{
    "id": "0023cf78-0232-40af-950a-c142925bdae4",
    "created_at": "2023-01-12T15:01:16.866199Z",
    "updated_at": "2025-03-27T02:05:21.388558Z",
    "deleted_at": null,
    "sha1_hash": "f2d9c301a9d7eb1b5d9db13958c50ee0ba027d38",
    "title": "2020-03-31 - FBI re-sends alert about supply chain attacks for the third time in three months",
    "authors": "",
    "file_creation_date": "2022-05-27T22:40:50Z",
    "file_modification_date": "2022-05-27T22:40:50Z",
    "file_size": 900832,
    "plain_text": "# FBI re-sends alert about supply chain attacks for the third time in three months\n\n**[zdnet.com/article/fbi-re-sends-alert-about-supply-chain-attacks-for-the-third-time-in-three-months/](https://www.zdnet.com/article/fbi-re-sends-alert-about-supply-chain-attacks-for-the-third-time-in-three-months/)**\n\n[Home Innovation Security](https://www.zdnet.com/)\nThe FBI says some attacks have also targeted the healthcare industry, currently grappling with the coronavirus outbreak.\n\nWritten by Catalin Cimpanu, Contributor on March 30, 2020\n\n\n-----\n\nkwampirs 3.png\n\n\n## see also\n\n\n-----\n\n### s est gat g o e t a,000 cases o C ese t e t o US tec o ogy\n\nUS officials talk about all the methods the Chinese government and its agents have been using to target US companies and universities to\nsteal intellectual property.\n\nRead now\nThe FBI has issued an alert on Monday about state-sponsored hackers using the Kwampirs malware to attack supply chain companies and\nother industry sectors as part of a global hacking campaign.\n\nThis marks the third alert about this particular group sent this year, in as many months, after the FBI sent alerts on January 6 and February 5.\n\nThis time around, the FBI highlighted that some of the group's targets are organizations in the healthcare industry, currently grappling with the\ncoronavirus (COVID-19) outbreak.\n\n[Besides sending out a PIN (Private Industry Notification), the FBI has also published two Flash alerts, one containing YARA rules to identify](http://www.documentcloud.org/documents/6821580-Kwampirs-PIN-20200330-001.html)\n[the group's Kwampirs malware on infected networks, and the second containing a technical report, complete with IOCs (indicators of](http://www.documentcloud.org/documents/6821581-FLASH-CP-000111-MW-Downgraded-Version.html)\ncompromise).\n\nBoth Flash alerts are re-releases of the February and January reports, with additional information.\n\n### FBI warns of Kwampirs attacks on healthcare\n\nThe FBI named the group behind these attacks as Kwampirs, after the malware they used in their intrusions. They described the group as an\nAdvanced Persistent Threat (APT), a term normally used to describe government-backed hacking groups.\n\nFBI investigators said the group has been active since 2016 when the first attacks with the Kwampirs remote access trojan (RAT) have been\nobserved in the wild.\n\n\"Through victimology and forensic analysis, the FBI found heavily targeted industries include healthcare, software supply chain, energy, and\nengineering across the United States, Europe, Asia, and the Middle East,\" the FBI said. \"Secondary targeted industries include financial\ninstitutions and prominent law firms.\"\n\nBut above all, the FBI wanted to point out in its report that the group has heavily targeted the healthcare sector in the past.\n\nAccording to the FBI, \"Kwampirs operations against global healthcare entities have been effective.\"\n\nThe FBI said the group gained \"broad and sustained access\" to targeted healthcare entities. According to the bureau, hacked targets range\nfrom major transnational healthcare companies to local hospital organizations.\n\n### Kwampirs gained access to hospitals through the supply chain\n\n\"The FBI assesses Kwampirs actors gained access to a large number of global hospitals through vendor software supply chain and hardware\nproducts,\" the agency said.\n\n\"Infected software supply chain vendors included products used to manage industrial control system (ICS) assets in hospitals,\" the FBI said.\n\nIn some attacks, the hackers accessed a few machines, in others, they compromised entire enterprise networks.\n\nThe FBI credited this to the Kwampirs malware's ability to propagate laterally across networks via the Server Message Block (SMB) protocol or\nvia hidden admin shares.\n\nThe FBI points organizations to its two Flash technical alerts for details on detecting the group's malware.\n\nWhile FBI officials did not attempt to attribute the group to a specific country, they did point out that the Kwampirs malware contained code\n[similarities with Disttrack, a piece of malware commonly known as Shamoon, and known to have been developed and deployed by hackers](https://www.zdnet.com/article/shamoons-data-wiping-malware-believed-to-be-the-work-of-iranian-hackers/)\nassociated with the Iranian regime.\n\nHowever, it is unclear if the FBI sent out yesterday's alerts because the Kwampirs group has begun increasingly targeting healthcare\norganizations in recent weeks, or because the group is known to have historically targeted healthcare organizations and the bureau is\nattempting to put the healthcare sector on alert against future cyber-attacks.\n\n### Attacks on the healthcare industry to be expected right now\n\nAt the moment, due to the ongoing COVID-19 pandemic and the frantic search for a vaccine, healthcare and medical research organizations\nare now one of the most sought-after targets of cyber-attacks and cyber-espionage operations.\n\n[Last week, Reuters reported that a state-sponsored hacking group attempted to breach the World Health Organization earlier this month.](https://www.reuters.com/article/us-health-coronavirus-who-hack-exclusive/exclusive-elite-hackers-target-who-as-coronavirus-cyberattacks-spike-idUSKBN21A3BN)\n\nIn the [Risky Business Live webcast yesterday, show producer and presenter Patrick Gray said attacks on healthcare and medical research](https://www.youtube.com/watch?v=Yctre-8kSS0)\norganizations are to be expected due to the current circumstances.\n\n\n-----\n\nO t e sa e ebcast, C o dst e co ou de t [pe o tc](https://twitter.com/DAlperovitch/) desc bed te ge ce se ces o d d ot e gage te ge ce gat e g\nabout the current COVID-19 pandemic as \"derelict of duty.\"\n\n\"Right now, you have a disaster on an unimaginable scale affecting nearly every country in the world, and [it] presents an existential threat to\nthe economy,\" Alperovitch said. \"The one thing that intelligence agencies are supposed to do is to help policymakers figure out how to get up\ncrises like these.\"\n\nWhile the FBI shied away from saying if the Kwampirs group was engaged in intelligence gathering on the coronavirus outbreak, it did\nrecommend that healthcare organizations take precautions to protect themselves.\n\n_[ReversingLabs published a technical breakdown of the Kwampirs malware last week.](https://blog.reversinglabs.com/blog/unpacking-kwampirs-rat)_\n\n**The FBI's most wanted cybercriminals**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-31 - FBI re-sends alert about supply chain attacks for the third time in three months.pdf"
    ],
    "report_names": [
        "2020-03-31 - FBI re-sends alert about supply chain attacks for the third time in three months.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535676,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653691250,
    "ts_modification_date": 1653691250,
    "files": {
        "pdf": "https://archive.orkl.eu/f2d9c301a9d7eb1b5d9db13958c50ee0ba027d38.pdf",
        "text": "https://archive.orkl.eu/f2d9c301a9d7eb1b5d9db13958c50ee0ba027d38.txt",
        "img": "https://archive.orkl.eu/f2d9c301a9d7eb1b5d9db13958c50ee0ba027d38.jpg"
    }
}