{
    "id": "01006a0e-eec8-4348-b492-f9cbc36bf0d6",
    "created_at": "2023-01-12T15:09:34.512423Z",
    "updated_at": "2025-03-27T02:12:56.24987Z",
    "deleted_at": null,
    "sha1_hash": "642747dfe7a0b77b99fdcfc9588ab1bd0055b6b8",
    "title": "2016-09-08 - The Philadelphia Ransomware offers a Mercy Button for Compassionate Criminals",
    "authors": "",
    "file_creation_date": "2022-03-01T17:52:22Z",
    "file_modification_date": "2022-03-01T17:52:22Z",
    "file_size": 1025978,
    "plain_text": "## A Realistic Analysis of the Stuxnet Cyber-attack\n\n By: Ahmad Mohee\n\nMA Arabic Studies – Political Sciences\n\n**Cairo on 1[st] March 2022**\n\n## Abstract\n\nThe Iranian-Israeli conflict has taken an accelerating dangerous turn. The pace and\nmomentum of the reciprocal cyber-attacks have accelerated from the two sides, since\nthe Stuxnet attack was first revealed in 2010. Analysts have come to use the term “cyber\nwar” without hesitation to describe the reciprocal cyber-attacks between Iran and\nIsrael.\n\nThis paper presented a realistic analysis of Stuxnet cyber-attack, aiming to uncover the\ncomplexities associated with the launch decision-making process. It managed to answer\nthe question: Why were Stuxnet cyber-attack adopted, as a strategic choice for\nmanaging the conflict instead of traditional choices? It also gave an understanding for\nthe security challenges and the strategic implications that cyber-attack had to pose.\n\nFinally, it reached a number of conclusions to the effect that: Realism, as a theory\nmostly concerned with issues of national security and power, can be a very suitable\ntheoretical framework for analyzing and understanding cyber-attacks. The analysis\nconfirmed that realism is an appropriate framework for identifying important issues\nrelated to security in the cyberspace and can provide useful insights into some of the\nenduring characteristics of international relations in the cyberspace.\n\n**Keywords: Cyberwar, Cyber-attack, Stuxnet, Realism, International Relations, Iran, Israel**\n\n**_0 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\n## Introduction:\n\nIn May 2011, the Pentagon announced an official list of cyber weapon capabilities\napproved for use against adversaries. The list included a \"toolkit\" of methods to hack\nforeign networks, examine and test their functionality and operations, and the ability to\nleave \"viruses\" to facilitate future targeting[1].\n\nSeveral months before that, in July 2010, the Iranian-Israeli conflict seemed to have\ntaken a dangerous and accelerating turn, as the details of the cyber-attack on the\nIranian Natanz nuclear facility were revealed using a virus or a \"malicious computer\nworm\" called Stuxnet[2].\n\nThe attack revealed the possibility of causing massive physical destruction in industrial\nfacilities or vital infrastructure networks of any state without the need to mobilize\narmies or move fleets.\n\nThe pace and momentum of reciprocal cyber-attacks accelerated between the two sides\nsince the Stuxnet attack was first revealed in 2010. Analysts have come to use the term\n\"cyber war\" without hesitation to describe the reciprocal cyber-attacks between Iran\nand Israel.\n\nThis was accompanied by a large cloud of controversy, mutual accusations, and theories\nthat sought to probe the depths of the new term emerged in the skies of political circles:\n\"cyber war\".\n\nThis research paper aims to:\n\n  - Answer the question: Why were cyber-attacks adopted in the case of the\n\nStuxnet, as a strategic option for conflict management instead of the traditional\noptions?\n\n  - Apply the analysis of Realism to the case of Stuxnet, in order to understand the\n\nsecurity challenges and the strategic effects it poses.\n\n  - Reach conclusions within the framework of Realism analysis.\n\n1 Nakashima, E. (2011). List of cyber-weapons Developed by Pentagon to Streamline Computer Warfare.\nThe Washington Post. [online] 1 Jun. Available at: https://www.washingtonpost.com/national/list-ofcyber-weapons-developed-by-pentagon-to-streamline-computerwarfare/2011/05/31/AGSublFH_story.html [Accessed 28 Feb. 2022].\n2 Fruhlinger, J. (2017). What Is Stuxnet, Who Created It and How Does It work? [online] CSO Online.\nAvailable at: https://www.csoonline.com/article/3218104/what-is-stuxnet-who-created-it-and-how-doesit-work.html [Accessed 28 Feb. 2022].\n\n**_1 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\n## Stuxnet Capabilities\n\nOnce announced, specialists had been engaged in Stuxnet analysis for several months,\nto determine how it got into the control systems of the target industrial equipment,\nwhich were offline by nature, the type of systems, equipment, processes targeted, the\nentities that were attacked, and the functions the virus used to achieve the goals of the\nattack.\n\nThe requirements for analyzing this cyber-attack in terms of the tools and expertise\nused, the time required to reveal its capabilities and objectives, the estimation of the\nresulting damage levels, and the appropriate defense strategies and procedures, were\ncompletely different from the requirements for analyzing attacks in conventional wars.\n\nThe Stuxnet virus surreptitiously infiltrates and takes over industrial control systems\nwith the aim of sabotaging normal industrial operations. The malicious computer worm\nis inserted via a \"hole\" in the industrial control system through a removable device such\nas a USB memory stick[3]. The virus uses default Siemens passwords to access Windows\noperating systems running WinCC and PC7 programs[4].\n\nAccording to Ralph Langner, Stuxnet contained two different digital warheads, which\nwere deployed together to present a \"massive cyber strike against Iran's nuclear energy\nprogram.\" The first cyber warhead worked against Siemens S7-315 controllers,\ntemporarily preventing legitimate software from taking control. The \"Warhead\" code\nhandled up to 186 high-speed engines by rotating operating speeds between low and\nhigh values. The second cyber warhead, the Siemens 417 attack code, intercepted\nphysical I/O and \"provided forensic software running on the console with the normal\ninput patterns pre-recorded by Stuxnet\"[5].\n\nLanger likens the process to a form of gimmick usually depicted in Hollywood movies;\nSurveillance during the robbery is replaced by pre-recorded security camera footage to\nfool the authorities into believing that nothing is unfamiliar[6].\n\nIf a nuclear centrifuge was indeed the target, the centrifuges needed to spin at a specific\nspeed for long periods of time in order to extract the uranium. Stopping this process at\nhigh speeds could disrupt the sequestration of heavy isotopes in centrifuges. Tampering\n\n3 Farwell, J. P., & Rohozinski, R. (2011). Stuxnet and the future of cyber war. Survival, 53(1), 23-40.\n4 Eric Byres, P. (2011). Stuxnet Report: A System Attack. [online] ISSSource. Available at:\nhttps://isssource.com/stuxnet-report-a-system-attack/ [Accessed 28 Feb. 2022].\n5 Langner, R. (2010). The Big Picture. [online] Langner Blog. Available at:\nhttps://www.langner.com/2010/11/the-big-picture/ [Accessed 28 Feb. 2022].\n6 Langner, R. (2011). How to Hijack a Controller: Why Stuxnet Isn’t Just about Siemens’ PLCs. *online+\nControl Global. Available at: https://www.controlglobal.com/articles/2011/industrialcontrollers1101/\n\n[Accessed 28 Feb. 2022].\n\n**_2 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nwith the motors in a gas centrifuge may lead to cracking and destruction of these\ncomponents[7].\n\n## The target: Iran\n\nIran emerged as a potential target for the Stuxnet virus based on the geographical\nextent of the infection, which suggested that Iran was the epicenter of the attacks, and\nalso on technical analyzes that revealed that Stuxnet could, at least in theory, “disable\nor destroy” Iran’s centrifuges[8].\n\nResearchers have found out that the Stuxnet attack began in June 2009, and the time\nframe between compiling the source code and launching the infection was only about\n12 hours, indicating that “the attackers had immediate access to the computer they\nused to spread the virus — either by working with an insider or inadvertently using a\nknowledgeable person to introduce the infection”[9].\n\nThe products of Siemens, the manufacturer of the target systems, were widely used in\nIran's power and communications plants, and in Iran’s first nuclear power plant near\nBushehr. It is possible that Stuxnet spread via contractors or over LANs to its expected\ntarget, the Natanz reactor[10].\n\n## Who Did It: Israel\n\nIsrael has been featured as the actor behind the Stuxnet attack in numerous media\nreports[11] [12] [13] [14] [15].\n\n7 Langner, R. (2013). To Kill a Centrifuge: A Technical Analysis of What Stuxnet’s Creators Tried to Achieve.\nThe Langner Group.\n8 Broad, W.J. and Sanger, D.E. (2010). Worm Was Perfect for Sabotaging Centrifuges. The New York Times.\n\n[online] 19 Nov. Available at: https://www.nytimes.com/2010/11/19/world/middleeast/19stuxnet.html\n\n[Accessed 28 Feb. 2022].\n9 Zetter, K. (2011). Report: Stuxnet Hit 5 Gateway Targets on Its Way to Iranian Plant. [online] Wired.\nAvailable at: https://www.wired.com/2011/02/stuxnet-five-main-target/ [Accessed 28 Feb. 2022].\n10 Nakashima, T.E. and E. (2010). Iran Struggling to Contain “foreign-made” “Stuxnet” Computer Virus. The\nWashington Post. [online] 28 Sep. Available at: https://www.washingtonpost.com/wpdyn/content/article/2010/09/27/AR2010092706229.html [Accessed 28 Feb. 2022].\n11 Beaumont, P. (2010). Stuxnet Worm Heralds New Era of Global Cyberwar. [online] the Guardian.\nAvailable at: https://www.theguardian.com/technology/2010/sep/30/stuxnet-worm-new-era-globalcyberwar [Accessed 28 Feb. 2022].\n12 Sanger, D.E. (2012). Obama Order Sped up Wave of Cyberattacks against Iran. The New York Times.\n\n[online] 1 Jun. Available at: https://www.nytimes.com/2012/06/01/world/middleeast/obama-orderedwave-of-cyberattacks-against-iran.html [Accessed 28 Feb. 2022].\n13 Halliday, J. (2010). Stuxnet Worm Is the “work of a National Government agency.” The Guardian.\n\n[online] 24 Sep. Available at: https://www.theguardian.com/technology/2010/sep/24/stuxnet-wormnational-agency [Accessed 28 Feb. 2022].\n14 Hounshell, B. (2010). 6 Mysteries about Stuxnet. [online] Foreign Policy. Available at:\nhttps://foreignpolicy.com/2010/09/27/6-mysteries-about-stuxnet/ [Accessed 28 Feb. 2022].\n\n**_3 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nAlthough Israel hadn’t released any official comment over the Stuxnet cyber-attack, in\n2010, it created the 8200 or SIGINT intelligence unit to pursue both offensive and\ndefensive duties of cyberwar. This confirmed that cyberwar was now one of the pillars\nof Israel’s defense doctrine[16] [17].\n\nEarlier in 2009, Scott Borg, an expert in the US-CCU, suggested that Israel might prefer a\ncyber-attack on Iran's nuclear facilities rather than a military strike, a year before\nStuxnet was discovered[18]. In late 2010, Burg stated, \"Israel certainly had the ability to\ncreate Stuxnet…a tool like Stuxnet was the obvious weapon of Israel\"[19].\n\n## Who Did It: United States of America\n\nThere were also clear indications of US involvement and cooperation with Israel[20] . It\nwas reported that United States - within the framework of one of its most secret\nprograms, initiated by the Bush administration and accelerated by the Obama’s - sought\nto destroy Iran's nuclear program by new methods such as hacking Iranian computer\nsystems[21].\n\nUnited States was advised by an influential German think tank to target Iran's nuclear\ncapabilities through \"covert sabotage\". Volker Perthes, director of the German\ngovernment-funded Institute for Security and International Affairs, told US officials in\nBerlin that covert operations would be \"more effective than a military strike\" in curbing\nIran's nuclear ambitions[22].\n\n15 Markoff, J. (2010). Stuxnet Worm Is Remarkable for Its Lack of Subtlety. The New York Times. [online]\n27 Sep. Available at: https://www.nytimes.com/2010/09/27/technology/27virus.html [Accessed 28 Feb.\n2022].\n16 Williams, D. (2009). Spymaster Sees Israel as World Cyberwar Leader. Reuters. [online] 15 Dec.\nAvailable at: https://www.reuters.com/article/idUSTRE5BE30920091215 [Accessed 28 Feb. 2022].\n17 Williams, D. (2010). EXCLUSIVE - Cyber Takes Centre Stage in Israel’s War Strategy. Reuters. *online+ 28\nSep. Available at: https://www.reuters.com/article/idINIndia-51792020100928 [Accessed 28 Feb. 2022].\n18 Williams, D. (2009). ANALYSIS-Wary of Naked force, Israelis Eye Cyberwar on Iran. Reuters. [online] 7\nJul. Available at: https://www.reuters.com/article/idUSLV83872 [Accessed 28 Feb. 2022].\n19 The Economist (2010). A Worm in the Centrifuge. [online] The Economist. Available at:\nhttps://www.economist.com/international/2010/09/30/a-worm-in-the-centrifuge [Accessed 28 Feb.\n2022].\n20 Reals, T. (2010). Stuxnet Worm a U.S. Cyber-Attack on Iran Nukes? [online] cbsnews.com. Available at:\nhttps://www.cbsnews.com/news/stuxnet-worm-a-us-cyber-attack-on-iran-nukes/ [Accessed 28 Feb.\n2022].\n21 Kelley, M.B. (2012). Obama Administration Admits Cyberattacks against Iran Are Part of Joint US-Israeli\nOffensive. [online] Business Insider. Available at: https://www.businessinsider.com/obama-cyberattacksus-israeli-against-iran-2012-6 [Accessed 28 Feb. 2022].\n22 Halliday, J. (2011). WikiLeaks: US Advised to Sabotage Iran Nuclear Sites by German Thinktank. [online]\nThe Guardian. Available at: https://www.theguardian.com/world/2011/jan/18/wikileaks-us-embassycable-iran-nuclear [Accessed 28 Feb. 2022].\n\n**_4 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nIn a New York Times article published in January 2009, an unspecified program was\ncredited with preventing an Israeli military attack on Iran, as some efforts focused on\nways to destabilize the centrifuges[23].\n\n## Why Was A Cyber-attack Adopted As A Strategic Option To Manage The Conflict Instead Of Traditional Options?\n\nThe US and Israeli governments intended to use Stuxnet as a tool to impede, or at least\ndelay, the Iranian nuclear program. The Bush and Obama administrations believed that\nif Iran was on the verge of developing nuclear weapons, Israel would launch air strikes\nagainst Iran's nuclear facilities in a move that could have triggered a regional war.\n\nIn early 2008, the Israeli government submitted a \"secret\" request to the Bush\nadministration to provide it with bunker-busting bombs capable of destroying\nunderground facilities; and refueling equipment to allow it to fly to Iran and back to\nIsrael, with permission to fly over Iraqi airspace. However, the Bush administration\n\"ignored\" Israeli demands for bombs and refueling equipment and refused to use Iraqi\nairspace, over fears that doing so would cause a \"political uproar\" in Iraq that might lead\nto \"the expulsion of American forces\"[24].\n\nThe Bush administration decided to pursue a new covert effort as a result of the failure\nof sanctions to rein in Iran's uranium enrichment, and in light of the fact that options for\nmilitary strikes seemed \"unacceptable\". The Bush administration turned to the CIA to\nhelp slow progress at Natanz and other \"known and suspected nuclear facilities\"[25].\n\nA dramatic meeting took place in the White House Situation Room late in the Bush\npresidency, in which parts of a previously destroyed centrifuge were shown in an\nexperiment on the table. At that time, United States gave the green light to the\nOperation Olympic Games, which included the Stuxnet cyber-attack[26].\n\nOperation Olympic Games was an extensive covert program to delay Iran's ability to\nproduce nuclear weapons broadly targeting \"the entire industrial infrastructure that\nsupports Iran's nuclear program\" including efforts to \"destabilize\" centrifuges. The\nprogram also included \"renewed US efforts to penetrate Iran's nuclear supply chain\nabroad, along with new, some experimental efforts to undermine the electrical systems,\ncomputer systems, and other networks that Iran relies on\"[27].\n\n23 Sanger, D.E. (2009). U.S. Rejected Aid for Israeli Raid on Iranian Nuclear Site (Published 2009). The New\nYork Times. [online] 10 Jan. Available at: https://www.nytimes.com/2009/01/11/washington/11iran.html\n\n[Accessed 28 Feb. 2022].\n24 Sanger, D.E. (2009). op. cit.\n25 Sanger, D.E. (2009). op. cit.\n26 Fruhlinger, J. (2017).op. cit.\n27 Sanger, D.E. (2009). op. cit.\n\n**_5 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nPrior to leaving office in 2009, the Bush administration allocated $300 million to such\nsecret joint projects with Israel against Iran[28]. The covert program appears to have been\n\"accelerated\" under the Obama administration, although what that entails has been\nshrouded in secrecy[29].\n\n## Realistic Analysis of the Stuxnet Cyber-attack\n\nRealism has always been a dominant paradigm in the field of international relations. The\nfield of cyber security shows a correlation with realist-influenced perspectives with a\nfocus on security and competition, power distribution, the advantage of attack over\ndefense, and the benefits of deterrence strategies. Although there is no theory of cyber\npower in realist literature, realism provides a framework for understanding the\ndistribution of power among actors and how this relates to conflict[30].\n\nAccording to Reardon and Choucri: “Realist theories of deterrence, crisis management,\nand conflict may be used to understand whether cyberspace is stabilizing or\ndestabilizing, whether cyber technologies will be a new source of conflict or of peace,\nand whether states will engage in cyber arms racing.”[31].\n\n## Conflict Management Options and The Realism of USA\n\nThe repercussions that led to the development and launch of Stuxnet within the\n\"Operation Olympic Games\" refer to a realistic strategy on the American side for the\noptions of conflict with Iran. A cyber-attack was not Israel's first choice in dealing with\nthe threat of the Iranian nuclear program. Despite the strong alliance between United\nStates and Israel, and the mutual security dependence between them, especially with\nregard to their interests in the Middle East, United States, within the framework of\nrealistic decision-making guidance, saw that Israel’s option to launch a conventional\nmilitary strike on the Iranian nuclear program could be of a huge cost for both US and\nIsrael.\n\nAnd because the threat posed by the Iranian nuclear program was similar to both\nAmerican and Israeli national security, undermining Iran's nuclear capabilities was a\ncommon strategic goal for the two states. However, United States sought with realism\n\n28 MacAskill, E. (2011). Stuxnet Cyberworm Heads off US Strike on Iran. [online] The Guardian. Available\nat: https://www.theguardian.com/world/2011/jan/16/stuxnet-cyberworm-us-strike-iran [Accessed 28\nFeb. 2022].\n29 Sanger, D.E. (2010). Iran Fights Malware Attacking Computers. The New York Times. [online] 25 Sep.\nAvailable at: https://www.nytimes.com/2010/09/26/world/middleeast/26iran.html [Accessed 28 Feb.\n2022].\n30 Craig, A. (2013). Realism and Cyber Conflict: Security in the Digital Age. [online] E-International\nRelations. Available at: https://www.e-ir.info/2018/02/03/realism-and-cyber-conflict-security-in-thedigital-age/ [Accessed 1 Mar. 2022].\n31 Reardon, R., & Choucri, N. (2012, April). The role of cyberspace in international relations: A view of the\nliterature. In ISA Annual Convention, San Diego, CA (Vol. 1).\n\n**_6 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nand rationality to achieve its goals and self-interest to assert power and security in the\nregion by offering the most realistic, least costly strategic option for its national security\nand the security of its ally, Israel.\n\nThe foregoing analysis could also be a reason why cyber warfare can sometimes not be\nfully adopted as a strategic option in conflict. When the risks outweigh the benefits of\noffensive action, states consider taking a more appropriate action, such as preparing the\nfuture battlefield using conventional warfare options along with the limited use of cyber\nwarfare, given that the advantages of offensive actions in cyberspace have not yet\noutweighed the risks[32].\n\n## Cyberspace is an Anarchic System\n\nJames Adams views cyberspace as an anarchic system: “Cyberspace has become a new\ninternational battlefield.” With no governing body or central authority, the Internet\nperfectly fits a real-world security model. In this model, each state stands alone or with\nits allies, whom it cannot fully trust, and is desperately trying to build up its cyber power\nand defenses while fearing that every penetration made by another state poses a direct\nthreat to its security[33].\n\nIn this context, the Stuxnet cyber-attack was a security nightmare because it proves that\nany state is capable of attacking another state with impunity and without leaving any\ntrace of the origin of the attack. Also, the neorealist theory predicts that there will be a\ncomplete breakdown of trust and of international institutions. As each state will fear\nimminent and unknown attacks, and consequently will retreat and build its own\nstrength.\n\nThe lack of a hierarchical structure and overarching authority in cyberspace made many\nof the steps taken to hack and sabotage the centrifuges in Natanz possible. Cyberspace,\nas another arena in which states present their interests, and in which interests converge\nand collide, undoubtedly becomes an extension of the system intended by Waltz in his\nrealistic analysis.\n\n## Balance of Power Analysis\n\nDue to the relatively low cost of entering the field of cyber warfare, traditionally weaker\nstates can challenge stronger states and redistribute powers in the system[34]. One of the\nmost important direct results of the Stuxnet attack was the increasing sophistication of\n\n32 Collins, A. (Ed.). (2022). Contemporary security studies. Oxford university press.pp. 20-23.\n33 Adams, J. (2001). Virtual defense. Foreign Aff., 80, 98.pp 98-112.\n34 Langø, H. I. (2016). Competing academic approaches to cyber security. In Conflict in Cyber Space (pp.\n23-42). Routledge.\n\n**_7 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nIranian cyber warfare capabilities and tactics[35]. Iran now possesses defense, deterrence\nand even cyber-attack tools that enabled it to target US and Israeli facilities and\ninfrastructure networks. The reciprocal cyber-attacks between the two sides escalated\nafter the Stuxnet attack, until analysts started calling it “cyber war” without hesitation.\n\nLindsay argues that only states with great technological powers have the ability to\ndevelop the most advanced cyber weapons suggesting that the asymmetric nature of\nthe cyber domain may be overstated[36]. This may be reflected in the fact that Israel could\nnot have developed Stuxnet alone without the help, financing and facilities of United\nStates.\n\nStuxnet attack did not succeed in destroying all the centrifuges at the Natanz reactor.\nBut if the goals were to bring a disruption or a delay to the Iranians' progress in uranium\nenrichment, it appears that Stuxnet was successful in achieving those realistic goals[37].\n\n## Conclusions\n\nRealism, as a theory mostly concerned with issues of national security and power in\ninternational relations, is a very suitable theoretical framework for analyzing and\nunderstanding cyber-attacks. This analysis confirmed that realism is an appropriate\nframework for analyzing important issues related to security in cyberspace, and can\nprovide useful insights into some of the enduring characteristics of international\nrelations in cyberspace.\n\nA realistic analysis of the Stuxnet cyber-attack was able to give us the following\nexplanations:\n\n1- The fact that United States and Israel joined forces to launch a powerful cyber\nattack that could disrupt uranium enrichment at Iran's Natanz reactor. This\ncyber-attack was an attempt to maintain the relative power of two states over a\nthird.\n2- Cyberspace is a reflection of the anarchic international system in its structure,\n\nand therefore states are intertwined with interests forced to seek their own\nsecurity. This was expressed as a direct action on the initiative of the two allies,\nUnited States and Israel, in the search for security and the realization of their\ninterests using cyber force.\n\n35 Aitel, D. (2015). Iran Is Emerging as One of the Most Dangerous Cyber Threats to the US. [online]\nBusiness Insider. Available at: https://www.businessinsider.com/iran-is-emerging-as-one-of-the-mostdangerous-cyber-threats-to-the-us-2015-12?r=US&IR=T [Accessed 1 Mar. 2022].\n36 Lindsay, J. R. (2013). Stuxnet and the limits of cyber warfare. Security Studies, 22(3), 365-404.\n37 Avag, R. (2010). Did Stuxnet Take out 1,000 Centrifuges at the Natanz Enrichment Plant? | Institute for\nScience and International Security. [online] isis-online.org. Available at: https://isis-online.org/isisreports/detail/did-stuxnet-take-out-1000-centrifuges-at-the-natanz-enrichment-plant/ [Accessed 1 Mar.\n2022].\n\n**_8 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\n3- The adoption of cyber-attack as a strategic option to maintain relative strength\n\nshowed that cyber capabilities are an influential factor in the distribution of\npowers and capabilities in international relations. It can affect the relative power\nbetween states and ensure the survival of states in the international system.\n4- The lack of a hierarchical structure and comprehensive authority in cyberspace,\n\ntempting governmental and non-governmental entities to use cyber-attacks to\nachieve their goals and interests.\n5- Cyber-attacks are “unconventional weapons” that can ensure some balance to\n\nthe anarchic international system, as no state can always be safe from cyberattacks.\n6- It is very difficult to track cyber-attacks in most of the cases, as the attackers can\n\nleave no trace or leave false evidence to implicate others.\n\n## Bibliography:\n\n1. Nakashima, E. (2011). List of cyber-weapons Developed by Pentagon to Streamline\n\nComputer Warfare. The Washington Post. [online] 1 Jun. Available at:\nhttps://www.washingtonpost.com/national/list-of-cyber-weapons-developed-bypentagon-to-streamline-computer-warfare/2011/05/31/AGSublFH_story.html\n\n[Accessed 28 Feb. 2022].\n2. Fruhlinger, J. (2017). What Is Stuxnet, Who Created It and How Does It work? [online]\n\nCSO Online. Available at: https://www.csoonline.com/article/3218104/what-is-stuxnetwho-created-it-and-how-does-it-work.html [Accessed 28 Feb. 2022].\n3. Farwell, J. P., & Rohozinski, R. (2011). Stuxnet and the future of cyber war. Survival,\n\n53(1), 23-40.\n4. Eric Byres, P. (2011). Stuxnet Report: A System Attack. [online] ISSSource. Available at:\n\nhttps://isssource.com/stuxnet-report-a-system-attack/ [Accessed 28 Feb. 2022].\n5. Langner, R. (2010). The Big Picture. [online] Langner Blog. Available at:\n\nhttps://www.langner.com/2010/11/the-big-picture/ [Accessed 28 Feb. 2022].\n6. Langner, R. (2011). How to Hijack a Controller: Why Stuxnet Isn’t Just about Siemens’\n\nPLCs. [online] Control Global. Available at:\nhttps://www.controlglobal.com/articles/2011/industrialcontrollers1101/ [Accessed 28\nFeb. 2022].\n7. Langner, R. (2013). To Kill a Centrifuge: A Technical Analysis of What Stuxnet’s Creators\n\nTried to Achieve. The Langner Group.\n8. Broad, W.J. and Sanger, D.E. (2010). Worm Was Perfect for Sabotaging Centrifuges. The\n\nNew York Times. [online] 19 Nov. Available at:\nhttps://www.nytimes.com/2010/11/19/world/middleeast/19stuxnet.html [Accessed 28\nFeb. 2022].\n9. Zetter, K. (2011). Report: Stuxnet Hit 5 Gateway Targets on Its Way to Iranian Plant.\n\n[online] Wired. Available at: https://www.wired.com/2011/02/stuxnet-five-main-target/\n\n[Accessed 28 Feb. 2022].\n10. Nakashima, T.E. and E. (2010). Iran Struggling to Contain “foreign-made” “Stuxnet”\n\nComputer Virus. The Washington Post. [online] 28 Sep. Available at:\n\n**_9 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\nhttps://www.washingtonpost.com/wpdyn/content/article/2010/09/27/AR2010092706229.html [Accessed 28 Feb. 2022].\n11. Beaumont, P. (2010). Stuxnet Worm Heralds New Era of Global Cyberwar. [online] the\n\nGuardian. Available at:\nhttps://www.theguardian.com/technology/2010/sep/30/stuxnet-worm-new-era-globalcyberwar [Accessed 28 Feb. 2022].\n12. Sanger, D.E. (2012). Obama Order Sped up Wave of Cyberattacks against Iran. The New\n\nYork Times. [online] 1 Jun. Available at:\nhttps://www.nytimes.com/2012/06/01/world/middleeast/obama-ordered-wave-ofcyberattacks-against-iran.html [Accessed 28 Feb. 2022].\n13. Halliday, J. (2010). Stuxnet Worm Is the “work of a National Government agency.” The\n\nGuardian. [online] 24 Sep. Available at:\nhttps://www.theguardian.com/technology/2010/sep/24/stuxnet-worm-national-agency\n\n[Accessed 28 Feb. 2022].\n14. Hounshell, B. (2010). 6 Mysteries about Stuxnet. [online] Foreign Policy. Available at:\n\nhttps://foreignpolicy.com/2010/09/27/6-mysteries-about-stuxnet/ [Accessed 28 Feb.\n2022].\n15. Markoff, J. (2010). Stuxnet Worm Is Remarkable for Its Lack of Subtlety. The New York\n\nTimes. [online] 27 Sep. Available at:\nhttps://www.nytimes.com/2010/09/27/technology/27virus.html [Accessed 28 Feb.\n2022].\n16. Williams, D. (2009). Spymaster Sees Israel as World Cyberwar Leader. Reuters. [online]\n\n15 Dec. Available at: https://www.reuters.com/article/idUSTRE5BE30920091215\n\n[Accessed 28 Feb. 2022].\n17. Williams, D. (2010). EXCLUSIVE - Cyber Takes Centre Stage in Israel’s War Strategy.\n\nReuters. [online] 28 Sep. Available at: https://www.reuters.com/article/idINIndia51792020100928 [Accessed 28 Feb. 2022].\n18. Williams, D. (2009). ANALYSIS-Wary of Naked force, Israelis Eye Cyberwar on Iran.\n\nReuters. [online] 7 Jul. Available at: https://www.reuters.com/article/idUSLV83872\n\n[Accessed 28 Feb. 2022].\n19. The Economist (2010). A Worm in the Centrifuge. [online] The Economist. Available at:\n\nhttps://www.economist.com/international/2010/09/30/a-worm-in-the-centrifuge\n\n[Accessed 28 Feb. 2022].\n20. Reals, T. (2010). Stuxnet Worm a U.S. Cyber-Attack on Iran Nukes? [online]\n\ncbsnews.com. Available at: https://www.cbsnews.com/news/stuxnet-worm-a-us-cyberattack-on-iran-nukes/ [Accessed 28 Feb. 2022].\n21. Kelley, M.B. (2012). Obama Administration Admits Cyberattacks against Iran Are Part of\n\nJoint US-Israeli Offensive. [online] Business Insider. Available at:\nhttps://www.businessinsider.com/obama-cyberattacks-us-israeli-against-iran-2012-6\n\n[Accessed 28 Feb. 2022].\n22. Halliday, J. (2011). WikiLeaks: US Advised to Sabotage Iran Nuclear Sites by German\n\nThinktank. [online] The Guardian. Available at:\nhttps://www.theguardian.com/world/2011/jan/18/wikileaks-us-embassy-cable-irannuclear [Accessed 28 Feb. 2022].\n\n**_10 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----\n\n23. Sanger, D.E. (2009). U.S. Rejected Aid for Israeli Raid on Iranian Nuclear Site (Published\n\n2009). The New York Times. [online] 10 Jan. Available at:\nhttps://www.nytimes.com/2009/01/11/washington/11iran.html [Accessed 28 Feb.\n2022].\n24. MacAskill, E. (2011). Stuxnet Cyberworm Heads off US Strike on Iran. [online] The\n\nGuardian. Available at: https://www.theguardian.com/world/2011/jan/16/stuxnetcyberworm-us-strike-iran [Accessed 28 Feb. 2022].\n25. Sanger, D.E. (2010). Iran Fights Malware Attacking Computers. The New York Times.\n\n[online] 25 Sep. Available at:\nhttps://www.nytimes.com/2010/09/26/world/middleeast/26iran.html [Accessed 28\nFeb. 2022].\n26. Craig, A. (2013). Realism and Cyber Conflict: Security in the Digital Age. [online] E\nInternational Relations. Available at: https://www.e-ir.info/2018/02/03/realism-andcyber-conflict-security-in-the-digital-age/ [Accessed 1 Mar. 2022].\n27. Reardon, R., & Choucri, N. (2012, April). The role of cyberspace in international\n\nrelations: A view of the literature. In ISA Annual Convention, San Diego, CA (Vol. 1).\n28. Collins, A. (Ed.). (2010). Contemporary security studies. Oxford university press.\n29. Adams, J. (2001). Virtual defense. Foreign Aff., 80, 98.\n30. Langø, H. I. (2016). Competing academic approaches to cyber security. In Conflict in\n\nCyber Space (pp. 23-42). Routledge.\n31. Aitel, D. (2015). Iran Is Emerging as One of the Most Dangerous Cyber Threats to the US.\n\n[online] Business Insider. Available at: https://www.businessinsider.com/iran-isemerging-as-one-of-the-most-dangerous-cyber-threats-to-the-us-2015-12?r=US&IR=T\n\n[Accessed 1 Mar. 2022].\n32. Lindsay, J. R. (2013). Stuxnet and the limits of cyber warfare. Security Studies, 22(3),\n\n365-404.\n33. Avag, R. (2010). Did Stuxnet Take out 1,000 Centrifuges at the Natanz Enrichment Plant?\n\n| Institute for Science and International Security. [online] isis-online.org. Available at:\nhttps://isis-online.org/isis-reports/detail/did-stuxnet-take-out-1000-centrifuges-at-thenatanz-enrichment-plant/ [Accessed 1 Mar. 2022].\n\n**_11 | of 11            A Realistic Analysis of the Stuxnet Cyber-attack_**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Stuxnet/A Realistic Analysis of the Stuxnet Cyber-attack.pdf"
    ],
    "report_names": [
        "A Realistic Analysis of the Stuxnet Cyber-attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d7c5a1bf-85c9-4d2f-bdbd-1455f5f2ae65",
            "created_at": "2022-10-25T16:07:23.978074Z",
            "updated_at": "2025-03-27T02:02:10.059972Z",
            "deleted_at": null,
            "main_name": "Operation Olympic Games",
            "aliases": [
                "GOSSIPGIRL"
            ],
            "source_name": "ETDA:Operation Olympic Games",
            "tools": [
                "Stuxnet",
                "W32.Stuxnet"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536174,
    "ts_updated_at": 1743041576,
    "ts_creation_date": 1646157142,
    "ts_modification_date": 1646157142,
    "files": {
        "pdf": "https://archive.orkl.eu/642747dfe7a0b77b99fdcfc9588ab1bd0055b6b8.pdf",
        "text": "https://archive.orkl.eu/642747dfe7a0b77b99fdcfc9588ab1bd0055b6b8.txt",
        "img": "https://archive.orkl.eu/642747dfe7a0b77b99fdcfc9588ab1bd0055b6b8.jpg"
    }
}