{
    "id": "01089646-7565-45ec-a2e6-67a17de4b4cf",
    "created_at": "2024-01-17T02:05:17.143371Z",
    "updated_at": "2025-03-27T02:11:47.725696Z",
    "deleted_at": null,
    "sha1_hash": "48ce1e53bd1cc8713e65dca21f28bc454ad13826",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T07:20:14Z",
    "file_modification_date": "2024-01-16T07:20:14Z",
    "file_size": 1894495,
    "plain_text": "# StripedFly: Perennially flying under the radar\n\n**[securelist.com/stripedfly-perennially-flying-under-the-radar/110903](https://securelist.com/stripedfly-perennially-flying-under-the-radar/110903/)**\n\nAuthors\n\n[Sergey Belov](https://securelist.com/author/sergeyb/)\n\n[Vilen Kamalov](https://securelist.com/author/vilenkamalov/)\n\n[Sergey Lozhkin](https://securelist.com/author/sergeyl/)\n\n## Introduction\n\nIt’s just another cryptocurrency miner… Nobody would even suspect the mining malware\nwas merely a mask, masquerading behind an intricate modular framework that supports\nboth Linux and Windows. It comes equipped with a built-in TOR network tunnel for\ncommunication with command servers, along with update and delivery functionality\nthrough trusted services such as GitLab, GitHub, and Bitbucket, all using custom\nencrypted archives. The amount of effort that went into creating the framework is truly\nremarkable, and its disclosure was quite astonishing.\n\n## How it started\n\nIn 2022, we came across two unexpected detections within the WININIT.EXE process of\nan older code which was earlier observed in Equation malware. Subsequent analysis\nrevealed earlier instances of suspicious code dating back to 2017. During that time, it had\n\n\n-----\n\neffectively evaded analysis and had previously been misclassified as a cryptocurrency\nminer. However, while it was in fact serving that purpose, that wasn’t its main objective.\n\nWe decided to conduct a comprehensive analysis of the collected samples with the sole\nobjective of resolving any uncertainties. What we discovered was completely unexpected;\nthe cryptocurrency miner was just one component of a much larger entity. This malware\n[employed a custom EternalBlue SMBv1 exploit to infiltrate its victims’ systems.](https://en.wikipedia.org/wiki/EternalBlue)\nImportantly, our investigation, which considered binary timestamps, indicated that this\nexploit was created prior to April 2017. It is worth noting that the EternalBlue exploit was\n[publicly disclosed by the Shadow Brokers group on April 14, 2017.](https://en.wikipedia.org/wiki/The_Shadow_Brokers)\n\nWhat set this particular worm apart from other malware that used EternalBlue was its\ndistinctive propagation pattern. It spread quietly, allowing it to avoid detection by most\nsecurity solutions. With the completion of our extensive private investigation report, this\narticle now provides a concise overview of our findings.\n\n## The infection\n\nThe first detected shellcode was located within the WININIT.EXE process, which has the\nability to download binary files from bitbucket[.]org and execute PowerShell scripts. At\nthe time of the initial detections, the infection vector was unknown. However, as our\ninvestigation progressed, we discovered an SMBv1 exploit that was remarkably similar to\nEternalBlue.\n\nThe kernel shellcode, delivered via an exploit, injects an additional shellcode into the user\nspace. The payload is then deployed, which includes a framework with plugin-like\nexpandable functionality along with an extremely lightweight TOR network client. Once\nthis process is completed, the gates are permanently sealed, and the malware proceeds\nto disable the SMBv1 protocol on the infected system.\n\nThe worming functionality attempts to propagate within the local network, relying not only\non the exploit but also on the SSH protocol, using keys found on the victim’s machine.\n\n\n-----\n\nInfection flow on Windows host\n\n## Persistence\n\nFor its persistence malware employs various methods. Its behavior depends on the\navailability of the PowerShell interpreter and the privileges granted to the process.\nTypically, the malware would be running with administrative privileges when installed via\nthe exploit, and with user-level privileges when delivered via the Cygwin SSH server.\n\nIf the PowerShell is not present, the malware generates a hidden file with MZ-PE loader\nwith a randomized name located in %APPDATA% directory. This loader includes a copy\nof system.img and is subsequently registered with a GUID-like name within the Windows\nregistry key Software\\Microsoft\\Windows\\CurrentVersion\\Run.\n\nIf PowerShell is installed, it will behave differently based on whether administrative\naccess is available. If administrative rights are present, its ether executes a PowerShell\nscript that creates two task scheduler entries with GUID-like names and with different\ntriggers. The action of these tasks is run of PowerShell loader script.\n\nIf administrative rights are unavailable, the PowerShell script loader, is surrounded\nthousands of spaces in the beginning and in the end, is placed in the\n**HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Applets registry key, which is**\nthen registered in the HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run key\nwith the following command:\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n\nC:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -W Hidden \nCommand \"Invoke-Expression((Get-ItemProperty -Path\n\n'HKCU:\\Software\\Microsoft\\Windows\\CurrentVersion\\Applets').\n\n'%RegValNameFromPrevStep%')\".\n\n\nOn both cases when PowerShell is available, the body of malware archive itself is stored\ninside the registry key Software\\Microsoft\\Windows\\CurrentVersion\\Shell, Base64\nencoded and surrounded with hundreds of spaces, and is started by mentioned above\nPowerShell scripts.\n\nOn Linux hosts the malware process hides itself under name (sd-pam). And has a rich\nset of ways to establish persistence: it may be system or user systemd service,\nautostarted .desktop file, or additional line inside one of suitable /etc/rc*, profile, bashrc\nor inittab file. The malware executable file is placed in /tmp directory with a random\nname.\n\n## Bitbucket repository\n\nTo minimize the footprint of the initial exploit, all elements that can be offloaded are\nencapsulated in an encrypted and compressed custom binary archive. This archive is\ndiscreetly hosted on legitimate websites, cleverly disguised as firmware binaries for\nenigmatic devices labeled “m100”.\n\nThe Bitbucket repository was created on June 21, 2018, under the account of Julie\nHeilman, and it remains the sole repository associated with this profile.\n\n\n-----\n\nBitbucket repository content\n\nThe repository houses only a README.md file with the project’s name inside. Notably,\nthe Downloads folder, which would normally contain compiled project binaries, contains\nfive binary files: delta.dat, delta.img, ota.dat, ota.img, and system.img.\n\n\n-----\n\nDownloads folder of the repository\n\nThis folder lacks any versioning, and the download counter only reflects the number of\ndownloads since the last file update. In particular, the system.img file serves as the\nauthentic payload archive used for initial Windows system infections. The download\ncounter for this file accurately reflects the number of new infections since its last update.\nDuring our analysis, the file was last updated on February 24, 2022, and the number of\ninitial infections stood at 160,000 victims as of June 2022. However, as of September\n2023, the number had dropped to 60,000 since the last update in April 2023.\n\nThe files ota.img and delta.img are used to update the malware, where ota.img\ncorresponds to the Windows version and delta.img corresponds to the Linux version.\nInterestingly, system.img and ota.img are functionally identical, although ota.img\nincludes supplementary metadata for integrity verification, while delta.img serves as the\ninitial infection payload for Linux hosts compromised via SSH by the Windows version.\n\nThe ota.dat and delta.dat files, along with the version files, serve as tools for the\nmalware to check for the availability of new updates. However, it’s worth noting that the\ndownload counters for ota.img and delta.img do not accurately reflect the current\nnumber of infected victims. This is because the malware primarily receives updates from\nits C2 server, and only resorts to downloading update files from the repository when the\nC2 server is unresponsive.\n\nDuring our analysis, approximately one million updates were obtained from the repository.\nAt the time of writing, there were only eight updates for Windows systems and four for\nLinux systems, suggesting one of two scenarios: either there are minimal active\ninfections, or the C2 server remains active and responsive to all infected victims.\n\n## The TOR\n\nThe C2 server is nestled in the TOR network and has the .onion address\n**gpiekd65jgshwp2p53igifv43aug2adacdebmuuri34hduvijr5pfjad[.]onion:1111.**\n\nIn order to communicate with the C2, the malware employs a custom, lightweight\nimplementation of a TOR client. Interestingly, this implementation does not appear to be\nbased on any known open-source TOR implementations. Many standard TOR features\nsuch as routing, directory listing, relay and exit node modes, and support for control\nprotocols are conspicuously absent.\n\nAt regular intervals, the malware initiates TCP connections with the C2 server,\ntransmitting a greeting message containing the victim’s unique ID. It then proceeds to\nsend an empty beacon message every minute.\n\nThe level of dedication demonstrated by this functionality is remarkable. The goal of\nhiding the C2 server at all costs drove the development of a unique and time-consuming\nproject – the creation of its own TOR client. Such an approach is by no means common\n\n\n-----\n\namong APT and crimeware developers, and this notable example underscores the\nsophistication of this malware against the background of many others. Its functional\ncomplexity and elegance remind us of the elegant code implementing delay tolerant\nEquation communications networking and other libraries, reinforcing its classification as a\nhighly advanced threat.\n\n## The modules\n\nThe malware payload itself is structured as a monolithic binary executable code designed\nto support pluggable modules to extend or update its functionality. This architectural\napproach is a hallmark of APT malware. Each module is responsible for implementing\nand registering a callback function that is triggered when a connection to the C2 server is\nestablished or lost, or when a message is received from the C2 server. The functionality\nwithin these modules is divided into two types: service and extended functionality\nmodules.\n\n### Service modules\n\n**Configuration storage**\n\nThe module securely stores the AES-encrypted malware configuration by creating a\nregistry key resembling a GUID within the HKCU\\Software\\Classes\\TypeLib key for the\nWindows version. The Linux version hides this information in randomized hidden folders\nlocated in the user’s home directory.\n\n**Upgrade/Uninstall**\n\nWhen the initial connection to the C2 server is established, the service module generates\nan 8-byte victim ID, stores it, and then reuses it along with the hash of the utilized\n**system.img file for reporting back to the server. This module is designed to implement**\njust two specific commands:\n\nThe server sends a new version of system.img and the upgrade process is\nexecuted by either a generated script or a generated executable.\nPerform a full uninstall.\n\nIf the C2 server remains offline for more than 20 minutes and this condition persists, the\nmodule initiates an attempt to download the ota.dat file (or delta.dat for Linux) and\nsubsequently verifies its integrity. If the version of the file has changed, the module\ntriggers the upgrade procedure by downloading the appropriate .img file: ota.img for\nWindows and delta.img for Linux.\n\n\n-----\n\n### Functionality modules\n\n**Reverse proxy**\n\nThe module grants access to the victim’s network and allows the execution of remote\nactions on behalf of the victim.\n\n**Miscellaneous command handler**\n\nThe module encompasses a range of commands designed to interact with the victim’s file\nsystems, capture screenshots, retrieve system versions, and obtain the active X11\ndisplay on Linux (the default is WinSta0 on Windows). It also includes a command\ncapable of executing shellcode received from the C2 server.\n\n**Credential harvester**\n\nThe module operates a dedicated thread that runs periodic scans every two hours. During\nthese scans, it collects a range of sensitive information from all active users. This\ninformation includes website login usernames and passwords, as well as personal autofill\ndata such as name, address, phone number, company, and job title. It also captures\nknown Wi-Fi network names and the associated passwords, as well as SSH, FTP, and\nWebDav credentials from popular software clients such as FileZilla, Cyberduck, and\nWinSCP.\n\nIt’s worth noting that web browser support for credential harvesting extends beyond wellknown browsers such as Chrome, Firefox, and Internet Explorer, and includes such\nlesser-known browsers as Nichrome, Xpom, RockMelt, Vivaldi, SaMonkey, Epic Privacy,\nand Brave.\n\nIn the Linux version, it also gathers OpenSSH keys stored in $HOME/.ssh, compiles a list\nof known hosts from $HOME/.ssh/known_hosts, and includes functionality to retrieve\nsecrets from the Libsecret vault. However, this particular functionality is currently broken\nbecause there is no dlopen API implementation in the linked musl libc library.\n\n**Repeatable tasks**\n\nThe module boasts a few built-in functional tasks that can be executed either once or on\na repeatable scheduled basis, with the condition that specific windows must be visible for\nthese tasks to proceed.\n\nThe following are brief descriptions of the tasks:\n\nTake a screenshot and get a list of windows that are visible at that moment.\nExecute a process with a given command line, redirect its output, and filter it using\nregular expressions.\nRecord the microphone input.\n\n\n-----\n\nThe task involves gathering a list of files with specific extensions, such as those\nrelated to images, documents, sounds, videos, archives, databases, certificates,\nsource code files, and other critical user data files. This process scans all local\ndrives and network shares, with the exception of system folders. This is the only\ntask that works in the Linux version of the malware.\n\n**Recon module**\n\nThis module compiles extensive system information and transmits it to the C2 server\nupon connection. The data collected includes a wide range of details, including operating\nsystem version, computer name, list of hardware MAC addresses, current username for\nWindows systems, /etc/passwd file for Linux systems, IP address of the machine, IP\naddress of the currently connected TOR network exit node, system startup time, malware\nuptime, time and time zone, total and available memory amount, user administrative\nprivileges, and specific Windows-related information such as the UI language and\nkeyboard layouts, presence of antivirus software, NetBIOS name, DNS domain, owner’s\nWindows license details, and the presence of the PowerShell command interpreter.\n\n**SMBv1 and SSH infectors**\n\nThere are two modules dedicated to the penetration capabilities of the malware, which\nmake up the core worming functionality.\n\nThe SSH infector springs into action once the credential harvester module completes its\ntasks. It filters the results for SSH keys and credentials and, if any are found, activates a\ndedicated thread. This thread operates with random timeouts ranging from 10 minutes to\ntwo hours and initiates the penetration process. First, it retrieves delta.dat and delta.img\neither from the cache or directly from bitbucket[.]org. It then proceeds to verify the\nintegrity of these files and dynamically loads the libeay, zlib and libssh2 libraries from\n**delta.img. The next step is to attempt to connect to the remote SSH server. If the**\nconnection is successful, it invokes and parses the output of the /bin/sh -c ‘uname -nmo’\ncommand. If the remote system is supported, the malware uploads its binary to the\nremote /tmp folder under a random name and executes it with the command /bin/sh -c\n**‘cat > %s; chmod +x %s; nohup sh -c “%s; rm %s” &>/dev/null’. This approach**\nensures compatibility with x86, amd64, arm, aarch64 Linux CPU architectures, as well as\nCygwin x86 and amd64 remote hosts using a generated MZ-PE loader.\n\nThe SMBv1 infection module serves as the primary penetration tool for Windows victims,\nusing a custom EternalBlue exploit. Upon initial execution, it immediately disables the\nSMBv1 protocol by modifying the\n**HKLM\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters registry key**\non the victim’s system. It then launches two dedicated threads to perform periodic\nworming routines.\n\n\n-----\n\nThe first thread is responsible for inspecting the network adapter’s IP address and subnet\nmask. It then attempts to cause infections within the entire LAN subnet. In contrast, the\nsecond thread periodically attempts to select a random internet IP address, with the\nfollowing exclusions:\n\nBogon networks like 0.0.0.0/8, 10.0.0.0/8, 100.64.0.0/10, 127.0.0.0/8,\n172.16.0.0/12, 192.168.0.0/16, 198.18.0.0/15, 224.0.0.0/4, 240.0.0.0/4\n169.255.0.0/16 – mostly South Africa. This may be a bug; the authors probably\nmeant 169.254.0.0/16 – the missing part of the bogon networks list\n3.0.0.0/8, 15.0.0.0/8, 16.0.0.0/8, 56.0.0.0/8 – Amazon, HP, US Post and more\n6.0.0.0/8, 55.0.0.0/8 – United States Army Information Systems Command HQ\n(USAISC)\n7.0.0.0/8, 11.0.0.0/8, 21.0.0.0/8, 22.0.0.0/8, 26.0.0.0/8, 28.0.0.0/8, 29.0.0.0/8,\n30.0.0.0/8, 33.0.0.0/8, 214.0.0.0/8, 215.0.0.0/8 – US Department of Defense\nNetwork Information Center (DNIC).\n\nSupported Windows versions include Windows Vista, Windows 7, Windows Server 2008\nR2, Windows 8, Windows Server 2012, and Windows 10 up to build 14392.\n\n**Monero cryptocurrency mining module**\n\nThe icing on the cake is the Monero mining module. It operates in a separate process and\nskillfully disguises itself as a chrome.exe process located in the\n**Google\\Chrome\\Application\\Services directory, which can be found in either the**\ncommon or local AppData directory. This deceptive facade even includes alterations to\nthe version information and process icon of the masqueraded executable. Periodically,\nthe malware functionality within the main module monitors the puppet mining process and\nrestarts it if necessary. It also dutifully reports hash rate, work time, discovered nonces,\nand error statistics to the C2 server.\n\nDNS resolutions for pool servers are cleverly concealed behind DNS over HTTPS\n[requests to the Cloudflare DoH (DNS over HTTPS) service, adding an extra layer of](https://developers.cloudflare.com/1.1.1.1/encryption/dns-over-https/)\nstealth to its operations.\n\nWe strongly suspect that this module is the primary reason for the malware’s ability to\nevade detection for an extended period. Its existence is primarily driven by the need for\n[effective masquerading. It’s worth noting that the Monero coin, which this module mines,](https://www.coingecko.com/en/coins/monero)\npeaked at $542.33 on January 9, 2018, after hovering around $10 in 2017. As of 2023, it\nis trading at around $150. While this module is certainly profitable, it’s not necessarily the\nmost lucrative use of such malware. Hunting for unencrypted binary wallets or wallet\ncredentials, for example, could yield significantly higher profits.\n\nFurthermore, the presence of unencrypted strings related to mining within the malware\ncode provides additional evidence of its potential secondary purpose.\n\n\n-----\n\n## ThunderCrypt\n\nDuring our analysis, we stumbled upon an earlier version of the malware, which led us to\nthe discovery of a related ransomware variant called ThunderCrypt. It turned out that both\nmalware strains share the same underlying codebase and, more importantly, they\ncommunicate with the same C2 server located at ghtyqipha6mcwxiz[.]onion:1111.\n\nThe ThunderCrypt ransomware exhibited a strikingly similar array of functionality and\nmodules when compared to StripedFly. These included the TOR client, configuration\nstorage, upgrade/uninstall, and reconnaissance module, with one notable exception being\nthe absence of the SMBv1 infection module. Interestingly, the ransomware used the file\nlisting component of the repeatable task module as an integral part of its ransom\nencryption process.\n\nTelemetry data shows that ThunderCrypt first appeared on April 23, 2017, with the main\nspike in activity occurring in the following month of May. Intriguingly, it attracted the\nattention of Taiwan News because of a rather amusing incident. A Taiwanese netizen,\nunable to afford the 0.345 bitcoin ransom demanded for decryption, decided to contact\nthe attackers via the support email address provided. In his email, he candidly explained\nhis predicament, citing a modest monthly income of just $400. To the surprise of many,\nthe attackers responded by conceding that they had overestimated the income of the\nTaiwanese population, and the attack was deemed a complete failure.\n\n\n-----\n\n**_Taiwan News regarding ThunderCrypt_**\n\n## EternalBlue\n\nWe assess that there are parallels between the EternalBlue exploit and the authors\nbehind StripedFly. Our assumptions rely on the accuracy of the PE timestamps, and\nalthough it is not possible to validate the authenticity of the timestamps of the initial\nEternalBlue module in question, subsequent updates of the malware contained\ntimestamps that approximately match with telemetry data, so it is likely that the initial\ntimestamps are also accurate. The timeline we’ve reconstructed is as follows:\n\nApril 9, 2016: Earliest known version of StripedFly incorporating EternalBlue, as\nindicated by PE timestamps.\nAugust 2016: Initial leak by the Shadow Brokers group.\nMarch 14, 2017: Microsoft releases security bulletin MS17-010, introducing a patch\nfor the EternalBlue exploit.\nApril 14, 2017: Shadow Brokers release a leak containing the EternalBlue exploit.\nApril 15 2017: The first EternalBlue-infused ransomware ExPetr appears\n\n\n-----\n\nApril 20, 2017: Introduction of the earliest version of ThunderCrypt ransomware\n(without EternalBlue).\nApril 23, 2017: First detection of ThunderCrypt in our telemetry data.\nMay 12, 2017: WannaCry ransomware attack utilizing EternalBlue.\nJune 27, 2017: ExPetr attack using EternalBlue.\nAugust 24, 2017: First detection of StripedFly in our telemetry, one year after the\ndate provided by the initial PE timestamps.\n\nTaken together, these various data points suggest the similarities to Equation malware,\nalthough there is no direct evidence that they are related. Discovery of the malware was\nfacilitated by the signatures associated with the Equation malware family, and the coding\n[style and practices resemble those seen in SBZ malware.](https://apt.securelist.com/apt/sbz)\n\n## Conclusion\n\nThis article represents an effort to bring the story out of the confines of a private technical\nreport that was released last year. Created quite some time ago, StripedFly has\nundoubtedly fulfilled its intended purpose by successfully evading detection over the\nyears. Many high-profile and sophisticated malicious software have been investigated,\nbut this one stands out and it truly deserves attention and recognition.\n\nWhat was the real purpose? That remains a mystery. While ThunderCrypt ransomware\nsuggests a commercial motive for its authors, it raises the question of why they didn’t opt\nfor the potentially more lucrative path instead. The prevailing narrative often centers\naround ransomware actors collecting anonymous ransoms, but this case seems to defy\nthe norm.\n\nThe question remains, but only those who crafted this enigmatic malware hold the\nanswer. It’s difficult to accept the notion that such sophisticated and professionally\ndesigned malware would serve such a trivial purpose, given all the evidence to the\ncontrary.\n\n## Indicators of compromise\n\n**C2 servers**\ngpiekd65jgshwp2p53igifv43aug2adacdebmuuri34hduvijr5pfjad[.]onion\nghtyqipha6mcwxiz[.]onion\najiumbl2p2mjzx3l[.]onion\n\n**URLs**\nbitbucket[.]org/JulieHeilman/m100-firmware-mirror/downloads/\nbitbucket[.]org/upgrades/um/downloads/\nbitbucket[.]org/legit-updates/flash-player/downloads\ngitlab[.]com/JulieHeilman/m100-firmware-mirror/raw/master/\ngitlab[.]com/saev3aeg/ugee8zee/raw/master/\n\n\n-----\n\ngithub[.]com/amf9esiabnb/documents/releases/download/\ntcp://pool.minexmr[.]com:4444\ntcp://mine.aeon-pool[.]com:5555\ntcp://5.255.86[.]125:8080\ntcp://45.9.148[.]21:80\ntcp://45.9.148[.]36:80\ntcp://45.9.148[.]132:8080\n\n**system.img**\nb28c6d00855be3b60e220c32bfad2535\n18f5ccdd9efb9c41aa63efbe0c65d3db\n2cdc600185901cf045af027289c4429c\n54dd5c70f67df5dc8d750f19ececd797\nd32fa257cd6fb1b0c6df80f673865581\nc04868dabd6b9ce132a790fdc02acc14\nc7e3df6455738fb080d741dcbb620b89\nd684de2c5cfb38917c5d99c04c21769a\na5d3abe7feb56f49fa33dc49fea11f85\n35fadceca0bae2cdcfdaac0f188ba7e0\n\n**delta.dat**\n00c9fd9371791e9160a3adaade0b4aa2\n41b326df0d21d0a8fad6ed01fec1389f\n\n**delta.img**\n506599fe3aecdfb1acc846ea52adc09f\n6ace7d5115a1c63b674b736ae760423b\n\n**ota.dat**\n2e2ef6e074bd683b477a2a2e581386f0\n04df1280798594965d6fdfeb4c257f6c\n\n**ota.img**\nabe845285510079229d83bb117ab8ed6\n090059c1786075591dec7ddc6f9ee3eb\n\n**ThunderCrypt**\n120f62e78b97cd748170b2779d8c0c67\nd64361802515cf32bd34f98312dfd40d\n\n[Data theft](https://securelist.com/tag/data-theft/)\n[Encryption](https://securelist.com/tag/encryption/)\n[EternalBlue](https://securelist.com/tag/eternalblue/)\n[Linux](https://securelist.com/tag/linux/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Miner](https://securelist.com/tag/miner/)\n\n\n-----\n\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[TOR](https://securelist.com/tag/tor/)\nStripedFly: Perennially flying under the radar\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.10.26.StripedFly/StripedFly_%20Perennially%20flying%20under%20the%20radar%20_%20Securelist.pdf"
    ],
    "report_names": [
        "StripedFly_ Perennially flying under the radar _ Securelist"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1705457117,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1705389614,
    "ts_modification_date": 1705389614,
    "files": {
        "pdf": "https://archive.orkl.eu/48ce1e53bd1cc8713e65dca21f28bc454ad13826.pdf",
        "text": "https://archive.orkl.eu/48ce1e53bd1cc8713e65dca21f28bc454ad13826.txt",
        "img": "https://archive.orkl.eu/48ce1e53bd1cc8713e65dca21f28bc454ad13826.jpg"
    }
}