{
    "id": "01263a84-0c35-45da-9458-11ff2cdb782c",
    "created_at": "2023-01-12T15:09:49.153361Z",
    "updated_at": "2025-03-27T02:16:26.264827Z",
    "deleted_at": null,
    "sha1_hash": "02d15ef98ca10a8cc999e7bc53631d2fb8eec3f2",
    "title": "2017-07-17 - Android Backdoor GhostCtrl can Silently Record Your Audio, Video, and More",
    "authors": "",
    "file_creation_date": "2022-05-27T21:29:27Z",
    "file_modification_date": "2022-05-27T21:29:27Z",
    "file_size": 162799,
    "plain_text": "# Android Backdoor GhostCtrl Records Your Audio, Video\n\n**blog.trendmicro.com/trendlabs-security-intelligence/android-backdoor-ghostctrl-can-silently-record-your-audio-video-**\nand-more/\n\nJuly 17, 2017\n\n_Updated as of August 6, 2017, 7:45 PM PDT to clarify GhostCtrl's attack vectors._\n\nThe [information-stealing RETADUP worm that affected Israeli hospitals is actually just part of](https://blog.trendmicro.com/en_us/research/17/f/information-stealer-found-hitting-israeli-hospitals.html)\nan attack that turned out to be bigger than we first thought—at least in terms of impact. It\nwas accompanied by an even more dangerous threat: an Android malware that can take\nover the device.\n\nDetected by Trend Micro as ANDROIDOS_GHOSTCTRL.OPS /\nANDROIDOS_GHOSTCTRL.OPSA, we’ve named this Android backdoor GhostCtrl as it can\nstealthily control many of the infected device’s functionalities.\n\nGhostCtrl was hosted in RETADUP's C&C infrastructure, and the samples we analyzed\nmasqueraded as a legitimate or popular app that uses the names App, MMS, whatsapp, and\neven Pokemon GO. Socially engineered phishing emails were also attack vectors; they had\nmalicious URLs that led would-be victims to download these apps.\n\nThere are three versions of GhostCtrl. The first stole information and controlled some of the\ndevice’s functionalities without obfuscation, while the second added more device features to\nhijack. The third iteration combines the best of the earlier versions’ features—and then some.\nBased on the techniques each employed, we can only expect it to further evolve.\n\n\n-----\n\n**GhostCtrl is literally a ghost of itself**\n\nGhostCtrl is also actually a variant (or at least based on) of the commercially sold,\nmultiplatform OmniRAT that made [headlines in November 2015. It touts that it can remotely](http://www.zdnet.com/article/omnirat-on-the-loose-spywares-nibbling-android-with-a-taste-for-linux-mac-and-windows/)\ntake control of Windows, Linux, and Mac systems at the touch of an Android device’s button\n—and vice versa. A lifetime license for an OmniRAT package costs between US $25 and\n$75. Predictably OmniRAT cracking tutorials abound in various underground forums, and\nsome its members even provide patchers for it.\n\nThere’s actually a red flag that shows how the malicious APK is an OmniRAT spinoff. Given\nthat it’s a RAT as a service, this can be modified (or removed) during compilation.\n\n_Figure 1: Snapshot of GhostCtrl version 3’s resources.arsc file indicating it’s an OmniRAT_\n_variant (highlighted)_\n\n**GhostCtrl is hauntingly persistent**\n\nWhen the app is launched, it base64-decodes a string from the resource file and writes it\ndown, which is actually the malicious Android Application Package (APK).\n\nThe malicious APK, after dynamically clicked by a wrapper APK, will ask the user to install it.\nAvoiding it is very tricky: even if the user cancels the “ask for install page” prompt, the\nmessage will still pop up immediately. The malicious APK doesn’t have an icon. Once\ninstalled, a wrapper APK will launch a service that would let the main, malicious APK run in\nthe background:\n\n_Figure 2: How the wrapper APK leads to the main APK_\n\nThe main APK has backdoor functions usually named com.android.engine to mislead the\nuser into thinking it’s a legitimate system application. The malicious APK will then connect to\nthe C&C server to retrieve commands via the socket (an endpoint for communication\nbetween machines), new Socket(\"hef--klife[.]ddns.net\", 3176).\n\n**GhostCtrl can possess the infected device to do its bidding**\n\nThe commands from the C&C server are encrypted and locally decrypted by the APK upon\nreceipt. Interestingly, we also found that the backdoor connects to a domain rather than\ndirectly connecting to the C&C server’s IP address. This can be an attempt to obscure their\ntraffic. We also found several Dynamic Name Servers (DNS), which at some point led to the\nsame C&C IP address:\n\nhef--klife[.]ddns[.]net\nf--klife[.]ddns[.]net\n\n\n-----\n\nphp[.]no-ip[.]biz\nayalove[.]no-ip[.]biz\n\nA notable command contains action code and Object DATA, which enables attackers to\nspecify the target and content, making this a very flexible malware for cybercriminals. This is\nthe command that allows attackers to manipulate the device’s functionalities without the\nowner’s consent or knowledge.\n\nHere’s a list of some of the action codes and what each does to the device:\n\nACTION CODE =10, 11: Control the Wi-Fi state\nACTION CODE= 34: Monitor the phone sensors’ data in real time\nACTION CODE= 37: Set phone’s UiMode, like night mode/car mode\nACTION CODE= 41: Control the vibrate function, including the pattern and when it will\nvibrate\nACTION CODE= 46: Download pictures as wallpaper\nACTION CODE= 48: List the file information in the current directory and upload it to the\nC&C server\nACTION CODE= 49: Delete a file in the indicated directory\nACTION CODE= 50: Rename a file in the indicated directory\nACTION CODE= 51: Upload a desired file to the C&C server\nACTION CODE= 52: Create an indicated directory\nACTION CODE= 60: Use the text to speech feature (translate text to voice/audio)\nACTION CODE= 62: Send SMS/MMS to a number specified by the attacker; the\ncontent can also be customized\nACTION CODE= 68: Delete browser history\nACTION CODE= 70: Delete SMS\nACTION CODE= 74: Download file\nACTION CODE= 75: Call a phone number indicated by the attacker\nACTION CODE= 77: Open activity view-related apps; the Uniform Resource Identifier\n(URI) can also be specified by the attacker (open browser, map, dial view, etc.)\nACTION CODE= 78: Control the system infrared transmitter\nACTION CODE= 79: Run a shell command specified by the attacker and upload the\noutput result\n\nAnother unique C&C command is an integer-type command, which is responsible for stealing\nthe device’s data. Different kinds of sensitive—and to cybercriminals, valuable—information\nwill be collected and uploaded, including call logs, SMS records, contacts, phone numbers,\nSIM serial number, location, and browser bookmarks.\n\nThe data GhostCtrl steals is extensive, compared to other Android info-stealers. Besides the\naforementioned information types, GhostCtrl can also pilfer information like Android OS\nversion, username, Wi-Fi, battery, Bluetooth, and audio states, UiMode, sensor, data from\ncamera, browser, and searches, service processes, activity information, and wallpaper.\n\n\n-----\n\nIt can also intercept text messages from phone numbers specified by the attacker. Its most\ndaunting capability is how it can surreptitiously record voice or audio, then upload it to the\nC&C server at a certain time. All the stolen content will be encrypted before they’re uploaded\nto the C&C server.\n\n_Figure 3: Code snapshot showing how some information will be deleted after upload_\n\n_Figure 4: Most of the related function codes for stealing information are in the “transfer”_\n_package._\n\nThe other C&C commands are self-defined, such as “account”, “audioManager”, and\n“clipboard”. These commands will trigger malicious routines. It’s worth noting that these\naren’t commonly seen in Android RATs:\n\nClearing/resetting the password of an account specified by the attacker\nGetting the phone to play different sound effects\nSpecify the content in the Clipboard\nCustomize the notification and shortcut link, including the style and content\nControl the Bluetooth to search and connect to another device\nSet the accessibility to TRUE and terminate an ongoing phone call\n\n**How do GhostCtrl’s versions stack up to each other?**\n\nGhostCtrl’s first version has a framework that enables it to gain admin-level privilege. While it\nhad no function codes at the time, the second version did. The features to be hijacked also\nincrementally increased as the malware evolved into its second and third iterations.\n\n_Figure 5: Framework of GhostCtrl’s first version for gaining admin-level privilege_\n\n_Figure 6: Comparison of backdoor function of the first (left) and second (right) versions_\n\n_Figure 7: Code snapshot of GhostCtrl’s second version applying device admin privileges_\n\n[GhostCtrl’s second version can also be a mobile ransomware. It can lock the device’s screen](http://blog.trendmicro.com/trendlabs-security-intelligence/2016-mobile-threat-landscape/)\nand reset its password, and also root the infected device. It can also hijack the camera,\ncreate a scheduled task of taking pictures or recording video, then surreptitiously upload\nthem to the C&C server as mp4 files.\n\n\n-----\n\n_Figure 8: Code snapshot showing GhostCtrl s ransomware-like capability_\n\n_Figure 9: Code snapshot showing how GhostCtrl roots the infected device_\n\nThe third version of GhostCtrl incorporates obfuscation techniques to hide its malicious\nroutines, as shown below:\n\n_Figure 10: The attack chain of GhostCtrl’s third version_\n\nIn GhostCtrl’s third version, the wrapper APK first drops a packed APK. The latter unpacks\nthe main APK, a Dalvik executable (DEX), and an Executable and Linkable Format file\n(ELF). The DEX and ELF files decrypt strings and Application Programming Interface (API)\ncalls in the main malicious APK in runtime. This longwinded attack chain helps make\ndetection more challenging, exacerbated by the fact that the wrapper APK hides the packed\nAPK as well as DEX and ELF files in the assets directory.\n\n**Mitigation**\n\nGhostCtrl’s combination with an information-stealing worm, while potent, is also telling. The\nattackers tried to cover their bases, and made sure that they didn’t just infect endpoints. And\nwith the ubiquity of mobile devices among corporate and everyday end users, GhostCtrl’s\ncapabilities can indeed deliver the scares.\n\nBut more than its impact, GhostCtrl underscores the importance of defense in depth.\nMultilayered security mechanisms should be deployed so that the risks to data are better\nmanaged. Some of the best practices that information security professionals and IT/system\n[administrators can adopt to secure bring-your-own devices (BYOD) include:](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/-infosec-guide-bring-your-own-device-byod)\n\nKeep the device updated; Android patching is fragmented and organizations may have\ncustom requirements or configurations needed to keep the device updated, so\nenterprises need to balance productivity and security\nApply the principle of least privilege—restrict user permissions for BYOD devices to\nprevent unauthorized access and installation of dubious apps\nImplement an app reputation system that can detect and block malicious and\nsuspicious apps\nDeploy firewalls, intrusion detection, and prevention systems at both the endpoint and\nmobile device levels to preempt the malware’s malicious network activities\nEnforce and strengthen your mobile device management policies to further reduce\npotential security risks\nEmploy encryption, network segmentation and data segregation to limit further\nexposure or damage to data\nRegularly back up data in case of device loss, theft, or malicious encryption\n\n**Trend Micro Solutions**\n\n\n-----\n\nEnd users and enterprises can also benefit from multilayered mobile security solutions such\nas [Trend Micro™ Mobile Security for Android™ which is also available on Google Play.](https://blog.trendmicro.com/en_us/forHome/products/mobile-security.html)\n\n[Trend Micro™ Mobile Security for Enterprise provides device, compliance and application](https://blog.trendmicro.com/en_us/business/products/user-protection/sps.html)\nmanagement, data protection, and configuration provisioning, as well as protects devices\nfrom attacks that leverage vulnerabilities, preventing unauthorized access to apps, as well as\ndetecting and blocking malware and fraudulent websites.\n\nA list of all the hashes (SHA-256) detected as\nANDROIDOS_GHOSTCTRL.OPS/ANDROIDOS_GHOSTCTRL.OPSA is in this **[appendix.](https://documents.trendmicro.com/assets/Appendix-Android-Backdoor-GhostCtrl-can-Silently-Record-Your-Audio-Video-and-More.pdf)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-07-17 - Android Backdoor GhostCtrl can Silently Record Your Audio, Video, and More.pdf"
    ],
    "report_names": [
        "2017-07-17 - Android Backdoor GhostCtrl can Silently Record Your Audio, Video, and More.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536189,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653686967,
    "ts_modification_date": 1653686967,
    "files": {
        "pdf": "https://archive.orkl.eu/02d15ef98ca10a8cc999e7bc53631d2fb8eec3f2.pdf",
        "text": "https://archive.orkl.eu/02d15ef98ca10a8cc999e7bc53631d2fb8eec3f2.txt",
        "img": "https://archive.orkl.eu/02d15ef98ca10a8cc999e7bc53631d2fb8eec3f2.jpg"
    }
}