{
    "id": "01449a41-6741-4c95-a492-3e0a9ad1bd42",
    "created_at": "2023-01-12T15:05:46.189111Z",
    "updated_at": "2025-03-27T02:05:33.293758Z",
    "deleted_at": null,
    "sha1_hash": "7e63928a324e7955f984ce24a7d63ceb82241be8",
    "title": "2019-07-10 - LooCipher- Can Encrypted Files Be Recovered From Hell-",
    "authors": "",
    "file_creation_date": "2022-05-28T15:39:09Z",
    "file_modification_date": "2022-05-28T15:39:09Z",
    "file_size": 213730,
    "plain_text": "# LooCipher Ransomware: Can Encrypted Files Be Recovered?\n\n**[fortinet.com/blog/threat-research/loocipher-can-encrypted-files-be-recovered.html](https://www.fortinet.com/blog/threat-research/loocipher-can-encrypted-files-be-recovered.html)**\n\nJuly 10, 2019\n\nLooCipher is a file-encrypting ransomware distributed in the wild. While there have been\narticles discussing its main behavior, how this type of [ransomware is spread, and how it](https://www.fortinet.com/resources/cyberglossary/ransomware?utm_source=blog&utm_campaign=ransomware)\ncommunicates with its command and control server to send victim machine information, this\nblog will focus on LooCipher’s file [encryption mechanism and take a look at the possibility of](https://www.fortinet.com/resources/cyberglossary/encryption?utm_source=blog&utm_campaign=2021-q1-encryption)\ndecrypting affected files without paying the ransom.\n\nDespite the suggestive implication of its being hellish (the name sounds like Lucifer), this\n[malware is actually pretty straightforward. For example, it doesn’t use any obfuscation.](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\nHowever, due to its use of high-level libraries such as Crypto++ for its encryption functions,\nit’s a bit more difficult to reverse engineer compared to those ransomware variants that use\nlow-level Windows APIs.\n\n## How Does the LooCipher Ransomware Encrypt Files?\n\n[Although our FortiGuard Labs team found several encryption codes in the body of the](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguardlabs)\nmalware – such as DES (Data Encryption Standard), AES (Advanced Encryption Standard),\nand ECC/ECDSA (Elliptic Curve Cryptography or Elliptic Curve Digital Signature Algorithm) –\nin our test, only the AES-128 ECB mode (Electronic Codebook) was used to encrypt files.\nHowever, it is possible that since LooCipher was only recently discovered it might be still in\nthe initial stage of development, and that those other encryption codes are there for future\nuse.\n\n\n-----\n\nLooCipher starts its encryption routine by generating a 16-byte data block with random\ncharacters chosen from the following predefined characters, using the current system time\nas seed.\n\nFig. 1. Predefined characters used in generating random 16-byte data block\n\nThis data block is then shuffled to form the 16-byte key that this ransomware uses for\nencrypting files with the AES-ECB encryption algorithm. This key is used for all file\nencryption. This is unlike most types of ransomware, which generate a different key for each\nfile they encrypt.\n\nFig. 2. Generated 16-byte AES key\n\nThe following directories are excluded from its file encryption routine to prevent corrupting\ncritical files used by the Windows operating system to start and work properly.\n\nFig. 3. Directories exempted from file encryption\n\nIt then searches all attached drives to encrypt files with the following extension names.\n\nFig. 4. LooCipher encrypts files with specific extension names\n\nWhen a target file has been found, LooCipher creates a file with the original name of the file\nbeing encrypted, then adds a .lcphr extension to the name. It then encrypts the content of the\nfile with the AES-128 ECB algorithm using the generated 16-byte random key and writes it to\nthe newly created file with the .lcphr extension and leaving the original file as a 0-byte file.\n\nFig. 5. Encrypted files have the .lcphr extension name\n\nWe validated this finding by creating a simple AES-128 EBC mode decryption code in\nPython and then using the code to decrypt several files that had been encrypted with the\ngenerated key.\n\nFig. 6. Decrypting an encrypted file using AES-128 ECB mode\n\nFig. 7. Successfully decrypting the encrypted file\n\n## Can Ransomware Encrypted Files Be Recovered?\n\nThe version of LooCipher we analyzed only uses the AES-128 ECB mode to encrypt files.\nSince it is executed in ECB mode, it doesn’t need an IV (initial vector) and only uses a 16byte key, which is randomly generated from the following 74 characters:\n\nFig. 8. Predefined 74 characters from which a random key is generated\n\n\n-----\n\nAES is a symmetric-key algorithm, meaning the same key is used for both encrypting and\ndecrypting the data. So, in order for us to recover the files, we just needed the key used for\nthe encryption.\n\nThis is also unlike other types of ransomware that use both symmetric and asymmetric\nencryption, where the private key – which is held only by the attacker – is required to decrypt\nthe files.\n\nSince LooCipher only generates a single key for all file encryption, and it only chooses from\nthe 74 characters shown above to generate the key, one might think that it’s easier to recover\nthe key using crypto attacks compared to other types of ransomware. But it turns out that this\nis not the case.\n\n[To recover the key using brute force, we must first have the original file to compare to the](https://www.fortinet.com/resources/cyberglossary/brute-force-attack?utm_source=blog&utm_campaign=brute-force-attack)\ndecrypted file. Then, we must test all possible combinations that can be made from these 74\ncharacters. This requires performing 7416 = 808,551,180,810,136,214,718,004,658,176 (808\nOctillion) AES-128 ECB operations, which will take an impractically long period of time, even\non a supercomputer.\n\nThere is a [chosen plaintext attack on AES-128 ECB mode that can be used to decrypt the](https://zachgrace.com/posts/attacking-ecb/)\nciphertext without breaking the key. But this requires a cryptographic oracle that is always\nrunning, which in this case should be the LooCipher process. However, LooCipher only\nperforms a single run of its encryption routine, so this isn’t possible. Also, this method bruteforces each byte by iterating through all possible values and comparing the outcome to a\nreference value which, again, will take an enormous amount of time since LooCipher doesn’t\njust encrypt one file.\n\n## Key Recovery from C2 Communication Traffic\n\nA capture of network traffic during ransomware attacks can really be very helpful, especially\nfor ransomware like LooCipher that sends the encryption key to a C2 (command and control)\nserver where the threat actors keep a database of these keys.\n\nLooCipher sends a victim ID (u), the encoded AES key (k), and the IP address (i) of the\nmachine to the C2 server.\n\nFig. 9. Data sent to the C2 server\n\nSince AES is a symmetric-key algorithm, it turns out that we only need to decode the value\nof k. Fortunately, k is just encoded with some kind of position encoding. Each character in\nthe key is represented by a value depending on the character’s position in the array/string.\n\nFig. 10. Key representation using position encoding\n\nThe python code below shows how to decode the value of k.\n\n\n-----\n\nFig. 11. Script to decode LooCipher AES key\n\nIn the network capture above, the value of k is “69604607186414680318386143262470”\nwhich is a representation of the original AES key “X?+evRC1%v_hIc4G”.\n\nFig. 12. Output showing the decoded AES key\n\nUsing this information, we may be able to decrypt the encrypted files using the following\nscript.\n\n**Disclaimer: Please be aware that while all scripts here were written with the intention of**\nhelping users recover their encrypted files, you must use them at your own risk.\n\nFig. 13. Decrypting encrypted files\n\nHowever, it is unlikely that someone would capture the traffic all the time, so this method may\nnot always be useful.\n\n## Key Recovery from Memory of a Running LooCipher Process\n\nFor this option to work, the first instance of LooCipher should still be running. If any AV tool\nhas removed LooCipher, and its process has been terminated, the key won’t be recovered\nfrom memory as LooCipher uses the current time as the seed to generate the key. However,\nif LooCipher is still running, we can extract the key from its process memory.\n\nWe start with using Sysinternals ProcessExplorer to create a full dump of the LooCipher\nprocess memory. LooCipher uses a randomly generated-looking process name.\n\nFig. 14. Creating a full dump of LooCipher’s process memory\n\nAfter dumping the memory, we can use PowerShell to search for the generated URLs. Just\ntype the following command:\n\n_Select-String –Encoding Unicode –Path <memory dump file> -Pattern ‘(ttps?://.*/k.php.*o=[0-_\n_9])’ –AllMatches | %{$_.Matches} | %{$_.Value}_\n\nNote: If Unicode encoding didn’t work, use BigEndianUnicode.\n\nFig. 15. Searching for the generated URLs using PowerShell\n\nAs can be seen above, the command gives us several references to the encoded key.\n\n_Sysinternals Strings and findstr command can also give us these strings with references to_\nthe encoded key.\n\nFig. 16. Searching for the generated URLs using Strings and FINDSTR\n\n\n-----\n\nAfter getting the URL, we can now use the script provided in Fig. 13 to decode the key and\ndecrypt the affected files.\n\n## Looking at the Infection Timestamp to Generate Keys\n\nWhile we believe that it’s possible to generate keys based on the infection timestamp, we\nhaven’t completed any proof of concept yet. That said, we are looking into this and hope to\npublish the information as it relates to similar ransomware families that use the current time\nas the seed for generating random keys.\n\n## Conclusion\n\nLooCipher currently only uses AES-128 with ECB mode, but since it may still be in the initial\nstages of development, and because those other encryption algorithms are already present\nin its body, this may only be temporary and those other encryption algorithms are likely to\nhave been put there for future use.\n\nHowever, until that changes, we have shown that there is still a chance to recover LooCipher\nencrypted files. AES is a symmetric-key algorithm. With a network capture during the\ninfection, a skilled analyst can extract the key from the data that is being sent to the attacker.\nIf network traffic was not captured but LooCipher is still running, they can extract the key\nfrom the memory and then use that key to recover the files using AES-128 ECB.\n\nAs it seems like LooCipher is still in the initial development stage, we will keep an eye out for\nany further developments.\n\n-= FortiGuard Lion Team =\n## Solution\n\nFortinet customers are protected by the following:\n\nSamples are detected by W32/Filecoder.NWG!tr signature\nFortiSandbox rates the LooCipher’s behavior as high risk\n\n## IOCs\n\nSha256\n\n924cc338d5d03f8914fe54f184596415563c4172679a950245ac94c80c023c7d –\nW32/Filecoder.NWG!tr\n\nC2\n\n\n-----\n\nhxxps://hcwyo5rfapkytajg.onion.pet\nhxxps://hcwyo5rfapkytajg.darknet.t\nhxxps://hcwyo5rfapkytajg.onion.sh\nhxxps://hcwyo5rfapkytajg.onion.ws\nhxxps://hcwyo5rfapkytajg.tor2web.xyz\n\n_[Learn more about FortiGuard Labs and the FortiGuard Security Services portfolio.](https://www.fortinet.com/fortiguard/threat-intelligence/threat-research.html?utm_source=nreleaseblog&utm_campaign=2018-q2-fortiguardlabs-cta)_ _Sign_\n_up for our weekly FortiGuard Threat Brief._\n\n_[Read about the FortiGuard Security Rating Service, which provides security audits and best](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/security-rating.html?utm_source=blog&utm_campaign=2018-blog-security-rating-service)_\n_practices._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-07-10 - LooCipher- Can Encrypted Files Be Recovered From Hell-.pdf"
    ],
    "report_names": [
        "2019-07-10 - LooCipher- Can Encrypted Files Be Recovered From Hell-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535946,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653752349,
    "ts_modification_date": 1653752349,
    "files": {
        "pdf": "https://archive.orkl.eu/7e63928a324e7955f984ce24a7d63ceb82241be8.pdf",
        "text": "https://archive.orkl.eu/7e63928a324e7955f984ce24a7d63ceb82241be8.txt",
        "img": "https://archive.orkl.eu/7e63928a324e7955f984ce24a7d63ceb82241be8.jpg"
    }
}