{
    "id": "014eb34a-7f3a-4c67-b0db-2cab0a7d4f36",
    "created_at": "2023-01-12T15:03:02.392699Z",
    "updated_at": "2025-03-27T02:05:34.88072Z",
    "deleted_at": null,
    "sha1_hash": "52da16de9c2895dd9d4b281f3eacf62c86976918",
    "title": "2022-02-28 - Microsoft finds FoxBlade malware on Ukrainian systems, removes RT from Windows app store",
    "authors": "",
    "file_creation_date": "2022-05-28T02:07:15Z",
    "file_modification_date": "2022-05-28T02:07:15Z",
    "file_size": 231629,
    "plain_text": "# Microsoft finds FoxBlade malware on Ukrainian systems, removes RT from Windows app store\n\n**[zdnet.com/article/microsoft-finds-foxblade-malware-on-ukrainian-systems-removing-rt-from-windows-app-store/](https://www.zdnet.com/article/microsoft-finds-foxblade-malware-on-ukrainian-systems-removing-rt-from-windows-app-store/)**\n\n[Home Innovation Security](https://www.zdnet.com/)\nMicrosoft also said it will not display any Russian state-sponsored RT and Sputnik content\n\nWritten by Jonathan Greig, Staff Writer on Feb. 28, 2022\n\nMicrosoft says it found a new malware package -- which it calls \"FoxBlade\" -- hours before\nRussia began its invasion of Ukraine on February 24.\n\nIn [a blog post, Microsoft president Brad Smith said it was coordinating its efforts to protect](https://blogs.microsoft.com/on-the-issues/2022/02/28/ukraine-russia-digital-war-cyberattacks/)\nusers in Ukraine with the Ukrainian government, the European Union, European nations, the\nUS government NATO and the United Nations\n\n\n-----\n\n## Ukraine Crisis\n\n\"Several hours before the launch of missiles or movement of tanks on February 24,\nMicrosoft's Threat Intelligence Center (MSTIC) detected a new round of offensive and\ndestructive cyberattacks directed against Ukraine's digital infrastructure. We immediately\nadvised the Ukrainian government about the situation, including our identification of the use\nof a new malware package (which we denominated FoxBlade), and provided technical\nadvice on steps to prevent the malware's success,\" Smith said.\n\n\"In recent days, we have provided threat intelligence and defensive suggestions to Ukrainian\nofficials... This work is ongoing.\"\n\nSmith noted that the cyberattacks on Ukraine seen by Microsoft have been extremely\n[targeted and not as wide-ranging as the 2017 NotPetya attack.](https://www.zdnet.com/article/notpetya-an-act-of-war-cyber-insurance-firm-taken-to-task-for-refusing-to-pay-out/)\n\nBut Smith said Microsoft has seen recent cyberattacks on \"Ukrainian civilian digital targets,\nincluding the financial sector, agriculture sector, emergency response services, humanitarian\naid efforts, and energy sector organizations and enterprises.\"\n\nMicrosoft has also told Ukraine's government about efforts to steal data from government\nsources, including healthcare information, insurance data, transportation data, and other\npersonally identifiable information.\n\nIn addition to its efforts to help Ukraine with cybersecurity measures, Microsoft said it is also\ntaking steps \"to reduce the exposure of Russian state propaganda, as well to ensure our own\nplatforms do not inadvertently fund these operations.\"\n\n[\"In accordance with the EU's recent decision, the Microsoft Start platform (including](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Ftwitter.com%2Fvonderleyen%2Fstatus%2F1497973706831929348%3Fs%3D21&data=04%7C01%7Cbradsmi%40microsoft.com%7Cb1c1650f7c3f42f31e7b08d9fa4eabb5%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C637816038071392617%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C7000&sdata=D3p5Iv2XBZINGWEqdVBTx8ZiGP8ooCxJgFELQ0rgKIg%3D&reserved=0)\nMSN.com) will not display any state-sponsored RT and Sputnik content. We are removing\nRT news apps from our Windows app store and further de-ranking these sites' search results\non Bing so that it will only return RT and Sputnik links when a user clearly intends to navigate\nto those pages,\" Smith said.\n\n\"Finally, we are banning all advertisements from RT and Sputnik across our ad network and\nwill not place any ads from our ad network on these sites.'\n\n\"We are also focused as a company in protecting against state-sponsored disinformation\ncampaigns, which have long been commonplace in times of war. The past few days have\nseen kinetic warfare accompanied with a well-orchestrated battle ongoing in the information\necosystem where the ammunition is disinformation, undermining truth and sowing seeds of\ndiscord and distrust. This requires decisive efforts across the tech sector – both individually\nby companies and in partnership with others – as well as with governments, academia and\ncivil society.\"\n\n\n-----\n\nSmith added that Microsoft is working with the International Committee of the Red Cross\n(ICRC) and multiple UN agencies on refugee support efforts.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-28 - Microsoft finds FoxBlade malware on Ukrainian systems, removes RT from Windows app store.pdf"
    ],
    "report_names": [
        "2022-02-28 - Microsoft finds FoxBlade malware on Ukrainian systems, removes RT from Windows app store.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535782,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653703635,
    "ts_modification_date": 1653703635,
    "files": {
        "pdf": "https://archive.orkl.eu/52da16de9c2895dd9d4b281f3eacf62c86976918.pdf",
        "text": "https://archive.orkl.eu/52da16de9c2895dd9d4b281f3eacf62c86976918.txt",
        "img": "https://archive.orkl.eu/52da16de9c2895dd9d4b281f3eacf62c86976918.jpg"
    }
}