{
    "id": "01629b86-9360-42f5-a65a-f717938387c1",
    "created_at": "2023-01-12T14:59:15.241573Z",
    "updated_at": "2025-03-27T02:09:07.295453Z",
    "deleted_at": null,
    "sha1_hash": "cca9796c7d407b5b277678c23ed4e0eb4b5d4878",
    "title": "2021-08-26 - Spies for Hire- China’s New Breed of Hackers Blends Espionage and Entrepreneurship",
    "authors": "",
    "file_creation_date": "2022-05-28T16:14:31Z",
    "file_modification_date": "2022-05-28T16:14:31Z",
    "file_size": 166070,
    "plain_text": "# Spies for Hire: China’s New Breed of Hackers Blends Espionage and Entrepreneurship\n\n**nytimes.com/2021/08/26/technology/china-hackers.html**\n\nPaul Mozur, Chris Buckley August 26, 2021\n\nContinue reading the main story\nChina’s buzzy high-tech companies don’t usually recruit Cambodian speakers, so the job ads\nfor three well-paid positions with those language skills stood out. The ad, seeking writers of\nresearch reports, was placed by an internet security start-up in China’s tropical islandprovince of Hainan.\n\nThat start-up was more than it seemed, according to American law enforcement. Hainan\nXiandun Technology was part of a web of front companies controlled by China’s secretive\n[state security ministry, according to a federal indictment from May. They hacked computers](https://www.justice.gov/opa/pr/four-chinese-nationals-working-ministry-state-security-charged-global-computer-intrusion)\nfrom the United States to Cambodia to Saudi Arabia, seeking sensitive government data as\nwell as less-obvious spy stuff, like details of a New Jersey company’s fire-suppression\nsystem, according to prosecutors.\n\nThe accusations appear to reflect an increasingly aggressive campaign by Chinese\ngovernment hackers and a pronounced shift in their tactics: China’s premier spy agency is\nincreasingly reaching beyond its own ranks to recruit from a vast pool of private-sector talent.\n\nThis new group of hackers has made China’s state cyberspying machine stronger, more\nsophisticated and — for its growing array of government and private-sector targets — more\ndangerously unpredictable. Sponsored but not necessarily micromanaged by Beijing, this\n\n\n-----\n\nnew breed of hacker attacks government targets and private companies alike, mixing\ntraditional espionage with outright fraud and other crimes for profit.\n\n[China’s new approach borrows from the tactics of Russia and](https://www.nytimes.com/2020/12/14/us/politics/russia-hack-nsa-homeland-security-pentagon.html) [Iran, which have tormented](https://www.nytimes.com/2018/05/11/technology/iranian-hackers-united-states.html)\npublic and commercial targets for years. Chinese hackers with links to state security\ndemanded ransom in return for not releasing a company’s computer source code, according\nto an [indictment released by the U.S. Department of Justice last year. Another group of](https://www.justice.gov/opa/press-release/file/1295981/download)\nhackers in southwest China mixed cyber raids on Hong Kong democracy activists with fraud\non gaming websites, another indictment asserted. One member of the group boasted about\nhaving official protection, provided that they avoid targets in China.\n\n“The upside is they can cover more targets, spur competition. The downside is the level of\ncontrol,” said Robert Potter, the head of [Internet 2.0, an Australian cybersecurity firm. “I’ve](https://www.internet2-0.com/)\nseen them do some really boneheaded things, like try and steal $70,000 during an\nespionage op.”\n\nInvestigators believe these groups have been responsible for some big recent data\n[breaches, including hacks targeting the personal details of 500 million guests at the Marriott](https://www.nytimes.com/2018/12/11/us/politics/trump-china-trade.html)\n[hotel chain, information on roughly 20 million U.S. government employees and, this year,](https://www.reuters.com/article/us-usa-data-breach-idUSKBN0OZ20Z20150620) a\nMicrosoft email system used by many of the world’s largest companies and governments.\n\nThe Microsoft breach was unlike China’s previously disciplined strategy, said Dmitri\nAlperovitch, the chairman of Silverado Policy Accelerator, a nonprofit geopolitical think tank.\n\n“They went after organizations they had zero interest in and exploited those organizations\nwith ransomware and other attacks,” Mr. Alperovitch said.\n\nChina’s tactics changed after Xi Jinping, the country’s top leader, transferred more\ncyberhacking responsibility to the Ministry of State Security from the People’s Liberation\nArmy following a slew of sloppy attacks and a reorganization of the military. The ministry, a\nmix of spy agency and Communist Party inquisitor, has used more sophisticated hacking\ntools, like security flaws known as zero days, to target companies, activists and\ngovernments.\n\nImage\nPresident Xi Jinping was embarrassed by revelations of the People’s Liberation Army’s\nhacking activities and gave more responsibility to the Ministry of State Security.Credit...Ng\nHan Guan/Associated Press\nWhile the ministry projects an image of remorseless loyalty to the Communist Party in\nBeijing, its hacking operations can act like local franchises. Groups often act on their own\nagendas, sometimes including sidelines in commercial cybercrime, experts said.\n\nThe message: “We’re paying you to do work from 9 to 5 for the national security of China,”\nMr. Alperovitch said. “What you do with the rest of your time, and with the tools and access\nyou have is really your business ”\n\n\n-----\n\n[A grand jury indictment released last year charged that two former classmates from an](https://www.justice.gov/opa/pr/two-chinese-hackers-working-ministry-state-security-charged-global-computer-intrusion)\nelectrical engineering college in Chengdu, in southwest China, marauded through foreign\ncomputer servers and stole information from dissidents and engineering diagrams from an\nAustralian defense contractor. On the side, the indictment said, the two tried extortion:\ndemanding payment in return for not revealing an unidentified company’s source code on the\ninternet.\n\nUnder this system, Chinese hackers have become increasingly aggressive. The rate of\nglobal attacks linked to the Chinese government has nearly tripled since last year compared\nwith the four previous years, according to Recorded Future, a Somerville, Mass., company\nthat studies the use of internet by state-linked actors. That number now averages more than\n1,000 per three-month period, it said.\n\n“Considering the volume that’s going on, how many times has the F.B.I. gotten them?\nPrecious few,” said Nicholas Eftimiades, a retired senior American intelligence officer who\nwrites about China’s espionage operations. “There’s no way you can staff up to be able to\ncontend with this type of onslaught.”\n\nThough their numbers make them hard to stop, the hackers don’t always try hard to cover\ntheir tracks. They sometimes leave clues strewn online, including wedding photos of agents\nin state security uniforms, telltale job ads and boasts of their feats.\n\nHainan Xiandun was set up to recruit young talent and create a veneer of deniability,\nprosectors said. It posted job ads on the message boards of Chinese universities and\nsponsored a cybersecurity competition.\n\nThe operations from Hainan — an island jutting into the South China Sea — sometimes\nreflected local priorities, like stealing marine research from a university in California and\nhacking governments in nearby Southeast Asian countries, according to the May indictment.\nIts job ad for Cambodian speakers was placed three months before Cambodian elections.\n\nWhile some targets had clear espionage goals, others appeared less focused. The hackers\ntried to steal Ebola vaccine data from one institution, prosecutors said, and secrets about\nself-driving cars from another.\n\nImage\nThe Department of Justice unsealed an indictment in July detailing the exploits of a Chinese\nhacking group.Credit...Stefani Reynolds for The New York Times\nIn January 2020, a mysterious blog with a track record of exposing Chinese state security\n[hackers picked up the scent. The blog, “Intrusion Truth,” was already known in Washington](https://intrusiontruth.wordpress.com/)\ncybersecurity circles for naming Chinese intelligence officers well before they appeared in\nU.S. indictments.\n\n\n-----\n\nThe operators of Intrusion Truth scoured job boards for Hainan companies advertising for\n“penetration testing engineers,” who secure networks by exploring how they could be\nhacked.\n\nOne posting from Hainan Xiandun stood out. The ad, on a Sichuan University computer\nscience hiring board from 2018, boasted that Xiandun had “received a considerable number\nof government-secret-related business.”\n\nThe company, based in Hainan’s capital, Haikou, paid monthly salaries of $1,200 to $3,000\n— solid middle-class wages for Chinese tech workers fresh out of college — with bonuses as\nhigh as $15,000. Xiandun’s ads listed an email address used by other firms looking for\ncybersecurity experts and linguists, suggesting they were part of a network.\n\nChinese hacking groups are increasingly “sharing malware, exploits and coordinating their\nefforts,” the operators of “Intrusion Truth” wrote in an email. The operators have not\ndisclosed their identities, citing the sensitivity of their work.\n\nXiandun’s registered address was the library of Hainan University. Its phone number\nmatched that of a computer science professor and People’s Liberation Army veteran who ran\na website offering payments for students with novel ideas about cracking passwords. The\nprofessor has not been charged.\n\nOther records and phone numbers led the blog authors to an email address and a frequentflier account owned by Ding Xiaoyang, one of the managers of the company.\n\nThe indictment asserted that Mr. Ding was a state security officer who ran the hackers\nworking at Hainan Xiandun. It included details the blog did not find, like an award Mr. Ding\nreceived from the Ministry of State Security for young leaders in the organization.\n\nMr. Ding and others named in the indictment couldn’t be reached.\n\nThough trackable for now, China’s state security apparatus may be learning how to better\nhide its footprints, said Matthew Brazil, a former China specialist for the Department of\n[Commerce’s Office of Export Enforcement who has co-written a study of Chinese espionage.](https://www.usni.org/press/books/chinese-communist-espionage)\n\n“The abilities of the Chinese services are uneven,” he said. “Their game is getting better, and\nin five or 10 years it’s going to be a different story.”\n\nNicole Perlroth contributed reporting.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-26 - Spies for Hire- China’s New Breed of Hackers Blends Espionage and Entrepreneurship.pdf"
    ],
    "report_names": [
        "2021-08-26 - Spies for Hire- China’s New Breed of Hackers Blends Espionage and Entrepreneurship.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535555,
    "ts_updated_at": 1743041347,
    "ts_creation_date": 1653754471,
    "ts_modification_date": 1653754471,
    "files": {
        "pdf": "https://archive.orkl.eu/cca9796c7d407b5b277678c23ed4e0eb4b5d4878.pdf",
        "text": "https://archive.orkl.eu/cca9796c7d407b5b277678c23ed4e0eb4b5d4878.txt",
        "img": "https://archive.orkl.eu/cca9796c7d407b5b277678c23ed4e0eb4b5d4878.jpg"
    }
}