{
    "id": "018173e0-02e3-461a-a84d-6c65a9b2f7f5",
    "created_at": "2023-01-12T14:59:10.715385Z",
    "updated_at": "2025-03-27T02:10:07.490959Z",
    "deleted_at": null,
    "sha1_hash": "62a7f17391a4fabcc91893f1d46fda7f6cb97228",
    "title": "2020-02-03 - PassLock Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T03:27:02Z",
    "file_modification_date": "2022-05-28T03:27:02Z",
    "file_size": 877531,
    "plain_text": "# Шифровальщики-вымогатели The Digest \"Crypto- Ransomware\"\n\n**id-ransomware.blogspot.com**\n\n### Kekpop\n\n## Kekpop Ransomware\n\n Aliases: Kekware\n\n Variants: YourCyanide\n\n### (шифровальщик-вымогатель) (первоисточник)\n Translation into English\n\nЭтот крипто-вымогатель шифрует данные пользователей с помощью комбинации алгоритмов\nAES+RSA, а затем требует выкуп $500 в BTC, чтобы вернуть файлы. Оригинальное\nназвание: Kekpop. На файле написано: kekpop.cmd.\n\n--\n**Обнаружения:**\n\n**DrWeb ->**\n**ALYac -> Trojan.BAT.Agent**\n\n**BitDefender -> Trojan.GenericKD.50265580**\n\n**ESET-NOD32 -> A Variant Of Generik.LKONBMI**\n\n**Kaspersky -> HEUR:Trojan.BAT.Generic**\n\n**Malwarebytes ->**\n\n**Microsoft ->**\n\n**Rising ->**\n\n**Tencent -> Bat.Trojan.Generic.Ebzs**\n\n**TrendMicro ->**\n\n--\n\n-----\n\n**© Генеалогия: ??? >> Kekpop**\n\nСайт \"ID Ransomware\" это пока не идентифицирует.\n**Информация для идентификации**\n\nАктивность этого крипто-вымогателя была в начале мая 2022 г. Ориентирован на\nанглоязычных пользователей, может распространяться по всему миру.\n\nК зашифрованным файлам добавляется расширение: .kekpop\n\nЗаписка с требованием выкупа называется: ReadMe.html\n\n**Содержание записки о выкупе:**\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nYour files are encrypted by kekpop.\nYou can get them back by paying $500 to this btc address Ox9NHVG8NVFGHG4HHHKBV.\nIf you dont pay this fee your files will be lost forever.\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n**Перевод записки на русский язык:**\nВаши файлы зашифрованы kekpop.\nВы можете получить их обратно, заплатив $500 на этот биткойн-адрес\nOx9NHVG8NVFGHG4HHHKBV.\nЕсли вы не заплатите эту плату, ваши файлы будут утеряны навсегда.\n\n**Внимание! Новые расширения, email и тексты о выкупе можно найти в конце статьи, в**\nобновлениях. Могут быть различия с первым вариантом.\n\n\n-----\n\n**Технические детали + IOC**\n\nМожет распространяться путём взлома через незащищенную конфигурацию RDP, с помощью\nemail-спама и вредоносных вложений, обманных загрузок, ботнетов, эксплойтов,\nвредоносной рекламы, веб-инжектов, фальшивых обновлений, перепакованных и\nзаражённых инсталляторов. См. также \"Основные способы распространения\n[криптовымогателей\" на вводной странице блога.](https://id-ransomware.blogspot.ru/2016/05/blog-post.html)\n\nНужно всегда использовать [Актуальную антивирусную защиту!!!](https://anti-ransomware.blogspot.com/2019/02/topical-protection.html)\nЕсли вы пренебрегаете комплексной антивирусной защитой класса Internet Security или Total\nSecurity, то хотя бы делайте резервное копирование важных файлов по [методу 3-2-1.](https://id-ransomware.blogspot.ru/2016/11/sposoby-zashhity-ot-shifrovalshhikov-vymogatelej.html)\n\n➤ Использует технологии Microsoft: CMD и PowerShell для атаки.\n\n**Список типов файлов, подвергающихся шифрованию:**\nЭто могут быть документы MS Office, OpenOffice, PDF, текстовые файлы, базы данных,\nфотографии, музыка, видео, файлы образов, архивы и пр.\n\n**Файлы, связанные с этим Ransomware:**\nReadMe.html - название файла с требованием выкупа;\nkekpop.cmd - название вредоносного файла;\nblack.bat - простой командный файл;\nGetToken.exe - вредоносный файл, загружаемый через Discord;\nps1-файлы.\n\nПроект вымогателя недоработан, множество окон с командами, это видно на скриншотах.\n\n\n-----\n\n**Расположения:**\n\\Desktop\\ ->\n\\User_folders\\ ->\n\\%TEMP%\\ ->\n\nhxxxs://cdn.discordapp.com/attachments/971160786015772724/971191444410875914/GetToken[.]exe\n\n**Записи реестра, связанные с этим Ransomware:**\nСм. ниже результаты анализов.\n\n**Мьютексы:**\nСм. ниже результаты анализов.\n\n**Сетевые подключения и связи:**\nEmail: BTC: Ox9NHVG8NVFGHG4HHHKBV (ненастоящий)\n\nСм. ниже в обновлениях другие адреса и контакты.\n\n**Результаты анализов:**\n\nMD5: f190183b6a6f55daa406c25cf5da66d8\nSHA-1: 89168542e0cec21bbafeafe39361994194576f61\nSHA-256: ea81248fddbf9080018845bf7862b9ceb8ab942526c1adcf20030f043c57ad99\n\nСтепень распространённости: низкая.\nИнформация дополняется. Присылайте образцы.\n\n=== ИСТОРИЯ СЕМЕЙСТВА === HISTORY OF FAMILY ===\n\n**=== БЛОК ОБНОВЛЕНИЙ === BLOCK OF UPDATES ===**\n\n**Вариант от 15 мая 2022:**\n[Сообщение >>](https://twitter.com/petrovic082/status/1525869534909026304)\n\n\n-----\n\n[Мое сообщение >>](https://twitter.com/Amigo_A_/status/1526088877332643841)\nРасширение: <random>.cyn\nЗаписки: YcynNote.txt, other.txt\nEmail: yourcyanide.help@gmail.com\nФайлы: YourCyanide.cmd, 1.cmd, ycynlog.cmd\n[Результаты анализов: VT +](https://www.virustotal.com/gui/file/b0f7c2021c00a1d495f408295d161befa3faceab02d9c4047cee4904db6c1272) **[AR](https://app.any.run/tasks/bfe590ff-cd43-43e9-89a3-ad4f09e677e1/)**\nОбнаружения:\nBitDefender -> Gen:Heur.Bat.1\nDrWeb -> BAT.Siggen.179\nKaspersky -> HEUR:Trojan.BAT.Generic\nMicrosoft -> Trojan:Script/Wacatac.B!ml\nSymantec -> Trojan.Gen.MBT\nTencent -> Bat.Trojan.Generic.Svgz\n\nС помощью командного файла KillAVS.bat вырубает следующие защитные функции и\nантивирусные службы:\nAhnlab Task Scheduler, AntiSpyware, AntiVirus Auto Protect Service, AntiVirus Client, AntiVirus\nCorporate Edition, AntiVirus Firewall Monitor Service, AntiVirus Server, Automatic Updates,\nccEvtMGR, ccPwdSvc, ccSetMGR, cls, Core LC, DefWatch, ERSvc, eTrust Antivirus Job Server,\neTrust Antivirus Realtime Server, eTrust Antivirus RPC Server, eventlog, helpsvc, InoRPC, InoRT,\nInoTask, McShield, mcupdmgr.exe, MonSvcNT, MpfService, MskService, NAV Alert, Nav AutoProtect, navapsvc, netsvcs, Network Drivers Service, NProtectService, PC-cillin Personal Firewall,\n\n\n-----\n\nPersonal Firewall Service, SAVScan, Security Center, SecurityCenter Update Manager, Serv-U,\nSophos Anti-Virus, Sophos Anti-Virus Network, Spamkiller Server, SPBBCSvc, spoolnt, srservice,\nSygate Personal Firewall Pro, SyGateService, Trend Micro Proxy Service, Trend NT Realtime\nService, Unerase Protection, ViRobot Professional Monitoring, VirusScan Online Realtime Engine,\nvrmonsvc\n--Еще варианты: файлы YourCyanide.cmd, YourCyanide_obf.bat\n\n[Результаты анализов: VT +](https://www.virustotal.com/gui/file/4b3efbf87fb31216a93954617e149825b9f029b4a37ea0fff9851eb363693424) **[TG / VT +](https://tria.ge/220519-vskh7acghq/behavioral1)** **[TG](https://tria.ge/220519-wft3jadbgj/behavioral1)**\n\n**=== БЛОК ССЫЛОК и СПАСИБОК = BLOCK OF LINKS AND THANKS ===**\n```\n        Thanks: \n Petrovic\n Andrew Ivanov (article author)\n ***\n to the victims who sent the samples\n\n```\n[© Amigo-A (Andrew Ivanov): All blog articles. Contact.](https://id-ransomware.blogspot.com/p/contact.html)\n\n### RansomHouse\n\n## RansomHouse Extortion Group\n\n RansomHouse Hacking Team\n\n RansomHouse Ransomware\n\n### (хакеры-вымогатели, доксеры, публикаторы) (первоисточник)\n Translation into English\n\n\n-----\n\nЭти хакеры-вымогатели на своем сайте сообщают, что сами они не атакуют ресурсы бизнеспользователей, не похищают и не шифруют данные, чтобы затем требовать выкуп в\nбиткоинах за возврат слитых файлов, не опубликовав их для всеобщего обозрения. Они\nназывают себя посредниками, предпочитая мирные соглашения со сторонами. Правда ли\nэто, мы не знаем. В любом случае, посредники, заинтересованные в уплате выкупа, состоят в\nсговоре с другими хакерами, которые атакуют и требуют выкуп за возврат файлов в прежнее\nсостояние.\nОригинальное название группы этих посредников: RansomHouse. Само слово \"Ransom\"\nподразумевает \"выкуп\", странно, что они выбрали себе такое название, но называют себя\nпосредниками между хакерами, укравшими данные и тем, у кого эти данные увели. Такие\nстранности имеют название — \"оговорка по Фрейду\". Назвались бы MediationHouse, тогда и\nбыли бы посредниками. Впрочем, значок биткоина в логотипе вымогателей и сумма оплаты в\n1 биткоин, говорят о том, что эти люди точно вымогатели, как бы они сами себя не\nназывали.\n--**Обнаружения:**\nНе образцов используемого вредоносного ПО.\n--\n**© Генеалогия: ??? >> RansomHouse**\n\nСайт \"ID Ransomware\" это пока не идентифицирует.\n**Информация для идентификации**\n\nИнформация о первых пострадавших от вымогателей размещена в декабре 2021 г. на сайте\nгруппы RansomHouse. Сайт на английском языке, значит они ориентированы на\nанглоязычные компании и могут быть активны по всему миру.\n\nДобавляемое к зашифрованным файлам расширение видимо зависит от названия\nатакованного ресурса компании или её названия. Сами RansomHouse к этому отношения не\nимеют.\n\n\n-----\n\nПример записки и образец вредоносного файла получить не удалось.\n\nПо аналогии с другими статьями о хакерах-вымогателях, мы решили опубликовать текст с\nсайта группы RansomHouse, чтобы рассказать о том, что они собой представляют и как себя\nпозиционируют.\n\n**Страница \"Main\"**\n\n**Содержание:**\nBelow is a list of companies that either have considered their financial gain to be above the\ninterests of their partners / individuals who have entrusted their data to them or have chosen to\nconceal the fact that they have been compromised.\nAHS Aviation Handling Services GmbH\nDellner Couplers AB\nJefferson Credit Union\nSaskatchewan Liquor and Gaming Authority\n\n\n-----\n\n**Краткий перевод:**\nНиже есть список компаний, поставивших свою финансовую выгоду выше интересов своих\nпартнеров/лиц, доверивших им свои данные, либо пожелавших скрыть факт компрометации.\n***\n--\n**Страница \"About\"**\n\n**Содержание:**\nOur mission\n©RansomHouse is a professional mediators community.\nWe have nothing to do with any breaches and don't produce or use any ransomware. Our primary\ngoal is to minimize the damage that might be sustained by related parties. RansomHouse members\nprefer common sense, good conflict management and intelligent negotiations in an effort to achieve\nfulfillment of each party's obligations instead of having non-constructive arguments. These are\nnecessary and sufficient principles that lead to amicable agreements and sometimes even to\nsubsequent productive and friendly cooperation.\nRansomHouse shares the opinion of both Red and Blue teams regarding the threats of data leaks.\nThe very possibility of such incidents taking place is a strong incentive to make the private sector,\ncorporations and the public aware of data security and privacy issues and should make those\ninvolved in 3rd parties' personal information collection and storage responsible and respectful of\ntheir responsibilities. Unfortunately, more often than not CEOs prefer to close their eyes on\ncybersecurity saving budget on their staff or spending huge amounts of money mindlessly, which\ninevitably leads to vulnerabilities.\nWe believe that the culprits are not the ones who found the vulnerability or carried out the hack, but\nthose who did not take proper care of security. The culprits are those who did not put a lock on the\ndoor leaving it wide open inviting everyone in. People are inherently curious and are eager to learn\nthe object of their interest. Usually corporations respond to the message that their \"doors are wide\nopen\" in negative context, direct threats or silence. In rare cases one could meet gratitude and\nridiculously small payments that do not cover even 5% of an enthusiast's efforts. Well, the negative\nreaction is understandable, because the company management will have a hard time explaining\nmillions of dollars spent on security audits and cybersecurity staff high salaries to their shareholders\n\n\n-----\n\nwith some freelancer around pointing out the global mistakes they ve made, bringing their\nmanagerial skills and the results of spending money to the ground. A close example to you might\nbe Lehman Brothers who were warned about severe vulnerabilities in their economic risk\nmanagement model six months in advance before the collapse - warned by three enthusiastic\neconomist-mathematicians who got nothing but mocks from the fund.\nBut evolution cannot be stopped, fitting structures emerge in every environment, and so groups of\nenthusiasts have emerged on the grounds of data negligence, eager to get paid honestly by\nstreamlining this chaos through public punishment. These methods of making money and pointing\nout companies' mistakes may be controversial, and when you recall that we are talking about\nbillion-dollar corporations on the opposing side, it becomes clear why the RansomHouse team is so\nimportant to engage in dialogue. That is what this project is all about - bringing conflicting parties\ntogether, helping them to set up a dialogue and make informed, balanced decisions. The team\nworks hard to find a way out of even the most difficult situations and allow both parties to go\nforward without changing rules as they go along. Incompetence and fuss is unacceptable when\ndealing with such cases, which is exactly what happens most often. Here and now we are creating\na new culture and streamlining this industry.\nUnfortunately, companies that refuse negotiations and reject reasonable arguments, companies\nthat are unwilling to pay for this kind of work - will face reputational and legal costs. In order to\nhighlight these cases we will not only disclose information on our website and official Telegram\nchannel but also attract the attention of journalists, public and third parties to the problem and do\neverything needed to make the incident as public as possible. Information accessibility is one of the\nfoundations of a civilized society and a way for it to rise above itself and overcome social\nchallenges.\nWe are strictly against the suffering of any individuals who became victims of other people's\nirresponsibility and leaks. To the best of our ability we help them by giving an opportunity to make a\nrequest through our Official Telegram Channel and have their data package removed from the\nshared set before it is published. The right to manage personal data is fulfilled here to the extent\npossible in current circumstances.\n\n**Краткий перевод (только слова группы о \"себе\"):**\nНаша миссия\n©RansomHouse — сообщество профессиональных посредников.\nМы не имеем никакого отношения к взлому, не создаем и не используем программывымогатели. Наша основная цель – свести к минимуму ущерб, который может быть нанесен\nсвязанным сторонам. Члены RansomHouse предпочитают здравый смысл, хорошее\nуправление конфликтами и разумные переговоры, чтобы добиться выполнения обязательств\nкаждой стороны, а не неконструктивные аргументы. Это необходимые и достаточные\nпринципы, ведущие к мировым соглашениям, а иногда и к последующему продуктивному и\nдружескому сотрудничеству.\n*** К сожалению, чаще всего руководители предпочитают закрывать глаза на\nкибербезопасность, экономя бюджет на своих сотрудниках или бездумно тратя огромные\nсуммы денег, что неизбежно приводит к уязвимостям.\nМы считаем, что виноваты не те, кто нашел уязвимость или осуществил взлом, а те, кто не\nпозаботился о безопасности должным образом. ***\n\n\n-----\n\nпоэтому на почве халатного отношения к данным возникли группы энтузиастов,\nстремящихся честно получить деньги, упорядочив этот хаос посредством публичного\nнаказания. Эти методы зарабатывания денег и указания на ошибки компаний могут быть\nспорными, а когда вспоминаешь, что речь идет о корпорациях на миллиарды долларов на\nпротивоположной стороне, становится понятно, почему команде RansomHouse так важно\nвести диалог. Именно для этого и предназначен этот проект – сближение конфликтующих\nсторон, помощь им в налаживании диалога и принятии взвешенных, взвешенных решений.\n*** Здесь и сейчас мы создаем новую культуру и оптимизируем эту отрасль.\nК сожалению, компании, которые отказываются от переговоров и отвергают разумные\nдоводы, компании, которые не желают платить за такую работу, столкнутся с\nрепутационными и юридическими издержками. Для освещения этих случаев мы будем не\nтолько раскрывать информацию на нашем сайте и официальном Telegram-канале, но и\nпривлекать внимание журналистов, общественности и третьих лиц к проблеме и делать все\nнеобходимое, чтобы инцидент был максимально публичным. ***\nМы категорически против страданий любых лиц, ставших жертвами чужой\nбезответственности и утечек. ***\n--\n**Страница \"Rules\"**\n\n**Содержание:**\nTerms of service\n1. Payment\n1.1. A Bitcoin wallet will be provided to the customer directly in the chat room when the customer\nis ready to pay;\n1.2. One bitcoin must be transferred to payment wallet for verification first; the remaining amount\nmust be transferred after confirming the transaction from our side;\n2. Participation of third-parties\n2.1. Participation of police departments is prohibited;\n2.2. Participation of FBI, CIA, NSA or other special agencies is prohibited;\n2.3. Participation of third-party negotiators is prohibited;\n2.4. Violation of clauses 2.1.-2.3. of \"Terms of service\" causes immediate termination of\nnegotiations and all reached agreements. In this case all the data the team has will be disclosed on\nthe website, Telegram channel and sent to all involved companies and individuals.\n\n\n-----\n\n3. Post-transaction guarantees\n3.1. All uploaded information will be removed from the team's servers;\n3.2. All posts/websites/pages etc. posted by the team and associated with the data leak will be\nremoved;\n3.3. All backdoors exploited by the team will be removed;\n3.4. Personal data will not be shared with third parties by the team;\n3.5. A list of information security recommendations will be provided to the head of the company;\n3.6. Decryption software, guidance and support will be provided if required;\n3.7. Current vulnerabilities will never be used by the team for further attacks. In case new\nvulnerabilities will be discovered, the company will be notified.\n\n**Краткий перевод:**\nУсловия обслуживания\n1. Оплата\n1.1. Биткойн-кошелек будет дан клиенту прямо в чате, когда клиент будет готов заплатить;\n1.2. Сначала надо перевести 1 биткойн на кошелек для проверки; оставшуюся сумму нужно\nперевести после подтверждения транзакции с нашей стороны;\n2. Участие третьих лиц\n2.1. Участие отделений полиции запрещено;\n2.2. Участие ФБР, ЦРУ, АНБ или других спец. агентств запрещено;\n2.3. Участие сторонних переговорщиков запрещено;\n2.4. Нарушение пунктов 2.1.-2.3. \"Условий обслуживания\" влечет за собой немедленное\nпрекращение переговоров и всех достигнутых договоренностей. В этом случае все данные,\nкоторые есть у команды, будут раскрыты на сайте, в Telegram-канале и отправлены всем\nзаинтересованным компаниям и частным лицам.\n3. Гарантии после сделки\n3.1. Вся загруженная информация будет удалена с серверов команды;\n3.2. Все сообщения/веб-сайты/страницы и пр., размещенные командой и связанные с утечкой\nданных, будут удалены;\n3.3. Все бэкдоры, используемые командой, будут удалены;\n3.4. Персональные данные не будут переданы командой третьим лицам;\n3.5. Список рекомендаций по информационной безопасности будет предоставлен\nруководителю компании;\n3.6. При необходимости будет предоставлена программа для расшифровки, руководство и\nподдержка;\n3.7. Текущие уязвимости никогда не будут использованы командой для дальнейших атак. При\nобнаружениия новых уязвимостей компания будет уведомлена об этом.--\n**Страница \"FAQ\"**\n\n\n-----\n\n**Содержание:**\nFAQ\nCan we cooperate with you?\nWe would be glad to find new contacts in this field. So if you want us to make your data available\non our website or participate in negotiations, you need to contact us using our Cooperation\nTelegram Channel, we are open to it. Please keep in mind that we reserve the right to reject data\nviolating moral and ethical principles. If we find common ground, the team will then contact the\ncompany and make negotiations for you. A further decision on data disclosure will be made\nfollowing the negotiations, so you will be notified. Important: if you are a member of an ultra-radical\ngroup forbidden in some country, involved in extremism or espionage, any cooperation between us\nis impossible. Your values are not the same as ours: we appreciate life, liberty, equal access to\ninformation, democracy and non-violent methods of communication. Our team does not provide\ndata to any groups if we become aware of their extremist activities. We are not involved in politics\nor religion.\nDo you have special offers for journalists or reporters?\nWe highly respect the work of journalists and consider information accessibility to be our priority.\nWe have a special program for journalists which includes sharing information a few hours or even\ndays before it is officially published on our news website and Telegram channel: you would need to\ngo through a KYC procedure to apply. Journalists and reporters can contact us via our PR Telegram\nchannel with any questions.\nI am (was) a client of a company found in your list and became a victim of their irresponsible\nprocessing of my personal data and business secrets, what can I do?\nFirst of all, we find it necessary to say we are sorry that you were affected by companies' negligent\nattitude to the privacy and security of their customers' personal data. But there is a bright side,\nbecause it gives you the opportunity to request compensation from such companies. Secondly, in\ncase the team decides to publish the data containing personal information, individuals can contact\nus via our Official Telegram Channel or dedicated Telegram Channels referenced at company's\ndetails profile with a removal request, in addition we will try to do this ourselves before making the\ndata public. So the team gives the opportunity to remove personal information from disclosure on\ndemand. This option is available if the company's status is marked as \"Evidence\". If the data is\nalready published, this option no longer applies. Depending on the amount of data available, up to\n10,000 data sets will be removed following to the appeals received for each project. This will be\ndone at no cost to you, in addition we will provide your data set that you can use in a lawsuit to\ncompensate the damage caused to you.\n\n\n-----\n\nWhat can I do if my company is in your list?\nIf your company is on our list and its status is \"Disclosed\", all the data is already publicly available.\nIn case the company's status is \"Evidence\", you have an opportunity to avoid data disclosure: you\nmust contact our support team via Last chance Telegram Channel, go through KYC and get further\ninstructions. But you should realise that you don't have an opportunity to think long and hard about\nwhether to contact us or not. Status can always change to \"Disclosed\", but we will inform about it in\nadvance.\n©RansomHouse\n\n**Краткий перевод:**\nЧЗВ\nМожем ли мы сотрудничать с вами?\nМы будем рады новым контактам в этой области. Поэтому, если вы хотите, чтобы мы сделали\nваши данные доступными на нашем сайте или участвовали в переговорах, вам надо\nнаписать нам в наш Telegram-канал... ...мы оставляем за собой право отклонять данные,\nнарушающие моральные и этические принципы. Если мы найдем точки соприкосновения,\nкоманда свяжется с компанией и проведет переговоры. Решение о раскрытии данных будет\nпринято после переговоров... Важно: если вы член запрещенной ...ультрарадикальной\nгруппировки, занимающейся экстремизмом или шпионажем, сотрудничество между нами\nневозможно. Ваши ценности отличаются от наших: мы ценим жизнь, свободу, равный доступ\nк информации, демократию и ненасильственные методы общения. Наша команда не\nпредоставляет данные каким-либо группам, если нам становится известно об их\nэкстремистской деятельности. Мы не занимаемся политикой или религией.\nЕсть ли у вас специальные предложения для журналистов или репортеров?\nМы очень уважаем труд журналистов и считаем доступность информации нашим\nприоритетом. У нас есть специальная программа для журналистов, которая включает в себя\nобмен информацией за несколько часов или даже дней до ее официальной публикации на\nнашем новостном сайте и в Telegram-канале: для подачи заявки вам необходимо пройти\nпроцедуру KYC. Журналисты и репортеры могут связаться с нами через наш PR Telegramканал...\nЯ являюсь (был) клиентом компании из вашего списка и стал жертвой их безответственной\nобработки моих личных данных и коммерческой тайны, что я могу сделать?\nПрежде всего... сожалеем о том, что вы пострадали от небрежного отношения компаний к\nконфиденциальности и безопасности персональных данных своих клиентов. Но ...это дает\nвам возможность требовать компенсацию... ...если команда решит опубликовать данные,\nсодержащие личную информацию, люди могут связаться с нами через наш официальный\nканал Telegram или специальные каналы Telegram, указанные в профиле компании, с\nзапросом на удаление... ...Эта опция доступна, если статус компании отмечен как\n«Доказательства». Если данные уже опубликованы, этот параметр больше не применяется...\nЭто будет сделано бесплатно для вас, кроме того, мы предоставим ваш набор данных,\nкоторый вы сможете использовать в судебном процессе для возмещения причиненного вам\nущерба.\nЧто мне делать, если моя компания есть в вашем списке?\nЕсли ваша компания есть в нашем списке и у нее статус «Раскрыта», то все данные уже\nнаходятся в открытом доступе. В случае статуса компании «Доказательство» у вас есть\n\n\n-----\n\nвозможность избежать разглашения данных: вам надо связаться с нашей службой поддержки\nчерез Telegram-канал «Последний шанс», пройти KYC и получить дальнейшие инструкции.\nНо вы должны понимать, что у вас нет возможности долго и упорно думать, обращаться к нам\nили нет. Статус всегда может измениться на \"Раскрыт\", но мы сообщим об этом заранее.\n©RansomHouse\n\n**Внимание! Различия с первым вариантом могут быть опубликованы в разделе для**\nобновлений, после основной статьи.\n\n**Технические детали + IOC**\n\nИспользуемое вредоносное ПО может распространяться путём взлома через незащищенную\nконфигурацию RDP, с помощью email-спама и вредоносных вложений, обманных загрузок,\nботнетов, эксплойтов, вредоносной рекламы, веб-инжектов, фальшивых обновлений,\nперепакованных и заражённых инсталляторов. См. также \"Основные способы\n[распространения криптовымогателей\" на вводной странице блога.](https://id-ransomware.blogspot.ru/2016/05/blog-post.html)\n\nНужно всегда использовать [Актуальную антивирусную защиту!!!](https://anti-ransomware.blogspot.com/2019/02/topical-protection.html)\nЕсли вы пренебрегаете комплексной антивирусной защитой класса Internet Security или Total\nSecurity, то хотя бы делайте резервное копирование важных файлов по [методу 3-2-1.](https://id-ransomware.blogspot.ru/2016/11/sposoby-zashhity-ot-shifrovalshhikov-vymogatelej.html)\n\n**Список типов файлов, подвергающихся шифрованию:**\nЭто документы MS Office, OpenOffice, PDF, текстовые файлы, базы данных, фотографии,\nмузыка, видео, файлы образов, архивы и пр.\n\n**Файлы, связанные с этим Ransomware:**\n<ransom_note>.txt - название файла индивидуальной записки;\n<random>.exe - условное название вредоносного файла.\n\n**Расположения:**\n\\Desktop\\ ->\n\\User_folders\\ ->\n\\%TEMP%\\ ->\n\n**Записи реестра, связанные с этим Ransomware:**\nСм. ниже результаты анализов.\n\n**Мьютексы:**\nСм. ниже результаты анализов.\n\n\n-----\n\n**Сетевые подключения и связи:**\nTelegram: ransom_house\nTor-URL: hxxx://xw7au5pnwtl6lozbsudkmyd32n6gnqdngitjdppybudan3x3pjgpmpid.onion\nEmail: BTC: \n**Результаты анализов:**\nIOC: VT, HA, IA, TG, AR, VMR, JSB\n\nMD5: \nСтепень распространённости: низкая.\nИнформация дополняется. Присылайте образцы.\n\n=== ИСТОРИЯ СЕМЕЙСТВА === HISTORY OF FAMILY ===\n\n=== БЛОК ОБНОВЛЕНИЙ === BLOCK OF UPDATES ===\n\nЕщё не было обновлений этого варианта.\n\n**=== БЛОК ССЫЛОК и СПАСИБОК = BLOCK OF LINKS AND THANKS ===**\n\n\n-----\n\n```\n          Read to links: \n Message + Message + myMessage\nWrite-up, Topic of Support\n *\n        Thanks: \n RakeshKrish12\n Andrew Ivanov (article author)\n ***\n to the victims who sent the samples\n\n```\n[© Amigo-A (Andrew Ivanov): All blog articles. Contact.](https://id-ransomware.blogspot.com/p/contact.html)\n\n### Pipikaki\n\n## Pipikaki Ransomware\n\n Pipikaki Doxware\n\n### (шифровальщик-вымогатель) (первоисточник)\n Translation into English\n\nЭтот крипто-вымогатель шифрует данные бизнес-пользователей с помощью комбинации\nалгоритмов AES+RSA, а затем требует написать вымогателям в Skype, ICQ или на email,\nчтобы вернуть файлы. Оригинальное название: Pipikaki. На файле написано: нет данных.\n\n--\n**Обнаружения:**\n\n\n-----\n\n**DrWeb ->**\n**BitDefender ->**\n**ESET-NOD32 ->**\n**Kaspersky ->**\n**Malwarebytes ->**\n**Microsoft ->**\n**Rising ->**\n**Tencent ->**\n**TrendMicro ->**\n--\n**© Генеалогия: ??? >> Pipikaki**\n\nСайт \"ID Ransomware\" это пока не идентифицирует.\n**Информация для идентификации**\n\nАктивность этого крипто-вымогателя была в конце апреля 2022 г. Ориентирован на\nанглоязычных пользователей, может распространяться по всему миру.\n\nК зашифрованным файлам добавляется расширение: .[5391F333].@PIPIKAKI\n\nВ конец кода зашифрованного файла добавляется маркер 5391F333MONSTER\n\nЗаписка с требованием выкупа называется: WE CAN RECOVER YOUR DATA.txt\n\n\n-----\n\n**Содержание записки о выкупе:**\nHello my dear friend\nUnfortunately for you, a major IT security weakness left you open to attack, your files have been\nencrypted\nIf you want to restore them,write to our skype - Pipikaki Decryption\nAlso you can write ICQ live chat which works 24/7 @PIPIKAKI\nInstall ICQ software on your PC https://icq.com/windows/ or on your mobile phone search in\nAppstore / Google market ICQ\nWrite to our ICQ @PIPIKAKI https://icq.im/PIPIKAKI\nIf we not reply in 6 hours you can write to our mail but use it only if previous methods not working pipikaki@onionmail.org\nAttention!\n\n- Do not rename encrypted files.\n\n- Do not try to decrypt your data using third party software, it may cause permanent data loss.\n\n- We are always ready to cooperate and find the best way to solve your problem.\n\n- The faster you write, the more favorable the conditions will be for you.\n\n- Our company values its reputation. We give all guarantees of your files decryption,such as test\ndecryption some of them\nWe respect your time and waiting for respond from your side\ntell your unique ID: 5391F333\nSensitive data on your system was DOWNLOADED.\nIf you DON'T WANT your sensitive data to be PUBLISHED you have to act quickly.\nData includes:\n\n- Employees personal data, CVs, DL, SSN.\n\n- Complete network map including credentials for local and remote services.\n\n- Private financial information including: clients data, bills, budgets, annual reports, bank\nstatements.\n\n- Manufacturing documents including: datagrams, schemas, drawings in solidworks format\n\n- And more...\n\n**Перевод записки на русский язык:**\nПривет, мой дорогой друг\nК сожалению для вас, из-за серьезной уязвимости в ИТ-безопасности вы оказались уязвимы\nдля атак, ваши файлы зашифрованы.\n\n\n-----\n\nЕсли хотите их восстановить, пишите в наш скайп - Pipikaki Decryption\nТакже вы можете написать в онлайн-чат ICQ, который работает 24/7 @PIPIKAKI.\nУстановите программу ICQ на свой ПК https://icq.com/windows/ или на мобильный телефон\nищите в Appstore/Google market ICQ\nПишите в наш ICQ @PIPIKAKI https://icq.im/PIPIKAKI\nЕсли мы не ответим в течение 6 часов, вы можете написать на нашу почту, но использовать\nее, только если предыдущие способы не работают - pipikaki@onionmail.org\nВнимание!\n\n- Не переименовывайте зашифрованные файлы.\n\n- Не пытайтесь расшифровать свои данные с помощью сторонних программ, это может\nпривести к безвозвратной потере данных.\n\n- Мы всегда готовы к сотрудничеству и найдем лучший способ решить вашу проблему.\n\n- Чем быстрее вы напишете, тем выгоднее будут для вас условия.\n\n- Наша компания дорожит своей репутацией. Мы даем все гарантии расшифровки ваших\nфайлов, в том числе тестовую расшифровку некоторых из них\nМы уважаем ваше время и ждем ответа с вашей стороны\nсообщите свой уникальный ID: 5391F333\nКонфиденциальные данные из вашей системе были СКАЧАНЫ.\nЕсли вы НЕ ХОТИТЕ, чтобы ваши конфиденциальные данные были ОПУБЛИКОВАНЫ, вы\nдолжны действовать быстро.\nДанные включают:\n\n- Персональные данные сотрудников, CV, DL, SSN.\n\n- Полная карта сети, включая учетные данные для локальных и удаленных служб.\n\n- Частная финансовая информация, включая: данные клиентов, счета, бюджеты, годовые\nотчеты, банковские выписки.\n\n- Производственная документация, в том числе: дейтаграммы, схемы, чертежи в формате\nSolidWorks\n\n- И более...\n\n**Внимание! Новые расширения, email и тексты о выкупе можно найти в конце статьи, в**\nобновлениях. Могут быть различия с первым вариантом.\n\n**Технические детали + IOC**\n\nМожет распространяться путём взлома через незащищенную конфигурацию RDP, с помощью\nemail-спама и вредоносных вложений, обманных загрузок, ботнетов, эксплойтов,\nвредоносной рекламы, веб-инжектов, фальшивых обновлений, перепакованных и\nзаражённых инсталляторов. См. также \"Основные способы распространения\n[криптовымогателей\" на вводной странице блога.](https://id-ransomware.blogspot.ru/2016/05/blog-post.html)\n\n\n-----\n\nНужно всегда использовать [Актуальную антивирусную защиту!!!](https://anti-ransomware.blogspot.com/2019/02/topical-protection.html)\nЕсли вы пренебрегаете комплексной антивирусной защитой класса Internet Security или Total\nSecurity, то хотя бы делайте резервное копирование важных файлов по [методу 3-2-1.](https://id-ransomware.blogspot.ru/2016/11/sposoby-zashhity-ot-shifrovalshhikov-vymogatelej.html)\n\n**Список типов файлов, подвергающихся шифрованию:**\nЭто документы MS Office, OpenOffice, PDF, текстовые файлы, базы данных, фотографии,\nмузыка, видео, файлы образов, архивы и пр.\n\n**Файлы, связанные с этим Ransomware:**\nWE CAN RECOVER YOUR DATA.txt - название файла с требованием выкупа;\n<random>.exe - случайное название вредоносного файла\n\n**Расположения:**\n\\Desktop\\ ->\n\\User_folders\\ ->\n\\%TEMP%\\ ->\n\n**Записи реестра, связанные с этим Ransomware:**\nСм. ниже результаты анализов.\n\n**Мьютексы:**\nСм. ниже результаты анализов.\n\n**Сетевые подключения и связи:**\nSkype: Pipikaki Decryption\nICQ: @PIPIKAKI\nEmail: pipikaki@onionmail.org\n\nСм. ниже в обновлениях другие адреса и контакты.\n\n**Результаты анализов:**\nIOC: VT, HA, IA, TG, AR, VMR, JSB\n\nMD5: \nСтепень распространённости: низкая.\nИнформация дополняется. Присылайте образцы.\n\n=== ИСТОРИЯ СЕМЕЙСТВА === HISTORY OF FAMILY ===\n\n\n-----\n\n=== БЛОК ОБНОВЛЕНИЙ === BLOCK OF UPDATES ===\n\nЕщё не было обновлений этого варианта.\n\n**=== БЛОК ССЫЛОК и СПАСИБОК = BLOCK OF LINKS AND THANKS ===**\n```\n          Read to links: \n myMessage + Message + Message\n Write-up, Topic of Support, Topic of Support\n *\n        Thanks: \n Andrew Ivanov (article author)\n ***\n ***\n to the victims who sent the samples\n\n```\n[© Amigo-A (Andrew Ivanov): All blog articles. Contact.](https://id-ransomware.blogspot.com/p/contact.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-03 - PassLock Ransomware.pdf"
    ],
    "report_names": [
        "2020-02-03 - PassLock Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "921cea27-4410-42e4-8c11-7d40ba313225",
            "created_at": "2023-01-06T13:46:39.375789Z",
            "updated_at": "2025-03-27T02:00:03.067286Z",
            "deleted_at": null,
            "main_name": "RansomHouse",
            "aliases": [],
            "source_name": "MISPGALAXY:RansomHouse",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535550,
    "ts_updated_at": 1743041407,
    "ts_creation_date": 1653708422,
    "ts_modification_date": 1653708422,
    "files": {
        "pdf": "https://archive.orkl.eu/62a7f17391a4fabcc91893f1d46fda7f6cb97228.pdf",
        "text": "https://archive.orkl.eu/62a7f17391a4fabcc91893f1d46fda7f6cb97228.txt",
        "img": "https://archive.orkl.eu/62a7f17391a4fabcc91893f1d46fda7f6cb97228.jpg"
    }
}