{
    "id": "01997e56-4db4-486d-b508-757d764df40d",
    "created_at": "2023-01-12T15:07:35.184922Z",
    "updated_at": "2025-03-27T02:06:09.91032Z",
    "deleted_at": null,
    "sha1_hash": "d4eeaef76b55aad9117bf80aee278629b7a9550c",
    "title": "2022-09-07 - The Curious Case of “Monti” Ransomware- A Real-World Doppelganger",
    "authors": "",
    "file_creation_date": "2022-09-12T12:04:36Z",
    "file_modification_date": "2022-09-12T12:04:36Z",
    "file_size": 3155183,
    "plain_text": "# The Curious Case of “Monti” Ransomware: A Real-World Doppelganger\n\n**[blogs.blackberry.com/en/2022/09/the-curious-case-of-monti-ransomware-a-real-world-doppelganger](https://blogs.blackberry.com/en/2022/09/the-curious-case-of-monti-ransomware-a-real-world-doppelganger)**\n\nAnuj Soni, Ryan Chapman\n\n1. [BlackBerry Blog](https://blogs.blackberry.com/en.html)\n2. The Curious Case of “Monti” Ransomware: A Real-World Doppelganger\n\nA ransomware victim called in the BlackBerry Incident Response (IR) team during this\nyear's 4th of July holiday weekend. We quickly realized we were investigating an attack by\na previously unknown group, calling themselves \"MONTI.\" They encrypted nearly 20 user\nhosts along with a multi-host VMware ESXi cluster that brought down over 20 servers.\n\nThreat research shows that the only credible reference of the “Monti” ransomware group\n[prior to today was a tweet from security researchers at MalwareHunterTeam, posted on](https://twitter.com/malwrhunterteam?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor)\nJune 30, 2022. The Twitter post mentioned the possibility that Monti ransomware may have\nhad “5-10 victims in the past months,” though no data is publicly available on these victims.\n\nMost Indicators of Compromise (IOCs) identified by the BlackBerry IR team in the Monti\n[attack were also seen in previous Conti ransomware cases — except one: Monti threat](https://blogs.blackberry.com/en/2021/05/threat-thursday-conti-ransoms-over-400-organizations-worldwide)\nactors leveraged the Action1 Remote Monitoring and Maintenance (RMM) agent.\n\n\n-----\n\nThis article provides a general overview of the incident, denotes the unique characteristics\nof this “new” threat actor group, and includes malware analysis of the payload used. We\n[also include a breakdown of “Veeamp,” a password stealer malware targeting the Veeam](https://www.veeam.com/)\ndata backup application, which was identified during the incident.\n\n### Operating System\n\n Risk & Impact\n\n Monti Ransomware Incident Overview\n\nOn July 5, 2022, a client engaged the BlackBerry® Security Services Incident Response\nteam to perform a forensic investigation and respond to a ransomware-related security\nincident. The security incident occurred when a threat actor group calling itself “MONTI”\nobtained access to the client’s environment.\n\n[The threat actor apparently intruded via an exploitation of the well-known “Log4Shell”](https://blogs.blackberry.com/en/2022/01/log4u-shell4me)\n[vulnerability (a.k.a. CVE-2021-44228) in the client’s internet-facing VMware Horizon](https://cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2021-44228)\nvirtualization system. At the time the BlackBerry team was engaged, the operators had\nalready initially encrypted 18 user desktops. They also encrypted a three-server ESXi\ncluster that resulted in 21 virtualized servers being impacted. Figure 1 provides an overview\nof the incident.\n\n\n-----\n\n_Figure 1 - Overview of the “MONTI strain” ransomware incident_\n\nThe threat actor initially obtained access to the client’s VMware Horizon Connection Broker\nserver via Log4Shell exploitation on June 29, 2022. After entering the client’s environment,\nit installed the Google Chrome™ browser and used it to download attack tools to the server.\n\nThe threat actor also downloaded and installed two remote monitoring and maintenance\n(RMM) agents, AnyDesk and Action1, which we’ll describe in more detail later. It used these\nagents to establish persistence within the network and to facilitate additional remote access.\n\nThe attackers also used tooling they’d brought into the environment to dump credentials\nfrom memory and scan the network. They used Microsoft® Windows® built-in Remote\nDesktop Protocol (RDP) to connect to other servers, access data files on network shares,\nand eventually to deploy the “MONTI” strain of ransomware. The goal of this activity was to\nencrypt multiple hosts within the network (including Veeam-based backups).\n\n### Meet the Mysterious Monti Ransomware Group\n\nThe threat group referring to itself as “MONTI” is little-known within the threat intelligence\ncommunity. The limited evidence we discovered regarding this threat actor indicates they\nemerged between May and June 2022.\n\n\n-----\n\nBased on analysis conducted in this investigation, BlackBerry researchers believe that the\nMonti group has purposefully (and brazenly) mimicked the better-known \"Conti\" team's\ntactics, techniques, and procedures (TTPs), along with many of its tools and its ransomware\nencryptor payload.\n\nIt seems likely that attackers chose this blatant emulation strategy because of the\navailability of Conti group’s internal communications, chat logs, training guides, real-world\nidentities, and source code — all of which were publicly leaked on the internet starting in\nFebruary 2022. Having access to this trove of information effectively gave Monti threat\nactors a step-by-step guide to emulating Conti’s notoriously successful activities.\n\nAs a response to the data leak, the Conti group went into hiding. Currently, the original\nConti ransomware operations group is believed to have dispersed and is no longer in\nbusiness.\n\nAt the time of writing this report, public internet and darknet research revealed only a single\nmention of the Monti ransomware crew, in the form of a Twitter post from the account\n“MalwareHunterTeam” (@malwrhunterteam). This tweet, shown in Figure 2, includes a\nscreenshot of the “MONTI strain” ransomware note, and alludes to possible re-use of the\nConti codebase.\n\n\n-----\n\n_Figure 2 - A tweet from June 30, 2022, discussing “MONTI strain” of ransomware_\n\nBecause a mountain of analysis already exists to explain Conti ransomware operations, we\nwill focus on what makes the Monti group unique, and what you can expect when a\n“doppelganger” group such as this spins up operations.\n\n### Unique Characteristics of Monti Ransomware\n\nThe ransom note left by the threat actor is taken directly from previously seen Conti notes,\nwith two minor changes:\n\nThe beginning of the note mentions “MONTI” as opposed to “CONTI.” (The remainder\nof this sentence is Conti’s verbiage, including the instruction to “Google it”: “All of your\nfiles are currently encrypted by MONTI strain. If you don't know who we are - just\n‘Google it.’”)\n\n\n-----\n\nThe TOR-based (.onion domain) URL provided for contacting the Monti group is\nunique.\n\nAs of July 5, 2022, the .onion domain provided for contacting Monti was unavailable.\nBlackBerry researchers were unable to find any indication that the domain was ever\naccessible. Public and darknet research, along with communications with fellow incident\nresponse firms, did not reveal any confirmation that the domain was up and running at any\ntime.\n\nGiven the lack of evidence from other Monti cases, we might never know if the domain was\never accessible. If this is the case, the Monti group might have never been able to collect a\nransom. (Should any researcher reading this article have information on a Monti\ndomain/URL being accessible, we would love to hear from you.)\n\nIn addition to changes in the ransom note, the threat actor leveraged a commercial, cloud[based RMM platform called Action1, which has not previously been used in a ransomware](https://www.action1.com/about-us/)\nattack. Ransomware actors, including Conti, commonly use commercial RMMs such as\nAnyDesk during their attacks. In fact, instructions for installation and configuration of the\nAnyDesk RMM are detailed in the “CobaltStrike MANUALS_V2 Active Directory” attack\nmanual that was leaked from the Conti group in 2021. Figure 3 shows a screenshot from\nthis manual, featuring AnyDesk installation instructions.\n\n\n-----\n\n_Figure 3 - Example of installation instructions for AnyDesk, as seen in a leaked_\n_“CobaltStrike MANUALS_V2 Active Directory” document_\n\nThe names of the Action1 agent executables that threat actors used in the Monti attack\nmatched those used by the RMM product itself. Specifically, the files found within the client\nenvironment were labeled “action1_agent.exe” and “action1_remote.exe.”\n\nWhen ransomware actors change a file’s name, they often do not change the\nOriginalFileName value. This value is found within the portable executable’s (PE’s)\nresources. Though alteration of this value is possible, many actors leave these values\nalone. As such, you can often find a renamed file by querying against the OriginalFileName\nvalue via your endpoint detection and response (EDR) tool, or Sysmon, among other tools.\n\nFigure 4 shows the file version information for action1_agent.exe, as seen on VirusTotal.\n\n\n-----\n\n_Figure 4 - action1_agent.exe file version information as seen on VirusTotal_\n\n[An example Lucene-based query for the Elasticsearch search and analytics engine might](https://www.elastic.co/guide/en/kibana/current/lucene-query.html)\nbe [OriginalFileName:\"action1_agent.exe\"]. (Keep this method in mind, as it is very handy\nduring ransomware investigations.)\n\n### Tools Leveraged in the Ransomware Attack\n\nThe attackers used two well-known temporary file transfer websites – dropmefiles.com[.]ua\nand temp[.]sh – to bring tools into the network and to exfiltrate data. They leveraged the\nGoogle Chrome web browser to access these sites and download tools.\n\nThe attackers’ choice to use Chrome™ rather than Internet Explorer (IE) may be due to the\nclient’s implementation of Enhanced Security Configuration (ESC), an option that can be\nenabled on Windows servers that prohibits general internet browsing via IE. To bypass the\nESC configuration, the attackers used Chrome, allowing them to freely browse web pages.\n\n**Table 1 lists the various tools leveraged by the Monti group.**\n\n**Tool** **Type** **Details**\n\n\n**Action1**\n**RMM**\n\n\nRMM - Commercial Remote Monitoring & Maintenance agent.\n\n       - Used by TAs to provide remote access to a victim network.\n\n\n-----\n\n**AnyDesk**\n**RMM**\n\n**Avast Anti-**\n**rootkit**\n**driver**\n\n\nRMM - Commercial Remote Monitoring & Maintenance agent.\n\n       - Used by TAs to provide remote access to a victim network.\n\n\nBypass\nTool\n\n\n\n- Avast's Anti-rootkit library is useful for removing rootkits.\n\n- Used by threat actors to remove endpoint security products\nsuch as antivirus (AV)/endpoint protection platforms (EPPs)/\nendpoint protection and response (EDR), etc.\n\n- Rootkit detector and remover\n\n- Used by threat actors to remove endpoint security products\nsuch as AV/EPP/EDR, etc.\n\n\n**GMER** Bypass\nTool\n\n\n**MEGASync** Data Theft - MEGA.io’s proprietary file synchronization agent.\n\n              - Used by TAs to exfiltrate data from victim networks to cloud\nstorage provider MEGA\n\n\n**Mimikatz** Credential\nTheft\n\n\n**netscan**\n\n**netscan64**\n\n\nNetwork\nScanner\n\n\n**PSEXEC** Lateral\nMovement\n\n\n\n- Free and open-source tool used to dump credentials,\nperform pass-the-hash/token attacks in networks, and\ngenerally obtain access to legitimate credentials\n\n- SoftPerfect Network Scanner tool\n\n- Used by threat actors to scan internal networks to identify\nsources for lateral movement\n\n- Microsoft \"SysInternal\" suite utility designed for\nadministrators to run commands on remote systems and/or\ncopy files to remote machines\n\n- Commonly used by threat actors to run processes remotely\nand to facilitate lateral movement\n\n\n**PuTTY** Data Theft - Data transfer tool commonly used by network administrators\n\n              - Used by threat actors to exfiltrate data from victim networks\n\n\n**Veeam-**\n**Get-Creds**\n\n\nCredential\nTheft\n\n\n\n- Open-source PowerShell script designed to dump\ncredentials from Veeam backup software\n\n- See [https://github.com/sadshade/veeam-creds](https://github.com/sadshade/veeam-creds)\n\n- Custom Veeam password dumper written in Microsoft .NET\n\n- Detailed in the Malware Analysis section found later in this\narticle\n\n\n**Veeamp** Credential\nTheft\n\n\n-----\n\n**WinRAR** Data Theft - Commercial data archival tool popularized in the early days\nof the internet and still used by many entities\n\n               - Often used by threat actors to archive data prior to\nexfiltration\n\n**WinSCP** Data Theft - Data transfer tool used by network administrators\n\n               - Used by threat actors to exfiltrate data from victim networks\n\n_Table 1 - Tools used by the Monti threat group_\n\n### Monti Group Data Access and Exfiltration\n\nWe reviewed various web browser-related files to analyze attacker access. For example,\nhistory and cache files from Internet Explorer, Chrome, and Firefox browsers revealed files\npotentially accessed by attackers. BlackBerry researchers uncovered more than 250 URLs\nindicating systems and files the threat group likely accessed.\n\nUsing the forensic data available on the client’s system, we were able to identify a single\ninstance of data exfiltration. The attacker dumped the process memory of the Local Security\nAuthority Server Service (LSASS) on the Horizon Connection Broker server, to a file named\n“lsass.DMP.”\n\nThis filename (specifically with the uppercase file suffix) is the default name given to files\ncreated from memory dumps of the LSASS process, when using Windows Task Manager.\nWhile attackers can change this filename, when this default name is used, this gives a hint\nat the provenance of the file.\n\nThe memory pages allocated to the LSASS process include credentials stored in memory\nthat Windows uses for various authentication and authorization procedures. As such,\nsomeone who dumps the memory for this process can recover plaintext credentials by\nusing a tool such as Mimikatz to process the memory dump. Mimikatz can also use this file\nto facilitate [Pass-the-Hash and similar attacks.](https://blog.netwrix.com/2021/11/30/passing-the-hash-with-mimikatz/)\n\nDuring data access analysis, BlackBerry researchers found that the threat actor accessed a\nURL associated with the DropMeFiles file-sharing website. Ransomware operators like this\nsite because it offers temporary and anonymous file-sharing services. We visited the\nidentified URL and confirmed that the attackers uploaded the dumped lsass.DMP file to the\nDropMeFiles site. Though users of this service can delete files at will, the threat actor\nneglected to do so. Thus, BlackBerry was able to obtain and review the exfiltrated memory\ndump.\n\nFigure 5 is a screenshot of the DropMeFiles site showing the lsass.DMP file that the threat\nactor exfiltrated from the client’s Horizon Connection Broker server.\n\n\n-----\n\n_Figure 5 - Screenshot showing lsass.DMP exfiltration via DropMeFiles_\n\n### Using Code Analysis to Your Advantage\n\nBefore we get into Monti’s reuse of Conti’s encryptor code, we want to point out a helpful\ntrick that was made possible due to our awareness of that code re-use.\n\nBecause we were familiar with Conti v2 and v3 encryptor payloads, the BlackBerry IR team\nknew that Conti encryptor payloads do not always encrypt the entirety of each file. Source\ncode analysis shows us that to determine which encryption methods to use, Conti payloads\nuse a combination of a file’s location (on the disk or network), type (based on file suffix), and\nsize.\n\nFor example, available ENCRYPT_MODES available in Conti v2 payloads include\nHEADER_ENCRYPT, PARTLY_ENCRYPT, and FULL_ENCRYPT. The PARTLY_ENCRYPT\nmode can be accompanied by a value of 20 or 50, indicating the percentage of the file that\nshould be encrypted.\n\nResearchers Luigi Martire, Carmelo Ragusa, and Luca Mella, from the cybersecurity\ncompany Yoroi, wrote a fantastic article named “Conti Ransomware Source Code: A Welldesigned COTS Ransomware,” which provides insight into the code segments that help\ndrive these encryption decisions. In the article, you will find examples of code segments\nsuch as the one shown in Figure 6, which details encryption mode selection based on file\nsize.\n\n\n-----\n\n_Figure 6 - Screenshot from Martire, Ragusa, and Mella’s 2022 article that shows encryption_\n_mode selection based on file size_\n\nThis knowledge allowed the BlackBerry IR team to extract full, unencrypted strings from\nencrypted log files.\n\nThe following command uses a simple grep query to identify the string “2022-0,” which was\nfound at the beginning of each line in the VMware Horizon Debug logs. Notice that even\nthough the log file included in the command below was encrypted, the command yielded\nover 137,000 lines of unencrypted log events.\n\n$ strings debug-2022-06-30-094202.txt.PUUUK | grep -i '2022-0' | wc -l\n\n137420\n\nThis same methodology can be adapted to many other file types. Text (.txt) and general log\nfiles are obviously the best use case.\n\n\n-----\n\nThis isn t just applicable to Monti or Conti. Many different ransomware encryptors use a\nsimilar process of selecting portions of each file to encrypt.\n\n**This possibility of decryption is just one of the many reasons why we recommend**\n**that ransomware victims back up files encrypted in these attacks. Yes, you read that**\n**right: the encrypted files.**\n\nEven if your encrypted files can’t be decrypted in this way, sometimes researchers are able\nto discover decryption methods that can be offered in stand-alone tools, and ransomware\noperations groups occasionally release their decryption keys. In any case, encrypted data\nthat has been saved can be revisited and potentially decrypted at a later date.\n\n## Monti Technical Analysis\n\n### Ransomware Behavior\n\nThe ransomware payload associated with this incident is a 32-bit Windows executable\nnamed “locker.exe.” At the time of writing this report, the malware is not publicly available.\nThe threat actor downloaded this payload from temp[.]sh via the Chrome browser.\n\nUpon execution, the malware encrypts files on disk, adds a “.PUUUK” extension to affected\nfiles’ names, and produces the following ransom note:\n\n\n-----\n\n_Figure 6a - Monti ransom note_\n\nThis ransom note is almost identical to the notes produced by some Conti ransomware\nvariants, except it references a “MONTI strain” instead of a “CONTI strain.”\n\n### Evaluating the Relationship Between Conti and Monti\n\n\n-----\n\nIn light of the Conti leaks that occurred in February and March 2022, we decided to explore\nany connections between the executable we identified, publicly available Conti payloads,\nand the leaked source code.\n\nBrief static analysis determined that our sample’s file name, file size, compile time, import\ntable hash, and most section hashes (with the exception of the .data section) match the\ncorresponding characteristics of the locker.exe [executable included in the Conti v3 code](https://www.virustotal.com/gui/file/e1b147aa2efa6849743f570a3aca8390faf4b90aed490a5682816dd9ef10e473)\nleaks. These observations provided strong evidence that the executable we found is, in fact,\na Conti v3 payload.\n\nFurther analysis of the leaked Conti executable revealed that, although the code within it\nwas identical to the sample we discovered, execution of the Conti payload did not actually\nresult in any file encryption.\n\nA review of the leaked locker.exe’s .data section provided insight into the nature of this\nexecutable, as seen in Figure 7.\n\n_Figure 7 - Strings within the leaked locker.exe Conti v3 payload_\n\nThe presence of the strings __DECRYPT_NOTE__, .EXTEN, and __publickey__\nsuggested that this file was intended as a template for a ransomware builder to generate\nfunctional payloads.\n\nAlthough the Conti v3 leak did not include the compiled ransomware builder or its source,\nthe Conti v2 leak did include the ransomware builder executable. Analysis of this\nexecutable confirmed that it was responsible for replacing the placeholder text mentioned\nabove with actual values.\n\nThe decompiler excerpt in Figure 8 shows code within the Conti v2 builder that locates the\ntext placeholders and replaces them with a generated RSA public key, RSA private key (for\ninclusion in the decryptor only) and ransom note text, respectively.\n\n\n-----\n\n_Figure 8 - Conti v2 builder decompiled code excerpt_\n\n### More Clues in the Timestamps\n\nAfter determining the origin of the payload file, we explored how the payload we found was\nlikely generated. The attacker could have compiled the leaked v3 source as the first step to\nproduce their payload. However, we suspect they took a different approach, because the\ncompile time of the ransomware payload we found matches the compile time of the leaked\nConti v3 locker.exe: Tue Jan 12 19:20:18 2021 UTC.\n\nIf the source code had been recompiled, this embedded timestamp would be more recent.\nThis timestamp is consistent with others embedded in each executable. It also aligns with\nthe time period when other Conti samples with the same import table hash (imphash 5036747C069C42A5E12C38D94DB67FAD) were first submitted to VirusTotal. These\nobservations suggest the timestamp was not manually stomped.\n\nIf the attacker did not recompile the available source code, we considered the possibility\nthat they had access to a Conti v3 builder to generate the payload. Since we do not have\naccess to a Conti v3 builder, we performed testing with the leaked v2 builder.\n\nWe built multiple payloads across a period of time and found that they all had the same,\nolder compile time of Tue Sep 15 20:17:05 2020 UTC. While this timestamp differed from\nour sample and the leaked executable, it confirmed the possibility that the Conti v3 builder\nmight also generate payloads with a consistent compile timestamp.\n\nIt might seem odd for a builder to maintain an old timestamp, but there is precedent for this\n[approach. The Babuk ransomware builder, leaked in June 2021, produces executables with](https://www.virustotal.com/gui/file/82e560a078cd7bb4472d5af832a04c4bc8f1001bac97b1574efe9863d3f66550)\nthe same compile time, regardless of when the payload is built. In contrast, the Yashma\n\n\n-----\n\n[ransomware builder, leaked in May 2022, generates executables that match the time the](https://www.virustotal.com/gui/file/f9a5a72ead096594c5d59abe706e3716f6000c3b4ebd7690f2eb114a37d1a7db)\n[build was created. (See our earlier blog posts for more information on Yashma and](https://blogs.blackberry.com/en/2022/05/yashma-ransomware-tracing-the-chaos-family-tree) [Babuk.)](https://blogs.blackberry.com/en/2021/12/threat-thursday-babuk-ransomware-shifts-attack-methods-to-double-extortion)\n\n### Is Monti Made With Manual Modification?\n\nWhile the discussion thus far might suggest that the Monti attackers used a non-public\nConti v3 builder, there is also reason to believe this was not the case. Instead, the attacker\nmight have manually modified (e.g., using a hex editor) the leaked Conti v3 locker.exe\nexecutable. To explain this theory, some additional background is required.\n\nOne difference between Conti v2 and v3 payloads is the format of the embedded ransom\nnote. In Conti v2 payloads, the ransom note text is stored as plaintext in the .data section of\nthe PE file. In Conti v3 executables, the ransom note is encrypted using the ChaCha8\nalgorithm.\n\n[D.J. Bernstein created this algorithm and threat actors implemented it in both Conti v2 and](https://cr.yp.to/chacha.html)\nv3 to encrypt files. In Conti v3, it’s also used to decrypt the instructions for payment.\n\nComparing the leaked v2 and v3 encryptor source code confirms that only v3 expects the\nransom note to be encrypted. In the leaked Conti v2 search.cpp source file (shown in Figure\n9 below), although there are several references to the word “Decrypt,” there is no actual\ndecryption performed before the ransom note is written to disk.\n\n_Figure 9 - Conti v2 search.cpp with no ransom note decryption_\n\nIn contrast, the leaked Conti v3 search.cpp source file (shown in Figure 10) includes code\nto perform ChaCha8 decryption:\n\n\n-----\n\n_Figure 10 - Conti v2 search.cpp with ransom note decryption_\n\nThe ChaCha8 algorithm uses a 32-byte key and an 8-byte nonce. A nonce, or number used\nonce, is similar to an initialization vector (IV). It is incorporated into the algorithm to add\nrandomness, so that using the same key to encrypt the same content produces different\nciphertext (i.e., it helps mitigate replay attacks).\n\n[The structure of the key, nonce, and encrypted text in a typical Conti v3 payload is shown in](https://www.virustotal.com/gui/file/3d8b6ccfcb742aeaac194c6a245ed08131a14919c4950039bf833c764e6d4f66)\nFigure 11 below. Only an excerpt of the ciphertext is shown.\n\n_Figure 11 - Typical Conti v3 payload with key and nonce_\n\nCompare the above values with the corresponding bytes in the payload we discovered,\nshown in Figure 12 below:\n\n\n-----\n\n_Figure 12 - Our payload with anomalous key and nonce values_\n\nAs you can see, both the key and nonce in this payload are zero-byte values. Just as the\nConti v2 builder dynamically generates the 4096-bit public RSA key before embedding it in\nthe payload, we would also expect the ransom note key and nonce values to be generated\nduring the build process.\n\nThis suggests that the attacker did not have access to the builder and instead manually\ninserted a ChaCha8 encrypted ransom note, file extension and RSA public key into the\nleaked Conti v3 locker.exe executable.\n\n### Detecting the Differences\n\nDue to the absence of a key and nonce, we crafted a signature to find samples that\nreference “MONTI.” In the payload discovered during this incident, the bytes 20 19 57 65 03\n_62 D0 AE F4 D1 68 are decrypted to “MONTI strain.”_\n\nSearching for these bytes on VirusTotal resulted in three files with the following SHA-256\nhashes:\n\nb45fe91d2e2340939781d39daf606622e6d0b9ddacd8425cb8e49c56124c1d56\n158dcb26239a5db7a0eb67826178f1eaa0852d9d86e59afb86f04e88096a19bc\n702099b63cb2384e11f088d6bc33afbd43a4c91848f393581242a6a17f1b30a0\n\nAll files have a VirusTotal imphash (import hash) value that matches the payload we found.\nAll files were also first submitted to VirusTotal in June 2022, the same month as the incident\nunder investigation.\n\nAmong the samples on VirusTotal with the imphash\n5036747C069C42A5E12C38D94DB67FAD, we did find [one more sample that did not have](https://www.virustotal.com/gui/file/48b8fbd9401a4ac8fe5239dd532b8502d5692e3450117438b7166f64b015ff6c)\na ChaCha8 key or nonce. It was first submitted to VirusTotal on 2022-04-26 20:13:02 UTC.\nHowever, the ransom note for this payload did not reference “MONTI” (or any “strain”), so\nthe connection with the Monti actor is unclear.\n\n### Veeam Credential Dumper\n\n\n-----\n\nDuring our investigation, we also found malware named veeamp.exe, with SHA-256 hash\n[9AA1F37517458D635EAE4F9B43CB4770880EA0EE171E7E4AD155BBDEE0CBE732.](https://www.virustotal.com/gui/file/9aa1f37517458d635eae4f9b43cb4770880ea0ee171e7e4ad155bbdee0cbe732)\nThis file attempts to dump credentials from a SQL database for Veeam backup\n[management software. (The credential dumper is briefly mentioned in this Symantec blog.)](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue)\n\nSome researchers associate this malware with Yanluowang ransomware. It is important to\nclarify that this credential dumper might have been used by threat actors that also deployed\nYanluowang ransomware, but veeamp.exe is not ransomware, and is only capable of\ndumping Veeam credentials.\n\nThe file is a 32-bit .NET binary. The code employs control-flow flattening, which is an\nobfuscation technique that makes it more challenging to understand the flow of execution.\n\nWhen launched, the malware attempts a connection to a SQL database named\nVeeamBackup. If it cannot connect to the specified database, no further action is taken.\nHowever, if a connection is established, the file runs the following command:\n\n_select [user_name],[password],[description] FROM [VeeamBackup].[dbo].[Credentials]_\n\nThe program then attempts to decrypt any user passwords that are returned by this\ncommand.\n\n[As discussed in this Veeam documentation, passwords can be encoded and/or encrypted](https://helpcenter.veeam.com/docs/agentforwindows/configurator/encryption.html?ver=50)\nusing several approaches, including simple base64 encoding, or through the use of\nMicrosoft’s [ProtectedData class.](https://docs.microsoft.com/en-us/dotnet/api/system.security.cryptography.protecteddata.protect?redirectedfrom=MSDN&view=windowsdesktop-6.0#System_Security_Cryptography_ProtectedData_Protect_System_Byte___System_Byte___System_Security_Cryptography_DataProtectionScope_)\n\nThe credential dumper uses these approaches to attempt decryption. If it’s successful, it\nprints to the screen the following information:\n\nUsername\nEncrypted password\nDecrypted password\nDescription for each user in the Credentials table\n\nIt prints this information in the following format:\n\n_user: {0} encrypted pass: {1} decrypted pass: {2} description: {3}_\n\nThe database name, SQL command, and output format string are all encoded in the\nexecutable, using a single-byte XOR key that varies for each string.\n\n[Two similar Veeam credential dumpers are currently available on VirusTotal (first link,](https://www.virustotal.com/gui/file/78517fb07ee5292da627c234b26b555413a459f8d7a9641e4a9fcc1099f06a3d)\n[second link). At the time of this writing, both have low detection rates (i.e., 15 detections or](https://www.virustotal.com/gui/file/df492b4cc7f644ad3e795155926d1fc8ece7327c0c5c8ea45561f24f5110ce54)\nless). Both files have similar code to the credential dumper we found, but they are also\nobfuscated with Eazfuscator.NET.\n\n\n-----\n\n### Conclusion\n\nWhile the activity of the Monti group itself seems to have been short lived, there is more we\ncan learn from its copycat techniques. As additional Ransomware-as-a-Service (RaaS)\nsolution builders and source code become leaked, either publicly or privately, we could\ncontinue to see these doppelganger-like ransomware groups proliferate.\n\nGeneral familiarity with the TTPs of known groups can help us identify any unique traits of\nthese lookalike crews. The more we can identify these unique traits, the better we will be\nable to associate known analysis methodologies with these new cases while keeping our\neye out for differences.\n\n### YARA Rule\n\nThe following YARA rules were authored by the BlackBerry Research & Intelligence Team\nto catch the threats described in this document:\n\n\n-----\n\nrule monti_ransom {\n\nmeta:\n\ndescription = \"Detects ChaCha8 encrypted 'MONTI Strain' text (using all-zero key\nand nonce) embedded in ransomware payload\"\n\nauthor = \"BlackBerry Threat Research Team\"\n\ndate = \"August 15, 2021\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0\n(https://www.apache.org/licenses/LICENSE-2.0) and open to any user or organization, as\nlong as you use it under this license and ensure originator credit in any derivative to The\nBlackBerry Research & Intelligence Team\"\n\nstrings:\n\n$s = {20 19 57 65 03 62 D0 AE F4 D1 68}\n\ncondition:\n\nuint16be(0) == 0x4d5a and filesize < 2MB\n\nand $s\n\n}\n\nrule veeam_dumper {\n\nmeta:\n\ndescription = \"Detects Veeam credential Dumper\"\n\nauthor = \"BlackBerry Threat Research Team\"\n\ndate = \"August 15, 2021\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0\n(https://www.apache.org/licenses/LICENSE-2.0) and open to any user or organization, as\nlong as you use it under this license and ensure originator credit in any derivative to The\nBlackBerry Research & Intelligence Team\"\n\nstrings:\n\n$s1 = \"SqlCommand\" fullword ascii wide\n\n$s2 = \"SqlConnection\" fullword ascii wide\n\n$s3 = \"SqlDataReader\" fullword ascii wide\n\n$s4 = \"veeamp.exe\" fullword ascii wide\n\n$s5 = \"veeamp.pdb\" fullword ascii wide\n\ncondition:\n\nuint16be(0) == 0x4d5a and filesize < 60KB\n\nand 4 of them\n\n}\n\n### Indicators of Compromise (IoCs)\n\n**\"MONTI” payload SHA-256 hashes:**\n\n1. b45fe91d2e2340939781d39daf606622e6d0b9ddacd8425cb8e49c56124c1d56\n2. 158dcb26239a5db7a0eb67826178f1eaa0852d9d86e59afb86f04e88096a19bc\n3. 702099b63cb2384e11f088d6bc33afbd43a4c91848f393581242a6a17f1b30a0\n\n**Veeam Credential Dumper SHA-256 hashes:**\n\n\n-----\n\n9aa1f37517458d635eae4f9b43cb4770880ea0ee171e7e4ad155bbdee0cbe732\ndf492b4cc7f644ad3e795155926d1fc8ece7327c0c5c8ea45561f24f5110ce54\n78517fb07ee5292da627c234b26b555413a459f8d7a9641e4a9fcc1099f06a3d\n\n### References\n\nMalwareHunterTeam. (2022). “Monti strain.” Retrieved from\nhttps://twitter.com/malwrhunterteam/status/1542595315915710465?\ns=20&t=Y7d3POTgnMSB_JcyEeF5_g\n\nMartire, Ragusa, & Mella. (2022). “Conti Ransomware Source Code: A Well-designed\nCOTS Ransomware.” Retrieved from https://yoroi.company/research/conti-ransomwaresource-code-a-well-designed-cots-ransomware/\n\n### BlackBerry Assistance\n\nIf you’re battling this malware or a similar threat, you’ve come to the right place, regardless\nof your existing BlackBerry relationship.\n\n[The BlackBerry Incident Response team is made up of world-class consultants dedicated to](https://www.blackberry.com/us/en/services/incident-response)\nhandling response and containment services for a wide range of incidents, including\nransomware and Advanced Persistent Threat (APT) cases.\n\nWe have a global consulting team standing by to assist you, providing around-the-clock\nsupport where required, as well as local assistance. Please contact us\nhere: https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incidentresponse-containment\n\n**Related Reading:**\n\n## About Anuj Soni\n\n\n-----\n\n**Principal Threat Researcher, BlackBerry**\n\n**[Anuj Soni is a Principal Threat Researcher at BlackBerry, where he performs malware](https://www.linkedin.com/in/sonianuj/)**\nresearch and reverse engineering. Anuj also brings his problem-solving abilities to his\nposition as a SANS Certified Instructor, which gives him the opportunity to impart his deep\ntechnical knowledge and practical skills to students.\n\n[As a co-author and instructor for Reverse-Engineering Malware and instructor for](https://www.sans.org/course/reverse-engineering-malware-malware-analysis-tools-techniques) Advanced\nDigital Forensics and Incident Response, Anuj emphasizes establishing goals for analysis,\ncreating and following a process, and prioritizing tasks. In addition to teaching SANS\ncourses, Anuj frequently presents at industry events such as the U.S. Cyber Crime\nConference, SANS DFIR Summit, and the Computer and Enterprise Investigations\nConference (CEIC).\n\nAnuj holds Bachelor's and Master's degrees from Carnegie Mellon University, and has\ncertifications in GIAC Reverse Engineering Malware (GREM) and as a EnCase Certified\nExaminer (EnCE) and Certified Information Systems Security Professional (CISSP).\n\n## About Ryan Chapman\n\n**[Ryan Chapman is Principal Incident Response & Forensics Consultant, BlackBerry.](https://www.linkedin.com/in/ryanjchapman/)**\n\nAs an author, instructor, and information security professional with over 18 years’\nexperience, Ryan runs and works incidents for clients to provide response, assessment,\nand training in the digital forensics and incident response (DFIR) realm at BlackBerry.\nHis primary case types involve digital forensics investigations (e.g. ransomware cases),\ncompromise assessments, business email compromises, tabletop exercises, and more.\nRyan loves the fact that the security industry is an ever-evolving creature.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-07 - The Curious Case of “Monti” Ransomware- A Real-World Doppelganger.pdf"
    ],
    "report_names": [
        "2022-09-07 - The Curious Case of “Monti” Ransomware- A Real-World Doppelganger.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536055,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1662984276,
    "ts_modification_date": 1662984276,
    "files": {
        "pdf": "https://archive.orkl.eu/d4eeaef76b55aad9117bf80aee278629b7a9550c.pdf",
        "text": "https://archive.orkl.eu/d4eeaef76b55aad9117bf80aee278629b7a9550c.txt",
        "img": "https://archive.orkl.eu/d4eeaef76b55aad9117bf80aee278629b7a9550c.jpg"
    }
}