{
    "id": "01b1496a-4b58-4531-9804-3ea6e4f8de0f",
    "created_at": "2023-01-12T15:05:51.374394Z",
    "updated_at": "2025-03-27T02:06:00.346333Z",
    "deleted_at": null,
    "sha1_hash": "64ac7b203226631896770e07c2efcbbeb344647b",
    "title": "2020-05-06 - Brazilian trojan banker is targeting Portuguese users using browser overlay",
    "authors": "",
    "file_creation_date": "2022-05-28T21:47:06Z",
    "file_modification_date": "2022-05-28T21:47:06Z",
    "file_size": 3591820,
    "plain_text": "# Brazilian trojan banker is targeting Portuguese users using browser overlay\n\n**[seguranca-informatica.pt/brazilian-trojan-banker-is-targeting-portuguese-users-using-browser-overlay/](https://seguranca-informatica.pt/brazilian-trojan-banker-is-targeting-portuguese-users-using-browser-overlay/)**\n\nMay 6, 2020\n\n**Brazilian trojan banker is targeting Portuguese users using browser overlay.**\nSince the end of April 2020, a new trojan has been affecting Portuguese users from several bank\norganizations.\n\nThe modus operandi of this piece of malware is not new in Portugal. At least since the year of 2014 that\nnew variants have been observed, with minor changes, and with the objective of collecting bank details\nof the victims.\n\n[One of the last occurrences was last December 2019, where the Lampion trojan operated in a very](https://seguranca-informatica.pt/targeting-portugal-a-new-trojan-lampion-has-spread-using-template-emails-from-the-portuguese-government-finance-tax/#.XrKhbahKhQA)\nsimilar way, changing only the way the malware was distributed (via AWS S3 buckets and with the first\nstage encoded in a highly obfuscated VBS file).\n\nThis new variant has been distributed via malscam campaigns that impersonate invoices from the\nVodafone group, as shown below.\n\nThe first stage of this malware is an MSI (Microsoft Installer) file that downloads the malware from a\ngoogle-sites server and deploys it in the Windows startup folder. After that, the infected computer is\nrestarted to make the trojan persistent.\n\nAfterward, the malware runs on the compromised machine, collecting sensitive data from browsers,\nincluding credentials for accessing bank portals. The malware can also obtain data on the clipboard and\nit contains keylogger features to collect everything the victims are writing and send the information to the\nC2 server.\n\n\n-----\n\nAs a way of obtaining banking details, when the malware detects that the victim is accessing a target\nhomebanking portal, it triggers a window overlaid on the browser simulating the legitimate system and\nrequesting additional details, such as credentials and SMS tokens.\n\nWhen malware initiates, it requests Google Drive documents for details on the C2’s IP address. This is a\nmechanism that makes C2 persistence and dynamics.\n\nThe number of victims in Portugal has increased significantly in recent weeks. The success of malicious\ncampaigns always depends on the starting point of infection: social engineering. In this sense, users\nshould be aware of emails of this nature and never click on email links or open attachments in case of\nsuspected malicious activity.\n\nFor more details on this finding see the Technical Analysis below.\n\n\n-----\n\n## Technical Analysis\n\nSince the end of April 2020, a new Trojan variant is affecting users from several bank organizations in\nPortugal. At first glance, the malware is originated from Brazil – based on artifacts collected during the\nanalysis.\n\nThe malware is disseminated via malspam campaigns – phishing emails distributed for a high range of\nusers and using a template that impersonates an invoice email from the Vodafone group.\n\n**h/t** [@DJ_PRMF](https://twitter.com/DJ_PRMF)\n\n**h/t** [@t14g0p](https://twitter.com/t14g0p)\n\n**_Figure 1: Phishing templates used to distribute the threat in Portugal._**\n\n\n-----\n\n[During Sl-LAB analysis, and also according to @t14g0p – a Portuguese security researcher, this](https://twitter.com/t14g0p)\nmalware is similar to other threats from Brazil observed in Portugal since 2014.\n\n[Lampion malware, for instance, was spread on end-December 2019 and took advantage of AWS](https://seguranca-informatica.pt/targeting-portugal-a-new-trojan-lampion-has-spread-using-template-emails-from-the-portuguese-government-finance-tax/#.XrCeF6hKhQA)\nbuckets to host the first stage and to download the files into the victim’s machine. One of the files was a\nDLL that exported functions to capture home banking credentials.\n\nThis new threat takes advantage of google-sites and Google Drive documents to distribute the threat in\nPortugal. The high-level diagram of this threat is presented below.\n\n**_Figure 2: Trojan banker high-level diagram._**\n\nThe trojan modus operandi is the following:\n\nThe user downloads a file after accessing the malicious URL available on the phishing email\n\n\n-----\n\nThe user extracts the .msi file from the zip file and executes it (1st stage)\nThe .msi file (the downloader) downloads the trojan malware from a google-sites domain and saves\nit into the Windows startup applications folder, thus ensuring that the malware will be executed\nwhenever the user login in the system (2nd stage)\nThe malware process starts, which in turn communicates with google docs to read the contents of 3\ndifferent documents. These documents contain the configuration of C2 addresses and a bitcoin\naddress\nThe malware is running and monitoring the user’s actions and periodically requesting commands\nfrom the command and control (C&C) server\nBrowser overlay is performed in order to collect banking credentials when the victim accesses\nspecific homebanking portals.\n\n## Initial infection – the zip file (1st stage)\n\n**Threat name: FATURA34109093137173917200003123.zip**\n\n**MD5: 4410f53446fe6784f904a75df57e7ad7**\n\n**SHA1: 814525924cd65f488348e921c1ca23a7da0085b5**\n\n**First submission VT: 2020-05-02 01:32:12**\n\nAfter analyzing the compromised server distributed along with malspam email, two zip files with different\nnames – in distinct directories – were observed. The reason why two paths were identified on the server\nis simple: the threat is the same but used in different phishing campaigns.\n\n**_Figure 3: Trojan banker .zip file (1st stage) downloaded from the compromised server._**\n\nAfter executing the .msi file, the 2nd stage is downloaded from the google-sites server.\n\n\n-----\n\n**_Figure 4: 2nd stage downloaded from the google-sites server._**\n\nNext, the trojan is deployed into the Windows startup folder (a .zip file with an arbitrary name –\n**jmccnJJi.zip – with the PE file inside). Finally, the PE file – the trojan – is dropped in the same folder**\n(fZpoAruv.exe).\n\n\n-----\n\n**_Figure 5: The 2nd stage (fZpoAruv.exe) is deployed on the Windows startup folder._**\n\nWhen the .msi installation ends, the victim’s computer is rebooted to make the malware persistent. The\nmalware starts whenever the victim login in the system.\n\n## Trojan banker (2nd stage)\n\n**Threat name: fZpoAruv.exe**\n\n**MD5: dc61d6239c2848bf8994df95740cbb13**\n\n**SHA1: 7eb6088157f3fbc0a758c4402c563bdfe1e91ee2**\n\n**First submission VT: 2020-05-03 07:35:06**\n\n[In detail, the malware was developed in Delphi as usual in threats from Brazil. The Embarcaredo IDE](https://www.embarcadero.com/br/)\nwas used to support its development.\n\n**_Figure 6: Delphi and Embarcadero were used by crooks to develop the trojan._**\n\nDelphi and Embarcadero have been used by Brazilian criminals to develop new malwares. Inside the\ntrojan is possible to identify several Portuguese words, allowing to confirm its origin.\n\n**PORTUGUESE, ENGLISH, NEUTRAL**\n\n\n-----\n\n**_Figure 7: Languages detected by analyzing the source-code._**\n\nAs a way of preventing malware from running on virtual machines (VM-Protect) and analyzing it (antidebug/reverse), the well-known packer Armadillo was used to make the Trojan protected.\n\n**_Figure 8: Packer Armadillo 6.X-9.X used to protect the malware._**\n\nThis type of protection makes it hard to analyze. As noted below, the malware has some calls in the IAT\nrelated to VM protection mechanisms.\n\n\n-----\n\n**_Figure 9: VM protect calls present in the IAT._**\n\nIf the malware detects it is running inside a virtual machine, it kills the process itself and removes itself\nfrom the Windows startup folder.\n\nPackers and protectors like Armadillo are used to protect code, including malware, as they allow to add\nan extra layer against reversing and anti-VM.\n\nContinuing with the analysis, during the malware execution mutex were created in the system, a\nmechanism often used to avoid a new infection.\n```\n\"RAL1DAED25C\"\n\"1DAED25C::WK\"\n“8D8CE7A22019”\n\n```\n**_Figure 10: Mutex created during malware execution._**\n\nThe trojan also checks some registry keys to identify whether it is running inside a VM:\n```\nHKEY_LOCAL_MACHINE\\HARDWARE\\DESCRIPTION\\System name: SystemBiosDate\nHKEY_LOCAL_MACHINE\\HARDWARE\\DESCRIPTION\\System name: SystemBiosVersion\n\n```\nSQL queries to detect VMs were also observed when we analyzed the malware.\n\n\n-----\n\n```\nSELECT FROM Win32_ComputerSystem WHERE (Manufacturer LIKE %VMware% ) Or (Manufacturer\nLIKE'%innotek%') Or (Manufacturer LIKE'%Microsoft%') Or (Manufacturer LIKE'%RingCube%')\n\n## Digging into the details\n\n```\nAs observed below, the initial sections of the trojan are empty, with raw size at zero. These are unusual\nsections, furthermore, there are two sections of the binary with execution privileges.\n\n**_Figure 11: Unusual PE file sections._**\n\nThis PE file has 16 sections, much more than normal ~10 sections.\n\nAn interesting detail is that one of the sections: .pdata has an entropy of 8. This indicator corroborates\nthat this section is packed. This detail can be observed on the next Figures.\n\n**_Figure 12: .pdata section highlighted is packed with entroty = 8._**\n\nIn the PortEx graphic below, it’s possible to see some details already mentioned. A great part of the PE\nfile is packed (0.0 – light gray), and the other part has code repetition (0.2 dark gray). The dark gray\nregion is related to the PE file empty sections.\n\n\n-----\n\n**_Figure 13: Trojan banker PortEx graphic._**\n\n## IAT – Keystrokes, clipboard and browser overlay\n\nFrom the IAT analysis, calls used to get key states are observed. This is a feature of this malware:\ncapture keystrokes and send the information onto the C2 server. Also, functions to manage the clipboard\nwere identified.\n\n**_Figure 14: Calls used to collect data from clipboard and key states._**\n\nAnother feature of this malware is to create windows overlaid on the browser when the victim navigates\nto a homebanking portal (browser overlay).\n\n\n-----\n\nAdditional artifacts of a specific Portuguese bank organization were found. Next Figure presents target\nmessages hardcoded and used to create the overlay window during malware execution.\n\n**_Figure 15: Target message hardcoded inside the malware._**\n\nThis targeted message, in particular, is displayed in a Delphi overlay window when the victim accesses\nthe target homebanking. Next, another message this line hardcoded, now about another bank.\n\n\n-----\n\n**_Figure 16: Hardcoded message inside trojan._**\n\nIn detail, by building the Delphi source-code, obtaining all the overlay windows is possible.\n\n**_Figure 17: Browser-overlay windows hardcoded inside the malware._**\n\nLooking at the Figure and the “Picture.Data” object in particular, it is base16 encoded, aka hex. The\n“Picture.Data” property data starts with a UTF-8 encoded ShortString containing the name of the\nTGraphic-derived class that produced the image data. In this case, that class name is encoded as:\n**0954506E67496D616765.**\n\nThe first byte (hex 09) is the number of bytes in the class name (9), the following 9 bytes (hex 54 50 6E\n67 49 6D 61 67 65) are the UTF-8 octets of the class name (TPngImage), and the remaining stream\nbytes are the actual PNG image data.\n\n\n-----\n\nBy ignoring this header, obtaining all the browser-overlay windows from the Delphi code is possible.\n\n## Details inside malware (browser-overlay)\n\nNext, the browser-overlay windows created during malware execution are presented.\n\n**_Figure 18: Browser overlay: Security mode installation and data collector._**\n\n**Affected groups**\n\nWhenever the application detects the victim is accessing a homebanking portal, it launches one of the\nfollowing windows on the screen, maximized, and requesting the victim’s details.\n\n\n-----\n\n**_Figure 19: Delphi form parameters (Width, Height and Maximized)._**\n\n**_Figure 20: Browser overlay windows (1)._**\n\n\n-----\n\n**_Figure 21: Browser overlay windows (2)._**\n\n**_Figure 22: Browser overlay windows (3)._**\n\n\n-----\n\n**_Figure 23: Browser overlay windows (4)._**\n\n## Communication with C&C server (C2)\n\nThe malware communicates with the C2 server in order to receive additional commands and to send the\nexfiltrated information from the victim’s machine.\n\nTo communicate with C2, the malware uses 3 Google Drive documents, where the addresses of the C2\ncontrolled by criminals are available and encoded. With this approach in place, the C2’s IP addresses\ncan be changed at any time.\n\nOn the other hand, removing google doc files from the cloud is a potential kill switch for this malware.\n\nAccording to a [@t14g0p](https://twitter.com/t14g0p) [publication on his website,](https://malware.pt/posts/banker_google_docs/)\n\n_Google docs URLs, like other critical strings, are obfuscated and are unobfuscated and stored in a_\n_global variable during the initialization process. After obtaining the URL, a function responsible for_\n_reading the google docs document and extracting the content between the strings “start =” and “=_\n_end” is called. This content is finally passed to a function that decrypts it and is later stored in a_\n_global variable that stores the C2 address._\n\nWe can confirm the exact time the docs are accessed below.\n\n\n-----\n\n**_Figure 24: Traffic network when the trojan gets the C2 IP address from Google docs._**\n\nBy analyzing the memory of the compromised machine, it is possible to verify that the malware, once\nunpacked, communicates with 3 Google Docs documents to obtain the IP addresses of C2 and also a\nbitcoin address of a wallet with recent transactions.\n\n**Collected URLs from memory:**\n```\nhttps://docs.google.]com/document/d/1hp6jZYnlZAtMZgIpw2YGyciS1qxck-OUPteOw9sFhX0/edit\nhttps://docs.google.]com/document/d/10Yx33pplUYa46H45-r7JrdKsUMgeXcxMn2_AABUrsfE/edit\nhttps://docs.google.]com/document/d/1-NZxqAKYFK-c1c_80VjLHfhLNlb8cK5u-jy-5VSeOto/edit\n\n```\n**Request and response from Google Docs (memory snippet):**\n\n**_Figure 25: Encoded string (C2 IP address) obtained from Google Docs URL._**\n\nDuring the memory analysis, also the key used to decode the string obtained from Google Docs was\ncollected.\n\n\n-----\n\n**_Figure 26: Key used in an XOR function to decode the Google Docs strings._**\n\n**Key:**\n```\nqazxs441wert41080gbnhyujmuikolpçPOIU400941979418YTREWQASDFGH52421354JKLÇMNBVCXZ098765ASJRUQ4OQ4JO\n[email protected]\n\n```\n[The following code, distributed by @t14g0p, is a python implementation to decrypt the strings from](https://twitter.com/t14g0p)\ngoogle documents.\n\n**h/t** [@t14g0p](https://twitter.com/t14g0p)\n\n**Encoded string: work3**\n\n**Decoded string: inicio= E86AFC51FA58A4E62D1324242C6B =fim**\n\n**Result: 23.108.57.243**\n\n**Encoded string: work2**\n\n\n-----\n\n**Decoded string: inicio= E86AFC51FA58A4E62D1324242C6B =fim**\n\n**Result: 23.108.57.243**\n\n**Encoded string: btc**\n\n**Decoded string:**\ninicio= C587DE50CC66FB0175C84BDE6491CA20AC2FE256C746CE3DE175B365D424022C638498 =fim\n**Result: 18KdHi9CJea1AjEtrVQSfqyN6QXZvJZXqS**\n\nIn detail, the [bitcoin wallet was used in recent transactions, last: 2020-01-14 00:22h. However, no](https://www.blockchain.com/btc/address/18KdHi9CJea1AjEtrVQSfqyN6QXZvJZXqS)\nmalicious activities related to bitcoin was identified during the trojan analysis.\n\n\n-----\n\n**_Figure 27: Bitcoin wallet and transactions – address also available on Google Docs and hardcoded_**\n_inside trojan._\n\n[By using Shodan – The search engine for IoT – some details about C2 were collected.](https://www.shodan.io/)\n\n\n-----\n\n**_Figure 28: Trojan C2 server RDP port._**\n\nDuring the execution of the malware, it was identified that it communicates with another address (the\ncompromised server from where the payloads were initially downloaded).\n\nAfter a few minutes of collecting information about the infected machine, the trojan sends encrypted\ncommands onto this server.\n\n\n-----\n\n**_Figure 29: Communication with control panel._**\n\nThis is a PHP service, probably a control panel to manage the victims and collect details on infections.\n\nIn this specific request, and based on the path, the trojan sends details about which antivirus is installed\non the victim’s machine.\n\nMalicious endpoints are still active at the moment of writing this report (05-05-2020).\n\n## Mitre Att&ck Matrix\n\n Thank you to all who have contributed:\n\n[Tiago Pereira @t14g0p](https://twitter.com/t14g0p)\n\n[Corsin Camichel @cocaman](https://twitter.com/cocaman)\n\n[Pedro Fernandes @DJ_PRMF](https://twitter.com/DJ_PRMF)\n\n## Indicators of Compromise (IOCs)\n\n\n-----\n\n```\n sample\nMD5: dc61d6239c2848bf8994df95740cbb13\nhttps://sites.google.]com/site/xbet362/control.zip\nhttps://vodafone-pt.]ciscofreak./com/my/\nhttps://vodafone-pt.]ciscofreak./com/nf/\n--C2-23.106.124.]20\n23.108.57.]243\nhttp://23.106.124.]20/avs/img1/index.]php\n--google-docs-https://docs.google.]com/document/d/10Yx33pplUYa46H45-r7JrdKsUMgeXcxMn2_AABUrsfE/edit\nhttps://docs.google.]com/document/d/1hp6jZYnlZAtMZgIpw2YGyciS1qxck-OUPteOw9sFhX0/edit\nhttps://docs.google.]com/document/d/1-NZxqAKYFK-c1c_80VjLHfhLNlb8cK5u-jy-5VSeOto/edit\n--BTC_ADDR-18KdHi9CJea1AjEtrVQSfqyN6QXZvJZXqS\n\n## Sandbox online analysis\n\n```\nhttps://www.virustotal.com/gui/file/3701d539821e5e68891d72cc1dd54f6ead592c3e277e92a4349f99b82\ne0cbcd3/detection\n\nhttps://www.hybrid[analysis.com/sample/421d6d28978d687aee62ef539d4c2d24e9e4d2b0d74c70c2856d8f978e538d5a/5eb](https://www.hybrid-analysis.com/sample/421d6d28978d687aee62ef539d4c2d24e9e4d2b0d74c70c2856d8f978e538d5a/5eb163ce3c3c05767b1bcc69)\n163ce3c3c05767b1bcc69\n\n[https://www.joesandbox.com/analysis/227588/0/html](https://www.joesandbox.com/analysis/227588/0/html)\n\n[https://analyze.intezer.com/#/analyses/92fad8e8-a756-4a70-8a7f-3c0098cc200a](https://analyze.intezer.com/#/analyses/92fad8e8-a756-4a70-8a7f-3c0098cc200a)\n\n## Yara rule\n\n[GitHub SI-LAB Yara repository here.](https://github.com/sirpedrotavares/SI-LAB-Yara_rules)\n\n## References\n\n[https://malware.pt/posts/banker_google_docs/](https://malware.pt/posts/banker_google_docs/)\n\n[https://twitter.com/sirpedrotavares/status/1256619456060669952](https://twitter.com/sirpedrotavares/status/1256619456060669952)\n\n[https://tugatech.com.pt/t33136-novo-ransomware-propaga-se-sobre-faturas-falsas-da-vodafone](https://tugatech.com.pt/t33136-novo-ransomware-propaga-se-sobre-faturas-falsas-da-vodafone)\n\n[Pedro Tavares](https://seguranca-informatica.pt/author/pipocaz/)\n**[Pedro Tavares is a professional in the field of information security working as an Ethical](https://www.linkedin.com/in/sirpedrotavares/)**\nHacker/Pentester, Malware Researcher and also a Security Evangelist. He is also a founding member at\n[CSIRT.UBI and Editor-in-Chief of the security computer blog seguranca-informatica.pt.](https://seguranca-informatica.pt/)\n\nIn recent years he has invested in the field of information security, exploring and analyzing a wide range\nof topics, such as pentesting (Kali Linux), malware, exploitation, hacking, IoT and security in Active\nDirectory networks. He is also Freelance Writer (Infosec. Resources Institute and Cyber Defense\n[Magazine) and developer of the 0xSI_f33d – a feed that compiles phishing and malware campaigns](https://feed.seguranca-informatica.pt/)\ntargeting Portuguese citizens.\n\n\n-----\n\n[Read more here.](https://seguranca-informatica.pt/contacto/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-06 - Brazilian trojan banker is targeting Portuguese users using browser overlay.pdf"
    ],
    "report_names": [
        "2020-05-06 - Brazilian trojan banker is targeting Portuguese users using browser overlay.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535951,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653774426,
    "ts_modification_date": 1653774426,
    "files": {
        "pdf": "https://archive.orkl.eu/64ac7b203226631896770e07c2efcbbeb344647b.pdf",
        "text": "https://archive.orkl.eu/64ac7b203226631896770e07c2efcbbeb344647b.txt",
        "img": "https://archive.orkl.eu/64ac7b203226631896770e07c2efcbbeb344647b.jpg"
    }
}