{
    "id": "01d98868-bff5-4f85-a0c3-2a3ea5c40228",
    "created_at": "2023-01-12T15:10:19.659669Z",
    "updated_at": "2025-03-27T02:16:01.157928Z",
    "deleted_at": null,
    "sha1_hash": "e4ef437ab9678f005b823f757607375e0a9c3b87",
    "title": "2019-04-15 - Cobalt Strike. Walkthrough for Red Teamers",
    "authors": "",
    "file_creation_date": "2022-05-28T15:14:48Z",
    "file_modification_date": "2022-05-28T15:14:48Z",
    "file_size": 6059875,
    "plain_text": "# Cobalt Strike. Walkthrough for Red Teamers\n\n**[pentestpartners.com/security-blog/cobalt-strike-walkthrough-for-red-teamers/](https://www.pentestpartners.com/security-blog/cobalt-strike-walkthrough-for-red-teamers/)**\n\nBlog: Red Teaming\n\nNeil Lines 15 Apr 2019\n\n## What is Cobalt Strike?\n\nRaphael Mudge is the creator of Cobalt Strike (CS), around 2010 he released a tool titled\nArmitage, which is described by wikipedia as a graphical cyber-attack management for the\n[Metasploit Project, to put this more bluntly, Armitage is a gui that allows you to easily](https://en.wikipedia.org/wiki/Metasploit_Project)\nnavigate and use MSF.\n\nFast forward to 2012 and Raphael released Armitage’s big brother: Cobalt Strike, what was\ninitially perceived as an enhanced version of Armitage, would a few years later become\nregarded as one of the most used command and control or as it’s commonly referred to as a\nC2 in red teaming today.\n\nRaphael is a legend in the industry, search for his name on YouTube alone, and you will find\nover 180+ videos. And he is someone I have personally looked up to in the sec world for\nmany years.\n\nQuick note, IT security did not invent the term red team or C2, we have borrowed these\nterms from the United States Army, which is referenced in 1999 as using the word C2 in a\nreleased field manual.\n\nSo, what’s this blog all about then? Well initially I thought it would be great to write a blog,\nshowing people how to get a trial version of CS, install and test it out in your own lab, but I\nmust admit I did start to waver half way through, and question why am I writing this, Raphael\nhas released a YouTube video for nearly every function, problem, and question you may ever\nhave with CS, the freely available support is second to none, but then I thought, well it’s nice\nto research and write something from a fresh prospective, and secondly from a more selfish\n\n\n-----\n\npoint, repeating what we have learned helps ourselves to learn more. I will admit going back\nand testing with the trial version of CS has taught me more, and I hope this blogpost is also\nof use to others.\n\nRight dull intro over, let’s get hacking!\n\nIngredients required for this recipe.\n\n1 x Trial copy of Cobalt Strike\n1 x VMware or Virtualbox for the lab\n1 x Copy of Kali\n1 x Copy of Windows 7 or 10, both if you can afford the RAM\n\nThe following ingredients can be sourced from the directly below links.\n\nCobalt Strike Trial – https://trial.cobaltstrike.com/\nVirtualbox – https://www.virtualbox.org/wiki/Downloads\nKali – https://www.offensive-security.com/kali-linux-vm-vmware-virtualbox-imagedownload/\nWindows VM/VB Images – https://developer.microsoft.com/en-us/microsoftedge/tools/vms/\n\n## Index\n\n How to start\n\nBack To Index▲\n\nTo download your twenty one day CS trial browse the following link\n[https://trial.cobaltstrike.com/ you are required to complete a form and submit a legitimate](https://trial.cobaltstrike.com/)\nemail address (unfortunately google, yahoo and other free mail providers are not accepted)\nyou also need to provide a postal address, for this I requirement I used my employers\naddress.\n\nAlso worth noting, Raphael is a busy person, so don’t expect to submit your details and get a\ntrial copy that second, as a reference I submitted for a trial copy and it took three days till I\ngot an email with the download link.\n\n\n-----\n\nSo, once you receive your download link, what do you do? I will be honest the process\nfollowing is so simple it will surprise you.\n\nClick (or copy and paste the hyperlink to the download files, into your browser of choice) the\nhyperlink. You must then accept the end user licence, followed by choosing your download\nflavour.\n\nThis post is based on the Linux version, but I must admit the idea of running CS in Windows\nhas caught my attention. I may write a follow-up covering that, but for now we’ll go with\nLinux:\n\n\n-----\n\nFollowing clicking “Download Cobalt Strike” now!” you will receive the following file in your\nselected download directory:\n\nNow, wove the compressed file over to Kali Linux:\n\nTo access the contents of the compressed file, simply double click it, and after it open define\nyour chosen location to extract the contents there:\n\n\n-----\n\nFollowing the extraction, you can then cd to the containing files via terminal.\n```\n[email protected]:~/Desktop# cd cobaltstrike/\n\n```\nTo view the contents of the directory run the ls command.\n```\n[email protected]:~/Desktop/cobaltstrike# ls\nagscript cobaltstrike   icon.jpg   peclone   releasenotes.txt third-party \nupdate.jar c2lint  cobaltstrike.jar license.pdf readme.txt teamserver    \nupdate\n\n```\nHere’s the contents of the extracted CS directory:\n\nThe first requirement is to start the Cobalt team server, this is the C2 server were all\ncompromised targets will beacon back to, and secondly it is where you also connect to for\nmanagement and control of compromised targets.\n\nTo start your CS team server run the following command.\n```\n[email protected]:~/Desktop/cobaltstrike#./teamserver IP-address-of-your-server Yourselected-password\n\n```\nThe screenshot below shows an extract the CS team server been started for the first time,\nyou will note that the trial is defined to twenty one days and that the EICAR string is added to\nany traffic sent via the malleable profile, the trial is for lab use only, with regards to malleable\nprofiles, this will be detailed later in the blogpost.\n\n\n-----\n\nNow you are now ready to start the CS client, which provides the user with GUI control to\nconnect and manage their team server.\n\nTo start the CS client simply run\n```\n[email protected]:~/Desktop/cobaltstrike#./cobaltstrike\n\n```\nFollowing click OK you will be prompted to create a connection profile, for the host IP\naddress, you can type in loopback address or if the team server is not locally hosted type in\nan IP address. The port you can tweak and in real world it should be, you can add your own\nusername but the default one of Neo is great, love the reference to Matrix! And finally, the\ncorresponding password as defined when you started the team server:\n\n\n-----\n\nAfter hitting Connect for the first time you will be prompted to verify the hash, this\nreferences the hash created while starting the team server, check it matches, then click Yes:\n\nAnd that’s it from downloading to starting, you will now have a running trial version of Cobalt,\nno messing around, no installing stuff, its’ all very simple and clean:\n\n## Testing CS in a lab\n\nBack To Index▲\n\nAnd now the games begin\n\nSo, you want to test CS out, so how do you do it? first off spin up a Windows VM you can opt\nfor a Windows 7 or 10 host. This VM will become your target machine, which you will run CS\npayloads in.\n\nI would recommend while your VM is downloading, spinning up, updating or whatever its\ndoing, you should take a look at the taskbars on the top of you CS client GUI, click on the\noptions, it’s a trial version so even if you brake it (Which I suspect you won’t, as its very\nstable), just start again.\n\n\n-----\n\nQuick note – This would be a good point to take a snapshot of your kali VM or VB.\n\n**Give me the shells!**\n\nYep I get it, you most likely just want to see the raining shells, right so let’s get to the fun part.\nTo create your first payload, right click on Cobalt Strike top left, and select Listeners, this\nallows you to define, were your targets can dial back to:\n\nClicking Listeners will prompt you to fill in your requirements for this new listener, add the IP\naddress of your team server, required port and click save:\n\nIf you wish to Wireshark, your traffic I would recommend you opt for port 80 HTTP over\nHTTPS which by default will encrypt all your traffic flows.\n\nWhile setting up the listener you will be prompted for a domain, for internal lab use you can\nuse an IP address, while on an offensive engagement you would replace your defined IP\naddress with a domain of choice:\n\n\n-----\n\nAfter clicking OK and saving your listener parameters you will see a tab at the bottom open,\nwhich details your listener settings:\n\nYou are now ready to create the payload. CS comes with an extensive payload creation\noffering, it covers nearly all commonly used techniques, and are incredibly simple to create,\nunfortunately (or fortunately depending on your view point), all common antivirus software\nhas a signature for each one of the available payloads, in addition to this, the trial version of\nCS also injects the EICAR string into the payload, but for a trial lab, you can still use them,\nsecondly you can use other provider solutions such as Dave Kennedy’s amazing unicorn\nwhich will take the CS generated payload and obfuscate the code, which will increase your\nchance of the payload bypassing AV, this more advanced payload process will be covered\nlater in the blogpost.\n\nTo create your first CS payload, click on Attacks / Packages / Payload Generator:\n\nSelect the listener you wish the payload to dial back to, followed by the output format. For\nthis demo the PowerShell Command has been opted for:\n\n\n-----\n\nIt creates a single PowerShell one liner, which can be copied in to a CMD or PS terminal\nthen run. This payload can also be placed into a .bat file and used as an OLE attack, which I\nmay cover later on in this post.\n\nAfter clicking generate you will be prompted for a location to save the payload to:\n\nOnce you have downloaded the payload, open it using gedit or your preferred editor:\n\nNote – I have seen formatting issues when using nano and the such to copy and paste\npayloads.\n```\n[email protected]:~/Desktop/cobaltstrike# gedit /root/Desktop/Payloads/payload.txt\n\n```\nHighlight all of the payload text Ctrl+a, then copy it Ctrl+c and move it across to your\nWindows machine, then open CMD and paste Ctrl+v it in, finally press enter:\n\n\n-----\n\nA few seconds later you should see the windows machine dialling back and you should\nreceive your session:\n\nIt is worth noting at this point the use of the * after the user name parameter, this reveals that\nthe session is running in an elevated position with system rights. Typically you would not gain\naccess to such a position from your initial foothold, but for lab use it doesn’t harm to start at\nthis level.\n\nTo be able to send any commands to the target you are require to enable interact mode, to\ndo this click on the chosen target and select Interact:\n\nThis will open a new tab and you can then input your desired commands next to the beacon\nprompt:\n\n\n-----\n\nDuring a red team engagement, you control the rate that you communicate to and from the\ntarget host, typically you slow this communication down, in an aim to reduce the chances of\nyour flows been spotted by the blue team, but while working in a lab environment, you may\nfind the slow responses to requests frustrating, and as such you can set the beacon to\nrespond instantly by typing in sleep 0 and pressing enter:\n\nSecondly all cmd / powershell commands can be used natively within beacon, but you do\nrequire to append the word “shell” before to enable beacon to understand your request.\n\nThe screenshot directly below shows the command error resulting from an attempt to run the\ncmd command “ipconfig” without appending the word shell before it:\n\nRepeating the above command request but this time appending the word ‘shell’ before it\nresults in the command being sent to the target machine and the responding reply being\nreceived as can be seen in this screenshot:\n\n\n-----\n\nWhile initially having to use the shell command feels unnatural, you quickly become used to\nit.\n\n## Useful Basic CS commands\n\nBack To Index▲\n\n**Screenshot**\n\nThe screenshot function allows you to take a snapshot of the target’s desktop, you should\nbecome comfortable using this function, as targets often leave open spreadsheets, outlook\nmails, and it’s not unheard of to spot a useful username or even a password via a screenshot\non an active engagement.\n\nTo take a screenshot of a targets desktop right click on the machine in question and Explore /\nScreenshot or alternatively just type screenshot in the beacon prompt and press enter:\n\nAll commands and additional data that is collected by CS such as the screenshot jpg files are\nstored in the active log’s directory, which in this example was located at\n/root/Desktop/cobaltstrike/logs/190329/192.168.1.20/screenshots:\n\n\n-----\n\nThere is a misconception that CS is very GUI driven, it can be, but attentively if you wish you\ncan use the command prompt as equally, it is down to user preference on how they wish to\nuse it.\n\n**Process List**\n\nTo view the targets running process list, right click on the host, Explore / Process List:\n\nA tab will open detailing the running processes:\n\n\n-----\n\nIf you want to inject into another process and have system rights on the target host, highlight\nthe process you want to inject into, following this you will then be prompted to define the\nlistener, select the desired one and click Inject:\n\nBelow shows the result of injecting into a different process, a new session is started on a\ndifferent PID, this can be useful for temporary resilience, as if the initial process is closed\nyour secondary one should still be active.\n\n**Hashdump**\n\n\n-----\n\nSeems some commands from MSF have still survive ;0) typing hashdump when run with\nsystem privileges results in the targets hashes been collected and presented as can be seen\nin this screenshot:\n\n## To kill an implant\n\nBack To Index▲\n\nYou can remove a target once you have finished with it by performing the following process.\n\nClick on Session / Exit:\n\n…or alternatively via beacon interact with the target you wish to remove and type exit:\n\nYou can now remove the target from your CS client window, simply click Session / Remove:\n\n\n-----\n\n…and the target is gone:\n\n## Unicorn and Cobalt payloads\n\nBack To Index▲\n\nLet’s go deeper\n\nSo, say you want to simulate a more sophisticated payload creation technique?\n\nThere are a few options but the quickest is trustedsec’s unicorn\nhttps://github.com/trustedsec/unicorn\n\nQuick note: Unicorn, as listed on the git hub page “Unicorn is a simple tool for using a\nPowerShell downgrade attack and inject shellcode straight into memory.”\n\nPersonally, I have used it for a few years, and I will happily say I’m a fan of it, but and there\nalways is a small but, with every other update or so the odd thing does brake, before anyone\ncomplains, unicorn is free, it’s amazing and the level of support / commitment David Kennedy\nand his team put into it is incredible.\n\nA neat tip I learned recently (respect to @ZephrFish for this tip) is, if you suspect the version\nof unicorn you are using is broken in some way, you can download the previous versions\n[here https://github.com/trustedsec/unicorn/releases an example of this is as such, version](https://github.com/trustedsec/unicorn/releases)\n3.6.8 to v3.6.11 looks to no longer support windows 7, which is not ideal due to mass support\nof this aging OS is still prevalent, now while the support for unicorn have been informed of\nthis https://github.com/trustedsec/unicorn/issues/118 and I suspect the next release will\n\n\n-----\n\naddress this, but for this next blog section, if you wish to use windows 7 as a target, you will\nhave to opt for unicorn version 3.6.7 https://github.com/trustedsec/unicorn/releases/tag/3.6.7\nfor it to work.\n\nBelow details how to git clone the most recent version of unicorn\n```\n[email protected]:~/Desktop# git clone https://github.com/trustedsec/unicorn.git\nCloning into 'unicorn'...\nremote: Enumerating objects: 50, done.\nremote: Counting objects: 100% (50/50), done.\nremote: Compressing objects: 100% (22/22), done.\nremote: Total 538 (delta 30), reused 47 (delta 28), pack-reused 488\nReceiving objects: 100% (538/538), 271.34 KiB | 723.00 KiB/s, done.\nResolving deltas: 100% (349/349), done.\n\n```\nThe following will detail how to use unicorn with CS.\n\nMove into the unicorn directory\n```\n[email protected]:~/Desktop# cd unicorn/\n\n```\nReview all files in the directory.\n```\n[email protected]:~/Desktop/unicorn# ls\nCHANGELOG.txt CREDITS.txt LICENSE.txt README.md templates unicorn.py\n\n```\nTo run unicorn in its default syntax, which will result in a response showing all possible\ncommands\n```\n[email protected]:~/Desktop/unicorn# ./unicorn.py\n\n```\n**CS and Unicorn Macro Fun**\n\nThe following section details using Unicorn with a C# CS payload to make a VBA office\nmacro with an increased chance of bypassing AV.\n\nFor lab use I opt to use Office 2010, this version of office is still a widely used flavour in the\nwild and as such makes a good base of testing.\n\nBy default, the office ribbon does not show the developer tab, this is required for the creation\nof macro’s and as such the following directly below section details how to enable the\ndeveloper tab.\n\nOpen MS word and go to File / Options / Customise Ribbon – and make sure the developer\ntab is ticked under Customise Ribbon:\n\n\n-----\n\nAn alternative way to enable the developer tab is to right click on any space on the ribbon,\nand select Customize the Ribbon, and tick Developer:\n\n\n-----\n\nTicking the developer function and saving the profile should now enable you to see the\ndeveloper tab on the end of the ribbon:\n\nClick on the Developer tab, then on Visual Basic:\n\nThis will start Visual Basic for Applications (VBA), right click on ThisDocument / Insert /\nModule, to create the Modual1 (Code) area:\n\n\n-----\n\nThis will create the Document1 – Module1 (Code) area, this will be were you paste your\nCobalt Strike / Unicorn VBA Macro into:\n\nIt is very simple to make the C# payload which is required as the base of your macro payload\nin CS, the following section details this process.\n\nClick on Attacks / Packages / Payload Generator.\n\n\n-----\n\nSelect your Listener and set output to C#:\n\nSave the payload in its default format of payload.cs:\n\nCS will prompt you to where it has been saved:\n\n\n-----\n\nNow take a note of the payload location and move over to terminal and move into the unicorn\ndirectory, while referencing the downloaded payload.cs file you can create a uniquely\ntweaked VBA macro automatically. The directly below syntax shows you all you require to\nperform this.\n```\npython unicorn.py /root/Desktop/Payloads/payload.cs cs macro\n\n```\nThe result of the above command is the creation of a file titled “powershell_attack.txt” in your\nunicorn directory which contains a VBA office macro script:\n\nOpen the “powershell_attack.txt” using your preferred editor, gedit because I’m “hu-man” ;0)\nand copy the full contents Ctrl+a, Ctrl+c\n\n\n-----\n\nMove back to the windows VM and in the open Word Document1 – Module1 (Code) area\nand paste the unicorn macro in full, an extract of this can be seen in the screenshot directory\nbelow:\n\nFinal tweak, you need to delete the underscore from between Auto_Open on the 1 line asst\ncan be seen below, without doing this the macro will not auto run on the opening of the\ndocument.\n\n\n-----\n\nTo test the macro, you can run it by clicking on the following “run” arrow on the tool bar:\n\nThis should make the word doc move from the developer window back to the default work\npage, you will see an error. This error is intentional and can be tweaked in the outputted\n“powershell_attack.txt”. The result of the error is, it forces the document to close when the\nOK is clicked, this makes it trickery for a standard user to nose around the document, and\ncan even result in the user forwarding it to others, to ask if they can open the document,\ndouble shells ;0)\n\nIf all works as expected you should receive the session back in CS.\n\n## Malleable profiles\n\nBack To Index▲\n\n\n-----\n\nMalleable C2 is defied by Raphael as a domain specific language to redefine indicators in\nBeacon’s communication. Put bluntly, it allows you to manipulate the useragent used by the\nC2 traffic in an aim to help it blend into normal traffic under the disguise of being a legitimate\nsource.\n\n[Take a look at https://github.com/rsmudge/Malleable-C2-Profiles as it details some created](https://github.com/rsmudge/Malleable-C2-Profiles)\nby Raphael that are available for you can use.\n\nTo download the above profiles in kali simply git clone the directory by performing the\nfollowing.\n```\n[email protected]:~/Desktop/cobaltstrike# git clone\nhttps://github.com/rsmudge/Malleable-C2-Profiles.git\nCloning into 'Malleable-C2-Profiles'...\nremote: Enumerating objects: 221, done.\nremote: Total 221 (delta 0), reused 0 (delta 0), pack-reused 221\nReceiving objects: 100% (221/221), 49.16 KiB | 535.00 KiB/s, done.\nResolving deltas: 100% (113/113), done.\n\n```\nTo view all files in the directory simply run ls.\n```\n[email protected]:~/Desktop/cobaltstrike# ls\nagscript c2lint cobaltstrike cobaltstrike.jar cobaltstrike.store data icon.jpg \nlicense.pdf logs Malleable-C2-Profiles peclone readme.txt releasenotes.txt \nteamserver third-party update update.jar\n\n```\nThe c2lint program checks the syntax of the defined malleable profile, it is recommended that\nyou do this with each profile you wish to use to verify that it will work.\n\n\n-----\n\n```\n[email protected]: /Desktop/cobaltstrike# ./c2lint Malleable C2\nProfiles/normal/amazon.profile\n[+] Profile compiled OK\nhttp-get\n-------GET /s/ref=nb_sb_noss_1/167-3294888-0262949/field-keywords=books HTTP/1.1\nAccept: */*\nHost: www.amazon.com\nCookie: skin=noskin;session-token=NbpB9E/faGd2tZXtRbXh9g==csm-hit=s24KU11BB82RZSYGJ3BDK|1419899012996\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko\nHTTP/1.1 200 OK\nServer: Server\nx-amz-id-1: THKUYEZKCKPGY5T42PZT\nx-amz-id-2: a21yZ2xrNDNtdGRsa212bGV3YW85amZuZW9ydG5rZmRuZ2tmZGl4aHRvNDVpbgo=\nX-Frame-Options: SAMEORIGIN\nContent-Encoding: gzip\nContent-Length: 64\n.7..y...........0%.ARW.K..h.H.p=.......cB.. ..|.d.W7f......CO$..\nhttp-post\n--------POST /N4215/adj/amzn.us.sr.aps?\nsz=160x600&oe=oe&sn=43985&s=3717&dc_ref=http%3A%2F%2Fwww.amazon.com HTTP/1.1\nAccept: */*\nContent-Type: text/xml\nX-Requested-With: XMLHttpRequest\nHost: www.amazon.com\nContent-Length: 24\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko\n66/7wTq/D3ql+bBKT4i3rQ==\nHTTP/1.1 200 OK\nServer: Server\nx-amz-id-1: THK9YEZJCKPGY5T42OZT\nx-amz-id-2: a21JZ1xrNDNtdGRsa219bGV3YW85amZuZW9zdG5rZmRuZ2tmZGl4aHRvNDVpbgo=\nX-Frame-Options: SAMEORIGIN\nx-ua-compatible: IE=edge\nContent-Length: 0\n[+] POST 3x check passed\n[+] .http-get.server.output size is good\n[+] .http-get.client size is good\n[+] .http-post.client size is good\n[+] .http-get.client.metadata transform+mangle+recover passed (1 byte[s])\n[+] .http-get.client.metadata transform+mangle+recover passed (100 byte[s])\n[+] .http-get.client.metadata transform+mangle+recover passed (128 byte[s])\n[+] .http-get.client.metadata transform+mangle+recover passed (256 byte[s])\n[+] .http-get.server.output transform+mangle+recover passed (0 byte[s])\n[+] .http-get.server.output transform+mangle+recover passed (1 byte[s])\n\n```\n\n-----\n\n```\n[+] .http get.server.output transform+mangle+recover passed (48248 byte[s])\n[+] .http-get.server.output transform+mangle+recover passed (1048576 byte[s])\n[+] .http-post.client.id transform+mangle+recover passed (4 byte[s])\n[+] .http-post.client.output transform+mangle+recover passed (0 byte[s])\n[+] .http-post.client.output transform+mangle+recover passed (1 byte[s])\n[+] .http-post.client.output POSTs results\n[+] .http-post.client.output transform+mangle+recover passed (48248 byte[s])\n[+] .http-post.client.output transform+mangle+recover passed (1048576 byte[s])\n[+] .host_stage: Will host payload stage (HTTP/DNS)\n[!] .spawnto_x86 is '%windir%\\syswow64\\rundll32.exe'. This is a *really* bad OPSEC\nchoice.\n[!] .spawnto_x64 is '%windir%\\sysnative\\rundll32.exe'. This is a *really* bad OPSEC\nchoice.\n[!] .code-signer.keystore is missing. Will not sign executables and DLLs\n[!] .https-certificate options are missing [will use built-in SSL cert]\n[email protected]:~/Desktop/cobaltstrike#\n\n```\nYou load the defined malleable profile at the same time as starting the CS team server, this\naccomplished by running the following.\n```\n[email protected]:~/Desktop/cobaltstrike# ./teamserver 192.168.1.18 TestmeUP3 \nMalleable-C2-Profiles/normal/amazon.profile\n\n```\nOnce it’s loaded start the Cobalt Strike client as mentioned earlier in this post, to enable you\naccess to communicate with the server.\n\nSet the listener as HTTP so the traffic is sent unencrypted, this will allow you to view the\ntraffic with wireshark in the lab environment.\n\nHere’s the listener set to HTTP:\n\n[Go to your windows host and install Wireshark once installed, start it listening on the](https://www.wireshark.org/)\ninterface that connects to your virtual lab.\n\nThen on CS create some traffic by running a command such as “shell ipconfig” to the target\nmachine:\n\n\n-----\n\nOn the target machine filter Wireshark to look for HTTP traffic, then right click on a GET\nrequest and select follow:\n\nThis screenshot shows the results of using the amazon malleable profile:\n\n\n-----\n\nThe remains of this section detail the results of trying different malleable profile out.\n\nHere’s the results identified while using the Gmail malleable profile:\n\nAnd finally using the Bing malleable profile:\n\n## Pivoting\n\n\n-----\n\nBack To Index▲\n\nWith CS most users opt to live off the land with CMD or PowerShell commands and scripts,\nor as becoming more popular C#, but there are times when you just miss your old school\ntechniques and tools, and CS allows you to use these via the use of a socks server.\n\nThe following section details using other tools via CS.\n\nTo enable the socks server click on Pivoting followed by selecting Socks Server:\n\nThis will result in you been prompted to provide a port to run the server on, it will default fill\nthis for you, and for this demo I use that setting.\n\nAlternatively, you can type in socks followed by your defined port via beacon and press\nenter:\n\nNow under a Kali terminal open the proxychains.conf and set socks4 127.0.0.1 port number\nto match the one you set under CS.\n```\n[email protected]:~/Desktop/cobaltstrike# gedit /etc/proxychains.conf\n\n```\n\n-----\n\nSave and then you can use proxychains with your desired tool.\n\nFor the following demo I will show using RDP through the compromised target and pivoting\nto a connected Windows 10 box.\n```\n[email protected]:~/Desktop/cobaltstrike# proxychains rdesktop 192.168.1.17\nProxyChains-3.1 (http://proxychains.sf.net)\nAutoselected keyboard map en-gb\n|S-chain|-<>-127.0.0.1:37279-<><>-192.168.1.17:3389-<><>-OK\nERROR: CredSSP: Initialize failed, do you have correct kerberos tgt initialized ?\n|S-chain|-<>-127.0.0.1:37279-<><>-192.168.1.17:3389-<><>-OK\nConnection established using SSL.\n\n```\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-15 - Cobalt Strike. Walkthrough for Red Teamers.pdf"
    ],
    "report_names": [
        "2019-04-15 - Cobalt Strike. Walkthrough for Red Teamers.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bf773c52-830b-46e3-aa61-58c82eb323ee",
            "created_at": "2023-01-06T13:46:39.135077Z",
            "updated_at": "2025-03-27T02:00:03.004808Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "MISPGALAXY:Nazar",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536219,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1653750888,
    "ts_modification_date": 1653750888,
    "files": {
        "pdf": "https://archive.orkl.eu/e4ef437ab9678f005b823f757607375e0a9c3b87.pdf",
        "text": "https://archive.orkl.eu/e4ef437ab9678f005b823f757607375e0a9c3b87.txt",
        "img": "https://archive.orkl.eu/e4ef437ab9678f005b823f757607375e0a9c3b87.jpg"
    }
}