{
    "id": "01ecc7fa-0293-47b3-bb33-5d004a91c865",
    "created_at": "2023-01-12T15:05:01.007197Z",
    "updated_at": "2025-03-27T02:05:29.62161Z",
    "deleted_at": null,
    "sha1_hash": "13f27a51eb41bcb350810370cc70a56e97e567f7",
    "title": "2016-07-26 - OTX Pulse on R980 ransomware",
    "authors": "",
    "file_creation_date": "2013-02-28T15:06:15Z",
    "file_modification_date": "2013-03-01T06:39:32Z",
    "file_size": 3242426,
    "plain_text": "# ICS-CERT Year in Review\n### Industrial Control Systems Cyber Emergency Response Team\n\n## 2012\n\n\n-----\n\n### What’s Inside\n\n**Welcome** **1**\n\n**Organization** **3**\n\n**Outreach** **4**\n\n**Industrial Control Systems Joint Working Group** **5**\n\n**Advanced Analytical Laboratory** **6**\n\n**Cybersecurity Training** **7**\n\n**Cybersecurity Evaluations** **8**\n\n**Cybersecurity Evaluation Tool** **9**\n\n**Standards Support** **9**\n\n**Industrial Control Systems Consequence Effects and Analysis** **10**\n\n**Taking Action** **11**\n\n**ICS-CERT by the Numbers “Calendar Years”** **12**\n\n**ICS-CERT by the Numbers “Fiscal Years”** **13**\n\n**Sector Support by the Numbers “Fiscal Years”** **14**\n\n**Future** **16**\n\n\n-----\n\n##### Welcome\n\nThis year, the Industrial Control Systems Cyber Emergency\nResponse Team (ICS-CERT) developed tools and capabilities\nto assist asset owners with incident handling and response\nefforts. ICS-CERT correlates emerging cyber incidents with\nprevious events and tracks known threat actors based on\ntheir techniques and tactics. The information these tools\nand capabilities yield is leveraged to provide situational\nawareness information for the greater industrial control\nsystem community.\n\nOur team accomplished several key initiatives in 2012\nincluding:\n\n - Developed incident handling and response guidance/\ntraining for asset owners, including tools to assist in\nforensic data gathering and analysis;\n\n - Improved watch floor operational capabilities, data\n\nfusion, and data analysis capabilities to correlate events\nand disseminate data;\n\n - Developed a hands-on Control Systems Forensics\n\nfor Law Enforcement course to train personnel in\ngathering, handling, and preserving forensic data;\n\n - Published relevant information products and\n\ncybersecurity guidance for protecting against emerging\nthreats, mitigating common vulnerabilities, and\nimplementing best recommended practices;\n\n\n\n - Improved relationships with the critical infrastructure\n\nand key resources (CIKR) community to share\ncritical information and raise awareness by leveraging\nknowledge of new vulnerabilities to reduce risk across\nall sectors; and\n\n - Updated policy related to researcher attribution\n\nin alerts and advisories to support coordinated\ndisclosures.\n\nCybersecurity is a journey, not a destination. ICS-CERT will\ncontinue to enhance our ability to identify weaknesses\nand emerging vulnerabilities, take the necessary steps to\nimplement change, and maintain adequate security measures\nto defend against the continuously evolving threats.\n\nAs we move into 2013, we are anxious to hear from you.\nEstablishing a strong posture of continuous information\nexchange is essential to reducing cybersecurity incidents\nand improving the overall security posture of our Nation’s\ncritical infrastructure.\n\nRegards,\n\nMarty Edwards\nDirector\nIndustrial Control Systems Cyber Emergency Response Team\nDepartment of Homeland Security\nICSJWG GCC Chair\n\n\nMarty Edwards\nDirector\n\n\n-----\n\n###### Providing Support\n\n_Advanced Analytical Laboratory_\n\n_Cybersecurity Evaluation Tool_\n\n_Onsite Evaluations_\n\n_Cybersecurity Training_\n\n_Industrial Control Systems_\n_Consequence Effects_\n_and Analysis_\n\n#### Improved Learning\n\n\n_Critical_\n_Infrastructure_\n_Stakeholders_\n\n\n#### Improved\n Effective and\n Learning\n Timely Action\n\n A Strong Robust Organization Partnerships\n\n\n###### Organization\n\n_Operational_\n_Excellence_ **A Strong**\n\n_Leadership_ **Organization**\n_Support_\n\n_Mission Resilience_\n\n_Cross-sector_\n_Coordination_\n\n\n-----\n\n##### Organization\n\nRecognizing the importance of control systems to our\ncritical infrastructure, the Department of Homeland\nSecurity (DHS) supported the Control System Security\nProgram’s (CSSP) mission to reduce risk to the Nation’s\ncritical infrastructure by strengthening control systems\ncybersecurity through public-private partnerships.\n\nThe ICS-CERT is aligning to facilitate the expansion of\nthose essential capabilities in support of Cybersecurity &\nCommunications (CS&C). CS&C will provide guidance\nto promote operational efficiencies and transition of\nresponsibilities and mission objectives to ICS-CERT.\nICS-CERT will continue to provide the same essential\nproducts, services, and support to critical infrastructure\nasset owners and operators, vendors, government agencies,\nand others.\n\nIn 2012, ICS-CERT served as a primary component of the\nNational Cybersecurity and Communication Integration\nCenter (NCCIC) and contributed to the NCCIC’s growing\nmission and capabilities.\n\n\nICS-CERT continues to accomplish its mission to reduce\ncybersecurity risks to the Nation’s critical infrastructure by\nestablishing and operating under its four core functional\nareas:\n\n1. Providing situational awareness through alerts\n\nand advisories to warn of cyber-based threats and\nvulnerabilities affecting critical infrastructure assets;\n\n2. Conducting technical analysis of malware, digital\nmedia, system vulnerabilities, and emerging exploits;\n\n3. Performing incident response to support asset owners\n\nwith discovery, analysis, and recovery efforts; and\n\n4. Coordinating and monitoring control system\nvulnerabilities in collaboration with the cyber research\nand vendor communities.\n\nThese four core functions are supported by a foundation of\npartnering with the control system stakeholder community\nto facilitate cyber risk mitigation activities.\n\n\n-----\n\n##### Outreach\n\nThe ICS-CERT is organized to support the Strategy for\nSecuring Control Systems, which outlines a longterm,\ncommon vision where effective risk management of\ncontrol systems security can be realized through successful\ncoordination efforts. ICS-CERT recognizes that outreach\nplays an important role in those coordination efforts.\n\nIn 2012, ICS-CERT provided nearly 60 briefings to 500\nindustry partners across the 18 critical infrastructure\nsectors, including multiple classified threat briefings to\nindustry organizations that have developed programs for\nsecurity-cleared personnel. The following is a sampling of\nthe sector briefings:\n\n - Electrical Sector Information Sharing and Acquisition\n\nCenters (ISAC),\n\n\n\n - Combined Chemical and Oil and Natural Gas ISACs,\n\n - Water ISAC,\n\n - Cyber Threat Intelligence Coordination Working Group\n\n(CTICG),\n\n - Transportation Security Sector Cyber Working Group\n\n(TSSCWG), and\n\n - Nuclear Sector Specific Agency (NSSA).\n\nIn addition, ICS-CERT attended over 200 events to promote\nawareness among critical infrastructure owners, operators, and\nvendors. This level of engagement supports the continuous\ndevelopment of resources to help industry understand\nand prepare for ongoing and emerging control systems\ncybersecurity issues, vulnerabilities, and mitigation strategies.\n\n\n-----\n\n##### Industrial Control Systems  Joint Working Group\n\nICS-CERT’s outreach strategy has leveraged the Industrial\nControl Systems Joint Working Group (ICSJWG) to engage\na broad range of partners, including critical infrastructure\nsector specific agencies; other federal, state, local, and\ntribal government agencies; national, trans and subnational\ngroups and councils; fusion centers; vendors; researchers\nand academia; infrastructure owners and operators; and\ninternational partners, including various CERTs.\n\nIn 2012, ICSJWG had one of the most successful years\nto date with membership expanding to more than 1,400\nindustrial control systems (ICS) professionals. The increased\ncoordination between various ICS professionals and\ncybersecurity organizations was mirrored at the Spring and\nFall 2012 ICSJWG meetings.\n\nHighlights include the following.\n\n - The ICS-CERT participated in panels fostering open\n\ndialog about control systems vulnerabilities and how the\ncommunity can work together to mitigate these issues.\n\n - The subgroup meetings allowed participants to discuss\n\nin depth the current status of subgroup activities and\nreport accomplishments to the community.\n\n\n\n - The Introduction to Control Systems Cybersecurity\n\ntraining course was taught to more than 115 meeting\nattendees at the Spring meeting and the Intermediate\nCybersecurity Industrial Control Systems Training was\ntaught to over 65 participants at the Fall meeting.\n\n - ICS-CERT hosted its first International Day featuring\n\ninformation sharing sessions, goal discussions, and\nconversations about a possible path forward for creating\na new ICSJWG international subgroup.\n\n - Marty Edwards provided an ICS threat brief and\n\noverview to meeting attendees at the Fall meeting.\n\n - International attendees were invited to attend the world\n\nrenowned “hands-on” Industrial Control Systems\nCybersecurity Advanced Training held at the ICS-CERT\ntraining facility in Idaho Falls, Idaho.\n\nMoving forward, we will continue to promote growth and\ncollaboration in the ICSJWG community through publicprivate partnership.\n\n\n-----\n\n##### Advanced Analytical Laboratory\n\nICS-CERT provides expertise for response and analysis of\ncyber incidents affecting the ICS community through the\nAdvanced Analytical Laboratory (AAL). One such example\nin 2012 was the spear-phishing campaign against the oil\nand natural gas sector. AAL worked directly with a dozen\nenergy and manufacturing companies affected by the\ncampaign, providing digital media and log file analyses\nto identify compromised hosts. During the course of this\nresponse effort, AAL analyzed over 50 malware samples\nand malicious files, 20 emails, and 38 hard drive images\nto determine the extent of the compromise and identify\nthe techniques and tactics used by the threat actors. By\nanalyzing malicious emails and malware samples, AAL was\nable to provide indicators of compromise through alerts and\nadvisories to the ICS community to aid in detection efforts.\nAAL provided onsite support to two affected companies,\nhelping determine the extent of the compromise and\nproviding mitigation recommendations.\n\nThe chemical sector was also the victim of targeted\nspear-phishing attacks in 2012. AAL worked directly with\ncompanies affected by this campaign, providing onsite\nsupport, analyzing drive images and malware samples\n\n\nand disseminating indicators back to the community. AAL\nprovided onsite support to one of the affected companies.\n\nAAL also provides vulnerability verification and patch\nvalidation for ICS products. AAL’s verification and validation\nreports assist ICS-CERT Vulnerability Handlers with\ndeveloping product advisories for the ICS community.\n\nIn 2012, AAL enhanced its analysis capabilities with a core\ninformation storage system. This system maintains forensic\ninformation for all analysis activities and is integrated\nwith the AAL automated analysis environment. AAL also\ndeveloped a tool to scan whole drives for malware using\nmultiple antivirus engines. This tool greatly reduced the\ntime needed to scan multiple drive images with commercial\nantivirus products.\n\nICS-CERT will continue to support AAL’s development of\ntools and techniques available to ICS community members\naffected by cyber incidents.\n\n\n-----\n\n##### Cybersecurity Training\n\nICS-CERT offers cybersecurity training at no cost to\nICS professionals and managers across all sectors of\nCIKR in order to support risk reduction efforts. These\ntraining courses include Introduction to Control Systems\nCybersecurity, Intermediate Cybersecurity for Industrial\nControl Systems, ICS Advanced Cybersecurity, and ICS\nSecurity for Management. In 2012, over 2,200 ICS\nprofessionals were trained.\n\n2012 Training Highlights included the following.\n\n - Provided 12 Advanced Training sessions, which are\n\nweek-long events that provide intensive hands-on\ntraining and a 12-hour, red team/blue team exercise\nthat simulates a corporate espionage scenario.\n\n - Developed a Control Systems Forensics for Law\n\nEnforcement course. This course helps law enforcement\nagents to understand the differences in performing\nforensics on ICSs versus normal corporate enterprise\nnetwork forensics.\n\n\n\n- Delivered 52 training sessions across the country,\n\nincluding Introduction to Control Systems\nCybersecurity (101), Intermediate Cybersecurity\nfor Industrial Control Systems lecture (201), and\nIntermediate Cybersecurity for Industrial Control\nSystems with lab (202).\n\n- Provided demonstrations of how an ICS attack could\n\nprogress for high ranking government officials and\ncongressional staffers.\n\n- Conducted our first regional training event in Atlanta,\n\nGeorgia. This event was so successful that ICS-CERT will\nnow conduct regional training on a regular basis.\n\n\n-----\n\n##### Cybersecurity Evaluations\n\nICS-CERT provides cybersecurity evaluations to support the\nreliability and resiliency of the systems that comprise and\ninterconnect critical infrastructures. ICS-CERT develops and\nimplements coordinated security measures in collaboration\nwith partners from across public, private, and international\ncommunities.\n\nIn 2012, ICS-CERT conducted 89 onsite assessments across\nall CIKR. The objective of the assessment is to establish a\n“baseline of performance” with regard to cybersecurity\nmaturity as defined within a suite of cybersecurity standards\nand guidelines. Although the results may differ from sector\nto sector, many of the vulnerabilities and weaknesses within\nthe networks are similar. This year has seen considerable\npartnering with the Nuclear Industry, Oil and Gas Industry,\nand Department of Defense with regard to performing onsite\ncybersecurity assessments.\n\n\nCybersecurity assessments are now tailored to each individual\nassessment depending on the level of complexity in the\nsystem(s). Asset owners can now request Cybersecurity\nEvaluation Tool (CSET[®]) evaluations and/or Architecture\nReviews, which is a more in-depth comprehensive evaluation\nof specific control systems networks, architectures, and\ncomponents.\n\n\n-----\n\n##### Cybersecurity Evaluation Tool\n\nThe ICS-CERT foundation tool for onsite assessments is\nour CSET[®]. In 2012, over 5,500 CSETs[®] were distributed\nand downloaded. Version 4.1 was released in January 2012\nand incorporated integration with Microsoft Visio. This\nfunctionality allows users to develop a diagram in Visio and\nthen map and export it to CSET[®] where component questions\nare generated. It also allows for a diagram created in CSET[®] to\nbe imported into Visio with all the CSET[®] metadata preserved.\nA new stencil of CSET[®] components for Visio was also\nincluded as part of the installation package.\n\nICS-CERT released CSET[®] 5.0, in January 2013, this version\nrepresents the most significant upgrade in the underlying\ntechnical architecture of the tool. This upgrade involves\nconversion to the Microsoft.NET framework environment as\nwell as utilization of component pieces from Syncfusion. In\naddition, Section 508 of the Americans with Disabilities Act\n(ADA) was incorporated into the new version to allow those\nwith disabilities a way to interact with and use the CSET[®].\n\n\n##### Standards Support\n\nA broad range of standards exists to support the CSET[®] tool\nacross CIKR. ICS-CERT executes a comprehensive approach\nto standards by providing assistance to standards bodies,\npromoting awareness of accepted standards and providing\ntools, like CSET[®] to asset owners, to evaluate compliance.\nThe ICS-CERT continues to engage with cross-sector industry\npartners to develop new cybersecurity standards and\nenhancement of existing standards. The ICS-CERT provides\nkey support to:\n\n - the ISA-99 Working Groups,\n\n - International Standard Organization (ISO)/\nInternational Electrotechnical Committee (IEC),\n\n - the National Institute of Standards (NIST),\n\n - Technology Smart Grid Interoperability Panel (SGIP),\n\n - American Public Transportation Association (APTA), and\n\n - ICSJWG Roadmap Subgroup.\n\n\n-----\n\n##### Industrial Control Systems Consequence Effects and Analysis\n\nICS-CERT supports the development of leading edge tools to\nfoster an environment of collaboration and provide unique\nforensic capabilities to address cybersecurity challenges\nspecific to ICS.\n\nThe Industrial Control Systems Consequence Effects and\nAnalysis (ICS-CEA) framework is a collaboration tool.\nICS-CEA provides a critical infrastructure modeling and\nsimulation capability. The tool also provides a means for\nusers to model, analyze, and share information related to\npotential consequences of naturally occurring or man-made\nthreats on our Nation’s critical infrastructure. The ICS-CEA\nsystem provides the NCCIC a capability for daily use of\nmodeling, simulation, analysis, and information sharing\nrelated to potential cross-sector “consequence” effects to ICS\nand their related CIKR sectors.\n\n\nIn 2012, ICS-CEA has been used for responding to multiple\nrequests by the NCCIC regarding the identification of\npotentially affected CIKR because of natural and potential\nman-made threats. These events have included analysis\nsupport for the Super Bowl, national level exercises,\nand others related on our Nation’s energy, water, and\ntransportation infrastructure.\n\nICS-CERT’s suite of tools provides analysis to improve\nsecurity posture as well as identify the appropriate\ncybersecurity mitigation measures. ICS-CERT continues to\ncultivate capabilities in collaboration and forensics to span\nthe gap between ICS, information technology, and the user\ninterface to provide advanced industrial analysis to enhance\ncybersecurity.\n\n\n-----\n\n##### Taking Action\n\nICS-CERT works with critical infrastructure asset owners\nand operators to respond to cyber incidents that have\nthe potential to impact ICS. ICS-CERT works with the\naffected organizations to offer subject matter expertise for\nimmediate actions to mitigate the compromise and develop\nstrategies for recovery and future defenses. The mitigation\nstrategies are specific to the incident and individual needs of\nthe organizations.\n\nICS-CERT is a component of the NCCIC, bringing\nICS security technical and response capabilities to the\npartnership. The work is performed in conjunction with the\nNCCIC and furthers its overall mission to coordinate defense\nagainst and response to cyber attacks across the Nation.\n\nIn 2012, ICS-CERT responded to a steady stream of\ncyber incidents, coordinated researcher-discovered ICS\nvulnerabilities with vendors, and produced alerts and\nadvisories to notify the ICS community. These situational\nawareness products provide actionable information about\nmitigation and protection strategies for implementing\nsound security practices.\n\nThis year, ICS-CERT received and responded to 138\nincidents as reported by asset owners and industry partners.\nIn 2012, attacks against the energy sector represented over\n40 percent of all incidents reported to ICS-CERT. In roughly\nhalf of these incidents, information pertaining to the\nICS/SCADA environment, including data that could facilitate\n\n\nremote unauthorized operations, was targeted in these\nincidents. ICS-CERT also deployed on site incident response\nteams to assist various critical infrastructure operators with\nefforts to mitigate cyber intrusions. The on site teams\nwere able to help identify the extent of the intrusion and\ndevelop strategies for recovery and improving the operator’s\ndefensive posture and future detection capabilities. The AAL\nplayed a key role in the response; providing support for\nanalysis of hard drives, log files, and malware artifacts. The\nAAL also developed the guidelines found in the paper on\nCyber Intrusion Mitigation Strategies.[a]\n\nVulnerability analysis and coordination activities continued\nto increase with more researchers using ICS-CERT as a\nconduit for coordination with ICS vendors. The ICS-CERT\nAAL also provided analytic support to vendors to perform\nproof-of-concept testing and patch validation. Many\nof those vulnerabilities resulted in ICS-CERT alerts and\nadvisories on the US-CERT secure portal and on the public\nWeb site.\n\nIn 2012, ICS-CERT published 342 information products\nwarning the ICS community about various vulnerabilities\nand threats that could potentially impact control systems.\nICS-CERT also published the Incident Summary Report[b]\nto summarize cyber incidents, onsite deployments, and\nassociated findings from 2009 through 2011.\n\na. http://www.us-cert.gov/control_systems/pdf/ICS-TIP-12-146-01.pdf\nb. http://www.us-cert.gov/control_systems/pdf/ICS-CERT_Incident_Response_\n\n\n-----\n\n##### ICS-CERT by the Numbers  “Calendar Years”\n\nTable 1 compares the overall incident, vulnerability, onsite\nevent, and information product statistics for calendar years\n2010, 2011, and 2012, indicating control system cyber\nevents and activity.\n\n_Table 1. ICS-CERT activity trend by *Calendar Year_\n\n**ICS-CERT Metrics** **2010 Totals** **2011 Totals** **2012 Totals**\nICS Incident Reported — tickets 39 204 138\nICS Incident Response Onsite Deployments 8 7 6\nICS Related Vulnerability Report — tickets 41 141 147\nICS-CERT Information Products 138 283 343\nDistributed or Downloaded CSET[®] 2,394 7,448 5,584\nOnsite Assessments 57 70 89\nProfessionals Trained 2,499 1,658 2,241\nNumber of Training Sessions 55 47 52\nICSJWG Membership N/A 1,040 1,416\nSpeaking Engagements 47 164 200\nConference Exhibitions 11 20 19\n\n*Calendar Year accounts for the time period between Jan 1 of a given year and Dec. 31 of the same year.\n\n\n-----\n\n##### ICS-CERT by the Numbers “Fiscal Years”\n\nTable 2 compares the overall incident, vulnerability, onsite\nevent, and information product statistics for fiscal years\n2010, 2011, and 2012, indicating control system cyber\nevents and activity.\n\n_Table 2. ICS-CERT activity trend by *Fiscal Year_\n\n**ICS-CERT FY Metrics** **2010 Totals** **2011 Totals** **2012 Totals**\nICS Incident Reported — tickets 39 140 197\nICS Incident Response Onsite Deployments 6 7 6\nICS Related Vulnerability Report — tickets 18 139 137\nICS-CERT Information Products 110 243 347\nDistributed or Downloaded CSET[®] 2,400 5,100 6,631\nOnsite Assessments 57 81 89\nProfessionals Trained 2,463 1,686 2,327\nNumber of Training Sessions 54 47 56\nICSJWG Membership 600 1,012 1,423\nSpeaking Engagements 26 137 205\nConference Exhibitions 11 20 22\n\n*Fiscal Year 2010 represents the time period of October 1, 2009–September 30, 2010, 2011 represents the time period of October 1, 2010–September 30, 2011, and\n2012 represents the time period of October 1, 2011–September 30, 2012.\n\n\n-----\n\n##### Sector Support by the Numbers  “Fiscal Years” \n\nTable 3 compares number of onsite assessments provided\nto the control systems community in each of the 18 critical\ninfrastructure sectors in fiscal years 2010, 2011, and 2012.\n\n_Table 3. Fiscal Year onsite assessments by Sector_\n\n\nThe last row on the table compares the number of sector\nrequesting support in each fiscal year with the total number\nof critical infrastructure sectors.\n\n\n**Sector** **FY-10** **FY-11** **FY-12** **Cumulative**\n**Assessments**\nAgriculture & Food 0 5 0 5\nBanking & Finance 2 1 6 9\nChemical 0 0 4 4\nCommercial Facilities 3 10 2 15\nDams 1 0 0 1\nDefense Industrial Base 1 0 12 13\nEmergency Services 0 2 3 5\nEnergy 13 11 7 31\nGovernment Facilities 6 5 3 14\nInformation Technology 0 3 5 8\nNational Monuments & Icons 0 5 1 6\nNuclear Reactors, Materials, & Waste 0 2 8 10\nPostal & Shipping 0 0 1 1\nPublic Health & Healthcare 5 6 1 12\nTelecommunication 0 1 0 1\nTransportation 5 7 10 22\nWater 19 21 25 65\nCritical Manufacturing 2 2 1 5\nTotals 57 81 89 227\nNumber of Sectors Assessed 11/18 14/18 15/18 N/A\n\n*Fiscal Year 2010 represents the time period of October 1, 2009–September 30, 2010, 2011 represents the time period of October 1, 2010–September 30, 2011, and\n2012 represents the time period of October 1, 2011–September 30, 2012.\n\n\n-----\n\n##### Future\n\nICS-CERT will continue to actively engage the public and\nprivate sectors as well as international partners to prepare\nfor, prevent, and respond to cybersecurity incidents that\ncould impair strategic assets. The ICS-CERT provides\nresources to enhance the security, resiliency, and reliability\nof the Nation’s cyber and communications infrastructure.\n\nIn order to provide integrated capabilities ICS-CERT\nenhances response capabilities based on the specific needs\nand requirements of the requesting customer. This tailored\napproach provides scalable response to cybersecurity\nchallenges across critical infrastructures. ICS-CERT works to\nprevent or minimize disruptions to our critical information\ninfrastructure in order to protect the public, economy,\ngovernment services, and the overall security of the United\nStates. This is accomplished through a series of continuous\nefforts designed to further safeguard systems by reducing\npotential vulnerabilities, protecting against cybersecurity\nand communications intrusions or disruptions, and\nanticipating future threats.\n\nUnder ICS-CERT, AAL’s future development plans include\nautomated tools for registry analysis, timelining, and pdf\nanalysis.\n\n\nThe ICS-CERT will continue to pursue five strategic goals.\n\n - Goal 1: Foster public-private partnerships to plan,\n\ncoordinate, and support ICS cybersecurity initiatives.\n\n - Goal 2: Serve as a global clearinghouse for information\n\nassociated with the security of ICS.\n\n - Goal 3: Support robust preparedness planning and\n\nfacilitate effective incident response capabilities.\n\n - Goal 4: Support increased awareness of control systems\n\nsecurity issues and improved technical expertise for\nstakeholders.\n\n - Goal 5: Ensure that ICS-CERT is an adaptive and\n\nprepared organization that effectively plans for,\nanticipates, and manages future risks and disruptions.\n\nIn 2012, ICS-CERT served as a primary component of the\nNCCIC and contributed to the NCCIC’s growing mission\nand capabilities.\n\n\n-----\n\n##### Assistance from ICS-CERT  is only a phone call away\n\nThe ICS-CERT encourages you to report suspicious cyber\nactivity and vulnerabilities affecting critical infrastructure\ncontrol systems.\n\nTo report control systems cyber incidents and vulnerabilities\ncontact the ICS-CERT:\n\n_ics-cert@dhs.gov_\n(877) 776-7585\n\n_www.us-cert.gov/control_systems/ics-cert_\n\nFor more information on the ICS-CERT Program visit:\n\n_http://www.us-cert.gov/control_systems/_\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/ICS-CERT - Year in Review - 2012.pdf"
    ],
    "report_names": [
        "ICS-CERT - Year in Review - 2012.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535901,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1362063975,
    "ts_modification_date": 1362119972,
    "files": {
        "pdf": "https://archive.orkl.eu/13f27a51eb41bcb350810370cc70a56e97e567f7.pdf",
        "text": "https://archive.orkl.eu/13f27a51eb41bcb350810370cc70a56e97e567f7.txt",
        "img": "https://archive.orkl.eu/13f27a51eb41bcb350810370cc70a56e97e567f7.jpg"
    }
}