{
    "id": "01ef0355-664c-4c61-bdcb-f4372b946029",
    "created_at": "2023-01-12T15:01:55.236128Z",
    "updated_at": "2025-03-27T02:17:15.041235Z",
    "deleted_at": null,
    "sha1_hash": "972057f8356ec04c6ac24fbff7b13baa7f867c88",
    "title": "2020-05-06 - Shadows with a chance of BlackNix",
    "authors": "",
    "file_creation_date": "2022-05-27T19:01:50Z",
    "file_modification_date": "2022-05-27T19:01:50Z",
    "file_size": 139154,
    "plain_text": "# Shadows with a chance of BlackNix\n\n**[medium.com/insomniacs/shadows-with-a-chance-of-blacknix-badc0f2f41cb](https://medium.com/insomniacs/shadows-with-a-chance-of-blacknix-badc0f2f41cb)**\n\nasuna amawaka May 6, 2020\n\nasu\nna\n\n\n[asuna amawaka](https://medium.com/@asuna.amawaka?source=post_page-----badc0f2f41cb--------------------------------)\n\nMay 6, 2020\n\n\n13 min read\n\nIn the last post, I did an analysis of a set of BBSRAT samples that are characterized by unique\nmutexes (cc5d64b344700e403e2sse, cc5d6b4700e403e2sse, cc5d6b4700032eSS) and calls\nback to a known Winnti Group C2 (bot[.]googlerenewals[.]net). In this post, I’m going to\ncontinue on analysis of samples related to the abovementioned mutexes.\n\nWhen I started on this analysis journey, I was hoping to find more BBSRAT samples. However,\nthe results I arrived at deviated from expectations, and instead I found a set of dropper malware\nthat used the same mutexes as those found in the BBSRAT samples I analyzed. The final\npayload dropped by these droppers is the BlackNix RAT. Pivoting from the C2 called from this\n_BlackNix RAT, more BlackNix RATs were found on VirusTotal. I was unable to find any technical_\nblogs on the BlackNix RAT, and hence, here I am.\n\nThe following diagram is a sort of a “signpost” for this writing.\n\n\n-----\n\nLet’s dip into the first dropper!\n\n**Project1.exe**\n\nThe following files are likely from the same source code:\ndaaa061c88b197fa92d9648306e79875e3a24f392550dacaabd22e5fdba53ebf\n75dc821013fe92ef93cefa47d3fe83ad5ce90658e8ef01fcdb0b11652397abec\n\n\n-----\n\nJudging from the executables icon, it looks like the samples are written with Borland Delphi 7,\nand sadly the executables’ compilation timestamps are 1992–06–19 22:22:17 (a well-known\nbug in Delphi 4–2006). I didn’t really look into which versions are affected by the compilation\ntime bug, because that’s beside the point. The samples’ compilation time can still be deduced\nwith the timestamp within the executables’ resources. (Thanks to Adam’s old post on this[1])\n\nThis dropper will drop 2 files system.exe and systemm.exe into %USERPROFILE%\\Pictures,\nexecute them and write a diskshadow.exe to C:\\ProgramData\\Microsoft\\DeviceSync\\.\n\n\n-----\n\n_system.exe, systemm.exe_\nSHA256:\nAEB61477C3F4F2D76AF0DC97B19B01F73C8ADA1FCE91D66E8B0E489E2E807430\n\nExecution of system.exe creates a service to execute itself within the context of the service.\n\nC:\\Windows\\System32\\sc.exe create SESSRV binpath= “cmd /c\n\\”C:\\Users\\asuna\\Pictures\\system.exe\\””\n\nC:\\Windows\\System32\\net.exe start SESSRV\n\n\n-----\n\nThe mutexes are set within the execution of system.exe and systemm.exe.\n\n\n-----\n\nsystemm.exe attempts to copy diskshadow.exe to a network location\n\\\\TSCLIENT\\%userprofile%\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\Startup\\. The sample also attempts to locate and copy a 1.jpg.lnk within the\nsame directory as diskshadow.exe, but this file was not created by the previous dropper.\n\nIn gist, the sample’s job is to copy the payload diskshadow.exe to a host that is connected to\nthe current victim via RDP and set persistency to run at startup. This is possibly a tool meant for\nlateral movement within the victim network. The same technique is also found in the execution\nof the BBSRAT samples analyzed previously.\n\nThe following screen captures referenced one of the BBSRAT trinity files, lockdown.dll (MD5:\n166D28FF69019D9991EECBD26DC1E266):\n\n\n-----\n\nCopy file to network location. Left: system.exe; Right: lockdown.dll\nThe mutexes come into play with the same “usage” as what was seen in the BBSRAT samples\nas well.\n\n\n-----\n\nOne of the places where mutex is set. Left: system.exe; Right: lockdown.dll\nGiven that even the sleep counter is identical, I would suspect that the two executables might\nshare the same “base code” (or perhaps copied from the same “reference code”). The proximity\nof their compilation time also suggests that perhaps the same author is behind both\nexecutables.\n\nSystem.exe: 13 May 2018 19:34:27\nLockdown.dll: 6 May 2018 17:59:24\n\n\n-----\n\nSame sleep counter. Left: system.exe; Right: lockdown.dll\nEnough of the dropper, let’s look at the actual evil payload now.\n\n**Diskshadow.exe**\n\n\n-----\n\nUPX section names\nWith just one look at it, we’d know it’s UPX-packed. So let’s unpack it quickly.\n\n\n-----\n\nAfter unpack:\n\nMD5: 40835ED7C92F33F7F377D4472228CB65\nSHA1: 033E97D4AC3AE3CEC00A206F2AD5CCC922DBD326\nSHA256:\nC5BAB78FCA3DB0CE5FFFF5838A5A4A93D930E715DED1CBD8A5B3CAF0CDCE803C\n\nWith the assistance of Procmon, we can see that the binary will drop 2 files, intel.exe and\ninte.exe into the C:\\intel directory. I located the code responsible for creating the files (refer to\nscreen capture below). The binary also sets 2 persistency mechanisms. Note the presence of\nSimplified Chinese words within the name of the registry key — 更新计划程序 (translates to “\nUpdate Schedule Program”). This is not the only place where Simplified Chinese words are\nobserved.\n\nregsetval sz HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n“intel更新计划程序” “c:\\intel\\inte.exe”’,0\n\nshortcut “c:\\intel\\inte.exe” “~$folder.startup$” “Windows Calculator”\n\n\n-----\n\nSet persistency\nThe two files dropped are:\n\n\n-----\n\n_intel.exe_\nSHA256:\n12459A5E9AFDB2DBFF685C8C4E916BB15B34745D56EF5F778DF99416D2749261\nThis is the NirCmd executable from Nirsoft. NirCmd is a small command-line utility that allows\nyou to do some useful tasks without displaying any user interface.\n\n_inte.exeSHA256:_\nF46520C2284E20C42AFA6E9B90E380735BFDF29817828369D5F1270A887E6979\nThis is the actual BlackNix RAT, which is the meat that we want to analyze.\n\nBoth diskshadow.exe and inte.exe are written in Borland Delphi and their compilation datetime\nstamps are as follow:\n\nFile: C:\\ProgramData\\Microsoft\\DeviceSync\\diskshadow.exe\nPE Comp.: 1992–06–19 22:22:17 2A425E19, 708992537\n.rsrc comp.: 2018–10–22 22:50:06 4D56B643, 1297528387\n\nFile: C:\\Intel\\inte.exe\nPE Comp.: 1992–06–19 22:22:17 2A425E19, 708992537\n.rsrc comp.: 2018–10–22 22:49:20 4D56B62A, 1297528362\n\nJudging from the compilation datetimes, they might be the output of a generator. Here, I could\nalso make a guess at the chronological logic of when the files are prepared.\n\n\n-----\n\n**inte.exe**\n\nAs with my usual style, I will start with a quick look at strings to try to guess the behaviour of the\nsample, before diving into dynamic and static analysis. Fortunately, the sample contains many\nhelpful and descriptive strings that can help us deduce the features that this RAT provides,\nincluding Keylogger, FileManager, ProcessManager etc. Pretty typical RAT stuff.\n\n\n-----\n\n-----\n\n_A YARA rule hit_\n\nThe sample happened to match James_inthe_box’s YARA rule[2] on BlackNix RAT:\n\n\n-----\n\nrule BlacknixRAT_bin{\n\nmeta:\ndescription = “BlacknixRAT”\nauthor = “James_inthe_box”\nreference = “https://app.any.run/tasks/e3d845db-09b5-462d-8290-cbb4bb4a505f/\"\ndate = “2019/02”\nmaltype = “RAT”\n\nstrings:\n$string1 = “[Random-Number-Here]”\n$string2 = “ScreenCapture”\n$string3 = “TScreenSpy”\n$string4 = “KeyLogger”\n$string5 = “RemoteShell”\n\ncondition:\nuint16(0) == 0x5A4D and all of ($string*) and filesize < 2000KB\n\n}\n\nBased on the strings seen above, the strings that matched the YARA rule did not look unique\nenough to confirm that this is indeed a BlackNix RAT. James_inthe_box also provided a snort\nrule:\n\nalert tcp any any -> any 80 (msg:”Blacknix RAT Detected”; flow:established,to_server;\ncontent:”|32|”; depth:1; content:”|7c 78 01 6d 8e|”; within:10;\nreference:url,https://app.any.run/tasks/e3d845db-09b5-462d-8290-cbb4bb4a505f/;\nclasstype:trojan-activity; sid:20166298; rev:1; metadata:created_at 2019_07_18;\n\nLet’s see what we have in the network data.\n\n\n-----\n\nYup, I see a 7C 78 01 but that’s not an exact match with the pattern in the snort rule. Hang on a\nsecond.. 78 01 looks like the ZLIB magic header. There we go!\n\n\n-----\n\nI noticed some weird characters, which could be indicative of Unicode (maybe Chinese…?).\nLet’s try.\n\n\n-----\n\nIndeed! 初始 is translated to mean Initial Start, and “2核2808” might mean 2 Cores (probably\nreferring to the CPU cores). I’ll step through the code that forms up this data in abit. Now, let us\ntry to confirm if this callback belongs to BlackNix family.\n\nThe YARA and snort rules mentioned above referenced a sample (SHA256:\nA4DA694DED531EC60CA5A242C554B6A7062E12FF633D34656C4CA9DF86E42DD5). Let’s\nsidetrack and see what this sample does.\n\nThis sample is packed with VMProtect, so to save time, I’m just going to execute it and see\nwhat happens. Upon execution, a new file phpalpha.exe is created in\nC:\\Intel\\ExtremeGraphics\\CUI\\Resource. Turns out the file has the same hash as the parent\nbinary.\n\n\n-----\n\nThe network callback looks like this:\n\n\n-----\n\nWe already know that’s a ZLIB header, so let’s use CyberChef to view the inflated data:\n\n\n-----\n\nInteresting. The data structure and keywords are identical. Now I can say that the sample\n(SHA256:\nA4DA694DED531EC60CA5A242C554B6A7062E12FF633D34656C4CA9DF86E42DD5) and\nour sample (inte.exe, SHA256:\nF46520C2284E20C42AFA6E9B90E380735BFDF29817828369D5F1270A887E6979) belong to\nthe same family. Is it really BlackNix though?\n\n_With the C2, everything is easier_\n\nWith some help from Google search, I found a copy of a BlackNix C2 component :D\n\n\n-----\n\nThe C2 executable comes with the ability to generate the server component. This naming\nconvention is common in RATs, where the malware client is typically referred to as the “server”,\nand the C2 is the “client”.\n\nThe following is one of the default profiles loaded with the C2:\n\nFor the ease of testing, I changed some of the values when generating our test binary. The\ngenerator even comes with the option of UPX-packing the generated binary if the user wishes.\n\n\n-----\n\nInspecting the strings within the generated binary, we can quickly identify some familiar\nkeywords.\n\n\n-----\n\nI’ve written a quick script to read the strings from the default settings. This will come useful later,\nwhen comparing these strings across different samples.\n\n\n-----\n\nHere’s the output of running the script:\n\n\n-----\n\nIt appears that these SETTINGS strings have nothing to do with the configuration set when\ngenerating the binary. The default connection password within the C2 is “admin” and notice that\neven if I changed the password when generating the binary, the new password does not get\ninserted into this SETTINGS data. These may be part of a “stub” that comes with the C2\nexecutable and inserted into every generated binary. I think this may be a helpful piece of\ninformation when trying to identify if a set of BlackNix RATs is communicating with the same C2\nexecutable (or at least the same version).\n\nTake a look at the network communications.\n\n\n-----\n\nFirst thing that I noticed was the difference in the way the “Processor” information is being\nformatted. Remember there were some Chinese words (2核2808) that I thought refers to\nProcessor Cores? In the data sent from this test binary, the processor information was simply a\n“2808” (referring to 2808 Mhz, which is indeed the setup of my VM).\n\n\n-----\n\nConnected victim on C2 dashboard\nLet’s get back to the sample we have at hand.\n\nI did an in-depth analysis of how the first beacon’s data structure is formed within inte.exe.\n\nEarlier I mentioned some SETTINGS strings. These are the strings that are populated into a\ndata structure and some of these values are later copied into the first beacon data.\n\n\n-----\n\nReading strings from SETTINGS\nLet’s compare the default SETTINGS strings found in the generated BlackNix binary and\ninte.exe.\n\n\n-----\n\nThe following code is responsible for building the structure to be sent in the first beacon:\n\n\n-----\n\n-----\n\nThe following is the deduced first beacon’s data structure sent from the inte.exe to its C2.\n\nOnConnect|Default 初始|Username|Username|Computer Name|IP Address|Hardcoded\nSpace|Locale|Is Machine Idle?|Locale|Language|Account\nPrivilege|Processor|Memory|Foreground Window Text|OS|Default False|Default\nFalse|%Root%|%Desktop%|%MyDocuments%|%AppData%|Locale|Server authentication\npassword|ProdID, InstallDate|\n\nNow we can play spot-the-differences. We can guess what each of these fields mean by\nlooking at what can be seen on the dashboard, without reverse engineering the binary.\n\nThe following is the deduced first beacon’s data structure sent from the test BlackNix binary.\n\n\n-----\n\nOnConnect|Assigned Group|Assigned Name|Username|Computer Name|IP\nAddress|Webcam Installed?|C2 Version|?|Locale|Language|Account\nPrivilege|Processor|Memory|OS|True/False?|True/False?\n|%Root%|%Desktop%|%MyDocuments%|%AppData%|Locale|Server authentication\npassword|?|\n\nComparison of fields within data structure sent to C2\n_Yes! inte.exe is a BlackNix RAT, but has a different/modified C2 component?_\n\nWhat I did above proved that the inte.exe sample is indeed a BlackNix RAT, judging from the\nhighly similar data structure within the initial beacon and the similarities found within the\nexecutables. However, since some fields in the communicated data are interpreted differently,\n\n\n-----\n\nI m guessing there is a customised C2 that the adversary is using. I am not even able to tell the\nversion number of the C2 from the sample, perhaps it is not important for the adversary.\nHowever, the SETTINGS strings found within the samples could be a way for us to differentiate\nvariants.\n\nSo far, I’ve walked through the analysis of this set of files:\n\n- 1st level droppers (Project1.exe)\ndaaa061c88b197fa92d9648306e79875e3a24f392550dacaabd22e5fdba53ebf\n75dc821013fe92ef93cefa47d3fe83ad5ce90658e8ef01fcdb0b11652397abec\n\n- 2nd level droppers (diskshadow.exe)\nf0311ede2dd5e752411bf181626e3cdb36737affe67ddeb8af028d0c44355886\nc5bab78fca3db0ce5ffff5838a5a4a93d930e715ded1cbd8a5b3caf0cdce803c\n\n- (inte.exe)\nf46520c2284e20c42afa6e9b90e380735bfdf29817828369d5f1270a887e6979\n\nI’ve verified that the sample inte.exe is indeed a BlackNix RAT and communicates with a\ncustom BlackNix C2 at IP address 112.213.107[.]134.\n\nRelated to this IP address, other possible BlackNix RAT samples were found on VirusTotal:\n\n\n-----\n\nIn addition, one other BlackNix RAT samples were mentioned by james_inthe_box[2]. Based on\nSSDEEP similarity, another sample was found.\n\n\n-----\n\nNext, we shall see if all these samples send data in the same structure as what we have\nanalyzed previously. If they do, then perhaps these are all related in some way and are not\n“wild” BlackNix RATs.\n\n**Set 1 binaries**\n\n\n-----\n\nExecution of these binaries will result in errors. Upon closer look, the errors happen because\nsome part of the binary seems to be corrupted. Whether this is a deliberate “disarm” attempt or\ndue to a bug, I can’t tell.\n\n\n-----\n\nCause of error at address 0x4CDE53\n\n\n-----\n\nCause of error at address 0x4CE084\nJust patch the areas with the corresponding bytes from inte.exe to fix the problems. The\nfollowing screenshots show highlighted areas after patching.\n\n\n-----\n\nPatch to solve error at 0x4CDE53\n\n\n-----\n\nPatch to solve error at 0x4CE084\nFrom the network packet, it looks like the data structures are identical to what we saw in\ninte.exe. This is verified with a comparison of the function that is responsible for building the\nstructure. This is not surprising, as they all call back to the same IP address.\n\n\n-----\n\n**Set 2 binaries**\n\nThese binaries are different, because they are VMProtect-packed, which means that I cannot\nsimply throw them into IDA Pro and hope to do function comparisons.\n\n\n-----\n\nExecution of these binaries require them to be executed with administrator privileges, as they\nwill spawn a svchost.exe process for injection. Knowing this behaviour, we can dump the\nunpacked executable from memory at the moment where the injection happens. A breakpoint at\nntdll.dll’s NtWriteVirtualMemory will do the trick.\n\n\n-----\n\nNtWriteVirtualMemory(\nIN HANDLE ProcessHandle,\nIN PVOID BaseAddress,\nIN PVOID Buffer,\nIN ULONG NumberOfBytesToWrite,\nOUT PULONG NumberOfBytesWritten OPTIONAL );\n\nThe idea is to watch for a call to NtWriteVirtualMemory with a handle to svchost.exe, and let it\nrun till all the sections have been copied. We would know it’s done when NtResumeThread is\ncalled.\n\n\n-----\n\nAfter dumping the executable from memory, we would have to fix the section headers raw\naddresses before we can use IDA Pro to look at it. I’ve mentioned how to do this with CFF\nexplorer in one of my earlier posts.\n\nA quick look at strings within this dumped file reveals the tell-tale BlackNix strings:\n\nThe SETTINGS strings looks identical to what was seen in inte.exe, including the Chinese\nwords 初始 and the server password ‘root’. The function that is responsible for reading the\nSETTINGS strings and building the callback data structure is identical to inte.exe’s as well (and\nhence the callback data structure is also the same).\n\nI am certain that we are looking at the same variant of BlackNix RAT here.\n\n\n-----\n\n**So, they are all the same BlackNix variant. Now what?**\n\nThis journey started from some unique mutexes found in a malware (one BBSRAT) that calls\nback to one of known Winnti Group’s infrastructure. The same set of mutexes, some overlaps\nin code logic (in the naming of files and lateral movement using RDP shared drives), as well as\nclose time proximity in compilation timestamps, suggested relationship between that one\n_BBSRAT and the set of BlackNix RATs (Project1.exe)._\n\nIn addition to the mutexes, I noticed other similarities in Project1.exe’s execution and the\n_Trochilus RAT dropper csres.exe described in Trend Micro’s Uncovering DRBControl report[3],_\nspecifically in the names of the files and service created and path to malicious binary:\n\n\n-----\n\n- system.exe\n\n- SESSRV\n\n- c:\\ProgramData\\Microsoft\\DeviceSync\n\nI get reminded of my earlier speculation that system.exe is a generic tool used to deliver/spread\nthe payload (be it BlackNix or Trochilus RAT). I’ll never know for sure till I get my hands on\nsome more samples ;)\n\n**Last Words**\n\nIs Winnti Group also behind the set of BlackNix RATs that were under scrutiny in this post?\nThere might be a good chance this is true. However, one other interesting finding that I came\nacross was that the C2 domain msdnsoft[.]lang32[.]com as well as the corresponding binary\n(SHA256: 873dfa94f924d59ceff4efb277fef5a251d7b648605c5239fc2ac0885ba32bd5) were\nlinked to an adversary group named “Lang32” by QiAnXin Technology[4]. This adversary group\nis said to target victims in Southeast Asia. Perhaps I should look into the tools used by this\ngroup as well…\n\nBut that’s a different long story for another time, that’s it for now!\n\nReferences:\n\n[1]: http://www.hexacorn.com/blog/2014/12/05/the-not-so-boring-land-of-borland-executablespart-1/\n\n[2]: [https://twitter.com/james_inthe_box/status/1151972438692921344](https://twitter.com/james_inthe_box/status/1151972438692921344)\n\n[3]: “Operation DRBControl: Uncovering a Cyberespionage Campaign Targeting Gambling\nCompanies in Southeast Asia”, Trend Micro, 18 Feb 2020\n\n[4]: [https://www.secrss.com/articles/12463](https://www.secrss.com/articles/12463)\n\n~~\n\n## Asuna\n\n### The latest Tweets from Asuna (@AsunaAmawaka). [Malware Analyst]. Binary World\n\ntwitter.com\n\nDrop me a DM if you would like to share findings or samples ;)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-06 - Shadows with a chance of BlackNix.pdf"
    ],
    "report_names": [
        "2020-05-06 - Shadows with a chance of BlackNix.pdf"
    ],
    "threat_actors": [
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e254cf33-e7f5-407b-a8a1-1a856a9f1c71",
            "created_at": "2025-01-21T02:00:03.599871Z",
            "updated_at": "2025-03-27T02:00:03.480307Z",
            "deleted_at": null,
            "main_name": "Operation DRBControl",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation DRBControl",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6d2910b0-9fea-46a2-84e6-a043b1e023e4",
            "created_at": "2022-10-25T16:07:23.946958Z",
            "updated_at": "2025-03-27T02:02:10.044112Z",
            "deleted_at": null,
            "main_name": "Operation DRBControl",
            "aliases": [],
            "source_name": "ETDA:Operation DRBControl",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535715,
    "ts_updated_at": 1743041835,
    "ts_creation_date": 1653678110,
    "ts_modification_date": 1653678110,
    "files": {
        "pdf": "https://archive.orkl.eu/972057f8356ec04c6ac24fbff7b13baa7f867c88.pdf",
        "text": "https://archive.orkl.eu/972057f8356ec04c6ac24fbff7b13baa7f867c88.txt",
        "img": "https://archive.orkl.eu/972057f8356ec04c6ac24fbff7b13baa7f867c88.jpg"
    }
}