{
    "id": "01f4c850-71a8-4054-a746-6e51987ba536",
    "created_at": "2023-01-12T15:09:19.874132Z",
    "updated_at": "2025-03-27T02:06:08.765389Z",
    "deleted_at": null,
    "sha1_hash": "6c348c47e088499e99d6f608f1af4fb298f2a309",
    "title": "2019-01-30 - Fake Cisco Job Posting Targets Korean Candidates",
    "authors": "",
    "file_creation_date": "2022-05-27T21:58:13Z",
    "file_modification_date": "2022-05-27T21:58:13Z",
    "file_size": 1297091,
    "plain_text": "# Fake Cisco Job Posting Targets Korean Candidates\n\n**[blog.talosintelligence.com/2019/01/fake-korean-job-posting.html](https://blog.talosintelligence.com/2019/01/fake-korean-job-posting.html)**\n\n## Executive summary\n\nCisco Talos recently observed a targeted malware campaign being leveraged in an attempt\nto compromise specific organizations. The infection vector associated with this campaign\n\n\n-----\n\nwas a Microsoft Word document that was disguised as a job posting for Cisco Korea, and\nleveraged legitimate content available as part of job postings on various websites. EST\nSecurity also [described this campaign in a blog post this week. This malicious Office](https://blog.alyac.co.kr/2105)\ndocument appears to have been the initial portion of what was designed to be a multi-stage\ninfection process.\n\nDuring our analysis of this campaign, we located additional samples that we believe are\nlinked to multiple previous campaigns associated with the same threat actor. Each of the\ncampaigns leveraged malicious documents and initial stage payloads that all featured similar\ntactics, techniques, and procedures (TTP). Due to the targeted nature of this campaign, the\nlack of widespread indicator of compromise data, and the apparent nature of the targeting,\nthis appears to be associated with a sophisticated attacker. This sort of attack has become\nmore common as threat actors continue to target users to gain an initial foothold in\nenvironments. Organizations are encouraged to employ a defense-in-depth approach to\nsecurity and disallow the execution of macros where possible.\n\n## Malicious Office document\n\nThe malicious document purports to relate to an employment opportunity with Cisco in Korea\nwith the name \"Job Descriptions.doc.\" The contents of the document match legitimate job\ndescriptions that are available online. Below is a screenshot showing the contents of the\ndecoy document.\n\n\n-----\n\nThe contents of this document appear to be copied from job descriptions that are publicly\navailable online. Here's an example of these documents:\n\n\n-----\n\nThe file metadata associated with the Word document indicates that it may have been\ncreated in 2018, but was last saved on Jan. 29, 2019.\n\nThe Microsoft Word document contains malicious macros that are responsible for extracting\na malicious PE32 executable called \"jusched.exe\" (the same name than the Java updater\nbinary) which is dropped into %APPDATA%\\Roaming. The macro is obfuscated:\n\n\n-----\n\nThe encoded string is a PE32 executable encoded with the XOR key: 0xe7. Below is the\ndecoded value of the variable str(1), which we can identify as a PE header:\n\nThe functionality present in the PE32 is described in the next section.\n\n## First-stage malware payload\n\n### Binary purpose\n\nThe PE32 executable attempts to contact the command and control (C2) server over HTTP,\npresumably to retrieve additional instructions (script or PE32 executable) for execution on\nthe infected system.\n\n\n-----\n\nUnfortunately, at the time of our analysis, the second-stage payload was no longer available\nand the HTTP requests resulted in HTTP 404 messages. The domain contacted is a\nlegitimate website that had been compromised and was being used to host malicious content\n(www[.]secuvision[.]co[.]kr/).\n\n### API obfuscation\n\nThe attackers hid four specific API calls. The APIs are not listed in the import table, but they\nare loaded dynamically using GetProcAddess(). The function names are obfuscated to make\nstatic analysis more difficult. Here's one example:\n\nWe can see the library name (kernel32.dll) but not the function name (3ez7/+r7zuzx/fvt7d8=).\nThe string is decoded by using mathematical byte operations. Below are the decoded APIs:\n\n3ez7/+r7zuzx/fvt7d8= ->            CreateProcessA()\n\n2vvy++r7y+zy3f/99vvb8Ors598= ->   DeleteURLCacheEntryA()\n\ny8zS2vHp8PLx//rK8dj38vvf ->       URLDownloadToFileA()\n\ny8zS0e778M3q7Pv/898= ->         URLOpenStreamA()\n\nThe APIs are linked to the process creation, as well as network communications. We assume\nthe attackers were attempting to hide suspicious APIs from static analysis detection engines\nthat use the import table. The C2 server is listed in plain text, indicating that this functionality\nwas not implemented to thwart manual analysis.\n\n\n-----\n\n## Links to previous campaigns\n\nDuring our analysis of this campaign, we identified several additional samples that we\nbelieve are linked to this campaign.\n\n### Case 1\n\nOne of these related samples was used in August 2017 and featured the filename \"주요 IT\n정보보호 및 보안 업체 리스트.zip\" (\"List of major IT information security and security\ncompanies\"). The ZIP archive contains an Office document that features the same macros\nas the original sample, but is responsible for dropping a different PE32 executable. The\nmacros also use the same XOR key as the original sample.\n\nThis document describes a list of companies with a summary of their products.\n\n\n-----\n\nThe macros were responsible for dropping a different PE32 executable, that was also called\n\"jusched.exe.\" The API obfuscation algorithm used in this campaign was the same as the\none used in our original sample. Below is a screenshot showing the code execution flow in\nboth samples. On the left is the sample from August 2017. On the right is the sample from\nJanuary 2019.\n\nThe C2 server in this campaign was www[.]syadplus[.]com, which is another legitimate\nwebsite that was compromised.\n\nThe SHA256 of the Office document is:\n809b1201b17a77732be3a9f96a25d64c8eb0f7e7a826c6d86bb2b26e12da7b58.\n\nThe SHA256 of the PE32 executable is:\nadfb60104a6399c0b1a6b4e0544cca34df6ecee5339f08f42b52cdfe51e75dc3.\n\n### Case 2\n\nThe second campaign we identified was observed in November 2017. In this case, the\nfilename was \"이력서_자기소개서.xls\" (\"Resume _ self introduction\"). Similar to the\npreviously described campaigns, this document leveraged the same macro execution and\nXOR key, but was responsible for dropping another PE32 executable.\n\n\n-----\n\nIn this campaign, the malicious document was simply an empty resume template.\n\nThe C2 server used in this campaign was ilovesvc[.]com, another example of a legitimate\nwebsite that had been compromised by the threat actor and used to host malicious content.\n\nThe SHA256 of the Office document is:\nbf27c1631ef64c1e75676375a85d48f8ae97e1ea9a5f67c2beefc02c609fc18b.\n\nThe SHA256 of the PE32 is:\n1497ab6ddccf91ef7f2cd75ce020bb3bf39979210351deaa6e0025997ddfda5a.\n\n## Conclusion\n\nThese campaigns demonstrate the increasingly sophisticated nature of attacks that are being\nleveraged by threat actors attempting to compromise organizations around the world. In this\nmost recent campaign, the attackers took the content of legitimate job postings and used that\nin an attempt to add legitimacy to the malicious Office documents being delivered to potential\nvictims. The use of the same TTPs across multiple campaigns over a long period\ndemonstrates that this threat actor has been operational for years, and is continuing to\noperate to achieve their mission objectives. Cisco Talos continues to monitor the global\nthreat landscape to ensure that customers remain protected from these as well as additional\nattacks that may be observed in the future.\n\n\n-----\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[Cisco Cloud Web Security (CWS) or](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html) [Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), andMeraki MX can detect malicious activity](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## Indicators of Compromise (IOCs)\n\nThe following IOCs are associated to this campaign:\n\n### Malicious Office Documents\n\n\n-----\n\n7af59922d4c1b4f2d589cb2853afb543b37a1f23da0cf0180a693f9748e05906 (SHA256)\nbf27c1631ef64c1e75676375a85d48f8ae97e1ea9a5f67c2beefc02c609fc18b (SHA256)\n809b1201b17a77732be3a9f96a25d64c8eb0f7e7a826c6d86bb2b26e12da7b58 (SHA256)\n\n### Malicious PE32 Executables\n\ne259aa1de48fd10b7601c4486b841428fbd6cd1a4752cf0d3bbe1799116ae6e6 (SHA256)\n\ncd2e8957a2e980ffb82c04e428fed699865542767b257eb888b6732811814a97 (SHA256)\n\n1497ab6ddccf91ef7f2cd75ce020bb3bf39979210351deaa6e0025997ddfda5a (SHA256)\n\nadfb60104a6399c0b1a6b4e0544cca34df6ecee5339f08f42b52cdfe51e75dc3 (SHA256)\n\n### Domains\n\nIt is important to note that in all of the campaigns that we observed, the domains being\nleveraged by the malware were legitimate websites that had been compromised by the threat\nactor for the purposes of hosting malicious content:\n\nwww[.]secuvision[.]co[.]kr\n\nilovesvc[.]com\n\nwww[.]syadplus[.]com\n\nBelow is a screenshot showing how AMP can protect customers from this threat.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-30 - Fake Cisco Job Posting Targets Korean Candidates.pdf"
    ],
    "report_names": [
        "2019-01-30 - Fake Cisco Job Posting Targets Korean Candidates.pdf"
    ],
    "threat_actors": [
        {
            "id": "93542ae8-73cb-482b-90a3-445a20663f15",
            "created_at": "2022-10-25T16:07:24.058412Z",
            "updated_at": "2025-03-27T02:02:10.093621Z",
            "deleted_at": null,
            "main_name": "PKPLUG",
            "aliases": [
                "Stately Taurus"
            ],
            "source_name": "ETDA:PKPLUG",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536159,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653688693,
    "ts_modification_date": 1653688693,
    "files": {
        "pdf": "https://archive.orkl.eu/6c348c47e088499e99d6f608f1af4fb298f2a309.pdf",
        "text": "https://archive.orkl.eu/6c348c47e088499e99d6f608f1af4fb298f2a309.txt",
        "img": "https://archive.orkl.eu/6c348c47e088499e99d6f608f1af4fb298f2a309.jpg"
    }
}