{
    "id": "01f6ac70-3b42-4ca1-b9ca-44f0e98d5f19",
    "created_at": "2023-01-12T15:04:24.337327Z",
    "updated_at": "2025-03-27T02:09:00.908227Z",
    "deleted_at": null,
    "sha1_hash": "7ac29552e8c8c311921f35dd24d26c32721e2b92",
    "title": "2020-08-26 - Threat Actor Profile- TA2719 Uses Colorful Lures to Deliver RATs in Local Languages",
    "authors": "",
    "file_creation_date": "2022-05-28T22:06:16Z",
    "file_modification_date": "2022-05-28T22:06:16Z",
    "file_size": 1079225,
    "plain_text": "# Threat Actor Profile: TA2719 Uses Colorful Lures to Deliver RATs in Local Languages\n\n**[proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages](https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages)**\n\nAugust 25, 2020\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nThreat Actor Profile: TA2719 Uses Colorful Lures to Deliver RATs in Local Languages\n\n\n-----\n\nAugust 26, 2020 The Proofpoint Threat Research Team\n\nIn late March 2020, Proofpoint researchers began tracking a new actor with a penchant for\nusing [NanoCore and later AsyncRAT, popular commodity remote access trojans (RATs).](https://www.proofpoint.com/us/corporate-blog/post/attackers-expand-coronavirus-themed-attacks-and-prey-conspiracy-theoriesd-coronavirus-themed-attacks-and-prey-conspiracy-theories)\nDubbed TA2719 by Proofpoint, the actor uses localized lures with colorful images that\nimpersonate local banks, law enforcement, and shipping services. To date, Proofpoint has\nobserved this actor send low volume campaigns to recipients in Austria, Chile, Greece,\nHungary, Italy, North Macedonia, Netherlands, Spain, Sweden, Taiwan, United States, and\nUruguay.\n\nBelow are recent lure examples, message volume, geo targeting, and payload\ndetails. While lures are customized for various geographies and impersonate individuals\nassociated with the spoofed entities, no vertical targeting has been observed. This\nactor typically delivers malware via malicious attachments, though URLs linking to malicious\nfiles were used as a delivery mechanism in early campaigns. TA2719 often relies on widely\navailable resources, such as commodity malware and free hosting providers, to execute their\ncampaigns.\n\n**Lures**\n\nMost lures observed appear to be from a real person with a connection to the spoofed\norganization. Even details like the street address in the alleged sender’s signature are often\naccurate. Combined with the branding, these details attempt to boost legitimacy of the\nmessage. They could still appear legitimate to an intended recipient who chooses to search\nfor the sender’s name or address before opening the attached file or clicking a link in the\nmessage.\n\nCampaigns observed during March-May 2020 were primarily law enforcement-themed. Using\nlocal languages and logos from local law enforcement agencies, the subject lines often\nattempted to create urgency by claiming, “ขอความดวนจากสํานักงานตํารวจแหงชาติ (Urgent\n\n\n-----\n\nmessage from the Royal Thai\nPolice),” or “Последната полициска покана пред апсењето (The last police invitation before\nthe arrest)” (Figures 1, 2).\n\n_Figure 1: Email lure spoofing Royal Thai Police_\n\n\n-----\n\n_Figure 2: Email lure impersonating the Police of North Macedonia, appearing to come_\n_from the State Secretary of the North Macedonian Ministry of Internal Affairs_\n\nIn addition to law enforcement-themed lures, some messages sent during this time spoofed\nshipping notifications. One early campaign also preyed on COVID-19 fears and impersonated\nthe Taiwan Centers for Disease Control (Figure 3). This campaign was notable not only\nbecause of the theme, but also because it leveraged both URLs and attachments to deliver\nthe payload. Typically, TA2719 uses attachments or URLs, but rarely a mix of both in a single\ncampaign.\n\n\n-----\n\n_Figure 3: Email lure impersonating the Taiwan Centers for Disease Control and appearing to_\n_be from its director, Jih-Haw Chou_\n\n\n-----\n\nIn early June 2020, Proofpoint observed a shift away from law enforcement lures as TA2719\nbegan to use more common bank, shipping, and purchase order lures (Figures 4, 5).\n\n_Figure 4: Swedish email lure impersonating SEB, with subject, “incoming payment notification_\n_from a third party bank”_\n\n\n-----\n\n_Figure 5: Email lure with fraudulent purchase order from Orascom Trading_\n\nLures continued to be bank-themed in late June, with subjects like,\n“Εισερχόμενη επιταγή πληρωμής (Incoming payment notification)” (Figure 6).\n\n\n-----\n\n_Figure 6: Email lure impersonating a Greek bank_\n\nAs of mid-July, TA2719 shifted to exclusively using package delivery lures,\nimpersonating shipping companies and using subject lines like, “Your parcel from\nMrs. Garn has arrived at our office,” or “您从中国寄来的包裹已经到了我们办公室（陈先生的包\n裹）”(The package you sent from China has arrived at our office (Mr. Chen's\npackage)” (Figure 7).\n\n\n-----\n\n_Figure 7: Email lure with fraudulent package notification_\n\n**Volume**\n\nCampaign message volume has been relatively low, with a few dozen or few hundred\nmessages per campaign. Total monthly message volume peaked in May but has since\nreturned to levels closer to those observed in March and April. Since late March, Proofpoint\nhas observed several TA2719 campaigns per month. The message volume spike in May\nwas driven by fewer campaigns with over 2,000 messages each, rather than multiple smaller\ncampaigns seen in other months.\n\n\n-----\n\n**Targeting**\n\nThough the campaigns don’t appear to have any vertical targeting, they are carefully crafted\nfor specific regions. Various languages and references to legitimate local entities, such as\nbanks or law enforcement organizations, have been observed:\n\n**Country** **Language** **Lure Themes Observed**\n\nAustria German Police\n\nChile Spanish Shipping\n\nGreece Greek Police, banking\n\nHungary Hungarian Police, banking\n\nItaly Italian Police\n\nNetherlands Dutch Police\n\n\n-----\n\nNorth Macedonia Macedonian Police, shipping\n\nSingapore English Police\n\nSpain Spanish Police, shipping\n\nSweden Swedish Police, banking\n\nTaiwan Chinese CDC, shipping\n\nThailand Thai Police\n\nUruguay Spanish Police\n\nUnited States English Shipping\n\nIntended recipients often have easily searchable profiles online, and TA2719 also sends to\nrole-based email addresses. This suggests that there is little targeting at the individual\nrecipient level, but that the recipient lists may be more opportunistic in nature and compiled\nusing basic OSINT techniques.\n\n**Delivery and Payload**\n\nFrom March to early July, NanoCore was distributed primarily\nthrough emailed ISO file attachments. Several campaigns instead used URLs linking to\nmalicious ISO files. Finally, sometimes the actor attempted to deliver a mix of attachments and\nURLs in the same email. When using URLs, ISO files were hosted on compromised\nsites or file hosting services.\n\nIn mid-July, the actor pivoted from distributing NanoCore to AsyncRAT, another commodity\nRAT. Like NanoCore, AsyncRAT has been advertised on forums and as of May 2020, appears\n[to still be under active development with new features released May 10, 2020.](https://github.com/NYAN-x-CAT/AsyncRAT-C-Sharp/commits/master/AsyncRAT-C%23)\n\nAcross all campaigns observed by Proofpoint, the ISO files had a generic name, such\nas ‘Document.iso’ or ‘pdf.iso’. Once the user opens the ISO–which opens like any other folder\non the computer–they then must double click the malware executable file inside to run it.\n\nThe C&C hostnames and IPs used by TA2719 appear to be relatively stable, changing roughly\nonce per month. This actor sometimes uses free dynamic DNS (DDNS) providers for\ntheir C&C.\n\n\n-----\n\n**Conclusion**\n\nWhile not the most advanced lures we’ve seen, the localization and inclusion of legitimate\nstreet addresses and names of real individuals related to the spoofed entities demonstrate this\nactor’s attention to detail. Though TA2719 does not appear to target any particular\nindustry, they tailor their messages to various geographies and send medium-volume\ncampaigns several times per month. Their use of free DDNS providers, reuse of\ninfrastructure, and reliance on commodity malware demonstrate the ease with which threat\nactors can begin and maintain an operation.\n\n**IOCs**\n\nNanoCore\nAttachment\nSHA256: 6489bbcdd9e0588d6e4ee63e5f66346e7d690ac3b7ee5249436fb1db8abc6453\nMalware SHA256: 1b93790c002d5216822277c6b8abb36dfd5daf9ebc14553135c992f64f8d949e\nC&Cs: 172.111.188[.]199, megaida123.ddns.net\n\nAsyncRAT\nAttachment\nSHA256: 161eaa18e31aec64433158da81eea99e518659e06ed36e2052508a7cbeb688c6\nMalware\nSHA256: bcc0be90110b3b960230a366f1be67904704f87645ff5fde69536432d73feace\nC&C: 194.5.98[.]8\n\n**ET + ETPRO Signatures**\n\nNanoCore:\nETPRO MALWARE NanoCore RAT Keep-Alive Beacon - 2816718\n\nAsyncRAT:\nETPRO MALWARE Observed Malicious SSL Cert (AsyncRAT Server) - 2836595\n\n**Additional References**\n\n[Vendetta-new threat actor from Europe](https://blog.360totalsecurity.com/en/vendetta-new-threat-actor-from-europe/)\n\n[Fake emails in the name of the Spanish national police](https://twitter.com/abuse_ch/status/1268146786297942017)\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-26 - Threat Actor Profile- TA2719 Uses Colorful Lures to Deliver RATs in Local Languages.pdf"
    ],
    "report_names": [
        "2020-08-26 - Threat Actor Profile- TA2719 Uses Colorful Lures to Deliver RATs in Local Languages.pdf"
    ],
    "threat_actors": [
        {
            "id": "40451441-a311-494f-8025-fdbad7a527d4",
            "created_at": "2024-02-06T02:00:04.114318Z",
            "updated_at": "2025-03-27T02:00:03.318668Z",
            "deleted_at": null,
            "main_name": "TA2719",
            "aliases": [],
            "source_name": "MISPGALAXY:TA2719",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0cfbbc-2acf-4cc8-afe1-1859679c522c",
            "created_at": "2022-10-25T16:07:24.373716Z",
            "updated_at": "2025-03-27T02:02:10.198532Z",
            "deleted_at": null,
            "main_name": "Vendetta",
            "aliases": [
                "TA2719"
            ],
            "source_name": "ETDA:Vendetta",
            "tools": [
                "AsyncRAT",
                "Atros2.CKPN",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "ReZer0",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "RoboSki",
                "Socmer",
                "Zurten"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535864,
    "ts_updated_at": 1743041340,
    "ts_creation_date": 1653775576,
    "ts_modification_date": 1653775576,
    "files": {
        "pdf": "https://archive.orkl.eu/7ac29552e8c8c311921f35dd24d26c32721e2b92.pdf",
        "text": "https://archive.orkl.eu/7ac29552e8c8c311921f35dd24d26c32721e2b92.txt",
        "img": "https://archive.orkl.eu/7ac29552e8c8c311921f35dd24d26c32721e2b92.jpg"
    }
}