{
    "id": "01fba819-af8c-4ed5-ac3e-d2224e19b70d",
    "created_at": "2023-01-12T15:04:40.720491Z",
    "updated_at": "2025-03-27T02:09:18.51246Z",
    "deleted_at": null,
    "sha1_hash": "0f8a7838b43410237f3c4935635db184a45c58de",
    "title": "2020-10-12 - A Look Inside The TrickBot Botnet",
    "authors": "",
    "file_creation_date": "2022-05-28T04:58:38Z",
    "file_modification_date": "2022-05-28T04:58:38Z",
    "file_size": 379538,
    "plain_text": "# A Look Inside The TrickBot Botnet\n\n**blog.lumen.com/a-look-inside-the-trickbot-botnet/**\n\n[Black Lotus Labs Posted On October 12, 2020](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/a-look-inside-the-trickbot-botnet/#respond)\n\n0\n\nShares\n\n\nOctober 12, 2020\n\n\n[Bolstered by contributions from Black Lotus Labs and others, Microsoft and FS-ISAC](https://www.lumen.com/en-us/security/black-lotus-labs.html)\n[recently took court action to disrupt a particularly insidious botnet called TrickBot – a](https://blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/)\nsignificant source of ransomware and banking credential theft.\n\n\n-----\n\n[As the threat intelligence arm of Lumen Technologies, Black Lotus Labs exists to defend a](http://www.lumen.com/)\nclean internet, and we collaborate with other threat intelligence and security companies to do\njust that. In the Microsoft TrickBot case, we provided intelligence and a legal declaration that\nwas filed with the court in support of Microsoft’s application for a temporary restraining order\nto halt TrickBot’s operations\n\nThis type of industry collaboration is key to disrupting bad actors’ activities and increasing\ntheir cost of doing business.\n\n## A (Brief) History of TrickBot\n\nTrickBot (a.k.a. The Trick, Trickbot, or TrickLoader) is a dangerous and widespread botnet\nthat has operated with relative impunity since it emerged in 2016. It is believed to have\n[evolved from an earlier botnet known as Dyre or](https://fidelissecurity.com/threatgeek/archive/trickbot-we-missed-you-dyre/) [Dyreza. From its onset, TrickBot had the](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\nability to steal credentials when a user accessed banking websites from an infected machine;\nhence, it was initially categorized as a banking trojan.\n\nThe criminal gang behind TrickBot has regularly updated its malicious software, adding\nmodules with new functionality to increase its effectiveness and potential to cause harm.\nThey have incorporated tools such as Mimikatz and Cobalt Strike – often used by\npenetration testers and criminal attackers – to map victim networks, steal operating system\ncredentials, and spread inside organizations. By 2018, the one-time banking trojan had\n[clearly evolved to become a loader for other malware, including Ryuk ransomware.](https://securityintelligence.com/the-business-of-organized-cybercrime-rising-intergang-collaboration-in-2018/)\n\nBotnets are often built with a single or small number of fixed controllers, referred to as\ncommand-and-control servers, or C2s. If TrickBot had a single server providing C2\ncapabilities, the groups monitoring TrickBot – including Black Lotus Labs – would have\nsuccessfully neutered it by now. Instead, TrickBot has evolved to use a complex\ninfrastructure that compromises third-party servers and uses them to host malware. It also\ninfects consumer appliances such as DSL routers, and its criminal operators constantly\nrotate their IP addresses and infected hosts to make disruption of their crime as difficult as\npossible. To add to the complexity, different C2s may serve different purposes. For example,\none group of servers (“core C2s”) might communicate directly with the bots, and another\ngroup (“plugin servers”) might serve up plugin modules after the initial infection.\n\n## An Earlier Disruption Attempt\n\nOur collaboration with Microsoft was not the industry’s first attempt to disrupt TrickBot. A few\nweeks prior to our collaborative effort, we learned that bots were receiving TrickBot\nconfigurations to replace the list of active C2 server IPs with reserved addresses (127.0.0.1,\n0.0.0.0). These configurations prevented communication to the C2s, in effect blocking the\ninfected bot from participating in the botnet. The unusual configurations were revealed\npublicly in early October, but the identity of the responsible parties remains a mystery.\n\n\n-----\n\nWhile this disruption did remove some bots from the botnet, it did not prevent new infections\nfrom occurring because the botnet infrastructure remained intact. In fact, during the week of\nOctober 6, the TrickBot infections continued, with one of our partners even witnessing new\nTrickBot installations being delivered from another nefarious botnet – Emotet.\n\n## Black Lotus Labs vs. TrickBot\n\nFor several years, Black Lotus Labs has used the data from our global network visibility to\ntarget numerous malware families to better understand them, track their activity, and disrupt\nor mitigate their malicious activity. In 2019, we focused on TrickBot by reverse-engineering a\nTrickBot malware sample and writing a validator that allowed us to add detection of TrickBot\nC2s to our monitoring systems.\n\n### Reverse Engineering\n\nWith TrickBot, an infected host contacts the C2, which sends back commands to execute or\nsoftware to download. The goal of reverse engineering is to understand these exact\ncommunication protocols and encryption techniques so we can validate C2s.\n\nBecause we don’t have access to the original source code, a reverse engineer on the Black\nLotus Labs team must dissect the contents of the binary executable itself. Developers of\nmalware actively seek to make such analyses more difficult by encoding, packing, and even\nencrypting sections of the file. By hiding the presence of character strings that might reveal\nuseful information such as C2 IP addresses, commands, and encryption keys. Our team’s\ngoal in reverse engineering is to understand more about how the malware operates in a\nnetwork environment in order to detect and monitor it across our global network.\n\nWhen TrickBot infects a machine, the malware generates a unique bot identifier (ID), and\ncommunications to the C2 include both the bot ID and a short group tag (referred to in the\nTrickBot configuration files as “gtag”) which indicate the campaign leading to the infection.\nThe gtag used in TrickBot campaigns typically has three or four letters and one to four digits,\nsuch as “tmt2’” “ono76,” “chil45” or “mor124.” The TrickBot communication protocol itself\nimplements one- to two-digit commands to update the bot software, download additional\nmodules and their configurations, or even download a different malware entirely (such as\nransomware). Communications from the C2 to the bot are encrypted (making it more difficult\nfor network monitoring to discern the contents of the communications) and include a digital\nsignature (protecting the integrity of messages).\n\n\n-----\n\n### Validating\n\nAfter we finish reverse-engineering the TrickBot sample, our team writes a validator, which\nsimulates bot communication to the C2s. This enables us to confirm that a suspected C2\nserver was responding in the manner unique to TrickBot. We regularly monitor C2s to track\nchanges in the TrickBot infrastructure so we know when a C2 has gone offline. In addition to\ncore C2s, we validate plugin servers, which together represent an important subset of the\noverall TrickBot infrastructure.\n\nLeveraging our network visibility, we also identify infected bots by examining communication\nwith confirmed C2s. We use machine learning algorithms that monitor our network data to\nidentify other suspected C2s by training a classifier on network characteristics from C2 traffic.\nAdditionally, we review third-party reports of suspicious behavior, and subsequently test\nthose suspected C2s using our validator.\n\nOnce we confirm active C2s, we submit abuse notifications to the relevant ISPs and hosting\nproviders to have the C2s taken down. In the past year, Black Lotus Labs has seen more\nthan 500 IP addresses serving as active TrickBot C2s.\n\nBased on our data, below are the top 15 countries where we saw hosting TrickBot C2s,\nweighted by the number of days a C2 was active:\n\n**Country Name** **C2s * Days Active**\n\n\n-----\n\nIndonesia 1,362\n\nColombia 652\n\nEcuador 637\n\nUnited States 362\n\nThailand 330\n\nCambodia 285\n\nNetherlands 232\n\nParaguay 174\n\nIndia 165\n\nBrazil 159\n\nRussia 156\n\nArgentina 154\n\nGermany 135\n\nIran 86\n\nBangladesh 86\n\n### What’s Next\n\n\n-----\n\nBlack Lotus Labs will continue to closely monitor to see what impact the collaboration with\nMicrosoft has had on TrickBot’s infrastructure and activities, and we hope to learn more for\nfuture disruption efforts. While our work might not remove the threat posed by TrickBot, it will\nraise the cost of doing business for the criminal gang behind the botnet because they will be\nforced to divert resources away from exploitation activities in order to rebuild the parts of\ntheir infrastructure that we disrupted. Meanwhile, we will continue our work to notify victims,\nnull route traffic for malicious servers, disrupt botnets and other malicious activity, and share\nintel with partners in our efforts to make the internet a safer place for all.\n\n### Indicators of Compromise:\n\n**Sample hash:**\n\n4691a862842f286924357f074927b4e9f276c6073458e3dd4c66218cf4918ea1\n\n**C2 IPs:**\n\n5.152.210[.]188 27.147.173[.]227 36.91.45[.]10 45.138.158[.]33\n\n5.182.210[.]224 36.66.218[.]117 36.91.87[.]227 45.148.10[.]174\n\n5.182.211[.]124 36.89.182[.]225 36.94.33[.]102 45.66.10[.]22\n\n5.182.211[.]138 36.89.243[.]241 45.127[.]222.8 45.89.125[.]148\n\n45.89.127[.]27 181.129.134[.]18\n\n51.77.112[.]252 181.143.186[.]42\n\n51.83.196[.]234 182.253.113[.]67\n\n51.89.215[.]186 185.14.30[.]247\n\n62.108[.]35.9 185.142.99[.]94\n\n80.210.32[.]67 185.172.129[.]100\n\n83.220.171[.]175 185.234.72[.]114\n\n85.204.116[.]117 185.234.72[.]35\n\n89.249.65[.]53 185.236.202[.]249\n\n91.200.100[.]71 185.25.51[.]139\n\n91.200.103[.]236 185.99.2[.]106\n\n92.38.135[.]61 185.99.2[.]115\n\n\n-----\n\n92.62.65[.]163 186.159.8[.]218\n\n93.189.42[.]225 190.136.178[.]52\n\n96.9.73[.]73 190.145.83[.]98\n\n96.9.77[.]142 190.152.182[.]150\n\n96.9.77[.]56 190.214.28[.]74\n\n103.111.83[.]246 190.99.97[.]42\n\n103.12.161[.]194 192.3.246[.]216\n\n103.196.211[.]120 194.5.249[.]214\n\n103.221.254[.]102 194.5.249[.]215\n\n103.36.48[.]103 194.87.236[.]171\n\n103.76.169[.]213 195.123.238[.]83\n\n104.161.32[.]108 195.123.239[.]193\n\n104.161.32[.]118 195.123.240[.]18\n\n107.155.137[.]15 195.123.240[.]93\n\n110.93.15[.]98 195.123.241[.]224\n\n112.109.19[.]178 195.123.241[.]229\n\n117.252.214[.]138 195.161.62[.]25\n\n121.100.19[.]18 200.116.159[.]183\n\n121.101.185[.]130 200.116.232[.]186\n\n122.50.6[.]122 200.171.101[.]169\n\n129.232.133[.]39 200.29.119[.]71\n\n131.161.253[.]190 201.231.85[.]50\n\n139.60.163[.]45 212.22.70[.]59\n\n156.96.46[.]27 220.247.174[.]12\n\n158.181.155[.]153\n\n176.31.28[.]85\n\n\n-----\n\n177.190.69[.]162\n\n179.127.88[.]41\n\n180.211.170[.]214\n\n181.112.157[.]42\n\n181.129.104[.]139\n\n[Black Lotus LabsCybersecurityCybersecurity Attacks](https://blog.lumen.com/tag/black-lotus-labs/)\n\nAuthor\n\n**Black Lotus Labs**\n\nThe mission of Black Lotus Labs is to leverage our network visibility to help protect\ncustomers and keep the internet clean.\n\nTrending Now\n\nYou may also like\n\n\n-----\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-12 - A Look Inside The TrickBot Botnet.pdf"
    ],
    "report_names": [
        "2020-10-12 - A Look Inside The TrickBot Botnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535880,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653713918,
    "ts_modification_date": 1653713918,
    "files": {
        "pdf": "https://archive.orkl.eu/0f8a7838b43410237f3c4935635db184a45c58de.pdf",
        "text": "https://archive.orkl.eu/0f8a7838b43410237f3c4935635db184a45c58de.txt",
        "img": "https://archive.orkl.eu/0f8a7838b43410237f3c4935635db184a45c58de.jpg"
    }
}