{
    "id": "02381e91-ac5c-459e-9530-b625a397f505",
    "created_at": "2022-10-25T16:48:23.391934Z",
    "updated_at": "2025-03-27T02:17:27.748154Z",
    "deleted_at": null,
    "sha1_hash": "588b19b571321e82e811aaf1179803da45f8c6cf",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-08-29T02:55:49Z",
    "file_modification_date": "2019-08-29T02:55:49Z",
    "file_size": 261340,
    "plain_text": "# LYCEUM Takes Center Stage in Middle East Campaign\n\n**[secureworks.com/blog/lyceum-takes-center-stage-in-middle-east-campaign](https://www.secureworks.com/blog/lyceum-takes-center-stage-in-middle-east-campaign)**\n\n**Threats & Defenses**\n_The previously unobserved LYCEUM threat group targeted critical infrastructure organizations_\n_without being detected for more than 12 months._\nTuesday, August 27, 2019 By: Counter Threat Unit Research Team\n\nThe LYCEUM threat group targets organizations in sectors of strategic national importance,\nincluding oil and gas and possibly telecommunications. The activity observed by Secureworks®\nCounter Threat Unit™ (CTU) researchers focuses on obtaining and expanding access within a\ntargeted network.\n\nCTU™ research indicates that LYCEUM may have been active as early as April 2018. Domain\nregistrations suggest that a campaign in mid-2018 focused on South African targets. In May 2019,\nthe threat group launched a campaign against oil and gas organizations in the Middle East. This\ncampaign followed a sharp uptick in development and testing of their toolkit against a public multivendor malware scanning service in February 2019.\n\nStylistically, the observed tradecraft resembles activity from groups such as COBALT GYPSY\n(which is related to OilRig, Crambus, and APT34) and COBALT TRINITY (also known as Elfin\nand APT33). However, none of the collected malware or infrastructure associated with LYCEUM\nhas direct links to observed activity from these or other known threat groups. As of this\npublication, there is insufficient technical evidence to support an attribution assessment.\n\nWhen CTU researchers first published information about LYCEUM to Secureworks Threat\nIntelligence clients, no public documentation on the group existed. Since then, reporting has\n[emerged that refers to the threat group as HEXANE.](https://dragos.com/resource/hexane/)\n\n## The LYCEUM toolkit\n\nLYCEUM initially accesses an organization using account credentials obtained via password\nspraying or brute-force attacks. Using compromised accounts, the threat actors send\nspearphishing emails with malicious Excel attachments to deliver the DanBot malware, which\nsubsequently deploys post-intrusion tools.\n\nCTU researchers have observed LYCEUM using the following tools:\n\n**DanBot — A first-stage remote access trojan (RAT) that uses DNS and HTTP-based**\ncommunication mechanisms and provides basic remote access capability, including the\nabilities to execute arbitrary commands via cmd.exe and to upload and download files\n**DanDrop — A VBA macro embedded in an Excel XLS file used to drop DanBot**\n**kl.ps1 — A PowerShell-based keylogger**\n**[Decrypt-RDCMan.ps1 — Part of the PoshC2 framework](https://github.com/nettitude/PoshC2/blob/master/Modules/Decrypt-RDCMan.ps1)**\n**Get-LAPSP.ps1 — A PowerView-based script from the PowerShell Empire framework**\n\n### DanBot\n\n\n-----\n\nDanBot is written in C# using .NET Framework 2.0 and provides basic remote access capabilities.\nThe DNS channel of DanBot's C2 protocol uses both IPv4 A records and IPv6 AAAA records for\ncommunication. The HTTP channel has evolved slightly since the early 2018 samples but retains\ncommon elements throughout.\n\nFigure 1 shows a typo in DanBot’s hard-coded User-Agent: an ampersand after the operating\nsystem value. Other typos in the code include missing spaces between key elements and the\nmisspelling of ‘Encoding’ in the Accept-Encoding header. The developer consistently used\n“Accept-Enconding” (note the extra ‘n’) in all DanBot samples analyzed by CTU researchers. This\ntypographical error can facilitate network detection for the HTTP-based elements of the C2\nprotocol.\n\n_Figure 1. Early 2019 DanBot sample HTTP request. (Source: Secureworks)_\n\n### DanDrop\n\nThe threat actors use this malicious macro to extract the DanBot payload from the weaponized\ndocument and then Base64-decode and install the malware using a scheduled task. The basic\nform and function of the macro have remained constant across analyzed samples, but the threat\nactors have made incremental improvements to obfuscate the macro and refactor some of the\nfunctionality.\n\n### kl.ps1\n\nkl.ps1 is a custom keylogger that is written in PowerShell and leverages elements of the Microsoft\n.NET Core framework. It captures the window title and keystrokes on infected systems and stores\nthem as Base64-encoded data. It is deployed using a scheduled task and a VBScript file. Figure 2\nshows the command line used to run the keylogger script.\n\n_Figure 2. Reconstructed PowerShell command. (Source: Secureworks)_\n\n### Decrypt-RDCMan.ps1\n\n[Decrypt-RDCMan.ps1 is a component of the PoshC2 penetration testing framework. It is used to](https://github.com/nettitude/PoshC2/blob/master/Modules/Decrypt-RDCMan.ps1)\ndecrypt passwords stored in the RDCMan configuration file, which stores details of servers and\nencrypted credentials to quickly establish remote desktop sessions. Recovered credentials could\ngive the threat actors additional access within the environment. LYCEUM deployed this tool via\nDanBot approximately one hour after gaining initial access to a compromised environment.\n\n\n-----\n\nGet-LAPSP.ps1 is a PowerShell script that gathers account information from Active Directory via\n[LDAP. It appears to contain borrowed code and has been run with an obfuscation script such as](https://raw.githubusercontent.com/ericshoemaker/PowerView/master/Powerview.ps1)\n[invoke-obfuscation. LYCEUM deployed this tool via DanBot shortly after gaining initial access to a](https://github.com/danielbohannon/Invoke-Obfuscation)\ncompromised environment.\n\n## First stops in a new organization: HR and IT\n\nA malicious document (maldoc) that was uploaded to an online virus scanning repository in May\n2019 contains the phrase “Industrial Systems Control Programming”. A superficial analysis of the\ndocument content might conclude that this document was intended for individuals working with\nindustrial control systems (ICS) or operational technology (OT). However, the true content of this\ndocument is a training schedule spanning multiple departments, with ICS being first on the list.\nThis focus on training aligns with LYCEUM’s targeting of executives, HR staff, and IT personnel.\n\nLYCEUM delivers weaponized maldocs via spearphishing from the compromised accounts to the\ntargeted executives, human resources (HR) staff, and IT personnel. The recipient is more likely to\nopen a message if it originates from an internal address. Compromising individual HR accounts\ncould yield information and account access that could be used in additional spearphishing\noperations within the targeted environment and against associated organizations. IT personnel\nhave access to high-privilege accounts and documentation that could help the threat actors\nunderstand the environment without blindly navigating the network to find data and systems of\ninterest.\n\nCTU researchers identified several 2018 campaigns using a “security best practice” theme (see\nFigure 3).\n\n_Figure 3. Phishing decoys used in 2018 LYCEUM campaign. The malicious Excel files dropped_\n_DanBot variants. (Source: Secureworks)_\n\n### No evidence of ICS targeting or capabilities\n\nDespite the initial perception that the maldoc sample was intended for ICS or OT staff, LYCEUM\nhas not demonstrated an interest in those environments. However, CTU researchers cannot\ndismiss the possibility that the threat actors could seek access to OT environments after\nestablishing robust access to the IT environment. Access to, and through, the IT environment is\noften a prerequisite to targeting an OT environment\n\n\n-----\n\nLYCEUM registered infrastructure using the PublicDomainRegistry.com, Web4Africa, and Hosting\nConcepts B.V. registrars. New domains appear to be registered for individual campaigns, and the\nthreat actors generally use the domain within a few weeks of registration. LYCEUM C2 domains\ntypically have a security or web technology theme. Figure 4 lists known and suspected LYCEUM\ninfrastructure and associated creation and expiration data.\n\n_Figure 4. List of known and suspected LYCEUM-operated domains. (Source: Secureworks)_\n\n## Conclusion\n\nLYCEUM is an emerging threat to energy organizations in the Middle East, but organizations\nshould not assume that future targeting will be limited to this sector. Critical infrastructure\norganizations in particular should take note of the threat group’s tradecraft. Aside from deploying\nnovel malware, LYCEUM’s activity demonstrates capabilities CTU researchers have observed\nfrom other threat groups and reinforces the value of a few key controls. Password spraying, DNS\ntunneling, social engineering, and abuse of security testing frameworks are common tactics,\nparticularly from threat groups operating in the Middle East. While there are many security\ncontrols that could mitigate aspects of a LYCEUM intrusion, CTU researchers recommend the\nfollowing to provide broad protection and detection capabilities that apply to a spectrum of threats:\n\nImplement multi-factor authentication (MFA) — Every corporate remote access service\navailable on the Internet, including cloud applications such as Office 365/Outlook, external\nvirtual private networks (VPNs), and single sign-on (SSO) pages, should require users to\nprovide a one-time password in addition to their regular password. However, simply\nsending auto-enrollment emails can allow threat actors to enroll themselves using\ncompromised accounts and continue their operations unhindered.\nIncrease visibility via endpoint detection, response, and logging — Incident response efforts\nare often hampered by a lack of visibility in the environment. This condition may be due to\nthe absence of logs that allow network defenders to forensically piece together what\nhappened or insufficient tools to monitor for ongoing threat actor activity. Endpoint\nmonitoring tools are essential for detecting suspicious activity in the environment after other\ncontrols have been evaded.\nConduct preparedness exercises — Technology solutions cannot address all cybersecurity\nrisks. Employees are both vulnerabilities and assets. Fostering a culture that focuses on\nsecurity awareness and makes it easy for staff to work efficiently in a crisis reduces the\n\n\n-----\n\nthe organization provides insight about what data is and is not important and why.\nThis training will enable staff to contact the correct people inside and outside the\norganization when an incident occurs.\nPhishing awareness — Continuously reinforcing phishing awareness training and\ngiving users an easy way to report suspicious messages helps to detect phishing\ncampaigns early. Organizations should have processes for swift response and\ncontainment if a user executes a malicious payload.\n\n## Threat indicators\n\nTo mitigate exposure to this malware, CTU researchers recommend that organizations use\navailable controls to review and restrict access using the indicators listed in Table 1. Note that IP\naddresses can be reallocated. The IP addresses and domains may contain malicious content, so\nconsider the risks before opening them in a browser.\n\n|Indicator|Type|Context|\n|---|---|---|\n|bsolutions-cloude.com|Domain name|Suspected DanBot C2 server operated by LYCEUM|\n|cybersecnet.co.za|Domain name|DanBot C2 server operated by LYCEUM|\n|cybersecnet.org|Domain name|DanBot C2 server operated by LYCEUM|\n|excsrvcdn.com|Domain name|DanBot C2 server operated by LYCEUM|\n|online-analytic.com|Domain name|DanBot C2 server operated by LYCEUM|\n|web-traffic.info|Domain name|DanBot C2 server operated by LYCEUM|\n|web-statistics.info|Domain name|DanBot C2 server operated by LYCEUM|\n|dnscachecloud.com|Domain name|DanBot C2 server operated by LYCEUM|\n|dnscloudservice.com|Domain name|DanBot C2 server operated by LYCEUM|\n|opendnscloud.com|Domain name|DanBot C2 server operated by LYCEUM|\n|164.132.181.82|IP address|Hosted multiple DanBot C2 domains operated by LYCEUM|\n|198.50.152.162|IP address|Hosted multiple DanBot C2 domains operated by LYCEUM|\n\n\n158.69.187.171 IP\n\ndd\n\n\nHosted multiple DanBot C2 domains operated by\nLYCEUM\n\n\n-----\n\n|Indicator|Type|Context|\n|---|---|---|\n|62.113.196.37|IP address|Hosted DanBot C2 domain operated by LYCEUM (dnscloudservice.com)|\n|75.87.185.45|IP address|Hosted DanBot C2 domain operated by LYCEUM (dnscloudservice.com)|\n|144.217.149.61|IP address|Hosted DanBot C2 domain operated by LYCEUM (dnscloudservice.com)|\n|62.113.207.181|IP address|Hosted suspected LYCEUM domain (opendnscloud.com)|\n|144.217.156.94|IP address|Hosted multiple DanBot C2 domains operated by LYCEUM|\n|10d0d53f5e5f34c424431492‐ fa4ee95eb 2fa4fe6327455384cf508c586d‐ d2851|SHA256 hash|DanBot variant (AdobeReport.exe) operated by LYCEUM|\n|a8f68c928f82ed‐ d8a28c0fd25e207929a7dbce23|SHA1 hash|DanBot variant (AdobeReport.exe) operated by LYCEUM|\n|9df776b9933f‐ bf95e3d462e04729d074|MD5 hash|DanBot variant (AdobeReport.exe) operated by LYCEUM|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.08.27.LYCEUM_threat_group/Cyber%20Threat%20Group%20LYCEUM%20Takes%20Center%20Stage%20in%20Middle%20East%20Campaign.pdf"
    ],
    "report_names": [
        "Cyber Threat Group LYCEUM Takes Center Stage in Middle East Campaign"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cde987a8-c71f-49e2-b761-5b7fa2b4ada6",
            "created_at": "2022-10-25T16:07:23.706646Z",
            "updated_at": "2025-03-27T02:02:09.933918Z",
            "deleted_at": null,
            "main_name": "Hexane",
            "aliases": [
                "ATK 120",
                "Cobalt Lyceum",
                "Lyceum",
                "Operation Out to Sea",
                "Siamesekitten",
                "Yellow Dev 9"
            ],
            "source_name": "ETDA:Hexane",
            "tools": [
                "DanBot",
                "DanDrop",
                "Decrypt-RDCMan.ps1",
                "Get-LAPSP.ps1",
                "James",
                "Milan",
                "kl.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a7df240e-6750-4b71-99de-85831b92faa2",
            "created_at": "2022-10-25T15:50:23.859253Z",
            "updated_at": "2025-03-27T02:00:55.546377Z",
            "deleted_at": null,
            "main_name": "HEXANE",
            "aliases": [
                "Lyceum",
                "Siamesekitten",
                "Spirlin"
            ],
            "source_name": "MITRE:HEXANE",
            "tools": [
                "Milan",
                "netstat",
                "BITSAdmin",
                "DnsSystem",
                "DanBot",
                "ipconfig",
                "Mimikatz",
                "Kevin",
                "PoshC2"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "16456fa1-b975-461f-85d1-35eabe8d048f",
            "created_at": "2024-05-01T02:03:08.035417Z",
            "updated_at": "2025-03-27T02:05:17.317852Z",
            "deleted_at": null,
            "main_name": "COBALT LYCEUM",
            "aliases": [
                "HEXANE ",
                "ScorchedEpoch ",
                "DEV-0133 "
            ],
            "source_name": "Secureworks:COBALT LYCEUM",
            "tools": [
                " MilanRAT",
                " RGDoor",
                " SharkWork RAT",
                "DanBot"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "fb8f3a5f-01a9-498e-9396-52f844424c33",
            "created_at": "2023-01-06T13:46:39.045338Z",
            "updated_at": "2025-03-27T02:00:02.984648Z",
            "deleted_at": null,
            "main_name": "LYCEUM",
            "aliases": [
                "siamesekitten",
                "Chrono Kitten",
                "Storm-0133",
                "COBALT LYCEUM",
                "UNC1530",
                "Spirlin",
                "MYSTICDOME"
            ],
            "source_name": "MISPGALAXY:LYCEUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b938e2e3-3d1b-4b35-a031-ddf25b912557",
            "created_at": "2022-10-25T16:07:23.35582Z",
            "updated_at": "2025-03-27T02:02:09.750954Z",
            "deleted_at": null,
            "main_name": "APT 33",
            "aliases": [
                "APT 33",
                "ATK 35",
                "Cobalt Trinity",
                "Curious Serpens",
                "Elfin",
                "Holmium",
                "Magnallium",
                "Peach Sandstorm",
                "Refined Kitten",
                "TA451",
                "Yellow Orc"
            ],
            "source_name": "ETDA:APT 33",
            "tools": [
                "Atros2.CKPN",
                "AutoIt backdoor",
                "Breut",
                "CinaRAT",
                "DROPSHOT",
                "DarkComet",
                "DarkKomet",
                "DistTrack",
                "EmPyre",
                "EmpireProject",
                "FYNLOS",
                "FalseFont",
                "Filerase",
                "Fynloski",
                "JuicyPotato",
                "Krademok",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Mimikatz",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Notestuk",
                "POWERTON",
                "PoshC2",
                "PowerBand",
                "PowerShell Empire",
                "PowerSploit",
                "PsList",
                "Pupy",
                "PupyRAT",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "SHAPESHIFT",
                "Shamoon",
                "Socmer",
                "StoneDrill",
                "TURNEDUP",
                "Tickler",
                "Yggdrasil",
                "Zurten",
                "klovbot",
                "pupy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1567047349,
    "ts_modification_date": 1567047349,
    "files": {
        "pdf": "https://archive.orkl.eu/588b19b571321e82e811aaf1179803da45f8c6cf.pdf",
        "text": "https://archive.orkl.eu/588b19b571321e82e811aaf1179803da45f8c6cf.txt",
        "img": "https://archive.orkl.eu/588b19b571321e82e811aaf1179803da45f8c6cf.jpg"
    }
}