{
    "id": "024b696a-9433-4d63-b1a4-8734b0ea9703",
    "created_at": "2023-01-12T14:59:35.164103Z",
    "updated_at": "2025-03-27T02:15:13.909614Z",
    "deleted_at": null,
    "sha1_hash": "9a210e1635aa20f0bdf29d31b40bcf1f5cb06730",
    "title": "2020-03-16 - They Come in the Night- Ransomware Deployment Trends",
    "authors": "",
    "file_creation_date": "2022-05-29T01:08:53Z",
    "file_modification_date": "2022-05-29T01:08:53Z",
    "file_size": 953714,
    "plain_text": "# They Come in the Night: Ransomware Deployment Trends\n\n**[mandiant.com/resources/they-come-in-the-night-ransomware-deployment-trends](https://www.mandiant.com/resources/they-come-in-the-night-ransomware-deployment-trends)**\n\nThreat Research\n\nKelli Vanderlee\n\nMar 16, 2020\n\n7 mins read\n\nRansomware\n\nThreat Research\n\n\n-----\n\nRansomware is a remote, digital shakedown. It is disruptive and expensive, and it affects all\n[kinds of organizations, from cutting edge space technology firms, to the](https://news.sky.com/story/spacex-and-tesla-documents-leaked-online-by-hackers-11947792) [wool industry, to](https://www.itnews.com.au/news/australian-wool-sales-stopped-by-ransomware-attack-538657)\n[industrial environments. Infections have forced hospitals to turn away patients and law](https://www.mandiant.com/resources/ransomware-against-machine-learning-to-disrupt-industrial-production)\n[enforcement to drop cases against drug dealers. Ransomware operators have recently](https://www.zdnet.com/article/six-suspected-drug-dealers-went-free-after-police-lost-evidence-in-ransomware-attack/)\n[begun combining encryption with the threat of data leak and exposure in order to increase](https://www.bleepingcomputer.com/news/security/doppelpaymer-ransomware-launches-site-to-post-victims-data/)\nleverage against victims. There may be a silver lining, however; Mandiant Intelligence\nresearch suggests that focusing defensive efforts in key areas and acting quickly may allow\norganizations to stop ransomware before it is deployed.\n\nMandiant Intelligence examined dozens of ransomware incident response investigations\nfrom 2017 to 2019. Through this research, we identified a number of common characteristics\nin initial intrusion vectors, dwell time, and time of day of ransomware deployment. We also\nnoted threat actor innovations in tactics to maximize profits (Figure 1). Incidents affected\norganizations across North America, Europe, Asia Pacific, and the Middle East in nearly\nevery sector category, including financial services, chemicals and materials, legal and\nprofessional services, local government, and healthcare. We observed intrusions attributed\n[to financially motivated groups such as FIN6, TEMP.MixMaster, and dozens of additional](https://www.mandiant.com/resources/pick-six-intercepting-a-fin6-intrusion)\nactivity sets.\n\n\n-----\n\nFigure 1: Themes Observed in Ransomware Incidents\nThese incidents provide us with enhanced insight into ransomware trends that can be useful\nfor network defenders, but it is worth bearing in mind that this data represents only a sample\nof all activity. For example, Mandiant ransomware investigations increased 860% from 2017\nto 2019. The majority of these incidents appeared to be post-compromise infections, and we\nbelieve that threat actors are accelerating use of tactics including post compromise\ndeployment to increase the likelihood of ransom payment. We also observed incidents in\nwhich ransomware was executed immediately, for example GANDCRAB and\nGLOBEIMPOSTER incidents, but most of the intrusions examined were longer duration and\nmore complex post-compromise deployments\n\n\n-----\n\n**Common Initial Infection Vectors**\n\nWe noted several initial infection vectors across multiple ransomware incidents, including\nRDP, phishing with a malicious link or attachment, and drive by download of malware\nfacilitating follow-on activity. RDP was more frequently observed in 2017 and declined in\n2018 and 2019. These vectors demonstrate that ransomware can enter victim environments\nby a variety of means, not all of which require user interaction.\n\n\n**RDP or**\n**other**\n**remote**\n**access**\n\n**Phishing**\n**with link or**\n**attachment**\n\n**Drive-by-**\n**download**\n\n\nOne of the most frequently observed vectors was an attacker logging on to\na system in a victim environment via Remote Desktop Protocol (RDP). In\nsome cases, the attacker brute forced the credentials (many failed\nauthentication attempts followed by a successful one). In other cases, a\nsuccessful RDP log on was the first evidence of malicious activity prior to a\nransomware infection. It is possible that the targeted system used default or\nweak credentials, the attackers acquired valid credentials via other\nunobserved malicious activity, or the attackers purchased RDP access\nestablished by another threat actor. In [April 2019, we noted that FIN6 used](https://www.mandiant.com/resources/pick-six-intercepting-a-fin6-intrusion)\nstolen credentials and RDP to move laterally in cases resulting in\nransomware deployment.\n\nA significant number of ransomware cases were linked to phishing\ncampaigns delivering some of the most prolific malware families in\nfinancially motivated operations: TRICKBOT, EMOTET, and\nFLAWEDAMMYY. In [January 2019, we described TEMP.MixMaster TrickBot](https://www.mandiant.com/resources/a-nasty-trick-from-credential-theft-malware-to-business-disruption)\ninfections that resulted in interactive deployment of Ryuk.\n\nSeveral ransomware infections were traced back to a user in the victim\nenvironment navigating to a compromised website that resulted in a\n[DRIDEX infection. In October 2019, we documented compromised web](https://www.mandiant.com/resources/head-fake-tackling-disruptive-ransomware-attacks)\ninfrastructure delivering FAKEUPDATES, then DRIDEX, and ultimately\nBITPAYMER or DOPPELPAYMER infections.\n\n\n**Most Ransomware Deployments Take Place Three or More Days After Initial Infection**\n\nThe number of days elapsed between the first evidence of malicious activity and the\ndeployment of ransomware ranged from zero to 299 days (Figure 2). That is, dwell times\nrange quite widely, and in most cases, there was a time gap between first access and\nransomware deployment. For 75 percent of incidents, at least three days passed between\nthe first evidence of malicious activity and ransomware deployment.\n\nThis pattern suggests that for many organizations, if initial infections are detected,\n**contained, and remediated quickly, the significant damage and cost associated with a**\n**ransomware infection could be avoided. In fact, in a handful of cases, Mandiant incident**\nresponders and FireEye Managed Defense contained and remediated malicious activity,\nlikely preventing ransomware deployment. Several investigations discovered evidence of\nransomware installed into victim environments but not yet successfully executed\n\n\n-----\n\nFigure 2: Days elapsed between initial access and ransomware deployment\n\n**Ransomware Deployed Most Often After Hours**\n\nIn 76% of incidents we reviewed, ransomware was executed in victim environments after\nhours, that is, on a weekend or before 8:00 a.m. or after 6:00 p.m. on a weekday, using the\ntime zone and customary work week of the victim organization (Figure 3 and Figure 4). This\nobservation underscores that threat actors continue working even when most employees\nmay not be.\n\nSome attackers possibly intentionally deploy ransomware after hours, on weekends, or\nduring holidays, to maximize the potential effectiveness of the operation on the assumption\nthat any remediation efforts will be implemented more slowly than they would be during\nnormal work hours. In other cases, attackers linked ransomware deployment to user actions.\n\n\n-----\n\nFor example, in 2019 incidents at retail and professional services firms, attackers created an\nActive Directory Group Policy Object to trigger ransomware execution based on user log on\nand log off.\n\nFigure 3: Ransomware execution frequently takes place after hours\n\n\n-----\n\nFigure 4: Ransomware execution by hour of the day\nMitigation Recommendations\n\nOrganizations seeking to prevent or mitigate the effects of ransomware infections could\nconsider the following steps. For more comprehensive recommendations for addressing\nransomware, please refer to our blog post: Ransomware Protection and Containment\n_Strategies: Practical Guidance for Endpoint Protection, Hardening, and Containment._\n\n\n-----\n\n**Address**\n**Infection**\n**Vectors**\n\n**Implement**\n**Best**\n**Practices**\n\n**Establish**\n**Emergency**\n**Plans**\n\n**Outlook**\n\n\nUse enterprise network, email, and host-based security products with\nup-to-date detections to prevent and detect many common malware\nstrains such as TRICKBOT, DRIDEX, and EMOTET.\nContain and remediate infections quickly to prevent attackers from\nconducting follow-on activity or selling access to other threat actors for\nfurther exploitation.\nPerform regular network perimeter and firewall rule audits to identify\nany systems that have inadvertently been left accessible to the\ninternet. Disable RDP and other protocols to systems where this\naccess is not expressly required. Enable multi-factor authentication\nwhere possible, particularly to internet-accessible connections, see\npages 4-15 of the white paper for more details.\nEnforce multi-factor authentication, that is, where enabled, do not\nallow single factor authentication for users who have not set up the\nmulti-factor mechanism.\n\nFor example, carry out regular anti-phishing training for all employees\nthat operate a device on the company network. Ensure employees are\naware of threat, their role in preventing it, and the potential cost of a\nsuccessful infection.\nImplement network segmentation when possible to prevent a potential\ninfection from spreading.\nCreate regular backups of critical data necessary to ensure business\ncontinuity and, if possible, store them offsite, as attackers often target\nbackups.\nRestrict Local Administrator accounts from specific log on types, see\npage 18 of the white paper for more details.\nUse a solution such as LAPS to generate a unique Local Administrator\npassword for each system.\nDisallow cleartext passwords to be stored in memory in order to\nprevent Mimikatz credential harvesting, see p. 20 of the white paper\nfor more details.\nConsider cyber insurance that covers ransomware infection.\n\nEnsure that after-hours coverage is available to respond within a set\ntime period in the case of an emergency.\nInstitute after-hours emergency escalation plans that include\nredundant means to contact multiple stakeholders within the\norganization and 24-hour emergency contact information for any\nrelevant third-party vendors.\n\n\nRansomware is disruptive and costly. Threat actor innovations have only increased the\npotential damage of ransomware infections in recent years, and this trend shows no sign of\nslowing down. We expect that financially motivated actors will continue to evolve their tactics\nto maximize profit generated from ransomware infections. We anticipate that post\n\n-----\n\ncompromise ransomware infections will continue to rise and that attackers will increasingly\ncouple ransomware deployment with other tactics, such as data theft and extortion,\nincreasing ransom demands, and targeting critical systems.\n\nThe good news is that particularly with post-compromise infections, there is often a window\nof time between the first malicious action and ransomware deployment. If network defenders\ncan detect and remediate the initial compromise quickly, it is possible to avoid the significant\ndamage and cost of a ransomware infection.\n\n[Register for our upcoming ransomware webinar to learn more.](https://www.brighttalk.com/webcast/7451/389929)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-16 - They Come in the Night- Ransomware Deployment Trends.pdf"
    ],
    "report_names": [
        "2020-03-16 - They Come in the Night- Ransomware Deployment Trends.pdf"
    ],
    "threat_actors": [
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535575,
    "ts_updated_at": 1743041713,
    "ts_creation_date": 1653786533,
    "ts_modification_date": 1653786533,
    "files": {
        "pdf": "https://archive.orkl.eu/9a210e1635aa20f0bdf29d31b40bcf1f5cb06730.pdf",
        "text": "https://archive.orkl.eu/9a210e1635aa20f0bdf29d31b40bcf1f5cb06730.txt",
        "img": "https://archive.orkl.eu/9a210e1635aa20f0bdf29d31b40bcf1f5cb06730.jpg"
    }
}