{
    "id": "024e5a93-2716-478c-8d36-36bfc5816bcf",
    "created_at": "2023-01-12T15:04:40.100921Z",
    "updated_at": "2025-03-27T02:05:18.460279Z",
    "deleted_at": null,
    "sha1_hash": "ff874c6be2b4b73f48e79fb3d9f6acd38db44742",
    "title": "2021-01-04 - Darknet Threat Actors Are Not Playing Games with the Gaming Industry",
    "authors": "",
    "file_creation_date": "2022-05-29T10:49:15Z",
    "file_modification_date": "2022-05-29T10:49:15Z",
    "file_size": 1532321,
    "plain_text": "# Darknet Threat Actors Are Not Playing Games with the Gaming Industry\n\n**ke-la.com/darknet-threat-actors-are-not-playing-games-with-the-gaming-industry/**\n\nJanuary 4, 2021\n\n[The gaming industry should really thank Covid-19: People are stuck at home, seeking indoor hobbies, and giving online gaming a chance.](https://www.theverge.com/2020/5/27/21270971/mobile-gaming-record-woodturning-ludo-king-coronavirus)\n[With the rise of gamers and purchases, the online gaming industry is estimated to reach $196 billion in revenue by 2022. However, the](https://www.visualcapitalist.com/online-gaming-the-rise-of-a-multi-billion-dollar-industry/)\ngrowing success of this industry also calls attention to cybercriminals scouting out their new targets – and what better target could\ncybercriminals ask for than an industry that’s up and coming and may not be prioritizing their security precautions as much as their industry\nadvancement and profit. So, though this industry isn’t valued at the trillions of dollars that the financial industry may be valued at, it still\nchecks off boxes for two key factors that many profit-driven cyber criminals tend to seek: increase profits and minimize the complexity of the\nprocess in order to do so.\n\nIn order to assess the threat landscape of the gaming industry in light of Covid-19, we explored the risks that are potentially threatening\n[employees and internal resources of the leaders of this industry.[1]](https://newzoo.com/insights/rankings/top-25-companies-game-revenues/) We’ve included some of this blog’s major key takeaways below:\nKELA observed multiple instances of supply and demand for initial network access of gaming companies (especially their\nresources designed for developers).\nKELA found nearly 1 million compromised accounts pertaining to gaming clients and employees, with 50% of them offered for\n**sale during 2020.**\nKELA detected more than 500,000 leaked credentials pertaining to employees of the leading companies in the gaming sector.\nThe gaming industry is growing, in turn increasing the number of threats against it. By proactively monitoring darknet communities,\norganizations in this industry can collect real-time valuable intelligence in order to help gain an external viewpoint on their\n**organizations’ attack surfaces and mitigate cyber threats.**\n\n## Terms\n\nBefore diving into some threats targeting the gaming sector and the implications they may have, let’s first review three commonly used terms\nthroughout this blog post:\n\n**Initial Network Access – A broad term referring to remote access to a computer in a compromised organization. Threat actors selling**\n[these accesses are referred to as initial access brokers – threat actors linking opportunistic campaigns with targeted attackers, namely](https://ke-la.com/the-secret-life-of-an-initial-access-broker/)\nransomware operators.\n**Compromised Accounts – Credentials, cookie sessions and additional technical fingerprints which are offered for sale on automated**\n[underground marketplaces such as Genesis and more. These accounts are breached and stolen from victims’ computers generally via](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/)\ninfections by banking trojans or other stealers. Such accounts can grant access to tools and software used in a targeted environment,\nsuch as RDP, VPN solutions, and more. They could be leveraged by a sophisticated actor to gain initial network access to the relevant\ncorporate’s network.\n**[Leaked Credentials – Credentials from various breached databases constantly traded and circulating in the underground. Mostly,](https://www.zdnet.com/article/23600-hacked-databases-have-leaked-from-a-defunct-data-breach-index-site/)**\nthese databases include private and corporate email addresses and associated passwords, including plaintext ones. This data can\nenable attackers to access the company’s resources and provide further malicious activity, such as account takeover attacks, social\nengineering, phishing and malware spreading campaigns.\n\nAll these threats, altogether or separately, can be used in an attack chain aimed to compromise organizations.\n\n## Supply and Demand: Threat Actors Specifically Looking for Access to Gaming Companies\n\nFor the past two months, we’ve observed several different actors looking for access to networks of gaming companies.\n\nA perfect example highlighting the demand for initial network access to gaming companies is seen in a listing by a Russian-speaking actor\nwho was looking to purchase multiple types of accesses and databases. This actor specifically stated that he was interested in access to\ndevelopers’ networks of Xbox (Microsoft), Nintendo, Qualcomm, and Apple.\n\n\n-----\n\n_A threat actor stating he is interested in access to developers’ resources of gaming companies in a format “developer.COMPANY.com” or similar links_\n\nAnother example, from December 18, shows a threat actor selling data related to a major Japanese video game developer, which has\n[recently been disclosed as Koei Tecmo. The listing included FTP credentials – in this instance it does not necessarily indicate a network](https://www.bleepingcomputer.com/news/security/koei-tecmo-discloses-data-breach-after-hacker-leaks-stolen-data/)\naccess, rather it provides an access point into the company’s environment. The sample of data posted by the actor included email\n[addresses, which KELA confirmed were indeed leaked from the company’s server in March 2020 and later offered on Cit0day – a service](https://www.zdnet.com/article/23600-hacked-databases-have-leaked-from-a-defunct-data-breach-index-site/)\nthat operated hacked databases and provided access to information for a subscription fee. Just a few days after the original listing, the threat\nactor decided to release all of Koei Tecmo’s data for free on the same forum that he published the original listing on.\n\nAnother instance showed a member of a Russian-speaking underground forum stating that he is ready to buy access to big gaming\ncompanies anywhere in the world. He claimed he was specifically interested in access to servers or repositories used for development.\n**Such accesses, as we’ll describe later, are frequently offered for sale in different underground markets.**\n\n_A threat actor seeking for access to “developments servers to GitHub analogues where they keep their code” of gaming companies_\n\nInterestingly, four days later the same actor offered access to a server of a publisher of online games in Latin America. It’s possible that\nthese are two unrelated events: the actor was looking for accesses to developers’ resources and separately worked on breaching the Latin\nAmerican publisher whose access he soon offered for sale. However, it can also be true that he managed to buy some kind of access and\n\n\n-----\n\ntransformed it into the server access offered for sale. Regardless of the connection of events, or the lack thereof, these two instances (as\nwell as the others mentioned above) showcase the fact that threat actors are actively interested in targeting organizations in the gaming\nsector.\n\n_The threat actor, previously looking to buy access to gaming companies, is himself offering access to a gaming company’s server_\n\nSome other offers that we observed by initial access brokers include access of an unknown type to an online game of a German developer\nand access to a cloud storage solution (“analogue of AWS”) used by a major game developer.\n\n_Access to an online game of a Germany-based developer_\n\n\n-----\n\n_Access to cloud storage solution of a “major game developer”_\n\nIn private communication with the threat actor that offered access to the cloud storage solution, he claimed that the offer is no longer\nrelevant, but alternatively offered something else – access to the network of a major Japanese game developer. Seeing that this was offered\nonly in private conversation with the threat actor, we can assume that the number of threats is greater than actually presented.\n\n## Supply: Compromised Accounts\n\nCompromised accounts originate from infected computers (also known as bots), usually infected with banking trojans or infostealers. These\nbots are sold in automated shops, where new listings are added daily, essentially making it very easy for threat actors to attain access to a\nvariety of resources. As one can imagine, a victim’s computer might have access to different services such as corporates’ portals,\nemployees’ internal resources and platforms, social media accounts, kids’ school portals, bank accounts, and much more. These markets\nessentially assist threat actors to attain access to desired services with the click of a button and at a price of a couple of dollars per bot.\n\nKELA has been monitoring the major underground markets of this type for over 2.5 years and has tracked nearly 1 million compromised\n**accounts of employee- and client-facing resources of the 25 major gaming companies in question – with half of them being listed**\n**for sale in 2020 alone.**\n\n**It’s important to note that we detected compromised accounts to internal resources of nearly every company in question. These**\n**resources are meant to be used by employees, for example – Admin panels, VPNs, Jira instances, FTPs, SSOs, dev-related**\n**environments, and the list goes on and on. As seen in the examples below, with a payment of just a couple of dollars a potential attacker**\ncan have access to the core areas of a company’s network.\n\n_Developer-related and Jira credentials collected from the information stealer Vidar, which could indicate some internal resources of a leading gaming company_\n_are being compromised_\n\n_Admin-related credentials collected from the information stealer AZORult, which might indicate some internal resources of a leading gaming company are being_\n_compromised._\n\n\n-----\n\n_VPN and SSO from Vidar, which might indicate some compromised internal resources of a leading gaming company._\n\nFor the past three months, we’ve observed four ransomware incidents impacting gaming companies – three of which were publicly reported.\n[In addition, it’s possible that another major gaming developer was attacked, as Sodinokibi (REvil) stated in their interview.](https://youtu.be/ZyQCQ1VZp8s?t=327)\n\n**Credentials to internal resources of recently attacked companies – such as VPN, website management portals, admin, Jira and**\n**more – were put up for sale and hence were available for any potential attacker prior to the cyberattacks that occurred. We also**\ndetected an infected computer (bot) which had credential logs to plenty of sensitive accounts that could be accessed by attackers upon\npurchase: SSO, Kibana, Jira, adminconnect, service-now, Slack, VPN, password-manager and poweradmin of the company – all on a single\nbot – which strongly suggests that it’s used by an employee of the company with administrator rights. This highly valuable bot was\n**available for sale for less than $10.**\n\n**Though we cannot directly correlate an attack on one of these victims to a bot that was listed in this market, this incident still**\n**highlights the risk that stands when an organization’s sensitive resources are available for malicious use with an investment of**\n**just a couple of dollars.**\n\n## Scenario: How Cybercriminals Could Play Around with Compromised Accounts to Execute a Cyber Attack\n\nTo understand the risk, let’s review a quick scenario of a possible cyberattack that can lead to ransomware infection once a\n**compromised account is offered on the underground automated shops:**\n\nGoing back a few years, a threat actor would have to spend some time in the reconnaissance phase, carefully choosing victims and using\nmultiple tools to get access to a valuable, functioning RDP server belonging to a corporation. Nowadays, an actor needs to only enter\nunderground marketplaces and purchase a bot containing RDP credentials (another possible way – access one of the many remote access\nmarkets and acquire multiple RDP corporate servers for a few hundred dollars).\n\nNext, the potential attacker needs to explore them and proceed with ones that look “interesting” – meaning they enable access to a network\nof a large company with significant revenue (and probably from a sector willing to pay ransom – government organizations, for instance,\nusually do not negotiate with ransomware operators). Finally, the actor will attempt to escalate privileges or install further tools in order to\ngain initial access.\n\nFrom that stage on, once there’s initial access to a specific company, the attacker will usually choose one of two directions:\n\nUsing the initial access to deploy ransomware on the company’s network on their own.\nSelling it to [ransomware affiliates, who will deploy the ransomware themselves as part of a more organized crime.](https://ke-la.com/kelas-100-over-100-september2020-in-network-access-sales/)\n\nHowever, deploying ransomware is only one of the many different cyberattacks that these cybercriminals may attempt. This access could\nalso enable them to initiate other offense such as corporate espionage, fraud, and other methods that could cause victims to incur severe\nfinancial losses.\n\n## Supply: Leaked Credentials\n\nWhen looking at an exposure of a company, unfortunately, employees continue to remain as the main entry point, driving us to also analyze\nthe sample companies’ leaked credentials stemming from 3rd party breaches. As of December 2020, we’ve observed more than 500,000\n**leaked credentials pertaining to the employees of the 25 major gaming companies in question. many cases, such credentials are**\navailable for free in the underground ecosystem, creating another opportunity for attackers to utilize for further attacks that could lead to\nprofits.\n\nWe found that these credentials also include high-profile email addresses such as senior employees and email addresses which are\ngenerally a significant channel in the company – invoice, purchasing, admin, HR-related emails, support and marketing are only some of the\nexamples we noticed.\n\nIt’s worth highlighting that KELA’s caching capabilities allows visibility into additional context of leaked credentials, such as associated\npasswords to a certain email address, previous leaks of a specific email address and more. As part of our regular review, we unfortunately\nstill come across a great deal of re-use of passwords, as can be examined in the example below:\n\n\n-----\n\nThis single (censored) email address was leaked in numerous unique breaches, as well as some of the Collections dumps (referring here to\nCollection #1-5), and we can still see that once this user signs up with their corporate email address to a 3rd-party platform or website, they\nare most likely using an identical password across platforms. This exact behavior, which is unfortunately widely and commonly practiced, is\nreally a “human vulnerability” that is continually being leveraged by threat actors, allowing attackers to gain access to services of interest.\n\n## Scenario: Leaked Credentials Are Level 1 in the Attack Process\n\n[As one of the main attack vectors still stands as phishing (also the vector possibly used against Ubisoft), there’s room to exemplify how](https://twitter.com/search?q=ubisoft%20from%3Amalwrhunterteam&src=typed_query&f=live)\n**leaked credentials can be easily “translated” into a more significant attack. Combolists (email address: password lists) as well as databases**\nwith credentials originating from previous breaches are no news in the Darknet. Once an adversary is going through their reconnaissance\nphase of looking for their next potential target and puts their hands on an email address of interest, there are a variety of techniques that\nthey may use. For instance:\n\nAn attacker can be seen using social engineering, or phishing attempts specifically tailored to the victim – either based on the place\nthey work in, or on personal details. The aim is, of course, attaining the relevant credentials in order to gain access to services of\ninterest, find an entry point to a targeted network and then escalate privileges and move laterally.\nA threat actor can attempt to perform brute force and dictionary attacks, for which these databases with plain text passwords are highly\nuseful. Once access was gained to a service of interest – the actor will continue to move laterally to eventually deploy ransomware, as\nwe supposed earlier.\n\n**Hence, these databases may be highly useful for a potential attacker to perform a variety of attacks. The examples presented above**\nreflect the types of threats KELA is detecting on a daily basis and can be used as an excellent example of why it’s crucial to educate\nemployees and ensure that they understand the various ways that attackers may use to enter the organization’s network.\n\n## Training the Targets: What Organizations in the Gaming Sector Should do to Reduce Cyber Threats\n\nThe examples laid out in this blog present the ever-growing threats against the gaming sector that can be leverage by threat actors in a\ncyberattack. Over the years, new sectors will continue to emerge as the main targets for cyber criminals. These new targets are generally\nbecoming popular among cyber criminals due to the simple fact that they are driving large sums of money. For that particular reason, we’ll\nlikely continue seeing new major targets rise, and organizations will need to prepare in accordance.\n\nOrganizations in the gaming sector have to act fast as they are the new target that cybercriminals are interested in. This preparation begins\nwith security training to employees, including:\n\n1. Raising awareness to employees about the risks presented above.\n2. Enforcing password changes.\n3. Implementing unique password use and MFA policies.\n\nThe organizations in this sector will also be required to invest in different measures in order to ensure that they are protecting all of their\ndifferent assets. Most importantly, these organizations should invest in ongoing monitoring of their assets, to get an external viewpoint of\ntheir organization as seen by cybercriminals. By monitoring mentions of their assets across the darknet, they will gain the necessary\n\n\n-----\n\nintelligence in order to help them better assess their exposure and prioritize security operations.\n\n**As we’ve all been observing – attacks and attackers are becoming more sophisticated and customized to the victim. Some**\n**attackers try to search for the specific data and information that is relevant to the scope or industry of the victim and reproduce**\n**the successful attacks. As the gaming industry continues to grow in revenue, we will likely continue to detect more threats and**\n**attacks targeting the online gaming industry. With constant monitoring of their assets’ exposure in the darknet, these organizations can**\nproactively detect threats and map out their risk in order to foresee potential weaknesses in their environment.\n\n———————————————————————————————————————————————————————————————–\n\n[1] Excluding Google, Apple and Microsoft. We have checked 53 domains which are related to the companies at issue, meaning not only\n\nlooked into the companies’ main domains, but also some of their most popular games.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-04 - Darknet Threat Actors Are Not Playing Games with the Gaming Industry.pdf"
    ],
    "report_names": [
        "2021-01-04 - Darknet Threat Actors Are Not Playing Games with the Gaming Industry.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535880,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653821355,
    "ts_modification_date": 1653821355,
    "files": {
        "pdf": "https://archive.orkl.eu/ff874c6be2b4b73f48e79fb3d9f6acd38db44742.pdf",
        "text": "https://archive.orkl.eu/ff874c6be2b4b73f48e79fb3d9f6acd38db44742.txt",
        "img": "https://archive.orkl.eu/ff874c6be2b4b73f48e79fb3d9f6acd38db44742.jpg"
    }
}