{
    "id": "02855435-fac6-4eb0-b7ed-12c80d57d566",
    "created_at": "2023-03-03T02:06:26.129852Z",
    "updated_at": "2025-03-27T02:17:05.813183Z",
    "deleted_at": null,
    "sha1_hash": "af67817d0ce66e2b25b8e98cf45123923d7e3fc7",
    "title": "2023-02-09 - Enigma Stealer Targets Cryptocurrency Industry with Fake Jobs",
    "authors": "",
    "file_creation_date": "2023-03-01T09:15:14Z",
    "file_modification_date": "2023-03-01T09:15:14Z",
    "file_size": 6182516,
    "plain_text": "# Enigma Stealer Targets Cryptocurrency Industry with Fake Jobs\n\n**[trendmicro.com/en_us/research/23/b/enigma-stealer-targets-cryptocurrency-industry-with-fake-jobs.html](https://www.trendmicro.com/en_us/research/23/b/enigma-stealer-targets-cryptocurrency-industry-with-fake-jobs.html)**\n\nFebruary 9, 2023\n\n\n-----\n\nFigure 1. The Attack kill chain used by Enigma Stealer operator (click the image for a larger version)\nWe recently found an active campaign that uses a fake employment pretext targeting Eastern\nEuropeans in the cryptocurrency industry to install an information stealer. In this campaign, the\nsuspected Russian threat actors use several highly obfuscated and under-development custom\nloaders to infect those involved in the cryptocurrency industry with the Enigma Stealer (detected as\nTrojanSpy.MSIL.ENIGMASTEALER.YXDBC), a modified version of the Stealerium information\nstealer. In addition to these loaders, the attacker also exploits CVE-2015-2291, an Intel driver\nvulnerability, to load a malicious driver designed to reduce the token integrity of Microsoft Defender.\n\nStealerium, the original information stealer which serves as the base for Enigma Stealer, is an opensource project written in C# and markets itself as a stealer, clipper, and keylogger with logging\ncapabilities using the Telegram API. Security teams and individual users are advised to continuously\nupdate the security solutions of their systems and remain vigilant against threat actors who perform\nsocial engineering via job opportunity or salary increase-related lures.\n\nAttack Chain\n\nUsing fake cryptocurrency interviews to lure victims\n\nThe infection chain starts with a malicious RAR archive — in this instance, contract.rar (SHA256:\n658725fb5e75ebbcb03bc46d44f048a0f145367eff66c8a1a9dc84eef777a9cc) — which is distributed\nto victims via phishing attempts or through social media. The archive contains the files, Interview\n\n\n-----\n\nquestions.txt, and Interview conditions.word.exe.\n\nFigure 2. The files found inside the malicious RAR\n\narchive\nThese files set up the pretext for a fake cryptocurrency role or job opening. One file, Interview\nquestions.txt (SHA256: 3a1eb6fabf45d18869de4ffd773ae82949ef80f89105e5f96505de810653ed73)\ncontains sample interview questions written in Cyrillic. This serves to further legitimize the package\nin the eyes of the victim and draw attention away from the malicious binary.\n\nFigure 3. A machine translation of Interview questions.txt\nThe other file Interview conditions.word.exe (SHA256:\n03b9d7296b01e8f3fb3d12c4d80fe8a1bb0ab2fd76f33c5ce11b40729b75fb23) contains the first stage\nEnigma loader. This file, which also masquerades as a legitimate word document, is designed to lure\nunsuspecting victims into executing the loader. Once executed, the Enigma loader begins the\nregistration and downloading of the second-stage payload.\n\nAnalysis of the Enigma infrastructure\n\nEnigma uses two servers in its operation. The first utilizes Telegram for delivering payloads, sending\ncommands, and receiving the payload heartbeat. The second server 193[.]56[.]146[.]29 is used for\nDevOps and logging purposes. At each stage the payload sends its execution log to the logging\nserver. Since this malware is under continuous development the attacker potentially uses the logging\nserver to improve malware performance. We have also identified the Amadey C2 panel on\n193[.]56[.]146[.]29 which has only one sample (95b4de74daadf79f0e0eef7735ce80bc)\ncommunicating with it.\n\n\n-----\n\nFigure 4. Amadey C&C login page\nAmadey is a popular botnet that is sold on Russian speaking forums, but its source code has been\nleaked online. Amadey offers threat actors polling and reconnaissance services.\n\n\n-----\n\nFigure 5. The exposed info.php page of the threat actors’ command-and-control (C&C) infrastructure\nThis server has a unique Linux distribution only referenced in Russian Linux forums.\n\nFigure 6. The default time zone of the C&C server\nThe default time zone on this server is set to Europe/Moscow. This server registers a newly infected\nhost when Interview conditions.word.exe is executed by the victim.\n\nStage 1: EnigmaDownloader_s001\n\n**MD5** 1693D0A858B8FF3B83852C185880E459\n\n**SHA-1** 5F1536F573D9BFEF21A4E15273B5A9852D3D81F1\n\n\n**SHA-**\n**256**\n\n\n03B9D7296B01E8F3FB3D12C4D80FE8A1BB0AB2FD76F33C5CE11B40729B75FB23\n\n\n**File size** 367.00 KB (375808 bytes)\n\nThe initial stage of Enigma, Interview conditions.word.exe, is a downloader written in C++. Its\nprimary objective is to download, deobfuscate, decompress, and launch the secondary stage\npayload. The malware incorporates multiple tactics to avoid detection and complicate reverse\n\n\n-----\n\nengineering, such as API hashing, string encryption, and irrelevant code.\n\nBefore delving into the analysis of \"EnigmaDownloader_s001,\" let's first examine how the malware\ndecrypts strings and resolves hashed Windows APIs. By understanding this, we can implement an\nautomated system to help us retrieve encrypted data and streamline the analysis process. Please be\nadvised that to enhance code legibility, we have substituted all hashes with the corresponding\nfunction names.\n\n### EnigmaDownloader_s001 API Hashing:\n\nAPI hashing is a technique employed by malware to conceal the utilization of potentially suspicious\nAPIs (functions) from static detection. This technique helps the malware disguise its activities and\nevade detection.\n\nIt involves replacing the human-readable names of functions (such as \"CreateMutexW\") with a hash\nvalue, such as 0x0FD43765A. The hash value is then used in the code to call the corresponding API\nfunction, rather than using the human-readable name. The purpose of this technique is to make the\nprocess of understanding the code more time-consuming and difficult.\n\nFor API Hashing the EnigmaDownloader_s001 uses the following custom MurmurHash:\n\n\n-----\n\nFigure 7. Custom implementation of murmur hash\nThe malware employs dynamic API resolving to conceal its API imports and make static analysis\nmore difficult. This technique involves storing the names or hashes of the APIs needed, then\nimporting them dynamically at runtime.\n\nThe Windows API offers LoadLibrary and GetProcAddress functions to facilitate this. LoadLibrary\naccepts the name of a DLL and returns a handle, which is then passed to GetProcAddress along\nwith a function name to obtain a pointer to that function. To further evade detection, the malware\nauthor even implemented their own custom version of GetProcAddress to retrieve the address of\nfunctions such as LoadLibrary and others. The use of standard methods like GetProcAddress and\nLoadLibrary might raise a red flag, so the custom implementation helps to avoid detection.\n\n\n-----\n\nFigure 8. Dynamic API loading\nThe following is a list of API hash values along with the names of functions that have been used in\nthis sample (Please note that the hash value might be different in other variants since the malware\nauthor changed some of the constant values in the hash generator function).\n\n\n-----\n\n0xE04A219 : kernel32_HeapCreate\n0xA1ADA36 : kernel32_lstrcpyA\n\n0x5097BB4 : kernel32_RegOpenKeyExA\n\n0x750EFAB : kernel32_GetLastError\n\n0x4CB039A : kernel32_RegQueryValueExA\n\n0xAAF4498 : kernel32_RegCloseKey\n\n0xFAD2A34 : kernel32_lstrcmpiA\n\n0x11A198F : combase_CoCreateGuid\n\n0xE94A809 : kernel32_RtlZeroMemory\n\n0x6A6A154 : kernel32_lstrcatA\n\n0x8150471 : ntdll_RtlAllocateHeap\n\n0x4CF4539 : user32_wvsprintfW\n\n0x663555F : kernel32_WideCharToMultiByte\n\n0x59CADCE : ntdll_RtlFreeHeap\n\n0x1CE543C : cabinet_CloseDecompressor\n\n0x11CF0A2 : wininet_InternetGetConnectedState\n\n0x675C7B2 : kernel32_Sleep\n\n0xDC75FF2 : wininet_InternetCheckConnectionA\n\n0x5CC35B1 : wininet_InternetSetOptionA\n\n0xF9E8859 : wininet_InternetOpenA\n\n0x6F05A9E : wininet_InternetConnectA\n\n0xBAEECD9 : wininet_HttpOpenRequestA\n\n0xAD9A77C : wininet_HttpSendRequestA\n\n0x835FA71 : wininet_HttpQueryInfoA\n\n0xBFA9532 : wininet_InternetReadFile\n\n0x99D029C : wininet_InternetCloseHandle\n\n0x8DABD38 : kernel32_GetFileAttributesW\n\n0x44E1C18 : kernel32_DeleteFileW\n\n0xAB69596 : kernel32_CreateFileW\n\n0x2CF38A1 : kernel32_WriteFile\n\n0x1CE43DE : kernel32_CloseHandle\n\n0x548C5A4 : Rpcrt4_RpcStringBindingComposeW\n\n0x7B0F79F : Rpcrt4_RpcBindingFromStringBindingW\n\n0x69A2B62 : Rpcrt4_RpcStringFreeW\n0xD2CD112 : advapi32_CreateWellKnownSid\n\n0xEFBC2E9 : kernel32_LocalFree\n\n0x60EDB01 : Rpcrt4_RpcBindingFree\n\n0x7A7DAA0 : Rpcrt4_RpcAsyncInitializeHandle\n\n0xB3F16FA : kernel32_CreateEventW\n\n0x1C23B4F : Rpcrt4_NdrAsyncClientCall\n\n0x8C1F37 : kernel32_WaitForSingleObject\n\n0x7831640 : Rpcrt4_RpcRaiseException\n\n0xF2FCCFE : Rpcrt4_RpcAsyncCompleteCall\n\n0x816F545 : kernel32_SetLastError\n\n0xFBE2D99 : oleaut32_SysAllocString\n\n\n-----\n\n0x393ACB : oleaut32_SysFreeString\n0xC9FEF5F : kernel32_ExpandEnvironmentStringsW\n\n0x74D51D3 : kernel32_CreateProcessW\n\n0xCDE9EC27 : wininet_HttpWebSocketClose\n\n0x80C8449 : kernel32_TerminateProcess\n\n0x418B4E7E : wininet_AppCacheCheckManifest\n\n0x44E65EB : kernel32_WaitForDebugEvent\n\n0x81C3F46 : kernel32_ContinueDebugEvent\n\n0x1FB9EB2 : kernel32_LoadLibraryW\n\n0x1071970 : kernel32_GetProcAddress\n\n0xDAE6C9B : combase_CoInitializeEx\n\n0xFD43765 : kernel32_CreateMutexW\n\n0x73861029 : kernel32_BasepSetFileEncryptionCompression\n\n0xA3FE987 : advapi32_RegDeleteKeyW\n\n0x1CA6703 : advapi32_RegCreateKeyA\n\n0x24EBD39 : kernel32_lstrlenA\n0x69F38C6 : kernel32_RegSetValueExA\n\n0xC2D33DC : ntdll_RtlGetVersion\n\n0xBD5D03A : kernel32_GetNativeSystemInfo\n\n0x10BEDD60 : wininet_CreateMD5SSOHash\n\nTo resolve the API hash, the malware first passes two arguments to the \"mw_resolveAPI\" function.\nThe first argument is the specific library name index number (in this case 0xA = Kernel32.dll), while\nthe second argument is the export function name hashed value (which, in this example, is\n0xFD43765A)\n\nThe mw_resolveAPI function first finds the specific index, jumps to it, and decrypts the corresponding\nlibrary name value as shown in the bottom image of Figure 9.\n\n\n-----\n\nFigure 9.\n\n\nResolving API hashes\nThe following is the list of decrypted library names:\n\nWinInet.dll\nuserenv.dll\npsapi.dll\nnetapi32.dll\nmpr.dll\nwtsapi32.dll\napi-ms-win-core-processthreads-l1-1-0.dll\nntoskrnl.exe\nRpcrt4.dll\nUser32.dll\napi-ms-win-core-com-l1-1-0.dll\nCabinet.dll\nshell32.dll\nOleAut32.dll\nOle32.dll\n\n\n-----\n\nntdll.dll\nmscoree.dll\nkernel32.dll\nadvapi32.dll\n\nThe library name and export function name hashed value is then passed to\nGetExportAddressByHash, which is responsible for opening the handle to the library, creating a hash\nfor each export function name, and comparing it with the passed argument. Once the match is found,\nthe malware returns the function address and calls it.\n\nFigure 10. Retrieving the address of an API\nThe code snippet in Figure 11 demonstrates how mw_GetExportAddressByHash resolves the given\nAPI hash and retrieves the address of an exported function. The techniques used to decrypt strings\nand resolve API hashes in both the stage 1 and stage 2 payloads are identical.\n\n\n-----\n\nFigure 11. Custom implementation of GetProcAddress\nWith an understanding of this process, we can then proceed with our analysis.\n\nUpon execution, the malware creates the mutual exclusion object (mutex) to mark its presence in the\nsystem and retrieves the MachineGuid of the infected system from the\n_SOFTWARE\\Microsoft\\Cryptography\\MachineGuid registry key, which it uses as a unique identifier to_\nregister the system with its C&C server and track its infection.\n\n\n-----\n\nFigure 12. Constructing a unique system identifier and creating a mutex\nIt then deletes the HKCU\\SOFTWARE\\Intel registry key and recreates it with two values, HWID and\n_ID, as shown in Figure 13._\n\nFigure 13. Recreating HKCU\\SOFTWARE\\Intel\n\n\n-----\n\nIt then collects information about the .NET Framework Setup on the infected system and sends it to\nits C&C server as shown in Figure 14.\n\nFigure 14. Constructing first debug message\n\nFigure 15. An example of the first debug message\nThere are two C&C servers that were used in this attack chain. The first one,193[.]56[.]146[.]29, is\nused to send program execution DEBUG and Telegram to deliver payloads and send commands.\n\nTo download the next stage payload, the malware first sends a request to the attacker-controlled\nTelegram channel https://api[.]telegram[.]org/bot{token}/getFile to obtain the file_path. This approach\nallows the attacker to continuously update and eliminates reliance on fixed file names.\n\n\n-----\n\nFigure 16. Payload “file_path” request from Telegram\nNote that in this case, the next stage payload was file_17.pack. However, this file and other stage\nnames were changed multiple times during our investigation.\n\nUpon obtaining the file_path, the malware then sends a request to download the next stage binary\nfile (shown in Figure 17)\n\nFigure 17. Payload download request from Telegram\n\n\n-----\n\nFigure 18. The code responsible for decrypting the next stage payload file_id and Telegram token\nIf the file's download, deobfuscation, and decompression are successful, the malware sends the\nmessage \"bot getted\" to the debug server.\n\nFigure 19. Successful payload retrieval debug message\nTo decompress the payload, the malware uses Microsoft Cabinet's Compressapi with the\ncompression algorithm (\"COMPRESS_RAW | COMPRESS_ALGORITHM_LZMS\"). The code\nsnippet in Figure 20 demonstrates how the malware downloads, deobfuscates, and decompresses\n_file_17.pack (UpdateTask.dll)._\n\n\n-----\n\nFigure 20. Code responsible for downloading, deobfuscating, decompressing, and renaming the\ndownloaded payload\n\n\n-----\n\nFigure 21. Payload deobfuscation and decompression\nBefore executing the payload, the malware attempts to elevate its privileges by executing the\n[mw_UAC_bypass function, which is part of an open-source project. This technique, Calling Local](https://github.com/aaaddress1/PR0CESS)\n[Windows RPC Servers from .NET (which was unveiled in 2019 by Project Zero), allows a user to](https://googleprojectzero.blogspot.com/2019/12/calling-local-windows-rpc-servers-from.html)\nbypass user account control (UAC) using only two remote procedure call (RPC) requests instead of\nDLL hijacking.\n\n\n-----\n\nFigure 22. Successful UAC bypass execution debug message\nThe malware requires elevated privileges for the subsequent stage payload, which involves loading\nthe malicious driver by exploiting CVE-2015-2291.\n\nFinally, the malware executes an export function called \"Entry\" from UpdateTask.dll via rundll32.exe\nas shown in Figure 23.\n\nFigure 23. Running the stage 2 payload through rundll32.exe\nStage 2: EnigmaDownloader_s002\n\n377f617ccd4aa09287d5221d5d8e1228\n\n**MD5**\n\n288358deaa053b30596100c9841a7d6d1616908d\n\n**SHA-1**\n\nf1623c2f7c00affa3985cf7b9cdf25e39320700fa9d69f9f9426f03054b4b712\n\n**SHA-256**\n\n497.50 KB (509440 bytes)\n\n**File size**\n\nThe second stage payload, UpdatTask.dll, is a dynamic-link library (DLL) written in C++ that\ncomprises two export functions (DllEntryPoint and Entry). The malicious code is executed in the\nEntry export function, which is triggered by the first stage routine. The primary objective of this\nmalware is to disable Microsoft Defender by deploying a malicious kernel mode driver (“bring your\nown vulnerable driver” or BYOVD method) via exploiting a vulnerable Intel driver (CVE-2015-2291)\nand then downloading and executing the third-stage payload.\n\n\n-----\n\nPlease note that the first, second, and third-stage payloads all obtain the infected system s\nMachineGuid at the start and use it to identify the machine in debug message network traffic,\nenabling the adversary to track the infected system's malware execution state.\n\nUpon execution, the malware creates the mutex to mark its presence on the system and retrieves\nthe MachineGuid of the infected system from the\n\"SOFTWARE\\Microsoft\\Cryptography\\MachineGuid\" registry key.\n\nFigure 24. Constructing a unique system identifier and creating a mutex\nNext, the malware will determine if it is running as an account with administrator privileges or simply\nas a regular user using the GetTokenInformation API. If the malware fails to obtain elevated\nprivileges, it will bypass the disablement of Windows Defender and proceed to download and\nexecute the next stage of its attack.\n\n\n-----\n\nFigure 25. Checking the process privileges\nIf the process successfully obtains elevated privileges, it proceeds to drop the files shown in Figure\n26.\n\nFigure 26. Stage 2 embedded binary files\n\n**Name** iQVW64.SYS (CVE-2015-2291)\n\n**Description** Vulnerable Intel driver, used for kernel exploitation\n\n**MD5** 1898ceda3247213c084f43637ef163b3\n\n**SHA-1** d04e5db5b6c848a29732bfd52029001f23c3da75\n\n**SHA-256** 4429f32db1cc70567919d7d47b844a91cf1329a6cd116f582305f3b7b60cd60b\n\n**Name** Driver.SYS\n\n**Description** Malicious drivers reduce the token integrity of Microsoft defender (MsMpEng.exe)\n\n**MD5** 28ca7a21de60671f3b528a9e08a44e1c\n\n\n-----\n\n**SHA-1** 21F1CFD310633863BABAAFE7E5E892AE311B42F6\n\n**SHA-256** D5B4C2C95D9610623E681301869B1643E4E2BF0ADCA42EAC5D4D773B024FA442\n\n[The malware uses an open-source project called KDMapper to manually map non-signed/self-signed](https://github.com/TheCruZ/kdmapper)\ndrivers in memory by exploiting the iqvw64e.sys Intel driver. Testing on this has reportedly been\nconducted on Windows 10 version 1607 to Windows 11 version 22449.1. The functions\nintel_driver::Load() and kdmapper::MapDriver() are both responsible for achieving this task.\n\nThe following snippet demonstrates the debug message related to drive loading and installation:\n\nFigure 27 Debug message for loading the driver and providing execution status\n\n\n-----\n\nThe malware then establishes persistence on the targeted system by creating scheduled tasks.\n\nFigure 28. Malware persistence is achieved via scheduled tasks (click the image for a larger version)\nFinally, the EnigmaDownloader_s002 downloads and executes the next-stage payload on the\ninfected system. To achieve this task, it employs similar techniques as those used in the first stage\n— the only difference, in this case, is that the malware is executing a .NET Assembly from C++ in\nmemory using the CLR (Common Language Runtime) hosting technique.\n\nFigure 29. The stage 3 .NET binary is executed via CLR hosting\nStage 2.1: Enigma Driver analysis\n\n\n-----\n\n**MD5** Driver.SYS\n\n**SHA-1** 28CA7A21DE60671F3B528A9E08A44E1C\n\n**SHA-256** 21F1CFD310633863BABAAFE7E5E892AE311B42F6\n\n**File size** D5B4C2C95D9610623E681301869B1643E4E2BF0ADCA42EAC5D4D773B024FA442\n\nThe driver's sole purpose is to patch the integrity level of the Microsoft defender (MsMpEng.exe) and\nforcibly reduce it from system to untrusted integrity. The reduction of the integrity level to untrusted\n[impedes the process of accessing secure resources on the system for the victim, silently disabling it](https://www.elastic.co/security-labs/sandboxing-antimalware-products)\nwithout terminating the process.\n\nFigure 30. Microsoft defender token integrity modification before and after executing Enigma Driver\nThe code snippets in Figure 31 demonstrate how the malware performs these operations.\n\n\n-----\n\nFigure 31. Integrity level patching\n\nFigure 32. Details of the vulnerable Intel driver binary\n\n\n-----\n\nFigure 33. Details of the certificate of the vulnerable driver (top) and Enigma Driver (bottom)\nStage 3: EnigmaDownloader_s003\n\nThe following table shows the details of Enigma.Bot.Net.exe.\n\n**MD5** 50949ad2b39796411a4c7a88df0696c8\n\n**SHA-1** 67a502395fc4193721c2cfc39e31be11e124e02c\n\n**SHA-256** 8dc192914e55cf9f90841098ab0349dbe31825996de99237f35a1aab6d7905bb\n\n**File size** 10.50 KB (10752 bytes)\n\nEnigmaDownloader_s003 is a third-stage downloader written in C#. It is responsible for\ndownloading, decompressing, and executing the final stealer payload on an infected system. The\nmalware also accepts commands from a Telegram channel, though these commands may vary\nbetween variants\n\n\n-----\n\nstop\nalive\n\nrunassembly\n\nUpon launch, the malware sends a \"Bot started\" message to both the Debug server and the\nTelegram channel, indicating its successful execution.\n\nFigure 34. Stage 3 payload initialization\nIt then sends a GET request to https://api[.]telegram[.]org/bot{token}/getUpdates to retrieve the\ncommand. Upon receiving the runassembly command, the malware downloads the next part of the\nfinal stage payload (file_19.pack), decompresses it using the GZipStream API, and executes it.\n\n\n-----\n\nFigure 35. Stage 3 payload commands\n\n\n-----\n\nFigure 36. An example of network communication between EnigmaDownloader_s003 and the\nattacker’s Telegram channel.\nStage 4: Enigma Stealer\n\n**MD5** 4DC2D57D9DB430235B21D7FB735ADF36\n\n**SHA-1** 98BF3080A85743AB933511D402E94D1BCEE0C545\n\n\n**SHA-**\n**256**\n\n**File**\n**size**\n\n\n4D2FB518C9E23C5C70E70095BA3B63580CAFC4B03F7E6DCE2931C54895F13B2C\n\n2954.75 KB (2954752 bytes)\n\n\nThe final stage is the Enigma Stealer which, as we previously mentioned, is a modified version of an\nopen-source information stealer project called Stealerium.\n\n\n-----\n\nUpon execution, the malware initializes configuration and sets up its working directory.\n\nFigure 37. Enigma Stealer initialization\nThe malware configuration is as follows:\n\npublic static string Version = \"0.05.01\";\n\npublic static string DebugMode = \"0\";\n\npublic static string Mutex = \"6C0560CE-2E75-4BB4-A26E-F08592A1D56D\";\n\npublic static string AntiAnalysis = \"0\";\n\npublic static string Autorun = \"1\";\n\npublic static string StartDelay = \"0\";\n\npublic static string WebcamScreenshot = \"1\";\n\npublic static string KeyloggerModule = \"0\";\n\npublic static string ClipperModule = \"0\";\n\npublic static string GrabberModule = \"0\";\n\npublic static string TelegramToken = \"5894962737:AAHAFZnz2AkLAyHC0G-7S2je9JMWWLJHGsU\";\n\npublic static string TelegramChatID = \"5661436914\";\n\nIt then starts to collect system information and steals user information, tokens, and passwords from\nvarious web browsers and applications such as Google Chrome, Microsoft Edge, Microsoft Outlook,\nTelegram, Signal, OpenVPN and others. It captures screenshots and extracts clipboard content and\nVPN configurations.\n\n\n-----\n\nFigure 38. Enigma Stealer exfiltrating sensitive data\nThe collected information is then compressed and exfiltrated to the attacker via Telegram.\n\nFigure 39. An example of data exfiltrated from the victim’s system\n\n\n-----\n\nFigure 40. Data upload logic\nFigure 41 illustrates a sample of the network traffic generated by the malware.\n\nFigure 41. Network traffic of data upload to the attacker's telegram channel\n\n\n-----\n\nFigure 42. Enigma Stealer capabilities\n\nIt's worth mentioning that some strings, such as web browser paths and Geolocation API services\nURLs, are encrypted with the AES algorithm in cipher-block chaining (CBC) mode.\n\n\n-----\n\nFigure 43. String encryption logic\nList of decrypted strings:\n\n\\Chromium\\User Data\\\n\n\\Google\\Chrome\\User Data\\\n\n\\Google(x86)\\Chrome\\User Data\\\n\n\\Opera Software\\\n\n\\MapleStudio\\ChromePlus\\User Data\\\n\n\\Iridium\\User Data\\\n\n7Star\\7Star\\User Data\n\n//CentBrowser\\User Data\n\n//Chedot\\User Data\n\nVivaldi\\User Data\n\nKometa\\User Data\nElements Browser\\User Data\n\nEpic Privacy Browser\\User Data\n\nuCozMedia\\Uran\\User Data\n\nFenrir Inc\\Sleipnir5\\setting\\modules\\ChromiumViewer\n\nCatalinaGroup\\Citrio\\User Data\n\nCoowon\\Coowon\\User Data\n\nliebao\\User Data\n\nQIP Surf\\User Data\n\nOrbitum\\User Data\n\nComodo\\Dragon\\User Data\n\nAmigo\\User\\User Data\n\nTorch\\User Data\n\nYandex\\YandexBrowser\\User Data\n\nComodo\\User Data\n\n360Browser\\Browser\\User Data\n\n\n-----\n\nMaxthon3\\User Data\nK-Melon\\User Data\n\nCocCoc\\Browser\\User Data\n\nBraveSoftware\\Brave-Browser\\User Data\n\nMicrosoft\\Edge\\User Data\n\nhttp://ip-api.com/line/?fields=hosting/content/dam/trendmicro/global/en/research/23/enigma-stealertargets-cryptocurrency-industry-with-fake-jobs/iocs-enigma-stealer-targets-cryptocurrency-industrywith-fake-jobs-tm.txt\n\nhttps://api.mylnikov.org/geolocation/wifi?v=1.1&bssid=\n\nhttps://discordapp.com/api/v6/users/@me\n\n## Conclusion\n\n[Similar to previous campaigns involving groups such as Lazarus, this campaign demonstrates a](https://www.bleepingcomputer.com/news/security/north-korean-hackers-target-crypto-experts-with-fake-coinbase-job-offers/)\npersistent and lucrative attack vector for various advanced persistent threat (APT) groups and threat\nactors. Through the use of employment lures, these actors can target individuals and organizations\n[across the cryptocurrency and Web 3 sphere. Furthermore, this case highlights the evolving nature](https://www.trendmicro.com/en_us/research/22/l/web3-ipfs-only-used-for-phishing---so-far.html)\nof modular malware that employ highly obfuscated and evasive techniques along with the utilization\nof continuous integration and continuous delivery (CI/CD) principles for continuous malware\ndevelopment.\n\n[Organizations can protect themselves by remaining vigilant against phishing attacks. Furthermore,](https://www.trendmicro.com/en_us/what-is/phishing.html)\nindividuals are advised to remain cautious of social media posts or phishing attempts that offer job\nopportunities unless they are sure of their legitimacy. Due to current economic conditions, threat\nactors can be expected to continue to heavily deploy employment lures to target those seeking\nemployment.\n\n[Meanwhile, organizations should also consider cutting edge multilayered defensive strategy and](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html)\n[comprehensive security solutions such as Trend Micro™ XDR that can detect, scan, and block](https://www.trendmicro.com/en_us/business/products/detection-response/xdr.html)\nmalicious URLs across the modern threat landscape.\n\n## Indicators of Compromise (IOCs)\n\n[The indicators of compromise for this entry can be found here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/23/enigma-stealer-targets-cryptocurrency-industry-with-fake-jobs/iocs-enigma-stealer-targets-cryptocurrency-industry-with-fake-jobs-trend-micro.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-09 - Enigma Stealer Targets Cryptocurrency Industry with Fake Jobs.pdf"
    ],
    "report_names": [
        "2023-02-09 - Enigma Stealer Targets Cryptocurrency Industry with Fake Jobs.pdf"
    ],
    "threat_actors": [
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1677809186,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1677662114,
    "ts_modification_date": 1677662114,
    "files": {
        "pdf": "https://archive.orkl.eu/af67817d0ce66e2b25b8e98cf45123923d7e3fc7.pdf",
        "text": "https://archive.orkl.eu/af67817d0ce66e2b25b8e98cf45123923d7e3fc7.txt",
        "img": "https://archive.orkl.eu/af67817d0ce66e2b25b8e98cf45123923d7e3fc7.jpg"
    }
}