{
    "id": "035713d3-e1d4-43a6-a2ff-7c5ee63c2f0a",
    "created_at": "2023-01-12T15:09:13.260644Z",
    "updated_at": "2025-03-27T02:13:50.053943Z",
    "deleted_at": null,
    "sha1_hash": "95c0c53bda8d9ebea888c236540de56033e6a151",
    "title": "2018-05-21 - An In-Depth Analysis of Samsam Ransomware and BOSS SPIDER",
    "authors": "",
    "file_creation_date": "2022-05-28T19:45:37Z",
    "file_modification_date": "2022-05-28T19:45:37Z",
    "file_size": 2186833,
    "plain_text": "# An In-Depth Analysis of Samsam Ransomware and BOSS SPIDER\n\n**[crowdstrike.com/blog/an-in-depth-analysis-of-samsam-ransomware-and-boss-spider/](https://www.crowdstrike.com/blog/an-in-depth-analysis-of-samsam-ransomware-and-boss-spider/)**\n\nMay 21, 2018\n\nMay 21, 2018\n\n[Karan Sood](https://www.crowdstrike.com/blog/author/karansood/) [From The Front Lines](https://www.crowdstrike.com/blog/category/from-the-front-lines/)\n\n## Introduction\n\nThis analysis provides an in-depth view of the Samsam ransomware, which is developed\nand operated by the actor tracked by CrowdStrike® Falcon Intelligence™ as BOSS\nSPIDER. The infection chain and the execution flow vary according to the variant of the\nmalware, both of which are detailed in this writeup. The malware uses external tools such\nas batch scripts, Mimikatz, and Sysinternals utilities, including PsExec and Sdelete, to aid in\nthe propagation and cleanup of the ransomware. In some cases, the ransomware is\ndelivered in an encrypted manner alongside a runner file, which is used to load and execute\nthe malware in memory. In addition, the malware has anti-forensics capabilities that make it\nchallenging to recover the ransomware payload from an infected system. Despite the steps\ntaken by the malware to evade detection, Falcon Prevent can detect and prevent the family\nbefore it ever encrypts any files on the system.\n\n## Infection Process\n\n\n-----\n\nNumerous variations of delivery methods for this ransomware family have been seen in the\nwild. Earlier variations of the ransomware involved gathering credentials from Active\nDirectory via a credential dumper such as Mimikatz, generating public RSA keys for each\nuser on the list and deploying the payload along with the following files:\n\nPSExec: A legitimate utility that is part of Sysinternals suite used to execute\napplications on remote systems\nBackup-Delete Helper File: This file is responsible for enumerating all the drives\n[connected to the victim machine. A detailed analysis is provided in the Backup–Delete](https://docs.google.com/document/d/1FzJkhSsKV6vTLNewaduhwkum1WDfGjXg0zu4sU78O6M/edit#heading=h.gw8tkwt73pza)\nHelper File subsection\nA list of compromised accounts\nA folder containing unique RSA public keys for each account\nFour batch scripts that are responsible for copying the files to each victim computer\nand loading the payload\n\nFirst file: copies the samsam payload and the corresponding public key to\n%WINDIR%\\system32; issues the command “vssadmin delete shadows /all\n**/quiet”**\nSecond file: copies the backup-delete helper file to C:\\Windows\nThird file: utilizes psexec to remotely execute the delete helper file\nFourth file: utilizes psexec to remotely execute the payload; provides the\ncorresponding public key as an argument to the payload\n\nAs seen above, the public key and the backup deletion commands are external to the\npayload itself. In other variants of Samsam, both the key and the backup deletions\ncommand have been embedded within the payload. In such cases, the delivery mechanism\ndiffers significantly from the one described above. Rather than deploying the payload with\nnumerous files, the payload is instead encrypted and deployed with a runner file and a\nbatch script as described below:\n\nRunner file: responsible for decrypting and loading the payload; a detailed analysis is\nprovided in the Runner File subsection.\nBatch script: loads the runner file and provides the following arguments to it (It should\n_be noted that the number of arguments can also differ depending on the variant of the_\n_ransomware. Up to four arguments have been observed so far)._\n\n<password>: used to decrypt the encrypted payload\n<path>: used by the decrypted payload to drop additional files\n<totalprice>: used by the decrypted payload to dynamically generate the splash\nscreen\n<priceperhost>: used by the decrypted payload to dynamically generate the\nsplash screen\n\nIn other cases, standalone Samsam payloads that do not require any arguments or helper\nfiles have also been seen.\n\n\n-----\n\nAs mentioned, there are a variety of ways in which the payload can be delivered and loaded\nonto a system. Subsequent sections will describe the payload and some of the previously\nmentioned helper files in more detail.\n\n## Technical Analysis\n\n**Backup-Delete Helper File**\n\nThis file is responsible for traversing the file system on a victim computer and targeting\nspecific file extensions associated with data backup. The extensions are provided in\n**Appendix A: Targeted Backup Extensions. This program’s goal is to ensure that once the**\nfiles on the system have been encrypted, no backups can be used for file restoration.\n_Please note that if any shared drives are connected, the helper file will also delete the_\n_corresponding files in those folders._\n\nOnce loaded by the batch script, this file recursively enumerates each directory in each\ndrive connected to the victim machine. If a directory name contains the string “backup,” the\nprogram will enumerate all the files within that directory and perform the following actions:\n\nSet the file attributes to FILE_ATTRIBUTE_NORMAL. This ensures that the file can\nbe deleted without throwing an exception.\nDelete each file once the file attribute is set.\nOnce all the files have been deleted, delete the directory itself.\n\nFor all the other directories, once a target file is found, the program ensures that it can\ndelete the file by performing the following actions:\n\nChecks that the file is not locked. In other words, makes sure that there isn’t a handle\nto the file being accessed by a process and that the file can be opened in READ\nmode. If the check passes, delete the file.\nIf the above check fails, the program kills the process associated with the file.\n\nIt invokes tasklist.exe to generate a list of running processes on the system by\nissuing the following command: tasklist /v /fo csv.\nIt enumerates the list to find a process with the same name as the file in\nquestion. If found, it invokes taskkill.exe to kill the process by issuing the\nfollowing command: taskkill /f /pid <process ID of the target process>.\nOnce the process has been killed, it deletes the corresponding file.\n\nThe following is a snippet of the output of the tasklist command:\n\n\n-----\n\n_Figure 1: Output of the tasklist command_\n\n**Runner File**\n\nThe runner file is responsible for decrypting and loading the payload in memory. This file\nrequires a password as an argument, which is used in the decryption process. Once loaded\nby the batch script, the runner looks for a file with the extension “.stubbin” within the\ncurrent working directory. This file is the actual encrypted payload and once it is found, the\nrunner reads the contents in memory and deletes the encrypted .stubbin file from the disk\nimmediately. The fact that the payload is decrypted and loaded entirely in memory makes it\nhard to recover the decrypted ransomware payload forensically.\n\nOnce the content is read, the runner decrypts it using the Rijndael algorithm. The password\nand a salt are provided to the algorithm to generate the decryption key and an IV. The salt\nvalue is “Ivan Medvedev”, which has been seen in numerous binaries (benign and\nmalicious) employing this algorithm. With these two inputs, the runner file generates a 32\nbyte key, and a 16 byte IV, which are then subsequently used to decrypt the payload. It is\nimportant to note that any additional arguments passed down from the batch file are then\npassed to the decrypted payload. The runner file is then responsible for invoking the entry\npoint of the payload; thereby executing it in memory.\n\n**Payload**\n\nNumerous variants of the payload were analyzed, and one of the main differences among\nthem was whether the RSA public key was embedded in the payload or not. As mentioned\nearlier, the batch script responsible for loading the payload passes the public key as an\nargument to it, which is then read to a variable and used later in the execution process. This\nsection will explain in detail the steps taken by the ransomware to encrypt the files on the\nvictim machine.\n\n**Resource Extraction**\n\nUpon being loaded, Samsam first parses its own resource section and extracts the resource\nnames. For each name, it ensures that the name has the extension “.exe”, and checks to\nsee if a file with the same name as the resource name exists in the current directory If so it\n\n\n-----\n\ndeletes the file from disk, reads the contents of the resource section in chunks of 4096\nbytes and writes it to disk in the current directory. So far, up to two different files have been\nseen as a result of this extraction: selfdel.exe and del.exe. Please note that this particular\n_activity of dropping two files in the current directory with static names can be used for_\n_detection purposes early on in the kill chain._\n\nOnce the files have been written to disk, the payload initiates a new thread to execute\nselfdel.exe, which is explained in further detail in the Cleanup section. Next, the payload will\nrecursively enumerate all the directories in each drive connected to the victim machine.\n\n**File System Enumeration**\n\nThe payload ensures that the following directories are skipped when enumerating files:\n\nC:\\Windows\nReference Assemblies\\Microsoft\nRecycle.bin\n\nThis is to ensure a smooth execution flow. Since system files reside in C:\\Windows, and\nfiles necessary for the .NET framework are in Reference Assemblies\\Microsoft, it is\nimperative that those files are left intact. One possible reason for skipping files within the\nRecycle.bin directory might be that this directory is usually among the first ones to be\nenumerated by ransomware families. A few security solutions depend on that behavior to\ndetect and prevent the ransomware process early on in the execution flow. By skipping that\ndirectory, Samsam can sidestep that mitigation and continue to encrypt the files.\n\nThe list of file extensions targeted by Samsam are listed in Appendix A: Targeted\n**Extensions. Once a file matching one of the extensions is found, the payload calls the**\nencryption subroutine immediately, if the file size is less than or equal to 100MB\n(104857600 bytes). However, if the file size is greater, the following actions take place:\n\nIf the file size is greater than 100MB and less or equal to 250MB, it appends the file’s\nfull path to the list mylist250.\nIf the file size is greater than 250MB and less or equal to 500MB, it appends the file’s\nfull path to the list mylist500.\nIf the file size is greater than 500MB and less or equal to 1GB, it appends the file’s full\npath to to the list mylist1000.\nIf the file size is greater than 1GB, it appends the file’s full path to the list mylistbig.\n\nThe payload encrypts the files in those lists once all the targeted files less than or equal to\n100MB in size are encrypted first. This is likely done to ensure that as many files as\npossible are encrypted in case the ransomware process ends prematurely. It should be\nnoted that the encryption subroutine is called on those lists in order of the file size; files in\n**mylist250 are encrypted first, followed by mylist500 and so on. Once the files in each list**\nare encrypted, the payload clears the list in memory.\n\n\n-----\n\nIn other variants of Samsam, this behavior of categorizing files per size is absent. Those\nvariants utilize just one list to compile a list of all files within all the drives connected to the\nvictim machine. Next, the file encryption subroutine is invoked to encrypt the target files.\n\n**File Encryption Wrapper**\n\nFor each file, the payload performs the following checks:\n\nThe length of the current file is less than the available free space in the drive. If the\ncheck fails, the payload moves on to the next file. This is to ensure that there is\nenough free space to write the encrypted file to disk.\nThe length of the current file is greater than 0 bytes.\nThe public key variable is not NULL. Without the public key, no encryption would take\nplace.\n\nIf any of the above checks fail, the payload moves on to the next file.\n\nNext, there are two observed variations in the manner in which encryption takes place;\nthese depend on the variant of Samsam running on the system.\n\nVariation A\n\nFor each file, the subroutine first checks if a file with the name <target filename>.<encrypted\nextension> already exists in the current directory. The encrypted extensions value has\nconsistently been “.encryptedRSA”. If so, the following steps are taken:\n\nChecks the length of the .encryptedRSA file. If this file size is greater than the target\nfile, the subroutine deletes the target file and moves on to the next file. The program\nassumes that the file has already been encrypted with Samsam and therefore deletes\nthe original target file.\nIf the .encryptedRSA file size is less than or equal to the target file, the subroutine\ndeletes the .encryptedRSA file. Since the actual encryption will cause the resultant file\nsize to be greater than the original file, the .encryptedRSA file size must be greater\nthan the target file. The program assumes that the .encryptedRSA file is not the actual\nencrypted file and deletes it from disk. Once the .encryptedRSA file is deleted, the\ntarget file is encrypted.\n\nVariation B\n\nIf the subroutine finds a file with the name <target filename>.encryptedRSA, it immediately\nskips the target file. There are no checks on the length of this file, nor is there any attempt\nto delete the target file. It is important to note that the subroutine moves onto the next file,\nleaving the current target file intact. This is a significant oversight on the malware author’s\npart since it implies that if there are files of any length with the extension .encryptedRSA for\neach file on the system, no files would get encrypted. In fact the ransomware would simply\nskip over every file, assuming that the files are already encrypted. This was tested and\nconfirmed during analysis\n\n\n-----\n\n**File Encryption**\n\nSamsam utilizes the AES standard to encrypt the files. For each file, it generates a random\n64 byte signaturekey, a 16 byte key, and a 16 byte IV. It also creates an empty file <target\nfilename>.encryptedRSA to which it writes 3072 NULL bytes. This acts as a placeholder for\nthe encrypted file header that is generated later in the execution flow. The payload then\ndetermines if there are current processes or services with an open handle to the target file\nby utilizing Restart Manager APIs. The following explains the steps in detail:\n\nStart a new session manager by invoking RmStartSession.This provides a session\nhandle to the new session.\nThe handle is used by RmRegisterResources to register the target file as a resource\nto the new session.\nThe handle is then used by RmGetList to get a list of processes that are currently\nutilizing the resource in question (target file).\nThe session manager is ended with RmEndSession.\nThe process ID of each process locking the file is appended to a file, which is then\npassed to a subroutine responsible for killing those processes.\n\nOnce the target file handle is freed from any processes, the encryption subroutine reads its\ncontents in a memory buffer in chunks of 10KB (10240 bytes) at a time. Next, the\nsubroutine uses AES in CBC mode to encrypt the contents in the buffer, which are then\nwritten to the .encryptedRSA file starting from the 3073rd byte position (after the header\nplaceholder). Once the entire file content has been encrypted and written to the new file, the\nfile header is generated.\n\n**File Header**\n\nThe randomly generated signaturekey is used to generate a Hash-based Message\nAuthentication Code (HMAC) hash of the encrypted content. This value, inArray, is then\nencoded with base64, and written to the file header. The following is the structure of the file\nheader:\n\n<MtAeSKeYForFile>\n\n<Key>: contains the randomly generated 16 byte key encrypted with the RSA public\nkey, and then encoded using base64. </Key>\n<IV>: contains the randomly generated 16 byte IV encrypted and encoded in the\nsame manner. </IV>\n<Value>: contains the aforementioned inArray </Value>\n<EncryptedKey>: contains the randomly generated 64 byte signature key encrypted\nand encoded in the same manner. </Encrypted>\n<OriginalFileLength>:contains the file size of the original target file.\n</OriginalFileLength>\n</MtAeSKeYForFile>\n\n\n-----\n\nThe corresponding RSA private key would help decrypt each value in the file header that\nwould, in turn, decrypt the file contents. The following is an example of an actual file header\nof a file encrypted by Samsam:\n\n_Figure 2: File header of a file encrypted with Samsam_\n\nOnce the file is encrypted, the original target file is deleted from disk.\n\n**Post Encryption**\n\nAfter each file has been encrypted, the payload will drop a text file named\n**HELP_DECRYPT_YOUR_FILES in the current directory. Figure 3 shows contents of the**\nfile.\n\n\n-----\n\n_Figure 3: Ransomware note_\n\nIn some instances, HELP_DECRYPT_YOUR_FILES.html with the same contents is\ndropped in the current directory. An odd behavior of every variant of Samsam analyzed is\nthat the ransomware note is dropped for every file encrypted. Therefore, in directories\nwhere multiple files have been encrypted, multiple copies of the same ransomware note are\ndropped.\n\n**Cleanup**\n\nAs mentioned earlier, the payload parses its resource section to extract two executables\nwhich are then written to the current directory. The following are the properties of both files:\n\n**File: selfdel.exe**\n\n**Size: 5632**\n\n**MD5: 710A45E007502B8F42A27EE05DCD2FBA**\n\n**SHA256:**\n\n\n-----\n\n32445C921079AA3E26A376D70EF6550BAFEB1F6B0B7037EF152553BB5DAD116F\n**Compiled: Wed, Dec 2 2015, 22:24:42 – 32 Bit .NET AnyCPU EXE**\n**Version: 1.0.0.0**\n\n**File: del.exe**\n**Size: 155736**\n**MD5: E189B5CE11618BB7880E9B09D53A588F**\n**SHA256:**\n97D27E1225B472A63C88AC9CFB813019B72598B9DD2D70FE93F324F7D034FB95\n**Compiled: Sat, Jan 14 2012, 23:06:53 – 32 Bit EXE**\n**Version: 1.61**\n**Signature: Valid**\n**Subject: Microsoft Corporation**\n**Issuer: Microsoft Code Signing PCA**\n**InternalName: sdelete**\n**ProductName: Sysinternal Sdelete**\n\nThe file del.exe is a legitimate Sysinternals utility that is used to delete files from disk. The\nfile selfdel.exe is invoked in a new thread by the payload. It first ensures that a process\nnamed samsa.exe is currently executing. If not, it immediately exits. Next, the file waits for 3\nseconds, and then issues the following command: del.exe -p 16 samsam.exe. This\ninvokes the legitimate utility del.exe, which is used to delete samsam.exe from disk.\nHowever, deleting a file simply marks it as deleted in the MFT table, which frees up the\nclusters that were allocated to the file. The file contents would still be present in those\nclusters. To overcome this, the utility actually overwrites the clusters; the -p 16 argument\nensures that the clusters are overwritten 16 times, making forensic recovery of the payload\nimpossible. This technique only applies to standalone payloads, and not to the variants that\ninvolve a runner file to decrypt and execute the payload in memory.\n\nOnce the payload is deleted, selfdel.exe sleeps for 30 seconds, and then deletes del.exe\nfrom disk; however, it does not delete itself.\n\n**How CrowdStrike Falcon Prevent™ Stops Samsam®**\n\nSamsam is unique in terms of how it is delivered onto a system. The gathering of user\ncredentials to generate unique RSA public keys ensures that an organization would have to\npay for each infected user to decrypt the files. In addition, the use of cleanup files for\nstandalone executables, and the fact that other variants run entirely in memory, makes it\nextremely difficult to forensically collect the payload from disk or memory. Despite these\nchallenges, Falcon Prevent™ next-gen AV is able to detect and prevent the malware before\nit can perform any file encryption as seen below:\n\n\n-----\n\n_Figure 4: Samsam prevented by Falcon Prevent_\n\nFalcon Prevent is also able to detect and prevent the dropped file selfdel.exe from\nexecuting once loaded by the payload as shown below:\n\n_Figure 5: Selfdel.exe prevented by Falcon Prevent_\n\nThese preventions are based on the behavioral patterns displayed by Samsam in\nconjunction with CrowdStrike’s machine learning algorithm.\n\n## Appendix A\n\nTargeted Backup Extensions\n\n.abk, .ac, .back, .backup, .backupdb, .bak, .bb, .bk, .bkc, .bke, .bkf, .bkn, .bkp, .bpp, .bup,\n.cvt, .dbk, .dtb, .fb, .fbw, .fkc, .jou, .mbk, .old, .rpb, .sav, .sbk, .sik, .spf, .spi, .swp, .tbk, .tib,\n.tjl, .umb, .vbk, .vib, .vmdk, .vrb, .wbk\n\nTargeted Extensions\n\n.jin, .xls, .xlsx, .pdf, .doc, .docx, .ppt, .pptx, .log, .txt, .gif, .png, .conf, .data, .dat, .dwg, .asp,\n.aspx, .html, .tif, .htm, .php, .jpg, .jsp, .js, .cnf, .cs, .vb, .vbs, .mdb, .mdf, .bak, .bkf, .java, .jar,\n.war, .pem, .pfx, .rtf, .pst, .dbx, .mp3, .mp4, .mpg, .bin, .nvram, .vmdk, .vmsd, .vmx, .vmxf,\n.vmsn, .vmem, .gz, .3dm, .3ds, .zip, .rar, .3fr, .3g2, .3gp, .3pr, .7z, .ab4, .accdb, .accde,\n.accdr, .accdt, .ach, .acr, .act, .adb, .ads, .agdl, .ai, .ait, .al, .apj, .arw, .asf, .asm, .asx, .avi,\n.awg, .back, .backup, .backupdb, .pbl, .bank, .bay, .bdb, .bgt, .bik, .bkp, .blend, .bpw, .c,\n\n\n-----\n\n.cdf, .cab, .chm, .cdr, .cdr3, .cdr4, .cdr5, .cdr6, .cdrw, .cdx, .ce1, .ce2, .cer, .cfp, .cgm, .cib,\n.class, .cls, .cmt, .cpi, .cpp, .cr2, .craw, .crt, .crw, .csh, .csl, .csv, .dac, .db, .db3, .dbf, .dbjournal, .dc2, .dcr, .dcs, .ddd, .ddoc, .ddrw, .dds, .der, .des, .design, .dgc, .djvu, .dng, .dot,\n.docm, .dotm, .dotx, .drf, .drw, .dtd, .dxb, .dxf, .jse, .dxg, .eml, .eps, .erbsql, .erf, .exf, .fdb,\n.ffd, .fff, .fh, .fmb, .fhd, .fla, .flac, .flv, .fpx, .fxg, .gray, .grey, .gry, .h, .hbk, .hpp, .ibank, .ibd,\n.ibz, .idx, .iif, .iiq, .incpas, .indd, .jpe, .jpeg, .kc2, .kdbx, .kdc, .key, .kpdx, .lua, .m, .m4v,\n.max, .mdc, .mef, .mfw, .mmw, .moneywell, .mos, .mov, .mrw, .msg, .myd, .nd, .ndd, .nef,\n.nk2, .nop, .nrw, .ns2, .ns3, .ns4, .nsd, .nsf, .nsg, .nsh, .nwb, .nx2, .nxl, .nyf, .oab, .obj, .odb,\n.odc, .odf, .odg, .odm, .odp, .ods, .odt, .oil, .orf, .ost, .otg, .oth, .otp, .ots, .ott, .p12, .p7b,\n.p7c, .pab, .pages, .pas, .pat, .pcd, .pct, .pdb, .pdd, .pef, .pl, .plc, .pot, .potm, .potx, .ppam,\n.pps, .ppsm, .ppsx, .pptm, .prf, .ps, .psafe3, .psd, .pspimage, .ptx, .py, .qba, .qbb, .qbm,\n.qbr, .qbw, .qbx, .qby, .r3d, .raf, .rat, .raw, .rdb, .rm, .rw2, .rwl, .rwz, .s3db, .sas7bdat, .say,\n.sd0, .sda, .sdf, .sldm, .sldx, .sql, .sqlite, .sqlite3, .sqlitedb, .sr2, .srf, .srt, .srw, .st4, .st5, .st6,\n.st7, .st8, .std, .sti, .stw, .stx, .svg, .swf, .sxc, .sxd, .sxg, .sxi, .sxi, .sxm, .sxw, .tex, .tga, .thm,\n.tlg, .vob, .wallet, .wav, .wb2, .wmv, .wpd, .wps, .x11, .x3f, .xis, .xla, .xlam, .xlk, .xlm, .xlr,\n.xlsb, .xlsm, .xlt, .xltm, .xltx, .xlw, .ycbcra, .yuv\n\n_[Learn more about Falcon Prevent Next-Gen AV.](https://www.crowdstrike.com/products/falcon-prevent/)_\n\n_Download the white paper: Guide to AV Replacement: What You Need to Know Before_\n_Replacing Your Antivirus Solution._\n\nRelated Content\n\n\n-----\n\nCompromised Docker Honeypots Used for Pro-Ukrainian DoS Attack\n\n\n-----\n\nNavigating the Five Stages of Grief During a Breach\n\nLemonDuck Targets Docker for Cryptomining Operations\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-05-21 - An In-Depth Analysis of Samsam Ransomware and BOSS SPIDER.pdf"
    ],
    "report_names": [
        "2018-05-21 - An In-Depth Analysis of Samsam Ransomware and BOSS SPIDER.pdf"
    ],
    "threat_actors": [
        {
            "id": "eb8697fd-882a-4323-9eb8-8e20222cfd91",
            "created_at": "2022-10-25T16:07:23.416834Z",
            "updated_at": "2025-03-27T02:02:09.788953Z",
            "deleted_at": null,
            "main_name": "Boss Spider",
            "aliases": [
                "Boss Spider",
                "CTG-0007",
                "Gold Lowell"
            ],
            "source_name": "ETDA:Boss Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "SDelete",
                "SamSam",
                "Samas"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4116df25-aff6-46ee-a5dd-926254a78e89",
            "created_at": "2023-01-06T13:46:38.894033Z",
            "updated_at": "2025-03-27T02:00:02.94496Z",
            "deleted_at": null,
            "main_name": "BOSS SPIDER",
            "aliases": [
                "GOLD LOWELL"
            ],
            "source_name": "MISPGALAXY:BOSS SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1b20199b-07ae-42f1-ad22-bbe2dd471df8",
            "created_at": "2024-06-04T02:03:07.872554Z",
            "updated_at": "2025-03-27T02:05:17.383011Z",
            "deleted_at": null,
            "main_name": "GOLD LOWELL",
            "aliases": [
                "CTG-0007 ",
                "Boss Spider "
            ],
            "source_name": "Secureworks:GOLD LOWELL",
            "tools": [
                "Samas"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536153,
    "ts_updated_at": 1743041630,
    "ts_creation_date": 1653767137,
    "ts_modification_date": 1653767137,
    "files": {
        "pdf": "https://archive.orkl.eu/95c0c53bda8d9ebea888c236540de56033e6a151.pdf",
        "text": "https://archive.orkl.eu/95c0c53bda8d9ebea888c236540de56033e6a151.txt",
        "img": "https://archive.orkl.eu/95c0c53bda8d9ebea888c236540de56033e6a151.jpg"
    }
}