{
    "id": "03c7a17c-a90a-4f7e-84d3-5b94c887aceb",
    "created_at": "2023-01-12T15:06:55.776603Z",
    "updated_at": "2025-03-27T02:16:25.765693Z",
    "deleted_at": null,
    "sha1_hash": "7eaaa62af4bfb7ce5c47cf4bedbc5c1140fc94e2",
    "title": "2021-10-21 - Franken-phish- TodayZoo built from other phishing kits",
    "authors": "",
    "file_creation_date": "2022-05-28T23:17:00Z",
    "file_modification_date": "2022-05-28T23:17:00Z",
    "file_size": 2386759,
    "plain_text": "# Franken-phish: TodayZoo built from other phishing kits\n\n**[microsoft.com/security/blog/2021/10/21/franken-phish-todayzoo-built-from-other-phishing-kits/](https://www.microsoft.com/security/blog/2021/10/21/franken-phish-todayzoo-built-from-other-phishing-kits/)**\n\nOctober 21, 2021\n\nA phishing kit built using pieces of code copied from other kits, some available for sale through publicly accessible scam sellers or are reused\nand repackaged by other kit resellers, provides rich insight into the state of the economy that drives phishing and email threats today. We\nuncovered this phishing kit while examining an extensive series of credential phishing campaigns that all sent credentials to a set of endpoints\noperated by the attackers.\n\nWe named the kit “TodayZoo” because of its curious use of these words in its credential harvesting component in earlier campaigns, likely a\nreference to phishing pages that spoofed a popular video conferencing application. Our prior research on phishing kits told us TodayZoo\ncontained large pieces of code copied from widely circulated ones. The copied code segments even have the comment markers, dead links,\nand other holdovers from the previous kits.\n\n[Today’s phishing attacks operate on a landscape fueled by an evolved service-based economy filled with efficient, reliable, and profitable](https://www.microsoft.com/security/blog/2021/09/21/catching-the-big-fish-analyzing-a-large-scale-phishing-as-a-service-operation/)\nofferings. Attackers who wish to launch a phishing campaign may rent their resource and infrastructure needs from phishing-as-a-service\n(PhaaS) providers, who do the legwork for them. Alternatively, they can make a one-time purchase of a phishing kit that they can “plug and\nplay.”\n\nThat’s not to say that attackers who build their kits from the ground up are at a disadvantage. If anything, the abundance of phishing kits and\nother tools available for sale or rent makes it easy for a lone wolf attacker to pick and choose the best features from these kits. They put these\nfunctionalities together in a customized kit and try to reap the benefits all to themselves. Such is the case of TodayZoo: because of the\nconsistency in the redirection patterns, domains, and other techniques, tactics, and procedures (TTPs) of its related campaigns, we believe\nthat the actors behind it came across an old phishing kit template and replaced the credential harvesting part with its own exfiltration logic to\nmake TodayZoo solely for their nefarious purposes.\n\nSince the first observed instances of the TodayZoo phishing kit last December, large email campaigns leading to it have continued without\nsignificant pause. Our analysis of its phishing page artifacts, redirection routines, and domain generation algorithm (DGA) methods for the\n[initial sites helps ensure Microsoft Defender for Office 365 effectively protect customers from the said campaigns.](https://www.microsoft.com/security/business/threat-protection/office-365-defender)\n\nMicrosoft tracks unique phishing kits, phishing services, and other components used in phishing to better protect customers from malicious\n[emails at a larger scale. Combined with our monitoring of individual credential campaigns and the latest evasion techniques, our research into](https://www.microsoft.com/security/blog/2021/08/18/trend-spotting-email-techniques-how-modern-phishing-emails-hide-in-plain-sight/)\nkits and services provides us with a better understanding of the structure of phishing email messages. Such threat intelligence and insights, in\n[turn, feed into our protection technologies, such as Defender for Office 365 and Microsoft 365 Defender.](https://www.microsoft.com/en-us/security/business/threat-protection/microsoft-365-defender)\n\nThis blog post details some of the technical aspects of a phishing campaign based on the TodayZoo kit. It also provides information about\n“DanceVida,” a potential parent family of kits based on a shared resource link, and how it and other historical patterns figure in TodayZoo’s\ncode structure.\n\n\n-----\n\n## What s in a kit?\n\nA “phishing kit” or “phish kit” can refer to various parts of a set of software or services meant to facilitate phishing. The term refers most\ncommonly to an archive file containing images, scripts, and HTML pages that enable an attacker to quickly set up an undetectable phishing\npage and collect credentials through it. However, “phishing kit” can also be used to refer specifically to the unique page itself that spoofs a\nbrand and interacts with a user, collects the user’s credentials, and posts them to an asset the attacker owns.\n\nPhishing kits are generally split into the following major components based on function:\n\n**Imitation: These components help make the login pages appear legitimate. These can include imagery to imitate welcome banners, as**\nwell as dynamically generated logos and branding that are fetched based on the target’s email address. These components may also\ninclude legitimate links and “help” or “password reset” buttons that navigate cautious users out of the page and onto legitimate sites.\n**Obfuscation: These components hide the pages’ true purpose from scanners or automated security detection systems. Obfuscation**\ntechniques can be through encoding or individual functions designed to make the extraction of resources more difficult. Obfuscation can\nalso include anti-sandboxing resources on the page or on the site that are called to enforce geofencing, CAPTCHAs, and others.\n**Credential harvest: These components facilitate the entry, collection, and exfiltration of the credentials the target user provides. These**\ncomponents also include information about where said credentials are sent, how they are stored, and which sites the user is sent to after\ngiving their credentials.\n\nThese components are seen in the TodayZoo phishing kit, which we will discuss in the following sections.\n\n## Breaking down a TodayZoo-based phishing campaign\n\nThe use of the TodayZoo phishing kit was initially seen in December 2020. Then, in March 2021, we observed a series of phishing campaigns\nabuse the AwsApps[.]com domain to send the email messages that eventually directed users to the final landing pages, leading us to examine\nthe kit more closely. As of this writing, we have already notified Amazon about the abovementioned abuse in their domain, and they promptly\ntook action.\n\nThe attackers created malicious accounts at scale. Initially, the sender emails appeared with randomly generated domain names such as\n_wederfs76y3uwedi3uy89ewdu23ye87293eqwhduayqw[.]awsapps[.]com. This contrasts legitimate emails—and even some spoofed phishing_\nones—where the subdomain would represent a company hostname.\n\n[The email message itself was relatively simple: it impersonated Microsoft and leveraged a zero-point font obfuscation technique in an attempt](https://www.microsoft.com/security/blog/2021/08/18/trend-spotting-email-techniques-how-modern-phishing-emails-hide-in-plain-sight/)\nto evade detection. For example, in the early iterations of their campaign, the attackers used the <ins></ins> tags to insert the date of the\nmessage every few characters invisibly, as shown below:\n\n_Figure 1. Example of zero-point font obfuscation to insert the date into the HTML code of the email message_\n\nThe social engineering lures in the message body repeatedly changed over the months. Campaigns in April and May used password reset,\nwhile more the recent campaigns in August were leveraging fax and scanner notifications.\n\n_Figure 2 Example of an email lure leading to TodayZoo phishing kit_\n\n\n-----\n\nega d ess o t e u e, t e o o g attac c a s co s ste t, t t a a d seco da y ed ecto s, a a a d g page, a d a c ede t a\nharvesting page. Below is a sample of TodayZoo’s attack chain URLs:\n\n**Initial redirector:**\nhxxp://2124658742[.]ujsd[.]pentsweser[.]com//fhwpp8sv[.]#aHR0cHM6Ly9saW1lc3RvbmVzbS5jb20vZWRmaC5rZXJmcS8jbm8tcmVwbHlAbW\n**Secondary redirector: hxxps://limestonesm[.]com/edfh.kerfq/#no-reply@microsoft[.]com**\n**Final landing page:**\nhxxps://fra1[.]digitaloceanspaces[.]com/koip/25_40_24_5E_40_26_40_26_28_29_23_23_5E_23_24_26_5E_25_26_40_5E_28_23_26.html#\nreply@microsoft[.]com\n**Credential harvesting page: hxxps://nftduniya[.]com/cas/vcoominctodayq[.]php**\n\nThe initial and secondary URLs are either compromised or attacker-created sites and serve as redirectors to funnel the more extensive set of\nURLs used in the emails to the final landing page where the phishing kit is hosted. The initial URL used infinite subdomains, a previously\ndiscussed technique that allows attackers to use a unique URL for each recipient while only purchasing or compromising one domain. The\nURL also leveraged malformed URLs that consisted of multiple forward slashes at the demarcation of the path, as well as the secondary URL\nthat is encoded along with the recipient’s email address.\n\nIn almost every instance of the TodayZoo-based campaign we’ve seen, the final landing page is hosted within the service provider\nDigitalOcean. This page bears a few tangible differences from a standard Microsoft 365 sign-in page. Notably, it has not substantially changed\nin appearance from the start of the year to the time of publication of this blog. This lack of change is because, despite the numerous changes\nin the delivery method, lures, and sites used as indicators of attack (IOAs), the TodayZoo kit stayed nearly identical with only a few strings\nchanging.\n\n_Figure 3. An example of TodayZoo’s fake sign-in page in August 2021_\n\nThere was little of the obfuscation component within the TodayZoo kit because the landing page’s source code revealed where the stolen\ncredentials would be exfiltrated, which was another compromised site ending in TodayZoo.php. Typically, credential harvesting pages process\nthe credentials and forward them to additional email accounts owned by sellers or purchasers of the kit for collection later. It’s unusual for\ncampaigns to store the credentials locally on the site itself.\n\n\n-----\n\n_Figure 4. An excerpt from the TodayZoo HTML source depicting credential exfiltration_\n\nIt should be noted that based on our analysis, the file name TodayZoo.php appears to be derived from a previous version of the phishing kit\nwhose credential processing page ends in Zoom.php. The said version also has markers like “Today Zoom Meetings,” indicating that it was\ninitially targeting users of a popular video conferencing application.\n\nThe succeeding TodayZoo-based campaigns follow the attack killchain pattern and source code discussed above. While for the first few\nmonths of operation, TodayZoo.php was utilized, the most recent harvesting pages have maintained the word “today” but now may use\n_vcoominctodayq.php instead._\n\nThe attackers have also moved from abusing a single legitimate mailing service to compromising mailing service accounts for their email\ncampaigns. However, they maintain specific leftover character patterns in their URL paths and subdomains that work with the other TTPs\ndescribed.\n\n## Piecing the puzzle\n\nTypically, phishing kits that are resold or reused have indicators of multiple actors using them through their generated email campaigns. For\nexample, these campaigns will have varying redirection techniques and hosting domains for their final landing pages. In the case of TodayZoo,\nas previously mentioned, there is consistency in the patterns, domains, and TTPs of the related campaigns. While many phishing kits are\nattributed to a wide variety of email campaign patterns and, conversely, many email campaign patterns are associated with many phishing kits,\nTodayZoo-based pages exclusively utilized the same email campaign patterns, and any of those subsequent email campaigns only surfaced\nTodayZoo kits. These lead us to believe that the actors behind this specific TodayZoo implementation are operating on their own.\n\nWithin the source code of the TodayZoo landing page we analyzed, there were several static references at the very start to external sources.\nGenerally, these external links help a phishing kit properly imitate the login page and other branding elements of the site they are spoofing.\nHowever, in TodayZoo’s case, many of these site connections were “dead links” and did not serve a relevant function within the page. Littered\nthroughout the source code as well were various markers like <!– FORM 1111111111111111 –> and <!– FINISHHHHHHHHHHHHHHHHHHHHH\n_–>. Some portions of the source code also utilized multiple languages in different sections, making clear indications of which ones have been_\nreplaced.\n\nUpon further investigation, we identified the dead links and markers as holdovers from many other commoditized kits available for free or\npurchase. We then compared TodayZoo with other phishing kits we have analyzed previously and found that even these kits also contained\nreferences to sites like Dancevida[.]com but would have different code blocks for their obfuscation or credential harvest components.\n\n_Figure 5. An excerpt from a TodayZoo landing page source code referencing DanceVida[.]com_\n\n### The DanceVida connection\n\n\n-----\n\na ce da s o e o a code b oc t a a u edged p s g t s suc, ts t at use a ce da a e at e d e se t e de e y, u es,\nand location because they are directly for sale on various forums under kit-naming schemas, as well as under a wider variety of landing page\ntemplates, including document download pages. Most of the credentials that the DanceVida-based kits’ harvesting pages gather are exfiltrated\nto accounts using free email services, such as GMail, Yahoo!, and Yandex.\n\nOne of the more notable kits that also reference DanceVida and share components with what we observed in the TodayZoo credential phishing\ncampaigns is “Office-RD117,” which is related to an online seller known as “Fud Tool.” This seller also offers other phishing kits and email and\nSMS delivery tools on various forums and other websites.\n\n_Figure 6: Screenshot of the now-defunct Fud Tool website from the Wayback Machine Internet Archive_\n\nIt is interesting to note that when analyzing the Office-RD117 kit, we also saw signatures from multiple sellers within its packaged resources.\nThere are also instances of dead links, such as a reference to a GitHub account that was only live for less than a day in January 2020 (the said\naccount is still carried over to kits online as of this writing). This goes to show that even commercially available phishing kits reuse and\nrepurpose elements from other ones. Such mixing and matching also make it quite challenging to determine where one kit ends and another\none begins.\n\n### Comparing TodayZoo with DanceVida and other kits\n\nIn the case of TodayZoo, we observed that its implementations only match the larger superset of kits referencing DanceVida at about 30-35%.\nAs seen in the figures below that compare a TodayZoo sample with a randomly selected DanceVida sample, both initially have similar structure\nand pieces of code until TodayZoo deviated in the credential harvesting component:\n\n_Figure 7. A comparison of DanceVida and TodayZoo kits, showing matching source codes_\n\n\n-----\n\n_Figure 8. A comparison of DanceVida and TodayZoo kits showing highly similar source codes. Note how TodayZoo has changed its variables._\n\n_Figure 9. A comparison of DanceVida and TodayZoo kits showing slightly different implementation for credential posting_\n\nTo further illustrate the “Frankenstein’s monster” characteristic of TodayZoo, the table below expands the comparison of one of its current\nphishing pages with Office-RD117, as well as with four other landing pages. These landing pages are unattributed to specific operators and\nreference DanceVida or use the same credential-harvesting POST statements. While all these samples share code segments in their imitation,\nobfuscation, or credential harvesting components, they each still have unique elements that differentiate them.\n\n_Table 1. Similarity areas and percentages of related phish kits to a recent TodayZoo sample_\n\n\n-----\n\n_Figure 10. Graphical representation of the similarity areas of related phish kits to a recent TodayZoo sample_\n\nThe above comparisons show a history of alterations and suggest an existence of a “core” set of codes being reused by these phishing kits.\nThey are also reminiscent of how remote access Trojans (RAT) and other malware families are continuously retooled by threat actors yet retain\nlarge chunks of code blocks across the board.\n\n## How threat intelligence enriches anti-phishing technologies in Microsoft Defender for Office 365\n\nOur analysis of TodayZoo, DanceVida, and other phishing kits gives us several insights into the underground economy today. First, this\nresearch further proves that most phishing kits observed or available today are based on a smaller cluster of larger kit “families.” While this\ntrend [has been observed previously, it continues to be the norm, given how phishing kits we’ve seen share large amounts of code among](https://www.imperva.com/blog/our-analysis-of-1019-phishing-kits/)\nthemselves. The continued presence of dead links and callbacks to other kits indicates that many phishing kit distributors and phishing\noperators have easy access to these existing kits and use parts of them to make new ones faster.\n\nSecondly, our research shows that the players in the cybercrime economy count on a lack of examination into their products. Whether that is a\nbane or a boon on their part depends on how the products’ codes are implemented. For example, an unchecked reused kit that still calls back\nto its original creator with copies of stolen credentials potentially translates into an equivalent of a passive income for the said creator.\n\nInsights such as those presented above enrich our protection technologies. Our intelligence on unique phishing kits such as TodayZoo,\n[phishing services, and other components of phishing attacks allows Microsoft Defender for Office 365 to detect related campaigns and block](https://www.microsoft.com/security/business/threat-protection/office-365-defender)\nmalicious emails, URLs, and landing pages. Combined with Defender for Office 365’s use of machine learning, heuristics, and\nadvanced detonation technology, such intel also makes it possible to detect kits that attempt to leverage techniques from one or multiple\ncodes, even before a user receives the email or interacts with the content.\n\nThreat intelligence about the latest trends in the phishing landscape also feeds into other Microsoft security solutions, such as Microsoft\nDefender SmartScreen, which blocks phishing websites and malicious URLs and domains in the browser, and [Network protection, which](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/network-protection?view=o365-worldwide)\n[blocks connections to malicious domains and IP addresses. Advanced hunting capabilities allow analysts to search for phishing kit](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/advanced-hunting-overview?view=o365-worldwide)\ncomponents and other IOAs.\n\n[Organizations can configure the recommended settings in Microsoft Defender for Office 365, such as applying anti-phishing, Safe Links, and](https://docs.microsoft.com/microsoft-365/security/office-365-security/recommended-settings-for-eop-and-office365?view=o365-worldwide)\n[Safe Attachments policies. These ensure real-time protection by scanning at the time of delivery and at the time of click. They can further](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/set-up-safe-attachments-policies?view=o365-worldwide)\n[strengthen their protection with Microsoft 365 Defender, which correlates signals from emails, endpoints, and other domains, delivering](https://www.microsoft.com/en-us/security/business/threat-protection/microsoft-365-defender)\ncoordinated defense.\n\n\n-----\n\nea o you ca stop c ede t a p s g a d ot e e a t eats t oug co p e e s e, dust y ead g p otect o t c oso t\nDefender for Office 365.\n\n[Visit our National Cybersecurity Awareness Month page for more resources and information on protecting your organization year-round. Do](https://www.microsoft.com/en-us/securitynow)\n**your part. #BeCyberSmart**\n\n_Microsoft 365 Defender Threat Intelligence Team_\n\n### Advanced hunting queries\n\n**Emails with TodayZoo operator patterns**\n\nUse this query to find emails sent that utilize additional forward slashes at the path and domain split point and utilize the TodayZoo operators’\npatterns in the path and the subdomain structure. TodayZoo operators occasionally store URLs in the attachment, so this query would not\nsurface those instances.\n```\nEmailUrlInfo\n\n```\n```\n| where Url matches regex \"(ujsd)?\\\\.[a-z]+\\\\.com\\\\/\\\\/.+\\\\.#\"\n\n```\n\n**Endpoint activity where TodayZoo patterns redirect to DigitalOcean**\n\nUse this query to find emails sent that utilize additional forward slashes at the path and domain split point and utilize the TodayZoo operators’\npatterns in the path and the subdomain structure.\n```\nDeviceNetworkEvents\n| where RemoteUrl matches regex \"(ujsd)\\\\.[a-z]+\\\\.com\\\\/\\\\/.+\\\\.#\" or RemoteUrl endswith \"digitaloceanspaces.com\"\n| extend Domain = extract(@\"[^.]+(\\.[^.]{2,3})?\\.[^.]{2,12}$\", 0, RemoteUrl)\n| summarize dcount(Domain), make_set(Domain) by DeviceId,bin(Timestamp, 1h), InitiatingProcessFileName,\nInitiatingProcessCommandLine\n| where dcount_Domain >= 2\n\n### Indicators of compromise\n\n```\n**Sample initial base domains**\n\npentsweser[.]com eurhutos[.]com dalotcii[.]com\n\nbuiyosi[.]com gsuouyty[.]com matanictii[.]com\n\nphmakert[.]com brepeme[.]com conncorrd[.]com\n\nsazmath[.]com normmavec[.]com jumperctin[.]com\n\nselfessdas[.]com kurvuty[.]com iotryfuty[.]com\n\nsetmakersl[.]com vlogctii[.]com coffimkeer[.]com\n\nmosyeurty[.]com qurythuy[.]com carlssbad[.]com\n\nchovamb[.]com tenssmor[.]com tenssmr[.]com\n\ncoffkeer[.]com tamsops[.]com speedoms[.]com\n\nshageneppi[.]com shadain[.]com coffieer[.]com\n\ncofeer[.]com carrtwright[.]com uyfteuty[.]com\n\nslobhurtiy[.]com braingones[.]com beinsmter[.]com\n\nksfcaghyou[.]com coffkr[.]com rtuatatcty[.]com\n\nlamyot[.]com tenssm[.]com kanesatakss[.]com\n\nbrainsdeads[.]com ourygshry[.]com\n\n**Sample initial domains with subdomains**\n\n1776769042[.]ujsd[.]iotryfuty[.]com 443577567[.]ujsd[.]iotryfuty[.]com\n\n646611056[.]ujsd[.]gsuouyty[.]com 1007183231[.]ujsd[.]gsuouyty[.]com\n\n1469782555[.]ujsd[.]phmakert[.]com 1436029448[.]ujsd[.]buiyosi[.]com\n\n946552600[.]ujsd[.]buiyosi[.]com 1733787821[.]ujsd[.]buiyosi[.]com\n\n\n-----\n\n1988722677[.]ujsd[.]eurhutos[.]com 255622856[.]ujsd[.]eurhutos[.]com\n\n600774497[.]ujsd[.]sazmath[.]com 1315116569[.]ujsd[.]setmakersl[.]com\n\n1179340144[.]ujsd[.]sazmath[.]com 516942697[.]ujsd[.]setmakersl[.]com\n\n1742965301[.]ujsd[.]setmakersl[.]com 124967719[.]ujsd[.]normmavec[.]com\n\n202271174[.]ujsd[.]pentsweser[.]com 1010306526[.]ujsd[.]iotryfuty[.]com\n\n728156920[.]ujsd[.]iotryfuty[.]com 1244535616[.]ujsd[.]selfessdas[.]com\n\n1227334331[.]ujsd[.]selfessdas[.]com 1229648857[.]ujsd[.]kurvuty[.]com\n\n926765708[.]ujsd[.]kurvuty[.]com 254503147[.]ujsd[.]kurvuty[.]com\n\n1656812361[.]ujsd[.]dalotcii[.]com 100666740[.]ujsd[.]matanictii[.]com\n\n404793834[.]ujsd[.]matanictii[.]com 879643450[.]ujsd[.]matanictii[.]com\n\n658338120[.]ujsd[.]matanictii[.]com 1359496128[.]ujsd[.]dalotcii[.]com\n\n995216045[.]ujsd[.]dalotcii[.]com 1838392685[.]ujsd[.]dalotcii[.]com\n\n9725332[.]ujsd[.]brepeme[.]com 1668463162[.]ujsd[.]conncorrd[.]com\n\n165175575[.]ujsd[.]sazmath[.]com 215852665[.]ujsd[.]brepeme[.]com\n\n**Sample initial URLs**\n\nodghyuter[.]com//wfvmlpxuhjeq[.]#aHR0cHM6Ly9wb2dmaHJ5ZXQuY29tL2VkZmgua2VyZnEvI25vLXJlcGx5QG1pY3Jvc29mdC5jb20=\nujsd.coffimkeer[.]com//0jw7yklk[.]#aHR0cHM6Ly9sdWh5cnR5ZS5jb20vZWRmaC5rZXJmcS8jbm8tcmVwbHlAbWljcm9zb2Z0LmNvbQ==\nujsd.pentsweser[.]com//iojjyaqw[.]#aHR0cHM6Ly9saW1lc3RvbmVzbS5jb20vZWRmaC5rZXJmcS8jbm8tcmVwbHlAbWljcm9zb2Z0LmNvbQ=\nujsd.brepeme[.]com//bnxvhyex[.]#aHR0cHM6Ly92YWVwbGVyLmNvbS9lZGZoLmtlcmZxLyNuby1yZXBseUBtaWNyb3NvZnQuY29t\n\n**Sample secondary (redirector) URLs**\n\npogfhryet[.]com/edfh[.]kerfq/#no-reply@microsoft[.]com\nluhyrtye[.]com/edfh[.]kerfq/#no-reply@microsoft[.]com\n\n**Sample final landing page**\n\nnyc3[.]digitaloceanspaces[.]com/bnj/25_40_24_5E_40_26_40_26_28_29_23_23_5E_23_24_26_5E_25_26_40_5E_28_23_26_%25_%25_%\nreply@microsoft[.]com\n\n**Sample credential harvesting page**\n\nlcspecops[.]com/psl/vcoominctodayq[.]php\n\n### References\n\n[https://www.imperva.com/blog/our-analysis-of-1019-phishing-kits/](https://www.imperva.com/blog/our-analysis-of-1019-phishing-kits/)\n[https://blog.bushidotoken.net/2021/02/the-next-evolution-in-office365.html](https://blog.bushidotoken.net/2021/02/the-next-evolution-in-office365.html)\n[https://steved3.io/data/Kit-Hunter-Report-Example/2021/01/16/](https://steved3.io/data/Kit-Hunter-Report-Example/2021/01/16/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-21 - Franken-phish- TodayZoo built from other phishing kits.pdf"
    ],
    "report_names": [
        "2021-10-21 - Franken-phish- TodayZoo built from other phishing kits.pdf"
    ],
    "threat_actors": [
        {
            "id": "a7d4fe31-d92f-425a-ba8c-c70219f52fb8",
            "created_at": "2022-10-25T15:50:23.466009Z",
            "updated_at": "2025-03-27T02:00:55.477162Z",
            "deleted_at": null,
            "main_name": "Frankenstein",
            "aliases": [
                "Frankenstein"
            ],
            "source_name": "MITRE:Frankenstein",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "56b3eb1d-6baf-4ee4-a098-ec0081280315",
            "created_at": "2024-09-28T02:05:36.599884Z",
            "updated_at": "2025-03-27T02:05:17.250078Z",
            "deleted_at": null,
            "main_name": "ALUMINUM THORN",
            "aliases": [
                "WIRTE ",
                "Frankenstein "
            ],
            "source_name": "Secureworks:ALUMINUM THORN",
            "tools": [
                " Powershell Empire",
                "FruityC2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536015,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653779820,
    "ts_modification_date": 1653779820,
    "files": {
        "pdf": "https://archive.orkl.eu/7eaaa62af4bfb7ce5c47cf4bedbc5c1140fc94e2.pdf",
        "text": "https://archive.orkl.eu/7eaaa62af4bfb7ce5c47cf4bedbc5c1140fc94e2.txt",
        "img": "https://archive.orkl.eu/7eaaa62af4bfb7ce5c47cf4bedbc5c1140fc94e2.jpg"
    }
}