{
    "id": "03e12c74-d40d-49b8-b6db-7dc73383db4d",
    "created_at": "2023-01-12T15:06:55.687947Z",
    "updated_at": "2025-03-27T02:06:04.495884Z",
    "deleted_at": null,
    "sha1_hash": "78c95c917d628ccfce792ef4490f1db9b1fc8042",
    "title": "2021-05-28 - WooCommerce Credit Card Skimmer Hides in Plain Sight",
    "authors": "",
    "file_creation_date": "2022-05-28T15:42:36Z",
    "file_modification_date": "2022-05-28T15:42:36Z",
    "file_size": 1421660,
    "plain_text": "# Sucuri Blog\n\n**[blog.sucuri.net/2021/05/woocommerce-credit-card-skimmer.html](https://blog.sucuri.net/2021/05/woocommerce-credit-card-skimmer.html)**\n\nBen Martin May 28, 2021\n\nRecently, a client’s customers were receiving a warning from their anti-virus software when\nthey navigated to the checkout page of the client’s ecommerce website. Antivirus software\nsuch as Kaspersky and ESET would issue a warning but only once a product had been\nadded to the cart and a customer was about to enter their payment information. This is, of\ncourse, a tell-tale sign that there is something seriously wrong with the website and likely a\ncase of credit card exfiltration.\n\nChecking the source code of the website showed that there was clearly some dodgy\njavascript code on their checkout:\n\n## Google Tag Manager Scripts\n\n\n-----\n\nAt first glance it appears to be a Google Tag Manager script (a popular service used on many\nwebsites). In the past we have seen how Google Tag Manager’s script can be used to hide\nmalicious content. Could this be the same?\n\nAttackers commonly place code in a way that makes it look legitimate and innocent.\nSometimes they even abuse GTM itself to surreptitiously exfiltrate credit card details, making\nit impossible to identify without using traffic inspection software or confirming which GTM\nscripts belong and which ones the site owner doesn’t recognise.\n\nA regular googletagmanager script call does not include any obfuscation, base64 encoded\ncontent or concatenation. However, we see a little bit of base64 encoded content here that\ndecodes to the following:\n\n[The domain a42[.]buzz has been blocklisted by us since January so this clearly indicates that](https://labs.sucuri.net/blacklist/info/?domain=a42.buzz)\nthis is malicious in nature and we’ll need to find how it’s loading.\n\n## How to Find the Malware\n\nIn the above example our initial scans did not pick up anything. Remember: it’s the attacker’s\njob to evade detection so they are writing new malware all the time. In this case, querying the\nfiles and database for “Google Tag Manager” or “atob(” (atob is the javascript instruction to\ndecode base64 encoded strings and is common on javascript injections) also returned\nnothing.\n\n## Checking Recently Modified Files\n\nOne of the first things that we will do in such a compromise is to check for recently modified\nfiles. Sometimes it can take a surprisingly long time for a compromise to be identified so I will\ntypically start with files modified in the last few months. If nothing is found then I will go as far\nback as six months or a year.\n\nYou might wonder how someone would check all those files! It seems overwhelming at first\nbut you can remove a lot of noise by parsing out all of the obvious plugin and theme updates.\nThey will appear in batches with a very similar (if not identical) last modified date. It’s not a\nperfect method but proves to be useful in some cases. What you are left with is (hopefully) a\nsmall handful of files that were modified at very different times and dates.\n\nAttackers will often spoof the last modified date on a file to make it appear as though it hasn’t\nbeen touched in years but these files should still show up when running an SSH command\nsuch as mtime. If you are not familiar with the SSH shell you can also spot check recently\nmodified files through FTP with a program like Filezilla but this is significantly more\n\n\n-----\n\ncumbersome, not as reliable, and you will be relying on those last modified timestamps that I\njust mentioned. Attacks can sometimes even go unnoticed for multiple years before the\nwebsite owner is made aware that their environment is compromised.\n\nEven after checking many recently modified files we were left empty handed.\n\n## Checking the Database\n\nSo where was this hiding? It turned out to be hiding in plain sight in the database. Base64\nencoding is one of the most popular encoding techniques that attackers will employ to hide\ntheir payloads, and that is exactly what they were doing here:\n\nIt’s unclear whether or not this was a deliberate attempt by the attackers to evade detection\nor if this is simply the way that the plugin/theme stores its data (resulting in a happy accident\nfor the attackers). In any event it created some additional steps for us to locate the malware.\n\n## Encoding Base64\n\nThe way that we were able to find it eventually (big ups to @liamsmith86 for the assist here)\nwas by base64 encoding <!– Google Tag Manager –> and querying some of the strings. The\nfull encoded string is:\n```\nPCEtLSBHb29nbGUgVGFnIE1hbmFnZXIgLS0+\n\n```\nAnd we queried the database for a few snippets of that until we found it lodged on the\ncheckout page.\n\nLet’s break down this malware shall we?\n\n\n-----\n\n## Analysis of a Woocommerce Credit Card Swiper\n\nStep one of course is to decode the base64 chunk, resulting in this (what we saw loading on\ncheckout earlier):\n\nTaken at face value it appears to be GTM but of course this is bogus. When decoding that\nbase64 string this is precisely the same code that we found in the source code earlier:\n\nHere we see some javascript loading from a domain that we have been blocklisting since\nJanuary of this year. Now let’s take a look at what’s actually in that javascript! Navigating to\nthe payload on the malicious website we find the following:\n\nWe can see that the payload is under yet another layer of obfuscation. Using a free online\ntool we can “unpack” this p,a,c,k,e,d javascript to find the main, deobfuscated credit card\nswiper. Here is a snippet:\n\n\n-----\n\nAt the top there we can clearly see two more malicious domains referenced. We have seen\nthese domains used for credit card exfiltration in the past and originally found them in\nOctober of last year on an OpenCart website. Over the last few years we have seen an\nincreasing trend of the same credit card swiping malware and exfiltration domains used\nacross different CMS platforms.\n\n### Looking at malicious domains\n\nLet’s break down these domains a little bit to see if we can understand them a bit better:\n\n\n-----\n\n```\na42[.]buzz\nRegistrar: Porkbun\nCreation Date: 2020-09-16\nIP: 5.188.62.36\nHosting provider: Petersburg Internet Network Hosting\nHosted in: Russian Federation\n\n```\nAll the other domains on this IP are also malicious and contain the same malicious script:\n```\nzerr[.]club\nbadger[.]uno\ncommv[.]club\n9gag[.]uno\n8words[.]xyz  \n64bitss[.]club\n221u7[.]cyou\n114oo[.]icu\n5x5x5[.]cyou\n404p[.]icu\n\n```\nThe next domain found in the payload:\n```\ngoogleanalytics[.]icu\nRegistrar: Porkbun\nCreation Date: 2020-07-09\nIP: 103.73.67.186\nHosting provider: HostHatch\nHosted in: Hong Kong\n\n```\n(As a Canadian I will never know if this is July 9th or September 7th.)\n\nAgain, all the other domains here are malicious and contain that malicious javascript:\n\n\n-----\n\n```\nsxjump[.]uno\nsxfnc[.]uno\nsxint[.]uno\nsxgear[.]uno\nsxhit[.]uno\nsxbet[.]uno\nsxerr[.]uno\nsxamp[.]uno\nsxdmp[.]uno\nsxcad[.]uno\n\n```\nAnd finally:\n```\nshopstatanalytics[.]store\nRegistrar: NameCheap\nCreation Date: 2020-07-08\nIP: 176.123.3.85\nHosting provider: Alexhost Srl\nHosted in: Moldova\n\n```\nSame story with this server:\n```\nsygna[.]club\nsyidim[.]club\nsyjet[.]club\nsyhire[.]club\nsyfer[.]club\nsydne[.]club\nsyamoto[.]club\nsyberian[.]club\nsycamor[.]club\nsyenna[ ]club\n\n```\n\n-----\n\nIt s interesting to see a little bit more information and context to the domains being used to\nexfiltrate credit card details of unsuspecting customers.\n\nSo this brings us to our last point: How did this credit card swiper find its way onto this\nwebsite?\n\n## How the Credit Card Swiper Got into the Website\n\nWithout going down the forensics rabbit hole there’s no way to know for certain. However I\nhave a pretty good guess that this was the result of a compromised wp-admin account. Once\nthe attackers find their way into the wp-admin panel they can really do whatever they want:\n\n1. Place malicious javascript code in the posts/pages/widgets\n2. Modify a file to be a backdoor and easily upload their payload\n3. Use a file manager plugin to upload a backdoor or more malware\n4. Post spam or other unwanted material\n5. Anything else you can imagine they’d want to do\n\n## How to Prevent Hacks\n\nAt risk of sounding like a broken record I would urge any WordPress site owners out there to\ntake their website security seriously. The most straightforward thing that you can do is to\nplace some additional protections on your wp-admin panel using a security plugin of your\nchoice. Some options for that include:\n\n1. Two factor authentication\n2. IP access restrictions\n3. CAPTCHA\n4. A limit on the number of failed authentications before lockout\n5. All of the above!\n\nOf course this makes it a little bit more inconvenient to administer your website but the\npotential repercussions of a site compromise are devastating and the benefits far outweigh\nthe annoyance of entering an additional code when logging in. Of course, our firewall is a\ngreat tool to help secure your wp-admin area (or other admin areas if you are using a\ndifferent CMS other than WordPress). It’s also a good idea to keep close tabs on the activity\nof your admin area which you can do with our WordPress [plugin:](https://wordpress.org/plugins/sucuri-scanner/)\n\n\n-----\n\nSucuri\n\nSecurity Free WordPress Plugin – Auditing, Malware Scanner and Security Hardening\nThis can help you detect suspicious activity on your website and learn a little bit more about\nthe threat actors behaviour in the event that you do get compromised. Remember: don’t\ninstall every security plugin under the sun thinking you will be more protected. This is much\nlike installing multiple antivirus programs on a computer: They’re usually trying to do similar\nthings at the same time and “wires get crossed” so to speak. In a WordPress environment\nthis is a recipe for locking you out of your own website.\n\n[Of course, the best way to prevent a compromise in the first place is to become a customer](https://sucuri.net/website-security-platform/signup/)\nof ours!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-28 - WooCommerce Credit Card Skimmer Hides in Plain Sight.pdf"
    ],
    "report_names": [
        "2021-05-28 - WooCommerce Credit Card Skimmer Hides in Plain Sight.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536015,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653752556,
    "ts_modification_date": 1653752556,
    "files": {
        "pdf": "https://archive.orkl.eu/78c95c917d628ccfce792ef4490f1db9b1fc8042.pdf",
        "text": "https://archive.orkl.eu/78c95c917d628ccfce792ef4490f1db9b1fc8042.txt",
        "img": "https://archive.orkl.eu/78c95c917d628ccfce792ef4490f1db9b1fc8042.jpg"
    }
}