{
    "id": "03e85fb3-fd5c-4a83-b738-8e62cce4a8b2",
    "created_at": "2023-01-12T15:03:01.027683Z",
    "updated_at": "2025-03-27T02:14:13.673656Z",
    "deleted_at": null,
    "sha1_hash": "22aea7bd62087bd8ae1d1d048138266cab2331e8",
    "title": "2022-05-18 - The BlackByte ransomware group is striking users all over the globe",
    "authors": "",
    "file_creation_date": "2022-05-25T20:32:48Z",
    "file_modification_date": "2022-05-25T20:32:48Z",
    "file_size": 1480595,
    "plain_text": "# The BlackByte ransomware group is striking users all over the globe\n\n**[blog.talosintelligence.com/2022/05/the-blackbyte-ransomware-group-is.html](https://blog.talosintelligence.com/2022/05/the-blackbyte-ransomware-group-is.html)**\n\n## News summary\n\nCisco Talos has been monitoring the BlackByte Ransomware Group for several months,\ninfecting victims all over the world, from North America to Colombia, Netherlands,\nChina, Mexico and Vietnam.\n[The FBI released a joint cybersecurity advisory in February 2022 warning about this](https://www.ic3.gov/Media/News/2022/220211.pdf)\ngroup, stating that the group has targeted at least three critical infrastructure sectors in\nthe U.S.\nTalos has monitored ongoing BlackByte attacks dating back to March.\nBlackByte updated its leak site with a new design and new victims and is still actively\nexploiting victims worldwide.\n\n## Executive overview\n\nThe BlackByte ransomware group uses its software for its own goals and as a ransomware-asa-service offering to other criminals. The ransomware group and its affiliates have infected\nvictims all over the world, from North America to Colombia, the Netherlands, China, Mexico\nand Vietnam. Talos has been monitoring BlackByte for several months and we can confirm\n[they are still active after the FBI released a joint cybersecurity advisory in February 2022.](https://www.ic3.gov/Media/News/2022/220211.pdf)\n[Additionally, BlackByte is considered part of the big game ransomware groups, which are](https://podcasts.apple.com/us/podcast/talos-takes-ep-6-big-game-hunting/id1497572268?i%3D1000465606172)\ntargeting large, high-profile targets, looking to exfiltrate internal data and threatening to\n\n\n-----\n\npublicly release it. Like similar groups, they have their own leaks site on the darknet. The\nactual TOR address of this site is frequently moved. Below, you can see a screenshot of the\nsite. We have anonymized the screenshot to protect victims' privacy.\n\nThe attack usually starts with a network entry point, either a previously compromised host or\na software vulnerability which is exploitable from the network. The former compromised\nhost elevates local and domain account privileges and moves laterally by using standard\n[penetration testing and legit administrator tools (LoLBins). In most incidents, they like to](https://lolbas-project.github.io/)\nuse the AnyDesk remote management software to control victim machines.\n\n## Technical details\n\nThe BlackByte gang often uses phishing and/or vulnerable unpatched applications or\nservices like vulnerable versions of SonicWall VPN or the ProxyShell vulnerability in\nMicrosoft Exchange servers to gain access to the victim's network. These are usually known\npublic vulnerabilities that the targets haven't patched in a timely manner. Due to a lack of\nlogs, we could not confirm the initial infection vector in the case below, but we have\nindicators that a vulnerable Microsoft Exchange Server was compromised, which matches\nthe previously described behavior of the BlackByte actor.\n\nA typical timeline of infection looks similar to the anonymized log below, which we saw in\nour telemetry in March.\n\n\n-----\n\n-----\n\nThe logs above show the adversaries are installing the AnyDesk remote management\nsoftware, as we've seen in Cisco Talos Incident Response engagements. BlackByte seems to\n[have a preference for this tool and often uses typical living-off-the-land binaries (LoLBins),](https://blog.talosintelligence.com/2019/11/hunting-for-lolbins.html)\nbesides other publicly available commercial and non-commercial software like 'netscanold' or\n'psexec'. These tools are also often used by Administrators for legitimate tasks, so it can be\ndifficult to detect them as a malicious threat. It seems to be that executing the actual\nransomware is the last step once they are done with lateral movement and make themselves\npersistent in the network by adding additional admin accounts.\n\nUnfortunately, we could not obtain the RANDOMNAME_n.EXE files, which are likely stages\nof the ransomware infection. We also tried to get them via the telemetry of our partners, but\nthe hash was unknown to them, too. This points to the same trend that many big game\nransomware groups moved to the tactic of using unique obfuscated files for every victim. The\nchat with a criminal from the ransomware group Hive we've transcribed below provides an\nidea of how these conversations go. We are releasing more details about conversations with\nransomware actors in a future post.\n\n**Victim: \"How many files are stolen? and can you share some file names?\"**\n\n**Hive: \"Hello\"**\n\n**Victim: \"maybe no ones here\"**\n\n**Hive: \"To decrypt your files you have to pay $20,000,000 in Bitcoin.\"**\n\n**Victim: \"that's way too much, can you please discount and please share the hash of the**\nransomware file so we can at least black list it. You have already stolen everything anyway\"\n\n**Hive: \"We don't provide any hashes. Every time the software is unique. There is no need of**\nhashes here. It will not help anyway.\"\n\n**Hive: \"If you want a discount I would like to see for how much\"**\n\nAssuming that RANDOMNAME.EXE -a <SUSPICIOUS NUMBER> is the start of the\nransomware infection process, they have slightly changed their behavior or are just using a\ndifferent packer. The FBI document states \"complex.exe -single <SHA256>\" launches the\ninfection process. In our case, the parameters are different — the first one is a '-a' and the\nfollowing is not a SHA256 hash, it is an eight-digit number, like '42269874' (not the real\nnumber, but similar to keeping the privacy of the victim). This seems to be a victim ID or an\noffset for the unpacking process. The actual behavior of RANDOMNAME.EXE seems to be\nvery similar to the complexe.exe one described in the FBI report. It also disables Windows\nDefender. The base64-obfuscated string 'VwBpAG4ARABlAGYAZQBuAGQA' decodes to\n\n\n-----\n\nWinDefend, which is the Windows Defender service. It then tries to disable Florian Roth s\n[Raccine ransomware protection tool and a few other commands mentioned in the FBI](https://github.com/Neo23x0/Raccine)\ndocument.\n\nFinally, approximately 17 hours after the ransomware infection process started, the machine\nreboots and the ransomware note \"BlackByteRestore.txt\" is shown to the user via Notepad.\n\n## Conclusion\n\nTalos research and other public reports about BlackByte are mainly pointing to vulnerable,\noutdated systems as the initial infection vector. This threat shows how important it is to have\na proper update strategy in place. If your organization is running a Microsoft Exchange\nServer or any other internet-facing system, make sure it always has the latest patch in place.\nThe time window between the announcement of a new security vulnerability and its\nweaponization and use by criminals is getting smaller every year.\n\nIt's more important now than ever to have a multi-layered security architecture to detect\nthese types of attacks. The adversary is likely to manage to bypass one of the other\ncybersecurity measures, but it is much harder for them to bypass all of them. These\ncampaigns and the refinement of the TTPs used will likely continue for the foreseeable\nfuture.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Cisco Secure Endpoint (formerly AMP for](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\nEndpoints) is ideally suited to prevent the\nexecution of the malware detailed in this\n[post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Damp-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Damp-free-trial)\n\n[Cisco Secure Web Appliance web scanning](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\nprevents access to malicious websites and\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\nSecurity) can block malicious emails sent by\nthreat actors as part of their campaign. You\n[can try Secure Email for free here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium%3Dweb-referral%26utm_source%3Dcisco%26utm_campaign%3Dcmd-free-trial-request%26utm_term%3Dpgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nGeneration Firewall and Firepower NGFW)\n[appliances such as Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html)\n\n\n-----\n\n[Adaptive Security Appliance and Meraki MX can detect malicious activity associated with](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html)\nthis threat.\n\n[Cisco Secure Network/Cloud Analytics (Stealthwatch/Stealthwatch Cloud) analyzes network](https://www.cisco.com/c/en/us/products/security/stealthwatch/index.html)\ntraffic automatically and alerts users of potentially unwanted activity on every connected\ndevice.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs and URLs, whether users are on or off the corporate network. Sign up for a free\n[trial of Umbrella here.](https://signup.umbrella.com/)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are\n[available from the Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized are](https://signup.duo.com/)\naccessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\nlatest rule pack available for purchase on Snort.org.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/)\n\n**Orbital Queries**\n\n[Cisco Secure Endpoint users can use Orbital Advanced Search to run complex OSqueries to](https://orbital.amp.cisco.com/help/#:~:text=Cisco%20Orbital%20(%E2%80%9COrbital%E2%80%9D),(Creators%20Update)%20or%20later.)\nsee if their endpoints are infected with this specific threat. For specific OSqueries on this\n[threat, click here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/blackbyte_ransomware.yaml)\n\n## IOCs\n\nTo protect the privacy of the victim we can only release the anonymized logs above, but we\nhope this helps SOC and security staff to build their own custom rules to protect their assets.\n\nTypical [log data in text format.](https://talosintelligence.com/resources/440)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-18 - The BlackByte ransomware group is striking users all over the globe.pdf"
    ],
    "report_names": [
        "2022-05-18 - The BlackByte ransomware group is striking users all over the globe.pdf"
    ],
    "threat_actors": [
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535781,
    "ts_updated_at": 1743041653,
    "ts_creation_date": 1653510768,
    "ts_modification_date": 1653510768,
    "files": {
        "pdf": "https://archive.orkl.eu/22aea7bd62087bd8ae1d1d048138266cab2331e8.pdf",
        "text": "https://archive.orkl.eu/22aea7bd62087bd8ae1d1d048138266cab2331e8.txt",
        "img": "https://archive.orkl.eu/22aea7bd62087bd8ae1d1d048138266cab2331e8.jpg"
    }
}