{
    "id": "0401fcd9-77df-4f27-9bd1-66b57cf4f2bf",
    "created_at": "2023-01-12T15:08:47.101031Z",
    "updated_at": "2025-03-27T02:17:05.638756Z",
    "deleted_at": null,
    "sha1_hash": "c82f489fd533091e593eebc5e4204a7ba13cd083",
    "title": "2022-01-28 - Lessons Learned From Successive Use of Offensive Cyber Operations Against Ukraine and What May Be Next",
    "authors": "",
    "file_creation_date": "2022-05-28T23:21:25Z",
    "file_modification_date": "2022-05-28T23:21:25Z",
    "file_size": 130571,
    "plain_text": "# Past Cyber Operations Against Ukraine and What May Be Next\n\n**[crowdstrike.com/blog/lessons-from-past-cyber-operations-against-ukraine/](https://www.crowdstrike.com/blog/lessons-from-past-cyber-operations-against-ukraine/)**\n\nCrowdStrike Intelligence Team January 28, 2022\n\nDisruptive and destructive cyber operations have been levied against elements of Ukrainian\nsociety by adversaries attributed to the Russian government — or groups highly likely to be\ncontrolled by them — since at least 2014. These operations have impacted several sectors,\nincluding energy, transportation and state finance, and have attempted to influence political\nprocesses and affect businesses more broadly within the country.\n\nThese operations have been conducted in a semi-deniable manner, providing enough\nevidence to arouse suspicion of the likely perpetrators — so as to ensure that intended\nmessaging is conveyed to targeted entities — while also obfuscating the activity’s origins.\nCrowdStrike attributes the majority of the known offensive operations against Ukraine to\n[VOODOO BEAR, an adversary highly likely controlled by the Main Intelligence Directorate of](https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-january-voodoo-bear/)\nthe General Staff of the Armed Forces of the Russian Federation (GRU).\n\nThe impact of offensive operations is rarely constrained to the initial target entity, with\ncollateral damage occurring either directly through corruption of computer networks or\nindirectly through interruption of critical business services on which organizations rely for\n\n\n-----\n\nday-to-day operation. Analysis of previous activities has identified several situations in which\napparently localized targeting has caused unintended consequences to organizations\noutside of Ukraine.\n\nThis blog will evaluate major disruptive events against Ukrainian interests in the past and\nattempt to forecast likely forms and outcomes of future operations within the region.\n\n## Detail\n\nTechniques employed by VOODOO BEAR to facilitate and deliver destructive effects have\nevolved over the years, from the distribution of targeted wiper malware via custom loaders to\nmimicking the effect of ransomware deployments using wider-reaching distribution\nmechanisms such as supply chain and strategic web compromises (SWC).\n\nHowever, the pretense of ransomware is often superficial and its implementation is not\nconsistent with financially motivated criminal actors. There is also evidence to suggest that\nthe adversary has leveraged attribution fronts claiming to be motivated by hacktivist\nideologies alongside destructive campaigns, likely in an attempt to amplify the effects of the\nattacks by publicizing them more widely.\n\nCrowdStrike Intelligence has reported extensively on VOODOO BEAR operations within\nUkraine, with overviews of their evolving operations available to our premium intelligence\nsubscribers. These campaigns are assessed to likely contribute to psychological operations\nseeking to degrade, delegitimize or otherwise influence public trust in state institutions and\nindustry sectors in the country.\n\n### 2014-2016: Targeted Attacks Using Custom Delivery Malware\n\nEarly destructive operations attributed to VOODOO BEAR have targeted a range of sectors\nwithin Ukraine, often leveraging a combination of the BlackEnergy malware (version 3) and\nthe KillDisk (aka PassKillDisk) wiper. Many campaigns were timed to coincide with specific\nevents or seasons, while the events in December 2016 could be interpreted as a persistent\nexecution of successive attacks designed to have a multiplicative disruptive effect on the\ncountry.\n\nThese operations included:\n\nMay 2014: targeting of energy and transportation organizations\nOctober 2015: targeting of media outlets, coinciding with local elections\nDecember 2015: targeting of an energy provider in western Ukraine\nDecember 2016: targeting of state-operated financial institutions (FIs) and rail\ncompanies\nDecember 2016: targeting of an energy provider causing power outages in Kiev\nDecember 2016: targeting of the Ukrainian State Hydrographic Service\n\n\n-----\n\nDespite the relatively focused targeting in each of these cases, variants of the KillDisk\nmalware distributed in December 2016 were modified to mimic ransomware and hacktivist\nintent, foreshadowing later developments in operational tactics, techniques and procedures\n(TTPs).\n\nObservations of contemporary activity in this period suggest that attribution fronts adopting\nhacktivist personas were used to publicly release data from Ukrainian organizations\nalongside these offensive operations, although the exact nature of their coordination is\nunclear. For example, the CyberBerkut collective claimed responsibility for destructive and\ndenial-of-service (DoS) attacks against the Ukrainian Central Election Commission (CEC) in\nMay 2014, after which the group began publishing sensitive emails and internal documents\nfrom the CEC to support their claim.\n\nSimilarly, in December 2016, a pro-Russia hacktivist group called Sprut leaked a series of\ndocuments related to the finances of the Ukrainian government’s state energy company.\nLater that month, the group announced they had disrupted the main website of the Ukrainian\n[Energy company Ukrenergo, which had publicly acknowledged that internal systems had](https://www.reuters.com/article/us-ukraine-cyber-attack-energy/ukraines-power-outage-was-a-cyber-attack-ukrenergo-idUSKBN1521BA)\nbeen accessed on Dec. 17-18, 2016. Information operations (IO) combining public\n(disruptive) and non-public (destructive) intent are highly likely representative of attempts to\namplify the effects of damage to government systems by controlling public narrative over an\nextended period.\n\n### 2016-2017: Increased Deniability and Scale Through the Use of Pseudo- Ransomware\n\nVOODOO BEAR’s destructive operations in 2017 marked a distinct change in deployment\nand destructive payload TTPs. Building on earlier attempts to masquerade wipers as criminal\nransomware, several campaigns using different — but technically linked — pseudoransomware families were deployed by the adversary against Ukrainian entities.\n\nOf particular note was the adoption of several deployment techniques that greatly amplified\nthe potential scope and destructive implications of these operations. The use of supply chain\ncompromise and SWC methodologies vastly increased the number of victims impacted by\neach campaign, and worm-like propagation mechanisms supported by the Mimikatz\ncredential-stealing tool and the EternalBlue exploit for the CVE-2017-0144 vulnerability\nincreased the potential impact on networks after initial infection.\n\nThese operations included:\n\nJanuary 2017: Filecoder.NKH was deployed via a supply chain compromise of a\nUkrainian IT company\nMay 2017: XDATA was deployed for a short period via the software update mechanism\nof M.E. Doc, a Ukrainian accounting software product used by many companies either\nlocated — or operating — within Ukraine\n\n\n-----\n\nJune 2017: FakeCry also was deployed via a malicious M.E. Doc update, a malware\nfamily impersonating the infamous WannaCry ransomware\nJune 2017: NotPetya was deployed via the same M.E. Doc mechanism, with earlier\ntests likely deployed via SWC of a Ukrainian media website\nOctober 2017: BadRabbit was deployed against Ukrainian transport networks via SWC\nof websites in several countries including Ukraine, Russia, Turkey and Bulgaria\n\nObservations of a phased approach to the distribution of pseudo-ransomware variants\nacross multiple delivery vectors suggest that campaigns in early 2017 may have been tests\nfor the wider distribution of NotPetya, which was apparently timed to coincide with Ukraine’s\nConstitution Day. However, distribution of NotPetya via the M.E. Doc update mechanism —\nalso used by non-Ukrainian organizations — and the implementation of unconstrained\npropagation techniques resulted in global spread with likely unintended impact to a wide\nvariety of sectors including logistics, healthcare and retail. The BadRabbit campaign also\nappeared to have resulted in collateral damage against some Russia-based organizations,\nlikely as a result of victims visiting websites used to distribute the malware.\n\n### 2022: Hybrid Operations Using Multiple Campaign Stages\n\nJanuary 2022 reporting on what CrowdStrike tracks as the WhisperedDebate activity cluster\n[involving website defacements and WhisperGate wiper operations against Ukrainian](https://www.crowdstrike.com/blog/technical-analysis-of-whispergate-malware/)\ngovernment networks demonstrates the continued intent to disrupt state institutions.\nCrowdStrike Intelligence does not currently attribute WhisperedDebate to a named adversary\n(e.g., VOODOO BEAR), although high-level parallels to previous operations, the Ukrainian\nfocus and timing of the activity strongly suggest a Russia-nexus adversary or a group aligned\nwith their interests.\n\nPublic statements from the Ukrainian government suggest that the scope of this operation\nwas relatively constrained compared to VOODOO BEAR campaigns in 2017, although it is\nunknown whether this was intentional or representative of operational difficulties experienced\nby the adversary. However, the likely manual malware distribution vector employed and the\nfocus on targeting of government networks — and other destructive attacks against IT\nservice providers, likely in an attempt to cover up evidence of initial intrusion vectors —\nindicates that limited impact was intentional in this case.\n\nCrowdStrike has identified several attempts to distribute data purportedly acquired from\nseveral government organizations shortly after they had been targeted during the\nWhisperedDebate campaign, supporting claims made in the website defacement messages.\nWhile links between these events have not been conclusively proven at the time of writing,\ndata leak evidence presented by several personas presenting hacktivist or criminal\nmotivations may be representative of an attempt to execute an IO campaign to successively\nrelease personally identifiable information (PII), contrary to repeated statements from\n\n\n-----\n\nUkrainian officials that no data had been taken during the network intrusions. These attempts\ncan seek to degrade public trust in the government’s ability to effectively address the\nbreaches.\n\nThis use of IO mirrors earlier VOODOO BEAR TTPs, where the CyberBerkut and Sprut\ngroup personas contemporaneously released private data from Ukrainian organizations. The\nintroduction of publicly visible website defacements during the WhisperedDebate activity\nprovides an additional facet to the operation that can be easily picked up and amplified by\nmedia outlets.\n\n## Assessment\n\nThe extended history of destructive VOODOO BEAR operations against Ukrainian entities\nindicates a commitment to the execution of psychological operations against the local\npopulace. This represents ongoing Russian government efforts to influence Ukraine against\na backdrop of national security and populist policies.\n\nUltimately, these operations and their intended effects are complementary to the Russian\ngovernment’s overall strategy pertaining to Ukraine, although they do not appear to be\nspecifically linked to overt diplomatic efforts or military maneuvers, and instead are likely\nintended as a separate tool that can be used to selectively increase tension within Ukraine\nand destabilize public trust in Ukrainian government institutions. The precise endgame for\nthese actions is unclear, although coercing the population to reject closer ties with the West,\nestablishing new leadership more favorable to Russia or preparing for military action similar\nto the 2014 annexation of Crimea are all possible intended outcomes.\n\nCrowdStrike anticipates that future offensive operations against Ukraine will most likely take\n[the form of destructive wiping attacks masquerading as ransomware. This assessment is](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\nmade with moderate confidence, based on a successive evolution of technical TTPs and the\nacknowledgement that this type of operation can have the desired disruptive effect and\nsignal deeper intent, while still avoiding taking direct responsibility for the attacks.\n\nThe contemporaneous use of IO campaigns to launder and publicize PII or other sensitive\ndata stolen during network breaches and draw media awareness through website\ndefacement activity is also likely to occur as part of hybrid operations in the future. A low\n[chance of DoS attacks may be present in future campaigns, although this technique has not](https://www.crowdstrike.com/cybersecurity-101/denial-of-service-dos-attacks/)\nbeen observed in recent years and arguably has little lasting effect on targeted\norganizations. DoS would most likely be used in combination with other offensive actions\nsuch as wiping attacks, or to bolster credentials within hacktivist communities.\n\nBased on observations of past events such as the spread of NotPetya, disruptive and\ndestructive attacks against Ukraine are likely to have broader implications, including potential\nimpacts to organizations based outside the country. Collateral damage is particularly likely to\nbe experienced by companies that operate subsidiaries within Ukraine or possess network\n\n\n-----\n\nassets interconnected with Ukrainian organizations. This assessment is made with moderate\nconfidence, although there is evidence to suggest that subsequent operations have\nattempted to limit the scope of unconstrained malware propagation, likely due to the\nsignificant unintended fallout of NotPetya. Outside of being directly impacted by destructive\nattacks, organizations relying on Ukrainian logistics networks are likely to experience\ndisruptive effects of any future operations targeting part of the Ukrainian transport sector.\n\nDestructive attacks intentionally targeted at organizations outside the country — such as\nthose headquartered within countries supportive of Ukraine’s position against Russia,\nincluding the U.S. and those in Europe — cannot be completely discounted, although this is\nassessed as an unlikely scenario due to the risk of uncontrolled escalation of international\ntension and punitive measures, including direct retaliatory actions by other governments.\nHowever, the incidental targeting of international businesses operating within Ukraine may\nbe used by Russian-nexus adversaries to dissuade business operations and investment and\ndestabilize the local economy.\n\n### CrowdStrike Intelligence Confidence Assessment\n\n**High Confidence: Judgments are based on high-quality information from multiple sources.**\nHigh confidence in the quality and quantity of source information supporting a judgment does\nnot imply that that assessment is an absolute certainty or fact. The judgment still has a\nmarginal probability of being inaccurate.\n\n**Moderate Confidence: Judgments are based on information that is credibly sourced and**\nplausible, but not of sufficient quantity or corroborated sufficiently to warrant a higher level of\nconfidence. This level of confidence is used to express that judgments carry an increased\nprobability of being incorrect until more information is available or corroborated.\n\n**Low Confidence: Judgments are made where the credibility of the source is uncertain, the**\ninformation is too fragmented or poorly corroborated enough to make solid analytic\ninferences, or the reliability of the source is untested. Further information is needed for\ncorroboration of the information or to fill known intelligence gaps.\n\n**Additional Resources**\n\n_Find out how to stop adversaries targeting your industry — schedule a free 1:1 intel_\n_briefing with a CrowdStrike threat intelligence expert today._\n_[Learn how Falcon X™ Premium cyber threat intelligence enables your security teams](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/premium/)_\n_to become intelligence-led by exposing the adversaries and evolving tradecraft_\n_targeting your business._\n_Learn about the powerful, cloud-native CrowdStrike Falcon® platform by visiting the_\n_product webpage._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ to see for yourself how](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_true next-gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-28 - Lessons Learned From Successive Use of Offensive Cyber Operations Against Ukraine and What May Be Next.pdf"
    ],
    "report_names": [
        "2022-01-28 - Lessons Learned From Successive Use of Offensive Cyber Operations Against Ukraine and What May Be Next.pdf"
    ],
    "threat_actors": [
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536127,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653780085,
    "ts_modification_date": 1653780085,
    "files": {
        "pdf": "https://archive.orkl.eu/c82f489fd533091e593eebc5e4204a7ba13cd083.pdf",
        "text": "https://archive.orkl.eu/c82f489fd533091e593eebc5e4204a7ba13cd083.txt",
        "img": "https://archive.orkl.eu/c82f489fd533091e593eebc5e4204a7ba13cd083.jpg"
    }
}