{
    "id": "04187ce1-c3fa-4932-8805-08f406cc4b17",
    "created_at": "2023-01-12T15:10:42.568695Z",
    "updated_at": "2025-03-27T02:11:00.504148Z",
    "deleted_at": null,
    "sha1_hash": "78ff2c555a79cb1a0286429c717bcb305eb70006",
    "title": "2021-07-15 - Hooking Candiru Another Mercenary Spyware Vendor Comes into Focus",
    "authors": "",
    "file_creation_date": "2022-05-28T15:40:27Z",
    "file_modification_date": "2022-05-28T15:40:27Z",
    "file_size": 4074698,
    "plain_text": "# Hooking Candiru Another Mercenary Spyware Vendor Comes into Focus\n\n**[citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/](https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/)**\n\nJuly 15, 2021\n\n[Research](https://citizenlab.ca/category/research/)\n\n\n-----\n\n[Targeted Threats](https://citizenlab.ca/category/research/targeted-threats/)\nBy [Bill Marczak,](https://citizenlab.ca/author/bmarczak/) [John Scott-Railton,](https://citizenlab.ca/author/jsrailton/) [Kristin Berdan,](https://citizenlab.ca/author/kristin-berdan/) [Bahr Abdul Razzak, and](https://citizenlab.ca/author/bahrabdulrazzak/) [Ron Deibert](https://citizenlab.ca/author/profd/)\nJuly 15, 2021\n\n## Summary\n\nCandiru is a secretive Israel-based company that sells spyware exclusively to governments. Reportedly, their\nspyware can infect and monitor iPhones, Androids, Macs, PCs, and cloud accounts.\nUsing Internet scanning we identified more than 750 websites linked to Candiru’s spyware infrastructure. We found\nmany domains masquerading as advocacy organizations such as Amnesty International, the Black Lives Matter\nmovement, as well as media companies, and other civil-society themed entities.\nWe identified a politically active victim in Western Europe and recovered a copy of Candiru’s Windows spyware.\n\n\n-----\n\nWorking with Microsoft Threat Intelligence Center (MSTIC) we analyzed the spyware, resulting in the discovery of\n**[CVE-2021-31979 and](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-31979)** **[CVE-2021-33771 by Microsoft, two privilege escalation vulnerabilities exploited by Candiru.](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2021-33771)**\nMicrosoft patched both vulnerabilities on July 13th, 2021.\n[As part of their investigation, Microsoft observed at least 100 victims in Palestine, Israel, Iran, Lebanon, Yemen,](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\nSpain, United Kingdom, Turkey, Armenia, and Singapore. Victims include human rights defenders, dissidents,\njournalists, activists, and politicians.\nWe provide a brief technical overview of the Candiru spyware’s persistence mechanism and some details about the\nspyware’s functionality.\nCandiru has made efforts to obscure its ownership structure, staffing, and investment partners. Nevertheless, we\nhave been able to shed some light on those areas in this report.\n\n## 1. Who is Candiru?\n\nThe company known as “Candiru,” based in Tel Aviv, Israel, is a mercenary spyware firm that markets “untraceable”\nspyware to government customers. Their product offering includes solutions for spying on computers, mobile devices,\nand cloud accounts.\n\nFigure 1: A distinctive mural of five men with empty heads wearing suits and bowler hats is displayed in this “Happy\nHour” photo a previous Candiru office posted on Facebook by a catering company.1\n\n### A Deliberately Opaque Corporate structure\n\n\nCandiru makes efforts to keep its operations, infrastructure, and staff identities opaque to public scrutiny. Candiru Ltd.\nwas founded in 2014 and has undergone several name changes2 (see: Table 1). Like many mercenary spyware\n[corporations, the company reportedly recruits from the ranks of Unit 8200, the signals intelligence unit of the Israeli](https://www.haaretz.com/middle-east-news/.premium-top-secret-israeli-cyberattack-firm-revealed-1.6805950)\nDefence Forces.\n\nWhile the company’s current name is Saito Tech Ltd, we will refer to them as “Candiru” as they are most well known by\n[that name. The firm’s corporate logo appears to be a silhouette of the reputedly-gruesome Candiru fish in the shape of](https://en.wikipedia.org/wiki/Candiru)\nthe letter “C.”\n\n**Company name** **Date of registration** **Possible meaning**\n\n**Saito Tech Ltd. (סאייטו טק בעיימ)** 2020 [“Saito” is a town in Japan](https://en.wikipedia.org/wiki/Saito,_Miyazaki)\n\n**Taveta Ltd. (טאבטה בעיימ)** 2019 [“Taveta” is a town in Kenya](https://en.wikipedia.org/wiki/Taveta,_Kenya)\n\n\n-----\n\n**Company name** **Date of registration** **Possible meaning**\n\n**Grindavik Solutions Ltd. (גרינדוויק פתרונות בעיימ)** 2018 [“Grindavik” is a town in Iceland](https://en.wikipedia.org/wiki/Grindav%C3%ADk)\n\n**DF Associates Ltd. (ד. אפ אסוסיאייטס בעיימ)** 2017 ?\n\n**Candiru Ltd. (קנדירו בעיימ)** 2014 [A parasitic freshwater fish](https://en.wikipedia.org/wiki/Candiru)\n\n**Table 1: Candiru’s corporate registrations over time**\n\nCandiru has at least one subsidiary: Sokoto Ltd. 3 _Section 5 provides further documentation of Candiru’s corporate_\nstructure and ownership.\n\n### Reported Sales and Investments\n\nAccording to a [lawsuit brought by a former employee, Candiru had sales of “nearly $30 million,” within two years of its](https://www.haaretz.com/israel-news/tech-news/.premium-mobile-spytech-millions-in-gulf-deals-top-secret-israeli-cyberattack-firm-reve-1.9125915)\nfounding. The firm’s reported clients are located in “Europe, the former Soviet Union, the Persian Gulf, Asia and Latin\nAmerica.” Additionally, reports of possible deals with several countries have been published:\n\n**Uzbekistan: In a 2019** [presentation at the Virus Bulletin security conference, a Kaspersky Lab researcher stated](https://www.virusbulletin.com/conference/vb2019/abstracts/who-sandcat-unveiling-lesser-known-threat-actor)\nthat Candiru likely sold its spyware to Uzbekistan’s National Security Service.\n**Saudi Arabia & the UAE: The same presentation also mentioned Saudi Arabia and the UAE as likely Candiru**\ncustomers.\n**Singapore: A 2019 Intelligence Online** [report mentions that Candiru was active in soliciting business from](https://www.intelligenceonline.com/international-dealmaking/2019/04/03/singapore-turns-to-israeli-cyber-spies-again,108351899-art)\nSingapore’s intelligence services.\n**Qatar: A 2020 Intelligence Online** [report notes that Candiru “has become closer to Qatar.” A company linked to](https://www.intelligenceonline.com/government-intelligence/2020/08/26/doha-like-abu-dhabi-also-hooked-on-israeli-technology,109602026-evg)\n[Qatar’s sovereign wealth fund has invested in Candiru. No information on Qatar-based customers has yet emerged,](https://www.intelligenceonline.com/corporate-intelligence/2020/08/26/candiru-receives-boost-from-investors-linked-to-qatar,109602043-art)\n\n### Candiru’s Spyware Offerings\n\n[A leaked Candiru project proposal published by TheMarker shows that Candiru’s spyware can be installed using a](https://www.themarker.com/embeds/pdf_upload/2020/20200902-161742.pdf)\nnumber of different vectors, including malicious links, man-in-the-middle attacks, and physical attacks. A vector named\n“Sherlock” is also offered, that they claim works on Windows, iOS, and Android. This may be a browser-based zero-click\nvector.\n\nFigure 2: Infection vectors offered by Candiru.\nLike many of its peers, Candiru appears to license its spyware by number of concurrent infections, which reflects the\nnumber of targets that can be under active surveillance at any one instant in time. Like NSO Group, Candiru also\nappears to restrict the customer to a set of approved countries.\n\nThe €16 million project proposal allows for an unlimited number of spyware infection attempts, but the monitoring of only\n10 devices simultaneously. For an additional €1.5M, the customer can purchase the ability to monitor 15 additional\ndevices simultaneously, and to infect devices in a single additional country. For an additional €5.5M, the customer can\nmonitor 25 additional devices simultaneously, and conduct espionage in five more countries.\n\n\n-----\n\nFigure 3: Proposal for a Candiru Customer indicating number of concurrent infections under a given contract.\nThe fine print in the proposal states that the product will operate in “all agreed upon territories, ”then mentions a list of\n[restricted countries including the US, Russia, China, Israel and Iran. This same list of restricted countries has previously](https://www.haaretz.com/middle-east-news/.premium-with-israel-s-encouragement-nso-sold-spyware-to-uae-and-other-gulf-states-1.9093465)\n[been mentioned by NSO Group. Nevertheless, Microsoft observed Candiru victims in Iran, suggesting that in some](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\nsituations, products from Candiru do operate in restricted territories. In addition, targeting infrastructure disclosed in this\nreport includes domains masquerading as the Russian postal service.\n\nThe proposal states that the spyware can exfiltrate private data from a number of apps and accounts including Gmail,\nSkype, Telegram, and Facebook. The spyware can also capture browsing history and passwords, turn on the target’s\nwebcam and microphone, and take pictures of the screen. Capturing data from additional apps, such as Signal Private\nMessenger, is sold as an add-on.\n\nFigure 4: Customers can pay additional money to capture data from Signal.\nFor a further additional €1.5M fee, customers can purchase a remote shell capability, which allows them full access to run\nany command or program on the target’s computer. This kind of capability is especially concerning, given that it could\nalso be used to download files, such as planting incriminating materials, onto an infected device.\n\n## 2. Finding Candiru’s Malware In The Wild\n\nUsing telemetry data from Team Cymru, along with assistance from civil society partners, the Citizen Lab was able to\nidentify a computer that we suspected contained a persistent Candiru infection. We contacted the owner of the computer,\na politically active individual in Western Europe, and arranged for the computer’s hard drive to be imaged. We ultimately\nextracted a copy of Candiru’s spyware from the disk image.\n\nWhile analysis of the extracted spyware is ongoing, this section outlines initial findings about the spyware’s persistence\n\n### Persistence\n\nCandiru’s spyware was persistently installed on the computer via COM hijacking of the following registry key:\n\n```\nHKEY_LOCAL_MACHINE\\Software\\Classes\\CLSID\\{CF4CC405-E2C5-4DDD-B3CE-5E7582D8C9FA}\\InprocServer32\n\n```\n\n-----\n\nNormally, this registry key s value points to the benign Windows Management Instrumentation wmiutils.dll file, but the\nvalue on the infected computer had been modified to point to a malicious DLL file that had been dropped inside the\nWindows system folder associated with the Japanese input method (IMEJP)\nC:\\WINDOWS\\system32\\ime\\IMEJP\\IMJPUEXP.DLL. This folder is benign and included in a default install of Windows\n10, but IMJPUEXP.DLL is not the name of a legitimate Windows component.\n\nWhen Windows boots, it automatically loads the Windows Management Instrumentation service, which involves looking\nup the DLL path in the registry key, and then invoking the DLL.\n\n### Loading the Spyware’s Configuration\n\nThe IMJPUEXP DLL file has eight blobs in the PE resources section with identifiers 102, 103, 105, 106, 107, 108, 109,\n110. The DLL decrypts these using an AES key and IV that are hardcoded in the DLL. Decryption is via Windows\nCryptoAPI, using AES-256-CBC.\n\nOf particular note is resource 102, which contains the path to the legitimate wmiutils.dll, which is loaded after the\nspyware, ensuring that the COM hijack does not disrupt normal Windows functionality. Resource 103 points to a file\nAgentService.dat in a folder created by the spyware, C:\\WINDOWS\\system32\\config\\spp\\Licenses\\curv\\config\\tracing\\.\nResource 105 points to a second file in the same directory, KBDMAORI.dat.\n\nIMJPUEXP.DLL decrypts and loads the AgentService.dat file whose path is in resource 103, using the same AES key\nand IV, and decompresses it via zlib. AgentService.dat file then loads the file in resource 105, KBDMAORI.dat, using a\nsecond AES key and IV hardcoded in AgentService.dat, and performs the decryption using a statically linked OpenSSL.\nDecrypting KBDMAORI.DAT yields a file with a series of nine encrypted blobs, each prefixed with an 8-byte little-endian\nlength field. Each blob is encrypted with the same AES key and IV used to decrypt KBDMAORI.DAT, and is then zlib\ncompressed.\n\nThe first four encrypted blobs appear to be DLLs from the Microsoft Visual C++ redistributable: vcruntime140.dll,\nmsvcp140.dll, ucrtbase.dll, concrt140.dll. The subsequent blobs are part of the spyware, including components that are\napparently called Internals.dll and Help.dll. Both the Microsoft DLLs and the spyware DLLs in KBDMAORI.DAT are\nlightly obfuscated. Reverting the following modifications makes the files valid DLLs:\n\n1. The first two bytes of the file (MZ) have been zeroed.\n2. The first 4 bytes of NT header (\\x50\\x45\\x00\\x00) have been zeroed.\n3. The first 2 bytes of the optional header (\\x0b\\x02) have been zeroed.\n4. The strings in the import directory have been XOR obfuscated, using a 48-byte XOR key hardcoded in\n\nAgentService.dat:\n\n```\n6604F922F90B65F2B10CE372555C0A0C0C5258B6842A83C7DC2EE4E58B363349F496E6B6A587A88D0164B74DAB9E6B58\n\n```\n\nThe final blob in KBDMAORI.DAT is the spyware’s configuration in JSON format. The configuration is somewhat\nobfuscated, but clearly contains Base64 UTF-16 encoded URLs for command-and-control.\n\nFigure 5: The obfuscated spyware’s C&C configuration in JSON format.\nThe C&C servers in the configuration are:\n\n```\nhttps://msstore[.]io\n\n```\n```\nhttps://adtracker[.]link\n\n```\n```\nhttps://cdnmobile[.]io\n\n```\n\nAll three domain names pointed to 185.181.8[.]155. This IP address was connected to three other IPs that matched our\nCandiru fingerprint CF1 (Section 3).\n\n\n-----\n\n### Spyware Functionality\n\nWe are still reversing most of the spyware’s functionality, but Candiru’s Windows payload appears to include features for\nexfiltrating files, exporting all messages saved in the Windows version of the popular encrypted messaging app Signal,\nand stealing cookies and passwords from Chrome, Internet Explorer, Firefox, Safari, and Opera browsers. The spyware\nalso makes use of a legitimate signed third-party driver, physmem.sys:\n\n```\nc299063e3eae8ddc15839767e83b9808fd43418dc5a1af7e4f44b97ba53fbd3d\n\n```\n\nMicrosoft’s [analysis also established that the spyware could send messages from logged-in email and social media](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\naccounts directly on the victim’s computer. This could allow malicious links or other messages to be sent directly from a\ncompromised user’s computer. Proving that the compromised user did not send the message could be quite challenging.\n\n## 3. Mapping Candiru’s Command & Control Infrastructure\n\nTo identify the websites used by Candiru’s spyware, we developed four fingerprints and a new Internet scanning\n[technique. We searched historical data from Censys and conducted our own scans in 2021. This led us to identify at](https://censys.io/)\nleast 764 domain names that we assess with moderate-high confidence to be used by Candiru and its customers.\nExamination of the domain names indicates a likely interest in targets in Asia, Europe, the Middle East, and North\nAmerica.\n\nAdditionally, based on our analysis of Internet scanning data, we believe that there are Candiru systems operated from\nSaudi Arabia, Israel, UAE, Hungary, and Indonesia, among other countries.\n\n### OPSEC Mistake by Candiru Leads to their Infrastructure\n\n[Using Censys, we found a self-signed TLS certificate that included the email address “amitn@candirusecurity.com”. We](https://search.censys.io/certificates/6008708f3c88b0acc4a56a5d396a8261bde02ec1408c69bfc21f3b397fc76a4f)\nattributed the candirusecurity[.]com domain name to Candiru Ltd, because a second domain name (verification[.]center)\nwas registered in 2015 with a candirusecurity[.]com email address and a phone number (+972-54-2552428) listed by Dun\n& Bradstreet as the [fax number for Candiru Ltd, also known as Saito Tech Ltd.](https://www.dunsguide.co.il/en/Cf02a0e29fc26363000a0275217acaa51_high_tech_computing_services/saito_tech/)\n\nFigure 6: This Candiru certificate we found on Censys was the starting point of our analysis.\nCensys data records that a total of six IP addresses returned this certificate: 151.236.23[.]93, 69.28.67[.]162,\n176.123.26[.]67, 52.8.109[.]170, 5.135.115[.]40, 185.56.89[.]66. The latter four of these IP addresses subsequently\nreturned [another certificate, which we fingerprinted (Fingerprint CF1) based on distinctive features. We searched](https://search.censys.io/certificates/9d1afe71fa38a2d8c24664029a41ceb980862d4c8cecaf6c2278c779ac1307bd)\nCensys data for this fingerprint.\n\n\n-----\n\n```\n    p g p\nFROM`censys-io.certificates_public.certificates`\nWHERE parsed.issuer_dn IS NULL\n AND parsed.subject_dn IS NULL\n AND parsed.validity.length = 8639913600\n AND parsed.extensions.basic_constraints.is_ca\n\n```\nTable 2: Fingerprint CF1\n\nWe found 42 certificates on Censys matching CF1. We observed that six IPs matching CF1 certificates later returned\ncertificates that matched a second fingerprint we devised, CF2. The CF2 fingerprint is based on certificates that match\nthose generated by a “Fake Name” generator. We first ran an SQL query on Censys data for the fingerprint, and then\nfiltered by a list of fake names.\n```\nSELECT parsed.fingerprint_sha256, parsed.subject_dn\nFROM`censys-io.certificates_public.certificates`\nWHERE (parsed.subject_dn = parsed.issuer_dn\n  AND REGEXP_CONTAINS (parsed.subject_dn, r\"^O=[A-Z][a-z]+,,? \n  CN=[a-z]+\\.(com|net|org)+$\")\n  AND parsed.extensions.basic_constraints.is_ca\n\n```\nTable 3: Fingerprint CF2 SQL Query.\n\nThe SQL query yielded 572 results. We filtered the results, requiring the TLS certificate’s organization in the\nparsed.subject_dn field to contain an entry from the [list of 475 last names in the Perl Data-Faker module. We suspect](https://metacpan.org/release/WSHELDAHL/Data-Faker-0.10/source/lib/Data/Faker/Name.pm)\nthat Candiru is using either this Perl module, or another module that uses the same word list, to generate fake names for\nTLS certificates. Neither the Perl Data-Faker module, nor other similar modules (e.g., the Ruby Faker Gem, or the PHP\nFaker module) appear to have built-in functionality for generating fake TLS certificates. Thus, we suspect that the TLS\ncertificate generation code is custom code written by Candiru. After filtering, we found 542 matching certificates.\n\nWe then developed an HTTP fingerprint, called BRIDGE, with which we scanned the Internet and built a third TLS\nfingerprint, CF3. We are keeping the BRIDGE and CF3 fingerprints confidential for now in order to maintain visibility into\nCandiru’s infrastructure.\n\n### Overlap with CHAINSHOT\n\nOne of the IPs that matched our CF1 fingerprint, 185.25.50[.]194, was pointed to by dl.nmcyclingexperience[.]com, which\n[is mentioned as a final URL of a spyware payload delivered by the CHAINSHOT exploit kit in a 2018 report. CHAINSHOT](https://unit42.paloaltonetworks.com/unit42-slicing-dicing-cve-2018-5002-payloads-new-chainshot-malware/)\nis believed to be linked to Candiru, though no public reports have outlined the basis for this attribution, until now.\nKaspersky has observed UAE hacking group Stealth Falcon4 using CHAINSHOT, as well as an Uzbekistan-based\ncustomer that they call SandCat. While numerous analyses have focused on various CHAINSHOT exploitation\ntechniques, we have not seen any public work that examines Candiru’s final Windows payload.\n\n### Overlap with Google TAG Research\n\nOn 14 July 2021, Google’s Threat Analysis Group (TAG) [published a report that mentions two Chrome zero-day exploits](https://blog.google/threat-analysis-group/how-we-protect-users-0-day-attacks/)\nthat TAG observed used against targets (CVE-2021-21166 and CVE-2021-30551). The report mentions nine websites\nthat Google determined were used to distribute the exploits. Eight of these websites pointed to IP addresses that\nmatched our CF3 Candiru fingerprint. We thus believe that the attacks that Google observed involving these Chrome\nexploits were linked to Candiru.\n\nGoogle also linked a further Microsoft Office exploit they observed (CVE-2021-33742) to the same operator.\n\n### Targeting Themes\n\nExamination of Candiru’s targeting infrastructure permits us to make guesses about the location of potential targets, and\ntopics and themes that Candiru operators believed that targets would find relevant and enticing.\n\nSome of the themes strongly suggest that the targeting likely concerned civil society and political activity. This troubling\nindicator matches with Microsoft’s observation of the extensive targeting of members of civil society, academics, and the\nmedia with Candiru’s spyware. We observed evidence of targeting infrastructure masquerading as media, advocacy\n\n\n-----\n\norganizations, international organizations, and others (see: Table 4).\n\nWe found many aspects of this targeting concerning, such as the domain blacklivesmatters[.]info, which may be used to\ntarget individuals interested in or affiliated with this movement. Similarly, infrastructure masquerading as Amnesty\nInternational and Refugee International are troubling, as are lookalike domains for the United Nations, World Health\nOrganization, and other international organizations. We also found the targeting theme of gender studies (e.g.\nwomanstudies[.]co & genderconference[.]org) to be particularly interesting and warranting further investigation.\n\n**Theme** **Example Domains** **Masquerading as**\n\nInternational Media cnn24-7[.]online CNN\n\ndw-arabic[.]com Deutsche Welle\n\neuro-news[.]online Euronews\n\nrasef22[.]com Raseef22\n\nfrance-24[.]news France 24\n\nAdvocacy Organizations amnestyreports[.]com Amnesty International\n\nblacklivesmatters[.]info Black Lives Matter\nmovement\n\nrefugeeinternational[.]org Refugees International\n\nGender Studies womanstudies[.]co Academic theme\n\ngenderconference[.]org Academic conference\n\nTech Companies cortanaupdates[.]com Microsoft\n\ngooglplay[.]store Google\n\napple-updates[.]online Apple\n\namazon-cz[.]eu Amazon\n\ndrpbx-update[.]net Dropbox\n\nlenovo-setup[.]tk Lenovo\n\nkonferenciya-zoom[.]com Zoom\n\nzcombinator[.]co Y Combinator\n\nfaceb00k-live[.]com Facebook\n\nminstagram[.]net Instagram\n\ntwitt-live[.]com Twitter\n\nyoutubee[.]life YouTube\n\n\nPopular Internet\nWebsites\n\nInternational\nOrganizations\n\n\nwikipediaathome[.]net Wikipedia\n\nosesgy-unmissions[.]org Office of the Special Envoy of the Secretary-General for\nYemen\n\n\nun-asia[.]co United Nations\n\nwhoint[.]co World Health Organization\n\nGovernment Contractors vesteldefnce[.]io Turkish defense contractor\n\n\n-----\n\n**Theme** **Example Domains** **Masquerading as**\n\nvfsglobal[.]fr Visa services provider\n\n**Table 4: Some targeting themes observed in Candiru domains.**\n\nA range of targeting domains appears to be reasonably country-specific (see: Table 5). We believe these domain themes\nindicate likely countries of targets and not necessarily the countries of the operators themselves.\n\n**Country** **Example Domain** **What is this likely impersonating?**\n\nIndonesia indoprogress[.]co Left-leaning Indonesian publication\n\nRussia pochtarossiy[.]info Russian postal service\n\nCzechia kupony-rohlik[.]cz Czech grocery\n\nArmenia armenpress[.]net State news agency of Armenia\n\nIran tehrantimes[.]org English-language daily newspaper in Iran\n\nTurkey yeni-safak[.]com Turkish newspaper\n\nCyprus cyprusnet[.]tk A portal providing information on Cypriot businesses.\n\nAustria oiip[.]org Austrian Institute for International Affairs\n\n\nPalestine lwaeh-itehamalasra[.]com\n\n\nWebsite that publishes Israeli court indictments of Palestinian prisoners\n\n\nSaudi\nArabia\n\n\nmbsmetoo[.]com Website for “an international campaign to support the case of Jamal Khashoggi” and\nother cases against Saudi Crown Prince Mohammed bin Salman\n\n\nSlovenia total-slovenianews[.]net\n\n\nEnglish-language Slovenian news site.\n\n\n**Table 5: Some country themes observed in Candiru domains.**\n\n## 4. A Saudi-Linked Cluster?\n\nA document was uploaded from Iran to VirusTotal that used an AutoOpen Macro to launch a web browser, and navigated\nthe browser to the URL https://cuturl[.]space/lty7uw, which VirusTotal recorded as redirecting to a URL,\nhttps://useproof[.]cc/1tUAE7A2Jn8WMmq/api, that mentions a domain we linked to Candiru, useproof[.]cc. The domain\n_useproof[.]cc pointed to 109.70.236.107, which matched our fingerprint CF3._\n\nThe document was blank, except for a graphic containing the text “Minister of Foreign Affairs of the Islamic Republic of\nIran.”\n\nFigure 7: A document that loads a Candiru URL was uploaded to VirusTotal from Iran, and includes a header image\nreferencing the Minister of Foreign Affairs.\nWe fingerprinted the behaviour of cuturl[.]space and traced it to five other URL shorteners: llink[.]link, instagrarn[.]co,\n_cuturl[.]app, url-tiny[.]co, and bitly[.]tel. Interestingly, several of these domains were flagged by a researcher at_\n[ThreatConnect in two](https://twitter.com/kyleehmke/status/1324029830560710658) [tweets, based on suspicious characteristics of their registration. We suspect that the AutoOpen](https://twitter.com/kyleehmke/status/1354420675105189892)\nformat and the URL shorteners may be unique to a particular Candiru client.\n\n\n-----\n\nA Saudi Twitter user contacted us and reported that Saudi users active on Twitter were receiving messages with\nsuspicious short URLs, including links to the domain name bitly[.]tel. Given this, we suspect that the URL shorteners\nmay be linked to Saudi Arabia.\n\n## 5. Additional Corporate Details for Candiru\n\nYa’acov Weitzman (ויצמן יעקב) and Eran Shorer (שורר ערן) founded Candiru in 2014. Isaac Zack (זק יעקב), also reportedly\nan early investor in NSO Group, became the largest shareholder of Candiru less than two months after its founding and\ntook a seat on its board of directors. In January 2019, Tomer Israeli (ישראלי תומר) first appeared in corporate records as\nCandiru’s “director of finance,” and Eitan Achlow (אחלאו איתן) was named CEO.\n\nA number of independent investors appear to have funded Candiru’s operations over the years. As of Candiru’s notice of\nallotment of shares filed in February 2021 with the Israeli Corporations Authority, Zack, Shorer, and Weitzman are still the\nlargest shareholders. Three organizations are the next largest shareholders: Universal Motors Israel LTD (corporate\nregistration 511809071), ESOP management and trust services (איסופ שירותי ניהול) corporate registration 513699538, and\nOptas Industry Ltd. ESOP (corporate registration no. 513699538) is an Israeli company that provides employee stock\nprogram administrative services to corporate clients. We do not know whether ESOP holds its stock in trust for certain\nCandiru employees. Optas Industry Ltd. is a Malta-based private equity firm (registration number C91267, shareholder\n[Leonard Joseph O’Brien, directors are O’Brien and Michael Ellul, incorporated 28 March 2019). It has been reported that](https://www.intelligenceonline.com/corporate-intelligence/2020/08/26/candiru-receives-boost-from-investors-linked-to-qatar,109602043-art)\nfor a decade O’Brien has served as head of investment and a board member of the Gulf Investment Fund, and that the\nsovereign Qatar Investment Authority has a 12% stake in the Gulf Investment Fund (through a subsidiary, Qatar Holding).\nUniversal Motors Israel (company registration no. 511809071) as an investor (including a seat on Candiru’s board) is\ncurious considering their primary business is the distribution of new and used automobiles.\n\nBesides Amit Ron (רון עמית), the Universal Motors Israel representative, Candiru’s board as of December 2020 includes\nIsaac Zack, Ya’acov Weitzman, and Eran Shorer.\n\nIn addition to the involvement of Zack, Candiru shares other points of commonality with NSO Group, including\n[representation by the same law firm and utilization of the same employee equity and trust administration services](https://www.legal500.com/firms/10627-erdinast-ben-nathan-toledano-co/11092-tel-aviv-israel/)\ncompany.\n\n## 6. Conclusion\n\nCandiru’s apparent widespread presence, and the use of its surveillance technology against global civil society, is a\npotent reminder that the mercenary spyware industry contains many players and is prone to widespread abuse. This\ncase demonstrates, yet again, that in the absence of any international safeguards or strong government export controls,\nspyware vendors will sell to government clients who will routinely abuse their services. Many governments that are eager\nto acquire sophisticated surveillance technologies lack robust safeguards over their domestic and foreign security\nagencies. Many are characterized by poor human rights track records. It is not surprising that, in the absence of strong\nlegal restraints, these types of government clients will misuse spyware services to track journalists, political opposition,\nhuman rights defenders, and other members of global civil society.\n\n### Civil Society in the Crosshairs…Again\n\nThe apparent targeting of an individual because of their political beliefs and activities that are neither terrorist or criminal\n[in nature is a troubling example of this dangerous situation. Microsoft’s independent analysis is also disconcerting,](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\ndiscovering at least 100 victims of Candiru’s malware operations that include “politicians, human rights activists,\njournalists, academics, embassy workers and political dissidents.”\n\nEqually disturbing in this regard is Candiru’s registration of domains impersonating human rights NGOs (Amnesty\nInternational), legitimate social movements (Black Lives Matter), international health organizations (WHO), women’s\nrights themes, and news organizations. Although we lack context around the specific use cases connected to these\ndomains, their mere presence as part of Candiru’s infrastructure—in light of widespread harms against civil society\nassociated with the global spyware industry—is highly concerning and an area that merits further investigation.\n\n### Rectifying Harms around the Commercial Spyware Market\n\n\n-----\n\n[Ultimately, tackling the malpractices of the spyware industry will require a robust, comprehensive approach that goes](https://www.lawfareblog.com/proposed-response-commercial-surveillance-emergency)\nbeyond efforts focused on a single high-profile company or country. Unfortunately, Israel’s Ministry of Defense—from\nwhom Israeli-based companies like Candiru must receive an export license before selling abroad—has so far proven\nitself unwilling to subject surveillance companies to the type of rigorous scrutiny that would be required to prevent abuses\nof the sort we and other organizations have identified. The export licensing process in that country is almost entirely\nopaque, lacking even the most basic measures of public accountability or transparency. It is our hope that reports such\nas this one will help spur policymakers and legislators in Israel and elsewhere to do more to prevent the mounting harms\nassociated with an unregulated spyware marketplace.\n\nIt is worth noting the growing risks that spyware vendors and their ownership groups themselves face as a result of their\nown reckless sales. Mercenary spyware vendors like Candiru market their services to their government clients as\n“untraceable” tools that evade detection and thus prevent their clients’ operations from being exposed. However, our\nresearch shows once again how specious these claims are. Although sometimes challenging, it is possible for\nresearchers to detect and uncover targeted espionage using a variety of networking monitoring and other investigative\n[techniques, as we have demonstrated in this report (and others like it). Even the most well-resourced surveillance](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/)\ncompanies make operational mistakes and leave digital traces, making their marketing claims about being stealthy and\nundetectable highly questionable. To the extent that their products are implicated in significant harms or cases of unlawful\n[targeting, the negative exposure that comes from public interest research may create significant liabilities for ownership,](https://citizenlab.ca/2018/12/litigation-and-other-formal-complaints-concerning-targeted-digital-surveillance-and-the-digital-surveillance-industry/)\nshareholders, and others associated with these spyware companies.\n\nFinally, this case shows the value of a community-wide approach to investigations into targeted espionage. In order to\nremedy the harms generated by this industry for innocent members of global civil society, cooperation among academic\nresearchers, network defenders, threat intelligence teams, and technology platforms is critical. Our research drew upon\nmultiple data sources curated by other groups and entities with whom we cooperated, and ultimately helped identify\n[software vulnerabilities in a widely used product that were reported to and then patched by its vendor.](https://blogs.microsoft.com/on-the-issues/2021/07/15/cyberweapons-cybersecurity-sourgum-malware/)\n\n## Acknowledgements\n\nThanks to Microsoft and Microsoft Threat Intelligence Center (MSTIC) for their collaboration, and for working to quickly\naddress the security issues identified through their research.\n\nWe are especially grateful to the targets that make the choice to work with us to help identify and expose the entities\ninvolved in targeting them. Without their participation this report would not have been possible.\n\nThanks to Team Cymru for providing access to their Pure Signal Recon product. Their tool’s ability to show Internet traffic\ntelemetry from the past three months provided the breakthrough we needed to identify the initial victim from Candiru’s\ninfrastructure\n\nFunding for this project was provided by a generous grant from the John D. and Catherine T. MacArthur Foundation, the\nFord Foundation, Oak Foundation, Sigrid Rausing Trust, and Open Societies Foundation.\n\nThanks to Miles Kenyon, Mari Zhou, and Adam Senft for communications, graphics, and organizational support.\n\n[1. 1. The same photo is visible in tweets by this reporter.](https://twitter.com/amitaiz/status/1080726249503375360) ↩\n2. 2. Data based on a review of the portfolio for company registration number 515126605 in the Israeli Corporations\n\nAuthority [online database.](https://ica.justice.gov.il/GenericCorporarionInfo/SearchCorporation?unit=8) ↩\n3. 3. Incorporated 14 Mar 2020, registration number 515996981, same registered address as Saito Tech. The name\n\n“Sokoto” may refer to a city in Nigeria. ↩\n4. 4. Kaspersky calls this group FruityArmor. ↩\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-15 - Hooking Candiru Another Mercenary Spyware Vendor Comes into Focus.pdf"
    ],
    "report_names": [
        "2021-07-15 - Hooking Candiru Another Mercenary Spyware Vendor Comes into Focus.pdf"
    ],
    "threat_actors": [
        {
            "id": "0f47a6f3-a181-4e15-9261-50eef5f03a3a",
            "created_at": "2022-10-25T16:07:24.228663Z",
            "updated_at": "2025-03-27T02:02:10.145238Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "Project Raven",
                "Stealth Falcon"
            ],
            "source_name": "ETDA:Stealth Falcon",
            "tools": [
                "Deadglyph",
                "StealthFalcon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67ac502c-8cf8-46cb-98e8-c249e0f0298d",
            "created_at": "2022-10-25T16:07:24.149987Z",
            "updated_at": "2025-03-27T02:02:10.124302Z",
            "deleted_at": null,
            "main_name": "SandCat",
            "aliases": [],
            "source_name": "ETDA:SandCat",
            "tools": [
                "CHAINSHOT",
                "FinFisher",
                "FinFisher RAT",
                "FinSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77aedfa3-e52b-4168-8269-55ccec0946f7",
            "created_at": "2023-01-06T13:46:38.453791Z",
            "updated_at": "2025-03-27T02:00:02.837384Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "G0038"
            ],
            "source_name": "MISPGALAXY:Stealth Falcon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "80cf66b8-27d2-4e87-b0d1-5bacacd9bb3d",
            "created_at": "2023-01-06T13:46:38.931567Z",
            "updated_at": "2025-03-27T02:00:02.954922Z",
            "deleted_at": null,
            "main_name": "SandCat",
            "aliases": [],
            "source_name": "MISPGALAXY:SandCat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "fea75bf4-c510-4146-bbac-0802351f4eb0",
            "created_at": "2023-01-06T13:46:38.714847Z",
            "updated_at": "2025-03-27T02:00:02.899174Z",
            "deleted_at": null,
            "main_name": "Unit 8200",
            "aliases": [
                "Duqu Group"
            ],
            "source_name": "MISPGALAXY:Unit 8200",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "38f8da87-b4ba-474b-83e6-5b04d8fb384b",
            "created_at": "2024-02-02T02:00:04.032871Z",
            "updated_at": "2025-03-27T02:00:03.294203Z",
            "deleted_at": null,
            "main_name": "Caramel Tsunami",
            "aliases": [
                "SOURGUM",
                "Candiru"
            ],
            "source_name": "MISPGALAXY:Caramel Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536242,
    "ts_updated_at": 1743041460,
    "ts_creation_date": 1653752427,
    "ts_modification_date": 1653752427,
    "files": {
        "pdf": "https://archive.orkl.eu/78ff2c555a79cb1a0286429c717bcb305eb70006.pdf",
        "text": "https://archive.orkl.eu/78ff2c555a79cb1a0286429c717bcb305eb70006.txt",
        "img": "https://archive.orkl.eu/78ff2c555a79cb1a0286429c717bcb305eb70006.jpg"
    }
}