{
    "id": "042ea478-fadc-4aff-bc01-0d55efaf42e3",
    "created_at": "2022-12-04T11:59:12.906642Z",
    "updated_at": "2025-03-27T02:16:50.902747Z",
    "deleted_at": null,
    "sha1_hash": "27384196bb9a4e55226c8a840876ea99c89b1261",
    "title": "BfV Cyber-Brief Nr. 01/2020",
    "authors": "Bundesamt für Verfassungsschutz",
    "file_creation_date": "2020-06-09T11:22:07Z",
    "file_modification_date": "2020-06-09T11:22:07Z",
    "file_size": 529859,
    "plain_text": "Köln, 18. Juni 2020\n\nBfV Cyber-Brief\nNr. 01/2020\n- Hinweis auf aktuelle Angriffskampagne -\n\nKontakt:\nBundesamt für Verfassungsschutz\nCyberabwehr\n 0221/792-2600\n© maxsim/Fotolia.com\n\nBfV Cyber-Brief\n\nBedrohung deutscher Stellen durch Cyberangriffe der Gruppierung\nKe3chang\nAktuelle Hinweise deuten auf aktuelle Cyberangriffs-Aktivitäten der Gruppierung Ke3Chang gegen Wirtschaftsunternehmen und politische Einrichtungen hin.\n\nSachverhalt\nKe3chang1 ist eine mutmaßlich seit 2010 aktive Cyberspionagegruppierung, die bereits in der Vergangenheit durch Angriffe auf Regierungseinrichtungen, diplomatische Ziele und Wirtschaftsunternehmen auf sich aufmerksam machte. Mitte 2019 warnte z.B. der IT-Sicherheitsdienstleister ESET\nvor Aktivitäten von Ke3chang.2\nNach Erkenntnissen der Cyberabwehr des Bundesamtes für Verfassungsschutz sind diese Angriffe\nTeil einer seit mehreren Jahren andauernden, umfangreichen Cyberspionagekampagne in verschiedenen Teilen Europas. Zum Schutz deutscher Stellen werden mit diesem Cyberbrief Detektionsregeln und technische Indikatoren (Indicators of Compromise) zur Verfügung gestellt, durch die Unternehmen und öffentliche Einrichtungen Infektionen mit aktuellen Versionen der durch Ke3chang verwendeten Schadsoftware namens Ketrican feststellen können.3\n\nVorgehensweise von Ke3chang\nFolgende Verhaltensweisen zeichnen den Akteur im Rahmen dieser Cyberspionagekampagne aus:\n•\n\nNutzung des HTTP-Protokolls zur Kommunikation\n\n•\n\nEinheitliche Muster in den Kommunikationsabständen\n(feste Zeitintervalle zwischen dem Beaconing)\n\n•\n\nSchwächung des Internet Explorers durch Anpassung der entsprechenden Registry-Einträge\n\n•\n\nIntensive Nutzung von cmd.exe zur Ausführung von Befehlen\n\n•\n\nGeringe Anzahl infizierter Maschinen\n\n•\n\nNutzung von Standard- bzw. OpenSource-Tools wie z. B. RAR-Datenkompression oder Mimikatz\n\nBei der Nutzung der Schadsoftware Ketrican:\n•\n\nBefehle werden zwischen Schlüsselwörtern in aufgerufenen Webseiten an den kompromittierten\nClient ausgeliefert: good<Befehl>bad, white<Befehl>purple oder nice<Befehl>say. Derzeit ist für\ndiese Schlüsselwörter noch keine eindeutige Systematik erkennbar. Die Befehle sind verschlüsselt\n(AES128 oder XOR).\n\n•\n\nDie technische Analyse von Ketrican-Samples hat ergeben, dass die Schadsoftware selbst keine\nPersistenz im System herstellt. Es wird daher eher davon ausgegangen, dass ein anderer Mechanismus (z. B. ein Dropper) eine Persistenz der Ketrican-Backdoor einrichtet.\n\n1\n\nKe3chang wird durch IT-Sicherheitsunternehmen auch unter den Bezeichnungen APT15, APT25, Vixen Panda und Metushy geführt.\n\n2\n\nVgl. “Okrum and Ketrican: An overview of recent Ke3chang group activity” vom 18.07.19, in www.welivesecurity.com\n\n3\n\nDie Cyberabwehr des Bundesamtes für Verfassungsschutz bedankt sich bei der Deutschen Cyber-Sicherheitsorganisation GmbH (DCSO) für die\nPrüfung der Detektionsregeln.\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n2\n\nBfV Cyber-Brief\nTechnische Analyse\nDie folgenden Informationen basieren auf der Analyse zahlreicher Ketrican-Samples durch die Cyberabwehr des Bundesamtes für Verfassungsschutz.\nAbbildung 1 zeigt den typischen Ablauf einer Ketrican-Instanz, der sich aus einer Initialisierungs- und\nOperationsphase zusammensetzt. Im Folgenden werden deren Funktionsweisen näher erläutert.\n\nAbbildung 1: Typischer Ablauf einer-Ketrican Instanz nach Start bis hin zum angreifergesteuerten Betrieb der Schadsoftware.\n\nInitialisierungsphase (siehe Abb. 2):\n1 Nach dem Start verhindert Ketrican mittels eines Mutex4 das Ausführen einer weiteren Instanz\nder Schadsoftware.\n2\n\nIm Rahmen der \"Defense Evasion\" versucht Ketrican durch eine lange Inaktivitätszeit in der Initialisierungsphase (API-Funktion Sleep) bei Ausführung innerhalb von Sandbox-Umgebungen\nunentdeckt zu bleiben. Einige Varianten von Ketrican nutzen zusätzlich/alternativ die API-Funktion GetTickCount() in Verbindung mit einer rechenintensiven Befehlsschleife, um typische Sandbox-Mechanismen zu detektieren und die Schadsoftware ggf. ohne weitere Aktivität zu beenden.\n\n4\n\nMutex (Abk. für englisch mutual exclusion) bezeichnet ein Verfahren zum wechselseitigen Ausschluss mehrerer Prozesse, die auf dieselbe\nRessource zugreifen.\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n3\n\nBfV Cyber-Brief\n3\n\nIm nächsten Schritt werden die in der Schadsoftware Base64-kodierte und verschlüsselte C2-Domain sowie URL-Pfade und eine Kampagnen-ID für die spätere Verwendung entschlüsselt. Dabei\nwird oft eine triviale XOR-Verschlüsselung verwendet.\n\n4\n\nAnschließend werden das %temp%-Verzeichnis, der Computername und der Pfad zur Betriebssystem-Shell (cmd.exe) bestimmt und für die weitere Verwendung in globalen Variablen gespeichert. Im %temp%-Verzeichnis werden im Verlauf der Schadsoftwareausführung alle erzeugten/\nheruntergeladenen Dateien abgelegt. Der Computername wird verwendet, um daraus eine spezifische Opfer-ID zu erzeugen, die in der Kommunikation der Schadsoftware mit dem C2-Server\nzur Identifikation dient.\n\n5\n\nDa die Schadsoftware die Engine des Internet Explorers für die C2-Kommunikation über\nHTTP/HTTPS verwendet, werden vor der ersten Kommunikationsaufnahme diverse Sicherheitseinstellungen des Internet Explorers in der Windows-Registry geändert (siehe Anhang – Registry\nKeys). Zur Änderung der Registry kommt z. B. die PowerShell zum Einsatz.\n\n6\n\nAnschließend wird eine Referenz auf das COM-Interface IWebBrowser2 angelegt, um die C2Kommunikation über die Engine des Internet Explorers zu ermöglichen. Hiermit ist die Initialisierungsphase der Schadsoftware abgeschlossen.\n\nAbbildung 2: Ablauf der Initialisierungsphase von Ketrican\n\nOperationsphase (siehe Abb. 3):\nIn regelmäßigen Abständen sendet die Schadsoftware HTTP/HTTPS-Anfragen an den C2-Server\n(Beacon) (I.) und erwartet als Antwort (II.) die Übermittlung einer HTML-Seite mit speziellen Schlüsselwörtern, z. B. \"nice\" und \"say\", zwischen denen sich die Steuerkommandos in Base64-kodierter und\nverschlüsselter Form befinden.\nDie HTTP/HTTPS-Anfragen enthalten als Parameter in verschlüsselter Form den Computernamen,\ndie zuvor bestimmte Opfer-ID sowie die im Sample enthaltene Kampagnen-ID. Als Verschlüsselung\nkommen AES (im Betriebsmodus CBC) oder XOR zum Einsatz, wobei die notwendigen Schlüssel\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n4\n\nBfV Cyber-Brief\ngleichzeitig übermittelt werden. So wird z. B. bei Verwendung von AES der Schlüssel in den ersten 16\nByte und der Initialisierungsvektor in den letzten 16 Byte der Payload übermittelt. Die Kombination\naus AES-Schlüssel, verschlüsselten Daten und Initialisierungsvektor ist zudem Base64-kodiert.\nDas Steuerkommando des C2-Servers ist auf gleiche Weise verschlüsselt (inkl. zufällig generiertem\nSchlüssel/Initialisierungsvektor) wie die Anfrage.\nDie aufgerufene URL variiert je Anfrage nach einem vorgegebenen Muster in der Pfad-Komponente.\nEin Merkmal scheint der Aufruf von aspx-Dateien zu sein.\n\nAbbildung 3: Operationsphase bzw. Angreifer-gesteuerter Betrieb von Ketrican\n\nKetrican erlaubt über die Steuerkommandos:\n•\n\ndie Ausführung beliebiger übermittelter Kommandos und Dateien mittels cmd.exe\n\n•\n\ndie Ausführung von Dateien mittels API Funktion CreateProcessW()\n\n•\n\ndas Einlesen lokaler Dateien und Übermittelung des Inhalts an den C2-Server\n\n•\n\nden Download von Dateien vom C2-Server\n\n•\n\nÄnderungen des Beacon-Intervalls\n\nErgebnisse von ausgeführten Kommandos oder Dateien werden im %temp%-Verzeichnis in einer\nLogdatei gespeichert, die nach der Übertragung an den C2-Server vom infizierten System gelöscht\nwird. Übermittlungen an den C2-Server erfolgen dabei stets verschlüsselt nach obigem Schema.\nHierbei wird je Übermittlung ein neuer Schlüssel/Initialisierungsvektor verwendet. Wie bei dem Beacon wird ebenfalls die Pfad-Komponente der URL nach einem vorgegebenen Muster variiert. Auch\nhier scheint der Aufruf von aspx-Dateien ein besonderes Merkmal darzustellen.\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n5\n\nBfV Cyber-Brief\n\nMögliche Erhöhung der Sichtbarkeit einer Infektion\nDie eingesetzte Schadsoftware – neben einigen Mechanismen zur Erschwerung der Analyse – wird\nindividuell angepasst. Die durch die Cyberabwehr des Bundesamtes für Verfassungsschutz mit diesem Cyber-Brief bereitgestellte Detektionsregel ermöglicht jedoch eine Erkennung zahlreicher Varianten der Ketrican-Schadsoftwarefamilie. Zudem bietet es sich an, möglicherweise betroffene Systeme auf das Vorhandensein der spezifischen Registry-Einträge zu überprüfen (siehe Anhang – Registry Keys). Diese Registry-Einträge sind zwar als solche legitim, das Auftreten mehrerer der genannten\nKeys in Kombination spricht jedoch mit hoher Wahrscheinlichkeit für eine Infektion mit Ketrican.\n\nHandlungsempfehlung\nDie Cyberabwehr des Bundesamtes für Verfassungsschutz empfiehlt die Überprüfung der eigenen\nNetzwerk-Hosts mit der nachfolgenden Detektionsregel.\nDarüber hinaus bieten wir Ihnen zusätzliche Hintergrundinformationen an. Hierzu stehen wir Ihnen\nunter folgenden Kontaktdaten gerne zur Verfügung:\n\nTel.: 0221-792-2600 oder\nE-Mail: poststelle@bfv.bund.de\nCyberabwehr BfV\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n6\n\nBfV Cyber-Brief\n\nAbbildung nach MITRE ATT&CK5 Schema\nID\n\nTactic\n\nName\n\nT1005\n\nCollection\n\nData from Local System\n\nloioiuKetrican allows to collect the output from the command-line interface as well as the content of files.\n\nT1001\n\nCommand and Control\n\nData Obfuscation\n\nKetrican obfuscates C2 traffic using Base64 encoding and receives C2 commands hidden in a HTML\nbody.\nT1024\n\nCommand and Control\n\nCustom Cryptographic Protocol\n\nKetrican variants encrypt C2 traffic using a XOR cipher.\nT1032\n\nCommand and Control\n\nStandard Cryptographic Protocol\n\nKetrican variants encrypt C2 traffic using AES (in CBC mode).\nT1043\n\nCommand and Control\n\nCommonly Used Port\n\nKetrican uses TCP port 80 or 443 for C2 communication.\nT1071\n\nCommand and Control\n\nStandard Application Layer Protocol\n\nKetrican uses HTTP or HTTPS to contact the C2 server through the Internet Explorer Engine using the\nIWebBrowser2 COM interface.\nT1105\n\nCommand and Control\n\nRemote File Copy\n\nKetrican allows to upload or download files from the C2 server.\nT1132\n\nCommand and Control\n\nData Encoding\n\nKetrican encodes C2 traffic with Base64.\nT1027\n\nDefense Evasion\n\nObfuscated Files or Information\n\nKetrican uses Base64 and XOR cipher to obfuscate strings.\nT1066\n\nDefense Evasion\n\nIndicator Removal from Tools\n\nKetrican samples appear to be compiled and modified for each individual victim. Furthermore,\nKetrican receives regular updates to evade anti-virus detection.\nT1089\n\nDefense Evasion\n\nDisabling Security Tools\n\nKetrican weakens Internet Explorer security settings by changing Registry keys.\nT1107\n\nDefense Evasion\n\nFile Deletion\n\nKetrican deletes files (containing previously collected data) after upload to the C2 server.\nT1112\n\nDefense Evasion\n\nModify Registry\n\nKetrican modifies several Registry keys related to Internet Explorer security.\nT1140\n\nDefense Evasion\n\nDeobfuscate/Decode Files or Information\n\nKetrican uses Base64 and XOR cipher to deobfuscate strings.\n5\n\nURL: https://attack.mitre.org\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n7\n\nBfV Cyber-Brief\n\nID\n\nTactic\n\nName\n\nT1497\n\nDefense Evasion, Discovery\n\nVirtualization/Sandbox Evasion\n\nKetrican uses a combination of delayed activity after start and the API function GetTickCount to evade/detect\na sandbox environment.\n\nT1082\n\nDiscovery\n\nSystem Information Discovery\n\nKetrican collects the computer name and uses it to generate a victim ID.\nT1059\n\nExecution\n\nCommand-Line Interface\n\nKetrican allows to run arbitrary commands on the command-line interface.\nT1086\n\nExecution\n\nPowerShell\n\nKetrican variants use PowerShell commands to modify Registry keys.\nT1106\n\nExecution\n\nExecution through API\n\nKetrican allows to run an application via API utilizing CreateProcessW.\nT1041\n\nExfiltration\n\nExfiltration Over Command and Control Channel\n\nKetrican exfiltrates data over the C2 channel.\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n8\n\nBfV Cyber-Brief\n\nDetektionsregeln\nYara-Regel „Ketrican“ – zur Erkennung verschiedener Varianten der Schadsoftware „Ketrican“\nrule ketrican\n{\nstrings:\n\n$r1=”WarnonZoneCrossing” wide ascii\n$r2=”WarnOnPostRedirect” wide ascii\n$r3=”ShownVerifyBalloon” wide ascii\n\n$r4=”DisableFirstRunCustomize” wide ascii\n\n$r5=”Internet Connection Wizard” wide ascii\n$f21={57 61 72 6e}\n$f22={72 6e 6f 6e}\n$f23={5a 6f 6e 65}\n$f24={43 72 6f 73}\n$f25={73 69 6e 67}\n$f31={72 6E 4F 6E}\n$f32={50 6F 73 74}\n$f33={52 65 64 69}\n$f34={72 65 63 74}\n$f51={53 68 6f 77}\n$f52={6f 77 6e 56}\n$f53={65 72 69 66}\n$f54={79 42 61 6c}\n$f55={6c 6f 6f 6e}\n$f61={44 69 73 61}\n$f62={62 6c 65 46}\n$f63={69 72 73 74}\n$f64={52 75 6e 43}\n$f65={75 73 74 6f}\n$f66={6d 69 7a 65}\n$f71={49 6e 74 65}\n$f72={74 65 72 6e}\n$f73={65 74 20 43}\n$f74={6f 6e 6e 65}\n$f75={63 74 69 6f}\n$f76={6e 20 57 69}\n$f77={7a 61 72 64}\n\n$clsid1 = “0002DF01-0000-0000-C000-000000000046” wide ascii\n\n$clsid2 = {01 DF 02 00 00 00 00 00 C0 00 00 00 00 00 00 46}\n$iid1 = {61 16 0C D3 AF CD D0 11 8A 3E 00 C0 4F C9 E2 6E}\n$iid2 = “D30C1661-CDAF-11D0-8A3E-00C04FC9E26E” wide ascii\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n9\n\nBfV Cyber-Brief\n$s1 = “CoInitialize” wide ascii\n\ncondition:\n\nuint16(0) == 0x5A4D and\nfilesize < 1000KB and\n$s1 and\n(\n\n(4 of ($f2*) and 4 of ($f3*) and 4 of ($f5*) and 5 of ($f6*) and 5 of ($f7*)) or\n4 of ($r*)\n\n) and\n\n(1 of ($clsid*)) and\n}\n\n(1 of ($iid*))\n\nRegistry Keys\n\nHKCU\\Software\\Microsoft\\Internet Connection Wizard\\Completed = 1\n\nHKCU\\Software\\Microsoft\\Internet Explorer\\Main\\Check_Associations = ‘no’\nHKCU\\Software\\Microsoft\\Internet Explorer\\Main\\DEPOff = 1\n\nHKCU\\Software\\Microsoft\\Internet Explorer\\Main\\DisableFirstRunCustomize = 2\nHKCU\\Software\\Microsoft\\Internet Explorer\\PhishingFilter\\Enabled = 1\n\nHKCU\\Software\\Microsoft\\Internet Explorer\\PhishingFilter\\ShownVerifyBalloon = 3\nHKCU\\Software\\Microsoft\\Internet Explorer\\Recovery\\AutoRecover = 2\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\IEHardenIENoWarn = 0\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\WarnOnPostRedirect = 0\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\WarnonBadCertRecving = 0\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\WarnonZoneCrossing = 0\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap\\IEHarden = 0\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\Zones\\3\\2500 = 3\n\nBundesamt für Verfassungsschutz - Cyber-Brief Nr. 01/2020\n\n10",
    "language": "DE",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.verfassungsschutz.de/SharedDocs/publikationen/DE/cyberabwehr/2020-01-bfv-cyber-brief.pdf?__blob=publicationFile&v=9"
    ],
    "report_names": [
        "2020-01-bfv-cyber-brief.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0a03e7f0-2f75-4153-9c4f-c46d12d3962e",
            "created_at": "2022-10-25T15:50:23.453824Z",
            "updated_at": "2025-03-27T02:00:55.473216Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "Ke3chang",
                "APT15",
                "Vixen Panda",
                "GREF",
                "Playful Dragon",
                "RoyalAPT",
                "Nylon Typhoon"
            ],
            "source_name": "MITRE:Ke3chang",
            "tools": [
                "Okrum",
                "Systeminfo",
                "netstat",
                "spwebmember",
                "Mimikatz",
                "Tasklist",
                "MirageFox",
                "Neoichor",
                "ipconfig"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7c8cf02c-623a-4793-918b-f908675a1aef",
            "created_at": "2023-01-06T13:46:38.309165Z",
            "updated_at": "2025-03-27T02:00:02.801298Z",
            "deleted_at": null,
            "main_name": "APT15",
            "aliases": [
                "BRONZE PALACE",
                "Nylon Typhoon",
                "VIXEN PANDA",
                "Playful Dragon",
                "BRONZE DAVENPORT",
                "BRONZE IDLEWOOD",
                "G0004",
                "Red Vulture",
                "Ke3Chang",
                "Metushy",
                "Lurid",
                "Social Network Team",
                "Royal APT"
            ],
            "source_name": "MISPGALAXY:APT15",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7d5531e2-0ad1-4237-beed-af009035576f",
            "created_at": "2024-05-01T02:03:07.977868Z",
            "updated_at": "2025-03-27T02:05:17.283109Z",
            "deleted_at": null,
            "main_name": "BRONZE PALACE",
            "aliases": [
                "BRONZE DAVENPORT ",
                "BRONZE IDLEWOOD ",
                "CTG-9246 ",
                "Ke3chang ",
                "Playful Dragon",
                "Vixen Panda ",
                "APT15 "
            ],
            "source_name": "Secureworks:BRONZE PALACE",
            "tools": [
                " BS2005",
                " Enfal",
                " Mirage",
                " RoyalCLI",
                " RoyalDNS",
                "BMW"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b1b76b-16da-4c4f-8b32-f6fede3eda8c",
            "created_at": "2022-10-25T16:07:23.750796Z",
            "updated_at": "2025-03-27T02:02:09.961401Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "APT 15",
                "BackdoorDiplomacy",
                "Bronze Davenport",
                "Bronze Idlewood",
                "Bronze Palace",
                "CTG-9246",
                "GREF",
                "Ke3chang",
                "Metushy",
                "Nylon Typhoon",
                "Operation Ke3chang",
                "Operation MirageFox",
                "Playful Dragon",
                "Playful Taurus",
                "Red Vulture",
                "Royal APT",
                "Social Network Team",
                "Vixen Panda"
            ],
            "source_name": "ETDA:Ke3chang",
            "tools": [
                "Agentemis",
                "Anserin",
                "BS2005",
                "BleDoor",
                "CarbonSteal",
                "Cobalt Strike",
                "CobaltStrike",
                "DarthPusher",
                "DoubleAgent",
                "EternalBlue",
                "GoldenEagle",
                "Graphican",
                "HenBox",
                "HighNoon",
                "IRAFAU",
                "Ketrican",
                "Ketrum",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MS Exchange Tool",
                "Mebroot",
                "Mimikatz",
                "MirageFox",
                "NBTscan",
                "Okrum",
                "PluginPhantom",
                "PortQry",
                "ProcDump",
                "PsList",
                "Quarian",
                "RbDoor",
                "RibDoor",
                "Royal DNS",
                "RoyalCli",
                "RoyalDNS",
                "SAMRID",
                "SMBTouch",
                "SilkBean",
                "Sinowal",
                "SpyWaller",
                "Theola",
                "TidePool",
                "Torpig",
                "Turian",
                "Winnti",
                "XSLCmd",
                "cobeacon",
                "nbtscan",
                "netcat",
                "spwebmember"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1670155152,
    "ts_updated_at": 1743041810,
    "ts_creation_date": 1591701727,
    "ts_modification_date": 1591701727,
    "files": {
        "pdf": "https://archive.orkl.eu/27384196bb9a4e55226c8a840876ea99c89b1261.pdf",
        "text": "https://archive.orkl.eu/27384196bb9a4e55226c8a840876ea99c89b1261.txt",
        "img": "https://archive.orkl.eu/27384196bb9a4e55226c8a840876ea99c89b1261.jpg"
    }
}