{
    "id": "045de474-8b5d-462b-80fc-7ac73993ed97",
    "created_at": "2023-01-12T15:02:01.010202Z",
    "updated_at": "2025-03-27T02:05:35.034036Z",
    "deleted_at": null,
    "sha1_hash": "5e1ffe608e0759791cfdafd840e36e65ce5c683a",
    "title": "2019-06-03 - GandCrab ransomware operators put in retirement papers",
    "authors": "",
    "file_creation_date": "2022-05-28T17:06:16Z",
    "file_modification_date": "2022-05-28T17:06:16Z",
    "file_size": 225806,
    "plain_text": "# GandCrab ransomware operators put in retirement papers\n\n**[scmagazine.com/home/security-news/ransomware/gandcrab-ransomware-operators-put-in-retirement-papers/](https://www.scmagazine.com/home/security-news/ransomware/gandcrab-ransomware-operators-put-in-retirement-papers/)**\n\nJune 3, 2019\n\nDoug [OlenickJune 3, 2019](https://www.scmagazine.com/author/doug-olenick)\nAfter operating for about 18 months, the RaaS gang operating under the name GandCrab\nhas announced it has cashed out of the game and has retired.\n\nGandCrab’s operators posted a message on a dark web forum indicating the group had\nmade more than $2 billion with its RaaS operation, had laundered the money and was\n[planning a life of leisure, ZD Net reported.](https://www.zdnet.com/article/gandcrab-ransomware-operation-says-its-shutting-down/)\n\n[GandCrab uses various exploit kits to deliver a wide variety of malware, including](https://www.scmagazine.com/?s=Gandcrab&orderby=date&order=desc)\n[ransomware and](https://www.scmagazine.com/home/security-news/ransomware/rig-and-grandsoft-exploit-kits-shell-out-new-gandcrab-ransomware/) [cryptocurrency mining malware, and has undergone several upgrades and](https://www.scmagazine.com/home/security-news/malware/cryptocurrency-mining-malware-usage-continues-climbing/)\nrevisions since it was rolled out in January 2018.\n\nThe retirement notice said the group would stop operations within a month and at that time it\nwould delete all its decryptor keys essentially stranding any victims who have not yet paid.\n\nSherrod DeGrippo, ProofPoint’s senior director of threat research and detection, told SC\nMedia she has noticed a steady decline in the volume and frequency of the ransomware over\nthe last few weeks, mainly small campaigns involving Sodinokibi ransomware, but she noted\nGandCrab’s retirement move is something being seen more often.\n\n\n-----\n\nThis appears to be a case of actors getting out while they are still on top. While malware\nstrains often come and go, we have seen some cybercriminals announce their ‘retirement’\nsuch as the actor behind the Zeus banking Trojan. Interestingly, this actor returned to the\nscene later with an updated version of the malware,” she said.\n\nDeGrippo noted the GandCrab portal is still active and will likely remain so as affiliates cash\nout their earnings.\n\nPierluigi Stella, CTO of Network Box USA, offered several reasons why the GandCrab folks\ndecided to hang up their hats ranging from having a bit more intelligence than other criminals\nto the possible fact that ransomware may becoming less of a threat due to better defensive\nmethods.\n\n“Are they actually 'giving up' or have they made enough money that they don't need to\ncontinue risking being caught? Hackers usually get caught only when they get greedy and\ndon't know when to stop. This group seems to be smarter - they have made enough money,\nhaven't been caught, and are retiring at the height of their career,” Stella said.\n\nMalwarebytes Malware Intelligence Analyst Marcelo Rivero, called the move a suprise and\nthat \"Considering their history of jokes and irony we probably should wait for those 20 days\nto see what really happens.\"\n\nAlthough many companies, municipalities and other types of organizations are frequently\nvictimized, Stella said, “Personally, I am not aware of any of our clients ever actually getting\nransomware. And, disaster recovery procedures now cover ransomware as a possible case\nof disaster. Therefore, it is possible that ransomware is becoming less lucrative and this\ngroup is getting out while they're still \"on top\", maybe because they are going to focus on\nsomething else, i.e. cryptojacking.”\n\nOthers do not believe the GandCrab actors are giving up their day job.\n\n“It is astonishing to read that a cybergang has made so much money they are retiring, and\nthey are publicly announcing it. They are thumbing their noses at all of us. I wouldn’t believe\na word of it, though – I would imagine it would be hard to stop, and they will likely resurface\nsoon in another form, helping crooks damage unprotected businesses,” said Dan Tuchler,\nCMO at SecurityFirst.\n\nRivero added, \"Generally they do not usually retire until they are arrested (there are also the\nso-called \"Exit Scams\") or they simply leave the game without prior announcement as in this\ncase.\"\n\nDoug [Olenick](https://www.scmagazine.com/author/doug-olenick)\n\n\n-----\n\n## Related\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-03 - GandCrab ransomware operators put in retirement papers.pdf"
    ],
    "report_names": [
        "2019-06-03 - GandCrab ransomware operators put in retirement papers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535721,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653757576,
    "ts_modification_date": 1653757576,
    "files": {
        "pdf": "https://archive.orkl.eu/5e1ffe608e0759791cfdafd840e36e65ce5c683a.pdf",
        "text": "https://archive.orkl.eu/5e1ffe608e0759791cfdafd840e36e65ce5c683a.txt",
        "img": "https://archive.orkl.eu/5e1ffe608e0759791cfdafd840e36e65ce5c683a.jpg"
    }
}