{
    "id": "04caa5e3-892a-4322-b70e-981336f89a3f",
    "created_at": "2023-01-12T15:09:11.922929Z",
    "updated_at": "2025-03-27T02:06:09.78792Z",
    "deleted_at": null,
    "sha1_hash": "7d834126fb5622e7e86067518d36b769407034b5",
    "title": "2021-05-11 - DarkSide Ransomware Links to REvil Group Difficult to Dismiss",
    "authors": "",
    "file_creation_date": "2022-05-28T00:43:38Z",
    "file_modification_date": "2022-05-28T00:43:38Z",
    "file_size": 97730,
    "plain_text": "# DarkSide Ransomware Links to REvil Group Difficult to Dismiss\n\n**[flashpoint-intel.com/blog/darkside-ransomware-links-to-revil-difficult-to-dismiss/](https://www.flashpoint-intel.com/blog/darkside-ransomware-links-to-revil-difficult-to-dismiss/)**\n\nMay 11, 2021\n\n[Blogs](https://www.flashpoint-intel.com/blog)\n\nBlog\n\nThe first report of a DarkSide ransomware attack came on August 10, 2020, with even early\nreports finding the ransomware to be highly customized with lucrative, million-dollar payouts\nfrom large corporate targets in finance, technology, and manufacturing industries. On that\nsame day, August 10th, the DarkSide actors launched their associated DarkSide website on\nTor.\n\n## Key Takeaways from Recent DarkSide Ransomware Events:\n\n1. On May 10, 2021, the U.S. Federal Bureau of Investigation (FBI) issued a statement\n\nconfirming that “the [DarkSide ransomware is responsible for the compromise of the](https://www.fbi.gov/news/pressrel/press-releases/fbi-statement-on-compromise-of-colonial-pipeline-networks)\nColonial Pipeline networks,” with its pipeline systems taken offline since Friday, May 7,\n2021.\n2. “DarkSide” is a ransomware strain that was originally developed by Russian-speaking\n\nthreat actors and has been active since August 2020. The ransomware is highly\ncustomized, designed to target large corporations in select industry verticals,\nparticularly those in finance, technology, and manufacturing.\n\n\n-----\n\n3. Flashpoint assesses with moderate confidence that the ransomware is a variant of\n\n“REvil” ransomware and is based on its code.\n4. DarkSide ransom payment demands range widely from $200,000 to $2,000,000,\n\ndepending on the size and possibly other associated characteristics of the targeted\norganization.\n5. When DarkSide victims refuse to pay the ransom demand, the ransomware group\n\nfollows through on its threat, releasing victims’ sensitive data on publicly visible\nwebsites\n\n\nransomware-lock-chain\n\n\n## What Is DarkSide Ransomware and Where Did It Come From?\n\nThe first report of a DarkSide ransomware attack came on August 10, 2020, with even early\nreports finding the ransomware to be highly customized with lucrative, million-dollar payouts\nfrom large corporate targets in finance, technology, and manufacturing industries. On that\n\n\n-----\n\nsame day, August 10th, the DarkSide actors launched their associated DarkSide website on\nTor.\n\nDarkSide uses Salsa20 and RSA-1024 to encrypt victims’ files on Windows OS. It also\nallegedly comes in a version for Linux, although no samples are publicly available. The Linux\nversion is said to be written in C++ and to use ChaCha20 and RSA-4096 for file encryption.\n\nVarious industry reports suggest that the ransomware not only encrypts victims data, but also\npropagates laterally on the network and steals sensitive information from affected machines.\nIf victims refuse to pay, their data is posted publicly on the DarkSide Tor website and offered\nfor download. Although there is no publicly available information about the infection vector,\nbecause the attacks are highly specific, compromised Remote Desktop Protocol (RDP)\nservers and custom phishing attacks are two highly plausible options.\n\n[Learn more about Flashpoint Threat Response and Readiness offerings and how](https://www.flashpoint-intel.com/threat-response-and-readiness/)\nFlashpoint prepares and actively supports organizations to respond to any ransomware\nattack.\n\n## Operators Quickly Expand DarkSide to Ransomware-as-a-Service (RaaS) Model\n\nThe first DarkSide ransomware attacks were all owner-operated, but after a few successful\nmonths, the owners began to expand their operations. On November 10, DarkSide operators\nannounced on Russian-language forums XSS and Exploit the formation of their new\nDarkSide affiliate program providing partners with a modified form of their DarkSide\nransomware to make use in their own operations.\n\nIt’s worth noting that DarkSide actors have pledged in the past to not attack organizations in\nthe medical, education, nonprofit, or government sectors. At one point, they also advertised\nthat they donate a portion of their profit to charities. However, neither claim has been verified\nand should be met with a heightened degree of scrutiny; these DarkSide operators would be\nfar from the first cybercriminals to make such claims and not follow through.\n\n## DarkSide Operators Likely Former “REvil” Affiliates\n\nFlashpoint assesses with moderate confidence that the threat actors behind DarkSide\nransomware are of Russian origin and are likely former affiliates of the [“REvil” RaaS group.](https://www.flashpoint-intel.com/cybercrime/revil-moves-to-ransomware-as-a-service/)\nSeveral facts support this attribution:\n\nSpelling mistakes in the ransom note and grammatical constructs of the sentences\nsuggest that the writers are not native English speakers.\nThe malware checks the default language of the system to avoid infecting systems\nbased in the countries of the former Soviet Union.\n\n\n-----\n\nThe design of the ransom note, wallpaper, file encryption extension and details, and\ninner workings bear similarities to “REvil” ransomware, which is of Russian origin and\nhas an extensive affiliate program. This shows the evolution path of this ransomware\nand ties it to other Russian-origin ransomware families.\nThe affiliate program is offered on Russian-language forums XSS and Exploit.\n\n## Prepare for Ransomware with Flashpoint\n\n**[Request a demo today and see firsthand how Flashpoint’s](https://go.flashpoint-intel.com/blog/request-a-demo/)** Threat Response and\nReadiness offerings ensure your entire team is prepped and able to respond to any\nransomware attack. And when equipped with Flashpoint Intelligence Platform and our\ndedicated, prebuilt ransomware dashboards, you move a step ahead of ransomware attacks\nand the cybercriminal groups who use them.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-11 - DarkSide Ransomware Links to REvil Group Difficult to Dismiss.pdf"
    ],
    "report_names": [
        "2021-05-11 - DarkSide Ransomware Links to REvil Group Difficult to Dismiss.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536151,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653698618,
    "ts_modification_date": 1653698618,
    "files": {
        "pdf": "https://archive.orkl.eu/7d834126fb5622e7e86067518d36b769407034b5.pdf",
        "text": "https://archive.orkl.eu/7d834126fb5622e7e86067518d36b769407034b5.txt",
        "img": "https://archive.orkl.eu/7d834126fb5622e7e86067518d36b769407034b5.jpg"
    }
}