{
    "id": "04e16bec-8a34-42b1-adba-57a4c4d352bb",
    "created_at": "2023-01-12T15:09:07.663605Z",
    "updated_at": "2025-03-27T02:16:01.102753Z",
    "deleted_at": null,
    "sha1_hash": "2a0640c82ee4840c75b857f2048be31f17ca942a",
    "title": "2015-11-10 - Bookworm Trojan- A Model of Modular Architecture",
    "authors": "",
    "file_creation_date": "2022-10-02T12:10:38Z",
    "file_modification_date": "2022-10-02T12:10:38Z",
    "file_size": 799822,
    "plain_text": "# Bookworm Trojan: A Model of Modular Architecture\n\n**[unit42.paloaltonetworks.com/bookworm-trojan-a-model-of-modular-architecture/](https://unit42.paloaltonetworks.com/bookworm-trojan-a-model-of-modular-architecture/)**\n\nRobert Falcone, Mike Scott, Juan Cortes November 10, 2015\n\nBy [Robert Falcone,](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Mike Scott and](https://unit42.paloaltonetworks.com/author/mike-scott/) [Juan Cortes](https://unit42.paloaltonetworks.com/author/juan-cortes/)\n\nNovember 10, 2015 at 11:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Threat Prevention,](https://unit42.paloaltonetworks.com/category/threat-prevention-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Bookworm,](https://unit42.paloaltonetworks.com/tag/bookworm/) [KBLogger,](https://unit42.paloaltonetworks.com/tag/kblogger/) [PlugX,](https://unit42.paloaltonetworks.com/tag/plugx/) [RAT,](https://unit42.paloaltonetworks.com/tag/rat/) [Trojan](https://unit42.paloaltonetworks.com/tag/trojan/)\n\nRecently, while researching attacks on targets in Thailand, Unit 42 discovered a tool that\ninitially appeared to be a variant of the well-known PlugX RAT based on similar observed\nbehavior such as the usage of DLL side-loading and a shellcode file. After closer inspection,\nit appears to be a completely distinct Trojan, which we have dubbed Bookworm and track in\n[Autofocus using the tag Bookworm.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Bookworm)\n\nBookworm’s functional code is radically different from PlugX and has a rather unique\nmodular architecture that warranted additional analysis by Unit 42. Bookworm has little\nmalicious functionality built-in, with its only core ability involving stealing keystrokes and\nclipboard contents. However, Bookworm expands on its capabilities through its ability to load\nadditional modules directly from its command and control (C2) server. This blog will provide\nan analysis of the Bookworm Trojan and known indicators of compromise. A later blog will\nexplore the associated attack campaigns and attributions surrounding Bookworm.\n\n## Bookworm: Chapter One\n\nSo far, it appears threat actors have deployed the Bookworm Trojan primarily in attacks on\ntargets in Thailand. Bookworm has many layers (see Figure 1) that increase the complexity\nof its overall architecture. To make matters worse, the author used multiple algorithms not\nonly to encrypt and decrypt files saved to the system, but also to encrypt and decrypt\nnetwork communications between Bookworm and its C2 servers (known servers are listed in\nthe Indicators of Compromise section near the end of this post).\n\n## Layered Loading Approach\n\n[The threat actors use a commercial installation tool called Smart Installer Maker to](http://www.sminstall.com/)\nencapsulate and execute a self-extracting RAR archive and in some cases a decoy\nslideshow or Flash installation application. The self-extracting RAR writes a legitimate\n\n\n-----\n\nexecutable, an actor-created DLL called Loader.dll and a file named readme.txt to the\nfilesystem and then executes the legitimate executable.\n\n\n-----\n\n-----\n\n**Figure 1 Architecture of Bookworm**\n\nThus far, the actors deploying bookworm have used the legitimate executables Microsoft\nMalware Protection (MsMpEng.exe) and Kaspersky Anti-Virus (ushata.exe) to perform DLL\nside-loading and load the Loader.dll. Loader.dll decrypts the readme.txt file using a three\nbyte XOR algorithm with 0xd07858 as a key, which results in shellcode that is responsible for\ndecrypting the remainder of readme.txt containing the actual Bookworm Trojan. The\nshellcode then loads Bookworm by manually loading another DLL named “Leader.dll”\nembedded in the decrypted readme.txt and passes a buffer to Leader.dll containing\nadditional DLLs. Leader.dll is the main component of Bookworm, which will we refer to as\n“Leader” for the remainder of this blog.\n\nThe initial execution of Leader results in the installation of Bookworm. The installation\nprocess involves moving the legitimate executable and actor-created DLL to a new location.\nBookworm also creates an additional file in this new location that has the same filename as\nthe actor-created DLL but with no file extension. Figures 2 and 3 shows the newly created\nfiles based on the legitimate application used to side-load the actor created DLL.\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\DeviceSync\\MsMpEng.exe_\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\DeviceSync\\MpSvc.dll_\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\DeviceSync\\MpSvc_\n\n**Figure 2 Files created if the Microsoft Malware Protection was used to Sideload the**\n**DLL**\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\DeviceSync\\ushata.exe_\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\DeviceSync\\ushata.dll_\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\DeviceSync\\ushata_\n\n**Figure 3 Files created if the Kaspersky Antivirus application was used to Sideload the**\n**DLL**\n\n\n-----\n\nAfter this process is completed, Bookworm changes how it loads itself, now reading the\nnewly created file “MpSvc” or “ushata” instead of readme.txt. The newly created file is\nencrypted with RC4 using the contents of the following registry value as its key:\n\n_HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Internet Explorer\\Registration\\ProductID_\n\nThe decrypted contents of this new file contain a path to the following file:\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\Crypto\\RSA\\MachineKeys\\sgkey.data_\n\nThe sgkey.data file contains the shellcode from readme.txt that loads the Bookworm\nmodules, but instead of being encrypted with the three byte XOR algorithm like readme.txt,\nsgkey.data is encrypted with RC4 using the “ProductID” value as the key. The installation\nprocess finishes with the creation of a service named “Microsoft Windows DeviceSync\nService”, which results in the addition of registry keys listed in Figure 4, which will run\nBookworm when the system starts.\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\Type: 0x00000120_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\Start: 0x00000002_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\ErrorControl: 0x00000001_\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\ImagePath: \"C:\\Documents and_\n_Settings\\All Users\\Application Data\\Microsoft\\DeviceSync\\MsMpEng.exe\"_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\DisplayName: \"Microsoft Windows_\n_DeviceSync Service\"_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\ObjectName: \"LocalSystem\"_\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Services\\DeviceSync\\Description: \"Allows USB devices_\n_to be hosted on this computer. If this service is stopped, any hosted USB devices will_\n_stop functioning and no additional hosted devices can be added. If this service is disabled,_\n_any services that explicitly depend on it will fail to start.\"_\n\n**Figure 4 Registry Keys Resulting from the Creation of the Bookworm Service**\n\n## Bookworm Modules\n\nLeader is Bookworm's main module and controls all of the activities of the Trojan, but relies\non the additional DLLs to provide specific functionality. The developers of Bookworm use\nthese modules in a rather unique way, as the other embedded DLLs provide API functions\nfor Leader to carry out its tasks. To load additional modules, Leader parses the buffer passed\nto it by the shellcode in readme.txt for the other DLLs, which exist in the following structure:\n\n_struct embedded_dll {_\n\n_DWORD dll_identifier;_\n\n_DWORD length_of_dll;_\n\n\n-----\n\n_char[length_of_dll] embedded_dll;_\n_};_\n\nTable 1 contains all of the embedded DLLs in each Bookworm sample, their ID numbers, and\na description of the functionality of each DLL’s API functions provided to Leader. It should be\nnoted that Bookworm does not write any of these DLLs to the filesystem, as the Trojan\noperates entirely in memory.\n\n\n**Name** **DLL**\n**ID #**\n\n\n**Description**\n\n\nLeader.dll 0x5 Main module. Communicates with the C2 server and other\nactivities by interacting with other modules in this table.\n\nResolver.dll 0x1 Used to resolve C2 server locations.\n\nMover.dll 0x2 Moves the Bookworm files from the RAR archive to a new folder\nand runs it from the new location. Only used on initial infection\nduring installation.\n\nCoder.dll 0xA Used to carry out RC4 encryption and decryption, base64\nencoding and decoding and the generation of CRC32 hashes of\ndata.\n\nDigest.dll 0xB Used to generate MD5 hashes of data.\n\nAES.dll 0xC Used to encrypt and decrypt data using AES.\n\nNetwork.dll 0xE Sets the network interface into promiscuous mode and gathers\nnetwork traffic for traffic destined to the system to receive data\nfrom C2 responses. Also provides the ability to send data to the\nC2 as well.\n\nHTTP.dll 0x13 Used to create HTTP Requests to send to the C2.\n\nWinINetwork.dll 0x17 Used to interact with the C2 server, specifically by sending HTTP\nGET and POST requests.\n\nKBLogger.dll N\\A Key logger that records keystrokes and the contents saved to the\nclipboard.\n\n**Table 1 Bookworm's Embedded Modules with their Corresponding Identification**\n**Number and a Brief Description**\n\nLeader loads each DLL into memory and then resolves an exported function named\n\"ProgramStartup\" within the loaded DLL. Leader then uses the \"dll_identifier\" (DLL ID # in\nTable 1) value to determine the appropriate arguments to send to the DLL when calling the\nProgramStartup function. Leader then passes a pointer to a structure to each loaded DLL\nwith each DLL receiving a different offset that it will set with addresses of its internal\n\n\n-----\n\nfunctions. The purpose of passing a structure to each DLL is to populate one large structure\nthat allows Leader to call specific functions within each DLL, which is very similar\nconceptually to the import address table of a portable executable. Figure 5 below visualizes\nthis concept, showing Leader calling example functions in the Bookworm modules to carry\nout various tasks.\n\n**Figure 5 Visualization of Leader using other Bookworm Modules’ API Functions to**\n**Carry out Tasks**\n\nBy using this type of modular framework, the developers of Bookworm have made static\nanalysis of the Trojan quite challenging. To perform static analysis of Bookworm, an analyst\nmust recreate the structure used by Leader to store the API functions of each DLL and apply\nthem throughout the entire Trojan. Without performing this task, an analyst would be unable\nto determine which API function Leader calls within the supporting DLLs. For example,\nFigure 6 below shows a code block within Leader that is responsible for encrypting a buffer\nusing functions within the AES module; however, the red, blue, and green boxes show calls\nto functions based on an offset in a structure.\n\n\n-----\n\n**Figure 6 Bookworm Calling API Functions using an Offset to its Structure**\n\nAt first glance, an analyst would be unable to determine the purpose of the code block\ndisplayed in Figure 6, as the functions called are not readily apparent. By creating a structure\nand populating it with the correct API functions however, an analyst can determine the API\nfunctions called in this code block. In Figure 7 below, the red, blue and green boxes show\ncalls to three functions within the AES module that allow Leader to encrypt data using the\nAES algorithm.\n\n**Figure 7 Applying Bookworm's API Structure Exposes the API Functions Called**\n\n\n-----\n\nNot only does this modular approach require an analyst to create a structure, but it also\ntakes away an analyst’s ability to use cross references (XREFs) on the API functions within\nthe supporting modules. Using XREFs during static analysis is a common technique to\nquickly find where functions of interest are called. An analyst cannot use this method to find\nwhere Leader is calling specific Bookworm APIs because the functions are not called\ndirectly; rather they are called based on the structure offset. We are unsure if the developers\nof Bookworm created this as an analysis hurdle, but it certainly contributes to anti-analysis\ntactics.\n\n## Bookworm’s Capabilities\n\nAlthough the developers of Bookworm have included only keylogging functionality in\nBookworm as a core ability, as suggested in Table 1, several of the embedded DLLs provide\nLeader with cryptographic and hashing functions, while others support Leader’s ability to\ncommunicate with its C2 server. The developers designed Bookworm to be a modular Trojan\nnot limited to just the initial architecture of the Trojan, as Bookworm can also load additional\nmodules provided by the C2 server. The ability to load additional modules from the C2\nextends the capabilities of the Trojan to accommodate any activities the threat actors need to\ncarry out on the compromised system.\n\n## Key Logging Functionality\n\nThe KBLogger.dll module, which we will refer to as KBLogger, provides key logging and\nclipboard grabbing functionality and is the only Bookworm module that does not provide\nLeader with API functions. Instead, Leader creates a new process\n“C:\\WINDOWS\\System32\\dllhost.exe –user” that it injects itself into and uses to execute the\nKBLogger functionality.\n\nKBLogger runs on its own by creating a new window called “DolefulClass<username>\n<PID>”, which is hidden so it is invisible to the user. The new window executes code that will\ncreate the following folder to store files that contain logged keystrokes and stolen clipboard\ncontents:\n\n_%AllUsersProfile%\\Application Data\\Microsoft\\Crypto\\RSA\\MachineKeys\\<crc32 hash>bk_\n\nKBLogger captures keystrokes typed by the user and saves them to a file in the folder\nabove. KBLogger also specifically monitors for the keystroke combinations “Control + C”,\n“Control + V” and “Control + X” that it uses as triggers to copy the contents of the clipboard to\na file. The keystrokes and clipboard contents are encrypted before KBlogger saves them to\nthe file system using the RC4 algorithm using a key derived from the value at the following\nregistry key:\n\n_HKLM\\SOFTWARE\\Microsoft\\Internet Explorer\\Registration\\ProductID_\n\n\n-----\n\nKBLogger will generate the key for the RC4 algorithm by using XOR and an eight-byte key\n(specifically 0x6E, 0x30, 0xD0, 0x30, 0xB9, 0x30, 0xB1, 0x30) on the value of the above\nregistry key. KBLogger creates files with the naming format “<username XOR with 2 byte key\n0x5878>_<seconds since EPOCH>” to store the captured keystrokes and clipboard. For\nexample, on November 3, 2015, we saw the following file created during by KBLogger on an\nanalysis system with a username of “administrator”:\n\n_191c351136112b0c2a192c172a_56391E90_\n\n## C2 Communications and Additional Modules\n\nBookworm uses a state machine to keep track of and carry out communications between the\ncompromised system and the C2 server. Also, Bookworm uses a combination of encryption\nand compression algorithms to obfuscate the traffic between the system and C2 server. We\nhave seen the following encryption and compression methods used at various stages and in\ndiffering combinations in the C2 communications:\n\nRC4\nAES\nXOR with 0x5a\nLZO\n\nBookworm first creates an HTTP request that acts as a network beacon to notify the C2 of\nthe compromised system. The initial network beacon is either an HTTP GET or POST\nrequest, which varies between Bookworm samples. Unit 42 analyzed the contents of a\nbeacon seen in Figure 8, which was sent to a URL that follows a structure of \"http://<c2\nserver>:<port>/0<crc32 hash of tick count><tick count><encrypted data>\". The encrypted\ndata in the URL is a 32 character string (16 hexadecimal bytes) created by RC4 and AES\nencrypting an empty data buffer using the tick count and crc32 hash of the tick count as a\nkey.\n\n**Figure 8 Initial C2 Beacon from Bookworm sample**\n**8ae2468d3f208d07fb47ebb1e0e297d7**\n\nSubsequent HTTP POST requests from Bookworm to the C2 server include campaign\nidentifier and system uptime. The data in the HTTP POST has a structure of\n“\\x03\\x04<campaign code>\\x00<system uptime>”. Leader then compresses this string using\nthe LZO compression algorithm and compares the compressed length to the original string\nlength Leader uses the shorter of the two strings and appends it to a DWORD that is the\n\n\n-----\n\nsize of the data and encrypts the combined string using AES with a key of 0123456789 and\nXOR with a key of 0x5a. We believe the threat actors use the data in these POST requests\nto map the compromised system to the appropriate campaign and to filter out analysis\nsystems. In our follow-up blog we will further discuss the campaign codes identified in our\nanalysis.\n\nThe threat actors also deliver additional modules to Bookworm via C2 communications. To\nload additional modules into Bookworm, Leader parses C2 responses for data that have the\nfollowing structure:\n\n<MD5 of cleartext of module><encrypted module>\n\nLeader skips the first 16 bytes and RC4 decrypts the remaining data with the key\n\"0123456789\". It then computes the MD5 hash of the resulting cleartext and checks this\nhash with the MD5 in the first 16 bytes of the C2 response data to see if it is the same. If the\nMD5 hashes match, then the code will carry out further checks on the decrypted data to\ndetermine if the data is a new DLL for Leader to load as an additional module. At this time,\nUnit 42 has not seen a Bookworm C2 server provide additional modules via network\ncommunications. By performing static analysis on Leader.dll, we know that Leader will load\nthe additional modules and attempt to call \"ProgramStartup\" and \"QueryBuffer\" functions\nexported by the DLLs.\n\n## Conclusion\n\nWhile we did not discuss the surrounding attacks using Bookworm in detail, we have\nobserved threat actors deploying Bookworm primarily in attacks on targets in Thailand. The\ndevelopers of Bookworm have gone to great lengths to create a modular framework that is\nvery flexible through its ability to run additional modules directly from its C2 server. Not only\nis this tool highly capable, but it also requires a very high level of effort to analyze due to its\nmodular architecture and its use of API functions within the additional modules. We believe\nthat it is likely threat actors will continue development Bookworm, and will continue to use it\nfor the foreseeable future.\n\n## Indicators of Compromise\n\n File Names\n\nsgkey.data\n\n## Known Bookworm C2 Servers\n\nbkmail.blogdns[.]com\ndebain.servehttp[.]com\n\n\n-----\n\nlinuxdns.sytes[.]net\nnews.nhknews[.]hk\nsswmail.gotdns[.]com\nsswwmail.gotdns[.]com\nsysnc.sytes[.]net\nsysteminfothai[.]gotdns.ch\nthailandbbs.ddns[.]net\nubuntudns.sytes[.]net\nweb12.nhknews[.]hk\n\n## Bookworm Smart Install Maker Samples\n\n0f41c853a2d522e326f2c30b4b951b04\n8ae2468d3f208d07fb47ebb1e0e297d7\n35755a6839f3c54e602d777cd11ef557\n87d71401e2b8978c2084eb9a1d59c172\n599b6e05a38329081b80a461b57cec37\nba1aea40182861e1d1de8c0c2ae78cb7\nde1595a7585219967a87a909f38acaa2\nf8c8c6683d6ca880293f7c1a78d7f8ce\n0b4ad1bd093e0a2eb8968e308e900180\ncba74e507e9741740d251b1fb34a1874\nfcd68032c39cca3385c539ea38914735\n3e69c34298a8fd5169259a2fef506d63\n\n## Bookworm Self-Extracting RAR Samples\n\n04d63e2a3da0a171e5c15d8e904387b9\n0d57d2bef1296be62a3e791bfad33bcd\n4389fc820d0edd96bac26fa0b7448aee\n74c293acdda0d2c3b5087763dae27ec6\nb030c619bb24804cbcc05065530fcf2e\n29df124f370752a87b3426dcad539ec6\n9df45e8d8619e234d0449daf2f617ba3\n40f1b160b88ff98934017f3f1e7879a5\n210816c8bde338bf206f13bb923327a1\n187cdb58fbc30046a35793818229c573\n0b4ad1bd093e0a2eb8968e308e900180\n499ccc8d6d7c08e135a91928ccc2fd7a\n5e4852c8e5ef3cbceb69a9bc3d554d6c\n5282b503b061eaa843c0bcda1c74b14f\n\n\n-----\n\n**Get updates from**\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-11-10 - Bookworm Trojan- A Model of Modular Architecture.pdf"
    ],
    "report_names": [
        "2015-11-10 - Bookworm Trojan- A Model of Modular Architecture.pdf"
    ],
    "threat_actors": [
        {
            "id": "8386d4af-5cca-40bb-91d7-aca5d1a0ec99",
            "created_at": "2022-10-25T16:07:23.414558Z",
            "updated_at": "2025-03-27T02:02:09.787347Z",
            "deleted_at": null,
            "main_name": "Bookworm",
            "aliases": [],
            "source_name": "ETDA:Bookworm",
            "tools": [
                "Agent.dhwf",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Scieron",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "ffrat",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536147,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1664712638,
    "ts_modification_date": 1664712638,
    "files": {
        "pdf": "https://archive.orkl.eu/2a0640c82ee4840c75b857f2048be31f17ca942a.pdf",
        "text": "https://archive.orkl.eu/2a0640c82ee4840c75b857f2048be31f17ca942a.txt",
        "img": "https://archive.orkl.eu/2a0640c82ee4840c75b857f2048be31f17ca942a.jpg"
    }
}