{
    "id": "04e2e129-1fb5-4ccd-b7da-623f76fd6f55",
    "created_at": "2023-01-12T15:02:00.567261Z",
    "updated_at": "2025-03-27T02:05:39.456131Z",
    "deleted_at": null,
    "sha1_hash": "515b79a881e24d3984ce185525d0da8e17ba50c1",
    "title": "2021-08-12 - Gootloader’s “mothership” controls malicious content",
    "authors": "",
    "file_creation_date": "2022-05-28T21:41:58Z",
    "file_modification_date": "2022-05-28T21:41:58Z",
    "file_size": 2307672,
    "plain_text": "# Gootloader’s “mothership” controls malicious content\n\n**[news.sophos.com/en-us/2021/08/12/gootloaders-mothership-controls-malicious-content/](https://news.sophos.com/en-us/2021/08/12/gootloaders-mothership-controls-malicious-content/)**\n\nAugust 12, 2021\n\nWhen [we last wrote about Gootloader, we detailed how the threat actors’ use of poisoned](https://news.sophos.com/en-us/2021/03/01/gootloader-expands-its-payload-delivery-options/)\nGoogle search results direct people who search for specific, business-related terms (in\nEnglish, German, French, and Korean) into a network of compromised WordPress websites.\nThose websites then serve up a malicious file by means of a clever social engineering trick.\nIf a person then double-clicks the malicious file, their computer is then infected with malware\nthat never touches the filesystem, and maintains persistence through a convoluted process\nin which the malicious code gets stored in the Windows registry.\n\nSince we published the initial research in March, the Gootloader actors have not slowed\ndown their efforts. In this followup to that research paper, we wanted to highlight some of the\nserver-side behavior of the compromised WordPress sites that make up the bulk of the threat\nactors’ social engineering and malicious SEO efforts. With hundreds of websites hosting the\nGootloader code at any given time, we just don’t know how the attackers initially gain access\nto these websites, belonging to individuals and businesses, but we’ve obtained some of that\nsource code to analyze.\n\n\n-----\n\nOne of the bogus “message boards” that Gootloader uses to serve up malicious files\nThis followup to our coverage will look under the hood, and explain how the malicious code\nrunning on the compromised sites gives the threat actors the ability to target a narrow\naudience of potential victims, as well as produce the polished-looking fake message board\npages that purport to offer the unwary visitor exactly what they were originally searching for.\n\n## Search engine de-optimization\n\nThe first part of the attack involves tricking Google (the apparent primary target, since the\npoisoned results don’t typically appear in other search engines’ results pages) into indexing\nthe compromised websites as if they were the best source for information on the narrow list\nof terms the attackers choose to emphasize and promote through search.\n\nThis is no rudimentary process, as the search results that deliver Gootloader pages are often\nthe top result for the specific query that leads victims to them.\n\n\n-----\n\nTake, as just one example, this search query (in the German language) for downloads of\nMIDI music files. The result in this screenshot points to a website called micbd.com.\n\n\n-----\n\nThe front page of the\n\nMICBD website\nIf a visitor were to browse to this website not by following the Google search result, but by\ntyping in the domain into the Address Bar manually, they would see that the page belongs to\nan industry trade organization representing cannabis businesses in the US state of Michigan.\nIt certainly doesn’t seem to have any relationship to the search result for MIDI file downloads\nin the German language.\n\n\n-----\n\nThe malicious SEO is scripted so it’s only visible to search engines, rather than normal site\nvisitors\nHowever, taking a look at the source code of that page reveals that someone has crafted a\nlarge series of search terms (highlighted in green) and embedded them within the website’s\nfront page as links (highlighted in red) that point to nonexistent pages purportedly hosted\nwithin the website. None of these links will appear when you browse to the page, but search\nengines index them, which is how the attackers poison the results. There’s also a JavaScript,\nabout two-thirds of the way down the page, document.getElementById(“a47ec48”), which\nhas also been placed in the webpage by the threat actors.\n\nAs we’ve already said, we don’t know exactly how the threat actors gain access to these\nwebsites and embed this code into pages on the site, but the malware itself has password\nstealing functionality, so it’s quite possible that they’re simply using whatever websites they\ncan obtain through their own activity. They may also be obtaining access to phished or\notherwise stolen admin credentials for websites from other criminals.\n\n\n-----\n\nA\n\nsimplistic but effective command shell script\nIn addition to the malicious SEO terms, the attackers embed some PHP scripting code into\nthe WordPress backend, so that the scripts could conceivably run on any page. One of the\nmalicious PHP scripts the attackers add to the website is a simple PHP command shell,\nwhich could serve to preserve the attackers’ access to compromised pages if they lose\nwhatever other access they may have. The attackers perform an HTTPS POST request with\na base64-encoded string of commands, which the WordPress installation will then execute in\nthe context of its process on the server. The variable $pposte holds the name of the\nparameter that gets executed.\n\nThe attackers also place a string into the pages that matches this regex filter: /j\\$k([0-9]\n_{1,10})j\\$k/._\n\nThis marker serves as placeholder where the link to a script that will render the malicious\npage will be inserted later. This marker is later removed from the page source using this\ncommand.\n```\npreg_replace(\"/j\\$k([0-9]{1,10})j\\$k/\", ''\n\n```\nFurther on, the script defines filters for WordPress events, which trigger the execution of\nhandler functions on certain conditions. For example, the following trigger fires once the\nWordPress environment has been set up: the invoked code initializes the backupdb_wp_lstat\ndatabase table at startup.\n```\nadd_action(\"wp\", \"qvc5\");\n\n```\n\n-----\n\nThis is part of the code form qvc5() that initializes the backend databases used by\nGootloader:\n```\nif ($table_prefix < > \"backupdb_\".$qvc4) {\n $table_prefix = \"backupdb_\".$qvc4;\n wp_cache_flush();\n $qvc5 = new wpdb(DB_USER, DB_PASSWORD, DB_NAME, DB_HOST);\n $qvc5 - > set_prefix($table_prefix);\n\n```\nA Virustotal search for content:”SELECT * FROM backupdb_” gives a couple of files (from\ninterfree.ca) with this error message:\n\nA Gootloader error message\nIt shows that the criminals are likely using the database backupdb_wp_lstat, which must\nhave been subsequently removed from the server.\n\nThe procedure qvc5 also filters on is_404 – for any non-existing subpage.\n\nLikely this is how the Google search results are served: the subpages don’t exist physically\non the server (it appears that the attackers don’t control the files and directories on the\ncompromised servers, only the WordPress database contents), but this handler will provide\nthe malicious content served through the pages themselves.\n\nThis script is used to filter the content of a post after it is retrieved from the database, but\nbefore it is printed to the screen, and inserts the malicious Javascript tag in place of the\n**j$k…j$k markers markers within the source, for example:**\n```\nadd_filter('the_content', 'qvc0');\n\n```\nThe following two values hold the content of the output buffer until the header and footer is\nthere, then remove the j$k…j$k markers and inserts the SEO poisoning div element into the\nmost recent 20 posts.\n```\nadd_action(\"wp_head\", \"qwc7\");\nadd_action(\"wp_footer\", \"qwc5\");\n\n```\nAs a result, the malicious code will appear in the SEO-poisoned pages and, additionally, the\nmost recent pages will contain the hidden element. Together, these serve to raise the\nwebsite’s profile in web search results.\n\n## Contacting the mothership\n\nAll of these behaviors, so far, rely solely on code installed into the WordPress database on\nthe compromised sites. However, there’s another machine involved in the attack, which we’re\ncalling the mothership. The mothership acts both as a traffic cop, and delivers the malicious\ncode that renders the page that looks like a message board post.\n\n\n-----\n\nAs traffic cop, the mothership only wants to serve malicious code to visitors who have (a)\nclicked a Google result, in (b) a geographically targeted region of the world, using (c) a\nWindows browser User-Agent. We’ve observed Gootloader target the US, Canada,\nGermany, France, and South Korea, delivering different payloads to different regions of the\nworld.\n\nOn preparing the requested web page, the malicious event handler hooks build a request to\nthe mothership, reporting the following parameters of the initial request, all in base64\nencoded form:\n\na: Unique server ID\nb: IP address\nc: user agent\nd: referrer string\n\nThe Gootloader target profiling code\nThe IP address of the source of the request (the address of the victim PC) is used for filtering\nout the unwanted countries. The referrer string will contain the original search terms as\npassed on during the click through process.\n\nThis will end up in a query that looks like this:\n\n\n-----\n\n(in this particular case the referrer string will be the base64 encoded value of: _google/?_\n_q=cisco_wpa_agreement”)_\n\nAfter that the response from the server is processed.\n\nThe mothership response contains two segments: one for the HTML header elements, the\nother for the body. The two are separated by a <sleep> marker. The header part contains\nmultiple elements, those are separated by | characters. Using the returned content the\nlanding page code will gather the HTML content:\n\nThe script generates a blocklist on the fly when the visitor first visits the web page. This\nfunctionality blocks the IP address where the request came from (so a researcher, for\ninstance, cannot easily visit the site twice from the same machine). But it doesn’t only block\nthe one IP address; They also block repeat visits by a range of IP addresses in the same\nsubnet as the visitor.\n\nRendering the fake forum page\n\nThe only visible malicious content in the source code compromised landing page is a simple\ninserted JavaScript tag, for example:\n```\nhttps://powerstick[.]com/main/?ad94610=1174868\n\n```\n\n-----\n\nThe number that is the value of the parameter (1174868 in the above example) is used in\nmany places in the pages source (for example in the placeholder variable) and may be a\nunique key for the infected server:\n\nThis script tag will invoke the landing page renderer code.\n\nThis linked script deletes the original content of the HMTL page:\n\nand replaces it with the fake forum text…\n\n…which contains the download link for the first stage Javascript:\n\nThe result will look like a conversation on the blog, with a link of the alleged search term\n(“kostenlos midi songs herunterladen” in this example), and a seemingly satisfied customer,\ntogether with the download link of the first stage JavaScript downloader.\n\n\n-----\n\nThe fake Gootloader forum page along with its accompanying source code\nThis link will connect to the server that is hosting the first stage download script, which is\nusually somewhere other than the compromised WordPress site hosting the bogus forum\npage content.\n\n## How the first stage downloader script works\n\nThe first stage download script (hosted on links using filenames that include down.php,\n**join.php, thank.php or about.php) simply relays the incoming request to the mothership:**\n\n\n-----\n\nIn the samples that we found we observed two mothership addresses, 5.8.18[.]7 and my**_game[.]biz (the my-game website is hosted on this IP address). Notably, they refer to the_**\nsame web location, but only the compromised landing page code refers to it by domain\nname, and the first stage downloader refers to it by IP address.\n\nThe request sent to the mothership will return the first stage downloader Javascript in ZIP\npackaged form. Because the original referrer string is passed all the way to the mothership, it\nwill receive the original search terms, and returns a Javascript payload with a file name\nmatching these search terms.\n\nAs a side effect, we could tell from the observed file names which were the most frequently\npoisoned search terms for, for example, German victims.\n\nThe mothership server plays the central role in the early stages of the infection process: it\nprovides the content that the compromised sites deliver to the victim computer.\n\nThis server has served as the mothership throughout the life of Gootloader, starting from the\nearly sightings back in 2018, up to the latest known campaigns. From 2014 until 2018, the\ndomain name belonged to a Russia-based group of videogame players. While the site has\n\n\n-----\n\nbeen used for malicious purposes these past three years, there s still a clan of Counterstrike\nplayers whose public profile still lists the website.\n\n## What can anyone do about Gootloader?\n\nAside from having a modern endpoint protection tool installed on your Windows computer,\nthere are some mitigations that people can use to try to minimize their risk of being caught\nup in a Gootloader attack.\n\nUnfortunately, all of them come with some caveats and none of them offer a quick fix for the\nproblem.\n\nNone of these Gootloader mitigations offer a satisfying, easy solution\nNot everyone will be familiar with the visual appearance of the Gootloader fake forum pages,\nthough this is an easy way to recognize the attack before anything has happened on a\ncomputer. Tools like script blockers are challenging for some people to use and make the\nweb more inconvenient in general, though they do offer some protection.\n\nThe real problem here is how readily the attackers have been able to float their malicious\nsearch results to the top of Google searches. Until Google addresses the methods by which\nthe Gootloader threat actors have managed to manipulate their results, the problem seems\nlike it will persist indefinitely.\n\n## Indicators of compromise\n\nSophosLabs has published indicators of compromise for Gootloader on its Github page.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-12 - Gootloader’s “mothership” controls malicious content.pdf"
    ],
    "report_names": [
        "2021-08-12 - Gootloader’s “mothership” controls malicious content.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535720,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653774118,
    "ts_modification_date": 1653774118,
    "files": {
        "pdf": "https://archive.orkl.eu/515b79a881e24d3984ce185525d0da8e17ba50c1.pdf",
        "text": "https://archive.orkl.eu/515b79a881e24d3984ce185525d0da8e17ba50c1.txt",
        "img": "https://archive.orkl.eu/515b79a881e24d3984ce185525d0da8e17ba50c1.jpg"
    }
}