{
    "id": "04f64af6-020e-4b86-b88a-2d121f687769",
    "created_at": "2023-01-12T15:06:15.738912Z",
    "updated_at": "2025-03-27T02:06:09.476595Z",
    "deleted_at": null,
    "sha1_hash": "34b28c2cb48ba40440afa8588bb7e350b1190a4e",
    "title": "2020-12-17 - Smokeloader is still alive and kickin’ – A new way to encrypt CC server URLs",
    "authors": "",
    "file_creation_date": "2022-05-27T21:13:11Z",
    "file_modification_date": "2022-05-27T21:13:11Z",
    "file_size": 310243,
    "plain_text": "# Smokeloader is still alive and kickin’ – A new way to encrypt CC server URLs\n\n**[telekom.com/en/blog/group/article/a-new-way-to-encrypt-cc-server-urls-614886](https://www.telekom.com/en/blog/group/article/a-new-way-to-encrypt-cc-server-urls-614886)**\n\nBlog.Telekom\n\n12‑17‑2020\n[Thomas Barabosch](https://www.telekom.com/en/blog/592636-592636)\n\n0 Comments\n\nShare Share\nTwo clicks for more data privacy: click here to activate the button and send your\nrecommendation. Data will be transfered as soon as the activation occurs.\n\nPrint\n[Read out](https://app-eu.readspeaker.com/cgi-bin/rsent?customerid=4779&lang=en&readid=readspeakercontent&url=https://www.telekom.com/en/blog/group/article/a-new-way-to-encrypt-cc-server-urls-614886)\n\nThe malware downloader Smokeloader is one of the oldest malware families that is still in\nuse today. A malware downloader is a typically small program that fingerprints a target\nsystem, downloads one or more additional malicious programs and executes them. Malware\ndownloader forms part of the cybercrime ecosystem: there are cybercriminals that offer to\ndistribute malware for other cybercriminals. They sell a number of installations for a couple of\ndollars, depending on several factors such as the geographic position of the target and its\noperating system.\n\n\n-----\n\nSmokeloader emerged from the Russian cybercrime underground in 2011 but is still alive.\n\nSmokeloader emerged from the Russian cybercrime underground in 2011. Its developer\n“SmokeLdr” is known to be customer friendly and they quickly act on customer complaints.\nSmokeloader is a crime kit that comes with a prebuilt bot, a PHP-based command and\n[control panel, and a user manual. In addition, cybercriminals can purchase more domains for](https://webcache.googleusercontent.com/search?q=cache:SISO5cE_3GkJ:https://blog.netlab.360.com/smoke-loader-the-core-files-the-admin-panel-the-plugins-and-the-3rd-party-patch/)\nthe bot (the default is just one domain) or additional modules that enhance the capabilities of\nthe main bot (e.g. DDoS attacks).\n\nThroughout the years, Smokeloader gained more and more anti-analysis measures to hinder\n[its profound analysis. A recent detailed analysis described a wide variety of obfuscation](https://n1ght-w0lf.github.io/malware%20analysis/smokeloader/)\ntechniques including opaque predicates, checking for running analysis programs, and antihooking measures. One anti-analysis trick is indeed very effective to hinder a full dynamic\nanalysis. Smokeloader resembles a Matryoshka doll: it comprises three layers of obfuscation\nwith the third being the final layer carrying out malicious activities. Before the second layer\nhands over control to the third layer, it checks if the filename of the executed Smokeloader\nbinary contains a certain string. If this string is not found, then the third and final layer will not\nbe unpacked. Since the filename of a sample is often either randomized or its hash itself, this\nis a severe problem for sandboxes in order to come to a correct verdict.\n\nWithin the last ten years, the cybercrime underground has changed significantly. There are\nmany new contenders such as Buer or Zloader, and Smokeloader has to stand its ground in\norder to maintain its market share. This may explain the above mentioned anti-analysis\nmeasures. But nevertheless the developer “SmokeLdr” has to continue developing their\nproject and improving it.\n\nIn this blog post, I will have a look at a recent change in the way how Smokeloader stores\nand decrypts its Command and Control (CC) server URLs. Until recently this malware used\nthe XOR cipher in a broken way and as a consequence its CC server URLs were trivial to\nbruteforce. Samples observed in November and December 2020 implement a fix for this\nproblem. In the following, I will show way the old implementation was flawed and how\n“SmokeLdr” fixed it in recent samples.\n\n## Recap: Broken XOR Encryption of CC URLs\n\nSmokeloader implemented a very weak way of encrypting the CC server URLs. N1ght-W0lf\ndescribed this in detail. An example of this algorithm can be found in sample\n91879bdd73625ac38c31fe5225310e92.\n\n[In a nutshell, the bot relies on a XOR cipher. It comprises one or more encrypted buffers with](https://en.wikipedia.org/wiki/XOR_cipher)\nencrypted CC server URLs. Each buffer’s first byte is the length of the encrypted URL,\nfollowed by the encrypted URL itself, and a four byte XOR key. An encryption function takes\n\n\n-----\n\neach encrypted byte of the buffer, XORs consecutively each byte of the XOR key with the\nencrypted byte. Finally, it applies another XOR operation with a hard-coded one byte XOR\nkey. Since XOR operations are associative, we can use this to our advantage.\n\nLet’s assume we have the following encrypted buffer. The size of the buffer is 0x1C\n(highlighted in red). This is followed by 0x1C encrypted bytes (highlighted in light green).\nNext, there is the XOR key 0x1AD4EC24 (highlighted in dark green). Finally, there is a buffer\nof zeros that are actually not in the binary but only for illustration purposes. We will see later\nwhy they are quite helpful.\n\nFigure1 Encrypted URL buffer of Smokeloader\n\nLet’s see how the first letter of the URL is decrypted. Remember that first Smokeloader\nconsecutively XORs the first byte 0x8A with each byte of the XOR key (0x1AD4EC24) and\nthen it XORs this intermediate result again with the hard-coded XOR key 0xE4. The following\nequations demonstrate this. I use the fact that XOR operations are associative, i.e. the order\nof the applications does not matter:\n\nThe following equations demonstrate this.\n\nAs you can see, in the end 0x8A gets decrypted to 0x68, the ASCII code of “h”. We can see\nas well that due to the properties of the XOR operation and the consecutive application of\nfive bytes (four bytes XOR key + one hard-coded XOR key), the effective XOR key deflates\nto a just a one byte long XOR key (0xE2).\n\nIn practice, it was easy to bruteforce the deflated XOR key: XORing the whole unpacked\nbinary with bytes in the range from 0x01 to 0xFF and looking for zero-terminated strings that\nbegin with http was enough to find the CC server URLs. The following figure illustrates this.\nWe can see the CC server URL (highlighted in light green). Note that the buffer of zeros now\nmirrors the deflated XOR key 0xE2 since each value XORed by zero will result in the original\nvalue.\n\nFigure 2 Bruteforced Smokeloader CC server URL. Note that the buffer of zeros is now filled\nwith the deflated XOR key 0xE2.\n\nLong story short: never use the XOR cipher as Smokeloader did in the past if you are serious\nabout obfuscating (or “encrypting”) something. Consecutively applying several one byte XOR\nkeys does not increase security. The final key will still be one byte and easy to bruteforce\nwith just 256 possible keys to choose from.\n\n## Improved Obfuscation of Command and Control Server URLs\n\nI’ve already mentioned Smokeloader’s continuous development in the introduction. Recently,\nI came across a Smokeloader variant (6e5017e2d0407e74578d1121233da979) that had an\nimproved algorithm for obfuscating the CC server URLs. This improved algorithm mitigated\n\n\n-----\n\nthe easy bruteforce decryption of Smokeloader CC server URLs.\n\nThe following figure shows an encrypted URL buffer as found in a recent Smokeloader\nvariant. Again, the first byte is the length of the total buffer. But now the buffer is split in two\nparts. The first part is highlighted in purple and the second part is highlighted in light green.\nFinally, again, there is the four byte XOR key.\n\nFigure 3Encrypted URL buffer of Smokeloader's recent variant\n\nSo how does Smokeloader compute the final decrypted URL? Have a look at the decompiled\ncode of the CC server URL decryption function in the following figure.\n\nFirst of it all, at its heart is still the old XOR cipher. But now it takes two buffers into account.\nThe algorithm starts at the beginning of the first part of the buffer (purple). It fetches the byte\nat this offset and checks if it is zero (lines 27 – 29). If it is zero it sets the variable\n“is_second_part_buffer” to one and fetches a byte from the second part of the buffer (light\ngreen) (lines 31 – 32). If the byte of the first part of the buffer is not equal zero, the variable\n“is_second_part_buffer” will remain zero. Consequently, it XORs the fetched byte with the\nfour byte XOR key (dark green) (lines 34 – 42). Finally, and this depends on the origin of the\nbyte, one of two hard-coded one byte xor keys is applied (lines 43 – 47). In the example,\nbytes from the first part of the buffer are XORed with 0x66 and bytes from the second part of\nthe buffer are XORed with 0xC9. If you compare the first part (purple) and the second part of\nthe buffer (light green), then you will note that every time where a byte at an offset x is zero\nin the first part, it is not zero in the second part, and vice versa.\n\nFigure 4 Decompiled CC server URL decryption function of Smokeloader\n\nIf you write code for configuration extraction, then you have to go the long way now since\nbruteforcing will not work anymore. This means that you have to first identify the function that\ndecrypts the CC server URLs and extract the two one byte XOR keys. Next, you have to\nidentify the encrypted URL buffer. First, you should extract the four byte XOR key. Then, you\ncan join part 1 and part 2 of the encrypted buffer, while XORing with the correct one byte key.\nFinally, you can XOR the joined buffer with the extracted four byte XOR key, and voilà: we\nhave our decrypted URL!\n\nNext year Smokeloader will turn ten years old, let’s see how this cybercrime veteran will\ncelebrate its anniversary…\n\n## Appendix: IoCs\n\n### IoC Description\n\n91879bdd73625ac38c31fe5225310e92 Smokeloader\n\n\n-----\n\n6e5017e2d0407e74578d1121233da979 Smokeloader\n\nhxxp://penodux[.]com/xsmkld/index.php Smokeloader CC URL\n\nhxxp://tommusikirtyur[.]com/xsmkld/index.php Smokeloader CC URL\n\nhxxp://2831ujedkdajsdj[.]info/ Smokeloader CC URL\n\nhxxp://dkajsdjiqwdwnfj[.]info/ Smokeloader CC URL\n\nhxxp://928eijdksasnfss[.]info/ Smokeloader CC URL\n\n© Copyright: Free-Photos on Pixabay\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-17 - Smokeloader is still alive and kickin’ – A new way to encrypt CC server URLs.pdf"
    ],
    "report_names": [
        "2020-12-17 - Smokeloader is still alive and kickin’ – A new way to encrypt CC server URLs.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535975,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653685991,
    "ts_modification_date": 1653685991,
    "files": {
        "pdf": "https://archive.orkl.eu/34b28c2cb48ba40440afa8588bb7e350b1190a4e.pdf",
        "text": "https://archive.orkl.eu/34b28c2cb48ba40440afa8588bb7e350b1190a4e.txt",
        "img": "https://archive.orkl.eu/34b28c2cb48ba40440afa8588bb7e350b1190a4e.jpg"
    }
}