{
    "id": "04fb9784-3c1e-4a56-b1ee-88d1123ca4a8",
    "created_at": "2023-01-12T15:05:35.922385Z",
    "updated_at": "2025-03-27T02:09:29.804104Z",
    "deleted_at": null,
    "sha1_hash": "0c691423a201896aa6ee0ca530866ed894b134ba",
    "title": "2021-10-27 - Tales From the Cryptojacking Front Lines",
    "authors": "",
    "file_creation_date": "2022-05-28T23:17:06Z",
    "file_modification_date": "2022-05-28T23:17:06Z",
    "file_size": 2141832,
    "plain_text": "# 2021 Cryptojacking Trends + Investigation Recommendations\n\n**[crowdstrike.com/blog/2021-cryptojacking-trends-and-investigation-recommendations/](https://www.crowdstrike.com/blog/2021-cryptojacking-trends-and-investigation-recommendations/)**\n\nFalcon OverWatch Team October 27, 2021\n\n[Throughout 2021, the CrowdStrike Falcon OverWatch™ team has observed the volume of](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)\ncryptojacking intrusions more than quadruple compared to 2020. ECrime adversaries are\nusing cryptojacking as a means of monetizing an intrusion, in addition to ransom demands\nand data extortion — and they’re going to greater lengths to employ stealthy techniques to\noptimize the performance of their tooling and make system changes to avoid discovery.\n\n[Cryptojacking involves the unauthorized use of a system’s resources to mine cryptocurrency,](https://www.crowdstrike.com/cybersecurity-101/cryptojacking/)\n[one of any number of digital currencies. This can be done via the installation of malware or](https://www.crowdstrike.com/cybersecurity-101/malware/)\nby injecting malicious code into a webpage. Cryptojacking can impact the performance of\nsystems and consume excess energy, and crucially, it indicates a more significant issue with\nthe integrity of an organization’s security.\n\nThere will always be sophisticated attackers with the resources and motivation to bypass or\nexploit technology-based defenses, and threat actors are increasingly leveraging valid\naccounts and native tooling to avoid detection. This blog unpacks the interesting hands-on\n\n\n-----\n\ncryptojacking tradecraft that OverWatch threat hunters uncovered in the first half of 2021 and\nprovides recommendations for identifying cryptojacking tradecraft within your environment.\n\nOverWatch tracks interactive intrusion activity against the MITRE ATT&CK® Enterprise\n[Matrix, and cryptojacking tradecraft is categorized under the Resource Hijacking (T1496)](https://attack.mitre.org/techniques/T1496/)\ntechnique, part of the “Impact” tactic group.\n\n## Why eCrime Adversaries Are Using Cryptojackers\n\nECrime adversaries are, by definition, primarily motivated by financial gain. Cryptojacking is\nyet another tool in their arsenal to anonymously extract payment following a compromise.\nCryptocurrency prices have spiked to unprecedented heights in recent months, and eCrime\nadversaries, looking to profit from these inflated prices, have responded by incorporating\ncryptojacking into their toolset. In this climate, it is likely that the number of cryptojacking\nvictims is high, but because this activity does not involve data theft, there is often no\nrequirement for victims to disclose attacks and risk reputational damage.\n\nAnother likely motivation behind the adoption of cryptojacking activity is the fact that it can be\nrelatively straightforward to execute. These applications generally do not require elevated\npermissions and can be installed by standard accounts. Many commodity cryptojackers also\nhave browser extension tooling, so installation can be very quick and easy. OverWatch often\nfinds adversaries attempting to take advantage of limited software controls to install\ncryptojacking applications, and threat hunters are critical for unearthing activity where\nadversaries are operating under valid accounts to configure cryptojackers.\n\nIn addition, most mining applications have a minimal code base, and due to the simplicity of\nthe disk operations required, adversaries can quickly write cryptojacking code to disk that\ncan blend in with legitimate scripts. Cryptojacking applications are mostly platform-agnostic,\nso adversaries can reuse code against multiple operating systems. Finally, adversaries can\nsubvert network-based defenses by blending their requests into everyday telemetry and\n[leveraging encryption or obfuscation to hide the payload data. CrowdStrike Falcon Prevent™](https://www.crowdstrike.com/endpoint-security-products/falcon-prevent-endpoint-antivirus/)\nnext-generation antivirus (NGAV) has the ability to detect and prevent up to 99% of known\nand unknown threats, but human defenders will always be necessary when up against\nhuman attackers. Depending on the adversary’s level of sophistication and access, they may\nopt for cryptojacking rather than ransomware objectives after gaining hands-on-keyboard\naccess. Continuous threat hunting operations will augment your ability to identify tradecraft\nthat bypasses traditional controls and the techniques designed to subvert technology.\n\n## What’s Changing in 2021\n\nOverWatch is seeing cryptojacking activity in 2021 that far outpaces 2020 and has\nuncovered hands-on cryptojacking activity in 14 industry verticals. The vast array of targeted\nverticals indicates that no organization is safe from eCrime adversaries looking to profit from\n\n\n-----\n\ncryptojacking attacks, and the rapid increase in this type of tradecraft suggests that these\nintrusions are increasingly opportunistic.\n\nThe hands-on cryptojacking activity that OverWatch uncovers shares similarities with other\neCrime activity, where actors are leveraging valid accounts and native tooling to avoid\ndetection. This was certainly the case in a recent intrusion by an unknown eCrime group that\nperformed extensive discovery using WMIC to enumerate the host’s system and hardware\ninformation. The adversary operated under a PostgreSQL service after remotely\ncompromising the vulnerable server. They proceeded to use a highly obfuscated Base64\nPowerShell command to acquire a low-prevalence cryptojacker to disk. The following graphic\nshows the process tree associated with this activity. Investigation revealed that along with\nacquiring the cryptojacker, the adversary leveraged native tooling for reconnaissance. At\nevery step of this intrusion, the adversary attempted to evade defenses, from subtly\nacquiring the binary to performing enumeration using native tools.\n\n\n-----\n\nFigure 1: Ecrime adversary operating under a PostgreSQL session, performing host reconnaissance using\nnative tooling, and acquiring a custom cryptojacker to disk using obfuscated PowerShell commands. (Click\n\nto enlarge)\n\nAn interesting development in the cryptojacking activity that OverWatch has observed is the\nadversaries’ efforts to modify victim hosts to ensure that cryptojacking applications operate\nunder the radar. In one such eCrime intrusion, the adversary gained access via RDP\npassword spraying and wrote a Kryptex Monero cryptojacker to disk. The adversary then set\nscheduled tasks to routinely execute the binary for persistence purposes. In an attempt to\nrun the cryptojacker covertly and bypass defenses, they made firewall changes to allow only\noutbound Kryptex traffic and deny any unnecessary inbound Kryptex server connections.\n\nThe adversary proceeded to invoke multiple registry changes, shown in the commands\nbelow. The first command modifies the default value of the `TdrDelay key from 2 seconds`\nto 20 seconds. This key handles GPU preempt requests — it is likely that the adversary\nmade this change to force their cryptojacker to run “low and slow” and therefore be less likely\nto trigger any detections for high GPU usage.\n```\nC:\\Windows\\system32\\cmd.exe /d /s /c \"reg add\nHKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\GraphicsDrivers /v TdrDelay /t\nREG_DWORD /d 0x14 /f\"\n\n```\n\n-----\n\nSimilarly, the adversary also changed another GPU registry key named `TdrDdiDelay,`\nincreasing the value from 5 to 10 seconds. This key controls the rate at which threads leave\nthe GPU driver, and this delay allows their cryotojacking threads to execute at a much slower\nrate.\n```\nC:\\Windows\\system32\\cmd.exe /d /s /c \"reg add\nHKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\GraphicsDrivers /v TdrDdiDelay /t\nREG_DWORD /d 0xa /f\"\n\n```\nOverWatch has also observed similar tradecraft amongst Linux systems. The following two\ncommand lines were observed in separate intrusions where eCrime adversaries invoked\nsystem changes likely intended to improve the performance of custom cryptojackers. This is\na timely reminder that adversaries do not discriminate and will actively target hosts\nregardless of the installed operating system.\n\nThe first command is a native utility, HugePages, which was used to increase from 4KB to\n128KB the memory pages supported by the operating system. This memory efficiency\nchange was likely to allow their cryptojacker to run without causing potential resource\nexhaustion issues.\n\n```\nsysctl vm.nr_hugepages=128\n\n```\n\nThe second intrusion featured the adversary using the native utility MSR in an effort to\nimprove the performance of a custom cryptojacker by enabling prefetch writes. These Linux\nintrusions were both preceded by a brief period of reconnaissance to collect details on the\nsystem. This reconnaissance also took advantage of “living off the land,” using tooling\nalready installed natively on the system to blend into everyday telemetry.\n\n```\nsh -c /sbin/modprobe msr allow_writes=on > /dev/null 2>&1\n\n```\n\n## Threat Hunting as a Tool to Unearth Cryptojacking Tradecraft\n\nThreat hunters are incredibly well placed to proactively search for early signs of cryptojacking\nactivity, understand the context of the activity and determine how widespread the intrusion is.\nOutlined below are several recommendations for defenders looking to proactively investigate\nthis activity.\n\nAs shown above, the registry can be modified to alter mining requests, and it is\ntherefore recommended to look for any anomalous registry changes to GPU or CPU\nkeys. In addition, any fluctuations in GPU/CPU temperature that cannot be accounted\nfor or that take place out of hours should be reviewed, along with inspecting any\nsustained utilization on hosts that differ from the baseline or expected volume.\n\n\n-----\n\nCryptojacking applications will often attempt to stop a range of commodity\ncryptojacking process names to eliminate competition from any other mining\napplication that may be currently installed. OverWatch recommends looking for this\nactivity, which may also be associated with an unsigned binary, a rogue browser\nextension, or a file stored within a suspicious location.\nAdversaries may manually write cryptojacking code to disk, so it can also be useful to\nlook for signs of file compilation events. This may also be found around the same time\nas associated events, such as new scheduled tasks being set for persistence purposes\nor native tools being used to timestomp the file in an attempt to make the malware\nappear legitimate.\nOverWatch further recommends investigating network connections to known mining\nnetwork pools and any connections to suspicious domains such as Pastebin or Github,\nwhere commodity cryptojacking tools can be easily acquired and can masquerade as a\nlegitimate code base.\nIn addition to these investigations, it is also essential to consider the basics, as\nadversaries will always exploit low-hanging fruit. IT hygiene is critical, such as\nestablishing an unauthorized software policy and ensuring rapid patching of systems\nfollowing any legitimate vendor updates. It is also important to understand your\n[environment and its critical assets, ensure full endpoint detection and response (EDR)](https://www.crowdstrike.com/cybersecurity-101/endpoint-security/endpoint-detection-and-response-edr/)\ncoverage across all hosts to support visibility, and maintain strong content filtering\nprotections across installed security technologies.\n\n[For more information on cryptojacking, see our Cybersecurity 101 page.](https://www.crowdstrike.com/cybersecurity-101/cryptojacking/)\n\n**Additional Resources**\n\n_Read about the latest trends in threat hunting and more in the 2021 Threat Hunting_\n_Report or simply_ _[download the report now.](https://www.crowdstrike.com/resources/reports/threat-hunting-report-2021/)_\n_[Learn more about Falcon OverWatch proactive managed threat hunting.](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)_\n_[Watch this video to see how Falcon OverWatch proactively hunts for threats in your](https://www.crowdstrike.com/resources/videos/falcon-overwatch-proactively-hunts-threats-environment/)_\n_environment._\n_[Learn more about the CrowdStrike Falcon® platform by visiting the product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_\n_[Test CrowdStrike next-gen AV for yourself. Start your free trial of Falcon Prevent™](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_today._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-27 - Tales From the Cryptojacking Front Lines.pdf"
    ],
    "report_names": [
        "2021-10-27 - Tales From the Cryptojacking Front Lines.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535935,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653779826,
    "ts_modification_date": 1653779826,
    "files": {
        "pdf": "https://archive.orkl.eu/0c691423a201896aa6ee0ca530866ed894b134ba.pdf",
        "text": "https://archive.orkl.eu/0c691423a201896aa6ee0ca530866ed894b134ba.txt",
        "img": "https://archive.orkl.eu/0c691423a201896aa6ee0ca530866ed894b134ba.jpg"
    }
}