{
    "id": "0520663f-dfe3-4904-bbbc-63773d686fe7",
    "created_at": "2023-01-12T15:08:32.339988Z",
    "updated_at": "2025-03-27T02:05:53.264693Z",
    "deleted_at": null,
    "sha1_hash": "356572b480ffb30084275dd01e70ade3471f3197",
    "title": "2021-02-06 - Decrypting AzoRult traffic for fun and profit",
    "authors": "",
    "file_creation_date": "2022-05-28T02:36:09Z",
    "file_modification_date": "2022-05-28T02:36:09Z",
    "file_size": 1318586,
    "plain_text": "# Decrypting AzoRult traffic for fun and profit\n\n**[mariohenkel.medium.com/decrypting-azorult-traffic-for-fun-and-profit-9f28d8638b05](https://mariohenkel.medium.com/decrypting-azorult-traffic-for-fun-and-profit-9f28d8638b05)**\n\nMario Henkel February 6, 2021\n\n[Mario Henkel](https://mariohenkel.medium.com/?source=post_page-----9f28d8638b05--------------------------------)\n\nFeb 6, 2021\n\n\n5 min read\n\nThere will be times in your career when you will be presented with a traffic capture and get\nthe task to determine what happened and if any data was stolen.\n\nIn this post, I will show you how you can squeeze all those juicy information from a PCAP\ntraffic capture from an Azorult infection.\n\nAt the end, you will be able to answer which data has been stolen so you can act\naccordingly. Let’s start!\n\n## Getting sample data\n\nHead over to [https://any.run and search for “Azorult” in public submissions or use the PCAP](https://any.run/)\nyou already got\n\n\n-----\n\nMost likely you will find a lot of samples\nYou will find a lot of samples without actual network traffic since the command and control\nserver was already offline when any.run analyzed the sample. Have a look at samples which\nshow POST requests\n\nA good candidate for further investigation since you can see multiple POST requests\nOnce you found an appropriate sample, download the PCAP to your machine and open it in\nWireshark.\n\n\n-----\n\nUsing Wireshark to follow HTTP streams\nYou then have to be on the lookout for HTTP POST requests. If you want to see the content\nof the request, you can right click the appropriate row and click on “Follow” and “HTTP\nstream”\n\n\n-----\n\nThe Check-in which does not contain any interesting info\nYou will notice multiple POST requests while the first is pretty small and functions as a\ncheck-in to the Command and Control server. Skip this one since this does not contain any\nvaluable data for us.\n\nSize matters! The biggest POST request in the PCAP is our target\nOne man’s trash is another man’s treasure! Looks like trash but is actually the stolen data\ngetting exfiltrated! That’s the request we are interested in! Notice, that this request contains\nmuch more data!\n\n\n-----\n\nChange view and save\nChange the view to “Raw” and save the output to disk so we can further process it.\n\nYou might need some patience\nNow comes the fun part! As you might have noticed, the POST request data is encrypted in\nsome way. Turns out, it is just XORed with a 3 byte key which unfortunately is not the same\nfor all variants. What now? Make “some” educated guesses?\n\nFear not, I created a tool which first tries to decrypt it with keys I found in the wild and if this\nis not successful, it will start to brute force the key. This is possible with the help of a known\nplaintext attack since I learned through manually reversing AzoRult that the plaintext stolen\ndata contains strings like “<info” which we can look for after every decryption try.\n\nYou can get it here: https://GitHub.com/hariomenkel/AzoBrute\n\nOnce downloaded, let it run against the extracted POST request and hopefully, you’ll receive\nthe key.\n\nPlease consider creating an issue at the AzoBrute GitHub repository with your key so I can\nadd it to the list of keys which are tried before trying brute force. Sharing is caring!\n\nOnce you have the key, copy it — you will need it for another tool\n\n\n-----\n\nChange the value of “xor_key”\nNow when you have the key, you might want to extract the stolen data don’t you? To do so,\nget https://GitHub.com/hariomenkel/AzoDecrypt and open it in an editor to change the value\nof “xor_key” to the value you found earlier. Don’t forget to add \\x before every byte so the\nformat is the same as before. When you are finished, save it and run that bad boy!\n\nDecrypt that bad boy\nAs you can see, the tool was able to use your key to find the payload, extract it and also\nsqueeze out a ZIP archive containing all stolen credentials, cookies, system infos etc.!\n\n\n-----\n\nBeauty lies in the eye of the beholder\nThis is the POST request which has been XORed which already shows some information\n\nContent of ZIP file\nThe really interesting data is in the ZIP file. You might want to have a look at it!\n\n\n-----\n\nPasswordsList.txt\nHere you can see the Fake credentials any.run was hosting while running the sample\n\n\n-----\n\nSystems.txt\nThe attacker is also able to gain a lot of information from your system through system.txt\n\n## What next?\n\nNow that you have the correct XOR key and GUID you can use another tool I created to\nannoy the attacker through flooding his/her AzoRult panel with real looking fake data which\nmakes it hard to distinguish between real and fake victims and ultimately may stop the\nattacker from selling the data due to its bad quality.\n\nYou can get it here: https://GitHub.com/hariomenkel/AzoSpam\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-06 - Decrypting AzoRult traffic for fun and profit.pdf"
    ],
    "report_names": [
        "2021-02-06 - Decrypting AzoRult traffic for fun and profit.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536112,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1653705369,
    "ts_modification_date": 1653705369,
    "files": {
        "pdf": "https://archive.orkl.eu/356572b480ffb30084275dd01e70ade3471f3197.pdf",
        "text": "https://archive.orkl.eu/356572b480ffb30084275dd01e70ade3471f3197.txt",
        "img": "https://archive.orkl.eu/356572b480ffb30084275dd01e70ade3471f3197.jpg"
    }
}