{
    "id": "052a4a35-c6bb-4524-8c1c-ed2f3b08bbfc",
    "created_at": "2022-10-25T16:48:22.572969Z",
    "updated_at": "2025-03-27T02:05:37.759147Z",
    "deleted_at": null,
    "sha1_hash": "630eea3f1bc9158570c53d70fc70b31003305f5c",
    "title": "An Analysis Of Regin's Hopscotch And Legspin",
    "authors": "Kaspersky",
    "file_creation_date": "2015-01-24T14:44:26Z",
    "file_modification_date": "2015-01-24T14:44:26Z",
    "file_size": 173061,
    "plain_text": "[With high profile threats like Regin, mistakes are incredibly rare. However, when it comes to humans](http://securelist.com/blog/research/67741/regin-nation-state-ownage-of-gsm-networks/)\n\nwriting code, some mistakes are inevitable. Among the most interesting things we observed in the Regin\n\nmalware operation were the forgotten codenames for some of its modules.\n\nThese are:\n\nHopscotch\n\nLegspin\n\nWillischeck\n\nU_STARBUCKS\n\nWe decided to analyze two of these modules in more detail - Hopscotch and Legspin.\n\nDespite the overall sophistication (and sometimes even over-engineering) of the Regin platform, these\n\ntools are simple, straightforward and provide interactive console interfaces for Regin operators. What\n\nmakes them interesting is the fact they were developed many years ago and could even have been created\n\nbefore the Regin platform itself.\n\n## The Hopscotch module\n\nMD5 6c34031d7a5fc2b091b623981a8ae61c\n\nSize 36864 bytes\n\nType Win32 EXE\n\nCompiled 2006.03.22 19:09:29 (GMT)\n\nThis module has another binary inside, stored as resource 103:\n\nMD5 42eaf2ab25c9ead201f25ecbdc96fb60\n\nSize 18432 bytes\n\nType Win32 EXE\n\nCompiled 2006.03.22 19:09:29 (GMT)\n\nThis executable module was designed as a standalone interactive tool for lateral movement. It does not\n\ncontain any exploits but instead relies on previously acquired credentials to authenticate itself at the\n\nremote machine using standard APIs.\n\nThe module receives the name of the target machine and an optional remote file name from the standard\n\ninput (operator). The attackers can choose from several options at the time of execution and the tool\n\nprovides human-readable responses and suggestions for possible input.\n\n|MD5|6c34031d7a5fc2b091b623981a8ae61c|\n|---|---|\n|Size|36864 bytes|\n|Type|Win32 EXE|\n|Compiled|2006.03.22 19:09:29 (GMT)|\n\n|MD5|42eaf2ab25c9ead201f25ecbdc96fb60|\n|---|---|\n|Size|18432 bytes|\n|Type|Win32 EXE|\n|Compiled|2006.03.22 19:09:29 (GMT)|\n\n\n-----\n\nAuthentication Mechanism (SU or NETUSE) [S]/N:\n\nContinue? [n]:\n\nA File of the same name was already present on Remote Machine - Not deleting...\n\nThe module can use two routines to authenticate itself at the target machine: either connecting to the\n\nstandard share named \"IPC$\" (method called \"NET USE\") or logging on as a local user (\"SU\", or \"switch\n\nuser\") who has enough rights to proceed with further actions.\n\nIt then extracts a payload executable from its resources and writes it to a location on the target machine.\n\nThe default location for the payload is: \\\\%target%\\ADMIN$\\SYSTEM32\\SVCSTAT.EXE. Once\n\nsuccessful, it connects to the remote machine's service manager and creates a new service called \"Service\n\nControl Manager\" to launch the payload. The service is immediately started and then stopped and deleted\n\nafter one second of execution.\n\nThe module establishes a two-way encrypted communication channel with the remote payload\n\n**SVCSTAT.EXE using two named pipes. One pipe is used to forward input from the operator to the**\n\npayload and the other writes data from the payload to the standard output. Data is encrypted using the\n\nRC4 algorithm and the initial key exchange is protected using asymmetric encryption.\n\n**\\\\%target%\\pipe\\{66fbe87a-4372-1f51-101d-1aaf0043127a}**\n\n**\\\\%target%\\pipe\\{44fdg23a-1522-6f9e-d05d-1aaf0176138a}**\n\nOnce completed, the tool deletes the remote file and closes the authenticated sessions, effectively\n\nremoving all the traces of the operation.\n\nThe SVCSTAT.EXE payload module launches its copy in the process dllhost.exe and then prepares the\n\ncorresponding named pipes on the target machine and waits for incoming data. Once the original module\n\nconnects to the pipe, it sets up the encryption of the pipe communication and waits for the incoming\n\nshellcode.\n\nThe executable is injected in a new process of dllhost.exe or svchost.exe and executed, with its input and\n\noutput handles redirected to the remote plugin that initiated the attack. This allows the operator to control\n\nthe injected module and interact with it.\n\n## The Legspin module\n\nMD5 29105f46e4d33f66fee346cfd099d1cc\n\nSize 67584 bytes\n\nT Wi EXE\n\n|MD5|29105f46e4d33f66fee346cfd099d1cc|\n|---|---|\n|Size|67584 bytes|\n\n\n-----\n\nThis module was also developed as a standalone command line utility for computer administration. When\n\nrun remotely it becomes a powerful backdoor. It is worth noting that the program has full console support\n\nand features colored output when run locally. It can even distinguish between consoles that support\n\nWindows Console API and TTY-compatible terminals that accept escape codes for coloring.\n\n**_\"Legspin\" output in a standard console window with color highlighting_**\n\nIn addition to the compilation timestamp found in the PE headers, there are two references that point to\n\n2003 as its true year of compilation. The program prints out two version labels:\n\n2002-09-A, referenced as \"lib version\"\n\n2003-03-A\n\nIn addition the program uses legacy API functions, like \"NetBIOS\" that was introduced in Windows 2000\n\nand deprecated in Windows Vista.\n\nOnce started and initialized, it provides the operator with an interactive command prompt, waiting for\n\nincoming commands. The list of available commands is pretty large and allows the operators to perform\n\nmany administrative actions. Some of the commands require additional information that is requested\n\nfrom the operator, and the commands provide a text description of the available parameters. The program\n\nis actually an administrative shell that is intended to be operated manually by the attacker/user.\n\n**Command** **Description**\n\nd Ch t ki di t\n\n|Command|Description|\n|---|---|\n\n\n-----\n\n|dir ls dirl dirs|List files and directories|\n|---|---|\n|tar|Find files matching a given mask and time range, and write their contents to a XOR-encrypted archive|\n|tree|Print out a directory tree using pseudographics|\n|trash|Read and print out the contents of the Windows \"Recycle Bin\" directory|\n|get|Retrieve an arbitrary file from the target machine, LZO compressed|\n|put|Upload an arbitrary file to the target machine, LZO compressed|\n|del|Delete a file|\n|ren mv copy cp|Copy or move a file to a new location|\n|gtm|Get file creation, access, write timestamps and remember the values|\n|stm|Set file creation, access, write timestamps to the previously retrieved values|\n|mtm|Modify the previously retrieved file timestamps|\n|scan strings|Find and print out all readable strings from a given file|\n|more|Print out the contents of an arbitrary file|\n|access|Retrieve and print out DACL entries of files or directories|\n|audit|Retrieve and print out SACL entries of files or directories|\n|finfo|Retrieve and print out version information from a given file|\n\n\ncs Dump the first 10,000 bytes from an arbitrary file or from several system files:\n\nadvapi32.dll\n\n\n-----\n\nntdll.dll\nntoskrnl.exe\nwin32k.sys\ncmd.exe\nping.exe\nipconfig.exe\ntracert.exe\nnetstat.exe\nnet.exe\nuser32.dll\ngdi32.dll\nshell32.dll\n\nlnk Search for LNK files, parse and print their contents\n\ninfo Print out general system information:\n\nCPU type\nmemory status\ncomputer name\nWindows and Internet Explorer version numbers\nWindows installation path\nCodepage\n\ndl Print information about the disks:\n\nType\nFree/used space\nList of partitions, their filesystem types\n\nps List all running processes\n\nlogdump Unfinished, only displays the parameter description\n\nreglist Dump registry information for a local or remote hive\n\nwindows Enumerate all available desktops and all open windows\n\nview List all visible servers in a domain\n\ndomains List the domain controllers in the network\n\nshares List all visible network shares\n\nregs Print additional system information from the registry:\n\nIE version\nOutlook Express version\nLogon default user name\nSystem installation date\nBIOS date\nCPU frequency\nSystem root directory\n\nips List network adapter information:\n\nDHCP/static IP address\nDefault gateway's address\n\n|Col1|netstat.exe net.exe user32.dll gdi32.dll shell32.dll|\n|---|---|\n|lnk|Search for LNK files, parse and print their contents|\n|info|Print out general system information: CPU type memory status computer name Windows and Internet Explorer version numbers Windows installation path Codepage|\n|dl|Print information about the disks: Type Free/used space List of partitions, their filesystem types|\n|ps|List all running processes|\n|logdump|Unfinished, only displays the parameter description|\n|reglist|Dump registry information for a local or remote hive|\n|windows|Enumerate all available desktops and all open windows|\n|view|List all visible servers in a domain|\n|domains|List the domain controllers in the network|\n|shares|List all visible network shares|\n|regs|Print additional system information from the registry: IE version Outlook Express version Logon default user name System installation date BIOS date CPU frequency System root directory|\n\n\n-----\n\n|who|List the names of current users and the domains accessed by the machine|\n|---|---|\n|net nbtstat tracert ipconfig netstat ping|Run the corresponding system utility and print the results|\n|tel|Connect to a given TCP port of a host, send a string provided by the operator, print out the response|\n|dns arps|Resolve a host using DNS or ARP requests|\n|users|List information about all user accounts|\n|admins|List information about user accounts with administrative privileges|\n|groups|List information about user groups|\n|trusts|List information about interdomain trust user accounts|\n|packages|Print the names of installed software packages|\n|sharepw|Run a brute-force login attack trying to obtain the password of a remote share|\n|sharelist|Connect to a remote share|\n|srvinfo|Retrieve current configuration information for the specified server|\n|netuse|Connect, disconnect or list network shares|\n|netshare|Create or remove network shares on the current machine|\n|nbstat|List NetBIOS LAN adapter information|\n|run|Create a process and redirect its output to the operator|\n|system|Run an arbitrary command using WinExec API|\n|exit|Exit the program|\n|set|Set various internal variables used in other shell commands|\n|su|Log on as a different user|\n|kill|Terminate a process by its PID|\n|kpinst|Modify the registry value: [HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon] System This value should normally point to \"lsass.exe\".|\n|svc drv|Create, modify or remove a system service|\n|help ?|Print the list of supported commands|\n\n\nThe Legspin module we recovered doesn't have a built-in C&C mechanism. Instead, it relies on the Regin\n\nplatform to redirect the console input/output to/from the operators.\n\n## Conclusions\n\nUnlike most other Regin modules, Legspin and Hopscotch appear to be stand-alone tools developed much\n\n\n-----\n\nthat not all Regin deployments contain the Legspin module; in most cases, the attackers manage their\n\nvictims through other Regin platform functions.\n\nThis means that Legspin could have been used independently from the Regin platform, as a simple\n\nbackdoor together with an input/output wrapper.\n\nAlthough more details about Regin are becoming available, there is still a lot that remains unknown. One\n\nthing is already clear – what we know about Regin is probably already retired information that has been\n\nreplaced by new modules and techniques as time passes.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/yezsypczjmt973gpcqfqh5yf9po4zr3c",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.01.22.Regin_Hopscotch_and_Legspin/Regin_Hopscotch_Legspin.pdf"
    ],
    "report_names": [
        "Regin_Hopscotch_Legspin"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1422110666,
    "ts_modification_date": 1422110666,
    "files": {
        "pdf": "https://archive.orkl.eu/630eea3f1bc9158570c53d70fc70b31003305f5c.pdf",
        "text": "https://archive.orkl.eu/630eea3f1bc9158570c53d70fc70b31003305f5c.txt",
        "img": "https://archive.orkl.eu/630eea3f1bc9158570c53d70fc70b31003305f5c.jpg"
    }
}