{
    "id": "055aeeb1-d865-4999-8fc7-c05c67cea899",
    "created_at": "2023-01-12T15:08:07.021965Z",
    "updated_at": "2025-03-27T02:16:13.962004Z",
    "deleted_at": null,
    "sha1_hash": "7ccea6a6fadcd4f95825e6fa563f5b603f2f2daa",
    "title": "2022-05-11 - Analysis of an Iranian APTs E400 PowGoop Variant Reveals Dozens of Control Servers Dating Back to 202",
    "authors": "",
    "file_creation_date": "2022-05-25T20:36:39Z",
    "file_modification_date": "2022-05-25T20:36:39Z",
    "file_size": 1036188,
    "plain_text": "# Analysis of an Iranian APTs “E400” PowGoop Variant Reveals Dozens of Control Servers Dating Back to 2020\n\n**[security.ntt/blog/analysis-of-an-iranian-apts-e400-powgoop-variant](https://www.security.ntt/blog/analysis-of-an-iranian-apts-e400-powgoop-variant)**\n\nMay 11, 2022\n\n## Executive Summary\n\nOn January 12th, 2022, the U.S. Cyber Command’s Cyber National Mission Force (CNMF)\n[released a report exposing malicious samples related to the offensive toolset of the Iranian](https://www.cybercom.mil/Media/News/Article/2897570/iranian-intel-cyber-suite-of-malware-uses-open-source-tools/)\nAPT group tracked by NTT Security Holdings (NTTSH) as ENT-11.\n\nThe [@CNMF_CyberAlert releases malware samples as part of CYBERCOM's persistent](https://twitter.com/CNMF_CyberAlert?ref_src=twsrc%5Etfw)\nengagement efforts, sharing malicious cyber activity we assess has the greatest impact on\n[improving global cybersecurity. #MuddyWater](https://twitter.com/hashtag/MuddyWater?src=hash&ref_src=twsrc%5Etfw) [https://t.co/rdEvr2KJWs@State_Cyber](https://t.co/rdEvr2KJWs) [@FBI](https://twitter.com/FBI?ref_src=twsrc%5Etfw)\n[@CISAgov](https://twitter.com/CISAgov?ref_src=twsrc%5Etfw) [@DeptofDefense](https://twitter.com/DeptofDefense?ref_src=twsrc%5Etfw) [pic.twitter.com/TDu0BB8kle](https://t.co/TDu0BB8kle)\n\n[— U.S. Cyber Command (@US_CYBERCOM) January 12, 2022](https://twitter.com/US_CYBERCOM/status/1481381542106644480?ref_src=twsrc%5Etfw)\n\nMultiple samples of ENT-11s malware known as PowGoop were released, including samples\nfor all three of the main components that make up the PowGoop infection chain.\n\nInsights gained from technical analysis of the final backdoor component of the PowGoop\nmalware has allowed NTTSH analysts the ability to identify dozens of PowGoop command\nand control servers dating back to October 2020. These control servers are related to a\nPowGoop variant dubbed “E400” by the NTTSH analyst team.\n\n\n-----\n\nUtilizing proprietary internet backbone data available to NTTSH shows three clusters of\nvictims can be observed since the beginning of 2022.\n\nTracking efforts by NTTSH analysts show ENT-11 is almost certainly winding down\noperations for the E400-PowGoop variant, as no new control servers for this variant have\nbeen observed since the end of 2021, and only one server is still active at the time of writing.\n\n## ENT-11\n\nENT-11, tracked publicly as MuddyWater, Seedworm, Static Kitten, and MERCURY, is\nprimarily an espionage and geopolitically motivated adversary that is attributed by the US\nCyber Command as being a subordinate element within the Iranian Ministry of Intelligence\n(MOIS).\n\n[The adversary’s recent toolset has been well-documented, and](https://www.cisa.gov/uscert/sites/default/files/publications/AA22-055A_Iranian_Government-Sponsored_Actors_Conduct_Cyber_Operations.pdf) [leaks over the past few years](https://cybershafarat.com/2019/04/23/green-leakers-infosec-beyond-lotusint-standby-for-a-possible-leak-on-muddywater/)\n[have proven useful for continued research into how the group has probably operated The](https://cybershafarat.com/2020/05/12/farzin-karimi/)\nthreat actor is known to target foreign governments, as well as organizations from the private\nsector in areas such as telecommunications and energy. In recent investigations NTTSH\nanalysts have also identified victims from within intergovernmental economic cooperation\norganizations, and the banking sector.\n\n[The actor is publicly reported to primarily target geographic neighbours in the Middle East,](https://attack.mitre.org/groups/G0069/)\n[but wide-ranging global targeting has also been reported. This is not unexpected given](https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-055a)\ntargeting orders are believed to come directly from MOIS, and hence follow the everchanging\ngeopolitical landscape.\n\nENT-11 seeks to maintain stealth in their operations by using techniques such as DLL\nsideloading to disguise command and control traffic as legitimate activity. Additionally, the\nadversary is often observed using custom lightweight encoding and obfuscation schemes to\nbypass detection.\n\nAlthough portions of the adversary’s toolset and infrastructure have recently been exposed\npublicly, the actor has shown the ability to adapt by modifying tools, and creating new\nvariants. NTTSH analysts believe that it is almost certain that the actor will continue to do\nthis throughout 2022.\n\n## High-level Overview of PowGoop\n\nPowGoop is a foundational part of ENT-11s offensive toolset and has been used against highlevel targets since 2020.\n\n[The first known variant of PowGoop was reported on in September 2020 by the Unit42 team](https://unit42.paloaltonetworks.com/thanos-ransomware/)\nat Palo Alto where a possible (but still unproven) connection was made to intrusions\ninvolving the destructive use of Thanos ransomware against state-run organizations in the\n\n\n-----\n\nMiddle East and North Africa in July of the same year.\n\n[A report called “Operation Quicksand” by ClearSky Cyber Security followed shortly thereafter](https://www.clearskysec.com/wp-content/uploads/2020/10/Operation-Quicksand.pdf)\noutlining an offensive campaign they observed against Israeli organizations in September\n2020 where a new harder to detect PowGoop variant was being deployed.\n\nThe new variant of PowGoop highlighted by the ClearSky report is the probable precursor to\nthe pervasive “E400” PowGoop variant observed to be used since October 2020 by NTTSH\nanalysts.\n\nPowGoop has a multistage infection chain that employs techniques such as DLL sideloading\nand obfuscation to bypass detection.\n\nScheduled tasks have been reported to be used for maintaining persistence with PowGoop.\n\nDue to the DLL side-loading method employed, PowGoop command and control traffic\nstealthily runs under a legitimate process such as Google Update Service, and as such can\nfurther hinder analysis.\n\nThe PowGoop malware set itself can be divided logically into three parts :\n\nDLL loader\nPowerShell script that acts as a decrypter and a loader\nPowerShell backdoor that offers code execution and downloader capabilities while\nmaintaining command and control over the victim\n\n[Some reports have observed that PowGoop may be deployed via the remote execution tool](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east)\nRemadmin, but others such as ClearSky have reported on downloads being observed from\ncontrol servers after initial access has been made.\n\nIt is reported that PowGoop arrives on a victim host in a zip file called “google.zip” which\ncontains the necessary malicious components\n\n\n-----\n\n_Figure 2. High-level overview of a PowGoop infection chain_\n\nAs [multiple reports have been released recently that have done an excellent job of](https://malpedia.caad.fkie.fraunhofer.de/details/ps1.powgoop)\n[summarizing the PowGoop infection chain, we choose to focus our attention on a technical](https://www.picussecurity.com/resource/blog/ttp-ioc-used-by-muddywater-apt-group-attacks)\ndeep dive of the final payload - the PowerShell backdoor.\n\n## Technical Analysis of the PowerShell Backdoor Component\n\nThe final payload of the PowGoop infection chain is the PowerShell script that contains the\ncommand and control functionality of the malware.\n\n\n-----\n\n[Analysis of a mostly decrypted and deobfuscated sample uploaded by the U.S. Cyber](https://www.virustotal.com/gui/file/9cb79736302999a7ec4151a43e93cd51c97ede879194cece5e46b4ff471a7af7/detection)\nCommand shows the script is built to be proxy aware, and contains a hard-coded user-agent,\nand control server to contact.\n\n_Figure 3. Proxy aware with hardcoded user-agent and control server_\n\nA hard-coded GUID is also observed.\n\n_Figure 4. Hard-coded GUID_\n\nThe script contains four functions (encode, c, decode, GET) along with a while loop that is\nused to maintain command and control.\n\nWhen the script is executed the while loop begins.\n\n_Figure 5. The first part of the while loop is for initiating the victim check-in_\n\nAn initial request is initiated towards the hard-coded control server using the hard-coded\nGUID as the $id input (and nothing for $ct) of the call to the GET function.\n\n_Figure 6. The GET function contains the web request and response functionality_\n\nA custom header “Authorization” is added to the request with the hard-coded GUID as the\nvalue. This request serves as the initial check-in and identification of the victim host.\n\n\n-----\n\n_Figure 7. Initial victim check-in using the hard-coded user-agent and control server. A_\n_custom Authorization header with hard-coded GUID as the value is also added._\n\nWhen the control server receives the request, it will either respond with an encoded and\nobfuscated command to be executed by the victim, or “ERROR 400” will be given.\n\n_Figure 8. The response from the control server to the victim check-in is either command(s)_\n_to be executed on the victim host, or “ERROR 400”_\n\nThe response from the control server is returned by the GET function as a string and dictates\nthe execution path the malware takes.\n\nAs only a single parameter was passed to the GET function for this first request, the part of\nthe code in the GET function affecting the second parameter is reserved for later requests.\n\nThe next part of the while loop initiates another request towards the control server, but this\ntime the response received from the first request is now added as the value of the\nAuthorization header.\n\n_Figure 9. Second request initiated in the while loop towards the control server_\n\n\n-----\n\n_Figure 10. The second request towards the control server contains the response from the_\n_first request as the value in the Authorization header_\n\nA check is then made in the while loop specifically if the response of “ERROR 400” was\nreceived in the response body.\n\nIf the “ERROR 400” response body was received, the malware then enters an infinite loop\nand keeps trying to check-in to the control server until a command is received.\n\n_Figure 11. Checking for “ERROR 400”_\n\nIf the response served by the control server to the check-in requests is not “ERROR 400”,\nthen it is a command to be executed on the victim host.\n\nThe command received is first run through a decode function:\n\n_Figure 12. Call to the decode function_\n\nThe decode function is as follow:\n\n_Figure 13. Function to decode the response served by the control server_\n\nThe function decodes a response by first taking every 2nd character starting from the 1st (so\n1,3,5 …) to form a new string. That string is then base64 decoded.\n\n\n-----\n\nAs an example, the response dQ2rhlvYYnWO1ap would first be reduced to d2hvYW1p,\nwhich would then be base64 decoded to the command “whoami”.\n\nThe command will then be executed on the victim host using Invoke-Expression (IEX).\n\nThe results of the command execution will be passed back to the GET function along with the\ncommand that was executed (the command string passed back to GET is still in its encoded\nand obfuscated form).\n\n_Figure 14. Logic to execute the command on the victim host with Invoke-Expression, and_\n_then initiate another request towards the control server with the results using the GET_\n_function_\n\nAs values are now passed to the GET function for both parameters, the following logic will be\nused to encode the results of the command execution on the victim host, and then the value\nwill be added to a new “Cookie” header in the request.\n\n_Figure 15. Encoding the result of the command executed and adding as a value to a new_\n_Cookie header_\n\nThe encode functionality is simply the reverse of what was observed in the decode function.\n\nAs can be seen below, the result of the command execution is first base64 encoded, and then\nobfuscated by inserting a random upper or lowercase letter (generated through calls to the c\nfunction) after each character of the base64 encoded string.\n\n\n-----\n\n_Figure 16. Lightweight encoding and obfuscation routine_\n\nAfter encoding and obfuscating the results, a request will then be made towards the control\nserver such as the following example which shows the results of executing “whoami” on a\nvictim host with IEX.\n\n_Figure 17. Request towards control server with results of the command execution added as_\n_a value of a new Cookie header. The command executed is in the Authorization header still_\n_in its encoded and obfuscated form._\n\nThe backdoor then goes to sleep for a hard-coded number of minutes (50 minutes in this\ncase) and then begins again at the start of the while loop which maintains command and\ncontrol.\n\n_Figure 18. Hard-coded backdoor sleep time_\n\nA more visual example of traffic starting with the initial victim check-in request at the top is:\n\n\n-----\n\n_Figure 19. Overview of example network traffic based on execution paths of the PowGoop_\n_backdoor_\n\n## Tracking ENT-11 “E400” PowGoop Infrastructure\n\nNTT Security Holdings through insights gained from NTT owning and operating one of the\nworld’s largest ISP backbones continuously maps threat actor infrastructure, both in\nrealtime, and by using novel threat research as a starting point to correlate in the historical\ndata.\n\nUsing the knowledge gained from the technical deep-dive into the functionality of the\nPowGoop backdoor component, NTTSH analysts were able to use both open-source and\nproprietary backbone data sources to pivot on, and attribute dozens of previously unknown\nPowGoop control servers to ENT-11.\n\nThe following control servers have been found and are sorted on approximate dates of known\nactivity (this information is also included in the IOC section at the end of the report):\n\n\n-----\n\n**Last Observed**\n**(≈)**\n\n\n**PowGoop Control Server**\n\n\n**First**\n**Observed (≈)**\n\n\n164.132.237[.]79 11/26/2021 1/15/2022\n\n178.32.30[.]1 11/25/2021 1/16/2022\n\n37.187.204[.]27 11/23/2021 1/14/2022\n\n51.255.19[.]178 11/22/2021 1/14/2022\n\n51.255.19[.]179 11/21/2021 1/17/2022\n\n164.132.237[.]65 11/18/2021 12/24/2021\n\n164.132.237[.]66 10/28/2021 1/9/2022\n\n185.141.27[.]143 10/18/2021 10/26/2021\n\n80.85.158[.]49 10/18/2021 10/18/2021\n\n185.141.27[.]248 10/15/2021 11/12/2021\n\n185.183.96[.]7 10/1/2021 11/13/2021\n\n185.183.96[.]44 10/1/2021 11/12/2021\n\n192.3.161[.]218 9/8/2021 still active as of\n4/6/2022\n\n23.94.7[.]9 8/31/2021 1/15/2022\n\n96.8.121[.]193 8/29/2021 3/3/2022\n\n23.94.24[.]78 7/23/2021 1/13/2022\n\n23.94.24[.]76 7/18/2021 2/9/2022\n\n185.45.192[.]228 7/11/2021 11/11/2021\n\n23.94.24[.]77 7/6/2021 8/18/2021\n\n107.172.165[.]182 6/17/2021 7/3/2021\n\n107.175.57[.]83 6/16/2021 1/14/2022\n\n107.172.165[.]17 6/16/2021 6/23/2021\n\n192.210.226[.]128 4/21/2021 11/5/2021\n\n107.175.95[.]102 11/23/2020 7/24/2021\n\n172.245.81[.]135 11/18/2020 6/12/2021\n\n\n-----\n\n**Last Observed**\n**(≈)**\n\n\n**PowGoop Control Server**\n\n\n**First**\n**Observed (≈)**\n\n\n104.168.98[.]148 11/12/2020 7/25/2021\n\n192.210.191[.]188 11/10/2020 7/24/2021\n\n198.144.190[.]132 11/4/2020 4/24/2021\n\n172.245.157[.]101 10/28/2020 10/28/2020\n\n23.94.7[.]134 10/26/2020 8/16/2021\n\n23.95.8[.]149 10/26/2020 1/26/2021\n\n96.8.121[.]101 10/14/2020 8/17/2021\n\n107.175.95[.]101 10/13/2020 10/13/2020\n\n192.3.161[.]182 10/10/2020 8/26/2021\n\n_Table 1. Identified ENT-11 PowGoop control servers_\n_for the “E400” variant_\n\nIt should be noted that the dates given above are approximate. As such, NTTSH analysts\nstrongly urge additional investigation of any activity discovered around (but outside) the\ngiven timeframes.\n\nAn interesting observation is that the date of the first actively observed control server on\n[2020-10-10 came approximately five weeks after the Unit 42 team at Palo Alto released the](https://unit42.paloaltonetworks.com/thanos-ransomware/)\nfirst public research on PowGoop, and just a few days before the ClearSky “Operation\nQuicksand” report was released.\n\nAn almost certain new variant such as “E400” being observed within this timeframe\ncontinues to lend evidence to the groups willingness to adapt through the modification of\ntheir tools, and the creation of new variants as their activities are investigated and reported\non publicly.\n\nAnother interesting observation is the considerable number of control servers that appeared\nto go offline in the days following the January 12th release by the U.S. Cyber Command team.\nNo analytic judgements are made on the reason for this due to the lack of any further\nevidence at this time to substantiate such a judgement.\n\n## Victimology\n\nSearching the proprietary historical data available to NTTSH analysts for the identified\ncontrol servers shows three victim clusters can be observed since the beginning of 2022:\n\n\n-----\n\n1. Multiple victims from government ministries and municipal governments that overlaps\n\n[with what was recently reported by the Cisco Talos team](https://blog.talosintelligence.com/2022/01/iranian-apt-muddywater-targets-turkey.html)\n2. An intergovernmental economic cooperation organization\n3. A large Central Asian bank\n\nPassive reconnaissance reveals multiple victims have exposed services for Fortinet FortiOS\nand/or Microsoft Exchange. Although NTTSH analysts cannot say definitively at this time\n[how initial access was gained, a joint cybersecurity advisory was recently released stating](https://www.cisa.gov/uscert/ncas/alerts/aa21-321a)\nthese services have been actively targeted in 2021 for initial access by Iranian APT groups\n\n## Conclusion\n\nIn this report NTTSH analysts have provided a high-level overview of the threat actor ENT11\nand the infection chain of their PowGoop malware. A technical deep dive was given for the\nPowerShell backdoor component of a PowGoop variant dubbed by NTTSH analysts as\n“E400”.\n\nInsights gained from the deep dive were used to identify dozens of previously unknown\nmalicious control servers, and some interesting observations of the data was provided. A\nsearch was then conducted in the historical internet backbone data available to NTTSH\nanalysts, and observed victims were clustered.\n\nPassive reconnaissance of the victims provided possible further context.\n\n## IOCS\n\n**PowGoop Control Server** **First Observed (≈)** **Last Observed (≈)**\n\n164.132.237[.]79 11/26/2021 1/15/2022\n\n178.32.30[.]1 11/25/2021 1/16/2022\n\n37.187.204[.]27 11/23/2021 1/14/2022\n\n51.255.19[.]178 11/22/2021 1/14/2022\n\n51.255.19[.]179 11/21/2021 1/17/2022\n\n164.132.237[.]65 11/18/2021 12/24/2021\n\n164.132.237[.]66 10/28/2021 1/9/2022\n\n185.141.27[.]143 10/18/2021 10/26/2021\n\n80.85.158[.]49 10/18/2021 10/18/2021\n\n185.141.27[.]248 10/15/2021 11/12/2021\n\n\n-----\n\n**PowGoop Control Server** **First Observed (≈)** **Last Observed (≈)**\n\n185.183.96[.]7 10/1/2021 11/13/2021\n\n185.183.96[.]44 10/1/2021 11/12/2021\n\n192.3.161[.]218 9/8/2021 still active as of 4/6/2022\n\n23.94.7[.]9 8/31/2021 1/15/2022\n\n96.8.121[.]193 8/29/2021 3/3/2022\n\n23.94.24[.]78 7/23/2021 1/13/2022\n\n23.94.24[.]76 7/18/2021 2/9/2022\n\n185.45.192[.]228 7/11/2021 11/11/2021\n\n23.94.24[.]77 7/6/2021 8/18/2021\n\n107.172.165[.]182 6/17/2021 7/3/2021\n\n107.175.57[.]83 6/16/2021 1/14/2022\n\n107.172.165[.]17 6/16/2021 6/23/2021\n\n192.210.226[.]128 4/21/2021 11/5/2021\n\n107.175.95[.]102 11/23/2020 7/24/2021\n\n172.245.81[.]135 11/18/2020 6/12/2021\n\n104.168.98[.]148 11/12/2020 7/25/2021\n\n192.210.191[.]188 11/10/2020 7/24/2021\n\n198.144.190[.]132 11/4/2020 4/24/2021\n\n172.245.157[.]101 10/28/2020 10/28/2020\n\n23.94.7[.]134 10/26/2020 8/16/2021\n\n23.95.8[.]149 10/26/2020 1/26/2021\n\n96.8.121[.]101 10/14/2020 8/17/2021\n\n107.175.95[.]101 10/13/2020 10/13/2020\n\n192.3.161[.]182 10/10/2020 8/26/2021\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-11 - Analysis of an Iranian APTs E400 PowGoop Variant Reveals Dozens of Control Servers Dating Back to 202.pdf"
    ],
    "report_names": [
        "2022-05-11 - Analysis of an Iranian APTs E400 PowGoop Variant Reveals Dozens of Control Servers Dating Back to 202.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536087,
    "ts_updated_at": 1743041773,
    "ts_creation_date": 1653510999,
    "ts_modification_date": 1653510999,
    "files": {
        "pdf": "https://archive.orkl.eu/7ccea6a6fadcd4f95825e6fa563f5b603f2f2daa.pdf",
        "text": "https://archive.orkl.eu/7ccea6a6fadcd4f95825e6fa563f5b603f2f2daa.txt",
        "img": "https://archive.orkl.eu/7ccea6a6fadcd4f95825e6fa563f5b603f2f2daa.jpg"
    }
}