{
    "id": "05661a96-e4f1-47e0-b2c1-7a4f4768c7d8",
    "created_at": "2023-01-12T15:07:44.862931Z",
    "updated_at": "2025-03-27T02:16:26.046284Z",
    "deleted_at": null,
    "sha1_hash": "7723badb89e710a0612ed9dc1096fd8ff83a6af3",
    "title": "2021-12-03 - Who Is the Network Access Broker ‘Babam’-",
    "authors": "",
    "file_creation_date": "2022-05-28T04:11:37Z",
    "file_modification_date": "2022-05-28T04:11:37Z",
    "file_size": 480093,
    "plain_text": "# Who Is the Network Access Broker ‘Babam’?\n\n**[krebsonsecurity.com/2021/12/who-is-the-network-access-broker-babam/](https://krebsonsecurity.com/2021/12/who-is-the-network-access-broker-babam/)**\n\nRarely do cybercriminal gangs that deploy ransomware gain the initial access to the target\nthemselves. More commonly, that access is purchased from a cybercriminal broker who\nspecializes in acquiring remote access credentials — such as usernames and passwords\nneeded to remotely connect to the target’s network. In this post we’ll look at the clues left\nbehind by “Babam,” the handle chosen by a cybercriminal who has sold such access to\nransomware groups on many occasions over the past few years.\n\nSince the beginning of 2020, Babam has set up numerous auctions on the Russian-language\ncybercrime forum Exploit, mainly selling virtual private networking (VPN) credentials stolen\nfrom various companies. Babam has authored more than 270 posts since joining Exploit in\n2015, including dozens of sales threads. However, none of Babam’s posts on Exploit include\nany personal information or clues about his identity.\n\n\n-----\n\nBut in February 2016, Babam joined Verified, another Russian-language crime forum.\nVerified was hacked at least twice in the past five years, and its user database posted online.\nThat information shows that Babam joined Verified using the email address\n“operns@gmail.com.” The latest Verified leak also exposed private messages exchanged\nby forum members, including more than 800 private messages that Babam sent or received\non the forum over the years.\n\nIn early 2017, Babam confided to another Verified user via private message that he is from\nLithuania. In virtually all of his forum posts and private messages, Babam can be seen\ncommunicating in transliterated Russian rather than by using the Cyrillic alphabet. This is\ncommon among cybercriminal actors for whom Russian is not their native tongue.\n\n[Cyber intelligence platform Constella Intelligence told KrebsOnSecurity that the](https://www.constellaintelligence.com/)\noperns@gmail.com address was used in 2016 to register an account at filmai.in, which is a\nmovie streaming service catering to Lithuanian speakers. The username associated with that\naccount was “bo3dom.”\n\nA reverse WHOIS search via [DomainTools.com says operns@gmail.com was used to](https://www.domaintools.com/)\nregister two domain names: bonnjoeder[.]com back in 2011, and sanjulianhotels[.]com\n(2017). It’s unclear whether these domains ever were online, but the street address on both\nrecords was “24 Brondeg St.” in the United Kingdom. [Full disclosure: DomainTools is a\nfrequent advertiser on this website.]\n\nA reverse search at DomainTools on “24 Brondeg St.” reveals one other domain:\n**wwwecardone[.]com. The use of domains that begin with “www” is fairly common among**\n[phishers, and by passive “typosquatting” sites that seek to siphon credentials from legitimate](https://krebsonsecurity.com/2018/04/dot-cm-typosquatting-sites-visited-12m-times-so-far-in-2018/)\nwebsites when people mistype a domain, such as accidentally omitting the “.” after typing\n“www”.\n\nA banner from the homepage of the Russian language cybercrime forum Verified.\n\nSearching DomainTools for the phone number in the WHOIS records for\nwwwecardone[.]com — +44.0774829141 — leads to a handful of similar typosquatting\ndomains, including wwwebuygold[.]com and wwwpexpay[.]com. A different UK phone\nnumber in a more recent record for the wwwebuygold[.]com domain — 44.0472882112 — is\ntied to two more domains – howtounlockiphonefree[.]com, and portalsagepay[.]com. All\nof these domains date back to between 2012 and 2013.\n\n\n-----\n\nThe original registration records for the iPhone, Sagepay and Gold domains share an email\naddress: devrian26@gmail.com. A search on the username “bo3dom” using Constella’s\nservice reveals an account at ipmart-forum.com, a now-defunct forum concerned with IT\nproducts, such as mobile devices, computers and online gaming. That search shows the\nuser bo3dom registered at ipmart-forum.com with the email address devrian27@gmail.com,\nand from an Internet address in Vilnius, Lithuania.\n\nDevrian27@gmail.com was used to register multiple domains, including\n**wwwsuperchange.ru back in 2008 (notice again the suspect “www” as part of the domain**\nname). Gmail’s password recovery function says the backup email address for\ndevrian27@gmail.com is bo3*******@gmail.com. Gmail accepts the address\n**bo3domster@gmail.com as the recovery email for that devrian27 account.**\n\nAccording to Constella, the bo3domster@gmail.com address was exposed in multiple data\nbreaches over the years, and in each case it used one of two passwords: “lebeda1” and\n“a123456“.\n\nSearching in Constella for accounts using those passwords reveals a slew of additional\n“bo3dom” email addresses, including bo3dom@gmail.com. Pivoting on that address in\nConstella reveals that someone with the name Vytautas Mockus used it to register an\naccount at mindjolt.com, a site featuring dozens of simple puzzle games that visitors can\nplay online.\n\nAt some point, mindjolt.com apparently also was hacked, because a copy of its database at\nConstella says the bo3dom@gmail.com used two passwords at that site: lebeda1 and\n**a123456.**\n\nA reverse WHOIS search on “Vytautas Mockus” at DomainTools shows the email address\n**devrian25@gmail.com was used in 2010 to register the domain name perfectmoney[.]co.**\nThis is one character off of [perfectmoney[.]com, which is an early virtual currency that was](https://en.bitcoin.it/wiki/Perfect_Money)\nquite popular with cybercriminals at the time. The phone number tied to that domain\nregistration was “86.7273687“.\n\nA Google search for “Vytautas Mockus” says there’s a person by that name who runs a\nmobile food service company in Lithuania called “Palvisa.” A [report on Palvisa (PDF)](https://krebsonsecurity.com/wp-content/uploads/2021/12/302610044-2559-e71f3.pdf)\npurchased from Rekvizitai.vz — an official online directory of Lithuanian companies — says\nPalvisa was established in 2011 by a Vytautaus Mockus, using the phone number\n**86.7273687, and the email address bo3dom@gmail.com. The report states that Palvisa is**\nactive, but has had no employees other than its founder.\n\nReached via the bo3dom@gmail.com address, the 36-year-old Mr. Mockus expressed\nmystification as to how his personal information wound up in so many records. “I am not\ninvolved in any crime,” Mockus wrote in reply.\n\n\n-----\n\nA rough mind map of the connections mentioned in this story.\n\nThe domains apparently registered by Babam over nearly 10 years suggest he started off\nmainly stealing from other cybercrooks. By 2015, Babam was heavily into “carding,” the sale\nand use of stolen payment card data. By 2020, he’d shifted his focus almost entirely to\nselling access to companies.\n\n[A profile produced by threat intelligence firm Flashpoint says Babam has received at least](https://www.flashpoint-intel.com/)\nfour positive feedback reviews on the Exploit cybercrime forum from crooks associated with\nthe [LockBit ransomware gang.](https://www.cybereason.com/blog/rising-threat-from-lockbit-ransomware)\n\nThe ransomware collective LockBit giving Babam positive feedback for selling access to different\n\nvictim organizations. Image: Flashpoint\n\n\n-----\n\nAccording to Flashpoint, in April 2021 Babam advertised the sale of Citrix credentials for an\ninternational company that is active in the field of laboratory testing, inspection and\ncertification, and that has more than $5 billion in annual revenues and more than 78,000\nemployees.\n\nFlashpoint says Babam initially announced he’d sold the access, but later reopened the\nauction because the prospective buyer backed out of the deal. Several days later, Babam\nreposted the auction, adding more information about the depth of the illicit access and\nlowering his asking price. The access sold less than 24 hours later.\n\n“Based on the provided statistics and sensitive source reporting, Flashpoint analysts assess\nwith high confidence that the compromised organization was likely Bureau Veritas, an\norganization headquartered in France that operates in a variety of sectors,” the company\nconcluded.\n\nIn November, Bureau Veritas acknowledged that it shut down its network in response to a\ncyber attack. The company hasn’t said whether the incident involved ransomware and if so\nwhat strain of ransomware, but its response to the incident is straight out of the playbook for\nresponding to ransomware attacks. Bureau Veritas has not yet responded to requests for\ncomment; its [latest public statement on Dec. 2 provides no additional details about the cause](https://group.bureauveritas.com/newsroom/update-cyber-attack)\nof the incident.\n\nFlashpoint notes that Babam’s use of transliterated Russian persists on both Exploit and\nVerified until around March 2020, when he switches over to using mostly Cyrillc in his forum\ncomments and sales threads. Flashpoint said this could be an indication that a different\nperson started using the Babam account since then, or more likely that Babam had only a\ntenuous grasp of Russian to begin with and that his language skills and confidence improved\nover time.\n\nLending credence to the latter theory is that Babam still makes linguistic errors in his\npostings that suggest Russian is not his original language, Flashpoint found.\n\n“The use of double “n” in such words as “проданно” (correct – продано) and “сделанны”\n(correct – сделаны) by the threat actor proves that this style of writing is not possible when\nusing machine translation since this would not be the correct spelling of the word,” Flashpoint\nanalysts wrote.\n\n“These types of grammatical errors are often found among people who did not receive\nsufficient education at school or if Russian is their second language,” the analysis continues.\n“In such cases, when someone tries to spell a word correctly, then by accident or\nunknowingly, they overdo the spelling and make these types of mistakes. At the same time,\ncolloquial speech can be fluent or even native. This is often typical for a person who comes\nfrom the former Soviet Union states.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-03 - Who Is the Network Access Broker ‘Babam’-.pdf"
    ],
    "report_names": [
        "2021-12-03 - Who Is the Network Access Broker ‘Babam’-.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536064,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653711097,
    "ts_modification_date": 1653711097,
    "files": {
        "pdf": "https://archive.orkl.eu/7723badb89e710a0612ed9dc1096fd8ff83a6af3.pdf",
        "text": "https://archive.orkl.eu/7723badb89e710a0612ed9dc1096fd8ff83a6af3.txt",
        "img": "https://archive.orkl.eu/7723badb89e710a0612ed9dc1096fd8ff83a6af3.jpg"
    }
}