{
    "id": "056f16b6-4216-4e18-9535-4eea8f8a84d7",
    "created_at": "2022-10-25T16:48:16.297142Z",
    "updated_at": "2025-03-27T02:16:16.855545Z",
    "deleted_at": null,
    "sha1_hash": "b8d1d27753e223c940bd1e4e3da2ceaa9aa5c798",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-08-08T03:37:53Z",
    "file_modification_date": "2019-08-08T03:37:53Z",
    "file_size": 443008,
    "plain_text": "# APT41: A Dual Espionage and Cyber Crime Operation\n\n**[fireeye.com/blog/threat-research/2019/08/apt41-dual-espionage-and-cyber-crime-operation.html](https://www.fireeye.com/blog/threat-research/2019/08/apt41-dual-espionage-and-cyber-crime-operation.html)**\n\nToday, FireEye Intelligence is releasing a comprehensive report detailing APT41, a prolific\nChinese cyber threat group that carries out state-sponsored espionage activity in parallel with\nfinancially motivated operations. APT41 is unique among tracked China-based actors in that it\nleverages non-public malware typically reserved for espionage campaigns in what appears to be\nactivity for personal gain. Explicit financially-motivated targeting is unusual among Chinese statesponsored threat groups, and evidence suggests APT41 has conducted simultaneous cyber\ncrime and cyber espionage operations from 2014 onward.\n\n[The full published report covers historical and ongoing activity attributed to APT41, the evolution](http://content.fireeye.com/apt41/rpt-apt41)\nof the group’s tactics, techniques, and procedures (TTPs), information on the individual actors, an\noverview of their malware toolset, and how these identifiers overlap with other known Chinese\nespionage operators. APT41 partially coincides with public reporting on groups including BARIUM\n[(Microsoft) and Winnti (Kaspersky, ESET, Clearsky).](https://www.microsoft.com/security/blog/2017/01/25/detecting-threat-actors-in-recent-german-industrial-attacks-with-windows-defender-atp/)\n\n## Who Does APT41 Target?\n\nLike other Chinese espionage operators, APT41 espionage targeting has generally aligned with\n[China's Five-Year economic development plans. The group has established and maintained](https://www.uscc.gov/sites/default/files/Research/The%2013th%20Five-Year%20Plan_Final_2.14.17_Updated%20%28002%29.pdf)\nstrategic access to organizations in the healthcare, high-tech, and telecommunications sectors.\nAPT41 operations against higher education, travel services, and news/media firms provide some\nindication that the group also tracks individuals and conducts surveillance. For example, the\ngroup has repeatedly targeted call record information at telecom companies. In another instance,\nAPT41 targeted a hotel’s reservation systems ahead of Chinese officials staying there,\nsuggesting the group was tasked to reconnoiter the facility for security reasons.\n\nThe group’s financially motivated activity has primarily focused on the video game industry, where\nAPT41 has manipulated virtual currencies and even attempted to deploy ransomware. The group\nis adept at moving laterally within targeted networks, including pivoting between Windows and\nLinux systems, until it can access game production environments. From there, the group steals\nsource code as well as digital certificates which are then used to sign malware. More importantly,\nAPT41 is known to use its access to production environments to inject malicious code into\nlegitimate files which are later distributed to victim organizations. These supply chain compromise\ntactics have also been characteristic of APT41’s best known and most recent espionage\ncampaigns.\n\nInterestingly, despite the significant effort required to execute supply chain compromises and the\nlarge number of affected organizations, APT41 limits the deployment of follow-on malware to\nspecific victim systems by matching against individual system identifiers. These multi-stage\noperations restrict malware delivery only to intended victims and significantly obfuscate the\nintended targets. In contrast, a typical spear-phishing campaign’s desired targeting can be\ndiscerned based on recipients' email addresses.\n\nA breakdown of industries directly targeted by APT41 over time can be found in Figure 1.\n\n\n-----\n\nFigure 1: Timeline of industries directly targeted by APT41\n\n## Probable Chinese Espionage Contractors\n\nTwo identified personas using the monikers “Zhang Xuguang” and “Wolfzhi” linked to APT41\noperations have also been identified in Chinese-language forums. These individuals advertised\ntheir skills and services and indicated that they could be hired. Zhang listed his online hours as\n4:00pm to 6:00am, similar to APT41 operational times against online gaming targets and\nsuggesting that he is moonlighting. Mapping the group’s activities since 2012 (Figure 2) also\nprovides some indication that APT41 primarily conducts financially motivated operations outside\nof their normal day jobs.\n\nAttribution to these individuals is backed by identified persona information, their previous work\nand apparent expertise in programming skills, and their targeting of Chinese market-specific\nonline games. The latter is especially notable because APT41 has repeatedly returned to\ntargeting the video game industry and we believe these activities were formative in the group’s\nlater espionage operations.\n\n\n-----\n\nFigure 2: Operational activity for gaming versus non-gaming-related targeting based on observed\noperations since 2012\n\n## The Right Tool for the Job\n\nAPT41 leverages an arsenal of over 46 different malware families and tools to accomplish their\nmissions, including publicly available utilities, malware shared with other Chinese espionage\noperations, and tools unique to the group. The group often relies on spear-phishing emails with\nattachments such as compiled HTML (.chm) files to initially compromise their victims. Once in a\nvictim organization, APT41 can leverage more sophisticated TTPs and deploy additional\nmalware. For example, in a campaign running almost a year, APT41 compromised hundreds of\nsystems and used close to 150 unique pieces of malware including backdoors, credential\nstealers, keyloggers, and rootkits.\n\nAPT41 has also deployed rootkits and Master Boot Record (MBR) bootkits on a limited basis to\nhide their malware and maintain persistence on select victim systems. The use of bootkits in\n\n\n-----\n\n## Fast and Relentless\n\nAPT41 quickly identifies and compromises intermediary systems that provide access to otherwise\nsegmented parts of an organization’s network. In one case, the group compromised hundreds of\nsystems across multiple network segments and several geographic regions in as little as two\nweeks.\n\nThe group is also highly agile and persistent, responding quickly to changes in victim\nenvironments and incident responder activity. Hours after a victimized organization made\nchanges to thwart APT41, for example, the group compiled a new version of a backdoor using a\nfreshly registered command-and-control domain and compromised several systems across\nmultiple geographic regions. In a different instance, APT41 sent spear-phishing emails to multiple\nHR employees three days after an intrusion had been remediated and systems were brought\nback online. Within hours of a user opening a malicious attachment sent by APT41, the group had\nregained a foothold within the organization's servers across multiple geographic regions.\n\n## Looking Ahead\n\nAPT41 is a creative, skilled, and well-resourced adversary, as highlighted by the operation’s\ndistinct use of supply chain compromises to target select individuals, consistent signing of\nmalware using compromised digital certificates, and deployment of bootkits (which is rare among\nChinese APT groups).\n\nLike other Chinese espionage operators, APT41 appears to have moved toward strategic\nintelligence collection and establishing access and away from direct intellectual property theft\nsince 2015. This shift, however, has not affected the group's consistent interest in targeting the\nvideo game industry for financially motivated reasons. The group's capabilities and targeting have\nboth broadened over time, signaling the potential for additional supply chain compromises\naffecting a variety of victims in additional verticals.\n\nAPT41's links to both underground marketplaces and state-sponsored activity may indicate the\ngroup enjoys protections that enables it to conduct its own for-profit activities, or authorities are\nwilling to overlook them. It is also possible that APT41 has simply evaded scrutiny from Chinese\nauthorities. Regardless, these operations underscore a blurred line between state power and\ncrime that lies at the heart of threat ecosystems and is exemplified by APT41.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.08.07.APT41/blog_APT41.pdf"
    ],
    "report_names": [
        "blog_APT41"
    ],
    "threat_actors": [
        {
            "id": "49822165-5541-423d-8808-1c0a9448d588",
            "created_at": "2022-10-25T16:07:23.384093Z",
            "updated_at": "2025-03-27T02:02:09.772829Z",
            "deleted_at": null,
            "main_name": "Barium",
            "aliases": [
                "Brass Typhoon",
                "Pigfish"
            ],
            "source_name": "ETDA:Barium",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Barlaiy",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "POISONPLUG",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041776,
    "ts_creation_date": 1565235473,
    "ts_modification_date": 1565235473,
    "files": {
        "pdf": "https://archive.orkl.eu/b8d1d27753e223c940bd1e4e3da2ceaa9aa5c798.pdf",
        "text": "https://archive.orkl.eu/b8d1d27753e223c940bd1e4e3da2ceaa9aa5c798.txt",
        "img": "https://archive.orkl.eu/b8d1d27753e223c940bd1e4e3da2ceaa9aa5c798.jpg"
    }
}