{
    "id": "05f373bc-3b49-439b-bc3f-c2eccad42337",
    "created_at": "2023-01-12T15:06:11.985029Z",
    "updated_at": "2025-03-27T02:16:43.649004Z",
    "deleted_at": null,
    "sha1_hash": "feafcb5cea260d94c998600c9225217d612d3794",
    "title": "2018-02-28 - CannibalRAT targets Brazil",
    "authors": "",
    "file_creation_date": "2022-05-28T15:55:25Z",
    "file_modification_date": "2022-05-28T15:55:25Z",
    "file_size": 778466,
    "plain_text": "# CannibalRAT targets Brazil\n\n**[blog.talosintelligence.com/2018/02/cannibalrat-targets-brazil.html](http://blog.talosintelligence.com/2018/02/cannibalrat-targets-brazil.html)**\n\n[This post was authored by Warren Mercer and](https://twitter.com/securitybeard) [Vitor Ventura](https://twitter.com/_vventura)\n\n### Introduction\n\n\n-----\n\nTalos has identified two different versions of a RAT, otherwise known as a remote access\ntrojan, that has been written entirely in Python and is wrapped into a standalone executable.\nThe RAT is impacting users of a Brazilian public sector management school.\n\nThe samples of two different versions of this RAT, both versions (3.0 and 4.0 according to the\ninformation within the samples analyzed) were written using Python and packed into an\nexecutable using a common tool called py2exe. The malware main script bytecode is stored\nin a portable executable (PE) section called PYTHONSCRIPT, while the Python DLL is\nstored in a section called PYTHON27.DLL. All the remaining modules' bytecode is\ncompressed and stored in the executable overlay.\n\nBoth versions have all the usual RAT capabilities, however, during our investigation it\nbecame clear that version 4.0 (the latest) is a stripped-down version, where some features\nwere removed, as explained later, to be part of a targeted campaign.\n\nThe target of such campaign are the users of INESAP - Instituto Nacional Escola Superior da\nAdministração Pública, which is a Brazilian public sector management school that also does\nconsulting work.\n\nThe command-and-control infrastructure uses a DNS technique called Fast Flux(ing), which\nallows the hosts to quickly change their resolution, the name servers use 120 seconds for\nTTL and are changed several times a day. The command-and-control is linked to four\nhostnames which, to our records, always point to IP addresses hosted within the same ASN.\n\nThe oldest sample was first seen in the wild on Jan. 8, 2018, while the second (v4.0) was\nfirst observed on Feb. 5, 2018. These dates are coherent with our DNS requests data, which\n\n\n-----\n\nshows that the activity increased after the campaign variant (v4.0) was seen in the wild.\n\n### The RAT\n\nThe RAT is distributed in a py2exe format, with the python27.dll and the python bytecode\nstored as a PE resource and the additional libraries zipped in the overlay of the executable.\n\nThe most recent version of the RAT (v4.0) shares a lot of the code with version 3.0. However,\nit is clear that the authors have attempted to add obfuscation techniques in order to avoid\ndetection.\n\nFirstly, the authors now are distributing the malware packed with a standard version of UPX,\na well-known executable packer, which will hide some of the strings. The python bytecode is\nnot obfuscated in anyway, allowing the trivial reversing back to the source code.\n\nGarbage string generator function\n\nLooking at the source code of both versions, it becomes clear that version 4.0 contains a\nfunction that will generate random strings in memory, thus attempting to make memory string\nanalysis harder.\n\nBoth versions use base16 encoding scheme to obfuscate the command-and-control\nhostnames and the data that is sent during the communications with the command-andcontrol. Although this encoding scheme is described in RFC4648 and is part of the standard\nbase64 Python module, it's usage is uncommon in malware samples that we have analyzed.\n\nThe persistency on both cases is done using the ever-common \"CurrentVersion\\Run\" registry\nkey, using the service name hardcoded in the configuration \"Java_Update\" in both versions.\nUpon installation, version 3.0 will display a message box with the text \"[Error5088] Arquivo\nCorrompido\" which is Brazilian Portuguese for corrupted file, in an attempt to trick the user to\nbelieve that the file is a legitimate PDF file that got corrupted.\n\nMessagebox creation code\n\nAs stated in the introduction, version 4.0 was clearly created as part of a campaign. Upon\ninstallation, it will create a PDF file with HTML code embedded that will load a single image\n\n\n-----\n\nhosted at imgur.com, which attempts to be an official document from the INESAP.\nAfterwards, it will start Chrome to open the created PDF.\n\nCreated pdf content\n\nBoth versions contact the same command-and-control infrastructure. However, the API has\nevolved from a standard web request to a REST-based API. While the web request does not\nexfiltrate any relevant information during the initial contact, the REST API request sends the\nusername, the hostname and other capability related information.\n\n\n-----\n\nVersion 4.0 Command-and-Control contact request\n\nThe self-explanatory module names provide a good summary of the RAT capabilities. Most\nof these modules provide very basic functionally. The network credentials are gathered using\nthe standard Windows API functions CredEnumerate() and CryptUnprotectData(), without\nthe usage of techniques like the well-known Mimikatz. The virtual machine (VM) detection\ncapability is rather basic, based on a simple WMI query and checking only for Vmware,\nVirtualBox and Virtual PC platforms.\n\nVersion 3.0 module list\n\nThe credential-stealer modules are a copy of the Radium-Keylogger, which has the source\ncode published on Github. The VM detection function can also be seen on Github in a\ndifferent repository, the copy of code from other software is a constant in most components\nof this RAT. Most of these capabilities are provided by Python scripts, which can be executed\nstandalone in the command line, which is coherent with code reuse that was described\nabove.\n\nThis is another good example of how much code is shared among the adversaries and how\nhard attribution can be given the level of code sharing and reuse.\n\n\n-----\n\nCapability-wise, both versions share the same code base. However, since version 4.0 seems\nto be configured for a specific campaign, it was not shipped with the full set of modules,\ndistributed denial of service, miner, Python and update being the ones that were not\nincluded. The functionality of the last two can easily be obtained from the runcmd module. It\nalso dropped the Firefox credential-gathering capability, which is in line with the campaign\ndesign.\n\nIn latest version, the module approach was also dropped. Instead, the code was copied-andpasted into the main script.\n\n### The command-and-control\n\nVersion 3.0 only had two command-and-control hostnames a primary and a secondary, the\nnewer version has now four possible hostnames from which, upon execution, will randomly\nchoose one.\n\nCommand-and-control hostnames and ports\n\nThe command-and-control infrastructure attempts to use the fast flux technique to hide,\nalthough the name servers are changing with high frequency, and the end points tend to be\nthe same, all belonging to a telecom provider in Brazil with the autonomous system number\nAS 7738 and shared among all four command-and-control hostnames.\n\nName servers for zxmbernx.camdvr.org\n\n\n-----\n\nBy far the most active hostname is zxmbernx.camdvr.org, which can be explained by the fact\nthat it is the primary command-and-control hostname for version 3.0, while version 4.0 has\nthe hostname randomized.\n\n### The campaign\n\nVersion 4.0 of the RAT was clearly configured to be part of campaign targeting the INESAP, a\nBrazilian school for public administration, as stated before.\n\nAccording to artifacts found in pastebin.com by Talos, seems that the campaign and RAT\ncustomization might have started as early as Jan. 9, 2018.\nThe code found on pastebin.com is an match to the code found in the install module which\nincludes the pdf decoy file generation.\n\n\n-----\n\nComparison between pastbin.com code and decompiled code\n\nThe campaign is highly targeted at this specific region of the world. The adversaries decided\nto drop the Firefox credential-stealer, keeping only the Chrome one. The deception technique\nonly works if Chrome is installed on the system.\n\nAlthough Talos was unable to determine the initial vector, we were able to confirm the\nversion 4.0 of the RAT was hosted at inesapconcurso.webredirect.org and filebin.net, while\nthe second domain is a popular file-sharing platform, the first domain was clearly created as\npart of the campaign.\n\nThe subdomain inesapconcurso is the aggregation of two words; inesap and concurso. The\nfirst word is the school name, the second can be translated into competition, this is part of\nthe social engineering of this campaign, as this Institute helps the management the\napplication of workers to public sector vacancies. Also part of the social engineering\nmethods, the file name used by both versions always starts with the word \"inscricao\", which\nmeans the application. The adversaries are using the double extension technique .pdf.exe to\ntrick the users into executing the malware.\n\nAs stated before, version 4.0 of the malware will create a PDF file with an image, which will\nbe opened by Chrome in an attempt to make the user believe that the malware was a\nlegitimate file.\n\n### Conclusion\n\n\n-----\n\nWhile the objective of this campaign is unclear, the adversaries went through some work in\norder to keep their RAT as unnoticed as possible. Both the campaign target and the\ncommand-and-control visibility show this campaign is active in Brazil, which our DNS data\nconfirms, reflecting the highly targeted approach of this campaign.\n\nThe RAT itself is not very sophisticated, and exhibits signs of code cannibalisation from other\nopen-source projects, which contrasts with the command-and-control, using fast flux to keep\nhidden, even if the endpoints are not very diversified.\n\n## IOC\n\n**URL's**\n\nhxxp://zxmbernx.camdvr.org:8843\n\nhxxp://zxmbernx.camdvr.org:8080\n\nhxxp://xmm.camdvr.org:8043\n\nhxxp://vit24ad.kozow.com:8843\nhxxp://683gvk34h.theworkpc.com:8843\n\nhxxp://inesapconcurso.webredirect.org/download.php\n\nhxxps://i.imgur.com/puSQDHe.png\n\nhxxp://amfotoalbum.com.br/images/banner/inscricao=157541254.pdf.exe\n\n**SHA-256 Hash's**\n\n83d49f14ebb6641f1b813614a40e7df2d200096b8aae198e6298125f47b55b59\n\n98bcb29912a8802d1a863d129d35876f7b2922146d2f05c17cd51ba907e617ba\n\ncbf255ecd5c113b6124549227c44054e8e976c4770a2eb323a60479eb260727b\n\nc7ef8f53dc170c6c2c3e5e57c57c6d2148e95e965c3356a868744a777bf4548b\n\n## Detection\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n[Network Security appliances such asNGFW,NGIPS, andMeraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\nSnort rules: 45771- 45773\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-28 - CannibalRAT targets Brazil.pdf"
    ],
    "report_names": [
        "2018-02-28 - CannibalRAT targets Brazil.pdf"
    ],
    "threat_actors": [
        {
            "id": "ca5d1398-1ab3-4844-91e3-f2b436f802f7",
            "created_at": "2024-02-02T02:00:04.047821Z",
            "updated_at": "2025-03-27T02:00:03.299804Z",
            "deleted_at": null,
            "main_name": "Raspberry Typhoon",
            "aliases": [
                "RADIUM"
            ],
            "source_name": "MISPGALAXY:Raspberry Typhoon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2fa14cf4-969f-48bc-b68e-a8e7eedc6e98",
            "created_at": "2022-10-25T15:50:23.538608Z",
            "updated_at": "2025-03-27T02:00:55.495551Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "Lotus Blossom",
                "DRAGONFISH",
                "Spring Dragon",
                "RADIUM",
                "Raspberry Typhoon"
            ],
            "source_name": "MITRE:Lotus Blossom",
            "tools": [
                "Elise"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "360f51f5-8a80-41d6-92c4-9aa042cd2732",
            "created_at": "2022-10-25T16:07:23.34569Z",
            "updated_at": "2025-03-27T02:02:09.746944Z",
            "deleted_at": null,
            "main_name": "APT 30",
            "aliases": [
                "APT 30",
                "Bronze Geneva",
                "Bronze Sterling",
                "CTG-5326",
                "Override Panda",
                "RADIUM",
                "Raspberry Typhoon"
            ],
            "source_name": "ETDA:APT 30",
            "tools": [
                "BackBend",
                "Creamsicle",
                "Flashflood",
                "Gemcutter",
                "Lecna",
                "NetEagle",
                "Neteagle_Scout",
                "Orangeade",
                "ScoutEagle",
                "Shipshape",
                "ZRLnk",
                "norton"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535971,
    "ts_updated_at": 1743041803,
    "ts_creation_date": 1653753325,
    "ts_modification_date": 1653753325,
    "files": {
        "pdf": "https://archive.orkl.eu/feafcb5cea260d94c998600c9225217d612d3794.pdf",
        "text": "https://archive.orkl.eu/feafcb5cea260d94c998600c9225217d612d3794.txt",
        "img": "https://archive.orkl.eu/feafcb5cea260d94c998600c9225217d612d3794.jpg"
    }
}