{
    "id": "0606b960-a376-4d82-91ef-72301cee22e0",
    "created_at": "2023-01-12T14:59:47.518717Z",
    "updated_at": "2025-03-27T02:09:30.17043Z",
    "deleted_at": null,
    "sha1_hash": "718a70dfa83b7e0d049ad675a0479082a37425d4",
    "title": "2017-11-02 - Poisoning the Well- Banking Trojan Targets Google Search Results",
    "authors": "",
    "file_creation_date": "2022-05-27T21:57:54Z",
    "file_modification_date": "2022-05-27T21:57:54Z",
    "file_size": 2636423,
    "plain_text": "# Poisoning the Well: Banking Trojan Targets Google Search Results\n\n**[blog.talosintelligence.com/2017/11/zeus-panda-campaign.html](http://blog.talosintelligence.com/2017/11/zeus-panda-campaign.html)**\n\n_[This blog post was authored by Edmund Brumaghin,](https://www.blogger.com/profile/10442669663667294759)_ _[Earl Carter and](https://www.blogger.com/profile/07833323932899203321)_ _[Emmanuel Tacheau.](https://blogs.cisco.com/author/emmanueltacheau)_\n\n## Summary\n\nIt has become common for users to use Google to find information that they do not know. In\na quick Google search you can find practically anything you need to know. Links returned by\na Google search, however, are not guaranteed to be safe. In this situation, the threat actors\ndecided to take advantage of this behavior by using Search Engine Optimization (SEO) to\nmake their malicious links more prevalent in the search results, enabling them to target users\nwith the Zeus Panda banking Trojan. By poisoning the search results for specific banking\nrelated keywords, the attackers were able to effectively target specific users in a novel\nfashion.\n\nBy targeting primarily financial-related keyword searches and ensuring that their malicious\nresults are displayed, the attacker can attempt to maximize the conversion rate of their\ninfections as they can be confident that infected users will be regularly using various financial\nplatforms and thus will enable the attacker to quickly obtain credentials, banking and credit\ncard information, etc. The overall configuration and operation of the infrastructure used to\ndistribute this malware was interesting as it did not rely on distribution methods that Talos\nregularly sees being used for the distribution of malware. This is another example of how\nattackers regularly refine and change their techniques and illustrates why ongoing\nconsumption of threat intelligence is essential for ensuring that organizations remain\nprotected against new threats over time.\n\n## Initial Attack Vector\n\n\n-----\n\nThe initial vector used to initiate this infection process does not appear to be email based. In\nthis particular campaign, the attacker(s) targeted specific sets of search keywords that are\nlikely to be queried by potential targets using search engines such as Google. By leveraging\ncompromised web servers, the attacker was able to ensure that their malicious results would\nbe ranked highly within search engines, thus increasing the likelihood that they would be\nclicked on by potential victims.\n\nIn one example, the attacker appeared to target the keyword search containing the following\nsearch query:\n\nIn most instances, the attacker was able to get their poisoned results displayed several times\non Page 1 of the Search Engine Results Page (SERP) for the keyword search being\ntargeted, in this case \"al rajhi bank working hours in ramadan\". A sample of the malicious\nresults returned by Google is included in the image below.\n\nBy leveraging compromised business websites that have received ratings and reviews, the\nattacker could make the results seem more legitimate to victims, as can be seen by the\nstar/rating displayed alongside the results in the SERP.\n\nThe attacker targeted numerous keyword groups, with most being tailored towards banking\nor financial-related information that potential victims might search for. Additionally, certain\ngeographic regions appear to be directly targetedy, with many of the keyword groups being\nspecific to financial institutions in India as well as the Middle East. Some examples of\nkeyword searches being targeted by this campaign were:\n\n_\"nordea sweden bank account number\"_\n\n_\"al rajhi bank working hours during ramadan\"_\n\n_\"how many digits in karur vysya bank account number\"_\n\n_\"free online books for bank clerk exam\"_\n\n_\"how to cancel a cheque commonwealth bank\"_\n\n_\"salary slip format in excel with formula free download\"_\n\n_\"bank of baroda account balance check\"_\n\n_\"bank guarantee format mt760\"_\n\n\n-----\n\n_free online books for bank clerk exam_\n_\"sbi bank recurring deposit form\"_\n_\"axis bank mobile banking download link\"_\n\nAdditionally, in all of the cases Talos analyzed, the titles of the pages that functioned as the\nentry point into this malware distribution system had various phrases appended to them.\nUsing the \"intitle:\" search parameter, we were able to positively identify hundreds of\nmalicious pages being used to perform the initial redirection that led victims to the malicious\npayload. Some examples of these phrases are included below:\n\n_\"found download to on a forum\"_\n_\"found global warez on a forum\"_\n_\"can you download free on the site\"_\n_\"found download on on site\"_\n_\"can download on a forum\"_\n_\"found global downloads on forum\"_\n_\"info site download to on forum\"_\n_\"your query download on site\"_\n_\"found download free on a forum\"_\n_\"can all downloads on site\"_\n_\"you can open downloads on\"_\n\nIn cases where victims attempt to browse to the pages hosted on these compromised\nservers, they would initiate a multi-stage malware infection process, as detailed in the\nfollowing section.\n\nIronically we have observed the same redirection system and associated infrastructure used\nto direct victims to tech support and fake AV scams that display images informing victims that\ntheir systems are infected with Zeus and instructing them to contact the listed telephone\nnumber.\n\n\n-----\n\n## Infection Process\n\nWhen the malicious web pages are accessed by victims, the compromised sites use\nJavascript to redirect clients to Javascript hosted on an intermediary site.\n\nThis results in the client retrieving and executing Javascript located at the address specified\nby the document.write() method. The subsequent page includes similar functionality, this time\nresulting in an HTTP GET request to another page.\n\n\n-----\n\nThe intermediary server will then respond with a HTTP 302 which redirects clients to another\ncompromised site which is actually being used to host a malicious Word document. As a\nresult, the client will follow this redirection and download the malicious document. This is a\ntechnique commonly referred to as \"302 cushioning\" and is commonly employed by exploit\nkits.\n\nFollowing the redirect results in the download of a malicious Microsoft Word document.\n\n\n-----\n\nFollowing the download of the malicious Word document, the victim is prompted by their\nbrowser to Open or Save the file. When opened, the document displays the following\nmessage, prompting the victim to \"Enable Editing\" and click \"Enable Content\".\n\nFollowing these instructions will result in the execution of malicious macros that have been\nembedded in the Word document. It is these macros that are responsible for downloading\nand executing a PE32 executable, thus infecting the system. The macro code itself is\nobfuscated, and quite basic. It simply downloads the malicious executable, saves it into the\n%TEMP% directory on the system using the filename such as \"obodok.exe\".\n\nIn this case, the malicious executable was being hosted at the following URL:\n\n_hXXp://settleware[.]com/blog/wp-content/themes/inove/templates/html/krang.wwt_\n\nThe macros use the following Powershell command to initiate this process:\n\nA review of DNS related information associated with the domain hosting the malicious\nexecutable shows that there were two significant spikes in the amount of DNS requests\n\n\n-----\n\nattempting to resolve the domain, occurring between 06/07/2017 and 06/08/2017.\n\nSettleware Secure Services, Inc. is a document e-Signing service that allows documents to\nbe signed electronically. It is used across a number of different processes, including Real\nEstate escrow e-Signing, and also offers eNotary services.\n\n## Malware Operations\n\nThe malicious payload associated with the campaign appears to be a new version of Zeus\nPanda, a banking trojan designed to stealing banking and other sensitive credentials for\nexfiltration by attackers. The payload that Talos analyzed was a multi-stage payload, with the\ninitial stage featuring several anti-analysis techniques designed to make analysis more\ndifficult and prolonged execution to avoid detection. It also featured several evasion\ntechniques designed to ensure that the malware would not execute properly in automated\nanalysis environments, or sandboxes. The overall operation of the Zeus Panda banking\n[trojan has been well documented, however Talos wanted to provide additional information](https://www.gdatasoftware.com/blog/2017/08/29928-analysis-zeus-panda)\nabout the first stage packer used by the malware.\n\nThe malware will first query the system's keyboard mapping to determine the language used\non the system. It will terminate execution if it detects the any of the following keyboard\nmappings:\n\nLANG_RUSSIAN\nLANG_BELARUSIAN\nLANG_KAZAK\nLANG_UKRAINIAN\n\nThe malware also performs checks to determine whether it is running within the following\nhypervisor or sandbox environments:\n\nVMware\nVirtualPC\nVirtualBox\nParallels\nSandboxie\nWine\nSoftIce\n\nIt also checks for the existence of various tools and utilities that malware analysts often run\nwhen analyzing malicious software. A full list of the different environment checks performed\n\n\n-----\n\nby the malware is below:\n\nIf any of the environmental checks are met, the malware then removes itself by first writing a\nbatch file to the %TEMP% directory and executing it using the Windows Command\nProcessor. The malware uses RDTSC to calculate the time-based filename used to store the\nbatch file. This batch file is responsible for deleting the original sample executable. Once the\noriginal executable has been deleted, the batch file itself is also removed from %TEMP%.\n\nIn an attempt to hinder analysis, the initial stage of the malicious payload features hundreds\nof valid API calls that are invoked with invalid parameters. It also leverages Structured\nException Handling (SEH) to patch its own code. It queries and stores the current cursor\nposition several times to detect activity and identify if it is being executed in a sandbox or\nautomated analysis environment. An example of the use of valid API calls with invalid\nparameters is below, where the call to obtain the cursor location is valid, while the call to\nScreentoClient contains invalid parameters\n\n\n-----\n\nBelow is an example of a bogus call designed to lure an analyst and increase the time and\neffort required to analyze the malware. Often we see invalid opcodes used to lure the\ndisassembler, but in this case, the result is that it is in front of hundred of structures too,\nmaking it more difficult to recognize good variables.\n\nThe below screenshot shows a list of auto populated and useless structures by IDA. These\nmeasures are all designed to impede the analysis process and make it more expensive to\nidentify what the malware is actually designed to do from a code execution flow perspective.\n\n\n-----\n\nPeriodically, we can find a valid and useful instruction. Below the EAX register is stored in a\nvariable to be reused later in order to allocate a heap memory chunk to initiate its own\nunpacked code.\n\nThe malware also uses others techniques to make analysis significantly more difficult, like\ncreating hundreds of case comparisons, which makes tracing code much harder.\n\nBelow an example of several if conditional statements in pseudo code demonstrating this\nprocess and how it can result in impeding the ability to efficiently trace the code.\n\n\n-----\n\nIn order to decrypt the malware code it's installs an exception handler, which is responsible\nfor decrypting some memory bytes to continue it's execution.\n\nBelow you can see the SEH has just been initialized:\n\nIn the same routine, it performs the decryption routine for the following code. We also\nobserved that the high number of exception calls were causing some sandboxes to crash as\na way to prevent automated analysis.\n\n\n-----\n\nOnce the data is decrypted and stored into the buffer that was previously allocated, it\ncontinues execution back in winmain using a known mechanism, the callback routine feature\nof EnumDisplayMonitor, by setting up the value of the callback routine towards the patched\nmemory.\n\nDuring this execution, the malware will then continue to patch itself and continue execution.\n\nThe strings are encrypted using an XOR value, however each string uses a separate XOR\nvalue preventing an easy detection mechanism. Below is some IDA Python code which can\nbe used to decrypt strings.\n\n\n-----\n\n```\ndef decrypt(data, length, key):\n  c = 0\n  o = ''\n  while c < length:\n    o += chr((c ^ ord(data[c]) ^ ~key) & 0xff)\n    c +=1\n  return o\ndef get_data(index):\n  base_encrypt = 0x1251A560\n  key = Word(base_encrypt+8*index)\n  length=Word(base_encrypt+2+8*index)\n  data=GetManyBytes(Dword(base_encrypt+4+8*index), length)\n  return key, length, data\ndef find_entry_index(addr):\n  addr = idc.PrevHead(addr)\n  if GetMnem(addr) == \"mov\" and \"ecx\" in GetOpnd(addr, 0):\n    return GetOperandValue(addr, 1)\n  return None\nfor addr in XrefsTo(0x1250EBD2, flags=0):\n  entry = find_entry_index(addr.frm)\n  try:\n    key, length, data = get_data(entry)\n    dec = decrypt(data, length, key)\n    print \"Ref Addr: 0x%x | Decrypted: %s\" % (addr.frm, dec)\n    MakeComm(addr.frm, ' decrypt_string return :'+dec)\n    MakeComm(ref, dec)\n  except: \n    pass\n\n```\nThis code should comment IDA strings decrypted and referenced where 0x1250EBD2\ncorresponds to the decryption routine and 0x1251A560 corresponds to the table of strings\nencrypted\n\n\n-----\n\nComments are inserted into the disassembly making it much easier to understand the\ndifferent features within the malware.\n\n\n-----\n\nFor API calls, there are also well known hash API calls which use the following algorithm.\nAgain this is code which can be used within IDA in order to comment API calls.\n```\ndef build_xor_api_name_table():\n  global table_xor_api\n  if not table_xor_api:\n    table_xor_api = []\n    entries = 0\n    while entries < 256:\n      copy_index = entries\n      bits = 8\n      while bits:\n        if copy_index & 1:\n          copy_index = (copy_index >> 1) ^ 0xEDB88320\n      else:\n        copy_index >>= 1\n      bits -= 1\n    table_xor_api.append(copy_index)\n    entries += 1\n  return table_xor_api\ndef compute_hash(inString):\n  global table_xor_api\n  if not table_xor_api:\n    build_xor_api_name_table()\nif inString is None:\n  return 0\necx = 0xFFFFFFFF\nfor i in inString:\n  eax = ord(i)\n  eax = eax ^ ecx\n  ecx = ecx >> 8\n  eax = eax & 0xff\n  ecx = ecx ^ table_xor_api[eax]\necx = ~ecx & 0xFFFFFFFF\nreturn ecx\n\n```\nThe malware uses a generic function which takes the following arguments:\n\nthe DWORD which corresponds to the module.\nAn index entry corresponding to the table of encrypted string for modules (if not\nloaded).\nThe hash of the API itself.\nThe index where to store the api call address.\n\n\n-----\n\nBelow is example pseudo code showing how the API call is performed just to perform a\nprocess lookup into memory using the snapshot list.\n\nOnce the malware begins its full execution, it copies an executable to the following folder\nlocation:\n```\nC:\\Users\\<Username>\\AppData\\Roaming\\Macromedia\\Flash\nPlayer\\macromedia.com\\support\\flashplayer\\sys\\\n\n```\nIt maintains persistence by creating the following registry entry:\n```\nHKEY_USERS\\<SID>\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\extensions.exe\n\n```\nIt sets the data value for this registry entry to the path/filename that was created by the\nmalware. An example of the data value is below:\n```\n\"C:\\Users\\<Username>\\AppData\\Roaming\\Macromedia\\Flash\nPlayer\\macromedia.com\\support\\flashplayer\\sys\\extensions.exe\"s\\\\0\n\n```\nIn this particular case, the file that was dropped into the infected user's profile was named\n\n\n-----\n\nextensions.exe however Talos has observed several different file names being used when\nthe executable is created.\n\nAdditional information about the operation of the Zeus Panda banking trojan once it has been\n[unpacked has been published here.](https://cyberwtf.files.wordpress.com/2017/07/panda-whitepaper.pdf)\n\n## Conclusion\n\nAttackers are constantly trying to find new ways to entice users to run malware that can be\nused to infect the victim's computer with various payloads. Spam, malvertising, and watering\nhole attacks are commonly used to target users. Talos uncovered an entire framework that is\nusing \"SERP poisoning\" to target unsuspecting users and distribute the Zeus Panda banking\ntrojan. In this case, the attackers are taking specific keyword searches and ensuring that\ntheir malicious results are displayed high in the results returned by search engines\n\nThe threat landscape is constantly evolving and threat actors are continually looking for new\nattack vectors to target their victims. Having a sound, layered, defense-in-depth strategy in\nplace will help ensure that organizations can respond to the constantly changing threat\nlandscape. Users, however, must also remain vigilant and think twice before clicking a link,\nopening an attachment or even blinding trusting the results of a Google search.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n\n-----\n\n[Network Security appliances such asNGFW,NGIPS, andMeraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs\n\nThe following Indicators of Compromise have been identified as being associated with this\nmalware campaign. Note that some of the domains performing the initial redirection have\nbeen cleaned, however we are including them in the IOC list to allow organizations to\ndetermine if they have been impacted by this campaign.\n\n### Domains Distributing Maldocs:\n\nmikemuder[.]com\n\n### IPs Distributing Maldocs:\n\n67.195.61[.]46\n\n### Domains:\n\nacountaxrioja[.]es\n\nalpha[.]gtpo-cms[.]co[.]uk\n\narte-corp[.]jp\n\nbellasweetboutique[.]com\n\nbilling[.]logohelp[.]com\n\nbirsan[.]com[.]tr\n\nbitumast[.]com\n\nbleed101[.]com\n\nblindspotgallery[.]co[.]uk\n\nblog[.]mitrampolin[.]com\n\ncalthacompany[.]com\n\ncannonvalley[.]co[.]za\n\ncoinsdealer[.]pl\n\ncorvettescruisingalveston[.]com\n\ncraigchristian[.]com\n\n\n-----\n\ndentopia[.]com[.]tr\ndgbeauty[.]net\ndressfortheday[.]com\nevoluzionhealth[.]com\ngemasach[.]com\njapan-recruit[.]net\njaegar[.]jp\nmichaelleeclayton[.]com\nwww[.]academiaarena[.]com\nwww[.]bethyen[.]com\nwww[.]bioinbox[.]ro\nwww[.]distinctivecarpet.com\nwww[.]helgaleitner[.]at\nwww[.]gullsmedofstad[.]no\nusedtextilemachinerylive[.]com\ngaragecodes[.]com\nastrodestino[.]com[.]br\n\n### Intermediary Redirect Domains\n\ndverioptomtut[.]ru\n\n### Word Doc Filenames:\n\nnordea-sweden-bank-account-number.doc\n\nal-rajhi-bank-working-hours-during-ramadan.doc\n\nhow-many-digits-in-karur-vysya-bank-account-number.doc\n\nfree-online-books-for-bank-clerk-exam.doc\n\nhow-to-cancel-a-cheque-commonwealth-bank.doc\n\nsalary-slip-format-in-excel-with-formula-free-download.doc\n\nbank-of-baroda-account-balance-check.doc\n\nbank-guarantee-format-mt760.doc\n\nincoming-wire-transfer-td-bank.doc\n\nfree-online-books-for-bank-clerk-exam.doc\n\nsbi-bank-recurring-deposit-form.doc\n\n### Word Doc Hashes:\n\n713190f0433ae9180aea272957d80b2b408ef479d2d022f0c561297dafcfaec2 (SHA256)\n\n### PE32 Distribution URLs:\n\nsettleware[.]com/blog/wp-content/themes/inove/templates/html/krang.wwt\n\n\n-----\n\n### PE32 Hashes:\n\n59b11483cb6ac4ea298d9caecf54c4168ef637f2f3d8c893941c8bea77c67868 (SHA256)\n\n5f4c8191caea525a6fe2dddce21e24157f8c131f0ec310995098701f24fa6867 (SHA256)\n\n29f1b6b996f13455d77b4657499daee2f70058dc29e18fa4832ad8401865301a (SHA256)\n\n0b4d6e2f00880a9e0235535bdda7220ca638190b06edd6b2b1cba05eb3ac6a92 (SHA256)\n\n### C2 Domains:\n\nhppavag0ab9raaz[.]club\n\nhavagab9raaz[.]club\n\n### C2 IP Addresses:\n\n82.146.59[.]228\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-11-02 - Poisoning the Well- Banking Trojan Targets Google Search Results.pdf"
    ],
    "report_names": [
        "2017-11-02 - Poisoning the Well- Banking Trojan Targets Google Search Results.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b0d34dd6-ee90-483b-bb6c-441332274160",
            "created_at": "2022-10-25T16:07:23.296754Z",
            "updated_at": "2025-03-27T02:02:09.724313Z",
            "deleted_at": null,
            "main_name": "Aggah",
            "aliases": [
                "Operation Red Deer",
                "Operation Roma225"
            ],
            "source_name": "ETDA:Aggah",
            "tools": [
                "AgenTesla",
                "Agent Tesla",
                "AgentTesla",
                "Aggah",
                "Atros2.CKPN",
                "Bladabindi",
                "Jorik",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Negasteal",
                "Origin Logger",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "Warzone",
                "Warzone RAT",
                "ZPAQ",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535587,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653688674,
    "ts_modification_date": 1653688674,
    "files": {
        "pdf": "https://archive.orkl.eu/718a70dfa83b7e0d049ad675a0479082a37425d4.pdf",
        "text": "https://archive.orkl.eu/718a70dfa83b7e0d049ad675a0479082a37425d4.txt",
        "img": "https://archive.orkl.eu/718a70dfa83b7e0d049ad675a0479082a37425d4.jpg"
    }
}