{
    "id": "061f481c-035d-47d3-a353-2bb8aa26f061",
    "created_at": "2022-10-25T16:48:11.617049Z",
    "updated_at": "2025-03-27T02:17:22.843998Z",
    "deleted_at": null,
    "sha1_hash": "3cdd5180fbe3168e97ae2da0e4e4d188760525c5",
    "title": "Guerrero-Saade-Raiu-VB2017.indd",
    "authors": "",
    "file_creation_date": "2017-08-25T17:49:14Z",
    "file_modification_date": "2017-08-30T07:13:46Z",
    "file_size": 2387298,
    "plain_text": "# WALKING IN YOUR ENEMY’S SHADOW: WHEN FOURTH-PARTY COLLECTION BECOMES ATTRIBUTION HELL\n## Juan Andres Guerrero-Saade & Costin Raiu Kaspersky Lab, USA & Romania\n\n Email juan.guerrero@kaspersky.com; craiu@kaspersky.ro\n\n ABSTRACT\n\nAttribution is complicated under the best of circumstances.\nSparse attributory indicators and the possibility of overt\nmanipulation have proven enough for many researchers to shy\naway from the attribution space. And yet, we haven’t even\ndiscussed the worst-case scenarios. What happens to our\nresearch methods when threat actors start hacking each other?\nWhat happens when one threat actor leverages another’s\nseemingly closed-source toolkit? Or better yet, what if they\nopen-source an entire suite to generate so much noise that\nthey’ll never be heard?\n\nLeaked documents have described how the standard practice\nof one espionage outfit infiltrating another has transcended\ninto the realm of cyber in the form of fourth-party collection.\nWhile this represents an immediate failure for the victim\nintelligence service, the tragedy doesn’t end there. Attackers\ncan then go on to adopt the victim threat actor’s toolkit and\ninfrastructure, leveraging their data and access, and\nperpetrating attacks in their name. As interesting as this\nconversation could be in the abstract, we’d rather present\nexamples from unpublished research that showcase how this is\nalready happening in the wild.\n\nSimilarly, while we’d prefer to present threat intelligence\nresearch in its most polished and convincing form, fringe cases\ndo appear. Strange activity overlaps between clusters,\nAPT-on-APT operations, open-sourcing of proprietary tools,\nor repurposing of proprietary exploit implementations are\nsome of the ways that the attribution and activity clustering\nstructures start to break down and sometimes collapse. And\nthis is not all an unintentional byproduct of our position as\nexternal observers; some threat actors are overtly adopting the\nTTPs of others and taking advantage of public reporting to\nblend their activities into the profiles researchers expect of\nother actors.\n\nThe material includes in-the-wild examples to substantiate\npreviously hypothesized claims about attackers stealing each\nother’s tools, repurposing exploits, and compromising the\nsame infrastructure. These covert dynamics in the space of\ncyber espionage further substantiate the difficulties underlying\naccurate security research and the need to track threat actors\ncontinually. The examples we’ll focus on come from\nunpublished research and unwritten observations from the\noriginal researchers themselves. The hope is to escape threat\nintel solipsism by providing a better framework to understand\nand discuss operations and actors and to understand how\ntraditional espionage shadow games are being played out on\nthe digital front.\n\n\n## INTRODUCTION\n\nOpportunity plays a large and unaccredited role in the practice\nof intelligence. Where convenience can proffer information of\nintelligence gathering value, an intelligence service can\ncapitalize while saving resources and maintaining a light touch\nto avoid detection. The maturity of an intelligence service can\nbe measured in part by structural adaptation to maximize\nopportunistic collection wherever beneficial. Depending on the\npurview of the intelligence service in question, be it all source,\nhuman intelligence (HUMINT), signals intelligence (SIGINT),\netc., these structural changes will take different forms.\nHUMINT outfits may recruit, supplant, or bug spouses,\ntherapists, and priests in proximity to a desirable outfit to take\nadvantage of the intended target’s willingness to ‘bare their\nsoul’ where they otherwise may not. The benefit of confession\nisn’t strictly necessary; in some cases, the heat emanating from\na facility, the number of pizza deliveries in a week, or the\nnumber of cars parked in a specific area may provide crucial\ninformation about the activities taking place in a location of\ninterest. Creativity for opportunism is well rewarded in the\npractice of intelligence.\n\nIn the case of signals intelligence services, the gamut of\nopportunism extends wider still. By the very tradition of\nSIGINT collection, phone calls and emails are desirable, as are\nthose of third-parties associated with the intended target who\nmay not treat the content of those privileged interactions with\nthe level of care of the original interlocutor. The existence of\ncontacts and connections between targets of interest may be\ntelling in and of itself. But let us widen our view to the options\navailable to truly mature, sophisticated, and capable services\nwhen it comes to engaging the full berth of options at their\ndisposal. After all, there’s more than one SIGINT agency in\nthe world. Different agencies, be they friend or foe, have a\npurview over different geographical areas and desirable\nsectors. Their analysts are likely to have a greater acquaintance\nwith desirable targeting and the context in which to interpret\nthe information received from their collection. This presents a\nvaluable opportunity: to co-opt the collection methods of a\nforeign intelligence service to receive the same raw\ninformation being collected on targets of interest to the latter\n– or ideally both – intelligence services; this practice is known\nas _fourth-party collection._\n\nIn the 21st century, intelligence operations of all kinds have\nembraced the ease, convenience, and tantamount desirability\nof digital espionage and as such, so must our concepts of\nintelligence methodology adapt. Fourth-party collection is an\ninteresting and ongoing practice with a palpable impact on\ncyber espionage operations. The opportunities for fourth-party\ncollection afforded by the digital realm are truly manifold.\nSadly, so are the problematic implications for those of us\ninterested in accurately researching or investigating these\nhigh-powered threat actors. From our perspective, the greatest\ndifficulties lie in the realm of attribution where the first- and\nsecond-order implications of intelligence piggybacking\nthreaten to destroy the current paradigm of our understanding\nand analysis capabilities. We must therefore carefully spell out\nour understanding of this practice, cases in the wild that\nshowcase the shadow of possible fourth-party collection, and\nface the potential limits of our understanding of digital\nespionage to avoid missteps going forward.\n\nA study of fourth-party collection from the perspective of\noutside observers is complicated. Passive forms of fourth-party\n\n\n-----\n\ncollection are largely unobservable from our vantage point.\nAs such, we will discuss these insofar as we understand their\ntheoretical effect on cyber operations. However, in the case of\nactive fourth-party collection, with its heavy-handed\nbyproducts like tool repurposing, victim stealing and sharing,\nwe have endeavoured to provide in-the-wild examples\nalongside relevant thought experiments to best serve our\nunderstanding of this elusive practice.\n\nSimilarly, while we do not indict the SIGINT giants that\nprotect our safety and the national security of our countries,\nwe stand firmly in our understanding that techniques continue\nto trickle down and proliferate. While some fourth-party\ncollection practices may be unattainable for actors that do not\nhold the status of ‘gods on the wires’, some of the\ncomplications that arise from code reuse or C&C (commandand-control) infrastructure piggybacking are already being\nfelt and should be addressed with an objective view to\nfurthering our understanding of the disastrous complications\nencountered therein.\n\n## Categorizing collection relative to its means of generation\n\nThe means by which information is generated and collected\ncannot be ignored when the purpose is to root out some\nsemblance of actionable context that must not be tainted by the\nperspective of the source of the information or the limitations\nof the collection methods themselves. The analyst must be well\naware of the means of generation and source of the information\nanalysed in order to either compensate or exploit its\nprovenance. For that reason, collection can be categorized by\nits means of generation in relation to the position of the parties\ninvolved, as discussed below. While insiders may find\ndisagreement with the particulars of our appropriation of the\nfollowing terms, these definitions will serve as functional\ncategories for our understanding as outsiders looking into the\nmore complex spheres of collection dynamics.\n\nTo facilitate this discussion we will fabricate a competent\nentity named ‘Agency-A’[1] as a stand-in for a ‘god on the\nwire’-style SIGINT agency interested in fourth-party\ncollection. Let’s categorize the collection categories available\nto this entity:\n\n  - **_First-party collection – Information collected by_**\nAgency-A first hand by passive or active means.\n\n  - **_Second-party collection – Information shared with_**\nAgency-A by partner intelligence agencies. Note that the\noriginal source of the data itself does not have to be the\npartner service’s first-party collection.\n\n  - **_Third-party collection – Information collected by means_**\nof access to strategic organizations, be it wittingly,\nwillingly, or otherwise. These may include Internet\nservice and telecommunication providers, social media\nplatforms, ad networks, or other companies that generate\nand collect vast amounts of data on potential targets of\ninterest. Agency-A is in a position to correlate seemingly\ninnocuous data (such as ad network trackers) with other\nforms of collection to benefit its overall intelligence\nproduct and targeting.\n\n1 Similarly, we will use Agency-B as a second, semi-competent\nSIGINT agency upon which Agency-A can be recurringly predatory\nfor the sake of explanation. When necessary, an even less competent\nentity, Agency-C, will serve as prey.\n\n\n\n  - **_Fourth-party collection – As described previously,_**\nfourth-party collection involves interception of a foreign\nintelligence service’s ‘computer network exploitation’\n(CNE) activity in a variety of possible configurations.\nGiven the nature of Agency-A as a cyber-capable\nSIGINT entity, two modes of fourth-party collection are\navailable to it: passive and active. The former will take\nadvantage of its existing visibility into data in transit\neither between hop points in the adversary’s\ninfrastructure or perhaps in transit from the victim to the\ncommand-and-control servers themselves (whichever\nopportunity permits). On the other hand, active means\ninvolve the leveraging of diverse CNE capabilities to\ncollect, replace, or disrupt the adversary’s campaign.\nBoth present challenges which we will explore in\nextensive detail further below.\n\n  - **_Fifth-party collection – This particular category is the_**\n‘unicorn of intelligence collection’ and is more likely the\nresult of serendipity rather than intentionally cunning\naccess. For a fifth-party collection scenario to occur,\nAgency-A must be successfully conducting fourth-party\ncollection on Agency-B, which, in turn, happens to be\ncollecting Agency-C’s respective collection efforts.\nThereby, Agency-A’s collection will entail a further level\nof opportunistic abstraction that yields the product of\nAgency-C’s collection. While fourth-party collection is a\ndesirable form of data collection, fifth-party collection is\nmostly a fortuitous byproduct that may instruct future\ntasking for Agency-A and likely not an intentional\nproduct in and of itself nor a reliable means of sustained\nproduction.\n\n## SIGINT SHOULDER-SURFING[2]\n\nEach category of collection is interesting in its own right, but\nfourth-party collection in particular is worthy of added\ninterest and scrutiny from the threat intelligence research\ncommunity. This heightened status is warranted by the\ntroubling ramifications implicit in the exploitation of ‘cyber\nsituational awareness’ by any entity involved in fourth-party\ncollection. Unwarranted tin-foil-hat-worthy claims of\nprevalent false-flagging become marginally[3] more plausible\nwhen modelling for threat actors in the rare position to\nconduct fourth-party collection. We will first discuss the\nsituational models that enable fourth-party collection,\nfollowed by the byproducts and benefits of this collection\ncategory, before discussing the specific problems these pose\nfor threat intelligence research.\n\n## Passive collection\n\nThe importance of ‘god on the wire’[4] status for our\nhypothetical Agency-A becomes most immediate when\ndiscussing passive collection opportunities. These are\n\n2 The following section will build on the elementary model of\nfourth-party collection described in the leaked slidedeck ‘Fourth\nParty Opportunities – I drink your milkshake’ [1].\n3 Keeping in mind that many of these threat actors are more likely\nimpaired by a litany of lawyers than propelled forward by audacious\ntasking and attributory cyber-acrobatics.\n4 By ‘god on the wire’ status, we are referring to the sort of entity that\nhas regular and legitimate access to nationwide, international, or even\ntranscontinental taps providing them with otherwise inimitable access\nto data in transit over a given region.\n\n\n-----\n\ncharacterized by a silent ability to collect data at some point\nin transit between the victim and the original attacker\n(Agency-B).\n\nFor those unfamiliar with the fundamental elements of a\ncyber espionage campaign, most consist of a malware toolkit\nmeant to perform victim tracking and collection of specific\ndata on a periodic and persistent basis. Like a satellite\nbeaming back to Earth, the malware exfiltrates this\ninformation back to a command-and-control server. This\ncommunication usually involves the retrieval of further\ntasking or instructions from the attackers, or perhaps\nnext-stage malware. As such, we can expect the attackers to\nconnect to this command-and-control server (or a daisy-chain\narrangement of servers) to retrieve exfiltrated information,\nupload tasking and payloads, and generally monitor their\ninfrastructure.\n\nThis snapshot of a standard cyber espionage operation can\nfunction as a working model for how we can expect\nAgency-B to conduct its day-to-day operations. Where, then,\ndoes Agency-A come in? Depending on its existing access,\nAgency-A can leverage multiple passive collection\nopportunities, as follows:\n\n## Victim-to-server transit\n\nBy virtue of its placement, Agency-A may have access to the\ndata in transit from the victim to one or more of Agency-B’s\ncommand-and-control servers. Possible enablers include: taps\non the cables leading to these servers, access to routing\ninfrastructure along the route, or broad third-party access to\nthe Internet Service Providers (ISPs) along the way or the\nVirtual Private Server (VPS) hosting provider specific to this\nserver.\n\n## Server-to-attacker transit\n\nAlternatively, Agency-A can find a similar vantage point\nalong the route connecting Agency-B and its command-andcontrol (C&C) infrastructure, or within junctures connecting\ndifferent nodes in that infrastructure itself. The latter is\npossible within C&C configurations that employ server\ndaisy-chaining for ‘anonymizing’ properties. In that case,\nmultiple servers are set up as relay hops, employing\nencryption and a fragmented awareness of the full route of\nservers as means of protecting the operators. For example, the\nimplant on the victim machine will exfiltrate data to Server-P.\nServer-P is aware of Server-Q (and only Server-Q) and will\nproceed to forward the victim’s data there. Server-Q will in\nturn forward to Server-R, and so on. By placing these servers\nacross many jurisdictions and different hosting providers,\nattackers with middling sophistication hope to throw off\nlaw-enforcement and researcher attempts to track or disrupt\ntheir activities. However, this system of relays actually\nprovides multiple potential opportunities for Agency-A to\npassively collect this traffic in transit from one node to\nanother, dependent on Agency-A’s access and luck.\n\n## Decryption and deobfuscation\n\nAssuming that Agency-A possesses the capability to decrypt\nor deobfuscate Agency-B’s means of data protection in\ntransit, it will be capable of reaping the benefits of\nAgency-B’s targeting passively and without arousing\nsuspicion. For those ardent fans of encryption that may\nconsider this unlikely, it’s worth emphasizing that obfuscation\n\n\nmethods chosen by malware developers of this calibre are far\nfrom infallible. In cases where potent encryption has been\nadopted, this encryption is only as strong as the means of\nstorage of the decryption keys in what is likely an automated\nsystem somewhere in Agency-B, or worse yet somewhere in\nAgency-B’s public-facing attack infrastructure. Wherever\ncostly superhuman cryptanalysis capabilities appear\nnecessary, access to a specific endpoint[5] is ever more likely to\nplay a cost-effective and desirable means of success.\n\n## Compromised servers, dynamic providers, open-ownership servers, and abused public services\n\nAs may appear obvious by now, the misuse of public\nresources or compromised servers is likely to yield Agency-A\nseveral fourth-party collection opportunities as well. Where\nwe have thus far characterized Agency-B as a mid-range\nattacker with some sophistication due to its deployment of\nreasonable countermeasures and targeting ambitions, we can\npoint to Agency-C as an example of the now all too common\nlow-resource threat actor entering the digital espionage space.\nAgency-C-style attackers often employ trifle means,\nscript-kiddie-worthy tools, and truly unimaginative infection\nvectors. However, lack of sophistication has not kept these\nattackers from succeeding in their collection efforts.\n\nAgency-C is likely to attempt to ‘hide in the noise’ while\nkeeping costs low, particularly when it comes to its\ninfrastructure. By compromising vulnerable servers or\nabusing public resources like cloud providers, open proxies,\nand dynamic DNS services, Agency-C may hope to mix in\nwith an abundance of promiscuous attackers more likely to be\nignored by high-calibre enforcers. However, in reality,\nAgency-C is likely to provide Agency-A with fourth-party\ncollection opportunities galore by virtue of well-placed\nthird-party access to the more reputable hosting services.\nThese service providers are even less likely to balk at the use\nof this access considering that the target is abusing the\nservices of a well-guarded corporate brand to conduct\nmalicious activities.\n\n## Active collection\n\nSo far we have focused entirely on passive collection\ncapabilities that are likely to yield a benefit for Agency-A\nwhile providing little to no indication of its access. Active\ncollection requires a heavier hand but may be the only\nrecourse when convenient opportunities for passive collection\nhave not presented themselves. An alternative compelling\nrationale states that active collection is likely to yield greater\nreturns for the overly-capable opportunistic attacker interested\nin greater cyber situational awareness.\n\nActive collection involves CNE on systems that form part of\nthe target campaign’s command-and-control infrastructure.\nThe idea is for Agency-A to break into one or more of\nAgency-B’s command-and-control servers, or better yet a\nbackend-collection node. Though access with stolen\ncredentials may suffice on a temporary basis, a disciplined\nattacker is more likely to opt for a more regimented and\nreliable form of access. An attacker might consider\nbackdooring a key program on the server, like SSH, thus\nenabling persistent access without arousing suspicion. The\n\n5 By means of Agency-A’s well-targeted CNE.\n\n\n-----\n\nadvanced attacker who realizes the collection value of the\nserver is more likely to place their own stealthy implant on\nthe C&C to collect and exfiltrate information collected from\nvictims regularly as well as monitor the original operators\nconnecting to these servers.\n\n## An equation for heavy-handed opportunism\n\nThe idea of monitoring the original operators as they connect\nto these nodes is crucial considering that a key starting point\nfor fourth-party collection is exceptional cyber situational\nawareness[6]. The apex predator looking to exploit the cyber\noperations of lesser equipped threat actors must be aware of\ntheir existence, their procedures and techniques, their tasking,\nthe effectiveness of their countermeasures, and so on. This\ndetailed situational understanding is then coupled with a\nmeasure of what may be termed Reasonable AttainableAccess Potential (RAAP) and weighed in relation to what\nstands to be gained from this style of collection.\n\nWe introduce the notion of RAAP with a particular interest in\nunderstanding the logistics of a ‘god on the wire’-style\nSIGINT agency with a cyber remit. Though these are\nunequivocally placed at the very top of the adversary\npyramid, they are not, in fact, omnipotent nor do they possess\nunlimited resources, and as such must be understood with an\neye towards logistical realism. RAAP speaks to the measure\nthat determines whether the disposition to gain access to a\ntarget can materialize within reasonable means.\n\nBarring the paramount value of a truly critical target, chances\nare that even an apex predator with vast resources will not\ntake the time to tailor brand new, time-consuming, and costly\nexploits and implants for a one-off victim (or an unusual\nplatform) without a drastic return on investment. Therefore,\nwe can expect the path of least resistance to be determined\nalong the following line of questioning:\n\n - ‘Are any of these systems vulnerable to exploits we\nalready possess?’\n\n - ‘Do we already have an implant suitable for this\nplatform?’\n\n - ‘Are credentials already available from other collection\nsources?’\n\n - ‘Might we have access to a relevant critical juncture by\nmeans of a third-party?’\n\n - ‘Does an allied service (second-party collection) already\npossess access to our intended victim?’\n\nWe must be prepared to consider that even a desirable (but not\ncritical) target may fall off the tasking list entirely if these\nconsiderations prove even marginally unfavourable. The tragic\nbanality of public sector decision-making entails that a simple\nlack of serendipitous bureaucratic support is likely to play a\nheavy hand in prioritizing one opportunity over another.\n\n## A server for two masters\n\nWhat we should expect to see in practice are command-andcontrol servers that are either backdoored to provide a\n\n6 The term ‘cyber situational awareness’ refers to an institution’s\nawareness of the cyber operations of other actors in a relevant region\n(or ideally at a global scale). While this is a desirable attribute for\ncorporations and public-facing value stakeholder entities, it is a\ncrucial ingredient for fourth-party collection as it constitutes the\nfundamental insight leveraged to target desirable nodes and stay\nahead of the victim intelligence service’s methods.\n\n\npersistent means of access, or an autonomous implant (whose\nownership is unrelated to the operation’s stakeholding threat\nactor) collecting information from that box. To better clarify\nthe situation, let’s apply this concept specifically to dedicated\nVPSs operating as C&Cs and not compromised servers where\nownership ambiguity implicitly applies.\n\nManaging a sprawling C&C infrastructure is a costly and\ndifficult problem, resistant to perfect automation, prone to\nfailures, misconfigurations and lapsed registrations. C&C\nmanagement is the cornerstone of the thesis that cyber\noperations do not scale well – hence the proliferation of\noperational security failures and mistakes[7]. As threat actors\nbecome favoured by their tasking entity (i.e. sponsor\ngovernment), their operational requirements are often\ndrastically increased without expanded resources or adequate\ntime for tooling and preparation.\n\nDespite their involvement in compromising systems,\ncampaign operators are often as unconcerned about the\nintegrity of their own systems as their victims. Talent in these\nareas is non-transferable: those devious operators endowed\nwith the gift of offensive capabilities are no closer to solving\nthe issue of maintaining device integrity than we are of\nperfecting our offensive capabilities by virtue of engaging in\nsecurity research. To that point, despite being managed by\nproficient attackers, the inner workings and network\ninteractions of command-and-control servers are in many\ncases no better monitored than any other system.\n\n_Let us envision the following idealized hypothetical situation:_\n\nAgency-A becomes aware of Agency-B’s sprawling campaign\nin desirable territory Q. As Agency-A is not aware of the\nparticular targets that would prove desirable within that\nterritory, it proceeds to map Agency-B’s campaign\ninfrastructure, noting that none of the nodes are particularly\naccessible by means of passive collection alone. Assessing the\nReasonable Attainable-Access Potential of the servers\ninvolved, it turns out that Agency-B’s servers are reasonably\naccessible: either by means of a vulnerability for which\nAgency-A has already developed an exploit (or could abuse\nwith little to no investment), or perhaps by means of\ncredentials already[8] within Agency-A’s databases. But\nsuccessful initial access represents an ephemeral beachhead\nfor our idealized attacker.\n\nHaving established initial access, a gung ho actor might set\noff to explore the server’s pilfered contents like a kid in a\ncandy store, but the prolific Agency-A will instead seek to\nunderstand the intended set-up of the server: does it function\n_as a relay for the operators – or as a staging server for tools_\n_and payloads? Does it host exfiltrated material, or does it_\n_forward it to a chain of other servers? Barring the rare_\nscenario where the operation of that server might involve\nsome stringent security practices, Agency-A will seek to\nmaximize the value of its access relative to the determined\n\n7 The sort of fortunate mistakes on which threat intel researchers can\ncapitalize to hunt for further elements in a campaign, or perhaps even\ngain greater information on the identity of the actor involved.\n8 Agency-A may already possess relevant credentials by means of\nautomated bulk passive collection systems, second-party collection or\nall-source intelligence sharing, third-party collection with access to\nrelevant service providers (for example, the email provider used\nduring a VPS registration, or the VPS hosting provider), or simply by\nmeans of previous acquaintance with Agency-B’s poor infrastructure\nmanagement practices (after all, password reuse cuts both ways).\n\n\n-----\n\nfunctionality of the server. At the very least, Agency-A will\nlikely place a webshell or replace a system binary with one\nthat ensures persistent, responsible[9] access going forward.\n\nIf the functionality of the server signals high projected value\nto its strategic interests, Agency-A is likely to upgrade this\naccess with an implant that automates the desired fourth-party\ncollection. This implant’s functionality can be as simple as\nforwarding a copy of all exfiltrated materials to Agency-A’s\nown collection infrastructure. In all likelihood, the\nopportunity will be maximized to automate greater\ncapabilities still, including:\n\n_• Logging of all operator activities, whether in the case of_\na relay server or to understand operator tasking and\nexfiltration practices.\n\n_• Server-side beaconing, particularly useful in the case of_\ninfrastructure that’s continually reassigned or taken\non- and off-line and only made available during attack\nphases.\n\n_• Watermarking of files, placing callback beacons or_\n_further payloads within pilfered materials to gain tailored_\naccess to the operator’s machines.\n\n_• Tool collection, particularly useful in the case of a_\nstaging server that will contain malware and exploits\nintended for use in current and future campaigns.\n\nFurthermore, in order to protect Agency-A’s access, the\nimplant may be loaded with a rudimentary AV-like\ncomponent. The intended functionality is multi-dimensional:\nby monitoring for the presence of other known – or as of yet\nunknown – adversaries, Agency-A protects its access, the\nintegrity of its investment (by protecting a likely unknown\nimplant from being discovered and analysed), and increases\nits cyber situational awareness capabilities by learning more\nabout other threat actors that have reached a similar apex\nstage of maturity to conduct similar operational manoeuvres[10].\nThe functionality consists of monitoring for known\nadversaries’ indicators of compromise and the generation of\ngeneral or specific telemetry [2] from the victim server. After\nall, it’s the fourth-party collector’s curse to look over its\nshoulder as well, lest it fall prey to its own tactics.\n\n## ‘We heard you like popping boxes, so we popped your box so we can watch while you watch’\n\nAs was clearly stated at the outset of this research endeavour,\nattempting to highlight examples of fourth-party collection is\na difficult exercise in the interpretation of shadows and vague\nremnants. While passive collection is beyond our ability to\nobserve, active collection involves the risk of leaving a\n\n9 The idea of responsible access was sparsely debated (and unfairly\ncriticized) by the information security community under the term of\nart ‘NOBUS’ (No One But US) backdoors.\n10 Nothing discounts the possibility that an implant in a vulnerable\ncommand-and-control server may have been placed there by the\nnewer player in the fourth-party collection space: the more reckless\nsecurity researchers. While most companies will not condone\nbreaking into command-and-control servers (much less interfering\nwith the integrity of servers that are possible subjects of ongoing\nlaw-enforcement investigations), it’s nonetheless not beyond the pale\nfor an overzealous threat intelligence company to enable some form\nof permanent access to continue to monitor a threat actor’s\noperations.\n\n\nfootprint in the form of artifacts. In the course of APT\ninvestigations, Kaspersky Lab’s Global Research and Analysis\nTeam (GReAT) has encountered strange artifacts that defy\nimmediate understanding in the context of the investigation\nitself. While we cannot be certain of the intent or provenance\nof these artifacts, they nonetheless fit a conceptual framework\nof active fourth-party collection and are presented as such:\n\n**_Crouching Yeti’s pixelated servers_**\n\nIn July 2014, we published our research [3] on Crouching\nYeti, also known as ‘Energetic Bear’, an APT actor active\nsince at least 2010. Between 2010 and 2014, Crouching Yeti\nwas involved in intrusions against a variety of sectors,\nincluding:\n\n - Industrial/machinery\n\n - Manufacturing\n\n - Pharmaceutical\n\n - Construction\n\n - Education\n\n - Information technology\n\nMost of the victims we identified fell into the industrial and\nmachine manufacturing sector, indicating vertical of special\ninterest for this attacker.\n\nTo manage its victims, Crouching Yeti relied on a network of\nhacked websites which acted as command-and-control\nservers. For this, the attackers would install a PHP-based\nbackend that could be used to collect data from or deliver\ncommands to the victims. To manage the backend, the\nattackers used a control panel (also written in PHP) that, upon\nchecking login credentials, would allow them to manage the\ninformation stolen from the victims.\n\nIn March 2014, while investigating one of the hacked sites\nused by Energetic Bear, we observed that for a brief period of\ntime, the page for the control panel was modified to include\nan <img src> tag that pointed to a remote IP address in China.\nThis remote 1x1 pixels wide image was likely intended to\nfingerprint the attackers as they logged into their control\npanel. The fingerprinting could have been used to collect\nattributory indicators. The usage of an IP address in China,\nwhich appeared to point to yet another hacked server, was\nmost likely an attempt at a rudimentary false flag should this\ninjection be discovered.\n\n**_NetTraveler’s most leet backdoor_**\n\nWhile investigating the NetTraveler attacks, we obtained a\ndisk image of a mothership server used by the threat actor.\nThe mothership, a combination staging and relay server,\ncontained a large number of scripts used by the attackers to\ninteract with their malware, as well as VPN software and\nother IP masking solutions used to tunnel into their own\nhacking infrastructure.\n\nBeyond the fortuitous boon of seizing such a content-rich\nserver, GReAT researchers made a further unexpected\ndiscovery: the presence of a backdoor apparently placed by\nanother entity.\n\nWe believe the backdoor was installed by an entity intent on\nmaintaining prolonged access to the NetTraveler\ninfrastructure or their stolen data. Considering that the\nNetTraveler operators had direct access to their mothership\n\n\n-----\n\nserver and didn’t need a backdoor to operate it, we consider\nother possible interpretations less likely.\n\nThe artifact encountered is the following:\n\n**Name** svchost.exe\n\n**MD5** 58a4d93d386736cb9843a267c7c3c10b\n\n**Size** 37,888\n\nInterestingly, the backdoor is written in assembly language\nand was injected into an empty Visual C executable that\nserved as a template. This unusual implementation was likely\nchosen in order to confuse analysis or prevent detection by\nsimple anti-virus programs.\n\nThe backdoor is primitive and does nothing but listen to port\n31337[11] and wait for a payload to be sent. The acceptable\npayload format is depicted in Figure 1.\n\n_Figure 1: Acceptable payload format._\n\nThe assembly code is then executed and can perform any\naction chosen by the predatory attackers. The backdoor\nrequires no authentication. Combining this sort of backdoor\nwith Metasploit or other similar frameworks could easily have\nbeen used to control the system.\n\n**_B lack sheep wall_**\n\nIn June 2016, Kaspersky Lab researchers discovered an\nunknown zero-day Adobe Flash Player exploit actively\nleveraged in targeted attacks. Further analysis revealed\npayload overlaps with the DarkHotel threat actor. DarkHotel\nis known to have deployed several Adobe Flash Player\nexploits over the years. What makes this case particularly\ninteresting is the fact that one of the websites compromised\nby DarkHotel for use in watering hole attacks hosted\n\n11 The most ‘LEET!’ port.\n\n\nexploitation scripts from another APT group. We code-named\nthis second actor ‘ScarCruft’.\n\nAccording to our telemetry, ScarCruft appears to have been\ntargeting Russian, Chinese, and Korean-speaking companies\nand individuals, among others. This actor relies on watering\nhole and spear-phishing attacks to infect its victims.\n\nThe most interesting overlap between DarkHotel and\nScarCruft became apparent with two operations we named\n‘Operation Daybreak’ and ‘Operation Erebus’.\n\nOperation Daybreak appears to have been launched by\nScarCruft in March 2016 and employed a previously\nunknown (zero-day) Adobe Flash Player exploit. The script\nused for exploitation was hosted at the following link:\n\nhxxp://scarcroft[.]net/plus/thumbs/index.php\n\nAt the end of May 2016, Kaspersky’s advanced heuristic\ndetection technology caught a new, unique web attack\nabusing the CVE-2016-4117 vulnerability. The malicious\npayloads were distributed from compromised websites and\ndidn’t display apparent connections to previously known\nmalware. We decided to call this ‘Operation Erebus’.\n\nIn Operation Erebus, the two hacked websites used in the\nattacks included the following link:\n\nhxxp://scarcroft[.]net/wp-content/plugins/twitplug/\ntwitter.php\n\nAdditional links included:\n\nhxxp://www[.]chateau-eu[.]fr/wp-content/player/\nqqplayer.php?...\n\nhxxp://www[.]chateau-eu[.]fr/wp-content/player/\nqqplayer.jpg\n\nhxxp://www[.]chateau-eu[.]fr/wp-content/plugins/\ngallery/photo-gallery.php?...\n\nhxxp://www[.]chateau-eu[.]fr/wp-content/protect/wpprotect.php?...\n\nThose links delivered a CVE-2016-4117 exploit, ripped from\npreviously known samples delivering FinFisher payloads,\nwith a slightly modified shellcode and payload URL, as\nshown in Figure 2.\n\n|Name|svchost.exe|\n|---|---|\n|MD5|58a4d93d386736cb9843a267c7c3c10b|\n|Size|37,888|\n\n\n_Figure 2: The links delivered a CVE-2016-4117 exploit, ripped from previously known samples delivering FinFisher payloads,_\n_with a slightly modified shellcode and payload URL._\n\n\n-----\n\nThe exploits were delivered through watering hole attacks\nfrom several compromised websites, including:\n\n  - rfchosun[.]org\n\n  - dailynk[.]com\n\n  - cafe.daum[.]net\n\nFigure 3 is a diagrammatic representation of the attacks,\nwhich serves to better illustrate the connections and overlaps.\n\nAccording to our telemetry, DarkHotel’s Operation\nDaybreak links were used as early as April 2016;\nScarCruft’s Operation Erebus links were first used in attacks\non 26 May 2016. This suggests the possibility that the\nScarCruft actor may have observed the DarkHotel attacks.\nThey succeeded in breaching the same website and used it\nfor another set of attacks on 26 May. The hacked site\noverlap was enough to trick us (and other researchers) into\nbelieving that ScarCruft and DarkHotel were the same threat\nactor, and thereby that Operation Erebus and Operation\nDaybreak were launched by the same actor. It is now clear\nthat this is not the case.\n\nFocusing on TTPs and victim tasking is useful in further\ndisambiguating the two threat actors (Figure 4).\n\n\nDarkHotel’s Operation Daybreak (Figure 4, right) relied on\nspear-phishing emails served to victims in the geographical\nfocus illustrated in Figure 4: predominantly targeting Chinese\nvictims with a Flash Player zero-day. Meanwhile, ScarCruft’s\nOperation Erebus focused primarily on South Korea.\n\nMore recently (as of April 2017), the ScarCruft actor has been\nattacking South Korean institutions for both espionage and\nsabotage in relation to the presidential elections. While the\nmain goal of this recent wave of attacks is stealing\ninformation from valuable targets, it appears that creating\nsocial chaos is not beyond the ScarCruft actor’s intent from\ntime to time. For this purpose, ScarCruft leveraged malicious\n_Hangul documents (.HWP) that drop a destructive payload._\nUnlike the ScarCruft actor, DarkHotel has not been observed\nengaging in destructive operations to date.\n\n## BYPRODUCTS OF NON-CONSENSUAL INTELLIGENCE SHARING\n\nHaving detailed the means and constraints that enable and\nguide the practice of fourth-party collection, we’d do well to\nunderstand its benefits and byproducts. This allows us to take\ninto account the incentives that justify this intricate, delicate,\n\n\n_Figure 3: Diagrammatic representation of the attacks._\n\nOperation Daybreak\n\n_Figure 4: Focusing on TTPs and victim tasking._\n\n|Operation Erebus|Operation Daybreak|\n|---|---|\n|||\n\n\n-----\n\nand investment-heavy practice. The main aspects we’ll focus\non are tasking, code reuse, and adversarial learning benefits.\nWhere possible we have added small but illustrative examples\nencountered in the wild.\n\n## Tasking-by-proxy\n\nTasking is one of the most revealing aspects of an operation.\nQuality tasking (i.e. avoiding a ‘spray-and-pray’ approach) is\nthe mark of a mature and measured threat actor. Few reach\nthis level of care, as most continue to rely on wide-ranging\nspear-phishing waves followed by lateral movement intended\nto map the network-to-individual topology of a breached\norganization. Some services may opt for costly HUMINT or\ninexact OSINT measures. However, for the most capable\nSIGINT agencies, fourth-party collection represents a way to\navoid this costly and noisy phase altogether. This is\naccomplished by taking tasking queues from other threat\nactors – particularly those with a stakeholder role over a\ndesirable region or organization: the more capable Agency-A\nis able to pinpoint valuable systems and individuals by virtue\nof Agency-B’s prolonged interest in them and the observable\nquality of the exfiltration or functional value evident in\nAgency-B’s resulting collection.\n\nNot only is Agency-A able to lower its investment threshold\nfor its own campaign in a foreign region thanks to\nfourth-party collection, it may also be able to leverage another\nthreat actor’s access to further its own access. The more\nintimate Agency-A’s understanding of the techniques and\ntools leveraged by a lesser-grade attacker, the more likely\nopportunities for victim stealing will present themselves. For\nexample, if Agency-B is using an implant that accepts\nnext-stage payloads without stringent checks for provenance,\nAgency-A can place its own implant by means of the careless\ndesign of Agency-B’s implant. Or perhaps Agency-C is so\noblivious as to allow its implants to accept commands\npromiscuously, allowing Agency-A direct operator access to\naccomplish further access. These, and other mistakes, would\nallow Agency-A to swoop in and steal a foreign service’s\nvictims altogether.\n\nAgency-A can not only place its own implant in the victim\nbox but also proceed to clean out the foreign malware. We\nhave witnessed interesting cases where advanced implants\nwere leveraged as benevolent protection solutions for likely\noblivious high-value religious figures under constant attack\nby hostile governments.\n\nAlternatively, threat actors may well choose to share a victim.\nThis may well happen if another threat actor is an ally or if\nAgency-A understands that the other threat actor inhabiting\nthe same box is so persistent as to likely insist on maintaining\nor regaining access. By allowing another to exist on the same\nvictim box, Agency-A maintains its access without arousing\nsuspicion from another capable service as to the presence\n(and characteristics) of Agency-A’s toolkit. However, it must\nbe noted that this is high-risk behaviour.\n\nWhere an actor of the quality and diligence of Agency-A is\nunlikely to arouse suspicion by design, and thereby won’t\nprovide many opportunities to get caught, reckless lessergrade actors will likely arouse eventual scrutiny. When an\nincident response team shows up to weed out the loud and\ncareless Agency-C, those same forensic artifacts are likely to\ncontain traces of Agency-A and any other intelligence service\n\n\nthat may have been inhabiting the same high-value target. If\nthis seems unlikely, keep in mind that tasking does not occur\nin a perfectly isolated theoretical vacuum. Tyrants, political\nfigures, and high-value researchers use one or multiple\nsystems, and a collection agency tasked with gaining as much\ninformation on these figures as possible has a limited number\nof opportunities to do so consistently. The avid reader may\nremember the story of the ‘Magnet of Threats’: a machine in\nthe Middle East of such high value as to simultaneously host\nimplants for Regin, Turla, ItaDuke, Animal Farm, Careto, and\nEquation. It was an investigation into this very system that\nyielded the first sighting and discovery of the prolific\nEquation Group.\n\n## Why reinvent the wheel?\n\nWhile we may subdivide artifacts into exploits, infection\nvectors, implants, etc., they’re ultimately tools for operators\nto accomplish specific goals as they carry out their\ncampaigns. As such, who’s to blame operators for stealing\neach other’s tools? One of the possible boons of fourth-party\ncollection is access to staging servers that may host exploits,\nimplants, scripts, and possibly even source code (depending\non the carelessness of the victim service). Exploits,\nparticularly zero-days, are of immediate benefit for any threat\nactor and are likely to be ceased and repurposed immediately\nto maximize the ongoing pre-patch window. Tools and\nimplants pose a more insidious gain and one that has caused\ngreat (if perhaps overblown) concern in the infosec\ncommunity’s sadomasochistic flirting with armchair\nattribution.\n\nThe more recent point of contention is that of code reuse and\nrepurposing. For experienced malware analysts, clustering[12]\nmalware on the basis of code reuse is a golden practice, with\nboth industry standard and proprietary tools that can match\nfunction overlaps down to a percentage point. Partial code\nsimilarities or reuse are not the beginning of an unsolvable\nparadox as popular Tweets might have us believe. Instead,\nthey suggest that the developers chose to implement a portion\nof code to which they had access (whether originally theirs,\nfrom a forum, a book, or wherever) once again. This form of\nclustering continues to stand up to scrutiny and presents great\nvalue for campaign and threat actor understanding, within the\nbounds of reasonable insight that clustering – and not\n_attribution – can provide._\n\nRecent PR-worthy global incidents were impacted by insights\ngained largely thanks to code reuse that allowed for threat\nactor clustering. The two incidents that come to mind are the\nWannaCry cryptoworm and SWIFT hack clustering to the\nLazarus Group and their BlueNoroff subset, respectively.\n\nThe original research[13] that yielded the bulk of the Lazarus\nGroup cluster was made possible entirely by the threat actor’s\nconsistently careless cut-and-splice methodology for\nmanaging a gigantic codebase in order to yield different tools\n\n12 Clustering is an important term in malware analysis that refers to\nthe ability to group similar artifacts together. It’s a term the wider\ninfosec community would do well to avail itself of, rather than obsess\nover attribution, which looks to cross the fifth domain’s boundary to\npinpoint a perpetrating organization or group of individuals.\n13 Joint research between Juan Andres Guerrero-Saade (Kaspersky\nGReAT) and Jaime Blasco (AlienVault). Presented in parallel with\n_Novetta’s tour de force in profiling nearly a decade’s worth of_\nLazarus Group tools under the moniker ‘Operation Blockbuster’.\n\n\n-----\n\nand malware families as needed. Despite this ideal ground for\nclustering, many were left unsatisfied by the findings as they\nwere recast as clustering-cum-attribution claims.\n\nOnce we move away from the temptation to equate clustering\nand attribution, we can clearly identify the issue of code\nrepurposing of privileged, proprietary, and closed-source code\nas one that challenges our ability to accurately and\nconsistently cluster threat actors. If Agency-A has access to\nAgency-B’s source code and begins to splice the latter’s\nfunctionality into its own malware, how do we manage the\nclustering overlap? What about when Agency-A decides to\nrun an operation entirely using Agency-B’s source code (but\nperhaps relying on an entirely different infrastructure)? What\nif Agency-C were to get a well-placed human asset in\nAgency-A to quietly steal the far more prolific actor’s tools\nand begin to leverage them as its own? Malware clustering\nyields straightforward results but threat actor clustering (and\nsubsequent attempts at interpretative attribution) fray and\nsuffer in the face of fourth-party collection gains as they\nalways have in the face of HUMINT infiltrations and operator\ndefections.\n\n## A minute of schadenfreude, a year of tooling\n\nA perhaps less controversial example of code repurposing can\nbe observed in the aftermath of the poorly disseminated\n_HackingTeam dump. While the latter commanded great public_\ninterest into the company’s contracting practices with\nobjectionable governments, the dumping of already\nweaponized zero-day exploits and a full malware codebase\nposed greater gains for determined attackers than the benefits\nit conferred on Internet safety. For example, DarkHotel was\nseen repurposing a HackingTeam Flash exploit [4] mere days\nafter the dump. And while the malware codebase itself may\nprove too intricate a set-up to mount in its entirety,\ndetermined attackers have found ways to make the implant\ncode useful in the wild.\n\nFor those unfamiliar with the infamous developers,\n_HackingTeam is a Milan-based information technology_\ncompany that sells offensive intrusion and surveillance\ncapabilities primarily to governments and law enforcement\nagencies. Its main product is called Remote Control Systems\n(RCS) and enables monitoring of the communications of\nInternet users, deciphering their encrypted files and emails,\nrecording Skype and other VoIP communications, and\nremotely activating microphones and cameras on target\ndevices.\n\n_HackingTeam’s RCS features a multi-stage attack platform_\nthat relies on several different trojans in order to minimize the\nchances of discovery and operational loss. The first-level\nvalidator-style trojans are referred to as ‘Scouts’. If the victim\nis confirmed as the designated target, the ‘Scout’ is upgraded\nto one of the more sophisticated implants, either ‘Soldier’ or\n‘Elite’, with each level adding further features and capabilities\nto spy on the victim.\n\n‘Dancing Salome’ is the Kaspersky codename for a previously\nundisclosed APT actor with a primary focus on ministries of\nforeign affairs, think tanks, and Ukraine. What makes\nDancing Salome interesting and relevant is the attacker’s\npenchant for leveraging HackingTeam RCS implants compiled\nafter the public breach. The name ‘Dancing Salome’ was\nderived from a hard-coded directory in the RCS binaries,\n<X:\\RCS\\salome\\WinWord.exe>. A subset of Dancing\n\n\nSalome-related activities was subsequently reported as\n‘Operation Armageddon’.\n\nIn 2016, we observed two previously unknown HackingTeam\n_RCS (‘Scout’) implants uploaded to a multi-scanner service:_\n\n**Name** **Upload** **Country** **Hash**\n**date** **of**\n**upload**\n\nSecurity 12 Feb Russia 99da44b0f1792460ba1d\nConference 2016 6730c65ec190\nAgenda.docx\n\nInvitation.docx 27 Jan Poland d1f1d7b84bb5bc84243c\n2016 3b43e93622cd\n\n_Table 1: Previously unknown HackingTeam RCS implants._\n\nThe implants were embedded into Microsoft Word files. The\nfirst document refers to a conference about ‘Domestic\nDevelopments in the South Caucasus’. The second\ndocument is an invitation to an event on ‘South Caucasus\nSecurity’, allegedly organized by the ConcorD Centre for\nPolitical and Legal Studies in cooperation with Friedrich\nEbert Stiftung [5], a non-profit German political foundation\ncommitted to the values of social democracy. According to\nits website:\n\n_‘The Friedrich-Ebert-Stiftung (FES) is the oldest political_\n_foundation in Germany, with a rich tradition in social_\n_democracy that dates back to its founding in 1925. The_\n_foundation owes its formation and mission to the political_\n_legacy of namesake Friedrich Ebert, the first_\n_democratically-elected President in German history.’_\n\n_‘The Regional Office South Caucasus is based in Tbilisi_\n_and coordinates programs in Georgia, Armenia and_\n_Azerbaijan. In addition, there is a Liaison Office in_\n_Yerevan that focuses on projects in Armenia under the_\n_umbrella of the Regional Office in Tbilisi.’_\n\nThese documents do not contain exploits; instead, they rely\non the user clicking on the embedded OLE objects inside.\n\nThe OLE storage in the Word documents holds the final\n_Windows PE payloads, which have the following identifying_\ndata:\n\n  - 6355c82c7c6a90ef41824a03bbabbabc\n\n  - 99a18bf3c04a491b256f7d60eb6e0f26\n\nBoth executables are VMProtect-ed RCS ‘Scout’ binaries. The\ntwo Scout binaries used in the Dancing Salome attacks are\nsigned with an invalid digital certificate issued to ‘SPC’[14].\nBoth samples have been configured to work with the same\ncommand-and-control server: 89.46.102[.]43.\n\nAn interesting indication that Dancing Salome is not a\nlegitimate HackingTeam customer comes from the samples’\nhard-coded customer ID. As a means of tracking samples that\nmight leak to multi-scanners, all HackingTeam samples\ncontain a customer ID that points to the licence of the RCS\nMasterNode used to generate them.\n\nIn the case of Dancing Salome, the customer ID can easily be\nspotted in the decrypted payload (Figure 5).\n\n14 Serial: 58 be 7b 63 89 43 cb 90 44 1a 09 42 25 ed c5 1c.\n\n|Name|Upload date|Country of upload|Hash|\n|---|---|---|---|\n|Security Conference Agenda.docx|12 Feb 2016|Russia|99da44b0f1792460ba1d 6730c65ec190|\n|Invitation.docx|27 Jan 2016|Poland|d1f1d7b84bb5bc84243c 3b43e93622cd|\n\n\n-----\n\n_Figure 5: HackingTeam customer ID string inside decrypted samples._\n\n\nIn this case, the customer ID is ‘Xt0DW33K...’. A dedicated\ntool called rcs-kill.rb [6] released with the code leak allows us\nto identify the customer (or licence) name based on the string\nshown in Figure 6.\n\n_Figure 6: We can identify the customer or licence name based_\n_on this string._\n\nIn this case, ‘fae-poc’ means ‘field application engineer –\nproof of concept’. Field application engineers are\n_HackingTeam terminology for those in charge of on-site_\ncustomer demos of RCS. In the console-to-mainframe design\nof RCS, field engineers can connect to a MasterNode\n(malware factory) server with limited licensing in order to\ngenerate backdoors that can be tested for clients. The use of\nthis particular designation may imply that the attacker has\nstood up a minimalist MasterNode installation and is using\nthe proof-of-concept mode to generate these binaries. This\nmay happen either through the distribution of unlicensed\nsoftware or, more likely, as re-compiled source code from the\n_HackingTeam dump itself._\n\nTo further support this theory, some samples contain strings\nreferencing a BleachBit executable used as one of the default\n\n[7] HackingTeam Scouts for field engineers to showcase to\ncustomers. Of course, purchasing a fully featured\n_HackingTeam RCS system is quite expensive; in this case, we_\nbelieve the attackers repurposed the leaked RCS sources in a\ntruly cost-effective manner. While the clustering confusion is\nultimately mitigated due to the actor’s inability to wield the\n_HackingTeam malware suite effectively and their reliance on_\nnew infrastructure, it stands as a clear example of how access\nto a privileged codebase can problematize threat actor\nclustering based on code reuse alone.\n\n## O f fensive leveraging of cyber situational awareness\n\nIt’s only natural that an actor that has found a way to\n\n\neffectively weaponize their existing cyber situational\nawareness for great gains will know to value the generation of\nfurther awareness of the activities of other capable threat\nactors. There are many methods by which to hunt and track\nnew threats in cyberspace. Different research outfits have\ndeveloped their own styles to match the peculiarities of the\ndata sources available to them. SIGINT giants with an\ninformation assurance or government-wide cyber defence\nremit have also developed impressive capabilities to leverage\ntheir unique visibility to track adversaries. External observers\noften consider cybersecurity a commodity state accomplished\nby the acquisition of expensive combinations of hardware and\nsoftware. True practitioners actually plagued by the ghastly\ntask of defending a sprawling heterogeneous network have\ninstead accepted that, not only will intrusions happen and\nincident responders be needed, but that so many of these\nincidents will take place so often that an awareness of existing\nthreats must guide how they leverage the very limited\nresources available for this task.\n\nThe nascent private offering of threat intelligence is designed\nto provide a context to guide this complex calculus. It says,\n_‘you have adversaries, these are known to other organizations_\n_facing similar threats, here are their past and current tactics,_\n_tools, and infrastructure, defend and hunt accordingly’. Most_\nthreat intelligence producers are servicing a variety of\ncustomers in different verticals, with different capital and\nvalue features, and so on. As such, producers are not in a\nposition to genuinely identify what threat actors will be\nrelevant to their customers (or the public interest as a whole,\nin the case of those altruism/PR-driven producers still\npublishing indiscriminately). This is the main thrust behind\nour continual argument that the only genuine threat\nintelligence is global in scope[15].\n\nWhile mere mortal threat intelligence producers are barred\nfrom greater prescience regarding the ultimate applied\n\n15 A thought-experiment: A threat intelligence producer contracted by\nAgency-A encounters Agency-A’s toolkit during a separate incident\nresponse engagement in an unrelated customer’s network.\nRecognizing its likely provenance, the TI company chooses to\ndisengage and avoid researching the intrusion altogether so as to\navoid rubbing Agency-A the wrong way. Six months later, Agency-A\nbecomes aware – through public sources – that Agency-B had\nphysically infiltrated their outfit, stolen a trove of tools, and leveraged\nthem against institutions under Agency-A’s defence purview. Was the\nthreat intelligence producer complicit in Agency-B’s stratagem by\nvirtue of its wilful ignorance? Did Agency-A implicitly encourage\nthis dereliction of duty?\n\n\n-----\n\ndefence needs of their customers, a ‘god on the wire’-style\nSIGINT agency conducting fourth-party collection is in a\nspecial position to understand the context of adversary\ncampaigns before anyone else does.\n\nBy virtue of passive or active collection to staging servers (or\neven operator boxes), Agency-A eliminates a huge element of\nuncertainty from the threat intelligence it can leverage for\ninformation assurance purposes. Rather than saying ‘these are\n_the tools Agency-B is likely to use’, Agency-A is in a position_\nto say ‘these are the tools Agency-B is currently using/getting\n_ready to leverage’. This high-fidelity, up-to-the-minute_\nawareness of adversary tactics is limited only by Agency-A’s\nvisibility into Agency-B’s infrastructure and is of incalculable\nbenefit if Agency-A’s internal fusion processes are efficient\nand effective enough[16] to leverage this information for\ndefence while it’s still actionable.\n\nHowever, even if information assurance value is unlikely to\nbe derived, other forms of adversarial learning are likely to\nform. As Agency-A becomes aware of the techniques\nleveraged by other threat actors, takes stock of the means by\nwhich Agency-B became aware of Agency-A’s operations,\nand observes how private sector researchers latch onto other\nadversaries[17], it is likely to fold this knowledge into its own\ntoolkit development and operator procedures.\n\nDue to the scalability issues in offensive operations, most\nthreat actors (even nation-state-sponsored actors) are not in a\nposition to afford the luxury of becoming untraceable, truly\ndifficult to discover, and impossible to weed out of a victim\nnetwork. However, institutions like Agency-A are in a\nposition to become the true apex predators of cyberspace and\nhave proceeded to do so.\n\nThe following are examples of adversarial learning. The first\nis of mid-grade actors creating confusing overlaps that\nmisguide campaign understanding by copying one another’s\nTTPs[18,19]. The second is an example of a true apex predator\nand the techniques entailed therein that generate truly difficult\n– perhaps even insurmountable – problems for incident\nresponders and threat intelligence producers going forward:\n\n## A most curious overlap\n\nIn June 2016, one of our hunting YARA rules implementing a\nlooser heuristic for WildNeutron samples fired on an\ninteresting trojan that we called ‘Decafett’. Due to the\npossible overlap[20] with the notorious WildNeutron actor, we\nwere eager to analyse it further.\n\n16 This is unlikely to happen in organizations that place greater value\non their collection techniques than their information assurance remit,\nas the possibility of revealing their level of access into Agency-B’s\noperational infrastructure will be considered of far greater negative\nimpact than Agency-B’s intrusion and access into high-value systems.\nThe true negative impact of over-enthusiasm with offensive\ntechniques will likely become clear as Agency-B’s access is\nweaponized in domains beyond cyber.\n17 ‘IMHO, next-gen tradecraft will require learning from these reports\n_and will eventually involve end-to-end decisions from development to_\n_deployment to shutdown / upgrade’ –‘What did Equation do wrong,_\nand how can we avoid doing the same?’ [8]\n18 Tools, techniques, and procedures.\n19 The example of shared compromised infrastructure between\nScarCruft and DarkHotel is relevant to this category as well.\n20 Further analysis ultimately indicated that there was, in fact, no code\noverlap with WildNeutron.\n\n\nThis backdoor implements keylogging capabilities that\nmonitors the victim’s keyboard activity and logs it to a text\nfile stored in the <%APPDATA%\\Microsoft\\Office\\>\ndirectory in an encrypted form. It is also capable of launching\nother processes as designated by an external file named\n<restore.idx> located in the same directory.\n\nSome of the strings used by the binary are encrypted with\nsimple custom algorithms (combining XOR, SUB, ADD and\nother arithmetic instructions) that are different for every\nstring. These get decrypted on the fly using inline decryption\nroutines during program execution and are immediately\nre-encrypted once used.\n\nThe C&C IP address calculation is what sets Decafett apart\nfrom most other malware. It is computed based on a hostname\nstored in the registry or based on a default C&C hostname\nhard coded into the executable: download.ns360[.]info.\nInterestingly, the authors implemented an unusual mechanism\nin the backdoor to obtain the actual C&C IP address. For this,\nthey first resolved the C&C domain through a DNS query and\nthen XORed the IP value with the key 0x186BFB49.\n\nThe following is an example using the default hostname,\ndownload.ns360[.]info:\n\norig IP resolution: 54.251.107.25= 36 FB 6B 19 =\n196BFB36\n\nxored: 127.0.0.1  = 7F 00 00 01 = 0100007F\n\nThe following is an example of the default URL with an\nadded number, download1.ns360[.]info:\n\norig: 84.45.76.100 = 54 2D 4C 64 = 644C2D54\n\nxored: 29.214.39.124 = 1D D6 27 7C = 7C27D61D\n\nThis IP XOR technique was later seen implemented in other\nmalware from the Lazarus Group. We were eventually able to\nattribute the Decafett malware to the Lazarus Group with\ngreater certainty in 2016. This assessment was further\nconfirmed when its usage was also observed during\nBlueNoroff[21] operations.\n\nAnother interesting feature of Decafett is its reliance on a\nspecific and unusual dynamic DNS provider. Some of the\nDecafett C&C servers we identified include:\n\n  - download.ns360[.]info\n\n  - update.craftx[.]biz\n\n  - mozilla.tftpd[.]net\n\n  - checkupdates.flashserv[.]net\n\nThe top domains used for these hostnames are derived from\nthe obscure dynamic DNS provider ‘DNSdynamic’ (see\nFigure 7).\n\nThe owner (‘Eddie Davis’, according to the official Twitter\naccount [9]) appears to have been quite active between 2011\nand 2014. The last post on his Twitter account (at the time of\nwriting) is from June 2014.\n\nWe attempted to uncover other potentially malicious\nsubdomains (in addition to Decafett’s\ncheckupdates.flashserv[.]net) on top of the flashserv[.]net\n\n21 It’s worth noting that the Decafett malware also contains the wiping\nfunction identified by BAE researchers tying the Bangladesh Bank\nSWIFT attack to the BlueNoroff subset of the Lazarus Group, thus\nfurther tying these groups together.\n\n\n-----\n\n_Figure 7: The top domains used for these hostnames are_\n_derived from the obscure dynamic DNS provider_\n_‘DNSdynamic’._\n\nservice offered by DNSdynamic. Interestingly, we found that\nthe only other APT known to use this service is DarkHotel\n(also known as ‘Tapaoux’ – see Figure 8).\n\nThe DarkHotel/Tapaoux actor used these hosts in 2014, while\nDecafett used them in 2016. Given the long-standing\nadversarial relationship between these two threat actors, this\nindicates that the Lazarus Group likely adopted the usage of\nthis obscure dynamic DNS provider after – and likely as a\nresult of – DarkHotel’s use.\n\n## Th e beginning of the end\n\nOver the last few years, the number of apparently\n‘APT-related’ incidents described in the media has grown\nsignificantly. For many of these, though, the designation rank\nof APT – an ‘Advanced Persistent Threat’ – is usually an\nexaggeration. With some notable exceptions, few of the threat\nactors described in the media are advanced. These exceptions\nrepresent the pinnacle of cyber espionage tools – the truly\n‘advanced’ threat actors out there include: Equation [10],\nRegin [11], Duqu [12], and Careto [13]. Another exceptional\nespionage platform is ‘ProjectSauron [14]’, also known as\n‘Remsec’ or ‘Strider’ (see Figure 9).\n\nProjectSauron is a true bleeding-edge modular cyber\nespionage platform in terms of technical sophistication,\ndesigned with an eye towards long-term campaigns through\nstealthy survival mechanisms coupled with multiple creative\nexfiltration methods.\n\n**_The golden pupil_**\n\nProjectSauron is perhaps most impressive in its thorough\naddress of the weaknesses and failures of other top-tier threat\nactors. Emulating their better features while avoiding the\n\n\n_Figure 9: A decrypted LUA configuration script from which_\n_the name ProjectSauron was derived._\n\npitfalls that burned actors like Duqu, Flame [15], Regin and\nEquation turned ProjectSauron into such a formidable threat\nactor as to entirely bring into question the effectiveness of\nindicators of compromise (IOCs) in addressing truly\nadvanced intrusion sets going forward.\n\nProjectSauron was observed emulating the following threat\nactors’ innovations:\n\nDuqu Running only in memory\n\nUsing compromised intranet servers as\ninternal C&C servers\n\nAlternate encryption methods per victim\n\nNamed pipes for LAN communication\n\nMalware distribution through legitimate\nsoftware deployment channels\n\nFlame LUA scripts executed in an embedded\n(custom tailored) VM\n\nSecure file deletion\n\nAttacking air-gapped systems via removable\ndevices\n\nRegin and Usage of RC5/RC6 encryption\nEquation\n\nReliance on virtual filesystems (VFS)\n\nAttacking air-gapped systems via removable\ndevices\n\nHidden data storage on removable devices\n\nAdditional care was taken to avoid the following common\npitfalls:\n\n - Vulnerable or consistent C&C locations\n\n - ISP, IP, domain, or tool reuse across different victims and\ncampaigns\n\n - Cryptographic algorithm and encryption key reuse\n\n|Duqu|Running only in memory Using compromised intranet servers as internal C&C servers Alternate encryption methods per victim Named pipes for LAN communication Malware distribution through legitimate software deployment channels|\n|---|---|\n|Flame|LUA scripts executed in an embedded (custom tailored) VM Secure file deletion Attacking air-gapped systems via removable devices|\n|Regin and Equation|Usage of RC5/RC6 encryption Reliance on virtual filesystems (VFS) Attacking air-gapped systems via removable devices Hidden data storage on removable devices|\n\n\n_Figure 8: The only other APT known to use this service is Darkhotel (also known as ‘Tapaoux’)._\n\n\n-----\n\n - Forensic footprint on disk\n\n - Timestamp similarity throughout various components\n\n - Large volumes of exfiltrated data\n\n - Use of unusual network protocols or message formats.\n\nMoreover, by apparently automating the modification of most\n(if not all) IOC-worthy elements (like mutexes, filenames,\ntimestamps, service names, subdomains, etc.) on a peroperation basis, ProjectSauron limits the threat hunting value\nof happening upon a single intrusion. While carefully\nprepared YARA rules (the byproduct of in-depth RE) and\nin-memory analysis will detect ProjectSauron components,\nleveraging IOCs alone will not alert network administrators to\ntheir presence. This ‘next-gen tradecraft’[22] makes\nProjectSauron’s toolkit not only truly advanced but also\nbespoke – tailor-made to each victim – and entails severe\nconsequences for the future of threat intelligence[23].\n\n**_Untraceable exfiltration_**\n\nAnother suspected feature of ProjectSauron is noteworthy in\nthe context of the superpowers afforded to ‘god on the\nwire’-style cyber espionage actors. As mentioned before,\nattempting to point out the active leveraging of passive\ncollection capabilities on cyber operations is a hermeneutic\nand inexact endeavour. The following example may prove\nequally illustrative of a passive collection superpower, as it\nmay simply be the result of unfortunate timing, and should be\ntaken with a grain of salt:\n\nOne of the aforementioned innovative exfiltration methods\nrelies on emails, which are delivered via the use of LUA\nscripts to a number of mailboxes allegedly controlled by the\nattackers. Some of these mailboxes, for instance, were hosted\non free email providers such as Gmail or Mail.ru. To send\nemails to these mailboxes, ProjectSauron implants attempt a\ndirect connection to the specific mail server. If that fails, it\ncan try to deliver the emails using a ‘relay’ server. A deeper\ninvestigation into one of these relay set-ups revealed an\nunusual ProjectSauron superpower.\n\nOne of the cases we observed employed a relay set-up\npointing to a machine in Chile, belonging to a massive US\ncorporation. We contacted the owners and were allowed to\ncheck the server to better understand its configuration as an\nopen relay. However, the server was well secured and\nwouldn’t accept emails to mailboxes outside of its configured\ndomains.\n\nTwo possibilities remain: despite an unlikely timeline, the\nserver could presumably have been backdoored at some point\nbefore our investigation with special software that would\nintercept these emails and forward them to the attackers.\nAnother, more fascinating, possibility is that the attackers\nhave access to some of the fibre links between the victim’s\nInternet space and the Chilean relay, allowing them to capture\nthe exfiltrated information at network level.\n\n## CONCLUSION – AN UNCERTAIN FUTURE FOR THREAT INTEL\n\nThe more cautious Twitter talking heads rightly urge us to\nmince words – separating ‘intrusions’ from ‘attacks’, and\n\n22 To borrow a Vault7 term.\n23 Further discussed in the next section.\n\n\n‘espionage’ from ‘warfare’. While we agree with this cautious\nstance, the newfound military language of ‘cyberwarfare’\ndoes shed some light on the utilitarian characteristics of\n‘cyber-as-a-domain’ as perceived by the relevant nation-state\nstakeholders. Major General Amos Yadlin[24] characterizes this\ndomain[25] as having ‘unlimited range, very high speed, and\n\n[...] a very low signature’. While unlimited range and speed\nmake cyber operations infinitely desirable to rugged military\nfolks familiar with the true cost of conventional warfare, the\nfinal characteristic should make this domain precarious,\ncapricious, and terrifying in its own right.\n\n## A signature weapon?\n\nLow signature is a characteristic of weaponry whose\nresponsible party is not immediately apparent. Mortars and\nimprovised explosive devices (IEDs) have the have the ability\nto cause damage without immediately recognizable\nprovenance. An analysis of the trajectory of the mortar or the\ndetonation method of the IED will yield an indication of the\nparties responsible. It’s interesting to note that the notion of\nlow signature, while superficially applicable, is actually a\ndeceptive oversimplification of the complexities posed by the\nuse of ‘cyber weaponry’.\n\nThere is a difference between a lack of identifiability, or a\ndelay in identifiability, and the presence of identifiable traits\nthat misidentify the perpetrators while presenting no\ndiscernible difference in quality. Where the sourcing and\nmanufacturing processes of conventional weaponry present\nnear-impossible-to-circumvent opportunities to identify the\nprovenance of a weapon and its subsequent use, the infinitely\nreproducible nature of programs and digital tools add an\ninsurmountable layer of complexity to identifying the\nperpetrators behind operations. The last bastion of the notion\nof definitive identifiability seems to lie with intellectual\nproperty. ‘Can we identify the sole proprietor of a closed_source tool?’ In a world without perfect knowledge and_\nimmediate transference of means, the usefulness of this\ncriterion is fading.\n\nAttribution – beyond tool clustering and threat actor narrative\ninterpretations – is a demand to cross the boundaries of a\ngiven domain to point to a perpetrating entity in another. Our\ninterest is not in saying that cyber operations present no\ndiscernible signature, but rather that our analysis methods for\nestablishing provenance beyond the boundaries of the cyber\ndomain are limited logically by a lack of direct correlation\n\n[16] between the topology of a network, the functional\norganization of an institution, the position of an individual,\nand the ultimate symbolic value of individual targets in a\ngeopolitical and socioeconomic order.\n\nAn added nuance directly introduced by the practice of\nfourth-party collection in cyber operations is the discovery\nand potential repurposing of closed-source tools. Where\nfourth-party collection will shed light on a foreign service’s\nintelligence collection methods, recruitment tactics, and their\ntasking priorities, it can also yield tools, source code,\nprocedural guidelines, identifiable information on operators\nand their systems, and access to IPs and known infrastructure.\n\n24 Commander of Israeli Defence Intelligence (2006–2010).\n25 In his original quote, he refers to ‘cyber’ as the fourth domain – an\nIsrael-centric departure from the US-centric model that includes\n‘Space’ as the fourth domain and displaces ‘Cyber’ to the fifth\ndomain.\n\n\n-----\n\nThis final collection boon is tantamount to the means for\ngenerating misleading signatures in subsequent attacks. With\nstrategic access to Agency-B’s tools and infrastructure,\nAgency-A has silently violated the bounds of closed-propriety\nthat served to identify Agency-B in the cyber domain.\n\nWhile we are in no way advocating the unhealthy scepticism\nthat arises from viewing every campaign as a potential false\nflag and every attribution claim as a self-serving misstep,\nwe’d rather point to the extreme outlier of fourth-party\ncollection-enabled misattribution and signature falsification\nas a statement indicative of the logical boundaries of the\nknowledge that can be derived from single-source\ninvestigations into perpetrating actors in cyberspace.\n\n## Treacherous surroundings for threat hunters\n\nAs the subject of study becomes more visibly complicated,\nthe defenders involved are facing their own problems. The\nhoneymoon with threat intelligence is coming to an end.\nWhile the ‘APT’ moniker has served the diabolical needs of\nRSA showfloor salesfolks, threat intelligence has not always\nproven a stable source of revenue for companies young and\nold. As behemoths reconsider their threat intelligence\ninvestments, a series of complications tormenting the\nimmediate future of threat intelligence come into view:\n\n - Regional balkanization of research capabilities and lack\nof defence of the academic and objective value of threat\nintelligence research beyond PR and marketing.\n\n - Greater adoption of non-telemetry-friendly operating\nsystems.\n\n - Rejection of anti-malware tools as ‘overly intrusive’\npromotes increased adoption of userland EDR-style tools\nincapable of detecting sophisticated threats.\n\n - Lack of adequate telemetry generation and aggregation\nbecomes the norm.\n\n - ‘Next-Gen’ or ‘machine-learning’ tools focus on specific\nprocesses (and not the whole OS) to avoid overhead\nwhile claiming full protection.\n\n - Reliance on scraping multiscanners[26] to ‘supplement’\ndetections gives a false sense of ubiquitous coverage.\n\n - ‘Modern’ solutions and alternative OSs[27] avoiding\ncomplex heuristics and process tracing to limit\nprocessing-power overhead are recreating blindspots\nalready addressed by the anti-malware industry.\n\n - Two years after providing in-the-wild proof of abuse of\nfirmware by the Equation Group, firmware is no more\naccessible for analysis than it was then.\n\n - While memory forensics capabilities have increased in\nleaps and bounds[28], a concern with system stability has\nkept most modern anti-malware solutions from\nattempting greater strides to address memory-resident\nmalware.\n\nThese conditions, presented in no particular order, blend\ntogether to outline the treacherous surroundings of a nascent\n\n26 It is interesting to consider a future where these vendors win\nmajority market share: based on whom will they mimic their\ndetections then?\n27 A lack of complex heuristic monitoring solutions in MacOS and\n_Linux._\n28 Thanks in large part to the Volatily Project [17].\n\n\nindustry whose practitioners are perhaps too fascinated with\nthe intricacies of their study to see the earth fragmenting\nbeneath their feet. In the cyber-arms race, advanced threat\nactors are pulling away at an alarming speed. While we have\nbecome better at spotting them and communicating this\nknowledge for other defenders to take measures en masse, we\nshould be troubled by the tendency towards crippling\ntelemetry generation and neglecting the advancement and\nubiquity of heuristic capabilities.\n\nIt’s important to highlight two important gains provided by\nthreat intelligence that are often taken for granted:\n\nFirst, while there is a great community of vulnerability\nresearchers out there providing insights to improve the code\nrelied on by all users regularly, threat intelligence researchers\nhave been providing increasing insights into exploits being\nleveraged in the wild with proven malicious intent. While\nmost threat intelligence production may be tied to a particular\ncompany, intended to protect a specific subset of consumers,\nby reporting these zero-days to the relevant codebase\nmaintainers, the benefit is provided for all users in a given\necosystem regardless of their chosen security software\nprovider. What happens to this important function as threat\n_intelligence production is further disincentivized?_\n\nSecondly, while the private sector is largely motivated by big,\nflashy announcements, the resulting byproduct is tantamount\nto a series of stories that collectively amount to a public\nunderstanding of fifth-domain operations. This body of\nliterature is the only relevant information when evaluating\npolicy to regulate cyber measures and norms[29]. It is largely\nreliant on private, non-reproducible data sources that may\nvery well fade away and disappear as threat intelligence\ncompanies are dissolved or acquired. Subsequent private\nreports and proprietary data that never entered the public\ndomain to begin with would actually disappear from within\nthese companies without relevant maintainers. The question\nthat should burn within us at the sight of these developments\nis: ‘What will happen to this Homeric history of human\n_adversarial incursion into the fifth domain in their absence?’_\n\n## An unhealthy obsession\n\nFinally, we’d do well to reiterate a disdain for the obsession\nwith cross-domain attribution based on single-domain\ninformation and analysis. No element of cyber threat\nintelligence has incited more ardent ignorant opinionated\nineffective bickering than whether a given attribution claim\nis right/wrong/justified/believable or acceptable given\nsomeone else’s gut feeling of what an unknown actor might\nfind reasonable to do on a given day. No element of this\ncacophonous symphony played on 140-character\ninstruments speaks to the true nature and limitations of our\npractice.\n\nAttempts at armchair attribution are instances of running up\nto (and past) a methodological cliff into an area that is simply\nbeyond private sector fifth-domain capabilities. It’s within\nreach for all-source agencies, it’s within reach for Agency-A\nstyle institutions, by virtue of their visibility simultaneously\n_within and beyond the fifth domain. For everyone else, one is_\ntempted to (mis-)apply Ludwig Wittgenstein’s Tractatus\n\n29 Although think tanks and lawyers somehow manage to ignore it all\nthe same, in favour of hyperbolic and technically impossible\noverstretched analogies.\n\n\n-----\n\nLogico-Philosophicus in its final admonition[30] of\nhyperextending beyond logical boundaries to make statements\nof logical fact. But in reality, while it’s the logical nature of\nthe fifth domain that limits what statements we can\nreasonably make in observation of these advanced campaigns,\nit’s a desire for relevance and the limelight that is ultimately\ndiminishing the value of the nascent and much needed\npractice of threat intelligence currently in need of its own\nardent defence.\n\n## REFERENCES\n\n[1] http://www.spiegel.de/media/media-35684.pdf.\n\n[2] CSEC SIGINT Cyber Discovery: Summary of the\ncurrent effort. REPLICANT FARM output, pp.10–\n11. https://edwardsnowden.com/wp-content/\nuploads/2015/01/media-35665.pdf\n\n[3] https://securelist.com/energetic-bear-more-like-acrouching-yeti/65240/\n\n[4] DarkHotel Attacks in 2015– https://securelist.com/\ndarkhotels-attacks-in-2015/71713/.\n\n[5] Friedrich-Ebert-Stiftung (FES). http://www.\nfes-caucasus.org/.\n\n[6] https://github.com/hackedteam/rcs-db/tree/master/\nscripts.\n\n[7] Re: Nomi agente per sistema di test.\nhttps://wikileaks.org/hackingteam/emails/\nemailid/106487.\n\n[8] https://wikileaks.org/ciav7p1/cms/page_14588809.\nhtml.\n\n[9] https://twitter.com/DNSdynamic.\n\n[10] https://securelist.com/blog/research/68750/equationthe-death-star-of-malware-galaxy/.\n\n[11] https://securelist.com/blog/research/67741/reginnation-state-ownage-of-gsm-networks/.\n\n[12] https://securelist.com/blog/incidents/32463/\nduqu-faq-33/.\n\n[13] https://securelist.com/blog/research/58254/thecaretomask-apt-frequently-asked-questions/.\n\n[14] https://securelist.com/faq-the-projectsauronapt/75533/.\n\n[15] https://securelist.com/the-fl ame-questions-andanswers-51/34344.\n\n[16] ‘TREASUREMAP’, NSA project to map entities\nacross domains. https://snowdenarchive.cjfe.org/\ngreenstone/collect/snowden1/index/assoc/\nHASH01c8/6ed8dd75.dir/doc.pdf.\n\n[17] http://www.volatilityfoundation.org.\n\n30 ‘Whereof one cannot speak, thereof one must be silent’. Proposition\n§7, Tractatus Logico Philosophicus, Ludwig Wittgenstein, 1921.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07170728/Guerrero-Saade-Raiu-VB2017.pdf"
    ],
    "report_names": [
        "Guerrero-Saade-Raiu-VB2017.pdf"
    ],
    "threat_actors": [
        {
            "id": "a0d369c1-f0b7-4c70-a3a5-77aabbd17979",
            "created_at": "2022-10-25T15:50:23.311311Z",
            "updated_at": "2025-03-27T02:00:55.438117Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "MITRE:Strider",
            "tools": [
                "Remsec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99845f58-2c39-46f7-8369-bb621ebb7002",
            "created_at": "2022-10-25T16:07:24.238844Z",
            "updated_at": "2025-03-27T02:02:10.14785Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "ETDA:Strider",
            "tools": [
                "Backdoor.Remsec",
                "ProjectSauron",
                "Remsec"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e7c75c6-097f-4d80-8c98-73485fe2a729",
            "created_at": "2022-10-25T16:07:24.386715Z",
            "updated_at": "2025-03-27T02:02:10.203847Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Dancing Salome",
                "DeftTorero"
            ],
            "source_name": "ETDA:Volatile Cedar",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Adminer",
                "DirBuster",
                "GoBuster",
                "JuicyPotato",
                "RottenPotato",
                "SharPyShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a653b7ac-97b5-465b-98cd-8713223b06a7",
            "created_at": "2023-01-06T13:46:38.592385Z",
            "updated_at": "2025-03-27T02:00:02.868419Z",
            "deleted_at": null,
            "main_name": "WildNeutron",
            "aliases": [
                "Morpho",
                "Sphinx Moth"
            ],
            "source_name": "MISPGALAXY:WildNeutron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "808d8d52-ca06-4a5f-a2c1-e7b1ce986680",
            "created_at": "2022-10-25T16:07:23.899157Z",
            "updated_at": "2025-03-27T02:02:10.019417Z",
            "deleted_at": null,
            "main_name": "NetTraveler",
            "aliases": [
                "APT 21",
                "Hammer Panda",
                "NetTraveler",
                "TEMP.Zhenbao"
            ],
            "source_name": "ETDA:NetTraveler",
            "tools": [
                "Agent.dhwf",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "NetTraveler",
                "Netfile",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "TravNet",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "254f2fab-5834-4d90-9205-d80e63d6d867",
            "created_at": "2023-01-06T13:46:38.31544Z",
            "updated_at": "2025-03-27T02:00:02.802896Z",
            "deleted_at": null,
            "main_name": "APT21",
            "aliases": [
                "HAMMER PANDA",
                "TEMP.Zhenbao",
                "NetTraveler"
            ],
            "source_name": "MISPGALAXY:APT21",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c1ac2a5e-0225-47a4-8ac5-5fa898c96bde",
            "created_at": "2023-01-06T13:46:38.472883Z",
            "updated_at": "2025-03-27T02:00:02.84253Z",
            "deleted_at": null,
            "main_name": "ProjectSauron",
            "aliases": [
                "Sauron",
                "Project Sauron",
                "G0041"
            ],
            "source_name": "MISPGALAXY:ProjectSauron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "23dfc9f5-1862-4510-a6ae-53d8e51f17b1",
            "created_at": "2024-05-01T02:03:08.146025Z",
            "updated_at": "2025-03-27T02:05:17.420497Z",
            "deleted_at": null,
            "main_name": "PLATINUM TERMINAL",
            "aliases": [
                "Longhorn ",
                "The Lamberts ",
                "Vault7 ",
                "APT-C-39 "
            ],
            "source_name": "Secureworks:PLATINUM TERMINAL",
            "tools": [
                " Assassin",
                " Marble Framework",
                "AfterMidnight"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "92c0dae2-e255-4b90-8d8f-be88e393ab8d",
            "created_at": "2022-10-25T16:07:24.402328Z",
            "updated_at": "2025-03-27T02:02:10.209983Z",
            "deleted_at": null,
            "main_name": "Wild Neutron",
            "aliases": [
                "Butterfly",
                "Morpho",
                "Sphinx Moth",
                "The Postal Group",
                "Wild Neutron"
            ],
            "source_name": "ETDA:Wild Neutron",
            "tools": [
                "HesperBot",
                "Jiripbot",
                "JripBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e09a7338-fb16-4e39-b579-c3bfc3140c47",
            "created_at": "2022-10-25T16:07:24.207294Z",
            "updated_at": "2025-03-27T02:02:10.140203Z",
            "deleted_at": null,
            "main_name": "Snowglobe",
            "aliases": [
                "ATK 8",
                "Animal Farm",
                "SIG20",
                "Snowglobe"
            ],
            "source_name": "ETDA:Snowglobe",
            "tools": [
                "Babar",
                "Casper",
                "Chocopop",
                "Dino",
                "EvilBunny",
                "Nbot",
                "TFC",
                "Tafacalou"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8b61d214-62b2-455b-8eb4-fb0594763787",
            "created_at": "2023-01-06T13:46:38.502064Z",
            "updated_at": "2025-03-27T02:00:02.84986Z",
            "deleted_at": null,
            "main_name": "Dancing Salome",
            "aliases": [],
            "source_name": "MISPGALAXY:Dancing Salome",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9a58d7bb-dd32-41bc-804e-500ef7550cf8",
            "created_at": "2023-01-06T13:46:39.131811Z",
            "updated_at": "2025-03-27T02:00:03.004067Z",
            "deleted_at": null,
            "main_name": "ItaDuke",
            "aliases": [
                "DarkUniverse",
                "SIG27"
            ],
            "source_name": "MISPGALAXY:ItaDuke",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b13c19d6-247d-47ba-86ba-15a94accc179",
            "created_at": "2024-05-01T02:03:08.149923Z",
            "updated_at": "2025-03-27T02:05:17.422065Z",
            "deleted_at": null,
            "main_name": "TUNGSTEN BRIDGE",
            "aliases": [
                "DUBNIUM ",
                "DarkHotel ",
                "CTG-1948 "
            ],
            "source_name": "Secureworks:TUNGSTEN BRIDGE",
            "tools": [
                "Nemim"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "548a4081-aa8f-4e2a-bcb3-0c9dfa61944f",
            "created_at": "2023-01-06T13:46:38.443779Z",
            "updated_at": "2025-03-27T02:00:02.835042Z",
            "deleted_at": null,
            "main_name": "SNOWGLOBE",
            "aliases": [
                "Snowglobe",
                "ATK8",
                "Animal Farm"
            ],
            "source_name": "MISPGALAXY:SNOWGLOBE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041842,
    "ts_creation_date": 1503683354,
    "ts_modification_date": 1504077226,
    "files": {
        "pdf": "https://archive.orkl.eu/3cdd5180fbe3168e97ae2da0e4e4d188760525c5.pdf",
        "text": "https://archive.orkl.eu/3cdd5180fbe3168e97ae2da0e4e4d188760525c5.txt",
        "img": "https://archive.orkl.eu/3cdd5180fbe3168e97ae2da0e4e4d188760525c5.jpg"
    }
}