{
    "id": "0632d5f2-bad6-493b-987a-92ee27648728",
    "created_at": "2023-01-12T15:04:44.352494Z",
    "updated_at": "2025-03-27T02:05:29.025203Z",
    "deleted_at": null,
    "sha1_hash": "ee754a87b5c833bcb8dba3eda5a812e4e82ee35c",
    "title": "2021-01-15 - SolarWinds- Insights into Attacker Command and Control Process",
    "authors": "",
    "file_creation_date": "2022-05-28T23:07:40Z",
    "file_modification_date": "2022-05-28T23:07:40Z",
    "file_size": 1416042,
    "plain_text": "# SolarWinds: Insights into Attacker Command and Control Process\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-sunburst-command-control](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-sunburst-command-control)**\n\n\n-----\n\nThreat Hunter TeamSymantec\n\n## In the third of a series of follow-up analysis on the SolarWinds attacks, we investigate how the attackers controlled the Sunburst malware.\n\nIn [our most recent blog on the SolarWinds attacks, we examined the domain generation](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-unique-dga)\nalgorithm (DGA) used to initiate contact with the attackers’ command and control (C&C)\nservers. The control flow, what happens after that contact is made, is also noteworthy.\n\nThe control flow of Sunburst varies depending on commands received from the attacker.\nHowever, the general control flow can be reconstructed in order to understand how\ncommunications would have progressed on machines that were of interest to the attackers.\n\nAs described in our previous blog, two types of DNS requests are used for initial\ncommunications, and both receive DNS replies. The attackers use two fields in the DNS\nreplies: “A records” for control flow and CNAME to hold data on a secondary C&C server.\n\n## IP addresses as commands\n\nNormally, when querying DNS, a hostname string is provided to be translated into a numeric\nIP address, e.g., google.com may translate into 142.250.72.238. The IP address is held in\nthe A record of the response. Sunburst parses the A record for IP addresses, but they are\nnot used as IP addresses at all, but instead are actually triggers for different malware\nbehavior. Instead of the attackers selecting random IP addresses to trigger different\nbehaviors, they have selected IP address ranges belonging to Google, Amazon, and\nMicrosoft. These are possibly chosen in order to reduce the chances of detection. Again,\nthese IPs are not used as IP addresses in any way and the actual computer systems with\nthese IP addresses are not contacted by the malware.\n\nThe IP address value received in the DNS reply represents one of five behaviors depending\non the current state:\n\nContinue sending additional Windows domain name chunks\nSend product security status information\nLaunch a secondary C&C channel\nClean up and exit\nReset state as if executing for the first time\n\n\n-----\n\nFor a typical infection, Sunburst will first send to the C&C server the first 14 characters of the\nWindows domain name. This will continue for each 14 character chunk, until the entire\nWindows Domain name is sent.\n\nNext, the attackers will instruct Sunburst to [send the current security product statuses and](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-unique-dga)\nthen send information enabling Sunburst to launch a more robust secondary HTTP-based\nC&C.\n\nFigure 1. Example of C&C control flow\nWithin any DNS reply, the attackers can also instead instruct Sunburst to restore security\nproduct service registry keys that were previously disabled back to their believed default\nsettings and quit or reset the internal state as if it is a fresh infection.\n\n\n-----\n\nFigure 2. IP address ranges and the behaviors they cause\nIn addition, to facilitate lab environment and sandbox avoidance, if the DNS requests result\nin a private range IP address, including 10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16,\n224.0.0.0/4, fc00::/7, fec0::/10, ff00::/8, Sunburst will also clean up and exit.\n\n## Second stage C&C\n\nVictims that were of interest to the attackers would have reached the secondary C&C stage.\nIn this case, the DNS reply would contain a hostname in the CNAME record to be used as\na HTTP C&C channel. The CNAME value is checked to see if it starts with http:// or https://\nand is prepended with https:// otherwise.\n\nNext, Sunburst will perform repeated HTTP GET requests to receive commands, sleeping a\nvariable amount of time between requests. The path portion of the URL always starts with\n/swip/upd/ followed by randomly selected URL patterns, in the following order.\n\nOptionally, one or more of the following:\n\nSolarWinds\n.CortexPlugin\n\n\n-----\n\n.Orion\n\nOptionally, followed by one of the following:\n\n.Wireless\n.UI\n.Widgets\n.NPM\n.Apollo\n.CloudMonitoring\n\nIf no previous string has been selected, one of the following or optionally, one of the following\nif a previous string has been selected:\n\n.Nodes\n.Volumes\n.Interfaces\n.Components\n\nOptionally, followed by:\n\n-<number>.<number>.<error or success code of previous request>\n\nFollowed by:\n\n.xml\n\nAlso, if the first character in the path is a dot (.), the dot is removed. For example, the\nfollowing are example URLs that could be used:\n\nhttps[:]//infinitysoftwares.com/swip/upd/SolarWinds.CortexPlugin.Nodes-5.2.1.xml\nhttps[:]//infinitysoftwares.com/swip/upd/Orion.Wireless.UI-3.1.0.xml\nhttps[:]//infinitysoftwares.com/swip/upd/Nodes-1.2.0.xml\n\nThe final digit before the .xml extension is not a random character, but represents the return\ncode for previous command requests – typically 0 means success and 1 or other values\nmean error. For the first 16 requests, a different randomly generated path is used each time,\nbut after that it may repeat random generations that it used previously. If data is being sent to\nthe attacker as a result of a command (e.g. sending system information), the path\nconstruction will be different and will be covered in a future blog.\n\nSunburst also adds the custom header “If-None-Match:” set to the previously described 8byte userid XOR’d by a randomly generated 8-byte sequence that is appended and then\nconverted into lowercase ASCII hex.\n\n\n-----\n\nFigure 3. Sunburst custom header\nAfter the HTTP GET request is made, Sunburst checks for a valid response from the\nattacker. The response uses steganography and is a faux, but convincing XML page of data,\nwhere only certain fields are utilized by Sunburst.\n\nThe faux XML data is searched for a sequence of:\n\n36 hexadecimal characters including dashes\n32 hexadecimal characters\n16 hexadecimal characters\n\nThese sequences are concatenated together with non-hexadecimal characters removed.\nThe first DWORD (4 bytes) of the sequence represents the size of the remaining data, which\nis validated and then the next byte is an XOR key. The rest of the data is then XOR\ndecrypted by the key byte and then decompressed. After being decompressed, the first\ncharacter is a number that specifies the action to perform followed by the number of included\narguments in the following data for the command:\n\nFigure 4. A contrived example of data received by Sunburst that is decoded to extract the\ncommand\nThe command number can instruct Sunburst to perform the following behaviors:\n\n\n-----\n\n-----\n\nFigure 5. Command numbers and corresponding behaviors\nIf no data needs to be sent to the attacker, the above GET request with the return code\nencoded in the URL filename is sent.\n\nIf data needs to be sent to the attacker as a result of these commands (e.g. sending system\ninformation), the data will be included in the next regular HTTP(S) communication as a\nPOST request or a HEAD request if some error occurred where the data is missing. Details\non each of these behaviors and how data is uploaded to the attacker will be covered in an\nupcoming blog.\n\n## Protection/Mitigation\n\nTools associated with these attacks will be detected and blocked on machines running\nSymantec Endpoint products.\n\n**File-based protection:**\n\nBackdoor.Sunburst\nBackdoor.Sunburst!gen1\nBackdoor.SuperNova\nBackdoor.Teardrop\n\n\n-----\n\n**Network-based protection:**\n\nSystem Infected: Sunburst Malware Activity\n\n[For the latest protection updates, please visit the Symantec Protection Bulletin.](https://www.broadcom.com/support/security-center/protection-bulletin)\n\n## About the Author\n\n### Threat Hunter Team\n\n**Symantec**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is to\ninvestigate targeted attacks, drive enhanced protection in Symantec products, and offer\nanalysis that helps customers respond to attacks.\n\n## Want to comment on this post?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-15 - SolarWinds- Insights into Attacker Command and Control Process.pdf"
    ],
    "report_names": [
        "2021-01-15 - SolarWinds- Insights into Attacker Command and Control Process.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535884,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653779260,
    "ts_modification_date": 1653779260,
    "files": {
        "pdf": "https://archive.orkl.eu/ee754a87b5c833bcb8dba3eda5a812e4e82ee35c.pdf",
        "text": "https://archive.orkl.eu/ee754a87b5c833bcb8dba3eda5a812e4e82ee35c.txt",
        "img": "https://archive.orkl.eu/ee754a87b5c833bcb8dba3eda5a812e4e82ee35c.jpg"
    }
}