{
    "id": "06813574-9d0e-450f-9f91-884356837ea3",
    "created_at": "2023-01-12T15:06:16.84009Z",
    "updated_at": "2025-03-27T02:05:31.855395Z",
    "deleted_at": null,
    "sha1_hash": "8c07d91383180116d76056216dd28e49c2dc8267",
    "title": "2021-07-07 - Global Phishing Campaign Targets Energy Sector and its Suppliers",
    "authors": "",
    "file_creation_date": "2022-05-28T18:24:14Z",
    "file_modification_date": "2022-05-28T18:24:14Z",
    "file_size": 1140958,
    "plain_text": "# Global Phishing Campaign Targets Energy Sector and its Suppliers\n\n**[intezer.com/blog/research/global-phishing-campaign-targets-energy-sector-and-its-suppliers/](https://www.intezer.com/blog/research/global-phishing-campaign-targets-energy-sector-and-its-suppliers/)**\n\nJuly 7, 2021\n\nWritten by [Nicole Fishbein and](https://www.intezer.com/author/nicolefishbein/) [Ryan Robinson - 7 July 2021](https://www.intezer.com/author/ryanrobinson/)\n\n### Get Free Account\n\nJoin Now\n\n### Top Blogs\n\n**[Top Cyber Threats to the Telecom Industry](https://www.intezer.com/blog/incident-response/cyber-threats-telecom-industry/)**\n\nIn our interconnected society, the telecom industry is responsible for keeping the world\nconnected 24/7.... [Read more](https://www.intezer.com/blog/incident-response/cyber-threats-telecom-industry/)\n\n**[Top Cyber Threats to the Manufacturing Sector](https://www.intezer.com/blog/incident-response/cyber-threats-to-manufacturing-sector/)**\n\nManufacturers are building automated workflows for alert triage, incident response, and\nthreat hunting to meet... [Read more](https://www.intezer.com/blog/incident-response/cyber-threats-to-manufacturing-sector/)\n\n**[Automate Alert Triage and Response Tasks with Intezer EDR Connect](https://www.intezer.com/blog/incident-response/alert-triage-edr-integrations/)**\n\nIntegrate with SentinelOne, CrowdStrike, and More One of the biggest pain points of cyber\nsecurity... [Read more](https://www.intezer.com/blog/incident-response/alert-triage-edr-integrations/)\n\n\n-----\n\nOur research team has found a sophisticated campaign, active for at least one year,\ntargeting large international companies in the energy, oil & gas, and electronics industries.\nThe attack also targets oil & gas suppliers, possibly indicating that this is only the first stage\nin a wider campaign. In the event of a successful breach, the attacker could use the\ncompromised email account of the receipt to send spear phishing emails to companies that\nwork with the supplier. Thus using the established reputation of the supplier to go after more\ntargeted entities.\n\nThe attackers use typosquatted and spoofed emails to launch the attack. The campaign\nspreads via phishing emails tailored to employees at each company being targeted. The\ncontents and sender of the emails are made to look like they are being sent from another\ncompany in the relevant industry offering a business partnership or opportunity. Each email\nhas an attachment, usually an IMG, ISO or CAB file. These file formats are commonly used\nby attackers to evade detection from email-based Antivirus scanners. Once the victim\nopens the attachment and clicks on one of the contained files an information stealer is\nexecuted.\n\nBelow we describe the attack vector, the attackers’ motives and tactics used in this\ncampaign, and how you can protect your systems from this attack.\n\n## Key Findings\n\nThe campaign uses spoofed or typosquatted emails to make them look like part of a\nnormal business-to-business (B2B) correspondence.\nThe attached file is primarily an IMG, ISO or CAB file containing information stealer\nmalware.\nThe dropped malware is generally able to steal private information, log keyboard\nstrokes and steal browsing data.\n\nAttack Flow\n\n## The Campaign\n\n\n-----\n\nRecently, we have identified a number of IMG files with names related to the oil & gas and\nenergy industries. Inside these image files are predominantly .NET malware. Upon further\ninvestigation the distribution method for this malware appears to be spear phishing emails,\nwith either an IMG, ISO, or CAB file included as an attachment and sent to specific targets.\nThe IMG/ISO files are part of the [Universal Disk Format (UDF) which are disk images](https://en.wikipedia.org/wiki/Universal_Disk_Format)\ncommonly used for DVDs. Cabinet (CAB) files are a type of archive file. In most of these\nemails the file name and icon of the attachment mimics a PDF. The purpose is to make the\nfile look less suspicious, enticing the targeted individual to open and read it.\n\nThe campaign targets companies from around the world, including the United States,\nUnited Arab Emirates (UAE) and Germany, but its primary targets are South Korean\ncompanies. The targeted industries are wide-ranging but mostly focused on the energy\nsector.\n\nEnergy\nOil & Gas\nInformation Technology\nManufacturing\nMedia\n\n## The Emails\n\nThe emails are formatted to look like valid correspondence between two companies. This\nextra effort made by the attacker is likely to increase the credibility of the emails and lure\nvictims into opening the malicious attachments. The emails use social engineering tactics\nsuch as making references to executives, using physical addresses, logos and emails of\nlegitimate companies. They also include requests for quotations (RFQ), contracts, and\nreferrals/tenders to real projects related to the business of the targeted company.\n\nThe content of the emails demonstrates that the threat actor is well-versed in business-tobusiness (B2B) correspondence. The recipient email addresses of these emails range from\ngeneric email handles such as “info@target_company[.]com” or\n“sales@target_company[.]com” to specific people within companies. This suggests that\nfor some companies they have likely managed to gather more intelligence during\nreconnaissance than others.\n\nAn example of one of the emails involved in the campaign (image below) uses a combined\ncycle power plant (CCPP) project in Panama as a lure. The email pretends to be sent from\nHyundai Engineering Co (HEC). The email asks the receiver to submit a bid for the supply\nof equipment in the project and states that more details and requirements can be found in\nthe attached file (containing the malware). The email presents a strict deadline for which the\nrequest for the bid should be submitted.\n\n\n-----\n\nPhishing email inviting recipient to participate in a project.\n\nUpon opening the disk image file the target is presented with an executable.\n\nMalicious file contained in the disk image.\n\n## Email Tactics\n\n Typosquatting\n\n\n-----\n\nIn several emails it appears the sender domains have been typosquatted in order to\nincrease the credibility of the spear phishing attempt. Typosquatted domains are a\ntechnique used to social engineer email recipients into thinking an email has been sent from\na trusted entity. This technique is performed by registering a domain name which mimics a\nlegitimate domain. When viewed quickly it can increase the chances of the recipient\nthinking that the email has been sent from a legitimate company.\n\nIn this campaign, many of the typosquatted domains mimic South Korean companies with\nlegitimate domains in the format of <company.co.kr>. Typosquatting is achieved by\nregistering a domain without the second level “.co” and instead registering the domain as\n<company-co.kr>. One example of this is the domain <hec-co.kr>, registered by the\nattackers to typosquat the legitimate domain for the company Hyundai Engineering\n(hec.co.kr). The typosquatted email from “Hyundai Engineering” invites the recipient to reply\nto a confidentiality agreement with respect to a refinery expansion project.\n\nEmail sent from typosquatted domain (jeongwan@hec-co.kr).\n\nAnother typosquatted email that caught our attention was supposedly sent by Barend Jenje\nfrom [GustoMSC, asking to return a signed non-disclosure agreement (NDA). The](https://www.gustomsc.com/)\nattachment was just an IMG file containing a malware executable.\n\nGustoMSC is based in The Netherlands, specializing in offshore equipment and technology\nfor the oil & gas industry. On June 14, 2021, [GustoMSC posted an alert on their site](https://www.gustomsc.com/news/scam-alert)\nwarning users that the company’s domain was being typosquatted and scammers were\nsending emails on behalf of their employees.\n\nThe email below references the Dunkirk offshore wind farm project to add credibility to\nthe message. The project was granted to the Éoliennes en Mer de Dunkerque (EMD)\nconsortium by the French government in June 2019. The consortium is made up of several\n\n\n-----\n\ncompanies, two of which are mentioned in the email: EDF Renouvelables and Enbridge. In\n[recent news, the companies announced their decision to move forward with the](https://renews.biz/69489/edf-team-move-ahead-with-dunkirk-offshore-wind/)\ndevelopment of the project beginning in the second half of 2021.\n\nIt would make sense then why the attackers name dropped this project, due to its recent\ndevelopments and also because the offshore wind farm is under the occupation of\nGustoMSC.\n\nPhishing email impersonating GustoMSC.\n\n## Email Spoofing\n\nMany email addresses in this campaign are spoofed by the actor. Email spoofing is another\ntactic that is used to social engineer targets into opening emails. Email spoofing is done by\nsending an email with forged headers to suggest that the email is sent from a trusted or\nlegitimate entity. An example of a spoofed email from this campaign pretends to come from\na company called Haesung Tech, seen below.\n\n\n-----\n\nSpoofed email pretending to be sent from Haesung Tech.\n\nThis email is clearly spoofed since inside the header the Sender Policy Framework (SPF)\ncheck does not pass. The reason for this is there is no DNS TXT record for\n**haesungtech.com that defines a permitted sender. The SPF verdict is shown below.**\n\nSender Policy Framework (SPF) verdict.\n\n## The Malware\n\nThis campaign uses several known Remote Access Tools (RATs) and information stealing\nmalware contained in the files attached to the phishing emails. Although the threats belong\nto different malware families, they do share a number of capabilities including: stealing\nprivate and banking information, logging keyboard strokes and stealing browsing data.\n\n\n-----\n\nThere are several known malware-as-a-service (MaaS) threats like Formbook and Agent\nTesla used in this campaign. Other threats we have identified are Loki, Snake Keylogger\nand AZORult.\n\nEach email has an attached file containing one or more executables encapsulated inside an\nIMG, ISO, or CAB file, each belonging to one of the threats mentioned above. In Windows 8\nand Windows 10, simply double-clicking on virtual disk files will automatically mount its\ncontent. This feature is appealing for threat actors because it takes a small number of user\nclicks to execute the malware. In addition, traditional email defenders do not handle disk\nimage files as well as more common formats such as ZIP files. Therefore, it’s more likely\nthat the malicious emails will end up in the inbox of the recipients without being\nblocked. One of the emails we analyzed was allegedly sent by Rashid Mahmood from\n[China Petroleum Engineering & Construction Corporation (CPECC), a subsidiary of the](http://cpecc.cnpc.com.cn/cpeccen/)\nChina National Petroleum Corporation. The recipient of the phishing email works for a\n[company called GS E&C, a Korean EPC contractor engaged in various global power plant](http://www.gsenc.com/)\nprojects.\n\nPhishing email sent to GS E&C.\n\n[The email contains a reference to the expansion project of an oil field in Abu Dhabi called](https://www.nsenergybusiness.com/projects/bab-onshore-oil-field-expansion/)\n[BAB. BAB is the oldest operating field in the United Arab Emirates (UAE). The receiver of](https://www.adnoc.ae/en/our-projects/bab-epc)\nthis email, who works at GS E&C, is invited to submit both technical and commercial offers\nfor the items described in the attached material take off (MTO) document (below).\n\n\n-----\n\nSecond part of the phishing email sent to employee at GS E&C.\n\nThere is a typo in the email below. Instead of “regional headquarters” the address says\n“Reginal Headquarter.” In addition to this mistake, the address provided is the actual\n[address of CPECC in UAE.](https://ae.arabplaces.com/abu-dhabi/cpecc-87624)\n\nPhishing email with a typo.\n\nThough the attached file has a seemingly complementary name related to the contents of\nthe email, it is actually an IMG file that contains Snake Keylogger malware. Once the user\ndouble-clicks on the IMG file, the content of the file is mounted, as shown below, and the\nuser can click the file to be executed.\n\nMounted disk image file with malicious Snake Keylogger binary masquerading as PDF.\n\nTo bypass detection from standard Antiviruses, the execution of the malware is fileless,\nmeaning that it is loaded into memory without creating a file on disk. In this case, it performs\nthe same loading and execution process used to load Agent Tesla as reported by\n[BlackBerry.](https://blogs.blackberry.com/en/2021/06/threat-thursday-agent-tesla-infostealer-malware)\n\n\n-----\n\n[We uploaded the attached file to Intezer Analyze. The file contains a malicious PE file that](https://analyze.intezer.com/files/3da25300ec711385344467823ae229bbc25a9a5a7caeccd911875994ed74c5b9/sub/5cb3737a-02b7-4945-b38c-d9aa9f8c934b)\nshares code with other Snake Keylogger samples.\n\nGenetic analysis of the ISO sample containing Snake Keylogger.\n\n## Targeting Companies in Religion Media Business\n\nAmong the targeted companies there is one that differs drastically from the others. The\ncompany is [FEBC, a religious Korean Christian radio broadcaster that reaches other](http://www.febc.net/intro)\ncountries outside of South Korea, many of these countries which downplay or ban religion.\nOne of FEBC’s goals is to subvert the religion ban in North Korea.\n\n## Recommendations\n\nTreat emails with awareness and caution, especially emails that are received from outside\nyour company’s domain. Most importantly, don’t open suspicious files or links.\n\n[Fileless malware is now very common. A recent blog by Panda Security states that fileless](https://www.pandasecurity.com/en/mediacenter/news/internet-security-report-q4-watchguard/)\nmalware rates in 2020 increased by 888% over 2019. Therefore, it is important to ensure\nthat your organization’s security strategy includes software that is able to detect malware\ninjected and executed in-memory. In case you come across a suspicious file, you can\nupload it to [Intezer Analyze to get an immediate verdict (trusted or malicious) and malware](http://analyze.intezer.com/sign-in)\nfamily classification if it is indeed a malicious file. The platform supports a wide range of file\nformats, including Windows and Linux executables, scripts and documents.\n\nTo summarize, don’t click on suspicious emails and make sure you have a solution that\n[handles fileless malware in-memory effectively. Intezer Analyze can help you with the latter.](https://www.intezer.com/blog/malware-analysis/revil-attack-genetic-analysis-and-lessons-learned/)\n\n_Intezer Analyze now supports non-executable files such as Microsoft Office documents,_\n_PDF files, and scripts such as PowerShell and VBS._\n\n\n-----\n\n## IoCs\n\nEmail: 1c85618ef82808c9bcc6deddf93b66d6ee7a81b82c03341ecbf61d3ee4975bb3\n\nAttached file: 74109522b38c609b4c576eecde644ffe544fcdc9a6494a9683f8eea6fb9e0bc7\n\nEmail: cd77a054500efdac4d39d743ad83f963c738d6f2b6b53f5c4b5818d34742f02b\n\nAttached file:\n3da25300ec711385344467823ae229bbc25a9a5a7caeccd911875994ed74c5b9\n\nEmail: 8877b6a829967924063e85120bf22b2ccc511fa25e376b479213020a15482bf6\n\nAttached file: 0dc594a10793d93e26584d8dcd4d811c4b2ccb017b86eb1119380f17e3606f85\n\nEmail: b51e83fd2583c8e92ef34f6b8d23e07aaa82eedcf2db4b68e667f3a52c8862f5\n\nAttached file: 079c7d83465481952407f3da954e08a5f165ff5480e2a51c32505088e78750f5\n\nAttached file: 53e3ae371a3e329c6ed4942eb6cc51007c53008e3b9da6fccaecbed8f68f2ffa\n\nAttached file: 96ff156bd7b09ec5a6216f43c0de578aafa9a8103832a401ce156e2ee918f580\n\nEmail: ff5be1c9c0ee11ceca68c10a9bcd1f8a995be8e3f89ed17a4933adde010ac3ad\n\nAttached file:\nd5080a9391b2ad1a75deeee81db15be47be2b0742378f633081eb4c9f81226ad\n\nEmail: a722bde3892eeaafdd285b6e9aabc67f0ad8dc8abe4035a8ff11671a7c2a68b1\n\nAttached file: 01970569f16e4adfdd4afb50d7a85327e8eb6abd7cb61a446e4a6f1010835968\n\nAttached file: 0ab00782d02cb0e817b0237007b6b7f81139ff6ded17bc42fbf277e929b77ccf\n\nEmail: 3d8d4fbf52301ea8dca5602d6c86da3d82fd659074d7868938064e84c7ad424a\n\nAttached file: ee7a4274d02042c8e516de2695ced13f4623c96377762f088d7795d5b0b2bd6f\n\nEmail: 0ea3575eed95cf60b1efb487a350a9fa24fd77482e881020a9a0f77220a6ad33\n\nAttached file:\n102adafddb589d6739ce8a489054825a9a958baa01e87b95eebdc302675a3bd9\n\nEmail: 9644169dee32d60f41d8d4e1f3dfb45a930ad3efd993fe941647549cf5e924dd\n\nAttached file:\ne2adb897c29a67295a2b411c47ee76e1e9ce1e27dccf259bc42a84c481ae41ce\n\n\n-----\n\nEmail: a03c0a2b6458cf55ee800291cf6b4698d1450bddd6d9e3e02f963c465004ac5c\n\nAttached file: f1e85b9f7b1c2a6ce9da528dbfe2c66f0a0f513f39411dbf7bb7d4d917e1ba99\n\nEmail: 0840cff0a98daa3962236913952b7b16896cae63af24fa99e46f3371c0e1ca49\n\nAttached file: 6a99c482b1634f3d0c775f4c8a0d1bb04cd24a0f54f1f48d1ee2697f5bf1c6c3\n\nEmail: 86ebf42301074e2907578e98dc20c46f6ecf9789503c625e2b2abfcb2af847b2\n\nAttached file: 079c7d83465481952407f3da954e08a5f165ff5480e2a51c32505088e78750f5\n\nAttached file: 53e3ae371a3e329c6ed4942eb6cc51007c53008e3b9da6fccaecbed8f68f2ffa\n\nAttached file: 96ff156bd7b09ec5a6216f43c0de578aafa9a8103832a401ce156e2ee918f580\n\nEmail: 5384a56a7d814aea903c33fbd602a3e3d5bc637b6e3bc0bd4568d4b7b99db2ad\n\nAttached file: f873b017cb3063a499db2874275e4797b8412ccd1300d29f4f1af03d66ee6700\n\nEmail: 8620f85ffd045187ffbc5d7e70df01d8a04e7fc5c69048b152f2b7284d20caf1\n\nAttached file: 06a3fe74ff3dd352db742ac96c6fbd0da1a0d98164dda2a6637e809ec0f48b35\n\nEmail: b552939890305a0a0d2c9af8973a7d04b1593d9f512c0cc485a0b987f4293d97\n\nAttached file: 8e2c23037b36f558920f626e7ef8767daa55734551238eb8816abd144f27db45\n\nAttached file: 9c55cc8f7acc09b5de745ec99b0c60862f7975eab77420e41b5c9d1351114cd9\n\nAttached file: d90f2a4a97cf6523e868f67356df7fc08581912c37e8f1f6ee16f2220eabdbb6\n\nEmail: 5db134f3aa187e74903a732b1bd55419977d66c63a55ae8952d908b8b0bc2616\n\nAttached file:\n713da8a5f0b2ee6a477a57b90834d4ae4637723ad817ffc5a53e5c86792e8ba4\n\nAttached file: 7b57b59d06c7ef6cc6fa09fafdf427f2db5969d1b49041d1b7a992e47a9a2726\n\nAttached file: b06cfcc8fabebb1bc83a4dfc91c0f9ba4e23c539018bb94fef1431745c0a2506\n\nEmail: 87b197032a6976c18f7f3df1df6e09cf9fd6a8e4cce3f35f51b2cf521b9ca278\n\nAttached file: 7aacd968f2cfb23a8369712c0dc60bcabc7b7d7c0ebf69863f7643e6b90e656f\n\nAttached file: 9e9ea32799bf9a246d76b11131abf71bbcffd3b79e026e440b221f6b1bdffe90\n\nEmail: 75ce82077ab9b2e18df87dae0e52270ae49fe20ec22f66fa3698b6fb75452e95\n\n\n-----\n\nAttached file: 14ae4b4b66588af22cf569a90c94e9dd6e2af708ad9dc0efde0cd7d2a809fb51\n\nAttached file: 60dc089158d86e9fb10ace29eb6afd7f23d001181e8a4a6ba5083c3597733a71\n\n**Nicole Fishbein**\nNicole is a malware analyst and reverse engineer. Prior to Intezer she was an embedded\nresearcher in the Israel Defense Forces (IDF) Intelligence Corps.\n\n**Ryan Robinson**\nRyan is a security researcher analyzing malware and scripts. Formerly, he was a researcher\non Anomali's Threat Research Team.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-07 - Global Phishing Campaign Targets Energy Sector and its Suppliers.pdf"
    ],
    "report_names": [
        "2021-07-07 - Global Phishing Campaign Targets Energy Sector and its Suppliers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535976,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653762254,
    "ts_modification_date": 1653762254,
    "files": {
        "pdf": "https://archive.orkl.eu/8c07d91383180116d76056216dd28e49c2dc8267.pdf",
        "text": "https://archive.orkl.eu/8c07d91383180116d76056216dd28e49c2dc8267.txt",
        "img": "https://archive.orkl.eu/8c07d91383180116d76056216dd28e49c2dc8267.jpg"
    }
}