{
    "id": "0688a9dc-3dde-4aa3-96a8-b8d48f0a20f0",
    "created_at": "2023-02-02T02:08:17.440031Z",
    "updated_at": "2025-03-27T02:15:26.161944Z",
    "deleted_at": null,
    "sha1_hash": "dbc4713812be79dd0e282512c9f930643ecfbd01",
    "title": "2023-01-09 - Dark Web Profile- Royal Ransomware",
    "authors": "",
    "file_creation_date": "2023-02-01T07:48:38Z",
    "file_modification_date": "2023-02-01T07:48:38Z",
    "file_size": 4600352,
    "plain_text": "# Dark Web Profile: Royal Ransomware\n\n**socradar.io/dark-web-profile-royal-ransomware/**\n\n**_By SOCRadar Research_**\n\n\nJanuary 9, 2023\n\n\nRansomware attacks have been rising in recent years, with the frequency of attacks increasing. In 2021, several high-profile ransomware\n[attacks made headlines, such as the attack on the Colonial Pipeline. This attack resulted in the temporary shutdown of the pipeline, which](https://socradar.io/from-fuel-shortages-to-gas-hikes-how-the-colonial-pipeline-co-fell-victim-to-a-ransomware-attack/)\ncaused fuel shortages and panic buying in some areas. This incident could have led to a crisis within the country.\n\n[In addition to targeting large companies, ransomware attacks are frequently directed at small businesses, hospitals, and other organizations](https://socradar.io/verizon-2022-dbir-all-sizes-of-businesses-suffer-from-ransomware/)\nwith less robust cybersecurity measures.\n\nIn November 2022, the Royal Ransomware group was the most actively operating ransomware group, and the group is continuing to damage\norganizations.\n\n\n-----\n\n_Daily Dark Web’s infographic of_\n\n_Ransomware activities in November 2022 (Source: Daily Dark Web)_\n\n## Who is Royal Ransomware Group?\n\n[Royal Ransomware strain was first detected on DEV-0569’s (threat actor) operations in September 2022. The actors behind the Royal are](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)\n[composed of experienced individuals from other ransomware operations, such as Conti, and operate independently without any affiliates.](https://socradar.io/conti-ransomware-ended-they-operate-with-other-groups-now/)\n[Royal Ransomware group operates professionally rather than adopting Ransomware-as-a-Service as most other groups work.](https://socradar.io/what-is-ransomware-as-a-service-raas/)\n\n[According to SOCRadar’s dark web team’s findings, Royal Ransomware primarily targets the manufacturing industry. It could be because of](https://socradar.io/manufacturing-industry-pays-the-highest-average-ransom-at-2-04m/)\nthe broad attack surface area, such as various specialized equipment and managed software used in the field. Plus, the limited IT and\nsecurity workforce may have led to factories becoming easy targets for cybercriminals. In addition, the probability of getting paid the ransom is\nhigh for ransomware groups considering that the extended downtime will increase the damage to facilities.\n\n\n-----\n\n_Targeted industries of Royal_\n\n_Ransomware_\n\n## How Royal Ransomware Group Attacks?\n\nAccording to [BleepingComputer, Royal Ransomware attacks used a technique called callback phishing, which involves tricking victims into](https://www.bleepingcomputer.com/news/security/new-royal-ransomware-emerges-in-multi-million-dollar-attacks/)\nbelieving they need to take some action, such as returning a phone call or opening an email attachment.\n\n\n-----\n\n_An example of Royal’s callback phishing mail (Source:_\n\n_Bleeping Computer)_\nWhen the victim reaches Royal, the group uses social engineering techniques to persuade the victim to install their remote access software -a\n[malware downloader that poses legitimate applications like Zoom and Microsoft Teams– and get initial access to the network of the victim’s](https://socradar.io/top-5-tactics-threat-actors-use-for-initial-access/)\norganization.\n\n\n-----\n\n_Diagram of_ _[DEV-0569‘s attack chain, which is a threat actor that uses Royal Ransomware actively (Source: Microsoft)](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)_\nSOCRadar Researchers took a sample and analyzed Royal Ransomware, which is detailed in the “Analysis of Royal Ransomware” section\nbelow.\n\nIn addition, the group generally uses the double-extortion method, which means they also exfiltrate sensitive data before encrypting it for\nransom. Also, the group’s ransom demand ranges between $250,000 to over $2 million.\n\n### Which Countries Did Royal Ransomware Target?\n\nRoyal ransomware group’s victims are commonly from Europe and the American continent.\n\n_Affected countries by Royal Ransomware_\nSOCRadar researchers analyzed about 70 observed claims from Royal Ransomware since September 2022 and found that around 69% of the\nattacks were made against organizations in the United States\n\n\n-----\n\nRoyal Ransomware’s percentage distribution of target countries from its latest attacks\n\n### Findings on Royal Ransomware\n\nSince it has damaged about 75 organizations and continues its operations actively, SOCRadar researchers browsed open sources. They\n[examined the Royal Ransomware sample obtained from the Malware bazaar platform to learn which activities are happening after it starts](https://bazaar.abuse.ch/sample/f484f919ba6e36ff33e4fb391b8859a94d89c172a465964f99d6113b55ced429/)\nworking on infected systems. The findings of the sample can be seen below: (You can find the IOCs of Royal Ransomware used in the\nanalysis at the Appendixes section)\n\nSeveral anti-analysis techniques were encountered when the Royal Ransomware ran step by step. After these stages were passed, it was\nseen that the process compares three arguments: “-path,” “-id,” and “-ep.”\n\nThe“-id” parameter could be for the victim ID, “-path” could be for the directory path, and the “-ep” parameter, as we observed, refers to\nthe encryption percentage of the file.\n\n\n-----\n\n_“-path”, “-id”, and “-ep” parameters used_\n\n_in Royal Ransomware_\n[Also, the program skips the encryption process for all the files with extensions “dll,” “bat,” “royal,” or “exe.“](https://socradar.io/lets-start-from-the-beginning-what-is-encryption/)\n\n_Skipping files with extensions dll, bat, exe, and royal._\n\n\n-----\n\n_Skipping files with extensions dll, bat, exe, and_\n\n_royal._\nThe program encrypts files using AES and IV and changes the extension of files with “.royal.”\n\n_[AES and IV key generation processes (Source: TrendMicro)](https://www.trendmicro.com/en_us/research/22/l/conti-team-one-splinter-group-resurfaces-as-royal-ransomware-wit.html)_\n\nWhen the encryption process starts, the first “README.TXT” file, which contains the ransom note, is created under the C:\\Program Files\ndirectory.\n\n_First file that contains_\n\n_ransom note observed in C:\\Program Files_\n\n\n-----\n\n_[Royal’s Ransom note (Source: BleepingComputer)](https://www.bleepingcomputer.com/news/security/new-royal-ransomware-emerges-in-multi-million-dollar-attacks/)_\nThe URL link in the ransom note directs the victim to the Contact page of Royal:\n\n_Contact form page of Royal_\nThe Royal group uses another page to share their claims:\n\n\n-----\n\n_Royal’s page that they share their claims and links of their exfiltrated files_\n[Security researchers observed that the group first used BlackCat‘s encryptors and Zeon’s ransom notes. These notes changed to Royal’s](https://socradar.io/dark-web-profile-blackcat-alphv/)\nransom notes in September 2022.\n\n_Zeon ransom note (Source: BleepingComputer)_\nAdditionally, the ransom note used by Royal ransomware was similar to that used by Conti –observed as Zeon after Conti stopped operating[and the code used to decrypt files was also used by Conti.](https://twitter.com/albertzsigovits/status/1576887610693369856)\n\n### Royal Ransomware Malware Analysis\n\n Executive Summary\n\n\n-----\n\n**Threat**\n**Identifiers**\n\n**Name** Royal Ransomware\n\n\n**Threat**\n**Type**\n\n\nRansomware\n\n\n**Detections** [Full List (VirusTotal)](https://www.virustotal.com/gui/file/f484f919ba6e36ff33e4fb391b8859a94d89c172a465964f99d6113b55ced429)\n\n\n**Tor**\n**Address**\n\n**Noticeable**\n**Behaviors**\n\n\n\n- hxxp[:]//royal2xthig3ou5hd7zsliqagy6yygk2cdelaxtni2fyad6dpmpxedid[.]onion\n\n- hxxp[:]//royal4ezp7xrbakkus3oofjw6gszrohpodmdnfbe5e4w3og5sm7vb3qd[.]onion\n\nRansomware skips the encryption process for all the files with extensions “dll, bat, royal, exe.“\n\nThose sub-folders and files are not encrypted by the ransomware. “Windows, Royal, Perflogs, Tor browser, Boot,\n$recycle.bin, Windows.old, $window.~ws, $windows.~bt, Mozilla, Google”\n\n\n**Conclusion** The attacks of this group occur more often, and their pattern should be kept in mind to be safe. The group mainly uses\ncallback phishing to get initial access to its victims. Organizations should provide cybersecurity awareness training for their\nemployees to prevent attacks from callback phishing.\n\nRoyal ransomware is a recent threat that appeared in 2022 and was particularly active during recent months. The ransomware deletes all\nVolume Shadow Copies and avoids specific file extensions and folders. It encrypts the network shares found in the local network and the local\ndrives. A parameter called “-id” that identifies the victim and is also written in the ransom note must be specified in the command line.\n\nThe files are encrypted using the AES algorithm (OpenSSL), with the key and IV being encrypted using the RSA public key that is hard-coded\nin the executable. The malware can fully or partially encrypt a file based on the file’s size and the “-ep” parameter. The extension of the\nencrypted files are changed to “.royal.”\n\n### Ransomware Composition\n\nWhen run as an administrator, Royal ransomware runs two sub-processes and terminates them after. Terminations could be because the tool\nused for analysis may be detected by the parent process, or it could terminate itself by detecting the virtual machine environment. This will be\nanswered in the static analysis section.\n\nThe findings gathered using Sysmon, Process Monitor and Event Viewer can be seen in the table below:\n\n**Process Name** **Command Line**\n\nvssadmin.exe delete shadows /all /quiet\n\nconhost.exe \\??\\C:\\WINDOWS\\system32\\conhost.exe 0xffffffff -ForceV1\n\nslui.exe \\??\\C:\\WINDOWS\\System32\\slui.exe -Embedding\n\n**vssadmin.exe**\n\nVolume Shadow Copy Service or VSS is a Windows service that allows taking manual or automatic backup copies (snapshots) of computer\nfiles or volumes, even when they are in use. It is executed as a Windows service called the Volume Shadow Copy service.\n\n**conhost.exe**\n\nMicrosoft provides the conhost.exe (Console Windows Host) file and is usually legitimate and completely safe. conhost.exe needs to run to\nallow Command Prompt to work with Windows Explorer. One of its features is that it gives you the ability to drag and drop files/folders straight\ninto Command Prompt.\n\n\n-----\n\n### Static Analysis\n\n**Overview**\n\n**File Name** Royal.exe\n\n**File Size** 3.013 KB\n\n**File Type** Win32.exe\n\n**MD5** df0b88dafe7a65295f99e69a67db9e1b\n\n**SHA-1** db3163a09eb33ff4370ad162a05f4b2584a20456\n\n**SHA-256** f484f919ba6e36ff33e4fb391b8859a94d89c172a465964f99d6113b55ced429\n\nThe ransomware was written in C++ and was not packed even with an entropy value of ‘6.60303’, which is thought to be 82% packed malware\nfirst. Let’s examine the strings and see if we can find anything during the analysis. You can see the entropy value in the screenshot below.\n\nWhen we searched for HTTP in the strings, we found an output. This onion URL may be the contact address of Royal Ransomware.\n\nThe first function call at the program’s start is shown in the screenshot below:\n\n\n-----\n\nAnti-Debugger control is provided with “IsDebuggerPresent” API. If the EAX register takes 1 as a value, the program will close itself, and it is\nnot possible to debug with the analysis tools; that’s why it is necessary to change it to 0 to run the program without closing. The anti-Debugger\nBypass technique will be done during Dynamic analysis.\n\n\n-----\n\nThe function related to the OpenSSL and RC4 encryption stage is given in the image below:\n\nThe ransomware imports a hard-coded RSA public key. The OpenSSL library will be used to encrypt the files using the AES algorithm, with the\nAES key being encrypted using the RSA public key:\n\n\n-----\n\n### Dynamic Analysis\n\nWhen executing the Royal ransomware, it takes three arguments. In this section, we will start the dynamic analysis phase by showing what\nthey are and for what they are used.\n\nWhen we run the program, it performs backup deletion -with child processes using the parameters we specified in the Ransomware\nComposition section- with vssadmin.exe and conhost.exe.\n\nConhost.exe must be run to allow Command Prompt to work with Windows Explorer. One of its features is that it will enable you to drag and\ndrop files/folders directly into Command Prompt.\n\n### ANY.RUN Process Graph\n\nBehavioral Information Reads the computer name Checks supported languages The process checks LSA protection\n\nroyal.exe x PID: 1568 x\n\nvssadmin.exe x x PID: 4768\n\nconhost.exe PID: 4892 PID: 4892 PID: 4892\n\nslui.exe x x PID: 1672\n\nWhen we examined the network activity, we could not find any interaction with blacklist IP addresses. All requested domain addresses are\nlegal addresses and whitelist IP addresses.\n\nSince it is a 64-bit program, let’s run it step by step by marking the relevant parts using x64dbg in the virtual environment.\n\n\n-----\n\nu g t e ebugge, e e t y to o e o a d by putt g a b ea po t o a e spec c s, t e p og a c oses tse a d pe o s t e\nterminate operation. It is clearly understood that Anti-Analysis techniques, which we see in the Static analysis section, are used.\n\nCommand line arguments:\n\n– path: The path to be encrypted.\n\n– ep: The number that represents the percentage of the file that will be encrypted.\n\n– id: A 32-digit array.\n\nRe-examined code part where the parameters are run with Ghidra can be found below:\n\n\n-----\n\n### Anti-Analysis Section\n\nWe saw the EAX Register value as 1 for IsDebuggerPresent, an important API that we constantly encounter in malware and will make the\nanalyst’s job more difficult. Let’s check again with Ghidra and start looking at what we can do for an anti-analysis bypass.\n\nAs we will see in the screenshot below, if we directly pass the function call made at the base address “00007FF6FDE0296D”, the program\nperforms the terminate operation.\n\n\n-----\n\nLet’s skip the executing process by changing the RIP address before it terminates the process using the function call and continue exploring it.\n\nWe’ve detected another function call that performs another terminate operation “00007FF6FDE029CF”.\n\nLet’s perform the previous RIP address change at this stage as well.\n\nIt repeats the same actions. Now let’s start reviewing the parts we skipped. After we got through the Anti-Analysis stages, we continued\nmonitoring the program’s operation, as seen in the image below. Once the backups have been deleted, Royal ransomware will set its exclusion\npaths (the files or directories spared from file encryption). The following file extensions will be excluded from being encrypted:\n\n.exe, .dll, .bat, .lnk, README.TXT, .royal\n\n\n-----\n\nNext, the ransomware will set the list of directories excluded from the encryption process. These directories are the ones that contain the\nfollowing strings:\n\n– Windows, RoyalPreflogs, Tor Browser, Boot $recycle.bin, Windows.old, $windows.~ws, $windows.~bt, Mozilla, Google.\n\n### Network Activity\n\nRansomware will scan the network interfaces and, if possible, retrieve the different IP addresses for the target machine/machines using the\n“GetIpAddrTable” API call. It will specifically search for IP addresses that start with “192.10.100./ 172.”\n\nRoyal ransomware will establish a socket using the API WSASocketW and associate it with a completion port using CreateIoCompletionPort. It\nthen will use the API call tones to set the port to SMB and eventually try to connect to the instructed IP addresses via the LPFN_CONNECTEX\ncallback function.\n\nRansomware will enumerate the shared resources of the given IP addresses using the API called NetShareEnum. If a shared resource is one\nof “\\\\<IP_Address>\\ADMIN$” or “\\\\<IP_Address>\\IPC$”, the ransomware will not encrypt it.\n\n### Encryption\n\nRoyal ransomware’s encryption is multi-threaded. To choose the number of running threads, the ransomware will use the API call\nGetNativeSystemInfo to collect the number of processors in a machine. It will then multiply the result by two and create the appropriate number\nof threads accordingly. Next, the ransomware will set the RSA public key, embedded in the binary in plain text and used for encrypting the AES\nkey.\n\n**RSA Public Key: —–BEGIN RSA PUBLIC KEY—–**\n\\nMIICCAKCAgEAuWfX+pJCUCKc9xsWLVHpCpw6TL20HG/Vk4vF3GYlr6HltX7BMRfA\\n7oGyMztNb37xW66NX+uxHghrX3+sm23yJmSfres\n\n\n-----\n\nRegarding partial encryption, Royal ransomware gives the ransomware operator a more flexible solution for evading detection than most\nransomware. We assume this flexibility and the evasion potential it enables was a design goal for the creators of Royal ransomware.\n\n### Latest Attacks of the Group\n\n[Ransomware attacks on the healthcare industry increased by 81.1% in 2022 compared to 2021. Also, Health Sector Cybersecurity](https://socradar.io/5-lessons-learned-from-healthcare-industry-cyberattacks-in-2022/)\n[Coordination Center (HC3) draws attention to this issue in its latest analysis of Royal Ransomware. Some recent attacks made in the](https://www.hhs.gov/sites/default/files/royal-ransomware-analyst-note.pdf)\nhealthcare industry, such as compromising the Northwest Michigan Health Services and Happy Sapiens Dental firms, are made from Royal\nRansomware. The group may likely target this sector more often in the future.\n\n_Royal’s post about the Happy Sapiens_\n\n_Dental_\n\n\n-----\n\nO e o t e oya s ost s g ca t c a s s t e co p o se o O, a e ca te eco u cat o s co pa y t o e t a **0**\nemployees. It is unknown which data was stolen, but according to Royal, they exfiltrated internal documents, passports, and driver’s licenses\nof INTRADO’s employees.\n\n_Royal’s_\n\n_claim about INTRADO_\nCountries affected by Royal Ransomware over time, based on our findings from around 70 observations, can be seen below:\n\n_Timeline of Royal Ransomware attacks_\nThe SOCRadar dark web team constantly monitors ransomware activities and reports in the SOCRadar Dark Web News panel.\n\n\n-----\n\n_SOCRadar’s Dark Web News panel under the Cyber Threat Intelligence module_\n\n### Conclusion\n\nThe attacks of this group occur more often, and their pattern should be kept in mind to be safe. The group mainly uses callback phishing to get\n[initial access to its victims. Organizations should provide cybersecurity awareness training for their employees to prevent attacks from callback](https://socradar.io/building-cybersecurity-awareness-for-organizations/)\nphishing.\n\nEmployees should:\n\nBe cautious of unsolicited calls, texts, or emails, especially if it asks to provide personal information or login credentials.\nBe cautious when providing personal information online.\nDo not click links or download attachments from unknown sources.\nUse strong passwords and assist it using 2FA or MFA solutions.\nKeep their systems up to date, which will help protect the devices from vulnerabilities that could be exploited.\n\nOrganizations -especially those operating in the Manufacturing and Healthcare sectors- should:\n\nRegularly update and patch software and systems.\nRegularly back up important data and test the backups.\nUse network segmentation and access controls to limit attackers’ movement within the network.\nDeploy and regularly update security software. (e.g., firewalls and antivirus)\n\nThese measures can help reduce the risk of Royal Ransomware, but no security measures are foolproof. It is vital to have a response plan in\nplace in case of an attack.\n\n### Appendixes\n\n**Appendix 1.**\n\n**Royal Ransomware (used sample’s information)**\n\n**MD5:df0b88dafe7a65295f99e69a67db9e1b**\n**SHA-1:db3163a09eb33ff4370ad162a05f4b2584a20456**\n**SHA-256: f484f919ba6e36ff33e4fb391b8859a94d89c172a465964f99d6113b55ced429**\n**File Type:Win32 EXE**\n\n**IOCs of Royal Ransomware:**\n\n104.86.182.8:443 (TCP)\n20.99.133.109:443 (TCP)\n20.99.184.37:443 (TCP)\n23.216.147.64:443 (TCP)\n\n\n-----\n\n3 6 6 3 ( C )\na83f:8110:0:0:64ca:1f00:0:0:53 (UDP)\na83f:8110:1749:73ff:1749:73ff:1a4b:73ff:53 (UDP)\na83f:8110:8401:0:2075:2cc:8401:0:53 (UDP)\nhxxp[:]//royal2xthig3ou5hd7zsliqagy6yygk2cdelaxtni2fyad6dpmpxedid[.]onion/%s\nREADME.txt\n\n**Appendix 2.**\n\n**MITRE ATT&CK Techniques**\n\n**Techniques** **Name**\n\nT1059 [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059/)\n\nT1106 [Native API](https://attack.mitre.org/techniques/T1106/)\n\nT1559.001 [Inter-Process Communication: Component Object Model](https://attack.mitre.org/techniques/T1559/001/)\n\nT1129 [Shared Modules](https://attack.mitre.org/techniques/T1129/)\n\nT1055 [Process Injection](https://attack.mitre.org/techniques/T1055/)\n\nT1134 [Access Token Manipulation](https://attack.mitre.org/techniques/T1134/)\n\nT1134.001 [Access Token Manipulation: Token Impersonation/Theft](https://attack.mitre.org/techniques/T1134/001/)\n\nT1070.004 [Indicator Removal: File Deletion](https://attack.mitre.org/techniques/T1070/004/)\n\nT1622 [Debugger Evasion](https://attack.mitre.org/techniques/T1622/)\n\nT1027 [Obfuscated Files or Information](https://attack.mitre.org/techniques/T1027/)\n\nT1140 [Deobfuscate/Decode Files or Information](https://attack.mitre.org/techniques/T1140/)\n\nT1082 [System Information Discovery](https://attack.mitre.org/techniques/T1082/)\n\nT1622 [Debugger Evasion](https://attack.mitre.org/techniques/T1622/)\n\nT1057 [Process Discovery](https://attack.mitre.org/techniques/T1057/)\n\nT1083 [File and Directory Discovery](https://attack.mitre.org/techniques/T1083/)\n\nT1135 [Network Share Discovery](https://attack.mitre.org/techniques/T1135/)\n\nT1518 [Software Discovery](https://attack.mitre.org/techniques/T1518/)\n\nT1560 [Archive Collected Data](https://attack.mitre.org/techniques/T1560/)\n\nT1090 [Proxy](https://attack.mitre.org/techniques/T1090/)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-01-09 - Dark Web Profile- Royal Ransomware.pdf"
    ],
    "report_names": [
        "2023-01-09 - Dark Web Profile- Royal Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf4d333d-ef79-40aa-b233-886e6de875a3",
            "created_at": "2023-12-08T02:00:05.754609Z",
            "updated_at": "2025-03-27T02:00:03.266797Z",
            "deleted_at": null,
            "main_name": "DEV-0569",
            "aliases": [
                "Storm-0569"
            ],
            "source_name": "MISPGALAXY:DEV-0569",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1675303697,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1675237718,
    "ts_modification_date": 1675237718,
    "files": {
        "pdf": "https://archive.orkl.eu/dbc4713812be79dd0e282512c9f930643ecfbd01.pdf",
        "text": "https://archive.orkl.eu/dbc4713812be79dd0e282512c9f930643ecfbd01.txt",
        "img": "https://archive.orkl.eu/dbc4713812be79dd0e282512c9f930643ecfbd01.jpg"
    }
}