{
    "id": "06b9abb1-924f-4726-a72c-a4f916922777",
    "created_at": "2023-01-12T15:04:07.635329Z",
    "updated_at": "2025-03-27T02:08:40.473151Z",
    "deleted_at": null,
    "sha1_hash": "88951530b293363a73473131001120adb5744845",
    "title": "2022-04-14 - Hacking activity of SectorB Group in 2021 Chinese government supported hacking group SectorB",
    "authors": "",
    "file_creation_date": "2022-05-28T23:24:50Z",
    "file_modification_date": "2022-05-28T23:24:50Z",
    "file_size": 751623,
    "plain_text": "# Hacking activity of SectorB Group in 2021\n\n**[redalert.nshc.net/2022/04/14/hacking-activity-of-sectorb-group-in-2021/](https://redalert.nshc.net/2022/04/14/hacking-activity-of-sectorb-group-in-2021/)**\n\n## Chinese government supported hacking group SectorB\n\nSectorB is a hacking group supported by the Chinese government in which 48 subgroups\nhave been identified as of now. They carry out hacking activities targeted on the entire world\nwith the purpose of collecting advanced information regarding political, diplomatic activities of\ngovernments. The subgroups show a trend of sharing malwares or vulnerabilities among\nthemselves for their hacking activities.\n\n[Figure 1 : SectorB subgroup activities identified in 2021]\n\nThey targeted their attacks on workers of government institutions and national defense to\ncollect advanced information and were identified to have been expanding their targets to\nnational finances and IT industries related to “One Belt and One Road”, the Chinese\ndiplomatic and economic policy.\n\n\n-----\n\nAmong the 48 subgroups of SectorB, hacking groups that showed most activities in 2021\nwas SectorB22 group, followed by SectorB01 group, SectorB03 and SectorB35 groups.\n\nThe following figure is the map of targeted countries of SectorB groups in 2021. A darker\nshade of red represents a higher number of attacks.\n\n[Figure 2 : Map of mainly targeted countries by SectorB groups in 2021]\n\nFrom the results, it could be deduced that SectorB carried out the greatest number of\nhacking activities targeted on Hong Kong, a neighboring country of China, followed by the\nUnited States and Russia.\n\nHong Kong has been independent of China in terms of political and economic fields, but\nrecently, democracy movements have emerged in the country against introduction of China’s\nsocialist political system. With regards to this, some of the hacking groups supported by the\nChinese government launched hacking activities targeted on Hong Kong’s liberalist\npersonnel for surveillance purposes.\n\nAdditionally, China launched hacking attacks on Russian research institutions with the\npurpose of stealing advanced science technologies related to latest military technologies\nsuch as aircraft carriers and jet planes.\n\n\n-----\n\n## Activity details of SectorB groups in 2021\n\nThe following is the timeline and monthly activity details of hacking activities by SectorB\ngroups identified in 2021.\n\n\n-----\n\n-----\n\n[Figure 3 : Timeline of main activities by SectorB group in 2021]\n\n**January Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 4\nhacking groups were identified this January, and the groups are SectorB01, SectorB07,\nSectorB22 and SectorB31 groups.\n\nSectorB01 group was found to be active in China, Hong Kong, and the Philippines. In this\nactivity, user mode Rootkit malwares created to attack Linux systems were identified.\n\nSectorB07 group was found to be active in China and Brazil. The attackers used MS Word\ndocument malwares disguised as resumes, using the template injection technique for their\nattacks.\n\nSectorB22 group was found to be active in Australia. In this activity, a modified PlugX\nmalware used by the attackers were identified.\n\nSectorB31 group was found to be active in Germany. In this activity, IP addresses used in\nhacking activities targeted on Germany’s public and governmental institutions were\nidentified.\n\n**February Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 3\nhacking groups were identified this February, and the groups are SectorB04, SectorB22 and\nSectorB32 groups.\n\nSectorB04 group was found to be active in Japan, Turkey, and the United States. The main\ntargets of this activity were Japanese corporations located in Japan or having overseas\nbranches, and the attacker used vulnerabilities of SSL-VPN as their initial access methods.\n\n\n-----\n\nSectorB22 group was found to be active in Taiwan, Hong Kong, Sri Lanka, Uganda, Poland,\nand Canada. The attackers intruded the update process of NoxPlayer, an Android emulator,\nto lead the users to download update programs containing malicious functions.\n\nSectorB32 group was found to be active in Russia. LNK format malwares were identified in\nthis activity, which carries out various commands through PowerShell upon execution. The\nLNK file was disguised as a regular program using the file name ‘adobeagent.lnk’.\n\n**March Hacking Aactivities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 7\nhacking groups were identified this March, and the groups are SectorB01, SectorB03,\nSectorB10, SectorB22, SectorB23, SectorB25 and SectorB35 groups.\n\nSectorB01 group was found to be active in India, Taiwan, the United States, the Philippines,\nIndonesia, and Iran. The group attacked main infrastructures such as India’s electricity\nproviding power plants, and multiple domains deduced to have been used in the attacks\nwere identified. During this period, attacks using vulnerabilities of MS Exchange were found,\nand along with the previously used ShadowPad malware, various tools such as Mimikatz\nwere found to have been used by SectorB01 groups in the attack.\n\nSectorB03 group was found to be active in Hong Kong, Taiwan, China, and the United\nStates. The group also used MS exchange server vulnerabilities, along with SysUpdate\nbackdoor, tools to search NETBIOS name servers and tools to serve HTTP Tunneling\nfunctions.\n\nSectorB10 group used the vulnerabilities of MS exchange server, and malwares written in\nDelphi that were used by the group in the past were identified together.\n\nSectorB22 group was found to be active in Pakistan and Vietnam. The group also used MS\nexchange server vulnerabilities to attack public resource providing companies. In this attack,\nthey used malwares disguised as installation programs of Adobe Flash Player.\n\nSectorB23 group was found to be active in Germany. The group also used MS exchange\nserver vulnerabilities for their attacks, and PlugX malware was identified in the attack as well.\n\nSectorB25 group was found to be active in Netherlands and Russia. The group also used\nMS exchange server vulnerabilities for their attacks targeted on cybersecurity consulting\ncompanies in Eastern Europe.\n\nSectorB35 group was found to be active in India, Italy, Canada, Iran, Belgium, the United\nStates, Spain, Switzerland, Finland, Arab Emirates, Israel, Netherlands, Poland, Austria,\nTurkey, Germany, Hungary, China, and South Korea. The group used MS exchange server\nvulnerabilities to disseminate Cryptomining malwares. They used the same vulnerability with\nthe intent to disseminate ransomware and botnet malwares as well.\n\n\n-----\n\n**April Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 5\nhacking groups were identified this April, and the groups are SectorB09, SectorB14,\nSectorB23, SectorB25 and SectorB37 groups.\n\nSectorB09 group was found to be active in Taiwan and Germany. The group used PLEAD\nmalwares in ELF (Executable and Linkable Format) format to collect system information from\ninfected systems and used OpenSSL to communicate with the encrypted C2 server.\n\nSectorB14 group was found to be active in Germany, Spain, China, Hong Kong, Slovakia,\nand Vietnam. The group used MS word documents with various subjects such as COVID-19,\nand the macro inserted in the document executes a normal executing program, a malware in\nDLL format, a normal document, and a CAB file including the encoded data. In the final\nstage, the normal executable program loads the malicious DLL file and communicates with\nthe C2 server.\n\nSectorB23 group was found to be active in Nepal, Russia, Macedonia, Australia,\nKazakhstan, Switzerland, Ukraine, the United States, Afghanistan, Italy, India, and Czech\nRepublic. The group used MS exchange server vulnerabilities to attack various industries.\nThey distributed PlugX malwares in the infected systems, and most of the domains used in\nthe activity were registered using a specific hosting company.\n\nSectorB25 group was found to be active in Russia, the United States and Mongolia. The\ngroup used spear phishing emails attached with RTF (Rich Text Format) files with\nvulnerabilities and served hacking activities targeted on a submarine designing company in\nRussia.\n\nSectorB37 group was found to be active in Czech Republic, Bangladesh, and China. The\ngroup used MS word documents with macro scripts inserted for their attacks, disguised as a\ndocument about expressway of a certain country in Southeast Asia. The VBS file created by\nthe macro script was encoded using Microsoft script encoder and uses WMI service to\ncollect system information and serves encrypted C2 communications upon execution of the\nfile.\n\n**May Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 1\nhacking group was identified this May, and the group was SectorB23 group.\n\nSectorB23 group was found to be active in China, Hong Kong, and Italy. The group used\nmalwares written through Pyinstaller, and disguised the file as an Adobe Flash Player\ninstallation file. Upon execution of the malware, communication with C2 server is established\nand additional files related to network tunneling are downloaded.\n\n\n-----\n\n**June Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 2\nhacking groups were identified this June, and the groups are SectorB22 and SectorB38\ngroups.\n\nSectorB22 group was found to be active in Myanmar, Japan, Netherlands, Taiwan, the\nPhilippines, China, Singapore, Thailand, and the United States. Supply chain attacks\ntargeted on the official website of Myanmar’s president was identified, and ZIP format\nmalwares were disseminated on the website.\n\nSectorB38 group was found to be active in Vietnam and China. The group used MS word\nmalwares with reports by audit committee of the Vietnamese government as the subject,\nwhich uses the template injection technique to download RTF (Rich Text File) including MS\noffice equation editor vulnerabilities from a remote server.\n\n**July Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 4\nhacking groups were identified this July, and the groups are SectorB08, SectorB22,\nSectorB25 and SectorB27 groups.\n\nSectorB08 group was found to be active in Taiwan. The MS word malware identified in this\nactivity contained a macro script, which, in the final stage, executes PowerShell to download\nmalwares uploaded in Google drives, and uses normal WinRAR programs to extract the\ndownloaded files.\n\nSectorB22 group was found to be active in Vietnam, South Korea, and China. In this activity,\nmalware like the malware used in supply chain attacks on the Vietnamese government\ncertification authority in December 2020 was identified. Malwares identified in these two\nactivities have a similar code structure, Rich Header hash, PDB (Program Database) path,\nand both uses service DLL files disguised as NLS (National Language Support) extension.\n\nSectorB25 group was found to be active in Russia, Japan, France, and England. In this\nactivity, RTF documents written in Royal Road were found, and the document disguised as\n“Statement by non-departmental expert committee on Aerospace” contains equation editor\nvulnerabilities.\n\nSectorB27 group was found to be active in the United States, Russia, and China. In this\nactivity, Netfilter Rootkit malware signed by Microsoft were found, and the hacking group was\ndeduced to have created the malware to target on online game industry. The malware was\nsigned and disseminated using Microsoft and other companies’ certifications.\n\n**August Hacking Activities**\n\n\n-----\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 2\nhacking groups were identified this August, and the groups are SectorB31 and SectorB35\ngroups.\n\nSectorB31 group was found to be active in France and China. In this activity, attacks\naffecting numerous institutions in France were identified. Various custom opensource tools\nwere used to steal information, and ELF malwares were used to make use of the router’s\nvulnerabilities.\n\nSectorB35 group was found to be active in Spain, Ireland, Italy, and England. The group\nused ProxyShell vulnerabilities often used against Microsoft exchange servers, and used\nCVE-2021-31207, CVE-2021-34523 and CVE-2021-34473 vulnerabilities to execute their\nremote code in the Microsoft exchange servers.\n\n**September Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 4\nhacking groups were identified this September, and the groups are SectorB01, SectorB04,\nSectorB22 and SectorB43 groups.\n\nSectorB01 group was found to be active in Canada, India, England, France, Austria,\nLuxembourg, Hong Kong, Bahrain, the United States, South Korea, and Singapore. The\ngroup targeted their attacks on workers of various fields such as government institutions,\nacademy, religion, and IT. They used .NET loaders to load malware in the memory of\ninfected user system to serve their attacks.\n\nSectorB04 group was found to be active in England, the United States, Hong Kong,\nGermany, France, and India. The group took advantage of vulnerabilities to launch attacks\non various industries such as manufacturing, finance, travelling and tourism. They used MS\nexchange serves to connect to the target’s network and continuously monitors their victims.\n\nSectorB22 group was found to be active in Japan, England, and the United States. The\ngroup used documents disguised as China’s national meeting and constitutional laws to\nserve their attacks. The malware delivered in the form of compressed files used DLL side\nloading techniques to load malicious DLL on a normal program to serve their functions, to\navoid suspicion from users.\n\nSectorB43 group was found to be active in Russia. In this activity, a malware was found to be\ncontinuously updated by a certain user at a specific time interval. New updates are added to\nthe malware in every update and serves various RAT (Remote Administration Tool) functions.\n\n**October Hacking Activities**\n\n\n-----\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 2\nhacking groups were identified this October, and the groups are SectorB09 and SectorB46\ngroups.\n\nSectorB09 group launched attacks on a certain company in this activity and used malwares\nusing the MFC (Microsoft foundation class) libraries. The malware contained functions to\ncollect information from the infected system and to download and execute additional\nmalwares.\n\nSectorB46 group was found to be active in Russia. The group used Zero-day vulnerabilities\nin the Window Kernel drive to launch attacks targeted on workers of defense industries and\ndiplomatic institutions.\n\n**November Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 1\nhacking group was identified this November, and the groups was SectorB03 group.\n\nSectorB03 group was found to be active in China, Czech Republic, and the United States.\nThe group used vulnerabilities of password management solutions to distribute payload\ncontaining malwares to workers in various industries such as defense industry, energy,\neducation, and consulting services.\n\n**December Hacking Activities**\n\nAmong the SectorB groups supported by the Chinese government, activities by a total of 5\nhacking groups were identified this December, and the groups are SectorB03, SectorB09,\nSectorB22, SectorB35 and SectorB43 groups.\n\nSectorB03 group was found to be active in Hong Kong, Denmark, and Netherlands. The\ngroup used vulnerabilities of corporate IT operation and service managing software to launch\ntheir attacks on medical, electronics and IT industries.\n\nSectorB09 group was found to be active in China. The group used MS excel format\nmalwares disguised as weekly work reports in this activity.\n\nSectorB22 group was found to be active in Vietnam, Taiwan, Myanmar, and Russia. The\ngroup used malwares in compressed file formats disguised as Adobe library files in this\nactivity.\n\nSectorB35 group was found to be active in the United States. The group used RCE (Remote\nCode Execution) vulnerabilities that allows one to execute unknown codes in the framework\nof Apache software.\n\n\n-----\n\nSectorB43 group was found to be active in Mongolia. In this activity, the group used RTF\n(Rich Text File) format malwares containing equation editor vulnerabilities, which were\ndisguised as featured news.\n\nThe full report detailing each event together with IoCs (Indicators of Compromise) and\nrecommendations is available to existing NSHC ThreatRecon customers. For more\n[information, please contact RA.global@nshc.net](http://10.10.0.46/mailto:RA.global@nshc.net)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-14 - Hacking activity of SectorB Group in 2021 Chinese government supported hacking group SectorB.pdf"
    ],
    "report_names": [
        "2022-04-14 - Hacking activity of SectorB Group in 2021 Chinese government supported hacking group SectorB.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535847,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653780290,
    "ts_modification_date": 1653780290,
    "files": {
        "pdf": "https://archive.orkl.eu/88951530b293363a73473131001120adb5744845.pdf",
        "text": "https://archive.orkl.eu/88951530b293363a73473131001120adb5744845.txt",
        "img": "https://archive.orkl.eu/88951530b293363a73473131001120adb5744845.jpg"
    }
}