{
    "id": "06c35d44-e8e7-46ea-80b9-0f3075cc8615",
    "created_at": "2022-10-25T16:48:14.886489Z",
    "updated_at": "2025-03-27T02:12:03.879378Z",
    "deleted_at": null,
    "sha1_hash": "71b7670f7c8e59dbaea64acb39a796862c6b05c1",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-03-12T03:25:31Z",
    "file_modification_date": "2021-03-12T03:25:31Z",
    "file_size": 1023425,
    "plain_text": "# Operation Exchange Marauder: Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities\n\n**[volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities](https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/)**\n\nMarch 2, 2021\n\nby Josh Grunzweig, Matthew Meltzer, Sean Koessel, Steven Adair, Thomas Lancaster\n\n**[UPDATE]** **March 8, 2021 – Since original publication of this blog, Volexity**\n**has now observed that cyber espionage operations using the SSRF**\n**vulnerability CVE-2021-26855 started occurring on January 3, 2021, three**\n**days earlier than initially posted.**\n\n**_Volexity is seeing active in-the-wild exploitation of multiple Microsoft_**\n**_Exchange vulnerabilities used to steal e-mail and compromise networks._**\n**_These attacks appear to have started as early as January 6, 2021._**\n\nIn January 2021, through its Network Security Monitoring service, Volexity detected\nanomalous activity from two of its customers’ Microsoft Exchange servers. Volexity\nidentified a large amount of data being sent to IP addresses it believed were not tied to\nlegitimate users. A closer inspection of the IIS logs from the Exchange servers revealed\nrather alarming results. The logs showed inbound POST requests to valid files associated\nwith images, JavaScript, cascading style sheets, and fonts used by Outlook Web Access\n(OWA). It was initially suspected the servers might be backdoored and that webshells\nwere being executed through a malicious HTTP module or ISAPI filter. As a result,\nVolexity started its incident response efforts and acquired system memory (RAM) and\nother disk artifacts to initiate a forensics investigation. This investigation revealed that\nthe servers were not backdoored and uncovered a zero-day exploit being used in the wild.\n\n\n-----\n\nThrough its analysis of system memory, Volexity determined the attacker was exploiting a\nzero-day server-side request forgery (SSRF) vulnerability in Microsoft Exchange (CVE2021-26855). The attacker was using the vulnerability to steal the full contents of several\nuser mailboxes. This vulnerability is remotely exploitable and does not require\nauthentication of any kind, nor does it require any special knowledge or access to a target\nenvironment. The attacker only needs to know the server running Exchange and the\naccount from which they want to extract e-mail.\n\nAdditionally, Volexity is providing alternative mitigations that may be used by defenders\nto assist in securing their Microsoft Exchange instances. This vulnerability has been\nconfirmed to exist within the latest version of Exchange 2016 on a fully patched Windows\nServer 2016 server. Volexity also confirmed the vulnerability exists in Exchange 2019 but\nhas not tested against a fully patched version, although it believes they are vulnerable. It\nshould also be noted that is vulnerability does not appear to impact Office 365.\n\nFollowing the discovery of CVE-2021-26855, Volexity continued to monitor the threat\nactor and work with additional impacted organizations. During the course of multiple\nincident response efforts, Volexity identified that the attacker had managed to chain the\nSSRF vulnerability with another that allows remote code execution (RCE) on the\n[targeted Exchange servers (CVE-2021-27065). In all cases of RCE, Volexity has observed](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-27065)\nthe attacker writing webshells (ASPX files) to disk and conducting further operations to\ndump credentials, add user accounts, steal copies of the Active Directory database\n(NTDS.DIT), and move laterally to other systems and environments.\nA patch addressing both of these vulnerabilities is expected imminently.\n\n## Authentication Bypass Vulnerability\n\nWhile Volexity cannot currently provide full technical details of the exploit and will not be\nsharing proof-of-concept exploit code, it is still possible to provide useful details\nsurrounding the vulnerability’s exploitation and possible mitigations. Volexity observed\nthe attacker focused on getting a list of e-mails from a targeted mailbox and downloading\nthem. Based on these observations, it was possible for Volexity to further improve and\nautomate attacks in a lab environment.\n\nThere are two methods to download e-mail with this vulnerability, depending on the way\nthat Microsoft Exchange has been configured. In corporate environments it is common\nthat multiple Exchange servers will be set up. This is often done for load balancing,\navailability, and resource splitting purposes. While it is less common, it is also possible to\nrun all Exchange functionality on a single server.\n\nIn the case where a single server is being used to provide the Exchange service, Volexity\nbelieves the attacker must know the targeted user’s domain security identifier (SID) in\norder to access their mailbox. This is a static value and is not considered something\nsecret. However, it is not something that is trivially obtained by someone without access\nto systems within a specific organization.\n\n\n-----\n\nIn a multiple server configuration, where the servers are configured in a Database\nAvailability Group (DAG), Volexity has proven an attacker does not need to acquire a\nuser’s domain SID to access their mailbox. The only information required is the e-mail\naddress of the user they wish to target.\n\nIn order to exploit this vulnerability, the attacker must also identify the fully qualified\ndomain name (FQDN) of the internal Exchange server(s). Using a series of requests,\nVolexity determined that this information could be extracted by an attacker with only\ninitial knowledge of the external IP address or domain name of a publicly accessible\nExchange server. After this information is obtained, the attacker can generate and send a\nspecially crafted HTTP POST request to the Exchange server with an XML SOAP payload\nto the Exchange Web Services (EWS) API endpoint. This SOAP request, using specially\ncrafted cookies, bypasses authentication and ultimately executes the underlying request\nspecified in the XML, allowing an attacker to perform any operation on the users’\nmailbox.\n\nVolexity has observed this attack conducted via OWA. The exploit involved specially\ncrafted POST requests being sent to a valid static resources that does not require\nauthentication. Specifically, Volexity has observed POST requests targeting files found on\nthe following web directory:\n```\n/owa/auth/Current/themes/resources/\n\n```\nThis folder contains image, font, and cascading style sheet files. Using any of these files\nfor the POST request appears to allow the exploit to proceed. If a file such as\n/owa/auth/logon.aspx or simply a folder such as /owa/auth/ were to be used, the exploit\nwill not work.\n\n## Authentication Bypass Exploit Demonstration\n\nThe video below demonstrates the vulnerability being exploited in a lab environment:\n\n_Figure 1. Video demonstrating the authentication bypass vulnerability at work in a lab_\n_environment._\n\nIn the video demonstration, the following SOAP XML payload is used to retrieve the\nidentifiers of each email in Alice’s inbox:\n\n\n-----\n\n_Figure 2. XML payload used to pull email identifiers from Alice’s inbox without_\n_authentication._\n\nThen, the following payload is used to pull down each individual email:\n\n_Figure 3. Payload used to retrieve individual emails without authentication._\n\n## Remote Code Execution Vulnerability\n\nAs mentioned in the introduction to this post, a remote code execution (RCE) exploit was\nalso observed in use against multiple organizations. This RCE appears to reside within the\n[use of the Set-OabVirtualDirectory ExchangePowerShell cmdlet. Evidence of this activity](https://docs.microsoft.com/en-us/powershell/module/exchange/set-oabvirtualdirectory?view=exchange-ps)\ncan be seen in Exchange’s ECP Server logs. A snippet with the exploit removed is shown\nbelow.\n\n;’S:CMD=Set-OabVirtualDirectory.ExternalUrl=”<removed>”\n\n\n-----\n\nIIS logs for the server would show an entry similar to what is shown below; however, this\nURL path may be used for items not associated with this exploit or activity.\n\n/ecp/DDI/DDIService.svc/SetObject\n\nIn this case, this simple backdoor, which Volexity has named SIMPLESEESHARP, was\nthen used to drop a larger webshell, named SPORTSBALL, on affected systems. Further,\nVolexity has observed numerous other webshells in use, such as China Chopper variants\nand ASPXSPY.\n\n## POST Exploitation Activity\n\nWhile the attackers appear to have initially flown largely under the radar by simply\nstealing e-mails, they recently pivoted to launching exploits to gain a foothold. From\nVolexity’s perspective, this exploitation appears to involve multiple operators using a\nwide variety of tools and methods for dumping credentials, moving laterally, and further\nbackdooring systems. Below is a summary of the different methods and tools Volexity has\nobserved thus far:\n\nMethod/Tool Purpose\n\n\nrundll32\nC:\\windows\\system32\\comsvcs.dll\nMiniDump lsass.dmp\n\n\nDump process memory of lsass.exe to obtain\ncredentials\n\n\nPsExec Windows Sysinternals tool used to execute\ncommands on remote systems\n\nProcDump Windows Sysinternals tool to dump process\nmemory\n\nWinRar Command Line Utility Used archive data exfiltration\n\nWebshells (ASPX and PHP) Used to allow command execution or network\nproxying via external websites\n\nDomain Account User Addition Leveraged by attackers to add their own user\naccount and grant it privileges to provide access in\nthe future\n\n## Indicators of Compromise\n\n### Authentication Bypass Indicators\n\nIn Volexity’s observations of authentication bypass attacks being performed in the wild,\nfiles such as the following were the targets of HTTP POST requests:\n\n\n-----\n\n/owa/auth/Current/themes/resources/logon.css\n/owa/auth/Current/themes/resources/owafont_ja.css\n/owa/auth/Current/themes/resources/lgnbotl.gif\n/owa/auth/Current/themes/resources/owafont_ko.css\n/owa/auth/Current/themes/resources/SegoeUI-SemiBold.eot\n/owa/auth/Current/themes/resources/SegoeUI-SemiLight.ttf\n/owa/auth/Current/themes/resources/lgnbotl.gif\n\n### Remote Code Execution Indicators\n\nTo identify possible historical activity related to the remote code execution exploit,\norganizations can search their ECP Server logs for the following string (or similar).\n```\n   S:CMD=Set-OabVirtualDirectory.ExternalUrl='\n\n```\nECP Server logs are typically located at <exchange install path>\\Logging\\ECP\\Server\\\n\n### Webshell Indicators\n\nFurther, Volexity has observed indicators that are consistent with web server breaches\nthat can be used to look on disk and in web logs for access to or the presence of ASPX files\nat the following paths:\n\n\\inetpub\\wwwroot\\aspnet_client\\ (any .aspx file under this folder or sub folders)\n\n\\<exchange install path>\\FrontEnd\\HttpProxy\\ecp\\auth\\ (any file besides\nTimeoutLogoff.aspx)\n\n\\<exchange install path>\\FrontEnd\\HttpProxy\\owa\\auth\\ (any file or modified file that is not\npart of a standard install)\n\n\\<exchange install path>\\FrontEnd\\HttpProxy\\owa\\auth\\Current\\<any aspx file in this folder\nor subfolders>\n\n\\<exchange install path>\\FrontEnd\\HttpProxy\\owa\\auth\\<folder with version number>\\<any\naspx file in this folder or subfolders>\n\nIt should be noted that Volexity has observed the attacker adding webshell code to\notherwise legitimate ASPX files in an attempt to blend in and hide from defenders.\n\n### Web Log User-Agents\n\nThere are also a handful of User-Agent that may be useful for responders to look for when\nexamining their web logs. These are not necessarily indicative of compromise, but should\nbe used to determine if further investigation.\n\nVolexity observed the following non-standard User-Agents associated with POST requests\nto the files found under folders within /owa/auth/Current.\n\n\n-----\n\nDuckDuckBot/1.0;+(+http://duckduckgo.com/duckduckbot.html)\nfacebookexternalhit/1.1+(+http://www.facebook.com/externalhit_uatext.php)\nMozilla/5.0+(compatible;+Baiduspider/2.0;++http://www.baidu.com/search/spider.html)\nMozilla/5.0+(compatible;+Bingbot/2.0;++http://www.bing.com/bingbot.htm)\nMozilla/5.0+(compatible;+Googlebot/2.1;++http://www.google.com/bot.html\nMozilla/5.0+(compatible;+Konqueror/3.5;+Linux)+KHTML/3.5.5+(like+Gecko)+(ExabotThumbnails)\nMozilla/5.0+(compatible;+Yahoo!+Slurp;+http://help.yahoo.com/help/us/ysearch/slurp)\nMozilla/5.0+(compatible;+YandexBot/3.0;++http://yandex.com/bots)\nMozilla/5.0+(X11;+Linux+x86_64)+AppleWebKit/537.36+\n(KHTML,+like+Gecko)+Chrome/51.0.2704.103+Safari/537.36\n\nVolexity observed the following User-Agents in conjunction with exploitation to /ecp/\nURLs.\n\nExchangeServicesClient/0.0.0.0\npython-requests/2.19.1\npython-requests/2.25.1\n\nFurther other notable User-Agent entries tied to tools used for post-exploitation access to\nwebshells.\n\nantSword/v2.1\n\nGooglebot/2.1+(+http://www.googlebot.com/bot.html)\nMozilla/5.0+(compatible;+Baiduspider/2.0;++http://www.baidu.com/search/spider.html)\n\n### Additional Auth Bypass and RCE Indicators\n\nTo identify possible historical activity relating to the authentication bypass and RCE\nactivity, IIS logs from Exchange servers can be examined for the following:\n\nPOST /owa/auth/Current/\n\nPOST /ecp/default.flt\n\nPOST /ecp/main.css\n\nPOST /ecp/<single char>.js\n\nNote that the presence of log entries with POST requests under these directories does not\nguarantee an Exchange server has been exploited. However, its presence should warrant\nfurther investigation.\n\nYara signatures for non trivial webshells deployed by attackers following successful\nexploitation may be found in the Appendix of this post.\n\n### Network Indicators – Attacker IPs\n\n\n-----\n\nVolexity has observed numerous IP addresses leveraged by the attackers to exploit the\nvulnerabilities described in this blog. These IP addresses are tied to VPS servers and VPN\nservices. Volexity has also observed the attackers using Tor, but has made attempts to\nremove those entries from the list below.\n\n103.77.192.219\n104.140.114.110\n104.250.191.110\n108.61.246.56\n149.28.14.163\n157.230.221.198\n167.99.168.251\n185.250.151.72\n192.81.208.169\n203.160.69.66\n211.56.98.146\n5.254.43.18\n80.92.205.81\n\n## Conclusion\n\nHighly skilled attackers continue to innovate in order to bypass defenses and gain access\nto their targets, all in support of their mission and goals. These particular vulnerabilities\nin Microsoft Exchange are no exception. These attackers are conducting novel attacks to\nbypass authentication, including two-factor authentication, allowing them to access email accounts of interest within targeted organizations and remotely execute code on\nvulnerable Microsoft Exchange servers.\n\nDue to the ongoing observed exploitation of the discussed vulnerabilities, Volexity urges\norganizations to immediately apply the available patches or temporarily disabling\nexternal access to Microsoft Exchange until a patch can be applied.\n\n## Need Assistance?\n\nIf you have concerns that your servers or networks may have been compromised from this\n[vulnerability, please reach out to the Volexity team and we can help you make a](https://www.volexity.com/company/contact/)\ndetermination if further investigation is warranted.\n\n## Appendix\n\n\n-----\n\nrule webshell_aspx_simpleseesharp : Webshell Unclassified\n{\n\nmeta:\n\nauthor= “threatintel@volexity.com”\ndate= “2021-03-01”\ndescription= “A simple ASPX Webshell that allows an attacker to write further files to\ndisk.”\nhash= “893cd3583b49cb706b3e55ecb2ed0757b977a21f5c72e041392d1256f31166e2”\n\nstrings:\n\n$header= “<%@ Page Language=\\”C#\\” %>”\n$body= “<% HttpPostedFile thisFile = Request.Files[0];thisFile.SaveAs(Path.Combine”\n\ncondition:\n\n$header at 0 and\n$body and\nfilesize < 1KB\n\n}\n\nrule webshell_aspx_reGeorgTunnel : Webshell Commodity\n{\nmeta:\nauthor= “threatintel@volexity.com”\ndate= “2021-03-01”\ndescription= “variation on reGeorgtunnel”\nhash= “406b680edc9a1bb0e2c7c451c56904857848b5f15570401450b73b232ff38928”\nreference= “https://github.com/sensepost/reGeorg/blob/master/tunnel.aspx”\nstrings:\n$s1= “System.Net.Sockets”\n$s2=\n“System.Text.Encoding.Default.GetString(Convert.FromBase64String(StrTr(Request.Headers.Get”\n$t1 = “.Split(‘|’)”\n$t2= “Request.Headers.Get”\n$t3= “.Substring(“\n$t4= “new Socket(“\n$t5= “IPAddress ip;”\ncondition:\nall of ($s*) or\nall of ($t*)\n}\n\n\n-----\n\nrule webshell_aspx_sportsball : Webshell\n{\n\nmeta:\n\nauthor= “threatintel@volexity.com”\ndate= “2021-03-01”\ndescription= “The SPORTSBALL webshell allows attackers to upload files or execute\ncommands on the system.”\nhash= “2fa06333188795110bba14a482020699a96f76fb1ceb80cbfa2df9d3008b5b0a”\n\nstrings:\n\n$uniq1= “HttpCookie newcook = new HttpCookie(\\”fqrspt\\”,\nHttpContext.Current.Request.Form”\n$uniq2= “ZN2aDAB4rXsszEvCLrzgcvQ4oi5J1TuiRULlQbYwldE=”\n\n$var1= “Result.InnerText = string.Empty;”\n$var2= “newcook.Expires = DateTime.Now.AddDays(”\n$var3= “System.Diagnostics.Process process = new System.Diagnostics.Process()”\n$var4= “process.StandardInput.WriteLine(HttpContext.Current.Request.Form[\\””\n$var5= “else if (!string.IsNullOrEmpty(HttpContext.Current.Request.Form[\\””\n$var6= “<input type=\\”submit\\” value=\\”Upload\\” />”\n\ncondition:\n\nany of ($uniq*) or\nall of ($var*)\n\n}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.03.02.Operation_Exchange_Marauder/Operation%20Exchange%20Marauder_%20Active%20Exploitation%20of%20Multiple%20Zero-Day%20Microsoft%20Exchange%20Vulnerabilities%20_%20Volexity.pdf"
    ],
    "report_names": [
        "Operation Exchange Marauder_ Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities _ Volexity"
    ],
    "threat_actors": [
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1615519531,
    "ts_modification_date": 1615519531,
    "files": {
        "pdf": "https://archive.orkl.eu/71b7670f7c8e59dbaea64acb39a796862c6b05c1.pdf",
        "text": "https://archive.orkl.eu/71b7670f7c8e59dbaea64acb39a796862c6b05c1.txt",
        "img": "https://archive.orkl.eu/71b7670f7c8e59dbaea64acb39a796862c6b05c1.jpg"
    }
}