{
    "id": "070bc19b-d287-47b9-8283-84735579a231",
    "created_at": "2023-01-12T15:09:01.64048Z",
    "updated_at": "2025-03-27T02:15:45.26035Z",
    "deleted_at": null,
    "sha1_hash": "3e6e46b30e46567b378036fac63462980a659038",
    "title": "2021-11-07 - Targeted Attack Campaign Against ManageEngine ADSelfService Plus Delivers Godzilla Webshells, NGLite Trojan and KdcSponge Stealer",
    "authors": "",
    "file_creation_date": "2022-05-28T00:36:35Z",
    "file_modification_date": "2022-05-28T00:36:35Z",
    "file_size": 659626,
    "plain_text": "# Godzilla Webshell\n\n**unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/**\n\nRobert Falcone, Jeff White, Peter Renals November 8, 2021\n\nBy [Robert Falcone,](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Jeff White and](https://unit42.paloaltonetworks.com/author/jeff-white/) [Peter Renals](https://unit42.paloaltonetworks.com/author/peter-renals/)\n\nNovember 7, 2021 at 6:00 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [APT,](https://unit42.paloaltonetworks.com/tag/apt/) [backdoor,](https://unit42.paloaltonetworks.com/tag/backdoor/) [Credential Harvesting,](https://unit42.paloaltonetworks.com/tag/credential-harvesting/) [credential stealer,](https://unit42.paloaltonetworks.com/tag/credential-stealer/) [KdcSponge,](https://unit42.paloaltonetworks.com/tag/kdcsponge/) [ManageEngine,](https://unit42.paloaltonetworks.com/tag/manageengine/) [NGLite,](https://unit42.paloaltonetworks.com/tag/nglite/) [TiltedTemple,](https://unit42.paloaltonetworks.com/tag/tiltedtemple/) [Trojan,](https://unit42.paloaltonetworks.com/tag/trojan/) Zoho\nManageEngine\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/manageengine-godzilla-nglite-kdcsponge/)\n\n## Executive Summary\n\n[On Sept. 16, 2021, the US Cybersecurity and Infrastructure Security Agency (CISA) released an alert warning that advanced persistent threat](https://us-cert.cisa.gov/ncas/alerts/aa21-259a)\n(APT) actors were actively exploiting newly identified vulnerabilities in a self-service password management and single sign-on solution known\nas ManageEngine ADSelfService Plus. The alert explained that malicious actors were observed deploying a specific webshell and other\ntechniques to maintain persistence in victim environments; however, in the days that followed, we observed a second unrelated campaign\ncarry out successful attacks against the same vulnerability.\n\nAs early as Sept. 17 the actor leveraged leased infrastructure in the United States to scan hundreds of vulnerable organizations across the\ninternet. Subsequently, exploitation attempts began on Sept. 22 and likely continued into early October. During that window, the actor\nsuccessfully compromised at least nine global entities across the technology, defense, healthcare, energy and education industries.\n\n[Following initial exploitation, a payload was uploaded to the victim network which installed a Godzilla webshell. This activity was consistent](https://github.com/BeichenDream/Godzilla/)\nacross all victims; however, we also observed a smaller subset of compromised organizations who subsequently received a modified version\n[of a new backdoor called NGLite. The threat actors then used either the webshell or the NGLite payload to run commands and move laterally](https://github.com/Maka8ka/NGLite)\nto other systems on the network, while they exfiltrated files of interest simply by downloading them from the web server. Once the actors\npivoted to a domain controller, they installed a new credential-stealing tool that we track as KdcSponge.\n\nBoth Godzilla and NGLite were developed with Chinese instructions and are publicly available for download on GitHub. We believe threat\nactors deployed these tools in combination as a form of redundancy to maintain access to high-interest networks. Godzilla is a functionalityrich webshell that parses inbound HTTP POST requests, decrypts the data with a secret key, executes decrypted content to carry out\nadditional functionality and returns the result via a HTTP response. This allows attackers to keep code likely to be flagged as malicious off the\ntarget system until they are ready to dynamically execute it.\n\nNGLite is characterized by its author as an “anonymous cross-platform remote control program based on blockchain technology.” It leverages\n[New Kind of Network (NKN) infrastructure for its command and control (C2) communications, which theoretically results in anonymity for its](https://nkn.org/)\nusers. It's important to note that NKN is a legitimate networking service that uses blockchain technology to support a decentralized network of\npeers. The use of NKN as a C2 channel is very uncommon. We have seen only 13 samples communicating with NKN altogether – nine NGLite\n[samples and four related to a legitimate open-source utility called Surge that uses NKN for file sharing.](https://github.com/rule110-io/surge)\n\nFinally, KdcSponge is a novel credential-stealing tool that is deployed against domain controllers to steal credentials. KdcSponge injects itself\ninto the Local Security Authority Subsystem Service (LSASS) process and will hook specific functions to gather usernames and passwords\nfrom accounts attempting to authenticate to the domain via Kerberos. The malicious code writes stolen credentials to a file but is reliant on\nother capabilities for exfiltration.\n\n\n-----\n\na o to et o s custo e s a e p otected aga st t s ca pa g t oug t e o o g\n\n[Cortex XDR local analysis blocks the NGLite backdoor.](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n[All known samples (Dropper, NGLite, KdcSponge) are classified as malware in WildFire.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[Cortex Xpanse can accurately identify Zoho ManageEngine ADSelfServicePlus, ManageEngine Desktop Central or ManageEngine](https://www.paloaltonetworks.com/cortex/cortex-xpanse)\nServiceDeskPlus Servers across customer networks.\n\n## Initial Access\n\nBeginning on Sept. 17 and continuing through early October, we observed scanning against ManageEngine ADSelfService Plus servers.\nThrough global telemetry, we believe that the actor targeted at least 370 Zoho ManageEngine servers in the United States alone. Given the\nscale, we assess that these scans were largely indiscriminate in nature as targets ranged from education to Department of Defense entities.\n\n[Upon obtaining scan results, the threat actor transitioned to exploitation attempts on Sept. 22. These attempts focused on CVE-2021-40539,](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-40539)\nwhich allows for REST API authentication bypass with resultant remote code execution in vulnerable devices. To achieve this result, the actors\ndelivered uniquely crafted POST statements to the REST API LicenseMgr.\n\nWhile we lack insight into the totality of organizations that were exploited during this campaign, we believe that, globally, at least nine entities\nacross the technology, defense, healthcare, energy and education industries were compromised. Following successful exploitation, the actor\nuploaded a payload which deployed a Godzilla webshell, thereby enabling additional access to a victim network. The following leased IP\naddresses in the United States were observed interacting with compromised servers:\n\n24.64.36[.]238\n\n45.63.62[.]109\n\n45.76.173[.]103\n\n45.77.121[.]232\n\n66.42.98[.]156\n\n140.82.17[.]161\n\n149.28.93[.]184\n\n149.248.11[.]205\n\n199.188.59[.]192\n\nFollowing the deployment of the webshell, which appears consistent across all victims, we also identified the use of additional tools deployed in\na subset of compromised networks. Specifically, the actors deployed a custom variant of an open-source backdoor called NGLite and a\ncredential-harvesting tool we track as KdcSponge. The following sections provide detailed analysis of these tools.\n\n## Malware\n\nAt the time of exploitation, two different executables were saved to the compromised server: ME_ADManager.exe and ME_ADAudit.exe. The\nME_ADManager.exe file acts as a dropper Trojan that not only saves a Godzilla webshell to the system, but also installs and runs the other\nexecutable saved to the system, specifically ME_ADAudit.exe. The ME_ADAudit.exe executable is based on NGLite, which the threat actors\nuse as their payload to run commands on the system.\n\n### ME_ADManager.exe Dropper\n\nAfter initial exploitation, the dropper is saved to the following path:\n\nc:\\Users\\[username]\\AppData\\Roaming\\ADManager\\ME_ADManager.exe\n\nAnalysis of this file revealed that the author of this payload did not remove debug symbols when building the sample. Thus, the following\ndebug path exists within the sample and suggests the username pwn was used to create this payload:\n\nc:\\Users\\pwn\\documents\\visual studio 2015\\Projects\\payloaddll\\Release\\cmd.pdb\n\nUpon execution, the sample starts off by creating the following generic mutex found in many code examples freely available on the internet,\nwhich is meant to avoid running more than one instance of the dropper:\n\ncplusplus_me\n\nThe dropper then attempts to write a hardcoded Godzilla webshell, which we will provide a detailed analysis of later in this report, to the\nfollowing locations:\n\n../webapps/adssp/help/admin-guide/reports.jsp\n\nc:/ManageEngine/ADSelfService Plus/webapps/adssp/help/admin-guide/reports.jsp\n\n../webapps/adssp/selfservice/assets/fonts/lato/lato-regular.jsp\n\nc:/ManageEngine/ADSelfService Plus/webapps/adssp/selfservice/assets/fonts/lato/lato-regular.jsp\n\n\n-----\n\ne d oppe t e c eates t e o de % %\\ a age a d cop es tse to % %\\ a age \\ _ a age e e be o e\ncreating the following registry keys to persistently run after reboot:\n\nSoftware\\Microsoft\\Windows\\CurrentVersion\\Run\\ME_ADManager.exe : %APPDATA%\\ADManager\\ME_ADManager.exe\nSoftware\\Microsoft\\Windows\\CurrentVersion\\Run\\ME_ADAudit.exe : %SYSTEM32%\\ME_ADAudit.exe\nThe dropper then copies ADAudit.exe from the current directory to the following path and runs the file with WinExec:\n%SYSTEM32%\\ME_ADAudit.exe\n\nThe dropper does not write the ME_ADAudit.exe file to disk, meaning the threat actor must upload this file to the server prior to the execution\n[of the dropper, likely as part of the initial exploitation of the CVE-2021-40539 vulnerability. During our analysis of multiple incidents, we found](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-40539)\nthat the ME_ADAudit.exe sample maintained a consistent SHA256 hash of\n805b92787ca7833eef5e61e2df1310e4b6544955e812e60b5f834f904623fd9f, therefore suggesting that the actor deployed the same\ncustomized version of the NGLite backdoor against multiple targets.\n\nAs mentioned previously, the initial dropper contains a Java Server Page (JSP) webshell hardcoded within it. Upon analysis of the webshell, it\n[was determined to be the Chinese-language Godzilla webshell V3.00+. The Godzilla webshell was developed by user BeichenDream, who](https://github.com/BeichenDream/Godzilla/)\nstated they created this webshell because the ones available at the time would frequently be detected by security products during red team\nengagements. As such, the author advertises it will avoid detection by leveraging AES encryption for its network traffic and that it maintains a\nvery low static detection rate across security vendor products.\n\nFigure 1. Detections on VirusTotal for Godzilla webshells.\n\nIt’s no surprise that the Godzilla webshell has been adopted by regional threat groups during their intrusions, as it offers more functionality and\n[network evasion than other webshells used by the same groups, such as ChinaChopper.](https://unit42.paloaltonetworks.com/tag/china-chopper/)\n\nThe JSP webshell itself is fairly straightforward in terms of functionality and maintains a lightweight footprint. Its primary function is to parse an\nHTTP POST, decrypt the content with the secret key and then execute the payload. This allows attackers to keep code likely to be flagged as\nmalicious off the target system until they are ready to dynamically execute it.\n\nThe below image shows the initial part of the default JSP webshell as well as the decrypt function.\n\nFigure 2. Header of a default Godzilla JSP\n\nwebshell.\n\n\n-----\n\nO ote a e t e a ab es c a d pass t e st a d seco d es o t e code s o gu e ese a e t e a co po e ts t at c a ge\neach time an operator generates a new webshell, and the variables represent the secret key used for AES decryption within that webshell.\n\nWhen you generate the webshell manually, you specify a plaintext pass and key. By default, these are pass and key.\n\nFigure 3. Godzilla default webshell values.\n\nTo figure out how these are presented in the webshell itself, we can take a look at the Godzilla JAR file.\n\nBelow, you can see the code substitutes the strings in one of the embedded webshell templates under the\n/shells/cryptions/JavaAES/GenerateShellLoder function.\n\nFigure 4. GenerateShellLoder function in\n\nGenerate.class file.\nThus we know the xc variable in the webshell will be the AES secret key, as indicated in the template.\n\nString xc=\"{secretKey}\"; String pass=\"{pass}\"; String md5=md5(pass+xc);\n\nWe observed that the xc value appears to be a hash, and under the /core/shell/ShellEntity.class file, we can see the code takes the first 16\ncharacters of the MD5 hash for a plaintext secret key.\n\npublic String getSecretKeyX()\n{\n\nreturn functions.md5(getSecretKey()).substring(0, 16);\n\n}\n\nWith that, we know then that the xc value of 3c6e0b8a9c15224a is the first 16 characters of the MD5 hash for the word key.\n\nGiven this, the xc and pass variables are the two primary fields that can be used for tracking and attempting to map activity across incidents.\nFor the purpose of this blog, we generated a Godzilla webshell with the default options for analysis; however, the only differences between the\ndefault one and the ones observed in attacks are different xc and pass values.\n\nOne important characteristic of this webshell is that the author touts the lack of static detection and has tried to make this file not stand out\nthrough avoiding keywords or common structures that might be recognized by security product signatures. One particularly interesting static\nevasion technique is the use of a Java ternary conditional operator to indicate decryption.\n\nThe conditional here is m?1:2 – m is a boolean value passed to this function, as shown previously in Figure 2. If m is True, then the first\nexpression constant (1) is used. Otherwise, the second (2) is passed. Referring to the Java documentation, 1 is ENCRYPT_MODE, whereas 2\nis DECRYPT_MODE.\n\nFigure 5.\n\nJavaX crypto constants meaning.\nWhen the webshell executes this function x, it does not set the value of m, thus forcing m to False and setting it to decrypt.\n\n\n-----\n\nespo se get te () te(base6 code( (base6 ecode( toSt g()), t ue)));\n\nTo understand the capabilities of Godzilla then, we can take a look in /shells/payloads/java/JavaShell.class. This class file contains all of the\nfunctions provided to the operator. Below is an example of the getFile function.\n\nFigure 6. getFile function payload for Godzilla.\n\nPayload functions:\n\ngetFile\ndownloadFile\ngetBasicsInfo\nuploadFile\ncopyFile\ndeleteFile\nnewFile\nnewDir\ncurrentDir\ncurrentUserName\nbigFileUpload\nbigFileDownload\ngetFileSize\nexecCommand\ngetOsInfo\nmoveFile\ngetPayload\nfileRemoteDown\nsetFileAttr\n\nAs evidenced by the names of the functions, the Godzilla webshell offers numerous payloads for navigating remote systems, transferring data\nto and from, remote command execution and enumeration.\n\nThese payloads will be encrypted with the secret key previously described, and the operating software will send an HTTP POST to the\ncompromised system containing the data.\n\nAdditionally, if we examine the core/ui/component/dialog/ShellSetting.class file (shown below), the initAddShellValue() function contains the\ndefault configuration settings for remote network access. Therefore, elements such as static HTTP headers and User-Agent strings can be\nidentified in order to aid forensic efforts searching web access logs for potential compromise.\n\nprivate void initAddShellValue() {\n\nthis.shellContext = new ShellEntity();\n\nthis.urlTextField.setText(\"http://127.0.0.1/shell.jsp\");\nthis.passwordTextField.setText(\"pass\");\nthis.secretKeyTextField.setText(\"key\");\nthis.proxyHostTextField.setText(\"127.0.0.1\");\nthis.proxyPortTextField.setText(\"8888\");\nthis.connTimeOutTextField.setText(\"60000\");\nthis.readTimeOutTextField.setText(\"60000\");\nthis.remarkTextField.setText(\"??\");\nthis.headersTextArea.setText(\"User-Agent: Mozilla/5.0 (Windows NT\n10.0; Win64; x64; rv:84.0) Gecko/20100101 Firefox/84.0\\nAccept:\ntext/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8\\nAccept-Language:\nzh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2\\n\");\n\nthis.leftTextArea.setText(\"\");\nthis.rightTextArea.setText(\"\");\n\n}\n\nTo illustrate, below is a snippet of the web server access logs that show the initial exploit using the Curl application and sending the custom\nURL payload to trigger the CVE-2021-40539 vulnerability. It then shows the subsequent access of the Godzilla webshell, which has been\nplaced into the hardcoded paths by the initial dropper By reviewing the User-Agent we can determine that the time from exploit to initial\n\n\n-----\n\nebs e access too just o e ou utes o t e t eat acto\n\n- /./RestAPI/LicenseMgr \"-\" X.X.X.X Y.Y.Y.Y POST [00:00:00] - - 200 \"curl/7.68.0\"\n\n- /help/admin-guide/reports.jsp \"-\" X.X.X.X Y.Y.Y.Y POST [+00:04:07] - - 200 \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:84.0)\nGecko/20100101 Firefox/84.0\"\n\n## Custom NGLite\n\nNGLite is an open-source backdoor written in the Go language (specifically Go version 1.13). It is available for download from a public GitHub\nrepository. NGLite is a backdoor Trojan that is only capable of running commands received through its C2 channel. While the capabilities are\nstandard for a backdoor, NGLite uses a novel C2 channel that leverages a decentralized network based on the legitimate NKN to communicate\nbetween the backdoor and the actors.\n\nThe NKN touts that their decentralized network uses a public blockchain and can support communication between millions of peers, each of\nwhich are identified by a unique NKN address instead of the typical network identifiers, such as IP addresses. Therefore, the immediate IP\naddress that the NGLite tool communicates with in its C2 channel is just a peer in the decentralized network and is unlikely to represent the\nthreat actor’s network location. This design makes detection and prevention of the NGLite C2 communication channel difficult.\n\nFortunately, the use of NKN as a C2 channel is very uncommon. We have seen only 13 samples communicating with NKN altogether – nine\n[NGLite samples and four related to an open-source utility called Surge that uses NKN for file sharing. Eight of the nine known NGLite samples](https://github.com/rule110-io/surge)\nwere scanned by VirusTotal. Four were undetected, three were detected by one antivirus and the remaining sample was detected by five. This\nlow detection rate suggests that NGLite had very little antivirus coverage during this attack campaign.\n\nAs mentioned in the previous section, the dropper creates registry keys and executes a custom variant of the NGLite backdoor (SHA256:\n805b92787ca7833eef5e61e2df1310e4b6544955e812e60b5f834f904623fd9f) saved at the following path:\n\nC:\\Windows\\system32\\ME_ADAudit.exe\n\nThe data structures within the Go-based backdoor contain the following path, which is used to store the main source code for this custom\nvariant of NGLite on the developers’ system:\n\n/mnt/hgfs/CrossC2-2.2/src/ng.com/lprey/main.go\n\n[Based on this path, one might surmise that the actor used CrossC2 to build a cross platform Cobalt Strike C2 payload; however, we have no](https://github.com/gloxec/CrossC2/tree/v2.2/src)\nreason to believe that this payload is actually based on CrossC2, as the payload is a customized version of the publicly available NGLite\nbackdoor.\n\nIt is possible that the threat actors included the CrossC2 string in the path as a misdirection, hoping to confuse threat analysts into thinking\nthey are delivering a Cobalt Strike payload. We have seen the following NGLite samples using this same source code path dating back to Aug.\n11, which suggests that this threat actor has been using this tool for several months:\n\n3da8d1bfb8192f43cf5d9247035aa4445381d2d26bed981662e3db34824c71fd\n\n5b8c307c424e777972c0fa1322844d4d04e9eb200fe9532644888c4b6386d755\n\n3f868ac52916ebb6f6186ac20b20903f63bc8e9c460e2418f2b032a207d8f21d\n\nThe custom NGLite sample used in this campaign checks the command line arguments for g or group value. If this switch is not present, the\npayload will use the default string 7aa7ad1bfa9da581a7a04489896279517eef9357b81e406e3aee1a66101fe824 in what NGLite refers to as its\nseed identifier.\n\nThe payload will create what it refers to as a prey id, which is generated by concatenating the MAC address of the system network interface\ncard (NIC) and IPv4 address, with a hyphen (-) separating the two. This prey identifier will be used in the C2 communications.\n\nThe NGLite payload will use the NKN decentralized network for C2 communications. See the NKN client configuration in the sample below:\n\n\n-----\n\nFigure 7.\n\nEmbedded NKN client configuration.\nThe sample first starts by reaching out to seed.nkn[.]org over TCP/30003, specifically with an HTTP POST request that is structured as\nfollows:\n\nFigure 8. Initial\n\nNKN HTTP POST.It also will send HTTP POST requests with monitor_03 as the prey id, as seen in the following:\n\nFigure 9. HTTP\n\nPost containing “prey id.”\nThe seed.nkn[.]org server responds to this request with the [prey id (MAC-IPv4)] within the JSON structured as follows:\n\n{\"id\":\"nkn-sdk-go\",\"jsonrpc\":\"2.0\",\"result\":\n{\"addr\":\"66.115.12.89:30002\",\"id\":\"223b4f7f4588af02badaa6a83e402b33dea0ba8908e4cd6008f84c2b98a6a7de\",\"pubkey\":\"38ce48a2a3cffded7c2\n\nThis suggests the payload will communicate with the peer at 66.115.12.89 over TCP/30003. The seed.nkn[.]org server then responds to the\nmonitor_03 request with the following, which suggests the payload will communicate with 54.204.73.156 over TCP/30003:\n\n{\"id\":\"nkn-sdk-go\",\"jsonrpc\":\"2.0\",\"result\":\n{\"addr\":\"54.204.73.156:30002\",\"id\":\"517cb8112456e5d378b0de076e85e80afee3c483d18c30187730d15f18392ef9\",\"pubkey\":\"99bb5d3b9b609a31c\n\nAfter obtaining the response from seed.nkn[.]org, the payload will issue an HTTP GET request to the IP address and TCP port provided in the\naddr field within the JSON. These HTTP requests will appear as follows, but keep in mind that these systems are not actor-controlled; rather,\nthey are just the first peer in a chain of peers that will eventually return the actor’s content:\n\n\n-----\n\nFigure 10. NKN\n\npeering.Eventually, the network communications between the custom NGLite client and server are encrypted using AES with the following key:\nWHATswrongwithUu\n\nThe custom NGLite sample will start by sending the C2 an initial beacon that contains the result of the whoami command with the string\n#windows concatenated, as seen in the following:\n\n[username]#windows\n\nAfter sending the initial beacon, the NGLite sample will run a sub-function called Preylistener that creates a server that listens for inbound\nrequests. The sample will also listen for inbound communications and will attempt to decrypt them using a default AES key of\n1234567890987654. It will run the decrypted contents as a command via the Go method os/exec.Command. The results are then encrypted\nusing the same AES key and sent back to the requester.\n\n## Post-exploitation Activity\n\nUpon compromising a network, the threat actor moved quickly from their initial foothold to gain access to other systems on the target networks\nby running commands via their NGLite payload and the Godzilla webshell. After gaining access to the initial server, the actors focused their\nefforts on gathering and exfiltrating sensitive information from local domain controllers, such as the Active Directory database file (ntds.dit) and\nthe SYSTEM hive from the registry. Shortly after, we observed the threat actors installing the KdcSponge credential stealer, which we will\ndiscuss in detail next. Ultimately, the actor was interested in stealing credentials, maintaining access and gathering sensitive files from victim\nnetworks for exfiltration.\n\n### Credential Harvesting and KdcSponge\n\nDuring analysis, Unit 42 found logs that suggest the threat actors used PwDump and the built-in comsvcs.dll to create a mini dump of the\nlsass.exe process for credential theft; however, when the actor wished to steal credentials from a domain controller, they installed their custom\ntool that we track as KdcSponge.\n\nThe purpose of KdcSponge is to hook API functions from within the LSASS process to steal credentials from inbound attempts to authenticate\nvia the Kerberos service (“KDC Service”). KdcSponge will capture the domain name, username and password to a file on the system that the\nthreat actor would then exfiltrate manually through existing access to the server.\n\nWe know of two KdcSponge samples, both of which were named user64.dll. They had the following SHA256 hashes:\n\n3c90df0e02cc9b1cf1a86f9d7e6f777366c5748bd3cf4070b49460b48b4d4090\n\nb4162f039172dcb85ca4b85c99dd77beb70743ffd2e6f9e0ba78531945577665\n\nTo launch the KdcSponge credential stealer, the threat actor will run the following command to load and execute the malicious module:\n\nregsvr32 /s user64.dll\n\nUpon first execution, the regsvr32 application runs the DllRegisterServer function exported by user64.dll. The DllRegisterServer function\nresolves the SetSfcFileException function within sfc_os.dll and attempts to disable Windows File Protection (WFP) on the\nc:\\windows\\system32\\kdcsvc.dll file. It then attempts to inject itself into the running lsass.exe process by:\n\n1. Opening the lsass.exe process using OpenProcess.\n\n2. Allocating memory in the remote process using VirtualAllocEx.\n\n3. Writing the string user64.dll to the allocated memory using WriteProcessMemory.\n\n4. Calling LoadLibraryA within the lsass.exe process with user64.dll as the argument, using RtlCreateUserThread.\n\nNow that user64.dll is running within the lsass.exe process, it will start by creating the following registry key to establish persistence through\nsystem reboots:\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnce\\KDC Service : regsvr32 /s user64.dll\n\nFrom there, the sample will check to make sure the system is running a Kerberos service by attempting to obtain a handle to one of the\nfollowing modules:\n\n\n-----\n\ndcs c d\nkdccli.dll\nKdcsvs.dll\n\nKdcSponge tries to locate three undocumented API functions – specifically KdcVerifyEncryptedTimeStamp, KerbHashPasswordEx3 and\nKerbFreeKey – using the following three methods:\n\n1. Identifies the version of Kerberos module and uses hardcoded offsets to API functions to hook.\n2. Reaches out to Microsoft’s symbol server to find the offset to API functions within Kerberos module and confirms the correct functions by\n\ncomparing to hardcoded byte sequences.\n3. Searches the Kerberos module for hardcoded byte sequences.\n\nThe primary method in which KdcSponge locates the API functions to hook is based on determining the version of the Kerberos module based\non the TimeDateStamp value within the IMAGE_FILE_HEADER section of the portable executable (PE) file. Once the version of the Kerberos\nmodule is determined, KdcSponge has hardcoded offsets that it will use to hook the appropriate functions within that version of the module.\nKdcSponge looks for the following TimeDateStamp values:\n\n2005-12-14 01:24:41\n2049-10-09 00:46:34\n2021-04-08 07:30:26\n2021-03-04 04:59:27\n2020-03-13 03:20:15\n2020-02-19 07:55:57\n2019-12-19 04:15:06\n2019-07-09 03:15:04\n2019-05-31 06:02:30\n2018-10-10 07:46:08\n2018-02-12 21:47:29\n2017-03-04 06:27:32\n2016-10-15 03:52:20\n2020-11-26 03:04:23\n2020-06-05 16:15:22\n2017-10-14 07:22:03\n2017-03-30 19:53:59\n2013-09-04 05:49:27\n2012-07-26 00:01:13\n\nIf KdcSponge was unable to determine the version of the Kerberos module and the domain controller is running Windows Server 2016 or\nServer 2019 (major version 10), the payload will reach out to Microsoft's symbol server (msdl.microsoft.com) in an attempt to find the location\nof several undocumented API functions. The sample will issue an HTTPS GET request to a URL structured as follows, with the GUID portion\nof the URL being the GUID value from the RSDS structure in the IMAGE_DEBUG_TYPE_CODEVIEW section of the PE:\n\n/download/symbols/[library name].pdb/[GUID]/[library name].pdb\n\nThe sample will save the results to a file in the following location, again with the GUID for the filename being the GUID value from the RSDS\nstructure in the IMAGE_DEBUG_TYPE_CODEVIEW section:\n\nALLUSERPROFILE\\Microsoft\\Windows\\Caches\\[GUID].db:\n\nAs mentioned above, we believe the reason the code reaches out to the symbol server is to find the locations of three undocumented\nKerberos-related functions: KdcVerifyEncryptedTimeStamp, KerbHashPasswordEx3 and KerbFreeKey. The sample is primarily looking for\nthese functions in the following libraries:\n\nkdcsvc.KdcVerifyEncryptedTimeStamp\nkdcsvc.KerbHashPasswordEx3\nkdcpw.KerbHashPasswordEx3\nkdcsvc.KerbFreeKey\nkdcpw.KerbFreeKey\n\nIf these functions are found, the sample searches for specific byte sequences, as seen in Table 1, to confirm the functions are correct and to\nvalidate they have not been modified.\n\n**Function** **Hex bytes**\n\nkdcsvc.KdcVerifyEncryptedTimeStamp 48 89 5c 24 20 55 56 57 41 54 41 55 41 56 41 57 48 8d 6c 24 f0 48 81 ec 10 01 00 00 48 8b 05 a5\n\nkdcsvc.KerbHashPasswordEx3 48 89 5c 24 08 48 89 74 24 10 48 89 7c 24 18 55 41 56 41 57 48 8b ec 48 83 ec 50 48 8b da 48\n8b\n\n\n-----\n\nkdcpw.KerbHashPasswordEx3 48 89 5c 24 08 48 89 74 24 10 48 89 7c 24 18 55 41 56 41 57 48 8b ec 48 83 ec 50 48 8b da 48\n8b\n\nkdcpw.KerbFreeKey 48 89 5c 24 08 57 48 83 ec 20 48 8b d9 33 c0 8b 49 10 48 8b 7b 18 f3 aa 48 8b 4b 18 ff 15 72 19\n\nkdcsvc.KerbFreeKey 48 89 5c 24 08 57 48 83 ec 20 48 8b 79 18 48 8b d9 48 85 ff 0f 85 00 c5 01 00 33 c0 48 89 03 48\n\nTable 1. Undocumented functions and byte sequences used by KdcSponge to confirm the correct functions for Windows major version 10.\n\nIf the domain controller is running Windows Server 2008 or Server 2012 (major version 6), KdcSponge does not reach out to the symbol server\nand instead will search the entire kdcsvc.dll module for the byte sequences listed in Table 2 to find the API functions.\n\n**Function** **Hex bytes**\n\nkdcsvc.KdcVerifyEncryptedTimeStamp 48 89 5C 24 20 55 56 57 41 54 41 55 41 56 41 57 48 8D 6C 24 F9 48 81 EC C0 00 00 00 48 8B\n\nkdcsvc.KerbHashPasswordEx3 48 89 5C 24 08 48 89 74 24 10 48 89 7C 24 18 55 41 56 41 57 48 8B EC 48 83 EC 40 48 8B F1\n\nkdcsvc.KerbFreeKey 40 53 48 83 EC 20 48 8B D9 48 8B 49 10 48 85 C9 0F 85 B4 B9 01 00 33 C0 48 89 03 48 89 43\n\nTable 2. Undocumented functions and byte sequences used by KdcSponge to locate the sought after functions.\n\nOnce the KdcVerifyEncryptedTimeStamp, KerbHashPasswordEx3 and KerbFreeKey functions are found, the sample will attempt to hook these\nfunctions to monitor all calls to them with the intention to steal credentials. When a request to authenticate to the domain controller comes in,\nthese functions in the Kerberos service (KDC service) are called, and the sample will capture the inbound credentials. The credentials are then\nwritten to disk at the following location:\n\n%ALLUSERPROFILE%\\Microsoft\\Windows\\Caches\\system.dat\n\nThe stolen credentials are encrypted with a single-byte XOR algorithm using 0x55 as the key and written to the system.dat file one per line in\nthe following structure:\n\n[<timestamp>]<domain><username> <cleartext password>\n\n## Attribution\n\nWhile attribution is still ongoing and we have been unable to validate the actor behind the campaign, we did observe some correlations\n[between the tactics and tooling used in the cases we analyzed and Threat Group 3390 (TG-3390, Emissary Panda, APT27).](https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-government-sharepoint-servers/)\n\n[Specifically, as documented by SecureWorks in an article on a previous TG-3390 operation, we can see that TG-3390 similarly used web](https://www.secureworks.com/research/threat-group-3390-targets-organizations-for-cyberespionage)\nexploitation and another popular Chinese webshell called ChinaChopper for their initial footholds before leveraging legitimate stolen\ncredentials for lateral movement and attacks on a domain controller. While the webshells and exploits differ, once the actors achieved access\ninto the environment, we noted an overlap in some of their exfiltration tooling.\n\nSecureWorks stated the actors were using WinRar masquerading as a different application to split data into RAR archives within the Recycler\ndirectory. They provided the following snippet from a Batch file deployed to do this work:\n\n@echo off\n\nc:\\windows\\temp\\svchost.exe a -k -r -s -m5 -v1024000 -padmin-windows2014 “e:\\recycler\\REDACTED.rar” “e:\\ProgramData\\REDACTED\\”\n\nExit\n\nFrom our analysis of recent attacks on ManageEngine ADSelfService Plus, we observed the same technique – with the same order and\nplacement of the parameters passed to a renamed WinRar application.\n\n@echo off\n\ndir %~dp0>>%~dp0\\log.txt\n\n%~dp0\\vmtools.exe a -k -r -s -m5 -v4096000 -pREDACTED \"e:\\$RECYCLE.BIN\\REDACTED.rar\" \"E:\\Programs\\REDACTED\\REDACTED\"\n\nOnce the files had been staged, in both cases they were then made accessible on externally facing web servers. The threat actors would then\ndownload them through direct HTTP GET requests.\n\n## Conclusion\n\nIn September 2021, Unit 42 observed an attack campaign in which the actors gained initial access to targeted organizations by exploiting a\nrecently patched vulnerability in Zoho’s ManageEngine product, ADSelfService Plus, tracked in CVE-2021-40539. At least nine entities across\nthe technology, defense, healthcare, energy and education industries were compromised in this attack campaign.\n\nAfter exploitation, the threat actor quickly moved laterally through the network and deployed several tools to run commands in order to carry\nout their post-exploitation activities. The actor heavily relies on the Godzilla webshell, uploading several variations of the open-source webshell\nto the compromised server over the course of the operation. Several other tools have novel characteristics or have not been publicly discussed\n\n\n-----\n\nas be g used p e ous attac s, spec ca y t e G te bac doo a d t e dcSpo ge stea e o sta ce, t e G te bac doo uses a\nnovel C2 channel involving the decentralized network known as the NKN, while the KdcSponge stealer hooks undocumented functions to\nharvest credentials from inbound Kerberos authentication attempts to the domain controller.\n\nUnit 42 believes that the actor’s primary goal involved gaining persistent access to the network and the gathering and exfiltration of sensitive\ndocuments from the compromised organization. The threat actor gathered sensitive files to a staging directory and created password-protected\nmulti-volume RAR archives in the Recycler folder. The actor exfiltrated the files by directly downloading the individual RAR archives from\nexternally facing web servers.\n\nThe following coverages across the Palo Alto Networks platform pertain to this incident:\n\nThreat Prevention signature ZOHO corp ManageEngine Improper Authentication Vulnerability was released on Sept. 20 as threat ID\n91676.\nNGLite backdoor is blocked by Cortex XDR’s local analysis.\n[All known samples (Dropper, NGLite, KdcSponge) are classified as malware in WildFire.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nCortex Xpanse can accurately identify Zoho ManageEngine ADSelfServicePlus, ManageEngine Desktop Central, or ManageEngine\nServiceDeskPlus Servers across customer networks.\n\n[If you think you may have been impacted, please email unit42-investigations@paloaltonetworks.com or call (866) 486-4842 – (866) 4-UNIT42](http://10.10.0.46/mailto:unit42-investigations@paloaltonetworks.com)\n– for U.S. toll free, (31-20) 299-3130 in EMEA or (65) 6983-8730 in JAPAC. The [Unit 42 Incident Response team is available 24/7/365.](https://www.paloaltonetworks.com/cortex/incident-response)\n\nSpecial thanks to Unit 42 Consulting Services and the NSA Cybersecurity Collaboration Center for their partnership, collaboration and insights\noffered in support of this research.\n\nPalo Alto Networks has shared these findings, including file samples and indicators of compromise, with our fellow Cyber Threat Alliance\nmembers. CTA members use this intelligence to rapidly deploy protections to their customers and to systematically disrupt malicious cyber\n[actors. Learn more about the Cyber Threat Alliance.](http://www.cyberthreatalliance.org/)\n\n### Indicators of Compromise\n\n**Dropper SHA256**\n\nb2a29d99a1657140f4e254221d8666a736160ce960d06557778318e0d1b7423b\n\n5fcc9f3b514b853e8e9077ed4940538aba7b3044edbba28ca92ed37199292058\n\n**NGLite SHA256**\n\n805b92787ca7833eef5e61e2df1310e4b6544955e812e60b5f834f904623fd9f\n\n3da8d1bfb8192f43cf5d9247035aa4445381d2d26bed981662e3db34824c71fd\n\n5b8c307c424e777972c0fa1322844d4d04e9eb200fe9532644888c4b6386d755\n\n3f868ac52916ebb6f6186ac20b20903f63bc8e9c460e2418f2b032a207d8f21d\n\n**Godzilla Webshell SHA256**\n\na44a5e8e65266611d5845d88b43c9e4a9d84fe074fd18f48b50fb837fa6e429d\n\nce310ab611895db1767877bd1f635ee3c4350d6e17ea28f8d100313f62b87382\n\n75574959bbdad4b4ac7b16906cd8f1fd855d2a7df8e63905ab18540e2d6f1600\n\n5475aec3b9837b514367c89d8362a9d524bfa02e75b85b401025588839a40bcb\n\n**KdcSponge SHA256**\n\n3c90df0e02cc9b1cf1a86f9d7e6f777366c5748bd3cf4070b49460b48b4d4090\n\nb4162f039172dcb85ca4b85c99dd77beb70743ffd2e6f9e0ba78531945577665\n\n**Threat Actor IP Addresses**\n\n24.64.36[.]238\n\n45.63.62[.]109\n\n45.76.173[.]103\n\n45.77.121[.]232\n\n66.42.98[.]156\n\n140.82.17[.]161\n\n149.28.93[.]184\n\n149.248.11[.]205\n\n199.188.59[.]192\n\n**Registry Keys**\n\n\n-----\n\nSo t a e\\ c oso t\\ do s\\Cu e t e s o \\ u \\ _ a age e e\nSoftware\\Microsoft\\Windows\\CurrentVersion\\Run\\ME_ADAudit.exe\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnce\\KDC Service\n\n## Additional Resources\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-07 - Targeted Attack Campaign Against ManageEngine ADSelfService Plus Delivers Godzilla Webshells, NGLite Trojan and KdcSponge Stealer.pdf"
    ],
    "report_names": [
        "2021-11-07 - Targeted Attack Campaign Against ManageEngine ADSelfService Plus Delivers Godzilla Webshells, NGLite Trojan and KdcSponge Stealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0a80df4d-5ab7-4ca3-809d-8ef7b5a54f1f",
            "created_at": "2023-11-21T02:00:07.386886Z",
            "updated_at": "2025-03-27T02:00:03.248375Z",
            "deleted_at": null,
            "main_name": "TiltedTemple",
            "aliases": [
                "DEV-0322",
                "Circle Typhoon"
            ],
            "source_name": "MISPGALAXY:TiltedTemple",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536141,
    "ts_updated_at": 1743041745,
    "ts_creation_date": 1653698195,
    "ts_modification_date": 1653698195,
    "files": {
        "pdf": "https://archive.orkl.eu/3e6e46b30e46567b378036fac63462980a659038.pdf",
        "text": "https://archive.orkl.eu/3e6e46b30e46567b378036fac63462980a659038.txt",
        "img": "https://archive.orkl.eu/3e6e46b30e46567b378036fac63462980a659038.jpg"
    }
}