{
    "id": "07531f5d-e0d1-4c9d-a9eb-a77ddd09b16e",
    "created_at": "2022-10-25T16:48:11.764064Z",
    "updated_at": "2025-03-27T02:17:11.699303Z",
    "deleted_at": null,
    "sha1_hash": "802cfc799eb72c9b5e40ca56e724c75b1fa10be8",
    "title": "Belling the BEAR",
    "authors": "ThreatConnect",
    "file_creation_date": "2016-10-19T13:46:23Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1687609,
    "plain_text": "**threatconnect.com/blog/russia-hacks-bellingcat-mh17-investigation/**\n\nThreatConnect Research Team 9/28/2016\n\n## ThreatConnect reviews activity targeting Bellingcat, a key contributor in the MH17 investigation.\n\n_Read the full series of ThreatConnect posts following the DNC Breach: “Rebooting Watergate: Tapping into the Democratic_\n_[National Committee”, “Shiny Object? Guccifer 2.0 and the DNC Breach“, “What’s in a Name Server?“, “Guccifer 2.0: the Man,](https://www.threatconnect.com/guccifer-2-0-dnc-breach/)_\n_[the Myth, the Legend?“, “Guccifer 2.0: All Roads Lead to Russia](https://www.threatconnect.com/guccifer-2-all-roads-lead-russia/)_ _[“, “FANCY BEAR Has an (IT) Itch that They Can’t Scratch](https://www.threatconnect.com/fancy-bear-it-itch-they-cant-scratch/)_ _“,_\n_[“Does a BEAR Leak in the Woods?“, and “Russian Cyber Operations on Steroids“.](https://www.threatconnect.com/blog/does-a-bear-leak-in-the-woods/)_\n\n##### [UPDATE] October 7th 2016\n\nIntroduction\n\n[Since posting about the DNC hack, each time we published a blog post on a BEAR-based topic we thought it was going to be](https://threatconnect.com/blog/tapping-into-democratic-national-committee/)\nour last. But like the Death Star’s gravitational pull, the story keeps drawing us back in as new information comes to light.\n[Following our post on DCLeaks as a Russian influence operation](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/) [, Bellingcat founder Eliot Higgins reached out to us. Bellingcat,](https://www.bellingcat.com/)\na group of citizen investigative journalists, has published articles critical of Russia and has been a key contributor to the\n[international investigation of the shootdown of Malaysian Airlines Flight 17 (MH17) over Ukraine in 2014.](https://en.wikipedia.org/wiki/Malaysia_Airlines_Flight_17)\n\nHiggins shared data with ThreatConnect that indicates Bellingcat has come under sustained targeting by Russian threat actors,\nwhich allowed us to identify a 2015 spearphishing campaign that is consistent with FANCY BEAR’s tactics, techniques, and\nprocedures. We also analyzed a February 2016 attack by CyberBerkut — a group claiming to be pro-Russian Ukrainian\n[hacktivists but also a suspected front for Moscow — against Russia-based Bellingcat contributor Ruslan Leviev, where](https://twitter.com/RuslanLeviev)\nCyberBerkut defaced the Bellingcat website and leaked Leviev’s personal details. As evidenced by these efforts and the attack\non the World Anti-Doping Agency, organizations that negatively impact Russia’s image can expect Russian cyber operations\n[intended to retaliate publicly or privately, influence, or otherwise maliciously affect them. The Diamond Model below](http://www.activeresponse.org/the-diamond-model/)\nsummarizes the activity that Bellingcat experienced.\n\n\n-----\n\n##### Bellingcat Background\n\nBellingcat is a group of citizen investigative journalists — [named after a classic fable — that uses open source information,](https://en.wikipedia.org/wiki/Belling_the_cat)\nsuch as photos and videos posted on social media, maps, and publicly available satellite imagery. Bellingcat articles have\nfocused on a variety of current events in Africa, the Middle East, the U.S., and Europe with a specific focus on notable conflicts\nrelated to Syria, Ukraine, and Russia.\n\nBellingcat published its first post on July 5, 2014, and for the next twelve days focused mainly on the ongoing Syrian civil war,\ncovering developments such as the use of chemical weapons, but also occasionally pointing out Russian involvement. On July\n17, 2014, Malaysian Airlines Flight 17 crashed in pro-Russian rebel territory in eastern Ukraine and Bellingcat released their\n[first post on the topic. Over the next two years, Bellingcat would publish no fewer than 92 posts from at least 8](https://www.bellingcat.com/resources/case-studies/2014/07/17/geolocating-the-missile-launcher-linked-to-the-downing-of-mh17/) [contributors](https://www.bellingcat.com/contributors/)\nfocused on Russian involvement in the downing of MH17, using open source information and imagery to prove the presence of\nthe Russian military in eastern Ukraine and that a Russian-supplied Buk missile launcher shot down MH17 from pro-Russian\nrebel territory. The Kremlin vehemently denies this.\n\n[The Dutch took the lead in the criminal investigation through an international Joint Investigation Team (JIT)](https://www.om.nl/onderwerpen/mh17-crash/) and officially\nconsidered Bellingcat’s reporting in their investigation. Founder Eliot Higgins was included as an official witness. The Dutch\n[Safety Board ultimately found MH17 was shot down by a Russian-made surface-to-air missile but declined to assign blame for](https://www.washingtonpost.com/news/worldviews/wp/2015/10/13/a-dutch-report-will-say-what-downed-mh17-it-wont-blame-the-russians/)\n[who was responsible for the launch. On September 28, the JIT is due to release the results of their criminal investigation.](http://www.nltimes.nl/2016/08/22/mh17-dutch-criminal-investigation-results-ready-sept-28/)\n\nCompromising Bellingcat contributors could provide Russian intelligence services with journalists’ contacts and sources,\npersonal information, insight into future reporting perceived as indemnifying Russia, as well as sensitive personal information.\nSuch collection could facilitate influence operations and retaliation efforts against Bellingcat, or access that could be leveraged\nfor follow-on operations. Compromising Bellingcat contributors’ accounts could also provide access to communications with the\nJIT offering a glimpse at how the investigation of the downing of MH17 was proceeding\n\n\n-----\n\n_Timeline_\n\nThe timeline below summarizes the notable dates related to the MH17 crash and investigation, Bellingcat’s articles related to\nthose events, and the malicious activity targeting Bellingcat and Leviev. It’s important to note we do not have complete insight\ninto all of the malicious activity that may have targeted Bellingcat during this timeframe.\n\n_FANCY BEAR_\n\nFrom February 2015 to July 2016 three researchers at Bellingcat — Higgins, Aric Toler, and Veli-Peka Kivimaki — who had\ncontributed MH17 articles received numerous spearphishing emails, with Higgins alone receiving at least 16 phishing emails\ntargeting his personal email account. A majority of the campaign took place from February to September 2015, with some\nactivity resuming in May 2016. These spearphishing attempts consist of a variety of spoofed Gmail security notices alerting the\ntarget that suspicious activity was detected on their account. The target is prompted to click a URL resembling a legitimate\nGmail security link to review the details of this suspicious activity. Below are screenshots of some of the spearphishing email\ntargeting Bellingcat researchers.\n\n\n-----\n\n-----\n\n-----\n\nThe attackers used several methods to redirect the target to credential harvesting pages. In at least 21 of the emails, the URL\nredirects the victim to a shortened Bitly URL. These shortened Bitly links, in turn, direct the victim to another Google-spoofing\n[URL appended with the base64 encoded target email and name. One of the emails used a shortened TINYCC URL to achieve](https://en.wikipedia.org/wiki/Base64)\nthe same effect. In four of the other emails, the security links direct the target to a Google Sites page that spoofs a Google login\npage. Once the target visits the Bitly, TINYCC, or Google Sites URLs, they are prompted to enter their Google credentials,\nwhich would then be captured by the threat actors.\n\nThe specifically crafted URLs with target-specific strings are consistent with a FANCY BEAR technique highlighted in Dell\n[Secureworks research and employed against a DNC staffer whose files were leaked on DCLeaks. Reviewing the click](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\ninformation for the Bitly links, we identified that at least three of the Bitly URLs targeting the same Bellingcat individual were\naccessed in the timeframe consistent with the spearphishing attack. This suggests the individual clicked on the links in three of\nthe spearphishing messages, but Bellingcat confirms that no credentials were supplied to these pages.\n\n\n-----\n\nOther consistencies with Russia and FANCY BEAR activity were also identified. In early May and again in mid-June 2016 the\nBellingcat contributor Aric Toler’s personal email address was targeted by FANCY BEAR. Using ThreatConnect’s Email Import\nfunction, we are able to identify that both messages abused Moscow-based Yandex email services to send malicious emails to\nthe researcher. In the May phishing example FANCY BEAR used the Yandex account berg01berg01@yandex[.]com.\n\nIn the June 2016 example, Toler was targeted with a message that used hellomail1@yandex[.]com in a [manner consistent with](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\nh Bill Ri h t t t d i t t t f hi l G il b i t d t DCL k\n\n\n-----\n\nBy analyzing the email headers provided by Bellingcat, we identified domains and corresponding IP addresses that the\nattackers leveraged as part of the spearphishing operation. The table below also shows the registrant for the domain, the\ncreation date for the WHOIS record, and the name server the domain used during the attack timeframe.\n\n**Spearphishing Domain** **Mailserver IP** **Domain Registrant** **Domain Create Date** **Name Server During Attack**\n\n**Domain**\n\n**Create** **Name Server During**\n\n**Spearphishing Domain** **Mailserver IP** **Domain Registrant** **Date** **Attack**\n\nmxx.evrosatory[.]com 46.22.208.204 andre_roy@mail.com 2/13/14 Carbon2u.com\n\naccounts.servicegoogle[.]com 155.254.36.155 theforeignnews@gmail.com 5/22/15 Cata501836.earth.orderboxdns.com\n\n\nmxx.us-westmailundeliversystem[.]com\n\n\n46.22.208.204 andre_roy@mail.com 2/28/14 Carbon2u.com\n\n\nmx1.servicetransfermail[.]com 95.153.32.53 theforeignnews@gmail.com 6/3/15 Cata501836.earth.orderboxdns.com\n\naccounts.google.com.rnil[.]am 198.105.122.187 Private 7/7/14 Carbon2u.com\n\nmx6.set132[.]com 198.105.122.187 emmer.brown@mail.com 9/30/14 Carbon2u.com\n\nserver.mx4.set132[.]com 46.22.208.204 emmer.brown@mail.com 9/30/14 Carbon2u.com\n\n\n-----\n\n[infrastructure that German Intelligence (BvF) established as FANCY BEAR within Cyber Brief Nr. 01/2016.](https://www.verfassungsschutz.de/download/broschuere-2016-03-bfv-cyber-brief-2016-01.pdf)\n\n[FANCY BEAR also previously used both the Cata501836 and Carbon2u name servers to host infrastructure and email](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\n[addresses from 1&1’s mail.com to register domains. We were able to identify further overlaps with other FANCY BEAR](https://threatconnect.com/blog/fancy-bear-it-itch-they-cant-scratch/)\ninfrastructure by pivoting off of these indicators, which we will describe in a later blog post. Based on these consistencies, we\nassess FANCY BEAR almost certainly is behind the spearphishing and credential harvesting campaign targeting Eliot Higgins\nand other Bellingcat researchers.\n\n_CyberBerkut Activity_\n\n[CyberBerkut describes itself as a group of pro-Russian Ukrainian hacktivists. They borrow the “ Berkut” name from the now](https://en.wikipedia.org/wiki/Berkut_(special_police_force))\n[disbanded Ukrainian riot police who responded brutally to the 2014 EuroMaidan demonstrations in Kiev. CyberBerkut runs a](https://www.netflix.com/title/80031666)\n[digitally-fueled, aggressive, active measures campaign directed against a pro-western government in Kiev and points of](https://en.wikipedia.org/wiki/Active_measures)\nwestern influence — such as NATO — in eastern Europe.\n\nCyberBerkut has conducted attacks across a spectrum of technical sophistication including distributed denial of service attacks\n[(DDOS), disrupting and degrading the networks of Ukraine’s Central Election Commission during the 2014 election, hacking](https://ccdcoe.org/sites/default/files/multimedia/pdf/CyberWarinPerspective_full_book.pdf)\nUkrainian billboards and displaying pro-Russian messages, conducting computer network exploitation and strategic leaks of\n[emails and documents, and leaking intercepted phone calls between high ranking Ukrainian officials. This range suggests](https://www.youtube.com/watch?v=Wkicw3EolCg)\nhighly capable actors are behind CyberBerkut and they employ a high degree of operational planning when considering the\noffensive use of information and their effects.\n\n[CyberBerkut defaced the Bellingcat webpage on February 10, 2016, claiming credit for the attack and singling out Ruslan](https://twitter.com/bellingcat/status/697334674029412353)\nLeviev, a Russian opposition blogger and Bellingcat contributor.\n\n[Leviev published a compelling piece of citizen journalism on May 22, 2015 exploring the fate of Russian Spetsnaz soldiers](https://www.bellingcat.com/news/uk-and-europe/2015/05/22/three-graves/)\nbelieved to have been killed in combat operations within Ukraine earlier that month. According to Bellingcat founder Higgins,\nL i ’ t ib t t i d d d t t th C b B k t I il i t i L i\n\n\n-----\n\n_y_ _,_ _y_ _,_ _,_ _g,_\n_password, not a word, from various letters, numbers, and special symbols. Plus there was a telephone number bound to the_\n_account for second factor authentication._\n\n_Exactly how it was hacked — I don’t know._\n\n1. _Either they as employees, or with their active assistance, intercepted the SMS authentication code._\n\n2. _Or they, again, as an officer from the authorities or with their active assistance, gained direct access to the Yandex Mail_\n\n_servers where they seized the email from my old inbox._\n\n3. _Or they know about a vulnerability in Yandex email that nearly nobody else knows about._\n\n_Having seized the old email inbox, they used the password recovery mechanism for LiveJournal. My LiveJournal account (which_\n_I have not used for a long time) was connected to my old email address, but LiveJournal does not provide second factor_\n_authentication. Via password recovery of my LiveJournal from my stolen email, they took over my LiveJournal account and_\n_made a post._\n\n_In the same stolen email account, they found my username and password for my account at Bellingcat (I had once published an_\n_investigation directly on the Bellingcat website) and they published a post there in my name._\n\n_At the same time, my icloud account was not setup for second factor authentication, and was connected only to my old email_\n_address for password recovery, it was also taken over. They performed a password recovery via my stolen email address for_\n_icloud, logged in, but I received a notification on my iPhone about it, and I quickly cut off their access, but they were able to_\n_download some photos._\n\n_They also tried to hack my Facebook and Twitter. They were unable to crack Facebook, because I had second factor_\n_authentication and always need to enter the code generated by the Facebook app. They were able to login to Twitter and_\n_change the password but nothing was deleted and they didn’t tweet anything. I restored the password._\n\n_Based on all the data, I assume that, as in the case of Alburovym, Kozlovsky, Parkhomenko, this was the activity of security_\n_services who intercepted the SMS containing the access code. So they got access to my old email account and they also_\n_gained access to my Twitter account (which was also under two-factor, but code is sent via SMS rather than generated in an_\n_app)._\n\n_Of my social networks where two-factor codes are generated via an application, they were unable to crack. Of my social_\n_networks where the two-factor code was sent via SMS, they were able to crack._\n\nLeviev suggests the attackers had direct access to Yandex mail servers or were able to intercept the SMS message used for\ntwo factor authentication to compromise his old Yandex email account. Leviev goes on to describe that the actors then used\nemails from that old account to compromise his iCloud account and access pictures and other information saved from Leviev’s\nphone to iCloud. Some of this information was ultimately put in a February 24, 2016 post on CyberBerkut’s website that\ncontained sensitive details of Leviev’s personal life, such as his pictures, phone number, address, passport scan, girlfriend’s\nname, and dating and sexual preferences.\n\nThese attacks were an overt attempt to discredit Bellingcat research and Leviev, but also carried a message to others who\npublicly voice positions critical of Moscow that this form of journalism does not go unnoticed. We also found it interesting how\nmuch effort was expended and the degree of sources and methods exposed to achieve a simple defacement. We do not know\nwhether the attackers intercepted Leviev’s SMS-based two-factor authentication or had direct access to Yandex mail servers,\nbut either tactic is more suggestive of a state-backed actor as opposed to independent hacktivists.\n\n##### CyberBerkut and FANCY BEAR: Not the Same, But Showing Up to the Same Party\n\nThroughout our research, we have focused on FANCY BEAR, an advanced persistent threat (APT) group assessed to be\nRussian government. CyberBerkut, on the other hand, was a referential data point when we looked at precedence for pro[Russian proxies interfering with elections. CrowdStrike assessed in its 2015 Global Threat Report “there are indications that](https://go.crowdstrike.com/rs/281-OBQ-266/images/15GlobalThreatReport.pdf)\nCyberBerkut has ties to Russian state security,” but the degree of Russian government control over the group is disputed.\n\n\n-----\n\nconcerted FANCY BEAR spearphishing efforts over a six month timeframe in 2015 shows Moscow s clear intent to compromise\nBellingcat, most likely due to their posts on key current events involving Russia. This activity was followed by a hard stop and\nthen additional targeted efforts by CyberBerkut in early 2016, which was in-turn followed by additional FANCY BEAR\nspearphishing from May to July 2016. A key assumption underlying any assessment about how these activities are related\nstems from how an analyst assesses the motives for targeting Leviev.\n\nWe came up with two scenarios:\n\n_Stronger/Closer Coordination Between FANCY BEAR and CyberBerkut. In this scenario, the activities against Bellingcat are_\ncoordinated with these two entities handing off operations. The timing suggests that the state actors, looking to compromise\nBellingcat, pivoted to a more aggressive attack against Leviev when the initial spearphishing campaign failed to yield the\ndesired results. Leviev is targeted more aggressively as a means to get at Bellingcat and since he lives in Russia, state actors\nwould have additional tools in their kit to intercept his SMS two-factor authentication messages or gain direct access to\nYandex’s mail servers. In this scenario, CyberBerkut functions as much as a strategic messaging outlet as the actual attacker\nand is subject to a much greater degree of direction and control from Moscow than previously assessed.\n\n_The Common Enemies Approach: Weaker/Less Coordination Between FANCY BEAR and CyberBerkut. In this scenario, the_\nspearphishing campaigns conducted by FANCY BEAR are distinct in purpose and perpetrator from the CyberBerkut attack\nagainst Leviev. The spearphishing campaigns are more focused on Bellingcat’s coverage of the MH17 shootdown and\ninvolvement in the JIT investigation. CyberBerkut targets Leviev separately after his coverage of Russian military involvement\nin eastern Ukraine with some assistance from supportive friends in Moscow to compromise his Yandex account. Targeting\nLeviev is less about a broader compromise of Bellingcat and more about harassing one journalist. In this scenario, CyberBerkut\nis advancing Moscow’s interests and can call on the Russian intelligence services, but is still a distinct group.\n\n##### Leak Sites Leaking Over\n\nWe looked to see if we could identify other overlaps between FANCY BEAR and CyberBerkut that would help us assess which\nof these two scenarios was more likely. Through our research into the Bellingcat activity, we found some surprising content\noverlaps with DCLeaks — another assessed Russian influence outlet — and a CyberBerkut pattern of registering infrastructure\nthat FANCY BEAR also uses. These developments move the needle slightly towards a more coordinated relationship between\nthe two groups, but not decisively.\n\n_Comparing DCLeaks and CyberBerkut_\n\n[In our previous post, we identified a website called DCLeaks as a Russian-backed influence outlet. Information shared with](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\nThreatConnect indicates that there is an association of some kind between the Guccifer 2.0 persona and the DCLeaks website.\nShortly after publication, we became aware of a cache of documents leaked on the DCLeaks site. The files were allegedly\nobtained via a compromise of an organization affiliated with George Soros. It is interesting to note that earlier in 2016\nCyberBerkut also published files purportedly associated with Soros.\n\n[Analysis conducted by Anton Cherepanov, a security researcher who works for ESET, suggests that the content of the two](https://twitter.com/cherepanov74/status/764948917939212289)\n[leaks are similar with at least three of the Soros documents being found on both sites. The acquisition and publication of](https://foreignpolicy.com/2016/08/22/turns-out-you-cant-trust-russian-hackers-anymore/)\ndocuments belonging to, or in some way associated with, the same individual is of interest as overlaps in targeting and\npotential similarities in stolen content could be indicative of a connection between DCLeaks and CyberBerkut. Further, as we\nhave identified that there is a connection from DCLeaks to Guccifer 2.0 and from Guccifer 2.0 to FANCY BEAR, the overlap in\nleaked documents may suggest that both leak sites obtained their data from the same collection source, FANCY BEAR.\n\nWhile this alone isn’t enough to verify a relationship between the sites, there are some other interesting similarities. Despite\ntheir statuses as a U.S.-focused whistleblower and hacktivist group respectively, the websites of both DCLeaks and\nCyberBerkut primarily host content that is critical of individuals and governments perceived to oppose Russian foreign and\ndomestic policies. Both sites attempt to appeal to civilian masses in the U.S. and Ukraine respectively by calling attention to\npurported in the political systems.\n\n_Aleksandr Panchenko_\n\n\n-----\n\nMost of these domains were also registered using privacy protection, but one domain, cyber berkut[.]net was registered by\n“Aleksandr Panchenko” using the email address alex_panchenko@mail[.]com. The same day the domain was registered\nthrough Reg.ru, it was later routed to CloudFlare infrastructure, suggesting that this domain was not opportunistically procured\nby a domain registrant in hopes they could sell it to the CyberBerkut actors.\n\nAdditional research into this name and email address identifies six other CyberBerkut-related domains, none of which are\nactive currently, registered by this individual:\n\nCyber-berkut[.]su\n\nCyber-berkut[.]tk\n\nCyber-berkut[.]us\n\nCyber-berkut[.]me\n\nCyber-berkut[.]cz\n\nCyber-berkut[.]im\n\nWhile certainly not definitive, the use of a mail.com email address to register domains is consistent with recently identified\n[FANCY BEAR registration activity against the DCCC, WADA, and CAS.](https://threatconnect.com/blog/fancy-bear-it-itch-they-cant-scratch/)\n\n##### Tracing out FB Infrastructure Based on Bellingcat Input\n\nThe activity that Bellingcat alerted us to provided a plethora of domains, IP addresses, email addresses, and other registration\nand hosting information for us to pivot off of to identify other pertinent infrastructure. In an upcoming blog post, we’ll seek to\nidentify as much FANCY BEAR infrastructure and aliases as possible using the ThreatConnect platform and capabilities from\nsome of our industry partners.\n\nReviewing the CATA501836 and Carbon2u name servers, we were able to identify dozens of active domains that fit the FANCY\nBEAR mold and likely spoof organizations that Moscow would seek to compromise.\n\nPivoting off of Bellingcat’s email headers we were able to identify hundreds of domains and IPs, and dozens of email addresses\n\nd li t lik l d b FANCY BEAR f hi h t i l id tifi d Thi i i il id tifi d\n\n\n-----\n\n**Conclusion**\n\nThe campaign against Bellingcat provides yet another example of sustained targeting against an organization that shines a light\non Russian perfidy. The spearphishing campaign is classic FANCY BEAR activity while CyberBerkut’s role raises yet more\nquestions about the group’s ties to Moscow. These end-to-end cyber operations begin with targeting and exploitation and end\nwith strategic leaks and other active measures employed against those with whom they disagree.\n\nThese efforts go above and beyond traditional intelligence requirements such as gaining insight into a sensitive project or\nsources. Vilifying the messenger and dumping their personal data is part of the game, intended to intimidate and embarrass\nthose that speak ill of Moscow. If Russia is willing to go to these lengths to compromise a small journalist organization and its\ncontributors, consider what they are willing to do to major news and media outlets that publish similar articles. While many\norganizations remain reticent to share information, this knowledge is the prerequisite to establishing how widespread such\nefforts are and the adversary’s modus operandi.\n\nThe BEARs win if their active measures campaigns push, scare, or intimidate their targets into doing what they want. If you\nencounter a BEAR, you’re doing something right. Don’t back down. And turn on two-factor authentication for everything.\n\n### Update\n\nOn October 5 2016, probable FANCY BEAR actors again sent a spearphishing message to a Bellingcat contributor. This\nspearphishing message spoofed Google security services, similar to those previously used to target Bellingcat.\n\n\n-----\n\nFANCY BEAR used a shortening service to mask the malicious link, similar to the previous messages, but it appears the actors\nattempted to obfuscate their activity by using two separate shortening services to hide the final malicious link. The tiny.cc link\nthat is in the spearphishing message actually points to a TinyURL shortened URL.\n\n\n-----\n\nThe TinyURL in turn points to the below URL:\n\nhxxp://myaccount.google.com-changepassword-securitypagesettingmyaccountgooglepagelogin.id833[.]ga\n\nThis URL is appended with a target-specific base64 encoded string as was seen in the previous spearphishing messages\ntargeting Bellingcat and others.\n\nThe id833[.]ga domain is hosted at the 89.40.181[.]119 IP (Bucharest, RO) which also hosts the domain id834[.]ga. There is a\nsubdomain for the id834[.]ga similar to the URL above that is also hosted at the same IP. This suggests that the id834[.]ga\ndomain has also been operationalized, though we have no information indicating who has been targeted with it. The WHOIS\nrecords for these domains did not contain any additional information on the registrants or other domains they may have\nregistered.\n\nUsing ThreatConnect’s Email Import feature, we identified that the spearphishing message was sent through Yandex mail\nservers using the email address g.mail2017@yandex[.]com.\n\n\n-----\n\nThis was the first identified spearphish against Bellingcat since July 2016 and suggests that FANCY BEAR activity against them\nis ongoing. Other organizations involved in the MH17 investigation that would draw Moscow’s ire should be on the lookout for\nsimilar activity.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/xpj87wwmxjkl3cykpyjbekaqhb3v4py6"
    ],
    "report_names": [
        "ThreatConnect_Belling_the_BEAR(09-28-2016)"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1476884783,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/802cfc799eb72c9b5e40ca56e724c75b1fa10be8.pdf",
        "text": "https://archive.orkl.eu/802cfc799eb72c9b5e40ca56e724c75b1fa10be8.txt",
        "img": "https://archive.orkl.eu/802cfc799eb72c9b5e40ca56e724c75b1fa10be8.jpg"
    }
}