{
    "id": "0757eccd-7705-486a-9625-3f129533c4e1",
    "created_at": "2023-01-12T15:07:25.214835Z",
    "updated_at": "2025-03-27T02:05:41.810576Z",
    "deleted_at": null,
    "sha1_hash": "324adbf067f86820070ea0da109ff14d923d240e",
    "title": "2015-03-19 - FindPOS- New POS Malware Family Discovered",
    "authors": "",
    "file_creation_date": "2022-05-28T02:12:29Z",
    "file_modification_date": "2022-05-28T02:12:29Z",
    "file_size": 936184,
    "plain_text": "# FindPOS: New POS Malware Family Discovered\n\n**[researchcenter.paloaltonetworks.com/2015/03/findpos-new-pos-malware-family-discovered/](https://researchcenter.paloaltonetworks.com/2015/03/findpos-new-pos-malware-family-discovered/)**\n\nJosh Grunzweig March 19, 2015\n\nBy [Josh Grunzweig](https://unit42.paloaltonetworks.com/author/joshgruznweig/)\n\nMarch 19, 2015 at 12:00 PM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Retail,](https://unit42.paloaltonetworks.com/category/retail/) [Threat Prevention,](https://unit42.paloaltonetworks.com/category/threat-prevention-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [FindPOS,](https://unit42.paloaltonetworks.com/tag/findpos/) [microsoft,](https://unit42.paloaltonetworks.com/tag/microsoft/) [Point of Sale,](https://unit42.paloaltonetworks.com/tag/point-of-sale/) [WildFire,](https://unit42.paloaltonetworks.com/tag/wildfire/) [Windows](https://unit42.paloaltonetworks.com/tag/windows/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/findpos-new-pos-malware-family-discovered/)\n\nUnit 42 has discovered a new Point of Sale (POS) malware family, which includes multiple\nvariants created as early as November 2014. Over the past few weeks we have been\nanalyzing this malware family, which we have dubbed ‘FindPOS’ due to strings consistently\nfound in each variant.\n\nWhile this malware doesn’t show strong sophistication, the large number of variants shows\n[prevalence similar to families such as Alina and](https://www.trustwave.com/Resources/SpiderLabs-Blog/Alina--Following-The-Shadow-Part-1/) [Backoff. It is clear that FindPOS should be](https://www.trustwave.com/Resources/SpiderLabs-Blog/Backoff---Technical-Analysis/)\nconsidered a strong threat to Microsoft Windows POS vendors, and measures should be\ntaken to ensure protection.\n\n## Workflow\n\n[The malware in question has the ability to scrape memory for track data, exfiltrate any](http://en.wikipedia.org/wiki/Magnetic_stripe_card)\ndiscovered data via HTTP POST requests, and in some instances log keystrokes. While the\nmalware family uses many common techniques witnessed in previous malware families\ntargeting POS devices, the prevalence and continued development of this malware\ndemonstrates a threat to those running Windows-based point of sale terminals.\n\nThe general workflow of the FindPOS malware family can be seen below.\n\n\n-----\n\n## Evolution\n\nOver the course of our research, a total of nine variants of FindPOS have been discovered.\nUsing compile timestamp information, we can see a timeline of these variants below.\n\nA breakdown of the specific functionality changes between versions is as follows:\n\n**Version 2.1**\n\n\n-----\n\nModified hashing algorithm to use the following information:\n\nVolume Serial Number\nNetworking Adapters (IPv4 Only)\nAdded ‘uinfo’ POST parameter\n\n**Version 5.57**\n\nAdded ability to terminate previously installed FindPOS upon installation\nCode cleanup during install\nSet main thread to lowest priority\nAdded memory scraping checks\n\nExpiration year between 2014 and 2030\nExpiration month between 1 and 12\nService code set to either ‘101’ or ‘201’\nAdded ability to download/execute files\nRemoved ‘Cookie: income=1’ HTTP Header\nAdded User-Agent HTTP Header\n\n**Version 5.80**\n\nModified memory scraping checks\n\nExpiration year cannot exceed 2030 (no lower bound check)\nExpiration month cannot exceed 12 (no lower bound check)\nCode enhancements to domain/URI configuration\n\n**Version 5.90**\n\nAdded keylogging functionality\n\n**Version 6.0**\n\nNo significant changes identified\n\n**Version 6.02**\n\nMinor modifications to exfiltration function\n\n**Version 6.03**\n\nNo significant changes identified\n\n**Version 6.04**\n\nMinor modifications to exfiltration sleep timer\n\n\n-----\n\nAs we can see from the above timeline, FindPOS appears to have been very actively\ndeveloped early on, while over time the author made minimal changes. These minimal\nchanges were likely made for performance reasons or potentially bug fixes.\n\n## Installation\n\nUpon execution, FindPOS will generate a lowercase alphabetic executable name of eight\ncharacters (example: abodeign.exe). This name is generated using the following system\ninformation:\n\nC:\\ Volume Serial Number\nSystemBiosdate\nVideoBiosdate\nCPU Identifier\nMicrosoft Windows ProductId\n\nUsing these values in order to generate results in a consistently generated name when run\non the same machine. Please note that the hashing algorithm used was modified in version\n2.1. Please refer to the ‘Evolution’ section above for details.\n\nThis executable name is then compared against the original executable name of the running\nmalware. Should those names not match, the malware will proceed to continue with its\ninstallation routine.\n\nFindPOS proceeds to copy itself to the following directories using the executable name that\nwas previously generated:\n\n%SystemRoot%\\System32\\[name].exe\n%USERPROFILE%\\[name].exe\n\nShould these file copy operations prove successful, the malware will write the following\nregistry keys:\n\nHKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run [name] :\n%SystemRoot%\\System32\\[name].exe\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run [name] : %USERPROFILE%\\\n\n[name].exe\n\nThe malware will proceed to spawn a new instance of %SystemRoot%\\System32\\[name].exe\n[via a call to CreateProcessA. Should this prove successful, the malware will execute the](https://msdn.microsoft.com/en-us/library/windows/desktop/ms682425%28v=vs.85%29.aspx)\nfollowing command prior to exiting. This command is responsible for deleting the original\nexecutable.\n\n_cmd.exe /c del [original_executable_path] >> NUL_\n\n\n-----\n\nShould the CreateProcessA call on %SystemRoot%\\System32\\[name].exe fail, FindPOS will\nattempt to spawn a new instance of %USERPROFILE%\\[name].exe. If this proves\nsuccessful, FindPOS will attempt to delete the original executable using the same technique\npreviously seen.\n\nAfter installation of FindPOS is successful, the malware will create a global mutex in order to\nensure only one instance of FindPOS is running. This mutex has the following name:\n\nWIN_[hex]\n\nWhere [hex] is a series of 16 uppercase hexadecimal characters that are generated using the\nsame technique witnessed when generating the malware’s executable name during the\ninstallation routine.\n\nAfter this mutex is successfully created, FindPOS will continue to scrape memory and\noptionally log keystrokes.\n\n## Memory Scraping\n\nMemory scraping is a technique found in the majority of POS malware families discovered in\nprior years. The concept is fairly simple: read the memory of running processes on a POS\nterminal, and look for track data. When a card is swiped on a POS terminal, and the\ntransaction is processed, the card data will often reside in memory unencrypted for a brief\nperiod of time. Attackers exploit this weakness in order to find track data.\n\nA common technique for increasing performance of memory scrapers is to denylist a list of\ncommonly seen process names, such as explorer.exe, lsass.exe, csrss.exe, etc.\nAlternatively, some malware families leverage an allowlist approach, where only specific\nprocess names are targeted. FindPOS, however, uses a brand new approach. This particular\n[family determines the owner of every process on the system, via calls to EnumProcesses,](https://msdn.microsoft.com/en-us/library/windows/desktop/ms682629%28v=vs.85%29.aspx)\n[OpenProcess,](https://msdn.microsoft.com/en-us/library/windows/desktop/ms684320%28v=vs.85%29.aspx) [GetTokenInformation and](https://msdn.microsoft.com/en-us/library/windows/desktop/aa446671%28v=vs.85%29.aspx) [LookupAccountSid. The owner of the process is](https://msdn.microsoft.com/en-us/library/windows/desktop/aa379166%28v=vs.85%29.aspx)\nthen compared against the ‘NT AUTHORITY’ string. This filters out any processes not being\nrun as system or as a service. In the example below, all processes except for ‘dwm.exe’ and\nthe multiple instances of ‘conhost.exe’ would be filtered.\n\n\n-----\n\nFigure 1. Example Running Processes\n\n[In the event a process is not filtered, memory is scraped via calls to VirtualQueryEx and](https://msdn.microsoft.com/en-us/library/windows/desktop/aa366907%28v=vs.85%29.aspx)\n[ReadProcessMemory. This is a very common approach that is witnessed in almost all](https://msdn.microsoft.com/en-us/library/windows/desktop/ms680553%28v=vs.85%29.aspx)\nmemory scrapers.\n\n\n-----\n\nOnce the data is read, FindPOS proceeds to look for track data. Starting with version 5.57,\nthe author began making checks based on various data found within the track data. For\nexample, in version 5.57 the author began ignoring any track data that did not have an\nexpiration date between January 2014 to December 2030. This helped to ensure expired\ncard data was not captured.\n\nAdditionally, the author paid close attention to the service codes that appeared within any\ndiscovered track data. The service code is a three-digit number that represents the type of\ncard being swiped. In this particular instance, the author chose to only capture cards that\nheld the following options:\n\n**First Digit – ‘International interexchange OK’ or ‘International interchange, use IC (chip)**\nwhere feasible’\n\n**Second Digit – ‘Normal’**\n\n**Third Digit – ‘No restrictions’**\n\nBy adding these restrictions, the author was able to ignore cards that it did not consider to be\nappealing. Such cards included gift cards, debit cards, and test cards to name a few.\n\nAny discovered track data is stored in memory until exfiltration occurs. This data is exfiltrated\nvia the ‘data’ POST parameter.\n\n\n-----\n\n## Keylogging\n\nStarting in version 5.90, the author of FindPOS began adding keylogging to this family. Many\nmagnetic card readers often will emulate a keyboard device. Knowing this, many POS\nmalware authors incorporate this functionality into their families. In addition to collecting track\ndata, keylogging also has the ability to potentially collect usernames, passwords, or other\nsensitive data on the victim machine.\n\nIn order to accomplish this, the author spawns a new thread that is responsible for\nkeylogging. A common technique of creating a new empty window, registering itself as a raw\n[input device, and making calls to the GetRawInputData API is used.](https://msdn.microsoft.com/en-us/library/windows/desktop/ms645596%28v=vs.85%29.aspx)\n\nAny keystrokes are stored in memory until exfiltration occurs. The keystrokes are exfiltrated\nvia the ‘logs’ POST parameter.\n\n## Exfiltration\n\nExfiltration for FindPOS takes place via HTTP POST requests. A number of hardcoded\ndomains are configured for each sample, often varying between FindPOS variants. HTTP\nPOST requests are made every 120 seconds (2 minutes). In the event any data has been\n\n\n-----\n\ndiscovered, such as track data or keystroke data, this data is included. An example request\nfrom version 5.80 is shown below:\n\nAs we can see, a number of POST variables are included in each request:\n\nAn example of decoding the ‘uinfo’ parameter can be seen below:\n\n_>>> import base64_\n_>>> base64.b64decode(\"Sk9TSC1QQyBAIGpvc2gtUENcam9zaA==\")_\n_'JOSH-PC @ josh-PC\\\\josh'_\n\nKeystroke data and track data is obfuscated using a combination of Base64 encoding and a\nsingle-byte XOR encryption. Decoding this data can be seen below:\n\n_>>> import base64_\n_>>> raw = \"\"_\n_>>> for s in_\n_base64.b64decode(\"HxkaGxgfGhodGhoaGhsTGxcbHxoSGxobGhMbGBkeHxwdEhMaGxU=\"):_\n_>>>   raw += chr(ord(s) ^ 0x2a)_\n_>>> print raw_\n_5301250070000191=15081010912345678901?_\n\nIn addition to data exfiltration, FindPOS added the ability to download/execute further\nmalware. Upon sending an exfiltration request, should the server respond with a 0x1 or 0x4\nbyte, followed by a URL, this file will be downloaded and subsequently executed.\n\n\n-----\n\nThe file is downloaded to a temporary folder, with the file itself prefixed by BN . This\n[downloaded file is executed via a call to CreateProcessA. In the event the file cannot be](https://msdn.microsoft.com/en-us/library/windows/desktop/ms682425%28v=vs.85%29.aspx)\nproperly downloaded or executed, it is deleted from disk.\n\n## Domain/IP Address Information\n\nA total of 37 domains were discovered while researching the FindPOS malware family. Of\nthese domains, 13 unique IP addresses were discovered. The geographic location of these\nIP addresses can be seen below. Please refer to the Appendix for a full list of all domains.\n\nThe majority of the domains discovered were configured with the following WHOIS\ninformation.\n\n_Registrant Name: Julio Quinlan_\n\n_Registrant Organization: NA_\n\n_Registrant Street: 4516 Glory Road_\n\n_Registrant City: Nashville_\n\n_Registrant State/Province: TN_\n\n_Registrant Postal Code: 37204_\n\n_Registrant Country: us_\n\n_Registrant Phone: +01.9318135965_\n\n_Registrant Phone Ext:_\n\n_Registrant Fax: +01.9318135965_\n\n_Registrant Fax Ext:_\n\n_Registrant Email: barkmanueta@rambler.ru_\n\nPlease note that the registrant email was slightly different depending on the domain queried.\nWhile the information above appears legitimate it was discovered to be falsified\n\n\n-----\n\n**Related Samples – Keylogging/LogMeIn Recon**\n\nDuring the course of our research, a number of similar samples were discovered. One such\nsample can be seen below.\n\n**Version 8.3 – LogMeIn Recon / Keylogger**\n\nThis particular sample is responsible for collecting LogMeIn account information, logging\nkeystrokes and mouse-clicks, and periodically exfiltrating this data to a remote server. This\nsample shares a number of characteristics with the FindPOS samples previously discovered.\nSome of these similarities include the installation process, URI scheme, format of the HTTP\nPOST requests, and the PDB string.\n\nUpon execution, this malware will install itself in the same method as FindPOS. Additionally,\na mutex is created using the technique previously mentioned. The malware will attempt\ndetermine if LogMeIn Ignition is installed on the victim machine by checking the following\nregistry keys:\n\n_HKCU\\Software\\LogMeIn Ignition\\[Variable Hash]\\Account : Email_\n\nAny discovered emails are exfiltrated using the same HTTP POST requests witnessed in\nFindPOS. However, instead of using the ‘data’ POST parameter, this particular sample uses\nthe ‘logs’ parameter. This can be seen below:\n\n\n-----\n\nThe malware proceeds to log keystrokes and mouse clicks. This data is exfiltrated every two\nminutes.\n\nWhile this sample certainly could have been used to scrape track data from POS terminals\nthat have card readers that emulate keyboard devices, I suspect this sample was more likely\nused to gain access to more POS machines. It is most likely that this sample was dropped on\na machine that was administering multiple POS machines, and the information obtained from\nthis particular box was leveraged to gain access to said POS machines.\n\nIt’s also interesting to note that the compile timestamp for this particular sample lines up to\njust about two weeks after the introduction of keylogging functionality (starting in version\n5.90). It would appear that right around this time the malware author added a new trick to his\nor her repertoire.\n\n\n-----\n\n## Conclusion\n\nOverall, FindPOS isn’t terribly sophisticated. It lacks a number of features that we’ve seen in\nprevious malware families, such as a more sophisticated command and control structure,\n[stronger encryption, and performing luhn checks on any discovered data. Additionally, the](http://en.wikipedia.org/wiki/Luhn_algorithm)\nevolution of this family provides interesting clues to the notion that this malware was written\nfrom scratch. While FindPOS may share minimal similarities with previously witnessed\nmalware families, we are strongly confident that this malware is a brand new family.\n\nWhile this malware doesn’t show strong sophistication, the large number of variants shows\n[prevalence similar to families such as Alina and](https://www.trustwave.com/Resources/SpiderLabs-Blog/Alina--Following-The-Shadow-Part-1/) [Backoff. It is clear that FindPOS should be](https://www.trustwave.com/Resources/SpiderLabs-Blog/Backoff---Technical-Analysis/)\nconsidered a strong threat to Microsoft Windows POS vendors, and measures should be\ntaken to ensure protection.\n\nSuch measures include, but are not limited to, configuring two-factor authentication for any\nremote access services (LogMeIn, VNC, RDP, etc.), ensuring anti-virus is installed and\nupdated, and ensuring POS devices are not used non-approved functions, such as browsing\nthe web or checking email.\n\nPalo Alto Networks customers are protected by WildFire, which automatically classifies\nFindPOS samples as malware. Additionally, the indicators we've discovered that are related\nto these attacks have been added to PANDB and Anti-Malware protection systems.\n\n## Appendix\n\n**Sample Information**\n\n**Version 2.0**\n\n**Version 2.1**\n\n\n-----\n\n**Version 5.57**\n\n**Version 5.80**\n\n**Version 5.90**\n\n\n-----\n\n**Version 6.0**\n\n**Version 6.02**\n\n\n-----\n\n**Version 6.03**\n\n**Version 6.04**\n\n**YARA Rule**\n\n\n-----\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n\n\nimport \"cuckoo\"\n\nrule findpos\n{\nmeta:\ndescription = \"FindPOS is a newly discovered POS family.\"\ncategory = \"Point of Sale\"\nauthor = \"Josh Grunzweig\"\n\nstrings:\n$s1 = \"oprat=2&uid=%I64u&uinfo=%s&win=%d.%d&vers=%s\" nocase wide ascii\n\n$pdb1 = \"H:\\\\Work\\\\Current\\\\FindStr\\\\Release\\\\FindStr.pdb\" nocase wide ascii\n$pdb2 = \"H:\\\\Work\\\\FindStrX\\\\Release\\\\FindStr.pdb\" nocase wide ascii\n$pdb3 = \"H:\\\\Work\\\\Current\\\\KeyLogger\\\\Release\\\\KeyLogger.pdb\" nocase wide ascii\n\ncondition:\nany of ($s*) or\nany of ($pdb*) or\n(\ncuckoo.sync.mutex(/WIN_[a-fA-F0-9]{16}/) and\ncuckoo.registry.key_access(/\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run/)\nand\n(\ncuckoo.filesystem.file_access(/C\\:\\\\WINDOWS\\\\System32\\\\\\w{8}\\.exe/) or\ncuckoo.filesystem.file_access(/C\\:\\\\Documents\\ and\\ Settings\\\\[^\\\\]+\\\\\\w{8}\\.exe/)\n)\n)\n}\n\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-03-19 - FindPOS- New POS Malware Family Discovered.pdf"
    ],
    "report_names": [
        "2015-03-19 - FindPOS- New POS Malware Family Discovered.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536045,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653703949,
    "ts_modification_date": 1653703949,
    "files": {
        "pdf": "https://archive.orkl.eu/324adbf067f86820070ea0da109ff14d923d240e.pdf",
        "text": "https://archive.orkl.eu/324adbf067f86820070ea0da109ff14d923d240e.txt",
        "img": "https://archive.orkl.eu/324adbf067f86820070ea0da109ff14d923d240e.jpg"
    }
}