{
    "id": "076e9dfb-b37d-4c10-bbdc-e68c4874e3f5",
    "created_at": "2023-01-12T15:03:56.388885Z",
    "updated_at": "2025-03-27T02:09:29.29399Z",
    "deleted_at": null,
    "sha1_hash": "eb8a5f2c2c129fff3950553afeb3a4d59ee334a5",
    "title": "2021-01-05 - An Overview of the DoppelPaymer Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:10:21Z",
    "file_modification_date": "2022-05-28T18:10:21Z",
    "file_size": 142443,
    "plain_text": "# An Overview of the DoppelPaymer Ransomware\n\n**[trendmicro.com/en_us/research/21/a/an-overview-of-the-doppelpaymer-ransomware.html](https://www.trendmicro.com/en_us/research/21/a/an-overview-of-the-doppelpaymer-ransomware.html)**\n\nJanuary 5, 2021\n\nFigure 1. DoppelPaymer’s infection routine\nDoppelPaymer uses a fairly sophisticated routine, starting off with network infiltration via malicious spam emails containing\nspear-phishing links or attachments designed to lure unsuspecting users into executing malicious code that is usually\ndisguised as a genuine document. This code is responsible for downloading other malware with more advanced capabilities\n(such as Emotet) into the victim’s system.\n\nOnce Emotet is downloaded, it will communicate with its command-and-control (C&C) server to install various modules as\nwell as to download and execute other malware.\n\n[For the DoppelPaymer campaign, the C&C server was used to download and execute the Dridex malware family, which in](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/web-attack/3147/dealing-with-the-mess-of-dridex)\nturn is used to download either DoppelPaymer directly or tools such as PowerShell Empire, Cobalt Strike, PsExec, and\nMimikatz. Each of these tools is used for various activities, such as stealing credentials, moving laterally inside the network,\nand executing different commands, such as disabling security software.\n\nOnce Dridex enters the system, the malicious actors do not immediately deploy the ransomware. Instead, it tries to move\nlaterally within the affected system’s network to find a high-value target to steal critical information from. Once this target is\nfound, Dridex will proceed in executing its final payload, DoppelPaymer. DoppelPaymer encrypts files found in the network\nas well as fixed and removable drives in the affected system.\n\nFinally, DoppelPaymer will change user passwords before forcing a system restart into safe mode to prevent user entry from\nthe system. It then changes the notice text that appears before Windows proceeds to the login screen.\n\nThe new notice text is now DoppelPaymer’s ransom note, which warns users not to reset or shut down the system, as well\nas not to delete, rename, or move the encrypted files. The note also contains a threat that their sensitive data will be shared\nto the public if they do not pay the ransom that is demanded from them.\n\nDoppelPaymer will also drop the Process Hacker executable, its driver, and a stager DLL. DoppelPaymer will create another\ninstance of itself that executes the dropped Process Hacker. Once Process Hacker is running, it will load the stager DLL via\nDLL Search Order Hijacking. Stager DLL will listen/wait for a trigger from the running DoppelPaymer process.\nDoppelPaymer has a crc32 list of processes and services it will terminate. If a process or service in its list is running, it will\ntrigger the Process Hacker to terminate it.\n\n## Who are affected?\n\nAccording to the FBI notification, DoppelPaymer’s primary targets are organizations in the healthcare, emergency services,\nand education. The ransomware has already been involved in a number of attacks in 2020, including disruptions to a\ncommunity college as well as police and emergency services in a city in the US during the middle of the year.\n\n\n-----\n\nDoppelPaymer was particularly active in September 2020, with the ransomware targeting a German hospital that resulted in\nthe disruption of communication and general operations. It also fixed its sights on a county E911 center as well as another\ncommunity college in the same month.\n\n## What can organizations do?\n\n[Organizations can protect themselves from ransomware such as DoppelPaymer by ensuring that security best practices are](https://www.trendmicro.com/en_us/forHome/campaigns/ransomware-protection.html)\nin place. These include:\n\nRefraining from opening unverified emails and clicking on any embedded links or attachments in these messages.\n[Regularly backing up important files using the 3-2-1 rule: Create three backup copies in two different file formats, with](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/best-practices-backing-up-data)\none of the backups in a separate physical location.\nUpdating both software and applications with the latest patches as soon as possible to protect them from\nvulnerabilities.\nEnsuring that backups are secure and disconnected from the network at the conclusion of each backup session.\nAuditing user accounts at regular intervals — in particular those accounts that are publicly accessible, such as Remote\nMonitoring and Management accounts.\nMonitoring inbound and outbound network traffic, with alerts for data exfiltration in place.\nImplementing two-factor authentication (2FA) for user login credentials, as this can help strengthen security for user\naccounts\nImplementing the principle of least privilege for file, directory, and network share permissions.\n\n## Indicators of Compromise (IOCs)\n\n**Hash (SHA256)** **Detection Name**\n\n624255fef7e958cc3de9e454d2de4ae1a914a41fedc98b2042756042f68c2b69 Ransom.Win32.DOPPELPAYMER.TGACAR\n\n4c207d929a29a8c25f056df66218d9e8d732a616a3f7057645f2a0b1cb5eb52c Ransom.Win32.DOPPELPAYMER.TGACAQ\n\nc66157a916c7f874bd381a775b8eede422eb59819872fdffafc5649eefa76373 Ransom.Win32.DOPPELPAYMER.TGACAP\n\nRansomware\n\nIn early December 2020, the FBI issued a warning regarding DoppelPaymer, a ransomware family that first appeared in\n2019. Its activities continued throughout 2020, including incidents that left its victims struggling to properly carry out their\noperations.\n\nBy: Trend Micro Research January 05, 2021 Read time: ( words)\n\nContent added to Folio\n\n[In early December 2020, the FBI issued a warning regarding DoppelPaymer, a](https://www.ic3.gov/Media/News/2020/201215-1.pdf) [ransomware family that first appeared in](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware)\n2019 when it launched attacks against organizations in critical industries. Its activities have continued throughout 2020,\nincluding a spate of incidents in the second half of the year that left its victims struggling to properly carry out their\noperations.\n\n## What is DoppelPaymer?\n\n[DoppelPaymer is believed to be based on the BitPaymer ransomware (which first appeared in 2017) due to similarities in](https://success.trendmicro.com/solution/000261855)\ntheir code, ransom notes, and payment portals. It is important to note, however, that there are some differences between\nDoppelPaymer and BitPaymer. For example, DoppelPaymer uses 2048-bit RSA + 256-bit AES for encryption, while\nBitPaymer uses 4096-bit RSA + 256-bit AES (with older versions using 1024-bit RSA + 128-bit RC4). Furthermore,\nDoppelPaymer improves upon BitPaymer’s rate of encryption by using threaded file encryption.\n\n\n-----\n\nAnother difference between the two is that before DoppelPaymer executes its malicious routines, it needs to have the\ncorrect command-line parameter. Our experience with the samples that we encountered shows different parameters for\ndifferent samples. This technique is possibly used by the attackers to avoid detection via sandbox analysis as well as to\nprevent security researchers from studying the samples.\n\nPerhaps the most unique aspect of DoppelPaymer is its use of a tool called Process Hacker, which it uses to terminate\nservices and processes related to security, email server, backup, and database software to impair defenses and prevent\naccess violation during encryption. in order to prevent access violation during encryption.\nLike many modern ransomware families, DoppelPaymer’s ransom demands for file decryption are sizeable, ranging\n[anywhere from US$25,000 to US$1.2 million. Furthermore, starting in February 2020, the malicious actors behind](https://www.bankinfosecurity.com/doppelpaymer-ransomware-gang-threatens-to-dump-victims-data-a-13683)\nDoppelPaymer launched a data leak site. They then threaten victims with the publication of their stolen files on the data leak\nsite as part of the ransomware’s extortion scheme.\n\n## What is DoppelPaymer’s routine?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-05 - An Overview of the DoppelPaymer Ransomware.pdf"
    ],
    "report_names": [
        "2021-01-05 - An Overview of the DoppelPaymer Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535836,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653761421,
    "ts_modification_date": 1653761421,
    "files": {
        "pdf": "https://archive.orkl.eu/eb8a5f2c2c129fff3950553afeb3a4d59ee334a5.pdf",
        "text": "https://archive.orkl.eu/eb8a5f2c2c129fff3950553afeb3a4d59ee334a5.txt",
        "img": "https://archive.orkl.eu/eb8a5f2c2c129fff3950553afeb3a4d59ee334a5.jpg"
    }
}