{
    "id": "078b9edd-7c0e-478f-aaf5-73bd2e173968",
    "created_at": "2022-10-25T16:48:15.169167Z",
    "updated_at": "2025-03-27T02:16:05.807855Z",
    "deleted_at": null,
    "sha1_hash": "e9ab559e5495f776e3ec2ffb46e648fa3b173a5c",
    "title": "Suckfly: Revealing the secret life of your code signing certificates | Symantec Connect Community",
    "authors": "",
    "file_creation_date": "2016-03-16T10:35:06Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 482717,
    "plain_text": "**Blogs** **Security Response**\n\n\n# Security Response\n\n\n### +3\n\n**3 Votes**\n\n\n##### Symantec Official Blog\n\n## Suckfly: Revealing the secret life of your code signing certificates\n#### A China-based APT group has an insatiable appetite for stolen code- signing certificates.\n\n**By: Jon_DiMaggio** **SYMANTEC EMPLOYEE**\n\n**Created 15 Mar 2016**\n\n**0**\n\n**Share**\n\n**Many security-minded organizations utilize code signing to provide an additional layer of**\n\n**security and authenticity for their software and files. Code signing is carried out using a type**\n\n**of digital certificate known as a code-signing certificate. The process of code signing**\n\n**validates the authenticity of legitimate software by confirming that an application is from the**\n\n\n-----\n\n**also live an unintended secret life providing cover for attack groups, such as the Suckfly**\n\n**APT group.**\n\n**In late 2015, Symantec identified suspicious activity involving a hacking tool used in a**\n\n**malicious manner against one of our customers. Normally, this is considered a low-level alert**\n\n**easily defeated by security software. In this case, however, the hacktool had an unusual**\n\n**characteristic not typically seen with this type of file; it was signed with a valid code-signing**\n\n**certificate. Many hacktools are made for less than ethical purposes and are freely available,**\n\n**so this was an initial red flag, which led us to investigate further.**\n\n**As our investigation continued, we soon realized this was much larger than a few hacktools.**\n\n**We discovered Suckfly, an advanced threat group, conducting targeted attacks using**\n\n**multiple stolen certificates, as well as hacktools, and custom malware. The group had**\n\n**obtained the certificates through pre-attack operations before commencing targeted attacks**\n\n**against a number of government and commercial organizations spread across multiple**\n\n**continents over a two-year period. This type of activity and the malicious use of stolen**\n\n**certificates emphasizes the importance of safeguarding certificates to prevent them from**\n\n**being used maliciously.**\n\n**An appetite for stolen code-signing certificates**\n\n**Suckfly has a number of hacktools and malware varieties at its disposal. Figure 1 identifies**\n\n**the malware and tools based on functionality and the number of signed files with unique**\n\n**hashes associated with them.**\n\n**_Figure 1_** **_Suckfly hacking tools and malware characterized by functionality_**\n\n\n-----\n\n**message block (SMB) scanner. The organization associated with this certificate is a South**\n\n**Korean mobile software developer. While initially suspicious because the hacktool was**\n\n**signed, we became more suspicious when we realized a mobile software developer had**\n\n**signed it, since this is not the type of software typically associated with a mobile application.**\n\n**Based on this discovery, we began to look for other binaries signed with the South Korean**\n\n**mobile software developer's certificate. This led to the discovery of three additional hacktools**\n\n**also signed using this certificate. In addition to being signed with a stolen certificate, the**\n\n**identified hacktools had been used in suspicious activity against a US-based health provider**\n\n**operating in India. This evidence indicates that the certificate’s rightful owner either misused**\n\n**it or it had been stolen from them. Symantec worked with the certificate owner to confirm**\n\n**that the hacktool was not associated with them.**\n\n**Following the trail further, we traced malicious traffic back to where it originated from and**\n\n**looked for additional evidence to indicate that the attacker persistently used the same**\n\n**infrastructure. We discovered the activity originated from three separate IP addresses, all**\n\n**located in Chengdu, China.**\n\n**In addition to the traffic originating from Chengdu, we identified a selection of hacktools and**\n\n**malware signed using nine stolen certificates.**\n\n**The nine stolen certificates originated from nine different companies who are physically**\n\n**located close together around the central districts of Seoul, South Korea. Figure 2 shows the**\n\n**region in which the companies are located.**\n\n\n-----\n\n**_certificates are located (Map data © 2016 SK planet)_**\n\n**While we do not know the exact circumstances of how the certificates were stolen, the most**\n\n**likely scenario was that the companies were breached with malware that had the ability to**\n\n**search for and extract certificates from within the organization. We have seen this capability**\n\n**built into a wide range of malware for a number of years now.**\n\n**The organizations who owned the stolen certificates were from four industries (see Figure**\n\n**3).**\n\n**_Figure 3. Owners of stolen certificates, by industry_**\n\n**A timeline of misuse**\n\n**We don't know the exact date Suckfly stole the certificates from the South Korean**\n\n**organizations. However, by analyzing the dates we first saw the certificates paired with**\n\n**hacktools or malware, we can gain insight into when the certificates may have been stolen.**\n\n**Figure 4 details how many times each stolen certificate was used in a given month.**\n\n\n-----\n\n**_Figure 4. Tracking Suckfly’s use of stolen certificates, by month_**\n\n**The first sighting of three of the nine stolen certificates being used maliciously occurred in**\n\n**early 2014. Those three certificates were the only ones used in 2014, making it likely that**\n\n**the other six were not compromised until 2015. All nine certificates were used maliciously in**\n\n**2015.**\n\n**Based on the data in Figure 4, the first certificates used belonged to Company A**\n\n**(educational software developer) and Company B (video game developer #2). Company A's**\n\n**certificate was used for over a year, from April 2014 until June 2015 and Company B's**\n\n**certificate was used for almost a year, from July 2014 until June 2015. When we discovered**\n\n**this activity, neither company was aware that their certificates had been stolen or how they**\n\n**were being used. Since the companies were unaware of the activity, neither stolen certificate**\n\n**had been revoked. When a certificate is revoked, the computer displays a window explaining**\n\n**that the certificate cannot be verified and should not be trusted before asking the user if they**\n\n**want to continue with the installation.**\n\n**Signed, sealed, and delivered**\n\n**As noted earlier, the stolen certificates Symantec identified in this investigation were used to**\n\n**sign both hacking tools and malware. Further analysis of the malware identified what looks**\n\n**like a custom back door. We believe Suckfly specifically developed the back door for use in**\n\n**[cyberespionage campaigns. Symantec detects this threat as Backdoor.Nidiran.](https://www.symantec.com/security_response/writeup.jsp?docid=2015-120123-5521-99)**\n\n**Analysis of Nidiran samples determined that the back door had been updated three times**\n\n\n-----\n\n**and likely performed to add capabilities and avoid detection. While the malware is custom, it**\n\n**only provides the attackers with standard back door capabilities.**\n\n**Suckfly delivered Nidiran through a strategic web compromise. Specifically, the threat group**\n\n**used a specially crafted web page to deliver an exploit for the Microsoft Windows OLE**\n\n**Remote Code Execution Vulnerability (CVE-2014-6332), which affects specific versions of**\n\n**Microsoft Windows. This exploit is triggered when a potential victim browses to a malicious**\n\n**page using Internet Explorer, which can allow the attacker to execute code with the same**\n\n**privileges as the currently logged-in user.**\n\n**Once exploit has been achieved, Nidiran is delivered through a self-extracting executable**\n\n**that extracts the components to a .tmp folder after it has been executed. The threat then**\n\n**executes “svchost.exe”, a PE file, which is actually a clean tool known as OLEVIEW.EXE.**\n\n**The executable will then load iviewers.dll, which is normally a clean, legitimate file. Attackers**\n\n**have been known to distribute malicious files masquerading as the legitimate iviewers.dll file**\n\n**and then use DLL load hijacking to execute the malicious code and infect the computer. This**\n\n**[technique is associated with the Korplug/Plug-x malware and is frequently used in China-](http://www.symantec.com/connect/blogs/backdoorkorplug-loading-malicious-components-through-trusted-applications)**\n\n**based cyberespionage activity.**\n\n**High demand for code-signing certificates**\n\n**Suckfly isn’t the only attack group to use certificates to sign malware but they may be the**\n\n**[most prolific collectors of them. After all, Stuxnet, widely regarded as the world’s first known](http://www.symantec.com/security_response/writeup.jsp?docid=2010-071400-3123-99)**\n\n**[cyberweapon, was signed using stolen certificates from companies based in Taiwan with](http://www.welivesecurity.com/2010/07/22/why-steal-digital-certificates/)**\n\n**[dates much earlier than Suckfly. Other cyberespionage groups, including Black Vine and](http://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/the-black-vine-cyberespionage-group.pdf)**\n\n**[Hidden Lynx, have also used stolen certificates in their campaigns.](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwjJxpKJjKjLAhUY1GMKHac1DkEQFgggMAA&url=http%3A%2F%2Fwww.symantec.com%2Fcontent%2Fen%2Fus%2Fenterprise%2Fmedia%2Fsecurity_response%2Fwhitepapers%2Fhidden_lynx.pdf&usg=AFQjCNHSDsX6EuF1cDE0DELMKbjv4MP3lw)**\n\n**In April 2013, a third-party vendor published a report about a cyberespionage group using**\n\n**[custom malware and stolen certificates in their operations. The report documented an](https://threatpost.com/winnti-cyberespionage-campaign-targets-gaming-companies-041113/77717/)**\n\n**advanced threat group they attributed to China. Symantec tracks the group behind this**\n\n**[activity as Blackfly and detects the malware they use as Backdoor.Winnti.](https://www.symantec.com/security_response/writeup.jsp?docid=2011-102716-2809-99)**\n\n**The Blackfly attacks share some similarities with the more recent Suckfly attacks. Blackfly**\n\n**began with a campaign to steal certificates, which were later used to sign malware used in**\n\n**targeted attacks. The certificates Blackfly stole were also from South Korean companies,**\n\n**primarily in the video game and software development industry. Another similarity is that**\n\n**Suckfly stole a certificate from Company D (see Figure 4) less than two years after Blackfly**\n\n**had stolen a certificate from the same company. While the stolen certificates were different,**\n\n**and stolen in separate instances, they were both used with custom malware in targeted**\n\n**attacks originating from China.**\n\n\n-----\n\n**investigation and the other attacks we have discussed. Attackers are taking the time and**\n\n**effort to steal certificates because it is becoming necessary to gain a foothold on a targeted**\n\n**computer. Attempts to sign malware with code-signing certificates have become more**\n\n**common as the Internet and security systems have moved towards a more trust and**\n\n**reputation oriented model. This means that untrusted software may not be allowed to run**\n\n**unless it is signed.**\n\n**[As we noted in our previous research on the Apple threat landscape, some operating](http://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/hidden_lynx.pdf)**\n\n**systems, such as Mac OS X, are configured by default to only allow applications to run if**\n\n**they have been signed with a valid certificate, meaning they are trusted.**\n\n**_Figure 5. OS X can be configured to only permit trusted apps to execute_**\n\n**However, using valid code-signing certificates stolen from organizations with a positive**\n\n**reputation can allow attackers to piggyback on that company’s trust, making it easier to slip**\n\n**by these defenses and gain access to targeted computers.**\n\n**Conclusion**\n\n**Suckfly paints a stark picture of where cyberattack groups and cybercriminals are focusing**\n\n**their attentions. Our investigation shines a light on an often unknown and seedier secret life**\n\n**of code signing certificates which is completely unknown to their owners The implications of**\n\n\n-----\n\n**from falling into the wrong hands. It is important to give certificates the protection they need**\n\n**so they can't be used maliciously.**\n\n**The certificates are only as secure as the safeguards that organizations put around them.**\n\n**Once a certificate has been compromised, so has the reputation of the organization who**\n\n**signed it. An organization whose certificate has been stolen and used to sign malware will**\n\n**always be associated with that activity.**\n\n**Symantec monitors for this type of activity to help prevent organizations from being tied to**\n\n**malicious actions undertaken with their stolen certificates. During the course of this**\n\n**investigation, we ensured that all certificates compromised by Suckfly were revoked and the**\n\n**affected companies notified.**\n\n**Over the past few years, we have seen a number of advanced threats and cybercrime**\n\n**groups who have stolen code-signing certificates. In all of the cases involving an advanced**\n\n**threat, the certificates were used to disguise malware as a legitimate file or application.**\n\n**As this trend grows, it is more important than ever for organizations to maintain strong**\n\n**cybersecurity practices and store their certificates and corresponding keys in a secure**\n\n**environment. Using encryption, and services such as Symantec’s Extended Validation (EV)**\n\n**[Code Signing, and Symantec’s Secure App Service can provide additional layers of security.](https://www.symantec.com/code-signing/secure-app-service/)**\n\n**Protection**\n\n**Symantec has the following detections in place to protect against Suckfly’s malware:**\n\n**Antivirus**\n\n**[Backdoor.Nidiran](https://www.symantec.com/security_response/writeup.jsp?docid=2015-120123-5521-99)**\n\n**[Backdoor.Nidiran!g1](http://www.symantec.com/security_response/writeup.jsp?docid=2015-120200-0342-99)**\n\n**[Hacktool](http://www.symantec.com/security_response/writeup.jsp?docid=2001-081707-2550-99)**\n\n**[Exp.CVE-2014-6332](https://www.symantec.com/security_response/writeup.jsp?docid=2014-111313-5510-99)**\n\n**Intrusion prevention system**\n\n**[Web Attack: Microsoft OleAut32 RCE CVE-2014-6332](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=28032)**\n\n**[Web Attack: Microsoft OleAut32 RCE CVE-2014-6332 2](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=27813)**\n\n**[Web Attack: Microsoft OleAut32 RCE CVE-2014-6332 4](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=70116)**\n\n**[Web Attack: OLEAUT32 CVE-2014-6332 3](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=28890)**\n\n**[System Infected: Trojan.Backdoor Activity 120](https://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=28977)**\n\n**Further information**\n\n\n-----\n\n**[visit our Code Signing Information Center.](https://www.symantec.com/page.jsp?id=code-signing-information-center)**\n\n**To learn more about how best to protect your code-signing certificates, read our**\n\n**[whitepaper: Securing Your Private Keys As Best Practice for Code Signing Certificates](https://www.symantec.com/content/en/us/enterprise/white_papers/b-securing-your-private-keys-csc-wp.pdf)**\n\n**Tags: Security, Security Response, Endpoint Protection (AntiVirus), APT, Backdoor.Nidiran,**\n\n**Backdoor.Winnti, black vine, China, code-signing certificates, digital certificate, Hacktool, Hidden Lynx,**\n\n**, plug-x, Stuxnet, Suckfly**\n\n**Subscriptions (0)**\n\n**Jon_DiMaggio**\n\n**View Profile**\n\n\n**[Login or Register to post comments.](https://www-secure.symantec.com/connect/user/login?destination=node%2F3577771)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.03.15.Suckfly/suckfly-revealing-secret-life-your-code-signing-certificates.pdf"
    ],
    "report_names": [
        "suckfly-revealing-secret-life-your-code-signing-certificates"
    ],
    "threat_actors": [
        {
            "id": "aada2650-7bef-45e4-8371-18c4318a7056",
            "created_at": "2022-10-25T15:50:23.422502Z",
            "updated_at": "2025-03-27T02:00:55.465428Z",
            "deleted_at": null,
            "main_name": "Suckfly",
            "aliases": [
                "Suckfly"
            ],
            "source_name": "MITRE:Suckfly",
            "tools": [
                "Nidiran"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a4a3c2a4-992d-4ce6-8c97-e39b23da9a26",
            "created_at": "2022-10-25T16:07:24.242051Z",
            "updated_at": "2025-03-27T02:02:10.148675Z",
            "deleted_at": null,
            "main_name": "Suckfly",
            "aliases": [],
            "source_name": "ETDA:Suckfly",
            "tools": [
                "Backdoor.Nidiran",
                "Nidiran",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "gsecdump",
                "smbscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7b039cc0-33b6-495a-b4ca-649d096b993d",
            "created_at": "2023-01-06T13:46:38.482654Z",
            "updated_at": "2025-03-27T02:00:02.845093Z",
            "deleted_at": null,
            "main_name": "APT22",
            "aliases": [
                "BRONZE OLIVE",
                "Group 46",
                "G0039",
                "Suckfly"
            ],
            "source_name": "MISPGALAXY:APT22",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d0f389f-2f6c-415d-91f4-633bd6c645f7",
            "created_at": "2024-05-01T02:03:07.974188Z",
            "updated_at": "2025-03-27T02:05:17.280317Z",
            "deleted_at": null,
            "main_name": "BRONZE OLIVE",
            "aliases": [
                "Barista",
                "Group 46 ",
                "Suckfly ",
                "APT22 "
            ],
            "source_name": "Secureworks:BRONZE OLIVE",
            "tools": [
                " DestroyRAT",
                " PlugX",
                " TCP/ICMP RAT",
                "Angryrebel"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041765,
    "ts_creation_date": 1458124506,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/e9ab559e5495f776e3ec2ffb46e648fa3b173a5c.pdf",
        "text": "https://archive.orkl.eu/e9ab559e5495f776e3ec2ffb46e648fa3b173a5c.txt",
        "img": "https://archive.orkl.eu/e9ab559e5495f776e3ec2ffb46e648fa3b173a5c.jpg"
    }
}