{
    "id": "079741b0-3fea-454e-b066-1478386933b3",
    "created_at": "2023-01-12T15:08:39.335853Z",
    "updated_at": "2025-03-27T02:16:57.937811Z",
    "deleted_at": null,
    "sha1_hash": "fc767efb2bf9a8444c2deafa2e3339df13d58814",
    "title": "2021-07-06 - The Evolution of PINCHY SPIDER from GandCrab to REvil",
    "authors": "",
    "file_creation_date": "2022-05-28T15:59:55Z",
    "file_modification_date": "2022-05-28T15:59:55Z",
    "file_size": 1380496,
    "plain_text": "# The Evolution of PINCHY SPIDER from GandCrab to REvil\n\n**[crowdstrike.com/blog/the-evolution-of-revil-ransomware-and-pinchy-spider/](https://www.crowdstrike.com/blog/the-evolution-of-revil-ransomware-and-pinchy-spider/)**\n\nAdam Meyers July 6, 2021\n\nFor years, [ransomware was a nuisance that impacted individuals who were unfortunate](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\nenough to encounter it via banking trojans, exploit kits or phishing attacks and resulted in a\nlarge number of small-value ransoms — typically hundreds of dollars per incident.\n\nIn 2016, a terrifying new model began to emerge fueled by reports of high-value ransom\ndemands targeting hospitals and medical facilities that were forced to pay ransoms in the\ntens of thousands of dollars (see: “Ransomware: Understanding the Threat and Exploring\nSolutions,” Statement from Adam Meyers for the Senate Judiciary Committee’s\nSubcommittee on Crime and Terrorism, May 18, 2016). These attacks, which we now call\n[“big game hunting” (BGH), were conducted by well-known criminal groups using existing](https://www.crowdstrike.com/cybersecurity-101/cyber-big-game-hunting/)\nbanking trojans that were repurposed for enterprise ransomware attacks. This model of\nattacking the enterprise illustrates that attackers realized they could make far more money\ngoing after highly targeted organizations. These targets started with healthcare but quickly\nmorphed to large organizations that could calculate downtime in lost revenue, where at some\npoint not long after the attack, the cost of being offline was higher than the ransom demand.\nThis is what the attackers were counting on, and as such we observed manufacturing,\n\n\n-----\n\ntechnology, industrial targets, state and local governments, and school districts all becoming\nattractive targets for big game hunters — organizations and verticals that often lagged\nbroader industry in terms of security sophistication.\n\n## The Advent of RaaS (and Emergence of PINCHY SPIDER)\n\nWhat began with closed specialized groups conducting these attacks soon morphed into\n[ransomware as a service (RaaS), where a small circle of developers with criminal intent](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/)\nwould create a platform for building encrypters and decryptors, and managing the ransom\nnotes and payment portals. These groups would take on affiliates, known in Russian slang\nas “partnerkas,” who would leverage the platform for the actual ransom activity and be\nresponsible for the targeting, deployment and execution of the attack. These affiliates would\nthen share the revenue with the platform operators for the privilege to use the service.\n\nIn early 2018, one such RaaS, named GandCrab by its developers, hit the underground\nmarkets. The early versions of GandCrab had some implementation flaws, and the\ndevelopers learned lessons that helped refine their business model. For example, early\nversions of GandCrab exchanged cryptographic keys insecurely, and organizations that\nrecorded all network sessions could recover the keys. GandCrab operators initially sought\npartners to help them evolve the platform by offering a revenue-sharing model, which\ncontinued to evolve over the years.\n\nSome of the prohibitions for the affiliates of GandCrab included:\n\nTargeting machines in Russia and other Commonwealth of Independent States (CIS)\ncountries (the malware will not infect machines using these keyboards and other\nparameters specific to these countries)\nUsing unverified antivirus scanners\nPublicly listing the admin panel `.onion address`\nReselling accounts\n\nOne of the notable differentiators for GandCrab included payment via the Dash\ncryptocurrency. Shortly after the introduction of GandCrab, the payment portal was\ncompromised, resulting in free decryptors being published. The adversary (i.e., GandCrab\ndeveloper) responded by announcing a version 2.0 would be available as a result, which\nthey made good on within a week.\n\n[CrowdStrike began tracking this ransomware platform developer as PINCHY SPIDER,](https://adversary.crowdstrike.com/en-US/adversary/pinchy-spider/)\nobserving that they continued to innovate with newer versions of the ransomware. Version\n4.2.1 for example was released as a result of an antivirus company releasing a “vaccine” for\nversion 4.1.2, indicating that PINCHY SPIDER actors were continuously monitoring social\nmedia and open sources for discussion of their tools. As the end-of-year holidays rolled\naround in 2018, PINCHY SPIDER announced that they would have limited support during\nthe holidays but would release a new version by the Russian Orthodox Christmas. GandCrab\n\n\n-----\n\noperations continued to improve and develop throughout the first half of 2019, but on May\n31, 2019, they announced, “All good things come to an end,” claiming their affiliates made $2\nbillion USD over the previous year and that PINCHY SPIDER themselves made $150 million\nUSD. They announced that they would be shutting down in 20 days and that victims should\npay or lose their data forever.\n\n## GandCrab Evolves Into REvil\n\nAs the GandCrab samples stopped being identified and the payment portal was\ndecommissioned, another ransomware began to become more prevalent, first identified a\nfew months earlier and known as “Sodinokibi.” This new ransomware shared technical\noverlaps as well as distribution and operational overlaps with GandCrab, leading\n\n\n-----\n\nCrowdStrike Intelligence to suspect these two ransomware were related. By July 2019,\n“REvil” became another name for this new ransomware, which quickly became one of the\nmore prevalent ransomware tools observed.\n\nBy December of 2019, a managed service provider (MSP) became a victim of PINCHY\nSPIDER’s REvil ransomware, demanding a $6 million USD payment. At the time,\nCrowdStrike Intelligence noted they “will likely continue to compromise managed service\nproviders and make use of remote management software to spread REvil ransomware in\norder to ransom many companies from a single point of entry.”\n\nAs the world became impacted by the COVID-19 pandemic in early 2020, PINCHY SPIDER\nstarted capitalizing on a new trend of stealing data and further extorting the victim to pay for\ntheir data to not get publicly leaked, suggesting that victims might be subject to fines due to\nthe EU’s General Data Protection Regulation (GDPR) if they did not pay.\n\nIn May 2021, the Colonial Pipeline ransomware attack made headlines across the globe,\nprompting the U.S. government to make statements about the attack and its implications.\nThis attack was associated with another RaaS known as DarkSide, which CrowdStrike\n[associates with CARBON SPIDER. As a result of the increased attention, PINCHY SPIDER](https://adversary.crowdstrike.com/en-US/adversary/carbon-spider/)\nissued new rules for their REvil RaaS affiliates, including the need to screen potential\nransomware victims prior to infection. Only a few weeks later, PINCHY SPIDER was\nassociated with a second breach targeting JBS, which resulted in additional statements from\nthe U.S. Department of Justice indicating that ransomware investigations would be\nconducted similar to counterterrorism investigations. This prompted someone associated\nwith PINCHY SPIDER to state that they were lifting targeting prohibitions, stating: “It no\n_longer makes sense to avoid working in the United States, all restrictions have been_\n_removed. You can work in all types of activities of a given state.”_\n\n## Protection Against PINCHY SPIDER and REvil\n\nPINCHY SPIDER remains one of the most prevalent threat actors in the ransomware and\ndata extortion space. Protecting against this type of threat requires organizations to get\nserious about security. Hope is not a strategy, and organizations closing their eyes and\nhoping they aren’t going to be hit by ransomware will not work. Here are five things that can\nhelp:\n\n**Secure the enterprise: This is what security experts have been saying for two decades:**\nEnsure that the enterprise is defendable. Implementing sound security methodologies, patch\nmanagement, vulnerability tracking and Zero Trust go a long way to help drive security and\n[make an enterprise a harder target. (See the recent U.S. cybersecurity Executive Order and](https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/)\n[our blog post, “New Cybersecurity Executive Order: What It Means for the Public Sector.”)](https://www.crowdstrike.com/blog/what-the-new-cybersecurity-executive-order-means-for-public-sector/)\n\n\n-----\n\n**Engage the threat: Waiting for the attacker to come to you is a dangerous precedent. Threat**\nhunting ensures that any security incident, no matter how small, is investigated by dedicated\nhunters who go out and look for trouble. If you can engage these threats quickly before they\nelevate privilege or move laterally, you can prevent the ultimate objective, whether that is\ninformation theft or ransomware.\n\n**Next-gen tech: Signature-based antivirus technology doesn’t cut it anymore. Machine**\nlearning classifiers that can determine if something is malicious based on its behavior or\nother observable traits are table stakes for defending the enterprise today.\n\n**Tabletop exercises: You play like you practice. You can have the best backup solution in the**\nworld, but if you have no idea who to call, which systems to bring up first, or have never\ntested the recovery at scale, then you’re doing it for the first time during a major incident. A\ntabletop exercise can help build the muscle memory that an organization needs so that its\nteams know what to do when a situation presents itself. These can be conducted quarterly or\neven monthly and have different scenarios to help ensure that everyone is training for\ndifferent threats.\n\n**Intelligence: There are dozens of different big game hunting adversaries that operate today.**\nUnderstanding how they operate, who they are and what they target can ensure that your\nenterprise defenders are ready for the threat and know what to look for.\n\n**Additional Resources**\n\n_Learn more about PINCHY SPIDER, CARBON SPIDER and other ransomware_\n_[adversaries in the CrowdStrike Adversary Universe.](https://adversary.crowdstrike.com/)_\n_[Download the CrowdStrike 2021 Global Threat Report for more information about](https://www.crowdstrike.com/resources/reports/global-threat-report/)_\n_adversaries tracked by CrowdStrike Intelligence in 2020._\n_[See how the powerful, cloud-native CrowdStrike Falcon® platform protects customers](https://www.crowdstrike.com/endpoint-security-products/)_\n_from DarkSide ransomware in this blog: DarkSide Goes Dark: How CrowdStrike Falcon_\n_Customers Were Protected._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-06 - The Evolution of PINCHY SPIDER from GandCrab to REvil.pdf"
    ],
    "report_names": [
        "2021-07-06 - The Evolution of PINCHY SPIDER from GandCrab to REvil.pdf"
    ],
    "threat_actors": [
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536119,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653753595,
    "ts_modification_date": 1653753595,
    "files": {
        "pdf": "https://archive.orkl.eu/fc767efb2bf9a8444c2deafa2e3339df13d58814.pdf",
        "text": "https://archive.orkl.eu/fc767efb2bf9a8444c2deafa2e3339df13d58814.txt",
        "img": "https://archive.orkl.eu/fc767efb2bf9a8444c2deafa2e3339df13d58814.jpg"
    }
}