{
    "id": "07fd9684-a988-4661-b57d-d678a842e241",
    "created_at": "2023-01-12T15:09:16.595719Z",
    "updated_at": "2025-03-27T02:16:25.509629Z",
    "deleted_at": null,
    "sha1_hash": "5b8517489c1b4487a010493dd936703cfc266047",
    "title": "2019-06-06 - Google confirms that advanced backdoor came preinstalled on Android devices",
    "authors": "",
    "file_creation_date": "2022-05-28T01:56:15Z",
    "file_modification_date": "2022-05-28T01:56:15Z",
    "file_size": 175000,
    "plain_text": "# Google confirms that advanced backdoor came preinstalled on Android devices\n\n**arstechnica.com/information-technology/2019/06/google-confirms-2017-supply-chain-attack-that-sneaked-backdoor-**\non-android-devices/\n\nDan Goodin\n\n[Alexandre Dulaunoy / Flickr](https://www.flickr.com/photos/adulau/8442476626/)\nCriminals in 2017 managed to get an advanced backdoor preinstalled on Android devices\nbefore they left the factories of manufacturers, Google researchers confirmed on Thursday.\n\n[Triada first came to light in 2016 in articles published by Kaspersky here and](https://www.kaspersky.com/blog/triada-trojan/11481/) [here, the first of](https://securelist.com/everyone-sees-not-what-they-want-to-see/74997/)\nwhich said the malware was \"one of the most advanced mobile Trojans\" the security firm's\nanalysts had ever encountered. Once installed, Triada's chief purpose was to install apps\nthat could be used to send spam and display ads. It employed an impressive kit of tools,\nincluding rooting exploits that bypassed security protections built into Android and the means\nto modify the Android OS' all-powerful Zygote process. That meant the malware could\ndirectly tamper with every installed app. Triada also connected to no fewer than 17 command\nand control servers.\n\nIn July 2017, security firm Dr. Web reported that its researchers had found Triada built into\nthe firmware of several Android devices, including the Leagoo M5 Plus, Leagoo M8, Nomu\nS10, and Nomu S20. The attackers used the backdoor to surreptitiously download and install\n\n\n-----\n\nmodules. Because the backdoor was embedded into one of the OS libraries and located in\nthe system section, it couldn't be deleted using standard methods, the report said.\n\nOn Thursday, Google confirmed the Dr. Web report, although it stopped short of naming the\nmanufacturers. Thursday's report also said the supply chain attack was pulled off by one or\nmore partners the manufacturers used in preparing the final firmware image used in the\naffected devices. Lukasz Siewierski, a member of Google's Android Security & Privacy\nTeam, wrote:\n\nTriada infects device system images through a third party during the production\nprocess. Sometimes OEMs want to include features that aren't part of the Android\nOpen Source Project, such as face unlock. The OEM might partner with a third party\nthat can develop the desired feature and send the whole system image to that vendor\nfor development.\n\nBased on analysis, we believe that a vendor using the name Yehuo or Blazefire\ninfected the returned system image with Triada.\n\n[Enlarge / Production process with a third party used by affected manufacturers.](https://cdn.arstechnica.net/wp-content/uploads/2019/06/productionProcess.png)\n[Google](https://1.bp.blogspot.com/-JtE3x0DI2KU/XPlFKc4LwyI/AAAAAAAAAl8/C8p5JqKW0twHQKk9upF0itlUV_xK-G5mACLcBGAs/s640/productionProcess.png)\nThursday's post also expanded on previous analysis of the features that made Triada so\nsophisticated. For one, it used XOR encoding and ZIP files to encrypt communications. And\nfor another, it injected code into the system user interface app that allowed ads to be\ndisplayed. The backdoor also injected code that allowed it to use the Google Play app to\ndownload and install apps of the attackers' choice.\n\n\n-----\n\nThe apps were downloaded from the C&C server, and the communication with the C&C was\nencrypted using the same custom encryption routine using double XOR and zip,\" Siewierski\nwrote. \"The downloaded and installed apps used the package names of unpopular apps\navailable on Google Play. They didn't have any relation to the apps on Google Play apart\nfrom the same package name.\"\n\nMike Cramp, senior security researcher at mobile security provider Zimperium, agreed with\nthe assessments that Triada's capabilities were advanced.\n\n\"From the looks of it, Triada seems to be a relatively advanced piece of malware including\nC&C capabilities, and in the beginning, shell execution capabilities,\" Cramp wrote in an\nemail. \"We do see a lot of adware, but Triada is different in that it uses C&C and other\ntechniques that we would usually see more in the malicious malware side of things. Yes, this\nis all used to ultimately deliver ads, but the way they go about it is more sophisticated than\nmost adware campaigns. It pretty much is an 'adware on steroids.'\"\n\nSiewierski said Triada developers resorted to the supply-chain attack after Google\nimplemented measures that successfully beat back the backdoor. One was mitigations that\nprevented its rooting mechanisms from working. A second measure was improvements in\nGoogle Play Protect that allowed the company to remotely disinfect compromised phones.\n\nThe Triada version that came preinstalled sometime in 2017 didn't contain the rooting\ncapabilities. The new version was \"inconspicuously included in the system image as thirdparty code for additional features requested by the OEMs.\" Google has since worked with\nthe manufacturers to ensure the malicious app was removed from the firmware image.\n\n## Not the first time\n\nLast year, Google implemented a program that requires manufacturers to submit new or\nupdated build images to a build test suite.\n\n\"One of these security tests scans for pre-installed PHAs [potentially harmful applications]\nincluded in the system image,\" Google officials wrote in their Android Security & Privacy\n2018 Year In Review report. \"If we find a PHA on the build, we work with the OEM partner to\nremediate and remove the PHA from the build before it can be offered to users.\"\n\nStill, Thursday's report acknowledges that, as Google tightens security in one area, attackers\nare sure to adapt by exploiting new weaknesses.\n\n\"The Triada case is a good example of how Android malware authors are becoming more\nadept,\" Siewierski wrote. \"This case also shows that it's harder to infect Android devices,\nespecially if the malware author requires privilege elevation.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-06 - Google confirms that advanced backdoor came preinstalled on Android devices.pdf"
    ],
    "report_names": [
        "2019-06-06 - Google confirms that advanced backdoor came preinstalled on Android devices.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536156,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653702975,
    "ts_modification_date": 1653702975,
    "files": {
        "pdf": "https://archive.orkl.eu/5b8517489c1b4487a010493dd936703cfc266047.pdf",
        "text": "https://archive.orkl.eu/5b8517489c1b4487a010493dd936703cfc266047.txt",
        "img": "https://archive.orkl.eu/5b8517489c1b4487a010493dd936703cfc266047.jpg"
    }
}