{
    "id": "083550a7-a738-4812-b013-e31d0dfc71f3",
    "created_at": "2023-01-12T15:01:34.096518Z",
    "updated_at": "2025-03-27T02:05:20.560872Z",
    "deleted_at": null,
    "sha1_hash": "d6268aae4e4b48b013455d16c72da668907f46ac",
    "title": "2021-06-07 - Ransomware Struck Another Pipeline Firm—and 70GB of Data Leaked",
    "authors": "",
    "file_creation_date": "2022-05-28T02:06:48Z",
    "file_modification_date": "2022-05-28T02:06:48Z",
    "file_size": 1651174,
    "plain_text": "# Ransomware Struck Another Pipeline Firm—and 70GB of Data Leaked\n\n**wired.com/story/linestar-pipeline-ransomware-leak**\n\nAndy Greenberg June 7, 2021\n\nWhen ransomware hackers [hit Colonial Pipeline last month and](https://www.wired.com/story/colonial-pipeline-ransomware-attack/) shut off the distribution of\ngas along [much of the East Coast of the United States, the world woke up to the danger of](https://www.wired.com/story/colonial-pipeline-mess-tanker-trucks-come-to-rescue/)\ndigital disruption of the petrochemical pipeline industry. Now it appears another pipelinefocused business was also hit by a ransomware crew around the same time, but kept its\nbreach quiet—even as 70 gigabytes of its internal files were stolen and dumped onto the\ndark web.\n\nA group identifying itself as Xing Team last month posted to its dark web site a collection of\nfiles stolen from LineStar Integrity Services, a Houston-based company that sells auditing,\ncompliance, maintenance, and technology services to pipeline customers. The data, first\n[spotted online by the WikiLeaks-style transparency group Distributed Denial of Secrets, or](https://www.wired.com/story/ddosecrets-blueleaks-wikileaks/)\nDDoSecrets, includes 73,500 emails, accounting files, contracts, and other business\ndocuments, around 19 GB of software code and data, and 10 GB of human resources files\nthat includes scans of employee driver's licenses and Social Security cards. And while the\nbreach doesn't appear to have caused any disruption to infrastructure like the Colonial\nPipeline incident, security researchers warn the spilled data could provide hackers a\nroadmap to more pipeline targeting.\n\n\n-----\n\n[DDoSecrets, which makes a practice of trawling data leaked by ransomware groups as part](https://www.wired.com/story/ddosecrets-ransomware-leaks/)\nof its mission to expose data it deems worthy of public scrutiny, published 37 gigabytes of the\ncompany's data to its leak site on Monday. The group says it was careful to redact potentially\nsensitive software data and code—which DDoSecrets says could enable follow-on hackers\nto find or exploit vulnerabilities in pipeline software—as well as the leaked human resources\nmaterial, in an effort to leave out LineStar employees' sensitive, personally identifiable\ninformation.\n\nBut the unredacted files, which WIRED has reviewed, remain online. And they may include\ninformation that could enable follow-on targeting of other pipelines, argues Joe Slowik, a\nthreat intelligence researcher for security firm Gigamon who has focused on critical\ninfrastructure security for years as the former head of incident response at Los Alamos\nNational Labs. While Slowik notes that it's still not clear what sensitive information might be\nincluded in the leak's 70 GB, he worries that it could include information about the software\narchitecture or physical equipment used by LineStar's customers, given that LineStar\nprovides information technology and industrial control system software to pipeline customers.\n\n\"You can use that to fill in lots of targeting data, depending on what's in there,\" says Slowik.\n\"It's very concerning, given the potential that it's not just about people's driver's license\ninformation or other HR related items, but potentially data that relates to the operation of\nthese networks and their more critical functionality.\"\n\nXing Team is a relatively new entrant to the ransomware ecosystem. But while the group\nwrites its name with a Chinese character on its dark web site—and comes from the Mandarin\nword for “star”—there's little reason to believe the group is Chinese based on that name\nalone, says Brett Callow, a ransomware-focused researcher with antivirus firm Emsisoft.\nCallow says he's seen Xing Team use the rebranded version of Mount Locker malware to\nencrypt victims' files, as well as threaten to leak the unencrypted data as a way to extort\ntargets into paying. In the case of LineStar, Xing Team appears to have followed through on\nthat threat.\n\nThat leak could in turn serve as a stepping stone for other ransomware hackers, who\nfrequently comb dark web data dumps for information that can be used to impersonate\ncompanies and target their customers. \"If you were to steal data from a pipeline company,\nthat could possibly enable you to construct a fairly conventional spearphishing email to\nanother pipeline company,\" says Callow. \"We absolutely know that groups do that.\"\n\nLineStar did not respond to multiple requests for comment prior to publication, but sent an\nemailed statement several hours after this story went live. \"LineStar is a small, private\ncompany and we were the victim of a ransomware attack in late April that targeted corporate\ndata. There was no impact to either internal or customer operations,\" said LineStar CFO\nChris Boston in the statement. \"Immediately following the attack, we notified our employees\nof a potential breach involving employee personal information, engaged third-party IT experts\nand notified the FBI. We have been taking every reasonable measure to protect our\n\n\n-----\n\nemployees while responding to an internal data breach and subsequent theft. Boston further\nclaimed that \"comparisons made\" in this story were \"completely inaccurate and provably\nuntrue,\" but did not provide any specific objections.\n\nDDoSecrets' practice of republishing the leaked data of ransomware victims—even in a\n[redacted form—has been criticized for amplifying ransomware groups' coercive techniques.](https://www.wired.com/story/ddosecrets-ransomware-leaks/)\nBut the group's cofounder Emma Best, who uses the pronoun \"they,\" argues that doing so for\nthe LineStar leak in particular helps to shine a spotlight on an industry with a long record of\nenvironmental scandals. The Colonial Pipeline itself leaked 1.2 million gallons of gasoline\ninto a nature preserve in North Carolina less than a year prior to being targeted by\nransomware, Best points out. “To torture a metaphor, fuel is the fuel of our economy, but it's\nalso a poison when they frequently leak or the pipeline's construction, operation, or\nmaintenance infringe on communities, typically already marginalized ones,” Best told WIRED\nin a text interview.\n\nBest notes that even the shutdown of the pipeline following Colonial's ransomware incident in\nMay, which triggered gas shortages across the East Coast, wasn't primarily due to safety\nconcerns, but [business and billing issues. \"This isn't an industry that has the public interest](https://zetter.substack.com/p/biden-declares-state-of-emergency)\nat heart,\" Best writes. They didn't confirm if they had found any evidence of wrongdoing in\nthe leaked LineStar files, but argue that it's noteworthy either way. \"With some industries, you\nhave to stop and study them regardless of individual wrongdoing because the industry itself\nis either so inherently harmful or fraught with danger that to not study it would be reckless.\"\n\nThe breach of a second pipeline firm by ransomware operators after Colonial's shutdown\nmay seem to signal a trend of cybercriminal hackers specifically targeting critical\ninfrastructure. But Emsisoft's Brett Callow points out that ransomware groups like Xing Team\nare targeting companies mostly indiscriminately, casting a wide net as they seek to maximize\ntheir ransom payments.\n\n“There has been a lot of talk about critical infrastructure being targeted in this war-like\nsituation, but that is really bullshit,” Callow says. “They are just going after everybody. It's a\nfeeding frenzy.”\n\nThat hacking epidemic, however, now extends to the industrial backbone of the American\neconomy. And with the breach of a company that serves as a hub of one such industry, the\nstakes are only getting higher.\n\n_Updated 6/8/21 4:00pm EST with a comment from LineStar._\n\nMore Great WIRED Stories\n\n📩 The latest on tech, science, and more: [Get our newsletters!](https://www.wired.com/newsletter?sourceCode=BottomStories)\n[Freedom, mayhem, and the uncertain future of Revel mopeds](https://www.wired.com/story/revel-electric-mopeds-freedom-mayhem-uncertain-future/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[The hostile takeover of a Microsoft Flight Simulator server](https://www.wired.com/story/hostile-takeover-microsoft-flight-simulator/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n\n\n-----\n\n[Goodbye Internet Explorer—and good riddance](https://www.wired.com/story/internet-explorer-browser-dead/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[How to take a slick, professional headshot with your phone](https://www.wired.com/story/how-to-professional-headshot-smartphone-camera/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[Online dating apps are actually kind of a disaster](https://www.wired.com/story/online-dating-apps-are-a-disaster/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[👁 Explore AI like never before with our new database](https://www.wired.com/category/artificial-intelligence/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n🎮 WIRED Games: Get the latest [tips, reviews, and more](https://www.wired.com/tag/video-games/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n✨ Optimize your home life with our Gear team’s best picks, from [robot vacuums to](https://www.wired.com/gallery/best-robot-vacuums/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[affordable mattresses to](https://www.wired.com/gallery/best-mattresses/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc) [smart speakers](https://www.wired.com/gallery/best-google-speakers-buying-guide/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-07 - Ransomware Struck Another Pipeline Firm—and 70GB of Data Leaked.pdf"
    ],
    "report_names": [
        "2021-06-07 - Ransomware Struck Another Pipeline Firm—and 70GB of Data Leaked.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535694,
    "ts_updated_at": 1743041120,
    "ts_creation_date": 1653703608,
    "ts_modification_date": 1653703608,
    "files": {
        "pdf": "https://archive.orkl.eu/d6268aae4e4b48b013455d16c72da668907f46ac.pdf",
        "text": "https://archive.orkl.eu/d6268aae4e4b48b013455d16c72da668907f46ac.txt",
        "img": "https://archive.orkl.eu/d6268aae4e4b48b013455d16c72da668907f46ac.jpg"
    }
}