{
    "id": "0840a5d6-ebed-4bf9-9268-57c4e7739fd4",
    "created_at": "2023-01-12T15:06:01.162522Z",
    "updated_at": "2025-03-27T02:06:08.759649Z",
    "deleted_at": null,
    "sha1_hash": "2b3505e6a03bf576b4be517dc9bacd343430845c",
    "title": "2017-02-05 - Detailed threat analysis of Shamoon 2.0 Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T17:30:28Z",
    "file_modification_date": "2022-05-28T17:30:28Z",
    "file_size": 2239675,
    "plain_text": "# Detailed threat analysis of Shamoon 2.0 Malware\n\n**[vinransomware.com/blog/detailed-threat-analysis-of-shamoon-2-0-malware](http://www.vinransomware.com/blog/detailed-threat-analysis-of-shamoon-2-0-malware)**\n\nGregory Paul and Shaunak\n\nOur [Previous post talked about the](https://www.vinransomware.com/blog/quick-threat-analysis-of-shamoon2-jan17-malware) [initial overview of the Shamoon 2.0 sample. This analysis is a continuation of our last](https://www.vinransomware.com/blog/quick-threat-analysis-of-shamoon2-jan17-malware)\npost but with a more insight on the working and behavior of the malware.\n\nThere are 3 components which are linked with one another which makeup Shamoon 2.0 single malware. We have\nanalyzed each component according to the stages which the Shamoon 2.0 uses for infection on a victim's machine i.e.\nDropper Component⇒ Communication Component⇒ Wiper Component.\n\n[When Shamoon 1.0 made its first wave of attack in August 2012, it had not just infected 30,000-35,000 computers but it](http://www.bbc.com/news/technology-19293797)\nalso had crippled the entire organizations altogether which were infected with it. Its effects were seen post attack as\nmany computers were still working irregularly and the time that required to restore the organization's full functionality led\nto huge loss in not just terms of money but also in terms of company’s reputation too.\n\nThe second wave Shamoon which is dubbed as Shamoon 2.0 used the similar approach which it had used previously\nbut this time it is predicted that the amount of infection of computers will be more, since last time the attackers were able\nto retrieve the credentials of users for various organization, The second wave will be using the stolen credentials from\nthe previous attack and the reason this attack is bound to be success is because of lack of awareness among the\nemployees on securing passwords. One survey about the Middle East reports some of the facts mentioned below:\n\n- More than 70 percent of the users said that they were storing administrative passwords in plaintext.\n\n- Over 45 percent of the users use the same password for over multiple systems.\n\n- More than 40 percent users share their passwords.\n\n- Only 13 percent users change their passwords once a month.\n\nThese facts make the Middle East region more easy as a target for Shamoon 2.0. We have launched a Shamoon\ndetection tool which can detect the new Shamoon 2.0.\n\nFollowing below is the in-depth analysis that we have done on Shamoon 2.0.\n\n**Dropper Component - Disttrack:**\n\nUpon computing the hash value of the sample, the SHA256 as\n394a7ebad5dfc13d6c75945a61063470dc3b68f7a207613b79ef000e1990909b\n\n**Doing a quick VirusTotal search we get the following output:**\n\n\n-----\n\nThis assures us that the sample we are analyzing is of Shamoon 2.0. The date of update also tells us that it is the recent\nShamoon sample which is dubbed as the Shamoon 2.0.\n\n**The sample uses the following evasion techniques for Debugging:**\n\n1)  GetLastError\n2)  IsDebuggerPresent\n3)  Process32FirstW\n4)  Process32NextW\n5)  TerminateProcess\n6)  UnhandledExceptionFilter\nThe following screenshot gives information of the which compiler was used for compiling the malware, which entry point\naddress is being used, EP section tells us the entry point of the portable executable (PE).\n\nAs mentioned earlier above the compiler used is Microsoft Visual C++ v8.0 2005\n\nMalware in general use some basic techniques to obfuscate the code so that it is not easily readable when loaded in any\ndebugger and to make it more difficult to reverse the malware. There are many Hashing methods that can be used. Our\nsample uses the Hash technique known as\n\n**Base64.**\n\n\n-----\n\nWe know that Shamoon 2.0 was targeted the Middle East region. The following screenshot is the evidence that this\nmalware is specifically looking for Arabic -Yemen [ar] (ar-ye) language settings.\n\nSo the malware looks into the keyboard layout and the ID mentioned is in the reference of the keyboard layout, for\nexample ID:1033 corresponds to the English-US [en] (en-us), here we find that the language is of the\n\n**ID: 9217 i.e.Arabic -Yemen [ar] (ar-ye).**\n\nThe following file\n\noperations that took place during the execution of the malware are listed as following:\n1. File-Read\nC:\\Documents and Settings\\student\\LocalSettings\\Temp\\Shamoon394a7ebad5dfc13d6c75945a61063470dc3b68f7a207613b79ef000e1990909b.bin\n\n2. File-Opened\nC:\\Documents and Settings\\student\\LocalSettings\\Temp\\Shamoon394a7ebad5dfc13d6c75945a61063470dc3b68f7a207613b79ef000e1990909b.bin\n\nC:\\WINDOWS\\system32\\kernel32.dll\n\n3. Registry Key-Read\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\GRE_Initialize\\DisableMetaFiles\n\n**Communication Component - Disttrack:**\n\nUpon computing the hash value of the sample, the SHA256 as\n**61c1c8fc8b268127751ac565ed4abd6bdab8d2d0f2ff6074291b2d54b0228842, doing a quick VirusTotal search we**\nverified the sample as a part of the Shamoon 2.0\n\n\n-----\n\nFollowing screenshot shows that communication component has the same hash technique as that seen in the dropper\ncomponent mentioned earlier, i.e. Base64.\n\nSince communication component is a part of the Shamoon 2.0 components it will have same compiler used\n\nFor compiling the communication component as well which is shown in the screenshot below:\n\nDuring our analysis, we found that the communication component made many changes in the Registry values of the\ninfected system, these changes are mentioned below:\n**Registry Key - Opened**\n\n1) HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\DnsCache\\Parameters\n2) HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\Windows NT\\DnsClient\n\n\n-----\n\n3) HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\Windows NT\\Rpc\n4)HKEY_LOCAL_MACHINE\\Software\\Microsoft\\WindowsNT\\CurrentVersion\\ImageFile\nExecutionOptions\\61c1c8fc8b268127751ac565ed4abd6bdab8d2d0f2ff6074291b2d54b0228842.exe\\RpcThreadPoolThrottle\n5) HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\LDAP\n6) HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\System\\DNSClient\n7) HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Rpc\n8) HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Tcpip\\Parameters\n9) HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Rpc\\PagedBuffers\n10) HKEY_LOCAL_MACHINE\\System\\Setup\n\n**Registry Key - Read**\n\n1. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\UseDomainNameDevolution\n2. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\ServerPriorityTimeLimit\n3. HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Rpc\\MaxRpcSize\n4. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\WaitForNameErrorOnAll\n5. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DnsQuickQueryTimeouts\n6. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DefaultRegistrationRefreshInterval\n7. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegisterWanAdapters\n8. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\DomainNameDevolutionLevel\n9. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\AppendToMultiLabelName\n10. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DisableAdapterDomainName\n11. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegisterPrimaryName\n12.\nHKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\EnableAdapterDomainNameRegistration\n13. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\UpdateTopLevelDomainZones\n14. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\FilterClusterIp\n15. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\DnsTest\n16. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\ScreenUnreachableServers\n17. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\MulticastListenLevel\n18. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\MaxNegativeCacheTtl\n19. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\QueryAdapterName\n20. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\PrioritizeRecordData\n21. HKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\SystemSetupInProgress\n22. HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\GRE_Initialize\\DisableMetaFiles\n23.\nHKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DisableReverseAddressRegistrations\n24. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\MaxCacheTtl\n25. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\UpdateSecurityLevel\n26. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\MaxCachedSockets\n27. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegistrationEnabled\n28. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegisterAdapterName\n29. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\AdapterTimeoutLimit\n30. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\UpdateSecurityLevel\n31. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegistrationMaxAddressCount\n32. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DefaultRegistrationTTL\n33. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DisableDynamicUpdate\n34. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\Hostname\n35. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\AllowUnqualifiedQuery\n36. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\UpdateZoneExcludeFile\n37. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\PrioritizeRecordData\n38. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegistrationTtl\n39. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\UseHostsFile\n40 HKEY LOCAL MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\AllowUnqualifiedQuery\n\n\n-----\n\n41. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegistrationRefreshInterval\n42. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DnsQueryTimeouts\n43. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\QueryIpMatching\n44. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DnsNbtLookupOrder\n45. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\MaxCacheSize\n46. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\UseDomainNameDevolution\n47. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\UseEdns\n48. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\Domain\n49. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\ldap\\LdapClientIntegrity\n50. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DisableWanDynamicUpdate\n51. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DnsMulticastQueryTimeouts\n52. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\ScreenBadTlds\n53. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\RegisterReverseLookup\n54. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\MaxNumberOfAddressesToRegister\n55. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Dnscache\\Parameters\\MulticastSendLevel\n56. HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\Tcpip\\Parameters\\DomainNameDevolutionLevel\n\nThese above results only indicate that the malware sample tries to communicate with the server.\n\n**Wiper Component - Disttrack:**\n\nThe wiper component is the most important component out of the three components of Shamoon 2.0. Upon computing\nthe hash value of the sample, the SHA256 as\n**128fa5815c6fee68463b18051c1a1ccdf28c599ce321691686b1efa4838a2acd.**\n\nA quick look up with VirusTotal confirms that this indeed is a wiper component of the Shamoon 2.0.\n\nInitial analysis shows us that apart from using the anti-debugging techniques this component also uses Anti-VM tricks\nwhich was not seen pervious dropper sample and communication sample.\n\nVMCheck.dll is a technique used to check if the sample is in a Virtual machine or not.\n\n\n-----\n\nJust similar to the Dropper component and Communication component, we find that the Wiper component uses\n**Microsoft Visual C++ v8.0 2005 shown in the screenshot below.**\n\nHowever, what is different in the Wiper component, which is not present in the dropper or the communication component\nis it uses and additional hash/crypt function along with the Base64. i.e. CryptEncrypt Function is also used. The\nscreenshot below shows this, which only means that the malware developers really wanted the make this wiper\ncomponent not more difficult to understand for researchers but also much more obfuscated than the other components\nthat we discussed above, as obfuscated codes are not detected by Antivirus companies easily.\n\nThe language component remains same as that of the dropper with the default English option included as shown below:\n\nIn context of the registry changes that the Wiper does is same as it did with the Dropper component:\n**Registry Key-Read**\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\GRE_Initialize\\DisableMetaFiles\n\n\n-----\n\nThe cryptbase.pdb which contains all the necessary information about the encryption techniques, Keys on encryption\nand other functions are linked in the following way with the code of the wiper sample:\n\nOne more file that we analyzed was which had links to the Shamoon 2.0 was with the SHA256 hash as\n**5a826b4fa10891cf63aae832fc645ce680a483b915c608ca26cedbb173b1b80a.**\n\nDoing a VirusTotal lookup gives us the following confirmation that the software is malicious in nature and that the\ndetection ratio is very low as well.\n\nNow the preliminary analysis shows us the following files that were found:\n\nExecutable     ntoskrnl.exe\nDatabase      c:\\projects\\rawdisk\\bin\\wnet\\fre\\amd64\\elrawdsk.pdb\n\n\n-----\n\nDuring the analysis for the file we found the following device name parameters\n\n\\#{9A6DB7D2-FECF-41ff-9A92-6EDA696613DF}#\n\\#{8A6DB7D2-FECF-41ff-9A92-6EDA696613DE}#\n\nThe interesting thing is that, this same details were also found in the previous Shamoon attack that took place in 2012.\n\nWe also came across these ‘060523170051Z’ and ‘160523171051Z0W1’ strings. The interesting thing about these\nnumbers is that they are found in a different malware which has a file name ‘mimidrv.sys’. The screenshot of that\nmalware is mentioned below.\n\nThis malware mentioned above is basically a ‘hacktool’ Trojan as identified by the other Antivirus companies. There are\nchances that this is another behavior that our sample also behaves like the sample mentioned below.\n\nWe find that the Mimikatz malware is related with the PowerShell. We had found out the same PowerShell which we\n**had reported in our previous blog. Hence the Shamoon 2.0 has some behaviour with PowerShell. Following screenshot**\nshows the PowerShell commands that Shamoon 2.0 executes:\n\n\n-----\n\nFrom the evidence collected we confirm links between the Shamoon 1.0 to Shamoon 2.0.\nSome features that were observed with this sample are that it is using an overlay to hid the packer information:\n\nAnalysing further, we found out the MEW 10v1.0 from Northfox packer is used:\n\nUnlike the components that we analyzed so far this particular sample had the CRC16 Hash function which is completely\ndifferent.\n\n\n-----\n\nThe malware has a SSL certificate embedded within it. The following screenshot gives the SLL certificate information,\n\nThe certificate is valid from Monday,January 11, 2010 7:49.26 PM to Friday, January 11 2013 7:49:26 PM\n\nThis above date correlates to the hard-coded date inside the program. This hardcoded date allows the program to\nexecute since the date is inside the validity period as mentioned.\n\nThe pseudo code explains that Shamoon 2.0 changes the system time, and sets it at random time and date between\nMonday, January 11, 2010 7:49.26 PM to Friday, January 11 2013 7:49:26 PM.\n\n**The above code is derived from this code flow:**\n\n\n-----\n\nThe reason for Shamoon 2.0 changes the time and date settings is because we found out that Shamoon 2.0 uses a\ncommercial product which the malware developers are using which is as called RawDisk by EldoS Corporation. This\nsoftware gives direct access to files, disk and partitions. The temporary license key for this product is between the time\nmentioned earlier and hence Shamoon 2.0 changes the system time to make the product believe into thinking that it is\nusing a valid key, and thus the overwrite function can take place.\n\n**The MBR-Overwriting Techniques that Shamoon 2.0 Implements:**\n\nBefore explaining the MBR overwriting that the Shamoon 2.0 does we need to understand what is an MBR or the Master\nBoot Record (MBR). MBR usually is the first 512 bytes of the disk which consists of all the important and crucial\ninformation about the data in the disk. The breakdown of the 512 bytes is as shown below:\nThe reason of overwriting the first 512 bytes of data is\n\nBootstrap code area 446 bytes\n\n\nPartition entry 1\nPartition entry 2\nPartition entry 3\nPartition entry 4\n\n\nPartition table (for primary partitions) 16 bytes x 4 (partitions)\n\n\nBoot signatureBoot signature 2 bytes\n\nTotal 512 bytes\n\n\n-----\n\nSo, that in simple terms mean that target the MBR and lose all data rather than wiping the entire drive all-together.\n\nThe following screenshot is a pseudo-code for the MBR-overwrite method that the Shamoon 2.0 uses.\n\nAs seen the code above there is a comparison of a variable with ‘69’. The ASCII equivalent of 69 is ‘E’\nSo, the way the code works in 3 simple steps:\n\n1. Reads the data from the location to overwrite.\n2. Uses an XOR table to corrupt the data\n3. Write back the XOR’ed values to the location where it read the original data from.\n\nThe Above code is derived from the following structure of code:\n\nAnd the XOR operations which are responsible for overwriting/wiping the data are in the cascading representations\nas shown in the image below:\n\n\n-----\n\nOne more module code that we can observe is from the ElRawDisk sample is shown below that shows the correlation\nbetween the actual code and the functionality and working in a pseudo - c code.\n\nThis particular snippet shows how the IoDeleteDevice routine removes a device object from the system, once the MBR\nis overwritten. This IODeleteDevice routine sends a message to the system notifying that a hard-drive or device is\nremoved, this message is sent because after the MBR is overwritten the system cannot read the drive and this routine\ntells the system that the device is disconnected from the system and hence the system does not further communicate\nwith the drive. Therefore, the drive is no longer visible on the system.\n\n**Conclusion**\n\nFrom the whole analysis, we now can say the following behaviour. The Shamoon sample that is currently spreading is\nnot very different from what spread in its first attack of August 2012. There is a lot of similarity in the previous sample\nand the new sample. But the new sample is more destructive than the older one. The modules which are split into\nDropper, Communication, Wiper are independent and yet linked with one another. From the analysis, we can say that the\nwiper component is the most important out of the three.\n\nThe first stage that the Shamoon 2.0 does it that it checks the system date and compares it with the date embedded. If\nthe date matches it proceeds towards the deletion stage but, otherwise Shamoon 2.0 changes the date into a date which\nis acceptable to the malware sample and then proceeds to the infection.\n\nThe wiper is does not only overwrites the MBR (Master-Boot-Record), but also uses the IODevices module to trigger\nalerts to the compromised system about the device module being removed from the system altogether making the\nsystem completely useless to the user.\n\nThe language detected as Arabic Yemen shows that it's a targeted attack towards Middle East.\n\n**Indicators of Compromise - SHA 256 hash values**\n\n5a826b4fa10891cf63aae832fc645ce680a483b915c608ca26cedbb173b1b80a\n\n\n-----\n\nc7fc1f9c2bed748b50a599ee2fa609eb7c9ddaeb9cd16633ba0d10cf66891d8a\n47bb36cd2832a18b5ae951cf5a7d44fba6d8f5dca0a372392d40f51d1fe1ac34\n61c1c8fc8b268127751ac565ed4abd6bdab8d2d0f2ff6074291b2d54b0228842\n128fa5815c6fee68463b18051c1a1ccdf28c599ce321691686b1efa4838a2acd\n394a7ebad5dfc13d6c75945a61063470dc3b68f7a207613b79ef000e1990909b\n\n[We have launched a Shamoon detection tool which can detect the new Shamoon 2.0.](https://www.vinransomware.com/blog/paramounts-releases-new-shamoon-detection-tool)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-02-05 - Detailed threat analysis of Shamoon 2.0 Malware.pdf"
    ],
    "report_names": [
        "2017-02-05 - Detailed threat analysis of Shamoon 2.0 Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "084e4456-1409-4664-9bc4-ceb6f6aacc20",
            "created_at": "2022-10-25T16:47:55.565006Z",
            "updated_at": "2025-03-27T02:05:17.263141Z",
            "deleted_at": null,
            "main_name": "BRONZE EXPORT",
            "aliases": [
                "Wicked Spider ",
                "TG-3279 "
            ],
            "source_name": "Secureworks:BRONZE EXPORT",
            "tools": [
                " PwDump",
                " pwdump6",
                "Conpee"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "273a41a8-5115-4f55-865f-0960a765f18c",
            "created_at": "2022-10-25T16:07:24.397947Z",
            "updated_at": "2025-03-27T02:02:10.208221Z",
            "deleted_at": null,
            "main_name": "Wicked Spider",
            "aliases": [
                "APT 22",
                "Bronze Export",
                "Bronze Olive",
                "Wicked Spider"
            ],
            "source_name": "ETDA:Wicked Spider",
            "tools": [
                "Agent.dhwf",
                "AngryRebel",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EternalBlue",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "Kaba",
                "Korplug",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535961,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653759028,
    "ts_modification_date": 1653759028,
    "files": {
        "pdf": "https://archive.orkl.eu/2b3505e6a03bf576b4be517dc9bacd343430845c.pdf",
        "text": "https://archive.orkl.eu/2b3505e6a03bf576b4be517dc9bacd343430845c.txt",
        "img": "https://archive.orkl.eu/2b3505e6a03bf576b4be517dc9bacd343430845c.jpg"
    }
}