{
    "id": "08457ea2-1da6-4c6f-8a43-a0df32e609f0",
    "created_at": "2024-11-18T02:05:11.719377Z",
    "updated_at": "2025-03-27T02:17:05.783828Z",
    "deleted_at": null,
    "sha1_hash": "c3741a7afdab5451c0e0b74daa3191007f40f9ae",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-05-08T08:37:04Z",
    "file_modification_date": "2024-05-08T08:37:05Z",
    "file_size": 543269,
    "plain_text": "# M-Trends\n\n#### 2024 Special Report\n\n## Chinese Espionage Operations\n Targeting The Visibility Gap \n\nEndpoint detection and response (EDR) platforms have become commonplace among companies seeking to expand the visibility\ninto endpoint activity necessary to provide a baseline of security monitoring. This increase in visibility has forced attackers to\nevolve in order to maintain operational efficacy. While some attackers have invested in EDR bypass techniques, others have,\ninstead, chosen to focus on areas of the corporate environment where in-depth visibility remains uncommon. While EDR agents\nhave become a standard part of security deployments, many specialized appliances that either segment or host assets critical to\nthe organization often lack similar levels of visibility. These systems have become a new preferred safe haven for attackers as it\nenables them to maintain long-term persistence with lower risk of detection due to the gap in visibility.\n\nCommon examples of devices that rarely support EDR deployment are firewalls, email filtering products, virtualization platforms,\nand virtual private network (VPN) solutions. To further complicate matters, the platforms on which these appliances are built\nmay be proprietary or otherwise locked down, such that forensic analysis efforts are hindered. Exploits for these devices are\nexceedingly valuable to attackers, primarily because they typically require no user interaction to succeed, which helps to minimize\nthe chance of detection. If an attacker possesses an exploit for a zero-day vulnerability on these devices, they are often able to\n\n\n**Zero-day: Vulnerabilities**\ndisclosed before patches are\nmade available.\n\n**N-day: Vulnerabilities first**\nexploited after patches were\nmade available.\n\n\ngain access to a target environment and remain undetected for an extended period of\ntime. Furthermore, the attacker can use the exploit to gain access to additional targets or\nreestablish access to the same target if it is disrupted.\n\nMandiant observed a range of attackers targeting devices that matched this profile in 2023.\nSandworm[1] continued to leverage access via compromised network edge infrastructure to\nenable their wartime operations in Ukraine. The financially motivated group FIN11[2] exploited\na zero-day in MOVEit Transfer software to steal data as part of their data theft extortion\noperations. In the past year alone, Mandiant has investigated several high-profile cases of\nsuspected Chinese espionage operations leveraging zero-day and n-day vulnerabilities to\ntarget systems where visibility has been difficult to instrument.\n\n\n### Custom Malware for\n Edge Devices\n\nSecurity and networking devices that sit at the logical\nperimeter of a network and host services on the internet are\noften referred to as “edge devices.” Mandiant has observed\na trend in which China-nexus attackers have gained access\nto edge devices via exploitation of vulnerabilities, particularly\nzero-days, and subsequently deployed custom malware\necosystems. These malware ecosystems have typically\n\n\nconsisted of several distinct code families that attackers\noperate in unison, and are usually custom developed or tailored\nfor the target edge device and underlying operating system.\nDeveloping malware for these managed appliances is a nontrivial task. Vendors typically do not enable direct access to\nthe operating system or filesystem for appliance device\nowners or users. In order to operationalize attacks within this\nclass of platform, attackers must maintain a resource intensive\nmalware development lifecycle that, by necessity, maintains\nflexibility and a high degree of technical acumen. While this\nprocess requires a substantial investment, it also produces\nclear results when leveraged successfully by attackers.\n\n\n-----\n\n##### Remaining Undetected\n\nIn general, custom malware may go undetected for long\nperiods of time since there is unlikely to be specific detections\nin place for the malware. This is particularly true for edge\ndevices, where network defenders may have little to no means\nfor monitoring and detection of malware activity. Malware\nauthors may also take special care to ensure that the malware\nhinders forensic investigation by circumventing or clearing\nlogging systems in place on the device. Even after the malware\nhas been discovered and exposed by the security community,\nit is often a non-trivial task for a device owner to identify if\nthey have been impacted, since off-the-shelf security products\ntypically will not support edge devices. Furthermore, it is\nsometimes the case that exploitation attempts of zero-day\nvulnerabilities leave little or no reliable evidence behind. This\nis often exacerbated by the fact that the attack may have\noccurred months or even years prior to detection. Additionally,\nthere are often challenges with traditional forensic techniques\nas these devices are typically kept under tight control by\nmanufacturers, adding to the already complex nature of\ninvestigating these types of compromises.\n\n##### Example: BOLDMOVE\n\nBOLDMOVE is a backdoor used by suspected Chinese\nespionage groups that has both Windows and Linux variants\ncontaining a core set of features. Mandiant identified a custom\nvariant of the Linux version of BOLDMOVE, which contained\nan extended set of features to remain undetected on Fortinet\ndevices. This variant of BOLDMOVE disabled the `miglogd` and\n`syslogd` logging daemons on the appliance, and contained\na command to patch memory address space for these\nlogging functions. These customizations of the BOLDMOVE\nbackdoor are suspected to have enabled the attacker to remain\nundetected for a longer period of time than they would have\notherwise been able to through traditional means.\n\n##### Reduced Complexity,\n Increased Reliability\n\nEdge devices such as email security gateway appliances and\nVPNs are typically high-availability devices that run for months\nor years at a time without being rebooted. As such, many of\nthese devices are put through rigorous testing regimes by the\nmanufacturer during development to ensure their stability.\nChina-nexus malware developers take advantage of the\nbuilt-in functionality included in these systems, which benefits\nthem in several ways. In general, leveraging native capabilities\nwill enable attackers to reduce the overall complexity of the\nmalware by instead weaponizing existing features within that\nhave been rigorously tested by the organization. For example,\n\n\nfor devices that use proprietary software components such\nas custom file formats or configuration files, attackers may\nbe able to leverage built-in functions to parse or process\n\nthese files rather\nthan developing their\n\n**Living off the land: Attacker** own implementation.\nuse of legitimate, pre-installed This concept is\ntools and software within a analogous to livingtarget environment, notably to off-the-land, and is\nevade detection. particularly effective\n\non edge devices\nsince these native\ndevice operations are likely not being monitored by network\ndefenders and, as such, may go unnoticed.\n\n##### Example: THINCRUST\n\nDuring an UNC3886 compromise, Mandiant discovered a\nbackdoor deployed to FortiAnalyzer and FortiManager devices\nnamed THINCRUST, which disguised its command and\ncontrol (C2) communications as legitimate API calls to the\ndevices. UNC3886, a suspected Chinese espionage group,\nappended the Python-based backdoor code into legitimate\nweb framework files that were responsible for providing\nthe API interface for the appliance. This gave UNC3886 the\nability to harness the native API implementation to access\nand send commands to THINCRUST by simply interacting\nwith a new endpoint URL, which they had added. By leveraging\nexisting capabilities built into the appliance, UNC3886 was\nable to simplify their malware while maintaining the reliability\nnecessary for continued operations.\n\n##### Tailored Capabilities and\n Smaller Footprint\n\nCustom malware for edge devices may only include the\ncapabilities required to achieve the attacker’s mission\nobjectives. Malware used to exploit vulnerabilities may never\nbe used again once the vulnerabilities are discovered and\npatched, as the cost to maintain and repurpose the code\noften outweighs the benefits. By developing relatively simple\nmalware that serves only to provide the attackers with the\ndesired functionality on the target device, attackers are able\nto achieve their goals while minimizing their overall footprint.\nIn the same vein, the requirement for complex obfuscation is\nlikely lessened since the primary objective of the attacker is\nto remain undetected entirely, rather than hinder the analysis\nof the malware once it has been discovered. By the time the\nmalware is discovered, the vulnerability and campaign would\nhave already been exposed, and the attacker’s operations\ntypically come to a close.\n\n\n-----\n\n**Activity after internet access restrictions implemented**\n**to FortiManager**\n\n\nAttacker\n\n|1|Col2|\n|---|---|\n\n\nAttacker interacted with\nTABLEFLIP to implement\nIptables traffic redirection\nrules to REPTILE port\n\n|4|Col2|\n|---|---|\n\n\nFirewall\n\n\nAttacker was unable\nto connect directly to\nFortiManager from\ninternet due to newly\nimplemented restrictions\n\nAttacker interacted\nwith THINCRUST on the\nFortiManager via\nCASTLETAP on a\ncompromised FortiGate\n\nAttacker installed TABLEFLIP\ntraffic redirection tool and\nREPTILE backdoor on\nFortiManager to bypass\ninternet access restrictions\n\n\nFortiManager\n\n\n##### Example: TABLEFLIP\n\nAfter losing access to a FortiManager device during one\nincident due to access control lists change, UNC3886 adapted\nto the situation by deploying a network traffic redirection utility\nnamed TABLEFLIP. TABLEFLIP passively listens on all active\ninterfaces for specialized command packets that contain\nan XOR encoded IP address and port to redirect traffic to\nusing iptables commands. UNC3886 deployed TABLEFLIP\nalongside the publicly available REPTILE rootkit to act as a\nreverse shell, and successfully gained access back to the\nFortiManager device. The ability to produce purpose-built\nmalware in response to changes in an ongoing operation\nplaces defenders at a disadvantage when facing capable and\n\nagile attackers with nation-state backing.\n\n##### Attribution Challenges\n\nCustom malware developed for edge devices may stifle\nattribution for cyber threat intelligence analysts. These\nmalware families, and potentially the entire ecosystem,\ncould be almost entirely unique when compared to existing\nmalware because of the target operating system and tailored\ncapabilities. As such, they may not contain code or other\noverlaps analysts traditionally find between related malware\nfamilies that contribute to the technical attribution analysis.\n\n\n##### Example: SEASPRAY and WHIRLPOOL\n\nSEASPRAY is a launcher written in Lua that UNC4841 injected\ninto legitimate Barracuda Email Security Gateway (ESG)\nmodules. SEASPRAY registers an event handler for incoming\nemails, and launches an external binary, which Mandiant\ntracks as WHIRLPOOL, when certain markers are present.\nWHIRLPOOL is a simple TLS reverse shell utility that receives\na C2 IP address and port to connect to from SEASPRAY\nat runtime. Because SEASPRAY was a relatively simple\nimplementation that consisted of a few lines of code that\nwere specific to the Barracuda ESG appliances, it did not offer\nmuch value in terms of attribution. Similarly, WHIRLPOOL was\na simple and generic TLS reverse shell that did not contain\nany embedded C2 server information that could be analyzed.\nUsage of such malware on edge devices presented significant\nchallenges for analysts performing attribution analysis.\n\n##### In-Depth Knowledge of Edge Devices\n\nMandiant has observed several instances where China-nexus\nattackers demonstrated a high level of in-depth knowledge when\ntargeting edge devices. The degree of knowledge spanned not\nonly the malware used during the attack, but also the zero-day\nvulnerabilities used to gain access to these devices.\n\n##### Example: DEPTHCHARGE\n\nDEPTHCHARGE is a passive backdoor that Mandiant observed\nUNC4841 begin to deploy about one week after Barracuda’s\ninitial public notification of the ESG zero-day campaign.\nThis was followed by more rapid deployment to what\nMandiant assessed were high-value targets, once Barracuda\nannounced plans to replace affected devices. The timing of\nthe accelerated deployment suggests that UNC4841 may have\nanticipated this, and was prepared for remediation efforts\nwith tooling and tactics, techniques and procedures (TTPs)\ndesigned to enable them to continue operations in the face of\nattempts to disrupt their access to target networks.\n\nSeveral aspects of DEPTHCHARGE and its execution chain\ndemonstrated an intimate knowledge of the Barracuda\nESG device and its software components. Most notable\nwas that the attacker had identified a method for malware\npersistence inside the configuration database for the\nappliance, which would result in it being present in exported\nbackup configurations. This meant that device owners looking\nto set up a clean device would unknowingly export backup\nconfigurations containing DEPTHCHARGE persistence, and\nin-turn infect their clean appliances when attempting to\nrestore their configuration.\n\n\n-----\n\nESG\nConfiguration\nDatabase\n\n\nOther\ncomponents of\nthe Barracuda\nESG codebase\n\n\nPerhaps an even more intricate display of UNC4841’s\nknowledge of the inner workings of the appliance was the\nmethod through which DEPTHCHARGE achieved command\nexecution from a trigger inside the MySQL configuration\ndatabase after it had been imported. UNC4841 understood\nthat completely separate components of the ESG’s codebase\naccessed files using the two-argument form of Perl’s open()\nfunction, and that they could craft a special filename that\nwould result in commands being executed on the appliance.\nBy having the MySQL trigger drop a file that induces this\ncommand execution, UNC4841 was able to chain these\ntechniques together to have DEPTHCHARGE dropped and\nexecuted upon import of a backup configuration on a new\nappliance. This effectively enabled UNC4841 to survive\nthrough a complete device replacement in the small number\nof cases where this occurred.\n\n### Custom Malware for Hypervisors\n\nAs cloud computing has grown in popularity over the years,\nhypervisors have subsequently become commonplace\nwithin modern infrastructures. However, while instrumenting\nendpoint visibility on the guest virtual machines is relatively\neasy, instrumenting visibility on the hypervisor itself can\npresent substantial challenges. As with network edge devices,\nType 1 hypervisors commonly run on operating systems\nversions that are rarely supported by EDR vendors. Not\n\n\nPeriodically Installs\n\nCreates Persistence\n\nLauncher Script Persistence\n/etc/barracuda/ Executes Script\nsystemctl/ /usr64/share/\nS92badlocks_ gdb/syscalls/\nnotify l686-linux.xml\n\nsurprisingly, given the low visibility yet excessively high target\nvalue of a hypervisor, Mandiant has observed China-nexus\nattackers targeting hypervisors as well.\n\nHypervisor technologies, such as VMware’s ESXi, use Virtual\nMachine Communication Interface (VMCI) sockets to facilitate\ncommunication between the bare-metal host and the guest\noperating systems. Mandiant has observed attackers leverage\nVMCI sockets for lateral movement and continued persistence\nwithin targeted environments. UNC3886 utilized backdoors\nsuch as VIRTUALPITA, and took advantage of VMCI-based\nchannels to communicate from the ESXi host to the guest\nvirtual machines (VM). Since the traffic over the virtualized\nlayer is localized to the bare metal machine, there are no\nsecurity mechanisms restricting any guest VM or ESXi host\nfrom initiating a connection with the other, essentially\nbypassing any network segmentation. Additionally, traffic\ncannot be monitored outside of the guest VMs and ESXi\nhosts present in the virtualized environment. While the client/\nserver communication socket has connection-oriented and\n\nESXi Hypervisors vmtoolsd.exe\n\n\nVIRTUALPITA\nand VIRTUALPIE\nsamples listening\nfor inbound\nconnections\n\n\nCommand Execution\n\n\n###### VISUALIZATION LAYER\n\n\nGuest machines\nrunning under\nEXSi Hypervisors\n\n\nFile Transfer\n\n\n-----\n\nconnectionless variants very similar to TCP and UDP, it is\ninvisible to commonly used networking tools such as tcpdump,\nnetstat, nmap, and Wireshark without custom configurations,\nas it belongs to a different socket address family.\n\nUNC3886 used a novel persistence technique to deploy the\nVIRTUALPITA backdoor using vSphere Installation Bundles\n(“VIBs”). Mandiant had not previously observed this technique\nfor deploying malware or persistence, which suggests\nUNC3886 spent significant resources to understand the\ninner workings of VMware technologies, especially the VMCI\nsockets for circumventing security restrictions. Furthermore,\nVIRTUALPITA was used to pass arbitrary commands to guest\nVMs without being logged on the host. These commands then\nget executed on the guest VM with the vmtoolsd.exe process\nwhere they are then observed in the Windows event logs.\nVIRTUALPITA also sets the HISTFILE to 0, which would remove\nany terminal history on the host system, leaving behind little\nforensics evidence.\n\n### Recommendations\n\nThe most critical strategy for protecting against such attacks\nis maintaining proper patch management to mitigate the risk\nof exploitation of known vulnerabilities. Applying the most\nrecent patch is the best way to limit any unexpected tampering\nor modification of the appliance. For zero-day vulnerabilities,\nwhere exploitation is unlikely to be detected, a defense-in-depth\napproach provides the best chances of surfacing evidence of\nthe malicious activity further in the attack lifecycle.\n\nIf an organization has identified that they were operating\nvulnerable devices and may have been compromised,\nMandiant recommends performing an investigation and\nhunting activities within their networks. An investigation\nmay include, but is not limited to, the following:\n\n**•** Scanning potentially impacted devices with publicly\n\navailable tools such as IOC scanners to identify evidence\nof compromise.\n\n**•** Sweeping the entire environment for known IOCs.\n\n[1 https://cloud.google.com/blog/topics/threat-intelligence/gru-disruptive-playbook](https://cloud.google.com/blog/topics/threat-intelligence/gru-disruptive-playbook)\n[2 https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft](https://cloud.google.com/blog/topics/threat-intelligence/zero-day-moveit-data-theft)\n[3 https://services.google.com/fh/files/misc/barracuda-esg-rpt-en.pdf](https://services.google.com/fh/files/misc/barracuda-esg-rpt-en.pdf)\n\n\n\n**•** Reviewing network logs for signs of data theft and lateral\n\nmovement.\n\n**•** Reviewing network logs for abnormal logins or internal\n\ntraffic from edge devices.\n\n**•** Capturing a forensic image of the impacted appliance and\n\nconducting a forensic analysis.\n\n**•** Applying any malware signatures (e.g. YARA rules) to\n\nappliance images to assist forensic investigators.\n\nOrganizations should also consider implementation of security\ncontrols detailed in architecture hardening guidance provided\nby security vendors. Mandiant has previously provided such\ndocumentation for the Barracuda ESG event.[3]\n\n### Outlook\n\nDespite the amount of resourcing required, Chinese espionage\ngroups are almost certainly going to continue investing in the\nacquisition of zero-day exploits and platform-specific tooling.\nMandiant expects that we will continue to see targeting of\nedge devices and platforms that traditionally lack EDR and\nother security solutions due to the challenges associated with\ndiscovery and investigation of compromise. Exploitation of\nthese devices will continue to be an attractive initial access\nvector for Chinese espionage groups to remain undetected and\nmaintain persistence into target environments.\n\nIt is also likely that we will continue to see the deployment\nof custom malware ecosystems by Chinese espionage\ngroups that are tailored for the device and operation at hand.\nThis approach provides several advantages such as the\nincreased ability to remain undetected, reduced complexity\nand increased reliability, and a reduced malware footprint.\nAdditionally, it presents challenges to technical attribution\nbeing performed by threat intelligence analysts.\n\nOrganizations must remain vigilant and ensure that they’re\nnot only monitoring their networks at the operating system\nlayer, but also continue to patch, maintain and, where possible,\nmonitor the appliances that are running the underlying\ninfrastructure of their networks.\n\n\n-----\n\n[Read the full report: M-Trends 2024 Special Report](https://cloud.google.com/security/resources/m-trends?hl=en)\n\n\n[For more information, visit cloud.google.com/security.](https://cloud.google.com/security?hl=en)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/01-chinese-espionage-article-m-trends-2024.pdf"
    ],
    "report_names": [
        "01-chinese-espionage-article-m-trends-2024.pdf"
    ],
    "threat_actors": [
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a2c3c22a-b3db-4d4a-9a5a-76bfe6171843",
            "created_at": "2023-11-21T02:00:07.315543Z",
            "updated_at": "2025-03-27T02:00:03.237322Z",
            "deleted_at": null,
            "main_name": "UNC4841",
            "aliases": [
                "SLIME57"
            ],
            "source_name": "MISPGALAXY:UNC4841",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1c91699d-77d3-4ad7-9857-9f9196ac1e37",
            "created_at": "2023-11-04T02:00:07.663664Z",
            "updated_at": "2025-03-27T02:00:03.15027Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3886",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a08d93aa-41e4-4eca-a0fd-002d051a2c2d",
            "created_at": "2024-08-28T02:02:09.711951Z",
            "updated_at": "2025-03-27T02:02:10.193557Z",
            "deleted_at": null,
            "main_name": "UNC3886",
            "aliases": [],
            "source_name": "ETDA:UNC3886",
            "tools": [
                "BOLDMOVE",
                "CASTLETAP",
                "LOOKOVER",
                "MOPSLED",
                "RIFLESPINE",
                "TABLEFLIP",
                "THINCRUST",
                "Tiny SHell",
                "VIRTUALGATE",
                "VIRTUALPIE",
                "VIRTUALPITA",
                "VIRTUALSHINE",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1731895511,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1715157424,
    "ts_modification_date": 1715157425,
    "files": {
        "pdf": "https://archive.orkl.eu/c3741a7afdab5451c0e0b74daa3191007f40f9ae.pdf",
        "text": "https://archive.orkl.eu/c3741a7afdab5451c0e0b74daa3191007f40f9ae.txt",
        "img": "https://archive.orkl.eu/c3741a7afdab5451c0e0b74daa3191007f40f9ae.jpg"
    }
}