{
    "id": "08604e81-2a57-4aac-bba4-64d0ba0ae23c",
    "created_at": "2025-03-04T02:03:40.944203Z",
    "updated_at": "2025-03-27T02:17:17.057323Z",
    "deleted_at": null,
    "sha1_hash": "da69d01ff549266b3a65c3611e197b64e8423a0a",
    "title": "Wherever you work, work safer with Google and CrowdStrike",
    "authors": "",
    "file_creation_date": "2023-05-22T22:37:25Z",
    "file_modification_date": "2023-05-22T22:37:26Z",
    "file_size": 664005,
    "plain_text": "# Modern Adversaries and Evasion Techniques:  Why Legacy AV  Is an Easy Target\n\n\n-----\n\n###### Table of Contents\n\n Where Legacy AV Went Wrong 3\n\n How Adversaries Evade Legacy AV 3\n\n 7 Defense Evasion Techniques Legacy AV Can’t Stop 4\n\n From Legacy AV to Modern Endpoint Security 5\n\n 5 Adversary Evasion Techniques in Action 6\n\n Make the Switch: Modern Threats Require  Modern Endpoint Security 11\n\n About CrowdStrike 12\n\n\n-----\n\n###### Where Legacy AV Went Wrong\n\nIf you take away one thing from this eBook, make it this: Legacy antivirus (AV) is no longer capable\nof stopping adversaries. Modern endpoint security is required to stop breaches — period.\n\nWhere did legacy AV go wrong? First, the decades-old technology is too slow. Implementation\ntakes months. And endless scans and updates swamp resources while slowing down endpoints.\nIn other words, as adversaries have sped up, legacy AV has only slowed down.\n\nBut the fatal flaw of legacy AV is that it just doesn’t work anymore. The technology relies on signatures,\nwhich are hard to update and ineffective against fileless attacks. And given that 71% of detections are now\nmalware-free,[1] a technology that relies purely on known threats is going to miss the vast majority of attacks.\n\nThese shortcomings aren’t for lack of effort. Some legacy AV vendors have added behavioral analysis and\nmachine learning capabilities over the years, but it’s become a patchwork of additional agents that are\ncumbersome to deploy and manage. New agents often lack native integration with existing agents, forcing\ncustomers to configure connections across agents. By the time a new agent is deployed, it’s already obsolete.\n\nRead on to learn how adversaries are evading legacy AV, hear five cautionary tales of adversaries in\naction and understand why modern endpoint security is the only way to stop breaches. Let’s go.\n\n###### How Adversaries Evade Legacy AV\n\nUntil recently, malware was the preferred point of entry for adversaries. Not anymore.\nWhile malware remains a top threat — with 560,000 new pieces of malware detected\nevery day and more than a billion malware programs available in the wild[2] — CrowdStrike\nresearch shows that malware is being used further down the attack chain.\n\n[Let’s examine seven emerging defense evasion techniques, according to MITRE.](https://attack.mitre.org/tactics/TA0005/)\n\n[1 CrowdStrike 2023 Global Threat Report](https://www.crowdstrike.com/global-threat-report/)\n\n2 [DataProt A Not So Common Cold Malware Statistics in 2023 March 2023](https://dataprot.net/statistics/malware-statistics/)\n\n\n#### 71%\n###### of detections are now malware-free\n\n\n##### 560,000\n\n###### new pieces of malware detected every day\n\n\n-----\n\n###### 7 Defense Evasion Techniques Legacy AV Can’t Stop\n\n**1. Impairing defenses: Adversaries may modify components of a victim’s environment to hinder**\nor disable defense mechanisms. This could involve preventative defenses, such as firewalls\nand AV, or detection capabilities used to audit activity and identify malicious behavior.\n\n**2. Removing indicators: Adversaries can delete or modify artifacts generated within systems to remove**\nevidence of their presence or hinder defenses. Various artifacts may be created by an adversary or\ncould be attributed to an adversary’s actions. Examples include file deletion or obfuscation.\n\n**3. Subverting trust controls: Undermining security controls that either warn users of untrusted activity or**\nprevent execution of untrusted programs is another way adversaries can bypass legacy AV. Operating systems\nand security products may contain mechanisms to identify programs or websites as possessing some level of\ntrust. Adversaries may attempt to subvert these trust mechanisms by modifying registries or file and directory\npermissions. Adversaries may also create or steal code-signing certificates to acquire trust on target systems.\n\n**4. Hijacking execution flow: Adversaries may execute their own malicious payloads by**\nhijacking the way operating systems run programs. Hijacking execution flow can be for\npersistence, since this hijacked execution may recur over time. Adversaries might also use\nthese mechanisms to elevate privileges or evade defenses such as application control.\n\n**5. Injecting code into processes: Injecting code into processes can allow adversaries to evade**\nprocess-based defenses or elevate privileges. Process injection is a method of executing arbitrary code\nin the address space of a separate live process. Running code in the context of another process may allow\naccess to the process’s memory and/or system/network resources and possibly elevate privileges.\n\n**6. Proxying execution with system binaries: Adversaries may bypass process and/or**\nsignature-based defenses by proxying execution of malicious content with signed or otherwise\ntrusted binaries. Binaries used in this technique are often Microsoft-signed files, indicating they’ve\nbeen either downloaded from Microsoft or are already native in the operating system.\n\n**7. Masquerading: Manipulating features of their artifacts to make them appear legitimate or benign to users and/or**\nsecurity tools is another way adversaries bypass legacy AV. Masquerading occurs when the name or location of an\nobject — legitimate or malicious — is manipulated or abused to evade defenses and observation. This may include\nmanipulating file metadata, tricking users into misidentifying the file type and giving legitimate task or service names.\n\n\n###### According to CrowdStrike  research, \n## 86% \n###### of eCrime actors use one or multiple forms of evasion techniques to bypass detection such as legacy AV software.\n\n\n-----\n\n###### From Legacy AV to Modern Endpoint Security\n\nModern endpoint security is a comprehensive security strategy designed to detect evasion techniques\nand ultimately stop breaches. At a basic level, it includes two components: next-generation AV (NGAV) and\nendpoint detection and response (EDR).\n\n###### What Is NGAV? \nNGAV is a cybersecurity tool that uses a combination of artificial intelligence (AI), behavioral detection,\nmachine learning algorithms and exploit mitigation to anticipate and prevent both known and unknown threats.\nUnlike legacy AV solutions, NGAV is cloud-based, which allows it to be deployed more quickly and without\nover-burdening the endpoint. In addition, it eliminates or significantly reduces the hassle of maintaining\nsoftware, managing infrastructure and updating signature databases.\n\n###### What Is EDR?\nEDR is a cybersecurity solution that detects and mitigates threats by continuously monitoring endpoint\ndevices and analyzing endpoint data. EDR solutions work by providing continuous and comprehensive realtime visibility into what’s happening across all endpoints. Behavioral analysis and actionable intelligence is then\napplied to endpoint data to prevent an incident from turning into a breach. EDR tools also provide advanced\nthreat detection, investigation and response capabilities, including incident data search and investigation alert\ntriage, suspicious activity validation, threat hunting, and malicious activity detection and containment.\n\nGiven the increasing sophistication of adversaries and their constantly evolving tactics, techniques and\nprocedures (TTPs), organizations should use both EDR and NGAV solutions for complete protection against\nmodern attacks.\n\n###### Next, read five cautionary tales of adversaries that evaded legacy AV and how modern endpoint security would have stopped the breaches.\n\n\n-----\n\n###### 5 Adversary Evasion Techniques in Action\n\n∎ **Adversary:**\n\n### WANDERING SPIDER\n\n∎ **When**\n\nEarly 2023\n\n∎ **What Happened**\n\nCrowdStrike Intelligence has tracked WANDERING SPIDER since April 2020. This adversary has conducted\nransomware campaigns using Black Basta, DOPPEL SPIDER’S DoppelPaymer, PINCHY SPIDER’S REvil and\nProLock, TWISTER SPIDER’S Egregor and Maze, and WIZARD SPIDER’S Conti. In early 2023, CrowdStrike\ndiscovered WANDERING SPIDER was using the legitimate binary fs _ uninstall _ 32.exe to uninstall an\nenterprise legacy AV solution.\n\n∎ **How Modern Endpoint Security Helps**\n\nOne way threat actors evade detection is by using legitimate tools to blend in with benign, day-to-day activities.\nThese types of attacks are extremely challenging to detect using signature-based methods. Modern endpoint\nsecurity excels at discerning between malicious and benign behavior. Tamper-resistant capabilities, for example,\nblock attempts to tamper with the sensor. This setting protects the sensor-related files, folders and registry objects\nfrom renaming or deletion. If disabled, the sensor still identifies and alerts on tampering attempts.\n\n\n∎\n\n\n∎\n\n\n-----\n\n∎ **Adversary:**\n\n### MALLARD SPIDER\n\n∎ **When**\n\nFebruary 2023\n\n∎ **What Happened**\n\nIndustry sources reported an email spam campaign distributing QakBot using Windows Script Files (WSF)\nmasquerading as a file certificate. The WSF file contained an embedded JavaScript that attempted to download\nand execute the QakBot payload. Following the decline of ISO and OneNote as delivery methods, eCrime threat\nactors have been experimenting with many alternative delivery methods and masquerading tactics, including\npreviously seen techniques such as HTML smuggling, password-protected ZIP files, Base64 encoding and file size\ninflation. These techniques are often effective in bypassing legacy AV scanning.\n\n∎ **How Modern Endpoint Security Helps**\n\nAdversaries continue to experiment with new malware distributions and use tactics like obfuscating characters and\nBase64 encoding to bypass signature-based detections. Through the use of indicators of compromise, advanced\nAI and behavioral analysis, modern endpoint security enables early detection of obfuscation techniques and\nattempted execution of malicious payloads, thereby stopping these attacks.\n\n\n∎\n\n\n∎\n\n\n-----\n\n∎ **Adversary:**\n\n### SCATTERED SPIDER\n\n∎ **When**\n\nEarly 2023\n\n∎ **What Happened**\n\n[CrowdStrike Intelligence detected probable SCATTERED SPIDER activity in which the adversary accessed](https://www.crowdstrike.com/adversaries/scattered-spider/)\nmultiple North America-based technology companies that specialize in business process outsourcing. While the\ninitial infection vectors were not confirmed, the adversary deployed either remote management and monitoring\n(RMM) tools or tested the ability to reach domains relating to such software. Furthermore, SCATTERED SPIDER\nused numerous living-off-the-land (LOTL) utilities and legitimate tools to conduct elements of their postexploitation activity. Legacy AV vendors routinely fail to scan RMM and legitimate tools, allowing these types of\nsupply chain attacks to occur.\n\n∎ **How Modern Endpoint Security Helps**\n\nModern endpoint security uses advanced behavioral analysis to understand the context of seemingly benign\nactivity. In this case, the adversary navigated to a legitimate but uncommonly used website and proceeded to\nremotely log into victim systems to run reconnaissance commands such as mmc.ex to enumerate Active Directory\ninformation or whoami to determine the account of the currently logged-in user. A modern endpoint security\nsolution would have detected and stopped this malicious activity.\n\n\n∎\n\n\n∎\n\n\n-----\n\n∎ **Adversary:**\n\n### Raccoon Stealer Customer\n\n∎ **When**\n\nAugust 2022\n\n∎ **What Happened**\n\nCrowdStrike Intelligence identified a new phishing campaign involving a heavily obfuscated .NET-based\nloader that attempted to download and install a sample of the newly released Raccoon Stealer 2.0. The\nextremely popular Raccoon Stealer is a tiny malware package that can be easily bundled into larger\npackages. When users download a large package, legacy AV vendors typically don’t scan all components in\nthe package, allowing malware to pass through unnoticed.\n\n∎ **How Modern Endpoint Security Helps**\n\nThis detection was made by observing a known downloader that uses several evasion techniques to bypass\nhost and network-level detections, including multistage fileless payloads, different types of obfuscations,\nand legitimate tools such as Discord and OneDrive to host next stages. Modern endpoint security that\ncombines behavioral analysis and fileless attack detection capabilities can stop these types of attacks,\nwhich typically evade legacy AV tools.\n\n\n∎\n\n\n∎\n\n\n-----\n\n∎ **Adversary:**\n\n### BITWISE SPIDER\n\n∎ **When**\n\nFebruary 2023\n\n∎ **What Happened**\n\n[In early 2023, CrowdStrike Services responded to a BITWISE SPIDER LockBit incident in which the](https://www.crowdstrike.com/adversaries/bitwise-spider/)\nSender2 exfiltration tool was deployed. The actor gained initial access using valid credentials, then\nproceeded to perform host and network reconnaissance using living-off-the-land (LotL) tools such as the\n```\n net, nltest and qwinsta utilities, which are not identified as malicious by legacy AV.\n\n```\n∎ **How Modern Endpoint Security Helps**\n\nIn this instance, modern endpoint security would have applied behavioral analysis to identify uncommon\nbehavior emanating from legitimate tools. A security system that also combines identity threat protection can\nprovide further protection by detecting the presence of threat actors that use compromised accounts or stolen\ncredentials to gain access and move laterally across systems.\n\n\n∎\n\n\n∎\n\n\n-----\n\n###### Make the Switch: Modern Threats Require  Modern Endpoint Security\n\nAdversaries have evolved and devised numerous ways to evade legacy AV. If you want to\nprotect your organization, you need modern endpoint security.\n\n[CrowdStrike is the industry leader in modern endpoint security. CrowdStrike Falcon® Prevent](https://www.crowdstrike.com/products/endpoint-security/falcon-prevent-antivirus/)\nis the new standard in NGAV, delivering superior protection from malware, exploits, malware[free intrusions and advanced persistent threats. CrowdStrike Falcon® Insight XDR endpoint](https://www.crowdstrike.com/products/endpoint-security/falcon-insight-xdr/)\ndetection and response delivers continuous, comprehensive visibility that spans detection,\ninvestigation and response to ensure potential breaches are stopped.\n\nAll CrowdStrike solutions are deployed on the CrowdStrike Falcon® platform using a single\nlightweight agent. This integrated approach spans endpoint, identity, cloud and threat\nintelligence — allowing you to easily expand your protections as adversary TTPs evolve.\nOne platform for complete protection.\n\n###### Next Steps\n\n∎ **[Discover adversaries that are targeting your industry.](https://www.crowdstrike.com/adversaries/)**\n\n∎ **[Access a modern endpoint security toolkit for additional resources.](https://www.crowdstrike.com/resources/reports/modern-endpoint-security-toolkit/)**\n\n∎ **[Try CrowdStrike Falcon free for 15 days.](https://go.crowdstrike.com/try-falcon-prevent.html?ct-q2-2023-bn-try-nav)**\n\n\n###### “In the old days when we had only AV tools, everything was a thick client with power-hungry agents. Managing that was time-consuming and we had some challenges with resources on workstations — whereas CrowdStrike is cloud- based and has just one agent for all the different solution modules compared to competitor products that need multiple agents.”\n\n–CISO of Berkshire Bank\n\n\n∎\n\n\n∎\n\n\n-----\n\n###### About CrowdStrike\n\n**[CrowdStrike (Nasdaq: CRWD), a global cybersecurity leader, has redefined modern security with](https://www.crowdstrike.com/)**\nthe world’s most advanced cloud-native platform for protecting critical areas of enterprise risk —\nendpoints and cloud workloads, identity and data.\n\nPowered by the CrowdStrike Security Cloud and world-class AI, the CrowdStrike Falcon® platform\nleverages real-time indicators of attack, threat intelligence, evolving adversary tradecraft and\nenriched telemetry from across the enterprise to deliver hyper-accurate detections, automated\nprotection and remediation, elite threat hunting and prioritized observability of vulnerabilities.\n\nPurpose-built in the cloud with a single lightweight-agent architecture, the Falcon platform delivers\nrapid and scalable deployment, superior protection and performance, reduced complexity and\nimmediate time-to-value.\n\nCrowdStrike: We stop breaches.\n\n[Follow us: Blog | Twitter | LinkedIn | Facebook | Instagram](https://www.crowdstrike.com/blog/)\n\n© 2023 CrowdStrike, Inc. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.patechcon.com/wp-content/uploads/2023/08/ebook-modern-adversaries-and-evasion-techniques-2023.pdf"
    ],
    "report_names": [
        "ebook-modern-adversaries-and-evasion-techniques-2023.pdf"
    ],
    "threat_actors": [
        {
            "id": "9ddc7baf-2ea7-4294-af2c-5fce1021e8e8",
            "created_at": "2023-06-23T02:04:34.386651Z",
            "updated_at": "2025-03-27T02:02:10.009484Z",
            "deleted_at": null,
            "main_name": "Muddled Libra",
            "aliases": [
                "0ktapus",
                "Scatter Swine",
                "Scattered Spider"
            ],
            "source_name": "ETDA:Muddled Libra",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d555c5da-abe4-42aa-a8cf-77b68905891a",
            "created_at": "2022-10-25T16:07:23.548385Z",
            "updated_at": "2025-03-27T02:02:09.857957Z",
            "deleted_at": null,
            "main_name": "Doppel Spider",
            "aliases": [
                "Gold Heron",
                "Grief Group"
            ],
            "source_name": "ETDA:Doppel Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "DoppelPaymer",
                "Pay OR Grief",
                "Pay or Grief",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa5b200f-a6c6-4d17-bc65-911d9a7bf4ef",
            "created_at": "2022-10-25T16:07:23.866039Z",
            "updated_at": "2025-03-27T02:02:10.002227Z",
            "deleted_at": null,
            "main_name": "Mallard Spider",
            "aliases": [
                "Gold Lagoon"
            ],
            "source_name": "ETDA:Mallard Spider",
            "tools": [
                "Egregor",
                "Mimikatz",
                "Oakboat",
                "PinkSlip",
                "Pinkslipbot",
                "ProLock",
                "PwndLocker",
                "QakBot",
                "Qbot",
                "QuackBot",
                "QuakBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d5cb8d20-b5b9-4ec6-9660-3dded9bd3c89",
            "created_at": "2023-01-06T13:46:39.204681Z",
            "updated_at": "2025-03-27T02:00:03.020862Z",
            "deleted_at": null,
            "main_name": "MALLARD SPIDER",
            "aliases": [
                "GOLD LAGOON"
            ],
            "source_name": "MISPGALAXY:MALLARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7da6012f-680b-48fb-80c4-1b8cf82efb9c",
            "created_at": "2023-11-01T02:01:06.643737Z",
            "updated_at": "2025-03-27T02:00:55.454098Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "Scattered Spider",
                "Roasted 0ktapus",
                "Octo Tempest",
                "Storm-0875"
            ],
            "source_name": "MITRE:Scattered Spider",
            "tools": [
                "WarzoneRAT",
                "LaZagne",
                "Mimikatz",
                "ngrok",
                "BlackCat"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c3b908de-3dd1-4e5d-ba24-5af8217371f0",
            "created_at": "2023-10-03T02:00:08.510742Z",
            "updated_at": "2025-03-27T02:00:03.139677Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "Scatter Swine",
                "Storm-0971",
                "UNC3944",
                "Scattered Swine",
                "Octo Tempest",
                "0ktapus",
                "DEV-0971",
                "Starfraud",
                "Muddled Libra",
                "Oktapus"
            ],
            "source_name": "MISPGALAXY:Scattered Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0fc739cf-0b82-48bf-9f7d-398a200b59b5",
            "created_at": "2022-10-25T16:07:23.797925Z",
            "updated_at": "2025-03-27T02:02:09.983353Z",
            "deleted_at": null,
            "main_name": "LockBit Gang",
            "aliases": [
                "Bitwise Spider",
                "Operation Cronos"
            ],
            "source_name": "ETDA:LockBit Gang",
            "tools": [
                "3AM",
                "ABCD Ransomware",
                "CrackMapExec",
                "EmPyre",
                "EmpireProject",
                "LockBit",
                "LockBit Black",
                "Mimikatz",
                "PowerShell Empire",
                "PsExec",
                "Syrphid"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3940f08b-39aa-492c-8699-86bfe515fa70",
            "created_at": "2023-01-06T13:46:39.470535Z",
            "updated_at": "2025-03-27T02:00:03.101867Z",
            "deleted_at": null,
            "main_name": "BITWISE SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:BITWISE SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a0d0e1ef-3562-40a8-a021-321db92644d9",
            "created_at": "2023-01-06T13:46:39.104046Z",
            "updated_at": "2025-03-27T02:00:02.997473Z",
            "deleted_at": null,
            "main_name": "DOPPEL SPIDER",
            "aliases": [
                "GOLD HERON"
            ],
            "source_name": "MISPGALAXY:DOPPEL SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e424a2db-0f5a-4ee5-96d2-5ab16f1f3824",
            "created_at": "2024-06-19T02:03:08.062614Z",
            "updated_at": "2025-03-27T02:05:17.373121Z",
            "deleted_at": null,
            "main_name": "GOLD HARVEST",
            "aliases": [
                "Scatter Swine ",
                "Scattered Spider ",
                "UNC3944 ",
                "Roasted 0ktapus "
            ],
            "source_name": "Secureworks:GOLD HARVEST",
            "tools": [
                " ConnectWise Control",
                " LogMeIn",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ccd0f6b5-6d20-4d28-9796-88ab6deb4087",
            "created_at": "2024-06-19T02:03:08.067518Z",
            "updated_at": "2025-03-27T02:05:17.375595Z",
            "deleted_at": null,
            "main_name": "GOLD HERON",
            "aliases": [
                "Doppel Spider "
            ],
            "source_name": "Secureworks:GOLD HERON",
            "tools": [
                " DoppelPaymer",
                " Dridex",
                " Grief",
                " Powershell Empire",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d093e8d9-b093-47b8-a988-2a5cbf3ccec9",
            "created_at": "2023-10-14T02:03:13.99057Z",
            "updated_at": "2025-03-27T02:02:09.728121Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "0ktapus",
                "LUCR-3",
                "Muddled Libra",
                "Octo Tempest",
                "Scatter Swine",
                "Scattered Spider",
                "Star Fraud",
                "Storm-0875",
                "UNC3944"
            ],
            "source_name": "ETDA:Scattered Spider",
            "tools": [
                "ADRecon",
                "AnyDesk",
                "ConnectWise",
                "DCSync",
                "FiveTran",
                "FleetDeck",
                "Govmomi",
                "Hekatomb",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Lumma Stealer",
                "LummaC2",
                "Mimikatz",
                "Ngrok",
                "PingCastle",
                "ProcDump",
                "PsExec",
                "Pulseway",
                "Pure Storage FlashArray",
                "Pure Storage FlashArray PowerShell SDK",
                "RedLine Stealer",
                "Rsocx",
                "RustDesk",
                "ScreenConnect",
                "SharpHound",
                "Socat",
                "Spidey Bot",
                "Splashtop",
                "Stealc",
                "TacticalRMM",
                "Tailscale",
                "TightVNC",
                "VIDAR",
                "Vidar Stealer",
                "WinRAR",
                "WsTunnel",
                "gosecretsdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2c936440-1695-4b9d-88c1-32ab6df31d1b",
            "created_at": "2025-03-04T02:00:03.004127Z",
            "updated_at": "2025-03-27T02:00:03.485414Z",
            "deleted_at": null,
            "main_name": "GOLD REBELLION",
            "aliases": [
                "WANDERING SPIDER",
                "White Dev 115",
                "Dark Scorpius"
            ],
            "source_name": "MISPGALAXY:GOLD REBELLION",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1741053820,
    "ts_updated_at": 1743041837,
    "ts_creation_date": 1684795045,
    "ts_modification_date": 1684795046,
    "files": {
        "pdf": "https://archive.orkl.eu/da69d01ff549266b3a65c3611e197b64e8423a0a.pdf",
        "text": "https://archive.orkl.eu/da69d01ff549266b3a65c3611e197b64e8423a0a.txt",
        "img": "https://archive.orkl.eu/da69d01ff549266b3a65c3611e197b64e8423a0a.jpg"
    }
}