{
    "id": "08735694-14f3-48ae-b2aa-046e32bc479c",
    "created_at": "2023-01-12T15:05:22.989056Z",
    "updated_at": "2025-03-27T02:09:30.036279Z",
    "deleted_at": null,
    "sha1_hash": "abb447c5a553a28860cb77e13288713bc3a92706",
    "title": "2017-09-18 - Morphisec Discovers CCleaner Backdoor Saving Millions of Avast Users",
    "authors": "",
    "file_creation_date": "2022-05-28T01:57:22Z",
    "file_modification_date": "2022-05-28T01:57:22Z",
    "file_size": 414258,
    "plain_text": "# Morphisec Discovers CCleaner Backdoor Saving Millions of Avast Users\n\n**[blog.morphisec.com/morphisec-discovers-ccleaner-backdoor](http://blog.morphisec.com/morphisec-discovers-ccleaner-backdoor)**\n\n[Tweet](https://twitter.com/share)\n\n\n-----\n\nAs widely reported today, the Avast-owned security application CCleaner was illegally\nmodified by hackers. According to Avast, some 2.27 million users were running the\nweaponized version 5.33 of CCleaner. In addition, the CCleaner cloud version 1.07 was\naffected. Morphisec was the first to uncover the CCleaner Hack and notify Avast.\n\nMorphisec identified and prevented malicious CCleaner.exe installations on August 20 and\n21, 2017 at customer sites. On September 11, 2017, some customers shared their logs of\nthe prevented attacks with Morphisec, which our team immediately started to investigate.\n\n**This post has been updated:**\n\n1.) Inclusion of Avast reference to Morphisec help.\n\n2.) The CCleaner compromised version was discovered and reported by both Morphisec and\n[Cisco in separate in-field cases and reported separately to Avast.](http://blog.talosintelligence.com/2017/09/avast-distributes-malware.html)\n\nAlthough the executables were signed by the original Piriform company – which was\npurchased by Avast in July - version 5.33 of CCleaner exhibited internal code injection\nbehavior and reflective DLL loading directly into memory.\n\n“Morphisec’s unique Moving Target Defense cyber security solution first stopped the\n_malicious file at one of our customers in Singapore. We were gratified to see that we_\n_prevented the attack and how our Endpoint Threat Prevention solution keeps our customers_\n_safe,” remarks Michael Gorelik VP R&D at Morphisec._\n\n\n-----\n\nImmediately after the initial investigation, Morphisec notified all of its customers and reported\nits findings to Avast to help the company identify the issue. An updated version of CCleaner\n5.34 - which was released at September 12, 2017 - did not include any malicious code.\n\n_“A backdoor transplanted into a security product through its production chain presents a new_\n_unseen threat level which poses a great risk and shakes customers’ trust. As part of our_\n_responsible disclosure policy, we immediately contacted Avast and shared all the information_\n_required for them to resolve the issue promptly. Customer safety is our top concern,” Gorelik_\n_emphasizes._\n\nIn their [blog post Avast confirms Morphisec's important role:](https://blog.avast.com/update-to-the-ccleaner-5.33.1612-security-incident)\n\n\"The CCleaner compromised version was released on August 15 and went undetected\nby any security company for four weeks, underscoring the sophistication of the attack.\nIn our view, it was a well-prepared operation and the fact that it didn’t cause harm to\nusers is a very good outcome, made possible by the original notification we received\nfrom our friends at security company Morphisec (more on this below) followed by a\nprompt reaction of the Piriform and Avast teams working together. We continue to be\nactively cooperating with law enforcement units, working together to identify the source\nof the attack.\"\n\n[...]\n\n\"Avast first learned about the possible malware on September 12, 8:35 AM PT from a\ncompany called Morphisec which notified us about their initial findings. We believe that\nMorphisec also notified Cisco. We thank Morphisec and we owe a special debt to their\nclever people who identified the threat and allowed us to go about the business of\nmitigating it. Following the receipt of this notification, we launched an investigation\nimmediately, and by the time the Cisco message was received (September 14, 7:25AM\nPT), we had already thoroughly analyzed the threat, assessed its risk level and in\nparallel worked with law enforcement in the US to properly investigate the root cause\nof the issue.\"\n\nNow that Avast has made a public announcement, Morphisec is able to share a short\nabstract of our technical investigation.\n\n## CCleaner Hack Technical Abstract:\n\nFirst, we identified that the TLS initialization of callback functions was probably altered by a\nmodification of the visual studio runtime file:\n\n\n-----\n\nSuch modifications can be done by someone with access to the machine that compiles the\ncode. This makes the code injection very useful and stealth. Moreover, this code is executed\nbefore any of the original CCleaner code is executed and the executable is automatically\nsigned by the build machine.\n\nFollowing the new TLS initiation path, we investigated the reflective injection of the DLL,\nwhich was a DLL without a FILE_DOS_HEADER. Later on, the NT_HEADER was striped as\nwell to evade any memory monitoring solutions. Morphisec’s research lab has witnessed\nsuch processes more and more lately.\n\nThe DLL by itself is a simple controller component that collects information from the\ncomputer, sends it to a C2 and is able to receive next stage code execution.\n\nThe DLL contained sophisticated methods rarely used by only few threat actors like code for\nidentifying 64/32 which can run within both processes:\n\nNote, that the downloaded payload has a failback option for accessing “randomly” generated\ndomains (the month of year being used as a seed).\n\n**Download of the Code from C2:**\n\n\n-----\n\n**Malicious code execution following the payload download + the Domain generated**\n**hosts:**\n\n\n-----\n\nUpdated on September 19.\n\n[Contact SalesInquire via Azure](http://10.10.0.46/mailto:sales@morphisec.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-09-18 - Morphisec Discovers CCleaner Backdoor Saving Millions of Avast Users.pdf"
    ],
    "report_names": [
        "2017-09-18 - Morphisec Discovers CCleaner Backdoor Saving Millions of Avast Users.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535922,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653703042,
    "ts_modification_date": 1653703042,
    "files": {
        "pdf": "https://archive.orkl.eu/abb447c5a553a28860cb77e13288713bc3a92706.pdf",
        "text": "https://archive.orkl.eu/abb447c5a553a28860cb77e13288713bc3a92706.txt",
        "img": "https://archive.orkl.eu/abb447c5a553a28860cb77e13288713bc3a92706.jpg"
    }
}