{
    "id": "08ad6d04-c3a6-4fce-b8db-0120e6c4cebb",
    "created_at": "2022-10-25T16:48:16.595236Z",
    "updated_at": "2025-03-27T02:06:12.399276Z",
    "deleted_at": null,
    "sha1_hash": "3480bf45d133f7d3ba136459a553b7e31d0a7945",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-04-10T10:45:11Z",
    "file_modification_date": "2019-04-10T10:45:13Z",
    "file_size": 2272238,
    "plain_text": "-----\n\n## ASEC REPORT\n##### VOL.94 [Q1 2019]\n\n\n###### ASEC (AhnLab Security Emergency Response Center) is a global security response group consisting of malware\n\n analysts and security experts. This report is published by ASEC and focuses on the most significant security\n\n threats and latest security technologies to guard against such threats. For further details, please visit AhnLab,\n\n Inc.’s homepage (www.ahnlab.com).\n\n\n###### SECURITY TREND OF Q1 2019\n\n\n###### Table of Contents\n\n\n-----\n\n-----\n\n###### Security Issue\n\n\n#### Discovery of the Ammyy\n\n RAT and CLOP Ransomware\n\n\n###### A recent rise in attacks using malicious macros in attachments has been spotted in South Korea. In\n\n February 2019, a remote control hacking tool called Flawed Ammyy RAT began to be distributed\n\n through email attachments. This hacking tool has been active since 2016 and has been distributed\n\n worldwide via email. It was mainly mentioned in the media in 2018.\n\n Also, a variant of the Cryptomix ransomware, CLOP, was discovered at a similar time. CLOP is a new\n\n variant that had recently received global attention for its attempt to attack networks worldwide.\n\n AhnLab analyzed the two malware, the Ammyy RAT and CLOP ransomware and found that they\n\n shared further similarities, including the same signatures and same attack targets. This report details\n\n the result of the analysis conducted by the AhnLab Security Emergency Response Center (ASEC) on\n\n the distribution method, attack method, and the comparison of the two malware.\n\n 1. Overview of the Flawed Ammyy RAT Attack\n\n Flawed Ammyy is a Remote Access Trojan (RAT). The attacker used the spam emails to distribute the\n\n malware. Usually, spam emails without malicious attachments tend to encourage users to download\n\n and run malicious files. While this is not the case for Flawed Ammyy, it does trick users into believing\n\n\n-----\n\n###### that the attachment is important by giving a name that seems to be work related. This method does\n\n not raise much suspicion, which increases the likelihood of users opening the attachment.\n\n Once the user downloads and opens the malicious attachment in the form of an Excel file,\n\n a macro-enabling button appears. This is a social-engineering method used by the threat\n\n actors that lures users into clicking the \"Enable Contents\" button at the top of the screen on\n\n Microsoft Office programs that have the macro setting disabled.\n\n Distributing malware through this method is a widely chosen attack method because general\n\n users do not know that a backdoor can be installed just by clicking this button. But unlike\n\n most general Office files that use Visual Basic for Application (VBA), the attachment of Flawed\n\n Ammyy use XML macros. XML is the macro used in the Excel version prior to 4.0. VBA that is\n\n frequently used in the general malicious documents was introduced from Excel 5.0.\n\n Most malicious Office files use VBA to create macros that download, drop, and execute\n\n malware. And while there has been a rise in the attack methods that use PowerShell. This\n\n attack is special for using the macro creation method used in the early version of Excel\n\n programs to avoid detection by the security programs.\n\n The malicious attachment of Flawed Ammyy contains hidden sheets. When unhidden, it\n\n shows commands as shown in Figure 1-1. This command is how the malware downloads the\n\n MSI file from the malicious server using the msiexec.exe process.\n\n The malicious MSI file downloaded from the server contains an executable (EXE) file, which\n\n\n-----\n\n###### also downloads another executable file which is the actual malicious backdoor. Before running\n\n the executable file, the malware inspects the running processes and if any anti-virus program is\n\n running, as shown in Figure 1-2, it ends the anti-virus program.\n\nFigure 1-2 | Routine of Inspecting the Vaccine Processes\n\n###### Then, the encoded file is downloaded from a set URL, and when the decoding process is\n\n finally performed, an exe-type malware is generated. The downloader is deleted once the\n\n malware is installed. This executable malware is the actual \"Flawed Ammyy RAT,\" the hacking\n\n tool conducting malicious acts.\n\n\n-----\n\n###### Figure 1-3 shows a series of processes from downloading Flawed Ammyy RAT. The threat actor\n\n effectively bypasses detection of antivirus programs by using XLM-based attacks, exploiting the\n\n fact that many anti-virus programs are designed to target the VBA macros in Office documents.\n\n Also, the threat actor does not download and run the malicious file directly but used the\n\n indirect method through the downloader by using the feature of the legitimate msiexec,\n\n which installs an external MSI file. A similar method is applied to malware that acts as\n\n a backdoor, such as Flawed Ammyy RAT, which is downloaded in an encoded form and\n\n decoded before installation. Flawed Ammyy RAT checks the list of running processes and\n\n terminates itself without conducting any actions if any of the anti-virus programs are running.\n\n It also disguises itself like a legitimate program by signing each binary with a valid certificate,\n\n unlike malware that is signed with invalid certificates or with no certificates at all.\n\n\n-----\n\n###### Flawed Ammyy RAT is a malware that has been designed based on a leaked source code of\n\n Ammyy Admin, a remote desktop program. The Ammyy Admin program contains control\n\n functions for remote computers, such as file transfer and screen capture. It is believed\n\n that the threat actor created RAT malware by adding and modifying the code to perform\n\n malicious actions based on the source code.\n\n Analysis of the initial routine of Flawed Ammyy showed that it checks the currently running\n\n processes similar to the downloader and shuts the anti-virus program down if it is running. In\n\n addition, it has been confirmed that the basic information, such as OS information, authority,\n\n and username, is sent to the server so that the server can access the computer.\n\n 2. Relationship between Flawed Ammyy RAT and CLOP Ransomware\n\n As mentioned earlier, Flawed Ammyy RAT contains not only the main malware but also a\n\n valid signature of the downloader. Unlike other malware that contains invalid certificates, the\n\n advantage of Flawed Ammyy RAT is that its binary is signed and distributed via many valid\n\n certificates. And such similarity was found in the CLOP ransomware that recently targeted\n\n South Korean companies.\n\n ASEC saw a similarity in the two and found that there was a case where these two malware\n\n were signed with the same certificate. Figure 1-4 and Figure 1-5 show the properties of the\n\n CLOP ransomware and Flawed Ammyy RAT, which were signed using the same certificates\n\n \"MAN TURBO (UK) LIMITED\" and \"DELUX LTD,\" respectively.\n\n\n-----\n\n###### Another common feature of Flawed Ammyy RAT and CLOP ransomware is that they are\n\n distributed to enterprise users, not general users. Unlike most ransomware, which target at\n\n a large number of general users, CLOP targets companies. The distribution and the infection\n\n method is yet to be confirmed. The only known fact is that the attack infects the central\n\n management server and inserts the malware in the system connected to the management\n\n server.\n\n Recently, a change has been found on the downloader of Flawed Ammyy. A routine for\n\n detecting the enterprise user environment has been added after the process of inspecting\n\n the running antivirus programs. As shown in Figure 1-6, it runs the \"net user /domain\"\n\n command and checks that the WORKGROUP text string is output. The WORKGROUP string\n\n\n-----\n\n###### will be output for general users because there are no special settings, but for enterprise\n\n users, group name set for each environment can be output. If WORKGROUP is output, it was\n\n terminated without conducting any malicious acts such as downloading and installing the\n\n Flawed Ammyy RAT malware.\n\nFigure 1-6 | Routine of Inspecting the WORKGROUP Text String\n\n###### 3. Operation Method of CLOP Ransomware\n\n The CLOP ransomware is registered and executed as a system service, as shown in Figure 1-7.\n\n If it does not run as a service, it does not operate properly.\n\nFigure 1-7 | Execution Method of CLOP Ransomware\n\n\n-----\n\n###### Also CLOP terminates certain processes before proceeding with file encryption. It is presumed\n\n that this is to encrypt more objects in the process of encryption. The targeted processes are\n\n shown in Figure 1-8.\n\n The characteristic feature of the CLOP\n\n ransomware is that it excludes some paths\n\n and files from encryption. Figure 1-9 shows\n\n the encryption exclusion paths. If the path\n\n contains the relevant string, it is excluded\n\nFigure 1-8 | List of Force-terminated Processes from the encryption.\n\n###### Figure 1-10 shows the encryption exclusion\n\n file list. Like the exclusion path, any file\n\n name with the string is excluded from the\n\n\nFigure 1-9 | Encryption Exclusion Path\n\n\n###### encryption target.\n\n\n-----\n\n###### As shown in Figure 1-11, the public key of the threat actor is included in the file, and the\n\n public key is used to encrypt the files.\n\nFigure 1-11 | Public Key of the Ransomware Threat Actor\n\n###### Also, CLOP uses the AES algorithm for file encryption. On the symmetric key generated by\n\n the user PC, it inserts the “Clop ^_-” sign of CLOP, as shown in Figure 1-12, and encrypts\n\n the symmetric key used as the public key of the threat actor and adds it to the end of the\n\n signature.\n\nFigure 1-12 | Signature of Encrypted File\n\n\n###### The Figure 1-13 shows the comparison of the file structure before and after the encryption.\n\nFigure 1-13 | File Comparison Before and After Encryption\n\n\n-----\n\n###### In the end, the file name is changed to [Original file name].Clop, as shown in Figure 1-14.\n\n Through the findings and similarities\n\n between the two malware, we can deduce\n\n that Flawed Ammyy RAT is used as one of the\n\n infection vectors of the CLOP ransomware,\n\nFigure 1-14 | Encrypted File\n\n###### even though its distribution method and\n\n infection method are not yet confirmed. This is because Flawed Ammyy RAT can execute\n\n commands to steal information and install malware via remote control. The Figure 1-15\n\n summarizes the distribution method of threat actor using two malicious codes of Flawed\n\n Ammyy RAT and CLOP ransomware.\n\nFigure 1-15 | Presumed Distribution Method\n\n###### 4. Conclusion\n\n The analysis conduct by ASEC found many similarities between the Flawed Ammyy RAT and\n\n CLOP ransomware, such as an overlap in the activity period, direct targeting of Korean users,\n\n routines to bypass the antivirus program, and signing and distribution of various malware\n\n including variants using a valid certificate. In addition, they share the same signature and\n\n\n-----\n\n###### they both target enterprise users, which makes it highly likely that they are produced by the\n\n same threat actor.\n\n It is important to keep Windows security patches and anti-virus programs up-to-date in order\n\n to minimize the risk of malware, such as Flawed Ammyy RAT, CLOP ransomware, and so on.\n\n Also, it is necessary to pay extra attention to the execution of attachments, such as emails,\n\n from untrusted sources in the company and to refrain from visiting unauthorized web pages.\n\n AhnLab’s V3 products detect Flawed Ammyy RAT and CLOP ransomware under the following\n\n alias:\n\n <V3 Product Alias>\n\n - XLS/Downloader\n\n - MSI/Downloader\n\n - BinImage/Encoded\n\n - Trojan/Win32.Agent\n\n - Trojan/Win32.Downloader\n\n - Backdoor/Win32.Agent\n\n - Trojan/Win32.ClopRansom\n\n\n-----\n\n-----\n\n###### ANALYSIS-IN-DEPTH\n\n\n### Shadow of WannaCry, 2019 SMB Exploitation\n\n\n###### WannaCry (or WannaCryptor), which infected more than 300,000 systems in May 2017\n\n and gripped the whole world in fear, spread rapidly by exploiting a Windows SMB security\n\n vulnerability (MS17-010). Precaution is required since the recently discovered malware is a\n\n CoinMiner, a type of malware that mines cryptocurrency.\n\n This report details the analysis by AhnLab on the attack cases that exploited the SMB\n\n vulnerability (MS17-010) from 2018 to the first quarter of 2019.\n\n 1. NRSMiner Malware Attack (2018)\n\n In March 2018, a company was found infected with NRSMiner malware. By exploiting the\n\n SMB vulnerability (MS17-010) like WannaCryptor, this malware scans the internal network of\n\n the company and installs the malware that mines the cryptocurrency Monero if the system is\n\n vulnerable. NRSMiner consists of a package file in the ZIP compressed file format, and has a\n\n different filename for the package \"MsraReportDataCache32.tlb\" for each variant.\n\n Figure 2-1 shows the structure of the NRSMiner package. Once the system is infected, one of\n\n the file names, Srv or Srv64, is changed to \"tpmagentservice.dll\" according to the installed OS\n\n\n-----\n\n###### environment and is registered as a service.\n\n This then later creates and executes the attack\n\n modules and the mining tool later. Spoolsv\n\n and Spoolsv64 executables load the package\n\n file, installs necessary modules depending\n\n on the environment, and scans the MS17\n 010 vulnerability in the system. Hash and\n\n Hash64 are XMRig, a public tool known to\n\nFigure 2-1 | Structure of the NRSMiner Package\n\n###### mine Monero. Crypt is a compressed folder\n\n containing publicly available MS17-010 vulnerability-related tools and files.\n\nFigure 2-2 | Flow of the Spoolsv.exe Execution\n\n###### Figure 2-2 shows how the Spoolsv.exe file runs an attack module. This file performs the\n\n function of unpacking the \"MsraReportDataCache32.tlb\" package and loading the internal\n\n modules. As shown in Figure 2-1, the TLB file consists of: XMRig (Public Monero mining tool)\n\n\n-----\n\n###### called hash and hash64, attack modules called spoolsv and spoolsv64, main modules called\n\n srv and srv64, and a compressed file in the name of Crypt that includes tools and files related\n\n to the EternalBlue SMB vulnerability (MS17-010). When the Spoolsv.exe file is executed, it\n\n runs six threads and performs the following series of steps.\n\n First, it creates a folder in the system as shown in Table 2-1, loads the malicious package file,\n\n and decompresses the loaded file.\n\n  - %Windows%\\SecureBootThemes\\\n\n  - %Windows%\\SecureBootThemes\\Microsoft\\\n\n  - %Windows%\\System32\\MsraReportDataCache32.tlb //*Decompresses the TLB (.tlb.zip) file\n\n  - %Windows%\\SecureBootThemes\\Microsoft\\crypt //Delete file once decompressed\n\n\nTable 2-1 | Folder Generated by the Spoolsv.exe File\n\n\n###### To propagate the SMB vulnerability exploit, it runs the svchost.exe (Eternalblue-2.2.0.exe)\n\n and the spoolsv.exe (Doublepulsar-1.3.1.exe) file in the Crypt compression folder inside the\n\n MsraReportDataCache32.tlb file. Depending on the Windows environment, the x64.dll or x86.\n\n dll file is loaded and the file names are hard-coded in spoolsv64.exe.\n\n Finally, a vulnerability scan is conducted within the thread of the spoolsv64.exe process. If\n\n successful, it copies the TLB file from the x64.dll and x86.dll module to the target system and\n\n conducts decompressions. Then the filename is changed to \"tpmagentservice.dll,\" the srv\n\n service is registered, and the spoolsv64.exe file is executed again.\n\n The internal network propagation using the vulnerability proceeds as shown in Figure 2-3.\n\n The example is based on the x64 window.\n\n\n-----\n\n###### When the EternalBlue tool is executed, two log files stage1.txt and stage2.txt are created as\n\n shown in Table 2-2.\n\ncmd.exe /c C:\\WINDOWS\\SecureBootThemes\\Microsoft\\\\svchost.exe > stage1.txt // Eternalblue\ncmd.exe /c C:\\WINDOWS\\SecureBootThemes\\Microsoft\\\\spoolsv.exe > stage2.txt // Doublepulsar\n\n\nTable 2-2 | Generated Log File\n\n\n###### The stage1.txt file is the execution log file of the EternalBlue tool, and details are shown in\n\n Figure 2-4.\n\n\n-----\n\n###### The vulnerability packet is also sent to the target system as shown in Figure 2-5.\n\nFigure 2-5 | Vulnerability Packet Transmission\n\n###### Then the lsass.exe file creates a malicious package file, MsraReportDataCache32.tlb, in the\n\n remote system it has infiltrated the system. The content of this package file is shown in Figure\n\n 2-6. The package file records information in 102,400 bytes each time to the file and directly\n\n sends the plain binary without the additional step of encryption.\n\nFigure 2-6 | TLB Package File Generated by lsass.exe After a Successful Vulnerability Attack\n\n###### The TCP port for packet transmission uses the dynamically allocated 492xx and 572xx bands.\n\n For testing, src: 49287 and dest: 57219 ports were used.\n\n If the vulnerability attack is successful, the \"MsraReportDataCache32.tlb\" file is transferred\n\n\n-----\n\n###### and the transferred file is decompressed. The decompressed folder is saved in the same path,\n\n Windows\\SecureBootThemes\\Microsoft. The name of the srv64 file is changed to \"system32\\\n\n tpagentservice.dll\", copied to the system and registered as a service for operation. This is the\n\n main control module which runs the spoolsv64.exe file within the TLB package and finds\n\n another vulnerable system to distribute the package file. Finally, the XMRig tool, in the name\n\n of hash or hash64, for mining Monero is executed. The mining pool address is shown in Table\n\n 2-3.\n\n\n-o p3.qsd2xjpzfky.site:45560 -u wvsymvtjeg\n-o p1.mdfr6avyyle.online:45560 -u lqbpyceupn\n-o p1.qsd2xjpzfky.site:45560 -u odiqldkee2\n-o p5.mdfr6avyyle.online:45560 -u jodkrofar\n-o p5.qsd2xjpzfky.site:45560 -u dkw1kaxlep\n\n\n###### The main control module decompresses the\n\n malware package file \"MsraReportDataCache32.\n\n tlb\" and creates and executes the attack\n\n module and \"TrustedHostServices.exe\", the\n\n\nTable 2-3 | Mining Pool Address\n\n\n###### Monero coin mining program. The code for the main actions of the control module is shown in\n\n Figure 2-7.\n\n\n-----\n\n###### Also as shown in Table 2-4, the control module deletes all files that are presumed to be the\n\n previous version, stop services, and deletes scheduled jobs.\n\ndnsclientprovider_userdata.mof\nNrsDataCache.tlb\nSecUpdateHost.exe\nServicesHost.exe\nsettings7283.dat\nSysprepCache.ini\nvmichapagentsrv.dll\n(\"schtasks.exe\", \" /Delete /TN \\\"\\\\Microsoft\\\\Windows\\\\UPnP\\\\Services\\\" /F\");\n(\"sc.exe\", \" stop vmichapagentsrv\");\n(\"sc.exe\", \" delete vmichapagentsrv\");\n(\"schtasks.exe\",\" /End /TN \\\"\\\\Microsoft\\\\Windows\\\\Tcpip\\\\TcpipReportingServices\\\"\");\n(\"schtasks.exe\",\" /Delete /TN \\\"\\\\Microsoft\\\\Windows\\\\Tcpip\\\\TcpipReportingServices\\\" /F\");\n\n\nTable 2-4 | Action of Performing File Deletion, Service Stop, and Scheduled Jobs Deletion\n\n\n###### Also, the main control module has its own Mongoose-based web server feature with the role\n\n of transmitting the MsraReportDataCache32.tlb package file to other infected system using\n\n the port 26397. Also, if an external internet connection is available, the malicious package file\n\n is downloaded from the remote server as shown in Figure 2-8.\n\n\n-----\n\n###### The TLB package is updated through this web server using the download address shown in\n\n Table 2-5.\n\n 2. Analysis of the POS Attack Case (2018)\n\n\nrer.njaavfxcgk3.club/f79e53 (port: 4431)\nccc.njaavfxcgk3.club/a4c80e (port: 4433)\nccc.njaavfxcgk3.club/5b8c1d (port: 4433)\nccc.njaavfxcgk3.club/d0a01e (port: 4433)\n\nTable 2-5 | Download Address of the TLB Package Update\n\n\n###### In July 2018, 100,000 POS terminals were\n\n hacked in South Korea. The hacking caused\n\n most POS terminals to disconnect from the\n\n\n###### internet and prevented normal operation of the payment service. One of the companies\n\n which was the victim of this hacking incident posted about their service failures that occurred\n\n due to the exploit of the Windows security vulnerability and also the recommendations for\n\n security patches\n\n Most of the infected terminals were running the Windows XP operating system that has\n\n the SMB vulnerabilities and did not have the security updates applied. The threat actor\n\n exploited this vulnerability, like the WannaCryptor ransomware, to install Gh0st RAT, which\n\n is a backdoor malware and CoinMiner. The Figure 2-9 shows the operation process of the\n\n malware.\n\nFigure 2-9 | Operation Process of the POS Malware (2018.07)\n\n\n-----\n\n###### The AhnLab Smart Defense (ASD) engine was used to find the iiiiiiii.exe file, the third file in\n\n Figure 2-9 which was created by \"lsass.exe\", Windows system file. From this, we can deduce\n\n that this is an attack exploiting the SMB vulnerability which was propagated by an infected\n\n system. The malware for the remote control Gh0st RAT is \"3b.txt\", the second file in Figure 2-9.\n\n The first file, \"3a.txt\", downloads CoinMiner, a tool for mining cryptocurrency.\n\nFigure 2-10 | Detection of SMB Vulnerability Behaviors (2018.06 - 2018.07)\n\n###### AhnLab's V3 products provide the behavior detection function against such SMB vulnerability\n\n attacks. The report count in Figure 2-10 shows that there was a sudden rise in the attack\n\n attempts between June 24th and July 7, 2018 which is the same period as the POS hacking\n\n incident in Korea.\n\n 3. Analysis of the POS Attack Case 2 (2019)\n\n In February 2019, another case of an infection that uses the CoinMiner malware to exploit the SMB\n\n vulnerability was found targeting the South Korean POS terminals. The overall operation process\n\n of this malware is shown in Figure 2-11 below.\n\n\n-----\n\n###### The sample.exe file is a malware which contains two different types of 32-bit and 64-bit files to\n\n apply depending on the operating environment. The \"svchost.exe\" file copied in the drive folder\n\n in the system path (%system%drivers) performs the actual role of initiating the SMB vulnerability\n\n attack. The last file that is downloaded and installed is the CoinMiner malware and Mimikatz, a\n\n hacking tool for stealing the Windows account information. Unlike the POS attack of July 2018, the\n\n interesting characteristics of the CoinMiner malware is that it is a script rather than an executable.\n\n The detection report in Figure 2-12 shows a sudden rise in the SMB vulnerability related behaviors\n\n from a specific period of January to February of 2019.\n\nFigure 2-12 | Detection of SMB Vulnerability Behaviors (2019.01 - 2019.02)\n\n\n-----\n\n###### 4. Conclusion\n\n In 2008, a worm called Conficker started to infect many systems and continued to do so,\n\n targeting the SMB vulnerability (MS08-067) to propagate the infection. Companies using the\n\n SMB service are susceptible to the types of attacks, especially when they are not applied with\n\n the recent security updates. To prevent such damage, the following security patches related\n\n to the Microsoft Windows operating system's EternalBlue SMB vulnerability (MS17-010) must\n\n be applied.\n\n In view of the March 2010 NRSMiner malware attacks and the POS attacks which took\n\n place in February and July 2018, it seems that the SMB vulnerability (MS17-010) attacks will\n\n continue in an increasingly sophisticated way. Therefore, security inspections and updates\n\n are important especially for the POS terminals in a vulnerable environment.\n\n [SMB Vulnerability Patch]\n\n[- https://docs.microsoft.com/en-us/security-updates/securitybulletins/2017/ms17-010](http://docs.microsoft.com/en-us/security-updates/securitybulletins/2017/ms17-010)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/AhnLab/ASEC_REPORT_vol.94_ENG.pdf"
    ],
    "report_names": [
        "ASEC_REPORT_vol.94_ENG"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1554893111,
    "ts_modification_date": 1554893113,
    "files": {
        "pdf": "https://archive.orkl.eu/3480bf45d133f7d3ba136459a553b7e31d0a7945.pdf",
        "text": "https://archive.orkl.eu/3480bf45d133f7d3ba136459a553b7e31d0a7945.txt",
        "img": "https://archive.orkl.eu/3480bf45d133f7d3ba136459a553b7e31d0a7945.jpg"
    }
}