{
    "id": "08e91cb3-ed9b-4a6f-a78e-d0f07c98ebb9",
    "created_at": "2022-10-25T16:48:22.490106Z",
    "updated_at": "2025-03-27T02:17:16.800558Z",
    "deleted_at": null,
    "sha1_hash": "0d98f0605864ff868915aebe136216db46d997d6",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-09-10T09:48:05Z",
    "file_modification_date": "2018-09-10T09:48:05Z",
    "file_size": 1811962,
    "plain_text": "# Leviathan: Espionage actor spearphishes maritime and defense targets\n\n[proofpoint.com/us/threat‑insight/post/leviathan‑espionage‑actor‑spearphishes‑maritime‑and‑defense‑targets](https://www.proofpoint.com/us/threat-insight/post/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets)\n\nOctober 17, 2017\n\nOverview\n\nProofpoint researchers are tracking an espionage actor targeting organizations and high‑value targets in\ndefense and government. Active since at least 2014, this actor has long‑standing interest in maritime industries,\nnaval defense contractors, and associated research institutions in the United States and Western Europe.\n\nKey takeaways from this research include:\n\nIndustry targeting: The actor targets defense contractors, universities (particularly those with military\nresearch ties), legal organizations [3] and government agencies [3]. The actor has particular interest in\nnaval industries including shipbuilding and related research\nGeographical targeting: Targeting includes United States, Western Europe, and South China Sea\nTools: Custom JavaScript [malware known as “Orz” and “NanHaiShu”, Cobalt Strike, the SeDll JavaScript](https://www.proofpoint.com/us/threat-reference/malware)\nloader, and MockDll dll loader\nDelivery: Emailed attachments and URLs, often employing a fraudulent lookalike domain and stolen\nbranding\nExploitation: Microsoft Excel and Word documents with macros (sometimes password‑protected), very\nrecent vulnerabilities such as [CVE‑2017‑0199 and](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0199) [CVE‑2017‑8759, and malicious Microsoft Publisher](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-8759)\nfiles\nInstallation: JavaScript, JavaScript Scriptlets in XML, HTA, PowerShell, WMI, regsvr32, Squiblydoo\nLateral Movement: The actor sometimes utilizes access at one compromised organization to attack the\nnext. For example, compromised email accounts at one organization were used to send the next wave of\nmalicious attachments to potential victims in the same industry. Similarly the actor attempts to\ncompromise servers within victim organizations and use them for command and control (C&C) for their\nmalware.\n\nThis blog traces key activities connected to this actor and examines a number of their tools and techniques.\nCampaigns and details are presented in reverse chronological order to highlight the group’s most recent\nactivities.\n\nDelivery and Exploitation\n\nSeptember 2017\n\nOn September 15 and 19, 2017, Proofpoint detected and blocked [spearphishing emails from this group targeting](https://www.proofpoint.com/us/threat-reference/spear-phishing)\na US shipbuilding company and a US university research center with military ties. Example emails used the\nsubject “Apply for internship position” and contained an attachment “resume.rtf”. Another attachment,\n“ARLUAS_FieldLog_2017‑08‑21.doc” contained a “Torpedo recovery experiment” lure. The attachments\nexploited CVE 2017 8759 which was discovered and documented only five days prior to the campaign [1]\n\n\n-----\n\nFigure 1: Example attachment resume.rtf from September 2017 campaign\n\nAugust 2017\n\nBetween August 2 and 4, the actor sent targeted spearphishing emails containing malicious URLs linking to\ndocuments to multiple defense contractors. Some of this activity was documented and observed by a fellow\nresearcher [2]. Many of the documents, C&C domains, and payload domains abused the brand of a major\nprovider of ships, submarines, and other vessels with military applications. Some of the documents exploited\nCVE‑2017‑0199 to deliver the payload.\n\nFigure 2: One of the documents involved in the campaign used Microsoft licensing lures purporting to be\nfrom a well‑known shipbuilder (sha256:\n6f6ee01e9dc2d8c4c260ef4131fe88dc152e53ee8afd3e66e92d4e1bf5fd2e92).\n\nOther documents were Microsoft Publisher files that relied on social engineering. The potential victims were\nlured into starting an embedded PowerPoint presentation, moving the mouse to trigger execution of an\nembedded JavaScript [5], and then pressing “Enable” in a warning dialog to cause the payload download. The\nPublisher files were poorly crafted, relied on multiple user interactions, and contained multiple grammatical and\ntypographic errors.\n\n\n-----\n\nFigure 3: Publisher document delivered via a link in email is in Italian, and is a simple reuse of a\nstudent’swork.\n\nFebruary 2015\n\nFrom February to October of 2015, our colleagues at F‑Secure and McAfee reported on campaigns [3][4] by this\nactor targeting South China Sea interests. During this time, the group utilized Microsoft Excel and Word\ndocuments with macros to target the Philippines Department of Justice, APEC organizers, and an international\nlaw firm. Targeting of these companies is different from that which we typically observe for this actor; however it\nstill centers around marine and naval issues as related to South China sea politics.\n\nFigure 4: Example attachment “DOJ Staff bonus January 13, 2015.xls”. Similar to this document attachment,\nmost of the attachments in this campaign did not contain meaningful content\n\nNovember 2014\n\nThe period between November 2014 and January 2015 marked one of the earlier instances in which Proofpoint\nobserved persistent exploitation attempts by this actor. The actor generally emailed Microsoft Excel documents\nwith malicious macros to US universities with military interests, most frequently related to the Navy. The actor\nalso occasionally used macro‑laden Microsoft Word documents to target other US research and development\norganizations with military and intelligence ties during this period.\n\nEmails were often very simple with a greeting and an attachment. On other occasions, it appears that the\nattackers used highly topical lures based on current events or legitimate documents stolen from previous\nvictims. Lure topics included symposia, the Navy, IT, and relevant research.\n\n\n-----\n\nFigure 5: Example Excel attachment “2014 Accomplishments Input Template.xls”\n\nInstallation\n\nThe actor continues to:\n\nInnovate and modify the code that accomplishes the installation, while the backdoor code remains more\nstatic\nUse scripting languages such as JavaScript, JavaScript Scriptlets, VBScript, and XML\nUse simple obfuscation such as base64, gzip compression, and insertion of garbage characters\nSplit functionality of the backdoor & code that establishes persistence for the backdoor into separate files\nand scripts\n\nExample 1: Resume.rtf\n\nThe “resume.rtf” file from the September 19, 2017 attack retrieves the malicious SOAP WSDL definition named\n“readme.txt “ using an anonymous FTP logon to the attacker’s server.\n\nFigure 6: SOAP WSDL definition (“readme.txt “)\n\nThis definition in turn downloads a VBScript favicon.ico file, which then creates and runs two JavaScript files in\nthe %TMP% directory:\n\n\n-----\n\nThe job of the smaller of the two JavaScripts is to establish a system autostart mechanism. It accomplishes this\nby deobfuscating another script, link.js, into %TMP%. Link.js in turn creates a shortcut file \"Java(TM) Platform\nSE Auto Updater.lnk\" in the \"Startup\" special folder pointing to the main backdoor JavaScript.\n\nFigure 8: Code for establishing persistence after reboot (autostart mechanism)\n\nThe job of the larger of the two JavaScripts is to download and execute the Cobalt Strike payload. It\naccomplishes this by writing more code to rWug5n0PHUFjDFyb8k.js in the temporary directory, which then runs\na PowerShell command (obfuscated using garbage characters, base64 encoding, and Gzip compression). The\nPowerShell is a default Cobalt Strike downloader.\n\nFigure 9: PowerShell code downloading Cobalt Strike\n\nExample 2: Malicious Microsoft Publisher document\n\nThe malicious script executed by the Microsoft Publisher file downloads and runs yet another JavaScript file,\n0.js, hosted on the attacker‑controlled server:\n\nFigure 10: Malicious script executed by the Microsoft Publisher file (sha256:\n305f331bfb1e97028f8c92cbcb1dff2741dcddacc76843e65f9b1ec5a66f52bc)\n\n\n-----\n\nSimilar to the previous example (resume.rtf), the 0.js handles the system autostart mechanism via a shortcut file\n\"office 365.lnk\" in the \"Startup\" special folder. However, the shortcut abuses the “Squiblydoo” technique [6].\nMoreover, the backdoor is not run directly but via an intermediary SeDll (see below).\n\n0.js also downloads two additional files from the C&C server (green.ddd and green.tmp) The first of these files,\ngreen.ddd, is an executable file internally named “SEDll_Win32.dll”. This is a known backdoor used by this actor\nsince 2014 for the same purpose: decrypting and executing the final JavaScript backdoor “Orz”.\n\nTools\n\nNanHaiShu\n\nWe have observed variants of this JavaScript backdoor used in various campaigns, including those publically\nreported. The actor continues to improve and refine the malware by, for example, wrapping it inside an HTA\nwrapper. Several good descriptions are available in analyses from fellow researchers [3][4]. Basic functionality\nincludes:\n\nInformation gathering (computer name, user name, serial number, proxy server)\nDownloading from URL\nExecuting other JavaScript\nRegistry, system, process, directory, file operations\nSafeIE (change IE settings to reduce warnings about about malware activity)\n\nFigure 11: Screenshot from 2015 version of the malware dropped by “DOJ Staff bonus January 13, 2015.xls”\n\nOrz\n\nWe observed this backdoor in an August 2017 campaign dropped by the Microsoft Publisher files, as well as\nmuch earlier in 2014. We named it due to a variable name “orz”, which is changed to “core” in the more recent\nversion. The actor consistently tweaks and improves this backdoor as well. The backdoor is a fairly involved\nscript malware. Its functionality includes:\n\nInformation gathering (IE version, OS version, OS 64‑bit/32‑bit, etc)\nOverwriting registry settings to reduce malware visibility on system\nDownload file\nUpload file\nExecute a command with cscript\nExecute JavaScript\nExecute shell command\nExecute a dll (via an embedded ‘MockDll')\nGet proxy info\nG t li t\n\n\n-----\n\nGET request to a URL\nPOST request to a URL\n\nFigure 12: Snippet of the Orz backdoor code delivered by the the Microsoft Publisher document. The URL\ndomain is a fraudulent lookalike domain.\n\nThere is an extensive configuration section at the top of the script. The \"jmpUrlList\" provides the initial C&C\nservers, which are used to determine the secondary C&C server as well as additional commands to execute. It is\nworth noting that the secondary C&C may be the same as the first. We have observed attacker‑controlled web\nservers, compromised victim web servers, and Technet and Pastebin web pages used for the initial C&C.\n\nThe initial C&C response is parsed with a regex. The backdoor first looks for the secondary encoded C&C server\nusing the \"jmpRegex\" regex. Next, the backdoor looks for additional code to execute using the \"codeRegex\"\nregex. For additional code, we observed simple code blocks that provide a different upload/download\nfunctionality.\n\nFigure 13: The encoded response \"vcmQx3ELgTyTyOVSvsm7wrBKwraFw8VFwCuL\" in the image above\ndecodes to \"hxxp://www.vitaminmain[.]info\" which is the secondary C&C server for an older backdoor variant\n(Decoder provided in Appendix).\n\nMockDll\n\nSome versions of the Orz backdoor have 32‑ and 64‑bit embedded DLLs, stored internally as base64 strings.\n\n\n-----\n\nlike that shown in Figure 14:\n\nFigure 14: MockDll configuration file\n\nmock: defaults to 'regsvr32'\n\nreal: the dll, which is the ultimate goal to execute\n\nargs: arguments to the dll that will be executed, if any\n\noutf: file in which to write results of the MockDll run\n\ntime: timeout defaults to 5\n\nAfter the configuration file is created, the MockDll is executed with regsvr32. MockDll reads the mentioned .ini\nconfig file to determine what to execute. It can log its execution results into a file specified by the “outf”\nparameter, as shown in Figure 15:\n\nFigure 15: Contents of the log file created by MockDll\n\nSeDll\n\nThis DLL is used for decrypting and executing another JavaScript backdoor such as Orz. The DLL is registered\nby the installer using regsvr32. The DllRegisterServer export is then called, which performs checks on the\ncommandline parameter. If the string “DR” is passed as an argument, or if the DLL is running in the active\nsession with a username that is not “system”, the final JavaScript backdoor is decoded using a custom base64\nalphabet. This backdoor has to be present in the same directory as the dll, with a “.tmp” file extension. The\nbackdoor script is then executed using the IActiveScript and IActiveScriptParse32 COM interfaces.\n\nFigure 16: Decoding and executing of the JavaScript backdoor\n\nIf those conditions are not met, it runs the following command line “\"regsvr32 /s \\\"%s\\\" DR __CIM__\"” to register\nthe DLL, where %s is the path to the DLL. It tries to do this with the current user privileges, but if the privileges\ncannot be adjusted it defaults to the available execution environment.\n\nCobalt Strike\n\nThis is a penetration testing tool. The attackers often abuse the free trial version.\n\n\n-----\n\nThis actor, whose espionage activities primarily focus on targets in the US and Western Europe with military ties,\nhas been active since at least 2014. The tools, techniques, and targets consistently connect their work,\nparticular given their attention to naval and maritime defense interests and use of custom backdoors. While\ndefense contractors and academic research centers with military ties should always be cognizant of the\npotential for cyberattacks, organizations fitting their targeting profiles should be especially wary of legitimate‑\nlooking but unsolicited emails from outside entities. Appropriate layered defenses at the firewall, email gateway,\nand endpoint can all help prevent the kinds of lateral movement we have observed with this actor, as well as the\ncompromise and abuse of systems via which this group expands its attack surface to other organizations.\n\nReferences\n\n[1] [https://www.fireeye.com/blog/threat‑research/2017/09/zero‑day‑used‑to‑distribute‑finspy.html](https://www.fireeye.com/blog/threat-research/2017/09/zero-day-used-to-distribute-finspy.html)\n\n[2] [https://twitter.com/James_inthe_box/status/893525493059788800](https://twitter.com/James_inthe_box/status/893525493059788800)\n\n[3] [https://labsblog.f‑secure.com/2016/08/04/nanhaishu‑rating‑the‑south‑china‑sea/](https://labsblog.f-secure.com/2016/08/04/nanhaishu-rating-the-south-china-sea/)\n\n[4] https://community.spiceworks.com/topic/1028936‑stealthy‑cyberespionage‑campaign‑attacks‑with‑social‑\nengineering\n\n[5] [http://blog.trendmicro.com/trendlabs‑security‑intelligence/mouseover‑otlard‑gootkit/](http://blog.trendmicro.com/trendlabs-security-intelligence/mouseover-otlard-gootkit/)\n\n[6] https://www.carbonblack.com/2016/04/28/threat‑advisory‑squiblydoo‑continues‑trend‑of‑attackers‑using‑\nnative‑os‑tools‑to‑live‑off‑the‑land/\n\nIndicators of Compromise (IOCs)\n\nIOC IOC Description\nType\n\ncdf6e2e928a89cbb857e688055a25e37a8d8b8b90530bd52c8548fb544f66f1f SHA256 Resume.rtf exploiting CVE‑\n2017‑8759 (Sep 19, 2017)\n\nc7fa6f27ec4f4142ae591f2dd7c63d046431945f03c87dbed88d79f55180a46d SHA256 ARLUAS_FieldLog_2017‑08‑\n21.doc exploiting CVE‑2017‑\n8759 (Sep 19, 2017)\n\nftp://185.106.120[.]206/pub/readme.txt URL Resume.rtf downloading\nscripts (Sep 19, 2017)\n\nhxxp://185.106.120[.]206/favicon.ico URL Resume.rtf downloading\nscripts (Sep 19, 2017)\n\n39c952c7e14b6be5a9cb1be3f05eafa22e1115806e927f4e2dc85d609bc0eb36 SHA256 Favicon.ico (Sep 19, 2017)\n\n5860ddc428ffa900258207e9c385f843a3472f2fbf252d2f6357d458646cf362 SHA256 Cobalt Strike (Sep 19, 2017)\n\nced7ca9625543d3d3d09f70223cc19f0d99e21792854452df5ba84b3a59d17b8 SHA256 20170720_final_pm_app‑\n2.doc (August\n2017)Document hash\n(August 2017)\n\n305f331bfb1e97028f8c92cbcb1dff2741dcddacc76843e65f9b1ec5a66f52bc SHA256 Publisher hash (August\n2017)\n\nbfc5c6817ff2cc4f3cd40f649e10cc9ae1e52139f35fdddbd32cb4d221368922 SHA256 MockDll 32‑bit (August\n2017)\n\n|IOC|IOC Type|Description|\n|---|---|---|\n|cdf6e2e928a89cbb857e688055a25e37a8d8b8b90530bd52c8548fb544f66f1f|SHA256|Resume.rtf exploiting CVE‑ 2017‑8759 (Sep 19, 2017)|\n|c7fa6f27ec4f4142ae591f2dd7c63d046431945f03c87dbed88d79f55180a46d|SHA256|ARLUAS_FieldLog_2017‑08‑ 21.doc exploiting CVE‑2017‑ 8759 (Sep 19, 2017)|\n|ftp://185.106.120[.]206/pub/readme.txt|URL|Resume.rtf downloading scripts (Sep 19, 2017)|\n|hxxp://185.106.120[.]206/favicon.ico|URL|Resume.rtf downloading scripts (Sep 19, 2017)|\n|39c952c7e14b6be5a9cb1be3f05eafa22e1115806e927f4e2dc85d609bc0eb36|SHA256|Favicon.ico (Sep 19, 2017)|\n|5860ddc428ffa900258207e9c385f843a3472f2fbf252d2f6357d458646cf362|SHA256|Cobalt Strike (Sep 19, 2017)|\n|ced7ca9625543d3d3d09f70223cc19f0d99e21792854452df5ba84b3a59d17b8|SHA256|20170720_final_pm_app‑ 2.doc (August 2017)Document hash (August 2017)|\n|305f331bfb1e97028f8c92cbcb1dff2741dcddacc76843e65f9b1ec5a66f52bc|SHA256|Publisher hash (August 2017)|\n\n\n-----\n\n|80b931ab1798d7d8a8d63411861cee07e31bb9a68f595f579e11d3817cfc4aca|SHA256|MockDll 32‑bit (August 2017)|\n|---|---|---|\n|146aa9a0ec013aa5bdba9ea9d29f59d48d43bc17c6a20b74bb8c521dbb5bc6f4|SHA256|green.ddd SeDll (August 2017)|\n|4029b43c7febd05e8bf013c1022244aaa238341ca44bbce2250667614c1a4932|SHA256|2014 Accomplishments Input Template.xls (December 2014)|\n|hxxp://www.vitaminmain[.]info|URL|Orz secondary C2 (December 2014)|\n\n\nET and ETPRO Suricata/Snort Coverage\n\n2024192 | ET EXPLOIT Possible CVE‑2017‑0199 HTA Inbound\n\n2024196 | ET WEB_CLIENT HTA File containing Wscript.Shell Call ‑ Potential CVE‑2017‑0199\n\n2022520 | ET POLICY Possible HTA Application Download\n\n2024197 | ET CURRENT_EVENTS SUSPICIOUS MSXMLHTTP DL of HTA (Observed in CVE‑2017‑0199)\n\n2024449 | ET CURRENT_EVENTS SUSPICIOUS Possible CVE‑2017‑0199 IE7/NoCookie/Referer HTA dl\n\n2814013 | ETPRO TROJAN Meterpreter or Other Reverse Shell SSL Cert\n\n2023629 | ET INFO Suspicious Empty SSL Certificate ‑ Observed in Cobalt Strike\n\n2810628 | ETPRO TROJAN JavaScript Backdoor CnC Beacon M2 (b64 3)\n\n2828317 | ETPRO TROJAN Orz JavaScript Backdoor Communicating with CnC\n\n2828316 | ETPRO TROJAN Orz JavaScript Backdoor Sending Password to CnC\n\nAppendix: Orz Traffic Decoder\n\nvar _keyStr = \"oMZF/W42VkcCbqOiPSajhnKtQws8NRAxr16XJpu=0mgE3THGLlvz9+5BDYd7feyUI\";\n\nfunction decode (input) {\n\nvar output = \"\";\n\nvar chr1, chr2, chr3;\n\nvar enc1, enc2, enc3, enc4;\n\nvar i = 0;\n\ninput = input.replace(/[^A‑Za‑z0‑9\\+\\/\\=]/g, \"\");\n\nwhile (i < input.length) {\n\nenc1 = this._keyStr.indexOf(input.charAt(i++));\n\nenc2 = this._keyStr.indexOf(input.charAt(i++));\n\nenc3 = this._keyStr.indexOf(input.charAt(i++));\n\nenc4 = this._keyStr.indexOf(input.charAt(i++));\n\nchr1 = (enc1 << 2) | (enc2 >> 4);\n\n\n-----\n\noutput = output + String.fromCharCode(chr1);\n\nif (enc3 != 64) {\n\noutput = output + String.fromCharCode(chr2);\n\n}\n\nif (enc4 != 64) {\n\noutput = output + String.fromCharCode(chr3);\n\n}\n\n}\n\noutput = this._utf8_decode(output);\n\nreturn output;\n\n}\n\nfunction _utf8_decode (utftext) {\n\nvar string = \"\";\n\nvar i = 0;\n\nvar c = c1 = c2 = 0;\n\nwhile ( i < utftext.length ) {\n\nc = utftext.charCodeAt(i);\n\nif (c < 128) {\n\nstring += String.fromCharCode(c);\n\ni++;\n\n} else if((c > 191) && (c < 224)) {\n\nc2 = utftext.charCodeAt(i+1);\n\nstring += String.fromCharCode(((c & 31) << 6) | (c2 & 63));\n\ni += 2;\n\n} else {\n\nc2 = utftext.charCodeAt(i+1);\n\nc3 = utftext.charCodeAt(i+2);\n\nstring += String.fromCharCode(((c & 15) << 12) | ((c2 & 63) << 6) | (c3 & 63));\n\ni += 3;\n\n}\n\n}\n\nreturn string;\n\n}\n\nvar decodeme =\n\n\n-----\n\ndocument.write(res);\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2017/2017.10.16.Leviathan/Leviathan_Espionage_actor.pdf"
    ],
    "report_names": [
        "Leviathan_Espionage_actor"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "59be3740-c8c7-47aa-84c8-e80d0cb7ea3a",
            "created_at": "2022-10-25T15:50:23.481057Z",
            "updated_at": "2025-03-27T02:00:55.480695Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "MUDCARP",
                "Kryptonite Panda",
                "Gadolinium",
                "BRONZE MOHAWK",
                "TEMP.Jumper",
                "APT40",
                "TEMP.Periscope",
                "Gingham Typhoon"
            ],
            "source_name": "MITRE:Leviathan",
            "tools": [
                "Windows Credential Editor",
                "BITSAdmin",
                "HOMEFRY",
                "Derusbi",
                "at",
                "BLACKCOFFEE",
                "BADFLICK",
                "gh0st RAT",
                "PowerSploit",
                "MURKYTOP",
                "NanHaiShu",
                "Orz",
                "Cobalt Strike",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b9806584-4d82-4f32-ae97-18a2583e8d11",
            "created_at": "2022-10-25T16:07:23.787833Z",
            "updated_at": "2025-03-27T02:02:09.978883Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "APT 40",
                "ATK 29",
                "Bronze Mohawk",
                "Gadolinium",
                "Gingham Typhoon",
                "ISLANDDREAMS",
                "ITG09",
                "Kryptonite Panda",
                "Mudcarp",
                "Red Ladon",
                "TA423",
                "TEMP.Jumper",
                "TEMP.Periscope"
            ],
            "source_name": "ETDA:Leviathan",
            "tools": [
                "AIRBREAK",
                "Agent.dhwf",
                "Agentemis",
                "AngryRebel",
                "BADFLICK",
                "BlackCoffee",
                "CHINACHOPPER",
                "China Chopper",
                "Cobalt Strike",
                "CobaltStrike",
                "DADJOKE",
                "Dadstache",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "GRILLMARK",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEFRY",
                "Hellsing Backdoor",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "LUNCHMONEY",
                "Living off the Land",
                "MURKYTOP",
                "Moudour",
                "Mydoor",
                "NanHaiShu",
                "Orz",
                "PCRat",
                "PNGRAT",
                "PlugX",
                "RedDelta",
                "SeDLL",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "cobeacon",
                "gresim",
                "scanbox"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "83025f5e-302e-46b0-baf6-650a4d313dfc",
            "created_at": "2024-05-01T02:03:07.971863Z",
            "updated_at": "2025-03-27T02:05:17.278721Z",
            "deleted_at": null,
            "main_name": "BRONZE MOHAWK",
            "aliases": [
                "Flaccid Rose ",
                "GADOLINIUM ",
                "Kryptonite Panda ",
                "Leviathan ",
                "Nanhaishu ",
                "Pickleworm ",
                "Temp.Jumper ",
                "Temp.Periscope ",
                "APT40 "
            ],
            "source_name": "Secureworks:BRONZE MOHAWK",
            "tools": [
                " BlackCoffee",
                " China Chopper",
                " Cobalt Strike",
                " Derusbi",
                " Derusbi Trojan",
                " FUSIONBLAZE",
                " GreenCrash",
                " HOMEFRY",
                " MURKYTOP",
                " Metasploit",
                " Metasploit / Meterpreter",
                " Nanhaishu",
                " Orz",
                " ScanBox",
                " SeDll",
                "AIRBREAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041836,
    "ts_creation_date": 1536572885,
    "ts_modification_date": 1536572885,
    "files": {
        "pdf": "https://archive.orkl.eu/0d98f0605864ff868915aebe136216db46d997d6.pdf",
        "text": "https://archive.orkl.eu/0d98f0605864ff868915aebe136216db46d997d6.txt",
        "img": "https://archive.orkl.eu/0d98f0605864ff868915aebe136216db46d997d6.jpg"
    }
}