{
    "id": "090094d9-dc99-416f-8875-1d59e797a936",
    "created_at": "2023-01-12T15:03:16.112807Z",
    "updated_at": "2025-03-27T02:05:22.696812Z",
    "deleted_at": null,
    "sha1_hash": "b42446ac3b7da85b7bad44af59d222354cda3064",
    "title": "2021-12-14 - Neutralizing Apache Log4j Exploits with Identity-Based Segmentation",
    "authors": "",
    "file_creation_date": "2022-05-28T19:26:04Z",
    "file_modification_date": "2022-05-28T19:26:04Z",
    "file_size": 499423,
    "plain_text": "# Neutralizing Apache Log4j Exploits with Identity-Based Segmentation\n\n**[zscaler.com/blogs/security-research/neutralizing-apache-log4j-exploits-identity-based-segmentation](https://www.zscaler.com/blogs/security-research/neutralizing-apache-log4j-exploits-identity-based-segmentation)**\n\nOn December 11, Zscaler’s TheatLabz observed exploit attempts of the Log4j in the wild,\n[analyzed the vulnerability, and recommended protection strategies. Read the blogs here](https://www.zscaler.com/blogs/product-insights/prevent-apache-log4j-java-library-vulnerability-zero-trust-architecture)\n[and here. Among the recommendations to mitigate the impact of the vulnerability was to](https://www.zscaler.com/blogs/security-research/security-advisory-log4j-0-day-remote-code-execution-vulnerability-cve-2021)\n[apply app-to-app microsegmentation using identity. This post explains why identity-based](https://www.zscaler.com/resources/security-terms-glossary/what-is-microsegmentation)\nsegmentation is superior to traditional firewall-based segmentation in preventing initial\ncompromise and stopping lateral movement of threats from a compromised workload.\n\nTraditional address-based segmentation uses L3/L4 based host firewalls rules to control\nwhat’s being communicated. This approach is ineffective because an IP address does not\nreveal what software is communicating. Even L7 firewalls looking at protocol information are\nunable to conclusively determine the identity of the communicating software. For example, if\na Log4j server is compromised and malicious code has been remotely executed, the\nmalicious code could piggyback on approved firewall policies to move laterally in the\nenvironment. In this attack scenario below, in Phase 2, the compromised Log4j server—\nafter the final payload has been delivered—could allow threats to move laterally.\n\n\n-----\n\n_Image:_ _[Fastly](https://www.fastly.com/blog/digging-deeper-into-log4shell-0day-rce-exploit-found-in-log4j)_\n\nAn identity-based segmentation solution would help prevent or contain the blast radius of\n[the exploit. First let’s understand how identity-based segmentation works. This blog post](https://www.zscaler.com/blogs/product-insights/identity-based-microsegmentation-foundational-cloud-security-dont-get)\n“Identity-Based Microsegmentation is Foundational to Cloud Security: Don’t Get Spoofed”\nfrom Zscaler explains it in detail. Here is a relevant excerpt:\n\n\n-----\n\n_To enable identity-based microsegmentation, each device and software asset is assigned_\n_an immutable, unique identity based on dozens of properties of the asset itself, such as a_\n_SHA-256 hash of a binary or the UUID of the BIOS. Identities extend down to the_\n_subprocess level, so we can uniquely identify even individual Java JAR and Python scripts._\n_Identity creation and management is fully automated to simplify operations._\n\n_Zscaler verifies the identities of communicating software in real time. This zero trust_\n_approach prevents unapproved and malicious software from communicating. Piggybacking_\n_attacks using approved firewall rules become a thing of the past. Identity is the secret to_\n_achieving simpler operations and delivering stronger protection compared to traditional_\n_network security controls.\"_\n\nIn the exploit example (image above), if identity-based segmentation had been in place with\nleast-privilege enforcement, attack risk could be reduced through multiple layers of defense:\n\n1. Initial inbound connectivity would not be allowed as the attacker’s IP would not be in\n\nthe allowed policy. Because the host that receives the inbound connection is protected\nby software identity, indiscriminate access to the system is not allowed.\n2. Outbound communication from the vulnerable server to unknown external entities\n\nwould not be allowed by policy–again enforced by software identity verification.\n3. If the final payload is executed, its lateral propagation would not be allowed because\n\nthe malicious communicating software would be fingerprinted before it attempts to\ncommunicate to other systems. First, Zscaler’s identity-based segmentation solution\nchecks the fingerprint against Zscaler’s threat feeds and if it is reported as malicious,\nadministrators are notified and any software not allowed by policy is automatically\nblocked. All communication by the software is blocked and the admin is notified.\n[Zscaler ThreatLabz has identified several exploit signatures described here and in the](https://www.zscaler.com/blogs/security-research/security-advisory-log4j-0-day-remote-code-execution-vulnerability-cve-2021)\n[Zscaler Threat Library. Other approved software running on the host is allowed to](https://threatlibrary.zscaler.com/?threatname=Apache.Exploit.CVE-2021-44228&_gl=1*1xtuaes*_ga*MzkyMjg3OTQuMTYxNTIxMjEzMA..*_ga_10SPJ4YJL9*MTYzOTQ0MTgxMC4zMjMuMS4xNjM5NDQyMDYwLjE3&_ga=2.97214237.363504171.1639422171-39228794.1615212130)\ncommunicate with no disruption to the business.\n4. If “living off the land” attack techniques are used where legitimate or approved\n\nsoftware is used for an attack, Zscaler’s segmentation solution analyzes\ncommunication patterns of approved software and blocks any communication to other\nsystems within the environment if the communication is not allowed by the leastprivilege access policy set.\n5. Any attempts at exfiltration of information is also blocked as it would not be allowed by\n\nthe segmentation policy for outbound communications.\n6. Even if an environment has not been attacked, Zscaler Workload Segmentation can\n\nhelp inventory all vulnerable Log4j systems that communicate in the environment\nusing software fingerprint hashes which can be retrieved via an API and compared\n[against publicly available hashes, e.g., in Github.](https://github.com/mubix/CVE-2021-44228-Log4Shell-Hashes)\n\n\n-----\n\n7. A [Randori blog post on Log4j notes The presence of JAR files belonging to the Log4j](https://www.randori.com/blog/cve-2021-44228/)\n\nlibrary can indicate an application is potentially susceptible to CVE-2021-44228. The\nspecific files to search for should match the following following pattern: “log4j-core*.jar”. Unlike legacy approaches, Zscaler Workload Segmentation extends identity\ndown to the sub-process level–e.g., not just Java but individual JAR files–which allows\nfor fine-grained control over communicating software. Zscaler also inventories the\nprimary JAR files allowing admins to gain a better understanding of their environment\nand application communication topology.\n8. Finally, no security solution is effective if it is overly complex to manage. Zscaler\n\nWorkload Segmentation simplifies policies by providing the same level of coverage\nwith up to 90 percent fewer policies that are based on identity. Machine learning\neases operations further by automatically recommending segmentation policies.\n\nIn summary, [identity-based segmentation from Zscaler verifies software identity and](https://www.zscaler.com/products/zscaler-workload-segmentation)\nenforces least-privileged access where only known good applications are allowed to\ncommunicate on approved paths. Segmentation using identity is extremely effective in\nprotecting against a broad range of threats with no change to the applications or the\nnetwork. This approach makes it easy to extend zero trust security to workloads in cloud\nand data center environments. Together with other solutions from Zscaler, organizations\ncan use a zero trust architecture to minimize risk and the impact of future vulnerabilities.\n\nTake action:\n\n[Request a custom Workload Segmentation demo today to get started on your journey.](https://www.zscaler.com/products/zscaler-workload-segmentation)\n\n[Run a complimentary internet attack surface analysis to see if you have any external attack](https://info.zscaler.com/internet-attack-surface-analysis?utm_source=google&utm_medium=cpc&utm_campaign=dynamic-search-na&gclid=CjwKCAiAksyNBhAPEiwAlDBeLCOvRr5WYg_LUdIpNyXsYzN14DL-EUpuApFrnSmJEt0Y7_qddIkd9xoC2bgQAvD_BwE)\nsurface using Apache.\n\n[Join our webinar on Wednesday, December 15th for more details and expert guidance on](https://info.zscaler.com/webinar-stop-the-apache-log4j-vulnerability-and-prevent-future-attacks-with-zero-trust)\nthe Apache vulnerability.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-14 - Neutralizing Apache Log4j Exploits with Identity-Based Segmentation.pdf"
    ],
    "report_names": [
        "2021-12-14 - Neutralizing Apache Log4j Exploits with Identity-Based Segmentation.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535796,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653765964,
    "ts_modification_date": 1653765964,
    "files": {
        "pdf": "https://archive.orkl.eu/b42446ac3b7da85b7bad44af59d222354cda3064.pdf",
        "text": "https://archive.orkl.eu/b42446ac3b7da85b7bad44af59d222354cda3064.txt",
        "img": "https://archive.orkl.eu/b42446ac3b7da85b7bad44af59d222354cda3064.jpg"
    }
}