{
    "id": "092fa92e-a9ff-49a0-acc0-f49367ab04cc",
    "created_at": "2023-01-12T15:02:00.150822Z",
    "updated_at": "2025-03-27T02:05:29.152491Z",
    "deleted_at": null,
    "sha1_hash": "d6461e22d8711d30b0ac937231b09b00d9572f1a",
    "title": "2022-02-07 - Exploring Windows UAC Bypasses- Techniques and Detection Strategies",
    "authors": "",
    "file_creation_date": "2022-05-27T21:48:45Z",
    "file_modification_date": "2022-05-27T21:48:45Z",
    "file_size": 2559764,
    "plain_text": "# Exploring Windows UAC Bypasses: Techniques and Detection Strategies\n\n**elastic.github.io/security-research/whitepapers/2022/02/03.exploring-windows-uac-bypass-techniques-detection-**\nstrategies/article/\n\n[Windows Internals](https://elastic.github.io/security-research/tags/#windows-internals)\n\n\n-----\n\n[@sbousseaden 2022-02-07](https://github.com/sbousseaden)\n\nMalware often requires full administrative privileges on a machine to perform more impactful\nactions such as adding an antivirus exclusion, encrypting secured files, or injecting code into\ninteresting system processes. Even if the targeted user has administrative privileges, the\n[prevalence of User Account Control (UAC) means that the malicious application will often](https://docs.microsoft.com/en-us/windows/security/identity-protection/user-account-control/how-user-account-control-works)\n[default to Medium Integrity, preventing write access to resources with higher integrity levels.](https://docs.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control)\nTo bypass this restriction, an attacker will need a way to elevate integrity level silently and\n[with no user interaction (no UAC prompt). This technique is known as a User Account](https://docs.microsoft.com/en-us/windows/security/identity-protection/user-account-control/images/uacconsentprompt.gif)\nControl [bypass and relies on a variety of primitives and conditions, the majority of which are](https://attack.mitre.org/techniques/T1548/002/)\nbased on piggybacking elevated Windows features.\n\nExample of `cscript.exe running as Medium spawning a` `cmd.exe instance with High`\nintegrity via a UAC bypass:\n\n\n-----\n\nMost of UAC validation logic is implemented in the Application Information (AppInfo) service.\n[A great primer about the elevation conditions and the different checks can be found here.](https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e)\n\nIn this blog post, we will take a look at a collection of UAC bypasses, investigate some of the\nkey primitives they depend on, and explore detection opportunities.\n\n## UAC Bypass Methods¶\n\nUAC bypass methods usually result in hijacking the normal execution flow of an elevated\napplication by spawning a malicious child process or loading a malicious module inheriting\nthe elevated integrity level of the targeted application.\n\nThere are some other edge cases but the most common hijack methods are :\n\n## Registry Key Manipulation¶\n\nThe goal of manipulating a registry key is to redirect the execution flow of an elevated\nprogram to a controlled command. The most abused key values are related to shell open\ncommands for specific extensions (depending on the targeted program) or\n\n`windir/systemroot` [environment variables manipulation:](https://www.tiraniddo.dev/2017/05/exploiting-environment-variables-in.html)\n```\n   HKCU\\\\Software\\\\Classes\\<targeted_extension>\\\\shell\\\\open\\command\n\n```\n(Default or DelegateExecute values)\n\n```\nHKCU\\\\Environment\\\\windir\n\n```\n```\nHKCU\\\\Environment\\\\systemroot\n\n```\n\n-----\n\nFor instance, when `fodhelper (a Windows binary that allows elevation without requiring a`\nUAC prompt) is launched by malware as a Medium integrity process, Windows automatically\nelevates `fodhelper from a Medium to a High integrity process. The High integrity`\n```\nfodhelper then attempts to open an ms-settings file using its default handler. Since the\nmedium-integrity malware has hijacked this handler, the elevated fodhelper will\n\n```\nexecute a command of the attacker’s choosing as a high integrity process.\n\n\n-----\n\n[Below is an example of Glupteba malware leveraging this method to first elevate from a](https://malpedia.caad.fkie.fraunhofer.de/details/win.glupteba)\nMedium to High integrity process, then from High to System integrity via Token Manipulation\n[(token stealing):](https://lengjibo.github.io/token/)\n\nAn example of a UAC bypass that manipulates the Windows environment variables registry\nkey is [byeintegrity5. To illustrate this, this bypass uses this primitive to redirect the normal](https://github.com/AzAgarampur/byeintegrity5-uac)\nexecution flow of the CDSSync scheduled task (set to Run with highest privileges) and\nelevate the integrity level as shown below.\n\nWhen the `CDSSync scheduled task is run,` `taskhostw.exe will try to load` `npmproxy.dll`\nfrom the `%windir%\\System32 folder, but because the malware controls` `%windir%, it can`\nredirect `taskhostw.exe to load a DLL named` `npmproxy.dll from a path it controls as`\nshown below.\n\n\n-----\n\nUAC bypasses based on environment variable manipulation often work when UAC is set to\n**Always Notify (the maximum UAC level) as they often don’t involve writing files to secured**\npaths or starting an autoElevated application. Changes to `SystemRoot or` `Windir from`\nthe current user registry to non-expected values are very suspicious and should be a highconfidence signal for detection.\n\n## DLL Hijack¶\n\nThe DLL hijack method usually consists of finding a missing DLL (often a missing\ndependency) or winning a DLL file write race by loading a malicious DLL into an elevated\nprocess. If UAC is enabled but not set to Always Notify, then malware can perform an\n[elevated IFileOperation (no UAC prompt) to create/copy/rename or move a DLL file to a](https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-ifileoperation)\ntrusted path (i.e `System32 ), then trigger an elevated program to load the malicious DLL`\ninstead of the expected one.\n\nThe IFileOperation is performed by `dllhost.exe (COM Surrogate) with`\n```\nprocess.command_line containing the classId { 3AD05575-8857-4850-927711B85BDB8E09 }.\n\n```\n\n-----\n\n[We can use the following EQL correlation to link any file operation by](https://www.elastic.co/guide/en/elasticsearch/reference/current/eql-syntax.html) `dllhost.exe`\nfollowed by loading a non-Microsoft signed DLL into a process running with system integrity:\n\nEQL search - UAC bypass via IFileOperation (Medium to System Integrity)\n```\nsequence by host.id\n [file where event.action in (\"creation\", \"overwrite\", \"rename\",\n \"modification\") and\n /* IFileOperation are performed by DllHost */\n process.name : \"dllhost.exe\" and user.id : \"S-1-5-21-*\" and\n /* executable file dropped via NewItem, Rename, Move or\n Copy IFileOperation */ (file.extension : \"dll\" or\n file.Ext.header_bytes : \"4d5a*\") and\n /* protected system paths usually abused via DLL search order hijack */\n file.path : (\"?:\\\\Windows\\\\system32\\\\*\",\n        \"?:\\\\Windows\\\\syswow64\\\\*\",\n        \"?:\\\\Program Files (x86)\\\\Microsoft\\\\*\",\n        \"?:\\\\Program Files\\\\Microsoft\\\\*\"\n        )] by file.path\n [library where\n /* non MS signed DLL loaded by a System Process */\n user.id : \"S-1-5-18\" and\n process.executable :\n       (\"?:\\\\Windows\\\\system32\\\\*\",\n        \"?:\\\\Windows\\\\syswow64\\\\*\",\n        \"?:\\\\Program Files (x86)\\\\Microsoft\\\\*\",\n        \"?:\\\\Program Files\\\\Microsoft\\\\*\") and\n not (dll.code_signature.subject_name : \"Microsoft *\" and\n   dll.code_signature.trusted == true)] by dll.path\n\n```\n[This is an example detection of UACME 30 sideloading wow64log.dll into an instance of](https://github.com/hfiref0x/UACME/tree/v3.2.x)\n```\nWerFault.exe running as System (which provides a good direct jump from Medium to\n\n```\nSystem integrity) shown below.\n\n\n-----\n\nIf UAC is set to Always Notify,then finding a missing DLL or winning a file write race\ncondition into a path writable by a Medium integrity process is a valid option. This is an\n[example of UAC bypass hijacking the SilentCleanup scheduled task (via a file write race](https://enigma0x3.net/2016/07/22/bypassing-uac-on-windows-10-using-disk-cleanup/)\ncondition) which spawns a high integrity descendant process DismHost.exe executing from\n[an AppData subfolder (writable by Medium integrity) and this is another variation that abuses](https://github.com/EncodeGroup/UAC-SilentClean)\nthe same task but for a missing dependency. api-ms-win-core-kernel32-legacy-l1.dll.\n\nAnother DLL Hijack primitive that can achieve the same goal is to use DLL loading\nredirection via creating a folder within the same directory of the targeted elevated program\n(e.g. `target_program.exe.local and dropping a DLL there that will be loaded instead of`\nthe expected one).\n\nThis technique can be also used as a primitive for local privilege escalation in the case of a\nvulnerability that allows the creation of a folder (with a permissive Access Control List) to a\n[controlled location such as described by Jonas Lykkegård in this blog](https://twitter.com/jonasLyk) _From directory deletion_\n_to SYSTEM shell._\n\nEQL search - Potential Privilege Escalation via DLL Redirection\n\n\n-----\n\n```\nlibrary where user.id : S 1 5 18 and\n dll.path : (\"?:\\\\Windows\\\\system32\\\\*.exe.local\\\\*\",\n       \"?:\\\\Windows\\\\syswow64\\\\*.exe.local\\\\*\",\n       \"?:\\\\Program Files (x86)\\\\Microsoft\\\\*.exe.local\\\\*\",\n       \"?:\\\\Program Files\\\\Microsoft\\\\*.exe.local\\\\*\") and\n not (dll.code_signature.subject_name : \"Microsoft *\" and\n   dll.code_signature.trusted == true) and\n process.executable :\n       (\"?:\\\\Windows\\\\system32\\\\*\",\n        \"?:\\\\Windows\\\\syswow64\\\\*\",\n        \"?:\\\\Program Files (x86)\\\\Microsoft\\\\*\",\n        \"?:\\\\Program Files\\\\Microsoft\\\\*\")\n\n```\n[This query matches on UACME method 22, which targets](https://github.com/hfiref0x/UACME/tree/v3.2.x) `consent.exe (executing as`\nSystem), tricking it into loading `comctl32.dll from the` `SxS DotLocal directory instead`\nof `System32 :`\n\nNote\n\nIt’s worth also mentioning that the majority of UAC bypasses via DLL hijack are also useful\n[for persistence and may bypass detection based on autoruns (known file and registry](https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns)\npersistence locations)\n\n## Elevated COM Interface¶\n\nThis method is a bit different from the previous ones, meaning no direct operation redirection\nis involved. Instead, it relies on finding an elevated COM interface that exposes some form of\n[execution capabilities (i.e. CreateProcess / ShellExec wrapper) that can be invoked to launch](https://gist.github.com/api0cradle/d4aaef39db0d845627d819b2b6b30512#file-akagi_41-c-L130)\na privileged program passed via arguments from a medium integrity process.\n\nFrom a behavior perspective, usually, those COM interfaces will be executed under the\ncontext of `dllhost.exe (COM Surrogate) with` `process.command_line containing the`\n```\nclassId of the targeted COM object, this will usually result in the creation of a high\n\n```\nintegrity child process.\n\n\n-----\n\nBelow are examples of different malware families adopting this method for UAC bypass\n(such as [DarkSide and](https://malpedia.caad.fkie.fraunhofer.de/details/win.darkside) [LockBit ransomware families) to elevate integrity level before](https://malpedia.caad.fkie.fraunhofer.de/details/win.lockbit)\nlaunching the encryption and evasion capabilities, which is good prevention choke point:\n\n## Token Security Attributes¶\n\n[An insightful observation was made by James Forshaw for the possibility of leveraging](https://twitter.com/tiraniddo/status/1192583900645732352?lang=fr)\n[process token security attributes to identify processes launched as descendants of an auto-](https://github.com/processhacker/processhacker/blob/76d00575597c9c6baabcf2cbb81e7e099ac31f8f/phnt/include/ntseapi.h#L194-L204)\nelevated application.\n\n[ProcessHacker also captures this type of information. Below is an example of Token](https://github.com/processhacker/processhacker/blob/ac8578d86bbca9924e9cec2c09ec495d44a6f3fd/ProcessHacker/tokprp.c#L3118-L3171)\nProperties for a notepad.exe instance launched via the `fodhelper UAC bypass.`\n\n\n-----\n\nThe `LUA://HdAutoAp attribute means it’s an auto-elevated application (populated also for`\nelevated COM objects and AppInfo hardcoded whitelisted processes). `LUA://DecHdAutoAp`\nmeans it’s a descendant of an auto elevated application, which is very useful when tracking\nthe process tree generated via a UAC bypass.\n\n[Elastic Endpoint security 7.16 and above capture this information with process execution](https://www.elastic.co/blog/whats-new-elastic-security-7-16-0)\nevents (process.Ext.token.security_attributes) which open up the opportunity to hunt and\ndetect UAC bypasses hijacking the execution flow of an auto-elevated program or COM\nInterface with no prior knowledge of the bypass specifics (targeted binary, COM Interface,\nredirection method, and other important details) :\n\nSuspicious Auto Elevated Program Child Process:\n\nEQL search - Detecting UAC bypass via Token Security Attributes\n\n\n-----\n\n```\nprocess where event.action  start and\n  process.Ext.token.integrity_level_name : (\"high\", \"system\") and\n  process.parent.command_line != null and\n  /* descendant of an auto-elevated application or COM object */\n  process.Ext.token.security_attributes : \"LUA://DecHdAutoAp\" and\n  (\n   /* common lolbins, evasion and proxy execution programs */\n   process.pe.original_file_name :\n         (\"rundll32.exe\",\n         \"cmd.exe\",\n         \"pwsh*\",\n         \"powershell.exe\",\n         \"mshta.exe\",\n         \"msbuild.exe\",\n         \"regsvr32.exe\",\n         \"powershell.exe\",\n         \"cscript.exe\",\n         \"wscript.exe\",\n         \"wmic.exe\",\n         \"installutil.exe\",\n         \"msxsl.exe\",\n         \"Microsoft.Workflow.Compiler.exe\",\n         \"ieexec.exe\",\n         \"iexpress.exe\",\n         \"RegAsm.exe\",\n         \"installutil.exe\",\n         \"RegSvcs.exe\",\n         \"RegAsm.exe\",\n         \"javaw.exe\",\n         \"reg.exe\",\n         \"schtasks.exe\",\n         \"sc.exe\",\n         \"net.exe\",\n         \"net1.exe\",\n         \"vssadmin.exe\",\n         \"bcdedit.exe\",\n         \"wbadmin.exe\",\n         \"msiexec.exe\") or\n    /* suspicious or unusual paths */\n    process.executable : (\"?:\\\\Windows\\\\Microsoft.NET\\\\*\",\n               \"?:\\\\Users\\\\Public\\\\*\",\n               \"?:\\\\Programdata\\\\*\",\n               \"?:\\\\Windows\\\\Temp\\\\*\",\n               \"?:\\\\Windows\\\\Tasks\\\\*\",\n               \"?:\\\\Windows\\\\System32\\\\Tasks\\\\*\") or\n    /* MS signed but from unusual paths */\n    (process.code_signature.trusted == true and\n    process.code_signature.subject_name : \"Microsoft *\" and\n    not process.executable : (\"?:\\\\Windows\\\\system32\\\\*.exe\",\n                 \"?:\\\\Windows\\\\SysWOW64\\\\*.exe\",\n                 \"?:\\\\Program Files\\\\*.exe\",\n                 \"?:\\\\Program Files (x86)\\\\*\",\n                 \"?:\\\\ProgramData\\\\Microsoft\\\\*\",\n\n```\n\n-----\n\n```\n           \\\\Device\\\\HarddiskVolume \\\\Windows\\\\System32\\\\ .exe,\n           \"\\\\Device\\\\HarddiskVolume*\\\\Windows\\\\SysWOW64\\\\*.exe\") and\n    /* runs from temp folder and invoked by different elevated processes */\n    not process.pe.original_file_name == \"DismHost.exe\"\n    ) or\n  /* elevated and unsigned or untrusted programs excluding\n   third party uninstallers executed via appwiz.cpl */\n   ((process.code_signature.trusted == false or\n   process.code_signature.exists == false) and\n    not (process.parent.name : \"dllhost.exe\" and\n     process.parent.command_line :\n     \"*FCC74B77-EC3E-4DD8-A80B-008A702075A9*\"))) and\n /* Rundll32 FPs */\n not (process.name : \"rundll32.exe\" and\n    process.args :\n     (\"devmgr.dll,DeviceProperties_RunDLL\",\n     \"?:\\\\Windows\\\\system32\\\\iesetup.dll,IEShowHardeningDialog\") and\n    process.parent.name : (\"dllhost.exe\", \"ServerManager.exe\")) and\n /* uninstallers executed via appwiz.cpl */\n not (process.args : \"/uninstall\" and\n    process.parent.name : \"dllhost.exe\" and\n    process.parent.command_line : \"*FCC74B77-EC3E-4DD8-A80B-008A702075A9*\")\n    and\n /* server manager may spawn interactive powershell commands */\n not (process.name : \"powershell.exe\" and\n    process.parent.executable : \"?:\\\\Windows\\\\System32\\\\ServerManager.exe\")\n    and\n /* Windows Installer service descendants */\n not (process.parent.executable : \"?:\\\\Windows\\\\System32\\\\msiexec.exe\" and\n   process.parent.args : \"/V\")\n\n```\nThe above query also matches on all the descendants of a UAC bypass and not only the\ndirect child process.\n\nHere we can see this approach detecting the `fodhelper execution flow hijacking via`\nregistry key manipulation:\n\n\n-----\n\n[Here is an example of this matching UAC Bypass by Mocking Trusted Directories.](https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e)\n\nBelow are examples of matches for 3 different UAC bypasses via Elevated COM Interface:\n\n\n-----\n\n## Detection Evasion¶\n\nA good number of evasion techniques that are not limited to UAC bypass were discussed in\n[this blog post by hFireF0X such as renaming a folder or registry key, registry symbolic links](https://swapcontext.blogspot.com/2020/10/uacme-35-wd-and-ways-of-mitigation.html)\nto break detection logic based on specific file path/registry key changes or correlation of\ndifferent events by the same process. Although the majority of malware families don’t bother\nto modify and tune those techniques, accounting for those evasion opportunities is a must for\nmore resilience.\n\n[Below is an example of file monitoring evasion via directory rename (UACME 22).](https://github.com/hfiref0x/UACME/tree/v3.2.x)\n\n[Here is an example of registry key path monitoring evasion via key rename (byeintegrity8).](https://github.com/AzAgarampur/byeintegrity8-uac)\n\n[Another interesting evasion trick that was added recently to UACME v.3.5.7 is the](https://github.com/hfiref0x/UACME/commit/75b39e214ef6c2e37f04463f89aa0433afb2b08a#diff-b88fec8a22ebca61cc2ebfb4b0e1549b50fd179f262228e018ab2463cb4efc56R567) [CurVer](https://docs.microsoft.com/en-us/windows/win32/shell/fa-progids)\nsubkey, which can be used to redirect the shell Default handler. This effectively bypasses\ndetections looking for hardcoded suspicious registry path/values:\n\n\n-----\n\nFor file-based detection related to DLL hijacking, it is better to use DLL load events (Elastic\nEndpoint Security 7.16 logs non-Microsoft signed DLLs). For registry ones, a mix of\nregistry.data.strings, and value names should be a bit more resilient than the full key path.\n\n[The example EQL correlation below shows how to detect DLL loading from a directory](https://www.elastic.co/guide/en/elasticsearch/reference/current/eql-syntax.html)\nmasquerading as System32 (i.e as a result of windir/systemroot environment variable\nmodification) :\n\nEQL search - Detect redirection via rogue Windir/SystemRoot\n```\nsequence by process.entity_id with maxspan=1m\n [process where event.action == \"start\" and\n  /* any process running as high or system integrity */\n  process.Ext.token.integrity_level_name : (\"high\", \"system\")]\n [library where dll.path :\n  /* masquerading as windir/system root */\n  (\"?:\\\\*\\\\System32\\\\*.dll\", \"?:\\\\*\\\\SysWOW64\\\\*.dll\") and\n  not dll.path :\n      (\"?:\\\\Windows\\\\System32\\\\*.dll\",\"?:\\\\Windows\\\\Syswow64\\\\*.dll\") and\n  not (dll.code_signature.subject_name : \"Microsoft *\" and\n     dll.code_signature.trusted == true)]\n\n```\nThis example shows matches for 2 different techniques (registry key manipulation and DLL\nhijack via fake Windir):\n\n\n-----\n\n[The next example combines a registry symbolic link and registry key rename to evade](https://scorpiosoftware.net/2020/07/17/creating-registry-links/)\n```\nfodhelper UAC bypass detection based on registry key changes monitoring (ms-settings\n\n```\nor shell\\open\\command) :\n\n[UACME v.3.5 and above implements this evasion for methods involving registry key](https://github.com/hfiref0x/UACME)\nmanipulation.\n\n[You can hunt using Elastic Endpoint or Sysmon logs registry symbolic link creation by](https://blog.menasec.net/2020/09/discovering-windows-registry-symbolic.html)\nlooking for registry modification with value name equal to SymbolicLinkValue.\n\nAn example KQL query to detect this evasion is: `registry.value :\"SymbolicLinkValue\"`\n```\nand registry.key : S-1-5-21-15Classes\\\\*`:\n\n```\n\n-----\n\n## Most Common UAC Bypasses¶\n\nMalware families in use in the wild constantly shift and change. Below you can see a quick\noverview of the top commonly observed UAC bypass methods used by malware families:\n\n**Method** **Malware Family**\n\nUAC Bypass via ICMLuaUtil Elevated COM Interface [DarkSide,](https://malpedia.caad.fkie.fraunhofer.de/details/win.darkside) [LockBit,](https://malpedia.caad.fkie.fraunhofer.de/details/win.lockbit) [TrickBot](https://malpedia.caad.fkie.fraunhofer.de/details/win.trickbot)\n\nUAC Bypass via ComputerDefaults Execution Hijack [ClipBanker,](https://malpedia.caad.fkie.fraunhofer.de/details/win.clipbanker) [Quasar RAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.quasar_rat)\n\nUAC Bypass via Control Panel Execution Hijack [AveMaria,](https://www.virustotal.com/gui/file/e07327f2a5d54106bd1e7e877281080c57b320daaf69594794ce59ff69ae3761) [Trojan.Mardom](https://www.virustotal.com/gui/file/f8dca5a2d7ec9ab3916266db1187428352889126cc30a4f8527c828dea706532/detection)\n\nUAC Bypass via DiskCleanup Scheduled Task Hijack [RedLine Stealer,](https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer) [Glupteba](https://malpedia.caad.fkie.fraunhofer.de/details/win.glupteba)\n\nUAC Bypass via FodHelper Execution Hijack [Glupteba,](https://malpedia.caad.fkie.fraunhofer.de/details/win.glupteba) [BitAT dropper](https://malpedia.caad.fkie.fraunhofer.de/details/win.bit_rat)\n\nUAC Bypass Attempt via Windows Directory Masquerading [Remcos RAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.remcos)\n\nMost common executed commands via a UAC bypass are either the malware re-execute\nitself as high integrity or defense evasions techniques such as:\n\nTamper with AV exclusions or state\nWriting to HKLM protected registry keys\nTamper with system recovery settings\n\n\n-----\n\n## Conclusion¶\n\nDesigning detections by focusing on key building blocks of an offensive technique is much\nmore cost-effective than trying to cover the endless variety of implementations and potential\nevasion tunings. In this post, we covered the main methods used for UAC bypass and how to\ndetect them as well as how enriching process execution events with token security attributes\nenabled us to create a broader detection logic that may match unknown bypasses.\n\n[In addition to the broader detections highlighted in this blog post, Elastic Endpoint Security](https://www.elastic.co/endpoint-security/)\ncomes with 26 prebuilt endpoint behavior protections for UAC bypasses.\n\n## References¶\n\n[https://github.com/hfiref0x/UACME (and its sub references)](https://github.com/hfiref0x/UACME)\n[https://swapcontext.blogspot.com/2020/10/uacme-35-wd-and-ways-of-mitigation.html](https://swapcontext.blogspot.com/2020/10/uacme-35-wd-and-ways-of-mitigation.html)\n[https://tyranidslair.blogspot.no/2017/05/reading-your-way-around-uac-part-1.html](https://tyranidslair.blogspot.no/2017/05/reading-your-way-around-uac-part-1.html)\n[https://tyranidslair.blogspot.no/2017/05/reading-your-way-around-uac-part-2.html](https://tyranidslair.blogspot.no/2017/05/reading-your-way-around-uac-part-2.html)\n[https://tyranidslair.blogspot.no/2017/05/reading-your-way-around-uac-part-3.html](https://tyranidslair.blogspot.no/2017/05/reading-your-way-around-uac-part-3.html)\n[https://www.tiraniddo.dev/2017/05/exploiting-environment-variables-in.html](https://www.tiraniddo.dev/2017/05/exploiting-environment-variables-in.html)\nhttps://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories24a96675f6e\n[https://github.com/AzAgarampur/byeintegrity5-uac](https://github.com/AzAgarampur/byeintegrity5-uac)\n[https://github.com/AzAgarampur/byeintegrity8-uac](https://github.com/AzAgarampur/byeintegrity8-uac)\n[https://enigma0x3.net/2016/07/22/bypassing-uac-on-windows-10-using-disk-cleanup/](https://enigma0x3.net/2016/07/22/bypassing-uac-on-windows-10-using-disk-cleanup/)\n[https://docs.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control](https://docs.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control)\nhttps://docs.microsoft.com/en-us/windows/security/identity-protection/user-accountcontrol/how-user-account-control-works\nhttps://googleprojectzero.blogspot.com/2019/12/calling-local-windows-rpc-serversfrom.html\n\nLast update: February 23, 2022\nCreated: February 8, 2022\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-07 - Exploring Windows UAC Bypasses- Techniques and Detection Strategies.pdf"
    ],
    "report_names": [
        "2022-02-07 - Exploring Windows UAC Bypasses- Techniques and Detection Strategies.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535720,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653688125,
    "ts_modification_date": 1653688125,
    "files": {
        "pdf": "https://archive.orkl.eu/d6461e22d8711d30b0ac937231b09b00d9572f1a.pdf",
        "text": "https://archive.orkl.eu/d6461e22d8711d30b0ac937231b09b00d9572f1a.txt",
        "img": "https://archive.orkl.eu/d6461e22d8711d30b0ac937231b09b00d9572f1a.jpg"
    }
}