{
    "id": "0962d841-1242-4109-93e9-a1af85956d16",
    "created_at": "2022-12-27T17:06:18.166931Z",
    "updated_at": "2025-03-27T02:09:34.556178Z",
    "deleted_at": null,
    "sha1_hash": "e86c921a324b25a7a06044942fb686b61a3aa0a6",
    "title": "APT Cyber Tools Targeting ICS/SCADA Devices",
    "authors": "DOE, CISA, NSA, FBI",
    "file_creation_date": "2022-05-31T12:46:39Z",
    "file_modification_date": "2022-05-31T12:46:39Z",
    "file_size": 641976,
    "plain_text": "Co-Authored by:\n\nTLP:WHITE\n\nProduct ID: AA22—103A\nApril 13, 2022\n\nAPT Cyber Tools Targeting ICS/SCADA Devices\nSUMMARY\nThe Department of Energy (DOE), the Cybersecurity\nand Infrastructure Security Agency (CISA), the National\nSecurity Agency (NSA), and the Federal Bureau of\nInvestigation (FBI) are releasing this joint Cybersecurity\nAdvisory (CSA) to warn that certain advanced\npersistent threat (APT) actors have exhibited the\ncapability to gain full system access to multiple\nindustrial control system (ICS)/supervisory control and\ndata acquisition (SCADA) devices, including:\n\n\n\n\nSchneider Electric programmable logic\ncontrollers (PLCs),\nOMRON Sysmac NEX PLCs, and\nOpen Platform Communications Unified\nArchitecture (OPC UA) servers.\n\nActions to Take Today to Protect\nICS/SCADA Devices:\n● Enforce multifactor\nauthentication for all remote\naccess to ICS networks and\ndevices whenever possible.\n● Change all passwords to\nICS/SCADA devices and\nsystems on a consistent\nschedule, especially all default\npasswords, to device-unique\nstrong passwords to mitigate\npassword brute force attacks\nand to give defender monitoring\nsystems opportunities to detect\ncommon attacks.\n\nThe APT actors have developed custom-made tools for\n● Leverage a properly installed\ntargeting ICS/SCADA devices. The tools enable them\ncontinuous OT monitoring\nsolution to log and alert on\nto scan for, compromise, and control affected devices\nmalicious indicators and\nonce they have established initial access to the\nbehaviors.\noperational technology (OT) network. Additionally, the\nactors can compromise Windows-based engineering\nworkstations, which may be present in information technology (IT) or OT environments, using an\nexploit that compromises an ASRock motherboard driver with known vulnerabilities. By compromising\n\nAll organizations should report incidents and anomalous activity to CISA 24/7 Operations Center at\nreport@cisa.gov or (888) 282-0870 and/or to the FBI via your local FBI field office or the FBI’s 24/7 CyWatch at\n(855) 292-3937 or CyWatch@fbi.gov. When available, please include the following information regarding the\nincident: date, time, and location of the incident; type of activity; number of people affected; type of equipment\nused for the activity; the name of the submitting company or organization; and a designated point of contact. For\nNSA client requirements or general cybersecurity inquiries, contact the Cybersecurity Requirements Center at\n410-854-4200 or Cybersecurity_Requests@nsa.gov.\nThis document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when information\ncarries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public\nrelease. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction.\nFor more information on the Traffic Light Protocol, see http://www.us-cert.gov/tlp/.\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\n\nand maintaining full system access to ICS/SCADA devices, APT actors could elevate privileges,\nmove laterally within an OT environment, and disrupt critical devices or functions.\nDOE, CISA, NSA, and the FBI urge critical infrastructure organizations, especially Energy Sector\norganizations, to implement the detection and mitigation recommendations provided in this CSA to\ndetect potential malicious APT activity and harden their ICS/SCADA devices.\n\nTECHNICAL DETAILS\nAPT actors have developed custom-made tools that, once they have established initial access in an\nOT network, enables them to scan for, compromise, and control certain ICS/SCADA devices,\nincluding the following:\n\n\n\n\nSchneider Electric MODICON and MODICON Nano PLCs, including (but may not be limited\nto) TM251, TM241, M258, M238, LMC058, and LMC078;\nOMRON Sysmac NJ and NX PLCs, including (but may not be limited to) NEX NX1P2, NXSL3300, NX-ECC203, NJ501-1300, S8VK, and R88D-1SN10F-ECT; and\nOPC Unified Architecture (OPC UA) servers.\n\nThe APT actors’ tools have a modular architecture and enable cyber actors to conduct highly\nautomated exploits against targeted devices. The tools have a virtual console with a command\ninterface that mirrors the interface of the targeted ICS/SCADA device. Modules interact with targeted\ndevices, enabling operations by lower-skilled cyber actors to emulate higher-skilled actor capabilities.\nThe APT actors can leverage the modules to scan for targeted devices, conduct reconnaissance on\ndevice details, upload malicious configuration/code to the targeted device, back up or restore device\ncontents, and modify device parameters.\nIn addition, the APT actors can use a tool that installs and exploits a known-vulnerable ASRocksigned motherboard driver, AsrDrv103.sys, exploiting CVE-2020-15368 to execute malicious code in\nthe Windows kernel. Successful deployment of this tool can allow APT actors to move laterally within\nan IT or OT environment and disrupt critical devices or functions.\n\nAPT Tool for Schneider Electric Devices\nThe APT actors’ tool for Schneider Electric devices has modules that interact via normal management\nprotocols and Modbus (TCP 502). Modules may allow cyber actors to:\n\n\n\n\n\n\nRun a rapid scan that identifies all Schneider PLCs on the local network via User Datagram\nProtocol (UDP) multicast with a destination port of 27127 (Note: UDP 27127 is a standard\ndiscovery scan used by engineering workstations to discover PLCs and may not be indicative\nof malicious activity);\nBrute-force Schneider Electric PLC passwords using CODESYS and other available device\nprotocols via UDP port 1740 against defaults or a dictionary word list (Note: this capability may\nwork against other CODESYS-based devices depending on individual design and function,\nand this report will be updated as more information becomes available);\nConduct a denial-of-service attack to prevent network communications from reaching the PLC;\n\nPage 2 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\n\n\n\n\nSever connections, requiring users to re-authenticate to the PLC, likely to facilitate capture of\ncredentials;\nConduct a ‘packet of death’ attack to crash the PLC until a power cycle and configuration\nrecovery is conducted; and\nSend custom Modbus commands (Note: this capability may work against Modbus other than\nin Schneider Electric PLCs).\n\nRefer to the appendix for tactics, techniques, and procedures (TTPs) associated with this tool.\n\nAPT Tool for OMRON\nThe APT actors’ tool for OMRON devices has modules that can interact by:\n\n\n\n\n\n\n\nScanning for OMRON using (Factory Interface Network Service (FINS) protocol;\nParsing the Hypertext Transfer Protocol (HTTP) response from OMRON devices;\nRetrieving the media access control (MAC) address of the device;\nPolling for specific devices connected to the PLC;\nBacking up/restoring arbitrary files to/from the PLC; and\nLoading a custom malicious agent on OMRON PLCs for additional attacker-directed\ncapability.\n\nAdditionally, the OMRON modules can upload an agent that allows a cyber actor to connect and\ninitiate commands—such as file manipulation, packet captures, and code execution—via HTTP\nand/or Hypertext Transfer Protocol Secure (HTTPS).\nRefer to the appendix for TTPs associated with this tool.\n\nAPT Tool for OPC UA\nThe APT actors’ tool for OPC UA has modules with basic functionality to identify OPC UA servers and\nto connect to an OPC UA server using default or previously compromised credentials. The client can\nread the OPC UA structure from the server and potentially write tag values available via OPC UA.\nThe threat from this tool can be significantly reduced by properly configuring OPC UA security. Refer\nto the Mitigations below for more information.\nRefer to the appendix for TTPs associated with this tool.\n\nMITIGATIONS\nNote: these mitigations are provided to enable network defenders to begin efforts to protect systems\nand devices from new capabilities. They have not been verified against every environment and should\nbe tested prior to implementing.\nDOE, CISA, NSA, and the FBI recommend all organizations with ICS/SCADA devices implement the\nfollowing proactive mitigations:\n\n\nIsolate ICS/SCADA systems and networks from corporate and internet networks using strong\nperimeter controls, and limit any communications entering or leaving ICS/SCADA perimeters.\n\nPage 3 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnforce multifactor authentication for all remote access to ICS networks and devices\nwhenever possible.\nHave a cyber incident response plan, and exercise it regularly with stakeholders in IT,\ncybersecurity, and operations.\nChange all passwords to ICS/SCADA devices and systems on a consistent schedule,\nespecially all default passwords, to device-unique strong passwords to mitigate password\nbrute force attacks and to give defender monitoring systems opportunities to detect common\nattacks.\nEnsure OPC UA security is correctly configured with application authentication enabled and\nexplicit trust lists.\nEnsure the OPC UA certificate private keys and user passwords are stored securely.\nMaintain known-good offline backups for faster recovery upon a disruptive attack, and conduct\nhashing and integrity checks on firmware and controller configuration files to ensure validity of\nthose backups.\nLimit ICS/SCADA systems’ network connections to only specifically allowed management and\nengineering workstations.\nRobustly protect management systems by configuring Device Guard, Credential Guard, and\nHypervisor Code Integrity (HVCI). Install Endpoint Detection and Response (EDR) solutions\non these subnets and ensure strong anti-virus file reputation settings are configured.\nImplement robust log collection and retention from ICS/SCADA systems and management\nsubnets.\nLeverage a continuous OT monitoring solution to alert on malicious indicators and behaviors,\nwatching internal systems and communications for known hostile actions and lateral\nmovement. For enhanced network visibility to potentially identify abnormal traffic, consider\nusing CISA’s open-source Industrial Control Systems Network Protocol Parsers (ICSNPP).\nEnsure all applications are only installed when necessary for operation.\nEnforce principle of least privilege. Only use admin accounts when required for tasks, such as\ninstalling software updates.\nInvestigate symptoms of a denial of service or connection severing, which exhibit as delays in\ncommunications processing, loss of function requiring a reboot, and delayed actions to\noperator comments as signs of potential malicious activity.\nMonitor systems for loading of unusual drivers, especially for ASRock driver if no ASRock\ndriver is normally used on the system.\n\nRESOURCES\nFor additional guidance on securing OT devices, see:\n Layering Network Security Through Segmentation,\n Stop Malicious Cyber Activity Against Connected Operational Technology, and\n NSA and CISA Recommend Immediate Actions to Reduce Exposure Across Operational\nTechnologies and Control Systems.\n\nPage 4 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nTLP:WHITE\n\nDOE | CISA | NSA | FBI\n\nFor additional guidance on securing OPC UA enabled devices, see:\n https://opcfoundation.org/UA/Security/BestPractices.pdf\nFor more information on APT actors’ tools and TTPs, refer to:\n Mandiant’s Blog – INCONTROLLER: New State-Sponsored Cyber Attack Tools Target\nMultiple Industrial Control Systems\n Dragos’ Blog – CHERNOVITE’s PIPEDREAM Malware Targeting Industrial Control Systems.\n\nDISCLAIMER\nThe information in this report is being provided “as is” for informational purposes only. DOE, CISA,\nNSA, and the FBI do not endorse any commercial product or service, including any subjects of\nanalysis. Any reference to specific commercial products, processes, or services by service mark,\ntrademark, manufacturer, or otherwise, does not constitute or imply endorsement, recommendation,\nor favoring by the DOE, CISA, NSA, or the FBI, and this guidance shall not be used for advertising or\nproduct endorsement purposes.\n\nACKNOWLEDGEMENTS\nThe DOE, CISA, NSA, and the FBI would like to thank Dragos, Mandiant, Microsoft, Palo Alto\nNetworks, and Schneider Electric for their contributions to this joint CSA.\n\nPage 5 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\n\nAPPENDIX: APT CYBER TOOLS TACTICS, TECHNIQUES, AND\nPROCEDURES\nSee tables 1 through 3 for TTPs associated with the cyber actors’ tools described in this CSA mapped\nto the MITRE ATT&CK for ICS framework. See the ATT&CK for ICS framework for all referenced\nthreat actor tactics and techniques.\nTable 1: APT Tool for Schneider Electric ICS TTPs\nTactic\n\nTechnique\n\nExecution\n\nCommand-Line Interface [T0807]\nScripting [T0853]\n\nPersistence\n\nModify Program [T0889]\nSystem Firmware [T0857]\nValid Accounts [T0859]\n\nDiscovery\n\nRemote System Discovery [T0846]\nRemote System Information Discovery [T0888]\n\nLateral Movement\n\nDefault Credentials [T0812]\nProgram Download [T0843]\nValid Accounts [T0859]\n\nCollection\n\nMonitor Process State [T0801]\nProgram Upload [T0845]\nMonitor Process State [T0801]\n\nCommand and Control Commonly Used Port [T0885]\nStandard Application Layer Protocol [T0869]\nInhibit Response\nFunction\n\nBlock Reporting Message [T0804]\nBlock Command Message [T0803]\nDenial of Service [T0814]\nData Destruction [T0809]\nDevice Restart/Shutdown [T0816]\nSystem Firmware [T0857]\n\nImpair Process Control Modify Parameter [T0836]\n\nPage 6 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\nTactic\n\nTechnique\nUnauthorized Command Message [T0855]\n\nImpact\n\nDenial of Control [T0813]\nDenial of View [T0815]\nLoss of Availability [T0826]\nLoss of Control [T0827]\nLoss of Productivity and Revenue [T0828]\nManipulation of Control [T0831]\nTheft of Operational Information [T0882]\n\nTable 2: APT Tool for OMRON ICS TTPs\nTactic\n\nTechnique\n\nInitial Access\n\nRemote Services [T0886]\n\nExecution\n\nCommand-Line Interface [T0807]\nScripting [T0853]\nChange Operating Mode [T0858]\nModify Controller Tasking [T0821]\nNative API [T0834]\n\nPersistence\n\nModify Program [T0889]\nValid Accounts [T0859]\n\nEvasion\n\nChange Operating Mode [T0858]\n\nDiscovery\n\nNetwork Sniffing [T0842]\nRemote System Discovery [T0846]\nRemote System Information Discovery [T0888]\n\nLateral Movement\n\nDefault Credentials [T0812]\nLateral Tool Transfer [T0867]\nProgram Download [T0843]\nRemote Services [T0886]\n\nPage 7 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\nTactic\n\nTechnique\nValid Accounts [T0859]\n\nCollection\n\nDetect Operating Mode [T0868]\nMonitor Process State [T0801]\nProgram Upload [T0845]\n\nCommand and Control Commonly Used Port [T0885]\nStandard Application Layer Protocol [T0869]\nInhibit Response\nFunction\n\nService Stop [T0881]\n\nImpair Process Control Modify Parameter [T0836]\nUnauthorized Command Message [T0855]\nImpact\n\nDamage to Property [T0879]\nLoss of Safety [T0837]\nManipulation of Control [T0831]\nTheft of Operational Information [T0882]\n\nTable 3: APT Tool for OPC UA ICS TTPs\nTactic\n\nTechnique\n\nExecution\n\nCommand-Line Interface [T0807]\nScripting [T0853]\n\nPersistence\n\nValid Accounts [T0859]\n\nDiscovery\n\nRemote System Discovery [T0846]\nRemote System Information Discovery [T0888]\n\nLateral Movement\n\nValid Accounts [T0859]\n\nCollection\n\nMonitor Process State [T0801]\nPoint & Tag Identification [T0861]\n\nCommand and Control Commonly Used Port [T0885]\nStandard Application Layer Protocol [T0869]\nImpact\n\nManipulation of View [T0832]\n\nPage 8 of 9 | Product ID: AA22-103A\n\nTLP: WHITE\n\nDOE | CISA | NSA | FBI\n\nTLP:WHITE\nTactic\n\nTechnique\nTheft of Operational Information [T0882]\n\nPage 9 of 9 | Product ID: AA22-103A\n\nTLP: WHITE",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/uscert/sites/default/files/publications/AA22-103A_APT_Cyber_Tools_Targeting_ICS_SCADA_Devices.pdf"
    ],
    "report_names": [
        "CSA_APT_Cyber_Tools_Targeting_ICS_SCADA_Devices_OPCUA_20220525.PDF"
    ],
    "threat_actors": [
        {
            "id": "091dc6fb-2650-4646-894a-41de0d463f94",
            "created_at": "2023-11-17T02:00:07.594612Z",
            "updated_at": "2025-03-27T02:00:03.230461Z",
            "deleted_at": null,
            "main_name": "Chernovite",
            "aliases": [],
            "source_name": "MISPGALAXY:Chernovite",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1672160778,
    "ts_updated_at": 1743041374,
    "ts_creation_date": 1654001199,
    "ts_modification_date": 1654001199,
    "files": {
        "pdf": "https://archive.orkl.eu/e86c921a324b25a7a06044942fb686b61a3aa0a6.pdf",
        "text": "https://archive.orkl.eu/e86c921a324b25a7a06044942fb686b61a3aa0a6.txt",
        "img": "https://archive.orkl.eu/e86c921a324b25a7a06044942fb686b61a3aa0a6.jpg"
    }
}