{
    "id": "096a8a56-827d-4a5f-ba2d-cc84ea0add37",
    "created_at": "2023-01-12T15:09:34.070327Z",
    "updated_at": "2025-03-27T02:09:29.89032Z",
    "deleted_at": null,
    "sha1_hash": "d214943a86accf94b79db87c1880f9844cf6b643",
    "title": "2016-10-17 - A Tale of Two Targets",
    "authors": "",
    "file_creation_date": "2014-07-11T10:07:06Z",
    "file_modification_date": "2014-07-11T10:07:06Z",
    "file_size": 1083368,
    "plain_text": "Office of Cyber and Infrastructure Analysis (OCIA)\n**National Protection and Programs Directorate**\n\nInfrastructure Sector Assessment\n\n\n# Sector Resilience Report: Electric Power Delivery\n\n**June 11, 2014, 1015 EDT**\n\n## SCOPE\n\nThe Department of Homeland Security Office of Cyber and Infrastructure Analysis\n(DHS/OCIA)[1] Homeland Infrastructure Threat and Risk Analysis Center (HITRAC) produces\nSector Resilience Reports to improve partner understanding of the interdependencies and\nresilience of certain sectors. Specifically, this report provides a brief overview of the electric\npower system, and analysis of key electric power system dependencies and interdependencies.\nAdditionally, this product includes an assessment of, and best practices for, improving\ncommunity, system, and facility resilience. This Sector Resilience Report was produced to\ncomplement other sector-specific guidance, analysis, and scholarly papers on infrastructure\nresilience by applying data obtained from DHS site visits and assessments analyzing the\nresilience of critical infrastructure assets and systems.\n\nThe resilience issues and best practices identified in this document may be considered by critical\ninfrastructure partners in each sector to improve their resilience at three levels: electric power\nprovider systems and facilities, community risk management organizations (e.g. State or local\nemergency operations centers or fusion centers), and any critical infrastructure asset or system\nthat depends on electric power. This product was coordinated with the DHS Office of\nInfrastructure Protection, the Department of Energy (DOE), and the Federal Energy Regulatory\nCommission (FERC).\n\n## KEY FINDINGS\n\n###  Of the 3,352 sites across all 16 sectors that received DHS assessments (2009–2012),\n\n**90 percent depend on electric power for core operations.**\n\n###  Critical dependencies and interdependencies of the Energy Sector mean that the loss\n\n**of electric power can quickly cascade to other lifeline infrastructure systems**\n**(including Water, Wastewater, Communications, Transportation, and Information**\n**Technology (IT)), potentially degrading services necessary for public health and**\n**safety.**\n\n1 In February 2014, NPPD created the Office of Cyber and Infrastructure Analysis by integrating analytic resources from across NPPD including\n\nthe Homeland Infrastructure Threat and Risk Analysis Center (HITRAC) and the National Infrastructure Simulation and Analysis Center\n(NISAC).\n\n\nOffice of Cyber and Infrastructure Analysis (OCIA)\n**National Protection and Programs Directorate**\n\nInfrastructure Sector Assessment\n\n\n-----\n\n###  Of the 41 electric power substations assessed by DHS, 59 percent depend upon an\n\n**external source of electric power for on-site operations, 62 percent depend on**\n**communications, and 77 percent depend on IT to maintain operations.**\n\n###  Interruption to IT supporting infrastructures, including the loss of electric power,\n\n**could limit the operating flexibility and efficiency of electric substations and system**\n**monitoring equipment. A large-scale IT disruption could potentially impact power**\n**delivery to other critical infrastructure assets in the electric service area.**\n\n## ELECTRIC POWER DELIVERY SYSTEMS OVERVIEW\n\nThe U.S. electric power delivery system is a highly complex network of substations and electric\nlines that transport electricity from generators to residential, commercial, and industrial\nconsumers. For this reportthe electric power delivery system includes all components between\nthe point where power is injected into the grid and the point where the power enters the\ncustomer’s premises. Figure 1 provides an overview of a representative electric power delivery\nsystem, and identifies nodes along the electric system that are suseptible to certain key hazards.\n\nThe contiguous 48 States, most of Canada, and parts of Mexico are served by a bulk power\nsystem comprising more than 200,000 miles of high-voltage transmission lines (230 kilovolts\n(kV) or greater), tens of thousands of miles of distribution lines operated at lower voltages, and\nan estimated 100,000 substations from which power is ultimately directed to customers.[2,3,4,5 ]To\nfacilitate efficient transfer over long distances, electricity produced at a power plant is first\ndirected to step-up transformers located in transmission substations, where the voltage is\nincreased and then introduced into the transmission grid.\n\nWhen the power arrives near a distribution territory, step-down transformers located in\ndistribution substations reduce the voltage and transfer the power to the distribution grid along\nsmaller distribution lines that are buried or carried on poles. Transformers located closer to\nindividual customers, often on poles, further reduce the voltage to meet each customer’s demand.\nSubstations at both the transmission and distribution levels are strategically interconnected,\ngiving operators multiple pathways by which to deliver power to meet individual loads and\ngreatly enhancing the overall resilience of the electrical transmission and distribution networks.\n\n2 DHS and U.S. Department of Energy (DOE), Energy Sector-Specific Plan, 2010, accessed May 9, 2013, www.dhs.gov/xlibrary/assets/nipp\nssp-energy-2010.pdf.\n3 Edison Electric Institute. “Electricity Transmission,” 2013, accessed January 29, 2013,\n\nwww.eei.org/ourissues/ElectricityTransmission/Pages/default.aspx.\n4 Argonne National Laboratory, Assessment of the Potential Costs and Energy Impacts of Spill Prevention, Control, and Countermeasure\n\n_Requirements for Electric Utility Substations, 2006, accessed January 29, 2013,_\nwww.fossil.energy.gov/programs/oilgas/publications/environment_otherpubs/SPCC_Impact_Substations_May_2006.pdf.\n5 DHS/OCIA (formerly HITRAC), Infrastructure System Overview: The Bulk Power System, September 23, 2013.\n\n\n-----\n\nFIGURE 1.—Electric Grid Overview and Vulnerabilities to Potential Hazards\n\n(Courtesy of DHS and Argonne National Laboratory).\n\n\n-----\n\n## RESILIENCE\n\nThe common themes shared in this report are drawn from data obtained from DHS site visits,\nincluding the Enhanced Critical Infrastructure Protection (ECIP) Initiative, analysis produced by\nthe Regional Resiliency Assessment Program (RRAP), and information gleaned from industry\nreports and academic research.[6,7] This paper summarizes results from numerous infrastructure\nassessments that examine vulnerabilities, threats, and\npotential consequences from an all-hazards perspective, **_PPD—8, National Preparedness, defines_**\nleading to the identification of dependencies, resilience as “the ability to adapt to\ninterdependencies, cascading effects, and resilience changing conditions and withstand and\ncharacteristics.[8 ] rapidly recover from disruption due to\n\nemergencies.”\n\nSince 1996, the critical infrastructure community has\n\n**_PPD—21, Critical Infrastructure_**\n\nevolved from a primary focus on protective security to a\n\n**_Security and Resilience, directed the_**\n\ngreater emphasis on resilience to disruptive events.[9] Federal Government to work with critical\nNational policies, such as Policy Presidential Directives infrastructure owners and operators and\n(PPDs) 8 and 21, highlight that collaborative State, local, tribal, and territorial partners\nengagement and information sharing with Federal to strengthen the security and resilience of\nagencies, private sector facility owners and operators, its critical infrastructure.\nlaw enforcement, emergency response organizations,\nacademic institutions, and other stakeholders are vital to\nbuilding a more resilient Nation.\n\n### THREATS AND HAZARDS \n\n\nThe electric power delivery system faces a broad range of potential threats and hazards, ranging\nfrom cyberattacks to a variety of natural hazards, including various weather-related phenomena\n(as shown in Figure 1). Electricity infrastructure is highly automated and controlled by utilities\nand regional grid operators that rely on sophisticated industrial control systems. These control\nsystems may be vulnerable to cyberattacks that could potentially disrupt electric power\nproduction or transmission. Accidents or physical attacks on electric power infrastructure, such\nas targeted shooting of transformers or intentional downing of power lines, also pose a threat for\nthe Sector’s continued reliable operations.[10] Natural events such as hurricanes, earthquakes,\nwinter storms, wildfires, and solar flares also present a significant hazard to the electric power\nsystem, as these events occur regularly and have the capacity to cause extensive and widespread\n\n6 The RRAP evaluates critical infrastructure on a regional level to examine vulnerabilities, threats, and potential consequences from an all\nhazards perspective, identifying dependencies, interdependencies, cascading effects, resilience characteristics, and gaps. RRAP projects are\nvoluntary and non-regulatory, and rely on engagement and information sharing with Federal agencies, private sector facility owners and\noperators, law enforcement, emergency response organizations, academic institutions, and other stakeholders. For more information, please\nemail resilience@dhs.gov or visit www.dhs.gov/regional-resiliency-assessment-program.\n7 The ECIP Initiative is a voluntary program where DHS Protective Security Advisors conduct outreach with critical infrastructure facility\n\nowners and operators and provide security surveys, training and education, and recommended protective measures. ECIP metrics provide DHS\nwith information on the protective and resilience measures in place at facilities and enable detailed analyses of site and sector vulnerabilities.\nFor more information, please contact PSCDOperations@hq.dhs.gov.\n8 DHS, Regional Resilience Assessment Program Fact Sheet, December 2013.\n9 The Federal Government began to examine potential threats to critical infrastructure in the 1990s as a result of incidents of domestic and\n\ninternational terrorism. President Bill Clinton issued Executive Order 13010 in 1996, which identified the Nation’s critical infrastructure\nsectors and established a Presidential Commission on Critical Infrastructure Protection (PCCIP) whose objective was to recommend a\ncomprehensive national infrastructure protection policy and implementation strategy.\n10 DHS, OCIA, and Office of Intelligence and Analysis (I&A), Infrastructure Protection Note: Most Significant Activity Surrounding Tactics,\n\n_Techniques, and Procedures Against the Electricity Subsector, March 26, 2014._\n\n\n-----\n\ndamage. Such threats and hazards can cause extensive damage to electric power systems, but due\nto system resiliency the effects may not result in significant power outages.\n\nIn 2012, the U.S. transmission grid experienced 2,068 sustained automatic outages, which lasted\nfor a total of 71,822 hours.[11] The U.S. Energy Information Administration’s (EIA’s) 2014\n_Electric Power Annual reports that sustained outages on the transmission-level grid were_\nprimarily caused by equipment failure, weather, and human error (Figure 2).[12]\n\n\nFailed AC Substation Equipment\n\nHuman Error\n\nFailed AC Circuit Equipment\n\nWeather, Excluding Lightning\n\nUnknown\n\nFailed Protection System Equipment\n\nLightning\n\nOther\n\nFire\n\nPower System Condition\n\nForeign Interference\n\nContamination\n\nVegetation\n\nFailed AC/DC Terminal Equipment\n\nEnvironmental\n\nFailed DC Circuit Equipment\n\n\n0% 2% 4% 6% 8% 10% 12% 14% 16%\n\n13.78%\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|\n|---|---|---|---|---|---|---|---|---|\n||1. 0.39 0.19|3 2.51 1.89% 16% % %|4.7 3.72% .43% %|7. 7. 4%|01% 01%|10.15 9.77% 9.62%|12. 11.75 %|13.78 72% %|\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n||||||||||\n\n\nOther includes automatic outages for which the cause is known, but is not included in the above list.\n\n\nForeign Interference includes objects such as aircraft, machinery, vehicles, kites, events where\nanimal movement or nesting impacts electrical operations, flying debris not caused by wind, and\nfalling conductors from one line into another.\n\nFIGURE 2.—U.S. Transmission Circuit Sustained Automatic Outage Counts for 2012.[12 ]\n\n\n11 An automatic outage results from the automatic operation of a switching device, causing an element to change from an “in-service” state to a\n\n“not-in-service” state. A sustained outage is an automatic outage lasting 1 minute or more. DOE, U.S. Energy Information Administration\n(EIA), Electric Power Annual, Table 8.13. A, January 2014, accessed Jan. 31, 2014, www.eia.gov/electricity/annual/.\n12 Ibid.\n\n\n-----\n\n## DEPENDENCIES, INTERDEPENDENCIES, AND POTENTIAL IMPACTS\n\nThe resilience of a community or region is a function of the resilience of its subsystems,\nincluding its critical infrastructure, economy, civil society, and governance (including emergency\nservices). Resilience can be highly complex due to the dependencies and interdependencies that\nexist within infrastructure systems, the regions they serve, and the potential for cascading\nconsequences. The loss of electric power within a community can happen at any time as the\nresult of faulty equipment, severe weather, flooding, cyberattack, vegetation control, accident, or\nsabotage. The loss of electric power is not just an inconvenience for the utility customers. Its\nimpacts can quickly cascade to other lifeline systems, including the Water and Wastewater\nSystem Sector, Communications, Transportation, and IT, resulting in the loss of services\nnecessary to the community’s economy, public health, and safety. Backup power supplies can\nmitigate these cascading effects in some cases. Understanding these dependencies and\ninterdependies are important keys to building and maintaining resilent electric power delivery\nsystems.\n\nElectric power substations are an important component of the electric power delivery system,\nand provide a useful study of the system’s dependencies and interdependencies. The following\nsections will discuss the dependencies of substations on three critical infrastructure services—\nelectric power, communications, and IT—and the dependencies of other critical infrastructure on\nthe electric delivery system. DHS assessment data from the RRAP and the Enhanced Critical\nInfrastructure Protection (ECIP) program, in which DHS partners with State and local agencies\nand the private sector to conduct voluntary assessments of a large number of critical\ninfrastructure facilities, was analyzed to determine potential dependencies and resilience of the\nelectric power delivery system.[13]\n\n### ELECTRIC POWER SUBSTATIONS \n\nSince January 2011, DHS has conducted 41 assessments of distribution and transmission\nsubstations to collect data on substation dependencies and resilience.[14] Of the 41 substations\nassessed, 59 percent depend upon an external source of electric power for on-site operations,\n62 percent depend on communications, and 77 percent depend on IT to maintain operations.\nElectric power, required to operate substation automated switches and supervisory control and\ndata acquisition (SCADA) equipment, is often provided from a station service line, rather than\nfrom the power passing through the station. Any interruption to these control systems, including\nthe loss of electric power, can mean the loss of substation functionality and the potential\nsubsequent loss of power to other critical infrastructure assets (e.g., to communication and IT\nfacilities; a critical infrastructure interdependency).\n\n13 Site assessments under the ECIP and RRAP are voluntary; they may not be representative of the entire sector. The information and data from\n\nthe RRAP and the Infrastructure Survey Tool (IST, on which the ECIP security survey resides) are often protected as For Official Use Only or\nas Protected Critical Infrastructure Information; the information provided below has been sanitized to remove any facility, system, or regional\nreferences.\n14 There are 10,287 transmission substations and 2,179 distribution substations in the United States, according to the DOE, The Electric Delivery\n\n_System, accessed May 10, 2013, www.ewp.rpi.edu/hartford/~stephc/EP/Research/Waste% 20Cycle/factsheet.pdf._\n\n\n-----\n\nThere are many factors that determine the criticality of\na particular substation. How a substation is connected\nto the facilities that it serves or to the surrounding\ntransmission system affects its role and contribution to\nthe overall resilience of the interconnected grid. For\nexample, a substation that acts as a single source of\nelectric power to a critical facility is more important to\noperations than a substation that is connected in a\nlooped fashion with other substations and the critical\nfacility. Similarly, a transmission substation that is\nconnected with other surrounding substations and\ntransmission lines may be less critical if disrupted.\n\nFifty-four percent of all the substations assessed by\nDHS that depend on external electric power have\nbackup electric generation. Further, substations that\nhave no backup generation capability, 15 percent of the\n41, would be expected to experience 67 to 99 percent\ndegradation in operations. Of those substations that\ndepend on communications to operate, 89 percent have\nalternate or redundant capability and could maintain at\nleast 67 percent of their full operations. However, of\nthose substations that depend on external IT services,\nonly 13 percent could maintain at least 67 percent of\nfull operations if IT services were lost.\n\n\n**Data Collection and Levels of**\n\n**Facility Degradation**\n\nThe ECIP Initiative collects data\nthrough the Infrastructure Survey Tool\n(IST), a secure web-based tool that\nprovides the ability to collect, process,\nand analyze survey data in near real\ntime. Data collected during site visits\nare consolidated in the IST and then\nvalued and weighted, which enables\nDHS to develop metrics; conduct\nsector-by-sector and cross-sector\nvulnerability comparisons; identify\nsecurity gaps and trends across critical\ninfrastructure sectors and sub-sectors;\nand establish sector baseline security\nsurvey scores.\n\nThe term “dependency,” as used in the\nIST and reported here, is defined as the\nreliance of a facility on an\noutside/external utility or service to\ncarry out its “core operations.”\n\n\nDegradation addresses how soon a\n\nonly 13 percent could maintain at least 67 percent of facility will be impacted and to what\nfull operations if IT services were lost. extent if the source is lost. Data on\n\ndegradation are gathered in the IST as\n\nRecovery may require considerable time and effort to a mutually exclusive set of answers:\nrestore a substation’s significant assets to full operation 0 percent degradation, 1 to33 percent\n\ndegradation, 34 to66 percent\n\ndepending on what equipment is damaged. Substations\n\ndegradation, 67 to99 percent\n\ninclude transformers, circuit breakers, disconnect\n\ndegradation, or 100 percent\n\nswitches, bus-bars, shunt reactors, shunt capacitors, degradation.\ncurrent and potential transformers, and control and\nprotection equipment. Among the more difficult to Data are also collected on the\nreplace and repair components include high-voltage existence of backup generation,\n\nduration of backup generation without\n\ntransformers and circuit breakers. There are also\n\nrefueling, and recovery time after\n\nswitches and circuit breakers located elsewhere external infrastructure service is\nthroughout the delivery system, not necessarily at restored.\nsubstations, that are essential for isolating (deenergizing) segments of the network for inspections\nand repairs. Depending on the variables such as extent of damage and availability of equipment\nand personnel, full restoration of a substation can take from 9 days to more than 1 year.[15]\n\n\n15 Argonne National Laboratory, Restore©, Modeling Interdependent Repair/Restoration Processes, accessed February 26, 2014,\n\nwww.dis.anl.gov/projects/restore.html.\n\n\n-----\n\n### IMPACTS TO CRITICAL INFRASTRUCTURE FROM LOSS OF ELECTRIC POWER \n\nImpacts from the loss of electric power vary greatly depending on the severity and location of the\nloss within the system. Isolated incidents at a single distribution substation, or along individual\ndistribution lines, can create localized outages that may last several hours. An incident at a\ntransmission or subtransmission substation, or along a high-voltage transmission line, can create\nmore widespread and significant impacts if appropriate protective measures outlined in\ncontingency plans and operating guides are not achievable by system operators. The loss of\nmultiple substations and lines, which can occur during a large-scale weather event like a\nhurricane, may result in the loss of electricity to millions of customers. As a result of the\ndiversity of impacts from disrupted substations or transmission lines, restoration of the power\ntransmission and distribution system can take days to weeks, depending on the ability to bypass\ndamaged substations or disrupted lines using the built-in resilience of the interconnected grid.\nHistorically, the loss of electric power delivery systems has resulted in some degree of crosssector impacts, particularly to other lifeline systems.\n\nFigure 3 provides a notional depiction of the physical interconnection of lifeline systems to a\ndistribution substation and the impacts of the loss of electric power. Of the total sites that DHS\nassessed through RRAP and ECIP surveys, 90 percent depend on electric power for operations.[16]\nTo illustrate the possible cross-sector impacts, data gathered from selected critical lifeline\nsystems, including Water, Wastewater, Transportation, Communications, and IT facilities, were\nused to provide information about the ability of critical infrastructure facilities to operate during\nan electric power outage. The dependency data for each asset in Figure 3 were based on the\nmedian resilient facility within each lifeline system.[17]\n\nAs the results in Figure 3 indicate, the significant cross-sector impacts that occur from the loss of\nelectric power, including the loss of SCADA functions for other lifeline sectors, underscore the\nimportance of enhancing the resilience of the electric power delivery system. In addition, an indepth knowledge of the resilience capabilities of lifeline system assets is crucial to effectively\nprioritizing response and recovery activities prior to, during, and after an event.\n\nThe example in Figure 3 depicts that water treatment plants dependence on electricity to supply\nraw water, whether by pumping from groundwater or surface water; for treatment processes\n(e.g., rapid mixing); or for pumping treated water to the distribution system. For water systems\nwith elevated distribution service areas, loss of electricity to pumps can result in isolation of\nportions of the system. Similarly, wastewater treatment plants depend on electricity for the\ncollection of wastewater (e.g., lift stations) and for treatment processes.[18]\n\n16 Between August 2009 and December 2012, 3,352 sites in all 16 DHS Sectors received DHS visits.\n17 The median resilient facility is based on the value of the overall Infrastructure Survey Tool Resilience Measurement Index, or RMI. The mean\n\nvalue of a variable, also commonly referred to as the average, is calculated by summing the observed values and then dividing by the total\nnumber of observations. The max is the highest RMI for any of the 41 substations in the comparison group and the min is the lowest. Argonne\nNational Laboratory, Resilience: Theory and Applications, January 2012, www.dis.anl.gov/pubs/72218.pdf.\n18 Electric Power Research Institute (EPRI), Water & Sustainability (Volume 4): U.S. Electricity Consumption for Water Supply & Treatment—\n\n_The Next Half Century,March 2002, accessed February 27, 2014,_\nwww.epri.com/abstracts/Pages/ProductAbstract.aspx?ProductId=000000000001006787.\n\n\n-----\n\nFIGURE 3.—Notional Impacts to Critical Infrastructure from the Loss of Electric Power Brought On by the\n\nLoss of a Distribution Substation (Courtesy of DHS and Argonne National Laboratory).\n\n\n-----\n\nThe data that was collected and illustrated in Figure 3 shows up to 33 percent of water treatment\nplant operations could be immediately degraded due to loss of external electric power. DHS\ninfrastructure site assessments indicated that 91 percent of water treatment plants and 82 percent\nof wastewater treatment plants have backup generators. Failure of both external electric power\nand backup power systems can result in severe consequences for water treatment systems. For\nexample, in 2011, power outages during Hurricane Irene on the East Coast in August and the\nOctober snowstorm in the New England area resulted in a combined total of 50 sewage spills that\ndischarged millions of gallons of untreated or partially treated sewage into Connecticut’s\nwaterways when backup power systems failed at a number of facilities.[19]\n\nDue to the dependencies and interdependencies of critical infrastructure sectors, cascading\nfailures are a potential consequence of any incident. An example of a cascading failure is when\nwastewater treatment systems fail due to a power outage and discharge untreated or partially\ntreated sewage to waterways that supply raw water to downstream drinking water treatment\nplants. If a downstream water treatment plant does not have a disinfection process capable of\ntreating contaminated raw water, drinking water supplies will also be impacted—even if that\nplant has electric power.\n\nCommunication switching facility operations can be severely degraded due to a loss of external\nelectric power, as depicted in Figure 3. Although 71 percent of communication facilities that\nDHS assessed have backup generators to maintain switching functions, a prolonged electric\noutage requires the delivery of fuel. In addition, although many cell towers may have battery\nbackup, such systems will last from a few hours to a day. IT facilities may have uninterruptible\npower supplies (UPSs), but these too are of limited duration. DHS data indicates that 88 percent\nof IT data management facilities surveyed use UPSs to maintain operations.\n\nDHS infrastructure assessments of road transportation, specifically tunnels, as shown in Figure 3,\nindicate that up to 33 percent of assets would experience immediate functional degradation from\na loss of external electric power. Roadway tunnels are dependent on electric power for core\noperations (e.g., lighting, traffic control equipment, and ventilation). While most assets have\nsome type of backup generator, complete power loss could impact traffic levels to keep carbon\nmonoxide at a safe-level. Traffic flow would also cease in tunnels if water began to enter the\ntunnels due to water pump power loss.\n\n19 The Hartford Courant, Severe Storms Led to Sewage Spills Across State, December 31, 2011, accessed February 27, 2014,\n\nhttp://articles.courant.com/2011-12-31/health/hc-storm-seweragespills-0101-20111231_1_gallons-of-raw-sewage-spills-backup-power.\n\n\n-----\n\n## RESILIENCE ISSUES AND BEST PRACTICES\n\nTable 1 presents commonly observed resilience issues and best practices summarized for three\ncategories of users: electric power provider systems and facilities, community risk management\norganizations (i.e., State or local emergency operation centers or fusion centers), and any critical\ninfrastructure asset or system that depends on electric power (i.e., electric power customers). The\nissues and best practices listed in Table 1 were identified in RRAPs and from among the results\nof the ECIP assessments, as well as general literature reviews.[20] The information is meant for\ngeneral application across the electric power delivery system, impacted sectors, and customers.\nThe resilience issues and best practices identified may apply to other regions, other facilities, or\nother types of facilities. See the Appendix for supporting resources and references.\n\nTABLE 1.—Resilience Issues and Best Practices.\n\n\n**FOR ELECTRIC POWER PROVIDER SYSTEMS AND FACILITIES**\n\n\n**Electric utilities may have issues with equipment failures that impact rapid response and recovery**\n\n- Continue with Smart Grid programs and develop capital improvement plans that incorporate Smart Grid\n\ntechnology over time as aging equipment is replaced or retrofitted.\n\n\n**The electric distribution grid may lack adequate design redundancies**\n\n\n\n- Use flow modeling to identify areas that can be impacted by single points of failure. In coordination with\n\nthe State Homeland Security agency, identify lifeline system assets within the potentially impacted\nservice territory and work with those assets to identify measures that can be taken to mitigate outages.\n\n- Review restoration plans and resources to determine the availability of specialized equipment, crews,\n\nand materials.\n\n- Consult with State officials to determine whether the State can support transmission network upgrade\n\nprojects through emergency or reliability programs.\n\n\n**High-consequence substations may not have the latest technology**\n\n\n\n- Conduct a cost-benefit analysis that examines the application of automated intelligent switching to the\n\ntransmission lines supporting high-consequence substations.\n\n- Work with State and local emergency managers and energy assurance planners to apply such\n\ntechnology where the benefits outweigh the costs.\n\n\n**Electric equipment lacks protection from natural hazards, accidents, or sabotage**\n\n\n\n- Determine whether equipment is at risk to natural hazards, accidents, or sabotage.\n\n- Harden at-risk equipment against natural disasters, such as flooding. Move at-risk equipment to higher\n\nground or build flood containment structures. Develop flood mitigation plans for at-risk substations.\n\n- Install protective measures, such as fencing and bollards, around equipment that is at risk of sabotage or\n\naccident and, if necessary, install fire/blast walls to protect adjacent equipment.\n\n20 Resilience information gathered via the RRAP and ECIP assessments are often protected as For Official Use Only or as Protected Critical\n\nInfrastructure Information; the information in Table 1 has been sanitized to remove any facility, system, or regional references.\n\n\n-----\n\n**FOR COMMUNITY RISK MANAGEMENT ENTITIES**\n\n\n**State and local emergency management agencies lack information on equipment and resource**\n**reserves in other agencies or neighboring States or communities**\n\n\n\n- Work with the local utility to understand private sector capabilities and resources.\n\n- Develop memoranda of understanding or agreements with utilities for resource sharing and identify other\n\nareas where the Government and private sector can share resources.\n\n\n**State and local emergency management agencies lack information on prioritizing fuel deliveries to**\n**critical governmental emergency response agencies and to privately owned, critical infrastructure**\n**facilities that are dependent on emergency generators or need fuel for repair vehicles**\n\n\n\n- Governmental agencies should ensure that emergency operations centers have identified critical\n\nequipment and determined the emergency generation capabilities, including fuel needs.\n\n- State and local energy assurance plans should include provisions for the distribution of petroleum fuels to\n\npriority government and privately owned critical infrastructure and lifeline sector customers following a\ndisaster.\n\n- In the event of severe fuel shortages during which suppliers need to ration the fuel supply for an\n\nextended period (1 month or longer), implement a statewide set-aside program or priority end-user\nprogram.\n\n- Review governmental contracts to assess the potential impact of Excuse by Failure of Presupposed\n\nConditions provisions under Uniform Commercial Code Section 2-615, as adopted in each State.\n\n\n**Citizens need to be better informed on the necessary steps to take to help ensure personal**\n**resilience and preparedness for prolonged electric power outages**\n\n\n\n- Conduct outreach to inform citizens of steps they can take to prepare for a blackout; such outreach will\n\nalso aid local utilities by reducing calls for information and damage/distress calls.\n\n\n**Emergency response agencies may not always communicate effectively with the population**\n\n\n\n- Use social media to communicate in disaster preparation, response, and recovery.\n\n\n**Electric utilities are not part of the State and local emergency response planning process**\n\n\n\n- To improve communication among electric distribution providers, customers, and State and local\n\nemergency response organizations, ensure that utility reporting content and point-of-contact information\nare built into State and local emergency response plans.\n\n\n**State and local energy assurance plans may not be incorporated into emergency planning, are not**\n**updated, and are not exercised regularly**\n\n\n\n- Incorporate energy emergencies into State and local exercises.\n\nLink energy assurance plans with Emergency Support Function-12 activities to better engage with\nindustry.[21]\n\n21 Emergency Support Function (ESF) #12 – Energy is intended to facilitate the restoration of damaged energy systems and components when\n\nactivated by the Secretary of Homeland Security for incidents requiring a coordinated Federal response. Under Department of Energy (DOE)\nleadership, ESF #12 is an integral part of the larger DOE responsibility of maintaining continuous and reliable energy supplies for the United\nStates through preventive measures and restoration and recovery actions. [http://www.fema.gov/media-library-data/20130726-1825-25045-](http://www.fema.gov/media-library-data/20130726-1825-25045-9530/emergency_support_function_12_energy_annex_2008.pdf)\n[9530/emergency_support_function_12_energy_annex_2008.pdf, accessed July 9, 2014.](http://www.fema.gov/media-library-data/20130726-1825-25045-9530/emergency_support_function_12_energy_annex_2008.pdf)\n\n\n-----\n\n- Ensure participation by States in regional exercises conducted by DOE and the National Association of\n\nState Energy Officials (NASEO).\n\n- Review and revise the State and local energy assurance plans at least annually and after each energy\n\nemergency to ensure that the plans contain the latest information and best implementation procedures.\n\n\n**Functions, vulnerabilities, and impacts of the loss of electric power on other critical infrastructures**\n**(e.g., water, wastewater, natural gas, petroleum, and communications) are not well understood by**\n**emergency planners and responders**\n\n\n\n- Develop an Interdependency Operational Plan (IOP) and Decision Support Tool (DST) to use in\n\nconjunction with current Emergency Operations Center capabilities. Work with critical infrastructure\nowners and operators to obtain necessary information on critical infrastructure assets. Elements to\nconsider in developing the IOP and DST include (1) protected, methodological data collection; (2)\ndetailed analysis of asset dependencies and interdependencies; (3) alternative means of providing the\nservice; and (4) distinct recovery time objectives (RTOs).\n\n\n### FOR ELECTRIC POWER CUSTOMERS\n\n\n**Electrical equipment and backup generators lack protection from natural hazards, accidents, or**\n**sabotage**\n\n\n\n- Identify equipment that is at risk of flooding, surge, accident, or sabotage.\n\n- Consider hardening facility-owned electrical equipment and emergency generators against unauthorized\n\naccess.\n\n- Develop storm surge and flood mitigation plans for at-risk electric equipment and emergency generators;\n\nmove at-risk equipment to higher ground.\n\n\n**There is a lack of redundancy in electric power service**\n\n\n\n- Consider requesting redundant service lines that can support the full facility load, are not collocated with\n\nother utility corridors, and are connected to different utility subsystems.\n\n- Consult with utility providers, which often have programs to provide expert technical consultation to\n\ndetermine the best configuration for critical service lines.\n\n\n**Customers have not assessed the electric power dependencies of their core functions and have not**\n**determined the business continuity impacts from the prolonged loss of externally supplied electric**\n**power**\n\n\n\n- Conduct a business impact analysis to ensure that backup generation has sufficient capacity to support\n\nall critical functions (e.g., security systems and communication and IT equipment) simultaneously and\nthen define the onsite emergency power capability (e.g., safe system shutdown versus full core function\ncapability versus reduced core function capability).\n\n- Conduct a feasibility study to determine required onsite emergency power needs before selecting\n\ngeneration equipment or incorporating provisions for onsite emergency power generation into business\ncontinuity plans.\n\n- Determine the amount of fuel that would need to be stored onsite to allow continued operation of\n\nemergency generation equipment in the event of fuel supply disruptions.\n\n\n-----\n\n**Customers may not have contracts in place to ensure continued delivery of fuel needed for onsite**\n**emergency power generation following a major disaster**\n\n\n\n- Review fuel contracts to determine the potential impacts of Excuse by Failure of Presupposed Conditions\n\nprovisions under Uniform Commercial Code Section 2-615, as adopted in each State.\n\n- For critical lifeline system assets, consider arranging for multiple fuel providers in the event of a\n\nprolonged outage.\n\n- Consult with manufacturer of emergency generator equipment to determine its potential to use alternative\n\nfuels (e.g., diesel and natural gas or diesel and jet fuel).\n\n\n**Customers have not tested emergency generators at load to ensure that they will operate as**\n**designed**\n\n\n\n- Conduct scheduled load tests on emergency generators.\n\n- Enroll emergency generators in a preventative maintenance program (e.g., through a contracted service).\n\n- Ensure that facility personnel are trained in operation of the emergency generation equipment.\n\n\n**Critical infrastructure customers lack emergency planning that includes addressing the loss of**\n**electric power and do not train or exercise this contingency**\n\n\n\n- Develop or amend emergency or business continuity plans to address the long-term loss of electric\n\npower; train personnel in implementing backup equipment and alternate operational procedures; and\nfinally, exercise plans at least annually.\n\n- Investigate contingency plans with electric power providers, including priority service restoration based\n\non criticality to disaster recovery.\n\n- Review electric utility service contracts to confirm that firm electric service is available for critical\n\nfunctions and understand contractual provisions for the utility’s voluntary reduction options, as well as its\nload-shedding priorities.\n\n\n**Critical infrastructure customers lack emergency power capability to improve core function**\n**resilience**\n\n\n\n- Install onsite emergency generators, or consider installing appropriate connections and entering into\n\ncontracts for the delivery of portable emergency generators, following an emergency event.\n\n- Place emergency generators away from other electrical equipment so that a single event will not impact\n\nboth main power and emergency power equipment.\n\n- Consider alternatives to emergency generators, including using large equipment with electric generating\n\ncapabilities such as railroad locomotives, ships, or even tractors.\n\n- Install battery backup systems for safe shutdown to prevent equipment damage from loss of electric\n\npower.\n\n- Many electric power providers will provide consultation to determine whether onsite generation\n\nequipment (distributed generation) is feasible and cost-effective; make use of this resource, if it is\navailable.\n\n\n-----\n\n## APPENDIX\n\n### RESILIENCE ISSUES AND BEST PRACTICES: REFERENCES AND RESOURCES\n\nThe following references provide more in-depth information on the Electric Transmission and\nDistribution Segment, including vulnerabilities, gaps, resilience technology, and other sectorspecific guidance.\n\nABB\n\n  - _U.S. Rapid Recovery Transformer Initiative Succeeds Using Specially-Designed ABB_\n\n_Transformers, October 4, 2012,_\nwww.abb.us/cawp/seitp202/9a9f00ef6e90dd00c1257a7e0042e142.aspx.\n\nArgonne National Laboratory\n\n  - _Resilience: Theory and Applications, January 2012, www.dis.anl.gov/pubs/72218.pdf._\n\nDOE\n\n  - Smart Grid Investment Grant Program (a public-private partnership to accelerate\n\ninvestments in grid modernization), July 2012, http://energy.gov/oe/downloads/smartgrid-investment-grant-program-progress-report-july-2012.\n\n  - _Large Power Transformers and the U.S. Electric Grid, June 2012,_\n\nhttp://energy.gov/oe/downloads/large-power-transformers-and-us-electric-grid-reportjune-2012.\n\n  - Office of Electricity Delivery and Energy Reliability, State and Local Energy Assurance\n\n_Planning, http://energy.gov/oe/services/energy-assurance/emergency-preparedness/state-_\nand-local-energy-assurance-planning.\n\n  - Office of Electricity Delivery and Energy Reliability, Energy Assurance Daily, 2013,\n\nwww.oe.netl.doe.gov/ead.aspx.\n\n  - DOE and National Association of State Energy Officials, National Energy Assurance\n\n_Planning Conference After Action Report, 2012,_\nhttp://energy.gov/sites/prod/files/National Energy Assurance Planning Conference_After\nAction Report_082112_1.pdf.\n\n  - DOE and Public Technology Institute, Local Government Energy Assurance Guidelines,\n\n2011, www.naruc.org/Publications/PTI1.pdf.\n\nDOE Energy Information Administration (EIA)\n\n  - _Annual Coal Distribution Report, 2013, www.eia.gov/coal/distribution/annual/._\n\n  - _Energy In Brief: What Is the Role of Coal in the United States?, 2013,_\n\nwww.eia.gov/energy_in_brief/article/role_coal_us.cfm.\n\n  - _Total Energy: Annual Energy Review, 2012,_\n\nwww.eia.gov/totalenergy/data/annual/diagram4.cfm.\n\n\n-----\n\n  - _Electricity Explained: Electricity in the United States, 2013,_\n\nwww.eia.gov/energyexplained/index.cfm?page=electricity_in_the_united_states.\n\n  - _Electricity Data Browser, 2013, www.eia.gov/electricity/data/browser/._\n\n  - _Electricity, 2013, www.eia.gov/electricity/data.cfm._\n\n  - _U.S. States, States Profiles and Energy Estimates, 2013, www.eia.gov/state/._\n\nDHS\n\n  - _Power Hungry: Prototyping Replacement EHV Transformer, 2012, www.dhs.gov/power-_\n\nhungry-prototyping-replacement-ehv-transformers.\n\n  - _Common Cybersecurity Vulnerabilities in Industrial Control Systems, 2011, May_\n\nhttp://icscert.uscert.gov/pdf/DHS_Common_Cybersecurity_Vulnerabilities_ICS_2010.pdf.\n\n  - _Critical Infrastructure Cyber Community (C[3]) Voluntary Program helps critical_\n\ninfrastructure sectors and organizations reduce and manage their cyber risk by connecting\nthem to existing cyber risk management capabilities provided by DHS, other U.S.\nGovernment organizations, and the private sector. At the time of launch in February\n2014, available resources primarily consisted of DHS programs, which will grow to\ninclude cross-sector, industry, and State and local resources. Available at\n\nwww.us-cert.gov/ccubedvp.\n\nDisaster Resource Guide\n\n  - Richard Rudman, Mission Critical Electrical: Preparing for Power, www.disaster\nresource.com/articles/04p_112.shtml.\n\nEnergy Central\n\n  - _Energy Central News, 2014, www.energycentral.com/news._\n\nEnvironmental Protection Agency (EPA)\n\n  - Is Your Water or Wastewater System Prepared? What You Need to Know about\n\nGenerators, 2012,\nwww.epa.gov/region1/eco/drinkwater/pdfs/WaterWastewaterSystemGeneratorPreparedn\ness.pdf.\n\nFederal Emergency Management Agency (FEMA)\n\n  - _Mapping Information Platform, 2014, https://hazards.fema.gov/wps/portal/mapviewer._\n\n  - _[Blackouts, February 2013, www.ready.gov/blackouts.](http://www.ready.gov/blackouts)_\n\n  - _[Business Continuity Plan, 2012, www.ready.gov/business/implementation/continuity.](http://www.ready.gov/business/implementation/continuity)_\n\n  - _Crisis Response and Disaster Resilience 2030: Forging Strategic Action in an Age of_\n\n_Uncertainty, January 2012,_ www.fema.gov/media-library-data/20130726-1816-250455167/sfi_report_13.jan.2012_final.docx.pdf.\n\n  - _A Whole Community Approach to Emergency Management: Principles, Themes, and_\n\n_Pathways for Action, FDOC 104-008-1, December 2011, www.fema.gov/media-_\nlibrary/assets/documents/23781.\n\n\n-----\n\nKathy Leotta, Parsons Brinckerhoff\n\n  - _Fuel Price, Availability, and Mobility: What We Can Learn from North Carolina in the_\n\n_Aftermath of Hurricane Katrina, and Oil Shocks of the 1970s and Early 1980s, 2009,_\nhttp://postcarboncities.net/files/Leotta_FuelPriceAvailabilityAndMobility-11Nov06.pdf.\n\nNational Association of Regulatory Utility Commissioners (NARUC)\n\n  - _Smart Grid Resources, 2014, www.naruc.org/smartgrid/._\n\n  - _Regulatory Commissions, 2014, www.naruc.org/commissions/._\n\nNational Association of State Energy Officials (NASEO)\n\n  - _Energy Assurance Planning, 2012, http://naseo.org/energyassurance/._\n\n  - _Petroleum Shortage Supply Management: Options for States, 2011,_\n\nwww.naseo.org/data/sites/1/documents/publications/Petroleum_Shortage_Supply_Manag\nement.pdf.\n\nNorth American Electric Reliability Corporation (NERC)\n\n  - _2010 Special Reliability Assessment Scenario: Resource Adequacy Impacts of Potential_\n\n_U.S. Environmental Regulations, www.nerc.com/files/EPA_Scenario_Final.pdf._\n\n  - _2012 Long-Term Reliability Assessment, www.nerc.com/files/2012_LTRA_FINAL.pdf._\n\n  - _2012 State of Grid Reliability, www.nerc.com/files/2012_SOR.pdf._\n\n  - _2011 NERC Grid Security Exercise: After Action Report, March 2012,_\n\nwww.nerc.com/files/NERC_GridEx_AAR_16Mar2012_Final.pdf.\n\n  - _Statement: Response to Passage of Critical Infrastructure Protection Version 5_\n\n_Standards, November 2012,_\nwww.nerc.com/fileUploads/File/News/CIPV5%207NOV12.pdf.\n\nThe State of New Jersey\n\n  - New Jersey Department of the Treasury, Request for Proposal 11-X-21485 (T-2748) For:\n\n_State of New Jersey Exit 14 (NJ Tpk). Resiliency Plan/Decision Support Tool,_\nhttps://wwwnet1.state.nj.us/treasury/dpp/ebid/Buyer/GetDocument.aspx?DocId=14355&\nDocName=11-x-21485RFP.pdf&DocLoc=13.\n\n  - New Jersey Board of Public Utilities, Order In the Matter of the Board’s Review of the\n\n_Utilities’ Response to Hurricane Irene, 2012, accessed February 5, 2014,_\nwww.nj.gov/bpu/pdf/boardorders/2013/20130123/1-23-13-6B.pdf.\n\nNational Oceanic and Atmospheric Administration (NOAA),\n\n  - _[Storm Surge Interactive Risk Maps, www.nhc.noaa.gov/surge/risk/. (Note: also see any](http://www.nhc.noaa.gov/surge/risk/)_\n\nState or regional surge mapping that may be available through State-level emergency\nplanning or transportation planning agencies.)\n\nNew York State and The Rockefeller Foundation\n\n  - _New York State 2100 Commission:_ _Recommendations to Improve the Strength and_\n\n_Resilience of the Empire State’s Infrastructure, January 11, 2013,_\nwww.rockefellerfoundation.org/news/publications/nys-2100-commission-report-building.\n\n\n-----\n\nNorth Carolina Institute for Public Health\n\n  - _A Public/Private Legal Preparedness Initiative to Develop Good Samaritan Liability_\n\n_Protection for Business and Non-Profit Entities Assisting in Emergency Community_\n_Preparedness Activities, January 2009, http://nciph.sph.unc.edu/law/. See also University_\nof North Carolina, Gillings School of Global Public Health Website for updates on the\nstatus of emergency entity liability protection by State and different approaches taken in\nthe various State laws.\n\nOutage Central\n\n  - _Power Outage Map, 2013, www.outagecentral.com/._\n\nRebecca Williams, Genevieve Williams, and David Burton, Joplin Tornado Information and the\nUniversity of Missouri Extension\n\n  - _The Use of Social Media for Disaster Recovery, 2012,_\n\nhttp://extension.missouri.edu/greene/documents/PlansReports/using%20social%20media\n%20in%20disasters.pdf.\n\nU.S. Army Corps of Engineers (USACE)\n\n  - _Two Coastal Flood Inundation Maps – Which Should I Use?: Hurricane Evacuation_\n\n_Study — Storm Surge Inundation Mapping vs. National Flood Insurance Program —_\n_Flood Insurance Rate Map. 2011,_\nwww.txchart.com/Documents/ResourcesDocument/Diff_BW_SLOSH_ADCIRC.pdf.\n\nU.S. Department of Transportation, Federal Highway Administration (FHWA)\n\n  - _MAP-21: Moving Head for Progress in the 21st Century, 2012,_\n\nwww.fhwa.dot.gov/map21/.\n\n\nThe Office of Cyber and Infrastructure Analysis (OCIA) produces Sector Resilience Reports to improve partner\nand stakeholder understanding of the interdependencies and resilience of certain aspects of specific sectors. The\ninformation is provided to support the activities of the Department, and to inform the strategies of Federal, State,\nlocal, and private sector partners designed to deter, prevent, preempt, and respond to all-hazard disruptions to\ninfrastructure in the United States. For more information, contact OCIA@hq.dhs.gov or visit our website:\n[www.dhs.gov/office-cyber-infrastructure-analysis.](http://www.dhs.gov/office-cyber-infrastructure-analysis)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/DHS - Sector Resilience Report Electric Power Delivery  14 JULY 14.pdf"
    ],
    "report_names": [
        "DHS - Sector Resilience Report Electric Power Delivery  14 JULY 14.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536174,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1405073226,
    "ts_modification_date": 1405073226,
    "files": {
        "pdf": "https://archive.orkl.eu/d214943a86accf94b79db87c1880f9844cf6b643.pdf",
        "text": "https://archive.orkl.eu/d214943a86accf94b79db87c1880f9844cf6b643.txt",
        "img": "https://archive.orkl.eu/d214943a86accf94b79db87c1880f9844cf6b643.jpg"
    }
}