{
    "id": "097f242e-fd97-4c15-80f7-dbc4d74c2269",
    "created_at": "2023-01-12T15:00:27.789481Z",
    "updated_at": "2025-03-27T02:05:52.521408Z",
    "deleted_at": null,
    "sha1_hash": "c14e36e710663f9b425f0825f1526f765012cbcf",
    "title": "2022-07-27 - PrivateLoader- Network-Based Indicators of Compromise",
    "authors": "",
    "file_creation_date": "2022-09-01T10:27:31Z",
    "file_modification_date": "2022-09-01T10:27:31Z",
    "file_size": 5458898,
    "plain_text": "# PrivateLoader: Network-Based Indicators of Compromise\n\n**[de.darktrace.com/blog/privateloader-network-based-indicators-of-compromise](https://de.darktrace.com/blog/privateloader-network-based-indicators-of-compromise)**\n\n27\n\nJul 2022\n\n27\n\nJul 2022\n\n**Instead of delivering their malicious payloads themselves, threat actors can pay certain**\n**cybercriminals (known as pay-per-install (PPI) providers) to deliver their payloads for them.**\n**Since January 2022, Darktrace’s SOC has observed several cases of PPI providers delivering**\n**their clients’ payloads using a modular malware downloader known as ‘PrivateLoader’.**\n\nThis blog will explore how these PPI providers installed PrivateLoader onto systems and outline the\nsteps which the infected PrivateLoader bots took to install further malicious payloads. The details\nprovided here are intended to provide insight into the operations of PrivateLoader and to assist\nsecurity teams in identifying PrivateLoader bots within their own networks.\n\n### Threat Summary\n\nBetween January and June 2022, Darktrace identified the following sequence of network behaviours\nwithin the environments of several Darktrace clients. Patterns of activity involving these steps are\nparadigmatic examples of PrivateLoader activity:\n\n1.   A victim’s device is redirected to a page which instructs them to download a password-protected\narchive file from a file storage service — typically Discord Content Delivery Network (CDN)\n\n2.   The device contacts a file storage service (typically Discord CDN) via SSL connections\n\n3.   The device either contacts Pastebin via SSL connections, makes an HTTP GET request with the\nURI string ‘/server.txt’ or ‘server_p.txt’ to 45.144.225[.]57, or makes an HTTP GET request with the\nURI string ‘/proxies.txt’ to 212.193.30[.]45\n\n4.   The device makes an HTTP GET request with the URI string ‘/base/api/statistics.php’ to either\n212.193.30[.]21, 85.202.169[.]116, 2.56.56[.]126 or 2.56.59[.]42\n\n5.   The device contacts a file storage service (typically Discord CDN) via SSL connections\n\n6.   The device makes a HTTP POST request with the URI string ‘/base/api/getData.php’ to either\n212.193.30[.]21, 85.202.169[.]116, 2.56.56[.]126 or 2.56.59[.]42\n\n7.   The device finally downloads malicious payloads from a variety of endpoints\n\n### The PPI Business\n\n\n-----\n\nBefore exploring PrivateLoader in more detail, the pay-per-install (PPI) business should be\ncontextualized. This consists of two parties:\n\n1.   PPI clients - actors who want their malicious payloads to be installed onto a large number of\ntarget systems. PPI clients are typically entry-level threat actors who seek to widely distribute\ncommodity malware [1]\n\n2.   PPI providers - actors who PPI clients can pay to install their malicious payloads\n\nAs the smugglers of the cybercriminal world, PPI providers typically advertise their malware delivery\nservices on underground web forums. In some cases, PPI services can even be accessed via Clearnet\nwebsites such as InstallBest and InstallShop [2] (Figure 1).\n\nFigure 1: A snapshot of the InstallBest PPI login page [2]\n\nTo utilize a PPI provider’s service, a PPI client must typically specify:\n\n(A) the URLs of the payloads which they want to be installed\n\n(B) the number of systems onto which they want their payloads to be installed\n\n(C) their geographical targeting preferences.\n\nPayment of course, is also required. To fulfil their clients’ requests, PPI providers typically make use of\ndownloaders - malware which instructs the devices on which it is running to download and execute\nfurther payloads. PPI providers seek to install their downloaders onto as many systems as possible.\nFollow-on payloads are usually determined by system information garnered and relayed back to the\n\n\n-----\n\nPPI providers command and control (C2) infrastructure. PPI providers may disseminate their\ndownloaders themselves, or they may outsource the dissemination to third parties called ‘affiliates’\n\n[3].\n\nBack in May 2021, Intel 471 researchers became aware of PPI providers using a novel downloader\n(dubbed ‘PrivateLoader’) to conduct their operations. Since Intel 471’s public disclosure of the\ndownloader back in Feb 2022 [4], several other threat research teams, such as the Walmart Cyber\nIntel Team [5], Zscaler ThreatLabz [6], and Trend Micro Research [7] have all provided valuable\ninsights into the downloader’s behaviour.\n\n### Anatomy of a PrivateLoader Infection\n\nThe PrivateLoader downloader, which is written in C++, was originally monolithic (i.e, consisted of only\none module). At some point, however, the downloader became modular (i.e, consisting of multiple\nmodules). The modules communicate via HTTP and employ various anti-analysis methods.\nPrivateLoader currently consists of the following three modules [8]:\n\n-   The loader module: Instructs the system on which it is running to retrieve the IP address of the\nmain C2 server and to download and execute the PrivateLoader core module\n\n-   The core module: Instructs the system on which it is running to send system information to the\nmain C2 server, to download and execute further malicious payloads, and to relay information\nregarding installed payloads back to the main C2 server\n\n-   The service module: Instructs the system on which it is running to keep the PrivateLoader\nmodules running\n\n### Kill Chain Deep-Dive\n\nThe chain of activity starts with the user’s browser being redirected to a webpage which instructs them\nto download a password-protected archive file from a file storage service such as Discord CDN.\nDiscord is a popular VoIP and instant messaging service, and Discord CDN is the service’s CDN\ninfrastructure. In several cases, the webpages to which users’ browsers were redirected were hosted\non ‘hero-files[.]com’ (Figure 2), ‘qd-files[.]com’, and ‘pu-file[.]com’ (Figure 3).\n\n\n-----\n\nFigure 2: An image of a page hosted on hero-files[.]com - an endpoint which Darktrace observed\nsystems contacting before downloading PrivateLoader from Discord CDN\n\nFigure 3: An image of a page hosted on pu-file[.]com- an endpoint which Darktrace observed systems\ncontacting before downloading PrivateLoader from Discord CDN\n‍\nOn attempting to download cracked/pirated software, users’ browsers were typically redirected to\ndownload instruction pages. In one case however, a user’s device showed signs of being infected with\nthe malicious Chrome extension, ChromeBack [9], immediately before it contacted a webpage\nproviding download instructions (Figure 4). This may suggest that cracked software downloads are not\nthe only cause of users’ browsers being redirected to these download instruction pages (Figure 5).\n\n\n-----\n\nFigure 4: The event log for this device (taken from the Darktrace Threat Visualiser interface) shows\nthat the device contacted endpoints associated with ChromeBack ('freychang[.]fun') prior to visiting a\npage ('qd-file[.]com') which instructed the device’s user to download an archive file from Discord CDN\n\n\n-----\n\nFigure 5: An image of the website 'crackright[.]com'- a provider of cracked software. Systems which\nattempted to download software from this website were subsequently led to pages providing\ninstructions to download a password-protected archive from Discord CDN\n‍\nAfter users’ devices were redirected to pages instructing them to download a password-protected\narchive, they subsequently contacted cdn.discordapp[.]com over SSL. The archive files which users\ndownloaded over these SSL connections likely contained the PrivateLoader loader module.\nImmediately after contacting the file storage endpoint, users’ devices were observed either contacting\nPastebin over SSL, making an HTTP GET request with the URI string ‘/server.txt’ or ‘server_p.txt’ to\n45.144.225[.]57, or making an HTTP GET request with the URI string ‘/proxies.txt’ to 212.193.30[.]45\n(Figure 6).\n\nDistinctive user-agent strings such as those containing question marks (e.g. ‘????ll’) and strings\nreferencing outdated Chrome browser versions were consistently seen in these HTTP requests. The\nfollowing chrome agent was repeatedly observed: ‘Mozilla/5.0 (Windows NT 10.0; Win64; x64)\nAppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36’.\n\nIn some cases, devices also displayed signs of infection with other strains of malware such as the\nRedLine infostealer and the BeamWinHTTP malware downloader. This may suggest that the\npassword-protected archives embedded several payloads.\n\n\n-----\n\nFigure 6: This figure, obtained from Darktrace's Advanced Search interface, represents the postinfection behaviour displayed by a PrivateLoader bot. After visiting hero-files[.]com and downloading\nthe PrivateLoader loader module from Discord CDN, the device can be seen making HTTP GET\nrequests for ‘/proxies.txt’ and ‘/server.txt’ and contacting pastebin[.]com\nIt seems that PrivateLoader bots contact Pastebin, 45.144.225[.]57, and 212.193.30[.]45 in order to\nretrieve the IP address of PrivateLoader’s main C2 server - the server which provides PrivateLoader\nbots with payload URLs. This technique used by the operators of PrivateLoader closely mirrors the\nwell-known espionage tactic known as ‘dead drop’.\n\nThe dead drop is a method of espionage tradecraft in which an individual leaves a physical object\nsuch as papers, cash, or weapons in an agreed hiding spot so that the intended recipient can retrieve\nthe object later on without having to come in to contact with the source. When threat actors host\ninformation about core C2 infrastructure on intermediary endpoints, the hosted information is\nanalogously called a ‘Dead Drop Resolver’ or ‘DDR’. Example URLs of DDRs used by PrivateLoader:\n\n-   https://pastebin[.]com/...\n\n-   http://212.193.30[.]45/proxies.txt\n\n-   http://45.144.225[.]57/server.txt\n\n-   http://45.144.255[.]57/server_p.txt\n\nThe ‘proxies.txt’ DDR hosted on 212.193.40[.]45 contains a list of 132 IP address / port pairs. The\n119 line of this list includes a scrambled version of the IP address of PrivateLoader’s main C2 serverth\n(Figures 7 & 8). Prior to June, it seems that the main C2 IP address was ‘212.193.30[.]21’, however,\nthe IP address appears to have recently changed to ‘85.202.169[.]116’. In a limited set of cases,\nDarktrace also observed PrivateLoader bots retrieving payload URLs from 2.56.56[.]126 and\n2.56.59[.]42 (rather than from 212.193.30[.]21 or 85.202.169[.]116). These IP addresses may be\nhardcoded secondary C2 address which PrivateLoader bots use in cases where they are unable to\nretrieve the primary C2 address from Pastebin, 212.193.30[.]45 or 45.144.255[.]57 [10].\n\n\n-----\n\nFigure 7: Before June, the 119th entry of the ‘proxies.txt’ file lists '30.212.21.193' - a scrambling of the\n‘212.193.30[.]21’ main C2 IP address\n\n\n-----\n\n-----\n\nFigure 8: Since June, the 119th entry of the ‘proxies.txt’ file lists '169.85.116.202' - a scrambling of the\n'85.202.169[.]116' main C2 IP address\nOnce PrivateLoader bots had retrieved C2 information from either Pastebin, 45.144.225[.]57, or\n212.193.30[.]45, they went on to make HTTP GET requests for ‘/base/api/statistics.php’ to either\n212.193.30[.]21, 85.202.169[.]116, 2.56.56[.]126, or 2.56.59[.]42 (Figure 9). The server responded to\nthese requests with an XOR encrypted string. The strings were encrypted using a 1-byte key [11], such\nas 0001101 (Figure 10). Decrypting the string revealed a URL for a BMP file hosted on Discord CDN,\nsuch as\n‘hxxps://cdn.discordapp[.]com/attachments/978284851323088960/986671030670078012/PL_Client.bmp’.\nThese encrypted URLs appear to be file download paths for the PrivateLoader core module.\n\nFigure 9: HTTP response from server to an HTTP GET request for '/base/api/statistics.php'\n\nFigure 10: XOR decrypting the string with the one-byte key, 00011101, outputs a URL in CyberChef\n\nAfter PrivateLoader bots retrieved the 'cdn.discordapp[.]com’ URL from 212.193.30[.]21,\n85.202.169[.]116, 2.56.56[.]126, or 2.56.59[.]42, they immediately contacted Discord CDN via SSL\nconnections in order to obtain the PrivateLoader core module. Execution of this module resulted in the\nbots making HTTP POST requests (with the URI string ‘/base/api/getData.php’) to the main C2\naddress (Figures 11 & 12). Both the data which the PrivateLoader bots sent over these HTTP POST\n\n\n-----\n\nrequests and the data returned via the C2 server s HTTP responses were heavily encrypted using a\ncombination of password-based key derivation, base64 encoding, AES encryption, and HMAC\nvalidation [12].\n\nFigure 11: The above image, taken from Darktrace's Advanced Search interface, shows a\nPrivateLoader bot carrying out the following steps: contact ‘hero-files[.]com’ --> contact\n‘cdn.discordapp[.]com’ --> retrieve ‘/proxies.txt’ from 212.193.30[.]45 --> retrieve\n‘/base/api/statistics.php’ from 212.193.30[.]21 --> contact ‘cdn.discordapp[.]com --> make HTTP POST\nrequest with the URI ‘base/api/getData.php’ to 212.193.30[.]21\n\nFigure 12: A PCAP of the data sent via the HTTP POST (in red), and the data returned by the C2\nendpoint (in blue)\n\nThese ‘/base/api/getData.php’ POST requests contain a command, a campaign name and a JSON\nobject. The response may either contain a simple status message (such as “success”) or a JSON\nobject containing URLs of payloads. After making these HTTP connections, PrivateLoader bots were\nobserved downloading and executing large volumes of payloads (Figure 13), ranging from cryptominers to infostealers (such as Mars stealer), and even to other malware downloaders (such as\nSmokeLoader). In some cases, bots were also seen downloading files with ‘.bmp’ extensions, such as\n‘Service.bmp’, ‘Cube_WW14.bmp’, and ‘NiceProcessX64.bmp’, from 45.144.225[.]57 - the same DDR\nendpoint from which PrivateLoader bots retrieved main C2 information. These ‘.bmp’ payloads are\nlikely related to the PrivateLoader service module [13]. Certain bots made follow-up HTTP POST\nrequests (with the URI string ‘/service/communication.php’) to either 212.193.30[.]21 or\n85.202.169[.]116, indicating the presence of the PrivateLoader service module, which has the purpose\nof establishing persistence on the device (Figure 14).\n\n\n-----\n\nFigure 13: The above image, taken from Darktrace's Advanced Search interface, outlines the plethora\nof malware payloads downloaded by a PrivateLoader bot after it made an HTTP POST request to the\n‘/base/api/getData.php’ endpoint. The PrivateLoader service module is highlighted in red\n\nFigure 14: The event log for a PrivateLoader bot, obtained from the Threat Visualiser interface, shows\na device making HTTP POST requests to ‘/service/communication.php’ and connecting to the\nNanoPool mining pool, indicating successful execution of downloaded payloads\n\nIn several observed cases, PrivateLoader bots downloaded another malware downloader called\n‘SmokeLoader’ (payloads named ‘toolspab2.exe’ and ‘toolspab3.exe’) from “Privacy Tools” endpoints\n\n[14], such as ‘privacy-tools-for-you-802[.]com’ and ‘privacy-tools-for-you-783[.]com’. These “Privacy\nTools” domains are likely impersonation attempts of the legitimate ‘privacytools[.]io’ website - a website\nrun by volunteers who advocate for data privacy [15].\n\nAfter downloading and executing malicious payloads, PrivateLoader bots were typically seen\ncontacting crypto-mining pools, such as NanoPool, and making HTTP POST requests to external\nhosts associated with SmokeLoader, such as hosts named ‘host-data-coin-11[.]com’ and ‘file-coinhost-12[.]com’ [16]. In one case, a PrivateLoader bot went on to exfiltrate data over HTTP to an\nexternal host named ‘cheapf[.]link’, which was registered on the 14 March 2022 [17]. The name ofth\n\n\n-----\n\nthe file which the PrivateLoader bot used to exfiltrate data was NOP8QIMGV3W47Y.zip, indicating\ninformation stealing activities by Mars Stealer (Figure 15) [18]. By saving the HTTP stream as raw data\nand utilizing a hex editor to remove the HTTP header portions, the hex data of the ZIP file was\nobtained. Saving the hex data using a ‘.zip’ extension and extracting the contents, a file directory\nconsisting of system information and Chrome and Edge browsers’ Autofill data in cleartext .txt file\nformat could be seen (Figure 16).\n\nFigure 15: A PCAP of a PrivateLoader bot’s HTTP POST request to cheapf[.]link, with data sent by the\nbot appearing to include Chrome and Edge autofill data, as well as system information\n\n\n-----\n\nFigure 16: File directory structure and files of the ZIP archive\n\nWhen left unattended, PrivateLoader bots continued to contact C2 infrastructure in order to relay\ndetails of executed payloads and to retrieve URLs of further payloads.\n\n\n-----\n\nFigure 17: Timeline of the attack\n\n### Darktrace Coverage\n\nMost of the incidents surveyed for this article belonged to prospective customers who were trialling\nDarktrace with RESPOND in passive mode, and thus without the ability for autonomous intervention.\nHowever in all observed cases, Darktrace DETECT was able to provide visibility into the actions taken\nby PrivateLoader bots. In one case, despite the infected bot being disconnected from the client’s\nnetwork, Darktrace was still able to provide visibility into the device’s network behaviour due to the\nclient’s usage of Darktrace/Endpoint.\n\nIf a system within an organization’s network becomes infected with PrivateLoader, it will display a\nrange of anomalous network behaviours before it downloads and executes malicious payloads. For\nexample, it will contact Pastebin or make HTTP requests with new and unusual user-agent strings to\nrare external endpoints. These network behaviours will generate some of the following alerts on the\nDarktrace UI:\n\n-   Compliance / Pastebin\n\n-   Device / New User Agent and New IP\n\n-   Device / New User Agent\n\n-   Device / Three or More New User Agents\n\n\n-----\n\nAnomalous Connection / New User Agent to IP Without Hostname\n\n-   Anomalous Connection / POST to PHP on New External Host\n\n-   Anomalous Connection / Posting HTTP to IP Without Hostname\n\nOnce the infected host obtains URLs for malware payloads from a C2 endpoint, it will likely start to\ndownload and execute large volumes of malicious files. These file downloads will usually cause\nDarktrace to generate some of the following alerts:\n\n-   Anomalous File / EXE from Rare External Location\n\n-   Anomalous File / Numeric Exe Download\n\n-   Anomalous File / Masqueraded File Transfer\n\n-   Anomalous File / Multiple EXE from Rare External Locations\n\n-   Device / Initial Breach Chain Compromise\n\nIf RESPOND is deployed in active mode, Darktrace will be able to autonomously block the download\nof additional malware payloads onto the target machine and the subsequent beaconing or cryptomining activities through network inhibitors such as ‘Block matching connections’, ‘Enforce pattern of\nlife’ and ‘Block all outgoing traffic’. The ‘Enforce pattern of life’ action results in a device only being\nable to make connections and data transfers which Darktrace considers normal for that device. The\n‘Block all outgoing traffic’ action will cause all traffic originating from the device to be blocked. If the\ncustomer has Darktrace’s Proactive Threat Notification (PTN) service, then a breach of an Enhanced\nMonitoring model such as ‘Device / Initial Breach Chain Compromise’ will result in a Darktrace SOC\nanalyst proactively notifying the customer of the suspicious activity. Below is a list of Darktrace\nRESPOND (Antigena) models which would be expected to breach due to PrivateLoader activity. Such\nmodels can seriously hamper attempts made by PrivateLoader bots to download malicious payloads.\n\n-   Antigena / Network / External Threat / Antigena Suspicious File Block\n\n-   Antigena / Network / Significant Anomaly / Antigena Controlled and Model Breach\n\n-   Antigena / Network / External Threat / Antigena File then New Outbound Block\n\n-   Antigena / Network / Significant Anomaly / Antigena Significant Anomaly from Client Block\n\n-   Antigena / Network / Significant Anomaly / Antigena Breaches Over Time Block\n\nIn one observed case, the infected bot began to download malicious payloads within one minute of\nbecoming infected with PrivateLoader. Since RESPOND was correctly configured, it was able to\nimmediately intervene by autonomously enforcing the device’s pattern of life for 2 hours and blocking\nall of the device’s outgoing traffic for 10 minutes (Figure 17). When malware moves at such a fast\npace, the availability of autonomous response technology, which can respond immediately to detected\nthreats, is key for the prevention of further damage.\n\n\n-----\n\nFigure 18: The event log for a Darktrace RESPOND (Antigena) model breach shows Darktrace\nRESPOND performing inhibitive actions once the PrivateLoader bot begins to download payloads\n\n### Schlussfolgerung\n\nBy investigating PrivateLoader infections over the past couple of months, Darktrace has observed\nPrivateLoader operators making changes to the downloader’s main C2 IP address and to the useragent strings which the downloader uses in its C2 communications. It is relatively easy for the\noperators of PrivateLoader to change these superficial network-based features of the malware in order\nto evade detection [19]. However, once a system becomes infected with PrivateLoader, it will inevitably\nstart to display anomalous patterns of network behaviour characteristic of the Tactics, Techniques and\nProcedures (TTPs) discussed in this blog.\n\nThroughout 2022, Darktrace observed overlapping patterns of network activity within the environments\nof several customers, which reveal the archetypal steps of a PrivateLoader infection. Despite the\nchanges made to PrivateLoader’s network-based features, Darktrace’s Self-Learning AI was able to\ncontinually identify infected bots, detecting every stage of an infection without relying on known\nindicators of compromise. When configured, RESPOND was able to immediately respond to such\ninfections, preventing further advancement in the cyber kill chain and ultimately preventing the delivery\nof floods of payloads onto infected devices.\n\n### IoCs\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n‍\n\n### MITRE ATT&CK Techniques Observed\n\n References\n\n[[1] [8] [13] https://www youtube com/watch?v=Ldp7eESQotM](https://www.youtube.com/watch?v=Ldp7eESQotM)\n\n\n-----\n\n[2] https://news.sophos.com/en-us/2021/09/01/fake-pirated-software-sites-serve-up-malwaredroppers-as-a-service/\n\n[3] https://www.researchgate.net/publication/228873118_Measuring_Pay-per\nInstall_The_Commoditization_of_Malware_Distribution\n\n[4], [15] [https://intel471.com/blog/privateloader-malware](https://intel471.com/blog/privateloader-malware)\n\n[5] [https://medium.com/walmartglobaltech/privateloader-to-anubis-loader-55d066a2653e](https://medium.com/walmartglobaltech/privateloader-to-anubis-loader-55d066a2653e)\n\n[6], [10],[11], [12] [https://www.zscaler.com/blogs/security-research/peeking-privateloader](https://www.zscaler.com/blogs/security-research/peeking-privateloader)\n\n[7] https://www.trendmicro.com/en_us/research/22/e/netdooka-framework-distributed-viaprivateloader-ppi.html\n\n[9] https://www.gosecure.net/blog/2022/02/10/malicious-chrome-browser-extension-exposedchromeback-leverages-silent-extension-loading/\n\n[14] [https://www.proofpoint.com/us/blog/threat-insight/malware-masquerades-privacy-tool](https://www.proofpoint.com/us/blog/threat-insight/malware-masquerades-privacy-tool)\n\n[16] [https://asec.ahnlab.com/en/30513/](https://asec.ahnlab.com/en/30513/)\n\n[[17]https://twitter.com/0xrb/status/1515956690642161669](https://twitter.com/0xrb/status/1515956690642161669)\n\n[18] [https://isc.sans.edu/forums/diary/Arkei+Variants+From+Vidar+to+Mars+Stealer/28468](https://isc.sans.edu/forums/diary/Arkei+Variants+From+Vidar+to+Mars+Stealer/28468)\n\n[19] [http://detect-respond.blogspot.com/2013/03/the-pyramid-of-pain.html](http://detect-respond.blogspot.com/2013/03/the-pyramid-of-pain.html)\n\n‍\n\n## Sie mögen das und wollen mehr?\n\nErhalten Sie den neuesten Blog per E-Mail\n\nVielen Dank! Ihre Anfrage ist eingegangen!\n\nHuch! Beim Absenden des Formulars ist etwas schief gelaufen.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-27 - PrivateLoader- Network-Based Indicators of Compromise.pdf"
    ],
    "report_names": [
        "2022-07-27 - PrivateLoader- Network-Based Indicators of Compromise.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535627,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1662028051,
    "ts_modification_date": 1662028051,
    "files": {
        "pdf": "https://archive.orkl.eu/c14e36e710663f9b425f0825f1526f765012cbcf.pdf",
        "text": "https://archive.orkl.eu/c14e36e710663f9b425f0825f1526f765012cbcf.txt",
        "img": "https://archive.orkl.eu/c14e36e710663f9b425f0825f1526f765012cbcf.jpg"
    }
}