{
    "id": "09c6ca3d-9218-4ea1-9302-f636fe96d487",
    "created_at": "2024-01-19T02:06:29.250147Z",
    "updated_at": "2025-03-27T02:16:14.484874Z",
    "deleted_at": null,
    "sha1_hash": "bd5f452c410332144799a69916d68235facb063f",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-10T11:28:37Z",
    "file_modification_date": "2024-01-10T11:28:51Z",
    "file_size": 3883255,
    "plain_text": "#### SecurityScorecard Threat Research:\n\n## Volt Typhoon Compromises 30% of Cisco RV320/325\n Devices in 37 Days\n\n###### Chinese state-sponsored group\n\n continues to actively compromise\n\n Cisco devices possibly affected by\n\n vulnerabilities publicly disclosed in 2019\n\n\n-----\n\n# Executive\n Summary\n\nThe SecurityScorecard Threat Research, Intelligence, Knowledge, and Engagement (STRIKE) Team has\n\nidentified new infrastructure that appears to be linked to the threat actor group tracked as Volt Typhoon.\n\n - Volt Typhoon is a state-sponsored group based in China that typically focuses on espionage and\n\ninformation gathering.\n\nApproximately 30% of the Cisco RV320/325 devices observed by SecurityScorecard in a 37-day\n\nperiod may have been compromised by Volt Typhoon.\n\n - The Cisco RV320/325 vulnerability was publicly disclosed in January 2019.\n\n  - For RV320, there are 35 known vulnerabilities for the Dual Gigabit Wan VPN Router Firmware,\n\nall with a CVSS score of 9.\n\n  - Two vulnerabilities from 2019 mentioned in the CISA KEV list (CVE-2019-1653, CVE-2019\n1652) could have been exploited by Volt Typhoon.\n\n - SecurityScorecard research illustrates state-sponsored threat actor groups’ ongoing ability to\n\nidentify vulnerable devices in anattempt to compromise targetnetworks.\n\n - The STRIKE Team observed frequent connections between these devices and known Volt\n\nTyphoon infrastructure from 12/1/23 to 1/7/2024, suggesting a very active presence.\n\n - The devices are end-of-life, so Cisco has not released and will not release software updates to\n\naddress vulnerabilities affecting them.\n\nSecurityScorecard researchers uncovered evidence of a previously unspecified webshell, fy.sh, on\n\nCisco routers and other network edge devices targeted by the group.\n\n - China Chopper is probably the best-known web shell used by China-linked APT groups;\n\nSecurityScorecard has now observed evidence of another.\n\n - The STRIKE Team observed possible targeting of U.S., U.K., and Australian government assets by\n\ntwo such devices.\n\n - Public reporting on Volt Typhoon has not previously noted its targeting of Australian or U.K.\n\ngovernment assets in addition to U.S. ones.\n\nResearchers identified two previously unidentified IP addresses belonging to a cluster of activity\n\nlinked to Volt Typhoon, 45.63.60[.]39 and 45.32.174[.]131.\n\nThe file name and IP addresses the STRIKE Team discovered may offer further indications of Volt\n\nTyphoon’s preparation of new infrastructure, which other recent reports have also observed.\n\n\n-----\n\n# Recommendations\n\n**See what a hacker sees to stop adversaries:**\n\n\n### 1\n\n 2\n\n 3\n\n\n###### Identify vulnerable devices\nMap your digital footprint with SecurityScorecard to identify Cisco RV320/325 devices on\nyour network.\n\n###### Upgrade end-of-life devices\n\nSince the vendor no longer provides support or patches for these devices, it is\nrecommended to upgrade to supported products immediately.\n\n###### Continuous monitoring\nSecurityScorecard validates your digital footprint on a continuous basis, so you can keep\ntrack of changes in your network that introduce new security issues.\n\n\n##### Digital footprint mapping\n\nA visualization of all the assets attributes to an organization, organized by IP addresses, IP ranges,\n\ndomains, and geographic distribution. SecurityScorecard also identifies the number of dynamic IP\n\naddresses at any point in time.\n\nBecause SecurityScorecard scans the entire IPv4 internet weekly, it continuously compiles\n\nand updates asset data to keep the security assessment current. Using data collected by\n\nSecurityScorecard proprietary scanners, web crawlers, honeypots, and other in-house analyses,\n\nwe proactively flag issue findings.\n\nEvery IP in your digital footprint is part of a domain. Since domains often group IPs by business\n\nunits, or initiatives, the domain view in your digital footprint enables you to review IPs in logical\n\nsubsets.\n\n\n-----\n\n# Background\n\n[Following the publication of reports of new activity attributed to the threat actor group tracked as Volt](https://www.washingtonpost.com/technology/2023/12/11/china-hacking-hawaii-pacific-taiwan-conflict/)\n[Typhoon and Bronze Silhouette, which the cybersecurity community believes to conduct espionage](https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/)\n[on behalf of the People’s Republic of China (PRC), the STRIKE Team began to track and identify covert](https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-144a)\ninfrastructure linked to the campaign. The reports already published about the group note varying\nlevels of complexity, but its use of compromised small office and home office (SOHO) equipment such\nas routers and firewalls to conduct attacks abroad is a recurring feature. This research is based on the\ninfrastructure that SecurityScorecard’s global internet data and other passive signals collections identified.\n\n[Lumen’s Black Lotus Labs’ recently-published report identified a group of compromised SOHO devices](https://blog.lumen.com/routers-roasting-on-an-open-firewall-the-kv-botnet-investigation/)\nappearing to constitute a botnet that threat actors including but not limited to Volt Typhoon have used\nto covertly transfer data. The compromised devices the botnet uses include Cisco and DrayTek routers,\nNETGEAR firewalls, and Axis IP cameras. STRIKE researchers used the indicators of compromise\n[(IoCs) published alongside that report to conduct further research, which led to the newly-identified](https://github.com/blacklotuslabs/IOCs/blob/main/KVbotnet_IOCs.txt)\ninfrastructure discussed below.\n\nFIGURE 1:\n###### Global distribution\n of targeted models\n of NETGEAR\n ProSAFE devices.\n\nFIGURE 2:\n###### Global distribution of targeted Cisco router models (RV320 and RV325) visible on the Internet in a seven-day period.\n\n\n-----\n\nFurther research suggests that the Volt Typhoon-linked botnet’s compromise of Cisco RV320\nand RV325 routers may be more extensive than previously reported. Researchers additionally\nused a strategic partner’s network flow (NetFlow) data to develop additional insights into\n\nactivity involving this population of possible target devices and found that approximately\n30% of them (325 of 1,116 devices) communicated with two IP addresses previously named\nas proxy routers used for command and control (C2) communications, 174.138.56[.]21 and\n159.203.113[.]25, in a thirty-day period. Communication with known botnet C2 infrastructure\nmay suggest participation in that same botnet’s activities.\n\n\nFIGURE 3:\n###### Connections between IP addresses known to be Volt Typhoon IoCs and other IP addresses by ISO country code.\n\nFIGURE 4:\n###### Geographical distribution of possibly infected Cisco RV320 devices by count of connections to C2 router nodes\n\n\n-----\n\nFIGURE 5:\n###### Geographical distribution of possibly infected Cisco RV325 devices by count of connections to C2 router nodes.\n\nFIGURE 6:\n###### Geographical distribution of IP addresses observed communicating with known Volt Typhoon C2 infrastructure between January 1 and 8, 2024.\n\n\nThe continued activity by one of the aforementioned C2 proxies, 159.203.113[.]25, into early\nJanuary, appears to reflect a shift in the botnet’s C2 infrastructure, which the dates provided\nby Black Lotus Labs may also reflect. Prior to mid-November, another DigitalOcean IP address\nnamed as an IoC linked to the same botnet, 159.203.72[.]166, appears to have been more\nactive, but the increased activity from 159.203.113[.]25, another DigitalOcean IP address, from\nNovember 17 onward, suggests that the latter took the former’s place. A similar shift appears to\nhave occurred in the botnet’s Vultr infrastructure as well, with activity involving 144.202.49[.]189\nincreasing and activity involving 140.82.20[.]246 diminishing in mid-November.\n\n\n-----\n\nFIGURE 7:\n###### Traffic activity involving sample population of C2 proxy servers increased from October 2023 to January 7, 2024.\n\n\nAdditionally, SecurityScorecard’s scan data has revealed a group of Cisco routers with\n\nmetadata containing an IP address the Black Lotus Labs report cited above named as a\n\npayload server, which suggests compromise by Volt Typhoon or another threat actor using the\n\nsame botnet. This metadata refers to a wget command featuring 45.11.92[.]176, a known Volt\n\nTyphoon IoC, and references a file, fy.sh, that the devices in question retrieve and execute\n\nfrom 45.11.92[.]176. However, as of January 8, 2024, the payload server is offline.\n\nFIGURE 8:\n###### Content from our data collections indicates that a group of Cisco routers’ HTML appears to contain a hidden wget command to a Volt Typhoon-linked payload server.\n\n\n-----\n\nMetadata for the following IP addresses indicates that they contact the payload server at the\n\nIP address listed among other new IoCs associated with Volt Typhoon. Given that they do not\n\nthemselves appear in the previously published list, they may represent previously unidentified IoCs\n\nrelated to Volt Typhoon activity:\n\n\n\n- 46.10.197[.]206\n\n- 176.102.35[.]175\n\n- 93.62.0[.]77\n\n- 194.50.159[.]3\n\n- 80.64.80[.]169\n\n\n\n- 24.212.225[.]54\n\n- 208.97.106[.]10\n\n- 70.60.30[.]222\n\n- 184.67.141[.]110\n\n\nThe following maps display the geographical distribution of the devices with metadata containing fy.sh:\n\nFIGURE 9:\n###### Distribution of European IP addresses with metadata featuring Volt Typhoon payload server IP address.\n\nFIGURE 10:\n###### Distribution of North American IP addresses with metadata featuring Volt Typhoon payload server IP address.\n\n\nThe following maps display the geographical distribution of the devices with metadata containing fy.sh:\n\nFIGURE 9:\n###### Distribution of European IP addresses with metadata featuring Volt Typhoon payload server IP address.\n\n\n-----\n\n# Findings:\n Cisco Webshell\n\n\nResearchers additionally noted that the infrastructure observed communicating with\n\n45.11.92[.]176 features a webshell implant. This implant performs a wget request to the\n\npayload server to download a file named fy.sh.\n\nOf the IoCs Lumen circulated, the two files identified by the SHA256 hashes\n\n7043ffd9ce3fe48c9fb948ae958a2e9966d29afe380d6b61d5efb826b70334f5 (the file\n\nnamed Kv-all.sh) and 36c63d0c2a78497ccf555e84f0233a514943faeff38281d99d00baf5df23f184\n\n[are, as indicated by the .sh extension they have in common with fy.sh, shell files. A sample](https://www.virustotal.com/gui/file/36c63d0c2a78497ccf555e84f0233a514943faeff38281d99d00baf5df23f184/details)\n\n[of the particular file named fy.sh that 45.11.92[.]176 served does not yet appear to be](https://www.virustotal.com/gui/ip-address/45.11.92.176/relations)\n\n[publicly available, but two files with that name have appeared in VirusTotal. These two files,](https://www.virustotal.com/gui/ip-address/45.11.92.176/relations)\n\n[however, appear to be unrelated to the recent campaign; vendors detect them as macOS](https://www.virustotal.com/gui/file/a40da7483af602b502693616bef34c1a914dddac401bd92551d8d9694988dcbb)\n\n[adware and both were last seen in Summer 2021, while the activity discussed in Lumen’s](https://www.virustotal.com/gui/file/a40da7483af602b502693616bef34c1a914dddac401bd92551d8d9694988dcbb/details)\n\nreport began in February 2022. The fy.sh served by 45.11.92[.]176 may therefore more likely\n\ncorrespond to a different file also named fy.sh, one which may be similar to either of the\n\n.sh files Lumen named as IoCs, both given that an IP address named as an IoC in the same\n\nreport as those files has served fy.sh and that it is, in general, fairly common for PRC-linked\n\nAPT groups to use webshells (the China Chopper webshell is perhaps the most famous\n\nexample but by no means the only one).\n\n\n-----\n\n# Findings:\n Additional NetFlow Analysis\n\n\nResearchers conducted further analysis of NetFlow data to develop additional insights into\n\nactivity that may be related to the campaign. The analysis below focuses on traffic involving\n\nthe payload server discussed above, devices observed communicating with it, and other\n\nnewly-identified compromised devices; communications between these compromised\n\ndevices and other network devices may also offer insights into the campaign’s victimology.\n\nResearchers identified new IP addresses that belong to the Volt Typhoon-linked C2\n\ninfrastructure Lumen termed the “JDY Cluster” on the basis of the recurrence of the same\n\ncommon name, “jdyfj,” in the SSL certificates observed at the IP addresses in this cluster.\n\nThe two new IP addresses belonging to the cluster are 45.63.60[.]39 and 45.32.174[.]131.\n\nTo identify these IP addresses, researchers first used SecurityScorecard’s scan data to\n\ncollect a group of IP addresses where products Volt Typhoon is known to compromise\n\nare in use and then leveraged a strategic partner’s network flow (NetFlow) data to\n\ncollect traffic samples for those IP addresses. 202.22.227[.]179 is one such IP address;\n\nSecurityScorecard’s data indicates that a Cisco RV325 device is in use there and, according\n\nto the traffic samples for established Volt Typhoon-linked IoCs, it has communicated\n\nregularly IP addresses previously linked to Volt Typhoon.\n\nSecurityScorecard’s Attack Surface Intelligence module indicates that 202.22.227[.]179 is\n\nlocated in Noumea, New Caledonia and belongs to Micro Logic Systems (mls[.]nc), a New\n\nCaledonian internet service provider (ISP).\n\n\n-----\n\nFIGURE 11:\n###### SecurityScorecard locates 202.22.227[.]179\n in New Caledonia and attributes it to a New Caledonian ISP.\n\n\nIts location and attribution to an ISP may further suggest 202.22.227[.]179’s use as a transit\npoint for Volt Typhoon-related traffic; New Caledonia is an island chain in the Southwest Pacific,\nso it may be a common occurrence for traffic between the Asia-Pacific (APAC) region and the\nAmericas to pass through New Caledonian communications infrastructure en route to a final\ndestination either elsewhere in APAC or in the Americas. The available analysis of Volt Typhoon\nhas highlighted its targeting of communications between APAC and the Americas – its intrusions\ninto the networks of telecommunications providers and other critical infrastructure in Guam\nattracted particular attention in previous reporting–so its exploitation of telecommunications\ninfrastructure on another Pacific island may be in keeping with this previous behavior.\n\nHowever, a separate traffic sample focused specifically on 202.22.227[.]179 indicated frequent\ncommunication between 202.22.227[.]179 and both 45.63.60[.]39 and 45.32.174[.]131.\n45.63.60[.]39 communicated with 202.22.227[.]179 3,097 times between December 28 and 31\nand 45.32.174[.]131 communicated with it 3,358 times over the same period. Both of these IP\naddresses belong to the same hosting provider as others previously identified as Volt Typhoon\nIoCs and both feature SSL certificates issued to jdyfj, the same subject that appeared in the\nSSL certificates at IP addresses Lumen previously named as part of the JDY cluster. Both\n45.63.60[.]39 and 45.32.174[.]131 are therefore likely previously unidentified parts of that cluster.\n\n\n-----\n\nAdditional activity involving 45.63.60[.]39 may further reflect behavior associated with Volt\n\nTyphoon. It and 67.205.139[.]175, a Tor exit node, communicated twenty-five times between\n\nDecember 28 and December 30. Previous reports have noted that Volt Typhoon has used Tor\n\nfor its C2 communications, so this traffic may reflect C2 communications between different\n\nVolt Typhoon-controlled resources (one routing traffic through Tor and the other hosted at\n\n45.63.60[.]39).\n\nSTRIKE Team researchers additionally observed four instances of communication between\n\n31.19.153[.]48, an IP address where SecurityScorecard’s data indicates another product\n\nVolt Typhoon has been observed exploiting, a DrayTek Vigor 2960 router, is in use and\n\n202.22.227[.]179 on November 18. Given that Volt Typhoon is known to compromise the\n\nspecific DrayTek and Cisco devices in use at 31.19.153[.]48 and 202.22.227[.]179, that\n\nthey were communicating with one another, and that 202.22.227[.]179 also communicated\n\nregularly with other Volt Typhoon-linked IP addresses, communications between these two IP\n\naddresses may also reflect Volt Typhoon activity, although it is not clear at present if the IP\n\naddresses represent infrastructure particular to Volt Typhoon.\n\nResearchers also collected and analyzed samples of traffic involving known Volt Typhoon\n\ninfrastructure, given that the behavior originating IP addresses named as Volt Typhoon-related\n\nIoCs could offer additional insights into the group’s activity. This sample led researchers\n\nto other IP addresses that may represent additional, previously unidentified Volt Typhoon\n\ninfrastructure. 144.202.49[.]189, an IP address Lumen identified as a proxy router for Volt\n\nTyphoon’s C2 communications, and 82.117.159[.]158, an IP address where SecurityScorecard’s\n\ndata indicates a Cisco router is in use, communicated 68,164 times between December 1 and\n\nDecember 7. Given the frequency of its communication with a known Volt Typhoon asset,\n\nand the observation of a product Volt Typhoon has been observed exploiting in use at it,\n\n82.117.159[.]158 may represent an additional Volt Typhoon-linked IoC.\n\nFIGURE 12:\n###### Communications between some targeted Cisco models and Volt Typhoon infrastructure.\n\n\n-----\n\nAs with the findings discussed previously, these communications may suggest that the botnet\nlinked to Volt Typhoon is more extensive than previously reported, as communications between\nknown IoCs linked to it and devices it is known to exploit could suggest compromise (and\nsubsequent malicious reuse) of those devices.\n\nThe payload server’s traffic sample, meanwhile, featured communication between it and\nfourteen IP addresses that appear to host routers and other devices like those listed in Lumen’s\nrecent report on the botnet Volt Typhoon has used from November 9th to December 18th. The\nuse of these devices and the IP addresses’ communication with the payload server, may, taken\ntogether, suggest that the following are the fourteen IP addresses also represent previously\nunpublished IoCs linked to the botnet identified by Lumen:\n\n\n\n- 192.149.47[.]110\n\n- 212.11.106[.]139\n\n- 89.203.140[.]246\n\n- 94.125.218[.]19\n\n- 183.82.110[.]178\n\n- 117.239.157[.]74\n\n- 210.212.224[.]124\n\n\n\n- 49.204.75[.]92\n\n- 61.2.141[.]161\n\n- 49.204.75[.]90\n\n- 114.143.222[.]242\n\n- 117.211.166[.]22\n\n- 49.204.65[.]90\n\n- 49.204.73[.]250\n\n\nWhile STRIKE Team researchers have not observed published vulnerabilities affecting the\nproducts at the IP addresses above in SecurityScorecard’s datasets, they did note that many\nof these products may be outdated. Twelve of the fourteen IP addresses above feature SSL\ncertificates for NETGEAR products issued in either 2007 or 2013. If these certificates’ issue\ndates are also an indication of their products’ age, it may suggest that these products have\n\nreached end-of-life. This may, in turn, reflect the previously published observation that Volt\nTyphoon and other threat actors using the newly-identified botnet appeared to be taking\nadvantage of the widespread use and easy accessibility of end-of-life SOHO devices.\n\nFIGURE 13:\n###### Geographical distribution of devices communicating\n with the payload server.\n\n\n-----\n\nIn order to identify additional, possibly-compromised infrastructure involved in the same\n\nactivity, researchers next filtered the traffic sample by product type and focused on IP\n\naddresses where the strategic partner furnishing the sample observed DrayTek routers,\n\ngiven that in one cluster of activity discussed in Lumen’s report, DrayTek devices comprised\n\ndistinct layers of infrastructure through which the threat actors tunneled traffic from other\n\ncompromised devices. This yielded the following IP addresses:\n\n\n\n- 112.120.122[.]88\n\n- 219.76.184[.]200\n\n- 14.224.157[.]129\n\n- 31.120.199[.]123\n\n- 110.175.91[.]70\n\n\n\n- 125.227.15[.]174\n\n- 37.224.98[.]249\n\n- 218.161.3[.]216\n\n- 82.69.127[.]130\n\n\nFinally, researchers collected separate traffic samples for each of the IP addresses where\n\nSecurityScorecard’s partner observed a DrayTek device and then compared these samples\n\nto identify IP addresses that recurred across them, as their recurrence may suggest that the\n\nIP addresses correspond to other layers in the same cluster of activity represented by the\n\nDrayTek routers should this group of DrayTek devices constitute such a layer. The following\n\nare the IP addresses that appeared in multiple DrayTek devices’ traffic samples:\n\n\n\n- 212.11.108[.]127\n\n- 212.11.107[.]193\n\n- 212.11.124[.]98\n\n\n\n- 129.132.120[.]59\n\n- 212.11.106[.]139\n\n- 147.87.210[.]109\n\n\n-----\n\n###### Potential Victimology\n\nSTRIKE Team researchers additionally observed communication between two Czech IP\n\naddresses that appeared in the payload server’s traffic sample and IP addresses hosting\n\nU.S. government domains. SecurityScorecard’s Attack Surface Intelligence tool indicates\n\nthat both Czech IP addresses host NETGEAR ProSAFE devices.\n\nFIGURE 14-15:\n###### Possibly end-of-life NETGEAR firewalls appear to be in use at both of the Czech IP addresses in question.\n\n\n-----\n\nThe recently published reports on new Volt Typhoon activity have noted that it exploited\n\nNETGEAR firewalls with some regularity. Given that SecurityScorecard’s data reflects the\n\nuse of NETGEAR products at the IP addresses observed and that the same IP addresses\n\nboth contacted a payload server previously linked to Volt Typhoon and other IP addresses\n\nhosting US government domains, these IP addresses may not only be previously unidentified\n\ncomponents of Volt Typhoon’s network of compromised devices, but may also reflect Volt\n\nTyphoon’s targeting of a U.S. and allied government entities.\n\nAn initial traffic sample for these two possibly compromised IP addresses reflected\n\ncommunication between them and seven IP addresses to which two different .gov domains,\n\nlogin[.]gov and login.gov.external-domains-production.cloud[.]gov, and one Australian\n\ngovernment domain, login.service.nsw[.]gov[.]au, resolved at the time of observation.\n\nA second, more recent traffic sample for these same two Czech IP addresses revealed\n\nrepeated communication between them and twenty-seven IP addresses hosting a total\n\nof sixty-nine U.S. U.K., Australian, and Indian government sites. Given that these domains\n\nappear to correspond to government assets and that Volt Typhoon has previously targeted\n\nU.S. government entities, this traffic may reflect additional targeting of the U.S. and allied\n\ngovernments by Volt Typhoon or a similar group, although it does not indicate a successful\n\ncompromise. It also bears noting that the IP addresses with which the possible Volt Typhoon\n\nassets communicated belong to cloud services and content distribution networks, so the\n\ngovernment domains are likely just a few of many that resolved to them within the observation\n\nperiod. That being the case, the possibility that the observed traffic involved other, non\ngovernment domains at the same IP addresses and therefore does not reflect targeting of\n\ngovernment assets also merits consideration.\n\nWhile public reporting on Volt Typhoon has not previously noted its targeting of Australian or\n\nU.K. government assets in addition to U.S. ones, such activity would be in keeping with PRC\n\nnation-state cyber activity more generally, as these countries’ roles in the Western alliance\n\nsystem (including their Five Eyes and AUKUS membership) have contributed to their frequent\n\ntargeting by China-linked APT groups.\n\n\n-----\n\n# Conclusion\n\n\nBlack Lotus Labs’ recent report assessed that the Volt Typhoon activity observed likely\n\nreflected the group’s development of new infrastructure in preparation for a period of\n\nrenewed activity. The communications between targeted models of Cisco routers and\n\nknown Volt Typhoon IoCs, which STRIKE Team researchers observed, suggests that these\n\npreparations are ongoing and extensive, as almost a third of the Cisco devices appearing in\n\nSecurityScorecard’s dataset communicated with these IoCs in a seven-day period.\n\nSimilarly, the newly-identified IP addresses specified above that may represent new, Volt\n\nTyphoon-linked IoCs may offer further indication that the group’s preparation of new\n\ninfrastructure has continued. Given their communication with known Volt Typhoon IoCs and\n\nthe appearance of other Volt Typhoon-linked artifacts in SecurityScorecard’s scan data about\n\nthem, the STRIKE Team assesses with moderate confidence that the following IP addresses\n\nrepresent previously unidentified Volt Typhoon IoCs:\n\n\n\n- 45.63.60[.]39\n\n- 45.32.174[.]131\n\n- 82.117.159[.]158\n\n- 46.10.197[.]206\n\n- 176.102.35[.]175\n\n- 93.62.0[.]77\n\n- 194.50.159[.]3\n\n- 80.64.80[.]169\n\n- 24.212.225[.]54\n\n- 208.97.106[.]10\n\n- 70.60.30[.]222\n\n- 184.67.141[.]110\n\n\n\n- 89.203.140[.]246\n\n- 94.125.218[.]19\n\n- 183.82.110[.]178\n\n- 117.239.157[.]74\n\n- 210.212.224[.]124\n\n- 49.204.75[.]92\n\n- 61.2.141[.]161\n\n- 49.204.75[.]90\n\n- 114.143.222[.]242\n\n- 117.211.166[.]22\n\n- 49.204.65[.]90\n\n- 49.204.73[.]250\n\n\nWhile certain contextual factors (the use of devices Volt Typhoon has previously targeted and\ncommunication with other such devices, including some that in turn communicated with IP\naddresses linked to Volt Typhoon) may suggest that the other IP addresses discussed elsewhere\nin this document are involved in Volt Typhoon-linked activity, the available evidence does not\nappear, at present, to indicate that they represent Volt Typhoon-specific infrastructure.\n\n**Explore SecurityScorecard’s previous threat**\n**intelligence research on China-backed cyber activity:**\n\n[SecurityScorecard Identifies Possible Flax Typhoon Infrastructure](https://securityscorecard.com/research/securityscorecard-identifies-possible-flax-typhoon-infrastructure/)\n\n[STRIKE Team Investigation Identifies Possible Flax Typhoon Links to Higher Education](https://securityscorecard.com/research/strike-team-investigation-identifies-possible-flax-typhoon-links-to-higher-education/)\n\n\n-----\n\n###### To learn more and create your free account, visit\n SecurityScorecard.com\n\n**ABOUT SECURITYSCORECARD**\n\nFunded by world-class investors, including Evolution Equity Partners, Silver Lake Partners,\n\nSequoia Capital, GV, Riverwood Capital, and others, SecurityScorecard is the global leader\n\nin cybersecurity ratings, response, and resilience, with more than 12 million companies\n\ncontinuously rated.\n\nFounded in 2013 by security and risk experts Dr. Aleksandr Yampolskiy and Sam Kassoumeh,\n\nSecurityScorecard’s patented rating technology is used by over 25,000 organizations for\n\nenterprise risk management, third-party risk management, board reporting, due diligence,\n\ncyber insurance underwriting, and regulatory oversight.\n\nSecurityScorecard makes the world safer by transforming how companies understand,\n\nimprove, and communicate cybersecurity risk to their boards, employees, and vendors.\n\nSecurityScorecard achieved the Federal Risk and Authorization Management Program\n\n(FedRAMP) Ready designation, highlighting the company’s robust security standards to\n\nprotect customer information, and is listed as a free cyber tool and service by the U.S.\n\nCybersecurity & Infrastructure Security Agency (CISA). Every organization has the universal\n\n[right to its trusted and transparent Instant SecurityScorecard rating. For more information,](https://securityscorecard.com/free-account/)\n\n[visit securityscorecard.com or connect with us on LinkedIn.](httpS://securityscorecard.com)\n\n**SecurityScorecard.com** United States: (800) 682-1707\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.securityweek.com/wp-content/uploads/2024/01/Volt-Typhoon.pdf"
    ],
    "report_names": [
        "Volt-Typhoon.pdf"
    ],
    "threat_actors": [
        {
            "id": "846522d7-29cb-4a0c-8ebe-ffba7429e2d7",
            "created_at": "2023-06-23T02:04:34.793629Z",
            "updated_at": "2025-03-27T02:02:10.204744Z",
            "deleted_at": null,
            "main_name": "Volt Typhoon",
            "aliases": [
                "Bronze Silhouette",
                "Dev-0391",
                "Insidious Taurus",
                "Redfly",
                "Storm-0391",
                "UNC3236",
                "VOLTZITE",
                "Vanguard Panda"
            ],
            "source_name": "ETDA:Volt Typhoon",
            "tools": [
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "Living off the Land"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "09031838-56db-4676-a2b2-4bc50d8b7b0b",
            "created_at": "2024-01-23T13:22:35.078612Z",
            "updated_at": "2025-03-27T02:00:03.285024Z",
            "deleted_at": null,
            "main_name": "Flax Typhoon",
            "aliases": [
                "Ethereal Panda",
                "Storm-0919"
            ],
            "source_name": "MISPGALAXY:Flax Typhoon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "86c7abc2-1b71-4665-b9e3-1594d6d15a4a",
            "created_at": "2023-09-07T02:02:47.367254Z",
            "updated_at": "2025-03-27T02:02:09.903407Z",
            "deleted_at": null,
            "main_name": "Flax Typhoon",
            "aliases": [
                "Ethereal Panda",
                "RedJuliett"
            ],
            "source_name": "ETDA:Flax Typhoon",
            "tools": [
                "BadPotato",
                "CHINACHOPPER",
                "China Chopper",
                "JuicyPotato",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Metasploit",
                "Mimikatz",
                "SinoChopper",
                "SoftEther VPN"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "382f2519-30b3-4943-b494-2d675bc2b38f",
            "created_at": "2024-06-19T02:03:07.951514Z",
            "updated_at": "2025-03-27T02:05:17.287489Z",
            "deleted_at": null,
            "main_name": "BRONZE SILHOUETTE",
            "aliases": [
                "Volt Typhoon "
            ],
            "source_name": "Secureworks:BRONZE SILHOUETTE",
            "tools": [
                " Web shells",
                "Living-off-the-land binaries"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4ed2b20c-7523-4852-833b-cebee8029f55",
            "created_at": "2023-05-26T02:02:03.524749Z",
            "updated_at": "2025-03-27T02:00:03.132087Z",
            "deleted_at": null,
            "main_name": "Volt Typhoon",
            "aliases": [
                "VANGUARD PANDA",
                "UNC3236",
                "Insidious Taurus",
                "VOLTZITE",
                "Dev-0391",
                "Storm-0391",
                "BRONZE SILHOUETTE"
            ],
            "source_name": "MISPGALAXY:Volt Typhoon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a88747e2-ffed-45d8-b847-8464361b2254",
            "created_at": "2023-11-01T02:01:06.605663Z",
            "updated_at": "2025-03-27T02:00:55.42808Z",
            "deleted_at": null,
            "main_name": "Volt Typhoon",
            "aliases": [
                "Volt Typhoon",
                "BRONZE SILHOUETTE",
                "Vanguard Panda",
                "DEV-0391",
                "UNC3236",
                "Voltzite",
                "Insidious Taurus"
            ],
            "source_name": "MITRE:Volt Typhoon",
            "tools": [
                "netsh",
                "PsExec",
                "ipconfig",
                "Wevtutil",
                "VersaMem",
                "Tasklist",
                "Mimikatz",
                "Impacket",
                "Systeminfo",
                "netstat",
                "Nltest",
                "certutil",
                "FRP",
                "cmd"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1705629989,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1704886117,
    "ts_modification_date": 1704886131,
    "files": {
        "pdf": "https://archive.orkl.eu/bd5f452c410332144799a69916d68235facb063f.pdf",
        "text": "https://archive.orkl.eu/bd5f452c410332144799a69916d68235facb063f.txt",
        "img": "https://archive.orkl.eu/bd5f452c410332144799a69916d68235facb063f.jpg"
    }
}