{
    "id": "09d7550e-7dd8-48cd-a42c-af5b018b6e65",
    "created_at": "2023-01-12T15:00:18.891013Z",
    "updated_at": "2025-03-27T02:09:30.286022Z",
    "deleted_at": null,
    "sha1_hash": "7c8dff3ca2a89200c23b492ad3f794f9035fa90c",
    "title": "2020-12-01 - Dox, steal, reveal. Where does your personal data end up-",
    "authors": "",
    "file_creation_date": "2022-05-28T01:23:18Z",
    "file_modification_date": "2022-05-28T01:23:18Z",
    "file_size": 1116108,
    "plain_text": "# Dox, steal, reveal. Where does your personal data end up?\n\n**securelist.com/dox-steal-reveal/99577/**\n\nAuthors\n\n[Dmitry Galov](https://securelist.com/author/dmitrygalov/)\n\n[Vladislav Tushkanov](https://securelist.com/author/vladislavtushkanov/)\n\n[Leonid Bezvershenko](https://securelist.com/author/leonidbezvershenko/)\n\nThe technological shift that we have been experiencing for the last few decades is\nastounding, not least because of its social implications. Every year the online and offline\nspheres have become more and more connected and are now completely intertwined,\nleading to online actions having real consequences in the physical realm — both good and\nbad.\n\n\n-----\n\nOne of the most affected areas in this regard is communication and sharing of information,\nespecially personal. Posting something on the internet is not like speaking to a select club of\nlike-minded tech enthusiasts anymore — it is more akin to shouting on a crowded square.\nThis gives rise to many unique threats, from cyberbullying and simple financial scams to\nspear phishing and social engineering attacks on business executives and government\nofficials. And while awareness of privacy issues is increasing, much of the general public still\nonly have a basic understanding of why privacy matters.\n\nUnfortunately, even if we take good care of how and with whom we share our personal data,\nwe are not immune from being doxed. The abusers may be motivated enough to go beyond\ngathering data available in the public domain and turn to the black market in the hope of\nfinding personal information that will do real harm, for instance, gaining access to social\nmedia accounts. In this report, we will dig deeper into two major consequences of (willing\nand unwilling) sharing personal data in public — doxing (the public de-anonymization of a\n[person online) and the selling of personal data on the dark web — and try to untangle the](https://encyclopedia.kaspersky.com/glossary/darknet/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\nconnection between the two. We’ll’ also look at how these phenomena affect our lives and\nwhat challenges these conditions present to users.\n\n**Key findings**\n\nDoxing is not something that only vulnerable groups or people with specific\nprofessions, such as journalists or sex workers, can be affected by. Anyone who voices\nan opinion online may potentially become a victim of doxing.\nAlmost any public data can be abused for the purpose of doxing or cyberbullying with\nan unlimited number of ways users can be harmed by their own data.\nWith increasing digitization of most aspects of our everyday lives, even more data is\nnow shared with organizations and may end up in the hands of criminals. This now\nincludes personal medical records and selfies with personal identification documents.\nAccess to personal data can start from as low as US$0.50 for an ID, depending on the\ndepth and breadth of the data offered.\nSome personal information is as much in demand as it was almost a decade ago –\nprimarily credit card data and access to banking and e-payment services. The cost of\nthis type of data has not fallen over time and that is unlikely to change.\nData sold on dark market websites can be used for extortion, executing scams and\nphishing schemes and direct stealing of money. Certain types of data, such as access\nto personal accounts or password databases, can be abused not just for financial gain\nbut also for reputational harm and other types of social damage including doxing.\n\n## Unwanted spotlight: doxing\n\nThe increasing political and social division of recent years combined with a perceived\nanonymity exacerbates some of the corresponding social dangers on the internet, such as\ntrolling and cyberbullying. And at the intersection with privacy threats there is the issue of\n\n\n-----\n\ndoxing.\n\n### What is doxing?\n\nHistorically, doxing (also spelled doxxing) meant de-anonymizing a person on the internet,\nespecially in early hacker culture, where people preferred to be known by their nickname\n(online handle). The meaning has evolved, however, to have a [broader sense.](https://dictionary.cambridge.org/dictionary/english/doxing)\n\nDoxing is, in a way, a method of cyberbullying. It occurs when a person shares some private\ninformation about another person without their consent to embarrass, hurt or otherwise put\nthe target in danger. This can include sharing:\n\nembarrassing photos or videos;\nparts of private correspondence, probably taken out of context;\na person’s physical address, phone number, private email address and other private\ncontacts;\noccupation and job details;\nmedical or financial data, criminal records.\n\n_EXAMPLE: An example of a threat of doxing in this classic sense is the story of the_\n_anonymous blogger Slate Star Codex, who claimed that a New York Times journalist insisted_\n_on publishing his real name in a piece about him. This prompted the blogger to delete his_\n_[blog. Luckily, the newspaper seems to have abandoned the idea.](https://slatestarcodex.com/2020/09/11/update-on-my-situation/)_\n\nDoxing also includes cases when data about the victim is already publicly available, but a\nperpetrator gathers and compiles it into an actionable “report”, especially if also inciting other\npeople to act on it. For example, if a person voices an opinion on a divisive issue in a post on\na social network, throwing in their phone number in the comments and suggesting people\nshould call them at night with threats is still doxing, even if the phone number is available\nonline in some database or on some other social network.\n\n_EXAMPLE: A journalist from Pitchfork, a US music outlet, received numerous threats on_\n_Twitter including suggestions to “burn her house” after her phone number and home address_\n_were published by Taylor Swift fans who_ _[were unhappy about a review of the singer’s latest](https://www.thedailybeast.com/taylor-swift-remains-silent-as-fans-doxx-and-harass-music-critic-over-folkore-review)_\n_album that wasn’t positive enough._\n\n### Why is doxing dangerous?\n\nCompared to the physical world, information on the internet can spread very quickly and is\nalmost impossible to remove once posted online. This makes doxing even more harmful.\n\nThe most common goal of doxing is to cause a feeling of stress, fear, embarrassment and\nhelplessness. If you are caught in a heated argument on Twitter, and somebody posts your\nhome address and suggests that people should hurt you, it naturally causes anxiety. Threats\n\n\n-----\n\n[can also be directed at your relatives. The real danger, however, comes if someone decides](https://www.amnesty.org/en/latest/research/2018/03/online-violence-against-women-chapter-3/)\nto actually carry out the threats, which means doxing also threatens your physical safety —\nsomething that happens more often than you would think.\n\nBesides posting your information online for everyone to see, attackers can share it in a\ntargeted way with your relatives, friends or employer, especially if it is embarrassing. This\ncan harm the victim’s relationships with their loved ones, as well as their career prospects.\n\n_EXAMPLE: After a service for finding people using only a photo gained popularity in VK, a_\n_popular social network in Russia, it was used to de-anonymize women who starred in porn_\n_[movies or worked in the sex industry. The perpetrators specifically suggested sharing this](https://paperpaper.ru/papernews/2016/04/20/findface-porn/)_\n_information with their relatives. One of the victims was a school teacher who eventually lost_\n_her job._\n\n### Doxing scenarios\n\nHow can you be doxed? These are some common scenarios and how they can harm the\nvictim:\n\nIdentifying the user and sharing information directly with their employer, which results in\nthe person getting fired due to social pressure;\nLeaking intimate photo and video content of a user to the public — an activity that is\noften called ‘revenge porn’ is a widespread method of attacking one’s privacy with\nmalicious intent that can have significant consequences for the victim;\nRevealing the identity of anonymous bloggers, internet users, opinion leaders and\ncreators, which can lead to real danger if the victim is in a hostile environment, for\ninstance, opposition bloggers in certain countries or a person who supports\nunconventional views;\nOuting the person and providing their personal details in the media when this\ninformation does not serve the public interest and may directly harm the person;\nGathering and sharing information about the account of a specific person (the potential\nvictim) featured in sensitive or questionable content with hostile groups or accounts\nthat may engage in online or even offline violence against that person.\n\n### Social impact\n\nDoxing is a very pressing matter in times of increasing social and political division. Doxing,\nas well as the threat of doxing, hampers freedom of speech and produces a chilling effect. It\nprevents people from voicing their opinions, which is harmful to democracy and healthy\nsocial debate.\n\n[Some people are more likely to be victims of doxing. Journalists, bloggers, activists, lawyers,](https://www.theguardian.com/world/2018/jun/14/doxxing-assault-death-threats-the-new-dangers-facing-us-journalists-covering-extremism)\nsex industry workers, law enforcement officers all run a higher risk of being doxed. For\n[women, doxing goes hand in hand with sexualized verbal abuse and threats. For law](https://www.amnesty.org/en/latest/research/2018/03/online-violence-against-women-chapter-1/)\n\n\n-----\n\nenforcement officers, it also [means direct danger for their physical safety, especially for](https://krebsonsecurity.com/2020/06/blueleaks-exposes-files-from-hundreds-of-police-departments)\nundercover officers. This can lead people to abandon their jobs.\n\nHigh-profile internet personas are more at risk than average users. It doesn’t mean that\n“ordinary” people are safe from doxing. Having said something online or done something on\ncamera that “upsets” a large group of people can randomly attract excessive attention from\nonline crowds and turn your life into a nightmare — even if you never actually said or did it in\nthe first place.\n\n_EXAMPLE: Tuhina Singh, a CEO of a Singapore company was doxed: her phone number_\n_and private email address were published online, resulting in insults and threats. Reason?_\n_She_ _[was misidentified as a woman from a viral video, refusing to put on a mask amidst the](https://www.newyorker.com/magazine/2020/09/28/the-public-shaming-pandemic)_\n_coronavirus pandemic._\n\n## The darknet database. How much do you cost?\n\nDoxing is the result of abusing information that is available in the public domain and not used\nfor financial gain. However, the threats to personal data and, hence, personal safety, do not\nend there. Aside from the publicly available data that we freely share and that can be\ngathered by anyone and used for malicious purposes, the organizations we share our data\nwith don’t always handle it responsibly.\n\nBy definition, we do not expect this information to leak out into the public and even if it does,\n[do not anticipate that it might harm us. According to recent research by Kaspersky, 37% of](https://www.kaspersky.com/about/press-releases/2020_too-boring-to-hack-a-third-of-millennials-think)\nmillennials think they are too boring to be the victim of cybercrime. The number of massive\ndata leaks hit a new high this year and we no longer get surprised by yet another company\nbeing hacked and their customers’ data being leaked or used in ransom demands.\n\nEfforts to better protect personal data are being made in a variety of countries, with\ngovernments imposing new directives to ensure protection and penalize irresponsible\nmanagement of citizens’ data. New personal information protection directives such as the\nGeneral Data Protection Regulation (GDPR) in the EU and Brazilian General Data Protection\nAct (LGPD), as well as increasing customer scrutiny towards data handling practices, have\nforced organizations to improve their security and take the data leakage threat more\nseriously.\n\nHowever, that doesn’t mean the data is safe. In some cases, stolen data is used for ransom\npractices, in others it is published out in the open. Sometimes it is a mix of both: threat actors\n[who employed the Maze ransomware published stolen data if they did not succeed in getting](https://securelist.com/maze-ransomware/99137/)\nthe ransom money. But most of it ends up on the dark web as a commodity, and a very\naccessible one. Darknet forums and markets, essentially marketplaces for illegal physical\nand digital goods, are used by cybercriminals to sell services and products, from malware to\npersonal data.\n\n\n-----\n\nOur experts, who specialize in understanding what goes on in the dark web, researched the\ncurrent state of data as a commodity on such platforms to find out what kind of personal data\nis in demand, what it is used for and how much it costs.\n\n### Methodology\n\nFor the purposes of this research we analyzed active offers on 10 international darknet\nforums and marketplaces that operate in English or Russian. The sample included posts that\nwere shared during the third quarter of 2020 and that are still relevant.\n\n### Research findings – how much do you cost?\n\nCovering all types of personal data offers on the dark web would turn this report into a short\nbook, so it focuses on just some of the most popular categories available on dark markets.\nHowever, it is important to mention that the types of databases leaked and then sold on the\ndark web vary, which is unsurprising considering they are stolen from different institutions\nand organizations. Leaked databases can be cross-referenced and this way made even\nmore valuable, as they present a fuller picture of a subject’s personal details. With that in\nmind, let’s dig into what is out there in the shadows that cybercrooks might have on you:\n\n**ID card data: $0.5 – $10**\n\nIdentity documents or ID cards are the main means of identification in most countries,\nincluding the US and throughout Europe. Usually they are tied to the most important\nservices, especially state services and contain sensitive information such as social security\nnumber (SSN) in the US. Though important, the cost of these documents on the black\nmarket is not that high and depends on how full the information is. For instance, information\nwith a full name and insurance number will cost as little as $0.50 per person, while the price\nfor a ‘full pack’ including ID number, full name, SSN, date of birth (DOB), email and mobile\nphone can reach up to $10 per person. The price also varies depending on the size of the\npurchase – data sold in bulk is cheaper per unit.\n\n\n-----\n\n**_Purchasing 150 ID cards will cost as little as 50 cents per unit_**\n\nData from identity documents can be used for a variety of scams, filling out applications for\nspecific services and gaining access to other sensitive information that can later be used for\ncriminal purposes.\n\n**_Sometimes the leaked databases contain much more than just ID info_**\n\n**Passport scans: $6 – $15**\n\n\n-----\n\nPassports are another type of identification document that are popular with cybercriminals. In\nsome countries such as Russia, Ukraine and other former Soviet states they are used\ninstead of IDs and are required to receive pretty much any government-related or financial\nservice – from filing a complaint in a shop to taking out a loan. In other countries, passports\ncan also be used for identification on international platforms such as cryptocurrency\nexchanges – or for international fraud.\n\nThis is the reason passport scans go around the web quite often – think of how many times\nyou have uploaded a copy of your passport to some service, sent it to an organization or\nallowed them to scan it themselves.\n\nPassport scans are more expensive than identification details with prices varying from $6 to\n$15 depending on the quality of the scan and the country of origin. Typically, there are two\ntypes of passport scans sold – a scan of the first page which, understandably, is cheaper\nthan a scan of a full passport.\n\n\n-----\n\n**_Passport copies for purchase can be selected by gender if required_**\n\n**Driver’s license scans: $5 – $25**\n\nDriver’s licenses are another type of identification document that is in demand in the\nshadows, primarily due to the growing number of services that one can register for using a\ndriver’s ID. Typically, the information sold on forums includes a scan of the license with full\ninformation. Varying in price from $5 to $25, these can be used by cybercriminals for car\nrental, as an ID for local services or insurance fraud.\n\n**Selfie with documents: $40 – $60**\n\n\n-----\n\nHave you ever taken a selfie with your passport or ID? User identification is taken more\nseriously these days with organizations adhering to so-called know-your-customer (KYC)\nprograms that require identity verification for various operations. For instance, cryptocurrency\nexchanges employ this practice to prevent money laundering by getting people extracting\nfunds to confirm they are who they say they are. Social networks require selfies with\ndocuments when users need to recover access to their account and bank employees take\npictures like these when delivering credit cards to clients’ homes.\n\nUsing stolen passport or ID selfies allows fraudsters to bypass KYC guidelines and continue\nto launder money. These documents can also be used for a whole variety of services – from\ncar rentals to getting micro-loans or manipulating insurance companies. Such documents\nallow cybercriminals to enter the cache or execute their schemes, and even blackmail the\npeople identified in these documents. As a result, this data is very valuable, varying from $40\nto $60 per person.\n\n**_Selfies with identification documents can be used to bypass a service’s security_**\n**_procedures_**\n\n**Medical records – $1 – $30**\n\nThe world is becoming more digitized along with certain aspects of our lives that we never\nthought would go online. Take medical records, for instance – cybercriminals have laid their\n[hands on them too. Looking back to 2012, when we analyzed different types of data](https://www.kaspersky.com/blog/windows-in-the-eye-of-a-cyber-storm/845/)\navailable in the darknet, medical data was not even a thing. Now, however, this data is in\ndemand as it can be used for a whole variety of fraudulent activities from obtaining health\ninsurance services to purchasing regulated drugs. It can also be used to demand ransom.\n\n\n-----\n\n[Recently, for instance, Vastaamo, a Finnish mental health organization, was hacked and the](https://www.theguardian.com/world/2020/oct/26/tens-of-thousands-psychotherapy-records-hacked-in-finland)\ndata of their patients, including children, stolen and later exposed on dark web markets, with\nat least two thousand patients affected. The hackers initially demanded a ransom payment to\ndelete the information, but then switched their attention directly to the patients.\n\nLeaks of medical information can become very unpleasant as they put the victims who are\nalready vulnerable into an even more vulnerable position. The type of data shared on the\ndarknet varies from a medical form with a full name, email, insurance number, and the name\nof the medical organization to a full medical record of a patient – with their medical history,\nprescriptions and more.\n\n**_Medical records sold on darknet forums can vary from full information about a person_**\n**_to forms from medical institutions_**\n\n**Credit card details: $6 – $20**\n\nCredit card details fall under the category of most basic information stolen and used by\ncybercriminals. Full credit card information including the name, number and CVV code can\nbe used to withdraw funds or purchase goods online and is valued from $6 to $20 per unit.\nBack in 2012, our evaluation put the price at $10. On average, the cost is more or less the\nsame. The price for such data is dictated by the country of origin, the bank and more\nimportantly, on how large the purchase is, with ‘better’ value with larger volume purchases.\nOf course, new anti-fraud banking systems are making life harder for cybercriminals, forcing\nthem to constantly come up with new ways to cash out. Nevertheless, with credit card details\nbeing the starting point for most of these schemes, they are nowhere near becoming\noutdated.\n\n\n-----\n\n**Online banking and PayPal accounts: $50 – $500**\n\nAnother type of financial data is online banking access and PayPal account information. Both\nprovide direct access to the funds of the victims with PayPal being a sweet spot for the\ncybercriminals who want to launder their money and withdraw it without any security checks.\nAccess to online banking is generally valued at between one and 10 percent of the funds\navailable in the account, while PayPal accounts cost from $50 to $500 depending on the\navailable credit and previous user operations.\n\n**Subscription services: $0.50 – $8**\n\nIn the world of subscription-based entertainment, access to popular streaming, gaming or\ncontent platforms is in high demand. While little personal information is given away, losing\naccess to one’s account on Netflix, Twitch or PornHub is not something that anyone would\nenjoy. Stolen subscription service credentials are not only sold on only in the dark web – they\ncan be found in some shady regular forums too. The dark web usually has offers to purchase\naccess details in bulk, which can later be sold individually to multiple customers. The price\nfor access to such services varies from 50 cents to $8.\n\n**How much does your data cost?**\n\nCredit card details: **$6 – $20**\n\nDriver’s license scans: **$5 – $25**\n\nPassport scans: **$6 – $15**\n\nSubscription services: **$0.50 – $8**\n\nID (full name, SSN, DOB, email, mobile): **$0.50 – $10**\n\nSelfie with documents (passport, driver’s license): **$40 – $60**\n\nMedical records: **$1 – $30**\n\nOnline banking account: **1-10% of value**\n\nPayPal accounts: **$50 – $500**\n\n**Password databases**\n\n[Leaks of password databases are among the most widespread data leaks. From retail loyalty](https://www.kaspersky.com/blog/collection-numba-one/25403/)\ncards to logins for banks, such databases have been appearing on the dark web and even\non the normal web for years, and they have a tendency to be leaked into the public domain,\nrequiring very small payments to access them, or sometimes access to the data is entirely\nfree. While these databases are outdated for the most part, they still represent a real danger.\nUsers tend to use the same passwords across a number of platforms and accounts, often\n\n\n-----\n\ntying them all to the same email. Picking up the right password for a specific account is often\na matter of time and effort, and as a result, users are at risk of having more of their data\ncompromised – from their social network accounts to their personal email or private accounts\non adult websites. Access to other accounts can later be resold (as in the case of\nsubscription services) or used for blackmail or scam.\n\n**_Certain services aggregate leaked passwords and enable paid subscription-based or_**\n**_single time access to their databases as shown on the screenshot. The service on the_**\n**_screenshot allows one database check for 30 coins_**\n\n**Unauthorized access to email and social media: $400 – $800**\n\nWith so much personal data available for sale, one may wonder whether purchasing access\nto someone’s email or social network account is also as easy as obtaining IDs. The darknet\noperators do indeed offer to hack into specific accounts or emails, charging from $400 per\naccount. However, the methods employed by those who offer such services are rather basic\n– they can only go as far as trying to guess the password or checking the account against\n[existing leaked databases or executing social engineering attacks to get the user to reveal](https://encyclopedia.kaspersky.com/glossary/social-engineering/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation%0A)\ntheir password. Increased security of social media and email services has also made these\npractices less successful with double authentication and various other security measures\nprotecting users better than before. As a result, most of these kinds of offers on dark markets\nare, ironically enough, actually scams against other cybercriminals.\n\n\n-----\n\n**_Examples of forum advertisements offering to hack social media accounts and emails_**\n\nNevertheless, this doesn’t rule out the possibility of real targeted account hacking – more\ncovert, technically complex methods are employed by experienced actors and these services\nusually cost a lot. For instance, the actor may identify a specific email of the potential victim,\nsend a spear-phishing email prompting the target to download malware that will be able to\ncollect information about the passwords and ultimately gain access to the targeted accounts.\nThese services, however, are extremely expensive, time consuming and are usually\nexecuted by advanced threat actors against priority targets.\n\n## Key takeaways\n\nIn the course of this research we have witnessed a number of trends relating to stolen and\nrepurposed personal data. Some personal information remains as much in demand as it was\nalmost a decade ago – primarily credit card data and access to banking and e-payment\nservices. The cost of this type of data has not fallen over time and that is unlikely to change.\n\nAnother big change is the type of data now available for sale. With the digitization of medical\ninstitutions, personal medical records traditionally categorized as very sensitive information\nbecame available for the public and cybercriminals to use and abuse for financial gain. The\ncurrent development and spread of telemedicine in the world is unlikely to decrease this\n[trend, although, we hope that after recent cases such as the Vastaamo hack, medical](https://www.theguardian.com/world/2020/oct/26/tens-of-thousands-psychotherapy-records-hacked-in-finland)\norganizations will approach data collection and security with greater responsibility.\n\nThe growth in the number of photos of people with documents in their hand and various\nschemes exploiting them also reflects a trend in the cybergoods game and indicates that any\ndata shared, even with organizations, can potentially end up in the hands of cybercrooks and\nabused for the purposes of financial gain. The repercussions of such data abuse are very\nreal for the victims as they will have to deal with the loans taken out in their name or services\nused on the basis of their identity.\n\n\n-----\n\nAt the same time, there is some good news when it comes to the safety of personal accounts\nand gaining access to specific emails and social media accounts. With improved security\nmeasures employed at the industry level, targeting and hijacking a specific individual’s\naccount is very costly, and in most cases, not doable. In this sphere there is evidence of an\ninteresting dynamic of cybercriminals scamming each other, with most cybercrooks unable to\ndeliver what they advertise. That does not, however, eliminate the threat entirely: provided\nthey have the funds and their order is big enough, the criminals may still be able to buy what\nthey want.\n\nThe overview of the types of data available on dark markets suggests that at least some of\nthe offers might be of interest to especially determined doxers. While we believe that such\ncases are unlikely due to their cost right now, things might change depending largely on the\ndetermination of the abusers to dox an individual.\n\n## Protecting your data and yourself\n\nWith our ever-growing online presence and footprint, it is almost impossible to be completely\nanonymous online. A determined person with some computer skills, especially if they have\naccess to privileged information (say, a private investigator or a law enforcement officer), will\nfind at least some data about you given enough time.\n\n_EXAMPLE: Kevin Mitnick shares a story in his book “The Art of Invisibility” about how he_\n_managed to find out the SSN, city of birth and the mother’s maiden name of a reporter who_\n_thought she had a very minimal online presence (he did it with her consent). To do so, he_\n_used his access to a specialized web resource for private investigators. People who usually_\n_enjoy privacy can also be tracked to their homes if you have specific data: a geolocation_\n_dataset from a marketing company obtained by the New York Times in 2019 showed the_\n_GPS location over time of senior US government officials, policemen and even_\n_acquaintances of Johnny Depp and Arnold Schwarzenegger._\n\nThis means that online privacy is almost always about assessing the risks that you face and\ntaking appropriate measures to mitigate them. If you think you might anger a few low-caliber\nonline trolls with a tweet, it is enough to hide your email address from your social network\nprofile. If you are a political reporter covering extremist movements, you need more control of\nyour digital footprint. Below, we describe a few basic steps that will be sufficient against\ndoxing for an average internet user.\n\n## Know what they know\n\nThe first thing to do if you want to protect yourself against doxing is to research what the\nInternet knows about you. Try googling your name, combine it with some other data about\nyou such as your place of residence or year of birth to narrow down the results. Try\nsearching for your online handles and emails as well. If your name is not very popular, you\ncan even subscribe to notificationы from Google in case it pops up somewhere on the web\n\n\n-----\n\nApart from Google, there are so-called people search engines such as BeenVerified that\nallow background checks to be conducted on people using open web data or government\nrecords. Publishing this kind of information online might be illegal depending on the country,\nso availability of such websites differs in various jurisdictions.\n\nIf you have public social media profiles, review the posts. Check if they contain geotags with\nplaces that you frequent, such as your home or office, or photos that can reveal their\nlocation. Of course, not all photos are dangerous, but the more specific they are, the more\nrisk they carry. Scout your older posts for some more private data, such as names of your\nfamily members. If you have a private profile, check if you actually know all the people in\nyour friend list.\n\nRemember that, besides social networks per se, there are many other applications that have\na social component and can reveal information about you, ranging from languages that you\nlearn to your [level of sexual activity. Pay special attention to apps that record some sort of](https://www.forbes.com/sites/kashmirhill/2011/07/05/fitbit-moves-quickly-after-users-sex-stats-exposed/)\ngeodata, such as fitness tracking applications. Check that your account in such apps is\nprivate.\n\n_EXAMPLE: In 2018, a security researcher noted that there were spots with a high level of_\n_activity in a dataset of user activity in Strava, a fitness app, in the Middle East. These spots,_\n_[cross-referenced with Google Maps, gave away the location of US military bases in the](https://www.wired.com/story/strava-heat-map-military-bases-fitness-trackers-privacy/)_\n_region._\n\nFinally, check if your data was leaked in data breaches. Leak monitoring is usually built into\npassword managers and web browsers, but you can also use a dedicated service like\nHaveIBeenPwned. If your email is found in a leak, you can assume that any other\ninformation from the breached info is available somewhere (e.g. your home address if the\nbreached service is a web store, or your favorite running routes if it is a fitness tracker).\n\n## Remove what you can\n\nIf you think that the information about you on the internet can be used against you, try to get\nrid of it. In the case of social networks, it is usually relatively easy: you either remove the\nposts with private data or make your profile private.\n\nWith other websites, check if you can just remove or disable your account. Otherwise, check\nif the website has a complaint or information removal form and use it. If not, try to contact the\nadministrators directly. If your jurisdiction has strict data privacy laws, such as GDPR or\nCCPA, it is easier for a service to just remove your data than face a regulator and the threat\nof huge fines.\n\nIf some information is impossible to remove from the source, you can ask the search engine\nto remove links to websites containing your private data from search results by exercising the\nso-called right to be forgotten. Whether you can do so depends on the search engine and\n\n\n-----\n\njurisdiction.\n\n_EXAMPLE: One of our researchers uses a smart watch with an application that traces his_\n_physical activity and helps him monitor his progress when jogging. One day he was_\n_approached by another runner that he didn’t know. Turns out the guy knew his name and_\n_where he runs – all thanks to this application, which did not only tracked his data but also_\n_shared it in its internal social network. While this strange occurrence didn’t result in any harm_\n_and the intention of the application was to help fellow runners meet each other, it is clear how_\n_knowledge of someone’s location and regular jogging route could be used against them –_\n_possibly by less friendly strangers._\n\n## Protect yourself\n\nDoxing is most devastating when the data being published is private, i.e., cannot be found on\nthe internet. An adversary can obtain this data by hacking into the accounts and services that\nyou use. To minimize the risks of being hacked, follow these simple rules:\n\nNever reuse your passwords across accounts. Use a unique password for each\naccount and a password manager to store them.\nProtect your devices with fingerprint/face scan or with a PIN or password.\nUse two-factor authentication. Remember that using an application that generates onetime codes is more secure than receiving the second factor via SMS. If you need\nadditional security, invest in a hardware 2FA key.\nBeware of phishing email and websites.\n\nIf you are ready to invest a bit more effort into protecting your privacy, here are some\nadditional ways to protect your personal information or check if your passwords or data have\nbecome compromised without your knowledge:\n\nThink twice before you post on social media channels. Could there be unforseen\nconsequences of making your views or information public? Could content be used\nagainst you or to your detriment now or in the future?\nTo make sure people close to home, including family, friends or colleagues, can’t\naccess your devices or accounts without your consent, never share passwords even if\nit seems like a good idea or convenient to do so. Writing them on a sticky note next to\nyour screen might be helpful for you, but it may also help others to access things you\ndon’t want them to.\nEnsure you always check permission settings on the apps you use, to minimize the\nlikelihood of your data being shared or stored by third parties – and beyond – without\nyour knowledge. You might end up giving consent by default, so it is always worth\ndouble-checking before you start using an app or service.\nThere is no substitute for strong and robust passwords. Use a reliable security solution\nlike Kaspersky Password Manager to generate and secure unique passwords for every\naccount, and resist the temptation to re-use the same one over and over again.\n\n\n-----\n\nPassword managers also allow personal data to be stored in an encrypted private vault\nwhere you can upload your driver’s licenses, passports/IDs, bank cards, insurance files\nand other valuable documents and manage them securely.\nTo find out if any of the passwords you use to access your online accounts have been\ncompromised, use a tool such as Kaspersky Security Cloud. Its Account Check feature\nallows users to inspect their accounts for potential data leaks. If a leak is detected,\nKaspersky Security Cloud provides information about the categories of data that may\nbe publicly accessible so that the individual affected can take appropriate action.\n\n## When it is too late\n\nIf you have fallen victim to doxing, you can try to contact the moderators of the website\nwhere your data was leaked or flag the posts with your data on the social network to have it\nremoved before the information spreads.\n\nNote that usually the goal of doxers is to cause the victim stress and psychological\ndiscomfort. Do not engage with trolls, make your accounts private and seek comfort with\nyour friends, relatives and offline activities. It takes a short time for an online mob to give up\non their victim and move on if you do not give them additional reasons to attack you.\n\nHowever, if you receive threats or fear for your physical safety, you might want to contact law\nenforcement. In this case, remember to document what is going on, for example screenshot\nthe threats, to provide law enforcement officers with additional evidence.\n\n## To sum up: take good care of yourself and your data\n\nThe digital world provides us with endless opportunities to express our individuality and\nshare our stories, but we need to make sure it is a safe place to express ourselves. As this\nresearch shows, our data is valuable not only to us but to many other users with malicious\nintentions – ranging from an expression of dissatisfaction with your actions to cybercriminals\nwho thrive on profiting off personal data. That’s why it’s crucial to know how to protect it.\n\nAn important point to remember here is that cybercriminals are not the only ones who can\nuse our data to cause harm – with new phenomena such as doxing, users need to be aware\nthat they can never know how someone can capitalize on their data. Approaching personal\ndata sharing with responsibility is a must-have skill nowadays that will help keep us safer in\nthe storms of the digital world.\n\n[Cyberbullying](https://securelist.com/tag/cyberbullying/)\n[Cybercrime](https://securelist.com/tag/cybercrime/)\n[Darknet](https://securelist.com/tag/darknet/)\n[Data leaks](https://securelist.com/tag/data-leaks/)\n[Data Protection](https://securelist.com/tag/data-protection/)\n[Data theft](https://securelist.com/tag/data-theft/)\n\n\n-----\n\n[Doxing](https://securelist.com/tag/doxing/)\n\nAuthors\n\n[Dmitry Galov](https://securelist.com/author/dmitrygalov/)\n\n[Vladislav Tushkanov](https://securelist.com/author/vladislavtushkanov/)\n\n[Leonid Bezvershenko](https://securelist.com/author/leonidbezvershenko/)\n\nDox, steal, reveal. Where does your personal data end up?\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-01 - Dox, steal, reveal. Where does your personal data end up-.pdf"
    ],
    "report_names": [
        "2020-12-01 - Dox, steal, reveal. Where does your personal data end up-.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535618,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653700998,
    "ts_modification_date": 1653700998,
    "files": {
        "pdf": "https://archive.orkl.eu/7c8dff3ca2a89200c23b492ad3f794f9035fa90c.pdf",
        "text": "https://archive.orkl.eu/7c8dff3ca2a89200c23b492ad3f794f9035fa90c.txt",
        "img": "https://archive.orkl.eu/7c8dff3ca2a89200c23b492ad3f794f9035fa90c.jpg"
    }
}