{
    "id": "0a219511-aa82-40c5-b1fd-859a160032ba",
    "created_at": "2022-10-25T16:48:16.040764Z",
    "updated_at": "2025-03-27T02:17:11.458907Z",
    "deleted_at": null,
    "sha1_hash": "fb8c120e618cddb8c89a2a5469d7b9983a45b703",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-06-27T07:46:06Z",
    "file_modification_date": "2022-06-27T07:46:06Z",
    "file_size": 5590230,
    "plain_text": "# Overview of Russian GRU and SVR Cyberespionage Campaigns 1H 2022\n\n**[blog.bushidotoken.net/2022/06/overview-of-russian-gru-and-svr.html](https://blog.bushidotoken.net/2022/06/overview-of-russian-gru-and-svr.html)**\n\n[(Image credit: DALL·E 2)](https://twitter.com/shashj/status/1535765776686260224?s=20&t=zsth2aWSVb4Ru5y3TQTUXg)\n\n**Background**\n[In 2015 and 2016, the Democratic National Committee (DNC) was hacked by not one, but](https://intel471.com/blog/who-hacked-the-democratic-national-committee/)\ntwo Russian intelligence services, the Russian Main Intelligence Directorate (GRU) and\nthe Russian Foreign Intelligence Service (SVR). The two advanced persistent threat (APT)\ngroups attributed to these organizations coexisted inside the DNC's networks for months\nand provided valuable political intelligence to the Russian government, in the form of\nstolen files and emails, during the run-up to US presidential election. This audacious act\n[of cyber-espionage brought these two APT groups, also known as FancyBear and](https://malpedia.caad.fkie.fraunhofer.de/actor/sofacy)\n[CozyBear (coined by CrowdStrike), into the spotlight and under the microscope ever](https://malpedia.caad.fkie.fraunhofer.de/actor/apt_29)\nsince.\n\nOn 24 February 2022, Russia invaded Ukraine and these two well-known APT groups\n(among many others) have been busy launching widespread intelligence gathering\nintrusion campaigns to support the Russian government and Russian military. This blog\naims to leverage open source intelligence (OSINT) reports to highlight the recent\npublicly-known tactics, techniques, and procedures (TTPs) leveraged by these cyber\nadversaries in 1H 2022 and the significance of them. For many top enterprises,\ngovernment organizations, and political entities, these hacking groups operating on\nbehalf of the Russian GRU and SVR are priority threats whose capabilities is of the\nutmost concern.\n\n\n-----\n\n_Figure 1. Timeline of reports on FancyBear and CozyBear activities_\n\n**Russian GRU Unit 26165 (aka APT28, FancyBear, Strontium, Sofacy)**\n**activities in 1H 2022**\n\nOn 14 January, @billyleonard from the Google Threat Analysis Group (TAG)\n[reported that FancyBear was behind an ongoing credential phishing campaign](https://www.blogger.com/blog/post/edit/8860294626556920790/8906270951556492055#)\nfocused on Ukraine. The group leveraged *.eu3[.]biz, *.eu3[.]org,\nand blogspot[.]com hostnames as part of its phishing infrastructure.\n[On 7 March, Google TAG disclosed that FancyBear conducted several large](https://www.blogger.com/blog/post/edit/8860294626556920790/8906270951556492055#)\ncredential phishing campaigns targeting ukr[.]net users (UkrNet is a Ukrainian\nmedia company). This campaign included malicious links to blogspot[.]com sites\nthat redirected to credential harvesting pages hosted on *.frge[.]io. These phishing\nlinks were also sent from email accounts that had been compromised prior by the\nAPT group.\nOn 16 March, the Computer Emergency Response Team of Ukraine (CERT[UA) issued an alert that further highlighted how UAC-0028 (CERT-UA's name for](https://cert.gov.ua/article/37788)\nFancyBear) was phishing UkrNet accounts, but this this time the APT group used\nthe tinyurl[.]com URL-shortening service embedded inside a QR code the would\nlead to UkrNet credential havresting sites with *.frge[.]io and\n***.m.pipedream[.]net hostnames.**\nOn 7 April, the Microsoft Threat Intelligence Center (MSTIC) and the Microsoft\n[Digital Crimes Unit obtained a court order authorizing us to take control of seven](https://blogs.microsoft.com/on-the-issues/2022/04/07/cyberattacks-ukraine-strontium-russia/)\ninternet domains Strontium (Microsoft's name for FancyBear) used to conduct\n[phishing attacks against Ukrainian media organizations, as well as government](https://twitter.com/dacuddy/status/1512193359602888725)\ninstitutions and think tanks in the US and the EU involved in foreign policy.\n[On 27 April, Microsoft's Special Report on Ukraine revealed additional details on](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\nStrontium's campaigns:\n\nIn August 2021, Microsoft recorded Strontium targeting defense-related\norganizations in Ukraine.\n\n\n-----\n\nOn 4 March, Microsoft specifically noted that the network of the government\nof Vinnytsia (a city in west-central Ukraine) was also compromised by\nStrontium and that sought access via phishing to other Ukrainian military\npersonnel and regional Ukrainian government employee accounts.\nIn April, Microsoft observed Strontium and other suspected Russian nation\nstate threat actors launch campaigns against or expand on existing access in\nthe communications sector, targeting the IT infrastructure that supports the\nsector, and a major internet service provider (ISP).\n[On 3 May, Google TAG provided an update on cyber activity in Eastern Europe.](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/)\nFancyBear was observed targeting users in Ukraine with a new variant of infostealer\nmalware distributed via email attachments. The new FancyBear malware is a .NET\nexecutable that when ran by the victim steals cookies and saved passwords from\nChrome, Edge and Firefox browsers. The data is then exfiltrated via email to a\ncompromised email account.\n[On 6 May, CERT-UA issued an alert that UAC-0028 sent malicious emails posing as](https://cert.gov.ua/article/40102)\nCERT-UA and contained an attachment in the form of a password-protected RAR\narchive \"UkrScanner.rar\". Inside the RAR file was a Self-Extracting Archive (SFX)\nof the same name, which, in turn, contains a malware dubbed CredoMap. Data\ncollected by the malware was exfiltrated via HTTP POST requests to\n***.m.pipedream[.]net hostnames.**\n[On 20 June, CERT-UA warned of another UAC-0082 attack, this time pushing](https://cert.gov.ua/article/341128)\na malicious document called \"Nuclear Terrorism A Very Real Threat.rtf\" via email.\nIf opened, the document will download an HTML file with embedded JavaScript\n[code from a *.frge[.]io hostname that exploits CVE-2022-30190, a remote code](https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/)\nexecution (RCE) bug in the Microsoft Windows Support Diagnostic Tool (MSDT)\n[(aka the \"Follina\" exploit). If executed successfully by the victim, the exploit chain](https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e?gi=a71dbe8951c6)\ndownloads the CredoMap malware. The same incident was also analysed by\n[Malwarebytes Threat Intel (see here) and Team Cymru (see here).](https://blog.malwarebytes.com/threat-intelligence/2022/06/russias-apt28-uses-fear-of-nuclear-war-to-spread-follina-docs-in-ukraine/)\n\n\n-----\n\n_Figure 2. Summary of FancyBear campaign attributes in 1H 2022_\n\n**Russian SVR (aka APT29, CozyBear, Nobelium, DarkHalo,**\n**TheDukes) activities in 1H 2022**\n\n[On 27 January, CrowdStrike published a comprehensive report on the](https://www.crowdstrike.com/blog/observations-from-the-stellarparticle-campaign/)\n'StellarParticle Campaign' associated with CozyBear. The report highlighted the\nnovel tactics and techniques leveraged by the Russian SVR hacking group\nthroughout 2021. This included details from the SolarWinds supply chain\nattack, Browser cookie theft, and Microsoft Service Principal manipulation.\n[On 18 February, the Shadow Chaser Group Tweeted a suspected sample of APT29](https://twitter.com/shadowchasing1/status/1494470323063779353?s=21)\n[malware known as EnvyScout. The attackers leveraged the HTML smuggling](https://www.microsoft.com/security/blog/2021/11/11/html-smuggling-surges-highly-evasive-loader-technique-increasingly-used-in-banking-malware-targeted-attacks/)\ntechnique to deliver an ISO file that, if executed, runs a DLL on the victim's device.\nThis incident used a COVID-19 theme and reportedly was aimed at the Embassy of\nthe Republic of Turkey.\n[On 4 March, the Telsy Threat Intelligence team disclosed several suspected spear-](https://www.telsy.com/legitimate-sites-used-as-cobalt-strike-c2s-against-indian-government/#page)\nphishing attempts against Indian government entities. The phishing attempts were\ntentatively attributed to Nobelium/APT29 due to the mutual use of a Cobalt Strike\nwatermark (\"1359593325\") and an infection chain that matches reports by\nMicrosoft and Volexity on Nobelium/APT29 campaigns.\n[On 18 April, InQuest Labs discovered a malicious file belonging to Nobelium called](https://inquest.net/blog/2022/04/18/nobelium-israeli-embassy-maldoc)\n\"Ambassador_Absense.docx.\" posing as an official document from the Israeli\nEmbassy in London. Opening the document downloads a HTML Application (.HTA)\nfile with embedded JavaScript that decrypts and executes the payload. Once\nlaunched, the malicious payload collects data about the local system and exfiltrates\nit to a remote server using api[.]trello[.]com.\n[On 27 April, Microsoft's Special Report on Ukraine revealed additional details on](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE4Vwwd)\nNobelium's campaigns:\n\nIn early 2021, Microsoft observed Nobelium launching a large-scale phishing\ncampaign against Ukrainian interests involved in rallying international\nsupport against Russian actions\nBy mid-2021, Nobelium attempted to access IT firms serving government\ncustomers in predominantly NATO member states, at times successfully\ncompromising then leveraging privileged accounts to breach and steal data\nfrom Western foreign policy organizations.\nAs 2021 progressed, the Nobelium group, alongside several other suspected\nRussian nation state threat actors, sought persistent access to their particular\ninterests among a total target pool that included Ukrainian defense, defense\nindustrial base, foreign policy, national and local administration, law\nenforcement, and humanitarian organizations.\n[Also on 27 April, Mandiant released a blog stating that it had gathered sufficient](https://www.mandiant.com/resources/unc2452-merged-into-apt29)\nevidence to assess that the activity previously tracked as UNC2452, the threat group\nresponsible for the SolarWinds compromise in December 2020, is attributable to\nAPT29.\n\n\n-----\n\n[On 28 April, Mandiant published a report on tracking APT29 phishing](https://www.mandiant.com/resources/tracking-apt29-phishing-campaigns)\ncampaigns targeting diplomatic organizations in Europe, the Americas, and Asia. It\nincluded the disclosure of two new APT29 malware families uncovered in 2022,\ndubbed BEATDROP and BOOMMIC, and details about APT29’s efforts to evade\ndetection through retooling and abuse of Atlassian's Trello API\nservice: api[.]trello[.]com.\n[On 2 May, Mandiant also disclosed a new campaign tracked as UNC3524 that has](https://www.mandiant.com/resources/unc3524-eye-spy-email)\nreportedly been active since December 2019. UNC3524 campaigns facilitate bulk\nemail collection from victim environments, especially as it relates to their support of\nsuspected espionage objectives. Notably, this threat actor leveraged a Dropbearbased backdoor, dubbed QUIETEXIT, on embedded network devices (such as VPN\nappliances) to access MS Office 365 or on-premises MS Exchange emails. Another\ninteresting tactic is that UNC3524 usually accessed its victim's system from other\ncompromised devices, usually outdated and unpatched LifeSize conference IoT\n[cameras. Mandiant analysts tentatively attributed this campaign to APT29.](https://twitter.com/tylabs/status/1521164434344976388)\nHowever, the technical overlaps included TTPs that had already been made public\nand there were also some aspects aligned to APT28, which could suggest the two\ngroups share some tooling.\n[On 5 May, the Shadow Chaser Group Tweeted a suspected sample of APT29](https://twitter.com/ShadowChasing1/status/1522180445789573124)\nmalware that leveraged DLL side-loading as a method of executing their payload by\ninvoking a legitimate Adobe application to execute their payload.\n[On 13 May, Cluster25 published a report analyzing several CozyBear spear-phishing](https://cluster25.io/2022/05/13/cozy-smuggled-into-the-box/)\ncampaigns involving the above mentioned use of a side-loaded DLL through signed\nsoftware (like Adobe suite) alongside the use of the legitimate Dropbox service\n**api[.]dropbox[.]com as communication vector. The Cluster25 researchers also**\nstated that this CozyBear campaign potentially impacted at least Greece, Italy,\nTurkey, and Portugal especially in the government and foreign affairs sectors.\n[On 9 June, the Shadow Chaser Group Tweeted another suspect sample of APT29](https://twitter.com/ShadowChasing1/status/1534714528919072768)\nmalware that also leveraged DLL side-loading as a method of executing their\npayload by invoking a legitimate Hewlett Packard application to execute their\npayload.\n[On 22 June, Microsoft released another report on 'Defending Ukraine: Early](https://query.prod.cms.rt.microsoft.com/cms/api/am/binary/RE50KOK)\nLessons from the Cyber War' and included additional details about some of the\nSVR's campaigns. The Nobelium group has continued to target Ukrainian and\nNATO member states diplomatic entities with password spraying and spearphishing attacks. Microsoft also reported that the SVR's influence operations\ninclude historical revisionism and the targeting of think tanks and academics.\n\n\n-----\n\n_Figure 3. Summary of CozyBear campaign attributes in 1H 2022_\n\n**Suggested Courses of Action**\n\nExtract and ingest indicators of compromise (IOCs) from each the reports\nhyperlinked in the blog and investigate any hits\nLeverage detection rules for the APT group's malware from the reports hyperlinked\nin the blog to hunt through telemetry\nExtract the legitimate services used by the APT groups to support phishing and\nmalware campaigns, hunt for them in your telemetry and investigate any hits\n\n**FancyBear: *.eu3[.]biz, *.eu3[.]org, *.blogspot[.]com,**\ntinyurl[.]com, *.frge[.]io, and *.m.pipedream[.]net\n**CozyBear: api[.]trello[.]com and api[.]dropbox[.]com**\nContinue to track the campaigns of FancyBear and CozyBear and mitigate\nappropriately\nInvestigate the exposure of and expedite patching of CVE-2022-30190, a critical\nRCE in MSDT leveraged in the wild by multiple threat actors\n[Leverage the Curated Intel GitHub repository on Ukraine Cyber Operations to track](https://github.com/curated-intel/Ukraine-Cyber-Operations)\nthe evolving threat landscape surrounding the war\n\n## Lessons from the Conti Leaks\n\n\n-----\n\n## How Do You Run A Cybercrime Gang?\n\n Ransomware Decryption Intelligence\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/Overview%20of%20Russian%20GRU%20and%20SVR%20Cyberespionage%20Campaigns%201H%202022.pdf"
    ],
    "report_names": [
        "Overview of Russian GRU and SVR Cyberespionage Campaigns 1H 2022"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ff183540-67fb-4514-bd30-b4a264795901",
            "created_at": "2022-10-25T16:07:24.367762Z",
            "updated_at": "2025-03-27T02:02:10.192778Z",
            "deleted_at": null,
            "main_name": "UNC3524",
            "aliases": [],
            "source_name": "ETDA:UNC3524",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "94890f31-3a6c-447b-8995-5c5958efea28",
            "created_at": "2023-01-06T13:46:39.352776Z",
            "updated_at": "2025-03-27T02:00:03.05845Z",
            "deleted_at": null,
            "main_name": "UNC3524",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3524",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1656315966,
    "ts_modification_date": 1656315966,
    "files": {
        "pdf": "https://archive.orkl.eu/fb8c120e618cddb8c89a2a5469d7b9983a45b703.pdf",
        "text": "https://archive.orkl.eu/fb8c120e618cddb8c89a2a5469d7b9983a45b703.txt",
        "img": "https://archive.orkl.eu/fb8c120e618cddb8c89a2a5469d7b9983a45b703.jpg"
    }
}