{
    "id": "0a3556ac-a684-4a00-82e1-f9885fd78f5c",
    "created_at": "2023-01-12T15:06:43.737729Z",
    "updated_at": "2025-03-27T02:05:20.150647Z",
    "deleted_at": null,
    "sha1_hash": "24bd185c0093f63058c57f3ba9c11cde8a381520",
    "title": "2021-02-16 - Dark Net Markets Going Out of Business- Where are Users Headed to Next-",
    "authors": "",
    "file_creation_date": "2022-05-28T03:57:30Z",
    "file_modification_date": "2022-05-28T03:57:30Z",
    "file_size": 3600909,
    "plain_text": "# Dark Net Markets Going Out of Business: Where are Users Headed to Next?\n\n**[ke-la.com/dark-net-markets-going-out-of-business-where-are-users-headed-to-next/](https://ke-la.com/dark-net-markets-going-out-of-business-where-are-users-headed-to-next/)**\n\nFebruary 16, 2021\n\nGoing out of business is a popular phenomenon with online marketplaces both in the Dark\n[Net and surface web. Dark Net marketplaces continually shut down for a number of reasons,](https://www.infosecurity-magazine.com/opinions/dark-net-market-closures/)\ncausing those markets’ users to actively search for alternative spots to trade goods and\nservices. In light of the major announcement of Joker’s Stash shutting down on February\n15th, 2021, we’ve dived into the cybercrime underground to understand more about the\nclosures of Dark Net marketplaces and where market’s users migrate to.\n\n**The research’s main highlights include:**\n\nKELA identified four main marketplaces that are trying to steal Joker’s Stash’s users\nfollowing the market’s closure. According to advertisements and users’ reactions, we\nmay see users shifting activities to Brian’s Club, Vclub, Yale Lodge, and UniCC.\nKELA observes cybercriminals acting just as regular businessmen and marketers,\ntrying to take advantage of their competitors’ terminations in order to advertise\n**their services and steal their competitors’ users.**\nKELA reveals an evident trend of market administrators offering free vendor\n**bonds to try and lure new sellers to come to their marketplaces following a**\ncompetitor’s market closure.\nKELA highlights the significance of monitoring threat actors and their TTPs so that\n**enterprise defenders can assess actors’ credibilities, predict actors’ next steps,**\n**and protect their organizations from cyber threats.**\n\n## The Hunt for New Markets to Trade Compromised Credit Cards\n\nRecent cybercrime events have shown that Covid-19 has taken a toll even on Dark Net\ncybercriminals. Towards the end of 2020, Joker’s Stash – the largest Dark Net credit card\n**marketplace – embarked on its termination. Following a year where the market’s admin**\ncaught the Coronavirus and some of the market’s servers were seized by authorities, it’s only\nnatural that the admin may have realized that it may be time to retire. Like millions of\nindividuals around the world, the pandemic put a pause to the admin’s day-to-day activities,\ncausing him to announce his unavailability for some time while he took some personal leave\nto recover.\n\n\n-----\n\n_Announcement by the Joker’s Stash admin, where he shares that he was infected with COVID-19, forcing_\n_him to pause work on the marketplace in order to focus on his recovery. In hindsight, this announcement_\n_seems to be the beginning to the end of Joker’s Stash._\n\n**Joker’s Stash has become a bustling one-stop-shop for cybercriminals looking to**\n**trade compromised credit cards. Cybercriminals, thirsty for money, turn right to this**\n[infamous market for all of their credit card trading needs. That is, until February 15th, 2021.](https://www.zdnet.com/article/jokers-stash-the-internets-largest-carding-forum-is-shutting-down/)\nA month prior, the market’s administrator announced that they will officially be closing in 30\ndays, without much explanation as to why.\n\n\n-----\n\n_The official announcement posted by Joker’s Stash announcing the closure of the market by February 15,_\n_2021._\n\nBy reviewing some recent events related to this market, we assume that the closing is likely\na combination of several things:\n\n1. Simply, the admin has decided to retire after some good years of business – and what\n\na better time than after he fell sick to COVID-19 and may not be ready to go back to\nwork at full force.\n\n\n-----\n\n2. The market s operations could have been affected when the US Federal Bureau of\n\n[Investigation and Interpol have temporarily seized a small number of servers used by](https://www.zdnet.com/article/fbi-interpol-disrupt-jokers-stash-the-internets-largest-carding-marketplace/)\nJoker’s Stash. The hunt and growing dangers by authorities may have influenced the\ndecision by the market’s admin to close.\n3. The downtime due to the admin’s sickness could have slowed operations and affected\n\nhim from picking activities back up.\n4. Joker’s Stash may have experienced potential reputational damage from multiple\n\ndowntimes that occurred on the market, including the recent seizures of several of their\nservers by authorities.\n\nRegardless of the reasons behind the closure, the market’s regular users have raised\nconcerns of where to go next. Naturally, other credit card marketplaces leveraged this\nopportunity to push their businesses forward and lure the Joker’s Stash users towards them.\nThis behavior is not novel though. We’ve seen similar activities by marketplace admins in the\npast when markets like Dark Market and Empire have shut down.\n\nWe’ve explored some popular underground forums to see where Joker’s Stash’s sellers and\nbuyers may be headed to next. Throughout the analysis, we’ve observed that though the\ncarding landscape is very active among cybercriminals, it seems that several marketplaces\nmay be seeing more traffic due to Joker’s Stash’s closure.\n\nWith the heavy marketing and advertising that Brian’s Club has been investing in, it seems\nthat the longtime attempts of marketing to credit card traders may be finally paying off now\nthat Joker’s Stash is out of the picture. Brian’s Club has been immodestly trying to steal the\nthunder by publishing an advertisement on the main page of XSS, soon after the\nannouncement by Joker’s Stash.\n\n_Brian’s Club purchased advertising space on the main page of XSS, a well-known underground forum_\n_where Joker’s Stash members have discussed where they will move to next._\n\nClearly, cybercriminals have learned how to best use marketing tactics at a time of\nopportunity. Not only did Brian’s Club publish ads on the main pages of XSS, but they also\nput down some money to become the official sponsor of Omerta – a popular underground\nforum focusing on credit card trading – a position that was held by Joker’s Stash only a year\nago\n\n\n-----\n\n_Brian’s Club has decided to become the official sponsor of the Omerta carding forum._\n\nAnd as Brian’s Club’s marketers are doing their jobs, the underground actors seem to agree\nthat this marketplace will be the new hub for trading compromised credit cards,\n**especially since it appears to be the largest market for compromised credit cards in**\nterms of volume of cards and dumps offered for sale. To date, we’ve found that there are\n**nearly 5 millions of credit card details available for sale on Brian’s Club. Buyers should**\ndeposit at least 1 USD to activate their account. Moreover, the shop has a referral system:\n“For each invited user you will get percentage of his deposit” – meaning users will get 1015% from the first deposit of the person they invited to Brian’s Club.\n\n_Forum members on XSS are sharing that Brian’s Club will be the next go-to for trading compromised_\n_credit cards: “Someone will need to fill the empty space. Brian’s Club, it’s your turn!”_\n\nBut Brian’s Club has not been the only carding marketplace to try and take advantage of the\nJoker’s Stash closure. Vclub, another carding marketplace, has also been seen trying to\npush their name in the carding world by advertising their market for users looking for Joker’s\nStash replacements. Registration fee is 25 USD with which they instantly gain access to\nabout 100,000 compromised credit cards and hundreds of thousands of dumps.\n\n\n-----\n\n_A post by the official user for Vclub on a well-known underground forum, where they attempt to promote_\n_themselves to Joker’s Stash’s users._\n\nMembers on a popular underground forum have claimed that Vclub does not reach the levels\nof service and quality that was available in Joker’s Stash. For example, a member complains\nthat despite the fact that he purchased one of the priciest cards for sale on the forum, the\ncard’s spend limit was 150 USD. Buyers complained that the quality of cards sold on Vclub\naren’t as good as they are on Joker’s Stash, however others still think that Vclub is one of\nthe good possible alternatives to Joker’s Stash.\n\n_Users complaining about the quality of Vclub’s cards_\n\n\n-----\n\n_Users clashing in the thread of Vclub if Joker’s Stash vendors should be allowed to trade there or not._\n\nAdditionally, we may see some of Joker’s Stash’s users migrating to Yale Lodge. Some\nformer Joker’s Stash users have been seen actively inquiring on how to register on Yale\nLodge, as they look for new marketplaces to profit from. However, one red flag for Yale\nLodge here is the registration fee that they demand – 150 USD for registration and a\nminimum deposit of 200 USD – a demand that is significantly higher than other similar shops\nsuch as Joker’s Stash that required a 20 USD deposit.\n\nLast, UniCC also seems to be a promising candidate to replace Joker’s Stash with almost\n300,000 new credit card details being added every week (based on their updates from\nFebruary 3-9, 2021). At UniCC, users are able to explore these details with a 100 USD\ndeposit requirement in order to activate the account.\n\nOverall, the carding landscape is much bigger than the several markets we mentioned in this\npost. Moreover, cybercriminals buy cards and dumps not only in specialized shops but\n**also on forums, via instant messaging channels, and behind closed doors in private**\n\n\n-----\n\n**deals. To reach true success in the carding niche, newly emerging markets need to focus on**\nthe constant influx of vendors and buyers – something that the above-mentioned markets\nhave been actively attempting to do with their heavy advertising campaigns.\n\n## The History of Market Closures and User Migration\n\nThis isn’t the first time a major underground marketplace is closing. In the past we’ve seen\n[similar instances where markets or forums shut down, forcing its users to find replacements.](https://www.google.com/url?q=https://www.nbcnews.com/news/us-news/alphabay-hansa-shut-drug-dealers-flock-dark-web-dreammarket-n785001&sa=D&source=editors&ust=1613391891768000&usg=AOvVaw3psvkjQMk3GSRaojJiYZ9e)\n\n**Dark Market**\n\n[Dark Market took great advantage of its predecessors by using tactics of “free offerings” for](https://www.theverge.com/2021/1/12/22227929/darkmarket-shutdown-europol-worlds-largest-illegal-marketplace)\nusers coming from similar and recently shut down markets. Dark Market, reportedly the\nworld’s largest Dark Net marketplace, grasped attention of many cybercriminals when they\nused the closure of Bitbazaar and Nightmare Market to attract more users to their market.\nDark Market’s administrators published advertisements offering waived vendor bonds for\nrefugees of Bitbazaar and Nightmare Market, meaning that new vendors coming from those\nformerly closed sites could open a free vendor account on Dark Market by simply applying\nand passing the market’s requirements.\n\n\n-----\n\nBut soon after Dark Market’s shutdown by law enforcement in January 2021, we found other\nmarkets using the same tactic of free vendor bonds being used against them. Dark0de 2.0,\nwhich is said to be online from May 2020 (allegedly being a reborn of the infamous market,\nDark0de), now offers “Free (Premium) Vendor Bonds for Dark Market Refugees,” which is\nvalued at 200 USD for new entry level vendors. Other markets adopted this ‘free vendor\nbond’ tactic en masse: Raw Market, ViceCity, Liberty, Televend – to name just a few.\n\n\n-----\n\n**Yellow Brick Market**\n\nYellow Brick Market, another Dark Net market known for going on and offline multiple times\nwithout any explanation whatsoever, seems to have [officially gone offline once again in the](https://darknetlive.com/post/yellow-brick-market-is-gone-once-again/)\nend of 2020. To no surprise, here as well alternative markets have been using this event to\npromote their markets. Dark0de 2.0 took the spotlight again here, offering again free vendor\nbonds and some further benefits as well.\n\nIncognito Market was seen using the closure of both Yellow Brick Market and Dark Market to\nadvertise to established vendors on both of those now-closed markets. Incognito’s\nadministrators shared that they will offer any established vendors who have good track\nrecords on pre-existing markets – such as Dark Market or Yellow Brick Market – to have their\nbond fully waived and, depending on their reputation, may be automatically gifted full “finalize\nearly” (FE) privileges, allowing them to bypass the escrow holding period during a purchase.\nThe admins also shared that established vendors who don’t have the longevity to be eligible\nfor the automatic full FE privileges but still have a good reputation can also pay for the €1500\nFE Bond.\n\n\n-----\n\n**Empire Market**\n\nSimilar trends were also observed when the famous Empire Market left the underground\necosystem in an [apparent exit scam. Icarus Market took on from other famous market](https://www.bankinfosecurity.com/blogs/bye-bye-bitcoins-empire-darknet-market-exit-scams-p-2934)\nadmins and also decided to use this opportunity to invite any former Empire vendors to\nbecome vendors on their market by offering them free vendor bonds as well.\n\n## Following the Cybercriminals’ Tracks\n\nThe examples listed above are just a few of the many instances where cybercriminals are\nobserved acting just as regular marketers looking to improve their profits and market traffic.\nWhat is evident is that these markets’ admins show a trend of offering free vendor bonds to\ntry and lure new sellers to come to their marketplaces following their competitor’s closure.\n\nCybercriminals will constantly be shifting operations to new markets and innovating their\nmonetization methods in line with Dark Net changes. It’s therefore crucial that enterprise\ndefenders constantly follow these trends to ensure that they understand threat actors and\ntheir TTPs, allowing them to continually be a few steps ahead of cybercriminals. Now that\nJoker’s Stash has officially been closed, we can presume that most activity will turn to Brian’s\nClub, Vclub, Yale Lodge, and UniCC. By observing chatter between cybercriminals across\nthese markets and other forums and instant messaging groups, fraud teams can learn\ntremendously about what cybercriminals may be planning to do next, essentially helping\nthem avoid severe financial losses due to fraudulent activities.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-16 - Dark Net Markets Going Out of Business- Where are Users Headed to Next-.pdf"
    ],
    "report_names": [
        "2021-02-16 - Dark Net Markets Going Out of Business- Where are Users Headed to Next-.pdf"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536003,
    "ts_updated_at": 1743041120,
    "ts_creation_date": 1653710250,
    "ts_modification_date": 1653710250,
    "files": {
        "pdf": "https://archive.orkl.eu/24bd185c0093f63058c57f3ba9c11cde8a381520.pdf",
        "text": "https://archive.orkl.eu/24bd185c0093f63058c57f3ba9c11cde8a381520.txt",
        "img": "https://archive.orkl.eu/24bd185c0093f63058c57f3ba9c11cde8a381520.jpg"
    }
}