{
    "id": "0a505a28-4510-4d72-9c0e-7c191979700e",
    "created_at": "2023-01-12T15:10:50.705638Z",
    "updated_at": "2025-03-27T02:05:24.397762Z",
    "deleted_at": null,
    "sha1_hash": "f464c082928889f78819f9815dcf696e4e8dbcd0",
    "title": "2022-03-29 - Woche 12- Schadsoftware «FluBot» in der Schweiz wieder aktiv und Web-Administratoren erhalten Drohmails von angeblich ukrainischen Hackern",
    "authors": "",
    "file_creation_date": "2022-05-28T21:40:40Z",
    "file_modification_date": "2022-05-28T21:40:40Z",
    "file_size": 491057,
    "plain_text": "# Woche 12: Schadsoftware «FluBot» in der Schweiz wieder aktiv und Web-Administratoren erhalten Drohmails von angeblich ukrainischen Hackern\n\n**ncsc.admin.ch/22w12-de**\n\nNavigation\n\n**29.03.2022 - Der Meldeeingang beim NCSC war in der letzten Woche leicht erhöht.**\n**Dem NCSC wurden SMS gemeldet, mit welchen erneut versucht wird, das Opfer zu**\n**verleiten, die Schadsoftware «FluBot» auf dem Smartphone zu installieren. Zudem**\n**erhielten Website-Besitzer elektronische Post von angeblichen ukrainischen**\n**Hackern, welche vorgaben, die Website gehackt zu haben und einen**\n**«Spendenbeitrag» forderten.**\n\n## Die Schadsoftware «FluBot» ist zurück\n\nIn der letzten Woche wurden dem NCSC zahlreiche SMS mit Benachrichtigungen zu\nangeblichen Paketlieferungen in diversen Textvarianten gemeldet. Bei der Formatierung\ngab es allerdings Gemeinsamkeiten: In den Wörtern waren jeweils zahlreiche Leerzeichen\nenthalten. Der Link unter dem Text führte auf eine Webseite, welche das Opfer aufforderte,\neine Software des Paketdienstleisters auf das Android Smartphone herunterzuladen und zu\ninstallieren.\n\n\n-----\n\nBeispiele versendeter SMS-Texte mit angeblichen Paketbenachrichtigungen\n\nBei der Software handelt es sich jedoch um die in der Schweiz nicht unbekannte\nSchadsoftware «FluBot». Die letzte grosse Welle traf die Schweiz im Herbst 2021. Damals\nwurden SMS mit einer angeblichen Sprachnachricht in grosser Zahl versendet. Das NCSC\n[hat darüber berichtet (Wochenrückblick 41). International werden auch SMS mit dem Text](https://www.ncsc.admin.ch/ncsc/de/home/aktuell/im-fokus/wochenrueckblick_41.html)\n«Bist Du das auf dem Video» beobachtet aber auch gefälschte Aufforderungen zur\nAktualisierung von Browser oder Betriebssystem gehören zum Repertoire von «FluBot».\nTypischerweise wechseln die Angreifer ihre Zielgebiete in kürzester Zeit, meistens bereits\nnach wenigen Tagen. Kampagnen wurden seit Dezember 2021 vor allem in Australien und\nDeutschland beobachtet. In der Schweiz werden die SMS mit den Paketbenachrichtigungen\nseit dem 18. März 2022 versandt.\n\n«FluBot» hat sich unter anderem auf den Diebstahl von SMS auf Mobiltelefonen\nspezialisiert. Ziel dabei ist, in den gestohlenen SMS so genannte Einmal-Passwörter zu\nfinden. Nach einer Infektion wird zudem das ganze Adressbuch des infizierten\nSmartphones an den Kontrollserver der Angreifer gesendet. Das Smartphone erhält danach\neine Liste mit Telefonnummern, die von anderen gehackten Smartphones stammen, an die\nes die bösartige SMS senden soll.\n\n**Auch wenn diese Schadsoftware lediglich Android-Geräte angreift, müssen sich**\n**auch Nutzende von Geräten mit dem iOS-Betriebssystem in Acht nehmen und sollten**\n**keine Links in SMS anklicken.**\n\n**Installieren Sie keine Software, die ausserhalb der offiziellen Stores der**\n**Betriebssysteme angeboten wird**\n\n\n-----\n\n**Insbesondere sollten Sie keine Software installieren, welche Sie über einen Link**\n**in einer SMS oder über einen anderen Messenger-Dienst (WhatsApp, Telegram**\n**usw.) erhalten haben.**\n**Falls Sie dennoch eine solche Software installiert haben, sollten Sie das Gerät**\n**von einer Fachperson überprüfen lassen und während dieser Zeit weder**\n**Bankgeschäft noch Online-Einkäufe tätigen. Geben Sie auch keine Passwörter**\n**ein.**\n**Das Zurücksetzten des befallenen Geräts auf die Werkseinstellungen ist nahezu**\n**die einzige Möglichkeit, diese Schadsoftware vom Gerät zu entfernen.**\n\n## Angebliche Hacker aus der Ukraine fordern eine «Spende»\n\nDas NCSC erhielt letzte Woche ausserdem mehrerer Meldungen zu Drohnachrichten an\nWebsite-Besitzende von angeblichen ukrainischen Hackern. Die Schreiben wurden jeweils\nüber das Kontaktformular der Webseiten abgesetzt. Die Hacker gaben dabei vor, eine\nSchwachstelle in der Webseite gefunden zu haben und forderten den Webseitenbesitzer\nauf, eine «Spende» von 0.05 BTC (aktuell ca. 2000 CHF) auf ein vorgegebenes BitcoinKonto zu transferieren.\n\nSollte der Webseitenbesitzer der Forderung nicht nachkommen, dann werde die Seite\ngekapert und ein Banner eingeblendet, welches alle Besucher auffordere, der Ukraine zu\nhelfen. Sollte das Banner durch den Besitzer entfernt oder die Schwachstelle geschlossen\nwerden, werde das Banner erneut installiert und eine neue Schwachstelle gefunden. Sollte\ndas nicht funktionieren, drohten die Angreifer, die Domäne bei der Registrierungsstelle\ndauerhaft zu löschen.\n\nDrohmail angeblich im Namen von ukrainischen Hackern\n\nDieses Schreiben war selbstverständlich nur ein «Bluff». Der Fall zeigt aber, dass die\nTragödie des Krieges in der Ukraine in verschiedenster Weise auch von Betrügern für ihre\nZwecke ausgenutzt wird. Das NCSC hat bereits am 8. März 2022 darauf aufmerksam. Auch\ndie Kantonspolizei ZH hat letzte Woche vor Betrugsversuchen gewarnt.\n\n**Lassen Sie sich nicht einschüchtern. Melden Sie im Zweifelsfall verdächtige**\n**Nachrichten dem NCSC oder der Polizei.**\n**Natürlich sollten Sie aber Webserver und alle Webapplikationen auf dem**\n**neuesten Stand halten.**\n\n\n-----\n\n**Generell für Spenden gilt:**\n\n**Gehen Sie nicht auf Kontaktaufnahmen per E-Mail ein**\n**Vermeiden Sie Spendenzahlungen per Kreditkarte**\n**Überweisen Sie keine Kryptowährungsguthaben**\n**Versenden Sie keine Geschenkgutschein Codes (Google Play, Apple**\n**iTunes etc.)**\n**Am besten nutzen Sie Sie nur IBAN-Konten von Hilfswerken, welche ZEWO**\n**zertifiziert sind:**\n[https://zewo.ch/de/](https://zewo.ch/de/)\n\n## Aktuelle Zahlen und Statistiken\n\nDie Anzahl Meldungen der letzten Woche nach Kategorien sind publiziert unter:\n\n[Aktuelle Zahlen](https://www.ncsc.admin.ch/ncsc/de/home/aktuell/aktuelle-zahlen.html)\n\nLetzte Änderung 29.03.2022\n\n\n-----",
    "language": "DE",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-29 - Woche 12- Schadsoftware «FluBot» in der Schweiz wieder aktiv und Web-Administratoren erhalten Drohmails von angeblich ukrainischen Hackern.pdf"
    ],
    "report_names": [
        "2022-03-29 - Woche 12- Schadsoftware «FluBot» in der Schweiz wieder aktiv und Web-Administratoren erhalten Drohmails von angeblich ukrainischen Hackern.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536250,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653774040,
    "ts_modification_date": 1653774040,
    "files": {
        "pdf": "https://archive.orkl.eu/f464c082928889f78819f9815dcf696e4e8dbcd0.pdf",
        "text": "https://archive.orkl.eu/f464c082928889f78819f9815dcf696e4e8dbcd0.txt",
        "img": "https://archive.orkl.eu/f464c082928889f78819f9815dcf696e4e8dbcd0.jpg"
    }
}