{
    "id": "0a9cb08e-565b-4279-b3b2-8efef7a82ef7",
    "created_at": "2023-01-12T15:06:13.160415Z",
    "updated_at": "2025-03-27T02:06:00.593846Z",
    "deleted_at": null,
    "sha1_hash": "e4eaf8b4f9d4145c5fdfd1a05f6ddbd2f20c8da0",
    "title": "2021-11-19 - The New Threat- Mallox Ransomware",
    "authors": "",
    "file_creation_date": "2022-12-29T00:30:59Z",
    "file_modification_date": "2022-12-29T00:30:59Z",
    "file_size": 5327566,
    "plain_text": "# The New Threat: Mallox Ransomware\n\n**[sangfor.com/blog/cybersecurity/new-threat-mallox-ransomware](https://www.sangfor.com/blog/cybersecurity/new-threat-mallox-ransomware)**\n\nAuthor : [Sangfor Technologies](https://www.sangfor.com/resource-center/author/sangfor-technologies)\n\nPublished Date : 19 Nov 2021\n\nLast Modified Date : 11 May 2022\n\n1. [Home](https://www.sangfor.com/)\n2. [Blog](https://www.sangfor.com/blog)\n3. [Blog - Cyber Security](https://www.sangfor.com/blog/cybersecurity)\n4. The New Threat: Mallox Ransomware | Sangfor Technologies\n\nTag :\n\n[Cyber Security](https://www.sangfor.com/blog/cybersecurity)\n\n## 1. Mallox Ransomware Description\n\nIn October 2021 Mallox, a new type of ransomware, began attacking enterprises in Asia.\nThis new ransomware is identified by encrypted files being given the suffix “. mallox”.\n\n\n-----\n\nAfter Sangfor FarSight Labs Endpoint Security Team captured samples of this new malware\nstrain, analysis found that Mallox was even more destructive than currently active\nransomware.\n\n1. Mallox adds a C# shell layer using common DLL hijacking technology to bypass\n\nsecurity software.\n2. Mallox spread like a worm through file sharing and uses the same file retrieval\n\ntechnology as Search Artifact to attain rapid file retrieval and encryption.\n\nMallox can encrypt many files in a very short period of time, resulting in irreparable losses\nonce it is installed on a company's computers.\n\n## 2. Technical Analysis\n\nTo bypass anti-virus software, Mallox adds a C# shell layer to hide its malicious behavior,\nand uses SmartAssembly to obfuscate the C# shell, as seen below:\n\n\n-----\n\nAdvancedRun.exe is installed and run in the temp directory:\n\nAdvancedRun.exe presents a configuration window when started:\n\n\n-----\n\nWindows Defender is turned off:\n\nThe Windows Defender directory is deleted:\n\n\n-----\n\nThe AdvancedRun.exe file is then deleted:\n\nThe script file Yubhigusnhbrkitykwictqkill$.bat is created in the temp directory:\n\n\n-----\n\nThe operation of the script file Yubhigusnhbrkitykwictqkill$.bat is as follows, with the main\nfunctions being:\n\n1. Restoring the CMD default association by deleting the registry\n\n\"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Command Processor\\AutoRun\".\n2. Setting security permissions for specified files and folders to prevent them from\n\nbecoming inaccessible: cmd.exe, net.exe, net1.exe, mshta.exe, FTP.exe, wscript.exe,\ncscript.exe, powershell.exe, C: \\ProgramData, C:\\Users\\Public.\n3. Deleting the shadow disk.\n4. Stopping and deleting specific programs and services, including security software and\n\nany related to line-of-business.\n\n\n-----\n\nThe Visual Basic script Blffpekna.vbs is created in the temp directory to run\nYubhigusnhbrkitykwictqkill$.bat:\n\nThe Yubhigusnhbrkitykwictqkill$.bat script is run:\n\n\n-----\n\nMSBuild.exe in the .NET installation directory is copied into the temp directory:\n\nThe running MSBuild.exe process is identified, and the ransomware main module is injected\ninto the MSBuild.exe process to bypass the security software:\n\n\n-----\n\nThe main Mallox module is an exe file that implements the encryption functions. The\nfollowing prepared is done before encryption:\n\n1. Excludes hosts in Russia, Kazakhstan, Russia, Ukraine and Qatar\n2. Elevates permissions\n3. Deletes the registration form for Raccine\n4. Deletes the disk shadow\n5. Cancels the automatic startup repair mode\n6. Terminates the following program process:\n\nIf a program is running under the debugger, an exception will be thrown when trying to use\nCloseHandle to close the handle returned by the FindFirstFile function which prevents the\nmalware from being closed. The malware will prevent debugging from starting again:\n\n\n-----\n\nThe number of encryption threads created are 2 times the number of existing processors\nwith an upper limit of 64 threads:\n\nThe encryption threads are synchronized using IOCP and encrypts target files found using\nthe file traversal thread:\n\nThe Chacha20 algorithm (a variant of the Salsa20 stream cipher) is used to encrypt files with\nthe encryption suffix \".mallox\".\n\n\n-----\n\nRansom information:\n\nRetrieve IP addresses from the ARP table to create a virus propagation thread:\n\n\n-----\n\nName the malware file mall.exe and copy it through file sharing to the IP hosts from the ARP\ntable, then create a corresponding service on the target systems. If the virus is run without a\nshell, it can be spread automatically:\n\n\n-----\n\nObtain system disk information of all network disks, removable disks, and local disks. Create\na thread for each disk that needs to be encrypted by traversing to find files:\n\n\n-----\n\nUse this method of reading USN logs to quickly retrieve disk files:\n\n\n-----\n\nFilter out the ransomware files and the files of the program itself:\n\nThen filter out the following suffix files:\n\n\n-----\n\nGet the full path of the files and filter the following directories:\n\n\n-----\n\nSend eligible files to the encryption thread for file encryption:\n\n## 3. Protection Recommendations\n\n1. Set up access permissions for important files and turn off unnecessary file sharing\n\nfeatures.\n2. Perform regular non-local (offline) backups.\n3. Use a highly secure host password and avoid multiple devices using the same\n\npassword.\n4. Do not map ports like 3389 directly to the internet or an external network to prevent\n\nbrute-force cracking.\n5. Avoid opening emails, links, and URL attachments of unknown origin.\n\n\n-----\n\n6. Do not download non-genuine software from unofficial sites.\n7. If you find that the file type does not match the original icon, you should scan the file\n\nusing endpoint detection software to detect any malicious code within the file.\n8. Regularly scan the system for vulnerabilities and install patches in a timely manner.\n\n## 4. Using Sangfor Products:\n\n1. Run anti-virus and vulnerability scans using Endpoint Secure.\n2. For users of Sangfor Cyber Command, NGAF, and Endpoint Secure, it is\n\nrecommended that the system engines and signature databases are upgraded\nregularly.\n3. Connect to Neural-X and use Cloud Sandbox to detect and defend against new threats.\n4. Sangfor provides free bot and virus removal tools to users. You can download the virus\n\n[detection and protection tools here: https://page.sangfor.com/anti-bot-tool](https://page.sangfor.com/anti-bot-tool)\n5. Sangfor Engine Zero malware detection engine is integrated into most Sangfor security\n\nproducts to provide precision defense against unknown viruses and malware.\n6. Sangfor has a suite of Security Assessment Services to help users quickly find gaps in\n\ntheir security architecture and develop remediation plans.\n7. Sangfor Security Assessment Services provide security device policy inspection, threat\n\nhunting & detection, and vulnerability inspections to ensure that risks are immediately\nidentified, and remediation strategies developed to prevent successful attacks in the\nfuture.\n\n[CONTACT SANGFOR FOR BUSINESS INQUIRIES](https://www.sangfor.com/en/about-us/contact-us/contact-us-form)\n\n## Meet the Author\n\n\n-----\n\n### Sangfor Technologies\n\nSangfor Technologies is a leading vendor of Cyber Security and Cloud Computing solutions.\nThe majority of the blogs that you are seeing here are written by professionals working at\nSangfor. We have a team of content writers, product managers and marketing experts who\nare taking care of writing articles on various topics that are relevant to our audience. Our\nteam ensures that the articles published are factually correct and helpful to our customers\nand partners to know more about the recent trends on Cyber Security and Cloud, and how it\ncan help their organizations.\n\n\n-----\n\n[See Author s Detail](https://www.sangfor.com/resource-center/author/sangfor-technologies)\n\nicon notification\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-19 - The New Threat- Mallox Ransomware.pdf"
    ],
    "report_names": [
        "2021-11-19 - The New Threat- Mallox Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535973,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1672273859,
    "ts_modification_date": 1672273859,
    "files": {
        "pdf": "https://archive.orkl.eu/e4eaf8b4f9d4145c5fdfd1a05f6ddbd2f20c8da0.pdf",
        "text": "https://archive.orkl.eu/e4eaf8b4f9d4145c5fdfd1a05f6ddbd2f20c8da0.txt",
        "img": "https://archive.orkl.eu/e4eaf8b4f9d4145c5fdfd1a05f6ddbd2f20c8da0.jpg"
    }
}