{
    "id": "0af3a7db-e9db-4d06-8c4c-38419f2db627",
    "created_at": "2023-01-12T15:01:06.634063Z",
    "updated_at": "2025-03-27T02:05:38.365114Z",
    "deleted_at": null,
    "sha1_hash": "ea620d6817922b2260264d02b13b28ab34edfbeb",
    "title": "2021-09-17 - Sophisticated Spyware Posing as a Banking Application To Target Korean Users",
    "authors": "",
    "file_creation_date": "2022-05-27T23:06:02Z",
    "file_modification_date": "2022-05-27T23:06:02Z",
    "file_size": 1920220,
    "plain_text": "# Sophisticated Spyware Posing as a Banking Application To Target Korean Users\n\n**[blog.cyble.com/2021/09/17/sophisticated-spyware-posing-as-a-banking-application-to-target-korean-users/](https://blog.cyble.com/2021/09/17/sophisticated-spyware-posing-as-a-banking-application-to-target-korean-users/)**\n\nSeptember 17, 2021\n\nDigital transactions and the use of Mobile Banking are growing exponentially – particularly due to the\nongoing pandemic. The increase in popularity of mobile banking has attracted the interest of Threat\nActors (TAs), who plan on leveraging this situation to steal information and money from users. Cybercriminals\nare also looking to compromise mobile phones which contain the highest amount of sensitive user information.\n\n[A researcher has reported a phishing page linked to spreading Android malware in a Twitter post. Cyble](https://twitter.com/ReBensk/status/1438027183490940931)\nResearch Labs has analyzed the page and found that the phishing page is targeting Korean-speaking users.\n\nA screenshot of the fake page is shown in the figure below.\n\n\n-----\n\n_Figure 1:_\n\n_Phishing page used to spread the spyware_\nUpon further analysis, we observed that on the phishing page, the TA is spreading a fake version of the Woori Bank\napp. Woori Bank is a multinational South Korean Bank headquartered in Seoul. The fake page offers the\nvictim a loan amount with extremely attractive interest rates to entice and mislead them into accepting the offer.\n\nCyble Research Labs has performed a thorough analysis of the fake app and found that it is a variant of spyware. We\nalso found that the same spyware is spreading through other phishing pages as well.\n\n\n-----\n\nBased on our investigation, the spyware collects contacts, SMSs, call logs and audio and video files. Additionally,\nit performs other malicious activities such as enabling permissions without the need for user interaction,\nstealing credentials, etc.\n\n## Technical Analysis\n\nThe spyware shares the same icon of the WON App by Woori Bank as shown in the below figure.\n\n_Figure 2: Comparison of original Won App and the fake app_\n\n### APK Metadata Information\n\n**APK File Info**\n\nAPP Name: Woori Bank (우리은행)\nPackage Name: com.fomta.c002\nSHA256: ed7ef6718a6b6e7abf3bd96c72929ee9f1e9a4bfcd97429154141c7702093f36\n\nUpon investigating the files inside the malware’s APK file, we observed the following:\n\n1. There are two files with .dex extension in addition to the classes.dex file, which looks suspicious. Refer to\n\nFigure 3.\n\n_Figure 3: APK File info_\nUpon inspecting magic numbers of the two .dex files highlighted in above figure, we found the file type of both files are\nnot of a DEX file\n\n\n-----\n\nMagic numbers are the first bits of a file that uniquely identify the type of file.\n\n1. 10 armv7-based native libraries present in APK file.\n\n_Figure 4: APK’s Native Libraries List_\n\n1. Set of HTML files in the assets folder as shown in Figure 5.\n\n_HTML Files in the APK_\n\n### Manifest File Description\n\n\n_Figure 5:_\n\n\nThe malware requests 41 permissions, out of which attackers can leverage 22 permissions to collect victim’s personal\ninformation such as contacts, SMSs, call logs, etc. These dangerous permissions are listed in Table 1.\n\n**Permission Name** **Description**\n\n**ACCESS_BACKGROUND_LOCATION, ACCESS_COARSE_LOCATION, ACCESS_FINE_LOCATION** Access\ndevice\nlocation\n(with the\nhelp of GPS\nand Phone\nnetwork)\n\n**ANSWER_PHONE_CALLS** Allows the\napp to\nanswer\nphone calls\n\n**CAMERA** Access\ndevice’s\ncamera\n\n\n-----\n\n**GET_TASKS** Fetch\ncurrently\nrunning apps\nand\nprocesses\n\n**PROCESS_OUTGOING_CALLS** Allows the\napp to\nprocess\noutgoing\ncalls\n\n**READ_CONTACTS** Access to\nphone\ncontacts\n\n**READ_EXTERNAL_STORAGE** Access\ndevice\nexternal\nstorage\n\n**WRITE_EXTERNAL_STORAGE** Modify\ndevice\nexternal\nstorage\n\n**READ_PHONE_STATE** Access\nphone state\nand\ninformation\n\n**RECORD_AUDIO** Allows to\nrecord audio\nusing device\nmicrophone\n\n**CALL_PHONE** Perform call\nwithout user\nintervention\n\n**READ_CALL_LOG** Access\nuser’s call\nlogs\n\n**READ_SMS** Access\nuser’s SMSs\nstored in the\ndevice\n\n**REQUEST_INSTALL_PACKAGES** Install\napplications\nwithout user\ninteraction\n\n**RECEIVE_SMS** Fetch and\nprocess\nSMS\nmessages\n\n**SEND_SMS** Allows the\napp to send\nSMS\nmessages\n\n\n-----\n\n**SYSTEM_ALERT_WINDOW** Allows to\ndisplay\nsystem\nalerts over\nother apps\n\n**WRITE_CALL_LOG** Modify or\nDelete Call\nLogs stored\nin the\ndatabase\n\n**WRITE_CONTACTS** Modify or\nDelete\nContacts\nStored in\nDatabase\n\n_Table1: Permissions List_\nUpon inspecting the Android components in the fake app’s manifest file, we identified the following entry point classes:\n\n1. com.ppnt.ccmd.aavv.Nforg – The class which executes first when the malware is initiated by the user. The\n\ndeclaration of the application subclass in the manifest file is shown in below figure.\n\n_Figure 6: Declaration of Application Subclass in Manifest_\n\n1. com.fomta.c002.MainActivity – The activity class which executes and displays the starting page of the app.\n\nLauncher activity declaration is shown in Figure 7.\n\n_Figure 7: Declaration of Launcher Activity in Manifest_\nIn the manifest file, the malware has declared a service for accessing Android’s Accessibility Service.\n\n_Figure 8: Declaration of Accessibility Service in Manifest_\n**Accessibility Service is a background service running in the device with the purpose of aiding users with disabilities.**\n\n[Malware such as Banking trojans,](https://blog.cyble.com/2021/07/30/aberebot-on-the-rise-new-banking-trojan-targeting-users-through-phishing/) [Remote Access Trojans (RATs) and Spyware abuse this service to intercept and](https://blog.cyble.com/2021/07/28/a-deep-dive-analysis-of-a-fake-coronapp-targeting-android-users-from-colombia/)\nmonitor all activities happening on the device screen. An example of this is the ability to intercept the credentials being\nentered by the user on any app.\n\nMost of the component classes declared in the Manifest file are not present in the APK. As shown in the below figure,\nthe launcher activity, Accessibility service, and several other classes are also missing in the APK.\n\n\n-----\n\n_Figure 9: Classes Missing in the decompiled APK_\n\n### Source Code Analysis\n\nUpon further analysis, we observed that the malware authors used packer software to conceal the actual behavior of\nthe spyware. In this case, the malware is packed using custom packer software. Additionally, the malware also uses\nmultiple obfuscation techniques to evade detection and to restrict reverse engineering.\n\n**Packers are a type of software used by developers to hide important code from reverse engineering. The code**\nwill only unpack during the execution of the application.\n\n### Unpack the DEX Files\n\nOur investigation on the application subclass led us to a code where the spyware filters\nand passes the two suspicious DEX files, secret_classes.dex and secret_class2.dex files.\n\nThe two files are passed to a function named decrypt which is part of a native library, libdn_ssl.so. The code\nflow used in the malware to decrypt the DEX files is shown in the below figure.\n\n_Figure 10: Code flow to unpack DEX files_\nUpon analyzing the libdn_ssl.so file, we found that the DEX files are encrypted using the AES-128-bit\nencryption technique. The code used for decryption is shown in Figure 11. The key used in the encryption is also\nhighlighted below.\n\n\n-----\n\n_Figure 11: Code in a native library used to Decrypt DEX Files_\nWe decrypted the DEX and files using the above findings. Upon decryption, we observed that the missing classes are\npresent in the unpacked DEX files. We also found that the spyware uses anti-sandboxing techniques to stay\nundetected.\n\n### Anti-Sandbox Techniques\n\nThe malware performs anti-sandboxing techniques in the initial stages of the execution (after unpacking the DEX\ncode) to hide its malicious behavior. The below code depicts the checks performed by the malware in the initial stages\nof execution. The malware does not execute if the device is a test environment as shown in the below figure.\n\n_Figure 12: Code for Anti-sandboxing checks_\nThe anti-sandbox techniques used are:\n\n\n-----\n\n1. Checks for test device (checks for the presence of adb): adb is enabled in most of the test devices. The code\n\nused by the spyware to check adb is shown in below figure.\n\n_Figure 13: Code to check for_\n\n_Test Device_\n\n1. Anti-Emulator Checks: Checks for emulator driver files and device fingerprints as shown in the Figure 14.\n\n_Figure 14: Code to check for emulator drivers and fingerprints_\n\n1. Device root check: Check for the presence of rooting software in device as shown below.\n\n_Figure 15: Code to check for rooting software’s_\n\n1. Proxy and VPN Checks: Malware analyst uses proxies and VPNs to capture the traffic of the malware. The code\n\nused to check for the presence of this technique is shown in the below figure.\n\n\n-----\n\n_Figure 16: Code to check for VPN and Proxies_\n\n1. Device Language: The spyware verifies whether the device uses Korean language as shown in the code below.\n\n_Figure 17: Code to check for the_\n\n_device language_\nThe spyware checks for the Korean language used in the victim’s device which concludes that the malware is\ncreated to target Korean-speaking users.\n\nThe fake application reveals the spyware behavior only if the malware identifies the device is not a sandboxing\nenvironment.\n\n### Spyware Behavior\n\nThe malware prompts the user to enable Accessibility permission on start, post the anti-sandboxing check. Upon\nenabling the permission, the malware has the capability to enable all other permissions requested with the help of the\nAccessibility service. The code used to request the Accessibility permission is shown below.\n\n_Figure 18: Code to Request User to enable Accessibility Permission_\nThe code used to enable all other permissions is shown in the figure below.\n\n\n-----\n\n_Figure 19: Code to enable all permission of spyware_\nThe spyware also displays the HTML files in the assets folder using a WebView. Upon analyzing the HTML files, we\nobserved that the spyware creates a fake webpage to collect user information. The below figure shows the starting\nwebpage and the other web pages used to collect user information.\n\n_Figure 20: Fake Webpage displays on app start_\nUsing the fake webpage, the spyware collects information such\nas name, Resident Registration Number (RRN), company name, phone number, etc.\n\nUpon further analysis, we observed that the malware collects information from the victim’s device such as:\n\nContacts from device phonebook\nSMSs\nCall Logs\nAudio and Video recording\nGPS Location\n\n\n-----\n\nApplications List\nScreen Content as text\n\nThe malware uses a service called, com.fomta.c002.service.LInitService, to perform the spyware activity.\n\nThe spyware collects information based on the commands from the TA’s Command & Control (C&C) server.\n\nThe below figure shows the code to collect contacts from the victim’s device phonebook.\n\n_Figure 21: Code to collect Contacts from the victim device_\nThe spyware also constantly monitors victim’s activities such as:\n\nIntercepting phone calls and recording phone call audio\n\nReceiving SMSs\n\nThe malware sends SMS messages based on commands from C&C, shared by the TA. The code used to send SMS\nmessages is shown in the figure below.\n\n_Figure 22: Code to send SMS_\n\n_message based on C&C command_\nThe malware also has the capability to make a phone call without user interaction as shown in the Figure 23.\n\n_Figure 23: Code to make phone call based on_\n\n_C&C command_\nThe malware encrypts the collected data and uploads it to the C&C server based on the commands from the TA. The\ncode to encrypt the data before the upload is shown in Figure 24.\n\n\n-----\n\n_Figure 24: Code to Encrypt Upload Data_\nThe spyware uses two different C&C server IPs.\n\n1. C&C IP1: hxxp://125[.]227.0.22/: Encrypted and stored in a native library, libfirebase.so\n\n1. C&C IP2: hxxp://45[.]115.127.106/: Encrypted and stored in a GitHub account\n\nGitHub URL: hxxps://raw[.]githubusercontent.com/maxw201653/dest/main/pwdText\n\nC&C IP1 is encrypted using AES-128-bit encryption and Base64. The code used to decrypt the IP is shown in the below\nfigure.\n\n_Figure 25: Code to_\n\n_decrypt C&C server IP1_\nFigure 26 shows the code used to retrieve the C&C IP2 from the GitHub repository.\n\n_Figure 26: Code to Retrieve encrypted C&C IP2 URL from GitHub_\n\n\n-----\n\nThe code used by the spyware to decrypt the C&C IP2 is shown in the below figure.\n\n_Figure 27: Code to decrypt C&C IP2_\n\n### Resilience\n\nThe malware has registered listeners for the victim’s device events and initiates the spyware\nactivity accordingly. These events include BOOT_COMPLETED, NEW_OUTGOING_CALL, etc. The below figure\nshows one such listener and events registered.\n\n_Figure 28: Declaration of the Listener and Events registered for resilience_\nThe fake application invokes the LInitService, as shown in the figure below. This is the service that initiates the spyware\nactivity.\n\n_Figure 29: Code to initiate spyware activity based on_\n\n_device events_\n\n### Commands\n\nThe TA sends the commands as integer values and the spyware translates it to the commands as shown in Figure 30.\n\n\n-----\n\n_Figure 30: Code to translate_\n\n_commands from C&C_\n\n## Conclusion\n\nAs per our observations, during the Covid-19 pandemic, there has been a substantial increase in malware\n[targeting financial services. Some notable examples are Aberebot,](https://blog.cyble.com/2021/07/30/aberebot-on-the-rise-new-banking-trojan-targeting-users-through-phishing/) [S.O.V.A., etc. This spyware is one of the latest](https://blog.cyble.com/2021/09/14/deep-dive-analysis-of-s-o-v-a-android-banking-trojan/)\namongst them.\n\nThe TA uses sophisticated techniques to evade detection and infect multiple users. Identifying phishing pages and fake\napplications is a best practice for not being a victim of this type of malware.\n\n## Our Recommendations\n\nWe have listed some of the essential cybersecurity best practices that create the first line of control against attackers.\nWe recommend that our readers follow the best practices given below:\n\n1. If you find this malware in your device, uninstall using adb uninstall or perform a factory reset.\n2. Use the shared IoCs to monitor and block the malware infection.\n3. Keep your anti-virus software updated to detect and remove malicious software.\n4. Keep your Operating System and applications updated to the latest versions.\n5. Use strong passwords and enable two-factor authentication.\n6. Download and install software only from registered app stores.\n\n## MITRE ATT&CK® Techniques\n\n**Tactic** **Technique ID** **Technique Name**\n\n\nDefense Evasion [T1406](https://attack.mitre.org/techniques/T1406)\n\n[T1444](https://attack.mitre.org/techniques/T1444/)\n\n[T1581](https://attack.mitre.org/techniques/T1581/)\n\n[T1575](https://attack.mitre.org/techniques/T1575/)\n\n\nObfuscated Files or Information\n\nMasquerade as Legitimate Application\n\nGeofencing\n\nNative Code\n\n\nCredential Access [T1412](https://attack.mitre.org/techniques/T1412/) Capture SMS Messages\n\n\n-----\n\nDiscovery [T1421](https://attack.mitre.org/techniques/T1421)\n\n[T1430](https://attack.mitre.org/techniques/T1421%22%20%EF%BF%BDHYPERLINK%20%22https://attack.mitre.org/techniques/T1430)\n\n[T1424](https://attack.mitre.org/techniques/T1424)\n\n[T1418](https://attack.mitre.org/techniques/T1418/)\n\nCollection [T1507](https://attack.mitre.org/techniques/T1507)\n\n[T1412](https://attack.mitre.org/techniques/T1412/)\n\n[T1432](https://attack.mitre.org/techniques/T1432/)\n\n[T1429](https://attack.mitre.org/techniques/T1429)\n\nCommand and Control [T1571](https://attack.mitre.org/techniques/T1571)\n\n[T1573](https://attack.mitre.org/techniques/T1573)\n\n\nSystem Network Connections Discovery\n\nLocation Tracking\n\nProcess Discovery\n\nApplication Discovery\n\nNetwork Information Discovery\n\nCapture SMS Messages\n\nAccess Contact List\n\nCapture Audio\n\nNon-Standard Port\n\nEncrypted Channel\n\n\nImpact [T1447](https://attack.mitre.org/techniques/T1447) Delete Device Data\n\n## Indicators of Compromise (IoCs): \n\n**Indicators** **Indicator**\n**type**\n\n\n**Description**\n\n\ned7ef6718a6b6e7abf3bd96c72929ee9f1e9a4bfcd97429154141c7702093f36 SHA256 Hash of the APK\nsample\n\nb4d3d4519427eec34c709a6d6ca43b9001fcc5802a71c8d3afa45cd4f3505626 SHA256 Hash of the second\nAPK sample\n\n14264416ad72a75ac2e2a399a9b19b7533bcf33d8427bea0241a317f513acb50 SHA256 Hash of the third APK\nsample\n\n8dbc872f284fbe5eee635aab96a08bc6441ac10f3a5b8eb3aab712b52ca73534 SHA256 Hash of the fourth APK\nsample\n\nhxxp://114[.]47.93.211 URL Phishing page used to\ndeliver first APK\n\nhxxp://61.227.36[.]150 URL Phishing page used\nto deliver second and\nthird APK\n\nhxxp://125[.]227.0.22/ URL C&C URL1\n\nhxxp://45[.]115.127.106/ URL C&C URL2\n\n## About Us\n\n[Cyble is a global threat intelligence SaaS provider that helps enterprises protect themselves from cybercrimes and](https://cyble.com/)\nexposure in the Darkweb. Its prime focus is to provide organizations with real-time visibility to their digital risk footprint.\nBacked by Y Combinator as part of the 2021 winter cohort, Cyble has also been recognized by Forbes as one of the top\n20 Best Cybersecurity Start-ups To Watch In 2020. Headquartered in Alpharetta, Georgia, and with offices in Australia,\nSingapore, and India, Cyble has a global presence. To learn more about Cyble, visit [www.cyble.com.](https://cyble.com/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-17 - Sophisticated Spyware Posing as a Banking Application To Target Korean Users.pdf"
    ],
    "report_names": [
        "2021-09-17 - Sophisticated Spyware Posing as a Banking Application To Target Korean Users.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535666,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653692762,
    "ts_modification_date": 1653692762,
    "files": {
        "pdf": "https://archive.orkl.eu/ea620d6817922b2260264d02b13b28ab34edfbeb.pdf",
        "text": "https://archive.orkl.eu/ea620d6817922b2260264d02b13b28ab34edfbeb.txt",
        "img": "https://archive.orkl.eu/ea620d6817922b2260264d02b13b28ab34edfbeb.jpg"
    }
}