{
    "id": "0af9a043-6cdd-4b32-8646-04aace092803",
    "created_at": "2023-01-12T15:09:31.796827Z",
    "updated_at": "2025-03-27T02:08:00.011701Z",
    "deleted_at": null,
    "sha1_hash": "7a3d7d71ed1b997cedc678029253b6dd8dd77c07",
    "title": "2021-05-03 - Spearphishing Attack Uses COVID-21 Lure to Target Ukrainian Government",
    "authors": "",
    "file_creation_date": "2022-05-28T02:16:47Z",
    "file_modification_date": "2022-05-28T02:16:47Z",
    "file_size": 183859,
    "plain_text": "# Spearphishing Attack Uses COVID-21 Lure to Target Ukrainian Government\n\n**[fortinet.com/blog/threat-research/spearphishing-attack-uses-covid-21-lure-to-target-ukrainian-government](https://www.fortinet.com/blog/threat-research/spearphishing-attack-uses-covid-21-lure-to-target-ukrainian-government)**\n\nMay 3, 2021\n\n**[FortiGuard Labs Threat Research Report](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)**\n\nAffected platforms: Microsoft Windows\n\nImpacted parties: Windows Users\n\nImpact: Collection of sensitive information from infected victims\n\nSeverity level: High\n\n## Introduction\n\n[FortiGuard Labs has discovered yet another COVID themed lure designed to compel](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)\nunsuspecting victims to click on what appears at first be an innocuous link. However,\nunbeknownst to the target, the link leads to a zip file that contains malicious attachments.\n\n\n-----\n\nThis blog will highlight the steps taken by an unnamed threat actor targeting the security\ninterests of a former Eastern bloc nation.\n\n### Key Takeaways of This Blog\n\nSpearphishing emails were sent to various security arms of the Ukrainian government\nutilizing social engineering lures containing subjects such as: “New COVID-21 Variant”\nand “An Urgent Computer Update”.\nAttacker’s goals\n\nSteal sensitive documents and files\nInstall Saint Bot Downloader on targets\nNote: The Saint Bot Downloader has been observed downloading infostealers and\nother downloaders.\n\n## Overview\n\nThis latest iteration of the COVID-themed lures we have been seeing over the past year is\nnot about COVID-19, but a fictitious COVID-21 (bypassing the equally fictitious COVID-20\nentirely!) using a fake World Health Organization (WHO) link. It is likely that the threat actor\nis hoping that the novelty of a COVID-21 announcement might entice the recipient into\nfollowing the link, either through misjudgment or sheer curiosity. The following research looks\nat possible motivations for this particular attack, as well as provides technical analysis of the\nmalware involved and related infrastructure.\n\nIn this case, we have observed specific instances of spearphishing emails being sent to\nvarious arms of the Ukrainian government and have also identified that the infrastructure\nused for these attacks originates in Russia. The first instance we detected targeted two\nseparate entities of the Ukrainian government, both dealing with security interests of the\nUkrainian state.\n\nFigure 1. Message body of the COVID-21 Lure\n\nThe email purports to originate from a “Political Officer” at the United States Embassy.\nInterestingly, a search engine check revealed that Political Officer is indeed an actual title\nwithin the US State Department. Further, a review of the email headers highlights that the\nsender is either a legitimate Gmail account created for such spam purposes, or one that has\nbeen compromised, as the email was relayed through Gmail servers. Sending spam email\nthrough clean reputable servers as a relay is an ideal tactic for attackers as they are often\nallowed to bypass spam filtering software since they originate from a reputable IP block.\n\nThis email is targeting one of the security arms of the Ukrainian Government. However, a\nsearch engine result yielded no results for the email address, which leads us to believe that\nthis is either a targeted or a dictionary/harvest based attack.\n\n\n-----\n\nAnother tactic observed was that the threat actors used masqueraded emails within the\nmessage body containing a back and forth conversation between (likely fictitious) personnel\nat the World Health Organization (WHO) and the United States Department of State\n(state.gov). We surmise that this email is targeted as it includes government-specific\ncommunication and not, for example, a generic purchase order from a random industry\nvertical, etc.\n\n## Technical Details\n\nInstead of using attachments, this lure opted to use a link to deliver its payload, further\nensuring that the spearphishing email makes it to the intended victim by bypassing security\ntools that detect and neutralize malicious attachments. The fake WHO link goes to\nhxxps://cut[.]ly/LcHx2Ga, which redirects to hxxp://2330[.]site/NewCovid-21[.]zip. The\ncontents of the zip archive are shown below.\n\nFigure 2. Zip file archive\n\nThe PDF is legitimate and not malicious. The other files however, are each malicious in their\nown way. The two shortcut files appear to launch cmd.exe. However, after examining these\ntwo files further, we found that the true attack vector actually uses cmd.exe to launch\n[PowerShell in order to download and execute yet another malicious file.](https://www.fortinet.com/blog/threat-research/offense-and-defense-a-tale-of-two-sides-powershell?utm_source=blog&utm_campaign=offense-and-defense-a-tale-of-two-sides-powershell)\n\nThe final file contained in the zip archive is a malicious document that exploits CVE-201711882 (Microsoft Office Equation Editor Vulnerability) and acts similarly to the shortcut files.\nAffecting multiple Microsoft Office versions, up to Word 2016, CVE-2017-11882 allows\narbitrary code execution in the context of the current user by failing to properly handle\nobjects in memory. By exploiting this vulnerability, the document is able to download and\nexecute yet another malicious file.\n\nEach of these malicious files will be explored further in the next sections.\n\n## Malicious Shortcuts (LNK) Files\n\nThe shortcut files at first appear to be benign:\n\nFigure 3. Properties of LNK file\n\nNothing except cmd.exe and whitespace can be seen. Peering into the .lnk file itself with a\nhex editor, or even a strings command, however, shows there is a PowerShell command\nhidden within. The essence of this command is to download a file from\nhxxp://2330[.]site/soft/08042021[.]exe and saves it as %TEMP%\\WindowsUpdate.exe. It\nthen executes the downloaded file.\n\nA cursory review of the 2330.site reveals that the domain has been associated with the\nfollowing IP addresses in the past:\n\n\n-----\n\n95.143.218[.]55\n31.31.205[.]163\n195.128.123[.]215\n185.195.27[.]112\n176.113.115[.]133\n\nAll of these IP addresses resolve back to the Russian Federation.\n\nA quick perusal of the WindowsUpdate.exe files shows that it is packed. Underneath the\nsurface lies an AutoIT file that cannot be decompiled by a standard decompiler. To get\naround this roadblock, the AutoIT compiled script can be found in memory and dumped into\na separate file.\n\nFigure 4. AutoIT compiled script from memory\n\nThe bytecode in this file can then be decompiled properly.\n\nFigure 5. Results after decompiling\n\nThis AutoIT script is designed to exfiltrate user files. It targets filetypes located in the user’s\nhome directory and uploads them to a server.\n\nThe targeted filetypes are: .doc, .pdf, .ppt, .dot, .xl, .csv, .rtf, .mdb, .acdb, .pot, .pps, .ppa,\n.rar, .zip, .tar, .7z.\n\nFigure 6. Filetypes targeted\n\n[Given the branches of the government targeted by this phishing attack, the filetypes being](https://www.fortinet.com/resources/cyberglossary/phishing?utm_source=blog&utm_campaign=phishing)\ncaptured could potentially vary from benign to sensitive to even classified information.\n\nFiles stolen by this script are uploaded to hxxp://name4050[.]com:8080/upld/\n\n## Malicious Word Document\n\nThe last file in the NewCovid-21.zip archive is a malicious document that exploits CVE-201711882 (Microsoft Equation Editor Vulnerability). The exploit forces the user to visit\nhxxp://bit[.]ly/3rQULnp. The user is then redirected to a predetermined URL,\nhxxp://name1d[.]site/index.txt. This is not a text file, but a PE file that then gets executed.\n\n### Part 1 of Social Engineering Lures\n\nThe downloaded PE file is also packed. After some investigation, we determined that its\ncontents are similar to the files downloaded by the LNK files.\n\nFigure 7. Analysis of downloaded PE file from hxxp://name1d[.]site/index.txt\n\n\n-----\n\nThe only significant difference in this sample is that it uploads gathered files to a different C2\nserver: hxxp://31.42.185[.]63:8080/upld/. The list of filetypes is still the same.\n\n### Part 2 - A Saint Amongst Blocs\n\nSometime later, a different index.txt file was served, possibly for a different campaign. We\n[analyzed this new file as well. It is a PE file that is a variant of the Saint malware recently](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\ndiscovered by security researchers. As it is a downloader, its possible uses are limitless. It\nhas been observed to even download other downloaders as well.\n\nThis version turned out to be Saint_v3, which operates similarly to the one analyzed here:\n(https://blog.malwarebytes.com/threat-analysis/2021/04/a-deep-dive-into-saint-botdownloader/). However, the C2 server this variant goes to is hxxp://smm2021[.]net/wpadm/gate.php and it uses compromised WordPress sites to communicate. It may also use\n8003659902[.]site as well as 8003659902[.]space as part of its network infrastructure.\n\nSaint_v3 has specific functionality in case it ends up running on a Windows 10 machine. It\nchecks the registry for the ProductName to see if it is Windows 10. If so, it then checks for\nanother registry setting, called ConsentPromptBehaviorAdmin, to see if it has a value of 5.\n\nMicrosoft defines this value as: ‘[T]he default. It is used to prompt the administrator in Admin\n_Approval Mode to select either \"Permit\" or \"Deny\" for an operation that requires elevation of_\n_privilege for any non-Windows binaries. If the Consent Admin selects Permit, the operation_\n_will continue with the highest available privilege. This operation will happen on the secure_\n_desktop.’_\n\nIt then performs a few other actions under a Windows 10 environment.\n\nOne unique thing that was observed is that this malware will not run on an infected computer\nrunning one of the following locales:\n\nFigure 8. Locales avoided by Saint Malware\n\nGiven that the phishing email gathered indicates that it is targeting a victim based in the\nformer Eastern Bloc, and may be using one of the listed locales, one wonders if the attackers\nhave narrowed down their target to the point they know the victim does not use any of these\nlocales? Perhaps as a defensive posture, the victim was using English or another version,\nand the attacker knew this? In any case, this just adds another layer of mystery to this attack.\n\nEven though there is not much code in the AutoIT samples, the same coding method is seen\nin the downloaded Saint_v3 files.\n\nFigure 9. Cleaning up all evidence\n\nThe cleanup functions are somewhat similar.\n\n\n-----\n\n## Urgent Update Variation\n\nAnother sample that we observed appears to be related to this same campaign, and is\nlikewise targeting a security arm of the Ukrainian government. Its email purports to be\ncoming from the main security arm of the Ukrainian government, and the link attempts to\nconvince the target that orders are coming from higher in the chain of command, possibly\nhoping that the link will be clicked on in a moment of misjudgment. The email address that\nthis spearphishing email is being sent from can actually be found on the main page of the\nwebsite of this security arm of the Ukrainian government:\n\nFigure 10. Original Urgent Update Email\n\nFigure 11. Urgent Update Email (Translated to English)\n\nThe broken text in the subject line that could not be rendered is:\n\nTермінове оновлення !!!\n\nWhich translates to English as:\n\nUrgent Update\n\nClicking on the forged [redacted].gov.ua update link leads to a bit.ly URL shortener link that\ngoes to redirect[.]co.ua, which then redirects to a predetermined download site that contains\nthe following zip file:\n\nhxxp://2215[.]site/soft2/Update-AV[.]zip\n\nThis Update-AV file\n\n[C33A905E513005CEE9071ED10933B8E6A11BE2335755660E3F7B2ADF554F704A] is\nalso a malicious Saint_v3 file. The icon used by this malware is the country’s flag with a\nshield on it to lend a sense that this is a legitimate protection update, as the email alluded to.\n\nFigure 12: Malicious Update-AV file\n\nNotice the similarity in the nomenclature between both domains (2215[.]site and 2330[.]site).\nThe 2215[.]site domain is registered to fed****kar@rambler[.]ru. As of April 21st, both of\nthese domains share the same IP address, [176[.]113.115.133]. While performing a dig on\nboth domains we discovered the following:\n\nFigure 13. Dig for 2215[.]site\n\nFigure 13b. Dig for 2330[.]site\n\n\n-----\n\nWe can assume that these sites are both under the control of the same attacker or attacking\ngroup. Because of the similarity of the attacks to the examples above, we will focus on the\nshared infrastructure between the 2330[.]site and 2215[.]site that ties both campaigns\ntogether.\n\n_Connecting the dots_\n\nA search on the 2330[.]site domain reveals that the domain is registered to the email contact\nkun*******1969@rambler[.]ru. Subsequent searches reveal that the registrant owns the\nfollowing domains:\n\n1017[.]site\n\n1202[.]site\n\n2330[.]site\n\n29572459487545-4543543-543534255-454-35432524-5243523-234543[.]xyz (this had only\nbeen registered for three days at the time of writing)\n\nBelow is a screenshot tying in the infrastructure below, along with the connection to the IP\naddress 176[.]113.115.133 to the following domains:\n\n2330[.]site\n\n2115[.]site\n\n29572459487545-4543543-543534255-454-35432524-5243523-234543[.]xyz\n\nFigure 14. Shared infrastructure\n\n## C2 Infrastructure\n\nThis is the 2330[.]site DNS over time:\n\n**Date** **Class** **Type** **IP**\n\n2021/01/11 04:08:54 PM IN A 95[.]143.218.55\n\n2021/04/20 11:27:04 PM IN A 185[.]195.27.112\n\n2021/04/21 10:01:25 PM IN A 176[.]113.115.133\n\n\n-----\n\nThis is the name4050[.]com DNS Over time\n\n**Timestamp** **Class** **Type** **Response**\n\n2021/04/03 07:10:58 AM IN A 31[.]42.185.63\n\n## Conclusion\n\nThe spearphishing examples above highlight the ways that attackers leverage simple\ntechniques to coerce and compel a target into following a link. Although, the attacker in this\ncase has spent time crafting the spearphishing email, setting up the fake URLs that lead\nelsewhere, and using the Saint_v3 malware, this is by no means a sophisticated attack. But\nplanning something like this, including the infrastructure that goes with it, takes time and\nresources.\n\nOne example of the lack of sophistication of this spearphishing email is that it is obvious that\nthe message body appears to be rushed, given the grammar issues, etc. And the strategy\nused is not unique. It is the same old spearphishing strategy that we’ve seen many times\nbefore. However, the Covid-21 lure is unique and preys on the public’s fears of the\nunknown.\n\nWhat is most concerning is that such attacks are often successful, and the malware being\ndelivered can just be the beginning of a bigger attack as Saint itself is a downloader. And\nonce a backdoor access is achieved, a multitude of things can occur, such as a [ransomware](https://www.fortinet.com/resources/cyberglossary/ransomware?utm_source=blog&utm_campaign=ransomware)\ninfection, damage to the reputation and bottom line of any organizations, and given the\nagencies targeted in this campaign, the potential loss of sensitive information and state\nsecrets.\n\nIn the grand scheme of things, it doesn’t really matter how ineffective or rushed an attack like\nthis might be, because all it takes is a one mistake by one of the targeted victims. And once\nthis occurs, the attacker has a beachhead within which to establish a foothold. When political\ntensions are high, gathering intelligence is critical. And it is easy to just send widespread and\nfar flung lures in the hope of getting one person to fall prey as part of a larger strategy. All it\ntakes is one bite and you are in.\n\nAttackers know that there are many layers of security that they have to get through to get the\ndata or resources they are targeting. And although there have been many technological\nadvancements in security over time, the weakest link in any defense is still the human one.\nBecause humans are fallible, organization must take the time to train and emphasize to its\nemployees that such attacks exist—and happen quite often. They need to be the focus of\ncontinuous internal security training sessions, as no amount of technology can stop human\ncuriosity, fear, and misjudgment.\n\n\n-----\n\n## Fortinet Protections\n\nFortinet customers are already protected from this Saint V3 campaign and associated files\nwith FortiGuard’s AntiVirus and WebFiltering services, as follows:\n\nThe redirected URLs launched from the Word Document and LNK samples are rated as\n\"Malicious Websites\" by the FortiGuard Web Filtering service.\n\nThe attached \"Covid-21\" Word Document file is detected as “RTF/CoinMiner.OIE!exploit” the\nindex.txt [AutoIT exfiltrator] file is detected as \"W32/GenKryptik.FDZD!tr,\" the\nWindowsUpdate.exe [AutoIT exfiltrator] is detected as \"W32/Kryptik.HKKC!tr\" and the\nSaintv3 downloader \"W32/Kryptik.HKMB!tr\" are blocked by the FortiGuard AntiVirus service.\n\nFor FortiEDR protections, all published IOC's were added to our Cloud intelligence and will\nbe blocked if executed on customer systems.\n\nThe FortiGuard AntiVirus service is supported by FortiGate, FortiMail, FortiClient, and\nFortiEDR. The Fortinet AntiVirus engine is a part of each of those solutions as well. As a\nresult, customers who have these products with up-to-date protections are protected.\n\nWe also suggest our readers to go through the free NSE training -- NSE 1 – Information\nSecurity Awareness, which has a module on Internet threats designed to help end users\nlearn how to identify and protect themselves from phishing attacks.\n\nFortinet’s Phishing Simulation Service, FortiPhish, can also be used to proactively test the\nsusceptibility of your organization to these kinds of phishing attacks.\n\n## MITRE ATT&CK:\n\nInitial Access\n\n==============\n\nSpearphishing Link - T1566.002\n\nExecution\n\n=========\n\nPowerShell - T1059.001\n\nWindows Command Shell - T1059.003\n\nExecution for Client Execution - T1203\n\nMalicious Link - T1204.001\n\n\n-----\n\nDefense Evasion\n\n===============\n\nExecution Guardrails - T1480\n\nFile Deletion - T1070.004\n\nDiscovery\n\n=========\n\nFile and Directory Discovery - T1083\n\nCollection\n\n==========\n\nData from Local System - T1005\n\nCommand and Control\n\n===================\n\nWeb Protocols - T1071.001\n\n**IOCs**\n\nFile: COVID-21.doc\n\n- Size: 4184194 bytes\n\n- MD5: 44697AAD796C0D82C1ADBEE15FD1266B\n\n- SHA256:\n9803E65AFA5B8EEF0B6F7CED42EBD15F979889B791B8EADFC98E7F102853451A\n\nDetected by FortiGuard Anti-Virus as: RTF/CoinMiner.OIE!exploit\n\nFile: index.txt\n\n- Size: 744448 bytes\n\n- MD5: D377C71F7DF1C515705EB6B0CC745F7D\n\n- SHA256:\n89DA9A4A5C26B7818E5660B33941B45C8838FA7CFA15685ADFE83FF84463799A\n\n- AutoIT file stealer\n\n\n-----\n\nDetected by FortiGuard Anti-Virus as: W32/GenKryptik.FDZD!tr\n\nFile: index.txt/Update-AV.exe\n\n- Size: 229888 bytes\n\n- MD5: 9AE3D8BA1311AF690523AEB2E69BB469\n\n- SHA256:\nC33A905E513005CEE9071ED10933B8E6A11BE2335755660E3F7B2ADF554F704A\n\n- Saint_v3\n\nDetected by FortiGuard Anti-Virus as: W32/Kryptik.HKMB!tr\n\nFile: WindowsUpdate.exe\n\n- Size: 612352 bytes\n\n- MD5: E4855693722DE3856421B1B6920BA54D\n\n- SHA256:\n0E1E2F87699A24D1D7B0D984C3622971028A0CAFAF665C791C70215F76C7C8FE\n\n- AutoIT file stealer\n\nDetected by FortiGuard Anti-Virus as: W32/Kryptik.HKKC!tr\n\nThe following URLs are blocked by the WebFiltering Client:\n\n31[.]42.185.63\n\n1017[.]site\n\n1202[.]site\n\n2330[.]site\n\nname1d[.]site\n\nname4050[.]com\n\nhttp://smm2021[.]net/wp-adm/gate.php\n\n29572459487545-4543543-543534255-454-35432524-5243523-234543[.]xyz\n\n_[Learn more about FortiGuard Labs threat research and the FortiGuard Security](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n\n-----\n\n_Learn more about Fortinet s_ _[free cybersecurity training initiative or about the Fortinet](https://www.fortinet.com/blog/business-and-technology/fortinet-offers-free-cybersecurity-training-courses?utm_source=blog&utm_campaign=free-cybersecurity-training-courses)_ _NSE_\n_Training program,_ _[Security Academy program, and](https://training.fortinet.com/local/staticpage/view.php?page=fnsa&utm_source=blog&utm_campaign=fnsa)_ _[Veterans program.](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=fortivet)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-03 - Spearphishing Attack Uses COVID-21 Lure to Target Ukrainian Government.pdf"
    ],
    "report_names": [
        "2021-05-03 - Spearphishing Attack Uses COVID-21 Lure to Target Ukrainian Government.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536171,
    "ts_updated_at": 1743041280,
    "ts_creation_date": 1653704207,
    "ts_modification_date": 1653704207,
    "files": {
        "pdf": "https://archive.orkl.eu/7a3d7d71ed1b997cedc678029253b6dd8dd77c07.pdf",
        "text": "https://archive.orkl.eu/7a3d7d71ed1b997cedc678029253b6dd8dd77c07.txt",
        "img": "https://archive.orkl.eu/7a3d7d71ed1b997cedc678029253b6dd8dd77c07.jpg"
    }
}