{
    "id": "0b142be7-7b9d-481a-8df4-aaa0944a51d5",
    "created_at": "2023-01-12T15:05:34.246863Z",
    "updated_at": "2025-03-27T02:05:27.03259Z",
    "deleted_at": null,
    "sha1_hash": "2b6f2be56b0d988e821f74da09f4dc0b0a24b6e0",
    "title": "2019-06-27 - Criminals, ATMs and a cup of coffee",
    "authors": "",
    "file_creation_date": "2022-05-29T10:52:43Z",
    "file_modification_date": "2022-05-29T10:52:43Z",
    "file_size": 171696,
    "plain_text": "# Criminals, ATMs and a cup of coffee\n\n**[securelist.com/criminals-atms-and-a-cup-of-coffee/91406/](https://securelist.com/criminals-atms-and-a-cup-of-coffee/91406/)**\n\nAuthors\n\n[Konstantin Zykov](https://securelist.com/author/konstantinzykov/)\n\nIn spring 2019, we discovered a new ATM malware sample written in Java that was uploaded\nto a multiscanner service from Mexico and later from Colombia. After a brief analysis, it\nbecame clear that the malware, which we call ATMJaDi, can cash out ATMs. However, it\ndoesn’t use the standard XFS, JXFS or CSC libraries. Instead, it uses the victim bank’s ATM\nsoftware Java proprietary classes: meaning the malware will only work on a small subset of\nATMs. It makes this malware very targeted.\n\nKaspersky products detect the sample as Trojan.Java.Agent.rs\n\n## Technical Details\n\nFirst, as with most other ATM malware, the attackers must find a way to install the malware\non the target ATMs. The malware can’t be controlled via the ATM keyboard or touchscreen,\nbecause it runs a self-crafted HTTP server web interface for its purpose. So the criminals\n\n\n-----\n\nmust have network access to the target ATM. This makes us believe that the criminals have\ncompromised the bank’s infrastructure to gain access to the network that the ATMs are\nconnected to.\n\nOnce installed and executed, the malware, in the form of a Java archive file called\n“INJX_PURE.jar”, looks for the process that controls the ATM and injects itself into it, giving it\ncontrol of the legitimate ATM process. After injection, the malware prints a message on the\nterminal simultaneously in several languages: Russian, Portuguese, Spanish and Chinese.\nHowever, all the other messages or strings used by the malware are in English. The different\nlanguage phrases shown in the output can be translated into English as “Freedom and\nglory”. This is followed by the additional Russian message “отдельный”, which means\n“separate”. We believe this might be a false flag, because native Russian speakers would\nnever use this word in this context.\n\nСвобода и слава\nLiberdade e glória\nLibertad y gloria\n自由与荣耀\nотдельный\n\nNext, an HTTP server is started that accepts commands using predefined URL paths. They\nare:\n\n**/d to dispense or to get the ATM cassette to carry out actions (the proper action is**\ndetermined by the passed parameters);\n**/eva to evaluate (run) user-supplied code on the victim ATM;**\n**/mgr for the manager, which gives criminals access to a list of all running classes for**\nthe attached Java virtual machine, so that they can call any function they desire,\nsupplying the arguments if needed;\n**/core allows the criminals to load a specified .jar file from the victim file system;**\n**/root path accepts a POST request body and passes it as a shell command to**\ncmd.exe, returning the resulting output.\n\nThe dispensing and “run a shell” path do not have an interface page with forms and buttons,\nbut instead only accept pre-prepared HTTP POST requests and print the raw text results to a\npage, omitting HTML tags. So, in the case of the dispensing request, the malware response\nwill be the ‘ok’ string. The “get cash units information” request will be followed by a string\ndescribing the ATMs cash units status (see the example below).\n\n1:1000;5:700;10:100;20:30;\n\nThis string consists of four groups, each group separated with a semicolon. It is a list that\ncorresponds to the ATM cash cassette and consists of two values, separated by a colon: the\ndenomination and the actual number of bills in the cassette. In the example above, the first\n\n\n-----\n\ncassette has 1000 banknotes of denomination 1, 700 banknotes of denomination 5, etc.\n\nOther than the “run a shell”, “dispense” and “get cash unit”, the “eva”, “mgr” and “core” paths\nhave interface pages. Below is a screenshot of the evaluation page:\n\n_/eva path interface example screenshot_\n\nIt allows the criminals to paste and run any JavaScript code on a victim ATM and see what it\nreturns. Why JavaScript? Because Java allows the use of external engines, and the\ncriminals used a JavaScript one. Below is the function that the malware uses to run the\npassed JavaScript code.\n\n\n-----\n\n_Malware sample code that can evaluate JavaScript_\n\n## Conclusions\n\nThe targeted nature of ATMJaDi shows that the criminals studied the victim very well before\nwriting their malware. It’s clear that they must have had access to an ATM where the custom\nJava classes were running and most likely to the Java program source code as well.\n\nAlso, the way the malware can be controlled shows that the criminals planned to gain\nnetwork access to the infected ATM, most likely through the bank’s internal network.\n\nWhat banks can do to prevent these types of attacks:\n\nSet up special anti-targeted attack solutions such as KATA (Kaspersky Anti Targeted\nAttack Platform) to protect the bank’s network and other solutions to protect ATMs from\nmalware;\nATM file allowlisting;\nThe bank ATM network has to be isolated and access to it must be highly restricted;\n\nThis is not a complete list of actions: the issue of information security requires constant\nattention and action.\n\nCriminals, ATMs and a cup of coffee\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-27 - Criminals, ATMs and a cup of coffee.pdf"
    ],
    "report_names": [
        "2019-06-27 - Criminals, ATMs and a cup of coffee.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535934,
    "ts_updated_at": 1743041127,
    "ts_creation_date": 1653821563,
    "ts_modification_date": 1653821563,
    "files": {
        "pdf": "https://archive.orkl.eu/2b6f2be56b0d988e821f74da09f4dc0b0a24b6e0.pdf",
        "text": "https://archive.orkl.eu/2b6f2be56b0d988e821f74da09f4dc0b0a24b6e0.txt",
        "img": "https://archive.orkl.eu/2b6f2be56b0d988e821f74da09f4dc0b0a24b6e0.jpg"
    }
}