{
    "id": "0b67fc3b-a0a6-4d29-aab2-3278f8c66b72",
    "created_at": "2023-01-12T15:04:33.486457Z",
    "updated_at": "2025-03-27T02:15:35.779932Z",
    "deleted_at": null,
    "sha1_hash": "98689387b6ec7445365ec1f8dc87d55c4d972b8d",
    "title": "2020-03-16 - New RedLine Stealer Distributed Using Coronavirus-themed Email Campaign",
    "authors": "",
    "file_creation_date": "2022-05-28T02:17:31Z",
    "file_modification_date": "2022-05-28T02:17:31Z",
    "file_size": 3829429,
    "plain_text": "# New Redline Password Stealer Malware\n\n**[proofpoint.com/us/threat-insight/post/new-redline-stealer-distributed-using-coronavirus-themed-email-campaign](https://www.proofpoint.com/us/threat-insight/post/new-redline-stealer-distributed-using-coronavirus-themed-email-campaign)**\n\nMarch 16, 2020\n\nIn early March 2020, Proofpoint researchers observed an email campaign attempting to deliver a previously\nunknown malware which the malware author calls RedLine Stealer. This name (not to be confused with the\nFireEye tool “Redline”) can be seen in the forum advertisements, code comments, and command and\ncontrol (C&C) panel.\n\nThe emails in this password stealer campaign abused the Folding@home brand, which is a distributed\ncomputing project for disease research, while also asking the recipient to help find a coronavirus cure. This\ncampaign primarily targeted healthcare and manufacturing industries in the United States.\n\n\n-----\n\nThe RedLine password stealer virus is new malware available for sale on Russian underground forums with\nseveral pricing options: $150 lite version; $200 pro version; $100 / month subscription option. It steals\ninformation from browsers such as login, autocomplete, passwords, and credit cards. It also collects\ninformation about the user and their system such as the username, their location, hardware configuration,\nand installed security software. A recent update to RedLine Stealer also added the ability to steal\ncryptocurrency cold wallets.\n\nRedLine Stealer is written in C#. While not particularly sophisticated, we were surprised by the high quality\nand readability of the code. Notably with its proper use of delegates, class inheritance, and data models\nalong with using SOAP for its C&C channel. This indicates a moderate-to-high level of experience with the\n.NET programming language from the developer. RedLine Stealer also appears to be under active\ndevelopment as shown by the recent introduction of new features.\n\n## Redline Password Stealer Malware Delivery Analysis\n\nOn March 7, 2020, Proofpoint researchers observed an email campaign consisting of thousands of\nmessages and attempting to deliver RedLine Stealer via a URL in the email messages. The campaign\ntargeted primarily the United States. Recipients were in many different industries but the top affected were\nhealthcare and manufacturing.\n\nEmails were sent from “Shannon Wilson <shannon@litegait[.]com>” with the subject “Please help us with\nFighting corona-virus”. These emails purported to come from \"Mobility Research Inc\" and implored\nrecipients to help find a cure to coronavirus by participating in their program \"Folding@Thome\".\n\n“Folding@Thome” (notice the extra “T”) is a spoof of a legitimate distributed computing project\n[Folding@home. In this project, similar to](https://foldingathome.org/) [SETI@home, participants are asked to help by donating their](https://setiathome.berkeley.edu/)\ncomputing power through the use of an application that does processing on behalf of the organization.\n[According to Folding@home, participants are donating their computing power “for disease research that](https://foldingathome.org/about/)\nsimulates protein folding, computational drug design, and other types of molecular dynamics.”\n\nParticipants in the legitimate Folding@home project download the official application from their website. In\nthis malicious email campaign, recipients are encouraged to download the application via a link in the email.\n\nAfter clicking the link, the user is redirected to the malware executable hosted on BitBucket. Figure 1 shows\na sample of the malicious email.\n\n\n-----\n\nFigure 1 Malicious Spoofed Folding@home Email with link to malware\n\n\n-----\n\nBecause Folding@home participants need to install an application on their system to help the project, the\nuse of this as a lure is particularly clever by the attackers, as recipients who want to help with coronavirus\nresearch may not find the downloading and installation of an application unusual or unexpected.\n\n## RedLine Stealer for Sale\n\nWe found “for sale” advertisements for RedLine Stealer on several forums (one as early as Feb 20, 2020).\nSome appear to be from an official seller with several pricing options ($100 / month subscription; $150 lite\nversion; $200 pro version), while some appear to be a cracked version (selling for $300). The official\nadvertisement is as follows, translated from Russian:\n\n*********************************************************\n\nStealer functionality:\n\nCollects from browsers:\n\nLogin and passwords\nCookies\nAutocomplete fields\nCredit cards\nSupported browsers:\n\nAll browsers based on Chromium (even latest version of Chrome)\nAll Gecko-based browsers (Mozilla, etc.)\nData collection from FTP clients, IM clients\nFile-grabber customizable by Path, Extension, Search-in-subfolders (can be configured for the\nnecessary cold wallets, Steam, etc.)\nSettings by country. Setting up a blacklist of countries where the build will not work\nSettings for anti-duplicate logs in the panel\nCollects information about the victim's system: IP, country, city, current username, HWID, keyboard\nlayout, screenshot, screen resolution, operating system, UAC Settings, is the current build running\nwith administrator privileges, User-Agent, information about PC hardware (video cards, processors),\ninstalled antiviruses\nPerforming tasks:\n\nDownload - download a file from link to the specified path\nRunPE - injection of a 32-bit file downloaded from link into another file\nDownloadAndEx - download a file from link to the specified path with subsequent launch\nOpenLink - open a link in the default browser\n\n*********************************************************\n\nAlso, on March 4, the seller advertised an update that added stealing of cryptocurrency cold wallets.\n\nThe C&C panel is a GUI program installed on a dedicated Windows server, not as a web panel. Specifically,\nthe panel operates as a WSDL application which responds to configured SOAP APIs to interact with the\nclient malware sample. The panel has typical functionality for controlling malware like this including\ndisplaying, sorting, exporting, commenting, searching logs, creating downloads, running tasks. The panel\nboasts having convenient features for log sellers such as exporting logs for a list of websites.\n\nIn Figure 2 you can see the Loader Tasks panel where actions such as “Download”, “RunPE”,\n“DownloadAndEx”, “OpenLink” can be specified.\n\n\n-----\n\nFigure 2 C&C panel showing the Loader Tasks\n\nIn Figure 3 you can see the Settings panel where options such as for log collection can be specified.\n\nFigure 3 C&C panel showing Settings\n\nIn Figure 4 you can see the logs panel where a summary of the stolen information is displayed.\n\n\n-----\n\nFigure 4 C&C panel showing Logs\n\n## Malware Analysis\n\nProofpoint researchers have confirmed all functionality described in the forum advertisements. RedLine is a\nstealer that supports FTP (such as FileZilla, WinSCP), IM clients (such as Pidgin), crypto-currency wallets,\nand browser cookies/settings. It also reports back a range of information about the system and can perform\nadditional tasks such as downloading and running payloads.\n\nIn addition to the features listed above, there were some additional points that we found interesting:\n\nPanel is a WSDL service\nClient configuration is supplied (and updatable) from C&C\nC&C communications use SOAP over HTTP\n\nFigure 5 through Figure 8 below show code samples from RedLine.\n\n\n-----\n\nFigure 5 Showing the list of classes and the “main”\n\n\n-----\n\nFigure 6 Enumeration of credit cards for the Chromium-based browsers\n\nFigure 7 Code for RunPE, injection of a file downloaded from a URL into another file\n\n\n-----\n\nFigure 8 Model for stealer settings from C&C\n\nIn Figure 9 you can see an example of the network traffic generated by the stealer. Specifically, in this traffic\nthe C&C configures the client settings (GrabBrowsers, GrabFTP, etc) via SOAP protocol (over HTTP).\n\nFigure 9 Network traffic from the C&C to configure the client settings\n\n## Conclusion\n\nRedLine Password Stealer virus, a new previously undocumented malware has appeared in a new email\ncampaign aimed at U.S. healthcare and manufacturing organizations. It already has many of the standard\ninformation stealer features, as well as additional features such as downloading secondary payloads and\n\n\n-----\n\nadvanced filtering features. The developer appears to be actively working on and updating the malware.\n\nThis specific password stealer campaign used COVID-19 and Folding@home lures to make downloading\nthis application seem plausible. We are currently observing many other actors trying COVID-19 email lures\nfor a variety of nefarious purposes such as attempting to deliver malware, phishing, business email\ncompromise, and spam.\n\n**Indicators of Compromise (IOCs)**\n\n\n**IOC** **IOC**\n**Type**\n\n\n**Description**\n\n\nhxxps://bitbucket[.]org/example123321/download/downloads/foldingathomeapp.exe URL URL hosting\nRedLine\nStealer\n\n0ddd7d646dfb1a2220c5b3827c8190f7ab8d7398bbc2c612a34846a0d38fb32b SHA256 RedLine\nStealer\nPayload\n\n5df956f08d6ad0559efcdb7b7a59b2f3b95dee9e2aa6b76602c46e2aba855eff SHA256 RedLine\nStealer\nPayload\n\n66.206.18[.]186 IP RedLine\nStealer C2\n\n**ET and ETPRO Suricata/Snort Coverage**\n\n2841160 - ETPRO TROJAN RedLine - CnC Activity\n\n2841435 - ETPRO TROJAN RedLine - GetSettings Request\n\n2841436 - ETPRO TROJAN RedLine - GetSettings Response\n\n2841437 - ETPRO TROJAN RedLine - GetTasks Response\n\n_[Is your organization protected from Malware threats? Learn about Malware Attacks & Protection.](https://www.proofpoint.com/us/threat-reference/malware)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-16 - New RedLine Stealer Distributed Using Coronavirus-themed Email Campaign.pdf"
    ],
    "report_names": [
        "2020-03-16 - New RedLine Stealer Distributed Using Coronavirus-themed Email Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535873,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653704251,
    "ts_modification_date": 1653704251,
    "files": {
        "pdf": "https://archive.orkl.eu/98689387b6ec7445365ec1f8dc87d55c4d972b8d.pdf",
        "text": "https://archive.orkl.eu/98689387b6ec7445365ec1f8dc87d55c4d972b8d.txt",
        "img": "https://archive.orkl.eu/98689387b6ec7445365ec1f8dc87d55c4d972b8d.jpg"
    }
}