{
    "id": "0b8f5768-aef3-473e-8505-fa8cb3e816b1",
    "created_at": "2023-01-12T15:00:32.215943Z",
    "updated_at": "2025-03-27T02:14:05.063561Z",
    "deleted_at": null,
    "sha1_hash": "3ea10dce7cf212382040d009068f2899745f3630",
    "title": "2022-06-01 - CUBA Ransomware Campaign Analysis",
    "authors": "",
    "file_creation_date": "2022-06-13T04:02:17Z",
    "file_modification_date": "2022-06-13T04:02:17Z",
    "file_size": 4114944,
    "plain_text": "# CUBA Ransomware Campaign Analysis\n\n**elastic.co/security-labs/cuba-ransomware-campaign-analysis**\n\n## Key Takeaways\n\nThe Elastic Security Team is tracking an organized and financially-motivated ransomware and extortion group\ncalled Cuba Ransomware\nCuba Ransomware targets small and medium-sized retailers, exfiltrating sensitive information, and then\ndeploying ransomware\nCuba Ransomware uses a “name and shame” approach by releasing exfiltrated data as an additional method to\nextort ransomware cryptocurrency payments\nWe are releasing a YARA signature and providing hunting queries that detect this ransomware family\n\nCUBA Ransomware Malware Analysis\n\n[If you're interested in a technical deep-dive on the CUBA ransomware, check out our malware analysis research here.](https://www.elastic.co/security-labs/cuba-ransomware-malware-analysis)\n\n## Preamble\n\nThe Elastic Security Team is tracking a threat group that is leveraging the Cuba Ransomware, combined with data\nexfiltration and extortion, to target North American and European retailers and manufacturers for cryptocurrency\npayments. The threat group has followed an effective, but repetitive cluster of TTPs for initial access, lateral movement,\nexfiltration, ransomware deployment, and extortion.\n\n## Initial Access\n\nThe incidents that we have observed included hosts that were infected with a litany of initial access opportunities.\nThese included everything from potentially unwanted programs (PUP) to remotely executable vulnerabilities. Because\nof this, we cannot verify what the initial access vehicle was, but there are two theories:\n\n\n-----\n\nAn access broker\nA remotely exploitable vulnerability\nWhile there are many ways to gain access into a targeted network, we’ll explore the most likely hypotheses for\nhow the CUBA threat group gained access.\n\n### Access Broker\n\n[As an introduction, an access broker is a threat group who, as they move through the kill chain, has their “actions on](https://www.lockheedmartin.com/en-us/capabilities/cyber/cyber-kill-chain.html)\nobjective” as collecting and maintaining remote access into a targeted network so that access can be sold to other\nthreat groups who have other goals.\n\nThis is a common tactic for ransomware campaigns where the goal is to rapidly encrypt and extort victims into paying\nto recover data. When using ransomware kits (ransomware-as-a-service), the threat actors are often focused on\nmoving rapidly across many victims and not on the reconnaissance required to identify and exploit victims to deploy\ntheir ransomware.\n\nRansomware-as-a-service includes a lot of overhead such as negotiating with victims, troubleshooting unlock\nprocedures, and managing the crypto infrastructure. It is often easier to purchase previously exploited systems that\nallow the ransomware campaign owners to be “shell wranglers” instead of needing to gain and maintain access to a\nlarge number of environments.\n\nThe theory that an initial access broker may have been used began percolating because we observed access attempts\nusing an Exchange vulnerability in multiple contested networks; however, all networks did not receive the CUBA\nransomware. Additionally, we observed initial access attempts in January but did not observe CUBA ransomware until\nMarch which would align with an access broker gaining and maintaining persistence while shopping for a buyer.\n\nIn the environments where the CUBA ransomware was not deployed, the incident response was rapid, however\nincomplete, and access was regained. Once the persistence was observed, the adversary was successfully evicted\nand CUBA was never deployed.\n\n### Remotely Exploitable Vulnerability\n\n[We observed the execution of the ProxyLogon exploit. Previous research has observed this threat group leveraging](https://www.mandiant.com/resources/unc2596-cuba-ransomware)\n[ProxyLogon and](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-26855) [ProxyShell vulnerabilities to gain initial access.](https://www.mandiant.com/resources/pst-want-shell-proxyshell-exploiting-microsoft-exchange-servers)\n```\nc:\\windows\\system32\\inetsrv\\w3wp.exe, -ap, MSExchangeOWAAppPool, -v, v4.0, -c, C:\\Program\nFiles\\Microsoft\\Exchange Server\\V15\\bin\\GenericAppPoolConfigWithGCServerEnabledFalse.config, -a, \\\\.\\pipe\\\n[redacted], -h, C:\\inetpub\\temp\\apppools\\MSExchangeOWAAppPool\\MSExchangeOWAAppPool.config, -w, (empty), -m, 0\n\n```\nIn each case REF9019 activity was traced back to Windows servers running Microsoft’s Exchange Server. Although we\ndo not have information on the patch levels of those machines at the time of the execution or the exact vulnerabilities\nexploited, there is corroborating evidence regarding the exploitation of publicly accessible Exchange servers at this\ntime generally, as well as specific reporting tied to the CUBA threat actor exploiting them.\n\nThis information combined with the lack of activity preceding this event, as well as the order of tactics after, indicates\nthat in both cases exploitation of publicly accessible Exchange servers initiated the compromise.\n\nExtracting binaries\n\nWhile analyzing certain alerts throughout these events, we used data present in the\n[process.Ext.memory_region.bytes_compressed field, and the technique we described in our Cobalt Strike series, to](https://www.elastic.co/security-labs/collecting-cobalt-strike-beacons-with-the-elastic-stack)\nextract the memory-resident binaries and shellcode.\n\n\n-----\n\n```\n         ()\n{\n int v1;\n int v2;\n WCHAR REMOTE_DESKTOP_USERS_groups_list[256];\n WCHAR ADMINS_groups_list[256];\n char password[44];\n wchar_t username[9];\n v2 = enum_local_groups(DOMAIN_ALIAS_RID_ADMINS, ADMINS_groups_list);\n v1 = enum_local_groups(DOMAIN_ALIAS_RID_REMOTE_DESKTOP_USERS, REMOTE_DESKTOP_USERS_groups_list);\n if ( v2 || v1 )\n {\n  wcscpy(username, L\"Mysql\");\n  qmemcpy(password, L\"KJaoifhLOaiwdhadx1@!\", 0x2Au);\n  if ( Add_user((int)username, (int)password) )\n  {\n   if ( v2 )\n    add_user_groups(ADMINS_groups_list, (int)username);\n   if ( v1 )\n    add_user_groups(REMOTE_DESKTOP_USERS_groups_list, (int)username);\n   hide_accountName(username); SpecialAccounts\\\\UserList regkey\n  }\n }\n return enable_RDP();\n}Read more\n\n```\nMARE determined that this executable performs several functions:\n\nEnumerates local administrator and RDP groups.\n```\n WCHAR REMOTE_DESKTOP_USERS_groups_list[256];\n WCHAR ADMINS_groups_list[256];\n char password[44];\n wchar_t username[9];\n v2 = enum_local_groups(DOMAIN_ALIAS_RID_ADMINS, ADMINS_groups_list);\n v1 = enum_local_groups(DOMAIN_ALIAS_RID_REMOTE_DESKTOP_USERS, REMOTE_DESKTOP_USERS_groups_list);\n if ( v2 || v1 )\n\n```\nCreates a new user Mysql, sets the password to KJaoifhLOaiwdhadx1@!, and sets no expiration date (0x2Au).\n```\n wcscpy(username, L\"Mysql\");\n  qmemcpy(password, L\"KJaoifhLOaiwdhadx1@!\", 0x2Au);\n  if ( Add_user((int)username, (int)password) )\n\n```\nAdds this user to the previously enumerated local administrative and RDP groups.\n```\n if ( v2 )\n    add_user_groups(ADMINS_groups_list, (int)username);\n   if ( v1 )\n    add_user_groups(REMOTE_DESKTOP_USERS_groups_list, (int)username);\n\n```\nSets the SpecialAccounts\\UserList regkey for this user to hide the user from login screens and the control panel.\n```\n hide_accountName(username); regkey\n\n```\nEnables RDP by setting the `fDenyTSConnections` value to false in the Registry.\n```\nreturn enable_RDP();\n\n```\nIn total, add2.exe establishes local persistence via a hidden user and opening of a remote access service. This\nenables the REF9019 actor to connect back to this machine in case of discovery, patching of the vulnerability, or an\nincomplete eviction.\n\n[Additionally, VirusTotal indicated on the graph page that this file has been hosted at http://208.76.253[.]84.](https://www.virustotal.com/graph/728994be6b928de3d1c7b49ca1c79db8656c1cf4b95a1e508a6be48c6ab407da)\n\nOf particular note, within the strings of add2.exe, we identified a unique program database file (PDB) named\nAddUser.pdb. PDB files are used to map elements of source code to the compiled program.\n\n\n-----\n\nSearching in VirusTotal for the HEX value of F:\\Source\\WorkNew17\\ ( content:\n{463a5c536f757263655c576f726b4e65773137}), we identified another file named ad.exe which shared the same\nfolder structure, and included another PDB file, CmdDLL.pdb.\n\n[VirusTotal shows on the graph page that this file has been hosted at http://108.170.31[.]115/add.dll. While we did not](https://www.virustotal.com/graph/http%253A%252F%252F108.170.31.115%252Fadd.dll)\nobserve add.dll, we believe they are related and have included the name, hash, and IP in our Observables table as the\n[IP address (108.170.31[.]115) was also reported distributing ra.exe (see the NetSupport section below).](https://www.virustotal.com/gui/ip-address/108.170.31.115/relations)\n\n[Using this same search criteria, we were able to locate three](https://any.run/report/bd270853db17f94c2b8e4bd9fa089756a147ed45cbc44d6c2b0c78f361978906/e1579345-7571-4dcb-af4c-e74a4a81d804) [other](https://any.run/report/2213db3f856cbed85a52cfa0275fa6eaba8e852a7e78449ab469d85d1945dc80/ed6077c3-6e2a-4f74-a761-cc0a354cc159) [files with the same PDB debugging](https://www.joesandbox.com/analysis/417560/1/html)\n[artifacts.SystemBC is a socks5 backdoor with the ability to communicate over TOR.](https://malpedia.caad.fkie.fraunhofer.de/details/win.systembc)\n\n## Remote Access Tools\n\nAfter establishing a beachhead, REF9019 dropped tooling to manage the post-exploitation phase of the attacks.\nNotably all tools were not present in each attack. It’s unclear if the decision to use one tool over another was merely\ndriven by preference of individual operators, or if there was an operational factor that contributed to the decision.\n\n### SystemBC\n\n[SystemBC is a socks5 backdoor with the ability to communicate over TOR.](https://malpedia.caad.fkie.fraunhofer.de/details/win.systembc)\n\nIt was identified via malware_signature alerts that ran after SystemBC was injected into a svchost.exe process.\n\nPost processing of the compressed_bytes of the shellcode_thread alert exposed network indicators our sample\nutilized, including its command and control server (104.217.8[.]100:5050).\n\nSystemBC analysis\n\n[Check out AhnLab’s ASEC blog for detailed coverage of SystemBC’s features.](https://asec.ahnlab.com/en/33600/)\n\nLet’s look at the data for the SystemBC binary that was collected from the\nprocess.Ext.memory_region.bytes_compressed field.\n\n\n-----\n\nIf we run this through the strings command, it becomes a bit more readable. As mentioned above, the work done by the\nteam at ASEC does a tremendous job of describing the SystemBC remote access tool, so we’ll focus on the atomic\nindicators that we observed.\n```\n…truncated…\nBEGINDATA\nHOST1:104.217.8[.]100\nHOST2:104.217.8[.]100\nPORT1:5050\n…truncated…\n193.23.244[.]244\n86.59.21[.]38\n199.58.81[.]140\n204.13.164[.]118\n194.109.206[.]212\n131.188.40[.]189\n154.35.175[.]225\n171.25.193[.]9\n128.31.0[.]34\n128.31.0[.]39\n/tor/status-vote/current/consensus\n/tor/server/fp/\n…truncated…Read more\n\n```\nThe values of HOST1 and HOST2 are [well-documented infrastructure for the SystemBC tool. The list of 10 IP](https://bazaar.abuse.ch/sample/6b36e8569a8b6150d760c3cfa1f23ff6072d2ab3bedd3633dc269ea6fd5fff9e/)\naddresses is Tor [directory authorities. One IP address is selected from the list to get the](https://metrics.torproject.org/glossary.html#directory-authority) [consensus data for the Tor](https://metrics.torproject.org/glossary.html#consensus)\nnetwork. Then it will start Tor communications based on the settings it received (as previously reported by ASEC).\n\nWhile we were not able to identify if Tor traffic was executed, this could have been a clandestine way to exfiltrate\nsensitive data.\n\n### GoToAssist\n\n[GoToAssist is a remote desktop support application with some legitimate usage, but also known for its use in tech](https://en.wikipedia.org/wiki/RescueAssist)\nsupport scams.In this incident, it was used to download a malicious DLL to the newly created user’s downloads\ndirectory (C:\\Users\\Mysql\\Downloads\\94-79.dll). We were unable to collect this file and have not observed it later in the\nincident, however previous reporting has indicated use in CUBA campaigns of DLLs with similar naming conventions.\n\n### NetSupport\n\n\n-----\n\nNetSupport Manager is another client-server remote desktop management application. In this incident, NetSupport was\nnamed ra.exe and was written and executed from the C:\\programdata\\ directory by the previously exploited IIS worker\nprocess (w3wp.exe). ra.exe has been distributed by a previously identified IP address (see add2.exe section above).\n\n[Our sample is the NetSupportManager RAT as indicated on VirusTotal and corroborates prior reporting of its usage](https://malpedia.caad.fkie.fraunhofer.de/details/win.netsupportmanager_rat)\nwith the CUBA Ransomware group.When analyzing the process data that we extracted from memory we can see that\n\n### Cobalt Strike\n\nCobalt Strike was used in these intrusions, we confirmed this while reviewing the value of the\n[Target.process.thread.Ext.start_address_bytes (a few (typically 32) raw opcode bytes at the thread start address, hex-](https://docs.elastic.co/en/integrations/endpoint)\nencoded). Upon doing this, we observed bytes commonly observed in Cobalt Strike payloads.\n\nWhen analyzing the process data that we extracted from memory we can see that dhl.jpg (from mvnetworking[.]com)\n[and temp.png (from bluetechsupply[.]com) are being used for command and control. This is corroborated by previous](https://twitter.com/drb_ra/status/1482117406122201095)\n[research.](https://www.darktrace.com/en/inside-the-soc/how-antigena-intercepted-and-delayed-a-cobalt-strike-intrusion/)\n\n[Looking at the domains in Shodan ([1][2]), we can see that they are both categorized as Cobalt Strike beacon C2](https://www.shodan.io/search?query=mvnetworking.com)\ninfrastructure.\n\n\n-----\n\nBoth sites are hosted by a cloud provider, Hivelocity, Inc. We have requested the domains be taken down.\n\n### BUGHATCH\n\n[BUGHATCH is the name given to a Cuba Ransomware associated downloader by Mandiant in their blog on UNC2596.](https://www.mandiant.com/resources/unc2596-cuba-ransomware)\nWe detail the observed execution chain and indicators below.\n\nBUGHATCH was launched via PowerShell script stagers in both cases. One execution was following the dropping of a\nmalicious DLL to the Mysql user’s downloads folder (C:\\Users\\Mysql\\Downloads\\14931s.dll). Download URI for the\nnext stage was found in the Target.process.Ext.memory_region.strings (http://64.235.39[.]82/Agent32.bin).\n\nIn the above example, we observed agsyst82.ps1 downloading Agent32.bin from 64.235.39[.]82, but were unable to\ncollect the PowerShell script. However, while performing open-source research, we identified a PowerShell script on\nANY.RUN that performed network connections to the same IP and URL (http://64.235.39[.]82/Agent32.bin). The script\nis named komar.ps1 in ANY.RUN’s analysis. We are associating these two PowerShell scripts and network activity\ntogether.\n\nThe other PowerShell script was called by a malicious file, cps.exe. This PowerShell script is called komar2.ps1 and\ndownloads Agent32.bin from 38.108.119[.]121.\n\n\n-----\n\nkomar2.ps1 next attempts to inject itself into svchost.exe from C:\\Windows\\Sysnative\\svchost.exe.\n\nThe Sysnative path\n\nFor context, the C:\\Windows\\Sysnative path is a legitimate Windows directory and used to allow 32-bit applications to\naccess the System32 folder on a 64-bit version of Windows. This path has also been observed as a SpawnTo\nparameter in Cobalt Strike process injection configurations.\n\nThis new injected process again executes komar2.ps1 and includes a new PDB entry of\nF:\\Source\\Mosquito\\Agent\\x64\\Release\\Agent.pdb. As we discussed above, “komar” means “mosquito” in Polish and is\na good indicator as a way to identify other related entities; we see “Mosquito” in the path of the PDB. While a weak\nassociation by itself, the PDB in this sample is located in F:\\Source\\, which is the same location that we’d observed\nwith F:\\Source\\WorkNew## above for add2.exe. By themselves, they are not a solid reference point between the two\nsamples, but when compared together, they can be categorized as “interesting”.\n\nBased on analysis of the Agent32.bin file, we believe that this is the BUGHATCH malware. BUGHATCH has been\nobserved being used as a downloader in CUBA ransomware incidents. This aligns to how we observed Agent32.bin.\n[BUGHATCH has been covered in the UNC2596 blog by the team at Mandiant.](https://www.mandiant.com/resources/unc2596-cuba-ransomware)\n\n## Credential Harvesting, Internal Reconnaissance, and Lateral Movement\n\nCredential harvesting was observed through process injection into the GoToAssistUnattendedUi.exe binaries. These\nappear to be the legitimate files for the Go To Assist suite. The credential harvesting was accomplished by using\nMeterpreter and Mimikatz.\n\n### Meterpreter\n\nAs we observed in the initial infection several months prior, Meterpreter was observed being used to collect the SAM\n[database using the hashdump module. As previously, this was observed in the](https://www.offensive-security.com/metasploit-unleashed/meterpreter-basics/#:~:text=SYSTEM%0Ameterpreter%20%3E-,hashdump,-The%20hashdump%20post)\nTarget.process.Ext.memory_region.strings fields.\n\n### Mimikatz\n\n[Similarly to the Meterpreter tool markings, we also observed Mimikatz. Mimikatz is an offensive security tool used to](https://attack.mitre.org/software/S0002/)\n[collect and inject passwords from compromised systems. It uses the SEKURLSA::LogonPasswords module to list all](https://adsecurity.org/?page_id=1821#SEKURLSALogonPasswords)\navailable provider credentials, and this was observed in the Target.process.Ext.memory_region.strings fields.\n\n### Zerologon Exploit\n\n[Next the threat actors attempted to use a file called zero.exe, which is used to exploit the Zerologon vulnerability to](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2020-1472)\n[escalate privileges. This file is referenced in previous reporting and is executed on a vulnerable domain controller to](https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/)\ndump the NTLM hash for the Administrator. This is a common tactic for lateral movement and to deploy additional\nimplants into the environment, such as Cobalt Strike.\n\n\n-----\n\n### PsExec\n\n[PsExec is a legitimate utility, part of the SysInternals suite of tools, used to interactively launch processes on remote](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\nsystems. PsExec is a common tool for remote administration, both benign and malicious.\n\nWhile we cannot validate how specifically PsExec was used because there was not an SMB parser on the infected\nhosts, we can see that PsExec was used to move files between the infected hosts. We cannot confirm that this was not\nnormal administration by the local IT staff, but the only activity observed was between infected hosts and was within the\ntime window of other confirmed malicious activity.\n\n### Using LOLBAS\n\n[Living off the land binaries, scripts, and libraries (LOLBAS) is a commonly leveraged method to use native and benign](https://lolbas-project.github.io/#)\ntools for malicious purposes. This reduces attacker tools that need to be moved into the environment as well as to\nappear more like legitimate processes running in a targeted environment.\n\nIn one intrusion we observed PsExec being used to remotely copy files (see the PsExec section), however in another\nenvironment, we observed similar activity to move files using cmd.exe to move files from one host to another. We were\nunable to collect the files that were being moved for analysis, but they were a DLL and a Batch file named d478.dll and\nd478.bat, and the atomic indicators are stored in the Observations table.\n\n\n-----\n\n## Data Exfiltration\n\nThe CUBA group belongs to a variant of ransomware operators in that they use extortion as a mechanism to coerce\npayments from their victims.\n\nIn these situations, once initial access and a foothold is achieved, threat actors will identify potentially sensitive data\nand exfiltrate it off of the environment to use for threats of “name and shame”.\n\nThe CUBA group runs a website on the dark web where they release data from victims that do not pay. CUBA releases\nsome data for free, and for others that are more lucrative, have a payment option.\n\n\n-----\n\n-----\n\nThere are multiple ways that the victim data could have been exfiltrated for extortion, the presence of BUGHATCH,\nMeterpreter, and Cobalt Strike all have data movement capabilities.\n\n## Defense Evasion and Actions on the Objective\n\n### DefenderControl.exe\n\n[To prevent the detection of their malware, the threat actors used Defender Control as a way to disable Microsoft](https://www.sordum.org/9480/defender-control-v2-1/)\nDefender, the native antivirus built into all Windows systems since Vista.\n\nTo ensure that Defender Control continued to run, the threat actor used svchost.exe to create a scheduled task.\n\n### CUBA Ransomware\n\nWe detail the observed execution chain and indicators above, but please see Elastic MARE’s detailed reverse\n[engineering of this sample here.](https://www.elastic.co/security-labs/cuba-ransomware-malware-analysis)\n\n## Diamond Model\n\n[Elastic Security utilizes the Diamond Model to describe high-level relationships between the adversaries, capabilities,](https://www.activeresponse.org/wp-content/uploads/2013/07/diamond.pdf)\ninfrastructure, and victims of intrusions. While the Diamond Model is most commonly used with single intrusions, and\nleveraging Activity Threading (section 8) as a way to create relationships between incidents, an adversary-centered\n(section 7.1.4) approach allows for a, although cluttered, single diamond.\n\n\n-----\n\n## Observed Adversary Tactics and Techniques\n\n### Tactics\n\nUsing the MITRE ATT&CK® framework, tactics represent the why of a technique or sub technique. It is the adversary’s\ntactical goal: the reason for performing an action.\n\nInitial access\nPersistence\nPrivilege escalation\nDefense evasion\nCredential access\nDiscovery\nLateral movement\nCommand & Control\nExfiltration\nImpact\n\nIt should be noted that we did not observe the Collection tactic, but based on the evidence of Exfiltration and Impact,\nthis would have been completed.\n\n### Techniques / Sub Techniques\n\nTechniques and Sub techniques represent how an adversary achieves a tactical goal by performing an action.\n\nAs noted throughout this research, this covered multiple victims over a large period of time. The CUBA intrusion set\nhas been reported using different techniques and sub techniques, but these are our specific observations.\n\nObserved techniques/sub techniques.\n\n\n-----\n\nExploit Public Facing Application\nCommand and Scripting Interpreter - PowerShell, Windows Command Shell\nScheduled Task/Job - Scheduled Task\nBoot or Logon Autostart Execution - Registry Run Keys/Startup Folder\nCreate Account - Local Account\nOS Credential Dumping - LSA Secrets\nData Encrypted for Impact\nHide Artifact - Hidden Window\nMasquerading - Match Legitimate Name or Location\nObfuscated Files or Information\nReflective Code Loading\n\n## Detection\n\n### YARA\n\nElastic Security has created YARA rules to identify this BUGHATCH and CUBA ransomware activity.\n\n\n-----\n\n```\n          j g {\n  meta:\n    author = \"Elastic Security\"\n    creation_date = \"2022-05-09\"\n    last_modified = \"2022-05-09\"\n    os = \"Windows\"\n    arch = \"x86\"\n    category_type = \"Trojan\"\n    family = \"Bughatch\"\n    threat_name = \"Windows.Trojan.Bughatch\"\n    reference_sample = \"b495456a2239f3ba48e43ef295d6c00066473d6a7991051e1705a48746e8051f\"\n  strings:\n    $a1 = { 8B 45 ?? 33 D2 B9 A7 00 00 00 F7 F1 85 D2 75 ?? B8 01 00 00 00 EB 33 C0 }\n    $a2 = { 8B 45 ?? 0F B7 48 04 81 F9 64 86 00 00 75 3B 8B 55 ?? 0F B7 42 16 25 00 20 00 00 ?? ?? B8 06\n00 00 00 EB ?? }\n    $b1 = { 69 4D 10 FD 43 03 00 81 C1 C3 9E 26 00 89 4D 10 8B 55 FC 8B 45 F8 0F B7 0C 50 8B 55 10 C1 EA\n10 81 E2 FF FF 00 00 33 CA 8B 45 FC 8B 55 F8 66 89 0C 42 }\n    $c1 = \"-windowstyle hidden -executionpolicy bypass -file\"\n    $c2 = \"C:\\\\Windows\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\PowerShell.exe\"\n    $c3 = \"ReflectiveLoader\"\n    $c4 = \"\\\\Sysnative\\\\\"\n    $c5 = \"TEMP%u.CMD\"\n    $c6 = \"TEMP%u.PS1\"\n    $c7 = \"\\\\TEMP%d.%s\"\n    $c8 = \"NtSetContextThread\"\n    $c9 = \"NtResumeThread\"\n  condition:\n    ($a1 or $a2 or $b1) or 6 of ($c*)\n}\nrule Windows_Ransomware_Cuba {\n  meta:\n    os = \"Windows\"\n    arch = \"x86\"\n    category_type = \"Ransomware\"\n    family = \"Cuba\"\n    threat_name = \"Windows.Ransomware.Cuba\"\n    Reference_sample =\n\"33352a38454cfc247bc7465bf177f5f97d7fd0bd220103d4422c8ec45b4d3d0e\"\n  strings:\n    $a1 = { 45 EC 8B F9 8B 45 14 89 45 F0 8D 45 E4 50 8D 45 F8 66 0F 13 }\n    $a2 = { 8B 06 81 38 46 49 44 45 75 ?? 81 78 04 4C 2E 43 41 74 }\n   $b1 = \"We also inform that your databases, ftp server and file server were downloaded by us to our  \nservers.\" ascii fullword\n   $b2 = \"Good day. All your files are encrypted. For decryption contact us.\" ascii fullword\n    $b3 = \".cuba\" wide fullword\n  condition:\n    any of ($a*) or all of ($b*)\n}Read more\n\n## Defensive Recommendations\n\n```\nEnable Elastic Security Memory and Ransomware protections\n\nReview and ensure that you have deployed the latest Microsoft Security Updates\nMaintain backups of your critical systems to aid in quick recovery\nAttack surface reduction\nNetwork segmentation\n\n## Observations\n\nAtomic indicators observed in our investigation.\n\n\n-----\n\n**Indicator** **Type**\n\n43f7d739f00c2fdc67f7ab6b976565a323a181fb6570ac3d261dff197f820165 SHA256\n\n159.203.70[.]39 ipv4addr\n\n728994be6b928de3d1c7b49ca1c79db8656c1cf4b95a1e508a6be48c6ab407da SHA256\n\n208.76.253[.]84 ipv4addr\n\nc24d7a93d6a5c33e673e6b0fd171701c4646e67cf2328f41739ef9b50302a02e SHA256\n\n108.170.31[.]115 ipv4addr\n\n62f1fbb6f151bcc67fe68e06031af00bc87ae7e4d9d0a6a60a31d140def09365 SHA256\n\n5669f6a48dac80717fa5770fa3be6c18022a7633b996ccf0df6b468994085378 SHA256\n\n9c71b67411b1432931b4b135dc945f6f7f9da3c295a7449f3ab8dcb56681fa70 SHA256\n\ne35632770a23d8e006e149b038c2ccf576c2da0998d830bbc7d7614dc5c22db5 SHA256\n\n38.108.119[.]121 ipv4addr\n\n64.235.39[.]82 ipv4addr\n\n17edf458f7b8baae5ddef725e255d3a7bb6c960830503556f157655308895128 SHA256\n\n2e6fffad384cd6ce93cc1cde97911063e640c1953dac0507cd5f5b4b3d21bb69 SHA256\n\n144.172.83[.]13 ipv4addr\n\n3a8b7c1fe9bd9451c0a51e4122605efc98e7e4e13ed117139a13e4749e211ed0 SHA256\n\ncdf2b3fbff2649a119051c63904476e70262bde2f6a9a7da8b7db13cbf257851 SHA256\n\n104.217.8[.]100 ipv4addr\n\n193.23.244[.]244 ipv4addr\n\n86.59.21[.]38 ipv4addr\n\n199.58.81[.]140 ipv4addr\n\n\n**Reference from**\n**blog** **Note**\n\nafk.ttf\n\nafk.ttf C2 IP\n\nadd2.exe\n\nadd2.exe C2 IP\n\nadd.dll\n\nadd.dll C2 IP\n\n94-79.dll\n\nra.exe\n\ncps.exe\n\n14931s.dll\n\nAgent32.bin stage\nlocation\n\nAgent32.bin stage\nlocation\n\nAgent32.bin\n(BUGHATCH)\n\nAgent32.bin\n(BUGHATCH)\n\nAgent32.bin C2 IP\n\nzero.exe\n\nd478.dll\n\nSystemBC\ninfrastructure\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\n\n-----\n\n204.13.164[.]118 ipv4addr\n\n194.109.206[.]212 ipv4addr\n\n131.188.40[.]189 ipv4addr\n\n154.35.175[.]225 ipv4addr\n\n171.25.193[.]9 ipv4addr\n\n128.31.0[.]34 ipv4addr\n\n128.31.0[.]39 ipv4addr\n\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\nSystemBC Tor\ndirectory authority\n\n\nbluetechsupply[.]com/components/temp.png url Cobalt Strike C2\nURL\n\n\nbluetechsupply[.]com domainname\n\n217.79.243[.]148 ipv4addr\n\nmvnetworking[.]com domainname\n\n\nCobalt Strike C2\n\nCobalt Strike C2\n\nCobalt Strike C2\n\n\nmvnetworking[.]com/files/dhl.jpg url Cobalt Strike C2\nURL\n\n\n149.255.35[.]131 ipv4addr\n\nce3a6224dae98fdaa712cfa6495cb72349f333133dbfb339c9e90699cbe4e8e4 SHA256\n\n0f385cc69a93abeaf84994e7887cb173e889d309a515b55b2205805bdfe468a3 SHA256\n\nb16e0d27e6fa24d3fe7c9ed9167474fbc1cde13ce047878bbd16548cfdf45be3 SHA256\n\n\nCobalt Strike C2\n\ndefender.exe \\\nDefenderControl.exe\n\nA.exe \\ (CUBA\nRANSOMWARE)\n\nAnet.exe\n(CUBA\nRANSOMWARE)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-01 - CUBA Ransomware Campaign Analysis.pdf"
    ],
    "report_names": [
        "2022-06-01 - CUBA Ransomware Campaign Analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d58052ba-978b-4775-985a-26ed8e64f98c",
            "created_at": "2023-09-07T02:02:48.069895Z",
            "updated_at": "2025-03-27T02:02:10.181465Z",
            "deleted_at": null,
            "main_name": "Tropical Scorpius",
            "aliases": [
                "DEV-0978",
                "RomCom",
                "Storm-0978",
                "Tropical Scorpius",
                "UNC2596",
                "Void Rabisu"
            ],
            "source_name": "ETDA:Tropical Scorpius",
            "tools": [
                "COLDDRAW",
                "Cuba",
                "Industrial Spy",
                "PEAPOD",
                "ROMCOM",
                "ROMCOM RAT",
                "SingleCamper",
                "SnipBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4f56bb34-098d-43f6-a0e8-99616116c3ea",
            "created_at": "2024-06-19T02:03:08.048835Z",
            "updated_at": "2025-03-27T02:05:17.365266Z",
            "deleted_at": null,
            "main_name": "GOLD FLAMINGO",
            "aliases": [
                "Tropical Scorpius ",
                "UAC-0132 ",
                "UAC-0132 ",
                "UNC2596 ",
                "Void Rabisu ",
                "REF9019 "
            ],
            "source_name": "Secureworks:GOLD FLAMINGO",
            "tools": [
                " Cobalt Strike",
                " Cuba",
                " Meterpreter",
                " Mimikatz",
                " ROMCOM RAT",
                "Chanitor"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535632,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1655092937,
    "ts_modification_date": 1655092937,
    "files": {
        "pdf": "https://archive.orkl.eu/3ea10dce7cf212382040d009068f2899745f3630.pdf",
        "text": "https://archive.orkl.eu/3ea10dce7cf212382040d009068f2899745f3630.txt",
        "img": "https://archive.orkl.eu/3ea10dce7cf212382040d009068f2899745f3630.jpg"
    }
}