{
    "id": "0b9ef91b-db53-4aa2-9218-0e1a8ee51ca1",
    "created_at": "2023-01-12T15:06:24.939807Z",
    "updated_at": "2025-03-27T02:09:29.765841Z",
    "deleted_at": null,
    "sha1_hash": "15f0ce47ac79e4fb3335a84317c9bb4e7c4f6fa3",
    "title": "2020-12-03 - IBM Uncovers Global Phishing Campaign Targeting the COVID-19 Vaccine Cold Chain",
    "authors": "",
    "file_creation_date": "2022-05-29T10:36:09Z",
    "file_modification_date": "2022-05-29T10:36:09Z",
    "file_size": 1174727,
    "plain_text": "# IBM Uncovers Global Phishing Campaign Targeting the COVID-19 Vaccine Cold Chain\n\n**[securityintelligence.com/posts/ibm-uncovers-global-phishing-covid-19-vaccine-cold-chain/](https://securityintelligence.com/posts/ibm-uncovers-global-phishing-covid-19-vaccine-cold-chain/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Government](https://securityintelligence.com/category/topics/government/)\nIBM Uncovers Global Phishing Campaign Targeting the COVID-19 Vaccine Cold Chain\n\n[Government December 3, 2020](https://securityintelligence.com/category/topics/government/)\n\n\n-----\n\nBy [Claire Zaboeva co-authored by Melissa Frydrych 6 min read](https://securityintelligence.com/author/claire-zaboeva/)\n[At the onset of the COVID-19 pandemic, IBM Security X-Force created a threat intelligence](https://www.ibm.com/security/services/ibm-x-force-incident-response-and-intelligence)\ntask force dedicated to tracking down COVID-19 cyber threats against organizations that are\nkeeping the vaccine supply chain moving. As part of these efforts, our team recently\nuncovered a global phishing campaign targeting organizations associated with a COVID-19\ncold chain. The cold chain is a component of the vaccine supply chain that ensures the safe\npreservation of vaccines in temperature-controlled environments during their storage and\ntransportation.\n\nOur analysis indicates that this calculated operation started in September 2020. The COVID19 phishing campaign spanned across six countries and targeted organizations likely\nassociated with Gavi, The Vaccine Alliance’s Cold Chain Equipment Optimization Platform\n(CCEOP) program, which we explain further in this blog. While firm attribution could not be\nestablished for this campaign, the precision targeting of executives and key global\norganizations hold the potential hallmarks of nation-state tradecraft.\n\nSome details from IBM Security X-Force’s analysis of this activity include:\n\n**The Cover Story — The adversary impersonated a business executive from Haier**\nBiomedical, a credible and legitimate member company of the COVID-19 vaccine\nsupply chain and qualified supplier for the CCEOP program. The company is\npurportedly the world’s only complete cold chain provider. Disguised as this employee,\nthe adversary sent phishing emails to organizations believed to be providers of material\nsupport to meet transportation needs within the COVID-19 cold chain. We assess that\nthe purpose of this COVID-19 phishing campaign may have been to harvest\ncredentials, possibly to gain future unauthorized access to corporate networks and\nsensitive information relating to the COVID-19 vaccine distribution.\n**The Targets — The targets included the European Commission’s Directorate-General**\nfor Taxation and Customs Union, as well as organizations within the energy,\nmanufacturing, website creation and software and internet security solutions sectors.\nThese are global organizations headquartered in Germany, Italy, South Korea, Czech\nRepublic, greater Europe and Taiwan.\n**The How — Spear-phishing emails were sent to select executives in sales,**\nprocurement, information technology and finance positions, likely involved in company\nefforts to support a vaccine cold chain. We also identified instances where this activity\nextended organization-wide to include help and support pages of targeted\norganizations.\n\nIBM Security X-Force has followed responsible disclosure protocols and notified the\nappropriate entities and authorities about this targeted operation.\n\n## Alert for the COVID-19 Supply Chain\n\n\n-----\n\nIBM Security X-Force urges companies in the COVID-19 supply chain — from research of\ntherapies, healthcare delivery to distribution of a vaccine — to be vigilant and remain on high\n[alert during this time. Governments have already warned that foreign entities are likely to](https://www.ncsc.gov.uk/files/Final%20Joint%20Advisory%20COVID-19%20exploited%20by%20malicious%20cyber%20actors%20v3.pdf)\nattempt to conduct cyber espionage to steal information about vaccines. Today, in\n[conjunction with this blog, DHS CISA is issuing an alert encouraging organizations](https://us-cert.cisa.gov/ncas/current-activity/2020/12/03/IBM)\nassociated with the storage and transport of a vaccine to review this research and\nrecommended best practices to remain vigilant.\n\n## Calculated Spoofing to Compromise the COVID-19 Cold Chain\n\nIBM Security X-Force uncovered targets across multiple industries, governments and global\npartners that support the [CCEOP program. The CCEOP was launched by Gavi, The Vaccine](https://www.unicef.org/supply/stories/keeping-vaccines-safe-through-last-mile-their-journey)\nAlliance along with the United Nations Children Fund (UNICEF) and other partners in 2015.\nIts objective is to ultimately strengthen vaccine supply chains, optimize immunization equity\nand ensure an agile medical response to outbreaks of infectious diseases. Various classes of\nmedication, and especially vaccines, require storage and transport in temperature-controlled\nenvironments to ensure their safe preservation.\n\nThe CCEOP initiative is naturally accelerating efforts to facilitate the distribution of a COVID19 vaccine. A breach within any part of this global alliance could result in the exposure of\nnumerous partner computing environments worldwide.\n\nThe spoofed phishing emails appear to originate from a business executive from Haier\nBiomedical, a Chinese company currently acting as a qualified supplier for the CCEOP\nprogram, in coordination with the World Health Organization (WHO), UNICEF and other U.N.\nagencies. It is highly likely that the adversary strategically chose to impersonate Haier\nBiomedical because it is purported to be the world’s only complete cold chain provider.\nLikewise, the Haier Biomedical employee who is purported to be sending these emails would\nlikely be associated with Haier Biomedical’s cold chain distribution operations based on his\nrole, which is listed in the email signature block.\n\nIt’s unclear from our analysis if the COVID-19 phishing campaign was successful. However,\nthe established role that Haier Biomedical currently plays in vaccine transport, and their likely\nrole in COVID-19 vaccine distribution, increases the probability the intended targets may\nengage with the inbound emails without questioning the sender’s authenticity.\n\n## Credential Harvesting for Wider Access\n\nThe subject of the phishing emails posed as requests for quotations (RFQ) related to the\nCCEOP program. The emails contain malicious HTML attachments that open locally,\nprompting recipients to enter their credentials to view the file. This phishing technique helps\nattackers avoid setting up phishing pages online that can be discovered and taken down by\nsecurity research teams and law enforcement.\n\n\n-----\n\nWe assess that the purpose of this campaign may have been to harvest credentials to gain\nfuture unauthorized access. From there, the adversary could gain insight into internal\ncommunications, as well as the process, methods and plans to distribute a COVID-19\nvaccine. This includes information regarding infrastructure that governments intend to use to\ndistribute a vaccine to the vendors that will be supplying it. However, beyond critical\ninformation pertaining to the COVID-19 vaccine, the adversary’s access could extend deeper\ninto victim environments. Moving laterally through networks and remaining there in stealth\nwould allow them to conduct cyber espionage and collect additional confidential information\nfrom the victim environments for future operations.\n\n_Figure 1: Phishing email sent to executives in organizations related to the COVID-19 vaccine_\n_supply chain._\n\n## Global Targeting\n\nGiven the specialization and global distribution of organizations targeted in this campaign, it’s\nhighly likely that the adversary is intimately aware of critical components and participants of\nthe cold chain.\n\n**European Commission’s Directorate-General for Taxation and Customs Union**\n— The Directorate-General is responsible for promoting cooperation on customs and\ntax matters across the EU. It maintains direct ties to multiple national government\nnetworks and is associated with trade and regulation. Targeting this entity could serve\nas a single point of compromise impacting multiple high-value targets across the 27\nmember states of the European Union and beyond.\n\n\n-----\n\n**Energy Sector — Spear phishing targets included companies involved in**\nmanufacturing solar panels. One of the ways that vaccines are kept cold in countries\nwhere reliable power is not possible is by using vaccine refrigerators powered by solar\npanels. A compromise of such technologies could result in intellectual property theft or\nstealing and selling vaccine shipping containers in black markets across the globe.\nTargeting also included companies associated with petrochemicals. Among the key\ncomponents of cold chain is the use of dry ice, which is a byproduct of petroleum\nproduction.\n**IT Sector — Amongst the targets were a South Korean software development firm and**\na German website development company. The latter supports multiple clients\nassociated with pharmaceutical manufacturers, container transport, biotechnology and\nmanufacturers of electrical components enabling sea, land and air navigation and\ncommunications.\n\n## Who is Likely Behind These Attacks?\n\nWhile attribution is currently unknown, the precision targeting and nature of the specific\ntargeted organizations potentially point to nation-state activity. Without a clear path to a cashout, cyber criminals are unlikely to devote the time and resources required to execute such a\ncalculated operation with so many interlinked and globally distributed targets. Likewise,\ninsight into the transport of a vaccine may present a hot black-market commodity, however,\nadvanced insight into the purchase and movement of a vaccine that can impact life and the\nglobal economy is likely a high-value and high-priority nation-state target.\n\nEarlier in 2020, IBM Security X-Force uncovered activity surrounding the targeting of a global\nCOVID-19 PPE supply chain. Similarly, as the global competition races for a vaccine, it is\nhighly likely the cold chain is a compelling target that will be at the top of the lists of national\ncollection requirements worldwide.\n\n## Recommendations to Defenders\n\nIBM Security X-Force stands ready to host the COVID-19 supply chain community on our\n[Enterprise Intelligence Management platform, where they can share threat information and](https://www.ibm.com/security/services/threat-intelligence)\ntake action on the latest threat intelligence. The following are recommendations for\norganizations to increase their cyber readiness amidst the developments outlined in this\nblog:\n\n**Create and test incident response plans to strengthen your organization’s**\npreparedness and readiness to respond in the event of an attack.\n\n\n-----\n\n**Share and ingest threat intelligence. Threat-sharing initiatives and partnerships are**\nessential to staying alert about the latest threats and attack tactics impacting your\nindustry. IBM Security X-Force has been feeding this threat intelligence into the\nCOVID-19 threat sharing enclave. At the onset of the pandemic, IBM made this\nenclave freely accessible to any organization in need of more eyes on cyber threats.\n**Assess your third-party ecosystem and assess potential risks introduced by third-**\nparty partners. Confirm you have robust monitoring, access controls and security\nstandards in place that third-party partners need to abide by.\n**Apply a zero-trust approach to your security strategy. As environments continue to**\nexpand, managing privilege access becomes paramount to ensuring that users are\nonly granted access to the data that is essential to their job.\n**Use Multifactor Authentication (MFA) across your organization. MFA works as a**\nfail-safe if a malicious actor has gained access to your credentials. As a last line of\ndefense, MFA offers a second form of verification requirement in order to access an\naccount.\n**Conduct regular email security educational trainings so employees remain on alert**\n[about phishing tactics and are familiar with email security best practices.](https://securityintelligence.com/posts/state-of-the-phish-ibm-x-force-reveals-current-phishing-attack-trends/)\n**Use Endpoint Protection and Response tools to more readily detect and prevent**\nthreats from spreading across the organization.\n\nIf your organization requires immediate assistance with incident response, please contact\nIBM Security X-Force’s US hotline 1-888-241-9812 | Global hotline (+001) 312-212-8034\nLearn more about X-Force’s [threat intelligence and](https://www.ibm.com/security/services/threat-intelligence) [incident response services.](https://www.ibm.com/security/services/incident-response-services)\n\n## Indicators of Compromise (IOCs)\n\n### Malicious HTML Files: RFQ – UNICEF CCEOP and Vaccine Project – Copy (#).html\n\nSHA256 Hashes\n\nd32b4793e4d99bb2f9d4961a52aee44bbdba223699075ed40f6a6081e9f1e6b4\n\nace86e8f5d031968d0c9319081a69fa66ce798e25ec6bbd23720ee570651aa04\n\n7f53eca4a3e083ad28c8d02862bc84c00c3c73a9d8b7082b7995f150713d4c51\n\ne3de643f3acebf1696a2b275f4ab1d0bacb5a8ba466ee8edbaaffaaa44cd2f10\n\na8c42db5ccddbde5b17ce3545189329a33acfdd4a8b9aff0c7e4294709b60af6\n\n07dbe854a34e61349adcc97dd3e2eb5a9158e02568bae3e2aae3859aeeb5b8a9\n\n7898d4596b6125129698866dbfa1a71d069aee3fd84ecb43343c3bf377a7abe2\n\n\n-----\n\n7fc47e4fdce42b032b8ad0438cb5c76ed42a36d8c6a3e16d42dd0b69f49f33bd\n\n83f8934fadccbaaa8119cd542382fbb9b97dfd196ef787b746ccaaf11f1d444e\n\n6126052b0b200e04ce83a3fa470efee6ba82882674ebcc46c326b0a6c7fbfab4\n\n75768be2e98b8010256f519a19a2a47d8983686389b2eeab300aca063b229be5\n\nb98984a7bf669518b074ef1c8fc4240e4ad6f4a2ccc80a7940a0b56150809e37\n\n33c44f32de3153d7705371c4a0c8d695a4e4eb22b4c4f2f3bda519631efb09af\n\na90056d8d0853f54dec3c8738fbcea6185f87aae6102cff2c0e1def49ccde977\n\n68f4e8b58367ae1d0f8c392b43f459b1d942faf979953233a104cd74944b88f4\n\n0ec6a1a0b353c672307220fe69ca4c3be6e516505e1f16b5bb8f3b55adaa0c0e\n\n61e7f48f41414d3c945b7317023ca27e5d3f011b0a2e16354641748cc0f9df8e\n\n0ac984f340a2903228b17e28c3a0f4507f5fc780bfe6505f196d2b92feccfab8\n\n9143c2499a1cb2fb4e86ba6f9552f752358d8c8b635376aa619305431a3eec50\n\n49468e2cbaab71a1035f45ef1d4a7cd791e2d5c2bbbfc9d29249d64f40be9aa4\n\n8dc052382d626a2b1fb9181bdc276858386098e1919276c682a0a2b397dab80b\n\n61bae857955c5cabf20119a918a0ebd83cbe9a34ebc6ee628144d225ab0867df\n\n93643badb18f8dccba1eae3d0a44e8a91d4646cb4d1d4b61e234bf7edc58969c\n\nc22ec0725f45221e477c9966a32b8faadd3e320c278043e57252903be89664cc\n\nd5cd18bd27b7525d5e240d5dca555844ec721f8f4be224b91c047b827b7e5529\n\n3e6b7d3055b50c2fd65231d1f757e3f0a6a1dbd803601d2e4223ace4d2bc1198\n\nd32b4793e4d99bb2f9d4961a52aee44bbdba223699075ed40f6a6081e9f1e6b4\n\n28511c50efe2fc02f7a437864e48f8c2983637507c2f8d8773e32ed9a420c895\n\n### C2 URLs\n\nhxxps://e-mailer.cf/next[.]php\n\nhxxps://e-mailer.ga/next[.]php\n\nhxxps://nwa-oma2.ml/next[.]php\n\nhxxps://routermanager.ga/next[.]php\n\n\n-----\n\nhxxps://routermanager.gq/next[.]php\n\nhxxps://routermanager.ml/next[.]php\n\nhxxps://routermanagers.cf/next[.]php\n\nhxxps://routermanagers.ga/next[.]php\n\nhxxps://routermanagers.gq/next[.]php\n\nhxxps://routermanagers.ml/next[.]php\n\nhxxps://serverrouter.cf/next[.]php\n\nhxxps://serverrouter.ga/next[.]php\n\nhxxps://serversrouter.cf/next[.]php\n\nhxxps://serversrouter.gq/next[.]php\n\nhxxps://nwa-oma.ml/next[.]php\n\n### Sender Email Addresses\n\n[[email protected][.]com](https://securityintelligence.com/cdn-cgi/l/email-protection)\n\nDNS [SOA Addresses](https://en.wikipedia.org/wiki/SOA_record)\n\nrahim[@]protonmail[.]com\n\nkilode[@]cock.li.\n\n### Additional Related URLs\n\nhxxps://mailerdeamon[.]cf\n\nhxxps://mailerdeamon[.]ga\n\nhxxps://mailerdeamon[.]gq\n\nhxxps://mailerdeamon[.]ml\n\nhxxps://mailerdeamon[.]tk\n\nhxxps://routermanager[.]tk\n\nhxxps://routermanagers[.]tk\n\nhxxps://serverrouter[.]tk\n\n\n-----\n\nRegister for the webinar: New Global Phishing Campaign Targeting the COVID-19 Vaccine\nCold Chain”\n[Claire Zaboeva](https://securityintelligence.com/author/claire-zaboeva/)\nSenior Strategic Cyber Threat Analyst, IBM\n\nClaire is a Senior Strategic Cyber Threat Analyst on the Threat Hunt & Discovery Team\nwithin IBM X-Force. Claire has over 10 years of analytic experience...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-03 - IBM Uncovers Global Phishing Campaign Targeting the COVID-19 Vaccine Cold Chain.pdf"
    ],
    "report_names": [
        "2020-12-03 - IBM Uncovers Global Phishing Campaign Targeting the COVID-19 Vaccine Cold Chain.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535984,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653820569,
    "ts_modification_date": 1653820569,
    "files": {
        "pdf": "https://archive.orkl.eu/15f0ce47ac79e4fb3335a84317c9bb4e7c4f6fa3.pdf",
        "text": "https://archive.orkl.eu/15f0ce47ac79e4fb3335a84317c9bb4e7c4f6fa3.txt",
        "img": "https://archive.orkl.eu/15f0ce47ac79e4fb3335a84317c9bb4e7c4f6fa3.jpg"
    }
}