{
    "id": "0ba6aa71-ae35-465f-bec6-ba99455718a1",
    "created_at": "2023-01-12T15:01:38.051231Z",
    "updated_at": "2025-03-27T02:05:51.198254Z",
    "deleted_at": null,
    "sha1_hash": "fd75703b26c906424bc76dbba287880645fd1814",
    "title": "2021-10-14 - Analyzing Email Services Abused for Business Email Compromise",
    "authors": "",
    "file_creation_date": "2022-05-27T22:35:08Z",
    "file_modification_date": "2022-05-27T22:35:08Z",
    "file_size": 967007,
    "plain_text": "# Analyzing Email Services Abused for Business Email Compromise\n\n**[trendmicro.com/en_in/research/21/j/analyzing-email-services-abused-for-business-email-compromise.html](https://www.trendmicro.com/en_in/research/21/j/analyzing-email-services-abused-for-business-email-compromise.html)**\n\nOctober 14, 2021\n\nCyber Threats\n\nWe analysed five major types of email channels, and the techniques in keywords and\ndomain names BEC actors use to appear legitimate to potential victims.\n\nBy: Marshall Chen, Loseway Lu, Paul Pajares, Fyodor Yarochkin October 14, 2021 Read\ntime: ( words)\n\n[Like a number of online attacks and threats that took advantage of the changing work](https://www.trendmicro.com/vinfo/tmr/?/us/security/research-and-analysis/threat-reports/roundup/attacks-from-all-angles-2021-midyear-security-roundup)\ndynamics, business email compromise (BEC) remains one of the cybercrimes that causes\n[the most financial losses for businesses despite the decrease in number of victims. Our](https://www.ic3.gov/Media/PDF/AnnualReport/2020_IC3Report.pdf)\ncontinued monitoring of BEC activities showed a consistent increase in numbers during the\nyear.\n\n\n-----\n\nFigure 1. Percentage of BEC detections from January to September 2021. Data from Trend\nMicro™ Smart Protection Network™ (SPN).\nThe gradual increase throughout the year prompted us to pay attention to the campaigns\nbeing deployed, but the sudden increase in August caught our interest. Compared to\ncampaigns from previous years in which BEC actors mostly impersonated executives or\nranking management personnel, we observed a specific BEC campaign type spoofing\ngeneral employees’ display names. We noticed a sudden upshot of dangerous emails\nimpersonating and targeting ordinary employees for money transfers, bank payroll account\nchanges, or various company-related information. We launched the “BEC Display Name\nSpoofing” detection solution for Trend Micro™ Cloud App Security in Q1 to address this\nissue. Following this, we also observed the highest volume of BEC detections in the\nAmericas.\n\n\n-----\n\nFigure 2. BEC display name spoofing detections by region from January to September 2021\n\nFigure 3. A\n\nBEC email sample spoofing the display name of an employee. The content of the email\ntranslates as the sender asking help for a confidential financial operation and inquiring if the\nrecipient is available for the day.\nBEC is an online scheme dependent on leveraging email and its features of convenience for\nlegitimate users, and we noted five major types of email channels that BEC actors use. As\nwe continue monitoring BEC operations, we also learnt that BEC actors can use the same\nchannels and techniques for a longer period than for just one deployment campaign, tracking\n\n\n-----\n\ncomplaints from different spoofed and scammed victims online. We also took note of the\npatterns in keywords and domain names that they use to appear legitimate to their potential\nvictims, and what BEC email recipients can watch for when encountering these scams.\n\nTypes of email services used for BECWe analysed the email services abused and the\ntechniques that BEC actors have adopted in their campaigns.\n\nFigure 4. Email services abused for BEC deployments\n\n1. Free email services\n\nWe observed BEC groups favouring the abuse of known free email services for the low-cost\nentry. There is also the trusted marketing quality and service promise of confidentiality in\nterms of protecting legitimate users, while bulk account creation tools can be used to\nfacilitate numerous accounts. We observed services offered by Gmail, Hotmail, and Outlook\nas the top choices for BEC campaigns.\n\nThese services allow BEC actors to spoof enterprise employees’ names or personal emails\nto use. In a typical case of this type of abuse, malicious actors spoof an employee email\naddress and request changes to payroll deposit bank accounts.\n\n\n-----\n\nFigure 5. BEC mail from AOL (top) and Gmail (bottom)\nWe observed a part of the BEC chief executive officer (CEO) email fraud scheme includes\nhaving a common account naming convention, such as “office”, “president”, “chief”, and\n“director”, amongst company leadership positions. Among all these free email services,\nGmail appears to be the most commonly abused service for BEC during our investigation\ntimeframe. We identified 10 commonly used examples:\n\n1. chiefexecutiveoffice <BLOCKED> [@]gmail.com\n2. chiefexecutiveofficer <BLOCKED> [@]gmail.com\n3. directorexecutiveofficer <BLOCKED> [@]gmail.com\n4. officepresident <BLOCKED> [@]gmail.com\n5. officepro <BLOCKED> [@]gmail.com\n6. officeproject <BLOCKED> [@]gmail.com\n7. officework <BLOCKED> [@]gmail.com\n8. offshoreoffice <BLOCKED> [@]gmail.com\n9. presidentoffice <BLOCKED> [@]gmail.com\n10. rev.office <BLOCKED> [@]gmail.com\n\n\n-----\n\nMore often, BEC email content usually includes direct financial requests or transfers from the\nintended victim. However, there are also indirect approaches wherein they first ask for\nspecific favours from the recipient. If the recipient replies, it indicates that the potential victim\nbelieves that the sender is legitimate.\n\nFigure 6. BEC actor first asking for help\n\nFigure 7. BEC actor requesting the victim to buy a gift card after the user replies to their first\nemail for a favor\nWe also observed some of these BEC email addresses being active from just a couple of\ndays to years. For example, email account cexecutive9<BLOCKED>[@]gmail.com has been\nactive for more than three years. We detected the address sending BEC emails in 1H 2018,\nand continued to see the same email account actively sending BEC more than three years\nlater. We also noticed some users in social media complaining about an email scam received\nfrom the same address.\n\nFigure 8. A user posting about a scam email account on social media in 2019. We have been\nfollowing the said account since 2018, and observed it still being used to deploy campaigns\nin 2021.\n**2. Local email services**\n\n\n-----\n\nSome services provide local email services for end users. BEC actors also frequently use\nthese services (using either compromised credentials or making new ones) to launch BEC\nattacks. We observed more than 15 countries’ local email services with BEC email footprints,\nsuch as the United States, United Kingdom, Germany, the Czech Republic, Poland, New\nZealand, South Korea, Ukraine, Russia, Portugal, Australia, Norway, Italy, France, and\nCanada. Table 1 lists five of the email services and the BEC email sender account that we\ndetected:\n\n**Country** **Email service** **BEC email address**\n\nUnited Kingdom virginmedia.com officelink <BLOCKED> [@]virginmedia.com\n\nUnited States optimum.net ceo <BLOCKED> [@]optimum.net\n\nCzech Republic seznam.cz officeport <BLOCKED> [@]seznam.cz\n\nGermany mail.com officeonlyme <BLOCKED> [@]mail.com\n\nSouth Korea naver.com mail_ceoofficial <BLOCKED> [@]naver.com\n\nTable 1. Sample free email services and BEC email addresses used for campaigns\n\nWe observed BEC email actors also being interested in victim's contact information or data\n[from companies such as ageing reports. They also try to get information from their victims for](https://www.bleepingcomputer.com/news/security/bec-scammers-use-aging-report-phishing-to-find-new-targets/)\nother attacks that use social engineering.\n\nFigure 9. BEC email asking for a user’s WhatsApp number\n\n\n-----\n\nFigure 10. BEC email asking for copies of a report and contact information\n**3. Encrypted email services**\n\nLike other cybercriminals, BEC actors also want to hide their footprints and prevent systems\nfrom tracking them. Encrypted email services provide users with a higher level of privacy and\nconfidentiality (that is, the inclusion of other security features compared to other email\nservices). We observed BEC actors using some encrypted email services and list some\nexamples below:\n\n**Encrypted email service** **Sample BEC email address**\n\nProtonmail officeiccon <BLOCKED> [@]protonmail.com\n\nTutanota eye.adimn <BLOCKED> [@]tutanota.com\n\nCriptext.com iphone <BLOCKED> [@]criptext.com\n\nTable 2. Sample encrypted email services used for BEC\n\nThese emails are not only found in the From email header, but at times also hidden in the\n_Reply-to section. A common trick in email scams like BECs involves forging the From header_\ninto something legitimate-looking and hide the actors’ actual email in a hidden Reply-to.\nWhen users directly reply just by clicking the in-mail Reply button, the Reply-to header will\nautomatically be the recipient email address. This is unknown to the victim and it allows the\nBEC actor to communicate with the victim thereafter. The example in Figure 11 shows how a\nBEC actor hides the actual email address ceoof<BLOCKED>[@]protonmail.com in the\nReply-to section.\n\n\n-----\n\nFigure 11. BEC email hiding their inbox at Reply-to headers\n**4. Self-registered domains and direct-to featured email service**\n\nAside from using globally known email services, BEC actors also register domains\nthemselves. This can bring two benefits when they conduct attacks:\n\n1.    They can create look-alike domains to deceive victims. The actors register domains\nwith different characters but appear similar to a legitimate domain. Some commonly seen\ntricks include the interchange between specific letters and numbers:\n\nI (small letter L) – l (capital letter i) – 1 (for example, example.com vs. exampIe.com vs.\nexamp1e.com)\no – 0 (for example, trendmicro.com vs. trendmicr0.com)\nd – cl (for example, trendmicro.com vs. trenclmicro.com)\nm – rn (for example, example.com vs. exarnple.com)\ni – j (for example, trendmicro.com vs. trendmjcro.com)\ng – q\nu– v\nw– vv\n\nOr the use of dashes (-) and periods (.) to separate a word or add a general postfix such as\ncountry codes (for example, example.com vs. example-tw.com). This trick is also widely used\nin other phishing schemes and other email-based scams, and will likely never get old.\n\n2.    Control positive email authentication results such as sender policy framework (SPF) or\neven DomainKeys Identified Mail (DKIM) while sending email to victims.\n\nFigure 12. Abusing email authentication results\nWhile a SPF or DKIM pass does not indicate that an email is threat-free, it does provide an\nimage that the sender is somehow legitimate, gaining the recipient’s trust or even fool some\nanti-scam solutions.\n\n**5. Stolen email credentials and email conversations**\n\n\n-----\n\nBEC actors also launch attacks from compromised email accounts. In most instances using\nthis technique, the malicious actors deploy a spam campaign with malicious attachments\n[dropping keyloggers or trojan stealers like Lokibot,](https://www.trendmicro.com/en_us/research/21/h/new-campaign-sees-lokibot-delivered-via-multiple-methods.html) [Fareit, backdoor Remcos, and](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/fareit) [Negasteal](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/negasteal-uses-hastebin-for-fileless-delivery-of-crysis-ransomware)\n(Agent Tesla). These can steal credentials in applications like browsers, simple mail transfer\nprotocol (SMTP), file transfer protocol (FTP), VPNs, and from computer and system\ninformation. The operators then harvest the credentials and try to log in to the mailbox or\nwebmail. If successful, they can manipulate the hacked accounts to perform BEC\ndeployments.\n\nFrom the compromised email account, BEC actors can also find email conversations related\nto finance- or purchase-themed threads such as purchase orders or invoices. Using these,\nthey can create other spoofed email accounts, draft a reply with the stolen conversation, and\nstart intercepting the conversation by replying to the recipients (usually suppliers). These are\n[also called man-in-the-middle (MiTM) attacks. In this case, BEC operators carefully study the](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/infosec-guide-defending-against-man-in-the-middle-attacks)\ntargeted victims, potentially compromising the companies’ email services. They will also look\nfor unsuspecting suppliers or other involved recipients in the original email thread.\n\nMoreover, BEC operators use the username in the email resembling the victim’s name or\ncompany name simultaneous to the email spoofing. In a few cases we observed, the\nmalicious actors use customised usernames bearing the code “god” in their email, marking\nthe account as a carbon copy.\n\n<BLOCKED>mygod@mail.com\ngodpls<BLOCKED>@mail.com\n<BLOCKED>foods@post.com\n<BLOCKED>elco@dr.com\n<BLOCKED>pala@dr.com\n<BLOCKED>zado@dr.com\nnicola<BLOCKED>@dr.com\n<BLOCKED>com-int@dr.com\nire<BLOCKED>@asia.com\njulien<BLOCKED>@mail.com\n\n\n-----\n\nFigure 13. Sample BEC email with a stolen conversation used to deploy a BEC attack.\nThe BEC actors can rent virtual private servers (VPS) with SMTP and remote desktop\n[protocol (RDP) services. They can use email marketing software like Gammadyne Mailer to](https://www.gammadyne.com/email_software.htm)\ncraft spam mails and send it to thousands of email addresses. These email addresses are\n[harvested via tools such as Email Extractor Lite, while some come from spam activities. The](https://www.lite14.us/)\nactors can then review the stealer logs and identify mail servers of interest, which can\ncontain conversations about purchasing orders. They can then hijack the email conversation,\ncreate spoofed emails, and use the conversation to deploy a BEC attack. Another method\nemployed involves the tampering of the invoice document to reflect the BEC actors’ bank\naccount details. Thus, if there is a request for a wire transfer the money will go directly into\ntheir account.\n\nKeyword use and naming patterns\n\nWe also observed some keywords or naming patterns that BEC actors generally use. We\nidentified some of them and provide examples for each.\n\n**1. Lengthy domain names with dashes (-)**\n\n\n-----\n\n[A group of BEC domains operating from Africa was observed to favour lengthy names, using](https://www.agari.com/cyber-intelligence-research/whitepapers/acid-agari-exaggerated-lion.pdf)\nnew generic top-level domain (TLD) words such as “[.]management”, “[.]work”, or “[.]one”.\nSome domains also contain “-“ and with common keywords such as “management”, “mail”,\n“office”, “reply”, and “secure”. We list examples that we observed here:\n\nadmin-office-mail-server-ssl0.management\nreply-netsuite-mails.management\nsystem-mail-protection-outlook.management\nreplys-mail-netsuite-com.management\nsysterm-proctection-outlook.management\nmails-officesslappssecure-serversportal-execs.management\nreply-workplace-secure-protection-management-office.one\nservermail-reply-office-works-secure-protecty-inbound-netsuite.one\noffice-xlsx-appspts-management-worksmailxls-cs.rest\noffice-mails-appsslz-workmail-management.work\n\nFigure 14. A BEC email using lengthy keywords and dashes\n**2. The use of telecom keywords**\n\nWe also noticed BEC actors registering domain names with telecommunications industryrelated keywords such as “5g”, “4g”, “mobile”, “network”, and “wireless”. They occasionally\ninclude names of service providers such as “Verizon” and “T-Mobile.” It’s also common to see\ndashes in domain names to increase the diversity of choices while registering:\n\n5g-verizou.com\nnetwork-sprint.biz\nsprint-mobile.net\nmobile-celldata.online.\nverizon-private-wireless.com\nreply-tmobile.com\ntmobilecellular.space\n5g-tmobile.com\nt-mobile4g-us.com\nverizone4g-device.com\n\n\n-----\n\nFigure 15. A BEC email using telecom-related domains\nWhen we tracked “TELE-COMM” naming BEC domains’ email infrastructure (observed from\nthe domain name system mail exchanger or DNS MX records), we checked several\ncommercial email services such as Google Workspace (aspmx.l.google.com) and\nTitan[.]email. These commercial email services provide advanced features like email\ntracking, scheduled sending, and follow-up reminders, and it is highly likely that BEC\noperators also optimise their operations’ flow in leveraging these services.\n\nFigure 16. Email services like Titan provide advanced features for tracking the progress of\nemails sent\nBelow is an example of a BEC email initiating a conversation, wherein spaces are inserted in\nbetween words in the subject line. The word “INVOICE” is replaced with “I NVOICE” to\nevade anti-scam email solutions that rely on keywords or regular\nexpressions. Similar tricks have been observed in sextortion and phishing email schemes.\n\n\n-----\n\nFigure 17. A BEC email sender using separate words or letters in the subject line.\n[Screenshot sourced from VirusTotal](https://www.virustotal.com/gui/file/8fd44022599427d1f3b4e83c42451b7823df34d39e09e33dbe2ff24747971361)\n\nConclusion\n\n[Unlike other cybercriminal schemes, phishing and](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/best-practices-identifying-and-mitigating-phishing-attacks) [BEC scams can be tricky to detect as they](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/how-to-spot-business-email-scam)\nare targeted toward specific recipients. Attackers seek to compromise email accounts to gain\naccess to financial and other sensitive information related to business operations, and BEC\nactors can easily use such access and information for other illicit activities. In the sample\nroutines discussed here, the attackers’ emails themselves do not include the typical malware\npayload of malicious attachments. As a result, traditional security solutions will not be able to\nprotect accounts and systems from such attacks.\n\nFrom our observations, BEC attacks don’t only target high-profile users but also any\nemployee that can be found on social media networks with significant personal information\npublished (such as LinkedIn). These pieces of information can be used to spoof employees\nand partners, and cause significant financial damage to businesses.\n\nAs we observed professional email services being used for BEC attacks, we believe BEC\nactors will keep adopting new services and tools to optimise their operations flow as email\nservices try to optimise services for their legitimate users. Targets in the Americas and\nEurope will continue to be targeted as sources of profit for these scams and will likely\ncontinue as companies see remote work becoming more mainstream, whether it be for their\nown operations or their managed service providers’ (MSPs). Companies and employees will\nhave to keep their guard up to mitigate the risks from BEC and other email-based scams:\n\nEducate and train employees. Deflect company intrusions through continuous InfoSec\neducation. All company personnel — from the CEO to rank-and-file employees — must\nbe aware of the various techniques and kinds of scams, and the procedure to follow\nwhen they encounter an attack attempt.\n\n\n-----\n\nConfirm requests using other channels. Avoid clicking on embedded links or directly\nreplying to the email addresses used in the email. Exercise caution by following a\nverification system amongst employees who handle sensitive information, such as\nmultiple personnel sign-off or additional verification protocols.\n**Scrutinize all emails. Be wary of irregular emails with suspicious content such as**\nunknown and dubious sender emails, domain names, writing styles, and urgent\nrequests. Report suspicious emails to the respective security and InfoSec teams for\nanalysis, tracking, and blocking.\n\nTrend Micro solutions\n\nTrend Micro protects both small- to medium-sized businesses and enterprises against\nphishing- and BEC-related emails. Using enhanced machine learning combined with expert\nrules, [Trend Micro™ Email Security solution analyses both the header and the content of an](https://www.trendmicro.com/en_in/business/products/user-protection/sps/email-and-collaboration/email-security.html)\nemail to stop BEC and other email threats. For source verification and authentication, it uses\nSender Policy Framework (SPF), DomainKeys Identified Mail (DKIM), and Domain-Based\nMessage Authentication, Reporting and Conformance (DMARC).\n\nThe [Trend Micro™ Cloud App Security solution enhances the security of Microsoft Office 365](https://www.trendmicro.com/en_in/business/products/user-protection/sps/email-and-collaboration/cloud-app-security.html)\nand other cloud services through sandbox malware analysis for BEC and other advanced\nthreats. It uses Writing Style DNA, Display Name Spoofing, and High-Profile domain to\ndetect BEC impersonations and computer vision to find credential-stealing phishing sites with\n[Advanced Spam Protection enabled. It also protects cloud file sharing from threats and data](https://docs.trendmicro.com/en-us/enterprise/cloud-app-security-online-help/advanced-threat-prot_001/adding-atp-policies/advanced-spam-protec.aspx)\nloss by controlling sensitive data usage.\n\nIndicators of Compromise (IOCs)\n\nFor the full list of IOCs, you may download the text file [here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/21/j/analyzing-email-services-abused-for-business-email-compromise/IOCs-analyzing-email-services-abused-for-BEC.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-14 - Analyzing Email Services Abused for Business Email Compromise.pdf"
    ],
    "report_names": [
        "2021-10-14 - Analyzing Email Services Abused for Business Email Compromise.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535698,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653690908,
    "ts_modification_date": 1653690908,
    "files": {
        "pdf": "https://archive.orkl.eu/fd75703b26c906424bc76dbba287880645fd1814.pdf",
        "text": "https://archive.orkl.eu/fd75703b26c906424bc76dbba287880645fd1814.txt",
        "img": "https://archive.orkl.eu/fd75703b26c906424bc76dbba287880645fd1814.jpg"
    }
}