{
    "id": "0bd01706-2d83-477a-9a5a-aa6a0b5780c6",
    "created_at": "2022-10-25T16:48:25.10596Z",
    "updated_at": "2025-03-27T02:09:29.567721Z",
    "deleted_at": null,
    "sha1_hash": "36044243987dace8e439a54a8d4fce6f3508126a",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-08-15T03:58:21Z",
    "file_modification_date": "2019-08-15T03:58:21Z",
    "file_size": 1005983,
    "plain_text": "## In the Balkans, businesses are under fire from a double‑barreled weapon\n\n**[welivesecurity.com/2019/08/14/balkans-businesses-double-barreled-weapon](https://www.welivesecurity.com/2019/08/14/balkans-businesses-double-barreled-weapon/)**\n\nAugust 14, 2019\n\nESET researchers discovered a campaign that uses two malicious tools with similar capabilities\nto ensure both resilience and broader potential for the attackers\n\n[Zuzana Hromcová 14 Aug 2019 - 11:30AM](https://www.welivesecurity.com/author/zhromcova/)\n\nWe’ve discovered an ongoing campaign in the Balkans spreading two tools having a similar\npurpose: a backdoor and a remote access trojan we named, respectively, BalkanDoor and\nBalkanRAT.\n\nBalkanRAT enables the attacker to remotely control the compromised computer via a graphical\ninterface, i.e., manually; BalkanDoor enables them to remotely control the compromised computer\nvia a command line, i.e., possibly en masse. ESET security products detect these threats as\nWin{32,64}/BalkanRAT and Win32/BalkanDoor.\n\nA typical victim of this campaign, which uses malicious emails as its spreading mechanism, ends\nup having both these tools deployed on their computer, each of them capable of fully controlling\nthe affected machine. This rather uncommon setup makes it possible for attackers to choose the\nmost suitable method to instruct the computer to perform operations of their choice.\n\nThe campaign’s overarching theme is taxes. With the contents of the emails, included links and\ndecoy PDFs all involving taxes, the attackers are apparently targeting the financial departments of\norganizations in the Balkans region. Thus, although backdoors and other tools for remote access\nare often used for espionage, we believe that this particular campaign is financially motivated.\n\nThe campaign has been active at least from January 2016 to the time of writing (the most recent\ndetections in our telemetry are from July 2019). Some parts of the campaign were briefly\n[described by a Serbian security provider in 2016 and the Croatian CERT in 2017. Each of these](https://www.it-klinika.rs/blog/prvi-phishing-na-srpskom)\nsources focused only on one of the two tools and only on a single country. However, our research\nshows that there is a significant overlap in targets and also in the attackers’ tactics, techniques\nand procedures.\n\nOur findings show that the mentioned attacks have been orchestrated and we consider them a\nsingle long-term campaign that spans Croatia, Serbia, Montenegro, and Bosnia and Herzegovina.\n\nOur research has also shed more light at the malware used in this campaign and provided some\ncontext. We’ve discovered a new version of BalkanDoor with a new method for\n[execution/installation: an exploit of the WinRAR ACE vulnerability (CVE-2018-20250). Further,](https://nvd.nist.gov/vuln/detail/CVE-2018-20250)\nwe’ve seen both malicious tools digitally signed with various certificates the developers paid for to\nadd perceived legitimacy. One of them, issued to SLOW BEER LTD, was even valid at the time of\nwriting; we’ve notified the issuer about the misuse and they revoked the certificate.\n\n\n-----\n\nIn this article, we will describe some notable features of both BalkanDoor and BalkanRAT. Our\nanalysis shows that the former runs as a Windows service, which allows it to unlock the Windows\nlogon screen remotely and without the password or start a process with the highest possible\nprivileges. The latter misuses a legitimate remote desktop software (RDS) product and uses extra\ntools and scripts to hide its presence from the victim, such as hiding the window, tray icon,\nprocess and so on.\n\n## Targets and distribution\n\nBoth BalkanRAT and BalkanDoor spread in Croatia, Serbia, Montenegro, and Bosnia and\nHerzegovina. (These countries, along with Slovenia and former Macedonia, formed the country of\nYugoslavia until 1992.)\n\n\n_Figure 1. Malware distribution by country_\n\n\nAccording to our telemetry, the campaign spreading these tools has been live since 2016, with the\nmost recent detections as late as in July 2019.\n\nThe attackers have been distributing their tools via malicious emails (“malspam”) with links\nleading to a malicious file.\n\nThe links included in the malspam emails used for distribution of both BalkanRAT and\nBalkanDoor mimic legitimate websites of official institutions.\n\n**Malicious domain** **Real domain** **Institution**\n\npksrs[.]com [pks.rs](http://www.pks.rs/) Chamber of Commerce and Industry of Serbia\n\n\nporeznauprava[.]com\n\nporeznauprava[.]net\n\n\n[porezna-](http://www.porezna-uprava.hr/)\nuprava.hr\n\n\nMinistry of Finance of Croatia, Tax Administration\n\n\n-----\n\n**PDF name** **Language** **Content**\n\nMIP1023.pdf Bosnian Tax form\n\nPonovljeni-Stav.pdf Bosnian Tax law\n\nAUG_1031.pdf Bosnian Instructions for using tax filing application\n\nZakon.pdf Croatian Tax law\n\nZPDG.pdf Serbian Tax law\n\n\n-----\n\nMost often, the links leading to an executable file are disguised as links to a PDF. The executable\nfile is a WinRAR self-extractor with its name and icon changed to resemble a PDF to fool the\nuser. When executed, it is configured to unpack its content, open the decoy PDF to prevent any\nsuspicion – and silently execute either BalkanRAT or BalkanDoor.\n\nIn some of the latest samples of BalkanDoor detected in 2019, the malware is distributed as an\nACE archive, disguised as a RAR archive (i.e., not an executable file), specially crafted to exploit\n[the WinRAR ACE vulnerability (CVE-2018-20250). This vulnerability, which has been remediated](https://www.win-rar.com/singlenewsview.html?&L=0&tx_ttnews%5Btt_news%5D=116&cHash=2b3cf0017a6df3b5a4a66288a60a1eae)\n[in version 5.70 released on February 28, 2019, is known to have been exploited quite often toth](https://www.fireeye.com/blog/threat-research/2019/03/winrar-zero-day-abused-in-multiple-campaigns.html)\ndistribute malware.\n\nThe exploit-based deployment of BalkanDoor is stealthier than in previous versions of the\nmalware because it does not require executing the downloaded file – an operation that might\nraise the intended victim’s suspicions.\n\n## The campaign\n\nAccording to our telemetry, most of the time, both tools have been deployed on the same\nmachine. The combination of the tools gives the attacker both a command-line interface and a\ngraphical interface to the compromised computer.\n\nIn the case of the whole toolset being deployed on the machine, here is an example scenario for\nthe attack:\n\nThe attacker detects that the victim has their screen locked and thus, most probably, is not using\nthe computer (either via BalkanDoor sending screenshot showing that computer is locked, or via\n[the View Only mode of BalkanRAT). Via the BalkanDoor backdoor, the attacker sends a backdoor](https://www.remoteutilities.com/support/docs/full-control-and-view/)\ncommand to unlock the screen… and using BalkanRAT, they can do whatever they want on the\ncomputer.\n\nHowever, even if the victim does not use their computer, the chance of them spotting the actions\nperformed by the attackers is still there. Even with this disadvantage, using the RDS tool may be\nuseful. The attacker is not limited by the commands shipped in the backdoor, or by their\nprogramming skills: manually, they can perform actions that would require writing a lot of code if a\nbackdoor was the only tool available.\n\nIn principle, the Balkan- toolset could be used for espionage, among other possible goals.\nHowever, not only the campaign’s targets and distribution, but also our analysis of the Balkantoolset tools show that the attackers are going after money instead of espionage.\n\nThe BalkanDoor backdoor does not implement any exfiltration channel. Presumably, if the\ncampaign were intended for espionage, the attackers would need an exfiltration channel for\nuploading the collected data – at least as a backup to manual exfiltration, which might not be\nalways an option.\n\nOn the contrary – and supporting the notion that the attackers’ goal has been to commit some\nfinancial crime – we’ve seen BalkanRAT dropping a tool that can list available smart cards, via the\nSCardListReadersA/ SCardConnectA API functions. Smart cards are usually issued by banks or\ngovernments for confirmation of the holder’s identity. If misused, smart cards can facilitate\n\n\n-----\n\n## Analysis – BalkanDoor\n\nBalkanDoor is a simple backdoor with a small number of commands (download and execute a\nfile, create a remote shell, take a screenshot). It can be used to automate tasks on the\ncompromised computer or to automatically control several affected computers at once. We have\nseen six versions of the backdoor, ranging in supported commands, evolving since 2016.\n\nThe initial dropper unpacks all components, opens a decoy PDF (in some cases) and executes a\nbatch installation script that ensures persistence of the backdoor.\n\nThe backdoor registers itself as a service, under a legitimately-looking service name (e.g.\nWindowsSvc, WindowsPrnt, WindowsConn or WindowsErr); the accompanying batch scripts can\nfurther ensure persistence by using Registry Run Keys or Startup folder.\n\nAfter the backdoor is installed, the computer connects to a C&C server, identifying itself by the\ncomputer name and requesting the commands. The backdoor can connect to any of the C&Cs\nfrom a hardcoded list – a measure to increase resilience. It connects via the HTTP or HTTPS\nprotocol; if HTTPS is used, then the server certificates are ignored.\n\nIf the connection is not successful, the backdoor is capable of using the user-configured proxy on\nthe victim’s computer and repeating the connection attempt.\n\nThe backdoor commands come in a format of an INI file, with properties determining the\ncommands, command arguments and intended recipients. Specifying the list of recipients allows\nthe attacker to send their commands to several compromised computers at once, e.g. to\nautomatically take screenshots of all compromised computers.\n\n**Commands** **Functionality**\n\ncn Specifies computer name(s) of the intended recipients of the commands\n\ndu, int Download and execute a file\n\ndu, ra, de, rpo Download and execute a file, in the specified context and on a specified desktop\n\nrip Create a remote shell accessible from the specified IP address\n\nscr_int, scr_dur Capture a series of screenshots of the specified duration\n\nFurthermore, the backdoor itself can be executed in several modes, determined by the command\nline arguments with which it is executed. These modes themselves can serve as backdoor\ncommands (when executed from the remote shell):\n\n**Argument** **Functionality**\n\n/unlock Unlocks the screen\n\n/rcmd Creates a remote shell and redirects its input/output to the specified IP address\n\n/takescr Captures a series of screenshots, duration determined by other arguments\n\n/run Executes the specified command using cmd.exe\n\n\n-----\n\n/start Starts the associated service, which starts the main procedure (see /nosvc)\n\n/nosvc Main payload, communicates with C&C and interprets backdoor commands\n\nAmong the BalkanDoor capabilities, the most notable is passwordless screen-unlocking.\n\nThis feature comes in handy to the attackers in cases when a logged-in user locks the computer.\nThe “Lock screen” is just another Desktop for the system, so any malware with the necessary\nprivileges can switch to a real desktop by command. No password is required to perform this\noperation.\n\n\n_Figure 3. Code responsible for unlocking the computer when the backdoor is executed remotely with an “/unlock” argument_\n\n\n## Analysis – BalkanRAT\n\nThe BalkanRAT part of the malicious Balkan- toolset is more complex compared to its backdoor\naccomplice. Its goal is to deploy a copy of the Remote Utilities software, which is commercial\nsoftware by a Russian vendor, Remote Utilities, LLC, used for remote access to a computer or for\nremote administration. BalkanRAT also provides the attacker with the credentials needed for this\nremote access.\n\nBalkanRAT has several additional components to help load, install and conceal the existence of\nthe RDS. They can add exceptions to the firewall, hide the RDS’s window and its tray icon, and\nhide the presence of related processes in the task manager.\n\n\n-----\n\n_Figure 4. Components used in the campaign to deploy and hide the presence of the RDS_\n\n\n1. The dropper first unpacks all components; a configuration file, the remote desktop software\n\nand a core component installing it, a userland rootkit, a GUI hider and a decoy PDF file.\n2. The dropper opens the PDF file so as not to arouse suspicion of the user.\n3. Covertly, the dropper executes the core component (32-bit) in the installation mode.\n4. The core component (32-bit) installs itself to be executed with each start, and adds\n\nexception to the firewall for the RDS. It executes commands inst1 and inst2 specified in the\nconfiguration file, and executes itself again, now in stealth mode.\n5. In this mode, the core component acts like a keylogger.\n6. The core component (32-bit) executes the 64-bit version of itself, in injection mode (if\n\napplicable).\n7. The core component (64-bit) injects the userland rootkit (64-bit) into task manager\n\nprocesses. The userland rootkit then hides presence of the malicious processes in the task\nmanager.\n8. The core component (32-bit) executes the RDS. It repeatedly monitors and hides the RDS\n\nwindow (because it is a GUI application).\n9. The core component (32-bit) injects the userland rootkit (32-bit) into task manager\n\nprocesses. The userland rootkit then hides presence of the malicious processes in the task\nmanager.\n10. The core component (32-bit) executes commands cmd1 and cmd2, as specified in the\n\nconfiguration file. One of such commands was seen executing a GUI hider, which is an\nAutoHotKey script hiding the tray icon of the RDS.\n\n_Note: Some components are optional. Also, sometimes they are deployed as a set comprising an_\n_encrypted payload and the corresponding loader. We are omitting these details._\n\nThe configuration file of BalkanRAT is in INI file format (similarly to BalkanDoor, which uses this\n\n\n-----\n\ninst1, inst2 Commands executed by the core component during installation\n\ncmd1, cmd2 Command executed by the core component main payload\n\nhproc List of processes that should be hidden by userland rootkit\n\nmproc List of processes where userland rootkit is injected\n\n\n_Figure 5. BalkanRAT’s configuration file – properties (top) and example (below)_\n\n\nBalkanRAT’s core is a multipurpose component (there are both a 32-bit and a 64-bit versions); it\ncan be executed in various modes, determined by the command-line argument. Most significantly,\nit is used for installation of BalkanRAT, launching a userland rootkit and adding exceptions for the\nRDS component in the firewall.\n\n\n**Argu‐**\n**ment**\n\n\n**Functionality**\n\n\n/rhc Executes a batch file\n\n/fwl Adds exception to the firewall for the specified program\n\n/sreg Sets configuration data for the RDS in the registry (especially email address where the\ncredentials should be sent)\n\n/inst Ensures persistence by adding itself to the [HKEY_CURRENT_USER\\SOFTWARE\\Mi‐\ncrosoft\\Windows NT\\CurrentVersion\\Windows] registry key under the “load” entry. Adds\nexception for the RDS to the local firewall. Executes itself again in the main mode (no\narguments).\n\n/inj Injects the userland rootkit library into processes, as specified in the configuration file\n\n(none) Main mode. Executes the 64-bit version of itself (if applicable), injects the userland rootkit,\nexecutes the RDS and hides the window by changing its coordinates to values outside the\nscreen.\nAnother thread captures pressed keystrokes.\n\nThe main part of the BalkanRAT malware is a copy of the Remote Utilities software for remote\naccess. Instead of using the official version, BalkanRAT deploys a copy signed by a certificate of\nthe attacker.\n\nThe client side of the RDS running on the victim’s computer must know the unique ID and the\npassword, both generated on the server side, to connect to the server. The RDS deployed by\nBalkanRAT is configured in such a way that the password is the same for all victims, and the\ngenerated unique ID is sent to the attacker’s email address by the tool itself.\n\nSince the tool BalkanRAT misuses is legitimate, it leverages the genuine Remote Utilities’\n\n\n-----\n\nAs a result, the attacker has obtained credentials to access the compromised computer via the\nRemote Utilities software. Using this tool, they can broadcast the screen to monitor the activity of\nthe user and manually take over the compromised computer.\n\n\n_Figure 6. A window the victim never sees. With a legitimate copy of Remote Utilities, this_\n\n_window is visible; however, BalkanRAT will hide it using the GUI hider feature._\n\n\nTo remain stealthy, BalkanRAT uses the GUI hider feature. In most samples (some older ones are\nan exception), it is implemented as an AutoHotKey script, compiled into an executable file so that\nit can be run on a computer even if AutoHotKey is not installed there. The purpose of this script is\nto hide the tray icon of the RDS client.\n\n\n_Figure 7. AutoHotKey script embedded in the resource section of the executable_\n\n\nAnother notable feature used by BalkanRAT to stay hidden is the ability to hide processes from\nthe user\n\n\n-----\n\nTo achieve this, userland rootkit libraries are injected in processes hardcoded in the configuration\nfile. The userland rootkit hooks the NtQuerySystemInformation function for the process in which it\nis injected. In case SystemProcessInformation is queried, it filters out all entries for processes\nwith the names specified in the configuration file. As a result, conventional task manager utilities\nwill not display the processes the attackers want to keep hidden from the user.\n\n\n_Figure 8. With the userland rootkit injected, some processes are missing in the list (left). Without the rootkit, the processes_\n\n_are visible (right)._\n\n\nNaturally, the list of processes that will be hidden contain mostly ones belonging to BalkanRAT.\nHowever, we have also seen names like “weather.exe” or “preserve.exe” in the list – which belong\nto the BalkanDoor backdoor. This finding supports the belief these two tools are indeed used\ntogether.\n\n## Conclusion\n\nBoth BalkanRAT and BalkanDoor have some interesting tricks up their sleeves and each of them\nseparately pose a significant risk to the victims. If used together as a toolset, they make an even\nmore powerful weapon – the more the campaign we have discovered targets accounting, a\nfunction that is critical for organizations.\n\nThe campaign targeting accountants in the Balkans shows some similarities with a campaign\n[aimed at Ukrainian notaries reported in 2016. (The only source we have been able to find](https://cys-centrum.com/ru/news/black_notaries_case)\ndescribing it is in Russian.) In that case, the attackers’ goal was to take control over a notary\ncomputer and issue some illegal operation on behalf of the notary.\n\nJust as attackers may confirm a fraudulent transaction on behalf of a notary, they may perform a\nfraudulent transaction while impersonating a manager in a company’s financial department.\n\nTo stay safe, business users – and their employers – should follow basic cybersecurity rules: be\ncautious about emails and scrutinize their attachments and links, keep their software updated and\nuse a reputable security solution.\n\n# Indicators of Compromise (IoCs)\n\n\n-----\n\nWin32/BalkanDoor.A\nWin32/BalkanDoor.B\nWin32/BalkanRAT.A\nWin32/BalkanRAT.B\nWin64/BalkanRAT.A\nWin64/BalkanRAT.B\n\n### SHA-1\n\n#### BalkanDoor – executable files\n\n02225C58A0800A8FFFE82F7614695FDEEB75C8B3\n3E8AF08F2C64D9D305A129FDEA6B24ED3D8D9484\n400FF3FD5BEF94DCBEAE24B5B8A6632DCD1D22A6\n576EF0057982DE87CA029C736706E840031A27F4\n5CC4F248595268A0C9988DAEE3F0F8F9F5AC0A7F\n60EB2A19EC63FF36D13F472EC0E6A594C2778CE6\n7AA3D6EA4736C3BF627DB1837B9C8D2B29D7AB8D\nAC5383306459CE8CD19BFF412875F093B40427C6\n\n#### BalkanRAT – executable and auxiliary files\n\n006B8EF615550BA731A30FA83B0E03CD16D2A92D\n030DC8C3832F664FA10EFA3105DFF0A9B6D48911\n032884A46430039ED4E38518AA20742B79AB2678\n09D18CD045285A753BCF4F42C6F10AF76913546A\n0F7A95C89911E3DE9205FF6AA03E1A4FCE6BC551\n13D8664B438DA278CEB9C8593AE85023432054CD\n17EA62EBC5F86997FD7E303FBBFF3E343DA38FCC\n1C03ED1ADF4B4E786EFC00F3D892217FAAAFB268\n15EC88015FB554302DB131258C8C11C9E46209D4\n21DE3EB6F39DF4DBBF2D1FE4B6467AAE3D9FBEBD\n21EE61874F299661AECC5453F4D6D0EC5380DAD0\n270F1FA36365273F14D89EE852D8A438A594CD05\n30BA2213BE4355D619E20DA733F27F59DA7B937E\n3170B45FB642301687A3A320282099B9D7B7F0F2\n38E7FCD6038E688DEC9F1AF9D2D222B9BBC03A8C\n3927B48D315F6712D33166A3B278B7835E76A6A9\n3C1FF7BBE8BC2BE9E5531FFAD25B18F03C51CF6B\n421F52733D334BE32C899670426C06CB72D92CDE\n46E4B456729CF659527D2697BD8518E67B5A0056\n4F8BA64DA7EA16A7CE5AA2C83BBFCE1C8646E424\n500A447A187240706C059C16366FEDF1AA13EA77\n555844CA5CD40DFC27778C2D3B6AFA43D1B76685\n5A3201048D8D9D696102A3C3B98DA99C2CC4FF1F\n64E3A46BF393936A79478C891654C1070CEC42D1\n685314454A7D7987B38ADD2EDDBAC3DB9E78464F\n\n\n-----\n\n730E20EE7228080A7F90A238D9E65D55EDD84301\n73E0A62F1AAAB3457D895B4B1E6E2119B8B8D167\n7BA4D127C6CD6B5392870F0272C7045C9932DB17\n7BF564891089377809D3F0C2C9E25FD087F5F42B\n8852647B1C1A2EFA4F25FEA393D773F9FF94D6FA\n8D9A804B1433A05216CFE1D4E61CE5EB092A3505\n8F85738534158DB9C600A29B9DED8AC85C3DE8C1\n963CF321740C4EF606FEC65FCE85FB3A9A6223AC\n97926E2A7514D4078CF51EAC069A014309E607F1\n9EA0C6A17EE4EB23371688972B7F4E6D4D53F3C8\n9F2C6A44453E882098B17B66DE70C430C64C3B26\nA1DEA762DD4329E77FE59526D4ABC0E15DE2BBBC\nA56A299A8EEF9F4FF082184F66FAD1B76C7CACB8\nA5ACE8F90C33CBDB12D398C0F227EC48F99551BF\nAA4AD783DFE3CC6B0B9612814ED9418253203C50\nAB311B53591C6625335B9B791676A44538B48821\nAEDF43347AF24D266EC5D471723F4B30B4ACC0D0\nB18222E93D25649BC1B67FAB4F9BF2B4C59D9A1A\nB8F67BB5682B26ACD5969D9C6AC7B45FE07E79E1\nBAD38D474D5CAAAC27082E6F727CAE269F64CF3C\nBEEF0EE9397B01855C6DAA2BFF8002DB4899B121\nBFE3F5CEC25181F1B6852E145013E548B920651E\nC268CAB6D8EC267EEE463672809FAAEE99C2F446\nC2F9FFDF518DA9E037F76902746DE89C2E2821E8\nC3813734D3BFC07E339C05417055A1A106E2FBBD\nC8CBBC175451A097E605E448F94C89D3E050ACD5\nC90756A3C6F6DC34E12BABF5F26543510AACE704\nC90B5471BBA3293C0A0E6829A81FBE2EB10B42B2\nCD1BC431F53E9CFF8204279CDF274838DE8EBB61\nCD82D898A3CEA623179456D9AE5FAD1FB5DA01A0\nCDBB74CA0960F2E8631D49ACABF2CEA878AE35B8\nCE7092FF909E9380CC647C3350AA3067E40C36A9\nCEA70DB7FB8E851EF0D6A257A41C9CEE904345B5\nCF7A8AFAC141E162A0204A49BAD0A49C259B5A45\nDEEA26F5AF918CEC406B4F12184F0CAB2755B602\nDFDFCC61770425A8D1520550C028D1DF2861E53F\nE0007A2E0E9AE47DD028029C402D7D0A08EBBC25\nE00C309E3FE09248B8AFCFF29FC1A79445C913DA\nE95C651C539EAF73E142D1867A1A96098A5E219F\nECEEE01F4E8051F544062AE37D76A3DF2921DF82\nF06CB000F9A25DDE791C7E5BC30917C74A8F2876\nF26C663D5F6F534543A7C42B02254C98BB4EC0D5\nF3BC2F436693B61FED7FA7DDF8BC7F27618F24F3\nF6030AE46DC2CEF9C68DA1844F7DCEA4F25A90A3\nFA19E71F9A836EA832B5D738D833C721D776781A\nFFE23D510A24DB27C1C171D2BAF1FBEB18899039\n\n#### Remote Utilities (otherwise legitimate releases signed by attackers’\n\n\n-----\n\n038ECEB80597DE438D8194F8F57245EB0239FF4B\n2A1BB4BB455D3238A01E121165603A9B58B4D09D\n34CE3FBEE3C487F4F467B9E8EB36844BB5ACB465\n3B88D4047FA2B8F8FA6241320D81508EB676EA7A\n400438EB302886FD064274188647E6653E455EED\n42F70DAA8C75E97551935D2370142C8904F5A20D\n446D3FBAE9889FE59AFAD02C6FB71D8838C3FC67\n4D46FB773C02A9FF98E998DA4F0777FB5D9F796B\n510C93D3DC620B17500C10369585F4AF7CF3CE0D\n6A5CA3B9EE0A048F0AEE1E99CBF3943D84F597FF\n6D53E7B5099CE11ACA176519620E8064D4FF9AD0\n7CEC39AC6A436577E02E7E8FE8226A00E58564CB\n8888014C16732CD5136A8315127BA50BB8BB94ED\nA5A05BA6E24226F1BC575CBC12B9FC59F6039312\nB77CFFF0E359946029120DD642505BC0A9713ECC\nBC6F31D5EBC71FF83BACC0B4471FDEFC206B28D0\nBE8A582360FB16A4B515CD633227D6A002D142FA\nC6E62A113E95705F9B612CDBF49DAC6BAD2073BD\nD8D27C742DA87292EF19A197594193C2C5E5F845\nDBE0E084B2A8CE4711C3DF4E62E8062234BF6D3B\nE56189FE86C9537C28099518D4F4EA2E42EF9EEE\nE918192D2B5C565A9B2756A1D01070C6608F361C\n\n#### Scripts\n\n0BD6C70B7E2320F42F0CFC2A79E161614C7C4F66\n7A41B912A3F99370DF4CD3791C91467E23B2AA82\nA15AB505B79B88A9E868C95CE544942403C58CB6\nA8A5980DE35FBF580497B43EF7E8499E004F9F38\nB248E43BAB127D8E1E466821B96B7B7ECF37CB78\n\n#### Configuration files\n\n28F152154F6E6074EA0DE34214102119C8589583\n37A2A15C52CAA7D63AF86778C2DD1D2D81D4A270\nB4A847D7AAC4164CF90EA585E4842CBF938B26CF\n\n#### Decoy PDF files\n\n1E0C4A5F0FF2E835D12C3B6571AE6000E81A014B\n8722441FF3678D154C89E312DB1A54951DD21C3F\n88C3FDA42768C5B465FD680591639F2CDC933283\n9F48E109675CDB0A53400358C27853DB48FCD156\nC9B592BD7B69995C75CD5B1E4261B229C27FB479\n\n### Misused certificates\n\n\n-----\n\nAMOK Limit‐\ned Lia‐\nbility\nCompa‐\nny\n\nValm‐\npak,\nTOV\n\nValm‐\npak,\nTOV\n\n3D\nPEO‐\nPLE\nLIMIT‐\nED\n\nADUNIK\nLTD\n\nSLOW\nBEER\nLTD\n\n\nllc.amok@list.ru\n\ntovvalpak@mail.ru\n\n\nadministrator@\nslowbeerltd.in‐\nfo\n\n\n2015/07/30 2016/07/28 4E36C4D10F1E3D820058E4D45\n1C4A7B77856BDB3\n\n2016/04/10 2017/04/01 17D50E2DBBAF5F8F60BF‐\nFE1B90F4DD52FDB44A09\n\n\n- 2016/08/22 2017/11/04 4A362020F1AFD3B‐\nD0C67F12F55A5754D2E70338C\n\n- 2017/11/05 2018/11/06 936EDFB338D458F‐\nBACB25FE557F26AA3E101506E\n\n- 2017/10/11 2018/10/12 E7DF448539D1E2671D‐\nCF787CF368AAC2ED8F5698\n\n\n2019/01/25 2019/12/18 2359D644E48759F43993D34885\n167FECAFD40022\n\n\nEx‐\npired\n\nRe‐\nvoked\n\nRe‐\nvoked\n\nEx‐\npired\n\nEx‐\npired\n\nRe‐\nvoked\n\n\n### File names\n\n#### BalkanDoor\n\n**Dropper: Zakon.exe**\n**Backdoors: weather.exe, winmihc.exe, Preserve.exe, PreservS.exe, WindowsConnect.exe**\n**Scripts: weather.cmd, winmihc4.cmd, mihcupdate.cmd**\n**Decoy PDF file: Zakon.pdf**\n\n#### BalkanRAT\n\n**Droppers: ZPDGI.exe, ZPDGV.exe, ZPDGE.exe, ZPDGO.exe, ZPDGU.exe, ZPDGA.exe,**\nPonovljeni-Stav.exe, AUG_1031.exe, MIP1023.exe\n**Configuration file: stg.cfg**\n**Decoy PDF files: ZPDG.pdf, Ponovljeni-Stav.pdf, AUG_1031.pdf, MIP1023.pdf**\n**Core component: winchk32.exe, wininit.exe, hide.exe, winchk64.exe**\n**RDS: rutserv.exe, rfusclient.exe**\n**Userland rootkit: winmmon.dll, winmmon64.dll**\n**GUI hider components: serk.bat, serk.exe**\n\n### Folder names\n\n%WINDIR%\\1B20F6AA-6CAD-45A7-81CB-120FB86FECD8\n%WINDIR%\\29D451CF-3548-4486-8465-A23029B8F6FA\n%WINDIR%\\B1EDD68E 6AD8 4A7E 91A1 3C30903B8DD4\n\n\n-----\n\n### C&C servers\n\nhttp://bestfriendsroot[.]com/smart.php\nhttp://bestfriendsroot[.]com/weather.php\nhttp://bestfriendsroot[.]com/zagreb.php\nhttp://consaltingsolutionshere[.]com/smart.php\nhttp://consaltingsolutionshere[.]com/weather.php\nhttp://consaltingsolutionshere[.]com/zagreb.php\nhttp://dogvipcare[.]net/kversion.php\nhttp://hvar.dogvipcare[.]net/dekol.php\nhttp://kimdotcomfriends[.]com/smart.php\nhttp://kimdotcomfriends[.]com/weather.php\nhttp://kimdotcomfriends[.]com/zagreb.php\nhttp://limosinevipsalon[.]com/kversion.php\nhttp://luxembourgprotections[.]com/kversion.php\nhttp://malmevipbikes[.]se/kversion.php\nhttp://split.malmevipbikes[.]se/dekol.php\nhttp://zagreb.porezna-uprava[.]com/dekol.php\n\n### Email addresses used to exfiltrate Remote Utilities credentials\n\nb.klokov@inbox.ru\ngalkin.valentin.83@bk.ru\ngligorijmaskov@mail.ru\nivan.aslanov@newmail.ru\nivan.tatarov@qip.ru\nmelikov.viktor@yandex.ru\nmr.aleksandrandreev@mail.ru\ntest@bbportal.info\ntgerik@list.ru\nvladzlobin@list.ru\n\n# MITRE ATT&CK techniques\n\n### BalkanRAT\n\n\nInitial\nAc‐\ncess\n\nExecu‐\ntion\n\n\n[T1192](https://attack.mitre.org/techniques/T1192/) Spearphish‐\ning Link\n\n[T1059](https://attack.mitre.org/techniques/T1059/) CommandLine\nInterface\n\n[T1106](https://attack.mitre.org/techniques/T1106/) Execution\nthrough API\n\n\nBalkanRAT is distributed via emails that contain links to malware.\n\nBalkanRAT uses cmd.exe to execute files.\n\nBalkanRAT uses ShellExecuteExW and LoadLibrary APIs to ex‐\necute other malware components.\n\n\n[T1064](https://attack.mitre.org/techniques/T1064/) Scripting BalkanRAT uses batch scripts for malware installation and\n\nti\n\n\n-----\n\nBalkanRAT relies on the victim to execute the initial infiltration.\nThe malware is disguised as PDF documents with misleading\nnames, in order to entice the intended victim to click on it.\n\nBalkanRAT uses the following Registry Run key to establish per‐\nsistence: [HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Win‐\ndows NT\\CurrentVersion\\Windows], “load”.\n\nBalkanRAT is able to impersonate the logged-on user using Du‐\nplicateTokenEx or ImpersonateLoggedOnUser APIs.\n\nBalkanRAT is digitally signed with code-signing certificates.\n\nBalkanRAT decrypts and decompresses some of its\ncomponents.\n\nBalkanRAT is capable of adding exceptions to the local firewall,\nusing its COM interface.\n\nBalkanRAT modifies the\n\n[HKEY_CURRENT_USER\\Software\\Usoris\\Remote\nUtilities\\Server\\Parameters] registry key to store configuration of\nthe RDS\n\nSome components of BalkanRAT are compressed and then en‐\ncrypted by a XOR cipher.\n\nBalkanRAT injects a userland rootkit library into processes of\ntask manager utilities.\n\nOperators of BalkanRAT have been seen deploying a second\nmalicious tool (BalkanDoor) to preserve remote access in case\nBalkanRAT is removed.\n\n\nPersis‐\ntence\n\nPrivi‐\nlege\nEsca‐\nlation\n\nDe‐\nfense\nEva‐\nsion\n\nDis‐\ncovery\n\nCollec‐\ntion\n\nCom‐\nmand\nand\nCon‐\ntrol\n\n\n[T1204](https://attack.mitre.org/techniques/T1204/) User\nExecution\n\n[T1060](https://attack.mitre.org/techniques/T1060/) Registry Run\nKeys / Start‐\nup Folder\n\n[T1134](https://attack.mitre.org/techniques/T1134/) Access To‐\nken\nManipulation\n\n[T1116](https://attack.mitre.org/techniques/T1116/) Code\nSigning\n\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfus‐\ncate/Decode\nFiles or\nInformation\n\n[T1089](https://attack.mitre.org/techniques/T1089/) Disabling\nSecurity\nTools\n\n[T1112](https://attack.mitre.org/techniques/T1112/) Modify\nRegistry\n\n[T1027](https://attack.mitre.org/techniques/T1027/) Obfuscated\nFiles or\nInformation\n\n[T1055](https://attack.mitre.org/techniques/T1055/) Process\nInjection\n\n[T1108](https://attack.mitre.org/techniques/T1108/) Redundant\nAccess\n\n\n[T1014](https://attack.mitre.org/techniques/T1014/) Rootkit BalkanRAT uses a userland rootkit that hooks the NtQuerySys‐\ntemInformation function to hide the presence of malicious\nprocesses.\n\n\n[T1143](https://attack.mitre.org/techniques/T1143/) Hidden\nWindow\n\n[T1082](https://attack.mitre.org/techniques/T1082/) System In‐\nformation\nDiscovery\n\n[T1056](https://attack.mitre.org/techniques/T1056/) Input\nCapture\n\n[T1219](https://attack.mitre.org/techniques/T1219/) Remote Ac‐\ncess Tools\n\n\nBalkanRAT uses 3 rd party remote desktop software and hides\nits window and tray icon in order to hide it from the user.\n\nBalkanRAT collects the computer name and the language set‐\ntings from the compromised machine.\n\nBalkanRAT is capable of logging pressed keystrokes.\n\nBalkanRAT has misused legitimate remote desktop software for\nremote access.\n\n\n-----\n\nInitial\nAc‐\ncess\n\nExe‐\ncution\n\nPer‐\nsis‐\ntence\n\nPrivi‐\nlege\nEsca‐\nlation\n\nDe‐\nfense\nEva‐\nsion\n\nDis‐\ncovery\n\n\n[T1192](https://attack.mitre.org/techniques/T1192/) Spearphis\nhing Link\n\n[T1059](https://attack.mitre.org/techniques/T1059/) Com‐\nmand-Line\nInterface\n\n[T1106](https://attack.mitre.org/techniques/T1106/) Execution\nthrough\nAPI\n\n[T1203](https://attack.mitre.org/techniques/T1203/) Exploita‐\ntion for\nClient\nExecution\n\n\n[T1035](https://attack.mitre.org/techniques/T1035/) Service\nExecution\n\n[T1204](https://attack.mitre.org/techniques/T1204/) User\nExecution\n\n[T1050](https://attack.mitre.org/techniques/T1050/) New\nService\n\n[T1060](https://attack.mitre.org/techniques/T1060/) Registry\nRun Keys\n/ Startup\nFolder\n\n[T1134](https://attack.mitre.org/techniques/T1134/) Access\nToken\nManipula‐\ntion\n\n[T1116](https://attack.mitre.org/techniques/T1116/) Code\nSigning\n\n[T1107](https://attack.mitre.org/techniques/T1107/) File\nDeletion\n\n[T1158](https://attack.mitre.org/techniques/T1158/) Hidden\nFiles and\nDirectories\n\n[T1036](https://attack.mitre.org/techniques/T1036/) Mas‐\nquerading\n\n[T1108](https://attack.mitre.org/techniques/T1108/) Redun‐\ndant\nAccess\n\n[T1082](https://attack.mitre.org/techniques/T1082/) System\nInforma‐\ntion\nDiscovery\n\n\nBalkanDoor is distributed via emails that contain links to download\nmalware.\n\nBalkanRAT uses cmd.exe to create a remote shell.\n\nBalkanRAT uses ShellExecuteExW and LoadLibrary APIs to exe‐\ncute files.\n\nBalkanDoor can be distributed as an ACE archive disguised as a\nRAR archive, exploiting CVE-2018-20250 vulnerability in WinRAR\nto execute malicious code.\n\n\n[T1064](https://attack.mitre.org/techniques/T1064/) Scripting BalkanDoor uses batch scripts for malware installation and\nexecution.\n\n\nBalkanDoor’s backdoor can be executed as a service.\n\nBalkanDoor relies on the victim to execute the initial infiltration. The\nmalware is disguised as PDF documents or RAR archives with mis‐\nleading names, in order to entice the intended victim to click on it.\n\nBalkanDoor can be installed as a new service, mimicking legitimate\nWindows services.\n\nBalkanDoor can be installed in the Registry Run key, or dropped in\nthe Startup folder.\n\nBalkanDoor is able to create a process under the security context of\na different user, using DuplicateTokenEx, SetTokenInformation or\nCreateProcessAsUserW APIs.\n\nBalkanDoor is digitally signed with code-signing certificates.\n\nBalkanDoor deletes files with backdoor commands after the com‐\nmands have been executed.\n\nBalkanDoor sets attributes of its files to HIDDEN, SYSTEM and\nREADONLY.\n\nBalkanDoor can be installed as a service with names mimicking le‐\ngitimate Windows services.\n\nOperators of BalkanDoor have been seen deploying a second mali‐\ncious tool (BalkanRAT) to preserve remote access in case Balkan‐\nDoor is removed.\n\nBalkanDoor collects the computer name from the compromised\nmachine.\n\n\n-----\n\nCom‐\nmand\nand\nCon‐\ntrol\n\n\n[T1043](https://attack.mitre.org/techniques/T1043/) Commonly\nUsed Port\n\n[T1090](https://attack.mitre.org/techniques/T1090/) Connec‐\ntion Proxy\n\n[T1008](https://attack.mitre.org/techniques/T1008/) Fallback\nChannels\n\n[T1071](https://attack.mitre.org/techniques/T1071/) Standard\nApplica‐\ntion Layer\nProtocol\n\n\nBalkanDoor uses ports 80 and 443 for C&C communication.\n\nBalkanDoor is capable of identifying a configured proxy server if\none exists and then using it to make HTTP requests.\n\nBalkanDoor can communicate over multiple C&C hosts.\n\nBalkanDoor uses HTTP or HTTPS for network communication.\n\n\n[Zuzana Hromcová 14 Aug 2019 - 11:30AM](https://www.welivesecurity.com/author/zhromcova/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.08.14.Balkans_Campaign/In%20the%20Balkans%2C%20businesses%20are%20under%20fire%20from%20a%20double%E2%80%91barreled%20weapon.pdf"
    ],
    "report_names": [
        "In the Balkans, businesses are under fire from a double‑barreled weapon"
    ],
    "threat_actors": [
        {
            "id": "3b046db2-f60e-49ae-8e16-0cf82a4be6fb",
            "created_at": "2022-10-25T16:07:23.427162Z",
            "updated_at": "2025-03-27T02:02:09.79482Z",
            "deleted_at": null,
            "main_name": "Buhtrap",
            "aliases": [
                "Buhtrap",
                "Operation TwoBee",
                "Ratopak Spider",
                "UAC-0008"
            ],
            "source_name": "ETDA:Buhtrap",
            "tools": [
                "AmmyyRAT",
                "Buhtrap",
                "CottonCastle",
                "FlawedAmmyy",
                "NSIS",
                "Niteris EK",
                "Nullsoft Scriptable Install System",
                "Ratopak"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "01d569b1-f089-4a8f-8396-85078b93da26",
            "created_at": "2023-01-06T13:46:38.411615Z",
            "updated_at": "2025-03-27T02:00:02.826863Z",
            "deleted_at": null,
            "main_name": "BuhTrap",
            "aliases": [],
            "source_name": "MISPGALAXY:BuhTrap",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716505,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1565841501,
    "ts_modification_date": 1565841501,
    "files": {
        "pdf": "https://archive.orkl.eu/36044243987dace8e439a54a8d4fce6f3508126a.pdf",
        "text": "https://archive.orkl.eu/36044243987dace8e439a54a8d4fce6f3508126a.txt",
        "img": "https://archive.orkl.eu/36044243987dace8e439a54a8d4fce6f3508126a.jpg"
    }
}