{
    "id": "0c639c83-961e-4bd4-8189-e7d86418cf69",
    "created_at": "2023-04-05T02:09:33.924282Z",
    "updated_at": "2025-03-27T02:05:36.635624Z",
    "deleted_at": null,
    "sha1_hash": "3ca37a5cd8f1288ad4aa532d6e49260da01316fd",
    "title": "2023-03-15 - Unmasking MedusaLocker Ransomware",
    "authors": "",
    "file_creation_date": "2023-04-03T08:31:37Z",
    "file_modification_date": "2023-04-03T08:31:37Z",
    "file_size": 1236584,
    "plain_text": "# Unmasking MedusaLocker Ransomware\n\n**[blog.cyble.com/2023/03/15/unmasking-medusalocker-ransomware/](https://blog.cyble.com/2023/03/15/unmasking-medusalocker-ransomware/)**\n\n## Alarming increase in MedusaLocker Ransomware Victims\n\n\nMarch 15, 2023\n\n\nMedusaLocker ransomware has been active since September 2019. MedusaLocker actors typically gain\naccess to victims’ networks by exploiting vulnerabilities in Remote Desktop Protocol (RDP).\n\nOnce Threat Actors (TAs) gain access to the network, they encrypt the victim’s data and leave a ransom\nnote with instructions on how victims can communicate with the TAs in every folder while encrypting files.\nThe ransom note tells victims to make a ransom payment to TA’s crypto wallet address.\n\nMedusaLocker appears to work on Ransomware-as-a-Service (RaaS) model, which allows cybercriminals\nto rent the ransomware and its services from the developer. In the RaaS model, ransomware operators\ndevelop the ransomware and a Command and Control panel which is then used by the affiliates to launch\nransomware attacks on the targets selected by their affiliates. After a successful operation, the\nransomware operators and affiliates divide the ransom extorted from victims.\n\nFigure 1 illustrates the countries that have been targeted by the ransomware group since January 2023,\nwith a total of 24 victims worldwide.\n\n\n-----\n\nFigure 1 – Map Showing Targets of MedusaLocker\nMedusaLocker ransomware gang is known to target Hospital and Healthcare industries, but additionally,\nthe gang also targets industries such as Education and Government organizations.\n\nThe figure below shows the industries targeted by the MedusaLocker Ransomware.\n\nFigure 2 – Industries Targeted by MedusaLocker\nThe United States of America is the biggest target for all ransomware groups; MedusaLocker also follows\nthis trend, where the largest numbers of the victims are from the United States of America.\n\nHowever, victims of MedusaLocker ransomware are scattered across all continents, excluding Antarctica.\nThe figure below shows the countries of the affected targets.\n\n\n-----\n\nFigure 3 – Countries Targeted by MedusaLocker\n\n## Technical Details\n\nAccording to [CISA, the MedusaLocker ransomware group gains initial access to the victim’s device](https://www.cisa.gov/news-events/cybersecurity-advisories/aa22-181a)\nthrough vulnerable Remote Desktop Protocol (RDP) configurations. The TAs also use phishing and spear\nphishing emails in their campaigns to target possible victims.\n\nThe malware sample we have identified is a 32-bit Graphical User Interface (GUI) based executable\ncompiled with Microsoft Visual C/C++, with a SHA 256 hash of\n“1658a064cb5a5681eee7ea82f92a2b7a14f70268dda3fc7aad8a610434711a8f” (shown in the figure\nbelow).\n\nWe will be performing an analysis of this ransomware executable to gain insights into its operations.\n\n\n-----\n\nFigure 4 – MedusaLocker File Details\n\n### Mutex Creation:\n\nUpon execution, the MedusaLocker creates a mutex, or mutual exclusion object, as a locking mechanism\nto prevent two threads from writing to shared memory simultaneously and to avoid reinfection of the victim.\n\nThe name of the mutex is “8761ABBD-7F85-42EE-B272-A76179687C63”. It is hardcoded into the binary,\nas shown in the figure below.\n\nFigure 5 – MedusaLocker Creating Mutex\n\n### Checking for Administrative Privileges:\n\nAfter acquiring the mutex, the ransomware checks for the privilege of its running process. MedusaLocker\nrequires administrative privileges in order to carry out its malicious operations without any restrictions. To\ndetermine the current privileges, the ransomware checks its own memory for a process token.\n\nTo do this, it obtains the current process and then extracts the token information from the process memory\nusing the GetTokenInformation() function. The code for checking the process’s privileges is shown in the\nfigure below.\n\n\n-----\n\nFigure 6\n\n– MedusaLocker Checking for Admin Privileges\n\n### Privilege Escalation:\n\nThe ransomware checks whether the process is currently running with administrative privileges. If the\nprocess is not running with admin privileges, the ransomware employs a User Account Control (UAC)\nbypass technique to restart itself with elevated privileges.\n\nThis technique uses the Microsoft Connection Manager Profile Installer (CMSTP.exe), a command-line\nprogram to install Connection Manager service profiles. CMSTP is used to execute malicious code by\nrouting it through a proxy server.\n\nAn illustration of this technique is shown in the figure below.\n\nFigure 7 – MedusaLocker Performing Privilege Escalation\n\n### Disabling UAC Prompt:\n\n\n-----\n\nThe ransomware then attempts to disable the UAC prompt so that the system will not prompt for\nauthentication. To do this, it modifies the “EnableLUA” registry value located at\n_SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System to “0”. This stops UAC prompts if the_\nprocess requires higher privileges to execute.\n\nIf the registry modification fails, the ransomware changes the “ConsentPromptBehaviorAdmin” registry\nvalue to “0”, allowing it to perform operations that require elevation without consent or credentials.\n\nThe code to disable the UAC prompt is shown in the figure below.\n\nFigure 8 –\n\nMedusaLocker Disabling UAC Prompt\n\n### Marking the Infected System:\n\nAfter disabling the UAC prompt, MedusaLocker marks the infected system with the registry key.\nMedusaLocker creates a value “Self” in the registry key HKEY_CURRENT_USER\\SOFTWARE\\MDSLK\\\nand sets the data as “svchost.exe” to the registry value, indicating that the system has already been\ninfected by the MedusaLocker ransomware.\n\nThe figure below shows the registry entry.\n\n\n-----\n\nFigure 9 –\n\nMedusaLocker creating registry marker\n\n### Cryptor Initialization:\n\nThe ransomware now initializes Cryptor, which performs AES-256 encryption on the victim’s files at a later\nstage. MedusaLocker ransomware contains an embedded public key which is encoded with Base64 and\nused to initialize the Cryptor.\n\nThe figure below shows the Base64 string.\n\nFigure 10 – MedusaLocker Initializing Encryption\n\n\n-----\n\n### Persistence:\n\nNow, the ransomware achieves persistence on the victim’s system by dropping itself into the “AppData”\nfolder as “svhost.exe”. The figure below shows the ransomware code to drop itself in the AppData Folder.\n\nFigure 11 – MedusaLocker dropping itself in AppData Folder\n\nAdditionally, the MedusaLocker Ransomware creates a Schedule Task entry in the system and launches\nitself every 15 minutes for an indefinite period.\n\nThe figure below shows the Schedule Task entry of the MedusaLocker Ransomware.\n\nFigure 12 – MedusaLocker Creating Scheduled Task Entry\n\n### System Volume Enumeration:\n\n\n-----\n\nAfter persistence, the ransomware enumerates all the logical drives in the system for further operations.\nThe figure below shows the malware’s routine for Enumerating Volumes in the system using the\n_FindNextVolumeW() API._\n\nFigure 13 –\n\nMedusaLocker Enumerating the Volume Drives\n\n### Stopping Services:\n\nTo avoid detection and ensure efficient encryption on the victim’s machine, the MedusaLocker\nRansomware also terminates various running services, including antivirus, database, and other utility\nservices. This is done through a hardcoded list of services checked by the ransomware using the\n_QueryServiceStatusEx() function. If any of the hardcoded services are found running, they are stopped_\nusing CloseServiceHandle().\n\nThe figure below shows the routine for stopping services.\n\nFigure 14 – MedusaLocker\n\nStopping Services\nThe following table shows the targeted services\n\nDefwatch ccEvtMgr ccSetMgr SavRoam\n\nsqlagent Sqladhlp Culserver RTVscan\n\nSQLADHLP QBIDPService Intuit.QuickBooks.FCS QBCFMonitorService\n\nsqlservr sqlbrowser Sqlwriter msmdsrv\n\ntomcat6 zhudongfangyu SQLADHLP vmware-usbarbitator64\n\nvmware-converter dbsrv12 dbeng8\n\n\n-----\n\n### Process Termination:\n\nAfter killing the predefined services, the ransomware enumerates the running processes using the\n_CreateToolhelp32Snapshot() function and then terminates the relevant process using the_\n_TerminateProcess() function._\n\nThis is done by checking a hardcoded list of processes identified as being related to antivirus, databases,\nand other utility programs. After the processes have been identified, the ransomware will terminate them to\nprevent any interference with the encryption process.\n\nThe figure below shows the routine used to terminate the relevant processes.\n\nFigure 15 – MedusaLocker\n\nTerminating Processes\nThe processes targeted by the MedusaLocker ransomware are as follows:\n\nwxServer.exe wxServerView sqlservr.exe sqlmangr.exe\n\nRAgui.exe supervise.exe Culture.exe RTVscan.exe\n\nDefwatch.exe sqlbrowser.exe winword.exe QBW32.exe\n\nQBDBMgr.exe qbupdate.exe QBCFMonitorService.exe axlbridge.exe\n\nQBIDPService.exe httpd.exe fdlauncher.exe MsDtSrvr.exe\n\ntomcat6.exe java.exe 360se.exe 360doctor.exe\n\nwdswfsafe.exe fdlauncher.exe fdhost.exe GDscan.exe\n\nZhuDongFangYu.exe\n\n### Disabling Data Recovery:\n\n\n-----\n\nThe Ransomware now utilizes inbuilt tools to delete the backups from the victim s system. It runs the\ncommand prompt and executes commands that remove the shadow copies and system backups, making\nit impossible to recover the data from the infected system. As a result, the victim is compelled to pay the\nransom in order to regain access to their data.\n\nThe figure below shows the commands executed by the MedusaLocker.\n\nFigure 16 –\n\nMedusaLocker Removing the Backup from the victim’s system\nAdditionally, the ransomware executes the SHEmptyRecycleBinW() API to clear the Recycle Bin,\neffectively obstructing the victim’s ability to restore any deleted files. The code for this is shown in the\nfigure below.\n\nFigure 17 – MedusaLocker Emptying the Recycle Bin\n\n### Excluding Folders from Encryption:\n\nAfter impairing data recovery, the ransomware creates a list of folders to exclude from encryption. This\nensures that the important executables and temporary files used for normal operations are not encrypted\nwhile data files are still encrypted.\n\nThe figure below shows the code for the excluded file paths.\n\n\n-----\n\nFigure 18 – MedusaLocker Excluding Important\n\nFolders\n\n### Data Encryption:\n\nThe ransomware now begins encrypting the files in the victim’s machine. The data is encrypted using the\nAES 256 encryption algorithm, with the encryption key further encrypted by the RSA public key embedded\nin the ransomware. Without the private key, it is impossible to decrypt the AES key.\n\nThe figure below shows the code to encrypt the files.\n\n\n-----\n\nFigure 19\n\n– MedusaLocker’s Encryption Routine\nWhen encrypting each file, the ransomware leaves a ransom note in the folder and adds the extension\n‘itlock4’. It also excludes multiple file extensions such as .exe, .dll, .sys, .ini, .rdp, etc. files from encryption.\n\nThe figure below shows the encrypted files and ransom note.\n\nFigure 20 – MedusaLocker Ransom note and Encrypted Files\nIn the end, MedusaLocker Ransomware presents the ransom note to its victims. The ransom note includes\na personal ID for the victim’s identification and a Tor contact page to facilitate negotiations and decrypt\nsample files.\n\nThe figure below shows the ransom note of MedusaLocker.\n\n\n-----\n\nFigure 21 – Ransom note Dropped by the MedusaLocker Ransomware\n\n### Network Activities:\n\nThe MedusaLocker checks the active network adaptor and uses Internet Control Message Protocol (ICMP)\nto scan for all connected systems.\n\nThe figure below depicts the ransomware using ICMP to scan for connected systems.\n\n\n-----\n\nFigure 22 – MedusaLocker Enumerating the Network using ICMP Protocol\nAfter enumeration, the ransomware scans for SMB shares connected to the system. It creates a list of\nSMB shares, excluding any hidden shares indicated by a name starting with “$”.\n\nThe code for this scanning process is shown in the figure below.\n\nFigure\n\n23 – MedusaLocker enumerating the SMB Shares\nEventually, the ransomware propagates to all shared resources and proceeds to infect other connected\nsystems within the network.\n\n## Conclusion\n\nMedusaLocker ransomware is a highly sophisticated form of malicious software that can potentially cause\nsevere data losses and financial losses for its victims. This advanced ransomware is difficult to detect and\nstop, and its encryption algorithms are extremely difficult to break.\n\n\n-----\n\nThere have been numerous attacks in a short period of time, targeting all kinds of industries and\ngeographic locations. More attacks from the MedusaLocker Ransomware are expected to occur in the\nfuture.\n\n## Our Recommendations\n\nThe following essential cybersecurity best practices create the first line of control against attackers. We\nrecommend that our readers follow the best practices as given below:\n\nFrequent Audits, Vulnerability Assessments, and Penetration Testing of\norganizational assets, including network and software.\nMonitor incoming emails from suspicious and potentially malicious domains.\nBack-up data on different locations and implement Business Continuity Planning (BCP). Keeping the\nBackup Servers isolated from the infrastructure helps fast data recovery.\nEnforcement of VPN to safeguard endpoints.\nConduct frequent training on security awareness for the company’s employees to inform them about\nemerging threats.\nImplementation of technology to understand the behavior of the ransomware-malware families and\nvariants to block malicious payloads and counter potential attacks.\n\n## MITRE ATT&CK® Techniques\n\n\n**Tactic** **Technique**\n**ID**\n\nInitial Access [T1133](https://attack.mitre.org/techniques/T1133/)\n\n[T1566](https://attack.mitre.org/techniques/T1566/001/)\n\n\n**Technique Name**\n\nExternal Remote Services\n\nPhishing\n\n\nPersistence [T1053.005](https://attack.mitre.org/techniques/T1053/005/) Scheduled Task/Job: Scheduled Task\n\n\nPrivilege\nEscalation\n\n\n[T1548.002](https://attack.mitre.org/techniques/T1548/002/) Abuse Elevation Control Mechanism: Bypass User Account\nControl\n\n\nDefense Evasion [T1562.001](https://attack.mitre.org/techniques/T1562/001/) Impair Defenses: Disable or Modify Tools\n\nDiscovery [T1135](https://attack.mitre.org/techniques/T1135/) Network Share Discovery\n\nImpact [T1486](https://attack.mitre.org/techniques/T1486/) Data Encrypted for Impact\n\n## Indicators of Compromise (IOCs)\n\n**Indicators** **Indicator**\n**Type**\n\n\n**Description**\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\n\n3618b68d7db4614ec8d33b5052cc0e85\n\n15177fbb65d707b308bac50f612b795494314001\n\n1658a064cb5a5681eee7ea82f92a2b7a14f70268dda3fc7aad8a610434711a8f\n\n28ec152fadc5119c31f1fc984735b324\n\n48e24f5c2c7572ed29a0e58b02e596f0638bc1f6\n\n3e22df5e41df76a46ab360be05fe0ee5c336c84fd55db7763fe4e214dca194b4\n\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\n\n-----\n\nd9fa435d704caebc54408e03227f0044\n\n0f36dff0f1beaf57d68b12fa0234853638c1c6f0\n\n8724e513ca2b4ce055bb846220e57c2ab622f296bf7a768393a701319d3eac70\n\n2979ed84c4ca3deb2924bd1f26bf88bd\n\n8f01f9112904389e0b53a25506ef69f99cc0fa1b\n\nbcf49e8f493c9eff83d9bc891e91dc91777f02b4f176e44b20f9a2d651f20fc3\n\n2316091f02153ac20dff768513aae1a4\n\n6b7b1017b9313ab87fccf4ea08a427c1499b89dc\n\n940bddbc6ef19b211f2022d61bf4d006969da11f9fe0beba98586e554dfcc741\n\n3618b68d7db4614ec8d33b5052cc0e85\n\n15177fbb65d707b308bac50f612b795494314001\n\n1658a064cb5a5681eee7ea82f92a2b7a14f70268dda3fc7aad8a610434711a8f\n\ne03fa1e0dd3dc0fb6960e76219ddf86c\n\nc92fd297256aa8d70607e33188b91442208aaeb3\n\n0a758a922bdaacc08a84a62881eeb0f17075058ecf7329cbc10a9bfe1fba0814\n\n168447d837fc71deeee9f6c15e22d4f4\n\n80ad29680cb8cecf58d870ee675b155fc616097f\n\nadd2850732c42683ee92ba555bbffb88bf5a4eee7c51e24f15a898f2d5aff66b\n\n57ee7ef00e009c4048d78406b3dca5b7\n\n81467ca16e87dfacd9c965f105fb5b30548f1ded\ne0221e692fa3476cb2d862c1aee07f3e87d83411ef9a534fdf8d20efbaee0394\n\naa82e62207615d2f227ce9a0e488b912\n\nd9390b6c1478970a9e7b8a3fe854a42efdc582f6\n79e009e12ba6d60665faf5bdd523d80f0fe6be28694914cf0fa64929b4052e67\n\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\nMD5\n\nSHA1\n\nSHA256\n\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\nMedusaLocker\nExecutable\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-15 - Unmasking MedusaLocker Ransomware.pdf"
    ],
    "report_names": [
        "2023-03-15 - Unmasking MedusaLocker Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660573,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1680510697,
    "ts_modification_date": 1680510697,
    "files": {
        "pdf": "https://archive.orkl.eu/3ca37a5cd8f1288ad4aa532d6e49260da01316fd.pdf",
        "text": "https://archive.orkl.eu/3ca37a5cd8f1288ad4aa532d6e49260da01316fd.txt",
        "img": "https://archive.orkl.eu/3ca37a5cd8f1288ad4aa532d6e49260da01316fd.jpg"
    }
}