{
    "id": "0c67dd62-6ab7-497b-8ba7-205d0776e2be",
    "created_at": "2023-01-12T15:10:09.377377Z",
    "updated_at": "2025-03-27T02:05:42.53352Z",
    "deleted_at": null,
    "sha1_hash": "0e066743f34be5573956268620057727ca7647fb",
    "title": "2021-09-09 - Case Analysis of Suncrypt Ransomware Negotiation and Bitcoin Transaction",
    "authors": "",
    "file_creation_date": "2022-05-28T21:43:38Z",
    "file_modification_date": "2022-05-28T21:43:38Z",
    "file_size": 3276800,
    "plain_text": "# Case Analysis of Suncrypt Ransomware Negotiation and Bitcoin Transaction\n\n**[medium.com/s2wlab/case-analysis-of-suncrypt-ransomware-negotiation-and-bitcoin-transaction-43a2194ac0bc](https://medium.com/s2wlab/case-analysis-of-suncrypt-ransomware-negotiation-and-bitcoin-transaction-43a2194ac0bc)**\n\nS2W September 9, 2021\n\n[S2W](https://medium.com/@s2w?source=post_page-----43a2194ac0bc--------------------------------)\n\nSep 9, 2021\n\n\n5 min read\n\n## Hotsauce | S2W TALON\n\n Executive Summary\n\nIn May 2021. The United state’s company was infected by the Suncrypt ransomware,\nand after a long negotiation of about 3 weeks, the victim paid the ransom with Bitcoin,\nand Suncrypt finally deleted the leaked data and informed security report, and the\nnegotiations were finished.\nAs a result of tracking the Bitcoin paid by the victim, it was sent to the Binance, OKEX,\nHuobi exchange and confirmed the circumstances of ChipMixer Mixing.\n\n## Detailed analysis\n\n 1. About Suncrypt ransomware\n\nSuncrypt is a Ransomware as a Service (RaaS) that uses a closed affiliate program on\nthe dark web and first appeared in October 2019.\nSuncrypt says “The Suncrypt group is a huge fan of a Win-Win style of negotiations\nand the minimal damage policy” and they provide a security report when the\nnegotiation is complete, emphasizing that they are a reliable “business” rather than a\nransomware “hack”.\n\n## 2. Analysis of Suncrypt Ransomware Negotiation\n\nSuncrypt ransomware left a HTML type ransom note on the infected PC with\ninformation on key points and how to access the 1:1 negotiation page.\n\n\n-----\n\nYou can start negotiating with Suncrypt by accessing the 1:1 negotiation page guided\nby the ransom note.\n\n## Victim company\n\n\n-----\n\n1.\n2.\n3.\n\n\nIn May 2021, an American company D was infected with the Suncrypt ransomware.\nOn the 1:1 negotiation page, Suncrypt said that after 72 hours the exfiltrated data will\nbe posted at our news website and DDoS attack will be stopped only after progress is\nmade in the negotiation.\nSuncrypt requested 1,200,000 USD as a payment amount, presenting sample files and\nlistings as proof and guaranteeing to provide the following three items upon completion\nof the negotiation.\n\nSuncrypt seems to have separate roles of negotiator and technician, as a person who\nappears to be a technician/developer who calls himself Tech (purple chat) participates\nin the negotiation.\n\nDuring the negotiations, the victim company gave a link to a posted on Marketo /\nTwitter and protested why they were already selling our data.\nSuncrypt said and denied it had nothing to do with us.\n\nMarketo is a marketplace of stolen data, first appeared in April 202.\nLeaked data is selling publicly by bidding auctions.\n\n\n-----\n\nSelling leak data of victim companies uploaded to Marketo.\n\n\n-----\n\nSince the victim company does not have files encrypted with extensions other than\nSuncrypt, it seems that Marketo only stole data without separate encryption, and it is\npossible that leaked by Suncrypt and Marketo both.\nSuncrypt’s Tech said that they start DDoS attack to Marketo.\n\nAfter several price negotiations, the victim company paid 182,000 USD, demanding\neven to delete the post on Marketo.\n\nSuncrypt closes the negotiation by providing erasure log and security report after\nconfirming Bitcoin deposit.\n\n**[Security Report — same contents are provided in case of other victim company that were](https://medium.com/s2wlab/w4-july-en-story-of-the-week-ransomware-on-the-darkweb-c61965d0386a)**\ninfected at around the same time\n\n— erasure logs to prove that Suncrypt has deleted all files stolen from the victim\ncompany.\n\n\n-----\n\nSuncrypt said that we are trying to bring down the fake post or getting a proof that data\nis fake, but leak data posted on Marketo have not yet been deleted and are still on\nselling.\n\n## 3. Analysis of payment address\n\nTracking the bitcoins paid by the victim company\nPayment address : bc1qx6wa9x9gdnah9jfdt0ps8c6z8vwt2mz9mpwdcr\nAmounts : 5.03350949 BTC\nTransaction date : 2021–06–02\nThe 5.03350949 BTC paid by the victim company was divided into several branches\nand each performed ChipMixer Mixing, transferred to Binance, OKEX, Huobi wallet\n\n\n-----\n\n## 3.1 Money Laundering with ChipMixer Mixing\n\nAfter several addresses, approximately 4 BTC was laundered through ChipMixer\nMixing\n\n**Bitcoin Address**\n\n1ME2WHjsa1TPjuWTUN2JRsAxJsCs62gSk7\n112oLSTUE4PvVD4K88ANpwnRsw8e19ea7q\n17pYQVxhPSGkiLwoJhaAM3DxG86VHtiBLn\n\n## 3.2 Transactions to Exchange wallet\n\nAfter several addresses, approximately 1 BTC was withdrawn to Binance, OKEX,\nHuobi exchange\n\n**Bitcoin Address**\n\n1Bb9AX3yM8WsFhZHFsVjWW79o6KFMiA3gE\n3CBDnbKDhgaEHDzoBiJrGza2FC6vv3GLej\n37Z8s6MQsWsRQTX7gPcFaAdo2qFsQm7RGr\n\n## Conclusion\n\n, the Suncrypt ransomware mainly uses ChipMixer for bitcoin laundering\nJudging from the negotiation chat content, suncrypt seems to be divided into\nRansomware operator, Negotiation manager, Tech manager, etc.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-09 - Case Analysis of Suncrypt Ransomware Negotiation and Bitcoin Transaction.pdf"
    ],
    "report_names": [
        "2021-09-09 - Case Analysis of Suncrypt Ransomware Negotiation and Bitcoin Transaction.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536209,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653774218,
    "ts_modification_date": 1653774218,
    "files": {
        "pdf": "https://archive.orkl.eu/0e066743f34be5573956268620057727ca7647fb.pdf",
        "text": "https://archive.orkl.eu/0e066743f34be5573956268620057727ca7647fb.txt",
        "img": "https://archive.orkl.eu/0e066743f34be5573956268620057727ca7647fb.jpg"
    }
}