{
    "id": "0c7e1b3a-7a88-4e7c-af5b-b8e17ed8fcc8",
    "created_at": "2023-01-12T15:01:45.218049Z",
    "updated_at": "2025-03-27T02:16:26.435343Z",
    "deleted_at": null,
    "sha1_hash": "217c6f6e4b8f927d8f97a5ad9b11f09fe6f4b789",
    "title": "2017-04-18 - Hajime worm battles Mirai for control of the Internet of Things",
    "authors": "",
    "file_creation_date": "2022-05-28T01:59:37Z",
    "file_modification_date": "2022-05-28T01:59:37Z",
    "file_size": 247116,
    "plain_text": "# Endpoint Protection\n\n**[symantec.com/connect/blogs/hajime-worm-battles-mirai-control-internet-things](https://www.symantec.com/connect/blogs/hajime-worm-battles-mirai-control-internet-things)**\n\n[Migration User](https://community.broadcom.com/symantecenterprise/network/members/profile?UserKey=909a8e41-f1e7-45af-914a-628128e3819f)\n\n\nApr 18, 2017 01:20 PM\n\n\nA battle is raging for control of Internet of Things (IoT) devices. There are many contenders,\nbut two families stand out: the remains of the Mirai botnet, and a new similar family called\nHajime.\n\n[Hajime was first discovered by researchers in October of last year and, just like Mirai](https://security.rapiditynetworks.com/publications/2016-10-16/hajime.pdf)\n[(Linux.Gafgyt), it spreads via unsecured devices that have open Telnet ports and use](https://www.symantec.com/security_response/writeup.jsp?docid=2014-100222-5658-99)\ndefault passwords. In fact, Hajime uses the exact same username and password\ncombinations that Mirai is programmed to use, plus two more.\n\nBut that’s where the similarities end.\n\nUnlike Mirai, which uses hardcoded addresses for its command and control (C&C) server,\nHajime is built on a peer-to-peer network. There isn’t a single C&C server address, instead\nthe controller pushes command modules to the peer network and the message propagates\nto all the peers over time. This is typically considered a more robust design as it makes\ntakedowns more difficult.\n\nHajime is also stealthier and more advanced in comparison to Mirai. Once on an infected\ndevice, it takes multiple steps to conceal its running processes and hide its files on the file\nsystem. The author can open a shell script to any infected machine in the network at any\ntime, and the code is modular, so new capabilities can be added on the fly. It is apparent\nfrom the code that a fair amount of development time went into designing this worm.\n\nOver the past few months, Hajime has been spreading quickly. Symantec has tracked\ninfections worldwide, with large concentrations in Brazil and Iran. It is hard to estimate the\nsize of the peer-to-peer network, but modest estimates put it in the tens of thousands.\n\n\n-----\n\n_Figure 1. Top 10 Hajime-infected countries_\n\n**Reasons behind the worm**\n\nThere are some features that are noticeably missing from Hajime. It currently doesn’t have\nany distributed denial of service (DDoS) capabilities or any attacking code except for the\npropagation module. Instead, it fetches a statement from its controller and displays it on the\nterminal approximately every 10 minutes. The current message is:\n\n_Just a white hat, securing some systems._\n\n_Important messages will be signed like this!_\n\n_Hajime Author._\n\n_Contact CLOSED_\n\n_Stay sharp!_\n\nThe above message is cryptographically signed and the worm will only accept messages\nsigned by a hardcoded key, so there is little question that this message is from the worm’s\ntrue author. However, there is a question around trusting that the author is a true white hat\n\n\n-----\n\nand is only trying to secure these systems, as they are still installing their own backdoor on\nthe system. The modular design of Hajime also means if the author’s intentions change\nthey could potentially turn the infected devices into a massive botnet.\n\nTo the author’s credit, once the worm is installed it does improve the security of the device.\nIt blocks access to ports 23, 7547, 5555, and 5358, which are all ports hosting services\nknown to be exploitable on many IoT devices. Mirai is known to target some of these ports.\n\n_Figure 2. The volume of observed Hajime infections, by location_\n\n**White worms**\nThis isn’t the first case of a [vigilante attempting to secure vulnerable IoT devices. In](https://community.broadcom.com/symantecenterprise/viewdocument?DocumentKey=ef23b297-5cc6-4c4a-b2e7-ff41635965fe&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=librarydocuments)\n[2014/2015, the Linux.Wifatch malware was observed. This was written by “The White](https://www.symantec.com/security_response/writeup.jsp?docid=2015-011216-2314-99)\nTeam”, which attempted to secure IoT devices in much the same way as Hajime is now.\n[Brickerbots also try to take IoT devices offline by deleting critical system files or corrupting](https://arstechnica.com/security/2017/04/rash-of-in-the-wild-attacks-permanently-destroys-poorly-secured-iot-devices/)\nthe system in similar ways.\n\nThe problem with these white worms is that they usually turn out to have a short lifespan.\nThat is because their effects are only temporary. On the typical IoT system affected by\nthese worms the changes made to improve the security are only in RAM and not persistent.\n\nOnce the device is rebooted it goes back to its unsecured state, complete with default\npasswords and a Telnet open to the world. To have a lasting effect, the firmware would\nneed to be updated. It is extremely difficult to update the firmware on a large scale because\nthe process is unique to each device and in some cases is not possible without physical\naccess. And so, we are left with embedded devices stuck in a sort of Groundhog Day time\nloop scenario. One day a device may belong to the Mirai botnet, after the next reboot it\ncould belong to Hajime, then the next any of the many other IoT malware/worms that are\nout there scanning for devices with hardcoded passwords. This cycle will continue with\neach reboot until the device is updated with a newer, more secure firmware.\n\n\n-----\n\n**Security researchers doubling as QA**\nThere is another aspect of the worm that stands out. In the broadcast message, the author\nrefers to themselves as the “Hajime Author” but the name Hajime appears nowhere in the\nbinaries. In fact, the name “Hajime” didn’t come from the author but rather from the\nresearchers who discovered the worm and spotted similarities between it and the Mirai\nbotnet and wanted to maintain the Japanese naming theme (Mirai means “future” in\nJapanese, Hajime means “beginning”). This shows that the author was aware of the\nresearchers’ report and seemed to have liked the name.\n\nThe report also identified bugs in the worm and provided signatures for detecting them. It\nappears that the worm’s author took note. Now, each of the noted bugs has been fixed and\nnone of the signatures still work. It appears that the report, in a way, served as free quality\nassurance for the worm’s author; showing them what bugs they still needed to fix.\n\nIn this case, helping the author fix the bugs may not have caused that much damage, but\nthe thought of security researchers inadvertently assisting malware authors is worrying.\nThere is a fine balance between deciding how much information to put into a malware\nreport to help IT teams identify compromises, while at the same time not exposing so much\ninformation as to serve as training and critical review for the attackers. Highlighting\nmistakes in malware is rarely worth it as it provides very little actionable intelligence for\ndefenders. Just like in poker, security researchers must remember to never show someone\ntheir hand if they don’t have to.\n\n**Guarding against attack**\nUsers of IoT devices should take the following steps to help prevent their devices from\nbecoming infected with malware.\n\nResearch the capabilities and security features of an IoT device before purchase\nPerform an audit of IoT devices used on your network\nChange the default credentials on devices. Use strong and unique passwords for\ndevice accounts and Wi-Fi networks\nUse a strong encryption method when setting up Wi-Fi network access (WPA)\nDisable features and services that are not required\nDisable Telnet login and use SSH where possible\nDisable Universal Plug and Play (UPnP) on routers unless absolutely necessary\nModify the default privacy and security settings of IoT devices according to your\nrequirements and security policy\nDisable or protect remote access to IoT devices when not needed\nUse wired connections instead of wireless where possible\nRegularly check the manufacturer’s website for firmware updates\nEnsure that a hardware outage does not result in an unsecure state of the device\n\n**Protection**\nSymantec and Norton products detect the threats mentioned in this blog as:\n\n\n-----\n\n**Further reading**\nTo learn more about the security of IoT devices, read our whitepaper: Insecurity in the\nInternet of Things\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-18 - Hajime worm battles Mirai for control of the Internet of Things.pdf"
    ],
    "report_names": [
        "2017-04-18 - Hajime worm battles Mirai for control of the Internet of Things.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535705,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653703177,
    "ts_modification_date": 1653703177,
    "files": {
        "pdf": "https://archive.orkl.eu/217c6f6e4b8f927d8f97a5ad9b11f09fe6f4b789.pdf",
        "text": "https://archive.orkl.eu/217c6f6e4b8f927d8f97a5ad9b11f09fe6f4b789.txt",
        "img": "https://archive.orkl.eu/217c6f6e4b8f927d8f97a5ad9b11f09fe6f4b789.jpg"
    }
}