{
    "id": "0d40e484-6d97-4b3c-b96a-2dcdbe9ccd4d",
    "created_at": "2023-01-12T15:05:38.553259Z",
    "updated_at": "2025-03-27T02:05:38.462698Z",
    "deleted_at": null,
    "sha1_hash": "688dcf9e909689d23bd0c211d61d26bd45dc0ba9",
    "title": "2022-03-04 - Imperva Mitigates Ransom DDoS Attack Measuring 2.5 Million Requests per Second",
    "authors": "",
    "file_creation_date": "2022-05-28T03:58:40Z",
    "file_modification_date": "2022-05-28T03:58:40Z",
    "file_size": 1645151,
    "plain_text": "# Imperva Mitigates Ransom DDoS Attack Measuring 2.5 Million Requests per Second\n\n**[imperva.com/blog/imperva-mitigates-ransom-ddos-attack-measuring-2-5-million-requests-per-second/](https://www.imperva.com/blog/imperva-mitigates-ransom-ddos-attack-measuring-2-5-million-requests-per-second/)**\n\nMarch 4, 2022\n\n[Home >](https://www.imperva.com/) [Blog > Imperva Mitigates Ransom DDoS Attack Measuring 2.5 Million Requests per](https://www.imperva.com/blog/)\nSecond\n\n[Application Security](https://www.imperva.com/blog/?category=application-security)\n\nWe are only at the beginning of 2022 and it looks like it is going to be an interesting year for\nthe [Distributed Denial of Service (DDoS) landscape. We recently mitigated a ransom DDoS](https://www.imperva.com/products/ddos-protection-services/)\nattack on a single website which reached a rate of 2.5 million requests per second (Mrps).\nAnd while ransom DDoS attacks are not new, they appear to be evolving and becoming\nmore interesting with time and with each new phase. For example, we’ve seen instances\nwhere the ransom note is included in the attack itself embedded into a URL request.\n\n\n-----\n\n_One of several ransom notes received by the customer before the attack started_\n\n## A ransom note as part of the attack? Really?\n\nYes. Increasingly, we are observing more cases like this where the ransom note has been\nincluded as part of the attack itself, perhaps as a reminder to the target to send their bitcoin\npayment. Of course once the target receives this note the attack is already underway\nadding a sense of urgency to the threat. In the case of the 2.5 Mrps DDoS attack, the target\nhad received several warning ransom notes before the first attack began.\n\nThis tactic is not a one-off either. In the same DDoS attack, Imperva mitigated over 12\n**million such embedded requests targeting random URLs on the same site.**\n\nThe following sinister message was incorporated into one of the URLs targeted.\n\nAnd the threats didn’t stop there. The following day on the same site, Imperva mitigated\n**over 15 million requests this time with the URL containing a different message but using**\nthe same scare tactics warning the CEO that they are going to destroy the company’s stock\nprice if they don’t pay up.\n\n\n-----\n\nTo show they mean business the attackers claim responsibility for a previous attack on the\nservice provider Bandwidth, naming themselves the well-known Ransomware as a service\n(RaaS) operator REvil . It is not clear however whether the threats were really made by the\n_original REvil group or by an imposter._\n\n## 2.5 million requests per second in under a minute\n\nThroughout the course of the same day the targeted company was hit by several DDoS\nattacks; the largest of which lasted less than one minute and measured up to 2.5 Mrps,\nsetting a new mitigation record for Imperva. Multiple sites from the same company came\nunder attack with one site sustaining an attack lasting around 10 minutes. The attackers\napplied sophisticated tactics to avert mitigation with the ransom messages and attack\nvectors changing constantly. At the same time, to shock the target, the payment amounts\ndemanded kept increasing in size. Despite these tactics Imperva successfully mitigated all\nof the attacks and demonstrated how important it is to have a fast, accurate and automated\nDDoS solution in place.\n\nThe story did not end there for the customer as the attacks continued for several days;\nsometimes lasting up to several hours and in 20 percent of cases reaching a size of\nbetween 90 and 750 thousand requests per second (Krps) as the chart below shows.\n\n## Attack origins\n\nThe attacks originated from 34,815 sources and looking at the number of requests per\nsource, there were 2 million requests per IP sent from the top sources during the attack.\n\nThe top source locations for the 2.5 Mrps attack were Indonesia followed by the United\nStates. And we have seen a pattern emerging of almost identical source locations for\ndifferent attacks indicating that the same botnet was used many times.\n\n\n-----\n\n## The botnet\n\nWe have a strong indication that the Meris botnet played a role in these attacks. Although\n[CVE-2018-14847 was published a while ago, attackers can still take advantage of it. The](https://blog.mikrotik.com/security/winbox-vulnerability.html)\nCVE refers to a MikroTik vulnerability where thousands of internet of things (IoT) devices, in\nthis case a huge number of MikroTik routers, were manipulated to create a botnet network\nwhich can still be used to carry out DDoS and other forms of attack.\n\nIn terms of bandwidth, the results reached a volume of 1.5Gbps of TCP traffic. The\ndashboard below represents the traffic in our scrubbing centers, before it reached our\nproxies that mitigated the attacks in the application layer:\n\n\n-----\n\n## Threat intelligence and Bot protection\n\nDespite the changing attack patterns, Imperva successfully mitigated the attacks within\nseconds using mainly threat intelligence, as the sources were known to us as malicious;\nand bot protection, as the clients were impersonating a legitimate browser or google bot.\nWhile the largest attack measured 2.5 Mrps the graph below shows how we blocked over\n64 million requests in under one minute.\n\n\n-----\n\n## Repeat performance\n\nWe have since monitored a repeat of this attack pattern against several other customers.\nWhile each of the targets receives a unique bitcoin address they are all part of the same\ncoordinated attack.\n\nThe types of sites the threat actors are after appear to be business sites focusing on sales\nand communications. Targets tend to be US- or Europe-based with the one thing they all\nhave in common being that they are all exchange-listed companies and the threat actors\nuse this to their advantage by referring to the potential damage a DDoS attack could do to\nthe company stock price. See example below.\n\n## Ransom within a ransom\n\nAnother example of a threat embedded in the attack itself was found in a GET request sent\nwith a link to a notepad.com note.\n\nAnother note (below) contains the now familiar pattern of a ransom demand for payment in\nbitcoin.\n\n\n-----\n\n## What’s Next?\n\nAs the REvil threat gang mentioned, we can expect more of the same throughout 2022. If\nyou don’t already have DDoS Protection in place, now is a good time to prepare for a\n[potential attack. Find out more about Imperva DDoS Protection here.](https://www.imperva.com/products/ddos-protection-services/)\n\n### Try Imperva for Free\n\nProtect your business for 30 days on Imperva.\n\n[Start Now](https://www.imperva.com/free-trial/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-04 - Imperva Mitigates Ransom DDoS Attack Measuring 2.5 Million Requests per Second.pdf"
    ],
    "report_names": [
        "2022-03-04 - Imperva Mitigates Ransom DDoS Attack Measuring 2.5 Million Requests per Second.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535938,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653710320,
    "ts_modification_date": 1653710320,
    "files": {
        "pdf": "https://archive.orkl.eu/688dcf9e909689d23bd0c211d61d26bd45dc0ba9.pdf",
        "text": "https://archive.orkl.eu/688dcf9e909689d23bd0c211d61d26bd45dc0ba9.txt",
        "img": "https://archive.orkl.eu/688dcf9e909689d23bd0c211d61d26bd45dc0ba9.jpg"
    }
}