{
    "id": "0d698215-6b88-4604-bfbb-98eaebbe0fa2",
    "created_at": "2023-01-12T15:10:25.110627Z",
    "updated_at": "2025-03-27T02:05:36.386429Z",
    "deleted_at": null,
    "sha1_hash": "097c222f30ba7e75e853e6b4284dcd0593f5efd1",
    "title": "2020-11-18 - Back from vacation- Analyzing Emotet’s activity in 2020",
    "authors": "",
    "file_creation_date": "2022-05-27T21:32:01Z",
    "file_modification_date": "2022-05-27T21:32:01Z",
    "file_size": 2508138,
    "plain_text": "# Back from vacation: Analyzing Emotet’s activity in 2020\n\n**blog.talosintelligence.com/2020/11/emotet-2020.html**\n\n[Emotet is one of the most heavily distributed malware families today. Cisco Talos observes](https://blog.talosintelligence.com/2019/01/return-of-emotet.html)\nlarge quantities of Emotet emails being sent to individuals and organizations around the\n[world on an almost daily basis. These emails are typically sent automatically by previously](https://blog.talosintelligence.com/2020/01/stolen-emails-reflect-emotets-organic.html)\n\n\n-----\n\ninfected systems attempting to infect new systems with Emotet to continue growing the size\nof the botnets associated with this threat. Emotet is often the initial malware that is delivered\nas part of a multi-stage infection process and is not targeted in nature. Emotet has impacted\nsystems in virtually every country on the planet over the past several years and often leads\nto high impact security incidents as the network access it provides to adversaries enables\nfurther attacks, such as big-game hunting and double-extortion ransomware attacks.\n\nCisco Talos obtained ownership of several domains that Emotet uses to send SMTP\ncommunications. We leveraged these domains to sinkhole email communications originating\nfrom the Emotet botnets for the purposes of observing the characteristics of these email\ncampaigns over time and to gain additional insight into the scope and profile of Emotet\ninfections and the organizations being impacted by this threat. Emotet has been observed\n[taking extended breaks over the past few years, and 2020 was no exception. Let's take a](https://blog.talosintelligence.com/2019/09/emotet-is-back-after-summer-break.html)\n[look at what Emotet has been up to in 2020 and the effect it's had on the internet as a whole.](https://blog.talosintelligence.com/2020/02/coronavirus-themed-malware.html)\n\n## Emotet background\n\nEmotet began its life as a banking trojan, but over the years, it evolved into what can now be\nclassified as a highly modular threat that adversaries leverage for a variety of purposes. In\nrecent years, it has often been used as a \"beachhead\" in victim networks as it provides initial\naccess and long-term persistence that malicious adversaries can use to conduct further\nintrusion activities from within infected networks. In many cases, it is used as the initial\npayload in a multi-stage infection process and can be operational in victim networks for\nextended periods of time before adversaries choose to leverage the access it provides to\nfurther attack organization. This is an important consideration for network defenders as\nsystem backups may be compromised as a result of long-term infections that reside in\nsystems in the environment.\n\nThere are several other malware families that are also often delivered alongside Emotet such\nas [Trickbot,](https://blog.talosintelligence.com/2020/03/trickbot-primer.html) [Qakbot and others. Many network-based ransomware incidents, such as those](https://blog.talosintelligence.com/2019/05/qakbot-levels-up-with-new-obfuscation.html)\n[conducted by the operators of Ryuk ransomware, can be traced back to initial network](https://blog.talosintelligence.com/2020/06/CTIR-trends-q3-2020.html)\naccess gained via Emotet. Over the past few years, Emotet has periodically taken breaks\nfrom sending spam messages, with periods of inactivity ranging from weeks to months in\nseveral cases. It is important to note that while these periods of inactivity correspond to lack\nof spam distribution, the botnets are typically still operational during these periods and as\nsuch, previously infected systems can still be leveraged for intrusions.\n\nOrganizations and network defenders should be aware of the threat posed by Emotet and\nensure that they have strategies in place to prevent compromise, detect infections within\ntheir environments, and ensure that their backup and recovery strategies compensate for\n\n\n-----\n\nsituations in which the malware may have been resident for extended periods prior to\ndiscovery.\n\n## Sinkholing Emotet SMTP domains\n\nSeveral top-level domains (TLDs) that are widely used across the internet exhibit interesting\nbehavior when Domain Name System (DNS) resolution is attempted for domains that do not\nexist or are not actively registered. In many cases, the TLDs are configured to resolve nonexistent domains to a specific IP address. Whenever the name servers associated with these\nTLDs receive resolution requests from clients on the internet for domains that are not actively\nconfigured to resolve to a specific IP address, they respond with a default IP address value,\nregardless of whether the domain being queried is invalid or has ever existed. Upon\ndiscovering this behavior, we leveraged the official [list of TLDs available from ICANN to](https://data.iana.org/TLD/tlds-alpha-by-domain.txt)\ndetermine which TLDs operate in this manner. We built a list of TLDs that exhibit the\naforementioned behavior by rotating through this list of TLDs and requesting name resolution\nfor domains that do not exist.\n\nThe table below lists the affected TLDs that we discovered, as well as the IP address that the\nnameservers return when the requested domain is either non-existent or not otherwise\nconfigured for name resolution.\n\n\n-----\n\nThis DNS behavior allows researchers to leverage technologies like Passive DNS (pDNS) to\nidentify domains that may have been valid at one point but are no longer actively registered\nand maintained. It also enables identification and tracking of the volume of name resolution\nrequests for these invalid domains being performed by various clients across the internet.\nThis is useful for identifying domains that were previously part of domain generation\nalgorithms (DGAs) or otherwise used for various malware operations like command and\ncontrol (C2).\n\nFor example, the name resolution activity for a C2 domain previously associated with\n[Phorpiex that has since been abandoned, is shown below. While the adversary no longer](https://malpedia.caad.fkie.fraunhofer.de/details/win.phorpiex)\ncontrols the domain, orphaned bots are still continuing to reach out to it, attempting to\nestablish a C2 channel. Note that it currently resolves to the default IP address returned for\nnonexistent domains in the WS TLD as previously described earlier in this section.\n\n\n-----\n\nDuring our analysis of various orphaned domains, we discovered many domains that were\n[used previously for C2 by systems infected with a variety of threats like Dyre,](https://blogs.cisco.com/security/talos/threat-spotlight-dyre) [Necurs,](https://blog.talosintelligence.com/2018/01/the-many-tentacles-of-necurs-botnet.html)\n[StealthWorker, and others. While many of the domains we investigated were part of time-](https://malpedia.caad.fkie.fraunhofer.de/details/win.stealthworker)\nbased DGAs and not particularly useful, we identified several domains previously associated\nwith SMTP servers that systems infected with Emotet use to relay malicious spam\nmessages. We obtained ownership of these domains and began sinkholing SMTP\ncommunications originating from these infected systems.\n\nSinkholing is the process of redirecting this malicious botnet traffic away from its intended\nsource and into a harmless destination. This has provided visibility into hundreds of\nthousands of Emotet emails each month. It has also allowed us to determine the scope of\nthe systems sending malicious spam, profile the geographic and industry makeup of these\nsystems, and identify organizations suffering from resident Emotet infections.\n\n## Emotet activity in 2020\n\nEmotet spent the early part of 2020 churning out large quantities of malicious email in\nvolumes consistent with what has been observed from this threat in recent years. As the\nCOVID-19 pandemic began to spread across the globe, malware distributors took advantage\n[of the public's focus on this emerging crisis — and Emotet was no exception. The use of](https://blog.talosintelligence.com/2020/02/coronavirus-themed-malware.html)\ncurrent events in phishing and malspam lures is not a new technique and has been observed\n[being used by various threat actors as described in detail here.](https://blog.talosintelligence.com/2020/07/current-events-lures.html)\n\n\n-----\n\nEmotet occasionally takes periodic breaks from sending malicious spam emails, as seen\nearlier this year. Starting in February 2020, Emotet took an extended break from spamming,\nwith low volumes of Emotet spam emails being observed for a period of several months. It\nspun up again in June with massive amounts of spam being sent starting in July and\ncontinuing through to the present time, with intermittent pauses along the way. The following\ngraph graph shows the relative volumes of spam for each month in 2020.\n\nA further breakdown shows the volume of spam emails generated by the Emotet botnets on\na weekly basis throughout the course of 2020.\n\n\n-----\n\nWe also performed an analysis of the email data that was transmitted by systems infected\nwith Emotet to get a better understanding of the characteristics of these spam runs and the\nemails themselves. One thing that is immediately noticeable is the fact that hardly any spam\nmessages are sent on weekends.\n\nInterestingly enough, when the botnets are spamming, they are doing so consistently around\nthe clock. The chart below shows the distribution of messages received broken down by the\nhour of the day in which the transmission occurred. This shows the consistency with which\nthe messages are transmitted on an hourly basis.\n\nWe identified several interesting characteristics associated with these campaigns. Analysis of\nthe subject lines of messages sent by infected systems uncovered several keywords that are\n\n\n-----\n\nused extensively across the different distribution campaigns we observed. The use of\n\"invoice\" as a keyword across emails was the most common by an extremely high margin,\nconsistent with what is a commonly observed theme to many malspam campaigns seen\nacross the threat landscape.\n\nWhen looking at the top five subjects by volume, a Japanese language subject was found:\n\"会議開催通知,\" which translates to \"Meeting Notification.\" Typically, we find that the most\nvoluminous subjects use Western languages, finding a Japanese example that high on the\nlist was unexpected. In general, Japanese and Korean, although a small percentage, were\nthe most common non-Western languages we observed while analyzing this data.\n\nMost of the emails associated with Emotet feature the use of malicious attachments that\nfunction as malware downloaders. Opening the attached files and enabling the malicious\ncontents causes them to reach out to the attacker's distribution infrastructure to download\nadditional malicious content that is then executed on the victim's system, thus infecting it with\nmalware. The overwhelming majority of attachments leverage malicious Microsoft Office\ndocuments (i.e. DOC, DOCX, XLS, XLSX) however Emotet malspam has also been\nobserved featuring ZIP archives, PDFs, and more. Below is a chart showing the distribution\nof attachments by file type based on telemetry data collected over the past twelve months.\n\n\n-----\n\nThere is one other type of email attachment we have seen in campaigns, although not\nwidespread, encrypted or password protected files. We found a small amount of these types\nof campaigns and they are typically used in conjunction with stolen email threads. One thing\nto note for these is instead of using basic or simple passwords they include relatively\ncomplex passwords, which is uncharacteristic for password protected malicious attachments.\nInvestigating the character count distribution associated with malicious attachment filenames\nshows that there is a wide range in terms of the approximate length of filenames associated\nwith Emotet malspam, with the most common file names used being 18 characters in length\n(including the file extension).\n\n\n-----\n\nEmotet has also been observed distributing emails containing hyperlinks that, when clicked\nby potential victims, directs their system to reach out to the attacker's distribution servers to\nobtain malicious content to execute, resulting in malware infection. In most cases, these\n[distribution servers are running WordPress, a content management system (CMS) that is](https://wordpress.com/)\nfrequently abused by attackers and used to host malicious components which are used in\nmalware infections. In many cases, the servers used for distribution were running outdated\nplugins, themes, etc., making them attractive targets for compromise.\n\n## Profiling infected systems\n\nWhile Emotet is often referred to as a singular threat, it is actually composed of multiple\ndistinct botnets, which are referred to by the security research community as \"epochs.\" At\npresent, there are three epochs, each with distinct supporting infrastructure for various\nmalware operations like C2. In analyzing the SMTP sinkhole data we collected, we identified\ninfected systems from each of these three botnets attempting to transmit malicious spam\nusing our newly acquired domains. We identified infected systems located in more than 200\ndifferent countries. This highlights how widespread Emotet's reach is, affecting virtually every\ncountry in the world. Below is a map showing the geographic regions associated with the\nlargest number of infected systems that we observed.\n\nWe also analyzed the network providers associated with these infected systems to determine\nwhat ISPs were most commonly affected. The graph below shows the top ASNs we\nobserved sending malspam.\n\n\n-----\n\nIt is important to note that the distribution of systems infected by Emotet is constantly\nchanging, as existing infections are removed and new ones are added. We analyzed the\nbotnet distribution over the course of the past twelve months and tracked these changes\nover time. This long term geographic distribution over time can be seen in the graph below.\n\n\n-----\n\nEmotet is a heavily distributed threat that has wide-ranging impacts on a variety of different\nindustries and geographic regions. Malicious activity associated with this threat has\ncontinued throughout 2020 and will likely continue for the foreseeable future.\n\n## Conclusion\n\nEmotet is a constantly evolving threat that poses risks to organizations all over the world.\nLarge volumes of malicious spam emails generated by systems infected with Emotet are\nconstantly being sent in an attempt to infect additional systems and provide persistent\nnetwork access that can be used for a variety of nefarious purposes. Organizations should\nbe aware of this threat as it continues to change over time and ensure that they have\nstrategies in place to protect their environment from the impacts of successful infection. In\nmany cases, Emotet is the initial stage of a multi-stage infection process that often features\nuse of additional malware payloads. Since Emotet can be present in environments for\nextended periods of time prior to discovery by security teams, it is essential that\norganizations develop comprehensive backup and recovery strategies that can compensate\nfor these situations prior to an incident occurring. This approach to cybercrime continues to\nbe lucrative for cybercriminals and as such is likely not going away in the foreseeable future.\nCisco Talos will continue to monitor this threat to ensure that customers remain protected as\nit continues to change and evolve over time.\n\n## Coverage\n\n\n-----\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware detailed in this post. Below is a screenshot showing how AMP can protect\ncustomers from this threat. Try AMP for free [here.](https://cisco.com/go/tryamp)\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), and](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html) [Meraki MX can detect malicious activity](https://meraki.cisco.com/products/appliances)\nassociated with this threat.\n\n[Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs and URLs, whether users are on or off the corporate network.\n\nAdditional protections with context to your specific environment and threat data are available\nfrom the [Firepower Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-18 - Back from vacation- Analyzing Emotet’s activity in 2020.pdf"
    ],
    "report_names": [
        "2020-11-18 - Back from vacation- Analyzing Emotet’s activity in 2020.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536225,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653687121,
    "ts_modification_date": 1653687121,
    "files": {
        "pdf": "https://archive.orkl.eu/097c222f30ba7e75e853e6b4284dcd0593f5efd1.pdf",
        "text": "https://archive.orkl.eu/097c222f30ba7e75e853e6b4284dcd0593f5efd1.txt",
        "img": "https://archive.orkl.eu/097c222f30ba7e75e853e6b4284dcd0593f5efd1.jpg"
    }
}