{
    "id": "0da7f31a-b546-4818-b8a1-ed2af914df72",
    "created_at": "2023-01-12T15:03:07.889109Z",
    "updated_at": "2025-03-27T02:06:15.305695Z",
    "deleted_at": null,
    "sha1_hash": "6d83e28534651501c81ccf93503a37f8ff05131f",
    "title": "2021-02-02 - Finding and Decoding Multi-Step Obfuscated Malware",
    "authors": "",
    "file_creation_date": "2022-05-27T22:09:17Z",
    "file_modification_date": "2022-05-27T22:09:17Z",
    "file_size": 801736,
    "plain_text": "# Finding and Decoding Multi-Step Obfuscated Malware\n\n**[trendmicro.com/en_us/research/21/b/finding-multi-step-obfuscated-malware.html](https://www.trendmicro.com/en_us/research/21/b/finding-multi-step-obfuscated-malware.html)**\n\nRecently, in the process of a threat investigation, we found an interesting event:\n\n\nFebruary 2, 2021\n\nFigure 1. Interesting event that\n\n\nstarted the investigation\nHere, we have a process (nslookup.exe) that tried to connect to a malicious URL that was already blocked by our solutions.\n[We could have stopped at this point, but searching for the root cause is part of managed detection and response (MDR) — we](https://www.trendmicro.com/en_us/business/products/detection-response/managed-xdr-mdr.html)\nneeded to learn why this event happened in the first place and prevent it from happening in the future.\n\nThe process in question is nslookup.exe, a network administration command-line tool used for querying the DNS. Therefore,\nthis process performing a URL request is not unusual — at first glance. Neither is this action, by itself, malicious. However, why\nwould anyone (aside from security researchers) query a malicious URL via nslookup in the first place?\n\nWe were able to trace where the execution came from, and we saw that the events coincided with execution of certutil:\n\n\n-----\n\nFigure 2. Certutil events as seen in logs\n_Certutil is a command-line tool used for certificate management. The command certutil -decode can be abused to decode files_\n[hidden inside a certificate file (T1140), and that was done here. The file Roccia.xltm is decoded to Fu.mp4, and then the](https://attack.mitre.org/techniques/T1140/)\ncontents of Fu.mp4 was piped to cmd.exe for execution. Upon digging further, we found that the starting point was user\nexecution of a [disguised file named setup_x86_x64_install.exe that was supposedly signed (with an invalid certificate) by AO](https://attack.mitre.org/techniques/T1036/)\nKaspersky Lab (Trend Micro detects this as Trojan.Win32.ALIEN.A).\n\nFigure 3. A signed malicious file\n\nThis file is actually an SFX CAB archive that contains the following files:\n\n\n-----\n\nFigure 4. Actual contents of the malicious file\n\nThe SFX file then executes the following command:\n\nFigure 5. The executed command\n\nThis will decode the content of Roccia.xltm to Fu.mp4 and execute the latter file.\n\nFigure 6. Obfuscated contents of\n\nRoccia.xltm\nThe contents of Fu.mp4 are obfuscated, and when the contents are deobfuscated, they will look like this:\n\nFigure 7.\n\nThe deobfuscated contents of Fu.mp4\nThe code checks for multiple computer names and the C:\\aaa_TouchMeNot_.txt file that usually indicates the presence of\nWindows Defender Antivirus Emulator. If any of these files are present, it will immediately exit.\n\nIt will then create the file rundll32.com from the contents of Agolo.mid, but without the prepended string and with an added MZ\nheader. This file is the AutoIt compiler.\n\n\n-----\n\nFigure 8. Contents of Angolo.mid\n\nIt will also decode the content of Custodiva.ppt, which is the obfuscated AutoIT script.\n\nFigure 9. Contents of Custodiva.ppt\n\nFigure 10. Deobfuscated AutoIT script\nThe deobfuscated script contains junk code and a simple string decryption routine. Upon decoding the strings, this AutoIt script\nwill be used to execute the content of Attesa.docm via process hollowing of a spawned nslookup.exe.\n\nThis is accomplished by first reading the content of Attesa.docm.\n\nFigure 11. Decoded\n\nAutoIt command to read Attesa.docm\n\n\n-----\n\nFigure 12. Contents of Attesa.docm\n\nThe AutoIT script will then spawn a nslookup.exe process, which is then hollowed. The contents are replaced with those of\n_Atessa.docm:_\n\nFigure 13. Decoded AutoIt command\n\nFigure 14. Use of SetThreadContext in AutoIt script for process hollowing\nUpon injection, nslookup.exe will then perform the malicious routine. The payload consists of an information stealer that tries to\nacquire information (such as cookies or credentials) from browsers and cryptocurrency wallets, as well as system information\nand desktop screenshots. Both this injected nslookup.exe and an executable that uses the same command-and-control (C&C)\nservers (and that has a similar behavior) are detected as TrojanSpy.Win32.PRETSTEAL.A.\n\nThe stolen information is saved, compressed into a ZIP file, and sent to the following C&C servers:\n\neressedu03[.]top/index.php\neressedv32[.]top/index.php\n\nIt also attempts to download and execute a file from the following URL. However, this URL is already inaccessible.\n\ndownhhay09[.]top/download.php?file=lv.exe\n\nFigure 15. Information stealer code\n**Takeaways for Researchers/Analysts**\n\nWhat can other researchers or security analysts learn from an incident like this?\n\n1.   A single detected event should not be the conclusion. Find out the underlying root cause of the issue. In this case, it was\na user who ran a malicious file and needed to be educated about it.\n\n2.   If a legitimate process (nslookup, in this case) behaves in a way that is suspicious, follow your instincts and dig deeper.\n\n\n-----\n\n3.   Good sensors are necessary to carry out a proper threat investigation. These sensors allowed us not only to gather\nsufficient information about this incident, but also to find the root cause.\n\n**Trend Micro Solutions**\n\n[Trend Micro’s comprehensive XDR solution applies the most effective expert analytics to the deep data sets collected from](https://www.trendmicro.com/en_us/business/products/detection-response/xdr.html?utm_campaign=PRLA2019_Corporate_XDR&utm_medium=VURL&utm_source=General&utm_content=XDR)\nTrend Micro solutions across the enterprise — including email, endpoints, servers, cloud workloads, and networks — making\nfaster connections to identify and stop attacks. Powerful artificial intelligence (AI) and expert security analytics correlate data\nfrom customer environments and Trend Micro’s global threat intelligence to deliver fewer, higher-fidelity alerts, leading to\nbetter, early detection. One console with one source of prioritized, optimized alerts supported with guided investigation\nsimplifies the steps needed to fully understand the attack path and impact on the organization.\n\n**Indicator of Compromise (IOC)**\n\nHash (SHA-256) Description Detection Name\n\nd7fdbdc5b650cb21e898fe45be1aaba320b0d47b5283e45822ecc1270b420279 Payload TrojanSpy.Win32.PRETSTEAL.A\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-02 - Finding and Decoding Multi-Step Obfuscated Malware.pdf"
    ],
    "report_names": [
        "2021-02-02 - Finding and Decoding Multi-Step Obfuscated Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535787,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653689357,
    "ts_modification_date": 1653689357,
    "files": {
        "pdf": "https://archive.orkl.eu/6d83e28534651501c81ccf93503a37f8ff05131f.pdf",
        "text": "https://archive.orkl.eu/6d83e28534651501c81ccf93503a37f8ff05131f.txt",
        "img": "https://archive.orkl.eu/6d83e28534651501c81ccf93503a37f8ff05131f.jpg"
    }
}