{
    "id": "0db21b8e-29f2-4470-9a6e-a6612c1a8fa2",
    "created_at": "2023-01-12T15:09:32.225019Z",
    "updated_at": "2025-03-27T02:05:32.489895Z",
    "deleted_at": null,
    "sha1_hash": "3b87d81b9fac81ddffec5678dea3c28c21e9bb2d",
    "title": "2020-12-18 - Nordkorea in Verdacht- Cyberspionage gegen deutsche Rüstungskonzerne",
    "authors": "",
    "file_creation_date": "2022-05-28T02:07:51Z",
    "file_modification_date": "2022-05-28T02:07:51Z",
    "file_size": 82816,
    "plain_text": "# Spionage - Aktuelle Nachrichten\n\n**[tagesschau.de/investigativ/br-recherche/cyberspionage-ruestung-nordkorea-105.html](https://www.tagesschau.de/investigativ/br-recherche/cyberspionage-ruestung-nordkorea-105.html)**\n\n## Britischer Inlandsgeheimdienst MI5 warnt vor angeblicher chinesischer Agentin\n\n14.01.2022 - 10:57 Uhr\nSie soll versucht haben, Einfluss auf die britische Politik zu nehmen - im Sinne der\nStaatsführung Chinas: Der britische Inlandsgeheimdienst warnt Ober- und Unterhaus vor\neiner Anwältin, die im Regierungsviertel gut vernetzt war.\n\n## Ausspähung von Handys Staatsanwaltschaft ermittelt gegen Finfisher\n\n18.07.2021 - 19:20 Uhr\nDie Staatsanwaltschaft hat ein Ermittlungsverfahren gegen Verantwortliche eines deutschen\nSpionageherstellers eingeleitet. Nach Informationen von NDR, BR und SZ wird die Firma\nverdächtigt, illegal Spähsoftware in die Türkei exportiert zu haben.\n\n## Spionagesoftware Warnung vor \"Golden Spy\" aus China\n\n21.08.2020 - 16:31 Uhr\nIndustriespionage ist seit langem ein Thema für westliche Firmen, die in China arbeiten. Nun\nwarnen die deutschen Sicherheitsbehörden vor einer Spionagesoftware, die sich die Firmen\nunbemerkt herunterladen. Von Michael Götschenberg.\n\n## Cyberangriff auf den Bundestag Wie lief die Suche nach dem Hacker?\n\n08.05.2020 - 11:44 Uhr\nDer Generalbundesanwalt fahndet nach einem russischen Spion, der am Cyberangriff auf\nden Bundestag 2015 beteiligt gewesen sein soll. Abgeordnete wollen nun wissen, wie die\nBehörden den Hacker enttarnt haben. Von Florian Flade.\n\n**Exklusiv**\n\n## Deutsche Sicherheitsbehörden Keine Beweise für Spionage durch Huawei\n\n17.02.2020 - 18:00 Uhr\nDie US-Regierung behauptet, das chinesische Unternehmen Huawei könne Spionage in\ndeutschen Mobilfunknetzen betreiben. Deutsche Sicherheitsbehörden sehen\nnach Recherchen von WDR, NDR und SZ keine Beweise dafür.\n\n\n-----\n\n## Spähsoftware in Israel Polizei soll mit Pegasus spioniert haben\n\n07.02.2022 - 16:13 Uhr\nIsraels Polizei soll jahrelang unerlaubt Regierungskritiker, Geschäftsleute und einen Sohn\nvon Ex-Regierungschef Netanyahu abgehört haben. Innenministerin Schaked forderte eine\numgehende Untersuchung der Vorwürfe.\n\n**Hintergrund**\n\n## Ausweisung russischer Diplomaten Wie sich Deutschland vor Spionage schützt\n\n06.04.2022 - 11:05 Uhr\nBerlin gilt als Hauptstadt der Spione - vor allem in Kriegszeiten. Wohl auch deshalb hat\nDeutschland nun russische Diplomaten ausgewiesen. Doch woher weiß die Regierung, wer\nfür Geheimdienste arbeitet? Von M. Stempfle.\n\n**Exklusiv**\n\n## Bundesanwaltschaft erhebt Anklage Spionierte ein BND-Informant für China?\n\n06.07.2021 - 05:03 Uhr\nOffiziell arbeitete er für eine Stiftung, spionierte aber für den BND. Nun hat die\nBundesanwaltschaft nach Informationen des ARD-Hauptstadtstudios Anklage erhoben\ngegen den 75-Jährigen: Er soll auch für China spioniert haben. Von M. Götschenberg.\n\n**Exklusiv**\n\n## Nach Ausweisungen Wo sind Russlands Spione?\n\n11.05.2022 - 18:23 Uhr\nMehr als 400 russische Diplomaten mussten Europa seit Beginn des Ukraine-Krieges\nverlassen. Sie sollen Spione gewesen sein. Sicherheitsbehörden gehen davon aus, dass\nRussland seine Spähaktivitäten anpasst. Von Florian Flade.\n\n## Für Russlands Geheimdienst Reserveoffizier wegen Spionage angeklagt\n\n01.04.2022 - 16:50 Uhr\nEin Reserveoffizier der Bundeswehr soll über etliche Jahre den russischen Geheimdienst mit\nInformationen versorgt haben - auch zur Gaspipeline Nord Stream 2. Deshalb hat die\nBundesanwaltschaft nun Anklage gegen ihn erhoben.\n\n## Wegen Spionage Russischer Diplomat ausgewiesen\n\n28.01.2022 - 15:36 Uhr\n\n\n-----\n\nDie Bundesregierung hat nach Spiegel -Informationen einen russischen Diplomaten des\nLandes verwiesen. Er sei bei Ermittlungen gegen den Mitarbeiter einer bayerischen\nUniversität als Spion aufgeflogen.\n\n## Spionageverdacht an Uni in Bayern Anklage gegen russischen Wissenschaftler\n\n27.01.2022 - 11:28 Uhr\nEin ehemaliger Mitarbeiter einer bayerischen Universität soll Erkenntnisse aus der\nRaumfahrttechnologie an Russland weitergegeben haben. Nun hat die Bundesanwaltschaft\nAnklage gegen den gebürtigen Russen erhoben.\n\n## Dänische Spionageaffäre Merkel und Macron verlangen Aufklärung\n\n31.05.2021 - 20:26 Uhr\nDie Beteiligung des dänischen Geheimdienstes bei der Ausspähung europäischer\nSpitzenpolitiker durch die USA sorgt für einigen Unmut. Frankreichs Präsident Macron\nnannte das Vorgehen \"inakzeptabel\" - Kanzlerin Merkel schloss sich an.\n\n**Exklusiv**\n\n## Russische Spionage Wie im Kalten Krieg\n\n13.04.2021 - 12:00 Uhr\nRusslands Geheimdienste sind zuletzt vor allem durch Cyberangriffe aufgefallen. Aber auch\nMethoden aus dem Kalten Krieg kommen noch zum Einsatz - etwa der Agentenfunk. Von\n_Florian Flade und Georg Mascolo._\n\n\n-----",
    "language": "DE",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-18 - Nordkorea in Verdacht- Cyberspionage gegen deutsche Rüstungskonzerne.pdf"
    ],
    "report_names": [
        "2020-12-18 - Nordkorea in Verdacht- Cyberspionage gegen deutsche Rüstungskonzerne.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536172,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653703671,
    "ts_modification_date": 1653703671,
    "files": {
        "pdf": "https://archive.orkl.eu/3b87d81b9fac81ddffec5678dea3c28c21e9bb2d.pdf",
        "text": "https://archive.orkl.eu/3b87d81b9fac81ddffec5678dea3c28c21e9bb2d.txt",
        "img": "https://archive.orkl.eu/3b87d81b9fac81ddffec5678dea3c28c21e9bb2d.jpg"
    }
}