{
    "id": "0dbc82a2-0e74-4891-8ef3-69b35fca6d64",
    "created_at": "2022-10-25T16:48:20.800188Z",
    "updated_at": "2025-03-27T02:17:23.703114Z",
    "deleted_at": null,
    "sha1_hash": "8b90e283d66e6e3222641f09269ad28eda4127bf",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-11-07T02:11:07Z",
    "file_modification_date": "2019-11-07T02:11:07Z",
    "file_size": 845922,
    "plain_text": "# The Lazarus’ gaze to the world: What is behind the first stone ?\n\n**[blog.telsy.com/the-lazarus-gaze-to-the-world-what-is-behind-the-first-stone](https://blog.telsy.com/the-lazarus-gaze-to-the-world-what-is-behind-the-first-stone/)**\n\nwebmaster@telsy.com\n\n## // Introduction\n\nLazarus (aka APT38 / Hidden Cobra / Stardust Chollima) is one of the more prolific threat actors\nin the APT panorama. Since 2009, the group leveraged its capability in order to target and\ncompromise a wide range of targets; Over the time, the main targets have been government and\ndefense institutions, organizations operating in the energy and petrochemical sector in addition to\nthose operating in financial and banking one.\n\nThe group has also a wide range of tools at its disposal; among these, it’s possible to catalog [D]\nDoS botnets, first stage implanters, remote access tools (RATs), keyloggers and wipers. This list\nof malicious tools has over time supported a series of operations that have ranged from\nespionage to funding up sabotage.\n\nThis specific blog posts about concerns of a recent operation most likely carried out by this group\nand directed towards targets located in different parts of the world. However, our analysis started\nfrom a single malicious e-mail delivered against an important Italian institution operating in the\nbanking and financial sector\n\n\n-----\n\nStarting from this email, we tried to trace back the path of the threat actor up to obtaining an\nexcellent degree of visibility on what was going on.\n\nBy tracking down malware variants, the actor’s operational logic and mechanisms were put in\nplace in order to limit the spread of the second-stage payloads.\n\nHowever, in this intervention, we will describe only the first phase of the kill chain; Here, the threat\nactor has provided for the release of two types of payloads based on the architecture of the\nvictim’s system as well as actions used in order to carry out a first recognition phase. Afterward,\nsome features of the remote script that was used for managing and controlling victims will be\nexplored. Further information about this campaign are available for our threat intelligence portal\ncustomers by referring to the investigation ATR:78456.\n\n## // Vector\n\nThe threat actor, in this case, relied on a spoofed e-mail message (coming from\n**_e_banking@victim_name_domain_name) in order to deliver to the victims a message with a_**\nmalicious Microsoft Office Word document attached. One of these retrieved documents refers to\nan alleged vacant job position for the Hindustan Aeronautics company.\n\nThe malicious document has two separate first-stage doubly base64 encoded payloads included\nwithin (one for 32 and one for 64-bit systems) in addition to another doubly encoded base64 word\ndocument that has been shown to the user.\n\nAn example of one of the payloads is shown as follows:\n\n\n-----\n\nOnce the macro is executed, the first infection process is started using the AutoOpen Sub.\nVariables dllPath and docPath are filled calling respectively the functions GetDllName() and\n**_GetDocName() in order to retrieve the paths from where they will be loaded later. For the first_**\nstage, it is as follows:\n\n_%USERPROFILE%”\\AppData\\Local\\Microsoft\\ThumbNail\\thumnail.db_\n\nA subsequent LoadLibraryA loads dropped dll. A variable named “a” is then filled with the\nresults of the so-called ShowState function within the content of an active opened document.\nThese instructions are the result of executing the dropped library.\n\n## // First run and persistence\n\nThe ShowState function has mainly the task of recovering the current execution path, starting the\n**_SetupWorkStation function in the same module context and ensuring persistence in the affected_**\nsystem.\n\nIt is interesting to note how the functions CoInitialize and CoCreateIstance are used respectively\nto initialize the COM library and to instantiate the COM object.\n\n\n-----\n\nHowever, in order to understand which object is being instantiated, the first argument to the\n**_CoCreateInstance() function must be inspected to extract the unique identifier (CLSID) of the_**\nCOM object. A look at variable as it would look in memory is shown as follows:\n\nOpening the HKEY_CLASSES_ROOTCLSID key gives the corresponding readable format:\n\nOn function return, a new shortcut (lnk) is created under the local path resulting from\n**_GetTempPath function minus “\\Local\\Temp\\” and plus “\\Roaming\\Microsoft\\Windows\\Start_**\n**_Menu\\Programs\\Startup\\thumbnail.lnk“_**\n\nThe content of thumbnail.lnk is:\n\n\n-----\n\n_“C:\\Windows\\System32\\rundll32.exe” “full path of module”, SetupWorkStation S-6-38-4412-_\n_76700627-315277-3247 0 0 9109 1_\n\n## // Implant Initialization\n\n**_SetupWorkStation function of the implant is aimed at a system reconnaissance and at_**\nperforming beacon of the command and control center. If the malware does not find the exact\nnumber of expected arguments in its command line, it simply quits the execution without going\nany further.\n\nInside this frame of code, a new thread is created with the starting address 100075A0.\n**_sub_10007340 is designed to initialize external communication. It internally calls sub_100071F0_**\nthat is aimed to executing operations designed for system reconnaissance.\n\nAn example of these instructions from dynamically generated pseudo-code is shown below:\n\nRetrieving Username and CumputerName\n\nRetrieving LogicalDrives, DriveTypes\n\nRetrieving FreeSpace for drives\n\n\n-----\n\nPerforming Processes Enumeration\n\nThe collected information is then compressed and encrypted. Subsequent HTTP request is\nprepared in order to send data to command and control. Communications make use of HTTP\nprotocol and POST method. “ned“, “gl” and “hl” parameters will be used in order to interact with\nremote command and control script that are used to handle victims and to deliver the second\nstage payload. A code frame regarding the functions used for HTTP communication is reported\nas follows:\n\n## // Behind the first stone\n\nWe had the opportunity to analyze what the actor did in the backend in order to manage the\nvictims of the first stage implanter that has been described. The remote script, at least as far as\nobserved, is copied into legitimate compromised sites. It also includes the possibility to decide if\nand when the second level payload is to be released and works through blacklists and whitelists\nin order to protect the final backdoor from unwanted spread.\n\n\n-----\n\nIt looks like a heavily obfuscated VBScript artifact. Here an extract from the original retrieved\ncode:\n\nAfter retrieving the original instructions set, it has been possible to deeply understand the working\nlogic behind; The remote script works mainly through Request.Form variables that are filled\nwhen receiving beacons from victims and by local variables named as following:\n\n1. strworkdir: The working folder within the compromised wwwroot.\n\n2. strlogpath: The path to the file used in order to log victims’ data. In this case a fake .mp3 file\n\n3. strwhitefile: The path to the file used in order to store whitelisted victims IP address. In this\ncase, a fake .mp3 file.\n\n4. strblackfile: The path to the file used in order to store the blacklisted IP address. In this case,\na fake .mp3 file.\n\nParameters “gl” and “hl” are used respectively to retrieve system info about victims and OS\narchitecture. On the basis of what we have collected, the log file mapped by strlogpath variable\nis then updated with a new row comprising victim IP address, victim system info, request\n_timestamp and adopted case in handling the victim._\n\nThe cases that have been designed by the threat actor can be four on the basis of interest for the\nvictim:\n\n1. case_1_64/86: MD5 of IP address that made the request is on whitelist. The actor has\n\nselected the victim to be infected with a second-stage payload. TorisMa_x64/86 _payload is_\nthen released to the victim.\n2. case_2_64/86: MD5 of IP address that made the request is on blacklist. The actor wants to\n\nprevent the spreading of the second stage payload to that IP address. Doris_x64/86 (nonsense chars) payload is then released to the victim.\n3. case_3: The victim results of particular interest for the threat actor on the basis of retrieved\n\nsystem info (identified with a value of 24 of “ned“). Second stage payload is not yet\ndelivered.\n4. case_4: The victim results of no particular interest for the threat actor. no previous\n\ncondition has been met. Second stage payload is not yet delivered.\n\n\n-----\n\nBelow, the primary construct used to manage what is received by the backend script:\n\n## // Victimology\n\nAccording to the visibility obtained so far, we asses with a high degree of confidence that this\ncampaign is mainly directed against research/defense sector and financial / payments institutions.\nOther types of sectors are obviously not to be excluded on the basis of actor interests. Most of the\nmalicious activities associated with the examined malware set are limited to the Indian region.\nHowever, organizations of other countries as well are inside of Lazarus’ interests. Here there is an\nexhaustive geographical map where it is possible to observe actions attributable to this specific\nthreat (note that these malicious actions may not have led to a current active infection but could\nbe only limited to infection attempts):\n\n## // Conclusions\n\nIn this case, the Lazarus group targets research / defense and financial organizations mainly in\nthe same region where the security community has recently attributed an attack from the same\ngroup against a nuclear power plant. However, it has also been noted that the actor has extended\nits interests to other regions of the world, including Italy. Furthermore, we have observed an info\n\n-----\n\ngathering implanter used to quickly identify interesting targets and we have exposed the use of a\nbackend script designed to handle the victims and limit the spread of second-stage payloads only\nto wanted ones.\n\n## // MITRE ATT&CK Techniques\n\n[+] T1193 – Actor relies on spear-phishing as infection vector\n\n[+] T1002 – Actor compresses and encrypts data\n\n[+] T1132 – Actor encodes data\n\n[+] T1023 – Actor relies on shortcuts to achieve persistence\n\n[+] T1060 – Malware maintain persistence through Start menu folder\n\n[+] T1071 – Actor relies on standard application layer protocol for C2 coms\n\n[+] T1043 – Actor uses common ports to communicate\n\n## // Indicators of Compromise\n\n**SHA256: b018639e9a5f3b2b9c257b83ee51a3f77bbec1a984db13d1c00e0CC77704abb4**\n\n**SHA256: adf86d77eb4064c52a3e4fb3f1c3218ee2b7de2b1780b81c612886d72aa9c923**\n\n**SHA256: 1a172d92638e6fdb2858dcca7a78d4b03c424b7f14be75c2fd479f59049bc5f9**\n\n**SHA256: ec254c40abff00b104a949f07b7b64235fc395ecb9311eb4020c1c4da0e6b5c4**\n\n**SHA256: 26a2fa7b45a455c311fd57875d8231c853ea4399be7b9344f2136030b2edc4aa**\n\n**Domain** **name (compromised): curiofirenze[.]com**\n\n**IP Address: 193.70.64.163**\n\n**File: %USERPROFILE%”\\AppData\\Local\\Microsoft\\ThumbNail\\thumnail.db**\n\n**File: %APPDATA% \\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\thumbnail.lnk**\n\n## // Artifacts detection rules\n\n[YARA detection rule for unpacked dll implant is available here](https://github.com/telsy-cyberops/research/blob/master/APT38/yara.yar)\n\nThird-party freely available rules for detecting executables that have been encoded with base64\n[twice are here](https://github.com/Neo23x0/signature-base/blob/master/yara/gen_susp_obfuscation.yar)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.11.05.LAZARUS_GAZE/LAZARUS_GAZE_APT38.pdf"
    ],
    "report_names": [
        "LAZARUS_GAZE_APT38"
    ],
    "threat_actors": [
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "810fada6-3a62-477e-ac11-2702f9a1ef80",
            "created_at": "2023-01-06T13:46:38.874104Z",
            "updated_at": "2025-03-27T02:00:02.94053Z",
            "deleted_at": null,
            "main_name": "STARDUST CHOLLIMA",
            "aliases": [],
            "source_name": "MISPGALAXY:STARDUST CHOLLIMA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1573092667,
    "ts_modification_date": 1573092667,
    "files": {
        "pdf": "https://archive.orkl.eu/8b90e283d66e6e3222641f09269ad28eda4127bf.pdf",
        "text": "https://archive.orkl.eu/8b90e283d66e6e3222641f09269ad28eda4127bf.txt",
        "img": "https://archive.orkl.eu/8b90e283d66e6e3222641f09269ad28eda4127bf.jpg"
    }
}