{
    "id": "0dfebbce-5d59-4f16-bf99-91a2a6fd8c28",
    "created_at": "2023-01-12T15:09:52.186563Z",
    "updated_at": "2025-03-27T02:16:37.074227Z",
    "deleted_at": null,
    "sha1_hash": "91e112ee74b84d72fe2bf4b5b522cd72e975abf7",
    "title": "2020-06-16 - Cloud Threat Landscape Report 2020,pdf",
    "authors": "",
    "file_creation_date": "2020-06-04T13:45:25Z",
    "file_modification_date": "2020-06-04T17:34:56Z",
    "file_size": 433508,
    "plain_text": "### Cloud Threat Landscape Report 2020\n\n###### IBM Security X-Force® Incident Response and Intelligence Services (IRIS)\n\nSpecial Intelligence Report Q2 2020\n\n\n-----\n\n##### Table of contents\n\n**Introduction**\nKey findings\n\n**Section 1**\nCloud computing: significant security benefits, but risks must be addressed\n\n**Section 2**\nWho is targeting cloud systems\n\n**Section 3**\nHow threat actors compromise cloud environments\n\n**Section 4**\nHow threat actors are using the cloud to cause harm\n\n**Section 5**\nCloud-native malware and its evolution\n\n**Section 6**\nRecommendations to enhance your cloud security\n\n**Conclusion**\nAbout IBM X-Force\nEndnotes\n\n\n03\n04\n\n06\n\n08\n\n10\n\n13\n\n17\n\n20\n\n24\n24\n25\n\n\nCloud Threat Landscape Report 2020 2\n\n\n-----\n\n##### Introduction\n\nWith organizations increasingly using cloud environments for scaling and\n\naccelerating operations, understanding the unique cyber threat landscape\n\nof this field is critical. Leveraging IBM’s global presence and cloud incident\n\nresponse capabilities, we have conducted an in-depth analysis of cloud-related\n\ncybersecurity incidents our team has responded to over the past year in order to\n\ndiscern the top threats in this arena. This paper will dive into what IBM Security\n\nsees on the front lines of defending the cloud, including:\n\n— Who is targeting cloud systems\n\n— How we’re seeing threat actors access cloud environments\n\n— What threat actors are doing once they have gained access\n\nto a cloud environment\n\n— Common shortcomings we observe in cloud security\n\n— Recommendations for improving your organization’s cloud\n\nsecurity posture\n\nCloud Threat Landscape Report 2020 3\n\n\n-----\n\n##### Key findings\n\n\n## 45%\n\n\n###### Bruteforcing and exploitation of cloud applications are the two most common infection vectors, accounting for 45% of the cases examined in this report.\n\n\n## >1 billion\n\n\n###### Misconfiguration of cloud environments led to over one billion lost records in 2019.\n\n\nCloud Threat Landscape Report 2020 4\n\n\n-----\n\n##### Key findings\n\n###### Leveraging cloud platforms for use as malicious infrastructure is often a favorite ploy of sophisticated threat actors, enabling them to ramp up operations with a single compromise. This has the added appeal of allowing them to minimize their own costs at the expense of their targets and appear to originate from otherwise legitimate sources.\n\n#### Losses of Depending on the organization impacted and the type of applications run in the\n###### cloud, infiltration can bring this swift and hefty price tag.\n#### >$50,000/hr\n\n###### Redeploy assets, don’t reimage them: Organizations that redeploy assets vs. reimage affected cloud environments are more capable of performing effective forensic investigations,\n which may prevent subsequent harm to the organization.\n\n Defense-in-depth is a necessity: Malware developers, aware of increasing cloud adoption, have begun making malware that disables many common cloud security products, leaving many companies unknowingly vulnerable.\n\nCloud Threat Landscape Report 2020 5\n\n\n-----\n\n**Section 1**\n\n##### Cloud computing: significant security benefits, but risks must be addressed\n\nCloud computing, the delivery of on-demand computing resources over\n\nthe internet on a pay-per-use basis, provides a host of security benefits to\n\norganizations looking to expand their computing capability across the enterprise.\n\nWhile most enterprises today are approximately 20 percent into their transition\n\nto the cloud, as companies continue modernizing their core IT infrastructure\n\nand moving mission-critical data and apps to the cloud, organizations must also\n\nadapt to the unique cybersecurity challenges and opportunities posed by these\n\nnew hybrid, multi-cloud environments.\n\nThere are key terms that need clarification when discussing cloud security,\n\nas these terms often come up while organizations work to secure their\n\ncloud-based assets.\n\n**Public cloud**\nA cloud environment hosted external to an organization.\n\n**Private cloud**\nA cloud environment hosted and maintained within an organization for their private use.\n\n**Hybrid cloud**\nHaving clouds that are integrated and holistically managed — both on- and off-premises\nand across different clouds.\n\n**Containerization**\nContainers are an executable unit of software in which application code is packaged,\nalong with its libraries and dependencies, in common ways so that it can be run\nanywhere, whether it be on desktop, traditional IT, or the cloud.\n\nCloud Threat Landscape Report 2020 6\n\n\n-----\n\nCorporate IT environments are getting increasingly complex as businesses\n\nincorporate cloud elements and need to manage their hybrid multicloud\n\ninfrastructure in a way that is simple, consistent and integrated. But the\n\narchitecture is not where it ends. Security threats inherent to the cloud’s\n\nhyper-connected nature must be assessed and addressed as data and\n\noperations are moved to the cloud. Understanding the cloud security threat\n\nlandscape can help organizations better protect themselves and prepare for\n\npotential security events.\n\n###### Thinking about risk\n\nAs a result of increased cloud integration across enterprises, cloud-to-cloud\n\ninteractions allow potential infections to spread across an enterprise even faster\n\nthan on-premise attacks would and the vast amounts of data running in clouds\n\ncan also increase the amount of data that threat actors could potentially steal.\n\nWith data breach costs tightly linked with the number of records breached, cloud\n\nsecurity incidents can be costly. Another aspect that can quickly add up costs is\n\nunauthorized access to cloud assets. Depending on the type of operation being\n\nbreached, that access can easily generate losses of over $50,000 within less\n\nthan one hour.\n\n###### Unauthorized access to cloud assets can lead to\n losses of >$50,000 in less than an hour.\n\nClouds are a new era for many organizations and securing them, addressing data\n\nprivacy concerns, regulation and compliance, all demand a new and adapted\n\napproach with best practices that can differ from managing classic IT security.\n\nCloud Threat Landscape Report 2020 7\n\n\n-----\n\n**Section 2**\n\n##### Who is targeting cloud systems?\n\nIBM Security has observed multiple types of groups targeting cloud systems\n\nthrough our IBM X-Force Incident Response and Intelligence Services (IRIS)\n\n[incident response team, and working with our colleagues at DarkOwl, we’ve](http://darkowl.com/blog-content/darknet-threats-to-cloud-based-platforms-and-applications)\n\nfound even more interested parties on the deep web and dark web. Per our\n\nfinding, financially motivated criminals are the top threat, but nation state\n\nactors are also a persistent risk.\n\n###### Financially motivated criminals are the top threat group targeting cloud systems, but nation state actors are also a persistent risk.\n\n Criminal cloud targeting\n\nThe most frequently observed threat actor category targeting cloud\n\nenvironments was cybercriminals, according to X-Force IRIS incident response\n\ndata. Financially motivated threat actors were rarely associated with a specific\n\ngroup or organization, but rather simply trying to gain access to cloud assets in\n\nopportunistic attacks, oftentimes automating their attempts to cast a wide net.\n\nFurther research done in collaboration with DarkOwl, a darknet data intelligence\n\ncompany, reveals a thriving market for cloud-targeted services and accounts on\n\nunderground forums and markets.\n\nCloud Threat Landscape Report 2020 8\n\n\n-----\n\nKey offerings in the underground ecosystem include cloud service accounts at\n\nreduced prices. For example, one Russian-language forum featured vendors\n\noffering an unlimited monthly service for a large public cloud service that was\n\ncheaper than the public sale price. In another case, a different group of actors\n\nwas observed selling access keys to another large public cloud service for as\n\nlittle as $15 each. These types of services can allow threat actors to use cloud\n\ninfrastructure for their malicious activities under accounts that would otherwise\n\nappear legitimate.\n\nCriminals also offer assistance in penetrating specific cloud-hosted accounts.\n\nOn a platform that connects English and Russian speaking hackers, a user\n\nposted a link to a bypass utility to access personal accounts on a large public\n\ncloud platform. Another offering detailed the steps for exploiting a public cloud\n\nservice’s ID and included a script the hacker was selling on the forum. Another\n\nmarket offering observed in dark and deep web venues is the sale of cloud\n\ncomputing resources. Cloud provider access is sold to those wanting to host\n\nphishing sites, for example. In one case we observed a hacking forum member\n\nexpress their plans to host phishing pages on a public cloud environment that\n\nmimicked a product offered by the cloud provider.\n\nSimilar to legitimate online learning courses, there are multiple tutorials on\n\nhow to use cloud computing credits or stolen credit cards to open accounts on\n\npopular cloud services, to then use them for malicious purposes.\n\n###### Nation state attacks\n\nNation state threat actors have an established record of targeting cloud\n\nenvironments for financial gain and espionage purposes. Threat groups often\n\ntarget cloud environments extensively in an effort to access connected third\nparty systems.\n\nAs more sensitive data moves into cloud environments, we expect espionage\nfocused threat groups to continue targeting cloud environments to achieve their\n\nstrategic intelligence objectives.\n\nCloud Threat Landscape Report 2020 9\n\n\n-----\n\n**Section 3**\n\n##### How threat actors compromise cloud environments\n\nLike any network, cloud environments can be targeted in a variety of ways, some\n\nof which are unique to cloud but many of which affect systems across the board.\n\nThe IBM Security threat intelligence team leveraged X-Force IRIS’s incident\n\nresponse data to find the most common ways we see threat actors targeting\n\ncloud environments. In many cases, threat actors use more than one of\n\nthe following mechanisms to gain, maintain, and spread access, as well as\n\nescalate their access permissions inside the same cloud and on potentially\n\nconnected clouds.\n\n###### Exploitation of cloud applications\n\nThe most common infection vector we observed in cloud environments from\n\nJanuary 2019 to May 2020 was remote exploitation of cloud applications,\n\naccounting for 45 percent of the cloud-related cybersecurity events examined.\n\nWhile agile and scalable, cloud-based applications can open up a broad avenue\n\nfor threat actors. Since these applications are also often necessary for business\n\noperations, they are a key target for threat activity.\n\n\n###### Remote exploitation of cloud environments was the most common infection vector observed, accounting for 45% of\n# 45% cloud-related cybersecurity events we examined.\n\n\nCloud Threat Landscape Report 2020 10\n\n\n-----\n\nOver the past two years, IBM Security has responded to multiple incidents\n\nwhere vulnerable applications were present in the environment but remained\n\nundetected. Sometimes that is due to lack of security maturity in the cloud,\n\nand often it can also be due to “shadow IT,” where an employee goes outside\n\napproved channels to use cloud capabilities, opts to use a vulnerable cloud\n\napplication, and thereby puts the entire environment at risk.\n\nAddressing remote vulnerabilities in cloud environments has been challenging,\n\nin part due to the lack of public cataloging of discovered issues. Until 2020,\n\n[vulnerabilities in cloud products were outside the scope of traditional CVEs,](https://cloudsecurityalliance.org/blog/2018/08/13/cve-cloud-services-part-1/)\n\nmeaning that vulnerabilities related to cloud infrastructure were rarely publicly\n\ndisclosed or recorded over time. As a result, cloud environments may have\n\nbeen more vulnerable than previously realized, harboring a variety of\n\nunaddressed issues.\n\n###### Misconfiguration exploitation\n\n[Based on data from IBM’s 2020 X-Force Threat Intelligence Index, threat](https://www.ibm.com/security/data-breach/threat-intelligence?cm_sp=CTO-_-en-US-_-Z81AVOY7)\n\nactors took advantage of misconfigured cloud servers to siphon over 1 billion\n\nrecords from compromised environments in 2019. Misconfiguration of cloud\n\nenvironments and subsequent data leaks remains one of the greatest sources of\n\nrecord loss across the board and can quickly allow a threat actor to access and\n\nsteal sensitive information from organizations where that sort of oversight may\n\naffect assets in the cloud.\n\n###### >1 billion Threat actors took advantage of misconfigured cloud servers to siphon over 1 billion records from records stolen compromised cloud environments in 2019\n\n IBM X-Force Threat Intelligence Index\n\nCloud Threat Landscape Report 2020 11\n\n\n-----\n\n###### Cross-cloud compromise\n\nThreat actors can sometimes breach cloud environments by infecting one cloud\n\nenvironment, then use the trusted connection to move laterally to other clouds\n\nand infect additional environments.\n\nThis cross-cloud compromise can be especially insidious, as cloud\n\nenvironments, especially large public clouds, often have high volumes of\n\ncommunication and can make this type of infection more difficult to detect.\n\nIn one X-Force IRIS incident response, threat actors were detected when larger\n\nthan normal amounts of data were observed being transferred between clouds\n\nthat were designated for different geographies. This type of attack allowed the\n\nthreat actors to quickly move between large data repositories and cause harm\n\nthroughout the target’s enterprise while evading many detection mechanisms,\n\nhiding their activity in the overall operational activity.\n\n###### Swimming upstream\n\nIn another type of vector, we have observed threat actors attempting to gain\n\nprivileged access to cloud repositories by getting onto the underlying hardware.\n\n[This “swimming upstream” technique requires threat actors to gain initial](https://www.wired.com/story/dark-metal-cloud-computers-invisible-malware/)\n\naccess to the cloud environment, then access the underlying host, then down\n\nto the management system to move between client environments. Swimming\n\nupstream can sometimes mask threat actor activity as legitimate administration,\n\nsince administration often needs to move data between instances as well,\n\nso distinguishing between the two can be complex. This technique was on\n\n[display when the severe Perfect 10.0 vulnerability was disclosed in 2020. That](https://www.forbes.com/sites/zakdoffman/2020/01/30/severe-perfect-100-microsoft-flaw-confirmed-this-is-a-cloud-security-nightmare/#20f11853b4a4)\n\nflaw allowed for a threat actor to break hardware-based isolation in a cloud\n\nenvironment, making them able to intercept code, manipulate programs, and\n\notherwise affect other users’ activities hosted on the same hardware. That flaw\n\n[was since fixed.](https://threatpost.com/critical-microsoft-remote-desktop-flaw-fixed-in-security-update/148982/)\n\nCloud Threat Landscape Report 2020 12\n\n\n-----\n\n**Section 4**\n\n##### How threat actors are using the cloud to cause harm\n\nWhile there are many theoretical techniques to cause harm once in a cloud\n\nenvironment, IBM Security has observed threat actors using a variety of\n\ntraditional attack tactics to profit from this new technology’s increased\n\ncapabilities.\n\nRansomware, data theft, and cryptomining lead the way in harming organizations\n\nwhile leveraging clouds. However, hosting malware and scam sites on cloud\n\nenvironments, or leveraging access to worm into other clouds, has enabled\n\nactors to cause broader damage outside the organization’s own scope,\n\ncompounding the potential risk to connected parties as well.\n\n###### Ransomware\n\nIn X-Force IRIS incident response cases we analyzed from 2019 and 2020,\n\nransomware was by far the most common type of malware deployed in the\n\ncloud, representing three times as many incidents as any other malware.\n\n###### Ransomware was used 3x\n\n as much as any other malware deployed in the cloud, based on IBM incident response cases studied.\n\nCloud Threat Landscape Report 2020 13\n\n\n-----\n\nUnlike ransomware attacks on traditional networked endpoints, ransomware in\n\nthe cloud can have a more disruptive impact and cause greater data loss. That\n\ncan be due to the wider range of operations supported by cloud environments,\n\ntheir potential impact on critical applications, and the sheer amount of data\n\nmoving through clouds every day.\n\nIn a ransomware incident to which X-Force IRIS responded, the infection\n\nresulted from a gap in cloud administration responsibilities between the\n\ninfrastructure provider and their client. That gap potentially allowed the\n\ncompromise to go undetected longer, increasing the cost to the organization,\n\nand highlighting the criticality of defining cloud security roles for both the\n\nprovider and the client.\n\n###### Data theft\n\nCloud environments host large troves of information, and this data can be stolen\n\nby threat actors and sold on underground marketplaces. From incidents that\n\nIBM X-Force IRIS has handled, we’ve seen that the types of data stolen can\n\nvary. For example, we observed threat actors stealing sensitive PII, including\n\ncredit card numbers, from a breach of cloud data. In a different incident,\n\nwe observed threat actors potentially stealing client-related emails from a\n\ncompromised cloud.\n\n###### Data theft was the second most common threat activity IBM X-Force observed in breached cloud\n environments in 2019.\n\nThe type of data stolen can vary based on threat actor motivations and\n\nsophistication, but in cloud environments, the amount of data available can be\n\nmuch greater, making the potential impact of a breach that much more damaging\n\nto the organization.\n\nCloud Threat Landscape Report 2020 14\n\n\n-----\n\n###### Cryptomining\n\nWhen it comes to illicit cryptomining threats, especially those leveraging scaled\n\ninfrastructure like clouds, IBM X-Force IRIS has seen multiple instances of\n\nthreat actors using cloud environments to mine for cryptocurrency over the\n\nlast year.\n\nIn one case in 2019, X-Force IRIS responded to an incident where a cloud server\n\nwas infected with a cryptominer that subsequently attempted to spread laterally\n\nto connected machines. This sort of compromise can have a few impacts: for on\nprem cloud environments, the organization can incur increased electricity costs\n\nand faster degradation of hardware components as well as performance impact\n\nthat can be rather meaningful in industries like the financial sector.\n\nWith external/public clouds, the organization could face increased charges due\n\nto higher data usage or slower response times as processing power is reduced.\n\nIn all cases, cryptomining is a drain on organizational resources and can hinder\n\nbusiness operations.\n\n###### Hosting malware or malicious sites\n\nThreat actors can use infected cloud environments to host malware that can\n\nsubsequently spread onto other environments. For example, in late 2019,\n\n[criminals were hosting a payment card skimmer on a cloud platform, which](https://arstechnica.com/information-technology/2019/12/crooks-host-payment-card-skimming-malware-on-heroku-cloud-platform/)\n\nwas subsequently downloaded onto targeted machines. In another case, threat\n\n[actors hosted over 200 tech support scam sites on one cloud instance, directing](https://www.scmagazine.com/home/security-news/malware/cyber-criminals-are-storing-malicious-content-including-malware-and-c2-servers-on-microsofts-azure-cloud-services/)\n\nusers to these sites and using the cloud environment to lend their attack an\n\nair of legitimacy.\n\nHosting malware or malicious sites on cloud environments can help threat actors\n\navoid network blocks by appearing as callouts to legitimate infrastructure.\n\nAlso, the use of cloud hosting can provide threat actors with a layer of\n\nabstraction, making campaign activity more difficult to track. If an organization\n\nis unknowingly hosting malware on its cloud, especially for extended periods of\n\ntime, this can lead to both direct and reputational harm as the organization may\n\nlose data itself and also be accused of allowing this activity to persist.\n\nCloud Threat Landscape Report 2020 15\n\n\n-----\n\n###### DNS compromise\n\nIBM X-Force IRIS observed multiple incidents in which threat actors\n\ncompromised cloud-hosted DNS services to redirect employees to\n\ndifferent sites.\n\nPlaying on the DNS cache poisoning concept, this insidious attack method\n\nleverages existing cloud access to cause further harm to an organization and\n\ncan be difficult for users to detect. This type of compromise can redirect users\n\nto sites that attempt to exploit their browsers and drop a malicious payload\n\nonto endpoint machines, or it could redirect them to phishing sites to steal their\n\nnetwork credentials. In some cases, redirection to advertisements, or click\nfraud, is set up to line the pockets of criminals.\n\nWhile DNS compromise is not a new attack, as organizations continue to shift\n\nthese services to an external cloud provider, threat actors can find new\n\navenues for potential compromise, and the impact could expand throughout\n\nthe organization.\n\n###### Lateral spread\n\nThreat actors have used a variety of methods to expand from an initial infection\n\ninto other parts of the cloud environment or on to endpoint boxes that access\n\ncloud resources. In 2019, IBM X-Force IRIS responded to an incident in\n\nwhich malware deployed to a cloud environment attempted to spread to other\n\nmachines via SSH bruteforcing, affecting external local machines accessing\n\nthe cloud.\n\nAlso in 2019, the Exim worm, a Linux worm spreading via Exim servers, was\n\n[reportedly spreading infection automatically via remote exploitation of CVE](https://www.zdnet.com/article/microsoft-warns-azure-customers-of-exim-worm/)\n\n2019-10149. The worm would take over a server with the goal of dropping a\n\ncryptojacking malware onto it.\n\nThis type of lateral spread can compound the impact of a cloud infection and\n\nbring it into an organization’s internal network space.\n\nCloud Threat Landscape Report 2020 16\n\n\n-----\n\n**Section 5**\n\n##### Cloud-native malware and its evolution\n\nMany cloud-based systems run the same operating systems and applications\n\nas their on-premise counterparts, and as a result, much of the malware found\n\noperating in cloud environments is the same as that found outside of the cloud.\n\nHowever, there are instances of malware which are specifically designed to\n\neither target or make use of cloud systems.\n\n###### These malware variants fall into three groups:\n\n — Malware that uses clouds to scale\n\n — Malware adapting to cloud environments\n\n — Malware using cloud environments for operational infrastructure\n\n Malware that uses clouds to scale\n\nBy targeting cloud applications or platforms specifically, malware operators\n\ncan quickly ramp up operations and potentially gain significant profits with\n\na single compromise. One example of a malware family adapting to the new\n\ncloud reality is DemonBot, a Linux-based bot which was reported in October\n\n2018. DemonBot targets cloud servers running Hadoop and infects them via a\n\nvulnerability in Hadoop’s resource management tool.\n\nCloud Threat Landscape Report 2020 17\n\n\n-----\n\nX-Force IRIS investigated an instance of DemonBot found in a cloud\n\nenvironment which was detected by the affected organization due to a\n\nsignificant increase in billing and resource usage. In that case, the DemonBot\n\nbinaries’ primary function was to launch distributed denial of service (DDoS)\n\nattacks as part of a botnet. With the addition of cloud-targeting capability,\n\nmalware operators are able to amplify these attacks using cloud resources.\n\nAnother malware family that has found use in organizations’ cloud adoption is\n\n[Graboid, a cryptomining worm identified in October 2019. This malware targeted](https://threatpost.com/docker-containers-graboid-crypto-worm/149235/)\n\nand compromised unsecured Docker hosts, onto which it downloaded malicious\n\nDocker containers. The malicious containers performed cryptomining and also\n\nspread the malware to other hosts.\n\nIn June 2019, researchers reported on an attack campaign which also targeted\n\nmisconfigured Docker hosts in order to infiltrate them. In this case, it was a\n\n[Linux botnet malware known as AESDDoS that exploited API misconfigurations](https://www.scmagazine.com/home/security-news/cybercrime/trendmicro-researchers-have-discovered-in-the-wild-a-botnet-malware-that-infiltrates-containers-via-exposed-docker-apis/)\n\nto deploy the malware on vulnerable containers. This malware was then able\n\nto receive commands from a command control server and launch a variety of\n\nDDoS attacks.\n\n###### Malware adapting to cloud environments\n\n[During the last two years, researchers at Intezer have observed a significant](https://intezer.com/)\n\nincrease in the number of cyber-attacks targeting Linux servers, mostly in cloud\n\nenvironments. The Linux operating system accounts for nearly 90 percent of all\n\ncloud servers.\n\nOne example of a threat actor that uses malware to target clouds is the\n\nChinese-affiliated Pacha Group. This group has been targeting cloud-based\n\ninfrastructures with new, previously undetected malware variants of Linux.\n\nGreedyAntd, which shares significant amounts of code with previous variants.\n\nAnother malware targeting Linux-based file storage systems (NAS servers) in\n\n[cloud environments is the QNAPCrypt ransomware. This sort of threat can affect](https://intezer.com/blog/ransomware/russian-cybercrime-group-fullofdeep-behind-qnapcrypt-ransomware-campaigns/)\n\na very large user base and affect damage on troves of data hosted in the cloud.\n\nAs cloud environments continue to increase in popularity, Linux-focused\n\nmalware is likely to continue to grow.\n\nCloud Threat Landscape Report 2020 18\n\n\n-----\n\n###### Malware using cloud environments for operational infrastructure\n\nJust as organizations scale up operations, malware distributors, especially\n\nthose linked with organized crime and nation state attacks, can opt to scale their\n\noperations as well. X-Force IRIS has observed threat actors leveraging cloud\n\nenvironments for their malware operations in a variety of ways.\n\n[One investigation of RokRat, a remote access tool (RAT) observed to target](https://attack.mitre.org/software/S0240/)\n\nvictims in South Korea and attributed to ITG10 (AKA APT37, Scarcruft), used\n\nlegitimate, commercial cloud storage services for hosting payloads and C2\n\ncommunications. This use of cloud services for infrastructure can be difficult to\n\ndetect, as organizations’ networks can have significant cloud communication as\n\npart of normal operations and whitelist legitimate providers. By hosting malware\n\nin that sort of a cloud environment, detection of malicious payload downloads\n\ncan also be more challenging.\n\n[Much like RokRat, Karae is another backdoor attributed to ITG10, which is also](https://attack.mitre.org/software/S0215/)\n\nknown to use cloud storage providers for C2 communications. In Karae samples\n\nanalyzed by X-Force IRIS, a legitimate cloud storage service provider was used\n\nby the threat actors to host the malware, with account credentials hardcoded\n\ninto the malware’s binaries. Karae gathers information about the victim’s system\n\nand writes it to a file, which it then uploads to the cloud. It also attempts to\n\ndownload and execute additional binaries from this service.\n\nThis tactic overall presents a detection problem because it can blend in with\n\nnormal and legitimate user activity, and it’s also the reason that malware\n\noperators of varying motivations opt to use it.\n\nCloud Threat Landscape Report 2020 19\n\n\n-----\n\n**Section 6**\n\n##### Recommendations to enhance your cloud security\n\nResponding to a security incident in a cloud environment requires some special\n\nconsiderations outside of the usual method of incident response. From X-Force\n\nIRIS’s extensive experience in this field, we’ve compiled some key lessons we’ve\n\nlearned while preparing for, and responding to, cloud incidents.\n\n###### Preparing a safer cloud environment\n\n**_Begin with the end in mind_**\n\nBefore considering moving workloads or data to the cloud, develop a plan as to\n\nits purpose. Build security controls into the conception process and take into the\n\naccount the criticality and sensitivity of operations running in the cloud. Consider\n\n[using a partner that provides comprehensive security services to help you gain](https://www.ibm.com/security/services/managed-security-services/x-force-cloud-services?cm_sp=CTO-_-en-US-_-Z81AVOY7)\n\nvisibility and control of all aspects of your hybrid cloud security as you develop\n\nyour program.\n\n**_Use proactive simulation_**\n\nSimulate both expected and unexpected security events within your cloud\n\nenvironment to understand the effectiveness of your preparation. This\n\npreparation can provide an opportunity to exercise internal playbooks and\n\nstandard operating procedures. By focusing on testing and improving both\n\ntechnical and operational response skills, organizations can move quickly to\n\nremedy issues before damage is done or expands. Furthermore, these exercises\n\ncan be augmented with tactical information, such as indicators of compromise\n\n(IOCs), to support a threat intelligence-driven response scenario.\n\nCloud Threat Landscape Report 2020 20\n\n\n-----\n\n**_Prevent policy “dead spots”_**\n\nWith external clouds, the responsibility for protecting cloud environments often\n\nfalls on both the organization and the cloud hosting provider. Cloud hosting is\n\nrarely a set-and-forget service, and requires security both on the part of cloud\n\nservice providers and the organization using the service. Delineating the role for\n\neach party at the time of negotiating the contract can help define responsibility,\n\ncontrols, monitoring, and potential liability before an incident. This can help\n\nprevent incidents resulting from policy gaps, as well as allow for more efficient\n\ndetection and incident response.\n\n**_Apply best practices to cloud security_**\n\nCloud security does have its own approaches, but they also resemble the\n\nsecurity of other networks in some respects. Organizations therefore need\n\nto apply security best practices to their cloud environments, as clouds are\n\nnot immune to compromise. To mitigate the threat of unauthorized access,\n\nimplementing multifactor authentication can help prevent infiltration using\n\nstolen credentials.\n\nPrivileged account management (PAM) is another important concept in\n\nkeeping clouds better protected. Restrict accounts to least-required\n\nprivileges to minimize harm from account compromise and consider using\n\n[the zero-trust model. By implementing these practices in cloud environments,](https://www.ibm.com/security/zero-trust?cm_sp=CTO-_-en-US-_-Z81AVOY7)\n\norganizations can mitigate the risks of incidents or reduce the impact of\n\npotential security events.\n\n**_Monitor and log_**\n\nCloud environments need to be monitored for a variety of matters. From\n\ncloud-sprawl to third party access and unexpected outages, proper monitoring\n\ncan help detect malware and the first sign of an attack. Cloud users should\n\nmaintain robust logging of events in cloud environment for forensic investigation\n\nof malicious activity. The responsibility of monitoring and logging of cloud events\n\nshould be decided by the organization and the cloud hosting provider prior to\n\nstarting services to prevent policy dead spots.\n\nCloud Threat Landscape Report 2020 21\n\n\n-----\n\n**_Use threat intelligence to monitor threats_**\n\nThreat actors continue to evolve and augment their existing arsenal of tactics,\n\ntechniques, and procedures with new capabilities specifically to target cloud\n\nenvironments. As these capabilities continue to develop, organizations should\n\nleverage threat intelligence to monitor changes in targeting and implement\n\neffective defenses.\n\n###### Responding to cloud security incidents effectively\n\n**_Don’t reimage, redeploy instead_**\n\nWhen organizations terminate their cloud instances, they lose potentially\n\nvaluable forensic artifacts. Instead of immediately destroying this data, isolating\n\naffected systems and standing up known clean images could allow forensic\n\ninvestigators to analyze the infected instance and potentially find additional\n\nleads to understand what went wrong and how to prevent it in the future.\n\nIn the case of an incident, build a workstation in the cloud for your investigators\n\nto perform the work on, then create an image from the compromised servers\n\nand collect volatile memory data. Also, doing root cause forensic analysis can\n\nprevent IT administrators from redeploying a tainted base image.\n\n**_Remember bandwidth costs_**\n\nOne challenge organizations face nowadays is that downloading a large server\n\nimage after an incident may be cost prohibitive due to the high bandwidth costs\n\nassociated with moving data out of the cloud environment. Having relevant\n\npolicies or requirements in place prior to an incident can help reduce the cost of\n\ndownload, especially when an infection could potentially harm other instances\n\non the same cloud.\n\nCloud Threat Landscape Report 2020 22\n\n\n-----\n\n**_Have the right investigative tools_**\n\nCloud security requires the right tools to conduct a thorough investigation if\n\nsomething goes wrong. Many common incident response and forensic tools are\n\nonly effective in a local environment or an on-premise hosted servers and are\n\nnot equipped for a cloud environment. However, preparing the right toolkit can\n\nenable effective cloud investigations.\n\nMoreover, organizations should include cloud assets in their overall incident\n\nresponse plans and test their cloud security incident response at a tactical level\n\n[to ensure that the tools they have are capable of working across all the cloud](https://www.ibm.com/products/cloud-pak-for-security?cm_sp=CTO-_-en-US-_-Z81AVOY7)\n\n[environments they use.](https://www.ibm.com/products/cloud-pak-for-security?cm_sp=CTO-_-en-US-_-Z81AVOY7)\n\n**_Automate incident response_**\n\nImplementing effective security automation in cloud environments can improve\n\ndetection and response capabilities, rather than relying on manually reacting to\n\nevents. For example, by following the Infrastructure as Code (IaC) approach and\n\nusing tools such as CloudFormation, declarative approach, and the serverless,\n\nevent-driven Lambda services, a compromised organization can efficiently\n\nrebuild the environment from a predefined template. This methodology can lead\n\nto accelerated recovery during ransomware or destructive cyber-attacks against\n\nthat environment.\n\nCloud Threat Landscape Report 2020 23\n\n\n-----\n\n##### Conclusion\n\nFor those who contract their infrastructure from a vendor, cloud security is a\n\njoint effort by both the provider and the user of cloud services. Organizations\n\nthat operate in the cloud must be aware of the threats to cloud environments\n\nin order to properly secure their data and services.\n\nIBM X-Force research indicates that threat actors are also keenly aware of\n\norganizations shifting to cloud infrastructure and are evolving accordingly. With\n\nthe cost of cloud breaches only continuing to grow, organizations need to take\n\nsteps to protect their cloud-based assets. By being proactive and taking the\n\nrecommended steps, organizations can better protect themselves as they\n\nmove into a cloud-based world.\n\n###### About IBM X-Force\n\nIBM X-Force studies and monitors the latest threat trends, advising customers\n\nand the general public about emerging and critical threats, and delivering\n\nsecurity content to help protect IBM customers. From infrastructure, data and\n\napplication protection to cloud and managed security services, IBM Security\n\nServices has the expertise to help safeguard your critical assets. IBM Security\n\nprotects some of the most sophisticated networks in the world and employs\n\nsome of the best minds in the business.\n\n\n###### Learn about IBM X-Force IRIS\n\n\nCloud Threat Landscape Report 2020 24\n\n\n-----\n\n##### Endnotes\n\n1. Methodology Caveat: The statistics cited in this paper used a subset of\n\nX-Force IRIS’s incident response reports between June 2018 and March\n\n2020; this limitation was required due to a variety of reasons including\n\nprivacy concerns. As a result, the statistics contained herein, while reflective\n\nof broader trends observed in cloud security during this timeframe, may be\n\naffected by a degree of collection bias.\n\nCloud Threat Landscape Report 2020 25\n\n\n-----\n\n**Contributed research**\n\nIntezer\nDarkOwl\n\n© Copyright IBM Corporation 2020\n\nIBM Security\nNew Orchard Rd\nArmonk, NY 10504\n\nProduced in the United States of America\nMay 2020\n\nIBM, the IBM logo, ibm.com, and X-Force are trademarks of\nInternational Business Machines Corp., registered in many\njurisdictions worldwide. Other product and service names might\nbe trademarks of IBM or other companies. A current list of IBM\ntrademarks is available on the web at “Copyright and trademark\n[information” at ibm.com/legal/copytrade.html.](http://ibm.com/legal/copytrade.html)\n\nThis document is current as of the initial date of publication and may\nbe changed by IBM at any time. Not all offerings are available in\nevery country in which IBM operates. THE INFORMATION IN THIS\nDOCUMENT IS PROVIDED “AS IS” WITHOUT ANY WARRANTY,\nEXPRESS OR IMPLIED, INCLUDING WITHOUT ANY WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE\nAND ANY WARRANTY OR CONDITION OF NON-INFRINGEMENT.\nIBM products are warranted according to the terms and conditions\nof the agreements under which they are provided.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-16 - Cloud Threat Landscape Report 2020,pdf.pdf"
    ],
    "report_names": [
        "2020-06-16 - Cloud Threat Landscape Report 2020,pdf.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "484c5fed-029e-4504-b75a-bbdbc9460595",
            "created_at": "2022-10-25T16:07:24.529893Z",
            "updated_at": "2025-03-27T02:02:10.273182Z",
            "deleted_at": null,
            "main_name": "Pacha Group",
            "aliases": [],
            "source_name": "ETDA:Pacha Group",
            "tools": [
                "Antd",
                "DDG",
                "GreedyAntd",
                "Korkerds",
                "XMRig"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "18bcbaa6-8e7b-43c4-9db7-8b0b315ee5a3",
            "created_at": "2023-01-06T13:46:39.024086Z",
            "updated_at": "2025-03-27T02:00:02.980081Z",
            "deleted_at": null,
            "main_name": "Pacha Group",
            "aliases": [],
            "source_name": "MISPGALAXY:Pacha Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536192,
    "ts_updated_at": 1743041797,
    "ts_creation_date": 1591278325,
    "ts_modification_date": 1591292096,
    "files": {
        "pdf": "https://archive.orkl.eu/91e112ee74b84d72fe2bf4b5b522cd72e975abf7.pdf",
        "text": "https://archive.orkl.eu/91e112ee74b84d72fe2bf4b5b522cd72e975abf7.txt",
        "img": "https://archive.orkl.eu/91e112ee74b84d72fe2bf4b5b522cd72e975abf7.jpg"
    }
}