{
    "id": "0e7c1c63-a2d6-4111-b4d5-0ac113a3748f",
    "created_at": "2023-01-12T15:01:45.771479Z",
    "updated_at": "2025-03-27T02:17:02.103871Z",
    "deleted_at": null,
    "sha1_hash": "dae28096e279d7a1c19993385ea65562ccebd64f",
    "title": "2022-09-06 - Pro-Russian Group Targeting Ukraine Supporters with DDoS Attacks",
    "authors": "",
    "file_creation_date": "2022-09-12T12:02:01Z",
    "file_modification_date": "2022-09-12T12:02:01Z",
    "file_size": 3386665,
    "plain_text": "# Pro-Russian Group Targeting Ukraine Supporters with DDoS Attacks\n\n**decoded.avast.io/martinchlumecky/bobik/**\n\nSeptember 6, 2022\n\nby [Martin ChlumeckýSeptember 6, 202226 min read](https://decoded.avast.io/author/martinchlumecky/)\n\nIt has now been six months since the war in Ukraine began. Since then, pro-Russian and pro-Ukrainian\nhacker groups, like KillNet, Anonymous, IT Army of Ukraine, Legion Spetsnaz RF, have carried out\ncyberattacks. A lesser-known group called NoName057(16) is among the pro-Russian groups attacking\nUkraine and the countries surrounding it and siding with Ukraine.\n\n_NoName057(16) is performing DDoS attacks on websites belonging to governments, news agencies, armies,_\nsuppliers, telecommunications companies, transportation authorities, financial institutions, and more in\nUkraine and neighboring countries supporting Ukraine, like Ukraine itself, Estonia, Lithuania, Norway, and\nPoland. A full list of the group’s targets can be found at the end of this post.\n\nTo carry out DDoS attacks, hacker groups utilize botnets. They control them via C&C servers, sending\ncommands to individual bots, which essentially act as soldiers. Uncovering and tracking botnets is complex\nand time-consuming.\n\nWe got our hands on malware called Bobik. Bobik is not new, it’s been around since 2020, and is known as a\nRemote Access Trojan. Things have, however, recently changed. Devices infected with Bobik are now part of\na botnet, and carrying out DDoS attacks for NoName057(16). We can confidently attribute the attacks to the\ngroup, as we have analyzed and compared what the C&C server is instructing devices infected with Bobik to\ndo with the attacks the group claims to be responsible for on their Telegram channel.\n\n**Toolset**\n\nThe bots used by the botnet are infected with malware called Bobik, which is written in .NET. The malware\nhas not been tied to a certain group in the past, and is actually a Remote Access Trojan. Its spyware\nfunctionalities include keylogging, running and terminating processes, collecting system information,\ndownloading/uploading files, and dropping further malware onto infected devices.\n\nKill Chain\n\nIn the wild, one of the most monitored droppers for Bobik is RedLine Stealer, a botnet-as-a-service\ncybercriminals can pay for to spread their malware of choice. The usual workflow of Bobik is illustrated in the\nimage below.\n\nAt first, an unknown group seems to have purchased RedLine Stealer to deploy – Bobik. The final DDoS\nmodule deployment is composed of two basic stages. The first executes Bobik’s Updater via a RedLine\n_Stealer bot. In the second stage, Bobik’s Updater extracts and drops the final DDoS module (Bobik’s_\n\n\n-----\n\n_RuntimeBroker) and ensures the module s persistence._\n\n_Bobik_\n\n_deployment_\nWhen RuntimeBroker is run, the module contacts a C&C server and downloads a configuration file defining\ntargets for DDoS attacks. The module then starts the attacks using a defined count of threads, usually five\nthreads.\n\nThe detailed workflow of the Bobik deployment is shown below. The RedLine Stealer Cryptic (installer)\ndeobfuscates the .NET payload of Bobik’s Updater and injects it into the newly created process of the .NET\n_ClickOnce Launch Utility ( AppLaunch.exe ); see steps 1 – 5._\n\n\n-----\n\n_Bobik_\n\n_deployment using RedLine Stealer Cryptic_\nThe same process is used to execute Bobik’s RuntimeBroker (the DDoS module), because the dropped\n_RuntimeBroker is also packaged and obfuscated via RedLine Stealer Cryptic. Therefore, the dropped Bobik’s_\n_RuntimeBroker also deobfuscates the .NET payload of Bobik’s RuntimeBroker and injects it into another_\n```\nAppLaunch process; see steps 6 – 8. After all these steps, the Bobik’s DDoS module is deployed, persistent,\n\n```\nand ready to attack.\n\n**C&C Servers and Communication**\n\nSince June 1, 2022, we have observed Bobik’s network activities. Bobik bots communicate with C&C servers\nlocated in Russia and Romania. These two servers are already offline. However, another Romanian server is\nstill active and able to send commands to the bots.\n\n\n-----\n\nC&C Servers\n\nSince tracking the botnet activity, we have captured three production C&C servers controlling Bobik bots and\n[one development server. The servers run on OS Ubuntu with Nginx (v 1.18.0). RiskIQ reports all servers as](https://www.riskiq.com/)\nmalicious with self-signed certificates and servers with bad reputations that previously hosted many\nsuspicious services.\n\n**Server 1**\n\nThe last active server is `2.57.122.243, located in Romania, and its first Bobik’s activity we saw was on`\nJune 13, 2022. We also have two DNS records for this malicious server:\n```\nv9agm8uwtjmz.sytes.net and q7zemy6zc7ptaeks.servehttp.com .\n\n```\n**Server 2**\n\nThe second server `2.57.122.82 is also in Romania, but the communication with the Bobik bots was`\ndeactivated around July 14, 2022. The server is still active. Nevertheless, the server responds with a `502`\n```\nHTTP code (Bad Gateway). Based on the findings from Server 1, this server used the same\nv9agm8uwtjmz.sytes.net DNS record, which was reconfigured to Server 1 in the middle of June.\n\n```\n**Server 3**\n\nThe first Bobik’s C&C server we saw was `77.232.41.206 in Russia. The server had opened ports` `80 and`\n```\n443 until June 9, 2022. It is not usable, and therefore de facto offline, by Bobik bots because there is only\n\n```\none opened port for OpenSSH since Bobik requires port `80 for its C&C communication.`\n\n**Dev Server**\n\nOne of the C&C servers is a suspected development server at `109.107.181.130, listening on port` `5001 .`\nThe server has been active since April and is located in Russia; its reputation is also suspicious. Avast has\nnot detected any hits for this server in the wild. However, one Python sample uses the server as a testing\nenvironment.\n\nC&C Communication\n\nThe communication between Bobik bots and the C&C servers is mediated using a simple unsecured HTTP\nrequest and response via the Nginx web server. The bots obtain appropriate commands from the C&Cs\nutilizing a URL, see the diagram below.\n\n_HTTP communication_\n**Request**\n\nThe request URL uses the following template:\n\n```\nhttp://[ip]/[request]/update?id=[sha256]&v=[version]&pr=[flag]\n\n```\n```\nip : Bobik bots hardcode one of the C&C IPs or one of the DNS records, see Section C&C Servers.\nrequest : defines the purpose of the communications; we registered three types of requests in the form of a\n\n```\nGUID.\n\n– notice: the bots report their states.\n\n– admin: this request can open the admin console of the Nginx web server\n\n\n-----\n\ndropper: is a path to a malicious executable representing Bobik s RuntimeBroker followed by an exe file\nname.\n\nThe exact GUIDs are listed in Appendix.\n```\nid : the hash is computed from Windows Management Instrumentation (WMI) information about a victim’s\n\n```\nmachine like `Win32_DiskDrive,` `Win32_Processor,` `Win32_BaseBoard, etc. The hash can provide a`\nunique identifier for Bobik bots.\n```\nv : the Bobik version; Avast has captured sample versions ranging from 8 to 19.\npr : is a flag (0,1) representing whether the communication with C&C has timed out at least once.\n\n```\nA body of the HTTP request contains one simple XML tag with information about the victim; for instance:\n\n```\n<client a0=\"1\" a1=\"en-US\" a2=\"en-US\" a3=\"14:03:53\" a4=\"600\">; where\n\n```\n```\n   a0 : ProductType (1: Workstation, 2: Domain Controller, 3: Server)\n   a1 : CultureInfo.InstalledUICulture\n   a2 : CultureInfo.CurrentUICulture\n   a3 : DateTime.Now\n   a4: Default timeout for the update of the DDoS target list from the C&C server\n\n```\nSee the examples of the notice URLs:\n```\n   http://2.57.122.82/d380f816-7412-400a-9b64-78e35dd51f6e/update?\n   id=AEF97F87751C863548359181B65B60EE86A7D44724040229CDE4622C99AB0B59&v=17&pr=1\n   http://2.57.122.82/d380f816-7412-400a-9b64-78e35dd51f6e/update?\n   id=67F5318073F09F03E762BF727015384589F00282EA26B1798C10581B8DC27F52&v=16&pr=1\n   http://v9agm8uwtjmz.sytes.net/d380f816-7412-400a-9b64-78e35dd51f6e/update?\n   id=B5B72AEBEC4E2E9EE0DAC37AC77EBFB679B6EC6D7EE030062ED9064282F404A7&v=18&pr=1\n   http://q7zemy6zc7ptaeks.servehttp.com/d380f816-7412-400a-9b64-78e35dd51f6e/update?\n   id=BADFD914A37A1FF9D2CBE8C0DBD4C30A9A183E5DF85FCAE4C67851369C2BAF87&v=18&pr=1\n\n```\n**Response**\n\nThe body of the HTTP response contains an encrypted and gzipped XML file configuring bots to the defined\nDDoS attacks. See the example below:\n\nThe bot receives the encrypted data that is decrypted using a simple algorithm, as shown below. The full\n[script is located in the IOC repository.](https://github.com/avast/ioc/tree/master/Bobik/decryptor.py)\n\n\n-----\n\n_HTTP response decryptor_\n\nThe encrypted XML file has an elementary structure, as shown below:\n\n_Decrypted XML config_\nMost of the XML attributes are intuitive, so we will just explain the compound brackets in the path and body\nattributes. The configuration often uses dynamically generated pieces (definitions) like this: `{.,15,20} . The`\ndefinition dictates what long random text should be generated and in which position.\n\nThe definitions are abundantly applied in the path or body of the HTTP requests, where the attackers expect\nan increased load on the server. The effect is that bots flood servers with meaningless requests. For instance,\nthe first `<task> in the image directly above (decrypted XML config) uses this definition:` `query={.,15,20}`\nwhich means that the bots generate random texts of 15 – 20 characters long as requests to, for example, the\ncalendar of Poland’s presidential office. Similarly, the second `<task> flooded the reference system of bus`\nlines in Ukraine with requests for a password reset, as illustrated in this definition `email=`\n```\n{.,5,15}%40gmail.com .\n\n```\nFor the most part, we captured definitions sending data to login pages, password recovery sites, and site\nsearches; as can be seen from the XML config snippet below:\n\n\n-----\n\nLogin data\n\n```\n<task\n\n```\n```\nhost=\"identity.tele2.lt\"\npath=\"/Account/Login\"\nbody=\"SkipAutoLogin=False&amp;Username={.,15,20}%40gmail.com&amp;Password=\n{.,15,20}&amp\"\n/>\n\n```\nSearch requests\n\n```\n<task\n\n```\n```\npath=\"/otsing?search=\n{.,3,12}&amp;domain=kinoveeb.delfi.ee&amp;categoryId&amp;order=PUBLISH_AT&amp;from=201208-22T{d,2,2}%3A{d,2,2}%3A{d,2,2}Z&amp;to=2022-08-22T20%3A59%3A59Z\"\n/>\n\n```\nPassword recovery request\n\n```\n<task\n\n```\n```\nhost=\"client.smscredit.lv\"\npath=\"/password-recovery\"\nbody=\"utf8=%E2%9C%93&amp;authenticity_token={.87,87}A%3D%3D&amp;user%5Bemail%5D=\n{.,15,20}%40gmail.com&amp;g-recaptcha-response=03ANYolqu{.,539,539}\"\n\n```\n```\n/>\n\n```\n\nConsequently, the attackers try to overload a server with these requests, as they are computationally\nintensive. The requests require many accesses to server databases, e.g., verifying emails for password\nresetting, trying to login with random data (definitions), etc.\n\n**Bobik Botnet**\n\nThe Avast telemetry data cannot paint a precise picture of the botnet’s size, but we can estimate the\napproximate representation of Bobik in the wild, see map below. The map shows where, according to Avast’s\ntelemetry, the bots that attempt to carry out DDoS attacks for NoName057(16) are located. Avast has\nprotected these devices from Bobik or from connecting to the C&C server. Most of the bots are located in\nBrazil, India, and Southeast Asia.\n\n\n-----\n\n_Distribution of users Avast protected from Bobik_\nAccording to our data, the number of Bobik bots is a few hundred. However, the total number must be much\nlarger considering the DDoS attacks’ acute effectiveness and frequency. We, therefore, estimate there are\nthousands of Bobik bots in the wild.\n\n**Selection of DDoS Targets**\n\nWe estimated a procedure as to how the attackers determine which web servers to DDoS attack because we\nhave configurations of unsuccessful attacks.\n\nThe first step is looking for a target that supports Ukraine or a target with anti-Russian views. The attackers\nanalyze the structure of the target’s website and identify pages that can cause server overloading, especially\nrequests requiring higher computing time, such as searching, password resetting, login, etc.\n\nThe second step is filling in the XML template, encrypting it, and deploying it to the C&C servers. The\nattackers monitor the condition of the target server and modify the XML configuration based on needs\n(modification of URL parameters, bodies, etc.) to be more effective. The configuration is changed\napproximately three times per day.\n\nSuppose the configuration is successful and a targeted server is in trouble. In that case, the configuration is\nfixed until the web server crashes or a server admins implement anti-DDoS technique or firewall rules based\non GeoIP.\n\nIf the attack is unsuccessful, a new target is selected, and the whole procedure of selection is repeated.\n\n**Targets**\n\n\n-----\n\nIn the first phase, the attackers targeted Ukrainian news servers they defined as being against the war in\nUkraine. Then, the attacks targeted websites belonging to Ukrainian cities, local governments, distribution of\nelectrical power, Ukrainian companies supplying the Ukraine army with weapons, railway, bus, companies,\nand postal offices.\n\nThe second phase targeted organizations publicly supporting Ukraine financially or materially, like Ukraine\nbanks and financial institutions, and operators of local Ukraine gas reservoirs that publicly declared help for\nthe defenders of Ukraine.\n\nAs the political situation around the war changed, so did the targets of the DDoS attacks. Bobik performed\nDDoS attacks on GKN Aerospace, which is the supplier of the Northrop Grumman Corporation because the\nUS Defense Department convened a meeting with America’s eight prime defense contractors (including\n[Northrop Grumman Corporation) to ensure long-term readiness to meet “Ukraine’s weapons needs”.](https://www.aa.com.tr/en/americas/us-to-convene-meeting-with-8-defense-contractors-on-ukraine/2562185)\n\n[Another global company under attack was Group 4 Securitas (G4S), which published a document assessing](https://www.g4s.com/en-gb/-/media/g4s/unitedkingdom/files/conflict_in_ukraine_march_22_v4.ashx)\nand exploring key elements of the conflict in Ukraine. In terms of telecommunications companies, we\n[observed an attack on American telco company Verizon, which declared a waiver of call charges to and from](https://www.wsj.com/livecoverage/russia-ukraine-latest-news/card/verizon-waives-calling-charges-to-and-from-ukraine-cvVIf5gJouWlK3OUEGI1)\nUkraine. And so, we could continue listing companies that were under Bobik attacks due to their support for\nUkraine. You can see a few screenshots from affected websites below.\n\n_Screenshots of websites supporting Ukraine_\nOther attacks were more politically motivated based on government declarations of a given country. Baltic\nstates (Lithuania, Latvia, and Estonia) were the significant targets, outside Ukraine, of DDoS attacks carried\nout by the group. Let’s summarize targets outside of Ukraine, chronologically, since we started monitoring\n_Bobik._\n\n**[June 7, 2022: Significant DDoS attack on Estonia central bank; see Twitter.](https://twitter.com/EestiPank/status/1534071747208691712)**\n\n\n-----\n\n**June 18, 2022:** _Bobik configuration changed to target Lithuanian transportation companies, local_\nrailway, and bus transportation companies after Lithuanian authorities announced a ban on transit\n[through their territory to the Russian exclave of Kaliningrad of goods that are subject to EU sanctions.](https://www.reuters.com/world/europe/lithuania-says-sanctions-goods-kaliningrad-take-effect-saturday-2022-06-18)\nThe attackers also targeted financial sectors in Lithuania, like UAB General Financing, Unija Litas, and\nmore.\n**July 1, 2022: Goods were** [stopped by Norwegian authorities destined for the roughly 400 miners in the](https://www.themoscowtimes.com/2022/07/06/norway-greenlights-blocked-goods-for-russian-arctic-miners-a78225)\ntown of Barentsburg employed by the Russian state coal mining company Arktikugol. NoName057(16)’s\nDDoS attacks focused on Norwegian websites as retaliation for the blockade. The main targets were\ntransportation companies (Kystverket, Helitrans, Boreal), the Norwegian postal service (Posten), and\nfinancial institutions (Sbanken, Gjensidige).\n**July 7, 2022: There were not any specific acts by Poland that caused the group to specifically target**\nPolish sites. However, Poland has supported Ukraine from the beginning of the Ukraine conflict, and\ntherefore sites in the country became targets. The first wave of DDoS attacks on Polish sites was aimed\nat government websites like the Polish Cyberspace Resource Center, Polish 56th Air Base, Military\nRecruitment Center in Chorzów, and more.\n**July 9, 2022: Bobik was reconfigured back to target Lithuanian websites, focusing on energy companies**\n(Ignitis Group, KN), transportation companies (Ingstad & Co, Asstra-Vilnius), and banks (Turto Bankas,\nŠiaulių Bankas, Swedbank, SEB, Kredito unija Litas).\n**July 25, 2022: Polish sites were targeted again, this time the Polish government and airports were**\nattacked. We observed a DDoS configuration including the Polish Sejm, Presidential Office, Ministry of\nNational Defense, Poznań Airport, Szczecin Goleniów Airport, Gdansk Airport, Kraków Airport, and\nmore.\n**August 5, 2022: Polish regional and district courts were targeted.**\n**August 9, 2022: When Finland announced their intention to join NATO, the Bobik configuration was**\nreconfigured to target Finnish government institutions, like the Parliament of Finland (Eduskunta), State\nCouncil, Finnish police, and more.\n**August 14, 2022: Latvian financial sector (Latvian Payment Services and Electronic Money, Luminor**\nInterneto bankas) was attacked.\n**August 16, 2022: The second wave of attacks on the Polish justice system began. We monitored a**\nconfiguration with specific district courts in Krakow, Olsztyn, Warszawa, Poznan.\n**August 23, 2022: Estonia’s largest news portal, Delfi, was under DDoS attack because it published**\nRussophobic content.\n**August 26, 2022: The group targeted another Estonian company, Tallink Grupp, a company providing**\ntransport services in the northern Baltic Sea region, including air transport. Tallink’s airports, such as\nKärdla, Tartu, and Pärnu were targeted.\n**August 27, 2022: Lithuania’s ministries of National Defense, Culture, Education, Science and Sports,**\nand Public Procurement Offices were targeted, along with the airports and transport companies.\n**August 29, 2022: Ukrainian banks were under DDoSed by the group after a long break. We observed**\nAcordbank, Trust capital, JSC Poltava-Bank, and Pravex Bank under attack.\n**September 1 and 2, 2022: Ukrainian schools were under attack at the beginning of the new school**\nyear. Fortunately, none of the group’s 14 targets were taken down.\n**September 3, 2022: Polish armaments plants (Dezamet, Zakłady Mechaniczne Tarnów) and Lithuanian**\ninvestment companies (Unija Litas, General Financing Bankas) were the group’s first victims after their\nunsuccessful attack attempts on Ukrainian school institutions.\n**September 6, 2022: The second attempt to attack Ukrainian school institutions (Athens School in Kyiv,**\nCherkasy National University, First Cambridge Education Center, and more).\n\nThe graph below shows a timeline of Bobik DDoS attacks, including successful and unsuccessful attacks from\nthe beginning of June to mid-July 2022, captured by Avast telemetry.\n\n\n-----\n\nFinally, we inspected all hosts from the XML configuration files within our three-month observation period. The\npie chart below illustrates that sites from Lithuania and Poland are the main targets of the NoName057(16)\ngroup.\n\nLooking at the distribution of attacked institutions, courts come in first, and second is logistic companies,\nfollowed by banks. The remaining targets are airports, transportation, and logistic companies, governments,\nand telecommunications companies. A full list of the targets can be found at Appendix.\n\n**Identifying NoName057(16)**\n\nWe have tried identifying the hacker group controlling Bobik bots and C&C servers. It was evident that the\ngroup must be pro-Russia, so we looked for the most famous DDoS attacks.\n\nShortly after the war in Ukraine began, a pro-Russia hacking group called Killnet appeared and began\ncarrying out [DDoS attacks against companies and governments supporting Ukraine, and even targeted the](https://cybernews.com/cyber-war/hacker-wars-heat-up-as-the-pro-russian-killnet-attacks-italy)\n2022 Eurovision Song Contest.\n\n_Bobik initially attacked websites Killnet has marked as “undesirable”. Killnet reports their DDoS attacks on_\ntheir Telegram account. At first, it looked like the attacks carried out by Bobik distantly resembled Killnet’s\nactivity, because the timeline of attacked countries was similar to the XML configurations. However, many\nsuccessful DDoS attacks by Bobik were not posted by Killnet.\n\n\n-----\n\nOn June 21, 2022, the Killnet group publicly thanked a group called NoName057(16) for their support during a\n“special military operation”:\n\nWhen we finished analyzing NoName057(16)’s Telegram channel, we confirmed that NoName057(16) is\nresponsible for the DDoS attacks performed by the Bobik bots. All the XML configurations we captured from\nthe NoName057(16) C&C servers exactly match the posts on the Telegram channel.\n\nNoName057(16)\n\n_NoName057(16) is a little-known pro-Russian hacker group. They boast about their successful attack_\nattempts on their Telegram channel, which has more than 14K subscribers. The group was active before we\nbegan tracking them on June 1, 2022. Their Telegram channel was created on March 11, 2022. We suspect\nthey were either using a different set of botnets before June 1, 2022, or updating the malware used to control\nthe bots in June.\n\n_NoName057(16) has been threatening to punish “propaganda” sources that “lie” about the Russian “special_\noperation” in Ukraine, as well as governments from neighboring countries supporting them in their fight\nagainst Russia. The group became visible in the media at the beginning of August after carrying out\n[successful attacks on Finnish and](https://www.hs.fi/newsinrussian/art-2000008995244.html) [Polish parliaments.](https://ceo.com.pl/rosyjska-grupa-hakerow-noname05716-atakuje-polske-i-finlandie-32079)\n\nA [Wikipedia page about NoName057(16) was created on August 17, 2022. The page summarizes the group’s](https://ru.wikipedia.org/wiki/NoName057(16))\nmain activity. It classifies the group as a pro-Russia hacker group that claimed responsibility for cyberattacks\non Ukrainian, US, and European websites belonging to government agencies, media, and private companies.\n\n_NoName057(16) released a manifesto declaring cyberwar as an act of revenge for open information war_\nagainst Russia:\n\n\n-----\n\nAs the group increased its activities and media profile, it became easier to determine they were behind the\nattacks. Therefore, we can clearly state that Bobik is controlled by the pro-Russian hacker group called\n_NoName057(16)._\n\n**Success Rate**\n\nThe group only reports successful DDoS attacks on their Telegram channel. Although the reported number of\nsuccessful attacks seems large, statistical information indicates the contrary.\n\nThe group exclusively concentrates on DDoS attacks. They do not try to steal data or gain access to systems\nlike other dangerous groups. The question is if they have the necessary knowledge, strength, and\ninfrastructure to do more. Carrying out DDoS attacks is straightforward and does not require deep technical\nknowledge. Furthermore, the Bobik implementation only sends a simple HTTP request.\n\nOur three-month observation shows that the group’s attack success is around 40%. We compared XML\nconfigurations captured by Avast to the achievements the group posts on their Telegram channel. Moreover,\nthere is a particular set of targets, making up ~20% of their posts on Telegram, NoName057(16) claimed they\nsuccessfully attacked, but we did not match them to the targets listed in their configuration files. For example,\n_NoName057(16) claims to be responsible for attacking websites belonging to Lithuanian airports on June 25,_\n2022:\n\n\n-----\n\n_NoName057(16) claiming to be responsible for a_\n\n_DDoS attack on Lithuanian airports, posted on NoName057(16)’s Telegram channel_\nHowever, we did not find any records of the attack in the configuration files. The likelihood of them not using\nall of their bots in attacks is slim. In addition to this outage, NoName057(16) declared the sites were under a\ncontinuous fourteen-day attack. This would require an extensive bot network, especially considering the group\nperformed other attacks during the same time frame, and the websites were still offline. From what we have\nseen, it is unlikely that NoName057(16) has an extensive bot network. Moreover, most of their DDoS attacks\nlast a few hours, maximally a few days.\n\nImpact and Protection\n\nThe power of the DDoS attacks performed by NoName057(16) is debatable, to say the least. At one time,\nthey can effectively strike about thirteen URL addresses at once, judging by configuration history, including\nsubdomains. Furthermore, one XML configuration often includes a defined domain/target as a set of\nsubdomains, so Bobik effectively attacks five different domains within one configuration. Consequently, they\ncannot focus on more domains for capacity and efficiency reasons.\n\nMost of the successful attacks result in servers being down for several hours or a few days. To handle the\nattacks, site operators often resort to blocking queries coming from outside of their country. It is a typical and\nsuitable solution for local servers/domains such as local ticket portals of local bus/train companies, local\ninstitutions/companies, etc. Therefore, the DDoS impact on these domains has a minimal effect on the\nservers of local and smaller companies. Some operators or owners of affected servers have unregistered\ntheir domains, but these are extreme cases.\n\nThe DDoS attacks carried out were more difficult to handle for some site operators of prominent and\nsignificant domains, such as banks, governments, and international companies. After a successful attack, we\nnoticed larger companies implementing enterprise solutions, like Cloudflare or BitNinja, which can filter\nincoming traffic and detect DDoS attacks in most cases. On the other hand, most large, international\ncompanies expect heavier traffic and run their web servers in the Cloud with anti-DDoS solutions, making\n\n\n-----\n\nthem more resilient to attacks. For example, the group was unsuccessful in taking down sites belonging to\nDanish bank, Danske Bank (attacked June 19 – 21, 2022), and Lithuanian bank, SEB (attacked July 12 – 13,\n2022 and July 20 – 21, 2022).\n\nThe success of DDoS attacks depends on victim selection. The more “successful” attacks affected companies\nwith simple sites, including about us, our mission, and a contact page, for example. These types of\ncompanies do not use their web pages as the main part of their business. These servers are therefore not\ntypically designed to be heavily loaded and do not implement anti-DDoS techniques, making them a very\neasy target.\n\nThe group’s DDoS attack on Poznań-Ławica Airport in Poland took the site offline for 16 minutes.\n_NoName057(16) configured Bobik bots based on the_ `<tasks> shown in the screenshot below:`\n\n_XML configuration for Poznań-Ławica Airport_\nThey tried to overload the server with requests for searching, form submitting, and getting data via WordPress\nAPI. When the server started to return `502 errors, NoName057(16) did not forget to brag on their`\n[Telegram channel. They also included a link to check-host.net to prove their “revenge”.](https://check-host.net/)\n\n_NoName057(16)’s Telegram post related to their_\n\n_DDoS attack on Poznań-Ławica Airport_\nHowever, affected servers very often run back online within several minutes if they implement some anti[DDoS techniques because the algorithms learn to recognize the given type of attacks. The check-host.net](https://check-host.net/)\nreport below demonstrates that the DDoS attack on Poznań-Ławica Airport had a minimal impact since the\nwebsite was offline for 16 minutes.\n\n\n-----\n\n_Check-host.net report for the DDoS attack on Poznań-Ławica Airport, which took the site offline for 16_\n_minutes_\nOn June 23, 2022, NoName057(16) reported on Telegram that Lithuanian authorities lifted a ban on the\ntransit of Russian cargo to Kaliningrad. The group attributes the lifting of the ban, amongst other things, to the\nefforts of their cyber attacks on Lithuania’s infrastructure, which is debatable at best. However, the attacks on\nLithuanian servers have continued.\n\nPerformance\n\nThe botnet went into an idle state on September 1, 2022, at 6 PM UTC, and remained idle persisted for 12\nhours. The botnet was reactivated on September 2, 2022, at 4 AM UTC. The XML file sent to the bots\ncontained empty `<tasks>, like in this example:` `<config><tasks delay=\"0\" thread_count=\"-6\"/>`\n```\n</config>\n\n```\nA decline in the botnet’s performance may be a possible explanation for this. The group only posted two\ngeneral posts to their Telegram channel on September 1 and 2, 2022, instead of boasting about successful\nattacks, our first indication the botnet might not be performing well.\n\nThe first post was about the beginning of the new school year and day of knowledge. The group also\nmentioned being on the defense of the cyber front for their country and the for the safety of the younger\ngeneration. The second post was about “information guns and DDoS tanks” that worked quietly on very\ndifficult and important work.\n\nIn fact, NoName057(16) changed targets ten times each day in the XML configurations, which is abnormal.\nWe monitored the targets for these days, and none of the attacks were successful. Therefore, it is evident that\nthe botnet had some trouble.\n\nMost of the sites attacked by the group have implemented anti-DDoS protections. This slowdown implies that\nthe botnet is relatively static without many changes, such as recruiting new bots or dynamically changing bots’\nIPs. A static botnet is an advantage for anti-DDoS protections, because malicious traffic can be easily\nidentified.\n\n_NoName057(16) has continued to attack other easier targets since September. Only the future will reveal the_\nBobik botnet’s successes and failures. However, the attack’s success rate has been only around 25% since\nthe beginning of September.\n\n\n-----\n\n**Conclusion**\n\nWe investigated and analyzed malware used to carry out DDoS attacks on sites in and around Ukraine,\nstarting in June, 2022. We identified the malware as a .NET variant of a RAT called Bobik, including a DDoS\nmodule, and spreading via a bot-net-as-a-service, RedLine Stealer.\n\nThe first technical part of this investigation uncovered C&C servers and the HTTP communication protocol\nused by the Bobik _bots. We also successfully decrypted the HTTP protocol, including its parameters. This_\nallowed us to monitor the C&C servers and collect information about the botnet architecture and XML\nconfigurations defining the DDoS targets.\n\nThe second aim was to determine the bad actors behind the attacks. We identified a pro-Russian hacker\ngroup called NoName057(16), as the users or possibly even the authors of Bobik, based on the XML\nconfigurations and what the group posts to their Telegram channel.\n\n_NoName057(16) focuses exclusively on DDoS attacks and looks for companies and organizations that_\nsupport Ukraine or are “anti-Russian”. They do not try to steal data or gain access to the system like other\ndangerous groups. Therefore, we can declare that their activities are only harmful in the sense that they can\nlose companies’ business while their sites are offline, but attacked sites that have gone offline have luckily\nrecovered quickly. Their activities are more annoying than dangerous.\n\nWe found that the successful attacks defined by NoName057(16) make up just ~ 40% of all of their attack\nattempts. The success of their attacks depends on the quality of the targeted infrastructure. The evidence\nsuggests that well-secured and designed servers can withstand the group’s DDoS attacks.\n\nThe group focuses on servers/domains as retaliation for cyber-attacks and sanctions on Russia. All\nsuccessful attacks, and even successful attacks the group is not responsible for (but claims to be), are posted\nto their Telegram channel.\n\nIf you are concerned your device might be infected with Bobik and supporting NoName057(16)’s efforts, we\n[highly recommend you install security software, like Avast Antivirus, which detects, blocks and can remove](https://www.avast.com/free-antivirus-download#pc)\n_Bobik._\n\n**IOCs**\n\n[The full list of IoCs is available in the IOC repository](https://github.com/avast/ioc/tree/master/Bobik)\n\n**Appendix**\n\nGUIDS\n\n```\nhttp://[ip]/[request]/update?id=[sha256]&v=[version]&pr=[flag]\n\n```\n\n\n**[request]** **value**\n\nnotice bcaa8752-51ff-4e35-8ef9-4aefbf42b482\n\nd380f816-7412-400a-9b64-78e35dd51f6e\n\nadmin 27bff71b-42c0-4a47-ba39-04c83f2f40bb\n\n\n-----\n\ndropper\n\n\nfb82275d-6255-4463-8261-ef65d439b83b/<file_name>\n\n<file_name>\n\nQ7yheyG7.exe\n\nafVAcUJTvDvM.exe\n\nXuS1qxZa.exe\n\nAdminService.exe\n\nQ7yheyG7.exe\n\nxLZ6auza.exe\n\nBAebY2lBT7ee.exe\n\n\nBobiks’ Targets\n\n[targets can be found in the IOC repository](https://github.com/avast/ioc/tree/master/Bobik)\n\n**References**\n\n[1] [Threat Encyclopedia](https://www.fortiguard.com/encyclopedia/virus/8065384)\n\n\nFull list of the\n\n\n\n[2] [US Defense Department convened a meeting with America’s eight prime defense contractors](https://www.aa.com.tr/en/americas/us-to-convene-meeting-with-8-defense-contractors-on-ukraine/2562185)\n\n[3] [Ukraine Conflict Overview And Impact To Security In The UK](https://www.g4s.com/en-gb/-/media/g4s/unitedkingdom/files/conflict_in_ukraine_march_22_v4.ashx)\n\n[4] [Verizon Waives Calling Charges to and From Ukraine](https://www.wsj.com/livecoverage/russia-ukraine-latest-news/card/verizon-waives-calling-charges-to-and-from-ukraine-cvVIf5gJouWlK3OUEGI1)\n\n[5] [Kaliningrad sanctions to take effect, Lithuania says](https://www.reuters.com/world/europe/lithuania-says-sanctions-goods-kaliningrad-take-effect-saturday-2022-06-18)\n\n[6] [Norway Greenlights Blocked Goods for Russian Arctic Miners](https://www.themoscowtimes.com/2022/07/06/norway-greenlights-blocked-goods-for-russian-arctic-miners-a78225)\n\n[7] [Hacker wars heat up as the pro-Russian Killnet attacks Italy](https://cybernews.com/cyber-war/hacker-wars-heat-up-as-the-pro-russian-killnet-attacks-italy)\n\n[8] What is known about the Russian hacker group NoName057(16), which hacked the website of the Finnish\nParliament?\n\n[9] [Russian hacker group NoName057 (16) attacks Poland and Finland](https://ceo.com.pl/rosyjska-grupa-hakerow-noname05716-atakuje-polske-i-finlandie-32079)\n\n[10] [Wikipedia – NoName057(16)](https://ru.wikipedia.org/wiki/NoName057(16))\n\n[Tagged asddos,](https://decoded.avast.io/tag/ddos/) [malware](https://decoded.avast.io/tag/malware/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-06 - Pro-Russian Group Targeting Ukraine Supporters with DDoS Attacks.pdf"
    ],
    "report_names": [
        "2022-09-06 - Pro-Russian Group Targeting Ukraine Supporters with DDoS Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b05a0147-3a98-44d3-9b42-90d43f626a8b",
            "created_at": "2023-01-06T13:46:39.467088Z",
            "updated_at": "2025-03-27T02:00:03.100909Z",
            "deleted_at": null,
            "main_name": "NoName057(16)",
            "aliases": [
                "Nnm05716",
                "NoName057",
                "NoName05716",
                "05716nnm"
            ],
            "source_name": "MISPGALAXY:NoName057(16)",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535705,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1662984121,
    "ts_modification_date": 1662984121,
    "files": {
        "pdf": "https://archive.orkl.eu/dae28096e279d7a1c19993385ea65562ccebd64f.pdf",
        "text": "https://archive.orkl.eu/dae28096e279d7a1c19993385ea65562ccebd64f.txt",
        "img": "https://archive.orkl.eu/dae28096e279d7a1c19993385ea65562ccebd64f.jpg"
    }
}