{
    "id": "0eaac930-9947-49ca-85d5-ecdf5c076e88",
    "created_at": "2023-01-12T15:02:00.898581Z",
    "updated_at": "2025-03-27T02:08:41.091922Z",
    "deleted_at": null,
    "sha1_hash": "ba63cb4a4b761fd5b19082d9eb579b00080d0bc9",
    "title": "2022-07-21 - It’s time to close the door on open directories",
    "authors": "",
    "file_creation_date": "2022-10-02T12:12:44Z",
    "file_modification_date": "2022-10-02T12:12:44Z",
    "file_size": 1954308,
    "plain_text": "# It’s time to close the door on open directories\n\n**[silentpush.com/blog/its-time-to-close-the-door-on-open-directories](https://www.silentpush.com/blog/its-time-to-close-the-door-on-open-directories)**\n\nJul 21\nWritten By [The Team](http://10.10.0.46/blog?author=6081bc3c4920d358398731f8)\n\n\nJuly 21, 2022\n\n\nSearch through indexed directories and files from open directories to help protect your\norganization.\n\nMost people have listened to an elderly relative extolling the virtues of the ‘good old days’,\nincluding a semi-smug description of their front door being left open in the summer - usually\njustified by the fact that they didn’t have anything worth stealing.\n\nOpen directories are just that - an open door onto your fileserver which, unlike an average\n1950s living room, contains information that is extremely valuable, for a variety of reasons.\n\nIn the world of global commerce, data is a highly lucrative and sought-after commodity. By\nusing open directories, threat actors are able to seize vast amounts of commercially\nsensitive information in a matter of seconds, and they’re gone before you even know they\nwere there.\n\nLet’s take a look at the global problem of open directories, what the consequences are, and\nhow you can find them using the Silent Push Open Directory Finder.\n\n\n-----\n\nAn example of an open directory- the full file structure of the server is browsable by anyone\non the internet.\n\n## What are open directories?\n\nOpen directories are freely accessible links to files hosted on a webserver that's connected\nto the Internet, and not subject to any authentication methods or external access rules.\n\nThere’s no software-based trickery involved. Open directories can be found using a simple\nGoogle search, tailored towards different categories of data. Once a threat actor has\nidentified an open directory, they’re free to browse through an organization’s file structure\nwithout circumnavigating RBAC or permissions-based security measures.\n\n\n-----\n\nWhilst it is undoubtedly immoral to access and/or download sensitive information that isn t\nmeant for prying eyes, the act of browsing through an open directory is a legal gray area.\nThere’s no global consensus on how such scenarios should be legislated against, and\nsentiments vary from jurisdiction to jurisdiction.\n\n## How damaging can they be to your organization?\n\nVery. Extremely. Catastrophically, in fact.\n\nMalicious activity on open directories is nigh on impossible to detect. The first you’ll hear of\nit is either a phone call from a law enforcement/regulatory agency, an email from a hacker\ndemanding money to keep quiet, or a very annoyed customer wondering why their data has\nbeen passed around the Internet for the last few years.\n\nThen there’s the compliance and liability aspect. Cyber insurance policies don’t cover the\ncommercial or operational consequences of an open directory exploit, so unless you have\nthe working capital to deal with the fall-out, it could lead to untold reputational and financial\ndamage and land you in pretty hot regulatory water.\n\nLast, and by no means least, is the data itself. Take a moment to think about the data held\non your organization's webservers and fileservers, and what would happen if you exposed it\nto the world through an open directory.\n\nBy working with firms to improve their threat resilience, we’ve seen sensitive data held in\nopen directories that would make a privacy protection lawyer spontaneously combust:\n\nFull environment files.\n\nCommercial application configs.\n\nCryptowallet logins.\n\nVPN installers.\n\n_.xls and .docx files containing PII and GDPR/HIPAA-regulated data._\n\nOnce you start investigating open directories on the behalf of large organizations, the horror\nstories come thick and fast. We recently came across a fairly sizable prison in the USA that\nleft the door open to tens of thousands of electronic prisoner and staff records, including\nlegal information, social security numbers and conviction details.\n\n## How do you prevent them?\n\n\n-----\n\n[Like other forms of threat protection (such as stopping subdomain takeovers), securing your](https://www.silentpush.com/blog/we-need-to-talk-about-subdomain-takeovers)\norganization’s data by preventing open directories is done through a combination of\nvigilance and good housekeeping.\n\nAnyone who’s ever browsed the Internet has, somewhere along the line, received the\ndreaded error 403 Forbidden or 404 File Not Found, instead of a web page. As an\norganization looking to protect its data, these errors are your friends, not your enemies - this\nis what users are faced with when a server has been configured to block access to directory\ncontent.\n\nMethods vary from platform to platform (from simple login controls to modifying your\n_.htaccess files and ensuring that IIS is configured correctly), but if you host ANY kind of_\nsensitive data on a webserver, you need to make sure that it’s configured so that external\nand unauthenticated users aren’t able to view directory data.\n\n## Silent Push Open Directory Finder\n\nFind open directories exposed on your infrastructure or search for your name across all\nopen directories\n\nThe Silent Push Open Directory Finder searches the global IPv4 range (all\n4,294,967,296 addresses) for open directories, to a granular set of parameters that can be\nconfigured to your organization’s unique requirements.\n\nOur cloud-based platform provides search and filter options (with RE2 regex support) on all\nknown open directories, including variables such as range, partial match and time window.\nResults can either be outputted in full, or to a file for further interrogation.\n\n\n-----\n\nIf you re a large, multi-site, multi-jurisdictional organization with an extensive online\npresence, you’ll be presented with a realtime list of open directories within the specified\nrange.\n\nEnterprise-level threat monitoring (including open directory detection) doesn’t need to be\nresource hungry. With the right tools, it is quite literally as easy as clicking a few buttons, in\norder to shore up your commercial data and close the aforementioned door onto your\nnetwork that leads to something considerably more valuable than your grandmother’s\ncollection of faux-porcelain dogs.\n\n[The Team](http://10.10.0.46/blog?author=6081bc3c4920d358398731f8)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-21 - It’s time to close the door on open directories.pdf"
    ],
    "report_names": [
        "2022-07-21 - It’s time to close the door on open directories.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535720,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1664712764,
    "ts_modification_date": 1664712764,
    "files": {
        "pdf": "https://archive.orkl.eu/ba63cb4a4b761fd5b19082d9eb579b00080d0bc9.pdf",
        "text": "https://archive.orkl.eu/ba63cb4a4b761fd5b19082d9eb579b00080d0bc9.txt",
        "img": "https://archive.orkl.eu/ba63cb4a4b761fd5b19082d9eb579b00080d0bc9.jpg"
    }
}