{
    "id": "0f6dd770-0a93-4320-bf88-c255b8eaeed1",
    "created_at": "2022-10-25T16:48:16.626766Z",
    "updated_at": "2025-03-27T02:15:35.486773Z",
    "deleted_at": null,
    "sha1_hash": "57eb61b0d2d2e8b62ea44f6ce4e108e85d9facb6",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-06-30T04:01:27Z",
    "file_modification_date": "2020-06-30T04:01:27Z",
    "file_size": 8108298,
    "plain_text": "# BAD TRAFFIC Sandvine’s PacketLogic Devices Used to Deploy Government Spyware in Turkey and Redirect Egyptian Users to Affiliate Ads?\n\n**[citizenlab.ca/2018/03/bad-traffic-sandvines-packetlogic-devices-deploy-government-spyware-turkey-syria](https://citizenlab.ca/2018/03/bad-traffic-sandvines-packetlogic-devices-deploy-government-spyware-turkey-syria/)**\n\nBill Marczak, Jakub Dalek, Sarah McKune, Adam Senft, John Scott-Railton, Ron Deibert March 9, 2018\n\n_This report describes our investigation into the apparent use of Sandvine/Procera_\n_Networks Deep Packet Inspection (DPI) devices to deliver nation-state malware in_\n_Turkey and indirectly into Syria, and to covertly raise money through affiliate ads and_\n_cryptocurrency mining in Egypt._\n\n# Key Findings\n\nThrough Internet scanning, we found deep packet inspection (DPI) middleboxes on\nTürk Telekom’s network. The middleboxes were being used to redirect hundreds of\nusers in Turkey and Syria to nation-state spyware when those users attempted to\ndownload certain legitimate Windows applications.\nWe found similar middleboxes at a Telecom Egypt demarcation point. On a number\nof occasions, the middleboxes were apparently being used to hijack Egyptian\nInternet users’ unencrypted web connections en masse, and redirect the users to\nrevenue-generating content such as affiliate ads and browser cryptocurrency mining\nscripts.\nAfter an extensive investigation, we matched characteristics of the network injection\nin Turkey and Egypt to Sandvine PacketLogic devices. We developed a fingerprint\nfor the injection we found in Turkey, Syria, and Egypt and matched our fingerprint\nto a second-hand PacketLogic device that we procured and measured in a lab\nsetting.\nThe apparent use of Sandvine devices to surreptitiously inject malicious and\ndubious redirects for users in Turkey, Syria, and Egypt raises significant human\nrights concerns.\n\n# 1. Summary\n\nThis report describes how we used Internet scanning to uncover the apparent use of\nSandvine/Procera Networks Deep Packet Inspection (DPI) devices (i.e. middleboxes) for\nmalicious or dubious ends, likely by nation-states or ISPs in two countries.\n\n## 1.1. Turkey\n\nWe found that a series of middleboxes on Türk Telekom’s network were being used to\nredirect hundreds of users attempting to download certain legitimate programs to\nversions of those programs bundled with spyware. The spyware we found bundled by\n\n\n-----\n\n[operators was similar to that used in the StrongPity APT attacks. Before switching to the](https://securelist.com/on-the-strongpity-waterhole-attacks-targeting-italian-and-belgian-encryption-users/76147/)\n_StrongPity spyware, the operators of the Turkey injection used the FinFisher “lawful_\n[intercept” spyware, which FinFisher asserts is sold only to government entities.](http://www.finfisher.com/FinFisher/index.html)\n\nTargeted users in Turkey and Syria who downloaded Windows applications from official\n[vendor websites including Avast Antivirus, CCleaner, Opera, and 7-Zip were silently](https://www.avast.com/)\nredirected to malicious versions by way of injected HTTP redirects. This redirection was\npossible because official websites for these programs, even though they might have\nsupported HTTPS, directed users to non-HTTPS downloads by default. Additionally,\ntargeted users in Turkey and Syria who downloaded a wide range of applications from\n[CBS Interactive’s Download.com (a platform featured by CNET to download software)](http://download.cnet.com/)\nwere instead redirected to versions containing spyware. Download.com does not appear\nto support HTTPS despite purporting to offer “secure download” links.1\n\nOur scans of Turkey revealed that this spyware injection was happening in at least five\nprovinces. In addition to targets in Turkey, targets included some users physically located\nin Syria who used Internet services relayed into Syria by Türk Telekom subscribers,\nsometimes via cross-border directional Wi-Fi links. In one case, more than a hundred\nSyrian users appeared to share a single Turkish IP address. Based on publicly available\ninformation we found on Wi-Fi router pages, at least one targeted IP address appears to\nserve YPG (Kurdish militia) users. YPG has been the target of a Turkish government air\nand ground offensive which began in January 2018. Areas not controlled by the YPG also\nappear to be targeted, including the area around Idlib city.\n\n## 1.2. Egypt\n\nWe found similar middleboxes at a Telecom Egypt demarcation point. The middleboxes\nwere being used to redirect users across dozens of ISPs to affiliate ads and browser\ncryptocurrency mining scripts. The Egyptian scheme, which we call AdHose, has two\nmodes. In spray mode, AdHose redirects Egyptian users en masse to ads for short\nperiods of time. In trickle mode, AdHose targets some JavaScript resources and defunct\nwebsites for ad injection. AdHose is likely an effort to covertly raise money.\n\n## 1.3. Technology Matches Sandvine PacketLogic\n\nAfter an extensive investigation, we matched characteristics of the middleboxes in Turkey\n[and Egypt to Sandvine PacketLogic devices. Sandvine’s PacketLogic middleboxes can](https://www.sandvine.com/products/packetlogic)\nprioritize, degrade, block, inject, and log various types of Internet traffic. The company\nthat makes PacketLogic devices was formerly known as Procera Networks, but was\nrecently renamed Sandvine after Procera’s owner, U.S.-based private equity firm\n[Francisco Partners, acquired Ontario-based networking equipment company Sandvine](https://www.theglobeandmail.com/technology/sandvine-accepts-francisco-partners-takeover-bid-plan-to-combine-with-procera/article35708446/)\n[and combined the two companies in 2017. Francisco Partners has a number of](https://www.franciscopartners.com/news/sandvine-corporation-to-be-acquired-by-francisco-partners-affiliate-and-combined-with-procera-networks)\ninvestments in dual-use technology companies, including providers of Internet\n\n\n-----\n\n[surveillance and monitoring tools such as NSO Group, an Israeli company that develops](https://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=257152480)\n[and sells mobile spyware. NSO Group’s spyware has been used in several countries to](https://citizenlab.ca/2016/08/million-dollar-dissident-iphone-zero-day-nso-group-uae/)\ntarget journalists, lawyers, and human rights defenders.\n\n[A 2014 article in a Turkish Newspaper mentioned that Turkey had begun negotiations](http://web.archive.org/web/20140707083118/http://www.taraf.com.tr/haber-internete-sansur-donanimi-158271/)\nwith Procera to buy a PacketLogic system for surveillance and censorship purposes; the\n[deal reportedly caused consternation within the company.](https://www.forbes.com/sites/thomasbrewster/2016/10/25/procera-francisco-partners-turkey-surveillance-erdogan/)\n\n## 1.4. Blocking Human Rights and Political Content\n\nIn Egypt and Turkey, we also found that devices matching our Sandvine PacketLogic\nfingerprint were being used to block political, journalistic, and human rights content.\n\nIn Egypt, these devices were being used to block dozens of human rights, political, and\nnews websites including Human Rights Watch, Reporters Without Borders, Al Jazeera,\nMada Masr, and HuffPost Arabic. In Turkey, these devices were being used to block\nwebsites including Wikipedia, the website of the Dutch Broadcast Foundation (NOS), and\nthe website of the Kurdistan Workers’ Party (PKK).\n\n## 1.5. Procera/Sandvine employees on the ground?\n\nA search of LinkedIn reveals profiles for a Procera Networks “Solutions Engineer” in\n[Istanbul, Turkey and a Sandvine (formerly Procera Networks) “Resident Engineer –](https://www.linkedin.com/in/g%C3%B6khan-s%C3%B6nmez-69189813/)\n[Senior Level” in Egypt. Sandvine’s “Careers” page describes the responsibilities of a](https://www.linkedin.com/in/ihab-zolfakar-44469954/)\nposition entitled “Resident Operations Engineer,” including “performing operations\nbased activities, residing at the customer’s location,” and “working closely with the\n[customers’ operations and development teams.” A 2016 Procera “use cases” brochure2](https://cdn2.hubspot.net/hubfs/482141/WhitePapers/Procera_UseCase_Book.pdf)\nhas a section on “Regulatory Compliance – Traffic Blocking,” which mentions that the\ncompany provides “resident engineering services” to support government mandates on\nProcera’s customers that require blocking of services like VPNs or VoIP. In light of this\ninformation, on February 12, 2018, we sent a letter to Sandvine and asked whether\nSandvine maintains a resident solutions engineer or other support staff in Turkey or\nEgypt. Sandvine did not respond to this question. The prospect of in-country work of this\nsort, especially at the large ISP level, raises questions regarding company awareness of, or\nparticipation in, activities with significant human rights impact.\n\nOur February 12, 2018 letters to Sandvine and Francisco Partners summarized the\nfindings of our report and contained detailed questions about our findings and their\ncorporate social responsibility practices. A February 16, 2018 letter from Sandvine\ncharacterized the statements in our letter as “false, misleading, and wrong,” and\ndemanded that we return the second-hand PacketLogic device that we used to confirm\nattribution of our fingerprint. On February 20, 2018, Francisco Partners sent its own\nresponse, stating that the firm “recognizes the importance of corporate governance and\nsocial responsibility.” On March 1, 2018, Citizen Lab replied to Sandvine. Our interactions\nwith Sandvine and Francisco Partners are discussed in further detail in Section 7.\n\n\n-----\n\n# 2. Background: Nation-State Network Injection\n\nNation-state-level network injection to deliver spyware has long been the stuff of legends.\n[There have been many leaked documents and vendor claims outlining purported nation-](https://wikileaks.org/spyfiles/files/0/297_GAMMA-201110-FinFly_ISP.pdf)\nstate network injection capabilities but there are no concrete public measurements that\nconclusively establish nation-state spyware injection in the wild.\n\nIn network injection, a middlebox operates over connections between a target and an\nInternet site they are visiting. If the connection is unauthenticated (e.g., HTTP and not\nHTTPS), then the middlebox can be used to tamper with data to inject a spoofed response\nfrom the Internet site. The spoofed response may contain redirects to exploits or spyware\nto infect and monitor the target. A significant portion of web traffic (approximately 20[30% in the United States) still does not use HTTPS, according to Google.](http://blog.chromium.org/2018/02/a-secure-web-is-here-to-stay.html)\n\nBroadly, network injection systems are divided into two categories: an on-path system\n(also called a man-on-the-side) can simply add Internet traffic to the network, whereas an\n_in-path system (also called a man-in-the-middle) can add traffic and also suppress_\nlegitimate traffic. A malicious response injected by an on-path system is easier for\nresearchers to detect, because the target receives both the legitimate and malicious\nresponse. The presence of two non-similar responses to the same request is a good\nindicator of on-path network injection. The target’s device will process whichever\nresponse is received first, so the goal of an on-path system is to inject a malicious\nresponse that reaches the user before the legitimate response. However, such a system\ncannot always guarantee that the target’s device will see the malicious response first, due\nto unpredictable network delays and reordering.\n\n## 2.1. On-Path Systems\n\n### NSA QUANTUM\n\n[Based on information from documents leaked from the US National Security Agency](https://theintercept.com/document/2014/03/12/nsa-gchqs-quantumtheory-hacking-tactics/)\n(NSA), NSA’s QUANTUM is an on-path network injection system, and has been used to\ntarget engineers associated with Belgian telco Belgacom, employees of OPEC, and Tor\nusers accessing terrorist content. NSA’s QUANTUM has never been publicly measured in\n[the wild, but leaked documents indicate that it functions by injecting HTTP redirects into](https://www.wired.com/opinion/2013/11/this-is-how-the-internet-backbone-has-been-turned-into-a-weapon/)\ntargeted users’ connections.\n\n### Hacking Team Network Injection Appliance (NIA)\n\n[According to a patent filed in 2010 by nation-state spyware vendor Hacking Team, and](http://pdfaiw.uspto.gov/.aiw?PageNum=0&docid=20130132571&IDKey=EEF16E1E2680&HomeUrl=http%3A%2F%2Fappft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D5%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPG01%2526s1%3Dht.AS.%2526OS%3DAN%2Fht%2526RS%3DAN%2Fht)\n[leaked documents, the company may have developed a similar on-path network injection](https://wikileaks.org/hackingteam/emails/fileid/447727/212805)\nsystem called the Hacking Team Network Injection Appliance (NIA). This system\nhas never been publicly measured in the wild. The patent indicates that the NIA functions\nby injecting HTTP redirects into targeted users’ connections.\n\n\n-----\n\n## 2.2. In-Path Systems\n\n### FinFly ISP\n\nLeaked documents from nation-state spyware vendor FinFisher indicate that the\n[company sells an in-path network injection system called FinFly ISP. The complex](https://www.youtube.com/watch?v=Dejw2G83Moo)\nsystem supports a number of unique features, such as rewriting downloaded binaries on[the-fly. The system was apparently sold to governments in Mongolia and Turkmenistan,](https://wikileaks.org/spyfiles4/customers.html#customer_18)\nand at least one additional customer that could not be identified from the 2014 FinFisher\nleaked documents. This system has never been publicly measured in the wild.\n\n### China’s Great Cannon\n\n[China’s Great Cannon is an in-path network injection system, which was used in 2015](https://citizenlab.ca/2015/04/chinas-great-cannon/)\n[(and perhaps as recently as 2017) to inject JavaScript that enlists targets’ browsers in](https://gist.github.com/paperbag/6287d41d9c1407bb5704a9a4ac86152b)\ndistributed denial of service (DDoS) attacks against the Chinese diaspora’s efforts to\n[spread censored information. In a 2015 report, we hypothesized that the Great Cannon](https://citizenlab.ca/2015/04/chinas-great-cannon/)\ncould also be used to distribute spyware, but this has never been publicly measured in the\nwild.\n\n### Sandvine PacketLogic\n\nAccording to our measurements (Section 3.3), Sandvine’s PacketLogic product\nsupports in-path network injection. The company advertises that they support “regulatory\ncompliance” but does not mention spyware injection. Nevertheless, the product has\nsupport for defining rules that inject data into targeted connections (Figure 4). As we\ndocument in this report, the PacketLogic product may have been used by governmentlinked entities in both Turkey and Egypt to inject spyware.\n\n## 2.3. The Procera/Sandvine value proposition\n\n[A Procera “use cases” brochure has a section on “Regulatory Compliance – Traffic3](https://cdn2.hubspot.net/hubfs/482141/WhitePapers/Procera_UseCase_Book.pdf)\n[Blocking.” The section links to a 2002 article by Electronic Frontiers Australia entitled](https://www.efa.org.au/Issues/Censor/cens3.html)\n“Internet Censorship: Law & policy around the world” and mentions that “Procera’s\nsolutions provide the capabilities to identify and block, or shape down to become\nunusable, any identifiable service network wide or on an individual subscriber basis.”\n\n[Procera appears to have pitched its services as a win-win for both ISPs and governments](https://www.proceranetworks.com/hubfs/Resource%20Downloads/Solutions%20Briefs/Procera_SB_Regulatory%20URL%20Filtering.pdf?t=1501671712921)\nthat require Internet censorship solutions, or as a way for ISPs to save money while\nimplementing regulatory requirements that do not generate any revenue:\n\n“Operators that are required to filter content from their networks by governmental\nregulations are struggling to find solutions that can keep up with the explosive bandwidth\ngrowth of the past few years. Many telecom operators are required to invest several racks\n\n\n-----\n\nworth of equipment for a single use case with no return on investment through additional\nARPU from subscribers.”\n\nThe document describes the close ongoing relationship Procera may have maintained\nwith its clients to help them implement “regulatory requirements,” in some cases\napparently having a Procera employee assist government clients with censorship:\n\n“As an example, adult content can be opted in on an individual bases [sic] or services like\nSkype could be enabled for corporate clients only. Procera updates it’s [sic] signature\ndatabase on a weekly basis to stay up to date on changes in what traffic looks like.\nBlocking proprietary over-the-top services will always remain a cat and mouse game that\nrequires local dedicated personnel to perform well. Procera can provide these resident\nengineering services.”\n\nSandvine appears to offer instructor-led training sessions, such as the “Operating with\nPacketLogic” course. If desired, Sandvine can offer such courses as a “customer-exclusive\nsession delivered at the customer’s location“.\n\n# 3. Catching Nation-State spyware injection in the wild\n\n_This section describes how we obtained the first-ever packet captures (PCAPs) of nation-_\n_state spyware injection, and how we matched the characteristics of the spyware_\n_injection to Sandvine PacketLogic devices._\n\n## 3.1. An initial report\n\n[A September 2017 report revealed that ISPs in two (unnamed) countries were likely](http://welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\ninjecting FinFisher spyware into targeted users’ Internet connections when the users tried\nto download popular Windows applications. The injection was implemented using HTTP\nredirects matching the format shown in Figure 1.\n\nHTTP/1.1 307 Temporary Redirect\nLocation: [location]\nConnection: close\n\n**Figure 1: Injected HTTP 307 redirect to spyware seen in two countries.**\n\n[A follow-up report in December 2017 found no further evidence of spyware injection from](https://www.welivesecurity.com/2017/12/08/strongpity-like-spyware-replaces-finfisher/)\none of the two countries from the original report and found that operators of the injection\nin the second country switched from FinFisher spyware to a piece of spyware that was\nsimilar to the StrongPity spyware. StrongPity was an unattributed APT operation in 2016\n[that primarily targeted individuals in Italy and Turkey.](https://securelist.com/on-the-strongpity-waterhole-attacks-targeting-italian-and-belgian-encryption-users/76147/)\n\n## 3.2. Scanning and identifying countries\n\n\n-----\n\nDiscovering that an ISP or government is tampering with a user’s Internet connection by\ninjecting malicious responses to the user’s requests is difficult. Typically, this requires the\nuser to send requests, record the responses they receive, and share this data with\nresearchers. However, we find that some network injection is bidirectional: we can\nsometimes receive a malicious injected response when we send a request to a targeted\nuser.\n\n[We checked Shodan, a website on which anyone can search the results of global Internet](https://www.shodan.io/)\nscans, for the header format in Figure 1, and found thousands of IP addresses in dozens\nof countries returning similar (non-malicious) redirects, sometimes to landing pages4\n[about billing like “Your Internet service has been suspended for non-payment.” It seemed](http://www.grm.net/~notices/nonpay.html)\npeculiar to us that Shodan saw these messages when it scanned the IP address of a\ncustomer who was suspended for non-payment, because the messages would only need to\nbe visible to the customer themself. The fact that Shodan received responses from\nthousands of IP addresses matching the same header format used to inject FinFisher\nspyware in two countries (Figure 1) suggested to us that the spyware injection might also\nbe bidirectional.\n\nWe scanned the Internet in October 2017, sending every IPv4 address an HTTP request to\n[download the Opera Web Browser, one of the applications that a September 2017 report](http://welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\nindicates was targeted for spyware injection. Our initial scan found dozens of IP\naddresses on Türk Telekom that returned 307 redirects such as the ones in Figure 2.\n\nHTTP/1.1 307 Temporary Redirect\nLocation: https://downloading.internetdownloading.co/down.php?\na=2ec8a93a73540467335f4365beee7e44\nConnection: close\n\nHTTP/1.1 307 Temporary Redirect\nLocation: https://downloading.syriantelecom.co/pcdownload.php?\na=20755b98d7c094747b75b157413e3422\nConnection: close\n\n**Figure 2: Injected HTTP 307 spyware redirects we observed in Turkey when**\n**performing HTTP requests for Opera.**\n\n\nWe successfully fetched the files from a Turkish IP address using a VPN. When we tried to\nfetch the files from a non-Turkish IP, we received a 503 Service Temporarily Unavailable\nmessage. The files were similar to the StrongPity spyware.5\n\nWe continued to perform scanning of Turkey and set out to fingerprint the middlebox\nperforming the spyware injection. As part of our scanning, we obtained packet captures\n(PCAPs) that show network-level details of the spyware injection. These are the first\n**ever public PCAPs showing nation-state spyware injection.**\n\n## 3.3. Attribution of middlebox to Sandvine\n\n\n-----\n\n### Fingerprint elements\n\nBased on our PCAPs, we identified several elements of the injection in Turkey which, in\nconjunction, form what we believe to be a highly distinctive fingerprint:\n\n1. In all injected packets, the IPID is always 13330 (0x3412, which is 0x1234\n\nendian-swapped) for all injected packets. This value is unusual, as the IPID is\ntypically incremented or pseudorandomly generated, and is not a fixed value.\n2. In all packets, the IP flags are all zero. This characteristic is unusual as\n\nmodern TCP stacks typically default-enable Path MTU Discovery for TCP sockets,\nwhich results in the “don’t fragment” IP flag being set to 1.\n3. The injected packet received by the client is either an empty RST/ACK\n\n**packet, or a FIN/ACK packet, with an HTTP 307 redirect whose headers**\n**exactly match the form of redirect in Figure 1.**\n4. If a FIN/ACK is injected, then the injector sends an unsolicited final\n\n**ACK packet to the client ~100ms later. This behavior is unusual, as a well-**\nbehaving TCP stack would wait to see the FIN/ACK from the client before sending\nthe final ACK.\n\n[Given the well-documented controversy over the installation of Sandvine PacketLogic](https://www.forbes.com/sites/thomasbrewster/2016/10/25/procera-francisco-partners-turkey-surveillance-erdogan/)\ndevices in Turkey, we purchased a PacketLogic device second-hand to confirm whether its\nbehavior matched our fingerprint.\n\n### Our second-hand PacketLogic device\n\nWe purchased a Sandvine PacketLogic device second-hand. The device was a PacketLogic\nPL7720, which is a 2U rackmount version of PacketLogic with Procera livery. This model\n[is well past its designated end-of-life date and no longer serviced by the company. The](https://cdn2.hubspot.net/hubfs/482141/Procera_Live_Site_Files/PDF_Live_Site/Resources/Discontinued_Products/PacketLogic_PL-7720_End_of_Sale_Announcement.pdf?t=1456414414263)\ndevice was installed with firmware version 12.1, which was released in 2009. The device\nalso contained a PacketLogic license file that appeared to be valid in perpetuity for the\ncurrently installed version of the firmware but which cannot be used to upgrade to a later\nversion. Version 12.1 appears to be the earliest version of PacketLogic firmware to contain\nsupport for network injection.6\n\n**Figure 3: A picture of our second-hand Sandvine PacketLogic box with Procera livery.**\n\n\n-----\n\nThe device has two USB ports, an RS232 (on RJ45) serial console port that can be used to\naccess a text-based menu configuration system, two management ethernet ports, and a\nsingle channel over which the middlebox operates. The channel has an internal ethernet\nport (Int) and an external ethernet port (Ext). The middlebox would typically operate over\ntraffic flowing between a local network (connected to the Int port), and the rest of the\nInternet (connected to the Ext port). An operator could add rules to the middlebox to take\ncertain actions over this traffic (e.g., block traffic to a website, inject traffic for targeted\nusers, etc.).\n\nWe powered up the device and connected through its Admin management port. We used\nan old version of the PacketLogic Client available on the Internet Archive to interface\nwith the device, as no current version of the PacketLogic Client on Sandvine’s website\nappeared to support version 12.1 of the firmware. We used the default password\n“pldemo00” printed on the device to log in. We connected one experiment computer to\nthe PacketLogic device’s Ext port, and a second experiment computer to the Int port in\norder to observe characteristics of the device’s operation. At no time did we connect the\ndevice to the Internet.\n\n### Redirecting users to a malicious file\n\nWe added a rule to redirect users who requested an Avast Antivirus setup file to a\nmalicious file. This test involved creating a PropertyObject to match requests whose URL\nended in the filename for Avast Antivirus: avast_free_antivirus_setup_online.exe, and\nthen a Filtering Rule to redirect all connections matching the PropertyObject to a\nmalicious file. This redirection used the built-in Inject action. The PacketLogic GUI has\nan “Insert 307 Temporary Redirect” button that, when pressed, pastes an HTTP 307\nTemporary Redirect response identical to element 3 of our fingerprint (at the start of this\nsection). The PacketLogic operator can configure the “Location” header, which is initially\nblank; in this case, we entered: http://example.com/spyware.exe.\n\n\n-----\n\n**Figure 4: How we set up our Sandvine PacketLogic device to inject spyware when a user**\n\n**tries to download Avast Antivirus. We believe a similar setup exists in Turkey.**\n\nWithout any further configuration, this rule caused our PacketLogic device to inject the\nredirect in response to a matching request in either direction (internal to external, or\nexternal to internal). This mirrors our experience of being able to reproduce spyware\ninjection in Turkey from requests sent external to internal. We noticed that we could add\nan extra condition to the rule in order to restrict the injection to a single direction.\n\nOur experiment matched elements 1-3 of our fingerprint, but did not completely match\nelement 4. Specifically, our PacketLogic middlebox injected an unsolicited final ACK\nback-to-back after the FIN/ACK containing the 307 Temporary Redirect instead of\ninjecting it following the ~100ms delay we observed in Turkey and Egypt. Our version of\nthe PacketLogic firmware (12.1) was the first to support injection; we hypothesize that the\n~100ms delay between the data packet and the final ACK was added in a later firmware\nversion, potentially to reduce the probability of the ACK being reordered before the\nFIN/ACK; such a reordering would cause the injection recipient’s TCP connection to hang\nin the LAST_ACK state, which is the scenario that sending the ACK seeks to avoid.\n\n**Figure 5 shows an excerpt from our client-side PCAP that captures the injection from**\nour test PacketLogic device. Note that the IPID is 13330 in both injected packets, both\ninjected packets have no IP flags, the format of the HTTP 307 redirect is what we expect,\nand the final ACK packet is unsolicited.\n\n**Client sends GET request for Avast file**\n\n17:28:25.024018 IP (tos 0x0, ttl 64, id 0, offset 0, flags [DF], proto TCP (6), length 170)\n192.168.1.27.49458 > 192.168.1.26.8080: Flags [P.], seq 1:119, ack 1, win 4117, options\n\n[nop,nop,TS val 756363711 ecr 2094486068], length 118: HTTP, length: 118\nGET /avast_free_antivirus_setup_online.exe HTTP/1.1\n\n\n-----\n\nHost: 192.168.1.26:8080\nUser-Agent: curl/7.54.0\nAccept: */*\n\n**Client receives injected data (redirect to spyware file)**\n\n17:28:25.024300 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length\n134)\n192.168.1.26.8080 > 192.168.1.27.49458: Flags [F.], seq 1:95, ack 119, win 32120, length\n94: HTTP, length: 94\nHTTP/1.1 307 Temporary Redirect\nLocation: http://example.com/spyware.exe\nConnection: close\n\n**Client receives injected ACK**\n\n17:28:25.024302 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length\n40)\n192.168.1.26.8080 > 192.168.1.27.49458: Flags [.], seq 96, ack 120, win 32120, length 0\n\n**Figure 5: PacketLogic spyware injection from the client side.**\n\n**Figure 6 shows an excerpt from our server-side PCAP that captures the injection from**\nour test PacketLogic device. Note that the server side does not receive the HTTP request\nfor the Avast file. Instead, it receives an injected RST packet with IPID 13330 and no\nflags. Note that the timestamp discrepancy in the PCAP files is because the server and\nclient clocks were not synchronized.\n\n**Server receives injected RST**\n\n17:28:06.715257 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length\n40)\n192.168.1.27.49458 > 192.168.1.26.8080: Flags [R], seq 681001116, win 32120, length 0\n\n**Figure 6: PacketLogic spyware injection from the server side.**\n\n## 3.4. Shared code: a competing hypothesis\n\nOur technical attribution (Section 3.3) can only establish that code that makes the same\ndistinctive implementation choices as PacketLogic’s was used in the injection in Turkey\nand Egypt. It is possible that another vendor copied PacketLogic’s design, such as by\nstudying and exactly re-implementing PacketLogic’s custom TCP stack and HTTP header\nformat in injected redirects. It is also possible that, with or without Sandvine’s knowledge,\na third party obtained and copied PacketLogic’s code. It might also be possible that both\nSandvine and other companies drew their code from the same third-party codebase.\n\n\n-----\n\nThere are, however, several reasons why the shared code hypothesis is unlikely to be an\naccurate explanation of our findings. First, the 2016 controversy within Procera about\nselling their solution to Turkey for surveillance (referred to in Section 1.3) indicates a\npossible prior business relationship between the company and Turkey. Second, we have\nnot been able to locate any codebase with both the same distinctive IPID value and the\nsame distinctive HTTP header format; the only references to IPID values of 133307\n(0x3412) we found were a 2016 OONI report about the ad injection we mention in\n**[Section 5, and a 2004 forum post by an individual in Sweden curious as to why he was](https://www.linuxquestions.org/questions/linux-networking-3/package-id-269218/)**\nseeing IPID values of 13330 when he tried to ping the IP addresses of his website’s\nvisitors with unsolicited TCP segments. It is significant in this regard that it was a\nSwedish company, Netintact AB, founded in 2000, that developed and sold the\n[PacketLogic product before Procera acquired the company in 2006. Third, performing](https://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=27408330)\nsingle packet injection in a TCP connection is a relatively simple feat to achieve; an\nengineer wishing to implement this functionality would likely not need to study or copy\nanother implementation.\n\n# 4. Turkey case: targeted malware injection\n\n_This section describes how DPI equipment that matches our Sandvine PacketLogic_\n_fingerprint is used to inject malware to users in Turkey and Syria who attempt to_\n_download common Windows software._\n\n## 4.1. Turkey background: information controls and surveillance\n\nIn spite of being a parliamentary democracy with decades of multi-party elections,\n[Turkey’s government is characterized by corruption, human rights abuses, and autocratic](https://www.transparency.org/country/TUR)\ntendencies on the part of the current Prime Minister Recep Tayyip Erdoğan. Turkey’s\nmilitary has traditionally been an important and occasional overbearing presence in\ndomestic politics, with the country experiencing several coup attempts. Information\n[controls played an important part in the most recent such attempt, which was foiled by](http://www.aljazeera.com/news/2016/12/turkey-failed-coup-attempt-161217032345594.html)\n[President Erdoğan in July 2016. Prior to the coup attempt, Turkish authorities routinely](https://motherboard.vice.com/en_us/article/bmvdj4/turkey-throttled-social-media-during-coup-in-evolution-of-internet-censorship-twitter-youtube-facebook)\n[throttled access to prominent social media sites, such as Twitter and Facebook. Erdoğan](https://www.reuters.com/article/us-mideast-crisis-socialmedia/turkey-appears-to-be-in-vanguard-of-throttling-social-media-after-attacks-idUSKCN0ZM2O3)\nused Apple’s Facetime video calling application during the coup attempt to plead with the\n[Turkish public to resist the plotters. While restrictions on social media were softened to](https://www.wsj.com/articles/erdogan-embraces-social-media-to-repel-coup-attempt-in-u-turn-1468760698)\nfacilitate popular opposition to the coup, the openness was short lived, with Internet\n[censorship returning (and even increasing) after Erdoğan successfully re-asserted his](https://www.cjr.org/opinion/turkey_coup_erdogan_press_freedom.php)\nauthority.\n\nAlthough there is widespread and growing popularity of social media in Turkey, which\n[provides citizens with an alternative to conservative state-controlled mainstream media,](https://www.transparency.org/news/pressrelease/transparency_international_condemns_forced_takeover_of_media_organisations)\n[the country has one of the most extensive Internet censorship regimes in the world. ISPs](https://www.dailydot.com/layer8/turkey-censorship-real-life/)\nroutinely throttle access to popular social media, make frequent requests to service\n[providers to remove content, and even implement occasional regional shutdowns.](https://turkeyblocks.org/2016/10/27/new-internet-shutdown-turkey-southeast-offline-diyarbakir-unrest/)\n[According to Twitter’s transparency report Turkey led the world with 2 710 removal](https://transparency.twitter.com/en/removal-requests.html#removal-requests-jan-jun-2017)\n\n\n-----\n\nrequests in the first six months of 2017. Although Turkey’s numerous security threats,\nand in particular those related to Islamist and other terrorist attacks, are provided as\njustifications for such expansive controls, Internet censorship has included a broad range\nof other content such as criticism of the Erdoğan regime.\n\nThe first Internet-related legislation in Turkey was passed in 2007. It is called “Law No.\n5651, Regulation of Publications on the Internet and Suppression of Crimes Committed\nby means of Such Publications,” or “Internet Law” for short. The Internet Law introduced\nInternet censorship across a range of content categories and mandated service providers\nto monitor online content passing through their infrastructure. Additional laws and\n[broader information controls were applied in the aftermath of the 2013 Gezi protests,](http://www.bbc.com/news/world-europe-22924886)\n[including Law No. 6532, passed in April 2014, which criminalized “the leaking and](https://www.hrw.org/news/2014/04/29/turkey-spy-agency-law-opens-door-abuse)\npublication of secret official information, punishable by a prison term of up to nine\nyears.” The law authorizes the Turkish intelligence agency, Milli İstihbarat Teşkilatı\n(MIT), to “collect data relating to external intelligence, national defense, terrorism,\ninternational crimes and cyber security passing via telecommunication channels.” These\nlaws and practices have imposed strict responsibilities on ISPs to block and disrupt access\n[to targeted URLs (in some cases through DNS poisoning), and to monitor and archive](https://www.internetsociety.org/blog/2014/04/turkish-hijacking-of-dns-providers-shows-clear-need-for-deploying-bgp-and-dns-security/)\n[Internet traffic for two years. The responsibilities have, in turn, prompted the acquisition](https://www.dailydot.com/layer8/turkey-procera-deal-isps-dpi/)\n[of mass and targeted surveillance technologies. A 2014 Citizen Lab report traced activity](https://www.dailydot.com/layer8/hacking-team-turkey/)\nrelated to Hacking Team spyware to an IP address owned by Türk Telekom, and a 2015\n[report mapped FinFisher spyware to Turkey.](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\n\nMIT’s practical implementation of the 2014 national security laws requires the\n[cooperation of the Turkish telecommunications sector, which is centralized around Türk](https://www.btk.gov.tr/File/?path=ROOT%2F1%2FDocuments%2FPages%2FMarket_Data%2F2017_Q1_Eng.pdf)\n[Telekom. While technically a private company, Türk Telekom is heavily controlled by the](https://freedomhouse.org/report/struggle-turkeys-internet/infrastructure-and-independence-why-turkeys-telecomms-sector-not-keeping-pace-demand)\nruling AKP party. The AKP exerts influence over Türk Telekom through its supposed\nindependent regulator, the Information and Communications Authority (which is itself\n[controlled by the state), as well as a large ownership stake controlled by the Turkish](https://freedomhouse.org/report/struggle-turkeys-internet/infrastructure-and-independence-why-turkeys-telecomms-sector-not-keeping-pace-demand)\nTreasury department. The government’s direct influence over Türk Telekom was\ndemonstrated following the July 2016 coup attempt, when several Türk Telekom senior\n[executives were purged from the company.](http://www.capacitymedia.com/Article/3578650/Middle-East/Executives-quit-Trk-Telekom-after-failed-coup-attempt)\n\n## 4.2. Localizing the targets of Turkey’s malware injection\n\nIn a February 2018 scan of Turkey, we identified five different malicious domain names\nthat were injected in response to HTTP requests for Opera. We performed traceroutes for\nthe targeted IP addresses and found targeting in at least five provinces, based on names\nwe found in the furthest downstream reverse DNS (PTR) record. Figure 7 shows the five\nprovinces where we identified injection.\n\n\n-----\n\n**Figure 7: Locations of the targets of spyware injection in Turkey and Syria.**\n\nOver five months of scanning we found a total of 259 targeted IP addresses. However, this\nis not a complete count of targeted IP addresses; we could only measure IP addresses that\nresponded to our scans (i.e., had an open TCP port).\n\nWe were able to develop a general sense of target identities by scraping data from public\nrouter pages hosted on some of the IP addresses. The pages show names chosen by the\npeople who set up the routers, including names of users sharing the connection. In some\ncases, the names chosen were of Syrian cities. We conducted on-the-ground testing in one\nsuch Syrian city and found that all users of a particular Internet reseller (sharing the same\nTürk Telekom IP) were targeted. We also found several router pages showing names\ncontaining “ypg” (e.g., ciwan.ypg and ypg-matar), indicating possible targeting of\nYPG (Kurdish militia) members or facilities. We also found that some routers were named\nfor resellers in Turkey and Syria. We found Facebook pages for some of the named\nresellers which showed images of the resellers building infrastructure to provide Internet\naccess using Türk Telekom leased lines (Figures 8 and 9).\n\n\n-----\n\n**Figure 8: One Turkey-based reseller whose customers appear to be targeted builds a**\n\n**tower to beam Internet to border areas in Syria’s Afrin region.**\n\n**Figure 9: Images posted by one Syrian-based reseller in the Idlib area whose users**\n**appear to be targeted. The reseller appears to redistribute Türk Telekom service via**\n\n**VDSL in one Syrian village.**\n\n\n-----\n\nAfter we sent letters to Sandvine and Francisco Partners on February 12, 2018, we ran\ntests on February 14 and February 16, 2018 which found that two targeted IP addresses–\non which we had observed injection since October 2017– no longer produced injection.\nWe conducted a full scan of Turkey on March 7, 2018 and found that these two IP\naddresses again produced injection, but with different domain names. Our March scan\nalso found that the operators of the injection had changed some of the injected domain\nnames.\n\n\n**Malware domain (Feb-**\n**ruary 2018)** **Malware domain (March 2018)**\n\n\n**Injection**\n**targets**\n**down-**\n**stream**\n**from**\n**location**\n\n\nsolitude.filedownload[.]today\n\n\nsystem.filedownloaders[.]com Hatay\n\n\nsystem.documentations[.]live epoch.englishdownloaders[.]today Gaziantep\n\n\nepiphany.downloaddocument[.]world\n\n\nepiphany.download-document[.]world Ankara (Ulus\nquarter)\n\n\nepoch.wind-files[.]today document.downloadingsystem[.]com Adana\n\n\ninternet.documentmanagement[.]today\n\n\ninternet.downloadingdocuments[.]com Diyarbakir\n\n\n### 4.3. Identifying targeted applications\n\nWe performed testing of targeted IP addresses to see what additional applications were\nbeing targeted. We sent requests like the one in Figure 10 for a variety of paths and\nfilenames matching popular Windows software. We tested filenames associated with the\n[IOCs from two earlier reports, as well as the top 20 Windows applications on](https://www.welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\nDownload.com (one of the IOCs from previous reports pointed to a file called\navast_free_antivirus_setup_online_cnet1.exe).\n\nGET [path] HTTP/1.1\nConnection: close\n\n**Figure 10: Form of requests that we sent to test for targeted applications.**\n\nWe found at least ten applications whose downloads were targeted for spyware injection.\n**Figure 11 lists the targeted applications we found, and for each application, a non-**\nexhaustive list of websites where targeted users’ downloads of these applications would be\ninjected with spyware.\n\n\n-----\n\n**If a user visits this**\n**site to download the**\n**application, the**\n**path will be fetched**\n**unauthenticated**\n**over HTTP**\n\n\n**Path**\n\n\n**Which ap-**\n**plication**\n**does this**\n**path typi-**\n**cally cor-**\n**respond**\n**to?**\n\n\n/opera/stable/windows Opera opera.com\n\n/vlc-2.2.8-win32.exe VLC download.videolan.org8\n\n/ccsetup539.exe CCleaner ccleaner.com\ndownload.com\n\n\n/wrar550.exe WinRAR\n32-bit\n\n/wrar540tr.exe WinRAR\n32-Bit\nTurkish\n\n/winrar-x64-550.exe WinRAR\n64-bit\n\n/winrar-x64-550tr.exe WinRAR\n64-Bit\nTurkish\n\n\ndownload.com\n\n?\n\ndownload.com\n\n?\n\n\n/7z1701.exe 7-Zip 7-zip.org\n\n\n/7z1701-x64.exe 7-Zip (64bit)\n\n\n7-zip.org\n\navast.com\ndownload.com\n\niobit.com\n\n\n/avast_free_antivirus_setup_online.exe\n/avast_free_antivirus_setup_online_cnet1.exe\n\n\nAvast\nAntivirus\n\n\n/driver_booster_setup.exe Driver\nBooster\n\n\n/SkypeSetup.exe Skype download.com\n\n\n/advanced-systemcare-setup.exe Advanced\nSystemCare\n\n\niobit.com\n\n\n**Figure 11: Applications targeted for spyware injection in Turkey.**\n\nSome of these websites supported HTTPS, but did not redirect users to the HTTPS\nversion when directly visited. As an example, when a user visited opera.com (the\nunencrypted version), they were not redirected to the HTTPS-encrypted version\nautomatically. According to Internet Archive data, Opera seems to have fixed the issue on\n\n\n-----\n\n[March 7, 2018, between 07:26GMT and 16:04GMT. Surprisingly, some websites we](https://web.archive.org/web/20180307072628/opera.com)\ntested, like avast.com, iobit.com, and ccleaner.com, used HTTPS on their main\nwebsite but directed users to download links that did not use HTTPS. While the user saw9\nan HTTPS page in their browser, the file that the page downloaded to their computer was\nvia HTTP (Figure 12). Targeted users in Turkey and Syria would have received spyware\ninstead of the legitimate version of the app. Sometime after February 13, 2018, Avast\n[fixed one page on their avast.com site to use HTTPS for downloads. However, as of the](https://www.avast.com/index)\n[publication date of this report, another page on avast.com redirects users to an insecure](https://www.avast.com/en-us/free-antivirus-download)\ndownload on download.com. Piriform fixed their ccleaner.com site to use HTTPS for\ndownloads sometime after February 23, 2018. Also, as of the date of publication, some\nwebsites we list in Figure 11 do not appear to support HTTPS at all, including\n**download.com, 7-zip.org.**\n\n**Figure 12: The Avast website in February 2018, showing an HTTPS padlock while**\n\n**automatically starting an insecure file download. The lack of HTTPS on the file**\n**download means that targeted users in Turkey and Syria will instead receive spyware.**\n\n**Avast fixed this particular issue in late February 2018.**\n\nThis situation can be particularly problematic for activists who may rely on advice to use\n[apps like CCleaner and Avast. For example, the digital security guide Security in a Box](https://securityinabox.org/en/)\n[advises the use of both products and links to the official websites of these products, both](https://securityinabox.org/en/guide/malware/)\nof which offered insecure downloads.\n\n## 4.4. Connection with FinFisher campaign\n\n[VirusTotal records that a sample of StrongPity-like spyware communicating with](https://www.virustotal.com/en/file/0a94c5ad0b6466b53ca363673dbac7b3e97030c4121048042f34f38769444ea8/analysis/)\nupdserv-east-cdn3[.]com was downloaded from download.downloading[.]shop, the same\n[site used to distribute samples of FinFisher. The updserv-east-cdn3[.]com server was also](https://www.welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\n\n\n-----\n\nthe command and control (C&C) server for the samples of StrongPity-like spyware\ndownloaded in a subsequent phase of the injection campaign that we observed, from sites\nincluding downloading[.]internetdownloading[.]co and\ndownloading[.]syriantelecom[.]co.\n\n# 5. AdHose: Mass connection hijacking to deliver affiliate ads in Egypt\n\n_This section describes how DPI equipment that matches our Sandvine PacketLogic_\n_fingerprint is installed on Telecom Egypt’s network at Egypt’s borders, and is used to_\n_deliver affiliate ads, cryptocurrency mining scripts, and perhaps nation-state spyware,_\n_to Egyptian Internet users._\n\n## 5.1. Egypt background: malware, surveillance, and censorship\n\nSeven years after the 2011 demonstrations in Cairo’s Tahrir Square, Egyptian President\nAbdel Fattah el-Sisi has escalated a violent crackdown against opposition and dissent.\nUnder the guise of combating terrorism, particularly following a series of ISIS church\nbombings, the el-Sisi government has engaged in mass arrests, forced disappearances,\nand torture against targeted journalists, human rights defenders, and protesters. The\nbrief window opened during the Arab Spring period has closed as el-Sisi has sought to\nstrengthen his rule and silence critics of his regime.\n\nThe Egyptian government has been widely criticized for its human rights abuses and\n[corruption. A May 2017 law ratified by el-Sisi was criticized as stifling dissent as it](https://www.reuters.com/article/us-egypt-rights/egypt-issues-ngo-law-cracking-down-on-dissent-idUSKBN18P1OL)\nimposes new restrictions on foreign NGOs, subjects groups to additional security\n[monitoring and financial reporting requirements, and imposes heavy fines on groups who](https://www.transparency.org/news/pressrelease/egypt_stop_the_onslaught_against_civil_society)\npublish without government permission. Reporters Without Borders has ranked Egypt\n[161st out of the 180 countries it included in its 2017 World Press Freedom Index. More](https://rsf.org/en/egypt)\n[than 15,000 civilians have been tried in military courts since 2014, and more than 800](https://www.hrw.org/world-report/2018/country-chapters/egypt)\npeople have been sentenced to death since 2013. Corruption is also endemic across all of\nsociety in Egypt, in spite of numerous attempts by various government agencies to reign it\nin. Transparency International ranked Egypt 108 out of 176 countries in its 2016\n[Corruption Perceptions Index.](https://www.transparency.org/country/EGY)\n\n[Egypt adopted a new constitution following a January 2014 referendum. While the](https://www.theguardian.com/world/2014/jan/18/egypt-constitution-yes-vote-mohamed-morsi)\nrevised constitution does contain provisions protecting freedom of expression, access to\n[information, and freedom of the press, it also contains exceptions which allow censorship](https://freedomhouse.org/report/freedom-press/2017/egypt)\nduring periods of war or state of emergency. Prior to the 2011 Arab Spring, Egypt had\n[generally been under a continuous state of emergency since 1958. Following a short](http://www.atlanticcouncil.org/blogs/menasource/the-state-of-emergency-in-egypt-an-exception-or-rule)\nreprieve in 2012, successive Egyptian governments have repeatedly reimposed emergency\n[rule, and most recently in January 2018. Such declarations expand the arrest and](https://www.reuters.com/article/us-egypt-security/egypt-to-extend-state-of-emergency-for-3-months-mena-idUSKBN1ER1B0)\ndetention powers of security forces and permit media censorship. El-Sisi has also targeted\nthe country’s judiciary by ratifying a bill which empowers him to select the courts’ chief\n\n\n-----\n\n[justices. Several potential political candidates have been arrested or face intimidation and](https://www.aljazeera.com/news/2018/02/egypt-curbs-opponents-presidential-election-180207095350993.html)\nphysical violence in advance of the March 2018 Presidential election. The election, which\n[is virtually guaranteed to see el-Sisi elected to a second term, has been widely criticized as](https://www.aljazeera.com/news/2018/01/egypt-presidential-election-rendered-irrelevant-180122125426620.html)\nundemocratic.\n\nTelecommunications surveillance is facilitated under the 2003 Telecommunications\nRegulation Law. This law compels telecommunications operators to provide technical\ncapacity for the military and national security entities to “exercise their powers within the\nlaw” as well as prohibiting the use of “telecommunication services encryption equipment”\n[without written authorization from entities including the armed forces. Article 73 of the](https://internetlegislationatlas.org/#/countries/Egypt/frameworks/surveillance)\nTelecommunications Law prohibits telecommunications providers from interfering with\nany part of a telecommunication message.\n\nThe ongoing crackdown against critical voices has extended to online censorship. The\npre-Arab Spring Mubarak government did not engage in widespread online censorship.\nHowever reports of censorship have increased in recent years. Testing conducted by the\n[OONI project in 2016 confirmed reporting that Qatari-owned news website The New](https://www.theguardian.com/media/2016/jan/05/saudi-arabia-uae-egypt-block-access-qatari-news-website)\nArab and its Arabic language version were blocked.\n\nCensorship in Egypt has also reflected regional concerns. Egypt, and four other Arab\n[states including Saudi Arabia, have accused Qatar of supporting terrorism and](https://www.aljazeera.com/news/2017/07/egypt-compromise-dispute-qatar-170725132801327.html)\ndestabilizing the region. In response, Egypt was reported in May 2017 to have blocked\n[access to 21 news websites for “supporting terrorism and spreading false news”. The](https://www.reuters.com/article/us-egypt-censorship/egypt-blocks-21-websites-for-terrorism-and-fake-news-idUSKBN18K307)\nblocked websites included Qatar-based Al Jazeera as well as prominent local independent\nnews website Mada Masr. In September 2017 Egypt blocked the Human Rights Watch\n[website one day after HRW released a report documenting the use of torture by the](https://www.hrw.org/report/2017/09/05/we-do-unreasonable-things-here/torture-and-national-security-al-sisis-egypt)\ncountry’s security services.\n\nThe use of surveillance technology by the Egyptian government has been widely\ndocumented, particularly the technologies operated by an obscure intelligence agency\n[called the Technical Research Department (TRD). A 2015 Citizen Lab report identified](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nthat a server used in the operation of FinFisher surveillance malware was present on\nnetworks operated by the TRD. Similarly, Privacy International obtained documents\nleaked from Nokia Siemens Networks which showed that the company sold an\ninterception management system and monitoring centre to the TRD. The leaked emails\nfrom surveillance company Hacking Team indicated that the company had sold its\nsurveillance malware system to the TRD for more than 1 million Euros.\n\n[A 2017 Citizen Lab report documented a large-scale phishing campaign against Egyptian](https://citizenlab.ca/2017/02/nilephish-report/)\ncivil society members. Virtually all of the targets identified in this report were implicated\n[in Case 173, a legal case brought by the Egyptian government against domestic NGOs. In](https://www.amnesty.org/en/latest/campaigns/2016/12/close-case-173/)\nthis case, the government has accused NGOs of improperly receiving foreign funding and\nengaging in prohibited activities.\n\n## 5.2. Following up on earlier findings\n\n\n-----\n\n[A September 2017 report found FinFisher spyware injected via HTTP 307 redirect](https://www.welivesecurity.com/2017/09/21/new-finfisher-surveillance-campaigns/)\nmatching the format in Figure 1 using the URL http://108.61.165[.]27/setup/TrueCrypt7.2.rar, (024d37333bf79796813e76ada77720cd according to VirusTotal). That FinFisher\nsample’s command and control (C&C) server is 199.195.193.34. We found another\nFinFisher sample (3947a9c9099d4728ff2ceaed2bd7edb3) with the same C&C; VirusTotal\nrecords the sample as being downloaded from\nhttp://185.82.202[.]133/setup/Threema.rar. When we tested 185.82.202.133, we found\nthat it was running cPanel, and the email address associated with the cPanel installation\n[was an email address we know to be associated with the TRD based on past work the](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nCitizen Lab has conducted. We conducted Internet scanning of Egypt, sending every IPv4\naddress an HTTP request to download the TrueCrypt setup file, but did not find any\nspyware injection. However, we discovered a system we call AdHose that was redirecting\nEgyptian Internet users to affiliate ads and cryptocurrency mining scripts.\n\n**Figure 13: Diagram of how AdHose seems to work in Egypt.**\n\nWe identify two modes of AdHose. In spray mode, a middlebox redirects Egyptian\nInternet users en masse to ads or cryptocurrency mining scripts whenever they make a\nrequest to any website. In trickle mode, only requests to certain URLs are redirected. It\nappears that spray mode is enabled sparingly, whereas trickle mode appears to be in\noperation mostly continuously.\n\n\n-----\n\n## 5.3. Discovering AdHose\n\nWhen checking Shodan for HTTP 307 redirects (Section 3.2), we noticed a large\nnumber of redirects returned by Egyptian IPs to what appeared to be an advertising site\n(Figure 14). The site embedded further redirects to affiliate ads.\n\nHTTP/1.1 307 Temporary Redirect\nLocation: http://static.dbmads.com/static.html\nConnection: close\n\n**Figure 14: Suspicious HTTP redirect returned by Egyptian IPs.**\n\nWhile we were conducting an (unrelated) scan of the IPv4 Internet (from outside Egypt),\nwe captured these redirects being injected, solely for IP addresses in Egypt. The redirects\nwere injected during 32 minutes of our scan (on January 8, 2018 between 10:23:36\n**– 10:55:12 Egypt time). The advertising redirects were injected in response to requests**\nwe sent of the form in Figure 15 (where “%s” is the IP address we were scanning).\n\nGET / HTTP/1.1\nHost: %s\nUser-Agent: Mozilla/5.0\n\n**Figure 15: HTTP request sent by our scan that elicited ad injection.**\n\nThe PCAPs we recorded during our scan show that each instance of injection matches our\nentire fingerprint in Section 3.3. Namely, all injected packets have IPID = 13330, no IP\nflags, match the expected 307 Redirect format, and involve the packet injector sending an\nunsolicited final ACK packet ~100ms after injecting the redirect. This indicates that the\nredirect was likely being injected by Sandvine PacketLogic devices as configured by the\noperators.\n\nDuring the 32 minutes on January 8 when injection was active, we both scanned and\nreceived a response containing data from 3,337 IP addresses in 27 ASNs in Egypt (as\n[determined by MaxMind GeoLite2 country database). 1,239 IP addresses in 17 ASNs](https://dev.maxmind.com/geoip/geoip2/geolite2/)\nreturned the advertising redirect, for an injection rate of ~38%. This appears to be an\ninstance of the AdHose spray mode. Figure 16 shows the ASNs in which we observed\ninjections, indicating that the middleboxes used for injection are upstream from these\nASNs.\n\n\n-----\n\n**ASN #** **ASN Description**\n\n24863 Link Egypt (Link.NET)\n\n8452 Telecom Egypt (TE)\n\n20928 Noor\n\n36992 Etisalat Misr\n\n24835 Vodafone / Raya Telecom\n\n37031 Misr Information Services & Trading (MIST)\n\n36935 Vodafone\n\n37069 Mobinil\n\n33785 City Net Telecom\n\n30993 Egypt Centers\n\n20484 Yalla Online\n\n36408 CDNetworks\n\n328067 EGIT\n\n31619 City Stars\n\n31065 Egyptian Ministry of Communications and Information Technology (MCIT)\n\n25576 Armed Forces Main information Center (AFMIC)\n\n15475 Nile Online (NOL)\n\n**Figure 16: ASNs where we observed injection in Egypt.**\n\n## 5.4. A multi-year campaign\n\n### OONI’s report and data\n\nOur data matches up with findings that the network interference measurement project\n[OONI published in August 2016. OONI’s work revealed affiliate ad injection when users](https://ooni.torproject.org/post/egypt-network-interference/)\nattempted to access certain pornography websites in Egypt. OONI’s findings matched all\nelements of the fingerprint we described in Section 3.3, which suggests that the ad\ninjection they identified in 2016 was also the result of Sandvine PacketLogic devices as\nconfigured by the operators.\n\n\n-----\n\nAdditional historical OONI data that we reviewed showed evidence that two domains,\n_copticpope[.]org (the former website of the Pope of the Coptic Orthodox Church of_\nAlexandria) and babylon-x[.]com (a former pornographic website), have been targeted by\nAdHose in trickle mode. As a result, visitors to these websites were continuously\nredirected to ads, regardless of whether spray mode was active. We confirmed these\nfindings in our own scans in February 2018. We also identified an October 2016 post on\nWebhostingtalk which indicated that visitors to a free web counter JavaScript file,\nhttp://s10.histats[.]com/js15.js, were redirected to advertisements linked to the\n_infinitads[.]com domain. We tested accessing this URL from within Egypt and found that_\nit is targeted by AdHose in trickle mode.\n\n### Censys captures AdHose spray\n\nWe found that the 7547-cwmp-get-full_ipv4 Censys scan performed on 10 **January 3,**\n**2018 captured AdHose** **in** **spray mode between 15:50:23 – 16:32:02 local time.**\nCensys both scanned and received a response containing data from 5,702 IP addresses in\nfour ASNs in Egypt during this period. Of these 5,702 IPs, 5,443 in four ASNs returned\nthe advertising redirect, for an injection rate of ~95%.\n\n### Enumerating affiliate IDs\n\nWe looked at historical OONI data and enumerated all HTTP 307 redirects within Egypt\nthat did not match the domain from which they were redirected. Within this list, we\nlooked for any domains returned which appeared to be domains hosting advertising pages\n(for example, we manually filtered out domains that appeared to be ISP or billing\nnotifications). To this list, we added the injected domains that OONI previously reported.\n\nWe then gathered all copies of all pages on these domains archived by the Internet\nArchive, and looked for affiliate links included in the HTML source of the webpages (or\nany pages they redirected to). We also manually visited URLs in cases where the Internet\nArchive did not retain past copies. As a result of this process, we obtained the list of\naffiliate links and IDs we believe were used by the AdHose operators, shown in Figure\n**17.**\n\n\n-----\n\n**Ad**\n**Net-**\n**work** **Affiliate Link** **Affiliate IDs**\n\n\nAdvertising\nTechnologies\nLtd.\n\nTerra\nAdvertising\nCorp\n\nAdvertica.ae\n\n(Unid\nentified)\n\n\nhttp://go.pub2srv[.]com/afu.php?\nzoneid=1251527\nhttp://go.ad2upapp[.]com/afu.php?\nid=1209127\n\nhttp://go.ad2upapp[.]com/afu.php?\nid=773263\n\nhttp://go.ad2up[.]com/afu.php?id=862744\n\nhttp://go.ad2up[.]com/afu.php?id=758873\n\nhttp://go.ad2up[.]com/afu.php?id=773263\n\nhttp://go.oclasrv[.]com/afu.php?\nid=896707\n\nhttp://go.ad2upapp[.]com/afu.php?\nid=723454\n\nhttp://go.deliverymodo[.]com/afu.php?\nid=723454\n\nhttp://www.hitcpm[.]com/watch?\nkey=e4c634c55ad300b85c8760d9e09104cd\nhttp://www.urldelivery[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttp://cs6hm[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttp://cpm10[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttp://www.clicksgear[.]com/watch?\nkey=3e73d64a401c1e5b8b3eb33316b711e0\n\nhttps://ylx-4[.]com/fullpage.php?\nsection=General&pub=175258&ga=g\nhttps://ylx-4[.]com/fullpage.php?\nsection=General&pub=125652&ga=g\n\nhttp://conceau[.]co/out?\nzoneId=2692073&htatb=1&sId=2692073\n\n\n723454\n758873\n\n773263\n\n862744\n\n896707\n\n1209127\n\n1251527\n\ne4c634c55ad300b85c8760d9e09104cd\n3e73d64a401c1e5b8b3eb33316b711e0\n\n125652\n175258\n\n2692073\n\n\n-----\n\n**Ad**\n**Net-**\n**work** **Affiliate Link** **Affiliate IDs**\n\n\nCoinhive\n(Monero\ncryptocurrency\nmining)\n\n\nhttp://cnhv[.]co/fmwi\n\n\n**Figure 17: Affiliate links we believe were used by AdHose operators.**\n\nWe saw a significant overlap between the ad networks mentioned in the OONI report and\nAdHose. For example, we saw in the hosting history that static.dbmads[.]com forwarded\nusers to ad2upapp[.]com, which was mentioned in the initial OONI report. Additionally,\nthe infinitads[.]com domain mentioned in the OONI report was forwarded to\nstatic.dbmads[.]com at several points in time. This overlap suggests to us that the same\nactors have been involved since at least October 2016.\n\n## 5.5. Localizing Egypt’s middleboxes\n\nWe conducted tests that localized the AdHose middleboxes to a Telecom Egypt\ndemarcation point.\n\nWe noticed that for AdHose, the redirects were injected upon receipt of an HTTP\nresponse, rather than an HTTP request. In this case, sending a request to a server did not\ntrigger an injected response unless the server received the request, and returned a proper\nHTTP response.\n\nWe verified that we could configure our second-hand PacketLogic device to inject on\nresponses rather than requests, such as by adding a condition on the injection rule that\nwould not be known until the device saw the response (e.g., the condition “HTTP\nresponse code == 200”).\n\n### Test 1: localizing AdHose\n\nBecause AdHose only injects data in response to HTTP responses, sending TTL limited\nHTTP requests cannot localize AdHose. We instead sent a TTL-limited FIN/ACK packet\nafter properly establishing a TCP connection, but before sending a default-TTL HTTP\nrequest with a Host header for one of the AdHose domains (copticpope[.]org). By varying\nthe TTL of the FIN/ACK packet, we could identify the link on which the middlebox first\nsaw the FIN/ACK (and the end-host in Egypt did not). We hypothesized that when the\nmiddlebox first saw the FIN/ACK, it might consider the connection closed and not\n\n\n-----\n\nperform any injection on the server’s response. Thus, we would expect to find some\nnumber X, where setting the TTL to Y (≥ X) would cause us to receive the legitimate\nresponse from the server, and setting the TTL to Z (< X) would cause us to receive the\nredirect injected by AdHose.\n\nWe did indeed observe this behavior; the first link on which we saw the legitimate\nresponse from the end-host in Egypt (and not the injected response) was between\n130.117.50.166 (be3093.ccr22.mrs01.atlas.cogentco.com) and 149.14.125.162 (telecomegypt.demarc.cogentco.com), which appears to be a cable link between Marseilles,\nFrance, and Egypt.\n\n### Test 2: localizing censorship\n\nIn this test, we found that the same device that was running AdHose was also performing\nInternet censorship in Egypt. We localized the censorship functionality of the device by\nsending a TTL-limited HTTP request to a blocked website (www.aljazeera.net). By\nvarying the TTL of the HTTP request, and observing whether we received an injected\nRST/ACK packet, we could identify the link where the device first saw the request.\n\nThe first link on which we saw an injected RST/ACK packet was between 130.117.50.166\n(be3093.ccr22.mrs01.atlas.cogentco.com) and 149.14.125.170 (telecomegypt.demarc.cogentco.com), which appears to be the same cable link that we found in\nTest 1.\n\nGiven that we localized both AdHose and Internet censorship to the same link, we believe\nthat the same PacketLogic device is being used to carry out both functionalities.\n\n# 6. Egypt & Turkey Censorship Testing\n\n_This section describes how DPI equipment that matches our Sandvine PacketLogic_\n_fingerprint is blocking political and human rights content in Egypt and Turkey._\n\n## 6.1. Websites blocked\n\nIn Egypt, we found that devices matching our Sandvine PacketLogic fingerprint are being\nused to block dozens of human rights, political, and news websites including Human\nRights Watch, Reporters Without Borders, Al Jazeera, Mada Masr, and HuffPost Arabi. In\nTurkey, we discovered that these devices are being used to block websites including every\nlanguage version of Wikipedia, the website of the Dutch Broadcast Foundation (NOS),\nand the website of the PKK (Kurdistan Workers’ Party).\n\nThe blocking is implemented by injecting TCP reset packets. The TCP reset packets have\nIPID 13330, and no IP flags, and match our fingerprint (Section 3.3). These\ncharacteristics suggest that Sandvine PacketLogic devices are being used to carry out the\nblocking.\n\n\n-----\n\n## 6.2. Website blocking in PacketLogic\n\nWe tested blocking a website using our second-hand Sandvine PacketLogic device\n(Section 3.3). This test involved creating a PropertyObject to match requests whose\nhostname was hrw.org and then a Filtering Rule that terminates all connections\nmatching the Property Object by using the built-in Reject action.\n\n**Figure 18: How we set up our PacketLogic device to block the website of Human Rights**\n\n**Watch. We believe a similar setup exists in Egypt.**\n\nRequests with an HTTP host header of hrw.org were terminated by an injected RST\npacket. Requests with a TLS client hello message with the SNI extension set to hrw.org\nwere also terminated.\n\nOur experiment (Figure 19, Figure 20) matched elements 1-4 of our fingerprint. Note\nthat the timestamp discrepancy in the PCAP files is because the server and client clocks\nwere not synchronized.\n\n**Client sends GET request for hrw.org**\n\n17:34:54.213576 IP (tos 0x0, ttl 64, id 0, offset 0, flags [DF], proto TCP (6), length 123)\n192.168.1.27.49482 > 192.168.1.26.8080: Flags [P.], seq 1:72, ack 1, win 4117, options\n\n[nop,nop,TS val 756752097 ecr 2094875405], length 71: HTTP, length: 71\nGET / HTTP/1.1\nHost: hrw.org\nUser-Agent: curl/7.54.0\nAccept: */*\n\n**Client receives injected RST/ACK**\n\n17:34:54.213805 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length\n\n\n-----\n\n40)\n192.168.1.26.8080 > 192.168.1.27.49482: Flags [R.], seq 1, ack 72, win 32120, length 0\n\n**Figure 19: PacketLogic content blocking via Reject rule from the client side.**\n\n**Server receives injected RST/ACK**\n\n17:34:36.051889 IP (tos 0x0, ttl 64, id 13330, offset 0, flags [none], proto TCP (6), length\n40)\n192.168.1.27.49482 > 192.168.1.26.8080: Flags [R.], seq 72, ack 1, win 32120, length 0\n\n**Figure 20: PacketLogic content blocking via Reject rule from the server side.**\n\n# 7. Communication with Sandvine and Francisco Partners\n\n[Citizen Lab sent letters to executive leadership at Sandvine and to Procera](https://citizenlab.ca/wp-content/uploads/2018/03/February-12-2018-letter-from-Citizen-Lab-to-Sandvine.pdf)\n[Networks/Sandvine owner Francisco Partners on February 12, 2018. Our letters notified](https://citizenlab.ca/wp-content/uploads/2018/03/February-12-2018-letter-from-Citizen-Lab-to-Francisco-Partners.pdf)\nthe companies of our research findings and raised questions concerning their human\nrights impact. We received an initial response from both companies on February 13 which\nconfirmed their receipt of our letters and indicated that they would provide us with a\nreply.\n\n[A February 16, 2018 letter from Sandvine laid out the company’s response in more detail,](https://citizenlab.ca/wp-content/uploads/2018/03/February-16-2018-letter-from-Sandvine.pdf)\ncharacterizing the statements in our letter as “false, misleading, and wrong”; demanding\nreturn of the second-hand PacketLogic device that we used to confirm attribution of our\nfingerprint; describing Sandvine’s “Comprehensive Business Ethics Program”; and noting\nthat any public statements we make “that are factually inaccurate or based on improper\nuse of [the PacketLogic] product . . . will be met with vigorous fact-based rebuttal and a\nstrong legal response . . . .” Citizen Lab replied to this email the same day noting that we\nhad withdrawn the original publication date to carefully review the points they raised and\nundertake further due diligence.\n\nSandvine asserted in its February 16 letter that its PacketLogic product “is not capable of\nMan-in-the-Middle (MITM) attacks and not capable of any form of payload injection,\nmalicious or not,” and that Citizen Lab’s findings were therefore incorrect. Our research,\nhowever, does not suggest that the PacketLogic device is capable of injecting traffic with\nthe malicious code outright. Rather, the spyware injection and advertising injection were\ncarried out by injecting HTTP 307 redirects that caused a target’s browser to\nautomatically fetch malicious code from a separate website. As described in Section 2,\nthe injection of various HTTP redirects is an established spyware and advertising\ninjection technique. Additionally, Sandvine acknowledged in its letter that the\nPacketLogic design “does not permit the end user to inject a payload larger than 1 packet.”\nThis assertion, indicating an injection of one packet is possible, is consistent with our\nfindings regarding the injection of a redirect command, which is one packet in size.\n\n\n-----\n\nNotably, in the February 16 letter, Sandvine also expressed its commitment to the ethical\n[use of its product. It referred to the company’s webpage regarding “Ethics and Human](https://www.sandvine.com/company/corporate-ethics)\nRights protection at Sandvine,” which provided:11\n\n_A key part of [Sandvine’s] innovation process is to ensure that we do not lose sight of the_\n_ethical impact of our technology on human rights, freedom of speech, and privacy._\n_Sandvine has taken the approach on regulating access to the components of our_\n_solutions that could be used to infringe on any of these. The usage of our regulatory_\n_compliance solutions are controlled by a EULA and software licenses that are required_\n_for any components that could conceivably be used to violate human rights, freedom of_\n_speech, and privacy._\n\nThe letter noted that Sandvine’s EULA prohibits injection of malicious payloads. The\nletter also indicated that the company maintains a Business Ethics Committee (BEC) “to\nreview and approve the sale of products and services to customers.” The webpage details\nhow Sandvine’s BEC uses “the World Bank Index” (an apparent reference to the\n[Worldwide Governance Indicators) to review sales to certain countries. The BEC assesses](http://info.worldbank.org/governance/wgi/#home)\nthe indicators associated with the following areas of governance: voice and accountability\n(which includes freedom of expression-related indicators); political stability and absence\nof violence/terrorism; rule of law; and control of corruption. The Sandvine webpage\nstates:\n\n_Any country not rated an “A” by the World Bank must be approved by the BEC and a_\n_certificate of compliance signed by the customer acknowledging that they will not use_\n_the technology to violate human rights based on the regulatory compliance use case(s)_\n_deployed. Sandvine employees and resellers are prohibited from selling solutions to_\n_countries that are embargoed or sanctioned by the EU, US, and/or UN or are rated a_\n_“D” by the Word Bank._\n\nIt is unclear, however, what letter grade ratings are referred to in this policy, or how they\nare determined, as the Worldwide Governance Indicators provide percentile rankings for\ncountries rather than a letter grade.\n\nWhile Sandvine did not comment on the existence or any aspect of business dealings in\nEgypt or Turkey, citing contract confidentiality clauses, the BEC assessment process it\noutlines would appear to apply to sales in both countries. The Worldwide Governance\nIndicators reflect the following 2016 percentile rankings (0 to 100) for Egypt and12\nTurkey in the categories utilized by Sandvine’s BEC:\n\n\n**Voice and**\n**accountabili-**\n**ty**\n\n\n**Political stability and absence**\n**of violence / terrorism**\n\n\n**Control of**\n**corruption**\n\n\n**Rule**\n**of**\n**law**\n\n\nEgypt 14 9 36 32\n\n\nTurkey\n\n\n30 6 49 50\n\n\n-----\n\nThe low percentile rankings assigned to those countries — single digits in the “political\nstability and absence of violence / terrorism” category, and in no case surpassing 50th\npercentile — suggest at a minimum that the BEC would have been called upon to assess\nand approve any such sales that took place, and require certificates of compliance from\nthe customers.\n\n[On February 20, 2018, Francisco Partners sent its own response to our letter,](https://citizenlab.ca/wp-content/uploads/2018/03/February-20-2018-email-from-Francisco-Partners.pdf)\nemphasizing that the firm “recognizes the importance of corporate governance and social\nresponsibility.” The firm went on to state: “We spend considerable time and effort\nregarding the thoughtful development and implementation of proper governance and\nsocial responsibility policies and processes for Francisco Partners and for the companies\nin which we invest.” The firm noted that, as an investor, it works “with company\nmanagement teams to enhance (where necessary) and to implement robust corporate\ngovernance principles, business processes and policies, and business strategy, including\nsocial responsibility policies and practices.” It also “mandates the adoption of compliant\nbusiness ethics policies and processes. Where appropriate, such policies and processes\nare based on, among other things, the engagement of outside parties and a variety of\nbenchmarking information sources, including World Bank information.”\n\n[On March 1, 2018, Citizen Lab replied to Sandvine. We emphasized that we were](https://citizenlab.ca/wp-content/uploads/2018/03/March-1-2018-letter-from-Citizen-Lab-to-Sandvine.pdf)\nconfident in our research findings, which two independent peer reviews confirmed. We\nalso posed additional questions regarding Sandvine’s business ethics program. On March\n[7, 2018, Sandvine sent a letter to the University of Toronto, expressing its continuing](https://citizenlab.ca/wp-content/uploads/2018/03/March-7-2018-letter-from-Sandvine.pdf)\nconcern that the Citizen Lab report “will contain false, inaccurate and misleading\ninformation that has the potential to do significant harm to the company, its shareholders\nand its customers.” Sandvine “demand[ed] that the report not be released publicly at this\n[time” and laid out the reasons for that demand. External counsel responded to Sandvine’s](https://citizenlab.ca/wp-content/uploads/2018/03/UofT-Sandvine-Letter-to-Lyndon-Cantor-signed-8-March-2018.pdf)\nletter on behalf of the University of Toronto and Citizen Lab on March 8, 2018.\n\n# 8. Conclusion: Dual-Use Technology, Unrestrained\n\nDeep packet inspection technology is now ubiquitous across network environments. DPI\ndevices supporting network injection can be used by ISPs for a range of ostensibly\nlegitimate uses, from alerting users to billing issues to bandwidth cap limits — all broadly\nmarketed under the rubric of what DPI companies refer to benignly as “Quality of\nService” or “Quality of Experience.” However, as our investigation demonstrates, network\ninjection can also be used for harmful purposes. Depending on how DPI systems are\nconfigured, they may even present serious human rights risks, such as censoring access to\ncontent or, worse, silently infecting users with malware, and all without the person\naffected by the censorship or targeted by the malware realizing what has occurred.\nEvidently, the technology can also be easily repurposed for mass-scale revenue scams.\n\nDespite the risks of harms and abuses, the market for this powerful technology remains\nlargely unregulated. Export controls that were agreed upon within the framework of the\n[Wassenaar Arrangement explicitly exclude “systems or equipment, specially designed for](http://www.wassenaar.org/)\n\n\n-----\n\n. . . a. Marketing purpose; b. Network Quality of Service (QoS); or c. Quality of Experience\n(QoE)” from the scope of controlled IP network communications surveillance systems or\nequipment. Yet the integration of functions, including network injection, in a\ncustomizable, multipurpose network solution raises difficult questions regarding end use\ndeterminations and proper methods for prevention of misuse of the technology.\n\nRegardless of the specific business sector, all companies have a responsibility to prevent\nthe misuse of their products and services in ways that undermine human rights. The UN\nGuiding Principles on Business and Human Rights note that businesses should “avoid\ncausing or contributing to adverse human rights impacts” and “address such impacts\nwhen they occur.” Moreover, the UN Guiding Principles clarify that companies should\n“seek to prevent or mitigate adverse human rights impacts that are directly linked to their\noperations, products or services by their business relationships, even if they have not\ncontributed to those impacts.” As described in this report, however, Sandvine appears to\nhave provided such tools in Turkey and Egypt — two countries with documented poor\nhuman rights records — and may have serviced these tools on the ground as well.\nAdditionally, prior reporting of internal company discussions at Procera Networks show\nclearly that concerns were raised inside the company about equipping the Turkish regime\nwith technology that could be used for surveillance. The company is or should be aware of\nthe potential for misuse of its product in Turkey. Despite the human rights concerns\nraised, Sandvine/Procera evidently chose to move ahead with provision of technology to\nTurkey.\n\nThe apparent use of Sandvine technology to engage in network injection in Egypt and\nTurkey is even more troubling in light of the “strong safeguards” that Sandvine asserts it\nmaintains “regarding social responsibility, human rights, and privacy rights.” Sandvine\nappears to have technical means in place to prevent misuse of its technology, noting in its\nFebruary 16 letter that it “implements stringent software license controls that limit access\nto specific product capabilities outside of an intended use case.” The malicious and\ndubious activities that appear to have been conducted through the use of PacketLogic\ndevices as documented in this report suggest that Sandvine’s safeguards have come up\nshort — despite the Procera controversy over dealings in Turkey that was publicly\nreported in 2016, which put the company on notice of the potential human rights impact\nof sales and services in Turkey. We recommend that Sandvine engage in regular\nconsultation with civil society regarding its human rights due diligence and business\nethics program, and enhance transparency surrounding its sales review process and postsale technical controls. We also recommend that Sandvine establish an operational-level\ngrievance mechanism, in line with the UN Guiding Principles on Business and Human\nRights, to address incidents of misuse of its products, and clearly communicate to the\npublic how to report concerns, the timeframe in which one can expect to receive a13\nresponse, and remedial action taken.\n\nWe recommend that both dual-use technology developers and investors carefully consider\ntheir human rights policies and due diligence practices in light of the changing regulatory\nand social landscape and growing expectations surrounding corporate social\n\n\n-----\n\nresponsibility. Francisco Partners in particular appears to have targeted dual-use\ntechnology companies as a lucrative sector for investment, given the company’s prior\ninvestment in companies such as Blue Coat and NSO Group. Proactive efforts within the\nfirm to incorporate and promote human rights due diligence, as Francisco Partners\ntouched on in its correspondence, could help address the risks of abuse present in this\nsector. We recommend that Francisco Partners publicly release its own corporate social\nresponsibility policies and practices, as well as those that it promotes among its\ninvestment companies, and engage with civil society in a transparent manner regarding\nhow those policies and practices could be improved. We also recommend that\ngovernment entities, including the newly established Canadian Ombudsperson for\nResponsible Enterprise (which would have jurisdiction over Sandvine as a corporation\nbased in Canada), consider the significant human rights implications of network tools\ncapable of network injection in responding to the lack of oversight, transparency, and\naccountability in the surveillance market.\n\nThe findings of this report also illustrate the urgent need for ubiquitous adoption of\nHTTPS by website developers. Handling web traffic over unencrypted channels leaves\nusers vulnerable to network injection techniques that may expose them to spyware,\nunwanted advertising, or other Internet scams. Particularly on sites offering software\ndownloads (some of which may be billed as “secure”), companies and developers\nresponsible for such platforms must ensure the proper use of encryption.Ultimately, the\nuse of products that provide network injection features on public ISP networks, as\nidentified in this report, represents a major global public safety risk. Network injection\ncan be used to take advantage of access to a user’s unencrypted web traffic to replace\nexpected data with malicious or inappropriate code, often in a manner undetectable to the\naverage user. Francisco Partners’ recent acquisition of Sandvine is especially troubling in\nthis regard, since the investment firm’s portfolio also includes NSO Group, one of the\nworld’s leading providers of spyware whose products are associated with numerous cases\nof abuse. The prospect of such powerhouse surveillance technologies being sold to\ncompanies operating in autocratic regimes, or autocratic regimes themselves, and in\njurisdictions wherein human rights are flagrantly abused, should be cause for concern.\n\n# Acknowledgements\n\nBill Marczak’s work on this project was supported by the Center for Long Term\nCybersecurity (CLTC) at UC Berkeley. This work was also supported by grants to the\nCitizen Lab from the Ford Foundation, the John T. and Catherine D. MacArthur\nFoundation, the Oak Foundation, the Open Society Foundations, and the Sigrid Rausing\nTrust. This work includes data from the Open Observatory of Network Interference\n[(OONI), Censys, VirusTotal, and RiskIQ.](https://censys.io/)\n\nEditing and other assistance provided by Masashi Nishihata, Jeffrey Knockel, Christopher\nParsons, Lex Gill, and Miles Kenyon. Research assistance provided by Elizabeth Gross\nand Gabrielle Lim.\n\n\n-----\n\n# Additional data can be found here\n\n Appendix A: Turkey malware injection IOCs\n\n### Initial Campaign\n\n**Domains of injected redirects**\n\ndownload.downloading[.]shop\ndownloading.syriantelecom[.]co14\ndownload.syriantelecommunications[.]co\nredirection[.]bid\n\n### Phase 2 Campaign\n\n**Domains of injected redirects**\n\ndownloading.internetdownloading[.]co\ndownload.downloadering[.]co\n\n**Malware hashes**\n\n08d971f5f4707ae6ea56ed2f243c38b7\n20755b98d7c094747b75b157413e3422\n3632fb080545d3518d57320466f96cb3\n40383bee9846ecbd78581402e3379051\n449ba12127133ecd0440a558b083468c\n461446151be0033a668782c2d7ba58cb\n56bc314bc0d4a0a230a4de2bf978b5ae\na070fd2cce434a6f0b0d0fa6d3278d22\nbe6f2a03dfddbaf1166854730961d13c\nd7ec065cc3f563928504f80692578d2f\nf344da38958dbc730ddebc10660cd451\nfa90508007b94a4dbfeb8b48d5443ec8\n\n**Malware C&C**\n\nupdserv-east-cdn3[.]com\n\n### Phase 3 Campaign:\n\n**Domains of injected redirects**\n\ncomputing[.]downloaders[.]today\nstorage[.]computingdownloads[.]life\nwindow[.]processingdownloads[.]today\n\n\n-----\n\n**Malware hashes**\n\n001316808aa7108b467e8ecc06139c2e\n5c3f0dcf4aaa699b50154aa245923c86\n7fd98d6bb1e9d6bcf2e1984e812c1e46\n89180820b47bb11ccf0c8505371e98d1\n8bb2ba6f1cfa3bd99146688cd1e76bb0\n8c8eb5cfc5642a773c5f2b5f59148aa3\n8fea3de31a58415c3fec2e6dd4095575\n9b0de56f7f862db73e223f41099fc74c\nbe8a344487bcfea66de8e0f0f14d869e\ndf0045bd4168893922480f7ccb29860a\ne436e849d9496ef3f651c1904786c78f\ne80d8a0c35133f7485d8e87ade903919\nf36e67109ae368c9db109d0a41b5817c\n\n**Malware C&C**\n\nms-cdn-88[.]com\n\n**Related IOCs discovered**\n\ncdn2-sys-upd[.]com\nand-security-state[.]com\n\n### Phase 4 Campaign\n\n**Injection domains**\n\nsolitude.file-download[.]today\nsystem.documentations[.]live\nepiphany.download-document[.]world15\nepoch.wind-files[.]today\ninternet.document-management[.]today\n\n**Malware hashes**\n\n08b8b4787f3ce90c6c1483cc127b1cdc\n205a5502ff0da4a471c4dad0e06c6c57\n32bc51088953377d601c6b27ca7484a9\n3729531c71163cddcded7e70c02a3004\n43b39fd4ddc386092372da19f6278c25\n4fe4094302c26e7ea2c58f5ca9f7f993\n58239ea5747d3375278ce7c04db22c1b\n6491df10c766be9c487fb9495d04df6e\n6a442a610c047a7a306a12f423978bfb\n6ce947913231bd968c86a2737bae7bba\n\n\n-----\n\n7ad8ad340c084f8185e2bb18cbfde891\n90373539c60529153d0d6b0cc857e845\na5ae6e0d74052d4f889f2538fdd7cb9b\n\n**Malware C&C**\n\ncdn-upd-ms6[.]com\n\n**Related IOCs discovered**\n\nbombinate.winload[.]info\nepoch.uploaders[.]online\nsolitude.filedownloads[.]online\nmevlut.oncu@yandex.com16\n\n### Phase 5 Campaign\n\n**Injection domains**\n\ndocument.downloadingsystem[.]com\nepoch.englishdownloaders[.]today\ninternet.downloadingdocuments[.]com\nsystem.filedownloaders[.]com\n\n**Malware C&C**\n\nupd-ms3-app-state[.]com\n\n**Related IOCs discovered**\n\ncdn6-upd-state-app.com\n\n### BPF rule to detect HTTP 307 redirect injection consistent with PacketLogic:\n\n“port 80 and ip[4:2] = 13330 and tcp[((tcp[12:1] & 0xf0) >> 2)+8:4] = 0x20333037 and\ntcp[14:2] = 32120 and ip[6:2] = 0”\n\n# Footnotes\n\n1. The text “SECURE DOWNLOAD” is displayed when a user hovers over the\n\n“DOWNLOAD NOW” link when attempting to download a file from Download.com.\n[2. Found via Google search; the brochure URL includes a Hubspot Hub ID (482141)](https://knowledge.hubspot.com/articles/kcs_article/cos-general/how-are-file-manager-urls-structured)\n\nthat we see in the HTML source code of the https://sandvine.com/ site, thus we\nconclude this is an official brochure.\n\n\n-----\n\n[3. Found via Google search; the brochure URL includes a Hubspot Hub ID (482141)](https://knowledge.hubspot.com/articles/kcs_article/cos-general/how-are-file-manager-urls-structured)\n\nthat we see in the HTML source code of the https://sandvine.com/ site, thus we\nconclude this is an official brochure.\n4. Our Shodan search query was: 307 temporary redirect -date -server connection\n\nclose -content-length -pragma -usercheck -content-type location.\n[5. The samples were structurally similar to the ones described here.](https://www.welivesecurity.com/2017/12/08/strongpity-like-spyware-replaces-finfisher/)\n6. See “inject_data parameter requires v12.1 firmware or newer” on\n\n[http://python.proceranetworks.com/4.0.0/ruleset.html.](http://python.proceranetworks.com/4.0.0/ruleset.html)\n7. For instance, Checkpoint’s Secure Web Gateway appears to use the same HTTP\n\nheader format as PacketLogic, but has numerous differences in the IP and TCP\nlayers, including not using a fixed IPID value, and not injecting a final unsolicited\nACK.\n8. Though most people would instead probably visit videolan.org, which redirects\n\nusers to HTTPS by default.\n9. Also surprisingly, when we tested ccleaner.com, it directed Mac users to a\n\ndownload via HTTPS, but directed PC users to a download over HTTP.\n10. While it is unlikely that a user would actually see an ad injected on port 7547, it\n\nappears that the DPI operator in Egypt did not restrict the network injection to a\nspecific port. As a result, an HTTP request on any port would be injected.\n11. After we began corresponding with Sandvine, and apparently in March 2018,\n\nSandvine changed the content of this webpage. The original text as of February 15,\n2018 is available at\nhttps://web.archive.org/web/20180215124449/https://www.sandvine.com/compa\nny/corporate-ethics.\n12. Most recent data available as of March 7, 2018.\n13. After we began corresponding with Sandvine, and apparently in March 2018,\n\nSandvine changed the content of its “Ethics and Human Rights protection at\n[Sandvine” webpage to add the following text: “[W]e encourage Sandvine employees](https://www.sandvine.com/company/corporate-ethics)\nand interested third parties to report any suspected breaches of a signed Sandvine\ncertificate of compliance or breaches of Sandvine’s End User License Agreement\n(EULA) with sufficient supporting evidence to Sandvine’s BEC committee at\nBEC@sandvine.com for investigation. All reported concerns will be reviewed and\nappropriately actioned.” It is unclear, however, what terms are contained in the\napplicable certificates of compliance or EULAs, which information would be\nrequired for the public to properly identify and report on such breaches; or what\nsupporting evidence would be considered “sufficient.” Additional transparency is\nnecessary to make this mechanism effectively available to the public.\n14. Also seen in the Phase 2 campaign.\n\n15. Also seen in the Phase 5 campaign.\n16. The (self-signed) TLS certificate served by 62.109.20.58 (pointed to by cdn-upd\nms6[.]com) was issued to “mevlut.oncu.example.com,” and we found a similar[looking domain cdn6-scl-ms.com registered to mevlut.oncu@yandex.com according](mailto:mevlut.oncu@yandex.com)\nto the WHOIS record. That domain never pointed to an IP address, as far as we\ncould tell.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.03.09.Sandvine_PacketLogic_Devices_APT/BAD%20TRAFFIC_%20Sandvine%E2%80%99s%20PacketLogic%20Devices%20Used%20to%20Deploy%20Government%20Spyware%20in%20Turkey%20and%20Redirect%20Egyptian%20Users%20to%20Affiliate%20Ads_.pdf"
    ],
    "report_names": [
        "BAD TRAFFIC_ Sandvine’s PacketLogic Devices Used to Deploy Government Spyware in Turkey and Redirect Egyptian Users to Affiliate Ads_"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67fbc7d7-ba8e-4258-b53c-9a5d755e1960",
            "created_at": "2022-10-25T16:07:24.077859Z",
            "updated_at": "2025-03-27T02:02:10.101173Z",
            "deleted_at": null,
            "main_name": "Promethium",
            "aliases": [
                "APT-C-41",
                "Promethium",
                "StrongPity"
            ],
            "source_name": "ETDA:Promethium",
            "tools": [
                "StrongPity",
                "StrongPity2",
                "StrongPity3",
                "Truvasys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cbede712-4cc3-47c6-bf78-92fd9f1beac6",
            "created_at": "2022-10-25T15:50:23.777222Z",
            "updated_at": "2025-03-27T02:00:55.544919Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "PROMETHIUM",
                "StrongPity"
            ],
            "source_name": "MITRE:PROMETHIUM",
            "tools": [
                "Truvasys",
                "StrongPity"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4660477f-333f-4a18-b49b-0b4d7c66d482",
            "created_at": "2023-01-06T13:46:38.511962Z",
            "updated_at": "2025-03-27T02:00:02.852307Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "StrongPity",
                "G0056"
            ],
            "source_name": "MISPGALAXY:PROMETHIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1593489687,
    "ts_modification_date": 1593489687,
    "files": {
        "pdf": "https://archive.orkl.eu/57eb61b0d2d2e8b62ea44f6ce4e108e85d9facb6.pdf",
        "text": "https://archive.orkl.eu/57eb61b0d2d2e8b62ea44f6ce4e108e85d9facb6.txt",
        "img": "https://archive.orkl.eu/57eb61b0d2d2e8b62ea44f6ce4e108e85d9facb6.jpg"
    }
}