{
    "id": "0fda7908-6218-4f21-90f3-22c7179f695f",
    "created_at": "2023-01-12T15:01:31.286325Z",
    "updated_at": "2025-03-27T02:16:25.934577Z",
    "deleted_at": null,
    "sha1_hash": "77492691c13f45e32767d1f1a969ce47932c9dfb",
    "title": "2016-10-03 - Polyglot – the fake CTB-locker",
    "authors": "",
    "file_creation_date": "2018-02-13T20:36:42Z",
    "file_modification_date": "2018-02-22T06:27:14Z",
    "file_size": 6570031,
    "plain_text": "-----\n\n### Table of contents\n\n###### Executive summary........................................... 3\n\n Part I: The attack landscape............................. 6\n\nThe evolution of malware .....................................................6\n\nEncrypted malicious web traffic ............................................9\n\nEmail threats .......................................................................14\n\nSandbox evasion tactics .....................................................22\n\nAbuse of cloud services and\nother legitimate resources...................................................24\n\nIoT and DDoS attacks..........................................................31\n\nVulnerabilities and patching ................................................38\n\n###### Part II: The defender landscape...................... 46\n\nThe cost of attacks .............................................................46\n\nChallenges and obstacles ..................................................47\n\nComplexity created by vendors\nin orchestration ..................................................................48\n\nImpact: Public scrutiny from\nbreaches, higher risk of losses ...........................................50\n\nServices: Addressing people and policies,\nas well as technology..........................................................53\n\nExpectations: Investing in\ntechnology and training ......................................................54\n\n###### Conclusion....................................................... 57\n\n About Cisco..................................................... 60\n\n Appendix.......................................................... 65\n\n\n-----\n\n### Executive summary\n\n###### What if defenders could see the future? If they knew an attack was coming, they could stop it, or at least mitigate its impact and help ensure what they need to protect most is safe. The fact is, defenders can see what’s on the horizon.\n Many clues are out there—and obvious.\n\n\nAdversaries and nation-state actors already have the\nexpertise and tools necessary to take down critical\ninfrastructure and systems and cripple entire regions. But\nwhen news surfaces about disruptive and destructive cyber\nattacks—such as those in Ukraine, for example, or elsewhere\nin the world—some security professionals might initially think,\n“Our company’s market/region/technology environment\nwasn’t a target, so, we’re probably not at risk.”\n\nHowever, by dismissing what seem like distant campaigns,\nor allowing the chaos of daily skirmishes with attackers to\nconsume their attention, defenders fail to recognize the speed\nand scale at which adversaries are amassing and refining their\ncyber weaponry.\n\nFor years, Cisco has been warning defenders about escalating\ncybercriminal activity around the globe. In this, our latest\nannual cybersecurity report, we present data and analysis\nfrom Cisco threat researchers and several of our technology\npartners about attacker behavior observed over the past 12\nto 18 months. Many of the topics examined in the report align\nwith three general themes:\n\n**1.** **Adversaries are taking malware to unprecedented**\n**levels of sophistication and impact.**\n\n**The evolution of malware (page 6) was one of the most**\nsignificant developments in the attack landscape in 2017.\nThe advent of network-based ransomware cryptoworms\neliminates the need for the human element in launching\nransomware campaigns. And for some adversaries, the\nprize isn’t ransom, but obliteration of systems and data,\nas Nyetya—wiper malware masquerading as ransomware—\nproved (see page 6). Self-propagating malware is\ndangerous and has the potential to take down the Internet,\naccording to Cisco threat researchers.\n\n\n**2.** **Adversaries are becoming more adept at evasion—**\n**and weaponizing cloud services and other**\n**technology used for legitimate purposes.**\n\nIn addition to developing threats that can elude\n**increasingly sophisticated sandboxing environments**\n(page 22), malicious actors are widening their embrace\n**of encryption to evade detection (page 9). Encryption is**\nmeant to enhance security, but it also provides malicious\nactors with a powerful tool to conceal command-andcontrol (C2) activity, affording them more time to operate\nand inflict damage.\n\nCybercriminals are also adopting C2 channels that rely\n**on legitimate Internet services like Google, Dropbox,**\nand GitHub (see page 24). The practice makes malware\ntraffic almost impossible to identify.\n\nAlso, many attackers are now launching multiple\n**campaigns from a single domain (page 26)** to get\nthe best return on their investments. They are also\nreusing infrastructure resources, such as registrant email\naddresses, autonomous system numbers (ASNs),\nand nameservers.\n\n**3.** **Adversaries are exploiting undefended gaps in**\n**security, many of which stem from the expanding**\n**Internet of Things (IoT) and use of cloud services.**\n\nDefenders are deploying IoT devices at a rapid pace\nbut often pay scant attention to the security of these\nsystems. Unpatched and unmonitored IoT devices\npresent attackers with opportunities to infiltrate networks\n(page 34). Organizations with IoT devices susceptible to\nattack also seem unmotivated to speed remediation,\nresearch suggests (page 42). Worse, these organizations\nprobably have many more vulnerable IoT devices in their\nIT environments that they don’t even know about.\n\n\n-----\n\nMeanwhile, IoT botnets are expanding along with the\nIoT and becoming more mature and automated. As they\ngrow, attackers are using them to launch more advanced\ndistributed-denial-of-service (DDoS) attacks (page 31).\n\nAttackers are also taking advantage of the fact that\nsecurity teams are having difficulty defending both\n**IoT and cloud environments. One reason is the lack of**\nclarity around who exactly is responsible for protecting\nthose environments (see page 42).\n\n**Recommendations for defenders**\n\nWhen adversaries inevitably strike their organizations, will\ndefenders be prepared, and how quickly can they recover?\nFindings from the Cisco 2018 Security Capabilities\n**Benchmark Study—which offers insights on security practices**\nfrom more than 3600 respondents across 26 countries—show\nthat defenders have a lot of challenges to overcome (see\npage 46).\n\nEven so, defenders will find that making strategic security\nimprovements and adhering to common best practices can\nreduce exposure to emerging risks, slow attackers’ progress,\nand provide more visibility into the threat landscape. They\nshould consider:\n\n - Implementing first-line-of-defense tools that can scale,\nlike cloud security platforms.\n\n - Confirming that they adhere to corporate policies and\npractices for application, system, and appliance patching.\n\n - Employing network segmentation to help reduce\noutbreak exposures.\n\n\n\n - Adopting next-generation endpoint process\nmonitoring tools.\n\n - Accessing timely, accurate threat intelligence data and\nprocesses that allow for that data to be incorporated into\nsecurity monitoring and eventing.\n\n - Performing deeper and more advanced analytics.\n\n - Reviewing and practicing security response procedures.\n\n - Backing up data often and testing restoration\nprocedures—processes that are critical in a world of\nfast-moving, network-based ransomware worms and\ndestructive cyber weapons.\n\n - Reviewing third-party efficacy testing of security\ntechnologies to help reduce the risk of supply\nchain attacks.\n\n - Conducting security scanning of microservice, cloud\nservice, and application administration systems.\n\n - Reviewing security systems and exploring the use of\nSSL analytics—and, if possible, SSL decryption.\n\nDefenders should also consider adopting advanced\nsecurity technologies that include machine learning and\nartificial intelligence capabilities. With malware hiding its\ncommunication inside of encrypted web traffic, and rogue\ninsiders sending sensitive data through corporate cloud\nsystems, security teams need effective tools to prevent or\ndetect the use of encryption for concealing malicious activity.\n\n\n-----\n\n# Part I:\n## The attack landscape\n\n\n-----\n\n### Part I: The attack landscape\n\n###### Adversaries are taking malware to unprecedented levels of sophistication and impact. The growing number and variety of malware types and families perpetuate chaos in the attack landscape by undermining defenders’ efforts to gain and hold ground on threats.\n\n THE EVOLUTION OF MALWARE\n One of the most important developments in the attack landscape in 2017 was the evolution of ransomware. The advent of network-based ransomware worms eliminates the need for the human element in launching ransomware campaigns. And for some adversaries, the prize isn’t ransom, but the destruction of systems and data. We expect to see more of this activity in the year ahead.\n\n They’re out there: Defenders should prepare to face new, self-propagating,\n network-based threats in 2018\n\n\nIn 2017, adversaries took ransomware to a new level—\nalthough it had been expected. After the SamSam campaign\nof March 2016[1]—the first large-scale attack that used the\nnetwork vector to spread ransomware, thereby removing the\nuser from the infection process—Cisco threat researchers\nknew it would only be a matter of time before threat actors\nfound a way to automate this technique. Attackers would\nmake their malware even more potent by combining it with\n“worm-like” functionality to cause widespread damage.\n\nThis malware evolution was swift. In May 2017, WannaCry—\na ransomware cryptoworm—emerged and spread like wildfire\nacross the Internet.[2] To propagate, it took advantage of a\n[Microsoft Windows security vulnerability called EternalBlue,](https://www.cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0144)\nwhich was leaked by the hacker group Shadow Brokers in\nmid-April 2017.\n\nWannaCry had earned more than US$143,000 through bitcoin\npayments at the point the wallets were cashed out. Given the\ntimeline, and calculating accrual of the value on the bitcoin\noriginally paid into the wallets at $93,531, Cisco threat\n\n\nresearchers estimate that roughly 312 ransom payments\nwere made. As a comparison, the exploit kit Angler, when\nit was active, was earning about $100 million per year as a\nglobal business.\n\nWannaCry did not track encrypted damage to and the\npayments made by affected users. The number of users\nwho received decryption keys after making a payment is also\nunknown. (WannaCry is still propagating, and users continue\nto pay ransoms—in vain.) Due to the very low performance\nof WannaCry as ransomware, the U.S. government and\nmany security researchers believe the ransom component\nis effectively a smokescreen to conceal WannaCry’s true\npurpose: wiping data.\n\nNyetya (also known as NotPetya) arrived in June 2017.[3]\nThis wiper malware also masqueraded as ransomware and it\ntoo used the remote code execution vulnerability nicknamed\n“EternalBlue,” as well as the remote code execution\nvulnerability “EternalRomance” (also leaked by Shadow\nBrokers), and other vectors involving credential harvesting\n\n\n1 _[SamSam: The Doctor Will See You, After He Pays the Ransom, Cisco Talos blog, March 2016: blog.talosintelligence.com/2016/03/samsam-ransomware.html.](http://blog.talosintelligence.com/2016/03/samsam-ransomware.html)_\n2 _[Player 3 Has Entered the Game: Say Hello to ‘WannaCry,’ Cisco Talos blog, May 2017: blog.talosintelligence.com/2017/05/wannacry.html.](http://blog.talosintelligence.com/2017/05/wannacry.html)_\n3 _[New Ransomware Variant ‘Nyetya’ Compromises Systems Worldwide, Cisco Talos blog, June 2017: blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html.](http://blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html)_\n\n\n-----\n\nunrelated to the Shadow Brokers release.[4] Nyetya was\ndeployed through software update systems for a tax software\npackage used by more than 80 percent of companies in the\nUkraine, and installed on more than 1 million computers.[5]\nUkraine cyber police confirmed that it affected more than\n2000 Ukrainian companies.[6]\n\nBefore the rise of self-propagating ransomware, malware\nwas distributed in three ways: drive-by download, email, or\nphysical media such as malicious USB memory devices. All\nmethods required some type of human interaction to infect a\ndevice or system with ransomware. With these new vectors\nbeing employed by attackers, an active and unpatched\nworkstation is all that is needed to launch a network-based\nransomware campaign.\n\nSecurity professionals may see worms as an “old” type\nof threat because the number of worm-like Common\nVulnerabilities and Exposures (CVEs) has declined as product\nsecurity baselines have improved. However, self-propagating\nmalware not only is a relevant threat, but also has the\npotential to bring down the Internet, according to Cisco threat\nresearchers. WannaCry and Nyetya are only a taste of what’s\nto come, so defenders should prepare.\n\nWannaCry and Nyetya could have been prevented, or their\nimpact muted, if more organizations had applied basic\nsecurity best practices such as patching vulnerabilities,\nestablishing appropriate processes and policies for incident\nresponse, and employing network segmentation.\n\nFor more tips on meeting the threat of automated network[based ransomware worms, read Back to Basics: Worm](http://blog.talosintelligence.com/2017/08/worm-defense.html)\n_[Defense in the Ransomware Age on the Cisco Talos blog.](http://blog.talosintelligence.com/2017/08/worm-defense.html)_\n\n\n**Security weak spot: the supply chain**\n\nThe Nyetya campaign was also a supply chain attack, one of\nmany that Cisco threat researchers observed in 2017. One\nreason Nyetya was successful at infecting so many machines\nso quickly is that users did not see an automated software\nupdate as a security risk, or in some cases even realize that\nthey were receiving the malicious updates.\n\nAnother supply chain attack, which occurred in September\n2017, involved the download servers used by a software\nvendor to distribute a legitimate software package known\nas CCleaner.[7] CCleaner’s binaries, which contained a Trojan\nbackdoor, were signed using a valid certificate, giving users\nfalse confidence that the software they were using was\nsecure. The actors behind this campaign were targeting major\ntechnology companies where the software was in use, either\nlegitimately or as part of shadow IT.\n\nSupply chain attacks appear to be increasing in velocity and\ncomplexity. They can impact computers on a massive scale,\nand can persist for months or even years. Defenders should\nbe aware of the potential risk of using software or hardware\nfrom organizations that do not have a responsible security\nposture. Look for vendors that issue CVEs, are quick to\naddress vulnerabilities, and consistently strive to ensure that\ntheir build systems can’t be compromised. Also, users should\ntake time to scan new software before downloading it to verify\nthat it doesn’t contain malware.\n\nNetwork segmentation of software that is not backed by a\ncomprehensive security practice can help contain damage\nfrom supply chain attacks, preventing them from spreading\nthroughout an organization.\n\n\n4 Ibid.\n5 _Ukraine scrambles to contain new cyber threat after ‘NotPetya’ attack, by Jack Stubbs and Matthias Williams, Reuters, July 2017:_\n\n[reuters.com/article/us-cyber-attack-ukraine-backdoor/ukraine-scrambles-to-contain-new-cyber-threat-after-notpetya-attack-idUSKBN19Q14P.](https://www.reuters.com/article/us-cyber-attack-ukraine-backdoor/ukraine-scrambles-to-contain-new-cyber-threat-after-notpetya-attack-idUSKBN19Q14P)\n6 _[The MeDoc Connection, Cisco Talos blog, July 2017: blog.talosintelligence.com/2017/07/the-medoc-connection.html.](http://blog.talosintelligence.com/2017/07/the-medoc-connection.html)_\n7 _[CCleaner Command and Control Causes Concern, Cisco Talos blog, September 2017: blog.talosintelligence.com/2017/09/ccleaner-c2-concern.html.](http://blog.talosintelligence.com/2017/09/ccleaner-c2-concern.html)_\n\n\n-----\n\n-----\n\n###### ENCRYPTED MALICIOUS WEB TRAFFIC\n The expanding volume of encrypted web traffic—both legitimate and malicious—creates even more challenges and confusion for defenders trying to identify and monitor potential threats. Encryption is meant to enhance security, but it also provides malicious actors with a powerful tool to conceal command-and-control (C2) activity, affording them more time to operate and inflict damage. Cisco threat researchers expect to see adversaries increase their use of encryption in 2018. To keep pace, defenders will need to incorporate more automation and advanced tools like machine learning and artificial intelligence to complement threat prevention, detection, and remediation.\n\n A dark spot for defenders: encrypted malicious web traffic\n\n\nCisco threat researchers report that 50 percent of global web\ntraffic was encrypted as of October 2017. That is a 12-point\nincrease in volume from November 2016 (see Figure 1). One\nfactor driving that increase is the availability of low-cost or\nfree SSL certificates. Another is Google Chrome’s steppedup practice of flagging unencrypted websites that handle\nsensitive information, like customers’ credit card information,\nas “non-secure.” Businesses are motivated to comply with\nGoogle’s HTTPS encryption requirement unless they want\nto risk a potentially significant drop in their Google search\npage rankings.\n\n\nAs the volume of encrypted global web traffic grows,\nadversaries appear to be widening their embrace of\nencryption as a tool for concealing their C2 activity. Cisco\nthreat researchers observed a more than threefold increase\nin encrypted network communication used by inspected\nmalware samples over a 12-month period (see Figure 2). Our\nanalysis of more than 400,000 malicious binaries found that\nabout 70 percent had used at least some encryption as of\nOctober 2017.\n\n\n-----\n\n**Applying machine learning to the threat spectrum**\n\nTo overcome the lack of visibility that encryption creates,\nand reduce adversaries’ time to operate, we see more\nenterprises exploring the use of machine learning and artificial\nintelligence. These advanced capabilities can enhance\nnetwork security defenses and, over time, “learn” how to\nautomatically detect unusual patterns in web traffic that might\nindicate malicious activity.\n\nMachine learning is useful for automatically detecting\n“known-known” threats—the types of infections that have\nbeen seen before (see Figure 3). But its real value, especially\nin monitoring encrypted web traffic, stems from its ability\nto detect “known-unknown” threats (previously unseen\n\n###### Figure 3 Machine learning in network security: taxonomy\n\n\nvariations of known threats, malware subfamilies, or related\nnew threats) and “unknown-unknown” (net-new malware)\nthreats. The technology can learn to identify unusual patterns\nin large volumes of encrypted web traffic and automatically\nalert security teams to the need for further investigation.\n\nThat latter point is especially important, given that the lack\nof trained personnel is an obstacle to enhancing security\ndefenses in many organizations, as seen in findings from\nthe Cisco 2018 Security Capabilities Benchmark Study\n(see page 35). Automation and intelligent tools like machine\nlearning and artificial intelligence can help defenders\novercome skills and resource gaps, making them more\neffective at identifying and responding to both known and\nemerging threats.\n\n\n**Unsupervised machine learning**\n\n\n-----\n\n-----\n\n-----\n\n8 _[Cisco 2017 Midyear Cybersecurity Report: cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html.](https://www.cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html)_\n\n\n-----\n\n###### EMAIL THREATS\n No matter how much the threat landscape changes, malicious email and spam remain vital tools for adversaries to distribute malware because they take threats straight to the endpoint. By applying the right mix of social engineering techniques, such as phishing and malicious links and attachments, adversaries need only to sit back and wait for unsuspecting users to activate their exploits.\n\n Fluctuations in spam botnet activity impact overall volume\n\n\nIn late 2016, Cisco threat researchers observed a noticeable\nincrease in spam campaign activity that appeared to coincide\nwith a decline in exploit kit activity. When leading exploit\nkits like Angler abruptly disappeared from the market, many\nusers of those kits turned—or returned—to the email vector\n\n\nto maintain profitability.[9] However, after that initial rush back\nto email, global spam volume declined and leveled during\nmost of the first half of 2017. Then, in late May and early June\n2017, global spam volume dipped before spiking considerably\nduring mid- to late summer (see Figure 8).\n\n\n###### Figure 8 IP reputation blocks by country, December 2016 – October 2017\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n\n2016 2017\n\nUS CN VN IN FR All Other Countries\n\nSource: Cisco Security Research\n\n9 See \"Decline in exploit kit activity likely influencing global spam trends,\" p. 18, Cisco 2017 Midyear Cybersecurity Report:\n\n[cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html.](https://www.cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html)\n\n\n-----\n\n###### Figure 9 Spam botnet activity, October 2016 – October 2017\n\n24\n\n22\n\n20\n\n18\n\n16\n\n14\n\n12\n\n10\n\n8\n\n6\n\n4\n\n2\n\n0\n\n2016 2017\n\nReports Sent Spam Submitted\n\nSource: Cisco SpamCop\n\nThe reduced spam volume from January through April 2017\ncoincides with a lull in spam botnet activity, as an internal\ngraph generated by the Cisco® SpamCop service shows\n(Figure 9).\n\nCisco threat researchers report that the Necurs botnet, a\nmajor contributor to overall spam volume globally, was active\nbut distributing less spam during the January to April time\nframe. In May, the botnet was spreading Jaff ransomware\nthrough massive spam campaigns. The campaigns featured\n\n\na PDF file with an embedded malicious Microsoft Office\ndocument, and the initial downloader for the Jaff ransomware.[10]\nSecurity researchers discovered a vulnerability in Jaff that\nallowed them to create a decryptor that forced Necurs’\noperators to make a quick return to distributing its usual\nthreat, Locky ransomware.[11] The time that the actors behind\nNecurs needed to pivot back to Locky coincides with the\nsignificant dip in global spam volume observed during the first\ntwo weeks of June (Figure 9).\n\n\n10 _Jaff Ransomware: Player 2 Has Entered the Game, by Nick Biasini, Edmund Brumaghin, and Warren Mercer, with contributions from_\n\n[Colin Grady, Cisco Talos blog, May 2017: blog.talosintelligence.com/2017/05/jaff-ransomware.html.](http://blog.talosintelligence.com/2017/05/jaff-ransomware.html)\n11 _Player 1 Limps Back Into the Ring—Hello Again, Locky! by Alex Chiu, Warren Mercer, and Jaeson Schultz, with contributions from Sean Baird_\n\n[and Matthew Molyett, Cisco Talos blog, June 2017: blog.talosintelligence.com/2017/06/necurs-locky-campaign.html.](http://blog.talosintelligence.com/2017/06/necurs-locky-campaign.html)\n\n\n-----\n\n###### Malicious file extensions in email: common malware families’ top 10 tools\n\n\nCisco threat researchers analyzed email telemetry from\nJanuary through September 2017 to identify the types of\nmalicious file extensions in email documents that common\nmalware families employed most often. The analysis yielded\na top 10 list that shows the most prevalent group of malicious\nfile extensions (38 percent) was Microsoft Office formats such\nas Word, PowerPoint, and Excel (see Figure 10).\n\nArchive files, such as .zip and .jar, accounted for about 37\npercent of all the malicious file extensions observed in our\nstudy. That adversaries heavily employ archive files is not\nsurprising, as they have long been favored hiding places\nfor malware. Users must open archive files to see the\ncontents—an important step in the infection chain for many\nthreats. Malicious archive files also often find success in\nfoiling automated analysis tools, especially when they contain\nthreats that require user interaction for activation. Adversaries\nwill also use obscure file types, such as .7z and .rar, to\nevade detection.\n\nMalicious PDF file extensions rounded out the top three in\nour analysis, accounting for nearly 14 percent of malicious\nfile extensions observed. (Note: The category of “Other\nExtensions” applies to extensions observed in our study that\ncould not be mapped easily to known file types. Some malware\ntypes are known to use random file extensions.)\n\n\n###### Figure 10 Top 10 malicious file extensions,\n\nJanuary – September 2017\n\n\n-----\n\nFigures 11a-c provide an overview of the malware families\nincluded in our investigation that were associated with the top\nthree malicious file extension types: MS Office files, archives,\nand PDFs. Figure 12 shows the percentage of detections,\nby family, that included a malicious payload file extension.\nThe spikes in activity align with spam campaigns observed\nduring those months, according to Cisco threat researchers.\n\n###### Figure 11a Top three malicious file extension types and\n\nmalware family relationships\n\nOffice\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\n2017\n\nMs, Rtf,Valyria,Vba, Word\nOther Docdl Locky\n\nAdnel, Dde, Dldr, Donoff\nDoc Mdropper\n\nSource: Cisco Security Research\n\n###### Figure 11c Top three malicious file extension types and\n\nmalware family relationships\n\nArchive\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\n2017\n\nFareit, Kryptik, Locky, Msil, Upatre\nOther Nemucod Adwind, Autoit, Donoff, Vbkrypt\n\nDwnldr Vbscrdlx Dldr\n\nSource: Cisco Security Research\n\n\nFor example, in late summer, there were major campaigns\nunderway distributing Nemucod and Locky—two threats that\noften work together. Nemucod is known to send malicious\npayloads in archive files like .zip that contain malicious script\nbut look like normal .doc files. (“Dwnldr,” also seen in Figure\n12, is a likely variant of Nemucod.)\n\n###### Figure 11b Top three malicious file extension types and\n\nmalware family relationships\n\nPDF\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\n2017\n\nA, Dldr, Donoff, Fraud, Urlmal,\n\nOther MSWord Nemucod\nLg, Malphish, Pdfphish,Pdfuri\n\nPDF Docdl\n\nSource: Cisco Security Research\n\n**Figure 12 Patterns of top malware families,**\n\nJanuary - October 2017\n\n\n-----\n\n**MyWebSearch spyware most active user of**\n**“other extensions”**\n\nThe “other extensions” group in our study includes several\nwell-known malware types. But MyWebSearch, a malicious\nadware software and browser hijacker that poses as a helpful\ntoolbar, is the most active player (see Figure 13). It uses\n.exe file extensions exclusively, sometimes only one type per\nmonth. The potentially unwanted application (PUA) has been\naround for years and infects different browser types. It is often\nbundled with fraudulent software programs and can expose\nusers to malvertising.\n\nOur analysis of malicious file extension types shows that even\nin today’s sophisticated and complex threat environment, email\nremains a vital channel for malware distribution. For enterprises,\nbaseline defense strategies include:\n\n - Implementing powerful and comprehensive email\nsecurity defenses.\n\n - Educating users about the threat of malicious attachments\nand links in phishing emails and spam.\n\n\n###### Figure 13 MyWebSearch most active user of\n\n“other extensions”\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\n2017\n\nMyWebSearch Other Qjwmonkey\n\nAdwind, Cerber, Docdl, Donoff, Fareit,\nFraud, Imali, Kryptik, Masrung, PDF, Valyria\n\nSource: Cisco Security Research\n\n\n-----\n\n###### Social engineering still a critical launchpad for email attacks\n\n\nPhishing and spear phishing are well-worn tactics for stealing\nusers’ credentials and other sensitive information, and that’s\nbecause they are very effective. In fact, phishing and spear\nphishing emails were at the root of some of the biggest,\nheadline-grabbing breaches in recent years. Two examples\nfrom 2017 include a widespread attack that targeted Gmail\nusers[12] and a hack of Irish energy systems.[13]\n\n###### Figure 14 Number of observed phishing URLs and domains by month\n\n120K\n\n100K\n\n80K\n\n60K\n\n30K\n\n20K\n\n10K\n\n5K\n\n0\n\n2017\n\nDomains URLs\n\nSource: Cisco Security Research\n\nThe spikes seen in March and June can be attributed to two\ndifferent campaigns. The first appeared to target users of a\nmajor telecom services provider. That campaign:\n\n - Involved 59,651 URLs containing subdomains under\naaaainfomation[dot]org.\n\n - Had subdomains that contained random strings consisting\nof 50-62 letters.\n\n12 _Massive Phishing Attack Targets Gmail Users, by Alex Johnson, NBC News, May 2017:_\n\n\nTo gauge how prevalent phishing URLs and domains are on\ntoday’s Internet, Cisco threat researchers examined data\nfrom sources that investigate potentially “phishy” emails\nsubmitted by users through community-based, anti-phishing\nthreat intelligence. Figure 14 shows the number of phishing\nURLs and phishing domains observed during the period from\nJanuary to October 2017.\n\nTotal Phishing URLs\n\n101,934\n\nTotal Phishing Domains\n\nEach subdomain length (50-62) contained about 3500 URLs,\nwhich allowed for programmatic use of the subdomains\n(example: Cewekonuxykysowegulukozapojygepuqybyteqe\njohofopefogu[dot]aaaainfomation[dot]org).\n\nAdversaries used an inexpensive privacy service to register\nthe domains observed in this campaign.\n\n\n[nbcnews.com/tech/security/massive-phishing-attack-targets-millions-gmail-users-n754501.](https://www.nbcnews.com/tech/security/massive-phishing-attack-targets-millions-gmail-users-n754501)\n13 _Hackers target Irish energy networks amid fears of further cyber attacks on UK’s crucial infrastructure, by Lizzie Deardon, The Independent, July 2017:_\n\n[independent.co.uk/news/world/europe/cyber-attacks-uk-hackers-target-irish-energy-network-russia-putin-electricity-supply-board-nuclear-a7843086.html.](http://www.independent.co.uk/news/world/europe/cyber-attacks-uk-hackers-target-irish-energy-network-russia-putin-electricity-supply-board-nuclear-a7843086.html)\n\n\n-----\n\nIn the second campaign, which was most active in June,\nthreat actors used the name of a legitimate tax agency in the\nUnited Kingdom to disguise their actions. They employed 12\ntop-level domains (TLDs). Eleven of the domains were URLs with\nsix random six-character strings (example: jyzwyp[dot]top). And\nnine of the domains were associated with more than 1600\nphishing sites each.\n\nLike the March campaign, adversaries registered the domains\nusing a privacy service to conceal domain registration\ninformation. They registered all the domains over a two-day\nperiod. On the second day, nearly 19,000 URLs connected to\nthe campaign were observed, and all were discovered within\n\n\na five-hour window (for more on how quickly threat actors\nput newly registered domains to use, see “Malicious use of\nlegitimate resources for backdoor C2,” on page 24).\n\n**TLD distribution across known phishing sites**\n\nOur analysis of phishing sites during the period from January\nto August 2017 found that threat actors were employing 326\nunique TLDs for these activities, including .com, .org, .top\n(largely due to the United Kingdom taxing agency campaign),\nand country-specific TLDs (see Figure 15). Employing lesserknown TLDs can be advantageous for adversaries; these\ndomains are typically inexpensive and often offer inexpensive\nprivacy protection.\n\n\n-----\n\n**Defenders should be vigilant in monitoring this “old” threat**\n\nIn 2017, tens of thousands of phishing attempts were\nreported monthly to the community-based, anti-phishing\nthreat intelligence services included in our analysis. Some\nof the common tactics and tools adversaries use to execute\nphishing campaigns include:\n\n - **Domain squatting: Domains named to look like valid**\ndomains (example: cisc0[dot]com).\n\n - **Domain shadowing: Subdomains added under a valid**\ndomain without the owner’s knowledge (example:\nbadstuff[dot]cisco[dot]com).\n\n - **Maliciously registered domains: A domain created to**\nserve malicious purposes (example: viqpbe[dot]top).\n\n - **URL shorteners: A malicious URL disguised with a URL**\nshortener (example: bitly[dot]com/random-string).\n\n\nNote: In the data we examined, Bitly.com was the\nURL-shortening tool adversaries used most. Malicious\nshortened URLs represented 2 percent of the phishing\nsites in our study. That number peaked to 3.1 percent\nin August.\n\n - **Subdomain services: A site created under a subdomain**\nserver (example: mybadpage[dot]000webhost[dot]com).\n\nThreat actors in the phishing and spear phishing game are\ncontinuously refining social engineering methods to trick\nusers into clicking malicious links or visiting fraudulent web\npages, and providing credentials or other types of highvalue information. User training and accountability, and the\napplication of email security technologies, remain crucial\nstrategies for combatting these threats.\n\n\n-----\n\n###### SANDBOX EVASION TACTICS\n Adversaries are becoming adept at developing threats that can evade increasingly sophisticated sandboxing environments. When Cisco threat researchers analyzed malicious email attachments that were equipped with various sandbox evasion techniques, they discovered that the number of malicious samples using a particular sandbox evasion technique showed sharp peaks, and then quickly dropped. This is yet another example of how attackers are swift to ramp up the volume of attempts to break through defenses once they find an effective technique.\n\n Malware authors playing dirty tricks in defenders’ sandboxes\n\n\nIn September 2017, Cisco threat researchers noted high\nvolumes of samples where a malicious payload is delivered\nafter a document is closed (Figure 16). In this case, the\nmalware is triggered using the “document_close” event. The\ntechnique works because, in many cases, documents are not\nclosed after the document has been opened and analyzed in\nthe sandbox. Because the sandbox doesn’t explicitly close the\ndocument, the attachments are deemed safe by the sandbox,\nand will be delivered to the intended recipients. When a\nrecipient opens the document attachment, and later closes\n\n\nthe document, the malicious payload is delivered. Sandboxes\nthat don’t properly detect actions on document close can be\nevaded using this technique.\n\nThe use of the “document_close” event is a clever option\nfor attackers. It takes advantage of the macro functionality\nbuilt into Microsoft Office, as well as users’ tendency to\nopen attachments that they believe are relevant to them.\nOnce users realize the attachment is not relevant to them,\nthey close the document, triggering the macros in which the\nmalware is hidden.\n\n\n-----\n\nSome attackers evade sandboxing by disguising the type of\ndocument in which the malicious payload exists. As seen in\nFigure 17, we noted a significant attack in May 2017 that was\nbuilt around malicious Word documents embedded within PDF\ndocuments. The documents might bypass sandboxes that\nsimply detect and open the PDF, instead of also opening and\nanalyzing the embedded Word document. The PDF document\ntypically contained an enticement for the user to click and\n\n###### Figure 17 Large attack in May 2017 involved PDFs with malicious embedded Word documents\n\n90K\n\n80K\n\n70K\n\n60K\n\n50K\n\n40K\n\n30K\n\n20K\n\n10K\n\n0\n\n2016 2017\n\nMalicious Samples Total Samples “document_open”\n\nSource: Cisco Security Research\n\nThe spikes in malicious samples using different sandbox\nevasion techniques point to malicious actors’ desire to follow\na method that seems to work for them—or for other attackers.\nAlso, if adversaries go to the trouble of creating malware\nand associated infrastructure, they want a return on their\ninvestments. If they determine that malware can slip through\nsandbox testing, they will, in turn, increase the number of\nattack attempts and affected users.\n\n\nopen the Word document, which would trigger the malicious\nbehavior. Sandboxes that don’t open and analyze embedded\ndocuments within PDFs can be bypassed using this technique.\n\nAfter viewing the spike in malicious samples involving these\nPDFs, our threat researchers refined the sandbox environment\nto detect whether PDFs contained actions or enticements to\nopen embedded Word documents.\n\nCisco researchers recommend using sandboxing that includes\n“content-aware” features to help ensure malware that uses\nthe tactics described above does not evade sandbox analysis.\nFor example, sandboxing technology should show awareness\nof the metadata features of the samples it is analyzing—such\nas determining whether the sample includes an action upon\nclosing of the document.\n\n\n-----\n\n###### ABUSE OF CLOUD SERVICES AND OTHER LEGITIMATE RESOURCES\n As applications, data, and identities move to the cloud, security teams must manage the risk involved with losing control of the traditional network perimeter. Attackers are taking advantage of the fact that security teams are having difficulty defending evolving and expanding cloud and IoT environments. One reason is the lack of clarity around who exactly is responsible for protecting those environments.\n\n To meet this challenge, enterprises may need to apply a combination of best practices, advanced security technologies like machine learning, and even some experimental methodologies, depending on the services they use for their business and how threats in this space evolve.\n\n Malicious use of legitimate resources for backdoor C2\n\n\nWhen threat actors use legitimate services for command\nand control (C2), malware network traffic becomes nearly\nimpossible for security teams to identify because it mimics the\nbehavior of legitimate network traffic. Adversaries have a lot\nof Internet “noise” to use as cover because so many people\ntoday rely on services like Google Docs and Dropbox to do\ntheir work, regardless of whether these services are offered\nor systemically endorsed by their employers.\n\n\nFigure 18 shows several of the well-known legitimate\nservices that researchers with Anomali, a Cisco partner and\nthreat intelligence provider, have observed being used in\nmalware backdoor C2 schemas[14] in the last few years. (Note:\nThese types of services face a dilemma in combatting abuse,\nas making it more difficult for users to set up accounts and\nuse their services can adversely affect their ability to\ngenerate revenue.)\n\n\n###### Figure 18 Examples of legitimate services abused by malware for C2\n\n\n###### Yahoo Answers Babelfish\n\nSource: Anomali\n\n\n###### Google Docs Google Code Google Translate Google Apps Script Google Calendar Google Plus Gmail Live.com Blogger Hotmail.com Microsoft TechNet Microsoft Answers Microsoft Social\n Dropbox\n OneDrive\n\n|Google Docs Google Code|Col2|Col3|\n|---|---|---|\n|Google Translate Twitter Google Apps Script Google Calendar Google Plus GitHub Gmail Blogger H Answers Amazon Micr belfish Micr Mic Dropbox Pastebin|||\n|Answers belfish|||\n|||Dropbox|\n||Pastebin||\n\n\n14 Anomali defines a C2 schema as “the totality of IP addresses, domains, legitimate services, and all the remote systems that are part of the … communications architecture” of malware.\n\n\n-----\n\nAccording to Anomali’s research, advanced persistent\nthreat (APT) actors and state-sponsored groups were\namong the first adversaries to use legitimate services for\nC2; however, the technique is now embraced by a broader\nrange of sophisticated adversaries in the shadow economy.\nUsing legitimate services for C2 appeals to malicious actors\nbecause it’s easy to:\n\n - Register new accounts on these services.\n\n - Set up a web page on the publicly accessible Internet.\n\n - Usurp encryption for C2 protocols. (Instead of setting up\nC2 servers with encryption or building encryption into\nmalware, attackers can simply adopt the SSL certificate\nof a legitimate service.)\n\n - Adapt and transform resources on the fly. (Attackers can\nreuse implants across attacks without reusing DNS or IP\naddresses, for instance.)\n\n - Reduce the likelihood of “burning” infrastructure.\n(Adversaries that use legitimate services for C2 don’t\nneed to hard-code malware with IP addresses or\ndomains. When their operation is complete, they can\nsimply take down their legitimate services pages—and no\none will ever know the IP addresses.)\n\n - Attackers benefit from this technique because it allows\nthem to reduce overhead and improve their return\non investment.\n\nFor defenders, adversaries’ use of legitimate services for C2\npresents some significant challenges:\n\n**Legitimate services are difficult to block**\nCan organizations, from a mere business perspective, even\nconsider blocking parts of legitimate Internet services like\nTwitter or Google?\n\n\n**Legitimate services are often encrypted and innately**\n**difficult to inspect**\nSSL decrypting is expensive and not always possible at\nenterprise scale. So, malware hides its communication inside\nof encrypted traffic, making it difficult, if not impossible, for\nsecurity teams to identify malicious traffic.\n\n**Use of legitimate services subverts domain and certificate**\n**intelligence, and complicates attribution**\nAdversaries don’t need to register domains because the\nlegitimate service account is considered the initial C2 address.\nAlso, they’re not likely to continue registering SSL certificates\nor using self-signed SSL certificates for C2 schemas. Both\ntrends obviously will have a negative impact on indicator feeds\nfor reputation filtering and indicator blacklisting, which are\nbased on newly generated and newly registered domains and\nthe certificates and IP addresses connected to them.\n\nDetecting the use of legitimate services for C2 is difficult.\nHowever, Anomali’s threat researchers recommend that\ndefenders consider applying some experimental methodologies.\nFor example, defenders may identify malware using legitimate\nservices for C2 by looking for:\n\n - Non-browser, non-app connections to legitimate services\n\n - Unique or low page response sizes from\nlegitimate services\n\n - High certificate exchange frequencies to\nlegitimate services\n\n - Bulk sandboxing samples for suspicious DNS calls to\nlegitimate services\n\nAll these unique behaviors merit further investigation of the\nsource programs and processes.[15]\n\n\n15 For details on these experimental methodologies, and more information about how adversaries use legitimate services for C2, download the Anomali research paper,\n\n_[Rise of Legitimate Services for Backdoor Command and Control, available at: anomali.cdn.rackfoundry.net/files/anomali-labs-reports/legit-services.pdf.](https://anomali.cdn.rackfoundry.net/files/anomali-labs-reports/legit-services.pdf)_\n\n\n-----\n\n###### Extracting optimal value from resources\n\nCisco security researchers analyzed newly seen unique query\nnames (domains) associated with DNS queries made over a\nseven-day period in August 2017. Note that “newly seen”\nin this discussion has no bearing on when a domain was\ncreated; it relates to when a domain was first “seen” by Cisco\ncloud security technology during the period of observation.\n\nThe purpose of this research was to gain more insight into how\noften adversaries use, and reuse, registered-level domains\n(RLDs) in their attacks. Understanding threat actor behavior\nat the domain level can help defenders identify malicious\ndomains, and related subdomains, that should be blocked with\nfirst-line-of-defense tools like cloud security platforms.\n\nSo that our researchers could focus solely on the core group\nof unique RLDs—about 4 million in total—subdomains were\nstripped from the sample of newly seen domains. Only a small\npercentage of the RLDs in that sample was categorized as\nmalicious. Of the RLDs that were malicious, more than half\n(about 58 percent) were reused, as Figure 19 shows.\n\n###### Figure 19 Percent of new vs. reused domains\n\n\nThat finding suggests that, while most attackers build new\ndomains for their campaigns, many are focused on trying to\nget the best return on their investments by launching multiple\ncampaigns from a single domain. Domain registration can\nbe costly, especially at the scale most attackers require to\nexecute their campaigns and evade detection.\n\n**One-fifth of malicious domains quickly put into use**\n\nAdversaries may sit on domains for days, months, or even\nyears after registering them, waiting for the right time to\nuse them. However, Cisco threat researchers observed that\na significant percentage of malicious domains—about 20\npercent—were used in campaigns less than one week after\nthey were registered (see Figure 20).\n\n###### Figure 20 RLD registration times\n\n\n-----\n\n**Many new domains tied to malvertising campaigns**\n\nMost malicious domains we analyzed were associated with\nspam campaigns—about 60 percent. Nearly one-fifth of the\ndomains were connected to malvertising campaigns (see\nFigure 21). Malvertising has become an essential tool for\ndirecting users to exploit kits, including those that\ndistribute ransomware.\n\n###### Figure 21 Malicious categorizations\n\n20.9%\n\n59.6%\n\n19.6%\n\nSpam Malvertising Other\n\nSource: Cisco Security Research\n\nWell-worn, domain-related techniques for creating\nmalvertising campaigns include domain shadowing. In\nthis technique, attackers steal legitimate domain account\ncredentials to create subdomains directed at malicious\nservers. Another tactic is the abuse of free, dynamic DNS\nservices to generate malicious domains and subdomains.\nThat allows threat actors to deliver malicious payloads from\nconstantly changing hosting IPs, either infected users’\ncomputers or compromised public websites.\n\n**Domains reuse infrastructure resources**\n\nThe malicious RLDs in our sample also appeared to reuse\ninfrastructure resources, such as registrant email addresses,\nIP addresses, autonomous system numbers (ASNs), and\nnameservers (see Figure 22). This is further evidence of\nadversaries trying to get the most value from their investments\n\n\nin new domains and preserve resources, according to our\nresearchers. For example, an IP address can be used by more\nthan one domain. So, an attacker laying the groundwork for a\ncampaign might decide to invest in a few IP addresses and an\narray of domain names instead of servers, which cost more.\n\n###### Figure 22 Reuse of infrastructure by malicious RLDs\n\n\n-----\n\nThe resources that RLDs reuse give clues to whether the\ndomain is likely to be malicious. For example, reuse of\nregistrant emails or IP addresses occurs infrequently, so a\npattern of reuse on either front suggests suspicious behavior.\nDefenders can have a high degree of confidence in blocking\nthose domains, knowing that doing so probably will have no\nnegative impact on business activity.\n\nStatic blocking of ASNs and nameservers is not likely to be\nfeasible in most cases. However, patterns of reuse by RLDs\nare worthy of further investigation to determine whether\ncertain domains should be blocked.\n\nUsing intelligent, first-line-of-defense cloud security tools\nto identify and analyze potentially malicious domains and\n\n\nsubdomains can help security teams follow the trail of an\nattacker and answer questions, such as:\n\n - What IP address does the domain resolve to?\n\n - What ASN is associated with that IP address?\n\n - Who registered the domain?\n\n - What other domains are associated with that domain?\n\nThe answers can help defenders not only refine security\npolicies and block attacks, but also prevent users from\nconnecting to malicious destinations on the Internet while\nthey’re on the enterprise network.\n\n\n-----\n\n###### Insider threats: Taking advantage of the cloud\n\nIn previous security reports, we have discussed the value\nof OAuth permissions and super-user privileges to enforce\nwho can enter networks, and how they can access data.[17]\nTo further examine the impact of user activity on security,\nCisco threat researchers recently examined data exfiltration\ntrends. They employed a machine-learning algorithm to\nprofile 150,000 users in 34 countries, all using cloud service\nproviders, from January to June 2017. The algorithm\naccounted for not only the volume of documents being\ndownloaded, but also variables such as the time of day of\ndownloads, IP addresses, and locations.\n\nAfter profiling users for six months, our researchers spent 1.5\nmonths studying abnormalities. flagging 0.5 percent of users\nfor suspicious downloads. That’s a small amount, but these\nusers downloaded, in total, more than 3.9 million documents\nfrom corporate cloud systems, or an average of 5200\ndocuments per user during the 1.5-month period. Of the\nsuspicious downloads, 62 percent occurred outside of normal\nwork hours; 40 percent took place on weekends.\n\nCisco researchers also conducted a text-mining analysis on the\ntitles of the 3.9 million suspiciously downloaded documents.\n\n###### Figure 23 Most commonly downloaded documents\n\n\nOne of the most popular keywords in the documents’ titles\nwas “data.” The keywords most commonly appearing with the\nword “data” were “employee” and “customer.” Of the types\nof documents downloaded, 34 percent were PDFs and 31\npercent were Microsoft Office documents (see Figure 23).\n\nApplying machine-learning algorithms offers a more\nnuanced view of cloud user activity beyond just the number\nof downloads. In our analysis, 23 percent of the users we\nstudied were flagged more than three times for suspicious\ndownloads, usually starting with small numbers of documents.\nThe volume slowly increased each time, and eventually, these\nusers showed sudden and significant spikes in downloads\n(Figure 24).\n\nMachine-learning algorithms hold the promise of providing\ngreater visibility into the cloud and user behavior. If defenders\ncan start predicting user behavior in terms of downloads,\nthey can save the time it might take to investigate legitimate\nbehavior. They can also step in to stop a potential attack or\ndata-exfiltration incident before it happens.\n\n###### Figure 24 Machine-learning algorithms capture suspicious\n\nuser download behavior\n\n\n17 _[Cisco 2017 Midyear Cybersecurity Report: cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html.](https://www.cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html)_\n\n\n-----\n\n-----\n\n###### IoT AND DDoS ATTACKS\n The IoT is still evolving, but adversaries are already exploiting security weaknesses in IoT devices to gain access to systems—including industrial control systems that support critical infrastructure. IoT botnets are also growing in both size and power, and are increasingly capable of unleashing powerful attacks that could severely disrupt the Internet. Attackers’ shift toward greater exploitation of the application layer indicates that this is their aim. But many security professionals aren’t aware of, or they dismiss, the threat that IoT botnets pose. Organizations keep adding IoT devices to their IT environments with little or no thought about security, or worse, take no time to assess how many IoT devices are touching their networks. In these ways, they’re making it easy for adversaries to take command of the IoT.\n\n Few organizations see IoT botnets as an imminent threat—but they should\n\n\nAs the IoT expands and evolves, so too are IoT botnets. And\nas these botnets grow and mature, attackers are using them\nto launch DDoS attacks of increasing scope and intensity.\nRadware, a Cisco partner, offered an analysis of three of\nthe largest IoT botnets—Mirai, Brickerbot, and Hajime—in the\n_Cisco 2017 Midyear Cybersecurity Report, and revisits the_\nIoT botnet topic in our latest report to underscore the severity\nof this threat.[18] Their research shows that only 13 percent of\norganizations believe that IoT botnets will be a major threat to\ntheir business in 2018.\n\nIoT botnets are thriving because organizations and users are\ndeploying low-cost IoT devices rapidly and with little or no\nregard for security. IoT devices are Linux- and Unix-based\nsystems, so they are often targets of executable and linkable\nformat (ELF) binaries. They are also less challenging to take\n\n###### Figure 28 Application DDoS attacks increased in 2017\n\n\ncontrol of than a PC, which means it’s easy for adversaries to\nquickly build a large army.\n\nIoT devices operate on a 24-hour basis and can be called\ninto action at a moment’s notice. And as adversaries\nincrease the size of their IoT botnets, they are investing in\nmore sophisticated code and malware and shifting to more\nadvanced DDoS attacks.\n\n**Application DDoS overtakes network DDoS**\n\nApplication layer attacks are on the rise while network layer\nattacks are declining (see Figure 28). Radware researchers\nsuspect this shift can be attributed to growth in IoT botnets.\nThe trend is concerning because the application layer is so\ndiverse, and has so many devices within it, which means\nattacks targeting this layer could potentially shut down large\nportions of the Internet.\n\n\n18 For more details on Radware’s IoT botnet research, see “The IoT is only just emerging but the IoT botnets are already here,” p. 39,\n\n_[Cisco 2017 Midyear Cybersecurity Report: cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html.](https://www.cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html)_\n\n\n-----\n\nMore attackers are turning to the application layer because\nthere is little left to exploit in the network layer, according to\nRadware researchers. IoT botnets are also less resourceintensive than PC botnets to build. That means adversaries\ncan invest more resources in developing advanced code and\nmalware. The operators of the multivector botnet Mirai, which\nis known for advanced application attacks, are among those\nmaking that type of investment.\n\n**“Burst attacks” increasing in complexity, frequency,**\n**and duration**\n\nOne of the most significant DDoS attack trends Radware\nobserved in 2017 was an increase in short-burst attacks, which\nare becoming more complex, frequent, and persistent. Forty-two\npercent of organizations in Radware’s investigation experienced\nthis type of DDoS attack in 2017 (Figure 29). In most of the\nattacks, the recurring bursts lasted only a few minutes.\n\n###### Figure 29 Experience with DDoS attacks in recurring bursts\n\n 42% Experienced Short-Burst DDoS Attacks in 2017\n\n9% 18% 15% 58%\n\nLasted Lasted a Lasted Not Hit by\nSeconds Few Minutes 15-30 Burst Attacks\nMinutes\n\nSource: Radware\n\nBurst tactics are typically aimed at gaming websites and\nservice providers due to their targets’ sensitivity to service\navailability and their inability to sustain such attack maneuvers.\nTimely or random bursts of high traffic rates over a period of\ndays or even weeks can leave these organizations with no\ntime to respond, causing severe service disruptions.\n\nRadware researchers say that burst attacks:\n\n - Are composed of multiple changing vectors. The\nattacks are geographically distributed and manifest as a\nsustained series of precise and high-volume SYN floods,\nACK floods, and User Datagram Protocol (UDP) floods on\nmultiple ports.\n\n\n\n - Combine high-volume attacks with varying durations—\nfrom two to 50 seconds of high burst-traffic with intervals\nof approximately five to 15 minutes.\n\n - Are often combined with other long-duration\nDDoS attacks.\n\n**Growth in reflection amplification attacks**\n\nAnother DDoS trend Radware observed during 2017 is growth\nin reflection amplification DDoS attacks as a major vector\nagainst a wide spectrum of services. According to Radware,\ntwo in five businesses experienced a reflection amplification\nattack in 2017. One-third of those organizations reported that\nthey were unable to mitigate these attacks.\n\nA reflection amplification attack uses a potentially legitimate\nthird-party component to send attack traffic to a target,\nconcealing the attacker’s identity. Attackers send packets\nto the reflector servers with a source IP address set to the\ntarget user’s IP. That makes it possible to indirectly overwhelm\nthe target with response packets and exhaust the target’s\nutilization of resources (see Figure 30).\n\n###### Figure 30 Reflection amplification attack\n\n\n-----\n\nTo successfully execute a reflection amplification attack,\nadversaries need to have a larger bandwidth capacity than\ntheir targets. Reflector servers make that possible: the\nattacker simply reflects the traffic from one or more thirdparty machines. Since these are ordinary servers, this\ntype of attack is particularly difficult to mitigate. Common\nexamples include:\n\n**DNS amplification reflective attacks**\nThis sophisticated denial of service attack takes advantage\nof a DNS server’s behavior to amplify the attack. A standard\nDNS request is smaller than the DNS reply. In a DNS\namplification reflective attack, the attacker carefully selects\na DNS query that results in a lengthy reply that’s up to 80\ntimes longer than the request (for example, “ANY”). The\nattacker sends this query using a botnet to third-party\nDNS servers while spoofing the source IP address with the\ntarget user’s IP address. The third-party DNS servers send\ntheir responses to the target’s IP address. With this attack\ntechnique, a relatively small botnet can channel a volumetric\nflood of large responses toward the target.\n\n**NTP reflection**\nThis type of amplification attack exploits publicly accessible\nNetwork Time Protocol (NTP) servers to overwhelm and\nexhaust defenders with UDP traffic. NTP is an old networking\nprotocol for clock synchronization between computer systems\nover packet-switched networks. It is still widely used across\nthe Internet by desktops, servers, and even phones to keep\ntheir clocks in sync. Several old versions of NTP servers\ncontain a command called monlist, which sends the requester\na list of up to the last 600 hosts that connected to the\nqueried server.\n\n\nIn a basic scenario, the attacker repeatedly sends the “get\nmonlist” request to a random NTP server and spoofs the\nsource IP address for the requesting server as the target\nserver. NTP server responses are then directed to the target\nserver to cause a significant increase in UDP traffic from\nsource port 123.\n\n**SSDP reflection**\nThis attack exploits the Simple Service Discovery Protocol\n(SSDP), which is used to allow Universal-Plug-and-Play\n(UPnP) devices to broadcast their existence. It also helps\nto enable discovery and control of networked devices and\nservices, such as cameras, network-attached printers, and\nmany other types of electronic equipment.\n\nOnce a UPnP device is connected to a network, and after\nit receives an IP address, the device is able to advertise\nits services to other computers in the network by sending\na message in a multicast IP. When a computer gets the\ndiscovery message about the device, it makes a request for a\ncomplete description of the device services. The UPnP device\nthen responds directly to that computer with a complete list of\nany services it has to offer.\n\nAs with NTP and DNS amplified DDoS attacks, the attacker can\nuse a small botnet to query that final request for the services.\nThe attacker then spoofs the source IP to the target user’s IP\naddress and aims the responses directly at the target.\n\n\n-----\n\n###### Defenders must remediate “leak paths”\n\nA “leak path,” as defined by Cisco partner Lumeta, is a policy\nor segmentation violation or unauthorized or misconfigured\nconnection created to the Internet on an enterprise network,\nincluding from the cloud, that allows traffic to be forwarded\nto a location on the Internet—such as a malicious website.\nThese unexpected connections can also occur internally\nbetween two different network segments that should not\nbe communicating with each other. For example, in critical\ninfrastructure environments, an unexpected leak path\nbetween the manufacturing floor and business IT systems\ncould indicate malicious activity. Leak paths can also stem\nfrom improperly configured routers and switches.\n\nDevices that don’t have permissions set up correctly, or\nare left open and unmanaged, are vulnerable to attackers.\nDevices and networks related to rogue or shadow IT are also\nfertile ground for adversaries to establish leak paths because\nthey tend to be unmanaged and unpatched. Lumeta estimates\n\n\nthat about 40 percent of the dynamic networks, endpoints,\nand cloud infrastructure in enterprises is leading to significant\ninfrastructure blind spots and lack of real-time awareness for\nsecurity teams.\n\nDetection of existing leak paths are critical as they can be\nexploited at any time. However, newly created leak paths\nare important to detect in real time since they are immediate\nindicators of compromise and are associated with most\nadvanced attacks, including ransomware.\n\nLumeta’s recent analysis of IT infrastructure at more than\n200 organizations across several industries underscores the\nendpoint visibility gap. It also shows that many companies\nsignificantly underestimate the number of endpoints in their IT\nenvironments (see Figure 31). Lack of awareness about the\nnumber of IP-enabled IoT devices connected to the network\nis often a key reason for underestimation of endpoints.\n\n|Government|Healthcare|Tech|\n|---|---|---|\n|150,000|60,000|8000|\n|170,000|89,860|14,000|\n|12%|33%|43%|\n|3278|24|5|\n|520|75|2026|\n|33,256|4|16,828|\n|3000|120|9400|\n\n\n-----\n\nLumeta’s researchers suggest that leak paths are on the rise,\nespecially in cloud environments, where there is less network\nvisibility and fewer security controls in place.\n\nMalicious actors don’t always immediately use the leak\npaths they create or find. When they do return to these\nchannels, they use them to install malware or ransomware,\nsteal information, and more. Researchers with Lumeta say\none reason leak paths often remain undetected is because\nthreat actors are adept at encrypting and obfuscating their\nactivity—by using TOR, for example. They also are careful to\nuse leak paths judiciously, so as not to alert security teams\nto their activity.\n\n\nLumeta researchers say security team skills gaps, namely the\nlack of fundamental knowledge about networks, can interfere\nwith organizations’ ability to investigate and remediate leak\npath issues in a timely manner. Better collaboration between\nsecurity and network teams can help expedite investigations\nand remediation of leak paths.\n\nTools for automation that provide network context can also\ngive security analysts insight into potential leak path issues. In\naddition, implementing appropriate segmentation policies can\nhelp security teams quickly determine whether unexpected\ncommunication between networks or devices is malicious.\n\n\n-----\n\n###### Industrial control systems vulnerabilities place critical infrastructure at risk\n\n\nIndustrial control systems (ICS) are at the heart of all\nmanufacturing and process control systems. ICS connect to\nother electronic systems that are part of the control process,\ncreating a highly connected ecosystem of vulnerable devices\nthat a wide range of attackers is eager to compromise.\n\nThreat actors who want to target ICS to cripple critical\ninfrastructure are actively engaged in research and creating\nbackdoor pivot points to facilitate future attacks, according\nto TrapX Security, a Cisco partner that develops deceptionbased cybersecurity defenses. Among the potential cyber\nattackers are experts with advanced knowledge of IT systems,\nICS architectures, and the processes they support. Some also\nknow how to program product lifecycle management (PLM)\ncontrollers and subsystems.\n\nThreat researchers with TrapX recently conducted\ninvestigations into several cyber attacks that targeted\ncustomers’ ICS to help highlight unexpected problems with\nICS cyber defense. Two of the incidents, described below,\ntook place in 2017 and remain under investigation.\n\n**Target: Large international water treatment and waste**\n**processing company**\n\nAttackers used the company’s demilitarized zone (DMZ)\nserver as a pivot point to compromise the internal network.\nThe security operations team received alerts from deception\nsecurity technology embedded in the network DMZ. This\nphysical or logical subnetwork bridges internal networks from\nuntrusted networks, such as the Internet, protecting other\ninternal infrastructure. The investigation found that:\n\n - The DMZ server was breached due to a misconfiguration\nthat allowed RDP connections.\n\n - The server was breached and controlled from several IPs,\nwhich were connected to political hacktivists hostile to\nthe plant.\n\n\n\n - The attackers were able to launch multiple major attacks\nagainst several of the company’s other plants from the\ncompromised internal network.\n\n**Target: Power plant**\n\nThis power plant’s critical assets include a very large ICS\ninfrastructure and the necessary supervisory control and\ndata acquisition (SCADA) components that manage and\nrun their processes. The plant is considered critical national\ninfrastructure and subject to scrutiny and oversight by the\nresponsible national security agency. It is therefore considered\na high-security installation.\n\nThe CISO involved decided to implement deception\ntechnology to protect the plant’s standard IT resources from\nransomware attacks. The technology was also distributed\nwithin the ICS infrastructure. Soon after, the security\noperations team received several alerts that indicated a\nbreach to the systems within the critical infrastructure plant\noperations. Their immediate investigation concluded:\n\n - A device in the process control network was attempting\nto interact with the deception traps, which were\ncamouflaged as PLM controllers. This was an active\nattempt to map and understand the exact nature of each\nPLM controller within the network.\n\n - The compromised device would normally have been\nclosed, but a vendor performing maintenance failed to\nclose the connection when finished. That oversight left\nthe process control network vulnerable to attackers.\n\n - The information adversaries were collecting is exactly the\ntype needed to disrupt plant activity and potentially cause\ngreat damage to ongoing plant operations.\n\n\n-----\n\n**Recommendations**\n\nMany ICS breaches begin with the compromise of vulnerable\nservers and computing resources within the corporate IT\nnetwork. Threat researchers with TrapX recommend that\norganizations take the following actions to reduce risk and\nhelp ensure the integrity of operations within their facilities:\n\n - Review vendors and systems, and see that all patches\nand updates are applied promptly. (If patches are not\navailable, consider migrating to new technology.)\n\n - Reduce the use of USB memory sticks and DVD drives.\n\n - Isolate ICS systems from IT networks. Don’t allow any\ndirect connections between the two. That includes\nnetwork connections, laptops, and memory sticks.\n\n\n\n - Implement policies that severely limit the use of the ICS\nnetworks for anything other than essential operations.\nReduce accessibility to ICS workstations and monitors\nwith external Internet browser access. Assume these\npolicies will fail and plan accordingly.\n\n - Research and eliminate all embedded passwords or\ndefault passwords in your production network. And\nwherever possible, implement two-factor authentication.\n\n - Review plans for disaster recovery following a major\ncyber attack.\n\nFor additional case studies, see the TrapX Security research\n[paper, Anatomy of an Attack: Industrial Control Systems](http://www.trapx.com/wp-content/uploads/2017/08/TrapX-Original-Research-Industrial-Control-Systems-Under-Siege.pdf)\n_[Under Siege.](http://www.trapx.com/wp-content/uploads/2017/08/TrapX-Original-Research-Industrial-Control-Systems-Under-Siege.pdf)_\n\n\n-----\n\n###### VULNERABILITIES AND PATCHING\n Amid the chaos of security concerns, defenders may lose sight of vulnerabilities affecting their technology. But\n you can be sure attackers are paying attention, and calculating how to exploit these potential weaknesses to\n launch attacks.\n\n There was a time when patching known vulnerabilities within 30 days was considered best practice. Now, waiting that long to remediate could increase an organization’s risk of being targeted for attack because threat actors are moving faster to release and use active exploits of vulnerabilities. Organizations also must avoid neglecting small but significant security gaps that could benefit adversaries, especially during the reconnaissance phase of attacks when they are searching for pathways into systems.\n\n Prevalent vulnerabilities in 2017 included buffer overflow errors, Apache Struts\n\n|493|403|\n|---|---|\n|227|268|\n|137|163|\n|125|250|\n|27|17|\n|7|15|\n|5|0|\n\n\n-----\n\nIn examining critical advisories (Figure 35), Apache Struts\nvulnerabilities were still prominent in 2017. Apache Struts is\nan open-source framework for creating Java applications that\nis widely used. Apache Struts vulnerabilities were implicated\nin security breaches in 2017 that involved major data brokers.\n\n\nreports,[19] third-party or open-source software vulnerabilities\ncan require manual patching, which may not be done as\nfrequently as automated patching from standard software\nvendors. That gives malicious actors a greater window of time\nto launch attacks.\n\n\n19 _[Cisco 2017 Midyear Cybersecurity Report: cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html.](https://www.cisco.com/c/m/en_au/products/security/offers/cybersecurity-reports.html)_\n\n\n-----\n\n###### IoT and library vulnerabilities loomed larger in 2017\n\n\nBetween October 1, 2016, and September 30, 2017, Cisco\nthreat researchers discovered 224 new vulnerabilities in nonCisco products, of which 40 vulnerabilities were related to\nthird-party software libraries included in these products, and\n74 were related to IoT devices (Figure 36).\n\nThe relatively large number of vulnerabilities in libraries\npoints to the need to delve deeper into third-party solutions\nthat provide the framework for many enterprise networks.\nDefenders should assume that third-party software libraries\ncan be targets for attackers; it’s not enough to simply make\nsure the latest version of the software is running, or that no\nopen CVEs (common vulnerabilities) have been reported.\nSecurity teams should check frequently for patches, and\nreview the security practices of third-party vendors. Teams\ncould, for example, request that vendors provide secure\ndevelopment lifecycle statements.\n\nAnother best practice for vetting third-party software is\nhelping to ensure that auto-update or check-for-update\nfeatures are running securely. For example, when an update\nis initiated, security professionals should be certain that\nthe communication for that software occurs over a secure\nchannel (such as SSL), and that the software is digitally\n\n\nsigned. Both are needed: If only digital signatures are used,\nbut not a secure channel, an attacker could intercept traffic\nand potentially replace an update with an older version\nof the software that is digitally signed, but may contain\nvulnerabilities. If only a secure channel is used, an attacker\ncould potentially compromise the vendor’s update server and\nreplace the update with malware.\n\n###### Figure 36 Third-party library and IoT vulnerabilities\n\n\n-----\n\n###### Active exploits fuel race to remediate, except for IoT devices\n\n\nQualys, Inc., a Cisco partner and provider of cloud-based\nsecurity and compliance solutions, took a retrospective look at\ncompanies’ patch management behavior before and after the\nWannaCry campaign that affected many organizations across\nthe world in May 2017.\n\nThe ransomware cryptoworm WannaCry, which many security\nexperts believe was designed to wipe data, took advantage of\na Microsoft Windows security vulnerability called EternalBlue,\nwhich was leaked by the hacker group Shadow Brokers\nin mid-April 2017. (For more on this topic, see “They’re\nout there: Defenders should prepare to face new, selfpropagating, network-based threats in 2018,” on page 6.)\n\nOn March 14, 2017, Microsoft issued a security update\n(MS17-010) alerting users to a critical vulnerability in its\nMicrosoft Windows SMB Server. Figure 37 shows how the\nnumber of devices detected with the vulnerability spikes, and\nthen gradually declines between mid-March and mid-April as\norganizations scan their systems and apply the patch.\n\n\nHowever, a significant number of devices still remained\nunpatched as of mid-April. Then, on April 14, Shadow\nBrokers released the working exploit for targeting that known\nvulnerability in various versions of Microsoft Windows.\nFigure 37 shows that the number of devices detected with the\nvulnerability nearly doubled shortly thereafter. That happened\nas organizations learned of the exploit and its potential to\nimpact both supported and unsupported versions of Windows\nthrough a remote check from Qualys that used a portion of\nthe exploit code.\n\nBut even after the exploit was released, widespread patching\ndidn’t occur until mid-May, after the WannaCry attack made\nheadlines around the world. Figure 37 shows the steep\nremediation curve after that campaign. By late May, few\ndevices were left unpatched.\n\nQualys’ research into its customers’ patching behavior\nindicates that it takes a major event to motivate many\norganizations to patch critical vulnerabilites—even knowledge\nof an active exploit is not enough to accelerate remediation.\nAnd in the case of the WannaCry campaign, businesses had\naccess to the patch for the Microsoft vulnerability for two\nmonths before the ransomware attacks occurred.\n\nAnother factor, as described by researchers with Cisco and\nQualys partner Lumeta, was that unknown, unmanaged,\nrogue, and shadow IT endpoints were left unpatched.\nAttackers were able to leverage these blind spots. Without\nknowledge of these systems, vulnerabilty scanners were\nunable to evaluate and recommend patching of these\nsystems, leaving them vulnerable to WannaCry.\n\n\n-----\n\n**Patching is even slower, or not happening at all,**\n**for IoT devices**\n\nQualys also examined patching trends for IoT devices. The\ndevices in the sample included IP-enabled HVAC systems,\ndoor locks, fire alarm panels, and card readers.\n\nThe researchers looked specifically for IoT devices\nvulnerable to several known threats, including Devil’s Ivy\nmalware that exploits a vulnerability in a piece of code called\ngSOAP that is widely used in physical security products,\nand Mirai, an IoT botnet that connects to targeted machines\nthrough brute-force attacks against Telnet servers.\n\n\nQualys detected 7328 devices in total, but only 1206 had\nbeen fixed (see Figure 38). That means 83 percent of the\nIoT devices in the sample still have critical vulnerabilities.\nWhile Qualys did not find evidence of threat actors actively\ntargeting those vulnerabilities, organizations were still\nsusceptible to attack. However, they do not seem motivated\nto speed remediation.\n\nThere are several possible explanations for the patching\ninertia, according to Qualys. Some devices may not be\nupdatable, for example. Others may require direct support\nfrom the vendor. Also, it is not always clear who inside\nthe organization is responsible for maintenance of IoT\ndevices. For example, an engineering team that takes care of\nthe company’s HVAC system may not be aware of IT risks\nthat could affect that system, or even that the system\nis IP-enabled.\n\nMore concerning, though, is the low number of IoT devices that\nQualys detected. The actual number is likely to be much higher\nbecause organizations simply do not know how many IoT\ndevices are connected to their network. That lack of visibility\nputs them at serious risk of compromise (see page 34 for more\non this topic).\n\nA first step to addressing this issue is inventorying all IoT\ndevices on the network. Organizations can then determine\nwhether the devices are scannable and still supported by\nvendors, and which employees in the company own and use\nthem. Organizations can also improve IoT security by treating\nall IoT devices like other computing devices—helping to ensure\nthey receive firmware updates and are patched regularly.\n\n\n-----\n\n###### Most common vulnerabilities are low severity but high risk\n\n\nLow-severity vulnerabilities are often left unremediated for\nyears because companies either don’t know they exist or\ndon’t consider them significant risks, according to security\nexperts with SAINT Corporation, a security solutions company\nand Cisco partner. However, these small but significant security\ngaps could provide adversaries with pathways into systems.\n\n\nSAINT researchers examined vulnerability exposure data\ncollected from more than 10,000 hosts in 2016 and 2017.\nThe company developed a list of the top vulnerabilities\ndetected most often across all the organizations in the study,\nwhich indicated that low-severity vulnerabilities occur most\noften (see Figure 39). (Note: Some organizations included in\nthe research had more than one host.)\n\n\n###### Figure 39 Low-severity vulnerabilities most often detected, 2016-2017\n\n\n-----\n\nHere’s a closer look at the top three low-severity vulnerabilities\nin Figure 39 and why they might be valuable to threat actors:\n\n**TCP timestamp requests enabled**\nTCP timestamps offer information about how long a machine\nhas been running, or when it was last rebooted, which could\nhelp adversaries learn what types of patchable vulnerabilities\nthe machine might have to exploit. Also, software programs\nmay use the system timestamp to seed a random number\ngenerator for creating encryption keys.\n\n**TCP reset by approximate sequence number**\nRemote attackers can guess sequence numbers and cause a\ndenial of service to persistent TCP connections by repeatedly\ninjecting a TCP RST packet, especially in protocols that use\nlong-lived connections, such as the Border Gateway Protocol.\n\n**“BEAST” attack**\nAn attacker can use the Browser Exploit Against SSL/TLS\n(BEAST) vulnerability to launch a man-in-the-middle (MiTM)\nattack to essentially “read” protected content being exchanged\nbetween parties. (Note: This is a complicated attack to execute,\nas the threat actor also must have control of the client-side\nbrowser to read and inject data packets very quickly.)\n\n\nSecurity researchers with SAINT did not detect adversaries\nactively exploiting these low-severity vulnerabilities during\ntheir analysis.\n\nThe vulnerabilities shown in Figure 39 are known to the security\ncommunity, but some of them would not typically be flagged\nor lead to automatic failure during a routine compliance check,\nsuch as a Payment Card Industry Data Security Standard (PCI\nDSS) audit. They are not critical vulnerabilities as defined by\nstandards relevant to that industry. Each industry triages the\ncriticality of vulnerabilities differently.\n\nAlso, most of the commonly occurring vulnerabilities that are\nlow-severity shown in Figure 39 cannot be remediated easily,\nor at all, through patch management because they stem\nfrom configuration problems or security certificate issues (for\nexample, weak SSL ciphers or a self-signed SSL certificate).\n\nOrganizations should act promptly to address low-severity\nvulnerabilities that may present risk. They should evaluate and\nidentify remediation priorities based on how they perceive\nthe risk, rather than rely on third-party ratings, or partial use\nof a scoring system, such as a CVSS base score, or a certain\ncompliance rating. Only the organizations know their unique\nenvironments and their risk management strategies.\n\n\n-----\n\n# Part II:\n## The defender landscape\n\n\n-----\n\n### Part II: The defender landscape\n\n###### We know that attackers are evolving and adapting their techniques at a faster pace than defenders. They are also weaponizing and field testing their exploits, evasion strategies, and skills so they can launch attacks of increasing magnitude. When adversaries inevitably strike their organizations, will defenders be prepared, and how quickly can they recover? That depends largely on the steps they’re taking today to strengthen their security posture.\n\n\n_What we’ve learned through our research for the Cisco 2018_\nSecurity Capabilities Benchmark Study is that defenders have\n_a lot of work to do—and challenges to overcome. To gauge_\n_the perceptions of defenders on the state of security in their_\n_organizations, we asked chief information security officers_\n_(CISOs) and security operations (SecOps) managers in_\n_several countries and at organizations of various sizes about_\n_their security resources and procedures._\n\n_The Cisco 2018 Security Capabilities Benchmark Study_\n_offers insights on security practices currently in use, and_\n_compares these results with those of the 2017, 2016,_\n_and 2015 studies. The research involved more than 3600_\n_respondents across 26 countries._\n\n###### The cost of attacks\n\nThe fear of breaches is founded in the financial cost of\nattacks, which is no longer a hypothetical number. Breaches\ncause real economic damage to organizations, damage that\ncan take months or years to resolve. According to study\nrespondents, more than half (53 percent) of all attacks\nresulted in financial damages of more than US$500,000,\nincluding, but not limited to, lost revenue, customers,\nopportunities, and out-of-pocket costs (Figure 40).\n\n\n###### Figure 40 Fifty-three percent of attacks result in damages of\n\n$500,000 or more\n\n$5M+ 8%\n\n$2.5M-4.9M 11%\n\n$1M-2.4M 19% 53% of Attacks\n\n$500K-999K 15%\n\n$100K-499K 17%\n\nLess Than $100K 30%\n\nSource: Cisco 2018 Security Capabilities Benchmark Study\n\n\n-----\n\n###### Challenges and obstacles\n\nIn their efforts to protect their organizations, security teams\nface many roadblocks. Organizations must defend several\nareas and functions, which adds to security challenges.\n\n\nThe most challenging areas and functions to defend are\nmobile devices, data in the public cloud, and user behavior\n(Figure 41).\n\n\n###### Figure 41 Most challenging areas to defend: mobile devices and cloud data\n\n4% 12% 28%\n\nMobile Devices\n\n3% 10% 30%\n\n4% 11% 30%\n\nData in Public Cloud\n\n2% 10% 30%\n\n3% 11% 29%\n\nUser Behavior 2% 10% 31%\n\n2017\n2016\nNot at All Extremely\nChallenging Challenging\n\nSource: Cisco 2018 Security Capabilities Benchmark Study\n\n\nSecurity professionals cite budget, interoperability, and\npersonnel as their key constraints when managing security\n(Figure 42). The lack of trained personnel is also named as\na challenge to adopting advanced security processes and\ntechnology. In 2017, 27 percent cited the lack of talent as an\nobstacle, compared with 25 percent in 2016 and 22 percent\nin 2015.\n\n###### Figure 42 The greatest obstacle to security:\n\nbudget constraints\n\n39%\n\n35%\n34%\n\n32%\n\n28%\n\n27% 27%\n25%\n22%\n\nBudget Constraints Compatibility Issues Lack of Trained\nwith Legacy Systems Personnel\n\n2015 2016 2017\n\n2015 (n=2432), 2016 (n=2912), 2017 (n=3651)\n\nSource: Cisco 2018 Security Capabilities Benchmark Study\n\n\nLack of skilled talent tops the list of obstacles in all industries\nand across all regions. “If I could wave a magic wand and\nget 10 percent more people to take some of the burden off\npeople who really feel the heat because of high demand for\ntheir particular service areas, I would be a very, very happy\nguy,” said a CISO for a large professional services firm.\n\nWhile the skilled talent gap is an ongoing challenge,\norganizations report that they’re seeking out and hiring more\nresources for their security teams. In 2017, the median\nnumber of security professionals at organizations was 40, a\nsignificant increase from 2016’s median number of 33\n(Figure 43).\n\n\n-----\n\n###### Complexity created by vendors in orchestration\n\n\nDefenders are implementing a complex mix of products from\na cross-section of vendors: an arsenal of tools that may\nobfuscate rather than clarify the security landscape. This\ncomplexity has many downstream effects on an organization’s\nability to defend against attacks, such as increased risk\nof losses.\n\n###### Figure 44 Organizations used more security vendors in 2017\n\n\nIn 2017, 25 percent of security professionals said they used\nproducts from 11 to 20 vendors, compared with 18 percent\nof security professionals in 2016. Also in 2017, 16 percent\nsaid they use anywhere from 21 to 50 vendors, compared to\n7 percent of respondents in 2016 (Figure 44).\n\n\nAs the number of vendors increases, so does the challenge **Figure 45 The challenge of orchestrating alerts**\nof orchestrating alerts from these many vendor solutions. As\nseen in Figure 45, 54 percent of security professionals said\nthat managing multiple vendor alerts is somewhat challenging, 20%\nwhile 20 percent said it is very challenging.\n\n\n-----\n\n**Security teams face challenges in orchestrating multiple**\n**vendor alerts**\n\nAs seen in Figure 46, among organizations with just 1 to 5\nvendors, 8 percent said orchestrating alerts is very challenging.\n\n\nAmong organizations using more than 50 vendors, 55 percent\nsaid such orchestration is very challenging.\n\nWhen organizations can’t orchestrate and understand\nthe alerts they receive, legitimate threats can slip through\nthe cracks.\n\n\n###### Figure 46 As vendors increase, so does the challenge of orchestrating security alerts\n\n\nRespondent data indicates that gaps continue to exist\nbetween alerts generated, those that have been investigated,\nand those that are eventually remediated. As shown in\nFigure 47:\n\n - Among organizations that receive daily security alerts, an\naverage of 44 percent of those alerts are not investigated.\n\n - Of those alerts investigated, 34 percent are\ndeemed legitimate.\n\n - Of those deemed legitimate, 51 percent of alerts\nare remediated.\n\n - Nearly half (49 percent) of legitimate alerts are\nnot remediated.\n\nThis process leaves many legitimate alerts unremediated.\nOne reason appears to be the lack of headcount and trained\npersonnel who can facilitate the demand to investigate\nall alerts.\n\n\n###### Figure 47 Many threat alerts are not investigated\n\nor remediated\n\n\n-----\n\n###### Impact: Public scrutiny from breaches, higher risk of losses\n\n\n“There are two kinds of companies: those who have been\nbreached and those who don’t know they’ve been breached,”\nsaid a benchmark study respondent. (The response echoes\na well-known quote from former Cisco CEO John Chambers:\n“There are two types of companies: those who have been\nhacked, and those who don’t yet know they have been\nhacked.”) Even though organizations are trying to meet future\nsecurity challenges with adequate preparation, security\nprofessionals expect they’ll fall victim to a breach that\nreceives public scrutiny. Fifty-five percent of respondents said\ntheir organizations had to manage public scrutiny of a breach\nin the last year (Figure 48).\n\n\n###### Figure 48 Fifty-five percent of organizations have had to\n\nmanage the public scrutiny of a breach\n\n\n-----\n\nOrganizations reported significantly more security breaches\naffecting over 50 percent of systems (Figure 49), than did\nthe organizations responding last year. In 2017, 32 percent\nof security professionals said breaches affected more than\nhalf of their systems, compared with 15 percent in 2016. The\nbusiness functions most commonly affected by breaches are\noperations, finance, intellectual property, and brand reputation\n(Figure 50).\n\nIn complex security environments, organizations are more\nlikely to deal with breaches. Of organizations using 1 to\n5 vendors, 28 percent said they had to manage public\nscrutiny after a breach; that number rose to 80 percent for\norganizations using more than 50 vendors (Figure 51). That\nmay be due to increased visibility into threats, which more\nproducts may allow.\n\n\n###### Figure 49 Sharp increase in security breaches affecting\n\nmore than 50 percent of systems\n\n\n###### Figure 50 Operations and finance are most likely to be affected by security breaches\n\n\n-----\n\n**The value of an integrated framework**\n\nWhy use a multitude of products from many vendors if the\nresulting environment is difficult to manage? The best-ofbreed approach, in which security teams choose the best\nsolution for each security need, is one key reason. Security\nprofessionals who practice the best-of-breed approach also\nbelieve it’s more cost-effective, according to research for the\nbenchmark study.\n\nWhen comparing best-of-breed to integrated solutions,\n72 percent of security professionals said they buy best-ofbreed point solutions to meet specific needs, compared with\n28 percent who buy products intended to work together as\nan integrated solution (see Figure 52). Of the organizations\nthat adopt a best-of-breed approach, 57 percent cite\n\n\ncost-effectiveness, while 39 percent said the best-of-breed\napproach is easier to implement.\n\nInterestingly, organizations that adopt an integrated approach\nto security cite similar reasons for their choice. Fifty-six\npercent said an integrated approach is more cost-effective.\nForty-seven percent said it’s easier to implement.\n\nEase of implementation is increasingly cited as a factor for\nusing an integrated architecture approach: Only 33 percent\nof organizations said ease of implementation was a reason\nto choose an integrated approach in 2016, compared to 47\npercent in 2017. While single-vendor solutions may not be\npractical for all organizations, buyers of security solutions\nmust help ensure that solutions work together to reduce risk\nand increase efficacy.\n\n\n###### Figure 52 Seventy-two percent buy best-of-breed solutions because they meet specific needs\n\n|28 Integ|% rated|\n|---|---|\n\n\n-----\n\n###### Services: Addressing people and policies, as well as technology\n\n\nFaced with potential losses and adverse impact on\nsystems, organizations need to move beyond relying solely\non technology for defense. That means examining other\nopportunities to improve security, such as applying policies or\ntraining users. This holistic approach to security can be seen\nin the issues identified during an Intelligence Lead Security\nAssurance (known as a “Red Team” assessment) provided by\nthe Cisco Advanced Services Security Advisory team.\n\n\nFigure 54 offers examples of issues identified by category\nduring the simulations. Some issues, such as weak\npasswords, cross over all three categories. Strengthening\npasswords can require improvements in people (user training),\nproducts (configuring servers for more complex passwords),\nand policies (setting stronger password requirements).\n\n\n-----\n\n###### Expectations: Investing in technology and training\n\n\nSecurity professionals fully anticipate that the threats facing\ntheir organizations will remain complex and challenging.\nThey expect bad actors to develop more sophisticated and\ndamaging ways to breach networks. They also know that\nthe modern workplace creates conditions that favor the\nattackers: The mobility of employees and adoption of IoT\ndevices provide attackers with fresh opportunities. Along with\nincreased threats, many security professionals expect they’ll\nbe under additional scrutiny—from regulators, executives,\nstakeholders, partners, and clients.\n\nTo reduce the likelihood of risk and losses, defenders must\ndetermine where to invest finite resources. For the most\npart, security professionals said that security budgets remain\nrelatively stable, unless a major public breach drives a rethink\nof, and new expenditures for, technology and processes.\nFifty-one percent said security spending is based on previous\nyears’ budgets, while an equal percentage of respondents\nsaid outcome objectives drive budget (Figure 55). Most\nsecurity leaders said they believe their companies are\nspending appropriately on security.\n\n###### Figure 55 Fifty-one percent said security spending\n\nis driven by previous years’ budgets\n\n\nWhen planning budgets, many companies systematically\nwork through wish lists developed as part of comprehensive\nsecurity plans, prioritizing investments as resources become\navailable. Investments may be reset if new vulnerabilities are\nexposed, whether by an internal incident, a highly publicized\npublic breach, or a routine third-party risk assessment.\n\nThe most important factors driving future investment, and\ntherefore improvements in technology and processes,\nappear to be breaches. In 2017, 41 percent of security\nprofessionals said that security breaches are driving increased\ninvestment in security technologies and solutions, up from 37\npercent in 2016 (Figure 56). Forty percent said breaches are\ndriving increased investment in the training of security staff,\ncompared with 37 percent in 2016.\n\n###### Figure 56 Security breaches are driving investment\n\nin technology and training\n\n\n-----\n\nSecurity professionals expect to spend more on tools that use\nartificial intelligence and machine learning in a bid to improve\ndefenses and help shoulder the workload. In addition, they\nplan to invest in tools that will provide safeguards for critical\nsystems, such as critical infrastructure services.\n\n\nTo stretch resources and strengthen defenses, organizations\nare stepping up their reliance on outsourcing. Among security\nprofessionals, 49 percent said they outsourced monitoring\nservices in 2017, compared with 44 percent in 2015; 47\npercent outsourced incident response in 2017, compared\nwith 42 percent in 2015 (Figure 57).\n\n\n###### Figure 57 Use of outsourcing for monitoring and incident response is growing year over year\n\n**2014 (n=1738)** **2015 (n=2432)** **2016 (n=2912)**\n\nAdvice and Consulting 51% 52%\n\n\n-----\n\n# Conclusion\n\n\n-----\n\n###### Conclusion\n\nIn the modern threat landscape, adversaries are adept at\nevading detection. They have more effective tools, like\nencryption, and more advanced and clever tactics, such as\nthe abuse of legitimate Internet services, to conceal their\nactivity and undermine traditional security technologies. And\nthey are constantly evolving their tactics to keep their malware\nfresh and effective. Even threats known to the security\ncommunity can take a long time to identify.\n\n\nOne reason defenders struggle to rise above the chaos of\nwar with attackers, and truly see and understand what’s\nhappening in the threat landscape, is the sheer volume of\npotentially malicious traffic they face. Our research shows\nthat the volume of total events seen by Cisco cloud-based\nendpoint security products increased fourfold from January\n2016 through October 2017 (see Figure 58). “Total events”\nis the count of all events, benign or malicious, seen by our\ncloud-based endpoint security products during the\nperiod observed.\n\n\n###### Figure 58 Total volume of events\n\n4\n\n2\n\n0\n\n2016\n\nSource: Cisco Security Research\n\n\n-----\n\n###### Figure 59 Overall malware volume\n\n14\n\n12\n\n10\n\n8\n\n6\n\n4\n\n2\n\n0\n\n2016\n\nSource: Cisco Security Research\n\nOur security products also saw an elevenfold increase in overall\nmalware volume during that same period, as Figure 59 shows.\n\nTrends in malware volume have an impact on defenders’\ntime to detection (TTD), which is an important metric for any\norganization to understand how well its security defenses\nare performing under pressure from the constant barrage of\nmalware deployed by adversaries.\n\nThe Cisco median TTD of about 4.6 hours for the period\nfrom November 2016 to October 2017 helps to illustrate the\nongoing challenge of identifying threats quickly in the chaotic\nthreat landscape. Still, that figure is well below the 39-hour\nmedian TTD we reported in November 2015, after we first\n\n\nbegan tracking TTD, and the 14-hour median reported in the\n_Cisco 2017 Annual Cybersecurity Report for the period from_\nNovember 2015 to October 2016.[20]\n\nThe use of cloud-based security technology has been a key\nfactor in helping Cisco to drive and keep its median TTD at a\nlow level. The cloud helps to scale and maintain performance\nas both the volume of total events and malware targeting\nendpoints continues to increase. On-premises security\nsolutions would struggle to offer the same flexibility. Designing\none to scale that could handle more than 10 times the volume\ncapacity of malicious events over a two-year period—and\nmaintain or increase response times—would be a very difficult\nand costly undertaking for any organization.\n\n\n20 _[Cisco 2017 Annual Cybersecurity Report: cisco.com/c/m/en_au/products/security/offers/annual-cybersecurity-report-2017.html.](https://www.cisco.com/c/m/en_au/products/security/offers/annual-cybersecurity-report-2017.html)_\n\n\n-----\n\n# About Cisco\n\n\n-----\n\n### About Cisco\n\n###### Cisco delivers intelligent cybersecurity for the real world, providing one of the industry’s most comprehensive advanced-threat protection portfolios of solutions across the broadest set of attack vectors. Our threat-centric and operationalized approach to security reduces complexity and fragmentation while providing superior visibility, consistent control, and advanced threat protection before, during, and after an attack.\n\n\nThreat researchers from the Cisco Collective Security\nIntelligence (CSI) ecosystem bring together, under a single\numbrella, the industry’s leading threat intelligence using\ntelemetry obtained from the vast footprint of devices and\nsensors, public and private feeds, and the open-source\ncommunity. This amounts to a daily ingest of billions of\nweb requests and millions of emails, malware samples, and\nnetwork intrusions.\n\nOur sophisticated infrastructure and systems consume this\ntelemetry, helping machine-learning systems and researchers\n\n\ntrack threats across networks, data centers, endpoints, mobile\ndevices, virtual systems, web, and email, and from the cloud,\nto identify root causes and scope outbreaks. The resulting\nintelligence is translated into real-time protections for our\nproducts and services offerings that are immediately delivered\nglobally to Cisco customers.\n\n**To learn more about our threat-centric approach to**\n**security, visit** **[cisco.com/go/security.](http://www.cisco.com/go/security)**\n\n\n-----\n\n###### CISCO 2018 ANNUAL CYBERSECURITY REPORT CONTRIBUTORS\n We would like to thank our team of threat researchers and other subject-matter experts from within Cisco, as well as our technology partners, who contributed to the Cisco 2018 Annual Cybersecurity Report. Their research and perspectives are essential to helping Cisco provide the security community, businesses, and users with relevant insight into the complexity and vastness of the modern, global cyber threat landscape, and present best practices and knowledge for improving their defenses.\n\n Our technology partners also play a vital role in helping our company develop simple, open, and automated security that allows organizations to integrate the solutions they need to secure their environments.\n\n\n**Cisco Advanced Malware Protection (AMP) for Endpoints**\n\nCisco AMP for Endpoints provides automated prevention,\ndetection, and response capabilities in a single solution. It\ncontinuously monitors and analyzes for signs of malicious\nactivity to uncover threats that bypass frontline security, and\npose the greatest risk to organizations. It uses a variety of\ndetection techniques including advanced sandboxing, exploit\nprevention, as well as machine learning to rapidly detect and\nmitigate threats. Cisco AMP for Endpoints is the only solution\nthat provides retrospective security to quickly respond to\nthreats and identify the scope, point of origin, and how to\ncontain the threat so organizations stay protected.\n\n**Cisco Cloudlock**\n\nCisco Cloudlock provides cloud access security broker\n(CASB) solutions that help organizations securely use\nthe cloud. It delivers visibility and control for softwareas-a-service (SaaS), platform-as-a-service (PaaS), and\ninfrastructure-as-a-service (IaaS) environments across\nusers, data, and applications. It also provides actionable\ncybersecurity intelligence through its data scientist-led\nCyberLab and crowd-sourced security analytics.\n\n**Cisco Cognitive Threat Analytics**\n\nCisco Cognitive Threat Analytics is a cloud-based service\nthat discovers breaches, malware operating inside protected\nnetworks, and other security threats by means of statistical\nanalysis of network traffic data. It addresses gaps in\nperimeter-based defenses by identifying the symptoms of a\nmalware infection or data breach using behavioral analysis\nand anomaly detection. Cognitive Threat Analytics relies\non advanced statistical modeling and machine learning to\nindependently identify new threats, learn from what it sees,\nand adapt over time.\n\n\n**Cisco Product Security Incident Response Team (PSIRT)**\n\nThe Cisco Product Security Incident Response Team (PSIRT)\nis a dedicated, global organization that manages the receipt,\ninvestigation, and public disclosure of information about\nsecurity vulnerabilities and issues related to Cisco products\nand networks. PSIRT receives reports from independent\nresearchers, industry organizations, vendors, customers, and\nother sources concerned with product or network security.\n\n**Cisco Security Incident Response Services (CSIRS)**\n\nThe Cisco Security Incident Response Services (CSIRS)\nteam is made up of world-class incident responders who are\ntasked with assisting Cisco customers before, during, and\nafter they experience an incident. CSIRS leverages best-inclass personnel, enterprise-grade security solutions, cuttingedge response techniques, and best practices learned from\nyears of combating adversaries to ensure our customers are\nable to more proactively defend against, as well as quickly\nrespond to and recover from, any attack.\n\n**Cisco Talos Intelligence Group**\n\nCisco Talos Intelligence Group is one of the largest\ncommercial threat intelligence teams in the world, comprised\nof world-class researchers, analysts, and engineers. These\nteams are supported by unrivaled telemetry and sophisticated\nsystems to create accurate, rapid, and actionable threat\nintelligence for Cisco customers, products, and services.\nTalos Group defends Cisco customers against known and\nemerging threats, discovers new vulnerabilities in common\nsoftware, and interdicts threats in the wild before they can\nfurther harm the Internet at large. Talos intelligence is at the\ncore of Cisco products that detect, analyze, and protect\nagainst known and emerging threats. Talos maintains the\nofficial rule sets of Snort.org, ClamAV, and SpamCop in\naddition to releasing many open-source research and\nanalysis tools.\n\n\n-----\n\n**Cisco Threat Grid**\n\nCisco Threat Grid is a malware analysis and threat intelligence\nplatform. Threat Grid performs static and dynamic analysis\non suspected malware samples that are sourced from\ncustomers and product integrations located all over the world.\nHundreds of thousands of samples, in a variety of file types,\nare submitted to the Threat Grid Cloud every day through the\nThreat Grid Cloud portal user interface, or by Threat Grid API.\nThreat Grid can also be deployed as an on-site appliance.\n\n**Cisco Umbrella**\n\nCisco Umbrella is a secure Internet gateway that provides\nthe first line of defense against threats on the Internet\nwherever users go. Because it is built into the foundation of\nthe Internet, Umbrella delivers complete visibility into activity\nacross all locations, devices, and users. By analyzing and\nlearning from this activity, Umbrella automatically uncovers\nattacker infrastructure staged for current and emerging\nthreats, and proactively blocks requests before a connection\nis established.\n\n**Security Research and Operations (SR&O)**\n\nSecurity Research and Operations (SR&O) is responsible for\nthreat and vulnerability management of all Cisco products and\n\n\nservices, including the industry-leading Cisco PSIRT. SR&O\nhelps customers understand the evolving threat landscape at\nevents such as Cisco Live and Black Hat, as well as through\ncollaboration with its peers across Cisco and the industry.\nAdditionally, SR&O delivers new services such as Cisco\nCustom Threat Intelligence (CTI), which can identify indicators\nof compromise that have not been detected or mitigated by\nexisting security infrastructures.\n\n**Security and Trust Organization**\n\nThe Cisco Security and Trust Organization underscores our\ncommitment to address two of the most critical issues that\nare top of mind for boardrooms and world leaders alike. The\norganization’s core missions include protecting Cisco public\nand private customers, helping to enable and ensure Secure\nDevelopment Lifecycle and Trustworthy Systems efforts\nacross the Cisco product and service portfolio, and protecting\nthe Cisco enterprise from ever-evolving threats. Cisco takes\na holistic approach to pervasive security and trust, which\nincludes people, policies, processes, and technology. The\nSecurity and Trust Organization drives operational excellence,\nfocusing across InfoSec, Trustworthy Engineering, Data\nProtection and Privacy, Cloud Security, Transparency and\nValidation, and Advanced Security Research and Government.\n[For more information, visit trust.cisco.com.](http://trust.cisco.com)\n\n\n###### Cisco 2018 Annual Cybersecurity Report technology partners\n\n\nThe Anomali suite of threat intelligence solutions empowers\norganizations to detect, investigate, and respond to active\ncybersecurity threats. The award-winning ThreatStream\nthreat intelligence platform aggregates and optimizes millions\nof threat indicators, creating a “cyber no-fly list.” Anomali\nintegrates with internal infrastructure to identify new attacks,\nsearches forensically over the past year to discover existing\nbreaches, and enables security teams to quickly understand\nand contain threats. Anomali also offers STAXX, a free tool to\ncollect and share threat intelligence, and provides a free, outof-the-box intelligence feed, Anomali Limo. To learn more,\n[visit anomali.com and follow us on Twitter: @anomali.](http://anomali.com)\n\n\nLumeta provides critical cyber-situational awareness that\nhelps security and network teams prevent breaches. Lumeta\noffers unmatched discovery of known, unknown, shadow,\nand rogue network infrastructure above any other solution on\nthe market today, as well as real-time network and endpoint\nmonitoring to detect unauthorized changes, prevent leak\npaths, ensure proper network segmentation, and detect\nsuspicious network behaviors across dynamic network\nelements, endpoints, virtual machines, and cloud-based\n[infrastructure. For more information, visit lumeta.com.](http://lumeta.com)\n\n\n-----\n\nQualys, Inc. (NASDAQ: QLYS) is a pioneer and leading\nprovider of cloud-based security and compliance solutions\nwith over 9300 customers in more than 100 countries,\nincluding a majority of each of the Forbes Global 100 and\nFortune 100. The Qualys Cloud Platform and integrated suite\nof solutions help organizations simplify security operations\nand lower the cost of compliance by delivering critical security\nintelligence on demand, and automating the full spectrum\nof auditing, compliance, and protection for IT systems and\nweb applications. Founded in 1999, Qualys has established\nstrategic partnerships with leading managed service providers\nand consulting organizations worldwide. For more information,\n[visit qualys.com.](http://qualys.com)\n\nRadware (NASDAQ: RDWR) is a global leader of application\ndelivery and cybersecurity solutions for virtual, cloud, and\nsoftware-defined data centers. Its award-winning solutions\nportfolio delivers service-level assurance for more than\n10,000 enterprises and carriers worldwide. For additional\nexpert security resources and information, visit Radware’s\nonline security center, which offers a comprehensive\nanalysis of DDoS attack tools, trends, and threats:\n[security.radware.com.](http://security.radware.com)\n\n\nSAINT Corporation, a leader in next-generation, integrated\nvulnerability management solutions, helps corporations and\npublic sector institutions pinpoint risk exposures at all levels\nof the organization. SAINT does it right so access, security,\nand privacy can coexist to the benefit of all. And SAINT\nenables clients to strengthen InfoSec defenses while\nlowering total cost of ownership. For more information, visit\n[saintcorporation.com.](http://saintcorporation.com)\n\nTrapX Security provides an automated security grid for\nadaptive deception and defense that intercepts real-time\nthreats while providing the actionable intelligence to block\nattackers. TrapX DeceptionGrid™ allows enterprises to detect,\ncapture, and analyze zero-day malware in use by the world’s\nmost effective advanced persistent threat (APT) organizations.\nIndustries rely on TrapX to strengthen their IT ecosystems\nand reduce the risk of costly and disruptive compromises,\ndata breaches, and compliance violations. TrapX defenses are\nembedded at the heart of the network and mission-critical\ninfrastructure, without the need for agents or configuration.\nCutting-edge malware detection, threat intelligence, forensics\nanalysis, and remediation in a single platform help remove\n[complexity and cost. For more information, visit trapx.com.](http://trapx.com)\n\n\n-----\n\n# Appendix\n\n\n-----\n\n###### Figure 60 Expectations for cyber attacks in OT and IT, by country or region\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\nExpect Cyber Attacks to Extend Beyond IT into Expect Cyber Attacks to Extend Beyond IT into OT,\nOT in the Next Year but Not in the Next Year\nHave Already Seen Cyber Attacks in OT Believe Cyber Attacks Will Remain Focused on IT\n\nSource: Cisco 2018 Security Capabilities Benchmark Study\n\n###### Figure 61 Number of security vendors in environment, by country or region\n\n\n-----\n\n###### Figure 62 Percent of alerts uninvestigated, by country or region\n\n70\n\n60\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\n*MEA: Saudi Arabia, South Africa, Turkey, UAE **Other European Countries: Belgium, Netherlands,\nPoland, Switzerland & Sweden Chile & Colombia\n\nSource: Cisco 2018 Security Capabilities Benchmark Study\n\n###### Figure 63 Obstacles to adopting advanced security processes and technology, by country or region\n\n\nWhich of the following do you consider the biggest obstacles\nto adopting advanced security processes and technology?\n\nBudget constraints 23% 35%\n\n\nCompeting priorities\n\nLack of trained personnel\n\n\nLack of knowledge about advanced\nsecurity processes and technology\n\nCompatibility issues with legal systems\n\n\nCertification requirements\n\nOrganizational culture/\nattitude about security\n\n\nReluctant to purchase until they\nare proven in the market\n\nCurrent workload too heavy to\ntake on new responsibilites\n\n\nOrganization is not a high-value\ntarget for attacks\n\nSecurity is not an executive-level priority\n\n|Col1|Aust|Braz|Cana|Fran|Germ|India|Italy|Japa|Mex|Peop of C|Russ|Spai|UK|US|MEA|Othe Euro|Othe Ame|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n|Budget constraints|23%|35%|29%|33%|25%|36%|38%|31%|31%|38%|60%|33%|27%|34%|36%|37%|35%|\n|Competing priorities|28%|11%|29%|27%|28%|26%|24%|27%|16%|27%|20%|18%|32%|32%|25%|18%|24%|\n|Lack of trained personnel|25%|28%|19%|22%|24%|31%|24%|28%|30%|25%|35%|33%|31%|26%|25%|23%|26%|\n|Lack of knowledge about advanced security processes and technology|26%|26%|24%|21%|22%|24%|21%|26%|23%|29%|18%|21%|27%|22%|22%|17%|21%|\n|Compatibility issues with legal systems|27%|19%|30%|27%|30%|30%|22%|23%|32%|40%|25%|25%|24%|28%|30%|25%|28%|\n|Certification requirements|33%|27%|29%|29%|24%|27%|27%|22%|27%|23%|22%|27%|27%|30%|24%|33%|21%|\n|Organizational culture/ attitude about security|30%|23%|25%|20%|16%|26%|17%|21%|26%|17%|19%|24%|28%|25%|20%|20%|27%|\n|Reluctant to purchase until they are proven in the market|19%|20%|23%|26%|25%|29%|20%|28%|15%|16%|17%|20%|21%|22%|22%|21%|25%|\n|Current workload too heavy to take on new responsibilites|22%|16%|28%|18%|28%|28%|26%|27%|23%|21%|15%|28%|22%|22%|20%|17%|19%|\n|Organization is not a high-value target for attacks|25%|18%|21%|22%|24%|17%|14%|20%|12%|16%|11%|13%|21%|21%|21%|20%|16%|\n|Security is not an executive-level priority|22%|10%|17%|17%|20%|13%|13%|23%|15%|18%|11%|11%|19%|19%|17%|19%|21%|\n\n\n*MEA: Saudi Arabia, South Africa, Turkey, UAE **Other European Countries: Belgium, Netherlands, ***Other Latin American Countries: Argentina,\nPoland, Switzerland & Sweden Chile & Colombia\n\nSource: Cisco 2018 Security Capabilities Benchmark Study [Download the 2018 graphics at: cisco.com/go/acr2018graphics](http://cisco.com/go/acr2018graphics)\n\n\n-----\n\n###### Figure 65 Percent of organizations perceiving they follow standardized infosec framework very well, by country or region\n\n\n-----\n\n###### Download the graphics\n\nAll the graphics in this report are downloadable at:\n[cisco.com/go/mcr2018graphics.](http://cisco.com/go/acr2018graphics)\n\n\n###### Updates and corrections\n\nTo see updates and corrections to the information\n[in this project, visit cisco.com/go/errata.](http://cisco.com/go/errata)\n\n\n**Americas Headquarters**\nCisco Systems, Inc.\nSan Jose, CA\n\n\n**Asia Pacific Headquarters**\nCisco Systems (USA) Pte. Ltd.\nSingapore\n\n\n**Europe Headquarters**\nCisco Systems International BV Amsterdam,\nThe Netherlands\n\n\n[Cisco has more than 200 offices worldwide. Addresses, phone numbers, and fax numbers are listed on the Cisco Website at www.cisco.com/go/offices.](http://www.cisco.com/cisco/web/siteassets/contacts/index.html)\n\nPublished February 2018\n\n© 2018 Cisco and/or its affiliates. All rights reserved.\n\nCisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. To view a list of Cisco trademarks,\ngo to this URL: [www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not](http://www.cisco.com/go/trademarks)\nimply a partnership relationship between Cisco and any other company. (1110R)\n\nAdobe Acrobat and Flash are either registered trademarks or trademarks of Adobe Systems Incorporated in the United States and/or other countries\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Cisco - Annual Cybersecurity Report - 2018.pdf"
    ],
    "report_names": [
        "Cisco - Annual Cybersecurity Report - 2018.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535691,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1518554202,
    "ts_modification_date": 1519280834,
    "files": {
        "pdf": "https://archive.orkl.eu/77492691c13f45e32767d1f1a969ce47932c9dfb.pdf",
        "text": "https://archive.orkl.eu/77492691c13f45e32767d1f1a969ce47932c9dfb.txt",
        "img": "https://archive.orkl.eu/77492691c13f45e32767d1f1a969ce47932c9dfb.jpg"
    }
}