{
    "id": "1024506b-e7cb-4f03-a874-dab17af09f82",
    "created_at": "2023-01-12T15:04:40.608801Z",
    "updated_at": "2025-03-27T02:11:48.974142Z",
    "deleted_at": null,
    "sha1_hash": "5c9dd627464e34f78cd406e169ec95d77ff1fd58",
    "title": "2022-07-05 - Hive ransomware gets upgrades in Rust",
    "authors": "",
    "file_creation_date": "2022-07-18T18:23:04Z",
    "file_modification_date": "2022-07-18T18:23:04Z",
    "file_size": 2272770,
    "plain_text": "# Hive ransomware gets upgrades in Rust\n\n**[microsoft.com/security/blog/2022/07/05/hive-ransomware-gets-upgrades-in-rust/](https://www.microsoft.com/security/blog/2022/07/05/hive-ransomware-gets-upgrades-in-rust/)**\n\nJuly 5, 2022\n\nHive ransomware is only about one year old, having been first observed in June 2021, but it has\n[grown into one of the most prevalent ransomware payloads in the ransomware-as-a-service (RaaS)](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/)\necosystem. With its latest variant carrying several major upgrades, Hive also proves it’s one of the\nfastest evolving ransomware families, exemplifying the continuously changing ransomware\necosystem.\n\nThe upgrades in the latest variant are effectively an overhaul: the most notable changes include a\nfull code migration to another programming language and the use of a more complex encryption\nmethod. The impact of these updates is far-reaching, considering that Hive is a RaaS payload that\nMicrosoft has observed in attacks against organizations in the healthcare and software industries by\n[large ransomware affiliates like DEV-0237.](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/#DEV-0237)\n\nMicrosoft Threat Intelligence Center (MSTIC) discovered the new variant while analyzing detected\nHive ransomware techniques for dropping .key files. We know that Hive drops its encryption keys\nfile, which contains encrypted keys used to decrypt encrypted files, and uses a consistent naming\npattern:\n```\n[KEY_NAME].key.[VICTIM_IDENTIFIER]\n\n(e.g., BiKtPupMjgyESaene0Ge5d0231uiKq1PFMFUEBNhAYv_.key.ab123)\n\n```\nThe said .key files were missing the [VICTIM_IDENTIFIER] part of the file name, prompting deeper\nanalysis of the Hive ransomware that dropped them. This analysis led to the discovery of the new\nHive variant and its multiple versions, which exhibit slightly different available parameters in the\ncommand line and the executed processes.\n\nAnalyzing these patterns in samples of the new variants, we discovered even more samples, all with\na low detection rate and none being correctly identified as Hive. In this blog we will share our indepth analysis of the new Hive variant, including its main features and upgrades, with the aim of\nequipping analysts and defenders with information to better identify and protect organizations\nagainst malware attacks relying on Hive.\n\n## Analysis and key findings\n\n### The switch from GoLang to Rust\n\nThe main difference between the new Hive variant and old ones is the programming language used.\nThe old variants were written in Go (also referred to as GoLang), while the new Hive variant is\nwritten in Rust.\n\n\n-----\n\nHive isn t the first ransomware written in Rust—BlackCat, another prevalent ransomware, was the\nfirst. By switching the underlying code to Rust, Hive benefits from the following advantages that Rust\nhas over other programming languages:\n\nIt offers memory, data type, and thread safety\nIt has deep control over low-level resources\nIt has a user-friendly syntax\nIt has several mechanisms for concurrency and parallelism, thus enabling fast and safe file\nencryption\nIt has a good variety of cryptographic libraries\nIt’s relatively more difficult to reverse-engineer\n\n### String encryption\n\nThe new Hive variant uses string encryption that can make it more evasive. Strings reside in the\n_.rdata section and are decrypted during runtime by XORing with constants. The constants that are_\nused to decrypt the same string sometimes differ across samples, making them an unreliable basis\nfor detection.\n\nFor example, let’s look at the section where part of the string “!error no flag -u <login>:<password>\n_provided” is decrypted. In one sample (SHA-256:_\nf4a39820dbff47fa1b68f83f575bc98ed33858b02341c5c0464a49be4e6c76d3), the constants are\n0x9F2E3F1F and 0x95C9:\n\nFigure 1 – String decryption using constants 0x9F2E3F1F and 0x95C9\nIn another sample (SHA-256:\n6e5d49f604730ef4c05cfe3f64a7790242e71b4ecf1dc5109d32e811acf0b053), the constants are\n0x3ECF7CC4 and 0x198F:\n\nFigure 2 – String decryption using constants 0x3ECF7CC4 and 0x198F\nSome samples do share constants when decrypting the same string. For example, let’s look where\nthe parameter string “-da” is decrypted. In one sample (SHA-256:\n88b1d8a85bf9101bc336b01b9af4345ed91d3ec761554d167fe59f73af73f037), the constants are\n0x71B4 and 2:\n\n\n-----\n\nFigure 3 – String decryption using\n\nconstants 0x71B4 and 2\nIn another sample (SHA-256:\n33744c420884adf582c46a4b74cbd9c145f2e15a036bb1e557e89d6fd428e724), the constants are\nthe same:\n\nFigure 4 – String decryption in a different\n\nsample also using constants 0x71B4 and 2\n\n### Command-line parameters\n\nIn old Hive variants, the username and the password used to access the Hive ransom payment\nwebsite are embedded in the samples. In the new variant, these credentials must be supplied in the\ncommand line under the “-u” parameter, which means that they can’t be obtained by analysts from\nthe sample itself.\n\nFigure 5 – Without a\n\nusername and a password, the sample won’t continue its execution\nLike most modern ransomware, Hive introduces command-line parameters, which allow attackers\nflexibility when running the payload by adding or removing functionality. For example, an attacker\ncan choose to encrypt files on remote shares or local files only or select the minimum file size for\nencryption. In the new Hive variant, we found the following parameters across different samples:\n\n**Parameter** **Functionality**\n\n-no-local Don’t encrypt local files\n\n\n-nomounted\n\n-nodiscovery\n\n\nDon’t encrypt files on mounted network shares\n\nDon’t discover network shares\n\n\n-local-only Encrypt only local files\n\n\n-networkonly\n\n\nEncrypt only files on network shares\n\n\n-----\n\n-explicitonly\n\n\nEncrypt specific folder(s). For example, ‘-explicit-only c:\\mydocs c:\\myphotos’\n\n\n-min-size Minimum file size, in bytes, to encrypt. For example, ‘-min-size 102400’ will encrypt\nfiles with size equal or greater than 100kb\n\n-da [Usage is being analyzed.]\n\n-f [Usage is being analyzed.]\n\n-force [Usage is being analyzed.]\n\n-wmi [Usage is being analyzed.]\n\nOverall, it appears different versions have different parameters that are constantly updated. Unlike in\nprevious variants where there was a ‘help’ menu, in the new variant, the attacker must know the\nparameters beforehand. Since all strings are encrypted, it makes finding the parameters challenging\nfor security researchers.\n\n### Stopped services and processes\n\nLike most sophisticated malware, Hive stops services and processes associated with security\nsolutions and other tools that might get in the way of its attack chain. Hive tries to impersonate the\nprocess tokens of trustedinstaller.exe and winlogon.exe so it can stop Microsoft Defender Antivirus,\namong other services.\n\nHive stops the following services:\n```\nwindefend, msmpsvc, kavsvc, antivirservice, zhudongfungyu, vmm, vmwp, sql, sap, oracle,\nmepocs, veeam, backup, vss, msexchange, mysql, sophos, pdfservice, backupexec, gxblr, gxvss,\ngxclmgrs, gxvcd, gxcimgr, gxmmm, gxvsshwprov, gxfwd, sap, qbcfmonitorservice, qbidpservice,\nacronisagent, veeam, mvarmor, acrsch2svc\n\n```\nIt also stops the following processes:\n```\ndbsnmp, dbeng50, bedbh, excel, encsvc, visios, firefox, isqlplussvc, mspub, mydesktopqos,\nnotepad, ocautoupds, ocomm, ocssd, onenote, outlook, sqbcoreservice, sql, steam,\ntbirdconfig, thunderbird, winword, wordpad, xfssvccon, vxmon, benetns, bengien, pvlsvr,\nraw_agent_svc, cagservice, sap, qbidpservice, qbcfmonitorservice, teamviewer_service,\nteamviewer, tv_w32, tv_x64, cvd, saphostexec, sapstartsrv, avscc, dellsystemdetect,\nenterpriseclient, veeam, thebat, cvfwd, cvods, vsnapvss, msaccess, vaultsvc, beserver,\nappinfo, qbdmgrn, avagent, spooler, powerpnt, cvmountd, synctime, oracle, wscsvc, winmgmt,\n*sql*\n\n### Launched processes\n\n```\nAs part of its ransomware activity, Hive typically runs processes that delete backups and prevent\nrecovery. There are differences between versions, and some samples may not execute all these\nprocesses, but one sample that starts the most processes is SHA-256:\n481dc99903aa270d286f559b17194b1a25deca8a64a5ec4f13a066637900221e:\n\n_“vssadmin.exe delete shadows /all /quiet”_\n\n\n-----\n\n_wmic.exe shadowcopy delete_\n_“wbadmin.exe delete systemstatebackup”_\n_“wbadmin.exe delete catalog -quiet”_\n_“bcdedit.exe /set {default} recoveryenabled No”_\n_“bcdedit.exe /set {default} bootstatuspolicy ignoreallfailures”_\n_“wbadmin.exe delete systemstatebackup -keepVersions:3”_\n\n### Ransom note\n\nHive’s ransom note has also changed, with the new version referencing the .key files with their new\nfile name convention and adding a sentence about virtual machines (VMs).\n\nThe older variants had an embedded username and password (marked as hidden). In the new\nvariant, the username and password are taken from the command line parameter -u and are labeled\n_test_hive_username and test_hive_password._\n\nOld ransom note text:\n```\n Your network has been breached and all data were encrypted.\n\nPersonal data, financial reports and important documents are ready to disclose.\n\nTo decrypt all the data and to prevent exfiltrated files to be disclosed at\n\nhttp://hive[REDACTED].onion/\n\nyou will need to purchase our decryption software.\n\nPlease contact our sales department at:\n\n  http://hive[REDACTED].onion/\n\n   Login:  [REDACTED]\n\n   Password: [REDACTED]\n\nTo get an access to .onion websites download and install Tor Browser at:\n\n  https://www.torproject.org/ (Tor Browser is not related to us)\n\nFollow the guidelines below to avoid losing your data:\n\n- Do not modify, rename or delete *.key.abc12 files. Your data will be\n\n  undecryptable.\n\n- Do not modify or rename encrypted files. You will lose them.\n\n- Do not report to the Police, FBI, etc. They don't care about your business.\n\n  They simply won't allow you to pay. As a result you will lose everything.\n\n- Do not hire a recovery company. They can't decrypt without the key.\n\n  They also don't care about your business. They believe that they are\n\n  good negotiators, but it is not. They usually fail. So speak for yourself.\n\n- Do not reject to purchase. Exfiltrated files will be publicly disclosed.\n\n```\nNew ransom note text:\n\n\n-----\n\n```\nYour network has been breached and all data were encrypted.\n\nPersonal data, financial reports and important documents are ready to disclose.\n\nTo decrypt all the data and to prevent exfiltrated files to be disclosed at\n\nhttp://hive[REDACTED].onion/\n\nyou will need to purchase our decryption software.\n\nPlease contact our sales department at:\n\n  http://hive[REDACTED].onion/\n\n   Login:  test_hive_username\n\n   Password: test_hive_password\n\nTo get an access to .onion websites download and install Tor Browser at:\n\n  https://www.torproject.org/ (Tor Browser is not related to us)\n\nFollow the guidelines below to avoid losing your data:\n\n- Do not delete or reinstall VMs. There will be nothing to decrypt.\n\n- Do not modify, rename or delete *.key files. Your data will be\n\n  undecryptable.\n- Do not modify or rename encrypted files. You will lose them.\n\n- Do not report to the Police, FBI, etc. They don't care about your business.\n\n  They simply won't allow you to pay. As a result you will lose everything.\n\n- Do not hire a recovery company. They can't decrypt without the key.\n\n  They also don't care about your business. They believe that they are\n\n  good negotiators, but it is not. They usually fail. So speak for yourself.\n\n- Do not reject to purchase. Exfiltrated files will be publicly disclosed.\n\n### Encryption\n\n```\nThe most interesting change in the Hive variant is its cryptography mechanism. The new variant was\nfirst uploaded to VirusTotal on February 21, 2022, just a few days after a group of researchers from\nKookmin University in South Korea published the paper “A Method for Decrypting Data Infected with\nHive Ransomware” on February 17, 2022. After a certain period of development, the new variant\nfirst appeared in Microsoft threat data on February 22.\n\nThe new variant uses a different set of algorithms: Elliptic Curve Diffie-Hellmann (ECDH)\nwith [Curve25519 and](https://en.wikipedia.org/wiki/Curve25519) [XChaCha20-Poly1305 (authenticated encryption with ChaCha20 symmetric](https://en.wikipedia.org/wiki/ChaCha20-Poly1305)\ncipher).\n\n**A unique encryption approach**\n\nThe new Hive variant uses a unique approach to file encryption. Instead of embedding an encrypted\nkey in each file that it encrypts, it generates two sets of keys in memory, uses them to encrypt files,\nand then encrypts and writes the sets to the root of the drive it encrypts, both with .key extension.\n\nTo indicate which keys set was used to encrypt a file, the name of the .key file containing the\ncorresponding encryption keys is added to the name of the encrypted file on disk, followed by an\nunderscore and then a Base64 string (also adding underscore and hyphen to the character set).\n\n\n-----\n\nOnce it s Base64-decoded, the string contains two offsets, with each offset pointing to a different\nlocation in the corresponding .key file. This way, the attacker can decrypt the file using these offsets.\n\nFor example, after running Hive, we got the following files dropped to the C:\\ drive:\n\n_C:\\3bcVwj6j.key_\n_C:\\l0Zn68cb.key_\n\nIn this example, a file named myphoto.jpg would be renamed to C:\\myphoto.jpg.l0Zn68cb _ _B82BhIaGhI8. As we discuss in the following sections, the new variant’s keys set generation is_\nentirely different from old variants. However, its actual file encryption is very similar.\n\n**Keys set generation**\n\nA buffer of size 0xCFFF00 bytes is allocated. Using two custom functions to generate random bytes\n(labeled “random_num_gen” and “random_num_gen_2” for demonstration purposes) the buffer is\nfilled. The first 0xA00000 bytes of this buffer are filled with random bytes and the remaining\n0x2FFF00 bytes are simply copied from the first 0x2FFF00 random bytes that were copied earlier to\nthe buffer.\n\nThe content of each buffer is a keys set (a collection of symmetric keys). Since two buffers are\nallocated, there are two keys sets. In the encryption process, the malware randomly selects different\nkeys (byte sequences) for each file from one of the keys set and uses them to encrypt the file by\nXORing the byte sequence of the keys with the file’s content.\n\n\n-----\n\n-----\n\nFigure 6 – Original keys set generation Figure 7\n\n– Inside get_random_byte\nA custom 64-byte hash is prepared for each keys set. This hash will be used later.\n\nFigure 8 – Preparing the custom hash of the keys set\n\n\n-----\n\nAfter the hash is computed and several other strings are decrypted, the encryption process takes the\nfollowing steps:\n\n1. Generate victim_private_key using the same functions introduced above.\n\nFigure 9 – Generating\n\nvictim_private_key\n\n1. Generate victim_public_key using ECDH with Curve25519. The input is victim_private_key\n\nand the basepoint is 9 followed by 31 zeros (embedded in the sample).\n\n\n-----\n\nFigure 10 –\n\nGenerating victim_public_key\n\n1. Generate a 24-byte nonce for the XChaCha algorithm, later in Poly1305-XChaCha20.\n\nFigure 11 –\n\nGenerating a 24-byte nonce\n\n1. Generate shared_secret using ECDH with Curve25519. The input is victim_private_key and\n\n_hive_public_key. Then, the shared_secret (as a key) with hive_public_key (as a nonce) is_\nused to derive the derived_key using ChaCha20.\n\n\n-----\n\nFigure 12\n\n– Generating shared_secret\n\n1. Encrypt the keys set using Poly1305-XChaCha20. The values used for the encryption are the\n\nkeys set, derived_key, nonce, and the embedded associated data (AD). This function encrypts\nthe keys set and adds a 16-byte authentication tag at the end of the buffer of the encrypted\nkeys. It’s unclear if the authentication tag is ever checked.\n\nFigure 13 – Encrypting the keys set\nNow that the keys set is finally encrypted, the nonce, victim_public_key, the now-encrypted keys set,\nand the authentication tag are copied to a new buffer, one after another. This buffer (which we label\n_encrypted_structure_1) is treated as a new keys set, which is again encrypted using the same_\nmethod described above but with a second hive_public_key. This time, the function outputs new\nnonce, victim_private_key, and others. Only the associated data is the same.\n\nFinally, the new buffer, which contains the second_nonce, second_victim_public_key, and the\nencryptedencrypted_structure_1, is written to the root of the drive it’s encrypting (for example, C:\\).\nThe create_extension function generates a Base64 string based on the first six bytes of the custom\nhash that was created earlier. This Base64 string serves as the file name, and the extension of the\nfile is simply “.key”.\n\n\n-----\n\nFigure 14 – Generating a Base64 string based on the first six bytes of the custom hash\n\nFigure 15 – Using the\n\nBase64 string as the file name\nThe diagram below illustrates the encryption scheme described above:\n\nFigure 16 – The keys set encryption scheme of the new Hive variant\nAs seen in the diagram above, “Keys sets encryption flow” is executed twice. In the first round it is\nexecuted with the original keys set as an input. In the second round it is executed with the\n“encrypted structure 1” as an input. In its second execution, all other input values are different\nexcept the AD (associated data) and the Basepoint 9.\n\nHence, the following values are new in the second execution: victim_private_key, victim_public_key,\n_hive_public_key, nonce, shared_secret and derived_key._\n\n**File encryption**\n\nAfter both keys files are written to the disk, the multi-threaded file encryption starts. Before\nencrypting each file, the malware checks its name and extension against a list of strings. If there is a\nmatch, then the file will not be encrypted. For example, a file with .exe extension will not be\n\n\n-----\n\nencrypted if .exe is in the list of strings. It should be noted that this list is encrypted and decrypted\nduring runtime.\n\nThe same file encryption method seen in old variants is used in the new one: two random numbers\nare generated and used as offsets to the keys set. Each offset is four bytes:\n\nFigure 17 – Generating the offsets\nFor the encryption, the file’s content is XORed with bytes from the keys set, according to the offsets.\nThe file bytes are XORed twice—once according to the first offset and a second time according to\nthe second offset. Files are encrypted in blocks of 0x100000 bytes, with the maximum number of\nblocks at 100. There is an interval between the encrypted blocks as defined by block_space. After\nthe encryption is finished in memory, the encrypted data is written to the disk, overwriting the original\nfile.\n\n\n-----\n\nFigure 18 – Calculation of number of blocks\n\nFigure 19 – Actual encryption of the file bytes\n\n\nFigure 20 –\n\n\n-----\n\nReading a file, encrypting it, and writing it back to the disk\nLooking at when create_extension is called once file encryption has started, we recognized a similar\nstructure in the previous variant:\n\nFigure 21 –\n\nCreating the extension for the file\nLet us look at the value (72 D7 A7 A3 F5 5B FF EF 21 6B 11 7C 2A 18 CD 00) in the address of r9\nregister just before create_extension is called on a file called EDBtmp.log\n\nRecall that in the older variants, 0xFF was used as a delimiter to separate the key file name from the\noffset values. We can also see it here. Converting the first six bytes (72 D7 A7 A3 F5 5B) to Base64\nyields the following:\n\n\n-----\n\n```\ncteno/Vb\n\n```\nAnd if we step over create_extension, the result is similar—we get cteno_Vb as the .key file name\n(note: Since Hive uses a different Base64 character set, “/” was replaced with “_”):\n\nMicrosoft will continue to monitor the Hive operators’ activity and implement protections for our\ncustomers. The current detections, advanced detections, and indicators of compromise (IOCs) in\nplace across our security products are detailed below.\n\n## Recommended customer actions\n\nThe techniques used by the new Hive variant can be mitigated by adopting the security\nconsiderations provided below:\n\nUse the included IOCs to investigate whether they exist in your environment and assess for\npotential intrusion.\n\nOur recent [blog on the ransomware-as-a-service economy has an exhaustive guide on how to](https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/)\nprotect yourself from ransomware threats that dive deep into each of the following areas. We\nencourage readers to refer to that blog for a comprehensive guide on:\n\nBuilding credential hygiene\nAuditing credential exposure\nPrioritizing deployment of Active Directory updates\nCloud hardening\n\n[Implement the Azure Security Benchmark and general best practices for securing identity](https://docs.microsoft.com/security/benchmark/azure/)\ninfrastructure.\nEnsure cloud admins/tenant admins are treated with the same level of security and\ncredential hygiene as Domain Admins.\n[Address gaps in authentication coverage.](https://docs.microsoft.com/azure/active-directory/authentication/how-to-authentication-find-coverage-gaps)\n[Enforce MFA on all accounts, remove users excluded from MFA, and strictly require MFA from](https://docs.microsoft.com/azure/active-directory/identity-protection/howto-identity-protection-configure-mfa-policy)\nall devices, in all locations, at all times.\nEnable passwordless authentication methods (for example, Windows Hello, FIDO keys, or\nMicrosoft Authenticator) for accounts that support passwordless. For accounts that still require\npasswords, use authenticator apps like Microsoft Authenticator for MFA.\nDisable legacy authentication.\n\nFor Microsoft 365 Defender customers, the following checklist eliminates security blind spots:\n\nTurn on [cloud-delivered protection in Microsoft Defender Antivirus to cover rapidly evolving](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/configure-block-at-first-sight-microsoft-defender-antivirus?view=o365-worldwide)\nattacker tools and techniques, block new and unknown malware variants, and enhance attack\nsurface reduction rules and tamper protection.\nTurn on [tamper protection features to prevent attackers from stopping security services.](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection?view=o365-worldwide)\n\n\n-----\n\n[Run EDR in block mode so that Microsoft Defender for Endpoint can block malicious artifacts,](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/edr-in-block-mode?view=o365-worldwide)\neven when a non-Microsoft antivirus doesn’t detect the threat or when Microsoft Defender\nAntivirus is running in passive mode. EDR in block mode also blocks indicators identified\nproactively by Microsoft Threat Intelligence teams.\n[Enable network protection to prevent applications or users from accessing malicious domains](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/enable-network-protection?view=o365-worldwide)\nand other malicious content on the internet.\n[Enable investigation and remediation in full automated mode to allow Microsoft Defender for](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/automated-investigations?view=o365-worldwide)\nEndpoint to take immediate action on alerts to resolve breaches.\nUse [device discovery to increase visibility into the network by finding unmanaged devices and](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/device-discovery?view=o365-worldwide)\nonboarding them to Microsoft Defender for Endpoint.\n[Protect user identities and credentials using Microsoft Defender for Identity, a cloud-based](https://docs.microsoft.com/defender-for-identity/what-is)\nsecurity solution that leverages on-premises Active Directory signals to monitor and analyze\nuser behavior to identify suspicious user activities, configuration issues, and active attacks.\n\n## Indicators of compromise (IOCs)\n\nThe below list provides a partial list of the IOCs observed during our investigation and included in\nthis blog. We encourage our customers to investigate these indicators in their environments and\nimplement detections and protections to identify past related activity and prevent future attacks\nagainst their systems.\n\n**Indicator** **Type** **Description**\n\n\nf4a39820dbff47fa1b68f83f575bc98ed33858b02341c5c0464a49be4e6c76d3 SHA256\n\n88b1d8a85bf9101bc336b01b9af4345ed91d3ec761554d167fe59f73af73f037 SHA256\n\n065208b037a2691eb75a14f97bdbd9914122655d42f6249d2cca419a1e4ba6f1 SHA256\n\n33744c420884adf582c46a4b74cbd9c145f2e15a036bb1e557e89d6fd428e724 SHA256\n\nafab34235b7f170150f180c7afb9e3b4e504a84559bbd03ab71e64e3b6541149 SHA256\n\n36759cab7043cd7561ac6c3968832b30c9a442eff4d536e901d4ff70aef4d32d SHA256\n\n481dc99903aa270d286f559b17194b1a25deca8a64a5ec4f13a066637900221e SHA256\n\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\n\n-----\n\n6e5d49f604730ef4c05cfe3f64a7790242e71b4ecf1dc5109d32e811acf0b053 SHA256\n\n32ff0e5d87ec16544b6ff936d6fd58023925c3bdabaf962c492f6b078cb01914 SHA256\n\n**NOTE: These indicators shouldn’t be considered exhaustive for this observed activity.**\n\n## Detections\n\n### Microsoft 365 Defender\n\n**Microsoft Defender Antivirus**\n\n\nHive Rust\nvariant\npayload\n\nHive Rust\nvariant\npayload\n\n\nMicrosoft Defender Antivirus provides detection for this threat under the following family names with\nbuild version 1.367.405.0 or later.\n\nRansom:Win64/Hive\nRansom:Win32/Hive\n\n**Microsoft Defender for Endpoint detection**\n\nMicrosoft Defender for Endpoint customers may see any or a combination of the following alerts as\nan indication of possible attack. These alerts are not necessarily an indication of a Hive compromise,\nbut should be investigated:\n\nRansomware behavior detected in the file system\nFile backups were deleted\nPossible ransomware infection modifying multiple files\nPossible ransomware activity\nRansomware-linked emerging threat activity group detected\n\n## Advanced hunting queries\n\n### Microsoft Sentinel\n\nTo locate possible Hive ransomware activity mentioned in this blog post, Microsoft Sentinel\ncustomers can use the queries detailed below:\n\n**Identify Hive ransomware IOCs**\n\nThis query identifies a match across various data feeds for IOCs related to Hive ransomware.\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/MultipleDataSources/HiveRansomwareJuly2022.yaml\n\n**Identify backup deletion**\n\n\n-----\n\nThis hunting query helps detect a ransomware s attempt to delete backup files.\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Hunting%20Queries/MultipleDataSources/BackupDeletion.yaml\n\n**Identify Microsoft Defender Antivirus detection of Hive ransomware**\n\nThis query looks for Microsoft Defender Antivirus detections related to the Hive ransomware and\njoins the alert with other data sources to surface additional information such as device, IP, signed-in\nusers, etc.\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/SecurityAlert/HiveRansomwareAVHits.yaml\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-05 - Hive ransomware gets upgrades in Rust.pdf"
    ],
    "report_names": [
        "2022-07-05 - Hive ransomware gets upgrades in Rust.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535880,
    "ts_updated_at": 1743041508,
    "ts_creation_date": 1658168584,
    "ts_modification_date": 1658168584,
    "files": {
        "pdf": "https://archive.orkl.eu/5c9dd627464e34f78cd406e169ec95d77ff1fd58.pdf",
        "text": "https://archive.orkl.eu/5c9dd627464e34f78cd406e169ec95d77ff1fd58.txt",
        "img": "https://archive.orkl.eu/5c9dd627464e34f78cd406e169ec95d77ff1fd58.jpg"
    }
}