{
    "id": "103b2c1e-76f1-47b6-9c8c-2d68767543f0",
    "created_at": "2022-10-25T16:48:13.603781Z",
    "updated_at": "2025-03-27T02:05:41.399149Z",
    "deleted_at": null,
    "sha1_hash": "33b3a24e5f3bbb9d99289fa01f2cdab26d21b7a6",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-03-14T08:17:33Z",
    "file_modification_date": "2019-03-14T08:17:33Z",
    "file_size": 1413579,
    "plain_text": "**[flashpoint-intel.com/blog/dmsniff-pos-malware-actively-leveraged-target-medium-sized-businesses](https://www.flashpoint-intel.com/blog/dmsniff-pos-malware-actively-leveraged-target-medium-sized-businesses/)**\n\n_By Jason Reaves & Joshua Platt_\n\nPoint-of-sale malware previously only privately sold has been used in breaches of small- and mediumsized businesses in the restaurant and entertainment industries. The malware, known as DMSniff,\nalso uses a [domain generation algorithm (DGA) to create lists of command-and-control domains on](https://blog.malwarebytes.com/security-world/2016/12/explained-domain-generating-algorithm/)\nthe fly. This technique is valuable to an attacker because if domains are taken down by law\nenforcement, technology companies, or hosting providers, the malware can still communicate and\nreceive commands or share stolen data.\n\nResearchers at Flashpoint believe the use of a DGA is rarely seen in the realm of POS malware.\n\nPoint-of-sale malware continues to plague\n\nindustries such as food services and hospitality where older and unsupported\n\nsystems remain prevalent, especially in small- and medium-sized companies. In\n\nthese environments where card-present transactions are king, criminals have\n\nbeen relentless in targeting these vulnerable devices. Data from last year’s\n\nVerizon Data Breach Investigations Report indicates that point-of-sale\n\nterminals were the second most-attacked network asset behind database servers.\n\nMost often, the malware scrapes Track 1 and\n\nTrack 2 data from a credit card when it’s swiped through a terminal, before it\n\nis encrypted and sent to a payment processor. Attackers may either physically\n\ntamper with a POS device to install the malware, or can exploit a vulnerability\n\nover the network to infect a device.\n\nAs for DMSniff, it appears to have flown under\n\nthe radar for at least four years, and has been actively used since at least\n\n2016. Flashpoint analysts believe attackers using DMSniff could be gaining an\n\ninitial foothold on devices either by using brute-force attacks against SSH\n\nconnections, or by scanning for vulnerabilities and exploiting those.\n\nBelow, we share some technical details on the\n\nmalware and corresponding panel code. We also share some possible mitigations\n\nand links to indicators of compromise.\n\n# Diving Into DMSniff\n\nDMSniff uses multiple techniques in order to\n\nprotect itself and its command-and-control (C2) communications from researchers\n\nand law enforcement. The first technique is a simple string-encoding routine,\n\nbelow, designed to hide its strings. This shields the malware’s capabilities\n\nfrom detection, making it difficult for researchers to learn its capabilities.\n\n**_Image 1: The string encoding used by DMSniff._**\n\nA pseudocode Python-based implementation of\n\nthis can be found below:\n\n\n-----\n\n**_Image 2: The pseudocode Python-based implementation of the string encoding._**\n\nUsing this, Flashpoint decoded select strings,\n\nwhich can be downloaded below. Another technique used by this malware is a DGA\n\nthat allows it to resist takedowns and bypass trivial blocking mechanisms.\n\n**_Image 3: The malware’s initial DGA._**\n\nThe DGA is based on a number of hardcoded\n\nvalues; in the samples researchers have found, the\nfirst two characters of the generated\n\ndomains are hardcoded in the bot. Researchers have\nfound 11 variants of this\n\nDGA so far, all structured in the same algorithm, but\nwith variable first two\n\nletters and hardcoded multiply values in the\nalgorithm.\n\n**_Image 4: Pseudocode for the domain generation algorithm._**\n\n\n-----\n\nwhile rotating through a list of top level domains (TLDs)\n— e.g .in, .ru, .net,\n\n.org, .com—until it finds a server it can talk to. The data\nthat was harvested\n\nby the bot to create a hostid is then sent off inside the\nuser-agent.\n\n**_Image 5: Malware check-in example._**\n\nIt is worth noting the fake response, which\n\npretends to be an error. There is also some data in the response that is\n\ncommented out as “vqns”; this is verified by the bot to determine whether it is\n\na real C2 domain.\n\n**_Image 6: Malware code for parsing comment block._**\n\nFor the data theft portion of the POS, the bot\n\nis simplistic because it comes with an onboard list of process names to avoid;\n\nit will use this list while looping through the process tree. Each time it\n\nfinds an interesting process, it will loop through the memory sections to\n\nattempt to find a credit card number. Once a number is found, the bot will take\n\nthe card data and some of the surrounding memory, packages it, and sends it to\n\nthe C2.\n\n\n-----\n\n**_Image 7: Redacted DMSniff panel, bot overview._**\n\nAfter a report on the stolen data has been downloaded or reviewed, it is deleted from the panel,\nmeaning the stolen data is being exfiltrated somewhere else either to store or sell.\n\nBelow is the PHP code from the panel\n\nresponsible for deleting reports after being sent:\n\n//- del all sent\n\n$das = $_GET[‘das’];\n\nif (!empty($das))\n\n{\n\n$dh = opendir($dirn);\n\n\n-----\n\nif (!$dh) { echo cant open\n\ndir”; die(); }\n\nwhile (($file = readdir($dh)) !==\n\nfalse)\n\n{\n\nif ($file[0] != ‘d’) continue;\n\nif ($file[1] != ‘_’) continue;\n\nif (!strpos($file,”.SENTOK”))\n\ncontinue;\n\nif (defined(“MARKER”))\n\n{\n\n$exp=explode(‘_’,$file);\n\nif ($exp[1] != MARKER) continue;\n\n}\n\nunlink($file);\n\n}\n\n}\n\nFrom the panel, an entry of the XOR value\n\nneeded to unlock the report is added; the panel will then verify the data. As\n\nof this writing, all identified panels and bots use the same single byte XOR\n\nkey of ‘0xd’ or ‘13.’\n\n**_Image 8: Redacted DMSniff report data overview for retrieving stolen data in the panel._**\n\nStolen data files are based on the bot data\n\nand a marker value:\n\n$fil d t DMPPATH ’/d ’ $ k ’ ’ $ li ’ ’ kti ()\n\n\n-----\n\n_$mrk  = $_GET[‘m’];_\n\n_if (strlen($mrk) > 2) die(); // hack_\n\n_protection_\n\nThis is also where the .upl files are created to signify the bot has uploaded\n\ndata:\n\n$fnm = my_base64_encode($exp[1]);\n\n$f = fopen(INFOPATH.$fnm.’.upl’,”w”);\n\n$data = mktime().’|’.$exp[1].’|’.$realip.’|’;\n\nfputs($f,$data);\n\nfclose($f);\n\nIf all is successful for the uploader, an\n\n<!-OK-> is returned:\n\nif\n\n($filear[“error”][0] == 0) echo “<!-OK->”;\n\nPanel code to parse bot checkin:\n\n$ua = getenv(‘HTTP_USER_AGENT’);\n\n$pos = strpos($ua,’DSNF_’);\n\nThe returned data from this is a\n\nstring-encoded version of the PID (Process Identifier) with every digit having\n\n“a” added to it and hardcoded mul values similar to the DGA and stored in a\n\nfake 404 page in a comment.\n\n$tmp = substr($ua,$pos+5);\n\n$exp = explode(‘)’,$tmp);\n\n$pid = $exp[0];\n\necho\n\n“<!-“.chr(97+ToRange($pid)).chr(97+ToRange(3*$pid)).chr(97+ToRange(5*$pid)).chr(97+ToRange(7*$pid)).”>”;\n\nIf a shell command has been set via a .prt\n\nfile, then another comment will be added:\n\n// shl cmd\n\nif (file_exists(INFOPATH.$fnm.’.prt’) )\n\n{\n\n$shl =\n\nfile_get_contents(INFOPATH.$fnm.’.prt’);\n\n$exp = explode(‘|’,$shl);\n\n\n-----\n\n<! # .$exp[0]. > ;\n\n}\n\n}\n\nThis will have the ip:port for the bot to\n\nconnect to and download and execute files. The bot uses FTP to accomplish this\n\naction of downloading secondary files.\n\n# Conclusion\n\nDMSniff is another name in a growing list of\n\nevolving threats for the point-of-sale malware world. During our research we\n\nfound that this malware was primarily utilized to target small to medium sized\n\nbusinesses such as restaurants and theaters. It also contains a domain\n\ngeneration algorithm, something that is rare to see in point-of-sale malware\n\n# Mitigations\n\nFlashpoint recommends organizations regularly\n\nupdate all attack surface appliances. The suspected infection avenue is SSH\n\nbrute forcing (low confidence) and common exploit scanners (low confidence).\n\nHost-based detections for the following file could also be beneficial:\n\ndmsnf.cfg\n\nAlso monitoring for abnormal Windows processes\n\nexecution, such as the following:\n\nImage=”*csrss.exe” AND (ParentImage!=”*system” OR\n\nParentImage!=”*smss.exe”)\n\nImage=”*lsass.exe” AND ParentImage!=”*wininit.exe”\n\nAs with all host-based indicators, additional tuning may be needed depending on the environment.\n\n# Attachments & Downloads\n\n- To download the indicators of\n\ncompromise (IOCs) for DMSniff, [click here.](https://www.flashpoint-intel.com/wp-content/uploads/2019/03/DMSniff_iocs_March2019.txt)\n\n- To download the decoded strings\n\nfor DMSniff, [click here.](https://www.flashpoint-intel.com/wp-content/uploads/2019/03/DMSniff_decoded_strings_March2019.txt)\n\n## Jason Reaves\n\n\n-----\n\nJason Reaves is a Principal Threat Researcher at Flashpoint who specializes in malware reverseengineering. He has spent the majority of his career tracking threats in the Crimeware domain,\nincluding reverse-engineering data structures and algorithms found in malware in order to create\nautomated frameworks for harvesting configuration and botnet data. Previously, he worked as a\nsoftware developer and unix administrator in the financial industry and also spent six years in the U.S.\nArmy. Jason holds multiple certifications related to reverse-engineering and application exploitation\nand has published numerous papers on topics such as writing malware scripts pretending to be a bot,\nunpackers, configuration data harvesters and covert channel utilities. He enjoys long walks in IDA and\nstaring at RFCs for hours.\n\n## Joshua Platt\n\n_Principal Threat Researcher_\n\nJoshua Platt is a Principal Threat Researcher at Flashpoint who specializes in investigating complex\nfinancial crimeware families. As a former network security engineer, he first began reversing malware\nwhile working in the financial services industry nearly 10 years ago. Joshua graduated from the\nUniversity of North Texas with a B.S. in criminal justice and has earned multiple certifications within\nthe security industry related to reverse engineering and penetration testing.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.03.13.DMSniff_POS_Malware/DMSniff_POS_Malware.pdf"
    ],
    "report_names": [
        "DMSniff_POS_Malware"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1552551453,
    "ts_modification_date": 1552551453,
    "files": {
        "pdf": "https://archive.orkl.eu/33b3a24e5f3bbb9d99289fa01f2cdab26d21b7a6.pdf",
        "text": "https://archive.orkl.eu/33b3a24e5f3bbb9d99289fa01f2cdab26d21b7a6.txt",
        "img": "https://archive.orkl.eu/33b3a24e5f3bbb9d99289fa01f2cdab26d21b7a6.jpg"
    }
}