{
    "id": "10a61d1d-3fe5-4e86-b229-ac3912cee592",
    "created_at": "2023-01-12T15:03:13.373132Z",
    "updated_at": "2025-03-27T02:17:11.587427Z",
    "deleted_at": null,
    "sha1_hash": "c208b888ba98c14b654d8017989cd3936aaa7cd6",
    "title": "2020-10-26 - The Russian Hackers (BERSERK BEAR) Playing 'Chekhov's Gun' With US Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T02:06:24Z",
    "file_modification_date": "2022-05-28T02:06:24Z",
    "file_size": 2443488,
    "plain_text": "# The Russian Hackers Playing 'Chekhov's Gun' With US Infrastructure\n\n**[wired.com/story/berserk-bear-russia-infrastructure-hacking/](https://www.wired.com/story/berserk-bear-russia-infrastructure-hacking/)**\n\nAndy Greenberg October 26, 2020\n\nOver the last half a decade, Russian state-sponsored hackers have triggered blackouts in\nUkraine, [released history's most destructive computer worm, and](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/) stolen and leaked emails\nfrom Democratic targets in an effort to help elect Donald Trump. In that same stretch, one\nparticular group of Kremlin-controlled hackers has gained a reputation for a very different\nhabit: walking right up to the edge of cybersabotage—sometimes with hands-on-the-switches\naccess to US critical infrastructure—and stopping just short.\n\nLast week the Department of Homeland Security's Cybersecurity and Infrastructure Security\n[Agency published an advisory warning that a group known as Berserk Bear—or alternately](https://us-cert.cisa.gov/ncas/alerts/aa20-296a)\nEnergetic Bear, TEMP.Isotope, and Dragonfly—had carried out a broad hacking campaign\nagainst US state, local, territorial, and tribal government agencies, as well as aviation sector\ntargets. The hackers breached the networks of at least two of those victims. The news of\n[those intrusions, which was reported earlier last week by the news outlet Cyberscoop,](https://www.cyberscoop.com/russia-temp-isotope-election-security-mandiant/)\npresents the troubling but unconfirmed possibility that Russia may be laying the groundwork\nto disrupt the 2020 election with its access to election-adjacent local government IT systems.\n\n\n-----\n\nThey re getting us spun up. They re burning our cycles.\n\nAdam Meyers, CrowdStrike\n\nIn the context of Berserk Bear's long history of US intrusions, though, it's much harder to\ngauge the actual threat it poses. Since as early as 2012, cybersecurity researchers have\nbeen shocked to repeatedly find the group's fingerprints deep inside infrastructure around the\nglobe, from electric distribution utilities to nuclear power plants. Yet those researchers also\nsay they've never seen Berserk Bear use that access to cause disruption. The group is a bit\nlike Chekhov's gun, hanging on the wall without being fired through all of Act I—and\nforeshadowing an ominous endgame at a critical moment for US democracy.\n\n\"What makes them unique is the fact that they have been so focused on infrastructure\nthroughout their existence, whether it's mining, oil, and natural gas in different countries or\nthe grid,\" says Vikram Thakur, a researcher at security firm Symantec who has tracked the\ngroup over several distinct hacking campaigns since 2013. And yet Thakur notes that in all\nthat time, he's only seen the hackers carry out what appear to be reconnaissance operations.\nThey gain access and steal data, but despite ample opportunity never actually exploit\nsensitive systems to attempt to cause a blackout, plant data-destructive malware, or deploy\nany other sort of cyberattack payload.\n\nInstead, the intruders seem content simply demonstrating that they can gain that troubling\nlevel of reach into infrastructure targets again and again. \"I see them having operated for\nseven years and till today, I've come across no evidence of them having done something,\"\nThakur says. \"And that makes me lean toward the theory that they're sending a message: I\nam in your critical infrastructure space, and I can come back if I want to.\"\n\nA Long Hibernation\n\nIn the summer of 2012, Adam Meyers, the vice president of intelligence at security firm\nCrowdStrike, remembers first coming across the group's sophisticated backdoor malware,\nknown as Havex, in an energy sector target in the Caucasus region. (CrowdStrike initially\ncalled the hackers Energetic Bear due to the energy sector targeting, but later changed the\nname to Berserk Bear when the group switched up its tools and infrastructure.) \"It was the\ncoolest thing I'd ever seen at the time,\" Meyers says. Crowdstrike would soon find Havex in\nother energy-related networks around the world—years before other Russian hackers would\ncarry out the world's first blackout-inducing cyberattack in 2015 against Ukraine.\n\nIn June of 2014 [Symantec published a comprehensive report on the group, which it called](https://community.broadcom.com/symantecenterprise/communities/community-home/librarydocuments/viewdocument?DocumentKey=7382dce7-0260-4782-84cc-890971ed3f17)\nDragonfly. In dozens of intrusions against oil and gas and electric utilities in the US and\nEurope, the hackers had used \"watering hole\" attacks that compromised websites their\ntargets visited to plant Havex on their machines. They also hid their malware in infected\nversions of three different software tools commonly used by industrial and energy firms.\nSymantec's Thakur says in that first wave of attacks the company found that the hackers had\n\n\n-----\n\nstolen detailed industrial control system data from their victims. He never saw evidence,\nhowever, that the hackers went so far as to attempt to disrupt any target's operations—\nthough given the scale of the campaign, he admits he can't be sure.\n\n[In 2017, Symantec discovered the same hackers carrying out a more targeted set of attacks](https://www.wired.com/story/hackers-gain-switch-flipping-access-to-us-power-systems/)\nagainst US energy sector targets. At the time, the security researchers described it as a\n\"handful\" of victims, but Thakur now says they numbered in the dozens, ranging from coal\nmining operations to electric utilities. In some cases, Symantec found, the hackers had gone\nso far as to screenshot control panels of circuit breakers, a sign that their reconnaissance\nefforts had gone deep enough that they could have started \"flipping switches\" at will—likely\n[enough to cause some sort of disruption if not necessarily a sustained blackout. But again,](https://www.wired.com/story/hacking-a-power-grid-in-three-not-so-easy-steps/)\nthe hackers appear not to have taken full advantage. \"We did not see them turning off the\nlights anywhere,\" he says.\n\nSix months later, in February of 2018, the FBI and DHS would warn that the hacking\ncampaign—which they named Palmetto Fusion—had been carried out by Russian state[sponsored hackers, and also confirmed reports that the hackers' victims had included at](https://www.nytimes.com/2017/07/06/technology/nuclear-plant-hack-report.html?mcubz=0)\nleast one nuclear power generation facility. The hackers had gained access only to the\nutility's IT network, though, not its far more sensitive industrial control systems.\n\nGoing Berserk\n\nToday Berserk Bear is widely suspected of working in the service of Russia's FSB internal\nintelligence agency, the successor to the Soviet-era KGB. CrowdStrike's Meyers says the\ncompany's analysts have come to that conclusion with \"pretty decent confidence,\" due in part\nto evidence that aside from its foreign infrastructure hacking, Berserk Bear has also\nperiodically targeted domestic Russian entities and individuals, including political dissidents\nand potential subjects of law enforcement and counterterrorism investigation, all in line with\nthe FSB's mission.\n\nThat's a contrast with other widely reported state-sponsored Russian hacking groups Fancy\nBear and Sandworm, who have been identified as members of Russia's GRU military\nintelligence agency. Fancy Bear hackers were [indicted in 2018 for breaching the Democratic](https://www.wired.com/story/mueller-indictment-dnc-hack-russia-fancy-bear/)\nNational Committee and the Clinton campaign in a hack-and-leak operation designed to\ninterfere with the 2016 US presidential election. Six alleged members of Sandworm were\nindicted by the US Department of Justice last week in connection with cyberattacks that have\ncaused two blackouts in Ukraine, the NotPetya malware outbreak that inflicted $10 billion in\ndamage globally, and the attempted sabotage of the 2018 Winter Olympics.\n\nBerserk Bear appears to be the FSB's more restrained version of the GRU's Sandworm\ncyberwar unit, says John Hultquist, director of intelligence at FireEye. \"This is an actor whose\nmission appears to be to hold critical infrastructure under threat,\" Hultquist says. \"The\ndifference is we've never seen them actually pull the trigger.\"\n\n\n-----\n\nJust why Berserk Bear would toe the line of critical infrastructure disruption without crossing\nit over so many years remains a subject of debate. Hultquist argues that the group may be\npreparing for a potential future geopolitical conflict, one that warrants an act of cyberwar\nsuch as attacking an enemy's power grid—what cybersecurity analysts have long described\nas \"preparing the battlefield.\"\n\nThe latest round of Berserk Bear breaches could be that sort of preparation, Hultquist warns,\nfor coming attacks on state, municipal, and other local governments responsible for\nadministering the current election. According to cybersecurity firm Symantec, three of\nBerserk Bear's attempted operations also targeted airports on the West coast of the United\nStates, including San Francisco International Airport. Symantec's Thakur imagines a future\nwhere Berserk Bear is mobilized to cause disruptive—if not necessarily disastrous—effects,\nlike \"lights out in a small part of the country, or a certain airline has trouble refueling their\nplanes.\"\n\nBut CrowdStrike's Meyers, who has tracked Berserk Bear for eight years, says he's come to\nbelieve that the group may be playing a more subtle game, one that has more indirect but\nimmediate, psychological effects. Every one of its breaches, no matter how seemingly minor,\ntriggers a disproportionate technical, political, and even emotional response. \"If you can\nmake US-CERT or CISA deploy a team every time they find a Berserk Bear target, if you can\nmake them publish stuff for the American public and get their partners from the intelligence\ncommunity and law enforcement involved, you're basically doing a resource attack against\nthe machine,\" Meyers says, drawing an analogy with a hacker technique that overwhelms a\ntarget computer's resources with requests. Meyers points out that last week's CISA advisory\ndescribes widespread scanning for potential victims, not the quieter, more targeted tactics of\na group making stealth its highest priority. \"The more they can run these theatrics, the more\nthey can make us go freaking nuts... They're getting us spun up. They're burning our cycles.\"\n\nIf triggering that overreaction is indeed Berserk Bear's endgame, it may have already\nsucceeded, given CISA's advisory about its latest round of intrusions and widespread media\ncoverage of those breaches—including in this article. But Myers concedes that the\nalternative, ignoring or downplaying Russian state-sponsored breaches into US critical\ninfrastructure and election-related systems, hardly seems wise either. If indeed Berserk Bear\nis Chekhov’s gun hanging on the wall, it has to go off before the play is over. But even if it\nnever does, it can be hard to take your eyes off of it—drawing your attention away from the\nrest of the plot.\n\nMore Great WIRED Stories\n\n[📩 Want the latest on tech, science, and more? Sign up for our newsletters!](https://www.wired.com/newsletter?sourceCode=BottomStories)\n[High science: This is my brain on salvia](https://www.wired.com/story/this-is-my-brain-on-salvia/?itm_campaign=BottomRelatedStories_Sections_5&itm_content=footer-recirc)\n[The pandemic closed borders—and stirred a longing for home](https://www.wired.com/story/the-pandemic-closed-borders-and-stirred-a-longing-for-home/?itm_campaign=BottomRelatedStories_Sections_5&itm_content=footer-recirc)\n[The cheating scandal that ripped the poker world apart](https://www.wired.com/story/stones-poker-cheating-scandal/?itm_campaign=BottomRelatedStories_Sections_5&itm_content=footer-recirc)\n\n\n-----\n\nHow to trick out your [iPhone home screen in iOS 14](https://www.wired.com/story/customize-iphone-home-screen-widgets-aesthetic-ios14/?itm_campaign=BottomRelatedStories_Sections_5&itm_content=footer-recirc)\n[The women who invented video game music](https://www.wired.com/story/the-women-who-invented-video-game-music/?itm_campaign=BottomRelatedStories_Sections_5&itm_content=footer-recirc)\n🎮 WIRED Games: Get the latest [tips, reviews, and more](https://www.wired.com/tag/video-games/?itm_campaign=BottomRelatedStories_Sections_5&itm_content=footer-recirc)\n[🎧 Things not sounding right? Check out our favorite wireless headphones,](https://www.wired.com/gallery/best-wireless-headphones/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc) [soundbars,](https://www.wired.com/gallery/best-soundbars/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n[and Bluetooth speakers](https://www.wired.com/gallery/best-bluetooth-speakers/?itm_campaign=BottomRelatedStories&itm_content=footer-recirc)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-26 - The Russian Hackers (BERSERK BEAR) Playing 'Chekhov's Gun' With US Infrastructure.pdf"
    ],
    "report_names": [
        "2020-10-26 - The Russian Hackers (BERSERK BEAR) Playing 'Chekhov's Gun' With US Infrastructure.pdf"
    ],
    "threat_actors": [
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a792743d-78a4-40c9-9d9a-a12c52880297",
            "created_at": "2023-01-06T13:46:38.75457Z",
            "updated_at": "2025-03-27T02:00:02.909884Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "Palmetto Fusion",
                "Allanite"
            ],
            "source_name": "MISPGALAXY:ALLANITE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "0a0132a3-526d-4698-be49-5e75530c1417",
            "created_at": "2022-10-25T15:50:23.856139Z",
            "updated_at": "2025-03-27T02:00:55.559398Z",
            "deleted_at": null,
            "main_name": "ALLANITE",
            "aliases": [
                "ALLANITE",
                "Palmetto Fusion"
            ],
            "source_name": "MITRE:ALLANITE",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1c4281e9-0a4c-4f20-94a2-25ed3661cc98",
            "created_at": "2022-10-25T16:07:23.301826Z",
            "updated_at": "2025-03-27T02:02:09.72625Z",
            "deleted_at": null,
            "main_name": "Allanite",
            "aliases": [
                "Palmetto Fusion"
            ],
            "source_name": "ETDA:Allanite",
            "tools": [
                "PsExec",
                "SecreetsDump",
                "THC Hydra"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535793,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653703584,
    "ts_modification_date": 1653703584,
    "files": {
        "pdf": "https://archive.orkl.eu/c208b888ba98c14b654d8017989cd3936aaa7cd6.pdf",
        "text": "https://archive.orkl.eu/c208b888ba98c14b654d8017989cd3936aaa7cd6.txt",
        "img": "https://archive.orkl.eu/c208b888ba98c14b654d8017989cd3936aaa7cd6.jpg"
    }
}