{
    "id": "10e0ccc3-1dc1-47b2-802a-4ba8d843f6f1",
    "created_at": "2023-05-06T02:08:21.214117Z",
    "updated_at": "2025-03-27T02:08:40.255725Z",
    "deleted_at": null,
    "sha1_hash": "cb61858e3047ca8e06756a5491d3a4077180b2b7",
    "title": "2022-12-13 - Threat Actors use Google Ads to Deploy VIDAR Stealer",
    "authors": "",
    "file_creation_date": "2023-05-05T02:06:14Z",
    "file_modification_date": "2023-05-05T02:06:14Z",
    "file_size": 1379245,
    "plain_text": "# Threat Actors use Google Ads to Deploy VIDAR Stealer\n\n**[kroll.com/en/insights/publications/cyber/threat-actors-google-ads-deploy-vidar-stealer](https://www.kroll.com/en/insights/publications/cyber/threat-actors-google-ads-deploy-vidar-stealer)**\n\nKroll has observed threat actors abusing Google Ads to deploy malware masquerading as\nlegitimate downloads or software that has been “cracked” or modified to remove or disable\nfeatures such as copy protection or adware. As part of our analysis of this trend and threat,\n[we have identified specifically that VIDAR malware, an information-stealing trojan, is using](https://www.kroll.com/en/insights/publications/cyber/malware-analysis-vidar-version)\nGoogle Ads to advertise spoofed domains and redirect users to fraudulent sites or malware\ndownloads. Kroll is currently tracking the use of this tactic by ransomware groups globally,\nparticularly groups that are assessed with medium confidence to be associated with former\nConti ransomware affiliates such as Royal, Black Basta, and Hive ransomware operators.\nWhile the infection vector is the same, Zloader is typically used to deploy further malicious\n[tooling to gain a foothold within the network during the Intrusion Lifecycle.](https://www.kroll.com/en/insights/publications/cyber/kroll-intrusion-lifecycle)\n\n\n-----\n\nAs an example of Kroll s findings and analysis into this trend, we discovered a particular\nGoogle Ad that, while displaying the legitimate domain of the opensource image editing\nproduct GIMP, ultimately redirected the user to a typo-squatted domain, hosting a cloned\nwebsite containing malicious downloads. This is particularly interesting as the format of the\nadvert is controlled through Google’s Ad framework. The display domain highlighted below is\nextracted by Google from the target URL provided by the advertiser.\n\nFigure 1: Screenshot of Malicious Ad (Source: Kroll)\n\nFigure 2: Screenshot of the Typo-Squatted Domain (Source: Kroll)\n\nThe malicious domain gilimp[.]org appears to have been registered on October 17, 2022,\nindicating that this advert could have been live for up to 16 days at the time of our analysis.\n\n\n-----\n\nFigure 3: Whois Record for Typo-Squatted Domain (Source: Kroll)\n\nAt the time of the investigation, it was no longer possible to access the advertisement\n(“advert”), and the screenshots available online no longer showed the destination URL of the\nadvert when hovered over to see the first step in the request chain, making it more difficult\nfor Kroll to definitively determine exactly how the threat actor achieved this.\n\nKroll analyzed a binary on the malicious domain that was presented to appear as the GIMP\nsoftware. The analysis showed that it was in fact VIDAR malware. Our experts were able to\ndetermine that the malware was stealing browser cookies and passwords, along with\ndetailed system information, before sending these to a C2 IP address.\n\nThe IP information for this IP address shows its geolocation as St. Petersburg in the Russian\nFederation.\n\n\n-----\n\nFigure 4: C2 IP Address Information (Source: Kroll)\n\n## Most Likely Methodologies\n\nThe Kroll Cyber Threat Intelligence team tested a number of theories leveraging the Google\nAd workflow for how “malvertising” could lead to the deployment of the VIDAR Stealer. Kroll\nproposed with high confidence the below two most likely scenarios based on completed\nresearch to date:\n\n1. A homoglyph attack utilizing international domain name scheme\n2. Via manipulation of the tracking template URL option\n\n### Homoglyph Attack\n\n\n-----\n\nThis attack method is documented by others within the Security and Incident Response\ncommunities and seems to be a favorite hypothesis shared by many to include Kroll’s\nresearchers.\n\nFigure 5: Screenshot Showing the Setting Up of Homoglyph Attack in Google Ads (Source:\nKroll)\n\nAs detailed in Figure 5, Kroll’s threat intelligence team would be able to set up an advert\nutilizing an international domain name that would pass most viewer’s initial inspection of the\ndomain. If a homoglyph attack was used, it is an exceptionally effective approach with no\nobviously out-of-place characters.\n\nFigure 6: Zoomed In View of Ad (Source: Kroll)\n\nKroll observed that the ultimate page reached by clicking on the link was not an international\ndomain, but a second, different typo-squatting domain. This inconsistency makes this\nmethod appear less probable since the threat actor would need to link to 2 domains via a\nredirect chain.\n\nHowever, there is a possibility that the threat actor did this to protect their homoglyph domain\nor they were aware that some web browsers will show the ascii format domain name in the\naddress bar (for example: xn--gmp2ub[.]org instead of gïmp[.]org), making the website\n\n\n-----\n\nappear more suspicious. Kroll s testing of this process also identified Google s automated\ndomain checking processes which would normally frustrate a threat actor's usage of this\nmethodology.\n\n### Tracking Template URL\n\nGoogle Ads allow for the use of a tracking link that would be the first link connected too, in\norder to store various parameters for your advertising campaign before forwarding on to the\ntarget page. With this tracking link set, the display domain remains the domain of the target\nURL.\n\nFigure 7: Screenshot Showing the Setting Up of a Cross domain Tracking Template in\nGoogle Ads (Source: Kroll)\n\nIt is possible that, by using a malicious tracking link, a threat actor could set up an advert for\nthe legitimate gimp.org and redirect to their malicious page instead of the real page. This is\ncurrently the method Kroll assesses has been leveraged by Threat Actors in prior Intrusion\nLifecycles.\n\nKroll tested this methodology using a malicious tracking template hosted on a separate\ndomain and successfully redirected an advert click to a third domain - the video of which can\n[be viewed here. The setup used the process described in the official Google documentation](https://vimeo.com/767273760/317429a75b)\nfor cross-domain redirects.\n\n\n-----\n\nFigure 8: Screenshot of Active Advert Setup using Cross domain Tracking Template (Source:\nKroll)\n\nBy utilizing a custom PHP script on the tracking domain, we were then able to redirect traffic\nto a proof-of-concept domain instead of the legitimate website. There is some automated\nchecking performed by Google to detect incorrect redirecting; however, this was\ncircumvented with minimal effort. It is likely this automated checking is designed to detect\nmistakes rather than this specific methodology.\n\n## Additional Methodologies\n\nOur team also explored a series of less likely scenarios:\n\n1. A configuration setting within the Google Ads system allowing the ability to specify a\n\ndifferent target domain to display domain either legitimately allowed or via a bug\n2. Use of an open redirect on the gimp.org site\n3. A bug in URL validation processes allowing for manipulation of display\n\n### Configuration Setting\n\nTo date, our team have been unable to produce a combination of settings in the Google Ads\ninterface that would allow a different display domain from the target domain.\n\n### Use of Open Redirect\n\nThe Google Ads system extracts the domain it displays in the advert from the Final URL\nfield. If an open redirect were present on the gimp.org website and being used as the Final\nURL, “gimp.org” would be displayed. It is not possible to test whether Google Ads would\ndetect this without an open redirect vulnerability being present to use in the test.\n\n\n-----\n\nFigure 9: Screenshot Showing Hypothetical Setup of Attack Using an Open Redirect\n(Source: Kroll)\n\nFor this to work, there would have to be an open redirect vulnerability on the gimp.org\nwebsite; additionally, the aforementioned redirection validation checks performed by google\nwould need bypassing.\n\n### Validation Bug\n\nIt is conceivable that a bug in the validation of inputs might have allowed the manipulation of\nthe advert and target domain. Our team tried a numerous strategies to see what resulted as\ncontrolled tests. All tests were caught by server-side validation. However, they were\nsuccessful in changing the display of the preview advert to not reflect the target domain.\n\n\n-----\n\nFigure 10: Screenshot Showing an Attempt to Manipulate the URL to Display Incorrectly\n(Source: Kroll)\n\n### Google Review\n\nAs mentioned earlier, Google has a review process for adverts. Changes to the advert,\nincluding changing domain or tracking link will take the advert offline and require further\nreview.\n\n### Impact\n\nNow that this attack has been documented on various websites, it is very likely that other\nactors will attempt this technique because it can effectively turn any website into a watering\nhole attack, conveniently placing their malicious website at the top of the Google Search\nresults.\n\nWhile it is particularly dangerous for sites that provide software for download, it could easily\nbe expanded for other purposes. For example, a clone of a login page of a legitimate domain\ncould be hosted for credential harvesting.\n\n### Kroll Recommendations\n\nInform and educate personnel of this current attack methodology, making them aware\nof the dangers of downloading executables from websites that have not been verified\nas legitimate, particularly in relation to executables found after clicking through any\nform of online advertising.\nWhere possible, restrict staff from downloading executables, a feature of many web\nfiltering capable proxy servers.\n\n\n-----\n\nRequire all installs to be performed by information technology staff from vetted binary\nrepositories.\n[Employ endpoint detection and response (EDR) and next-generation anti-virus (NGAV)](https://www.kroll.com/en/services/cyber-risk/managed-security/kroll-responder/mdr-microsoft)\ntools across all endpoints within the environment.\n\n[Learn more about Kroll’s end-to-end cyber security services or call our Cyber Incident](https://www.kroll.com/en/services/cyber-risk)\nResponse Hotline to request immediate assistance.\n\n## Stay Ahead with Kroll\n\n### Cyber Risk\n\nIncident response, digital forensics, breach notification, managed detection services,\npenetration testing, cyber assessments and advisory.\n\n### 24x7 Incident Response\n\nEnlist experienced responders to handle the entire security incident lifecycle.\n\n### Computer Forensics\n\nKroll's computer forensics experts ensure that no digital evidence is overlooked and assist at\nany stage of an investigation or litigation, regardless of the number or location of data\nsources.\n\n### Cyber Risk Retainer\n\nKroll delivers more than a typical incident response retainer—secure a true cyber risk\nretainer with elite digital forensics and incident response capabilities and maximum flexibility\nfor proactive and notification services.\n\n### Ransomware Preparedness Assessment\n\nKroll’s ransomware preparedness assessment helps your organization avoid ransomware\nattacks by examining 14 crucial security areas and attack vectors.\n\n### Malware Analysis and Reverse Engineering\n\nKroll’s Malware Analysis and Reverse Engineering team draws from decades of private and\npublic-sector experience, across all industries, to deliver actionable findings through in-depth\ntechnical analysis of benign and malicious code.\n\n### Cloud Security Services\n\n\n-----\n\nKroll s multi-layered approach to cloud security consulting services merges our industryleading team of AWS and Azure-certified architects, cloud security experts and unrivaled\nincident expertise.\n\n### Assessments and Testing\n\nKroll’s field-proven cyber security assessment and testing solutions help identify, evaluate\nand prioritize risks to people, data, operations and technologies worldwide.\n\nReturn to top\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-13 - Threat Actors use Google Ads to Deploy VIDAR Stealer.pdf"
    ],
    "report_names": [
        "2022-12-13 - Threat Actors use Google Ads to Deploy VIDAR Stealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683338901,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1683252374,
    "ts_modification_date": 1683252374,
    "files": {
        "pdf": "https://archive.orkl.eu/cb61858e3047ca8e06756a5491d3a4077180b2b7.pdf",
        "text": "https://archive.orkl.eu/cb61858e3047ca8e06756a5491d3a4077180b2b7.txt",
        "img": "https://archive.orkl.eu/cb61858e3047ca8e06756a5491d3a4077180b2b7.jpg"
    }
}