{
    "id": "11100575-7a35-4a65-aab9-fd077dbf1b6f",
    "created_at": "2022-10-25T16:48:22.986148Z",
    "updated_at": "2025-03-27T02:13:47.933782Z",
    "deleted_at": null,
    "sha1_hash": "738aef489fec1012a57b05e862a7721ff9832fbf",
    "title": "2021-11-18 - Conti Ransomware Group In-Depth Analysis",
    "authors": "",
    "file_creation_date": "2021-11-18T14:05:29Z",
    "file_modification_date": "2021-11-18T14:05:29Z",
    "file_size": 4024138,
    "plain_text": "# Conti Ransomware Group In-Depth Analysis\n\n\n-----\n\n### Contents\n\n**References** **2**\n\n**1** **Introduction** **4**\n\n**2** **Executive Summary** **6**\n2.1 Overview . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n2.2 Conti Ransomware . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n2.3 The RaaS Business Model . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n\n**3** **Technical Analysis** **8**\n3.1 Conti’s History . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 8\n3.1.1 The Ryuk and Conti Connection . . . . . . . . . . . . . . . . . . . . . . . . . 10\n3.1.2 Affiliate Leaks . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n3.2 The Conti Attack Kill Chain . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n3.2.1 Target Selection . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n3.2.2 Deployment and Execution . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n3.2.3 Demand and Negotiation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 16\n3.3 Management Panel . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20\n3.4 De-Anonymization . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 23\n\n**4** **Statistics and Observations** **28**\n4.1 Known Recruiter Profiles . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 28\n\n**5** **Money Flow** **30**\n5.1 Analysis of Conti ransom payments . . . . . . . . . . . . . . . . . . . . . . . . . . . . 30\n5.1.1 Identification of consolidation cluster . . . . . . . . . . . . . . . . . . . . . . 30\n5.1.2 Destination of funds : Conti operator . . . . . . . . . . . . . . . . . . . . . . 33\n5.1.3 Destination of funds : Conti affiliates . . . . . . . . . . . . . . . . . . . . . . 33\n5.1.4 Identification opportunities . . . . . . . . . . . . . . . . . . . . . . . . . . . . 33\n\n**6** **Conclusion** **34**\n\n2 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nany legally applicable warranty regarding completeness or accuracy of the contents Therefore neither this report nor any of\n\n\n-----\n\n|Reference Number|CH-2021100801|\n|---|---|\n|Prepared By|PTI Team|\n|Investigation Date|25.09.2021 - 16.10.2021|\n|Initial Report Date|16.10.2021|\n|Last Update|18.11.2021|\n\n\n**What’s new?**\n\nPRODAFT Threat Intelligence (PTI) Team has obtained valuable insights on the\ninner workings of the Conti ransomware group. The PTI team accessed Conti’s\ninfrastructure and identified the real IP addresses of the servers in question. This report\nprovides unprecedented detail into the way the Conti ransomware gang works, how\nthey select their targets, how many targets they’ve breached, and more.\n\n**Why does it matter?**\n\nRansomware attacks are increasing in severity and frequency, threatening major\ninstitutions and placing enormous strain on supply chains that are already stretched\nthin. Conti has shown itself to be a particularly ruthless group, indiscriminately\ntargeting hospitals, emergency service providers, and police dispatchers. This report\ncontains the latest and most accurate data available on one of the most dangerous\nransomware groups in existence.\n\nConti also earned a reputation for not delivering decryption keys even after\nvictims pay. However, simply telling companies not to pay isn’t enough to solve\nthe problem. Our mission is to equip executives, legal advisors, insurers and law\nenforcement agents with intelligence and unique insights that help them understand\nthe threat, manage the risk more effectively, and find better practical solutions to\ndeal with its consequences.\n\n\n3 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n### 1 Introduction\n\nRansomware attacks work by encrypting the victim’s business-critical data, rendering it\ninaccessible. After triggering the attack, cybercriminals will offer to sell a decryption key to\nthe victim. If the victim doesn’t comply, they simply have to accept the catastrophic loss of\ntheir most valuable data.\n\nSome ransomware attacks use a two-pronged strategy. Attackers will demand a ransom\npayment for decrypting data, and threaten to publicly publish sensitive data if the ransom\nis not paid by a certain deadline. (”Double Extortion”).\n\nRansomware has been in use for decades, but it has surged in popularity among\ncybercriminals in recent years. Multiple factors contribute to this rise, including the\ndevelopment of cryptocurrency that enables near-anonymous payments, the widespread\ndigitalization of sensitive data, and the release of sophisticated ransomware-as-a-service\ncriminal business models. Ransomware losses are likely to exceed $20 billion by the end of\n2021 [4].\n\nRansomware can be separated into two basic groups :\n\n## • [Fully Automated Ransomware (FAR), and]\n • [Semi-Automated Ransomware (SAR)]\n\nIn FAR cases, ransomware generally infects the system via phishing emails or malicious\nweb pages that contain the malicious payload. The malware contains the code to spread\nthroughout the network, identify sensitive files, encrypt them, and display a ransom note for\nthe victim. Threat actors who use FAR mostly focus on lightweight distribution channels that\nare easily automated – they tend to stay away from making direct contact with victims. FAR\nattacks do not typically succeed against enterprise-level organizations with a wide range\nof detection and prevention tools. Victims of FAR attacks tend to be more cautious about\npaying the ransom because the automated system doesn’t instill a great degree of trust. In\nmany cases, victims will ask to be transferred to a human representative, who will negotiate\non behalf of the cybercrime organization.\n\nSAR attacks can be more sophisticated since they rely on manual interaction between\ncybercriminals and their victims. In these cases, attackers may use zero-day exploits, or they\nmay rely on known vulnerabilities that haven’t yet been patched – even within hours of the\npatch release. Our team has observed SAR attackers buying RDP or VPN credentials directly\nfrom other hackers on underground markets. Upon successful entry, these attackers use\ncommon penetration testing tools for lateral movement within the victim’s network. They\nthen escalate their privileges, start encrypting, and trigger the ransomware attack.\n\nModern cybercrime organizations use a hierarchical workflow to monetize operations.\nThe ”X-as-a-Service” model has become popular among criminals since each step of an\nadvanced attack kill chain requires different skills. This report will demonstrate how this\nbusiness model works and provide in-depth insight about the illicit economy it perpetuates.\nThese findings will help other researchers understand the working dynamics of other groups\nthat operate in the ransomware industry.\n\n4 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nThe group this report focuses on is called ”Conti”, which appears to be identical with the\ngroup known as ”Wizard Spider”. It is a criminal organization behind advanced ransomware\ntechnologies known as Ryuk and Hermes. We won’t focus on sample analysis, as many\nreputable sources already offer this kind of technical information. Instead, this report is the\nfirst to presents findings regarding behind-the-scenes information on how the ransomware\ngroup operates.\n\nEnterprise leaders, cybersecurity executives, and risk advisors can use this report’s findings to\nbetter prepare their organizations against ransomware attacks. Proactive threat intelligence\nis key to identifying the factors that contribute to cybercrime trends and preventing threat\nactors from exploiting enterprise vulnerabilities.\n\n\nPlease note that this report has two versions. The ”Private Release” is provided to law\nenforcement agencies, applicable CERTS / CSIRTS, and members of our U.S.T.A. Threat\nIntel Platform (with appropriate annotations and reductions). Likewise, the ”Public\n_Release” is publicly disseminated for the purpose of advancing global fight against_\nhigh-end threat actors and APTs.\n\n\n5 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n### 2 Executive Summary\n\n#### 2.1 Overview\n\nConti ransomware frequently makes headlines due to the high-profile organizations it\noften targets, as well as the high ransoms its negotiators demand. The PTI Team noticed a\nsurge in Conti attacks and started analyzing the group in September 2021. Our team detected\na vulnerability in the recovery servers that Conti uses, and leveraged that vulnerability to\ndiscover the real IP addresses of the hidden service hosting the group’s recovery website.\nThis report presents valuable data about the inner workings of the semi-automatic recovery\nservice that Conti relies on to execute ransomware attacks. Threat intelligence data like this\nhelps enterprise executives build resilient cybersecurity defenses and protect sensitive data\nfrom exfiltration.\n\n#### 2.2 Conti Ransomware\n\nConti ransomware (a.k.a. Hermes, Ryuk[1], Wizard Spider[9]) is a malicious program that\nprevents users from accessing their data unless the victims pay a ransom. Conti automatically\nscans networks for valuable targets, spreads through the network, and encrypts every\ndevice and account it can find.\n\nUnlike similar ransomware variants, Conti uses a ransomware-as-a-service (RaaS) business\nmodel. The ransomware developers sell or lease their ransomware technology to affiliates,\nwho then use that technology to carry out attacks. This business model often includes a\ndigital management panel. Conti customers – affiliate threat actors – use this management\npanel to create new ransomware samples, manage their victims, and collect data on their\nattacks. Our investigation showed that Conti threat actors also use extortion and victim\nshaming to coerce victims into paying ransoms.\n\n**Analyst Note :** Victim shaming is the use of tactical use of social pressure to push\nvictim organizations into fulfilling ransom demands. They may threaten to release stolen\nconfidential data, or to email business partners and draw attention to the ransomware\nattack.\n\n6 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 1. Conti threat actors using extortion**\n\n#### 2.3 The RaaS Business Model\n\nRaaS owners employ multiple affiliates who are responsible for breaking into victims’\nnetworks and encrypting their files. These affiliates are selected mostly from forums, among\nhighly-skilled hackers with backgrounds in penetration testing. People may also become\naffiliates if they have an established network for obtaining access to information from other\ncybercriminals. In both cases, RaaS owners require references from recognized cybercriminals\nbefore hiring affiliates.\n\nThe RaaS business model makes cybercriminal reputation essential to success. Most\naffiliates send a commission between 10-30% of each ransom payment they receive to\nthe RaaS owners. The amount for the operators can also be automatically deducted from\nthe collected ransom in certain cases. RaaS owners also often provide virtual machines,\nexploitation tools, and other technologies to support affiliates’ attacks. Every affiliate has an\naccess to a management panel where they can monitor and communicate with victims. An\naffiliate panel usually includes the following tools :\n\n## • [A ransomware executable generator]\n\n7 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n## • [A separate ransomware decryption application]\n • [A cryptocurrency payment gateway for victims]\n • [A commission rate calculator]\n • [Monitoring tools for victims and statistics]\n • [Secure chat functionality for victim negotiation]\n\nThese tools are designed with non-technical users in mind. Cybercriminals no longer need a\ngreat deal of technical expertise to run successful attack campaigns. Instead, they maximize\nprofit using psychological tactics like extortion and victim shaming. Moreover, affiliates are\nexpected to constantly attack and breach new targets. Whenever an affiliate becomes\ninactive for a long period of time, RaaS owners remove that affiliate’s account, which has a\nnegative impact on the affiliate’s reputation.\n\n### 3 Technical Analysis\n\nOur team obtained insider data on the Conti RaaS group and its platform, including\ninformation on its management panel and a step-by-step analysis of the Conti attack kill\nchain. This section contains intelligence about the threat responsible and their affiliates.\nIt includes new, never-before-seen data on Conti’s active management server and the\ngroup’s techniques, tactics and procedures (TTP).\n\nThis is valuable information that enterprises and cybersecurity vendors can use to detect\nand mitigate Conti ransomware attacks. Organizations equipped with sophisticated threat\nintelligence capabilities can prepare for these attacks and proactively prevent devastating\ndata breaches and ransomware attacks from occurring.\n\n#### 3.1 Conti’s History\n\nThe first indications of a unique Conti ransomware group appeared in October\n**2019. The group did not establish its own website until early 2020 on the address**\n**http://fylszpcqfel7joif.onion. Since then, we’ve observed data belonging to 567 different**\ncompanies have been shared on the Conti extortion site https://continews.click and\n**http://continewsnv5otx5kaoje7krkto2qbu3gtqef22mnr7eaxw3y6ncz3ad.onion. This number**\nonly represents victims whose names are shared on the extortion site or whose data is\nshared and subsequently deleted. In addition, Conti uses another TOR hidden service for\nserving the stolen victim data. As can be seen in the figure 2 data download links points to\nthe domain nilbxxtm5mava3k2r5vzkuuu2g4bp5wlupo3nzry3c6q5rm5sti5ktqd.onion with a\nrandom path.\n\n8 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 2. Conti’s victim data download server**\n\nBased on unofficial statistics, it appears that the number of companies affected by the\nConti ransomware group is much higher than what we can see on just these websites.\nExpanding its scope of influence day by day, the Conti ransomware currently uses the RaaS\naffiliation model, enabling different threat actors to operate independently of one another.\nThe Conti team is currently deploying a ransomware variant known as Conti v3.0 to victim\nsystems, and development continues.\n\n9 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 3. Conti’s extortion blog**\n\n**3.1.1** **The Ryuk and Conti Connection**\n\nBased on an analysis made on ransomware samples and a comparison of bitcoin wallets\nused for receiving ransom payments, there is an undeniable connection between Conti\nand Ryuk ransomware teams. They may be the same team, or different teams that share\nmembers and resources with one another. The first examples of Ryuk were published on the\n**https://exploit.in/, a well known underground cybercrime forum, under the name Hermes**\nransomware by a russian-speaking threat actor named CryptoTech in February 2017.\n\n10 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 4. CryptoTech’s Hermes Share**\n\nDevelopment of Hermes continued until version 2.1, which is released in August 2018. The\nthreat actor replaced the name Hermes with ”Ryuk” and begin advertising it for $300. Based\non e-mail address data and similarities between forum submissions, it’s overwhelmingly likely\nthat the threat actor CryptoTech developed Ryuk.\n\nThe Conti Ransomware can be understood as a continuation of Ryuk. The two ransomware\ntools share similarities in their libraries and the way they spread. They even share near\nperfect copy-pasted fragments of code. Both Conti and Ryuk rely on the same ransomware\npayload distributors : Trickbot, Emotet and BazarLoader. These are the software packages\nthat do the work of actually delivering malicious ransomware files onto victim’s networks.\n\nAt the beginning of 2021, ClearSkysec [3] analyzed bitcoin ransom transactions of Conti\nransomware victims and revealed that they included a wallet address previously used by\nthe Ryuk ransomware gang. This confirms the connection between Ryuk and Conti, which is\nnow accepted as fact by the global threat intelligence community.\n\n11 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**3.1.2** **Affiliate Leaks**\n\nThe Conti group is currently working with an RaaS affiliate model and continues to recruit\nnew members to the team. However, on 05.08.2021 the Conti team suffered a data leak\nwhich exposed internal documents, guides, training materials, and much more. This situation\nis common inside the cybercriminal industry, especially among organizations that use the\naffiliate business model. A user named m1Geelka shared information about the groups\nleader and his assistant in a thread on the on the xss.is cybercrime forum, claiming that the\ngroup treated him unfairly in regards to money.\n\n**Figure 5. Affiliate Leak Post**\n\nAfterwards, m1Geelka uploaded a large cache of Conti group-related data, including\ntraining materials used by the affiliates, and shared the link to the group’s SendSpace\nfile-sharing site in the same post. This data contains a high volume of tactical information\nabout Conti, and valuable intelligence about the operations of the threat actors responsible,\nsuch as images of the CobaltStrike servers that the Conti group actively uses.\n\n12 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 6. Cobaltstrike Servers Leak**\n\n**Figure 7. Conti Educational Materials for Affiliates**\n\nThis list of topics was included inside the leaked training materials :\n\n## • [How to build a Cobalt Strike executable]\n • [An introduction to avoiding security products using compiler-based obfuscation]\ntechniques.\n\n## • [A tutorial on using rclone to pull victim data to secure cloud storage accounts on MEGA.]\n • [How to establish a remote connection to the victim’s network and gain persistence]\nusing AnyDesk and Atera.\n\n## • [How to connect to hacked networks with RDP using Ngrok secure tunnel.]\n • [A guide to performing SMB brute-force attacks.]\n • [A tutorial on operating system and anonymizing internet traffic via Tor network.]\n • [A how-to on privilege escalation and gaining administrative rights inside a target]\nnetwork.\n\nIt’s important to note that many of these technologies are readily available software\n\n13 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nproducts with legitimate commercial use cases, and that cybercriminals are abusing these\ntechnologies to attack victims :\n\n## • [Cobalt Strike is a commercial, full-featured, remote access tool frequently used in]\ncybersecurity event simulations.\n\n## • [rclone is a command-line program that helps users manage cloud data storage using]\ncode.\n\n## • [AnyDesk and Atera are commercial remote desktop applications that provide]\nplatform-independent remote access to personal computers and other devices.\n\n## • [ngrok generates an interface where users can introspect all HTTP traffic running over]\nspecified tunnels in real-time.\n\n## • [Tor is an open-source web browser designed for secure, anonymous communication.]\n\n#### 3.2 The Conti Attack Kill Chain\n\nConti ransomware is constantly changing its attack pattern on a daily basis. It relies on\nup-to-date security exploits such as PrintNightmare[7] and FortiGate[10], which are known\nexploits with official patches available. However, many users still have not downloaded the\nappropriate patches and remain vulnerable.\n\n## • [PrintNightmare (CVE-2021-1675, CVE-2021-34527, and CVE-2021-36958)][ works by]\nescalating the Windows Print Spooler service permissions to executive privileged\noperations. An attacker can use this exploit to install programs; view, change, or delete\ndata; or create new accounts with full user rights.\n\n## • [FortiGate firewall remote code execution (CVE-2018-13379 and CVE-2018-13374)][ is a]\nbuffer underwrite vulnerability that impacts Fortigate VPN servers to gain access to\nenterprise networks.\nConti knows that many users don’t update their security patches very frequently. Its\naffiliates count on users waiting for days or even weeks before downloading and running\nsecurity patches. With a highly automated RaaS business model like the one Conti uses,\nit’s possible for attackers to compromise unpatched systems mere hours after patches get\nreleased.\nIn the following sections, each step of the overall Conti attack kill chain will be explained,\nincluding every technique, tactic, and procedure that Conti affiliates use to attack their\nvictims. Since Conti is a RaaS platform, every individual attack may use unique vectors and\nexhibit unique behaviour – there is no one-size-fits-all Conti ransomware attack variant.\n\n**3.2.1** **Target Selection**\n\nSince the RaaS service model gives affiliates a great deal of flexibility over how they choose\nto operate, Conti affiliates use a wide range of target selection methods. These include :\n\n## • [Email phishing]\n • [Mass vulnerability scanning]\n • [High-end malware distribution software]\n • [Credential stuffing]\n • [Fake websites, impersonated phone calls, and similar social engineering tactics.]\nOf these target selection methods, email phishing is by far the most common. Another\ncommon method used by Conti affiliates is mass vulnerability scanning, which relies on\n\n14 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nautomated bots checking publicly exposed networks for known vulnerabilities. We have also\nseen Conti affiliates using high-end Malware-as-a-Service technologies such as Trickbot,\nEmotet, and BazarLoader for distributing Conti ransomware.\n\n**3.2.2** **Deployment and Execution**\n\nIn the example our team analyzed for this report, the attack kill chain begins with a phishing\ncampaign that installs the BazarLoader backdoor onto target systems.\n\nPhishing campaigns often take advantage of Microsoft Office and Google Doc links, send via\nemail. Attackers use these links to redirect victims to malicious sites where they download the\nBazarLoader[6] payload. At this point, the reconnaissance phase begins. The ransomware\nwill try to discover all directories and network shares inside the victim’s system and expand\nthroughout.\n\n**Figure 8. Bazarloader phishing page**\n\nBased on forensic investigations on multiple Conti victims, our Team observed that before\nlaunching Conti ransomware, attackers often try to identify mission-critical systems like\ndomain controllers or backup servers. If they can find these systems early on, they can\ntrigger the next phase of the attack faster.\n\nOnce discovery and reconnaissance is complete, the data exfiltration phase begins. Conti\nattackers evaluate the data inside the victim’s system and decide whether it is important for\nthe target company. If the data is important enough, attackers will start exfiltrating data to\nan anonymous account on the cloud-based anonymous file upload service called MEGA.\n\n15 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nThe tool attackers use to do this is called ”rclone”.\n\nOnce the first two stages are complete, Conti begins encrypting all files and backups\nin the target system, including accessible network devices. The Conti ransomware uses\n**ChaCha8 encryption with randomly generated keys for each file inside the target system.**\nEvery generated key is encrypted with a RSA-4096 public key and stored at a specific offset\nof each file. These keys are used to identify the victim, manage negotiation, and eventually\ngenerate decryption codes upon payment.\n\n**3.2.3** **Demand and Negotiation**\n\nAt the end of the ransomware execution phase, all important files of the victims are\nencrypted, backups are deleted and a readme.txt file containing the ransom note is\ndropped on the target system desktop. The Conti group uses two different ransom note\nformats.\n\nThe first ransom note directs victims to **https://contirecovery.best/** and\n**http://contirecj4hbzmyzuydyzrvm2c65blmvhoj2cvf25zqj2dwrrqcq5oad.onion/** websites,\nwhich contain instructions for purchasing decryption keys from Conti affiliate attackers. The\nransom note also contains instructions about installing the TOR browser in order to access\nthe Conti group’s hidden web service.\n\n**Figure 9. Conti ransom note inside the victim system**\n\nThere is a unique victim ID value at the end of this ransom note (readme.txt). It is the string\nenclosed with —BEGIN ID— and —END ID— delimiters. Victims are expected to upload their\n\n16 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nransom note to the Conti’s recovery service website. Once a victim uploads a valid ransom\nnote, the website sends them to a chat page for negotiating with the affiliates. This type of\nransom note format carries data leakage risks for companies. The victim IDs are hard-coded\nin the ransomware itself. This means that whenever malicious files are uploaded to any\nmalware service, or the IDs get leaked, the chat becomes accessible to anyone.\n\nThe second ransom note includes one or two Protonmail accounts. Victims are expected\nto send their company information to those Protonmail mailboxes, which are operated by\nConti affiliates. Victims are recognized by victim-specific Protonmails here, just like the victim\nIDs produced in the first example.\n\n**Figure 10. Conti ransom note with e-mails**\n\nAs stated in 3.1, there are many similarities between Ryuk’s ransomware and Conti’s. This is\nparticularly evident when comparing Conti and Ryuk ransom notes. Both ransoms use a\nsimilar structure. There are victim-specific e-mail addresses created with Protonmail and a\nBTC wallet in both examples[2].\n\n17 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 11. Ryuk ransom note**\n\nOnce the unique ID is uploaded to Conti’s recovery system, it directs victims to a login page.\nOn the login page, affiliates request the victim’s names and e-mail addresses. Once they\nhave this information, the web service provides a chat page with a standard greeting\nmessage (Figure 1).\n\n**Figure 12. Conti main page**\n\n18 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nAt this stage, affiliates send the total captured file size and enumerated system information\nto the user. This proves that the data has indeed been compromised.\n\n**Figure 13. Victim system information messages**\n\nAt this point, if the attacker and victim reach an agreement, the victim sends bitcoin to\nthe designated address and the attacker produces a decryption key using the victim’s ID.\nHowever, we have found evidence that some Conti affiliates simply take the money and\ndisappear, refusing to provide the decryption key as promised. If the attacker sends the\ndecryption key to the victim, the link includes a user manual 14 that shows how to use the\ndecryption application. All information retrieved from the victim’s systems is uploaded to\na free file sharing site where it can be deleted, and that system data is shared with the victim.\n\n19 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 14. Post-agreement messages**\n\nConti affiliates will also send recommendation messages 15 telling victims how to protect\nagainst future attacks.\n\n**Figure 15. Recommendation message**\n\n#### 3.3 Management Panel\n\nThe PTI Team successfully gained access to several parts of Conti’s RaaS infrastructure. This\ngave us cutting-edge insight into the way Conti manages its affiliates and ransomware\ntechnology.\n\n20 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nWe gained access to a victim landing page (recovery service) and an\nadmin management panel hosted as a TOR hidden service on this address :\n**http://contirecj4hbzmyzuydyzrvm2c65blmvhoj2cvf25zqj2dwrrqcq5oad.onion/.**\n\nWe located the subject management panel as well /adminbdpm6p47p2ye3k5f.php, which\nis mainly used for managing victims, affiliate accounts, and uploaded files.\n\n**Figure 16. Conti admin panel login page**\n\nOur threat intelligence team was also able to access a hidden service that provided key\ninformation on the underlying technology stack Conti developers rely on. By analyzing the\nsource code of Conti’s recovery service and admin management panel, our team discovered\na hidden service using dockerized MySql database bound to 127.0.0.1:3327.\n\n21 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 17. Conti admin panel source code**\n\nThe victim recovery service panel contains a submit button, where victims are supposed to\nupload the readme.txt files created on their devices. We’ve highlighted the regex pattern\nthat detects the victim-specific ID in the figure below,18.\n\n**Figure 18. Recovery service readme.txt parser code**\n\nAs the following image shows 19, every uploaded file is stored under the /files/ directory, with\na unique name and following format : MD5(current_time+random_string), which prevents file\nname brute force attacks.\n\n22 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 19. Uploaded content hiding**\n\n#### 3.4 De-Anonymization\n\nOne of the main objectives of our investigation was revealing the identity of the Conti\naffiliates, retailers, developers and servers. Our management panel analysis revealed a\ngreat deal of information regarding the servers that this group uses.\n\nOne of the most valuable pieces of threat intelligence we discovered is the the real IP\naddress of Conti’s TOR hidden service and contirecovery.ws, and 217.12.204.135, on Tuesday,\n**28 September 2021 21:30:03 UTC.**\n\n**Figure 20. Domain definitions inside the Conti recovery service source code.**\n\nAdditionaly, our team was able to identify the operating system details of the server\nhosting the TOR hidden service for Conti. The host is a Debian server with host name\n”dedic-cuprum-617836”. We believe the numeric value at the end of the host name is an\ninvoice number for the server, assigned by the hosting company ITLDC.\n\n```\nLinux version 4.9.0-16-amd64 (Debian 6.3.0-18deb9u1) #1 SMP Debian 4.9.272-2\n(2021-07-19)\n/>■\n\n```\n\n**Console 1. OS Details of the Conti onion server (uname -a)**\n\n23 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n```\n217.12.204.135 dedic-cuprum-617836.hosted-by-itldc.com dedic-cuprum-617836\n/>■\n\n```\n\n**Console 2. Hostname Details of the Conti onion server (/etc/hosts)**\n\nThe captured IP address with the corresponding timestamp have been shared with law\nenforcement authorities for further legal action against the Conti group and its affiliates.\n\nThe next image shows the contents of htpasswd file of the subject host. The password hash\ncan be used by other researchers in future Conti investigations.\n\n```\nuser:$apr1$7F5MK3J3$/JX4zqKicgXi3hXS57OWZ/\n/>■\n\n```\n\n**Console 3. Htpasswd file of the Conti onion server**\n\nThroughout the analysis phase, our team constantly monitored network traffic entering and\nleaving Conti’s recovery servers. This information will improve anti-ransomware software\nand lead to more effective filtering and blacklisting of Conti-related traffic. We found the\nfollowing IP addresses communicating with the subject Conti server.\n\n## • [1.177.172.158]\n • [104.244.76.44]\n • [122.51.149.86]\n • [176.9.1.211]\n • [176.9.98.228]\n • [18.27.197.252]\n • [185.130.44.108]\n • [185.220.103.4]\n • [2.82.175.32]\n • [217.160.251.63]\n • [218.92.0.211]\n • [45.153.160.134]\n • [46.101.236.25]\n • [49.234.143.71]\n • [51.75.171.136]\n • [54.36.108.162]\n • [6.11.76.81]\n • [61.177.172.158]\n • [64.113.32.29]\n • [66.211.197.38]\n\n24 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n|User|Connect With|Connected From|Login Date (GMT+3)|Login Activity|\n|---|---|---|---|---|\n|root|pts/0|89.163.249.244|Wed Nov 10 14:11 - gone|no logout|\n|root|pts/0|107.189.31.241|Wed Nov 10 09:09 - 09:10|(00:01)|\n|root|pts/0|185.220.103.5|Mon Oct 25 15:08 - 15:50|(00:42)|\n|root|pts/0|192.42.116.25|Fri Oct 15 20:25 - 20:28|(00:03)|\n|root|pts/0|18.27.197.252|Mon Oct 4 17:47 - 17:47|(00:00)|\n|root|pts/0|45.153.160.134|Mon Sep 27 14:12 - 14:18|(00:05)|\n|root|pts/0|185.220.103.4|Mon Sep 27 09:10 - 09:13|(00:03)|\n|root|pts/0|185.130.44.108|Thu Sep 23 21:08 - 21:26|(00:18)|\n|root|pts/3|104.244.76.44|Thu Sep 23 08:04 - 08:04|(00:00)|\n|root|pts/2|104.244.76.44|Thu Sep 23 08:01 - 13:02|(05:01)|\n|root|pts/0|64.113.32.29|Wed Sep 22 13:46 - 15:40|(1+01:54)|\n|root|pts/0|54.36.108.162|Wed Sep 22 12:54 - 13:10|(00:16)|\n\n\n**Table 1. Conti Hidden Server SSH Connections**\n\nBy analyzing the IP addresses communicated with Conti servers, we discovered that most of\nthe connections originate from TOR exit nodes. Two of the IP addresses 176.9.1.211:9001 and\n**217.160.251.63:29001 are constantly connected to the Conti server, which could indicate that**\nthese are TOR entry nodes used for Conti’s hidden recovery service.\n\nDuring this phase of the investigation, the PTI team discovered multiple victim chat sessions\nand captured login credentials for MEGA accounts used when extorting victims’ data. Our\nteam has revealed the connecting IP addresses, dates, the purchase method, and the\nsoftware used for accessing the file sharing and upload service.\n\n25 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 21. Mega account**\n\nAnalyzing the MEGA account in above image 21 revealed that the threat actor created\nthe account using the TOR browser and made the purchase using Bitcoin. This transaction\noccurred while the ransomware attack against the victim was happening. Afterwards, this\naccount was used with a variety of different operating systems before Conti attackers\nuploaded company data to this account using the rclone 3.2.2 tool.\n\nTable 2 contains the login application, IP address, and access date for the MEGA account\ndiscovered by the PTI team.\n\n26 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n|Login App|IP Address|Access Date|\n|---|---|---|\n|MEGAsync-on-Linux|80.147.24.162|10/7/2021,06:03|\n|Opera-on-Windows|198.98.60.19|10/6/2021,22:32|\n|Opera-on-Windows|107.189.5.68|10/6/2021,20:54|\n|MEGAsync-on-Windows|62.216.203.221|10/6/2021,19:02|\n|MEGAsync-on-Windows|45.128.133.242|10/6/2021,18:38|\n|MEGAsync-on-Windows|147.135.36.162|9/23/2021,07:02|\n|Chrome-on-Windows|94.242.253.13|9/23/2021,07:02|\n|Firefox-on-Windows|147.135.36.162|9/23/2021,06:53|\n|MEGAsync-on-Windows|142.4.212.27|9/14/2021,15:45|\n|rclone/v1.53.3|176.98.160.187|9/13/2021,14:54|\n|rclone/v1.53.3|176.98.160.187|9/9/2021,14:35|\n|Firefox-on-Windows|185.193.52.180|9/9/2021,12:47|\n\n\n**Table 2. Conti Full List of Mega Account Information**\n\nOur analysis of victim chat logs revealed that several other Bitcoin wallet addresses were\nshared with some victims. The PTI Team is still conducting taint analysis on these wallet\naddresses to detect shared spending or laundering attempts.\n\n**Figure 22. Conti threat actor giving out additional wallet addresses**\n\n27 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n### 4 Statistics and Observations\n\nThe following graph (See Figure 23) displays changes in the number of Conti victims over a\none-year period. The victim data were gathered from the Conti extortion blog (See Figure 3\n\n[5]).\n\n**Figure 23. Conti Victim Count**\n\nIt’s clear to see that the number of victims has grown rapidly in the past year. The data\ncontained in this report will help law enforcement authorities act against the Conti\nransomware group and its affiliates, which should result in a drastic reduction in the number\nof victims in the near future. This report will inform ongoing investigations that could lead to\nthe complete neutralization of Conti itself.\n\n#### 4.1 Known Recruiter Profiles\n\nRansomware groups hire affiliates from deep web and dark net forums, competing to attract\nnew affiliates into their network. These recruiters generally create topics in well-known\nforums and discussion boards. In order to become an affiliate, one must have impressive\nskills, demonstrate motivation, and provide references from reputable cybercrime figures or\n\n28 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\norganizations.\n\nThreat actors like the Conti team are both secretive and selective when it comes to recruiting.\nThey recruit members only from experienced cybercrime organizations with high reputation,\nusing private communication channels. The posts and forum topics of Conti recruiters often\ninclude penetration testing job ads and tooling projects. The following example shows a\npenetration test job announcement written by Conti recruiters.\n\n**Figure 24. Pentester call for application post**\n\nThe relevant post was shared by a Russian-speaking threat actor named IT_Work on the\ncybercriminal forum exploit.in. In the comments to the related post, IT_Work mentions that\nonly those who can speak Russian can be included to the team. By combining the data\ngathered on the IT_Work profile and the Conti affiliate data leak 3.1.2 already mentions, the\nPTI team has gathered a list of threat actors identified as members of the Conti team :\n\n## • [Conti Admin]\nNick : Tokyo\nJabber : cicada3301@strong.pm\n\n## • [Assistant]\nJabber : it_work_support@xmpp.jp\n\n## • [Recruiter]\nNick : IT_Work\nUsername : megabyte\n\nThis information will prove vital in helping enterprise cybersecurity teams and their vendors\nidentify and mitigate security threats that originate from within the Conti cybercrime network.\n\n29 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n### 5 Money Flow\n\nThis section of the report is written by Elliptic Ltd. [8]. Elliptic is the leading provider of\ncrypto compliance and blockchain analysis solutions globally.\n\n#### 5.1 Analysis of Conti ransom payments\n\n113 bitcoin addresses were identified by Prodaft during this investigation. 100 of these\naddresses related to a single ransomware attack in which the victim requested to pay Conti\nin 100 separate transactions in order to hide the payment from tax and audit authorities. As\na result, the addresses identified during this research are believed to be connected to 14\nseparate ransomware incidents. 50% of these attacks resulted in a payment to Conti.\n\nElliptic analysed the seven addresses to which ransom payments have been made. Conti\noperates as a Ransomware as a Service model. RaaS transactions characteristically split as\nthe proceeds of each transaction is distributed between the ransomware operators and\naffiliates, with the exact percentage split differing between RaaS groups. In most instances,\nthe affiliates are awarded the majority of the ransom payment, with the ransomware\noperators taking a smaller percentage. However, on 22 September 2021, the US Cybersecurity\n& Infrastructure Security Agency (CISA) issued an alert in which they described Conti’s affiliate\nmodel as wage-based, as opposed to operating a traditional RaaS payment model.\n\n**5.1.1** **Identification of consolidation cluster**\n\nOf the seven active addresses, four were found to send a percentage of their incoming\nfunds, either directly or indirectly, to the same address cluster (hereafter referred to as “Conti\nconsolidation cluster”). For three of these addresses, almost exactly 22.5% of the original\nincoming funds were sent to this cluster. As a result, it appears that this consolidation cluster\nmay represent the operator portion of these ransomware payments.\n\n30 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 25. Elliptic Forensics**\n\nA further 31 incoming flows to this cluster were identified which appear to be ransomware\npayments. The majority of these send between 22-23% of their incoming funds either directly\nor indirectly to the Conti consolidation cluster. This common splitting pattern indicates that\nConti affiliates may be awarded a percentage of the ransoms they successfully obtain,\npotentially contradicting CISA’s assessment of Conti operating a wage-based affiliate\npayment model. Of interest, several further payments were identified in which the incoming\nfunds originate from a split of a previous ransom payment, as demonstrated in the graph\nbelow. It is unclear whether this demonstrates an attempt to obfuscate the flow of funds, or\na payment to the Conti operator for other services.\n\n31 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Figure 26. Elliptic Forensics**\n\nResearching the addresses identified by Prodaft and the incoming payments to the\nconsolidation cluster indicates that since July 2021, Conti has received over 500 bitcoin in\nransomware payments, valued at over $25.5 million, of which $6.2 million has been sent to\nthe Conti consolidation cluster.\n\n**Figure 27. Monthly ransom payments**\n\n32 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**5.1.2** **Destination of funds : Conti operator**\n\nThe consolidation cluster, believed to be controlled by a Conti operator, was first active\nin December 2017 when it received one incoming payment of 1.8 bitcoin, which was later\nsplit and sent to a variety of prominent exchanges. After this time, the consolidation cluster\nwas not active again until mid-2021. In August 2021, 0.07 bitcoin was sent from this cluster\nto a prominent exchange known to be used by ransomware groups. Aside from this, Conti\nhave not attempted to cash out or exchange any of the bitcoin they have received into this\ncluster. Blockchain activity indicates that the remaining 123.06 bitcoin is currently held in an\nunhosted wallet.\n\n**5.1.3** **Destination of funds : Conti affiliates**\n\nIn addition to investigating the flow of funds into the consolidation cluster, Elliptic also\ninvestigated the ransomware proceeds which are believed to have been sent to Conti\naffiliates. One cluster was identified which has received payments from both Conti and\nDarkSide, which may indicate that an individual has worked as an affiliate for both of these\ngroups.\n\n**Figure 28. Ransom payments over time**\n\nConti affiliates appear to conduct a sophisticated money laundering operation, avoiding\nobvious consolidation of funds. Due to the recent nature of some of these payments, some\naffiliate funds have not yet been moved. Despite this, Elliptic has identified affiliate funds\nbeing sent to a variety of services, including exchanges, coin swaps, privacy enhancing\nwallets including Wasabi, and the Russian-language darknet market Hydra.\n\n**5.1.4** **Identification opportunities**\n\nThis research indicates that identifying individuals associated with Conti through following\nthe flow of funds is likely to be challenging, particularly given Conti’s sophisticated money\nlaundering techniques and use of services such as Wasabi wallet. Furthermore, whilst services\nincluding exchanges implement KYC policies, it is possible that groups such as Conti deposit\nand withdraw from these services in small amounts, which do not trigger KYC requirements.\nHowever, transaction screening tools can provide financial institutions and cryptocurrency\n\n33 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\nexchanges with the ability to identify incoming transactions from illicit sources such as\nransomware payments. Elliptic’s clients, including financial institutions and cryptocurrency\nexchanges can be alerted to any client deposits which originate from addresses connected\nto Conti, by using our transaction and wallet screening solutions [1].\n\n### 6 Conclusion\n\nBold, headline-making cyberattacks like the Colonial Pipeline attack in May 2021 showed\nthe world how cybercriminals can deeply impact day-to-day life for millions of people.\nEnterprise executives and their risk advisors need in-depth threat intelligence in order to\nmitigate these threats while minimizing the damage they cause. The work of our PTI team is\ncrucial towards understanding the cybercrime landscape and developing solutions that\nimprove enterprise resilience against cyber threats and reduce risk exposure in the event of\nan attack.\n\nIn this report, we presented the inner workings of one of the most well-known ransomware\ngroups in the world. However, the cybercrime industry moves rapidly. Many ongoing\ntechnological and cultural changes – like the widespread acceptance of cryptocurrency\nand the ongoing shift towards remote and hybrid work – will significantly impact how\ncyberattacks occur in the near future.\n\nIn order to tackle the complex challenge of disrupting cybercriminal organizations,\npublic and private forces need to work collaboratively with one another to better\nunderstand and mitigate the wider legal and commercial impact of the threat. Our research\nsheds much-needed light on the inner workings of cybercriminal organizations, helping\ncybersecurity professionals, lawyers and insurance companies identify operatives and their\nexternal connections when investigating security incidents.\n\nEnterprise leaders and cybersecurity executives who invest in threat intelligence services\ngain valuable insight into the unique risk profile of their organization. This kind of intelligence\nenables them to make comprehensive, data-based decisions about the overall exposure of\ntheir business e relative to real-world threat actor tactics and techniques.\n\nIf there is no choice but to negotiate, enterprises equipped with sophisticated threat\nintelligence capabilities like ours stand a far better chance of gaining the upper hand\nand preventing catastrophic damage to their brand, their users, and their stakeholders.\n\n1. https://www.elliptic.co/solutions/crypto-transaction-monitoring\n\n34 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n### Références\n\n[1] [CERTFR. Hermes and Ryuk ransomware relation. url : https://www.cert.ssi.gouv.fr/](https://www.cert.ssi.gouv.fr/uploads/CERTFR-2021-CTI-006.pdf)\n```\n   uploads/CERTFR-2021-CTI-006.pdf. (accessed : 10.11.2021).\n\n```\n[2] [Checkpoint. Ryuk ransomware notes. url : https://research.checkpoint.com/2018/](https://research.checkpoint.com/2018/ryuk-ransomware-targeted-campaign-break/)\n```\n   ryuk-ransomware-targeted-campaign-break/. (accessed : 10.11.2021).\n\n```\n[3] Clearskysec. Clearskysec research : CONTI Modus Operandi and Bitcoin Tracking. url :\n```\n   https://www.clearskysec.com/wp-content/uploads/2021/02/Conti-Ransomware.\n   pdf. (accessed : 12.10.2021).\n\n```\n[4] [Comparitech. 2018-2021 Ransomware statistics and facts. url : https : / / www .](https://www.comparitech.com/antivirus/ransomware-statistics/)\n```\n   comparitech.com/antivirus/ransomware-statistics/. (accessed : 25.03.2021).\n\n```\n[5] [Conti. Conti ransomware’s extortion blog. url : https://continews.click/. (accessed :](https://continews.click/)\n10.11.2021).\n\n[6] [Cybereason. Bazarloader distrubition methods. url : https://www.cybereason.com/](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)\n```\n   blog/cybereason-vs.-conti-ransomware. (accessed : 28.10.2021).\n\n```\n[7] [Intel471. Intel471 : Printnightmare usages in Conti ransomware. url : https://intel471.](https://intel471.com/blog/ransomware-as-a-service-fivehands-printnightmare-babuk-conti)\n```\n   com / blog / ransomware - as - a - service - fivehands - printnightmare - babuk - conti.\n\n```\n(accessed : 28.10.2021).\n\n[8] [Elliptic Ltd. AML Compliance Monitoring for Crypto Transactions. url : https://www.](https://www.elliptic.co/solutions/crypto-transaction-monitoring)\n```\n   elliptic.co/solutions/crypto-transaction-monitoring. (accessed : 12.11.2021).\n\n```\n[9] [Malpedia. Malpedia : Wizard Spidef References. url : https://malpedia.caad.fkie.](https://malpedia.caad.fkie.fraunhofer.de/actor/wizard_spider)\n```\n   fraunhofer.de/actor/wizard_spider. (accessed : 28.10.2021).\n\n```\n[10] [Sophos. Fortigate firewall RCE usages in Conti ransomware. url : https://news.sophos.](https://news.sophos.com/en-us/2021/02/16/conti-ransomware-attack-day-by-day/)\n```\n   com / en - us / 2021 / 02 / 16 / conti - ransomware - attack - day - by - day/. (accessed :\n\n```\n10.11.2021).\n\n35 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n**Acknowledgement**\nWe would like to thank ”Police Cantonale Vaudoise / Switzerland” and our advisors for their\nvaluable guidance and support throughout this research.\n\nWe also would like to thank Elliptic Ltd. (www.elliptic.co) for their invaluable contribution to\nthis research by analyzing the money flow of one of the world’s top ransomware gangs.\n\n[The public version of the report will be shared from our github page https://www.github.](https://www.github.com/prodaft)\n```\ncom/prodaft. The readers can find new samples, IOCs, and new versions of this report from\n\n```\nour github page as we will constantly update our page based on new findings.\n\n36 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----\n\n### Historique\n\n**Version** **Date** **Auteur(s)** **Modifications**\n\n1.0 16.10.2021 PTI Team Initial DRAFT release\n1.1 10.11.2021 PTI Team Initial TLP:WHITE DRAFT\n1.2 12.11.2021 PTI Team Money Flow section added\n1.3 15.11.2021 PTI Team Typo fixes\n1.4 17.11.2021 PTI Team 5.1 edited\n1.5 18.11.2021 PTI Team Intro and Conclusion edited\n1.6 18.11.2021 PTI Team Removed Hermes, Wizard Spider\n\n37 / 37\n\nDISCLAIMER : This document and its contents shall be deemed as proprietary and privileged information of PRODAFT and shall\n\nbe subjected to articles and provisions that have been stipulated in the General Data Protection Regulation and Personal\n\nData Protection Law. It shall be noted that PRODAFT provides this information “as is” according to its findings, without providing\n\nan legall applicable arrant regarding completeness or acc rac of the contents Therefore neither this report nor an of\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://www.prodaft.com/m/reports/Conti_TLPWHITE_v1.6_WVcSEtc.pdf",
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-18 - Conti Ransomware Group In-Depth Analysis.pdf"
    ],
    "report_names": [
        "Conti_TLPWHITE_v1.6_WVcSEtc.pdf",
        "2021-11-18 - Conti Ransomware Group In-Depth Analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041627,
    "ts_creation_date": 1637244329,
    "ts_modification_date": 1637244329,
    "files": {
        "pdf": "https://archive.orkl.eu/738aef489fec1012a57b05e862a7721ff9832fbf.pdf",
        "text": "https://archive.orkl.eu/738aef489fec1012a57b05e862a7721ff9832fbf.txt",
        "img": "https://archive.orkl.eu/738aef489fec1012a57b05e862a7721ff9832fbf.jpg"
    }
}