{
    "id": "114744a5-256d-45fc-b95c-bb0b68619145",
    "created_at": "2023-01-12T15:06:45.311898Z",
    "updated_at": "2025-03-27T02:06:15.362142Z",
    "deleted_at": null,
    "sha1_hash": "2511da7eb33678829303c5c2adcf8a21a2a66de1",
    "title": "2020-05-04 - ATM malware targets Wincor and Diebold ATMs",
    "authors": "",
    "file_creation_date": "2022-05-28T03:48:40Z",
    "file_modification_date": "2022-05-28T03:48:40Z",
    "file_size": 1985228,
    "plain_text": "# ATM malware targets Wincor and Diebold ATMs\n\n**[insights.oem.avira.com/atm-malware-targets-wincor-and-diebold-atms/](https://insights.oem.avira.com/atm-malware-targets-wincor-and-diebold-atms/)**\n\nApril 30, 2020\n\nCyber criminals continue to target cash points (ATMs) causing significant loss to the\nbanking and financial industry. They target the vulnerabilities and security flaws found in the\noutdated (and unpatched) operating systems still used in many Automated Teller Machines,\nstealing financial information and dispensing large amounts of unauthorised cash.\n\nAnatoly Kazantsev, specialist threat researcher at Avira Protection Labs, recently found an\n[ATM malware in the wild that specifically targets Wincor and](https://en.wikipedia.org/wiki/Wincor_Nixdorf) [Diebold ATM machines.](https://www.dieboldnixdorf.com/)\nFurther investigation of these samples suggests that the campaigns originated from\nPortuguese-speaking countries.\n\nIn this blog, we will analyze the ATM malware samples that were recently found.\n\n## Malware sample analysis\n\n**SHA256: 7cea6510434f2c8f28c9dbada7973449bb1f844cfe589cdc103c9946c2673036**\n\nThis sample uses CEN/XFS API to communicate with the ATM cash dispenser.\n\nThe CEN/XFS standard defines a common language to speak with the hardware\ncomponents of the ATM. It shares a common conceptual background with Microsoft\nWindows device drivers. XFS stands for eXtension for Financial Services and has the\nfollowing architecture:\n\n\n-----\n\nfigure 1: XFS architecture\n\nThe ATM malware sample is written in C language and compiled using a MinGW GCC\ncompiler as a 32-bit console application:\n\nFor further analysis, we upload the malware sample into IDA Pro and import MSXFS.dll\nlibrary that implements XFS API functions:\n\n\n-----\n\nThese functions are called from _main function. In general, the malware logic is\nstraightforward and mostly implemented inside the _main function. The function is the\nbiggest part of the sample’s executable code:\n\nThe function’s graph (a few if-else and switch-case constructions):\n\n\n-----\n\nThese if-else and switch-case constructions handle the return values and print error or\ninformation messages to a console. We will not describe _main function in detail, only\nconcentrate on WFS* functions call and its parameters.\n\nNow, let’s review a typical XFS API usage scenario and map malware’s behavior to this\nworkflow:\n\nAs we can see from the import table, the malware doesn’t care about clean-up after itself. It\nonly uses necessary functions (marked bold in the below table) to execute a specific\ncommand.\n\n\n-----\n\n**Action** **Function**\n**name**\n\n\n**Description**\n\n\nStartUp **WFSStartUp** Connects to XFS Manager\n\nOpen **WFSOpen** Establishes a session between an application and the\nService Provider\n\nRegister **WFSRegister** Enable monitoring of a class of service events by an\napplication\n\nLock **WFSLock** Establish exclusive control by an application of a service\n\nExecute **WFSExecute** Send service-specific commands to a Service Provider\n\nUnlock WFSUnlock Release exclusive control by an application of a service\n\nDeregister WFSDeregister Disable monitoring of a class of service events by an\napplication\n\nClose WFSClose Close a session between an application and the Service\nProvider\n\nCleanUp WFSCleanUp Terminate a connection between an application and the\nXFS Manager\n\nLet’s take a closer at the most important functions to understand malware goals:\n\nFirst, WFSOpen function takes its first argument the string “CDM30”:\n\nA quick Google search gives us the meaning of the string:\n\n\n-----\n\nNow we know that this particular sample targets Wincor ATMs and establishes a session\nwith Cash Dispenser Module (CDM) service provider.\n\nThe next interesting XFS API call is WFSExecute. This function takes 5 arguments. Two of\nthem define command ID and command data – dwCommand and lpCmdData accordingly.\nIn our case, dwCommand equals 302 and it is WFS_CMD_CDM_DISPENSE command ID:\n\nCommand name describes itself – malware tries to dispense some cash. Amount and\ncurrency are defined in a special structure lpCmdData. Inside the _main function there are\nsome interesting string:\n\nAccording to ISO4217 (https://en.wikipedia.org/wiki/ISO_4217):\n\nBRL – Brazilian real\nUSD – United States dollar\nARG – seems malware authors meant ARS (Argentine peso)\nEUA – Euro (EUR)?\n\n\n-----\n\nAFA – Afghan afghani (AFN)?\nMEX – seems malware authors meant MXN (Mexican peso)\n\nIf the malware didn’t find one of the above currency code, it will use a value returned by\nWFSGetInfo call.\n\nTo set an amount of money, malware fills a field of special structure (var_260) with value\n1000:\n\nAfter some manipulations this structure is passed as lpCmdData argument to WFSExecute\nfunction:\n\nIt is interesting to see that the first upload to VirusTotal originated from Brazil:\n\n\n-----\n\nSimilarly, the currency we saw earlier and strings in Portuguese tell us the malware targets\nLatin America countries (and possibly written by Portuguese-speaking attackers).\n\n## Conclusion\n\nThe results of the analysis indicate that the authors behind these attacks target Wincor and\nDiebold ATMs. We regularly see malware attacks on ATMs mostly because of unaddressed critical issues found in the systems. The detection and prevention of these kinds\nof threats can be done in multiple ways, and is made easier because the focus of the\nmalware is on executing some specific commands and doesn’t clean-up after itself. Avira’s\nrange of detection mechanisms protects its customers from such attacks; powerful machine\n[learning based anti-malware technologies help to extend the security level of ATMs and](https://oem.avira.com/en/technology/avira-scan-engines)\nprovide protection from known, unknown and advanced threats.\n\n\n-----\n\n## IOCs\n\n_5c002870698258535d839d30f15c58934869c337add65c9b499aca93fb1c8692_\n\n_7cea6510434f2c8f28c9dbada7973449bb1f844cfe589cdc103c9946c2673036_\n\nAvira Protection Labs\n\nProtection Lab is the heart of Avira’s threat detection and protection unit. The researchers\nat work in the Labs are some of the most qualified and skilled anti-malware researchers in\nthe security industry. They conduct highly advance research to provide the best detection\nand protection to nearly a billion people world-wide.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-04 - ATM malware targets Wincor and Diebold ATMs.pdf"
    ],
    "report_names": [
        "2020-05-04 - ATM malware targets Wincor and Diebold ATMs.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536005,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653709720,
    "ts_modification_date": 1653709720,
    "files": {
        "pdf": "https://archive.orkl.eu/2511da7eb33678829303c5c2adcf8a21a2a66de1.pdf",
        "text": "https://archive.orkl.eu/2511da7eb33678829303c5c2adcf8a21a2a66de1.txt",
        "img": "https://archive.orkl.eu/2511da7eb33678829303c5c2adcf8a21a2a66de1.jpg"
    }
}