{
    "id": "11a50c2b-275f-4592-9443-032bf2525575",
    "created_at": "2023-01-12T15:02:59.719492Z",
    "updated_at": "2025-03-27T02:05:30.484559Z",
    "deleted_at": null,
    "sha1_hash": "17d092e3b74339b5937234e9b7bbeb2f876144b1",
    "title": "2020-11-18 - Thanos Ransomware Evading Anti-ransomware Protection With RIPlace Tactic",
    "authors": "",
    "file_creation_date": "2022-05-28T19:30:34Z",
    "file_modification_date": "2022-05-28T19:30:34Z",
    "file_size": 1232877,
    "plain_text": "# Thanos Ransomware Evading Anti-ransomware Protection With RIPlace Tactic\n\n**[seqrite.com/blog/thanos-ransomware-evading-anti-ransomware-protection-with-riplace-tactic/](https://www.seqrite.com/blog/thanos-ransomware-evading-anti-ransomware-protection-with-riplace-tactic/)**\n\nPriyanka Shinde November 18, 2020\n\n18 November 2020\nWritten by [Priyanka Shinde](https://www.seqrite.com/blog/author/priyanka-shinde/)\n\n[Cybersecurity,](https://www.seqrite.com/blog/category/cybersecurity/) [Ransomware](https://www.seqrite.com/blog/category/ransomware/)\n\nEstimated reading time: 5 minutes\nRansomware has come a long way in cyberspace by continuous improvement in its\ntechniques and tactics in encrypting system files. Over the years ransomware has\nimprovised itself by moving from PE to non-PE and standalone payloads, by using different\ncompilers and complex packers. To deal with such variations, behaviour-based detection and\nAnti-ransomware solutions plays a vital role as the activity of the ransomware is targeted\nwhich no one can avoid.\n\nRansomware authors have now started injecting their malicious payloads into Windows\ngenuine system processes, which are usually white-listed, encrypting the files by bypassing\nsecurity solutions — they have always been found hunting for vulnerable apertures and\nabusing them the moment it gets publicly exposed.\n\n\n-----\n\nRecently, we observed a similar strain of ransomware (named as Thanos Ransomware)\ntrying to evade traditional Anti-Ransomware solutions by implementing different techniques\nwhich include process injection and the latest RIPlace tactic.\n\n[Last year researchers at Nyotron had furnished proof of concept (POC) of RIPlace tactic that](https://www.nyotron.com/riplace/)\ncan potentially encrypt files without getting identified by the anti-ransomware or Endpoint\nDetection and Response (EDR) solutions.\n\n## Technical Analysis\n\nThe Thanos Ransomware has been found to use multiple features, in an attempt to bypass\nAnti-Virus (AV) products.\n\nThe Infection Vector is not clear yet but there is a PowerShell script that contains another\ndouble Base64 encoded PowerShell which contains inline C# code. The first script executes\nthe embedded PowerShell script and creates processes of “notepad” in hidden mode. The\nC# code present in the second script is basically taken from the Urban Bishop code of the\nSharp-Suite framework present on Github. The PID of the notepad processes created is\npassed to this C# code as the argument. After this, the script is distributed laterally to all the\nmachines connected in the network.\n\nFig.1 Flow of execution of different modules\n\n\n-----\n\nFig.2 First PowerShell script containing encrypted script and process creation code\nThe function call contains Base64 encoded shellcode (shown in Fig.3), which is then injected\nto the notepad process. The shellcode contains encoded .Net payload. This payload is the\nvariant of Thanos ransomware which encrypts files on the targeted machine.\n\nFig.3 Encrypted shellcode in the C# code\nThere are different modules in the Thanos framework. Some of the interesting ones being\n_1. AntiKill – As shown in fig. 4, uses the function named, IamInmortal() to make the process_\nimmortal by making changes in the process security descriptor.\n\nFig.4 AntiKill code in .Net payload\n_2. Anti-Analysis – Used to identify the presence of debugger or virtual environment and if_\nfound so, terminating the sample.\n\n\n-----\n\nFig.5 Anti-analysis code in .Net payload\n_3. Anti-Sniffer – Stops following processes that are usually used for analysis-_\n\n_4. AwakeMe – Responsible for implementing Wake-on-LAN. (A detailed description of Wake-_\n[on-LAN can be found in our earlier blog)](https://blogs.quickheal.com/deep-dive-wakeup-lan-wol-implementation-ryuk/)\n\n_5. Encryptions – Contains all the encryption-related functions like AES-CBC encryption,_\ndecryption, reading data from files, writing data to files.\n\n_6. CryptographyHelper – RSA encryption implemented._\n\n_7. NetworkSpreading – Downloads an application of Power Admin i.e exe (this allows to_\nexecute Windows program on a remote machine) and executes the current sample on\nremote machines.\n\n_8. MutexHelper – It checks for the presence of below mutex to check whether the sample_\nhas already been executed on the system –\n\n**_“Global\\\\3747bdbf-0ef0-42d8-9234-70d68801f407”_**\n\n_9. ProcessCritical_ _– Checks whether the process is running with admin privileges._\n\n_10. RIP – Implementation of RIPlace tactic which is discussed later._\n\n_11. Shortcut – Creates shortcut at Startup folder with the target filename as the ransom note_\nkept at the %Temp% folder.\n\n\n-----\n\n_12. WakeOnLan – Implements Wake-on-LAN by taking IP addresses of all the machines_\nconnected to the current machine.\n\nThe inclusion of such different modules varies in different samples.\n\nUtmost precaution is taken and so it tries to hide the following processes\n_Taskmgr_\n\n_taskmgr_\n\n_ProcessHacker_\n\n_procexp_\n\nThe self-copy is also dropped at StartupFolder — it also tries to stop various services related\nto different AVs, running on the system by net.exe, using the commands shown in fig.6\n\n-----\n\nFig.6 Tries\n\nto stop different services\nIt further deletes the shadow copy using vssadmin.exe, deletes all the backup files present\non different drives, including the recycle bin using\n\n_cmd.exe /c rd /s /q %SYSTEMDRIVE%\\\\$Recycle.bin_\n\n## Encryption\n\nThe files are encrypted and the filename is appended with the extension ‘.locked’. The\nencryption is performed only for the files with the extensions given below\n_bco, one, dat, txt, vib, vbm, vbk, jpeg, gif, lst, tbl, cdx, log, fpt, jpg, png, php, cs, cpp, rar, zip,_\n_html, htm, xlsx, xls, avi, mp4, ppt, doc, docx, sxi, sxw, odt, hwp, tar, bz2, mkv, eml, msg, ost,_\n_pst, edb, sql, accdb, mdb, dbf, odb, myd, php, java, cpp, pas, asm, key, pfx, pem, p12, csr,_\n_gpg, aes, vsd, odg, raw, nef, svg, psd, vmx, vmdk, vdi, lay6, sqlite3, sqlitedb, accdb, java,_\n\n\n-----\n\n_class, mpeg, djvu, tiff, backup, pdf, cert, docm, xlsm, dwg, bak, qbw, nd, tlg, lgb, pptx, mov,_\n_xdw, ods, wav, mp3, aiff, flac, m4a, csv, sql, ora, mdf, ldf, ndf, dtsx, rdl, dim, mrimg, qbb, rtf,_\n_7z_\n\nFig.7 Encrypted files\nThe files are encrypted with AES-CBC and the key used in encryption is then encrypted with\nRSA and is appended in the Ransom note (as shown in Fig.8). The complete file is\nencrypted if the file size is less than 10MB, otherwise, only file data up to the size of 10MB is\nencrypted.\n\n\n-----\n\nFig.8 Ransom Note\nBut the most important and a novel technique used by Thanos to evade anti-ransomware\nsolutions is the RIPlace tactic that assets Microsoft Windows file Rename functionality! It\nhelps the ransomware to hide from modern anti-ransomware solutions.\n\nIn this technique, a malware can call DefineDosDevice, a genuine function that creates a\nsymlink and can give an arbitrary name (for example, ‘Resolve’ in this case) to the\ntarget/destination file path. When we make a call to rename function, the filter driver fails to\nparse the destination path in the callback function when using the common routine\n_FltGetDestinationFileNameInformation. So, instead of returning the new path, it returns an_\nerror, however, the Rename call gets succeeded.\n\n\n-----\n\nFig.9 RIPlace Tactic\nAlong with this, taking it further, Thanos may attempt to overwrite the MBR, trying to display\nthe below message\n**Conclusion**\n\nThere have been several techniques used by ransomware families to evade the AV products\nearlier, increasing the complexity, the speed of their operations, termination of the analysis\ntools, but this time it has become more advanced, challenging for anti-ransomware\ntechnologies. The use of almost all the possible anti-analysis techniques and then hiding the\nnew extensions of the encrypted files from the anti-ransomware solutions makes the task\nmuch more difficult.\n\n**IOCs:**\n\n_7BDD4B25E222B74E8F0DB54FCFC3C9EB_\n\n\n-----\n\n_AF0E33CF527B9C678A49D22801A4F5DC_\n\n_A15352BADB11DD0E072B265984878A1C_\n\n_BE60E389A0108B2871DFF12DFBB542AC_\n\n_98880A1C245FBA3BAE21AC830ED9254E_\n\n_E01E11DCA5E8B08FC8231B1CB6E2048C_\n\nPriyanka Shinde is working as Senior Security Researcher in Quick Heal Security Labs. She\nhas experience in cyber-security domain and expertise in reversing various...\n\n[Articles by Priyanka Shinde »](https://www.seqrite.com/blog/author/priyanka-shinde/)\n\n### No Comments\n\nLeave a Reply.Your email address will not be published.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-18 - Thanos Ransomware Evading Anti-ransomware Protection With RIPlace Tactic.pdf"
    ],
    "report_names": [
        "2020-11-18 - Thanos Ransomware Evading Anti-ransomware Protection With RIPlace Tactic.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535779,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653766234,
    "ts_modification_date": 1653766234,
    "files": {
        "pdf": "https://archive.orkl.eu/17d092e3b74339b5937234e9b7bbeb2f876144b1.pdf",
        "text": "https://archive.orkl.eu/17d092e3b74339b5937234e9b7bbeb2f876144b1.txt",
        "img": "https://archive.orkl.eu/17d092e3b74339b5937234e9b7bbeb2f876144b1.jpg"
    }
}