{
    "id": "11adac00-369d-4e14-b9d7-5fcc6c9fe35e",
    "created_at": "2023-01-12T15:10:23.652611Z",
    "updated_at": "2025-03-27T02:05:25.090511Z",
    "deleted_at": null,
    "sha1_hash": "6bc82304f2c69e4061def382b82003ba33240bfb",
    "title": "2017-01-31 - Locky Bart ransomware and backend server analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T04:56:10Z",
    "file_modification_date": "2022-05-28T04:56:10Z",
    "file_size": 1776810,
    "plain_text": "# Locky Bart ransomware and backend server analysis\n\n**[blog.malwarebytes.com/threat-analysis/2017/01/locky-bart-ransomware-and-backend-server-analysis/](https://blog.malwarebytes.com/threat-analysis/2017/01/locky-bart-ransomware-and-backend-server-analysis/)**\n\nMalwarebytes Labs January 31, 2017\n\n[In this post we will cover the Locky Bart ransomware. The developers of Locky Bart already](https://www.malwarebytes.com/ransomware)\nhad 2 very successful ransomware campaigns running called “Locky” and “Locky v2”. After\nsome users reported being infected with Locky Bart, we investigated it to find the differences\nas to gain greater knowledge and understanding of this new version.\n\nThe Locky Bart ransomware has new features that are different from its predecessors. It can\nencrypt a machine without any connection to the Internet. It also has a much faster\nencryption mechanism.\n\nOur research would also indicate that the backend infrastructure of Locky Bart might be\nmaintained by a different threat actor than the original versions. While the internals of the\nmalicious binary share a great number of similarities, there were some notable differences.\n\nThese included: Comments in the code of the application, but more notably the kind of\n_software used in the backend server._\n\nThis did not come as a surprise, as cyber-criminals are known to share, rent, sell, and even\nsteal malicious code from one another.\n\n## Analysis of Locky Bart’s binary\n\nIn previous incarnations, Locky Bart used a simpler encryption process. They enumerated\nthe files targeted for encryption, placed each in a password protected ZIP archive, and\nrepeated this process until all the files were encrypted. The creators did not use the AES ZIP\nprotection, but an older algorithm, and because of this, researchers were able to make a\ndecrypting application.\n\nLocky Bart performs a fairly straight forward set of actions to encrypt the victim’s files. They\nare as follows:\n\nWipe System Restore Points with VSSadmin.\nGenerate a seed to create a key to encrypt user’s files.\nEnumerate the files it wants to encrypt, skipping certain folders to speed it up.\nEncrypt the enumerated files with the generated key.\nEncrypt the key used to encrypt the files with a master key, which now becomes the\nvictim’s “UID” used to identify them.\nCreate a ransom note on the desktop with a link to a payment page and their “UID”.\n\n\n-----\n\n_The function used to generate a seed, which is used to create a key to encrypt the files with._\n_It uses variables like system time, process ID, thread ID, Process Alive Time, and CPU ticks_\n_to generate a random number._\n\n\n-----\n\n-----\n\n_The function used to enumerate and encrypt the files._\n\n_Locky Bart will skip any folders with these strings in them._\n\n\n-----\n\n_The file-types that Locky Bart targets to encrypt._\n\n_The string that Locky Bart uses to make a Ransom Note. The “khh5cmzh5q7yp7th.onion” is_\n_the payment server, and the “AnOh/Cz9MMLiZMS9k/8huVvEbF6cg1TklaAQBLADaGiV” is a_\n_sample UID that would be sent with the URL to the server for the victim to make a payment._\n_Remember that the UID is only an encrypted version of the key that can be used to decrypt a_\n_victim’s files._\n\nHow the creators of Bart Locky acquire the key is what differentiates this version from its\npredecessors. When the victim of the ransomware visits the URL to make their payment for\nthe ransom, they are unknowingly sending their decryption key to the criminals.\n\nLet’s break down the process in a more granular method, to better understand it.\n\nLocky Bart gathers information on the victim’s machine to create an encryption key.\n\nLocky Bart encrypts the user’s files using the seeded key created in the previous step.\n\nLocky Bart then encrypts the key that was used for the original encryption with a one\nway encryption mechanism, using the public key of a public / private key pair method.\nThe private key for this second encryption resides on the malicious server and is never\naccessible to the victim.\n\n\n-----\n\nLocky Bart then generates a URL on the victim s machine. It contains the link to a TOR\ncloaked .onion address where the malicious backend website is hosted. This URL has\na user ID within it. This UID is the original decryption key, in encrypted form.\n\nThe victims visits the .onion site and the malicious server harvests the encrypted UID.\n\nThis UID is useless to the victim though, because they do not have the private key to decrypt\ntheir files. However, the ransomware creator’s server does, meaning his server can not only\nuse the UID to identify the victim, but also decipher the UID into their victim’s key upon\npayment of the ransom.\n\nIn the end, only the ransomware creators can decrypt the user’s files, and because of this\nfeature, there is no need to access the malicious server to encrypt them.\n\n## Locky Bart Software Protection technique\n\nThe Locky Bart binary also uses a software protection technique. This technique is known as\ncode virtualization and is added to the Locky Bart binary by using a program called\n[“WPProtect”.](https://github.com/xiaoweime/WProtect)\n\nThis makes reversing the binary significantly more difficult to disassemble and complicates\nstepping through the code, a technique used to understand what it does. Legitimate uses of\nthis type of software are most typically seen in anti-piracy mechanisms. An example of a\n[commercial version of this type of software would be Themida. The author of Locky Bart](http://www.oreans.com/themida.php)\nprobably chose this particular anti-tampering mechanism as it is free, open source, and\nprovides many features. This adoption of software protection techniques is a troubling\ndevelopment. These applications, including WPProtect, make reversing and analysis\nsignificantly more challenging.\n\n## The Locky Bart server\n\nThe second half of Locky Bart is the server and backend. This server is used to provide the\nvictims with a payment mechanism to pay the ransom.\n\nReceive the bitcoins used as a payment method.\nTransfer the bitcoins to other wallets.\nGenerate a decryption EXE for the victims.\nProvide the victims with the decryption EXE to the victims.\nAccrue additional information on the victims.\n\n[The Locky Bart backend runs on a framework called yii. Yii is a high-performance PHP](http://www.yiiframework.com/)\nframework best for developing Web 2.0 applications.\n\nThis framework contains a wealth of information on the inner workings of Locky Bart.\n\n\n-----\n\n_TheYii debug panel that contained extensive information about the configuration server._\n\nAccess to this control panel revealed:\n\nEvery configuration setting for all the software running on the server such as PHP,\nBootstrap, Javascript, Apache (if used), Nginx (If used), ZIP, and more.\nEvery request that was made to the server including their request information, header\ninformation, body, timestamp, and where they originated.\nLogs that showed every error, trace, and debug item.\nAll the automated email functions.\nMYSQL Monitoring that showed every statement made and its return.\n\nLocky Bart stores information in a MYSQL database. The credentials to the MYSQL server\nreside in a “Config” PHP file in the “Common” folder of the site. An example path looks like\nthe following: /srv/common/config/main-local.php\n\n\n-----\n\n_The contents of Locky Bart’s server MYSQL config file_\n\nThe information contained in the MYSQL database consists of the victims Unique IDentifier,\nthe encryption key, BitCoin Address, Paid Status, and Timestamps.\n\n_A small part of the table holding the ransomware information in the database._\n\n\n-----\n\nThe Locky Bart server also contains a second database that contains further information on\nthe victims of the ransomware.\n\n_Locky Bart ransomware’s “Stats” table example._\n\n_A “ReadMe” file found on the server that seems to detail some features on the Stats_\n_database._\n\nThe Locky Bart server contains a “BTCwrapper.php” which used a “controller” method that\nexposes a BTC Wallet Class that all other PHP files can call. This class initiates a connection\nto the Bitcoin servers through a username and password. This class contained complete\n\n\n-----\n\nmethods on controlling and using the main BTC wallet set up by the criminal to store all the\nmoney received. This wallet is emptied regularly. This class can create new BTC Addresses\nas well and had the ability to empty those wallets on payment to the main wallet. There were\nalso methods to check on the status of payments from each victim.\n\n\n-----\n\n_Some of the functions that the BTCWrapper Class calls._\n\n_The first few functions of the BTCWrapper Class. The class uses CURL to contact a locally_\n_ran bitcoin server that communicates with the block chain_\n\n\n-----\n\nThe Locky Bart server had 2 Bitcoin addresses where victims payments were transferred to.\nThe current one:\n\n_The current BTC address associated with Locky Bart has accumulated $ 7,671.60 in its life_\n_time._\n\nAnd a second one, that was referenced in PHP configurations on the malicious server.\n\n_An older BTC address also associated with Locky Bart had accumulated $ 457,806.06._\n\nThe server portion of this ransomware was configured to function very similar to a legitimate\nbusiness. It mirrored a “Support Ticket Department” where the user could contact the\nransomware support for any issues they may have experienced.\n\nThe process was completely automated. The user would get infected and visit the site as\ntheir ransom note instructed. When they visited the site, the server would then generate their\nunique BTC address and present it to them automatically.\n\nAfter this, if the user made the decision to pay the ransom, but if they had any questions,\nthey could literally contact support.\n\n\n-----\n\nIf they did indeed make the decision to pay, they would proceed to buy Bitcoins through the\nmany methods available (BTC ATM, LocalBitcoins – which allows you to meet people local to\ntrade BTC for money or use banks and wiring like Western Union, or buy them with a credit\ncard online).\n\nOnce the user has the amount specified by the ransomware in their own BTC Wallet, they\nwould then transfer the money from their wallet to the Payment Address the Ransomware\nPayment Page generated for them.\n\nThe Ransomware Server checks every few minutes if a payment has been made for any of\nits victims and if the payment had been confirmed. Once the server verifies a payment they\nmark that victim in the Database as “Paid”.\n\n\n-----\n\nWhen a victim is marked as Paid the server then generates a Decryption Tool EXE and\nwrites the users Encryption Key in the binary of that exe, and presents a link to download it\non the personal payment page of the victim. Later when the victim checks their payment\npage again, they will see the link, download the tool, and decrypt their files.\n\n_The generation of the victim’s decryption tool on the fly._\n\n## Conclusion\n\nThis research into Locky Bart ransomware gives a great view of the side of a ransomware\noperation that we typically do not get to see, the backend. The criminals who run these\noperations do so on an extremely professional level, and users should always take an extra\nstep in protecting themselves from these types of attacks.\n\nRansomware will continue to grow and get more advanced and users need to make sure\n[they are protected in the form of backup’s, security application protection like Malwarebytes,](https://www.malwarebytes.com/premium/)\nand make sure they have some type of anti-ransomware technology protecting them from\nthese advanced attacks. Users running Malwarebytes already have protection from\nransomware, as Malwarebytes is equipped with our anti-ransomware technology.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-31 - Locky Bart ransomware and backend server analysis.pdf"
    ],
    "report_names": [
        "2017-01-31 - Locky Bart ransomware and backend server analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536223,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653713770,
    "ts_modification_date": 1653713770,
    "files": {
        "pdf": "https://archive.orkl.eu/6bc82304f2c69e4061def382b82003ba33240bfb.pdf",
        "text": "https://archive.orkl.eu/6bc82304f2c69e4061def382b82003ba33240bfb.txt",
        "img": "https://archive.orkl.eu/6bc82304f2c69e4061def382b82003ba33240bfb.jpg"
    }
}