{
    "id": "11c27002-fbb2-4354-8d12-fa0c048728c6",
    "created_at": "2023-01-12T15:00:50.574848Z",
    "updated_at": "2025-03-27T02:16:22.779559Z",
    "deleted_at": null,
    "sha1_hash": "f713f1bd000011bf9b94d45422d3af997c36c790",
    "title": "2022-08-15 - Disrupting SEABORGIUM’s ongoing phishing operations",
    "authors": "",
    "file_creation_date": "2022-09-01T10:10:35Z",
    "file_modification_date": "2022-09-01T10:10:35Z",
    "file_size": 2260105,
    "plain_text": "# Disrupting SEABORGIUM’s ongoing phishing operations\n\n**[microsoft.com/security/blog/2022/08/15/disrupting-seaborgiums-ongoing-phishing-operations](https://www.microsoft.com/security/blog/2022/08/15/disrupting-seaborgiums-ongoing-phishing-operations)**\n\nAugust 15, 2022\n\nThe Microsoft Threat Intelligence Center (MSTIC) has observed and taken actions to disrupt\ncampaigns launched by SEABORGIUM, an actor Microsoft has tracked since 2017.\nSEABORGIUM is a threat actor that originates from Russia, with objectives and victimology\nthat align closely with Russian state interests. Its campaigns involve persistent phishing and\ncredential theft campaigns leading to intrusions and data theft. SEABORGIUM intrusions\nhave also been linked to hack-and-leak campaigns, where stolen and leaked data is used to\nshape narratives in targeted countries. While we cannot rule out that supporting elements of\nthe group may have current or prior affiliations with criminal or other nonstate ecosystems,\nMSTIC assesses that information collected during SEABORGIUM intrusions likely supports\ntraditional espionage objectives and information operations as opposed to financial\nmotivations.\n\nThis blog provides insights into SEABORGIUM’s activities and technical methods, with the\ngoal of sharing context and raising awareness about a significant threat to Microsoft\ncustomers. MSTIC would like to acknowledge the Google Threat Analysis Group (TAG) and\nthe Proofpoint Threat Research Team for their collaboration on tracking and disrupting this\n\n\n-----\n\nactor. Microsoft s ability to detect and track SEABORGIUM s abuse of Microsoft services,\nparticularly OneDrive, has provided MSTIC sustained visibility into the actor’s activities and\nenabled us to notify impacted customers. As an outcome of these service abuse\ninvestigations, MSTIC partnered with abuse teams in Microsoft to disable accounts used by\nthe actor for reconnaissance, phishing, and email collection. Microsoft Defender\nSmartScreen has also implemented detections against the phishing domains represented in\nSEABORGIUM’s activities.\n\n## Who is SEABORGIUM?\n\nSEABORGIUM is a highly persistent threat actor, frequently targeting the same organizations\nover long periods of time. Once successful, it slowly infiltrates targeted organizations’ social\nnetworks through constant impersonation, rapport building, and phishing to deepen their\nintrusion. SEABORGIUM has successfully compromised organizations and people of interest\nin consistent campaigns for several years, rarely changing methodologies or tactics. Based\non known indicators of compromise and actor tactics, SEABORGIUM overlaps with the\nthreat groups tracked as Callisto Group (F-Secure), TA446 (Proofpoint) and COLDRIVER\n[(Google). Security Service of Ukraine (SSU) has associated Callisto with Gamaredon Group](https://ssu.gov.ua/uploads/files/DKIB/%D0%A2%D0%B5%D1%85%D0%BD%D1%96%D1%87%D0%BD%D0%B8%D0%B9%20%D0%B7%D0%B2%D1%96%D1%82%20%D0%B4%D1%96%D1%8F%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D1%96%20%D0%90%D1%80%D0%BC%D0%B0%D0%B3%D0%B5%D0%B4%D0%BE%D0%BD.pdf)\n(tracked by Microsoft as ACTINIUM); however, MSTIC has not observed technical intrusion\nlinks to support the association.\n\nSince the beginning of 2022, Microsoft has observed SEABORGIUM campaigns targeting\nover 30 organizations, in addition to personal accounts of people of interest. SEABORGIUM\nprimarily targets NATO countries, particularly the US and the UK, with occasional targeting of\nother countries in the Baltics, the Nordics, and Eastern Europe. Such targeting has included\nthe government sector of Ukraine in the months leading up to the invasion by Russia, and\norganizations involved in supporting roles for the war in Ukraine. Despite some targeting of\nthese organizations, Microsoft assesses that Ukraine is likely not a primary focus for this\nactor; however, it is most likely a reactive focus area for the actor and one of many diverse\ntargets.\n\nWithin the target countries, SEABORGIUM primarily focuses operations on defense and\nintelligence consulting companies, non-governmental organizations (NGOs) and\nintergovernmental organizations (IGOs), think tanks, and higher education. SEABORGIUM\nhas a high interest in targeting individuals as well, with 30% of Microsoft’s nation-state\nnotifications related to SEABORGIUM activity being delivered to Microsoft consumer email\naccounts. SEABORGIUM has been observed targeting former intelligence officials, experts\nin Russian affairs, and Russian citizens abroad. As with any observed nation-state actor\nactivity, Microsoft directly notifies customers of Microsoft services that have been targeted or\ncompromised, providing them with the information they need to secure their accounts.\n\n## Observed actor activity\n\n\n-----\n\nOver many years of tracking, Microsoft has observed a consistent methodology from\nSEABORGIUM with only slight deviations in their social engineering approaches and in how\nthey deliver the initial malicious URL to their targets. In this section, we provide detailed\nanalysis of SEABORBIUM’s operational tactics as well as several examples of their\ncampaigns.\n\n### Impersonation and establishing contact\n\nBefore starting a campaign, SEABORGIUM often conducts reconnaissance of target\nindividuals, with a focus on identifying legitimate contacts in the targets’ distant social\nnetwork or sphere of influence. Based on some of the impersonation and targeting observed,\nwe suspect that the threat actor uses social media platforms, personal directories, and\ngeneral open-source intelligence (OSINT) to supplement their reconnaissance efforts.\nMSTIC, in partnership with LinkedIn, has observed fraudulent profiles attributed to\nSEABORGIUM being used sporadically for conducting reconnaissance of employees from\nspecific organizations of interest. In accordance with their policies, LinkedIn terminated any\naccount (including the one shown below) identified as conducting inauthentic or fraudulent\nbehavior.\n\nFigure\n\n1: Example profile used by SEABORGIUM to conduct industry-specific reconnaissance\n\n\n-----\n\nSEABORGIUM also registers new email accounts at various consumer email providers, with\nthe email address or alias configured to match legitimate aliases or names of impersonated\nindividuals. While the creation of new consumer accounts is common, we have also\nobserved SEABORGIUM returning to and reusing historical accounts that match the industry\nof the ultimate target. In one case, we observed SEABORGIUM returning to an account it\nhad not used in a year, indicating potential tracking and reusing of accounts if relevant to\ntargets’ verticals.\n\nAfter registering new accounts, SEABORGIUM proceeds to establish contact with their\ntarget. In cases of personal or consumer targeting, MSTIC has mostly observed the actor\nstarting the conversation with a benign email message, typically exchanging pleasantries\nbefore referencing a non-existent attachment while highlighting a topic of interest to the\ntarget. It’s likely that this additional step helps the actor establish rapport and avoid\nsuspicion, resulting in further interaction. If the target replies, SEABORGIUM proceeds to\nsend a weaponized email.\n\nFigure\n\n2: Example email showing the multi-email approach and rapport building frequently used by\nthe actors.\nMSTIC has also documented several cases where the actor focuses on a more\norganizational approach to phishing. In these cases, the actor uses an authoritative\napproach in their social engineering and typically goes to directly sending malicious content.\n\n\n-----\n\nFigure\n\n3: Example phishing email from 2022 where the actor impersonates the lead of an\norganization and emails select members of the organization with a cybersecurity themed\nlure.\nThese examples serve to demonstrate the actors’ capability to be dynamic and to adapt their\nsocial engineering approach to gain the trust of their victims.\n\n### Delivery of malicious content\n\nMicrosoft has identified several variations in the way that SEABORGIUM delivers a link that\ndirects targets to their credential stealing infrastructure.\n\n**URL in body of email**\n\nIn the simplest case, SEABORGIUM directly adds a URL to the body of their phishing email.\nOccasionally, the actor leverages URL shorteners and open redirects to obfuscate their URL\nfrom the target and inline protection platforms. The email varies between fake personal\ncorrespondence with a hyperlinked text and fake file sharing emails that imitate a range of\nplatforms.\n\n\n-----\n\nFigure\n\n4: Example follow-up email impersonating a OneDrive share. The link embedded takes the\nuser to actor-controlled infrastructure.\n**PDF file attachment that contains a URL**\n\nMSTIC has observed an increase in the use of attachments in SEABORGIUM campaigns.\nThese attachments typically imitate a file or document hosting service, including OneDrive,\nand request the user to open the document by clicking a button.\n\n\n-----\n\nFigure\n\n5: Campaign from 2022 using the war in Ukraine as a ruse. Example of SEABORGIUM\ndirectly attaching a PDF file to the email.\n\nFigure 6: Example PDF\n\nfile used in campaigns. The PDF files appear to be a failed preview, redirecting the users to\nclick a link which takes the user to actor-controlled infrastructure.\n**OneDrive link to PDF file that contains a URL**\n\nSEABORGIUM also abuses OneDrive to host PDF files that contain a link to the malicious\nURL. This activity does not represent any security issues or vulnerabilities on the OneDrive\nplatform. The actors include a OneDrive link in the body of the email that when clicked\ndirects the user to a PDF file hosted within a SEABORGIUM-controlled OneDrive account.\nAs seen in the previous example, the victim is presented with what appears to be a failed\npreview message, enticing the target to click the link to be directed to the credential-stealing\n\n\n-----\n\ninfrastructure. Occasionally, SEABORGIUM makes use of open redirects within the PDF file\nto further disguise their operational infrastructure. In the example below, SEABORGIUM\nuses a Google URL for redirection.\n\nFigure\n\n7: Example document hosted on OneDrive that uses a Google redirect link to send users to\nactor-controlled infrastructure.\n\n### Credential theft\n\nRegardless of the method of delivery, when the target clicks the URL, the target is directed to\nan actor-controlled server hosting a phishing framework, most often EvilGinx. On occasion,\nMicrosoft has observed attempts by the actor to evade automated browsing and detonation\nby fingerprinting browsing behavior. Once the target is redirected to the final page, the\nframework prompts the target for authentication, mirroring the sign-in page for a legitimate\nprovider and intercepting any credentials. After credentials are captured, the target is\nredirected to a website or document to complete the interaction.\n\n\n-----\n\nFigure\n\n8: Example cloned phishing portal used by SEABORGIUM to directly impersonate a victim\norganization.\n\n### Data exfiltration and impact\n\nSEABORGIUM has been observed to use stolen credentials and directly sign in to victim\nemail accounts. Based on our experience responding to intrusions from this actor on behalf\nof our customers, we have confirmed that the following activities are common:\n\n**Exfiltration of intelligence data: SEABORGIUM has been observed exfiltrating**\nemails and attachments from the inbox of victims.\n**Setup of persistent data collection: In limited cases, SEABORGIUM has been**\nobserved setting up forwarding rules from victim inboxes to actor-controlled dead drop\naccounts where the actor has long-term access to collected data. On more than one\noccasion, we have observed that the actors were able to access mailing-list data for\nsensitive groups, such as those frequented by former intelligence officials, and\nmaintain a collection of information from the mailing-list for follow-on targeting and\nexfiltration.\n\n\n-----\n\n**Access to people of interest: There have been several cases where SEABORGIUM**\nhas been observed using their impersonation accounts to facilitate dialog with specific\npeople of interest and, as a result, were included in conversations, sometimes\nunwittingly, involving multiple parties. The nature of the conversations identified during\ninvestigations by Microsoft demonstrates potentially sensitive information being shared\nthat could provide intelligence value.\n\nBased on the specific victimology, documents stolen, conversations fostered, and sustained\ncollection observed, we assess that espionage is likely a key motivation of the actor.\n\n### Sporadic involvement with information operations\n\nIn May 2021, MSTIC attributed an information operation to SEABORGIUM based on\nobservations and technical overlaps with known phishing campaigns. The operation involved\ndocuments allegedly stolen from a political organization in the UK that were uploaded to a\npublic PDF file-sharing site. The documents were later amplified on social media via known\nSEABORGIUM accounts, however MSTIC observed minimal engagement or further\namplification. Microsoft was unable to validate the authenticity of the material.\n\nIn late May 2022, Reuters along with Google TAG [disclosed details about an information](https://www.reuters.com/technology/exclusive-russian-hackers-are-linked-new-brexit-leak-website-google-says-2022-05-25/)\noperation, specifically using hack and leak, that they attributed to\nCOLDRIVER/SEABORGIUM. Microsoft independently linked SEABORGIUM to the\ncampaign through technical indicators and agrees with the assessment by TAG on the actor\nresponsible for the operation. In the said operation, the actors leaked emails/documents from\n2018 to 2022, allegedly stolen from consumer Protonmail accounts belonging to high-level\nproponents of Brexit, to build a narrative that the participants were planning a coup. The\nnarrative was amplified using social media and through specific politically themed media\nsources that garnered quite a bit of reach.\n\nWhile we have only observed two cases of direct involvement, MSTIC is not able to rule out\nthat SEABORGIUM’s intrusion operations have yielded data used through other information\noutlets. As with any information operation, Microsoft urges caution in distributing or\namplifying direct narratives, and urges readers to be critical that the malicious actors could\nhave intentionally inserted misinformation or disinformation to assist their narrative. With this\nin mind, Microsoft will not be releasing the specific domain or content to avoid amplification.\n\n## Recommended customer actions\n\nThe techniques used by the actor and described in the “Observed actor activity” section can\nbe mitigated by adopting the security considerations provided below:\n\nCheck your Office 365 email filtering settings to ensure you block spoofed emails,\nspam, and emails with malware.\n[Configure Office 365 to disable email auto-forwarding](https://docs.microsoft.com/microsoft-365/security/office-365-security/external-email-forwarding?view=o365-worldwide)\n\n\n-----\n\nUse the included indicators of compromise to investigate whether they exist in your\nenvironment and assess for potential intrusion.\nReview all authentication activity for remote access infrastructure, with a particular\nfocus on accounts configured with single factor authentication, to confirm authenticity\nand investigate any anomalous activity.\nRequire multifactor authentication (MFA) for all users coming from all locations\nincluding perceived trusted environments, and all internet-facing infrastructure–even\nthose coming from on-premises systems.\nLeverage more secure implementations such as FIDO Tokens, or Microsoft\nAuthenticator with number matching. Avoid telephony-based MFA methods to avoid\nrisks associated with SIM-jacking.\n\nFor Microsoft Defender for Office 365 Customers:\n\nUse [Microsoft Defender for Office 365 for enhanced phishing protection and coverage](https://docs.microsoft.com/microsoft-365/security/office-365-security/office-365-atp?view=o365-worldwide)\nagainst new threats and polymorphic variants.\n[Enable Zero-hour auto purge (ZAP) in Office 365 to quarantine sent mail in response to](https://docs.microsoft.com/microsoft-365/security/office-365-security/zero-hour-auto-purge)\nnewly acquired threat intelligence and retroactively neutralize malicious phishing,\nspam, or malware messages that have already been delivered to mailboxes.\n[Configure Defender for Office 365 to recheck links on click. Safe Links provides URL](https://docs.microsoft.com/office365/securitycompliance/atp-safe-links)\nscanning and rewriting of inbound email messages in mail flow, and time-of-click\nverification of URLs and links in email messages, other Office applications such as\nTeams, and other locations such as SharePoint Online. Safe Links scanning occurs in\n[addition to the regular anti-spam and anti-malware protection in inbound email](https://docs.microsoft.com/microsoft-365/security/office-365-security/anti-spam-and-anti-malware-protection?view=o365-worldwide)\nmessages in Exchange Online Protection (EOP). Safe Links scanning can help protect\nyour organization from malicious links that are used in phishing and other attacks.\nUse the [Attack Simulator in Microsoft Defender for Office 365 to run realistic, yet safe,](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/attack-simulator?view=o365-worldwide)\nsimulated phishing and password attack campaigns within your organization. Run\nspear-phishing (credential harvest) simulations to train end-users against clicking URLs\nin unsolicited messages and disclosing their credentials.\n\n## Indicators of compromise (IOCs)\n\nThe below list provides IOCs observed during our investigation. We encourage our\ncustomers to investigate these indicators in their environments and implement detections\nand protections to identify past related activity and prevent future attacks against their\nsystems.\n\n**Indicator** **Type** **Confidence** **Public References (if**\n**Applicable)**\n\n\ncache-dns[.]com Domain\nname\n\n\nHigh [Google TAG,](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/) [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\n\n-----\n\ncache-dnsforwarding[.]com\n\n\nDomain\nname\n\n\ncache-dns-preview[.]com Domain\nname\n\ncache-docs[.]com Domain\nname\n\ncache-pdf[.]com Domain\nname\n\ncache-pdf[.]online Domain\nname\n\ncache-services[.]live Domain\nname\n\ncloud-docs[.]com Domain\nname\n\ncloud-drive[.]live Domain\nname\n\ncloud-storage[.]live Domain\nname\n\ndocs-cache[.]com Domain\nname\n\ndocs-forwarding[.]online Domain\nname\n\ndocs-info[.]com Domain\nname\n\ndocs-shared[.]com Domain\nname\n\ndocs-shared[.]online Domain\nname\n\ndocs-view[.]online Domain\nname\n\n\ndocumentforwarding[.]com\n\n\nDomain\nname\n\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Google TAG,](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/) [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh\n\nHigh\n\nHigh\n\n\ndocument-online[.]live Domain\nname\n\n\n-----\n\ndocument-preview[.]com Domain\nname\n\ndocuments-cloud[.]com Domain\nname\n\ndocuments-cloud[.]online Domain\nname\n\n\ndocumentsforwarding[.]com\n\n\nDomain\nname\n\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Google TAG](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/)\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Google TAG](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/)\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Google TAG,](https://blog.google/threat-analysis-group/tracking-cyber-activity-eastern-europe/) [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh\n\nHigh\n\n\ndocument-share[.]live Domain\nname\n\ndocuments-online[.]live Domain\nname\n\ndocuments-pdf[.]online Domain\nname\n\ndocuments-preview[.]com Domain\nname\n\ndocuments-view[.]live Domain\nname\n\ndocument-view[.]live Domain\nname\n\ndrive-docs[.]com Domain\nname\n\ndrive-share[.]live Domain\nname\n\ngoo-link[.]online Domain\nname\n\nhypertextteches[.]com Domain\nname\n\nmail-docs[.]online Domain\nname\n\nofficeonline365[.]live Domain\nname\n\nonline365-office[.]com Domain\nname\n\n\n-----\n\nonline-document[.]live Domain\nname\n\nonline-storage[.]live Domain\nname\n\npdf-cache[.]com Domain\nname\n\npdf-cache[.]online Domain\nname\n\npdf-docs[.]online Domain\nname\n\npdf-forwarding[.]online Domain\nname\n\nprotection-checklinks[.]xyz Domain\nname\n\nprotection-link[.]online Domain\nname\n\nprotectionmail[.]online Domain\nname\n\nprotection-office[.]live Domain\nname\n\nprotect-link[.]online Domain\nname\n\nproton-docs[.]com Domain\nname\n\nproton-reader[.]com Domain\nname\n\nproton-viewer[.]com Domain\nname\n\nrelogin-dashboard[.]online Domain\nname\n\nsafe-connection[.]online Domain\nname\n\nsafelinks-protect[.]live Domain\nname\n\n\nHigh\n\nHigh\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh\n\nHigh\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Google TAG,](https://blog.google/threat-analysis-group/tracking-cyber-activity-eastern-europe/) [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Google TAG,](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/) [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh [Google TAG,](https://blog.google/threat-analysis-group/tracking-cyber-activity-eastern-europe/) [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nHigh\n\nHigh\n\nHigh\n\n\n-----\n\nsecureoffice[.]live Domain\nname\n\nwebresources[.]live Domain\nname\n\nword-yand[.]live Domain\nname\n\nyandx-online[.]cloud Domain\nname\n\ny-ml[.]co Domain\nname\n\ndocs-drive[.]online Domain\nname\n\ndocs-info[.]online Domain\nname\n\ncloud-mail[.]online Domain\nname\n\nonlinecloud365[.]live Domain\nname\n\npdf-cloud[.]online Domain\nname\n\npdf-shared[.]online Domain\nname\n\nproton-pdf[.]online Domain\nname\n\nproton-view[.]online Domain\nname\n\noffice365-online[.]live Domain\nname\n\ndoc-viewer[.]com Domain\nname\n\nfile-milgov[.]systems Domain\nname\n\noffice-protection[.]online Domain\nname\n\n\nHigh\n\nHigh [Google TAG](https://blog.google/threat-analysis-group/update-on-cyber-activity-in-eastern-europe/)\n\nHigh\n\nHigh\n\nHigh\n\nModerate [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nModerate\n\nModerate\n\nModerate\n\nModerate [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nModerate [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nModerate\n\nModerate [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nLow\n\nLow\n\nLow [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\nLow [Sekoia.io](https://blog.sekoia.io/calisto-continues-its-credential-harvesting-campaign/)\n\n\n**NOTE: These indicators should not be considered exhaustive for this observed activity.**\n\n\n-----\n\n## Detections\n\nIntelligence gathered by the Microsoft Threat Intelligence Center (MSTIC) is used within\nMicrosoft security products to provide protection against associated actor activity.\n\n### Microsoft Defender for Office 365\n\nMicrosoft Defender for Office offers enhanced solutions for blocking and identifying malicious\nemails. Signals from Microsoft Defender for Office inform Microsoft 365 Defender, which\ncorrelate cross-domain threat intelligence to deliver coordinated defense, when this threat\nhas been detected. These alerts, however, can be triggered by unrelated threat activity.\nExample alerts:\n\nA potentially malicious URL click was detected\nEmail messages containing malicious URL removed after delivery\nEmail messages removed after delivery\nEmail reported by user as malware or phish\n\n### Microsoft 365 Defender\n\nAside from the Microsoft Defender for Office 365 alerts above, customers can also monitor\nfor the following Microsoft 365 Defender alerts for this attack. Note that these alerts can also\nbe triggered by unrelated threat activity. Example alerts:\n\nSuspicious URL clicked\nSuspicious URL opened in web browser\nUser accessed link in ZAP-quarantined email\n\nMicrosoft 365 Defender customers should also investigate any “Stolen session cookie was\n**used” alerts that would betriggered for adversary-in-the-middle (AiTM) attacks.**\n\n### Microsoft Defender SmartScreen\n\nMicrosoft Defender SmartScreen has implemented detections against the phishing domains\nrepresented in the IOC section above.\n\n## Advanced hunting queries\n\n### Microsoft Sentinel\n\nMicrosoft Sentinel customers can run the following advanced hunting queries to locate IOCs\nand related malicious activity in their environments.\n\nThe query below identifies matches based on domain IOCs related to SEABORGIUM actor\nacross a range of common Microsoft Sentinel data sets:\n\n\n-----\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Detections/MultipleDataSources/SEABORGIUMDomainsAugust2022.y](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/SEABORGIUMDomainsAugust2022.yaml)\naml\n\n### Microsoft 365 Defender\n\nMicrosoft 365 Defender customers can run the following advanced hunting queries to locate\nIOCs and related malicious activity in their environments.\n\nThis query identifies matches based on domain IOCs related to SEABORGIUM against\nMicrosoft Defender for Endpoint device network connections\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/SEAB](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/SEABORGIUMDomainIOCsAug2022.yaml)\nORGIUMDomainIOCsAug2022.yaml\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-15 - Disrupting SEABORGIUM’s ongoing phishing operations.pdf"
    ],
    "report_names": [
        "2022-08-15 - Disrupting SEABORGIUM’s ongoing phishing operations.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5dae3c71-8be1-4591-a2fb-b851ea6f083d",
            "created_at": "2022-10-25T16:07:23.432642Z",
            "updated_at": "2025-03-27T02:02:09.798919Z",
            "deleted_at": null,
            "main_name": "Callisto Group",
            "aliases": [],
            "source_name": "ETDA:Callisto Group",
            "tools": [
                "RCS Galileo"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2d06d270-acfd-4db8-83a8-4ff68b9b1ada",
            "created_at": "2022-10-25T16:07:23.477794Z",
            "updated_at": "2025-03-27T02:02:09.824281Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Blue Callisto",
                "BlueCharlie",
                "Calisto",
                "Cobalt Edgewater",
                "Nahr Elbard",
                "Nahr el bared",
                "Seaborgium",
                "Star Blizzard",
                "TA446",
                "TAG-53",
                "UNC4057"
            ],
            "source_name": "ETDA:Cold River",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "DNSpionage",
                "SPICA"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "79bd28a6-dc10-419b-bee7-25511ae9d3d4",
            "created_at": "2023-01-06T13:46:38.581534Z",
            "updated_at": "2025-03-27T02:00:02.865836Z",
            "deleted_at": null,
            "main_name": "Callisto",
            "aliases": [
                "GOSSAMER BEAR",
                "BlueCharlie",
                "Star Blizzard",
                "TAG-53",
                "UNC4057",
                "COLDRIVER",
                "TA446",
                "IRON FRONTIER",
                "Blue Callisto",
                "SEABORGIUM"
            ],
            "source_name": "MISPGALAXY:Callisto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a057a97-db21-4261-804b-4b071a03c124",
            "created_at": "2024-06-04T02:03:07.953282Z",
            "updated_at": "2025-03-27T02:05:17.406598Z",
            "deleted_at": null,
            "main_name": "IRON FRONTIER",
            "aliases": [
                "BlueCharlie ",
                "CALISTO ",
                "COLDRIVER ",
                "Callisto Group ",
                "Gossamer Bear ",
                "Gossamer Bear ",
                "SEABORGIUM ",
                "Star Blizzard ",
                "TA446 ",
                "Blue Callisto "
            ],
            "source_name": "Secureworks:IRON FRONTIER",
            "tools": [
                " Galileo RCS",
                " SPICA",
                "Evilginx2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3aedca2f-6f6c-4470-af26-a46097d3eab5",
            "created_at": "2024-11-01T02:00:52.689773Z",
            "updated_at": "2025-03-27T02:00:55.508065Z",
            "deleted_at": null,
            "main_name": "Star Blizzard",
            "aliases": [
                "Star Blizzard",
                "SEABORGIUM",
                "Callisto Group",
                "TA446",
                "COLDRIVER"
            ],
            "source_name": "MITRE:Star Blizzard",
            "tools": [
                "Spica"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535650,
    "ts_updated_at": 1743041782,
    "ts_creation_date": 1662027035,
    "ts_modification_date": 1662027035,
    "files": {
        "pdf": "https://archive.orkl.eu/f713f1bd000011bf9b94d45422d3af997c36c790.pdf",
        "text": "https://archive.orkl.eu/f713f1bd000011bf9b94d45422d3af997c36c790.txt",
        "img": "https://archive.orkl.eu/f713f1bd000011bf9b94d45422d3af997c36c790.jpg"
    }
}