{
    "id": "11cdba04-8c29-43cf-ab68-5bb143690422",
    "created_at": "2023-01-12T15:10:51.026847Z",
    "updated_at": "2025-03-27T02:05:38.450106Z",
    "deleted_at": null,
    "sha1_hash": "24d17409f28f7d3fdcfd04a38dc36ce7901fe6f9",
    "title": "2020-12-18 - SUNBURST indicator detection in QRadar",
    "authors": "",
    "file_creation_date": "2022-05-28T04:04:40Z",
    "file_modification_date": "2022-05-28T04:04:40Z",
    "file_size": 1407306,
    "plain_text": "# SUNBURST indicator detection in QRadar\n\n**[community.ibm.com/community/user/security/blogs/gladys-koskas1/2020/12/18/sunburst-indicator-detection-in-qradar](https://community.ibm.com/community/user/security/blogs/gladys-koskas1/2020/12/18/sunburst-indicator-detection-in-qradar)**\n\nBack to Blog List\n\n**By** **[Gladys Koskas posted Sat December 19, 2020 12:25 PM](https://community.ibm.com/community/user/security/people/gladys-koskas1)**\n\n_Estimated reading time: 6 minutes_\n\n\n4 Like\n\n\n[This week, and based on current information as of the time of publication, SolarWinds announced a cyberattack that inserted a vulnerability](https://www.solarwinds.com/securityadvisory)\ninto the SolarWinds Orion Platform software builds for versions 2019.4 HF 5, 2020.2 with no hotfix installed, and 2020.2 HF 1. This® ®\nvulnerability could enable an attacker to compromise the server(s) on which SolarWinds runs, and thus gain a foothold in the victim’s network.\nPost compromise, the attacker can conduct lateral movement, data exfiltration and other threat activity.\n\n[The United States Cybersecurity and Infrastructure Security Agency (CISA) has published Emergency Directive 21-101, advising Federal](https://cyber.dhs.gov/ed/21-01/)\nagencies to disconnect or power down all SolarWinds Orion products until further notice.\n\nAs with the ['FireEye Red Team Tools detection in QRadar’ blog, in this blog we’ll provide guidance that can help you use QRadar to respond](https://community.ibm.com/community/user/security/blogs/gladys-koskas1/2020/12/10/fireeye-red-team-tools-detection-in-qradar?CommunityKey=f9ea5420-0984-4345-ba7a-d93b4e2d4864&tab=recentcommunityblogsdashboard)\nquickly.\n\nThis blog will cover the following topics and content extensions:\n\nThreat Intelligence\nSnort Rules\n\n[IBM Security QRadar Custom Properties for Snort](https://exchange.xforce.ibmcloud.com/hub/extension/b98a9deaac6b7a4e32a54b68a7f9da5d)\nMD5, SHA-1 and SHA-256\nPipe creation and Sysmon\n\n[IBM QRadar Custom Properties for Microsoft Windows](https://exchange.xforce.ibmcloud.com/hub/extension/IBMQRadar:MicrosoftWindowsCustomProperties)\nEndpoint content extension\n\n[IBM QRadar Endpoint Content Extension](https://exchange.xforce.ibmcloud.com/hub/extension/98a27a306371909e1d96ef903676cbb2)\n[IBM QRadar Custom Properties for Microsoft Windows](https://exchange.xforce.ibmcloud.com/hub/extension/IBMQRadar:MicrosoftWindowsCustomProperties)\n[IBM QRadar Custom Properties for Linux](https://exchange.xforce.ibmcloud.com/hub/extension/427f5d543cb917916619e6abafc26404)\nThreat Monitoring Content Extension\n\n[IBM QRadar Security Threat Monitoring Content Extension](https://exchange.xforce.ibmcloud.com/hub/extension/IBMQRadar:IBMContentPackageInternalThreat)\n\n## Threat Intelligence\n\n[IBM Security X-Force researchers published a collection of IOCs, including malicious file hashes, IP addresses and URLs, connected to this](https://exchange.xforce.ibmcloud.com/collection/DHS-Issues-SolarWinds-Orion-Code-Compromise-Emergency-Directive-48eef2fb4d7e308f0676837b818b5694)\n[on-going threat. These IOCs can easily be brought into QRadar using the Threat Intelligence App, which can be downloaded either from IBM](https://exchange.xforce.ibmcloud.com/hub/extension/IBMQRadar:ThreatIntelligence)\nSecurity App Exchange or natively via the [QRadar Assistant. Threat indicators can be added to a reference set so that they can be used](https://exchange.xforce.ibmcloud.com/hub/extension/ed8aee4440f98f9c8bedaff4c5c644de)\nwithin building blocks, rules and searches to detect the presence of these IOCs within your environment. Public X-Force Collections, including\nthis one, are free to existing QRadar customers.\n\n[QRadar customers who also subscribe to the IBM Security X-Force Advanced Threat Protection Feed have access to a built-in “Am I](https://www.ibm.com/products/xforce-exchange/details)\nAffected?” featured with the Threat Intelligence app. This tool can be used in tandem with other forms of threat intelligence that may become\navailable in this developing situation to help assess known IOCs. With this subscription, new X-Force collections are loaded directly into\nQRadar, and users can simply click ‘Scan now’ to automatically search for all IOCs associated with a collection. The query results will show\nyou which systems and users may have been connected to this threat, assisting you to initiate investigation, remediation and response.\n\n\n-----\n\n[If you do not currently subscribe to the Advanced Threat Protection Feed, a 30-day free trial is available.](https://www.ibm.com/account/reg/us-en/signup?formid=urx-40692)\n\n## Snort Rules\n\nOnce again, FireEye and Cisco Talos teams provided a new set of Snort rules to implement. QRadar users can easily create a new rule based\non these signatures, correlate these insights with other events, or optionally be alerted directly via email. The steps to implement this are:\n\n1. Install the [IBM Security QRadar Custom Properties for Snort content extension](https://exchange.xforce.ibmcloud.com/hub/extension/b98a9deaac6b7a4e32a54b68a7f9da5d)\n2. Create a new Event rule\n\nApply Sunburst - Snort Rules on events which are detected by the Local system\n\nand when the event(s) were detected by one or more of Snort Open Source IDS\n\nand when the event matches \"Rule ID\" in\n**(77600832,77600833,77600842,77600843,77600844,77600845,77600846,77600847,77600848,77600850,77600851,77600852,77600853,77600**\n**77600840,77600863,77600864,77600865,77600837,77600856,77600857,77600858,77600859,77600860,77600866,56660,56661,56662,56663,**\n**AQL filter query**\n\n## MD5, SHA-1 and SHA-256\n\nWe talked about it, file hashes are a great source to improve threat detection. Once again, you can have a quick implementation by enabling\ndetection with MD5, SHA-1 and SHA-256 through three reference sets and one custom rule.\n\n\n-----\n\nC eate t ee e e e ce Sets, o e pe as type, a d popu ate t e t [t e Su bu st_](https://higherlogicdownload.s3.amazonaws.com/IMWUC/UploadedImages/c9bd8668-d409-43ad-b26f-38a261105238/Sunburst_md5) [d5, Su bu st_s a, Su bu st_s a 56](https://higherlogicdownload.s3.amazonaws.com/IMWUC/UploadedImages/c9bd8668-d409-43ad-b26f-38a261105238/Sunburst_sha1) es\n(comma separated).\n\n2. Install content extensions containing Hash properties or create your own.\n\nOn the App Exchange, you can find MD5, SHA-1 and SHA-256 parsed for the following devices:\n[Carbon Black Response,](https://exchange.xforce.ibmcloud.com/hub/extension/79449a113bd330507270f9664661d98d) [Cisco AMP,](https://exchange.xforce.ibmcloud.com/hub/extension/8f8e1caf1b9decd70542ef741d7d6818) [McAfee ePolicy Orchestrator,](https://exchange.xforce.ibmcloud.com/hub/extension/efb43ce66be214dfee8c549c1e8e8e57) [Microsoft Windows Defender ATP,](https://exchange.xforce.ibmcloud.com/hub/extension/c8e594fa5d744dcb23859a8fb060bc9d) Microsoft Windows Security\nEvent Log\n3. Create a rule that tests the Custom Properties MD5 Hash, Parent MD5, SHA1 Hash, Parent SHA1 Hash, SHA256 Hash, Parent SHA256\n\n_Hash against the new Reference Sets._\n\nApply Sunburst - Tools Hash on events which are detected by the Local system\nand when the event(s) were detected by one or more of Carbon Black Response, Cisco AMP, McAfee ePolicy Orchestrator,\n**Microsoft Windows Defender ATP, Microsoft Windows Security Event Log**\nand when the event matches (\"MD5 Hash\" IS NOT NULL AND REFERENCESETCONTAINS('Sunburst - MD5', \"MD5 Hash\")) OR\n**(\"Parent MD5\" IS NOT NULL AND REFERENCESETCONTAINS('Sunburst - MD5', \"Parent MD5\")) OR (\"SHA1 Hash\" IS NOT**\n**NULL AND REFERENCESETCONTAINS('Sunburst - SHA1', \"SHA1 Hash\")) OR (\"Parent SHA1 Hash\" IS NOT NULL AND**\n**REFERENCESETCONTAINS('Sunburst - MD5', \"Parent SHA1 Hash\")) OR (\"SHA256 Hash\" IS NOT NULL AND**\n**REFERENCESETCONTAINS('Sunburst - SHA256', \"SHA256 Hash\")) OR (\"Parent SHA256 Hash\" IS NOT NULL AND**\n**REFERENCESETCONTAINS('Sunburst - SHA256', \"Parent SHA256 Hash\")) AQL filter query**\n\n## Pipe creation and Sysmon\n\nIn the blog published by FireEye regarding SUNBURST, there is a mention about the creation of a pipe named 583da945-62af-10e8-4902_a8f205c72b2e as one of the “delivery and installation” mechanism:_\n\n\n-----\n\nSource: [Highly Evasive Attacker Leverages SolarWinds Supply Chain to Compromise Multiple Global Victims With SUNBURST Backdoor](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html)\n\nIf you are collecting Sysmon logs, you have another opportunity for a quick way to detect another IOC.\n\n[1. Download the IBM QRadar Custom Properties for Microsoft Windows content extension](https://exchange.xforce.ibmcloud.com/hub/extension/IBMQRadar:MicrosoftWindowsCustomProperties)\n2. Create a rule that detects the pipe name mentioned in the blog\n\nApply Sunburst - Pipe Name on events which are detected by the Local system\nand when the event(s) were detected by one or more of Microsoft Windows Security Event Log\nand when the event QID is one of the following (5001836) PipeEvent (Pipe Created)\nand when the event matches PipeName (custom) is any of 583da945-62af-10e8-4902-a8f205c72b2e\n\n## Endpoint content extension\n\nThis time I will be quick with this one, but I wanted to renew my recommendation to download the latest version of the Endpoint content pack.\n\nThe pack has been built to detect lateral movement, reconnaissance tools, help to make the difference between a legitimate administration\ntask from a suspicious one... All these behaviour have been mentioned in all the blogs you’ve read on the topic so far.\n\nBelow is the list of the rules (excluding building blocks) present in the Endpoint content extension\n\nAttempt to Delete Shadow Copies Ransomware IOCs Detected on Multiple Machines\n\nCobalt Strike Behaviour Detected Ransomware: BadRabbit IOC in Events\n\nCommunication with a Potential Hostile Host Ransomware: BadRabbit IOC in Flows\n\nCommunication with a Potential Hostile IP Address Ransomware: Maze IOC in Events\n\nCredential Dumping Activities Discovered Ransomware: Maze Suspicious File Transfer\n\nCritical File Deleted (Unix) Ransomware: Petya / NotPetya IOC in Events\n\nCritical File Permission Changed (Unix) Ransomware: Petya / NotPetya IOC in Flows\n\nCritical Security Tool Killed (Unix) Ransomware: Petya / NotPetya Payload in Flows\n\nCritical Security Tool Stopped Ransomware: REvil IOC in Events\n\nDetection of Malicious File or Process Ransomware: WCry IOC in Events\n\nDetection of Malicious IOC Ransomware: WCry IOC in Flows\n\n\nExcessive Failed Access to an Administrative Share from the Same\nSource\n\n\nRansomware: WCry Payload in Flows\n\n\nExcessive File Deletion and Creation RDP Hijacking Tool Detected\n\nExcessive Login Failures via RDP Recommended Blocked Process is Running\n\nExcessive Login Failures via RDP to Multiple Machines Reconnaissance Tool Detected\n\nExcessive Nslookup Usage Recovery Disabled in Boot Configuration Data\n\nFile Created with Right to Left Override Search for Password Files using findstr (Windows)\n\nFile Created with Space After Filename Search for Password Files using grep or find (Unix)\n\nFile Decode or Download followed by Suspicious Activity Search for Password Files using Select-String (Windows)\n\nPotential Component Object Model (COM) Hijacking SharpHound PowerShell Detected\n\nPotential DLL Hijacking Suspicious Activity Followed by Endpoint Administration Task\n\nPotential Malicious Application Shimming Suspicious Amount of Files Deleted on the Same Machine\n\n\n-----\n\nProcess Masquerading (Unix) Suspicious Amount of Files Renamed on the Same Machine\n(Windows)\n\nProcess Masquerading (Windows) Suspicious Amount of Files Renamed/Moved on the Same Machine\n(Unix)\n\nProgramming Environment Spawned by a Suspicious Process User Account Creation followed by Account Deletion (Unix)\n\nRansomware Decryption Instructions Created User Account Creation followed by Account Deletion (Windows)\n\nRansomware Encrypted File Extension\n\nAll these rules provide a wide spectrum of detection capabilities\n\nPlease refer to the documentation for more information on each rule. You can also refer to the [Endpoint dedicated blog to have a better](https://community.ibm.com/community/user/security/blogs/gladys-koskas1/2020/10/27/endpoint-monitoring-essentials-for-qradar?CommunityKey=f9ea5420-0984-4345-ba7a-d93b4e2d4864&tab=recentcommunityblogsdashboard)\nunderstanding of the implementation of some use cases.\n\n## Threat Monitoring Content Extension\n\nThe multi-task pack ! This pack is mentioned last in this blog because it is certainly going to need some tuning to be adapted to what you are\nlooking for, but it is definitely a good help to know where to go.\n\nAs an example, thanks to your endpoint security software, you can increase the visibility on a threat spreading through the network. Indeed,\nthis extension contains a series of rules alerting on security software.\n\n\n-----\n\nAll you have to do is to:\n\n1. Ensure your device is listed in one of BB:DeviceDefinition: AV/AM or BB:DeviceDefinition: IDS / IPS Building blocks\n2. Get the Threat Name parsed either by downloading one of our content extension, or creating your own extraction.\n\nYou can decide to duplicate the rules to focus the detection on SUNBURST specifically, and have a higher priority rule response (email, SNMP\ntrap, vulnerability scan). Simply add a new filter to the original rule, catching the specific Threat Name reported by your product:\n\nand when the event matches Threat Name (custom) is any of Backdoor.Sunburst\n\nPlease refer to your product documentation to get more information on the relevant detection name\n\n## Conclusion\n\nThe above steps can enable you to easily take advantage of the publicly available IOCs and Countermeasures to detect indicators of the\nSUNBURST threat within your environment. All of the QRadar apps, custom properties and content extensions mentioned above are available\nfree of charge to all QRadar customers and can be downloaded either from the IBM Security App Exchange or natively via QRadar Assistant.\n\nAs usual, we build content for you, to save you time and effort, a content that you can use as a base and adapt to your environment and your\nneeds. Don't hesitate to give us any feedback or ideas, tell us what you need.\n\nIf you are directly impacted and in need of expert assistance, you can contact the IBM Security X-Force Incident Response team, who is\navailable to assist 24×7, at US hotline 1-888-241-9812 | Global hotline (+001) 312-212-8034.\n\n[#QRadar](https://community.ibm.com/community/user/search?s=tags%3A%22QRadar%22&executesearch=true)\n\n[#Featured-area-2 #Highlights-home](https://community.ibm.com/community/user/search?s=tags%3A%22Featured-area-2%22&executesearch=true)\n\n\n-----\n\n# g g ts\n[#Spotlight](https://community.ibm.com/community/user/search?s=tags%3A%22Spotlight%22&executesearch=true)\n\n0 comments\n\n9050 views\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-18 - SUNBURST indicator detection in QRadar.pdf"
    ],
    "report_names": [
        "2020-12-18 - SUNBURST indicator detection in QRadar.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536251,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653710680,
    "ts_modification_date": 1653710680,
    "files": {
        "pdf": "https://archive.orkl.eu/24d17409f28f7d3fdcfd04a38dc36ce7901fe6f9.pdf",
        "text": "https://archive.orkl.eu/24d17409f28f7d3fdcfd04a38dc36ce7901fe6f9.txt",
        "img": "https://archive.orkl.eu/24d17409f28f7d3fdcfd04a38dc36ce7901fe6f9.jpg"
    }
}