{
    "id": "121bf5f6-df3d-415a-bbb2-7c503aa17d23",
    "created_at": "2023-01-12T15:06:19.857772Z",
    "updated_at": "2025-03-27T02:08:41.279358Z",
    "deleted_at": null,
    "sha1_hash": "f5b9c0c2faa09f480319b18493dc4830d0a30ccd",
    "title": "2021-12-23 - Hacker gains access to Hewlett-Packard 9000 EPYC server hardware to mine the cryptocurrency Raptoreum using Java exploit",
    "authors": "",
    "file_creation_date": "2022-05-28T16:07:49Z",
    "file_modification_date": "2022-05-28T16:07:49Z",
    "file_size": 143819,
    "plain_text": "# Hacker gains access to Hewlett-Packard 9000 EPYC server hardware to mine the cryptocurrency Raptoreum using Java exploit\n\n**einnews.com/pr_news/558959060/hacker-gains-access-to-hewlett-packard-9000-epyc-server-hardware-to-mine-the-**\ncryptocurrency-raptoreum-using-java-exploit\n\nPaul Mills December 23, 2021\n\n_Hacker gains access to Hewlett-Packard 9000 EPYC server hardware to mine the_\n_cryptocurrency Raptoreum using a Java exploit known as Log4J_\n\n[LONDON, UNITED KINGDOM, December 23, 2021 /EINPresswire.com/ -- A hacker gained](http://www.einpresswire.com/)\naccess to Hewlett-Packard 9000 EPYC server hardware to mine the cryptocurrency\n[Raptoreum using Java exploit Log4J. Log4j is a vulnerability in Java that permits remote](https://raptoreum.com/)\ncode execution, giving attackers authority to run programs within the host computer they\nhave entered. Although the Java exploit has now been mostly patched, administrators who\nfail to update their servers will continue to be at risk. The exploit gained its notoriety from use\nin Minecraft servers, where it can completely control a computer with just a short string of\ntext in the chat. Microsoft has also recently claimed that state-funded hackers from China,\nTurkey, Iran, and North Korea have been deploying a variety of malware in order to mine\ncryptocurrencies and gain access to valuable information. Vendors such as Cisco, VMWare,\nAmazon, IBM, Fortinet, Microsoft, Splunk, Sophos, Red Hat and some of the other largest\nenterprise technology providers in the world have claimed attacks.\n\nOn December 9 2021, a lead developer of Raptoreum noticed abnormalities in the network\nhash rate and detected this inconsistency through the use of the Raptoreum Blockchain, a\npublicly available digital ledger that documents all transactions being made through the\nnetwork. He states :\n\n\"Raptoreum’s total network hash rate had increased over the past few weeks, but out of\nnowhere, it increased from 200 MH/S to 400MH/S with a single address contributing an\nadditional 100 - 200MH/S to the Raptoreum network. During the attack, many servers were\nbreached, each outputting a significant amount of hash power on very high-end server\nequipment. Very few organizations in the world have their hands on this kind of hardware,\nmaking it extremely unlikely that the attack was done using the individual’s own hardware.\n\n\n-----\n\nThrough a private investigation, there is now strong evidence that suggests Hewlett-Packard\n9000 EPYC server hardware was being used to mine Raptoreum coins. We discovered that\nthe miners they were using were all given HP nicknames and were all stopped abruptly\nwhich fortifies speculation of a company breach, followed by a patch of the servers. The\nLog4J Raptoreum mining exploit started December 9th until it mostly ended on December\n17th. During this period hackers were able to collect approximately 30% of the total block\n[reward which is roughly 3.4 million Raptoreum RTM, worth around $110,000 USD as of](https://coinmarketcap.com/currencies/raptoreum/)\n12/21/2021. Although activity has dropped considerably, it is actively mining to this day on\nwhat still looks to be a single premium machine which has failed to patch.\"\n\nSources show that roughly 1.5 million of the mined Raptoreum coins have been sold on the\nCoinEx cryptocurrency exchange to date, while 1.7 million RTM currently remain in a wallet.\nWith a 40% increase in value during the exploit, it appears that the dumping of the coins had\nlittle negative effect in the short term for the project. Distributed networks such as\nRaptoreum, secured through mining, node integrity, and free market perseverance, are able\nto resist individuals with a plethora of stolen server equipment. Other coins might not be so\nlucky depending on the spirit of their communities and the depth of their market volume.\n\nThe Raptoreum project states that it is an ASIC/FPGA resistant Proof Of Work/Proof of Stake\nhybrid Cryptocurrency with 51% double spend attack resistance and is taking Ethereum\nhead on with aims to solve many of its pitfalls. Due to the way the Raptoreum based\n'Ghostrider' algorithm works, it favours heavily on the hashing power of everyday CPU's with\na preference towards the AMD Ryzen brand due to its large on board L3 cache. It was\npreviously reported that world wide demand for mining the RTM coin created a temporary\nshortage in the availability of powerful Ryzen processors driving prices to levels unseen and\noutraging gamers around the world who rely on powerful processors for smooth gameplay.\n\nAs more powerful processors are due to be released from manufacturers such as AMD with\nits [Threadripper 5000 series slated for release in March 2022, competition for mining the](https://www.notebookcheck.net/Tentative-AMD-Ryzen-Threadripper-5000-series-launch-date-outed-by-new-leak.588084.0.html)\nRaptoreum cryptocurrency is only set to increase. Also the desire for the release of its\nroadmap which aims to solve the scalability issues that many traditional blockchains are\nfacing, has certainly got the attention of many in the space.\nPaul Mills\nThe Core Administration\n[email us here](http://www.einpresswire.com/contact_author/558959060)\nVisit us on social media:\n[Other](https://www.thecoreadmin.com/)\n\nYou just read:\n\n[Distribution channels: Technology](http://www.einpresswire.com/channel/technology)\n\nEIN Presswire's priority is source transparency. We do not allow opaque clients, and our\neditors try to be careful about weeding out false and misleading content. As a user, if you see\n\n\n-----\n\nsomething we have missed, please do bring it to our attention. Your help is welcome. EIN\nPresswire, Everyone's Internet News Presswire™, tries to define some of the boundaries\n[that are reasonable in today's world. Please see our Editorial Guidelines for more](https://www.einnews.com/editorial_guidelines)\ninformation.\n\n[Submit your press release](http://www.einpresswire.com/why-us)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-23 - Hacker gains access to Hewlett-Packard 9000 EPYC server hardware to mine the cryptocurrency Raptoreum using Java exploit.pdf"
    ],
    "report_names": [
        "2021-12-23 - Hacker gains access to Hewlett-Packard 9000 EPYC server hardware to mine the cryptocurrency Raptoreum using Java exploit.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535979,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653754069,
    "ts_modification_date": 1653754069,
    "files": {
        "pdf": "https://archive.orkl.eu/f5b9c0c2faa09f480319b18493dc4830d0a30ccd.pdf",
        "text": "https://archive.orkl.eu/f5b9c0c2faa09f480319b18493dc4830d0a30ccd.txt",
        "img": "https://archive.orkl.eu/f5b9c0c2faa09f480319b18493dc4830d0a30ccd.jpg"
    }
}