{
    "id": "1272dae0-8add-423c-9096-793967f6c38d",
    "created_at": "2023-01-12T15:04:32.341815Z",
    "updated_at": "2025-03-27T02:16:07.365441Z",
    "deleted_at": null,
    "sha1_hash": "72f43556eec6b9c7fb4e12e97ef0b22cacb41a33",
    "title": "2020-09-17 - Treasury Sanctions Cyber Actors Backed by Iranian Intelligence Ministry",
    "authors": "",
    "file_creation_date": "2022-05-28T23:50:44Z",
    "file_modification_date": "2022-05-28T23:50:44Z",
    "file_size": 801826,
    "plain_text": "# Treasury Sanctions Cyber Actors Backed by Iranian Intelligence Ministry\n\n**home.treasury.gov/news/press-releases/sm1127**\n\nSeptember 17, 2020\n\n**Washington – Today, the U.S. Department of the Treasury’s Office of Foreign Assets Control**\n(OFAC) imposed sanctions on Iranian cyber threat group Advanced Persistent Threat 39\n(APT39), 45 associated individuals, and one front company. Masked behind its front\ncompany, Rana Intelligence Computing Company (Rana), the Government of Iran (GOI)\nemployed a years-long malware campaign that targeted Iranian dissidents, journalists, and\ninternational companies in the travel sector. Concurrent with OFAC’s action, the U.S. Federal\nBureau of Investigation (FBI) released detailed information about APT39 in a public\nintelligence alert.\n\n“The Iranian regime uses its Intelligence Ministry as a tool to target innocent civilians and\ncompanies, and advance its destabilizing agenda around the world,” said Treasury Secretary\nSteven T. Mnuchin. “The United States is determined to counter offensive cyber campaigns\ndesigned to jeopardize security and inflict damage on the international travel sector.”\n\nThese individuals and entities were designated pursuant to Executive Order (E.O.) 13553.\n\nRana advances Iranian national security objectives and the strategic goals of Iran’s Ministry\nof Intelligence and Security (MOIS) by conducting computer intrusions and malware\ncampaigns against perceived adversaries, including foreign governments and other\nindividuals the MOIS considers a threat APT39 is being designated pursuant to E O 13553\n\n\n-----\n\nfor being owned or controlled by the MOIS, which was previously designated on February\n16, 2012 pursuant to Executive Orders 13224, 13553, and 13572, which target terrorists and\nthose responsible for human rights abuses in Iran and Syria, respectively.\n\nRana is being designated pursuant to E.O. 13553 for being owned or controlled by MOIS.\nForty-five cyber actors are also being designated pursuant to E.O. 13553 for having\nmaterially assisted, sponsored, or providing financial, material, or technological support for,\nor goods or services to or in support of the MOIS. The identification of these individuals and\ntheir roles related to MOIS and APT39 comes as the result of a long-term investigation\nconducted by the FBI Boston Division.\n\nThe 45 designated individuals served in various capacities while employed at Rana,\nincluding as managers, programmers, and hacking experts. These individuals provided\nsupport for ongoing MOIS cyber intrusions targeting the networks of international\nbusinesses, institutions, air carriers, and other targets that the MOIS considered a threat.\n\nThe FBI advisory, also being released today, details eight separate and distinct sets of\nmalware used by MOIS through Rana to conduct their computer intrusion activities. This is\nthe first time most of these technical indicators have been publicly discussed and attributed\nto MOIS by the U.S. government. By making the code public, the FBI is hindering MOIS’s\nability to continue their campaign, ending the victimization of thousands of individuals and\norganizations around the world.\n\n“The FBI, through our Cyber Division, is committed to investigating and disrupting malicious\ncyber campaigns, and collaborating with our U.S. government partners to impose risks and\nconsequences on our cyber adversaries. Today, the FBI is releasing indicators of\ncompromise attributed to Iran’s MOIS to help computer security professionals everywhere\nprotect their networks from the malign actions of this nation state,” said FBI Director\nChristopher Wray. “Iran’s MOIS, through their front company Rana, recruited highly educated\npeople and turned their cyber talents into tools to exploit, harass, and repress their fellow\ncitizens and others deemed a threat to the regime. We are proud to join our partners at the\nDepartment of Treasury in calling out these actions. The sanctions announced today hold\nthese 45 individuals accountable for stealing data not just from dozens of networks here in\nthe United States, but from networks in Iran’s neighboring countries and around the world.\"\n\n\n-----\n\nThe MOIS, camouflaged as Rana, has played a key role in the GOI’s abuse and surveillance\nof its own citizens. Through Rana, on behalf of the MOIS, the cyber actors designated today\nused malicious cyber intrusion tools to target and monitor Iranian citizens, particularly\ndissidents, Iranian journalists, former government employees, environmentalists, refugees,\nuniversity students and faculty, and employees at international nongovernmental\norganizations. Some of these individuals were subjected to arrest and physical and\npsychological intimidation by the MOIS. APT39 actors have also victimized Iranian private\nsector companies and Iranian academic institutions, including domestic and international\nPersian language and cultural centers. Rana has also targeted at least 15 countries in the\nMiddle East and North Africa region.\n\n\n-----\n\nRana’s targeting has been both internal to Iran and global in scale, including hundreds of\nindividuals and entities from more than 30 different countries across Asia, Africa, Europe,\nand North America. Rana has used malicious cyber intrusion tools to target or compromise\napproximately 15 U.S. companies primarily in the travel sector. MOIS cyber actors targeted a\nwide range of victims, including global airlines and foreign intelligence services. The\nunauthorized access obtained by the individuals designated today allow the MOIS to track\nindividuals whom it considers a threat.\n\nAs a result of today’s action, all property and interests in property of the individuals and\nentities above, and of any entities that are owned, directly or indirectly, 50 percent or more by\nthem, individually, or with other blocked persons, that are in the United States or in the\npossession or control of U.S. persons, are blocked and must be reported to OFAC. Unless\nauthorized by a general or specific license issued by OFAC or otherwise exempt, OFAC’s\nregulations generally prohibit all transactions by U.S. persons or within (or transiting) the\nUnited States that involve any property or interests in property of designated or otherwise\n\n\n-----\n\nblocked persons. The prohibitions include the making of any contribution or provision of\nfunds, goods, or services by, to, or for the benefit of any blocked person or the receipt of any\ncontribution or provision of funds, goods or services from any such person.\n\n[View identifying information on the entites and individuals designated today.](https://home.treasury.gov/policy-issues/financial-sanctions/recent-actions/20200917)\n\n[View the FBI’s Public Intelligence Alert on APT39.](https://www.ic3.gov/media/news/default.aspx)\n\n####\n\nUse featured image\n\nOff\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-17 - Treasury Sanctions Cyber Actors Backed by Iranian Intelligence Ministry.pdf"
    ],
    "report_names": [
        "2020-09-17 - Treasury Sanctions Cyber Actors Backed by Iranian Intelligence Ministry.pdf"
    ],
    "threat_actors": [
        {
            "id": "1b3a247f-6186-4482-8b92-c3fb2d767c7d",
            "created_at": "2023-01-06T13:46:38.883911Z",
            "updated_at": "2025-03-27T02:00:02.942724Z",
            "deleted_at": null,
            "main_name": "APT39",
            "aliases": [
                "COBALT HICKMAN",
                "G0087",
                "Radio Serpens",
                "TA454",
                "REMIX KITTEN"
            ],
            "source_name": "MISPGALAXY:APT39",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a761f2a6-26ba-47fd-89c3-6a74f847a3b2",
            "created_at": "2024-05-01T02:03:08.025289Z",
            "updated_at": "2025-03-27T02:05:17.312292Z",
            "deleted_at": null,
            "main_name": "COBALT HICKMAN",
            "aliases": [
                "Chafer ",
                "ITG07 ",
                "APT39 "
            ],
            "source_name": "Secureworks:COBALT HICKMAN",
            "tools": [
                " Mimikatz",
                " Remexi",
                " TREKX",
                "MechaFlounder"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6b6155e4-94ec-4909-b908-550afe758ad6",
            "created_at": "2022-10-25T15:50:23.365074Z",
            "updated_at": "2025-03-27T02:00:55.455014Z",
            "deleted_at": null,
            "main_name": "APT39",
            "aliases": [
                "APT39",
                "ITG07",
                "Remix Kitten"
            ],
            "source_name": "MITRE:APT39",
            "tools": [
                "NBTscan",
                "MechaFlounder",
                "Remexi",
                "CrackMapExec",
                "pwdump",
                "Mimikatz",
                "Windows Credential Editor",
                "Cadelspy",
                "PsExec",
                "ASPXSpy",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535872,
    "ts_updated_at": 1743041767,
    "ts_creation_date": 1653781844,
    "ts_modification_date": 1653781844,
    "files": {
        "pdf": "https://archive.orkl.eu/72f43556eec6b9c7fb4e12e97ef0b22cacb41a33.pdf",
        "text": "https://archive.orkl.eu/72f43556eec6b9c7fb4e12e97ef0b22cacb41a33.txt",
        "img": "https://archive.orkl.eu/72f43556eec6b9c7fb4e12e97ef0b22cacb41a33.jpg"
    }
}