{
    "id": "12d0c7e7-47fd-4771-bcd6-9c5788f61323",
    "created_at": "2023-01-12T15:01:31.690646Z",
    "updated_at": "2025-03-27T02:17:00.018796Z",
    "deleted_at": null,
    "sha1_hash": "cecf8dd2b7948ef9d364dd78a1e924e37afcdcc8",
    "title": "2021-04-05 - The leap of a Cycldek-related threat actor",
    "authors": "",
    "file_creation_date": "2022-05-28T04:50:16Z",
    "file_modification_date": "2022-05-28T04:50:16Z",
    "file_size": 3082933,
    "plain_text": "# The leap of a Cycldek-related threat actor\n\n**[securelist.com/the-leap-of-a-cycldek-related-threat-actor/101243/](https://securelist.com/the-leap-of-a-cycldek-related-threat-actor/101243/)**\n\nAuthors\n\n[Ivan Kwiatkowski](https://securelist.com/author/ivankwiatkowski/)\n\n[Pierre Delcher](https://securelist.com/author/pierredelcher/)\n\n[Mark Lechtik](https://securelist.com/author/marklechtik/)\n\n## Introduction\n\nIn the nebula of Chinese-speaking threat actors, it is quite common to see tools and\nmethodologies being shared. One such example of this is the infamous “DLL side-loading triad”: a\n[legitimate executable, a malicious DLL to be sideloaded by it, and an encoded payload, generally](https://attack.mitre.org/techniques/T1574/002/)\ndropped from a self-extracting archive. Initially considered to be the signature of LuckyMouse, we\nobserved other groups starting to use similar “triads” such as HoneyMyte. While it implies that it is\nnot possible to attribute attacks based on this technique alone, it also follows that efficient\ndetection of such triads reveals more and more malicious activity.\n\nThe investigation described in this article started with one such file which caught our attention due\nto the various improvements it brought to this well-known infection vector.\n\n## FoundCore Loader\n\n\n-----\n\nThis malware sample was discovered in the context of an attack against a high-profile\norganization located in Vietnam. From a high-level perspective, the infection chain follows the\nexpected execution flow:\n\nAfter being loaded by a legitimate component from Microsoft Outlook (FINDER.exe, MD5\n[9F1D6B2D45F1173215439BCC4B00B6E3), outlib.dll (MD5](https://opentip.kaspersky.com/9F1D6B2D45F1173215439BCC4B00B6E3/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[F267B1D3B3E16BE366025B11176D2ECB) hijacks the intended execution flow of the program to](https://opentip.kaspersky.com/F267B1D3B3E16BE366025B11176D2ECB/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\ndecode and run a shellcode placed in a binary file, rdmin.src (MD5\n[DF46DA80909A6A641116CB90FA7B8258). Such shellcodes that we had seen so far, however,](https://opentip.kaspersky.com/DF46DA80909A6A641116CB90FA7B8258/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\ndid not involve any form of obfuscation. So, it was a rather unpleasant surprise for us when we\ndiscovered the first instructions:\n\nExperienced reverse-engineers will immediately recognize disassembler-desynchronizing\nconstructs in the screenshot above. The conditional jumps placed at offsets 7 and 9 appear to\nland in the middle of an address (as evidenced by the label loc_B+1), which is highly atypical for\nwell-behaved assembly code. Immediately after, we note the presence of a call instruction whose\ndestination (highlighted in red) is identified as bogus by IDA Pro, and the code that follows doesn’t\nmake any sense.\n\n\n-----\n\nExplaining what is going on requires taking a step back and providing a bit of background about\nhow disassemblers work. At the risk of oversimplifying, flow-oriented disassemblers make a\nnumber of assumptions when processing files. One of them is that, when they encounter a\nconditional jump, they start disassembling the “false” branch first, and come back to the “true”\nbranch later on. This process is better evidenced by looking at the opcodes corresponding to the\ncode displayed above, again starting from offset 7:\n\nIt is now more obvious that there are two ways to interpret the code above: the disassembler can\neither start from “E8”, or from “81” – by default, IDA will choose the latter: E8 is in fact the opcode\nfor the call instruction. But astute readers will notice that “JLE” (jump if lower or equal) and “JG”\n(jump if greater) are opposite conditions: no matter what, one of those will always be true and as\nsuch the actual code, as seen by the CPU during the execution, will start with the byte “81”. Such\n[constructs are called opaque predicates, and this E8 byte in the middle was only added there in](https://en.wikipedia.org/wiki/Opaque_predicate)\norder to trick the disassembler.\n\nDefeating this trick is but a trivial matter for IDA Pro, as it is possible to manually correct the\ndisassembling mistake. However, it was immediately obvious that the shellcode had been\nprocessed by an automated obfuscation tool. Opaque predicates, sometimes in multiples, and\ndead code were inserted between every single instruction of the program. In the end, cleaning up\nthe program automatically was the only practical approach, and we did so by modifying an\n[existing script for the FinSpy malware family created by the respected reverse-engineer Rolf](https://github.com/RolfRolles/FinSpyVM/)\nRolles.\n\nThis step allowed us to discover the shellcode’s purpose: to decrypt and decompress the final\npayload, using a combination of RC4 and LZNT1. Even then, it turned out that the attackers had\nmore tricks up their sleeve. Normally, at this stage, one would have expected to find a PE file that\nthe shellcode would load into memory. But instead, this is what we got:\n\n\n-----\n\nThe recovered file was indeed a PE, but it turned out that most of its headers had been scrubbed.\nIn fact, even the scarce ones remaining contained incoherent values – for instance, here, a\nnumber of declared sections equal to 0xAD4D. Since it is the shellcode (and not the Windows\nloader) that prepares this file for execution, it doesn’t matter that some information, such as the\nmagic numbers, is missing. As for the erroneous values, it turned out that the shellcode was fixing\nthem on the fly using hardcoded operations:\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n\nfor ( i = 0; ; ++i ) // Iterate on the sections\n\n{\n\n// [...]\n\n// Stop when all sections have been read\n\nif ( i >= pe->pe_header_addr->FileHeader.NumberOfSections - 44361 )\n\nbreak;\n\n// [...]\n\n}\n\n\nFor instance, in the decompiled code above (as for all references to the file’s number of sections)\nthe value read in the headers is subtracted by 44361. For the attackers, the advantage is two-fold.\nFirst, it makes acquiring the final payload statically a lot more difficult for potential reverseengineers. Second, it also ensures that the various components of the toolchain remain tightly\ncoupled to each other. If only a single one of them finds itself uploaded to a multi-scanner\nwebsite, it will be unexploitable for defenders. This is a design philosophy that we had observed\nfrom the LuckyMouse APT in the past, and is manifest in other parts of this toolchain too, as we\nwill see later on. Eventually, we were able to reconstruct the file’s headers and move on with our\nanalysis – but we found this loader so interesting from an educational standpoint that we decided\nto base one track of our online reverse-engineering course on it. For more detailed steps on how\n[we approached this sample, please have a look at Targeted Malware Reverse Engineering.](https://xtraining.kaspersky.com/courses/targeted-malware-reverse-engineering)\n\n## FoundCore payload\n\nThe final payload is a remote administration tool that provides full control over the victim machine\nto its operators. Upon execution, this malware starts 4 threads:\n\nThe first one establishes persistence by creating a service.\nThe second one sets inconspicuous information for the service by changing its “Description”,\n“ImagePath”, “DisplayName” fields (among others).\nThe third sets an empty DACL (corresponding to the SDDL string “D:P”) to the image\nassociated to the current process in order to prevent access to the underlying malicious file.\nFinally, a worker thread bootstraps execution and establishes connection with the C2 server.\nDepending on its configuration, it may also inject a copy of itself to another process.\n\nCommunications with the server can take place either over raw TCP sockets encrypted with RC4,\nor via HTTPS. Commands supported by FoundCore include filesystem manipulation, process\nmanipulation, screenshot captures and arbitrary command execution.\n\n## RoyalRoad documents, DropPhone and CoreLoader\n\n\n-----\n\nTaking a step back from the FoundCore malware family, we looked into the various victims we\nwere able to identify to try to gather information about the infection process. In the vast majority of\nthe incidents we discovered, it turned out that FoundCore executions were preceded by the\nopening of a malicious RTF documents downloaded from static.phongay[.]com. They all were\n[generated using RoyalRoad and attempt to exploit CVE-2018-0802.](https://malpedia.caad.fkie.fraunhofer.de/details/win.8t_dropper)\n\nInterestingly, while we would have expected them to contain decoy content, all of them were\nblank. We, therefore, hypothesize the existence of precursor documents, possibly delivered\nthrough spear-phishing, or precursor infections, which would trigger the download of one of these\nRTF files.\n\nSuccessful exploitation leads to the deployment of yet another malware that we named\nDropPhone:\n\n**MD5** 6E36369BF89916ABA49ECA3AF59D38C6\n\n**SHA1** C477B50AE66E7228164930117A7D36C53713A5F2\n\n**SHA256** F50AE4B25B891E95B57BD4391AEB629437A43664034630D593EB9846CADC9266\n\n\n**Creation**\n**time**\n\n\n2020-11-04 09:14:22\n\n\n**File type** PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\n\n**File size** 56 KB\n\nThis C++ implant also comes in the form of a legitimate executable (DeElevate.exe, from the\npublisher StarDock) and a side-loaded DLL (DeElevator.dll). At this stage, we are left with more\nquestions than answers when it comes to it. DropPhone fetches a file saved as data.dat from\nhxxps://cloud.cutepaty[.]com, but we were unable to obtain a copy of this file so far. Next, it\nexpects to find a companion program in %AppData%\\Microsoft\\Installers\\sdclt.exe, and will\neventually terminate execution if it cannot find it.\n\nOur hypothesis is that this last file could be an instance or variant of CoreLoader (which we will\ndescribe in a minute), but the only piece of data supporting this theory that we have at our\ndisposal is that we found CoreLoader in this folder in a single occurrence.\n\nDropPhone launches sdclt.exe, then collects environment information from the victim machine\nand sends it to DropBox. The last thing this implant does is delete data.dat without ever accessing\nits contents. We speculate that they are consumed by sdclt.exe, and that this is another way to\nlock together the execution of two components, frustrating the efforts of the reverse-engineers\nwho are missing pieces of the puzzle – as is our case here.\n\n**MD5** 1234A7AACAE14BDD94EEE6F44F7F4356\n\n**SHA1** 34977E351C9D0E9155C6E016669A4F085B462762\n\n\n-----\n\n**SHA256** 492D3B5BEB89C1ABF88FF866D200568E9CAD7BB299700AA29AB9004C32C7C805\n\n\n**Creation**\n**time**\n\n\n2020-11-21 03:47:14\n\n\n**File type** PE32 executable (DLL) (GUI) Intel 80386, for MS Windows\n\n**File size** 66 KB\n\nFinally, CoreLoader, the last malware we found associated to this set of activity, is a simple\nshellcode loader which performs anti-analysis and loads additional code from a file named\nWsmRes.xsl. Again, this specific file eluded our attempts to catch it but we suspect it to be, one\nway or another, related to FoundCore (described in the previous section).\n\nOverall, our current understanding of this complex toolchain is as follows. Dashed lines represent\nthe components and links we are inferring, striped boxes represent the files we could not acquire.\n\n## Victimology and attribution\n\nWe observed this campaign between June 2020 and January 2021. According to our telemetry,\ndozens of organizations were affected. 80% of them are based in Vietnam and belong to the\ngovernment or military sector, or are otherwise related to the health, diplomacy, education or\npolitical verticals. We also identified occasional targets in Central Asia and in Thailand.\n\n\n-----\n\nFor the reasons laid-out in the introduction, attribution based on tooling alone is risky when it\ncomes to this nebula. At first glance, the use of a “triad”, the general design philosophy and the\nobvious effort spent to make reverse-engineering as complex as possible are reminiscent of\nLuckyMouse. However, we also observed code similarities between CoreLoader or FoundCore\nand programs associated with the Cycldek threat actor – namely, RedCore Loader (MD5:\n[1B6BCBB38921CAF347DF0A21955771A6).](https://opentip.kaspersky.com/1B6BCBB38921CAF347DF0A21955771A6/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nWhile Cycldek was, so far, considered to be one of the lesser sophisticated threat actors from the\nChinese-speaking nexus, its targeting is known to be consistent with what we observed in this\ncampaign. Therefore, we are linking the activities described in this post with Cycldek with low\nconfidence.\n\n## Conclusion\n\nNo matter which group orchestrated this campaign, it constitutes a significant step up in terms of\nsophistication. The toolchain presented here was willfully split into a series of interdependent\ncomponents that function together as a whole. Single pieces are difficult – sometimes impossible\n– to analyze in isolation, because they rely on code or data provided at other stages of the\ninfection chain. We regretfully admit that this strategy was partly successful in preventing us from\nobtaining a complete picture of this campaign. As such, this report is as much about the things we\nknow as it is about figuring out what we don’t. We hereby extend our hand to fellow researchers\nwho might be seeing other pieces of this vast puzzle, because we strongly believe that the\nchallenges ahead of us can only be overcome through information sharing among trusted industry\npartners.\n\nSome readers from other regions of the world might dismiss this local activity as irrelevant to their\ninterests. We would advise them to take heed. Experience shows that regional threat actors\nsometimes widen their area of activity as their operational capabilities increase, and that tactics or\ntools are vastly shared across distinct actors or intrusion-sets that target different regions. Today,\nwe see a group focused on South-East Asia taking a major leap forward. Tomorrow, they may\ndecide they’re ready to take on the whole world.\n\n## Indicators of Compromise\n\n**File Hashes**\n\n[F267B1D3B3E16BE366025B11176D2ECB](https://opentip.kaspersky.com/F267B1D3B3E16BE366025B11176D2ECB/?utm_source=SL&utm_medium=SL&utm_campaign=SL) FoundCore malicious DLL (outllib.dll)\n\n[DF46DA80909A6A641116CB90FA7B8258](https://opentip.kaspersky.com/DF46DA80909A6A641116CB90FA7B8258/?utm_source=SL&utm_medium=SL&utm_campaign=SL) FoundCore companion file (rdmin.src)\n\n[6E36369BF89916ABA49ECA3AF59D38C6](https://opentip.kaspersky.com/6E36369BF89916ABA49ECA3AF59D38C6/?utm_source=SL&utm_medium=SL&utm_campaign=SL) DropPhone\n\n[60095B281E32DAD2B58A10005128B1C3](https://opentip.kaspersky.com/60095B281E32DAD2B58A10005128B1C3/?utm_source=SL&utm_medium=SL&utm_campaign=SL) Malicious RTF document\n\n[1234A7AACAE14BDD94EEE6F44F7F4356](https://opentip.kaspersky.com/1234A7AACAE14BDD94EEE6F44F7F4356/?utm_source=SL&utm_medium=SL&utm_campaign=SL) CoreLoader\n\n**Domains**\n\n\n-----\n\n[phong.giaitrinuoc[.]com](https://opentip.kaspersky.com/phong.giaitrinuoc.com/?utm_source=SL&utm_medium=SL&utm_campaign=SL) FoundCore C2\n\n[cloud.cutepaty[.]com](https://opentip.kaspersky.com/cloud.cutepaty.com/?utm_source=SL&utm_medium=SL&utm_campaign=SL) DropPhone C2\n\n[static.phongay[.]com](https://opentip.kaspersky.com/static.phongay.com/?utm_source=SL&utm_medium=SL&utm_campaign=SL) RTF document stager\n\n[APT](https://securelist.com/tag/apt/)\n[Chinese-speaking cybercrime](https://securelist.com/tag/chinese-speaking-cybercrime/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n\nAuthors\n\n[Ivan Kwiatkowski](https://securelist.com/author/ivankwiatkowski/)\n\n[Pierre Delcher](https://securelist.com/author/pierredelcher/)\n\n[Mark Lechtik](https://securelist.com/author/marklechtik/)\n\nThe leap of a Cycldek-related threat actor\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-05 - The leap of a Cycldek-related threat actor.pdf"
    ],
    "report_names": [
        "2021-04-05 - The leap of a Cycldek-related threat actor.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1691c25f-1aa4-4168-8ce2-7aa8f23246e7",
            "created_at": "2024-06-04T02:03:07.724221Z",
            "updated_at": "2025-03-27T02:05:17.284601Z",
            "deleted_at": null,
            "main_name": "BRONZE PRESIDENT",
            "aliases": [
                "Mustang Panda ",
                "Red Lich ",
                "Temp.Hex ",
                "HoneyMyte "
            ],
            "source_name": "Secureworks:BRONZE PRESIDENT",
            "tools": [
                " Cobalt Strike",
                " ORat",
                " PlugX",
                " RCSession",
                "China Chopper"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2c7ecb0e-337c-478f-95d4-7dbe9ba44c39",
            "created_at": "2022-10-25T16:07:23.690871Z",
            "updated_at": "2025-03-27T02:02:09.921431Z",
            "deleted_at": null,
            "main_name": "Goblin Panda",
            "aliases": [
                "1937CN",
                "Conimes",
                "Cycldek",
                "Goblin Panda"
            ],
            "source_name": "ETDA:Goblin Panda",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "BackDoor-FBZT!52D84425CDF2",
                "BlueCore",
                "BrowsingHistoryView",
                "ChromePass",
                "CoreLoader",
                "Custom HDoor",
                "Destroy RAT",
                "DestroyRAT",
                "DropPhone",
                "FoundCore",
                "HDoor",
                "HTTPTunnel",
                "JsonCookies",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NBTscan",
                "NewCore RAT",
                "PlugX",
                "ProcDump",
                "PsExec",
                "QCRat",
                "RainyDay",
                "RedCore",
                "RedDelta",
                "RoyalRoad",
                "Sisfader",
                "Sisfader RAT",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Win32.Staser.ytq",
                "USBCulprit",
                "Win32/Zegost.BW",
                "Xamtrav",
                "ZeGhost",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7d553b83-a7b2-431f-9bc9-08da59f3c4ea",
            "created_at": "2023-01-06T13:46:39.444946Z",
            "updated_at": "2025-03-27T02:00:03.093712Z",
            "deleted_at": null,
            "main_name": "GOBLIN PANDA",
            "aliases": [
                "Conimes",
                "Cycldek"
            ],
            "source_name": "MISPGALAXY:GOBLIN PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535691,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1653713416,
    "ts_modification_date": 1653713416,
    "files": {
        "pdf": "https://archive.orkl.eu/cecf8dd2b7948ef9d364dd78a1e924e37afcdcc8.pdf",
        "text": "https://archive.orkl.eu/cecf8dd2b7948ef9d364dd78a1e924e37afcdcc8.txt",
        "img": "https://archive.orkl.eu/cecf8dd2b7948ef9d364dd78a1e924e37afcdcc8.jpg"
    }
}