{
    "id": "136fc092-9573-4bd8-aebc-4cc2bff752ac",
    "created_at": "2023-01-12T15:06:34.661196Z",
    "updated_at": "2025-03-27T02:09:18.416283Z",
    "deleted_at": null,
    "sha1_hash": "485d28d76364fe1f7701262b35d3ab6d3a0d04dd",
    "title": "2021-12-14 - Analysis of Novel Khonsari Ransomware Deployed by the Log4Shell Vulnerability",
    "authors": "",
    "file_creation_date": "2022-05-28T16:16:10Z",
    "file_modification_date": "2022-05-28T16:16:10Z",
    "file_size": 2059848,
    "plain_text": "# Analysis of Novel Khonsari Ransomware Deployed by the Log4Shell Vulnerability\n\n**[cadosecurity.com/analysis-of-novel-khonsari-ransomware-deployed-by-the-log4shell-vulnerability/](https://www.cadosecurity.com/analysis-of-novel-khonsari-ransomware-deployed-by-the-log4shell-vulnerability/)**\n\nDecember 14, 2021\n\nBlog\n\nDecember 14, 2021\n\nBy Matt Muir\n\n**Overview**\n\n[As previously reported, a recently-discovered critical vulnerability (CVE-2021-44228) in](https://www.cadosecurity.com/analysis-of-initial-in-the-wild-attacks-exploiting-log4shell-log4j-cve-2021-44228/)\nApache’s Log4J logging utility is now being actively exploited in the wild. Researchers at\n[Bitdefender have observed threat actors exploiting this vulnerability to deliver malicious](https://businessinsights.bitdefender.com/technical-advisory-zero-day-critical-vulnerability-in-log4j2-exploited-in-the-wild)\npayloads, including a novel strain of ransomware. Given this is the first ransomware known to\nbe directly deployed by CVE-2021-44228 (also known as Log4Shell) – we decided to take a\ndeeper look.\n\n**Ransomware Sample**\n\n**_We have published a playbook on how to respond to ransomware investigations_** **_that_**\n**_you can download here._**\n\nThe ransomware sample is part of a new ransomware family named Khonsari which targets\nWindows servers.\n\nThe exploit loads the Java bytecode at hxxp://3.145.115[.]94/Main.class via JNDI, which then\ndownloads the Kohnsari ransomware from hxxp://3.145.115[.]94/zambo/groenhuyzen.exe.\n\nWe retrieved this [sample and performed static analysis of it along with forensic analysis using](https://www.virustotal.com/gui/file/f2e3f685256e5f31b05fc9f9ca470f527d7fdae28fa3190c8eba179473e20789)\nthe Cado platform.\n\n\n-----\n\n**Static Analysis**\n\nSince the ransomware makes use of the .NET framework and is written in C♯, retrieving the\n[source code through decompilation is straightforward when using tools such as ILspy. Once](https://github.com/icsharpcode/ILSpy)\ndecompiled, the source code gives us a good idea of the malware’s capabilities.\n\nKhonsari is – frankly – a bit boring. It weighs in at only 12 KB and contains only the most basic\nfunctionality required to perform its ransomware objective. Its size and simplicity is also a\nstrength however – at the time we ran the malware dynamically it wasn’t detected by the\nsystems built in Antivirus.\n\nSoon after execution, the malware enumerates all mounted drives (apart from C:\\) and begins\nto encrypt all contents found on them:\n\n\n-----\n\nEncryption of the C:\\ drive is more targeted, with the ransomware sample only encrypting user\ndirectories, such as Documents, Videos, Pictures, Downloads and Desktop. Each file is\nencrypted using the AES 128 CBC algorithm and the extension .khonsari is added:\n\n\n-----\n\n**Forensic Analysis**\n\nAfter static analysis, we imported a disk image from the hard disk of a Windows Server 2019\nmachine compromised by Khonsari to see if we could confirm our findings. Using the “Key\nEvents” feature of [Cado Response, we were immediately notified of suspicious events relating](https://www.cadosecurity.com/platform/)\nto this ransomware sample.\n\nFirstly, Cado has highlighted that the main executable for the sample is located in the\nWindows temp folder – a folder typically used by malware:\n\nThis is suspicious as it’s a non-standard location for executable files on Windows and goes\nagainst developer convention.\n\nDuring static analysis, we noticed that encrypted files had the .khonsari extension added to\nthem. Cado displays these events within the platform during post-incident forensics:\n\n\n-----\n\nTypically, ransomware samples will create a ransom note on the target system, with\ninstructions for how to pay the ransom and contact the developers once you’ve done so.\nKhonsari is no different. As noted by Bitdefender, the Khonsari ransom note is dropped at the\nfollowing path:\n\nC:\\Users\\<user>\\Desktop\\HOW TO GET YOUR FILES BACK.TXT\n\nCado detects the writing of this file to disk and displays the contents of the ransom note:\n\n**Impact**\n\nWe have only seen very limited distribution of this file – it is unlikely many organisations were\nimpacted by Khonsari. However – it is a harbinger of more dangerous ransomware to come.\nOminously, Microsoft have reported seeing Cobalt Strike delivered by Log4Shell – a staple of\nransomware gangs.\n\n**Ransomware Recommendations**\n\n**_We have published a playbook on how to respond to ransomware investigations_** **_that_**\n**_you can download here._**\n\n\n-----\n\nIf it s an opportunistic attack such as this, identify the initial method of intrusion and close all\ngaps. For example, if the initial infection was through an exploit kit, make sure your network is\npatched against the successful exploit.\n\nIf you’re dealing with manually-deployed ransomware, you will need to consider a number of\n[steps in your response. Some useful references can be found here, and](https://us-cert.cisa.gov/ncas/alerts/aa20-245a) [here.](https://www.sans.org/media/score/checklists/APT-IncidentHandling-Checklist.pdf)\n\nTo ensure timely recovery, it’s important that you have off-site data backups and have tested\nthat you can successfully restore the data into a new environment. If this isn’t the case,\nconsider how effective your backup strategies are and if they can be improved. In addition,\nany passwords or credentials used on the infected system should be considered\ncompromised, and reset. Normally the infected system should be wiped and reinstalled after\n[any data for an investigation has been captured. US-CERT provides additional guidance](https://www.us-cert.gov/sites/default/files/publications/Ransomware_Executive_One-Pager_and_Technical_Document-FINAL.pdf)\naround responding to ransomware.\n\nIt’s critical that you have a sound backup and recovery process in place. With backups, it’s\nimportant to ensure you have true offline copies, as some attackers will target how your\nbackup systems function. Further, some incremental backups rely on there being a known\ngood state of a system, so it is important that you also consider if you need a full backup vs\nincremental. Depending on the variant of ransomware, it will normally overwrite original files,\nand look to delete volume shadow backups. As such, forensic recovery of files is usually met\nwith limited success.\n\n**Log4Shell Recommendations**\n\nA number of mitigations can be employed to reduce the impact of Log4Shell:\n\nUpgrade Log4J to the latest version (>=2.15.0).\nUpgrade Java installations to 2019 or later editions.\nWhere that isn’t possible, you can manually set the setting\ncom.sun.jndi.rmi.object.trustURLCodebase to false.\nSetting either the system property log4j2.formatMsgNoLookups or the environment\nvariable LOG4J_FORMAT_MSG_NO_LOOKUPS to true.\nIf possible, block outgoing LDAP traffic.\n\nReview all vulnerable internet facing systems for signs of compromise. If any systems show\nsigns of compromise, we recommend that you investigate each system to determine what\nmalicious activity has occurred. This could include what data or accounts may have been\nexposed, if propagation to other systems had occurred, or if other unknown backdoors exist,\nand then determine if you need to take any further incident response actions. You may wish to\nforensically capture then reinstall and apply updates where feasible.\n\nFor systems that have been impacted in AWS, we also recommend that you monitor\nconnections to the AWS console for newly deployed ec2 instances, access to existing ec2\ninstances or S3 buckets using potentially compromised AWS credentials.\n\n\n-----\n\n**References**\n\nhttps://businessinsights.bitdefender.com/technical-advisory-zero-day-criticalvulnerability-in-log4j2-exploited-in-the-wild\n\n**Indicators of Compromise (IOCs)**\n\n**Filename** **Hash (SHA256)**\n\ngroenhuyzen.exe f2e3f685256e5f31b05fc9f9ca470f527d7fdae28fa3190c8eba179473e20789\n\n\nHOW TO GET\nYOUR FILES\nBACK.txt\n\n**URLs**\n\n\nefbc218dfff5c4d9e4b1449380fd31a0380aee8cdfede1356ef20a986342b300\n\n\nhxxp://3.145.115.94/Main.class\n\nhxxp://3.145.115.94/zambo/groenhuyzen.exe\n\nhxxp://3.145.115.94/zambos_caldo_de_p.txt\n\n**Email Addresses**\n\n[[redacted]@gmail[.]com – See also https://twitter.com/mikko/status/1470810620496957450](https://twitter.com/mikko/status/1470810620496957450)\n\nAbout The Author\n\nChris Doman\n\n[Chris is well known for building the popular threat intelligence portal ThreatCrowd, which](https://www.threatcrowd.org/)\n[subsequently merged into the AlienVault Open Threat Exchange, later acquired by AT&T.](https://otx.alienvault.com/)\nChris is an industry leading threat researcher and has published a number of widely read\narticles and papers on targeted cyber attacks. His research on topics such as the North\n\n\n-----\n\nKorean government s [crypto-currency theft schemes, and China s attacks](https://www.wsj.com/articles/in-north-korea-hackers-mine-cryptocurrency-abroad-1515420004) against dissident\nwebsites, have been widely discussed in the media. He has also given interviews to print,\n[radio and TV such as CNN and BBC News.](https://www.youtube.com/watch?v=z_0oV_hsc08)\n\n**About Cado Security**\n\nCado Security provides the cloud investigation platform that empowers security teams to\nrespond to threats at cloud speed. By automating data capture and processing across cloud\nand container environments, Cado Response effortlessly delivers forensic-level detail and\nunprecedented context to simplify cloud investigation and response. Backed by Blossom\nCapital and Ten Eleven Ventures, Cado Security has offices in the United States and United\n[Kingdom. For more information, please visit https://www.cadosecurity.com/ or follow us on](https://www.cadosecurity.com/)\nTwitter [@cadosecurity.](https://twitter.com/CadoSecurity)\n\n[Prev Post](https://www.cadosecurity.com/analysis-of-initial-in-the-wild-attacks-exploiting-log4shell-log4j-cve-2021-44228/) [Next Post](https://www.cadosecurity.com/the-continued-evolution-of-abcbot/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-14 - Analysis of Novel Khonsari Ransomware Deployed by the Log4Shell Vulnerability.pdf"
    ],
    "report_names": [
        "2021-12-14 - Analysis of Novel Khonsari Ransomware Deployed by the Log4Shell Vulnerability.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535994,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653754570,
    "ts_modification_date": 1653754570,
    "files": {
        "pdf": "https://archive.orkl.eu/485d28d76364fe1f7701262b35d3ab6d3a0d04dd.pdf",
        "text": "https://archive.orkl.eu/485d28d76364fe1f7701262b35d3ab6d3a0d04dd.txt",
        "img": "https://archive.orkl.eu/485d28d76364fe1f7701262b35d3ab6d3a0d04dd.jpg"
    }
}