{
    "id": "13806770-814e-4a10-8f97-194cfb07179b",
    "created_at": "2022-10-25T16:48:10.486522Z",
    "updated_at": "2025-03-27T02:09:29.800418Z",
    "deleted_at": null,
    "sha1_hash": "9a7978041e795b788d86c52a477160dae296413b",
    "title": "The Plugx Malware Revisited: Introducing Smoaler",
    "authors": "Sophos",
    "file_creation_date": "2013-07-15T17:16:58Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1119705,
    "plain_text": "## By Gabor Szappanos, Principal Researcher, SophosLabs\n\n July 2013\n\n[In a recent SophosLabs article about the PlugX malware family [A], we concluded](http://nakedsecurity.sophos.com/2013/05/20/inside-the-plugx-malware-with-sophoslabs-a-fascinating-journey-into-a-malware-factory/)\nwith these words:\n\n_There is no doubt that PlugX development will go on, and new features and_\n_tricks will be introduced._\n\n_We'll keep an eye on them, and if any interesting or important new features_\n_appear, we'll be sure to let you know._\n\nFast forward just under two months, and we're ready to tell you the next stage in\nthis ongoing saga.\n\nThe malware family we'll be looking at in this report is known as Smoaler, and it\nshares many features with PlugX, notably that:\n\n[• Smoaler relies on the same vulnerability, CVE-2012-0158. [B]](http://www.cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0158%20)\n\n  - Smoaler uses the same exploit shellcode.\n\n  - Smoaler uses similar visual distractions, or decoys, with a Tibetan theme.\n\n  - Smoaler uses the same initial malware modules to initiate infection.\n\nThereafter, the new malware follows a different path to the PlugX samples we\nlooked at last time.\n\nWe shall analyse the “what happens next” component of Smoaler later on.\n\nTo clarify the terminology we have used above, remember that:\n\n  - A vulnerability is a software bug that could potentially be abused to make\n\nyour computer behave insecurely.\n\n  - An exploit is a real-world trick by which a vulnerability can be activated to\n\nbypass security.\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                 1](http://www.sophos.com/legal)\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                      Gabor Szappanos, SophosLabs\n\n  - Shellcode is runnable program code delivered inside a file that is supposed\n\nto be plain data, and therefore implicitly safe, but that can be executed\nwithout the user's knowledge or consent by exploiting a vulnerability.\n\n  - Initial malware modules, also called droppers, are malware components,\n\noften delivered or activated by shellcode, used to deliver the full malware, or\npayload, that the attacker wants to install.\n\n### How Smoaler arrives\n\nThe Smoaler samples seen by SophosLabs were all packaged into files with the\nextensions .DOC or .DOCX. These extensions usually denote files specific to\nMicrosoft Word that were created by Microsoft Word.\n\nDespite the extensions, however, all the files were actually in Rich Text Format\n(RTF), a text-based file format for representing documents.\n\nFig 1: RTF content of one of the Smoaler samples received by SophosLabs\n\nWe assume that the attackers chose RTF because its text structure makes it easier\nto manipulate to create a working exploit for the CVE-2012-0158 vulnerability.\n\nAs with PlugX, the Smoaler files arrived with Tibetan-themed subject lines:\n\nSelected quotes from the book.docx\nPress Release - Heart is Noble book launch.doc\n\nFilenames TIBATIAN PROBLEM.doc [sic]\n\nBackgrounder on His Holiness the Karmapa.docx\nWhy Tibet Matters Now Oct 1 final version.doc\n\n404,220 bytes\n294,096 bytes\n\nFile sizes 1,086,312 bytes\n\n397,564 bytes\n7,858,097 bytes\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    2](http://www.sophos.com/legal)\n\n|Filenames|Selected quotes from the book.docx Press Release - Heart is Noble book launch.doc TIBATIAN PROBLEM.doc [sic] Backgrounder on His Holiness the Karmapa.docx Why Tibet Matters Now Oct 1 final version.doc|\n|---|---|\n|File sizes|404,220 bytes 294,096 bytes 1,086,312 bytes 397,564 bytes 7,858,097 bytes|\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\n56e8c76cd88996da9b88901520f72ebb743e55ff\na99b73b56fe94375ec46e51903f815d86afbd78d\n\nSHA1 checksums b2f854e9987bce5d110349a354588568ab49726b\n\nc093d4cd2390617da58bd412c9219e013de503a3\nb84a133cf02eaa7b8a8096e997bda28fc482cf78\n\nSophos detection Exp/20120158-A\n\nIf you open an infected document on an unpatched, unprotected computer, the\nshellcode in the document will activate and run.\n\nAfter infecting your computer, the shellcode loads a new copy of Word to display a\n**decoy document that is hidden inside the malicious file.**\n\nYou will notice only notice a brief flicker when the old instance of Word closes and\nthe new one with the decoy opens.\n\nFig 2: Sample Smoaler decoy documents\n\nThe decoy documents are all unexceptional, uninfected documents with content\nthat matches the filenames given to the malicious RTFs. (See Fig 2.)\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    3](http://www.sophos.com/legal)\n\n|SHA1 checksums|56e8c76cd88996da9b88901520f72ebb743e55ff a99b73b56fe94375ec46e51903f815d86afbd78d b2f854e9987bce5d110349a354588568ab49726b c093d4cd2390617da58bd412c9219e013de503a3 b84a133cf02eaa7b8a8096e997bda28fc482cf78|\n|---|---|\n|Sophos detection|Exp/20120158-A|\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\nIn preparing the decoy for display, the malware overwrites the infected RTF file\nwith the contents of the decoy (which is in DOC format), thus removing one useful\npiece of evidence that might otherwise help pinpoint the source of infection.\n\n### The shellcode\n\nThe executable code that kicks off infection is the same as was used in PlugX,\nbeing byte-for byte identical (see Fig 3) to the shellcode from [PlugX 6.0 [A].](http://nakedsecurity.sophos.com/2013/05/20/inside-the-plugx-malware-with-sophoslabs-a-fascinating-journey-into-a-malware-factory/)\n\nFig 444: The PlugX 6.0 and Smoaler shellcodes are identical\n\nFig 3: The PlugX 6.0 and Smoaler shellcodes are identical\n\n￼This shellcode is unusual for its use of LZNT1 compression for the embedded\nexecutable payload. This technique has not been observed in any other APT\n(Advanced Persistent Threat) attacks.\n\nThe shellcode decompresses an embedded PE file, writes it into the %TEMP% folder\nwith the name DW20.DLL (this mimics the filename used by the Dr. Watson utility\n\non Windows that pops up when a program crashes), and runs it.\n\n### First-stage dropper\n\nFilename DW20.DLL\n\nSophos detections [ Troj/Plugx-I]\n\nTroj/Plugx-K\n\nThe first-stage payload created by the shellcode contains another program file\nembedded as data.\n\nIt locates this in its own executable file, drops it to disk (which is where the name\n**dropper comes from for this sort of malware component), and runs it.**\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    4](http://www.sophos.com/legal)\n\n|Filename|DW20.DLL|\n|---|---|\n|Sophos detections|Troj/Plugx-I Troj/Plugx-K|\n\n\nFig 444: The PlugX 6.0 and Smoaler shellcodes are identical\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\nThere are two main sorts of dropper, detected by Sophos as Troj/Plugx-I and\nTroj/Plugx-K. (See Fig 4.) The names reflect the similarity, thus far, to earlier PlugX\nmalware.\n\nFig 4: Side-by-side pseudocode for Smoaler first-stage dropper variants\n\nBut what happens next is quite different from a PlugX attack, which is why this\nmalware has been given the general name Smoaler, rather than PlugX.\n\n### The intermediate infector\n\nFilename Random temporary name (deleted after use)\n\nSophos detection Mal/Smoaler-A\n\nThe temporary file dropped by DW20.DLL contains a compressed DLL (dynamic link\n\nlibrary: a special sort of program file) stored in its resources. This compressed\nprogram is unpacked using code built on the stack.\n\nThis component decodes the Command-and-Control (C&C) server names that the\nfinal malware will use, and saves them to the registry entry HKCU\\Software\\\nMicrosoft\\Windows Media\\XC. (See Fig 5.)\n\nC&C servers are the computers to which infected computers, often called bots or\n_zombies, connect in order to fetch instructions on what to do next. Putting the C&C_\nserver names in the registry, rather than in the zombie executable itself, means\nthat if the user becomes suspicious and submits the malware file to a security\nvendor, the locations of the C&C servers will not be revealed.\n\nThe data in the registry entry is obscured by flipping the least significant bit of the\nnon-zero bytes (i.e. XORing them with 0x01). This provides a light disguise against\nan inquisitive user.\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    5](http://www.sophos.com/legal)\n\n|Filename|Random temporary name (deleted after use)|\n|---|---|\n|Sophos detection|Mal/Smoaler-A|\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\nFig 5: Smoaler registry entry used to store C&C server names\n\nAfter storing the C&C names in the registry, the intermediate infector loads the\ndropped DLL using the LoadLibrary() Windows API call.\n\nThe intermediate infector is deleted from the system after execution.\n\n### Main malware component\n\nFilename Randomly-generated name\n\nSophos detection Troj/Smoaler-A\n\nThe DLL dropped by the intermediate infector is the principal component of\nSmoaler.\n\nThe DLLs created during infection are variable in size, and huge, ranging from 20\nMBytes to 50 MBytes.\n\nThis is not because they are complex and packed with functionality: the useful\ncontent of Smoaler is less than 40 KBytes. The bulk of each DLL consists of a\nnumber (two to six) binary resources of 5 MBytes to 10 MBytes each. These\nresources are filled with zero bytes, entirely for the purpose of bulking up the file.\n\nWe assume that the purpose of deliberately bloating the main DLL is to disguise its\noriginal source, since even a suspicious user might not connect a multi-megabyte\nDLL with the original infectious RTF of a few hundred kilobytes. (The original RTF is\nalso replaced with the decoy DOC file after infection, further diverting attention\nfrom the origin of the malware.)\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    6](http://www.sophos.com/legal)\n\n|Filename|Randomly-generated name|\n|---|---|\n|Sophos detection|Troj/Smoaler-A|\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\nWhen the DLL first runs, it installs itself permanently into two places on the\nvictim's computer:\n\n  - C:\\Documents and Settings\\All Users\\Application Data\\Microsoft\\\n\nWindows\\Burn\\%COMPUTERNAME%.dll\n\n(%COMPUTERNAME% is generated by querying the name of the computer.)\n\n  - C:\\Documents and Settings\\All Users\\Application Data\\Microsoft\\\n\nWindows\\LiveUpdata_Mem\\%RANDOM%.dll\n\n(The %RANDOM% part of the name is variable, e.g. B6go3s_One.dll or 7n5HjV.dll.)\n\nTwo or three copies of the DLL are dropped. They typically differ in size, because\nthe zero-byte resource padding may vary in each file.\n\nThe DLL is added as a registry value called %COMPUTERNAME% in the registry key\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\run.\nThis provides what is known as persistence, meaning that the malware is\nautomatically re-loaded every time the victim reboots or logs on. (See Fig 6.)\n\nFig 6: Smoaler registry persistence on a computer named XP3\n\nNote that Smoaler is launched using the Windows utility rundll32.exe, because\nDLLs cannot execute on their own. They require a host program inside which to\nrun.\n\nWhen connecting to its C&C servers, Smoaler injects itself into the process\nIEXPLORE.EXE. This is a common trick used by malware to make its traffic appear\n\nto originate from a browser, thus arousing much less suspicion.\n\nWhile running, however, Smoaler keeps a lookout for processes called vsserv.exe,\nfsdfwd.exe, AvastSvc.exe, uiWatchDog.exe, and avp.exe. It avoids injecting\n\nitself into Internet Explorer if any of them are active.\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    7](http://www.sophos.com/legal)\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\nThese processes belong to various security products, so this is a malware\nprecaution often jocularly called anti-anti-virus, intended to avoid suspicious\nactivity that might attract the attention of security software.\n\nAfter installing itself, Smoaler attempts to connect to its C&C servers. The domain\nnames it uses are already known from earlier Tibet-related malware attacks:\ndtl.dnsd.me, dtl.eauto.com and dtl6.moo.com.\n\n### What happens next?\n\nUnfortunately, we can't say precisely how an infected computer will behave if\nSmoaler gets this far.\n\nThat is because the content that the primary Smoaler DLL fetches from its C&C\nservers is whatever malware the attackers choose to serve up next.\n\nWorse still, the programs downloaded by Smoaler are not in regular EXE or DLL\nformat.\n\nFirstly, the downloads are encrypted; secondly, their headers are stripped off so\nthat, even decrypted, they are not immediately obvious as programs; thirdly, they\nare loaded directly into, and run directly from, memory, rather then being written\nto disk and launched via the Windows API.\n\nThat means that if you kill off the Smoaler process and delete its primary\nexecutable, as you will almost certainly want to do if you find out that you are\ninfected, you may no longer have a complete copy of the malware to submit for\nanalysis.\n\nIn this way, the Smoaler authors avoid showing all the cards in their hand at once,\nin the hope of staying one step ahead.\n\nHowever, this multi-stage approach also has a significant disadvantage for\ncybercriminals: there are now multiple points in the attack at which you can spot\nan anomaly, intervene, and win.\n\n### Prevention is better than cure\n\nMalware like Smoaler is a strong reminder of why proactivity and prevention are\nbetter than cure: once you are infected, it can be hard to go back and unravel\nwhat happened, because of the tricks that the malware uses along the way.\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    8](http://www.sophos.com/legal)\n\n\n-----\n\nPlugX revisited: introducing “Smoaler”                                     Gabor Szappanos, SophosLabs\n\n### References\n\n[A] http://nakedsecurity.sophos.com/inside-the-plugx-malware\n\n[B] http://www.cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0158\n\n### For further security information\n\nhttp://www.sophos.com/why-sophos/our-people/technical-papers.aspx\n\nhttp://nakedsecurity.sophos.com/\n\nhttp://podcasts.sophos.com/\n\n[© 2013 Sophos Ltd. All rights reserved. Visit www.sophos.com/legal for more information.                    9](http://www.sophos.com/legal)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/dfdg420iygjtz1rmou2ps14zi25l7tfb",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.07.15.PlugX_Smoaler/Plugx_Smoaler.pdf"
    ],
    "report_names": [
        "Plugx_Smoaler"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1373908618,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/9a7978041e795b788d86c52a477160dae296413b.pdf",
        "text": "https://archive.orkl.eu/9a7978041e795b788d86c52a477160dae296413b.txt",
        "img": "https://archive.orkl.eu/9a7978041e795b788d86c52a477160dae296413b.jpg"
    }
}