{
    "id": "14e18316-f382-4455-bd81-7ebb5b62083d",
    "created_at": "2023-01-12T15:02:58.985052Z",
    "updated_at": "2025-03-27T02:10:04.380035Z",
    "deleted_at": null,
    "sha1_hash": "e1cd28c2656dc9f26cc7aa1f29e18cebf15afe95",
    "title": "2021-01-19 - FreakOut – Leveraging Newest Vulnerabilities for creating a Botnet",
    "authors": "",
    "file_creation_date": "2022-05-29T01:10:41Z",
    "file_modification_date": "2022-05-29T01:10:41Z",
    "file_size": 3232264,
    "plain_text": "# FreakOut – Leveraging Newest Vulnerabilities for creating a Botnet\n\n**[research.checkpoint.com/2021/freakout-leveraging-newest-vulnerabilities-for-creating-a-botnet/](https://research.checkpoint.com/2021/freakout-leveraging-newest-vulnerabilities-for-creating-a-botnet/)**\n\nJanuary 19, 2021\nResearch By: Omer Ventura, Ori Hamama, Network Research\n\n## Introduction\n\n\nJanuary 19, 2021\n\n\nRecently, Check Point Research encountered several attacks that exploited multiple vulnerabilities, including some that were only recently\npublished, to inject OS commands. The goal behind the attacks was to create an IRC botnet, which can later be used for several purposes,\nsuch as DDoS attacks or crypto-mining.\n\nThe attacks aim at devices that run one of the following:\n\nTerraMaster TOS(TerraMaster Operating System) – the operating system used for managing TerraMaster NAS (Network Attached\nStorage) servers\nZend Framework – a collection of packages used in building web application and services using PHP, with more than 570 million\ninstallations\nLiferay Portal – a free, open-source enterprise portal. It is a web application platform written in Java that offers features relevant for the\ndevelopment of portals and websites\n\n**Figure 1: The products attacked by the campaign.**\n\nEach of the infected devices can be later used as an attacking platform, thus making the attack flow recursive. In a later variant, Xmrig causes\nthe victim’s device to engage in coin-mining.\n\n## FreakOut Infection Chain\n\n\n-----\n\n**Figure 2: The attack flow of the campaign.**\n\nThe campaign exploits these recent vulnerabilities: CVE-2020-28188, CVE-2021-3007 and CVE-2020-7961. These allow the attacker to\nupload and execute a Python script on the compromised servers.\n\n### CVE-2020-28188\n\nThe vulnerability is caused by a lack of input validation in the “event” parameter in the “makecvs” PHP page (/include/makecvs.php). This\nallows a remote unauthenticated attacker to inject OS commands, and gain control of the servers using TerraMaster TOS (versions prior to\n4.2.06).\n\n**Figure 3: The attack exploiting CVE-2020-28188 as seen in our sensors.**\n\n### CVE-2021-3007\n\nThis vulnerability is caused by the unsecured deserialization of an object. In versions higher than Zend Framework 3.0.0, the attacker abuses\nthe Zend3 feature that loads classes from objects in order to upload and execute malicious code in the server. The code can be uploaded\nusing the “callback” parameter, which in this case inserts a malicious code instead of the “callbackOptions” array.\n\n**Figure 4: The attack exploiting CVE-2021-3007 as seen in our sesnors.**\n\n### CVE-2020-7961\n\n\n-----\n\ne u e ab ty s a Ja a u a s a g u e ab ty a JSO S e ay o ta ( e s o s p o to C G ) a s a g, c s\nsimilar to serialization, is used for communication with remote objects, in our case with a serialized object. Exploiting the vulnerability lets the\nattacker provide a malicious object, that when unmarshalled, allows remote code execution.\n\n**Figure 5: The attack exploiting CVE-2020-7961 as seen in our sensors.**\n\nIn all the attacks involving these CVEs, the attacker’s first move is to try running different syntaxes of OS commands to download and execute\na Python script named “out.py”.\nAfter the script is downloaded and given permissions (using the “chmod” command), the attacker tries to run it using Python 2. Python 2\nreached EOL (end-of-life) last year, meaning the attacker assumes the victim’s device has this deprecated product installed.\n\n## The Python Code – out.py\n\nThe malware, downloaded from the site https://gxbrowser[.]net, is an obfuscated Python script consisting of polymorphic code. Many of the\nfunction names remain the same in each download, but there are multiple functions that are obfuscated using random strings generated by a\npacking function. The first attack trying to download the file was observed on January 8, 2021. Since then, hundreds of download requests\nfrom the relevant URL were made.\n\n**Figure 6: The __init__ function of the main class of the code “out.py”. The code is obfuscated and encoded with several different functions.**\nEach time it is downloaded, the code is obfuscated anew. differently.\n\n\n-----\n\ne e sea c ed o t e e e a t do a a d e us ota ( ), e ou d ot e codes ca ed out py\nThese files were uploaded only a few hours before the attacks began, and had low scores of detections by the AVs presented in VirusTotal. All\nthe files originated from the same domain, hxxp://gxbrowser[.]net, as this address is hardcoded in all scripts and is the only address that\nappears.\n\n**Figure 7: Other codes related to the domain and IP. Both are Python-based although the second is classified as Java.**\n\nWhen we examined the first variation uploaded to VT (the third one in Fig.7) with our script, and compared the codes and their functions, it\nseemed to be a slightly earlier version of the code.\n\n**Figure 8: Comparing the different files. They have some similarities in function names and comments that shed some light on the more**\nobfuscated code.\n\nThe code itself is less obfuscated, includes comments, and seems to be related to our attacker.\n\n**Figure 9: An earlier version of the same function presented in Fig.6. This time it contained developer comments revealing some of the**\nvariables’ purposes.\n\nIn addition, in this version, the attacker left a calling card with relevant information, including the code developer’s name and an update that\ntook place on January 1, 2021. All this information was omitted in the version we studied\n\n\n-----\n\n**Figure 10: A calling card left in the earlier version of the code.**\n\nComparing the two codes and the different comments helped reveal the code communication methods, the capabilities and the threat actor\nbehind it.\n\n## The Malware Capabilities\n\nAt this point, the facilities and capabilities of the malware became clearer.\n\nThere is a specific function for each of the main capabilities, making the code very modular and easy to change or maintain:\n\nPort Scanning utility\nCollecting system fingerprint\n\nIncludes the device address (MAC, IP), and memory information. These are used in different functions of the code for different\nchecks\nTerraMaster TOS version of the system\nCreating and sending packets\n\nARP poisoning for Man-in-the-Middle attacks.\nSupports UDP and TCP packets, but also application layer protocols such as HTTP, DNS, SSDP, and SNMP\nProtocol packing support created by the attacker.\nBrute Force – using hard coded credentials\n\nWith this list, the malware tries connecting to other network devices using Telnet. The function receives an IP range and tries to\nbrute force each IP with the given credential. If it succeeds, the results of the correct credential are saved to a file, and sent in a\nmessage to the C2 server\nHandling sockets\n\nIncludes handling exceptions of runtime errors.\nSupports multi-threaded communication to other devices. This allows simultaneous actions the bots can perform while listening to\nthe server\nSniffing the network\n\nExecutes using the “ARP poisoning” capability. The bot sets itself as a Man-in-the-Middle to other devices. The intercepted data is\nsent to the C2 server\nSpreading to different devices, using the “exploit” function.\n\nRandomly generates the IPs to attack\nExploits the CVEs mentioned above (CVE-2020-7961, CVE-2020-28188, CVE-2021-3007)\nGaining persistence by adding itself to the rc.local configuration.\nDDOS and Flooding – HTTP, DNS, SYN\n\nSelf-implementation of Slowlaris. The malware creates many sockets to a relevant victim address for the purpose of instigating a\nDDoS attack\nOpening a reverse-shell – shell on the client\nKilling a process by name or ID\nPacking and unpacking the code using obfuscation techniques to provide random names to the different functions and variables\n\n\n-----\n\n**Figure 11: Part of the function exploit, which is responsible for the spreading attempts. Exploits CVE-2020-7961, CVE-2020-28188 and CVE-**\n2021-3007, after clarification.\n\n## The Malware’s Communication\n\nEach infected device is configured to communicate with a hardcoded C2 server. All the connection credentials are obfuscated and encoded in\nthe code itself multiple times, and are generated using multiple functions.\n\nAt the initial connection to the server, the conversation begins with the client sending a “NICK message”, which declares the user nickname.\nThe nickname is generated with this format:\n\n**[HAX|System OS|Machine Type|CPU count] 8-12 random letters**\n\nAn example of the bot nickname as created by the script:\n\n**[HAX|Linux|x86_64|3] QCRjbbnQm**\n\nAfter declaring the nickname of the client, the client sends the username, which is the nickname plus the IRC address and the string “localhost\n:”, followed by the bot nickname. When the server accepts this message, the communication begins.\n\nFollowing a quick back and forth set of Ping-Pong messages, the server provides the client server information about the channels. Then, one\nminute later, the client can join channels on the server.\n\nIn FreakOut, the relevant channel was “#update” on the server “gxbrowser[.]net”. The user must provide a channel key, used as a password,\nto connect to the channel. The key can be extracted from the code, and is equal to the string “N3Wm3W”.\n\n\n-----\n\n**Figure 12: Communication with the server. Initiates the conversation with the relevant messages.**\n\nThe client can now be used as a part of a botnet campaign and accepts command messages from the server to execute. The commands are\nsent using a symbols-based communication. Each message sent by the server is parsed and split into different symbols, with each one having\na different meaning.\n\nEvery message includes the command name (i.e: udpflood, synflood) and the rest of the arguments change accordingly. When the client\nfinishes executing the relevant command as received from C2, it then sends the results in a private message (PRIVMSG IRC command) to the\nrelevant admin in the channel, providing it with relevant details.\n\n\n-----\n\n**gu e** **3 Co** u cat o t t e se e e se e accepts co a ds t e o at e t o ed abo e\n\n## The Impact\n\nBased on the malware features, it seems that the attacker can use the compromised systems for further attacks, such as using the system\nresources for crypto-mining, spreading laterally across the company network, or launching attacks on outside targets while masquerading as\nthe compromised company. We revealed further information about FreakOut when we used the algorithm-created credentials to connect to the\nserver. After logging in, additional server information is provided to the client, including the room’s capacity, the users connected and even\noperators and unknown connections.\n\n**Figure 14: After logging in, more information is provided about the server.**\n\nThe server was created in late November 2020 and has been running ever since with 300 current users and 5 channels. Exploring the different\nchannels revealed a very active one, called #update. This channel includes 186 exploited devices communicating with the server, as seen in\nthe messages exchanged between the IRC server and the client, and in the channel page:\n\n\n-----\n\n**Figure 15: The #update channel, as seen in the IRC communication with the malware and in the IRC channel surfed through a web interface.**\n\nWe observed two additional channels called “opers” (which probably stands for operators as we have seen the server admin there), and\n“andpwnz”. The network name of the server is called “Keknet”. Due to the fact the file was updated and released in January 2021, we believe\nthis scale was reached in less than a week. Therefore, we can assume that this campaign will ratchet up to higher levels in the near future.\n\n## Threat Actors\n\nTo identify the threat actors responsible for the attacks, we searched for leads in the internet and social media. Searching for both the code\nauthor, who goes by the name “Freak” (which we have also seen in the IRC server channels) and the IRC bot name “N3Cr0m0rPh”, revealed\ninformation about the threat actor behind the campaign.\n\nIn a post published on HackForums back in 2015, submitted by the user “Fl0urite” with the title “N3Cr0m0rPh Polymorphic IRC BOT”, the bot is\noffered for sale in exchange for BitCoins (BTC). This bot seem to have many of the same capabilities as the current one, and the same\ndescription as the current bot in the calling card. However, some of the features were omitted over the years, such as the USB worm and the\nregedit ability.\n\n\n-----\n\n**Figure 16: The post submitted by “Fl0urite” back in 2015. The name of the IRC bot is the same, with many similar capabilities.**\n\nThe name “Fl0urite” is mentioned in other hacking forums and GitHub, and is associated with multiple pieces of code which can be found on\nthese sites that resemble the current malware code functions.\n\n[As mentioned previously, “[email protected]” appears to be the author of the latest code version. When we searched for these strings, we](https://research.checkpoint.com/cdn-cgi/l/email-protection)\nfound several results, including an earlier version of the malware code (V6). In this version, however, the author left a comment, explaining the\ncode is a free tool and that redistribution is allowed.\n\n\n-----\n\n**Figure 17: Version 6 of the code.**\n\nAs mentioned previously, the admin in the IRC channel is also called “Freak.”\n\n**Figure 18: The user “Freak” joins and leaves the #update channel on the server.**\n\nIn early 2015 codes found on Pastebin, that were uploaded by the user “Keksec”, there seems to be a link between the two identities “Fl0urite”\nand “Freak” in several files. In addition, there is a link to the user “Fl0urite” on HackForums in these files signed by “Freak.” The other files\n[uploaded by the user are signed with the exact string “[email protected] (aka sudoer)” that seems to be associated with the malware functions](https://research.checkpoint.com/cdn-cgi/l/email-protection)\nas well. Based on this evidence, we conclude that both identities belong to the same person.\n\nIn the Pastebin, there are also files that were uploaded recently (January 12, 2021).\n\n\n-----\n\n**Figure 19-20: Files uploaded to Pastebin. The author presents himself as Freak/Fl0urite. The address is related to the user “Fl0urite” in Hack**\n[Forums, while later files uploaded are signed only with “[email protected]”](https://research.checkpoint.com/cdn-cgi/l/email-protection)\n\nThe URL of the site gxbrowser[.]net reveals the following page:\n\n**Figure 21: The index page of gxbrowser[.]net**\n\nThe page has the names “keksec” and “Freak” which were observed in the Pastebin files, and is also associated with the name “Keknet” seen\nin the IRC server.\n\n\n-----\n\nCu e t y, t see s t at ea s us g t to c eate a bot et\n\nOn VT, and on the relevant Pastebin mentioned previously, there are other files related to the domain such as Crypto-mining malwares. In the\nlatest code downloaded (January 12, 2021), it seems that the malware tries to exploit the vulnerabilities to install the Xmrig from the server\nhxxp://gxbrowser[.]net.\n\n**Figure 22: The file xmrig1 on the server gxbrowser[.]net**\n\n**Figure 23: Exploit function in the newest edition of the script – clarified. The file “xmrig1” is also downloaded.**\n\n## Conclusion\n\nFreakOut is an attack campaign that utilizes three vulnerabilities, including some newly released, to compromise different servers. The threat\nactor behind the attack, named “Freak”, managed to infect many devices in a short period of time, and incorporated them into a botnet, which\nin turn is used for DDoS attacks and crypto-mining. Such attack campaigns highlight the importance of taking sufficient precautions and\nupdating your security protections on a regular basis. As we have observed, this is an ongoing campaign that can spread rapidly.\n\n## MITRE ATT&CK TECHNIQUES\n\n\n**Initial**\n**Access**\n\nExploit\nPublicFacing\nApplication\n(T1190)\n\n\n**Resource**\n**Development**\n\nAcquire\ninfrastructure:\nDomains\n(T1583/003)\n\n\n**[Execution](https://attack.mitre.org/tactics/TA0002)** **[Persistence](https://attack.mitre.org/tactics/TA0003)** **Privilege**\n**Escalation**\n\n\nExploitation\nfor Client\nExecution\n(T1203)\n\n\n**[Defense Evasion](https://attack.mitre.org/tactics/TA0005)** **Credential**\n**Access**\n\n\n**[Discovery](https://attack.mitre.org/tactics/TA0007/)** **Lateral**\n**Movement**\n\n\n**[Colle](https://attack.mitre.org/tactics/TA0009)**\n\nNetw\nSniff\n(T10\n\n\nEvent\nTriggered\nExecution:\n.bash_profile\nand .bashrc\n(T1546/004)\n\n\nEvent\nTriggered\nExecution:\n.bash_profile\nand .bashrc\n(T1546/004)\n\n\nDeobfuscate/Decode\nFiles or Information\n(T1140)\n\n\nBrute Force\n(T1110)\n\n\nNetwork\nService\nScanning\n(T1046)\n\n\nRemote\nServices\n(T1021)\n\n\n-----\n\nCompromise\nInfrastructure:\nBotnet\n(T1584/005)\n\n## Protections\n\n\nCommand\nand\nScripting\nInterpreter\n(T1059)\n\nCommand\nand\nScripting\nInterpreter:\nPython\n(T1059/006)\n\nCommand\nand\nScripting\nInterpreter:\nUnix Shell\n(T1059/004)\n\n\nFile and Directory\nPermissions\nModification: Linux\nand Mac File and\nDirectory\nPermissions\nModification\n(T1222/002)\n\n\nMan-in-theMiddle:\nARP Cache\nPoisoning\n(T1557/002)\n\n\nExploitation\nof Remote\nServices\n(T1210)\n\n\nData\nStag\nLoca\nStag\n(T10\n\n\nCheck Point customers are protected by these protections:\n\n**IPS**\n\nTerraMaster TOS Command Injection (CVE-2020-28188).\nLiferay Portal Insecure Deserialization (CVE-2020-7961).\nZend Framework Remote Code Execution (CVE-2021-3007).\nCMD Injection Over HTTP\n\n**Anti-Bot**\n\nWin32.IRC.G\nN3Cr0m0rPh.TC.a\nWin32.N3Cr0m0rPh.TC.a\nWin32.N3Cr0m0rPh.TC.b\nWin32.N3Cr0m0rPh.TC.c\nWin32.N3Cr0m0rPh.TC.d\n\n## IOCs\n\nhxxp://gxbrowser[.]net\n7c7273d0ac2aaba3116c3021530c1c868dc848b6fdd2aafa1deecac216131779 – out.py (less obfuscated)\n05908f2a1325c130e3a877a32dfdf1c9596d156d031d0eaa54473fe342206a65 – out.py (more obfuscated)\nac4f2e74a7b90b772afb920f10b789415355451c79b3ed359ccad1976c1857a8 – out.py (including the xmrig1 installation)\nac6818140883e0f8bf5cef9b5f965861ff64cebfe181ff025e1f0aee9c72506cOut – xmrig1\n\n## References\n\nhttps://kiwiirc.com/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-19 - FreakOut – Leveraging Newest Vulnerabilities for creating a Botnet.pdf"
    ],
    "report_names": [
        "2021-01-19 - FreakOut – Leveraging Newest Vulnerabilities for creating a Botnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a270f6c-2c13-4abf-861e-7d44dcfa5ceb",
            "created_at": "2023-11-03T02:00:07.794425Z",
            "updated_at": "2025-03-27T02:00:03.146871Z",
            "deleted_at": null,
            "main_name": "Keksec",
            "aliases": [],
            "source_name": "MISPGALAXY:Keksec",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535778,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1653786641,
    "ts_modification_date": 1653786641,
    "files": {
        "pdf": "https://archive.orkl.eu/e1cd28c2656dc9f26cc7aa1f29e18cebf15afe95.pdf",
        "text": "https://archive.orkl.eu/e1cd28c2656dc9f26cc7aa1f29e18cebf15afe95.txt",
        "img": "https://archive.orkl.eu/e1cd28c2656dc9f26cc7aa1f29e18cebf15afe95.jpg"
    }
}