{
    "id": "150e2a8b-d50c-45e0-a41b-df88d0d74432",
    "created_at": "2023-01-12T15:07:44.706315Z",
    "updated_at": "2025-03-27T02:08:42.772394Z",
    "deleted_at": null,
    "sha1_hash": "3a4d4118c595c2f8d9ab025e99c9acc702fcb859",
    "title": "2020-02-29 - Meet the white-hat group fighting Emotet, the world's most dangerous malware",
    "authors": "",
    "file_creation_date": "2022-05-27T22:40:40Z",
    "file_modification_date": "2022-05-27T22:40:40Z",
    "file_size": 1547193,
    "plain_text": "# Meet the white-hat group fighting Emotet, the world's most dangerous malware\n\n**[zdnet.com/article/meet-the-white-hat-group-fighting-emotet-the-worlds-most-dangerous-malware/](https://www.zdnet.com/article/meet-the-white-hat-group-fighting-emotet-the-worlds-most-dangerous-malware/)**\n\n[Home Innovation Security](https://www.zdnet.com/)\nA private group of 20+ security researchers and system administrators have been waging a silent war against Emotet, today's most dangerous\nmalware operation.\n\nWritten by Catalin Cimpanu, Contributor on Feb. 29, 2020\n\n\n-----\n\nCryptolaemus\n\n\nBackground image via Guido Bohne (CC-BY-SA-2.0)\n\n## Special feature\n\n\n-----\n\n### Spec a epo t g st ategy o cybe secu ty ( ee )\n\nThis ebook, based on the latest ZDNet/TechRepublic special feature, offers a detailed look at how to build risk management policies to protect\nyour critical digital assets.\n\nRead now\nFor more than a year, a group of security researchers and system administrators have banded together to fight back against Emotet, today's\nmost active and dangerous malware operation.\n\n[By working together, the Cryptolaemus group has seriously hindered Emotet operations. Daily, the group publishes updates on its website and](https://paste.cryptolaemus.com/)\n[Twitter account. They share so-called indicators of compromise (IOCs). These include IP addresses for Emotet command servers, subject](https://twitter.com/Cryptolaemus1)\nlines used in Emotet spam campaigns, and file hashes for Emotet-infected files.\n\n**Also:** **[30 years of ransomware: How one bizarre attack laid the foundations for the malware taking over the world](https://www.zdnet.com/article/30-years-of-ransomware-how-one-bizarre-attack-laid-the-foundations-for-the-malware-taking-over-the-world/)**\n\nThe Cryptolaemus members share these details so that system and network administrators around the world can import the IOCs into their\ncyber-security products and protect against possible Emotet infections, or help with early detections before the malware can do extensive\ndamage.\n\n[\"Personally, I just want to help people and stop this threat,\" said Joseph Roosen, one of the Cryptolaemus members.](https://twitter.com/JRoosen)\n\n\"When Emotet infected my network at my day job in November of 2017, it was only stopped by us having a rather robust VLAN scheme, and\ntherefore lateral movement was isolated and easier to clean up,\" Roosen said.\n\n\"However, the experience changed my life, though, and pissed me off at the same time.\"\n\n### Emotet -- from banking trojan to cybercrime empire\n\nThe reason for Roosen's anger was Emotet, a name that describes both a malware strain and the criminal operation behind it.\n\nEmotet appeared online in 2014. It began its operations as a banking trojan. Banking trojans were all in the rage in the mid-2010s.\n\nEmotet would infect a victim, lurk around on a system until the user would access its bank account, steal the user's credentials, and then allow\nthe Emotet gang to access the bank account and steal funds.\n\n**SEE:** **[Cybersecurity: Let's get tactical (ZDNet/TechRepublic special feature) |](https://www.zdnet.com/topic/cybersecurity-lets-get-tactical/)** **[Download the free PDF version (TechRepublic)](https://www.techrepublic.com/resource-library/whitepapers/cybersecurity-let-s-get-tactical-free-pdf/)**\n\nBut by 2014, banks had already faced banking trojans in the likes of Emotet for more than a decade, and they were starting to deploy antifraud measures. Multi-factor authentication systems, IP geo-fencing, and transaction alerts made stealing funds from someone's bank account\nwithout their knowledge much harder.\n\nThe Emotet gang saw the writing on the wall, and in the spring and summer of 2016, they became one of the first major banking trojan\noperations to morph into something else.\n\nDuring 2016 and the next year, in 2017, Emotet slowly replaced most of its codebase and transformed itself from a banking trojan into a\nmalware loader.\n\nA \"loader\" is an incredibly simplistic malware strain. It infects a victim and then downloads (or loads) other malware. Emotet would download\nits own modules, or it would download someone else's malware.\n\nBasically, Emotet shifted its entire mode of operation in only two years, from a closed group that stole money from people's bank accounts, into\nan open group that allowed other malware gangs to rent access to infected computers all over the world.\n\nNowadays, Emotet is one of the biggest \"loader\" operations on the market. It's effectively a cybercrime empire. They're so big that other\n[\"loaders\" -- like TrickBot -- rent access to its huge network of infected computers.](https://www.zdnet.com/article/trickbot-hackers-create-new-stealthy-backdoor-for-high-value-targets/)\n\nRansomware, crypto-miners, info-stealers, and banking trojans have been seen being planted on Emotet-infected hosts.\n\n\n-----\n\nemotet infographic.png\n\n\nImage: Sophos\nNowadays, an Emotet infection means much more than many other malware infections. An Emotet infection usually means that Emotet has\nalso expanded its reach from the initial point of entry to your entire network.\n\nEmotet now comes with a plethora of modules that allow it to spread inside a network once it gets a foothold inside it. Its lateral movement\n[tools are so advanced it's now pioneering a novel method of spreading via Wi-Fi connections, something not seen in any other malware](https://www.zdnet.com/article/emotet-trojan-evolves-to-spread-via-a-wifi-connection/)\noperation.\n\nEmotet is a litmus test for the infosec (information security) community. If a security researcher is playing down an Emotet infection, then\n[they've most likely lost touch with what's what in the malware world. All good security researchers will tell you that Emotet is one of the most](https://www.zdnet.com/article/what-is-malware-everything-you-need-to-know-about-viruses-trojans-and-malicious-software/)\ndangerous infections you can get, right next to TrickBot, another similar banking-trojan-turned-downloader operation.\n\nAuthorities in Germany and the Netherlands currently treat Emotet the same way as they do ransomware attacks. When a company gets\ninfected with Emotet, cyber-security authorities in those two countries tell the victim company to shut down its entire network and immediately\ntake it off the internet. Emotet infections left to run wild eventually turn into data breaches and ransomware infections.\n\n\n-----\n\n### Getting together to fight Emotet\n\nIt was in June 2018 when the idea of an anti-Emotet group came to be. In a Twitter group chat, a US-based system administrator named\n[JayTHL asked \"Any interest in a dedicated Emotet working group?\"](https://twitter.com/JayTHL)\n\nAlmost all in the chat said yes.\n\n\"Before you know it, we are chatting daily about Emotet TTPs (Tactics, Techniques, and Procedures) and sharing intel,\" Roosen told ZDNet in\nan interview.\n\n\"Eventually, after things got going, we started to add more members and made a joint effort to publish our IoCs instead of doing it as individual\npiecemeal stuff,\" Roosen added.\n\nThat's how a formal group came to be.\n\nWhen it came to naming it, they had the perfect title.\n\n[\"This name -- Cryptolaemus -- is based on the genus of beetles that are known to be 'Mealybug destroyers',\" Roosen said.](https://en.wikipedia.org/wiki/Cryptolaemus)\n\n[\"Back in the summer of 2018, Symantec had published a threat intel blog claiming that the name for the Emotet actors was 'Mealybug',\"](https://www.symantec.com/blogs/threat-intelligence/evolution-emotet-trojan-distributor)\nRoosen said.\n\n\"None of us had heard of this before and scratched our heads as to where this came from. It quickly became somewhat of a joke to us that we\nwere the destroyers of Mealybug(s), and thus, the Cryptolaemus name was born.\"\n\nThe Cryptolaemus name idea came from a security researcher going on Twitter by [@ps66uk, a trained biologist, showing how diverse the](https://twitter.com/ps66uk)\ngroup was becoming.\n\n[Now, the Cryptolaemus team lists over 20 members on its website, but their ranks are far larger. Many can't disclose their affiliation with the](https://paste.cryptolaemus.com/about/)\ngroup due to non-disclosure agreements they've signed. Some work as IT administrators for big corporations while others work at cybersecurity firms. Most work on contracts that don't allow them to share threat intel freely on the internet.\n\nHowever, many are doing it anyway.\n\n### Taking down Emotet one water drop at a time\n\nThey're doing it because they want to see Emotet shut down and its mastermind -- an individual known only as Ivan -- arrested and behind\nbars.\n\nBut bringing down Emotet is not an easy feat. Emotet is one of the most sophisticated malware operations known to date. It operates from\nthree distinct botnets, not just one, created for this very same reason -- to make takedowns harder.\n\nFurthermore, Ivan is believed to reside in Russia, a country that hasn't been too forthcoming in helping take down local cybercrime operations.\n\n[\"I'd love it if they were arrested, but if they just give up, I'll be happy too,\" said James Quinn, a malware analyst at Binary Defense and a](https://twitter.com/lazyactivist192)\nCryptolaemus member.\n\nMaking Emotet and Ivan give up, or tap out, is what Cryptolaemus members have in mind. Most know that an arrest or a takedown is far away.\n\nInstead, they hope that by sharing daily Emotet IOCs they can cut into Emotet's infection rate and into Ivan's profits.\n\nRight now, Cryptolaemus members have regular meetings in Slack and Telegram channels, where they discuss new ways to hinder Emotet.\nSome spend their time reverse-engineering Emotet malware payloads, others track the botnet's command and control servers, while others\ncrack encryption and other Emotet-related protocols.\n\nTheir efforts have not gone unnoticed. Today, the group's work is often closely followed by law enforcement and cyber-security firms alike. But\nCryptolaemus' biggest fan is the Emotet gang itself.\n\n\"I am quite sure they are aware and reading our daily reports,\" Roosen said.\n\n\"We have seen them change tactics minutes after our posts, often enough that it is more than simple coincidence. I am quite sure they are part\nof the many reading our posts as soon as they go live,\" the researcher added.\n\n\"We have even joked that they are now calling the three botnets as Epoch 1, Epoch 2, and Epoch 3 internally [based on the names we\nassigned them].\"\n\n### A stalemate\n\n\n-----\n\ng t o, t e g t bet ee C ypto ae us a d otet appea s to be a sta e ate; o e e, t e g oup s e o ts a e de y app ec ated a d\nrespected in the infosec community, where, slowly but surely, the group's members have become de-facto Emotet experts, whose opinions are\nalways highly valued.\n\nBut while the Cryptolaemus group may never get their wish to see Ivan in handcuffs, the group is still pretty happy at how things turned out.\n\n\"Honestly, seeing the amount of cooperation in the group is really cool, because some of us literally work for direct competitors of each other,\nbut we're still able to work together and push out IOCs, which is rare to see in the industry,\" Quinn said.\n\n\"I learn something new every day it seems, and I am helping the world,\" Roosen said. \"To me, this is a win-win! I am truly touched by people\nreaching out to us explaining how we have helped them in their battles with Emotet.\n\n\"I think we have had some minor victories in this fight with the Emotet actors, but our greatest single accomplishment is the open collaboration\nand sharing amongst different entities in the industry,\" Roosen added.\n\n\"Because we are viewed as a neutral party, people will work together with us more freely, and through that collaboration, we have\naccomplished great things together.\"\n\n**The FBI's most wanted cybercriminals**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-29 - Meet the white-hat group fighting Emotet, the world's most dangerous malware.pdf"
    ],
    "report_names": [
        "2020-02-29 - Meet the white-hat group fighting Emotet, the world's most dangerous malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536064,
    "ts_updated_at": 1743041322,
    "ts_creation_date": 1653691240,
    "ts_modification_date": 1653691240,
    "files": {
        "pdf": "https://archive.orkl.eu/3a4d4118c595c2f8d9ab025e99c9acc702fcb859.pdf",
        "text": "https://archive.orkl.eu/3a4d4118c595c2f8d9ab025e99c9acc702fcb859.txt",
        "img": "https://archive.orkl.eu/3a4d4118c595c2f8d9ab025e99c9acc702fcb859.jpg"
    }
}