{
    "id": "15342ce0-d8e1-4df0-8ff4-9be815b6587b",
    "created_at": "2022-10-25T16:48:11.139158Z",
    "updated_at": "2025-03-27T02:09:18.2822Z",
    "deleted_at": null,
    "sha1_hash": "3a894221bb3da2727d2574250fe2447561f4ded9",
    "title": "Microsoft Word - Cuba Ransomware Group - on a roll.docx",
    "authors": "",
    "file_creation_date": "2021-04-29T19:33:25Z",
    "file_modification_date": "2021-04-29T19:33:25Z",
    "file_size": 2994806,
    "plain_text": "## Cuba Ransomware Group\n\n on a Roll here\n\n### Published\n\n# April 2021\n\nCopyright\n\nPage 1\n\n2021\n\n\n-----\n\n#### 1.1 Executive Summary\n\nAt the end of 2020, our team, made up of SecurityJoes and Profero incident responders, led\n\nan investigation into a complex attack in which hundreds of machines were encrypted,\n\nknocking the victim company offline completely. The threat actors behind the attack deployed\n\nthe Cuba ransomware across the corporate network, using a mixture of PowerShell scripts,\n\nSystemBC, and Cobalt Strike to propagate it. Cuba Ransomware utilizes the symmetric\n\nChaCha20 algorithm for encrypting files, and the asymmetric RSA algorithm for encrypting\n\nkey information. As a result, the files could not be decrypted without the threat actor's\n\nprivate RSA key.\n\nIn the days following the attack, our incident responders investigated the modus operandi of\n\nthe threat actors, their malicious software and lateral movement tools. Simultaneously, we\n\ninitiated negotiations with the attackers, who over the course of the investigation, we\n\ndiscovered are Russian speakers, due to a simple translation mistake on their part.\n\nUnfortunately, due to several essential missing links, we were unable to approximate the\n\nattackers’ location, and as a result, their whereabouts remain unknown. Negotiations\n\nconcluded with the ransom being paid, and with the successful receipt of a decryptor. After\n\nwe determined the decryptor contained no malicious code within, and confirmed that it did in\n\nfact decrypt the encrypted files, we deployed it across the network, allowing operations to\n\nresume.\n\nThe discovered ransomware binary was generic. It utilized implemented algorithms for\n\nencryption and stored strings in plaintext—however, it was wrapped with several layers of\n\nobfuscation and packers.\n\nBased on these factors, we believe the attackers are not state-sponsored, instead operating\n\nsimply as a threat group. They are fast acting, and seem to prefer to communicate via\n\nemail—they generally launch their attacks by setting up email accounts to initiate\n\ncommunication a few days in advance of deploying ransomware. Additionally, based on\n\nransom notes we’ve discovered through pivoting, it’s clear the actors often use ProtonMail\n\nas their primary email host.\n\nCopyright\n\nPage 2\n\n2021\n\n\n-----\n\n#### 1.2 Technical Details\n\n##### 1.2.1 Overview\n\nWhile Cuba Ransomware has purportedly been active for a few years, they’ve only recently\n\ngained notoriety, primarily for publishing leaked documents from infected companies that\n\nresisted their blackmail attempts. One of their more recent targets was the Automatic Funds\n\nTransfer Services, whose stolen data was listed on the actor’s .onion site and is thought to\n\ncontain sensitive information such as bank employee correspondence, balance sheets, tax\n\ndocuments, and other financial documents.\n\nFor the attack we investigated, the threat actors used a variety of tools to propagate through\n\nthe network, before landing on two servers they engaged as main distribution points. They\n\nused PSEXEC to distribute the Cuba Ransomware binary, which led to the encryption of a\n\nlarge number of network machines.\n\nUpon execution, Cuba begins to encrypt all files on the infected machine, dropping its\n\nransom note to each directory under the name “!!FAQ for Decryption!!.txt”. Unlike other\n\nransomware families, the ransom note does not include a key for identification—it is more\n\nsophisticated, indicating this threat group likely performs a low volume of attacks against\n\nhigh-value organizations. The Cuba note informs the victim that all their files are encrypted,\n\nand invites them to contact the group via email to send payment in exchange for a\n\ndecryptor.\n\nDropped Ransomware Note\n\nBased on our experience with these threat actors, we can confirm they do indeed provide a\n\nvalid decryptor upon payment. However, because we are unable to determine whether\n\npaying victims get retargeted, we recommend that the ransom should not be paid.\n\nCopyright\n\nPage 3\n\n2021\n\n\n-----\n\n##### 1.2.2 Infection Chain\n\nDuring our investigation, we discovered a batch file that had been dropped onto a core\n\nsystem, together with two PowerShell scripts. Interestingly, one of the PowerShell scripts and\n\nthe batch file were named based on the last octet of the C2 server they reached out to (for\n\nexample 182.ps1 and 182.bat if the C2 is 185.153.196.182). After collaborating with McAfee\n\nATR during their investigation of Cuba Ransomware, we confirmed that this was, in fact, a\n\ncampaign identifier, rather than a coincidence. The second PowerShell script was aptly\n\nnamed socks1.ps1 and involved execution of SystemBC.\n\nThe deployed batch file was utilized for disabling the EDR/AV on the infected system, as\n\nwell as altering the permissions of network shares to be accessible by everyone, and adding\n\na firewall rule to allow RDP connections over port 3389. Finally, the batch script created a\n\nnew user with a legitimate name, based on a service in the environment, then added this\n\nuser to the Administrators and Remote Desktop Users group, before deleting itself. One of\n\nthe PowerShell scripts executed a Cobalt Strike stager, to reach out and download the main\n\nCobalt Strike implant, and the other, as mentioned, set up the SystemBC proxy on the\n\nsystem, loading it into memory using shellcode:\n\nPowerShell Script used to execute SystemBC binary\n\nCopyright\n\nPage 4\n\n2021\n\n\n-----\n\nSystemBC related strings found in binary\n\nSystemBC is a notorious proxy[1] malware that can route connections through SOCKS5 in an\n\nattempt to hide communications between an implant and its C2 server. In the past, this\n\ntechnique has been used by the group operating Ryuk.[2] It is commonly dropped alongside\n\nCobalt Strike beacons to shield the traffic from detection, especially when threat actors\n\ninteract with it frequently, in attempts to pivot across the network. Generally, when\n\nSystemBC is deployed, the attack revolves around ransomware infections,[3] although it has\n\nbeen distributed alongside banking trojans such as Danabot.\n\nIn this case, the SystemBC payload was deployed to communicate with a hardcoded IP\n\naddress over port 5050. We were surprised to locate multiple SystemBC samples all\n\ncommunicating to the same IP address, some with the default network packet marker\n\n“xordata”, and some with custom markers.\n\nCopyright\n\nPage 5\n\n2021\n\n\n-----\n\nHardcoded IP seen in SystemBC binary after configuration decryption\n\nDuring the investigation process, we discovered that a prior infection with TrickBot had\n\noccurred, raising the question whether it had served as the delivery method for Cuba.\n\nHowever, after consulting with leading security researchers, we believe it to be highly\n\nunlikely that TrickBot dropped Cuba ransomware onto the machine, as it is primarily known\n\nto drop Ryuk[4] and Conti ransomware. We also completed an investigation internally, and\n\nfound no evidence to support such a theory. We suspect the ransomware was most likely\n\ndropped through the usage of SystemBC and Cobalt Strike on the infected machines.\n\nCopyright\n\nPage 6\n\n2021\n\n\n-----\n\n##### 1.2.3 Ransomware Algorithm Analysis\n\nLike most ransomware families, there is nothing remarkable about Cuba ransomware. The\n\ntwo main encryption algorithms used are ChaCha20 and RSA. Both are implemented in the\n\nsample, rather than utilizing the WinCrypt library for encryption. As with most variants of\n\nransomware, the symmetric algorithm is used for encrypting the file, while the asymmetric\n\nalgorithm is used for encrypting the symmetric key.\n\nImage of key blob inside Cuba-encrypted file\n\nCuba ransomware is also referred to as Fidel ransomware,[5] due to the marker placed at the\n\nbeginning of all encrypted files. The marker is part of a 1024-byte header, prepended to all\n\nencrypted files. The file marker itself is used as an indicator to the ransomware (and the\n\ndecryption tool), that the file has been encrypted. The rest of the header contains a large\n\nchunk of data containing essential information required to decrypt the file. However, the data\n\nis encrypted using RSA, and therefore cannot be decrypted without the use of the attackers’\n\nRSA private key. This allows operators behind Cuba ransomware to generate completely\n\nrandom encryption keys for each file—and to still be able to decrypt them even after\n\npayment has been received.\n\nAs with several other ransomware families that implement encryption algorithms rather than\n\nusing the Windows Cryptography API, Cuba ransomware utilizes the RSA functions offered\n\nCopyright\n\nPage 7\n\n2021\n\n\n-----\n\nby the wolfSSL[6] library. We were able to identify that the actors used an open-source\n\nlibrary, when an extremely useful indicator emerged in the form of non-modified return\n\nvalues.\n\nSnippet of pseudocode inside Cuba: wolfSSL linked function\n\nBased on these return values, and the presence of Windows Cryptography API for\n\ngenerating random data, we were able to link the algorithm to wolfSSL’s implementation of\n\nRSA. Additionally, rather than providing a specific private key in the decryptor, the attackers\n\nused a block of data as a seed in a random number generation (RNG) function. This seed,\n\nin turn, generates the private key, used to decrypt the data blob stored in the file. The\n\ndecrypted blob contains 44 bytes of important data: a 32-byte ChaCha20 key, and a 12-byte\n\nIV.\n\nComparison of decompiled code in Cuba to wolfSSL source code\n\nThe ChaCha20 algorithm in use was also taken from an open-source implementation.\n\nHowever, the attackers altered certain parts of the code, such as modifying return values\n\nCopyright\n\nPage 8\n\n2021\n\n\n-----\n\nand joining the ChaCha20 key and IV initialization together. As a result, attribution is more\n\ncomplicated in comparison to the RSA code, however, it is still very likely to have originated\n\nfrom the wolfSSL library.\n\nComparison of decompiled ChaCha20 code in Cuba to wolfSSL source code\n\n#### 1.3 Threat Actor Information\n\nThroughout our research, we found links to victims who shared valuable information that led\n\nus to believe that the group comprises Russian-speaking individuals. The first major hint was\n\nCopyright\n\nPage 9\n\n2021\n\n\n-----\n\nan incorrect translation: The word “north” appeared in a message regarding exfiltrated files\n\nand encrypted servers—a context in which it seemed out of place. Investigating further, we\n\nlearned the Russian words for “server” and “north” are very similar. It seems to us extremely\n\nlikely the attackers made a typo in the original Russian text prior to translation.\n\nTranslation of “north” to Russian\n\nAfter the negotiations were finalized, we focused our efforts on the webpage supposedly set\n\nup by the actors behind Cuba. The site was hosted on the Tor network and lists several\n\ncompanies who refused to cooperate and pay the ransom—as well as the stolen data, most\n\nof which is up for sale. Combing through the website, we confirmed our suspicion that the\n\nactors spoke Russian: we came across a custom 404 error page in Russian, roughly stating,\n\n“Oh, this is 404! blablabla 404 blablabla.”\n\nScreenshot from the Russian 404 error page\n\n#### 1.4 Payment Tracking\n\nCopyright\n\nPage 10\n\n2021\n\n\n-----\n\nOnce the ransom payment was finalized, we broadened our investigation to include tracing\n\nthe flow of Bitcoin in an attempt to gather additional intelligence on the threat actors. As the\n\nimage below—which was captured using the CipherTrace platform—shows, the threat actors\n\nfollow a highly complex transaction procedure to avoid tracking attempts. It includes using\n\ncoin mixers, third-party exchange services, and several different wallet providers, all together\n\nindicating the threat actors possess a sound understanding of anonymizing transactions.\n\nAnalysis of the payment mixing used\n\nWe have compiled a list of services the threat actors were utilizing to evade tracking, and\n\nbelow are summaries of the purposes of a selection of them.\n\nCoinToCard: http://cointocard.org/\n\nBinance: https://www.binance.com/en\n\nChangeNow: https://changenow.io/\n\nMorphToken: https://www.morphtoken.com/\n\nHuobi: https://www.huobi.com/en-us/\n\nWasabi: https://wasabiwallet.io/\n\nCopyright\n\nPage 11\n\n2021\n\n\n-----\n\nChangeNow website\n\nChangeNow allows for swift, anonymized exchanges between cryptocurrencies, such as\n\nBTCàXMR, LTCàETH, and even same-coin exchanges such as BTCàBTC. All that is\n\nrequired to perform these changes is an input address and an output address. From there,\n\nit is as simple as transferring an amount over to ChangeNow and receiving it in the output\n\nwallet. This transaction occurs through the ChangeNow platform, and as a result, further\n\ntracking would require knowledge of the receiving address. We do not believe the threat\n\nactors immediately cashed out after receiving funds from ChangeNow into the new wallet.\n\nInstead, they likely passed the transfer through a similar obfuscated transaction flow before it\n\nreached a final destination.\n\nCopyright\n\nPage 12\n\n2021\n\n\n-----\n\nMorphToken website\n\nMorphToken is a very similar service to ChangeNow, allowing a user to transfer\n\ncryptocurrency from one blockchain to another. The usage of both testifies to the\n\nsophistication of either the services the threat actors employ to obfuscate transactions, or of\n\ntheir own personal actions.\n\nHuobi and Binance are both extremely large global exchange networks. These networks\n\nallow seamless transfers between different cryptocurrencies, and as a result could help\n\nfacilitate further obfuscation of the attackers’ transfers. It is possible that in the case of\n\nHuobi, the transfers are sent not directly to a Huobi-linked account, but to wallets hosted by\n\nthe platform, which are then dispersed to smaller exchanges such as ChangeNow and\n\nMorphToken.\n\nDuring our analysis of the transactions, we discovered a small number of transfers that took\n\nplace utilising the Wasabi Wallet technology, potentially to increase the anonymity of the\n\ntransfers. These significantly differed from the majority of transfers we discovered in our\n\nanalysis, potentially suggesting an additional third-party service was used for a certain\n\nnumber of coins.\n\nAfter gaining an understanding of the complex pathways that the threat actors took in order\n\nto anonymize the bitcoin transfers, we can confidently assume that they are highly\n\naccustomed to managing large transfers, further indicating they have extensive experience\n\nwith sizable ransom payments.\n\nCopyright\n\nPage 13\n\n2021\n\n\n-----\n\n#### 1.5 Victims\n\nWhile the Cuba Ransomware group has been around for some time, it only established itself\n\nas a major player recently, when the attackers breached the Automatic Funds Transfer\n\nService and hosted stolen files on their Tor site, which they then made accessible to others,\n\nfor a fee. Prior to that, they targeted several companies in wide-ranging sectors, including a\n\nlogistics company, a real estate firm, and an aviation company. Based on the irregular\n\npattern and the sophisticated nature of their attacks, it is difficult to ascertain whether there\n\nare motives beyond financials in the group’s targeting process.\n\nOver the course of our investigation, we discovered multiple uploads of the ransom note to\n\nVirusTotal, each with different contact addresses. Considering these emails together, we\n\ngained a picture of when the attacks occurred, as the email addresses are generally\n\nregistered a day or two before deploying the ransomware. It seems the attackers attempt to\n\nmaintain an authentic image by following through with promises on not releasing data and\n\nproviding a decryptor—however it is impossible to know, at least at this point—whether they\n\ndelete it on their back-end, or leave it accessible for use in the future.\n\nCopyright\n\nPage 14\n\n2021\n\n\n-----\n\n#### 1.6 References\n\n1. https://www.proofpoint.com/us/threat-insight/post/systembc-christmas-july-socks5-\n\nmalware-and-exploit-kits\n\n2. https://news.sophos.com/en-us/2020/10/14/inside-a-new-ryuk-ransomware-attack/\n\n3. https://www.bankinfosecurity.com/ransomware-operators-using-systembc-malware-as-\n\nbackdoor-a-15612\n\n4. https://us-cert.cisa.gov/ncas/alerts/aa20-302a\n\n5. https://twitter.com/siri_urz/status/1327233462617731074?s=20\n\n6. https://github.com/wolfSSL/wolfssl-examples\n\nCopyright\n\nPage 15\n\n2021\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://shared-public-reports.s3-eu-west-1.amazonaws.com/Cuba+Ransomware+Group+-+on+a+roll.pdf"
    ],
    "report_names": [
        "Cuba+Ransomware+Group+-+on+a+roll.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1619724805,
    "ts_modification_date": 1619724805,
    "files": {
        "pdf": "https://archive.orkl.eu/3a894221bb3da2727d2574250fe2447561f4ded9.pdf",
        "text": "https://archive.orkl.eu/3a894221bb3da2727d2574250fe2447561f4ded9.txt",
        "img": "https://archive.orkl.eu/3a894221bb3da2727d2574250fe2447561f4ded9.jpg"
    }
}