{
    "id": "153bbd16-bdab-4c31-b78f-33b7aac89754",
    "created_at": "2022-10-25T16:48:10.606005Z",
    "updated_at": "2025-03-27T02:14:56.459627Z",
    "deleted_at": null,
    "sha1_hash": "d4c015f0cc390e3c632face2a66323cd7c4b3afe",
    "title": "",
    "authors": "",
    "file_creation_date": "2013-06-28T11:25:18Z",
    "file_modification_date": "2013-07-09T22:24:09Z",
    "file_size": 190710,
    "plain_text": "CISAK 2013 – C1/O/8\n\n# Dark Seoul Cyber Attack: Could it be worse?\n\n**Jonathan A.P. Marpaung[1], HoonJae Lee[1]**\n\n_1Cryptography & Network Security Lab, Dongseo University_\n\n_San 69-1, Jurye 2-dong, Sasang-gu, Busan 617-716, Korea_\n```\n                                  1jonathan@spentera.com\n                                   1hjlee@dongseo.ac.kr\n\n```\n**Abstract.** On March 20, 2013 a cyber attack now known as Dark Seoul, paralyzed several major banking services and\nbroadcasters in South Korea. Labeled by the media as cyber terror, the attack significantly disrupted these services for at least one\nday. Despite these facts, various indicators suggest that the attack had a low level of sophistication. Major cyber attacks in the\npast such as Ten Days of Rain and the SK Communications breach employed far more advanced techniques compared to Dark\nSeoul. We examine the technical details of Dark Seoul by outlining the primary attack vector used, describing the malware\ncomponents, and discussing the malware’s evasion techniques. Furthermore we compare this incident to previous attacks in order\nto determine its technical sophistication using these attacks as a relative benchmark. Lastly we explore various malware design\ntechniques that were not used in the malware such as multiple propagation vectors, 0-day exploits, and evasion techniques, thus\npresenting a proof of concept of the malware’s low technical sophistication.\n\n**Keywords: advanced persistent threat; cyber attack; Dark Seoul; defense; malware analysis;**\n\n\n### A. INTRODUCTION\n\nOn March 20, 2013, at approximately 14.15PM South\nKorea suffered a cyber attack that resulted in the denial of\nservice of several major banks and broadcasters. Reported as a\nmajor cyber attack, our analysis of the malware and attack\nvectors employed suggests that the malware had a relatively\nlow level of technical sophistication. Firstly we explore the\ntechnical components of Dark Seoul to analyze the\nsophistication of the malware and attack vectors used. This\nanalysis is based on information obtained from the media as\nwell as technical reports of various malware research labs such\nas AhnLab, Imperva, Symantec, Avast, Kaspersky, Alienvault,\nand Sophos. Secondly we conduct a comparative study of\nDark Seoul by looking at prior cyber attacks, namely Stuxnet,\n10 Days of Rain, and the SK Communications breach. By\ndoing so we draw a picture of South Korea’s current security\nposture since those attacks. Lastly we discuss several design\ncharacteristics of advanced malware used by determined\nadversaries to carry out more technically advanced and\nstealthier attacks, therefore highlighting the components where\nDark Seoul lacked sophistication.\n\n### B. POSTMORTEM\n\nTelevision broadcasters YTN, MBC, and banks KBS,\nShinhan, Nonghyup, and Jeju were targeted in this recent\nattack. The Korea Internet Security Agency (KISA) reported\nthat about 48,000 computers were affected making services\ninaccessible and the victim organizations needed weeks to\nfully restore all functions [1]. In terms of impact, the attackers\nmanaged to successfully penetrate the target networks, pivot\ntheir way into critical assets, wipe out systems, cause denial of\nservices, and trigger enough public response to spur the media\ninto using terminology such as cyber terror and advanced\npersistent threats.\n\n\nIn this paper we take an in-depth look of the malware by\nexamining the attack vectors used, and later discuss whether\nthe claims in the media are warranted. According to the\ninvestigating team consisting of government, military, and\ncivilian members, as many as 76 samples of malware were\ncollected from infected machines [2]. We present the most\nlikely  primary  attack  vector  used  by  the  attackers  by\ndiscussing information summarized from reports by Avast [3],\nTrend Micro [4], and Symantec [5][6] issued in the first few\ndays following the attack.\n\nFig. 1. Dark Seoul Attack Vector\n\n### 1.  Spearphishing\n\nTrend Micro researchers discovered a phishing email sent\nto South Korean organizations on March 19. The email\ncontained a malicious Trojan downloader which the\nresearchers report to have been detected by their Deep\nDiscovery software. This is likely to be the initial attack point.\n\n\n-----\n\nCISAK 2013 – C1/O/8\n\n### 2.  Launch Platform – Cross-Site Scripting\n\nAvast detected the attacks originating from the Korea\nSoftware Property Right-Council (SPC) website\n(http://www.spc.or.kr) possibly infected via the phishing email\nsent on the 19th. Usage of a legitimate website/server in the\ntarget nation/region for launching attacks is a common tactic\nused to minimize detection. The SPC website contained\nJavaScript causing the client browser to load an iframe loading\n[the contents of http://rootadmin2012.com, which was the main](http://rootadmin2012.com/)\nattack site for hosting the malicious payloads.\n\n### 3.  Exploitation\n\nExamination of rootadmin2012.com revealed heapspray\nand shellcodes with references to Internet Explorer (IE). Avast\nmanaged to identify the vulnerability exploited as CVE-20121889 [7] which allows remote attackers to execute arbitrary\ncode or cause a denial of service via a crafted website. The\nvulnerability targets Microsoft XML Core Services 3.0 – 6.0\nwith a published metasploit exploit targeting MS XML Core\nServices 3.0 via IE6 and IE7 over Windows XP [8]. After\ngaining access the second stage downloader file (sun.exe)\nperforms the following actions:\n\n_a. Check for internet connection: Downloads an_\nimage from naver.com.\n\n### b.  Local DNS cache poisoning: Redirects requests\nto certain Korean banking websites listed in\nFigure 2 to another server in Japan.\n\n\n### 126.114.224.53 www.kbstar.com 126.114.224.53 www.ibk.co.kr 126.114.224.53 www.shinhan.com 126.114.224.53 www.wooribank.com 126.114.224.53 www.hanabank.com 126.114.224.53 www.nonghyup.com\n\n\nFig. 2. New entries appended to Windows hosts file\n\n_c._ _Update download counter: Runs a counter script_\n[by opening http://myadmin2012.com/tong.htm.](http://myadmin2012.com/tong.htm)\n_d. Makes itself persistent: Modifies the Windows_\nregistry by adding value with name “skunser”\nand data “C:\\ntldrs\\svchest.exe”, where it was\npreviously copied to.\n_e. Download backdoor: Downloads dropper_ file\n\npao.exe from [http://www.hisunpharm.com/](http://www.hisunpharm.com/)\nfiles/File/product/ and stores it to C:\\Program\nFiles\\tongji2.exe\n_f._ _Drops  and  execute  batch  file:  schedules_\ndownloader every 30 minutes and ensures\nsvchest.exe is started with Local System\nprivileges.\n\n### 4.  Post-exploitation\n\nThe tongji2.exe module injects itself into iexplore.exe in an\nattempt to mask itself. Avast classified this as a backdoor\nTrojan and infostealer. This malware allowed attackers to\n\n\ncontrol the computer as a compromised zombie part of a wider\nbotnet network – a theory suggested by Alienvault [9] – which\nthen wiped hard disks, and harvested personal information.\nExamination of the file names and the Safeengine executable\nprotector suggest that the malware was made in China.\nAlthough capable of executing many functions, only the\nfollowing were widely utilized in the attack:\n\n_a. Antivirus disablement: Malware attempts to disable_\n\nAhnlab and Hauri antivirus.\n_b. Command & control (C&C): Using a simple XOR_\nloop for encryption, the malware attempts to connect\nto laoding521.eicp.net over port 889 to communicate\nwith the attackers.\n_c. Harddisk wiper: Symantec identified Trojan.Jokra as_\nthe malware component that wiped harddisks in the\nattack. It is likely that it was downloaded onto the\nvictim’s computer after receiving an instruction by\nthe C&C servers. The malware overwrites the master\nboot record (MBR) and the rest of the harddisk with\nthe strings “PRINCIPES” or “HASTATI.”. Other\nattached drives or removable devices may also be\ntargeted. The malware then forces the computer to\nrestart thus making it unusable. An interesting\nfeature of this malware is that it has components to\nwipe out harddisks on both Windows and Linux\nplatforms. Detailed analysis of Jokra can be found\nhere [10].\n_d. Information harvesting: After gaining root privileges_\nthe attackers can intercept any information that goes\nin or out of the infected computer. However the most\napparent information taken was user credentials. As\na result of DNS poisoning, users believe they are\naccessing the authentic internet banking website, but\nare decepted into interacting with a fake website. An\nerror  message pops  up  stating that  the  user’s\ncomputer was infected by a virus and that for\nsecurity reasons they need to apply for a fraud\nprevention service. If the user clicks the OK button,\nthe user is directed to a page requesting their name\nand national identification number. If the format\nentered is correct, the user is then asked to fill in\nmore details including address, phone number, etc..\n\n### C. CASE   STUDIES:  PREVIOUS   MAJOR   CYBER\n ATTACKS\n 1. Stuxnet\n\nStuxnet was discovered in July 2010, but the earliest\nknown variant is confirmed to have existed since 2007 [11].\nStuxnet caught many security researchers and professionals by\nsurprise, being the first advanced malware of its kind.\nAccording to Symantec’s report [12], Stuxnet is a complex\nthreat that was primarily written to target an industrial control\nsystem (ICS) or set of similar systems. A vast array of\ncomponents was implemented in the malware including four\n0-Day exploits, a windows rootkit, antivirus evasion\ntechniques, complex process injection and hooking code,\n\n\n-----\n\nCISAK 2013 – C1/O/8\n\nnetwork infection routines, peer-to-peer updates, a command\nand control interface, as well as the first ever PLC rootkit.\nStuxnet’s main payload has the main purpose of modifying\ncode on Siemens industrial PLCs in order to sabotage the\nsystem. It is widely believed that Iran’s Natanz nuclear Fuel\nEnrichment Plant (FEP) was the intended target. Hosts in five\ndomains of organizations based in Iran were heavily infected\nover 3 attack waves. The deliberate containment of the\nmalware to targets in Iran is also apparent from the number of\nhosts infected worldwide, which reached only around 100,000\nwith approximately 60% being in Iran. This attack has been\nclaimed to setback Iran’s nuclear program by several years as\n1,000 out of 9,000 centrifuges were disabled and had to be\nreplaced [13]. The initial attack point is likely to be via a USB\ninfection.\n\n### 2. 10 days of Rain\n\nOn March 4, 2011, exactly 20 months after a similar\nincident during the U.S. Independence Day celebrations of\n2009, a botnet based in South Korea launched DDoS attacks\nagainst 40 websites affiliated with South Korean government,\nmilitary, and civilian critical infrastructure as well as U.S.\nforces based in Korea [14]. The botnet was dynamically\nupdated via new malware binaries, launched a DDoS non-stop\nfor more than a week, and then wiped the harddisks with\nzeroes, overwriting the MBR making the machines unusable.\nThis attack used malware with a much higher level of\nsophistication than is necessary to launch a trivial distributed\ndenial of service (DDoS) attack. Encryption of code and\nconfigurations using cipher algorithms such as the Advanced\nEncryption Standard (AES), RSA, and Rivest Cipher 4 (RC4)\nenabled them to evade detection and prolong analysis. A\nmultitier botnet architecture included 40 C&C servers\ndistributed across the globe including servers in the USA,\nTaiwan, Saudi Arabia, Russia, and India. Highlighting the\noverkill in this attack, McAfee went so far as to call it\n“analogous to bringing a Lamborghini to a go-cart race” [15].\nConsidering the limited timeframe scope and target list,\nMcAfee suggested the motivation of the attack was a cyber\nwar exercise to test the preparedness of South Korea’s cyber\ndefense capabilities and to better understand the technical\nrequirements for a successful campaign.\n\n### 3. SK Communications – CyWorld\n\nIn July 2011 SK Communications became the victim of an\nattack that resulted in the loss of the personal details of 35\nmillion users [16]. The users of CyWorld and Nate, services\nowned by SK Communications, were affected by this attack.\nJudging from the sophistication of the attack and the time\nneeded for planning it, researchers concluded that the attack\nwas likely to be carried out by an Advanced Persistent Threat.\nBetween July, 18 and 25, more than 60 computers were\ninfected then used to gain access to the user databases. The\nlaunch point was a South Korean software company’s update\nserver, normally used to deliver software updates to customers\n\n[17]. The attackers compromised the server and created a\nTrojan that would be downloaded to user computers during a\nroutine update. Poor change management policy resulted in the\n\n\nfull trust of software updates, allowing attackers to fully\nexploit this weakpoint. During this time attackers used C&C\nservers to monitor the activities on the infected machines and\nuploaded tools on a previously compromised legitimate\nTaiwanese website. An elaborate infrastructure of waypoints\nand C&C servers was created to make tracing the sources of\ntheir activities difficult. In-depth investigation of the attack\nreveal that preparation went back as early as September 2010\nbefore finally culminating in the compromise of the user\ndatabases between July 26-28, 2011.\n\nComparing Dark Seoul with previous attacks shows that it\nwas technically low in sophistication while causing high\nimpact to the organizations affected. An intuitive indicator of\nthis sophistication is that it was completely preventable if the\norganizations had used existing software updates and antivirus\nsolutions, whereas prior attacks could not have been detected.\nHowever judging from the high number of infections, services\ndisrupted, and the fact that information was being harvested\nfrom the infected machines at least 8 months [18] before the dday wipeout, we consider the impact to be high.\n\nTable 1. Comparison with Previous Attacks.\n\n\n**10 days of**\n**rain (2011)**\n\n\n**Dark**\n**Seoul**\n**(2013)**\n\nLOW\n\n\n**Metric**\n\n\n**Stuxnet**\n\n**(2007-**\n\n**2010)**\n\n\n**SK Comm**\n\n**(2011)**\n\n\nVERY\nSophistication\nHIGH\n\n\nVERY\nHIGH\nHIGH\n\n\nVERY\nImpact HIGH HIGH HIGH\nHIGH\n\n#of Infections >100,000 60 >100,000 >48,000\n\n\n8 billion\n\nKRW\n\n>1 year\n\n\nDDoS\n\n>8 months\n\n\nNuclear\nLosses\nProgram\n\n\n35 million\nusers\n\n\nTime Before\n\nDetection\n\n\n>10\n>3 years\nmonths\n\n\n### D. ADVANCED MALWARE DESIGN\n 1. Multiple Propagation Vectors\n\nTo increase the probability of successfully infecting the\ntarget systems, various propagation vectors should be\nembedded into the malware. The most likely attack vector is\nsocial engineering via phishing emails, USB sticks, and other\ntechniques. Although people can be used as the initial point of\nentry, propagation needs to continue laterally through the\nnetwork till the specific target host is reached. During this\nprocess the malware may need higher privileges (e.g. root) and\nfurther exploits will be utilized. Therefore the persistent\nadversary will need to consider multiple vectors to infiltrate\ntarget systems.\n\n\n-----\n\nCISAK 2013 – C1/O/8\n\n### 2. 0-day Exploits\n\nThe problem with publicly published vulnerabilities is\npeople can defend against them. 0-day exploits are written to\nexploit vulnerabilities that have not been disclosed to the\npublic nor the concerned software vendor. These exploits are\nat the core payload of any advanced malware, and are virtually\nunstoppable until vendors release a patch or anti-virus\nproviders come up with a signature definition. The only other\nmethod of minimizing the 0-day threat is by actively designing\nsecurity into software. Dark Seoul did not use any 0-days.\n\n### 3. Evasion Techniques\n\nThe deployment of anti-virus software, intrusion detection\nsystems, firewalls and other malware detection or prevention\ntechnology has done much to defend against many attacks.\nAdvanced malware bypasses these defenses by employing\ntechniques such as dynamic botnet obfuscation, network based\nfragmentation and session splicing, application or protocol\nviolations, disabling intrusion detection systems (IDSs), to\nmore advanced techniques such as encryption and code reuse\nattacks [19]. Carefully crafted exploits can avoid even\nadvanced heuristic detection algorithms used in today’s antivirus software. Evasion techniques are crucial for successful\nattacks against high level targets, such as in the case of the\nIranian nuclear program.\n\n### E. CONCLUSION\n\nDark Seoul was a low tech threat which managed to\nescalate into a high impact attack. Successful in carrying out\nits goals, the malware was lacking in many areas that would be\ntypically found in attacks by advanced persistent threats. We\nhighlighted the components of the malware used and the\npossible design principles that could have been employed to\nmake the attack more sophisticated.\n\nSouth Korea is more at risk now than before the attack, as\nnow adversaries less capable than advanced persistent threats\nrealize they could also successfully perform damaging attacks.\nUndertaking the needed remediation strategies to prevent\nsimilar attacks as well as understanding the anatomy of more\nadvanced malware is vital for mounting an adequate defense\nagainst the advanced cyber threats.\n\n## ACKNOWLEDGEMENT\n\nThis research was supported by Basic Science Research\nProgram through the National Research Foundation of Korea\n(NRF) funded by the Ministry of Education, Science and\nTechnology (grant number: 2012-0008447).\n\n**REFERENCES**\n\n[1]  “South Korea blames North for bank and TV cyber-attacks,” BBC News,\n\n[online] 10 April 2013, Available:\n[http://www.bbc.co.uk/news/technology-22092051 (Accessed: 18 April](http://www.bbc.co.uk/news/technology-22092051)\n2013)\n\n[2]  He-suk Choi. “Seoul blames Pyongyang for cyber attacks,” The Korea\nHerald, [online] 10 April 2013, Available:\n[http://www.koreaherald.com/view.php?ud=20130410000766 (Accessed:](http://www.koreaherald.com/view.php?ud=20130410000766)\n18 April 2013)\n\n\n\n[3]  J. Horejsi. “Analysis of Chinese attack against Korean banks,” Avast!\n\nBlog, [online] 19 March 2013, Available:\nhttps://blog.avast.com/2013/03/19/analysis-of-chinese-attack-againstkorean-banks/ (Accessed: 18 April 2013)\n\n[4]  J. Schwartz, “South Korea Changes Story On Bank Hacks,” Information\nWeek [online] 22 March 2013, Available:\n[http://www.informationweek.com/security/attacks/south-korea-changes-](http://www.informationweek.com/security/attacks/south-korea-changes-)\nstory-on-bank-hacks/240151542 (Accessed: 18 April 2013)\n\n[5]  “Remote Linux Wiper Found in South Korean Cyber Attack,” Symantec\nConnect [online] 20 March 2013, Available:\n[http://www.symantec.com/connect/blogs/remote-linux-wiper-found-](http://www.symantec.com/connect/blogs/remote-linux-wiper-found-)\nsouth-korean-cyber-attack (Accessed: 18 April 2013)\n\n[6]  “Trojan.Jokra,” Symantec Security Response, [online] 27 March 2013,\nAvailable:\n[http://www.symantec.com/security_response/writeup.jsp?docid=2013-](http://www.symantec.com/security_response/writeup.jsp?docid=2013-)\n032014-2531-99 (Accessed: 18 April 2013)\n\n[7]  “CVE-2012-1889,” Common Vulnerabilities and Exposures, [online] 22\n\n[March 2012, Available: http://www.cve.mitre.org/cgi-](http://www.cve.mitre.org/cgi-)\nbin/cvename.cgi?name=CVE-2012-1889 (Accessed: 18 April 2013)\n\n[8]  Metasploit, “Microsoft XML Core Services MSXML Uninitialized\nMemory Corruption,” The Exploit Database, [online]\n[http://www.exploit-db.com/exploits/19186/ (Accessed: 18 April 2013)](http://www.exploit-db.com/exploits/19186/)\n\n[9]  J. Blasco, “A theory on the South Korean attacks,” Alien Vault Labs\n\n[online] 20 March 2013, Available:\n[http://labs.alienvault.com/labs/index.php/2013/a-theory-on-the-south-](http://labs.alienvault.com/labs/index.php/2013/a-theory-on-the-south-)\nkorean-attacks/ (Accessed: 18 April 2013)\n\n[10] “Trojan.Jokra,” Symantec Security Response, [online] 27 March 2013,\nAvailable:\n[http://www.symantec.com/security_response/writeup.jsp?docid=2013-](http://www.symantec.com/security_response/writeup.jsp?docid=2013-)\n032014-2531-99&tabid=2 (Accessed: 18 April 2013)\n\n[11] G. McDonald, L.O. Murchu, S. Doherty, and E. Chien, “Stuxnet 0.5:\nThe Missing Link,” Symantec Security Response [online] 26 February\n2013, Available:\n[http://www.symantec.com/content/en/us/enterprise/media/security_respo](http://www.symantec.com/content/en/us/enterprise/media/security_respo)\nnse/whitepapers/stuxnet_0_5_the_missing_link.pdf\n\n[12] N. Falliere, L. O. Murchu, and E. Chien, “W32.stuxnet dossier,”\nSymantec, Symantec Security Response [online] February 2011. [online].\nAvailable:\n[http://www.symantec.com/content/en/us/enterprise/media/security_respo](http://www.symantec.com/content/en/us/enterprise/media/security_respo)\nnse/whitepapers/w32_stuxnet_dossier.pdf\n\n[13] Albright, D., Brannan P., Walrond, C. “Did Stuxnet Take Out 1,000\n\nCentrifuges at the Natanz Enrichment Plant?” Institute for Science and\n[International Security [online] 22 December 2010, Available: http://isis-](http://isis-/)\nonline.org/isis-reports/detail/did-stuxnet-take-out-1000-centrifuges-atthe-natanz-enrichment-plant/ (Accessed: 18 April 2013)\n\n[14] “10 Days of Rain in Korea,” McAfee Blog Central [online] 5 July 2011,\n[Available: http://blogs.mcafee.com/mcafee-labs/10-days-of-rain-in-korea](http://blogs.mcafee.com/mcafee-labs/10-days-of-rain-in-korea)\n(Accessed: 18 April 2013)\n\n[15] “Ten Days of Rain Whitepaper,” McAfee, 5 July 2011\n\n[16] “SK Hack by an Advanced Persistent Threat,” Command Five [online]\nSeptember 2011, Available:\n[http://www.commandfive.com/papers/C5_APT_SKHack.pdf (Accessed:](http://www.commandfive.com/papers/C5_APT_SKHack.pdf)\n18 April 2013)\n\n[17] Moon-young Lee, “Personal information hack traced to Chinese IP\naddress” The Hankyoreh [online] 12 August 2011, Available:\n[http://www.hani.co.kr/arti/english_edition/e_national/491514.html](http://www.hani.co.kr/arti/english_edition/e_national/491514.html)\n(Accessed: 18 April 2013)\n\n[18] “South Korea Probe Blames North for Cyber Attack” VOA News\n\n[online] 10 April 2013, Available:\n[http://www.voanews.com/articleprintview/1638361.html (Accessed: 18](http://www.voanews.com/articleprintview/1638361.html)\nApril 2013)\n\n[19] J.A.P. Marpaung, M. Sain, H.J. Lee, “Survey on Malware Evasion\nTechniques: State of the Art and Challenges” in 14th International\nConference on Advanced Communication Technologies, 2012, pp 744749.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.00.00.Dark_Seoul_Cyber_Attack/Dark_Seoul_Cyberattack.pdf"
    ],
    "report_names": [
        "Dark_Seoul_Cyberattack"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041696,
    "ts_creation_date": 1372418718,
    "ts_modification_date": 1373408649,
    "files": {
        "pdf": "https://archive.orkl.eu/d4c015f0cc390e3c632face2a66323cd7c4b3afe.pdf",
        "text": "https://archive.orkl.eu/d4c015f0cc390e3c632face2a66323cd7c4b3afe.txt",
        "img": "https://archive.orkl.eu/d4c015f0cc390e3c632face2a66323cd7c4b3afe.jpg"
    }
}