{
    "id": "157e5042-9676-439b-8ec1-1ff4d54c9804",
    "created_at": "2023-01-12T15:07:06.385536Z",
    "updated_at": "2025-03-27T02:15:38.167608Z",
    "deleted_at": null,
    "sha1_hash": "162d268ad922ae8b6a642f65846496d8ea5971b8",
    "title": "2020-10-02 - Attacks Aimed at Disrupting the Trickbot Botnet",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:38Z",
    "file_modification_date": "2022-05-28T04:10:38Z",
    "file_size": 67596,
    "plain_text": "# Attacks Aimed at Disrupting the Trickbot Botnet\n\n**[krebsonsecurity.com/2020/10/attacks-aimed-at-disrupting-the-trickbot-botnet/](https://krebsonsecurity.com/2020/10/attacks-aimed-at-disrupting-the-trickbot-botnet/)**\n\nOver the past 10 days, someone has been launching a series of coordinated attacks\ndesigned to disrupt Trickbot, an enormous collection of more than two million malwareinfected Windows PCs that are constantly being harvested for financial data and are often\nused as the entry point for deploying ransomware within compromised organizations.\n\nOn Sept. 22,\nsomeone\npushed out a\nnew\nconfiguration\nfile to\nWindows\ncomputers\ncurrently\ninfected with\nTrickbot. The\ncrooks\nrunning the\nTrickbot\n\nA text snippet from one of the bogus Trickbot configuration updates. Source: Intel 471\n\nbotnet\ntypically use\nthese config files to pass new instructions to their fleet of infected PCs, such as the Internet\naddress where hacked systems should download new updates to the malware.\n\nBut the new configuration file pushed on Sept. 22 told all systems infected with Trickbot that\ntheir new malware control server had the address 127.0.0.1, which is a “localhost” address\nthat is not reachable over the public Internet, according to an analysis by cyber intelligence\nfirm [Intel 471.](https://www.intel471.com/)\n\nIt’s not known how many Trickbot-infected systems received the phony update, but it seems\nclear this wasn’t just a mistake by Trickbot’s overlords. Intel 471 found that it happened yet\nagain on Oct. 1, suggesting someone with access to the inner workings of the botnet was\ntrying to disrupt its operations.\n\n“Shortly after the bogus configs were pushed out, all Trickbot controllers stopped responding\ncorrectly to bot requests,” Intel 471 wrote in a note to its customers. “This possibly means\ncentral Trickbot controller infrastructure was disrupted. The close timing of both events\nsuggested an intentional disruption of Trickbot botnet operations.”\n\n\n-----\n\nIntel 471 CEO Mark Arena said it s anyone s guess at this point who is responsible.\n\n“Obviously, someone is trying to attack Trickbot,” Arena said. “It could be someone in the\nsecurity research community, a government, a disgruntled insider, or a rival cybercrime\ngroup. We just don’t know at this point.”\n\nArena said it’s unclear how successful these bogus configuration file updates will be given\nthat the Trickbot authors built a fail-safe recovery system into their malware. Specifically,\nTrickbot has a backup control mechanism: A domain name registered on EmerDNS, a\ndecentralized domain name system.\n\n“This domain should still be in control of the Trickbot operators and could potentially be used\nto recover bots,” Intel 471 wrote.\n\nBut whoever is screwing with the Trickbot purveyors appears to have adopted a multipronged approach: Around the same time as the second bogus configuration file update was\npushed on Oct. 1, someone stuffed the control networks that the Trickbot operators use to\nkeep track of data on infected systems with millions of new records.\n\n**[Alex Holden is chief technology officer and founder of Hold Security, a Milwaukee-based](https://www.holdsecurity.com/)**\ncyber intelligence firm that helps recover stolen data. Holden said at the end of September\nTrickbot held passwords and financial data stolen from more than 2.7 million Windows PCs.\n\nBy October 1, Holden said, that number had magically grown to more than seven million.\n\n“Someone is flooding the Trickbot system with fake data,” Holden said. “Whoever is doing\nthis is generating records that include machine names indicating these are infected systems\nin a broad range of organizations, including the Department of Defense, U.S. Bank, JP\nMorgan Chase, PNC and Citigroup, to name a few.”\n\nHolden said the flood of new, apparently bogus, records appears to be an attempt by\nsomeone to dilute the Trickbot database and confuse or stymie the Trickbot operators. But\nso far, Holden said, the impact has been mainly to annoy and aggravate the criminals in\ncharge of Trickbot.\n\n“Our monitoring found at least one statement from one of the ransomware groups that relies\non Trickbot saying this pisses them off, and they’re going to double the ransom they’re\nasking for from a victim,” Holden said. “We haven’t been able to confirm whether they\nactually followed through with that, but these attacks are definitely interfering with their\nbusiness.”\n\nIntel 471’s Arena said this could be part of an ongoing campaign to dismantle or wrest\ncontrol over the Trickbot botnet. Such an effort would hardly be unprecedented. In 2014, for\nexample, U.S. and international law enforcement agencies teamed up with multiple security\n\n\n-----\n\n[firms and private researchers to commandeer the Gameover Zeus Botnet, a particularly](https://krebsonsecurity.com/2014/06/operation-tovar-targets-gameover-zeus-botnet-cryptolocker-scourge/)\naggressive and sophisticated malware strain that had enslaved up to 1 million Windows PCs\nglobally.\n\nTrickbot would be an attractive target for such a takeover effort because it is widely viewed\n[as a platform used to find potential ransomware victims. Intel 471 describes Trickbot as “a](https://public.intel471.com/blog/understanding-the-relationship-between-emotet-ryuk-and-trickbot/)\nmalware-as-a-service platform that caters to a relatively small number of top-tier\ncybercriminals.”\n\nOne of the top ransomware gangs in operation today — which deploys ransomware strains\nknown variously as “Ryuk” and “Conti,” is known to be closely associated with Trickbot\ninfections. Both ransomware families have been used in some of the most damaging and\ncostly malware incidents to date.\n\nThe [latest Ryuk victim is Universal Health Services (UHS), a Fortune 500 hospital and](https://www.bleepingcomputer.com/news/security/uhs-hospitals-hit-by-reported-country-wide-ryuk-ransomware-attack/)\nhealthcare services provider that operates more than 400 facilities in the U.S. and U.K.\n\nOn Sunday, Sept. 27, UHS shut down its computer systems at healthcare facilities across the\nUnited States in a bid to stop the spread of the malware. The disruption has reportedly\ncaused the affected hospitals to redirect ambulances and relocate patients in need of\nsurgery to other nearby hospitals.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-02 - Attacks Aimed at Disrupting the Trickbot Botnet.pdf"
    ],
    "report_names": [
        "2020-10-02 - Attacks Aimed at Disrupting the Trickbot Botnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536026,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1653711038,
    "ts_modification_date": 1653711038,
    "files": {
        "pdf": "https://archive.orkl.eu/162d268ad922ae8b6a642f65846496d8ea5971b8.pdf",
        "text": "https://archive.orkl.eu/162d268ad922ae8b6a642f65846496d8ea5971b8.txt",
        "img": "https://archive.orkl.eu/162d268ad922ae8b6a642f65846496d8ea5971b8.jpg"
    }
}