{
    "id": "15b1ff00-4992-4777-b6ff-38755984480b",
    "created_at": "2023-01-12T15:00:25.557149Z",
    "updated_at": "2025-03-27T02:08:23.147766Z",
    "deleted_at": null,
    "sha1_hash": "62c3c429369fd799b9b8a75f3c0d0224bc1f6590",
    "title": "2020-03-06 - Dissecting Emotet - Part 2",
    "authors": "",
    "file_creation_date": "2022-05-27T21:12:48Z",
    "file_modification_date": "2022-05-27T21:12:48Z",
    "file_size": 718774,
    "plain_text": "# Dissecting Emotet - Part 2\n\n**[telekom.com/en/blog/group/article/cybersecurity-dissecting-emotet-part-two-596128](https://www.telekom.com/en/blog/group/article/cybersecurity-dissecting-emotet-part-two-596128)**\n\nBlog.Telekom\n\n03‑06‑2020\n[Thomas Barabosch](https://www.telekom.com/en/blog/592636-592636)\n\n2 Comments\n\nShare Share\nTwo clicks for more data privacy: click here to activate the button and send your recommendation. Data will be transfered\nas soon as the activation occurs.\n\nPrint\n[Read out](https://app-eu.readspeaker.com/cgi-bin/rsent?customerid=4779&lang=en&readid=readspeakercontent&url=https://www.telekom.com/en/blog/group/article/cybersecurity-dissecting-emotet-part-two-596128)\n\nReady to follow me further into the details of Emotet? That's right, it's about one of the biggest malware threats in the world.\nEmotet is mainly spread through spam campaigns. In the first part of this blog post I introduced the modular structure and\nindividual elements in more detail. It makes sense to read this classification first and then continue at this point.\n\nEmotet became world famous in 2019 and is still very active\n\nFirst of all, I would like to show this time which tricks this malware uses to protect itself from being detected via so-called hash\nvalues. And before we finally turn to the evolution of the modules, I will talk about the consequences for us as defenders.\n\nReady? Let's do it!\n\n## \"Rehashing\" of Modules\n\nEven though there are only a couple of unique modules, there are many versions with different hashes. This makes a hashbased detection of them not very efficient. In order to detect them, we need the latest version of a module. However, since\nthese modules are only memory resident, it may take some time for them to get to AV companies or to public platforms like\nVirusTotal.\n\n\n-----\n\nLet us have a look at the rehashing feature of Emotet s Command and Control (C2) servers. There are two classes of\nmodules: those that change their hash value every couple of hours and those that do not change their hash value for months.\nSo, the interesting question is: why does this happen?\n\nAt first, I consider the modules that continuously rehash. When byte comparing the outlook mail harvester modules that I\nfetched from Epoch 3 on 2019-11-04 and 2019-11-05, then it becomes clear that only a handful of bytes are different.\n\nThe area, where those two binaries differ, holds the set of C2 addresses. Only three of the four addresses are different. The\nfirst address (96 4E 3F B2 90 1F) stayed the same. Furthermore, both binaries comprise the same compilation timestamp\n(2019-10-15 04:31:32). Replacing the C2 addresses does not require any recompilation. It is probable that the C2 server does\nthis fully automatically by directly writing to a fixed file offset (e.g. in this case 0xD300). From the operator’s point of view, the\ngood thing is that these modules continuously rehash so that hash-only based solutions fail to detect them.\n\nNow I regard two examples of the second case: the modules that do not change their hash values in months. I was able to\nobtain the administrative shares spreader module by all three epochs on several consecutive days (2019-11-05 - 2019-11-08).\nThe modules always had the same hash (f8dd847ab1565aa460875c782f44a003a5b2c20b0e76a6672cfe3cd952a38727) and\n[they all had a creation timestamp of 2019-03-31 10:59:43, which I believe to be correct. Its first submission to VirusTotal was](https://www.virustotal.com/gui/file/f8dd847ab1565aa460875c782f44a003a5b2c20b0e76a6672cfe3cd952a38727/details)\non 2019-05-14 07:35:47. Under the assumption that the timestamps are correct then this would be six weeks after compilation\nand after their subsequent distribution within the botnet. I observed the same for the network password bruteforcer\n(d714eca8a485b86cfa40dacfdedcd164877bf9d0e0d704ea325718b14498ba02): its creation time is 2019-04-24 17:53:50 and\nits first submission to [VirusTotal was on 2019-05-17 19:44:25.](https://www.virustotal.com/gui/file/d714eca8a485b86cfa40dacfdedcd164877bf9d0e0d704ea325718b14498ba02/details)\nThe reason that those modules do not rehash is that they do not depend on fresh C2 addresses. They just spread the Emotet\nloader laterally. Since the loader has a set of C2 addresses, these modules can stay as they are and the Emotet operators do\nnot have to bother to change these modules. For us as defenders this means that we can detect them either with Yara\nsignatures or by using fuzzy hashes that are not affected by a couple of bit flips.\n\n## Evolution of Modules\n\nIn the previous section, I stated that the timestamps found in the modules' PE headers are reasonable. It is very likely that the\nEmotet operators did not tamper with them. Therefore, I utilized them to cluster the modules.\n\n[D00rt published a corpus of Emotet modules along with his blog post on Emotet's network protocol. Even though the corpus](https://d00rt.github.io/emotet_network_protocol)\nwas collected within a limited time frame, i.e. around one month, there are more than 600 DLLs included. This is a wonderful\nopportunity to dig a little bit deeper in the recent evolution of Emotet's modules.\n\nI clustered the over 600 DLLs of D00rt's corpus by timestamp and got 15 clusters. We can see that there are five modules that\nthe Emotet operators compiled on 2019-03-31. Another batch of modules was compiled in April 2019. Finally, there are some\nmodules that were compiled in October 2019. The following table summarizes the clusters. It holds the cluster's timestamp, the\nmodule that I associate with this cluster, the number of modules in this cluster, and a cluster representative for future research.\n\n\nTimestamp Module Cluster\nSize\n\n\nCluster Representative\n\n\n2019-0331\n10:48:35\n\n\nwrapper\nWebBrowserPassView\n\n\n102 1334b5c6025151c92abaa08adff7a0f04bf6e5d9a2b04d55e6c73bbe8a6a5983\n\n\n2019-0331\n10:48:40\n\n\n2019-0331\n10:48:52\n\n\nC2 traffic proxy 102 d45eb10428eb2b262a6bedd275e070618f36288dc8a872445456834e6c938d47\n\nwrapper MailPassView 102 4a23a1a24421b50570d840e1aade7d6304674707d81155be0818f8ac2f8bef1e\n\n\n2019-0331\n10:48:55\n\n\nOutlook contact\nharvester\n\n\n117 49bce46b7931a52c655f9d9ba83ce47be6f07263b8053bb009f9ea6a7216ca91\n\n\n-----\n\n2019-0331\n10:49:11\n\n\nOutlook mail harvester 117 e9a077d388e98316af074d109e8d8f93cd07fe67073a585027fef0d640eff1f6\n\n\n2019-0331\n10:59:43\n\n\nadministrative share\nspreader\n\n\n30 f8dd847ab1565aa460875c782f44a003a5b2c20b0e76a6672cfe3cd952a38727\n\n\n2019-0408\n16:38:38\n\n\nspammer 23 b7ff07953428feb7d629b407158ce1fa896169ffd108d2a7a6c45e541167d4eb\n\n\n2019-0424\n17:53:50\n\n\nnetwork password\nbruteforcer\n\n\n39 d714eca8a485b86cfa40dacfdedcd164877bf9d0e0d704ea325718b14498ba02\n\n\n2019-0424\n18:17:09\n\n\n2019-1002\n06:38:18\n\n\nspammer 23 77c04e8a66efe29b56e9ef7c615776c0559872ca99c3db7fc80ef5a540c43b0a\n\nspammer 8 cbebc09364704b9078f6463eed723c31c384920f5f65ff1caf702f136d2ea93a\n\n\n2019-1004\n23:19:53\n\n\nOutlook contact\nharvester\n\n\n15 918e4e36ced6d131ebd30fbcc2206823d14b702f448780afcbd06d60aae375f8\n\n\n2019-1004\n23:20:39\n\n\n2019-1014\n20:45:29\n\n\nOutlook mail harvester 15 3706c6ce387f803517464754bc6e04ddd3711401b07535cc9ca25008f321ff36\n\nspammer 2 54be4115e54b6dcb2986ff953b271202de0b3c64b4b18714f49e0febddba3c0c\n\n\n2019-1015\n04:31:43\n\n\nOutlook contact\nharvester\n\n\n9 2f360761d5bc5505fa4ebf80281ba724e8027b923300aeb6da2799d21035720c\n\n\n2019-1015\n04:31:32\n\n\nOutlook mail harvester 9 5638f3f14cb916ac6f3debf1838822f789fbd760ea63981d7e3fb454b8afb95e\n\n\nThere are some interesting points to note. First, the Emotet operators compiled at least six modules on 2019-03-31. Since they\nwere all compiled within two minutes, I assume that they belong to one (Visual Studio) solution, which got built on this date.\n\nSecond, there was some activity in April, when two versions of the spammer module and one version of the network password\nbruteforcer got compiled. In the case of the network password bruteforcer I assume that it got recompiled because the\nbruteforce dictionary was exchanged. It seems that there were no modules compiled in Summer 2019, which coincides with\n[the reports on Emotet's summer break from June until September 2019.](https://blog.talosintelligence.com/2019/09/emotet-is-back-after-summer-break.html)\n\nThird, tracking these modules is (still) easy given several facts that I showed in this blog post: the timestamps seem to be\nreliable, there is no real packing of the modules, and only a small number of bytes of each module may change due to binary\npatching. Therefore, it is enough to match new modules against the fuzzy hash (e.g. ssdeep) of a cluster representative.\n\n## Conclusion\n\n\n-----\n\nThis blog post concludes my two part series on the internals of Emotet s modules. I have described the rehashing of some of\nEmotet's modules, which is just a byproduct of binary patching new C2 addresses into already compiled modules. Next, I have\nanalyzed D00rt's corpus of Emotet modules by clustering them by their timestamp. This has yielded only a couple of clusters\nand gives a good insight in the development of Emotet modules within the last months. Furthermore, I have discussed the\npossibility to detect modules by utilizing fuzzy hashes.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-06 - Dissecting Emotet - Part 2.pdf"
    ],
    "report_names": [
        "2020-03-06 - Dissecting Emotet - Part 2.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535625,
    "ts_updated_at": 1743041303,
    "ts_creation_date": 1653685968,
    "ts_modification_date": 1653685968,
    "files": {
        "pdf": "https://archive.orkl.eu/62c3c429369fd799b9b8a75f3c0d0224bc1f6590.pdf",
        "text": "https://archive.orkl.eu/62c3c429369fd799b9b8a75f3c0d0224bc1f6590.txt",
        "img": "https://archive.orkl.eu/62c3c429369fd799b9b8a75f3c0d0224bc1f6590.jpg"
    }
}