{
    "id": "15d7c1c9-0fbb-4238-9a81-ab20ac85d3b1",
    "created_at": "2022-10-25T16:48:18.468556Z",
    "updated_at": "2025-03-27T02:06:07.317552Z",
    "deleted_at": null,
    "sha1_hash": "620d1dff9961cd685997fef0f77773691b858f57",
    "title": "Microsoft Word - DiavolFLASH Approved FINAL 01192022",
    "authors": "",
    "file_creation_date": "2022-01-19T16:59:53Z",
    "file_modification_date": "2022-01-19T16:59:53Z",
    "file_size": 1461126,
    "plain_text": "## 19 January 2022 The following information is being provided by the FBI, with no guarantees or warranties, for potential\n\n_use at the sole discretion of recipients to protect against cyber threats. This data is provided_\n_to help cyber security professionals and system administrators guard against the persistent malicious_\n\nFLASH Number\n\n_actions of cyber threat actors. This FLASH was coordinated with DHS/CISA._\n\n#### CU-000161-MW This FLASH has been released TLP:WHITE\n\n\n**WE NEED YOUR HELP!** If you identify any suspicious activity within your enterprise or have related information,\n\nplease contact your local FBI Cyber Squad immediately with respect to the procedures outlined in the\n\nReporting Notice section of this message.\n\n*Note: By reporting any related information to FBI Cyber Squads, you are assisting in sharing information that allows the FBI to track\n\n_malicious actors and coordinate with private industry and the United States Government to prevent future intrusions and attacks._\n\n# Indicators of Compromise Associated with Diavol\n\n Ransomware\n\n## Summary\n\nThe FBI first learned of Diavol ransomware in October 2021. Diavol is associated with\ndevelopers from the Trickbot Group, who are responsible for the Trickbot Banking Trojan.\nDiavol encrypts files solely using an RSA encryption key, and its code is capable of prioritizing\nfile types to encrypt based on a pre-configured list of extensions defined by the attacker. While\nransom demands have ranged from $10,000 to $500,000, Diavol actors have been willing to\nengage victims in ransom negotiations and accept lower payments. The FBI has not yet\nobserved Diavol leak victim data, despite ransom notes including threats to leak stolen\ninformation.\n\n\n-----\n\n## Technical Details\n\n\n## Indicators\n\nOnce files are encrypted, the desktop background color is changed to black, and the following\nmessage is stored in a BMP file and displayed: “All your files were encrypted. For more\n**information see README-FOR-DECRYPT.txt.” Files are encrypted with the “.lock64” extension**\nand the ransom note is dropped into the folders. A readme file dropped on victims’ machines\ndirects them to a TOR website to obtain a decryption key.\n\nAfter successful execution of the malware, Diavol can be found in the following directories:\n\n**Diavol indicators as of 12/2021**\n**Directories** **Whitelisted File Extensions** **Whitelisted Files** **Whitelisted Paths**\n\n.exe readme_for_decrypt.txt %WINDIR%\n\n%ProgramData% .sys locker.txt %PROGRAMFILES%\n%UserProfile% .dll unlocker.txt %PROGRAMW6432%\n\n.lock64 %TEMP%\n.restore\n\nDiavol’s malicious executables further contained the following PDB path:\nD:\\Development\\Master\\onion\\locker.divided\\LockMainDIB\\Release\\LockMainDIB.pdb\n\n|Diavol indicators as of 12/2021|Col2|Col3|Col4|\n|---|---|---|---|\n|Directories Whitelisted File Extensions Whitelisted Files Whitelisted Paths||||\n|.exe readme_for_decrypt.txt %WINDIR% %ProgramData% .sys locker.txt %PROGRAMFILES% %UserProfile% .dll unlocker.txt %PROGRAMW6432% .lock64 %TEMP% .restore||||\n||.restore|||\n\n\n-----\n\nThe following is an example of a ransom note used by Diavol, as of December 2021:\n\n### W h a t h a p p e n e d? ###\n\n--------------Your computers and servers were L O C K E D-------------\n--------------You need to buy decryption tool for restore the network.----------\nTake into consideration that we have also downloaded data from your network\n\nThat in case of not making payment will be published on our news website.\n\n----------------# How to get my f i l e s back? #---------------\n1. Download Tor Browser from original site.\n\n2. Open this url in Tor Browser and go to discuss https://rgehmqvs2pgukiyzlfxruq2nn7vl5ldnn4gsemheoddj4anljjnf2iad.onion/\n\n----------------Try to use Tor over VPN!-----------------------------------------------------------------------------------\n_Figure 1: Diavol Ransom Note_\n\n## Information Requested\n\nThe FBI is seeking any information that can be shared, to include boundary logs showing\ncommunication to and from foreign IP addresses, Bitcoin wallet information, the decryptor file,\nand/or a benign sample of an encrypted file. The FBI does not encourage paying ransoms.\nPayment does not guarantee files will be recovered. It may also embolden adversaries to target\nadditional organizations, encourage other criminal actors to engage in the distribution of\nransomware, and/or fund illicit activities. However, the FBI understands that when victims are\nfaced with an inability to function, all options are evaluated to protect shareholders, employees\nand customers. The FBI may be able to provide threat mitigation resources to those impacted\nby Diavol ransomware. Regardless of whether you or your organization have decided to pay the\nransom, the FBI urges you to promptly report ransomware incidents to your local field office.\nDoing so provides the FBI with critical information needed to prevent future attacks by\nidentifying and tracking ransomware attackers and holding them accountable under US law.\n\n\n-----\n\n## Recommended Mitigations\n\n  - Implement a recovery plan to maintain and retain multiple copies of sensitive or\n\nproprietary data and servers in a physically separate, segmented, and secure location\n(i.e., hard drive, storage device, the cloud).\n\n  - Implement network segmentation and maintain offline backups of data to ensure\n\nlimited interruption to the organization.\n\n  - Regularly back up data, password protect backup copies offline. Ensure copies of critical\n\ndata are not accessible for modification or deletion from the system where the data\nresides.\n\n  - Install and regularly update antivirus software on all hosts, and enable real time\n\ndetection.\n\n  - Install updates/patch operating systems, software, and firmware as soon as\n\nupdates/patches are released.\n\n  - Review domain controllers, servers, workstations, and active directories for new or\n\nunrecognized user accounts.\n\n  - Audit user accounts with administrative privileges and configure access controls with\n\nleast privilege in mind. Do not give all users administrative privileges.\n\n  - Disable unused ports.\n\n  - Consider adding an email banner to emails received from outside your organization.\n\n  - Disable hyperlinks in received emails.\n\n  - Use multifactor authentication where possible.\n\n  - Use strong passwords and regularly change passwords to network systems and\n\naccounts, implementing the shortest acceptable timeframe for password changes. Avoid\nreusing passwords for multiple accounts.\n\n  - Require administrator credentials to install software.\n\n  - Only use secure networks and avoid using public Wi-Fi networks. Consider installing and\n\nusing a VPN.\n\n  - Focus on cyber security awareness and training. Regularly provide users with training on\n\ninformation security principles and techniques as well as overall emerging cybersecurity\nrisks and vulnerabilities (i.e., ransomware and phishing scams).\n\n## Additional Resources\n\nFor additional resources related to the prevention and mitigation of ransomware, go to\nhttps://www.stopransomware.gov as well as the CISA-Multi-State Information Sharing and\nAnalysis Center (MS-ISAC) Joint Ransomware Guide. Stopransomware.gov is the Government’s\nofficial one-stop location for resources to tackle ransomware more effectively.\n\n\n-----\n\n## Reporting Notice\n\nThe FBI encourages recipients of this document to report information concerning suspicious or\ncriminal activity to their local FBI field office. With regards to specific information that appears\nin this communication; the context, individual indicators, particularly those of a nondeterministic or ephemeral nature (such as filenames or IP addresses), may not be indicative of\na compromise. Indicators should always be evaluated in light of your complete information\nsecurity situation.\n\nField office contacts can be identified at www.fbi.gov/contact-us/field-offices. When available,\neach report submitted should include the date, time, location, type of activity, number of\npeople, and type of equipment used for the activity, the name of the submitting company or\norganization, and a designated point of contact.\n\n## Administrative Note\n\nThis product is marked TLP:WHITE. Subject to standard copyright rules, the information in this product\nmay be shared without restriction.\n\n\n### Your Feedback Regarding this Product is Critical\n\n#### Was this product of value to your organization? Was the content clear and concise?  Your comments are very important to us and can be submitted anonymously. Please take a moment to complete the survey at the link below. Feedback should be specific to your experience with our written products to enable the FBI to make quick and continuous improvements to such products. Feedback may be submitted online here:\n\n## https://www.ic3.gov/PIFSurvey\n\n#### Please note that this survey is for feedback on content and value only. Reporting of technical\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/Media/News/2022/220120.pdf",
        "http://www.ic3.gov/Media/News/2022/220120.pdf"
    ],
    "report_names": [
        "220120.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1642611593,
    "ts_modification_date": 1642611593,
    "files": {
        "pdf": "https://archive.orkl.eu/620d1dff9961cd685997fef0f77773691b858f57.pdf",
        "text": "https://archive.orkl.eu/620d1dff9961cd685997fef0f77773691b858f57.txt",
        "img": "https://archive.orkl.eu/620d1dff9961cd685997fef0f77773691b858f57.jpg"
    }
}