{
    "id": "15e51cd9-50a2-4341-9550-9c5d3e548cd8",
    "created_at": "2023-01-12T15:04:31.119159Z",
    "updated_at": "2025-03-27T02:15:26.216536Z",
    "deleted_at": null,
    "sha1_hash": "02eb10b8e32aa89fbf83c8396cf6db259b596c2d",
    "title": "2022-02-02 - BlackCat ransomware implicated in attack on German oil companies",
    "authors": "",
    "file_creation_date": "2022-05-28T02:07:13Z",
    "file_modification_date": "2022-05-28T02:07:13Z",
    "file_size": 912084,
    "plain_text": "# BlackCat ransomware implicated in attack on German oil companies\n\n**zdnet.com/article/blackcat-ransomware-implicated-in-attack-on-german-oil-companies/**\n\n[Home Innovation Security](https://www.zdnet.com/) [Ransomware](https://www.zdnet.com/topic/ransomware/)\nGerman newspaper Handelsblatt said 233 gas stations across Germany have been affected by the incident.\n\nWritten by Jonathan Greig, Staff Writer on Feb. 2, 2022\n\nAn internal report from the Federal Office for Information Security (BSI) said the BlackCat ransomware group was behind the recent\ncyberattack on two German oil companies that is affecting hundreds of gas stations across northern Germany.\n\n## ZDNet Recommends\n\n### The best security key\n\n\n-----\n\ne obust pass o ds e p you secu e you a uab e o e accou ts, a d a e based t o acto aut e t cat o ta es t at secu ty to t e\nnext level.\n\nRead now\n[German newspaper Handelsblatt managed to obtain the internal report that said Oiltanking's \"systems were compromised by the BlackCat](https://www.handelsblatt.com/unternehmen/energie/benzinversorgung-cyberangriff-auf-shell-zulieferer-sicherheitsbericht-zeigt-gefahr-durch-erpressersoftware-black-cat/28029264.html)\nransomware through a previously unknown gateway.\"\n\nClaudia Wagner, head of communications for Oiltanking GmbH, would not confirm that BlackCat was behind the attack but said they\ndiscovered the initial cyber incident on Saturday, January 29th.\n\n\"Upon learning of the incident, we immediately took steps to enhance the security of our systems and processes and launched an investigation\ninto the matter. We are working to solve this issue according to our contingency plans, as well as to understand the full scope of the incident.\nWe are undertaking a thorough investigation, together with external specialists and are collaborating closely with the relevant authorities. All\nterminals continue to operate safely.\n\n\"Oiltanking Deutschland GmbH & Co. KG terminals are operating with limited capacity and have declared force majeure. Mabanaft\nDeutschland GmbH & Co. KG has also declared force majeure for the majority of its inland supply activities in Germany. All parties continue to\nwork to restore operations to normal in all our terminals as soon as possible.\"\n\n[On Tuesday, Royal Dutch Shell said it was forced to reroute to different supply depots because of the issue. Handelsblatt said 233 gas stations](https://www.reuters.com/article/germany-cyber-shell-idCNL1N2UC0QD)\nacross Germany now have to run some processes manually because of the attack.\n\n**Also:** **[Apple, SonicWall, Internet Explorer vulnerabilities added to CISA list](https://www.zdnet.com/article/apple-internet-explorer-sonic-wall-vulnerabilities-added-to-cisa-list/)**\n\nLast year, [US oil giant Colonial Pipeline dealt with a devastating ransomware attack that crippled its business services and left significant parts](https://www.zdnet.com/article/colonial-pipeline-ransomware-attack-everything-you-need-to-know/)\n[of the East Coast without access to gas for less than a week. The Darkside ransomware group was eventually named as the culprit, and some](https://www.zdnet.com/article/colonial-pipeline-ceo-paying-darkside-ransom-was-the-right-thing-to-do-for-the-country/)\n[experts believe the group has rebranded multiple times to dodge law enforcement scrutiny.](https://www.zdnet.com/article/us-offers-10-million-reward-for-information-on-darkside-leaders-5-million-for-affiliates/)\n\nEmsisoft threat analyst Brett Callow said there are links tying Darkside to another ransomware group -- BlackMatter -- which made a name for\n[itself last summer and fall by attacking agricultural organizations.](https://www.zdnet.com/article/cisa-says-blackmatter-ransomware-group-behind-recent-attacks-on-agriculture-companies/)\n\n\"It's likely that BlackCat -- or ALPHV -- is a rebrand of BlackMatter, which was itself a rebrand of Darkside,\" Callow said. \"Intel suggests that\nthe individuals behind the operation fired their devs after the blunder which cost them -- and their affiliates -- multiple millions. New devs were\nrecruited and they were responsible for the development of BlackCat.\"\n\n[Last week Palo Alto Networks' Unit 42 released a deep-dive into the BlackCat ransomware, which emerged in mid-November 2021 as an](https://unit42.paloaltonetworks.com/blackcat-ransomware/)\ninnovative ransomware-as-a-service (RaaS) group leveraging the Rust programming language and offering affiliates 80-90% of ransom\npayments.\n\nBlackCat has been seen targeting both Windows and Linux systems, according to Unit 42, which added that it has observed affiliates asking\nfor ransom amounts of up to $14 million. In some instances, affiliates have offered discounts of $9 million if the ransom is paid before the\nestablished time. They allow ransom to be paid in Bitcoin and Monero.\n\n[Unit 42 found that at least 16.7% of the groups' victims were based in Germany. Last week, Italian fashion brand Moncler was revealed to be a](https://www.bleepingcomputer.com/news/security/fashion-giant-moncler-confirms-data-breach-after-ransomware-attack/)\n[BlackCat victim from December.](https://s3.documentcloud.org/documents/21181299/moncler-press-release-malware.pdf)\n\n\n-----\n\nscreen shot 2022 01 27 at 6 52 14 pm.png\n\n\nUnit 42\n[The incident with Oiltanking follows another cyberattack on billion-dollar German logistics firm Hellmann Worldwide Logistics that took place in](https://www.zdnet.com/article/german-logistics-giant-hellmann-reports-cyberattack/)\nDecember.\n\nJames Carder, chief security officer at LogRhythm, said the attack on Oiltanking is a perfect example of how cyberattacks can go beyond just\nthe targeted entity and disrupt the larger supply chain.\n\n\"In this case, the oil distributor supplies fuel to 26 companies in Germany, including Shell, which operates over 1,900 gas stations in the\ncountry,\" Carder said.\n\n\"While the supply of fuel has not been affected in the attack, impact remains consequential with IT systems responsible for the automation of\ntank loading and unloading processes, something that cannot be done manually, being forced offline for the time being. The 13 tank farms that\nOiltanking operates cannot currently serve trucks, so the firm has turned to alternative methods. The economic impact of cyberattacks affecting\nthe greater supply chain can prove to be extremely detrimental.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-02 - BlackCat ransomware implicated in attack on German oil companies.pdf"
    ],
    "report_names": [
        "2022-02-02 - BlackCat ransomware implicated in attack on German oil companies.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535871,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653703633,
    "ts_modification_date": 1653703633,
    "files": {
        "pdf": "https://archive.orkl.eu/02eb10b8e32aa89fbf83c8396cf6db259b596c2d.pdf",
        "text": "https://archive.orkl.eu/02eb10b8e32aa89fbf83c8396cf6db259b596c2d.txt",
        "img": "https://archive.orkl.eu/02eb10b8e32aa89fbf83c8396cf6db259b596c2d.jpg"
    }
}