{
    "id": "160fe81c-9d1e-4140-8c54-37a4bac607e2",
    "created_at": "2022-10-25T16:48:12.383236Z",
    "updated_at": "2025-03-27T02:05:32.48137Z",
    "deleted_at": null,
    "sha1_hash": "18d9bae2981f45046835347429f8a07088dd7887",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-09-17T08:09:24Z",
    "file_modification_date": "2020-09-17T08:09:24Z",
    "file_size": 1090366,
    "plain_text": "# 17 September\n 2020\n\nPIN Number\n# 20200917-001\n\nPlease contact the FBI with\nany questions related to this\nPrivate Industry Notification\nat either your local Cyber\n**Task Force or the Internet**\n**Crime Complaint Center**\n**(IC3).**\n\nLocal Field Offices:\n**[www.fbi.gov/contact-us/field-](http://www.fbi.gov/contact-us/field)**\n**office**\n\n\n### The following information is being provided by the FBI, with no guarantees or warranties, for potential use at the sole discretion of recipients to protect against cyber threats. This data is provided to help cyber security professionals and system administrator’s guard against the persistent malicious actions of cyber actors. This product was coordinated with DHS-CISA.\n This product is marked TLP:WHITE. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction.\n\n# IRGC-Associated Cyber Operations Against US Company Networks\n\n**Summary**\nThe FBI is sharing information about a group of Iran-based cyber\nactors recently indicted for conducting malicious cyber operations to\nobtain access to US-based networks and steal information. The Iranian\nnationals indicted are Said Pourkarim Arabi, a member of Iran’s Islamic\nRevolutionary Guard Corps (IRGC), Mohammad Reza Espargham, and\nMohammad Bayati, both associates of Arabi. Since at least 2015, the\nactors conducted malicious cyber activity against US-based and\nforeign organizations and companies involved in aerospace or satellite\ntechnology and international government organizations in the United\nStates, the United Kingdom, Singapore, Australia, and Israel.\n\nThe FBI is providing an overview of the group’s tactics, techniques, and\nprocedures, as well as indicators of compromise, to aid potential\ntargets in the identification of malicious activity.\n\n\n### TLP:WHITE\n\n\n-----\n\n**Details**\n\nThe FBI has observed Iran-based cyber actors conducting multi-phased cyber operations\ntargeted against companies in the United States. The FBI advises these cyber actors can achieve\nsubstantial unauthorized access to US company networks through harvesting of personally\nidentifying information, use of fraudulent identities, social engineering, and off-the-shelf\nmalicious tools. These operations have led to significant financial losses, with the actors\naccessing sensitive business information, intellectual property, and vendor information.\n\nThe FBI has observed these actors beginning their operations by identifying employees\nconnected to the US aerospace and satellite industry. The FBI judges the malicious cyber actors\nobtained personal details needed to impersonate employees via openly available sources, such\nas professional development and networking Web sites. The actors create fraudulent social\nmedia accounts impersonating those individuals. The actors then use information about those\nemployees for other purposes related to their operations, such as registering email and PayPal\naccounts and fraudulently purchasing domains and hacking tools.\n\nThe FBI has observed the actors create and send customized spear-phishing emails purporting\nto be from the individuals whose identities they had stolen. The emails would entice recipients\nto take action – usually clicking on a malicious link, which would download malware being\ndownloaded onto the victim’s computer and enable unauthorized access to victim networks. In\none instance, the actors were observed hosting malicious code on a file-sharing service\nregistered in the name of a US company employee, and including links to that malicious code in\nspear-phishing emails. One of the actors was observed using a fraudulent domain to host\nmalware, then sending a link to the malware via spear phishing.\n\nThe FBI observed these actors conducting follow-on activities to expand and maintain their\nunauthorized access, such as creating additional backdoors and escalating privileges. The actors\nwere observed using the below tools to exploit victims.\n\n\n**Details**\n\n\n### TLP:WHITE\n\n\n-----\n\n**Tool** **Description**\nMetasploit Framework An open source pen-testing framework\nsometimes used by attackers to exploit\nvulnerable systems and gain remote access.\nMetasploit contains a catalog of prewritten\nmodules and payloads that make its usage by\nattackers very simple.\nMimikatz A post-exploitation tool that dumps\npasswords from memory, as well as hashes,\nPINS, and Kerberos tickets.\nNanoCore RAT Remote Access Trojan that allows a user to\nremotely access and control computers. Also\nused to record user credentials and conduct\nsurveillance using infected computers.\nOCRA shell-code stagers Used to execute intrusions once malicious\ncode is active on a running system.\nPython Backdoor Open source backdoor written in the Python\nprogramming language. Additional way to\ncontrol a victim’s computer.\n\nThe FBI advises that the below indicators of compromise are historical in nature, but may be\nused to identify historical targeting efforts.\n\n**Indicator** **Context**\ntleanalyser[.]com May be included in spear-phishing messages as a provided link\ntheanalyser@gmail[.]com May be included in spear-phishing messages as contact email\nreseller.apples@gmail[.]com Sending account for spear-phishing emails\nnoreply@theanalyser[.]com From: line on spear-phishing messages\nidc-team[.]net May be identified in malware\n109.236.81[.]86 Used in 2017 intrusion activity\n91.210.107[.]120 Used in 2017 intrusion activity\n\n|Tool|Description|\n|---|---|\n|Metasploit Framework|An open source pen-testing framework sometimes used by attackers to exploit vulnerable systems and gain remote access. Metasploit contains a catalog of prewritten modules and payloads that make its usage by attackers very simple.|\n|Mimikatz|A post-exploitation tool that dumps passwords from memory, as well as hashes, PINS, and Kerberos tickets.|\n|NanoCore RAT|Remote Access Trojan that allows a user to remotely access and control computers. Also used to record user credentials and conduct surveillance using infected computers.|\n|OCRA shell-code stagers|Used to execute intrusions once malicious code is active on a running system.|\n|Python Backdoor|Open source backdoor written in the Python programming language. Additional way to control a victim’s computer.|\n\n|Indicator|Context|\n|---|---|\n|tleanalyser[.]com|May be included in spear-phishing messages as a provided link|\n|theanalyser@gmail[.]com|May be included in spear-phishing messages as contact email|\n|reseller.apples@gmail[.]com|Sending account for spear-phishing emails|\n|noreply@theanalyser[.]com|From: line on spear-phishing messages|\n|idc-team[.]net|May be identified in malware|\n|109.236.81[.]86|Used in 2017 intrusion activity|\n|91.210.107[.]120|Used in 2017 intrusion activity|\n\n\n**Tool** **Description**\n\n\n### TLP:WHITE\n\n\n-----\n\n**Example spear-phishing email using a link to a file-sharing service account hosting malware:**\n\n\n### TLP:WHITE\n\n\n**Example spear-phishing email using a link to a file-sharing service account hosting malware:**\n\n\n-----\n\n**Example spear-phishing email using an actor-registered and controlled domain hosting**\n**malware:**\n\n\n### TLP:WHITE\n\n\n**Example spear-phishing email using an actor-registered and controlled domain hosting**\n\n\n-----\n\n**Recommendations**\n\n  - Ensure anti-virus and anti-malware software is enabled and signature definitions are\n\nupdated regularly in a timely manner. Well-maintained anti-virus software may prevent\nuse of commonly deployed attacker tools that are delivered via spear phishing.\n\n  - Adopt threat reputation services at the network device, operating system, application,\n\nand email service levels. Reputation services can be used to detect or prevent lowreputation email addresses, files, URLs, and IP addresses used in spear-phishing attacks.\n\n  - Deploy application control software to limit which applications and executable code can\n\nbe run by users. Email attachments, and files downloaded via links in emails, often\ncontain executable code. Application control software limits users so they can only\nexecute applications and code allowed by the organization, rendering malicious\nexecutables delivered via spear phishing unable to execute.\n\n  - Limit the use of administrator privileges. Users who browse the internet, use email, and\n\nexecute code with administrator privileges make spear phishing much more effective by\nenabling attackers to move laterally across a network, gain additional accesses, and\naccess highly sensitive information.\n\n  - Be suspicious of unsolicited contact via email or social media from any individual you do\n\nnot know personally.\n\n  - Be suspicious of unsolicited or unexpected email or social media messages enticing\n\nrecipients to open an attached or hosted file.\n\n\n**Recommendations**\n\n\n### TLP:WHITE\n\n\n-----\n\n### Reporting Notice\n\n The FBI encourages recipients of this document to report information concerning suspicious or criminal activity to their local FBI field office. Field office contacts may be identified at www.fbi.gov/contact-us/field-office. When available, each report submitted should include the date, time, location, type of activity, number of people, and type of equipment used for the activity, the name of the submitting company or organization, and a designated point of contact.\n\n Administrative Note\n\n This product is marked TLP:WHITE. Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction.\n\n\n# Your Feedback Regarding this Product is Critical\n\n## Please take a few minutes to send us your feedback. Your feedback submission may be anonymous. We read each submission carefully, and your feedback will be extremely valuable to the FBI. Feedback should be specific to\n your experience with our written products to enable the FBI to make quick\n and continuous improvements to these products. Feedback may be\n submitted online here: https://www.ic3.gov/PIFSurvey\n\n\n### TLP:WHITE\n\n\n### Reporting Notice\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/media/news/2020/200917-1.pdf"
    ],
    "report_names": [
        "200917-1.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1600330164,
    "ts_modification_date": 1600330164,
    "files": {
        "pdf": "https://archive.orkl.eu/18d9bae2981f45046835347429f8a07088dd7887.pdf",
        "text": "https://archive.orkl.eu/18d9bae2981f45046835347429f8a07088dd7887.txt",
        "img": "https://archive.orkl.eu/18d9bae2981f45046835347429f8a07088dd7887.jpg"
    }
}