{
    "id": "16245b0e-4e81-4acb-b270-243c8b87a40b",
    "created_at": "2023-04-05T02:09:41.162456Z",
    "updated_at": "2025-03-27T02:05:38.725257Z",
    "deleted_at": null,
    "sha1_hash": "e57ea3d065a0a49488f9c55fe040945bfe0f0cc8",
    "title": "2023-03-11 - Analyzing GuLoader",
    "authors": "",
    "file_creation_date": "2023-04-03T08:33:50Z",
    "file_modification_date": "2023-04-03T08:33:50Z",
    "file_size": 255063,
    "plain_text": "# Analyzing GuLoader\n\n**[medium.com/@ZainWare/analyzing-guloader-42c1d6a73dfa](https://medium.com/@ZainWare/analyzing-guloader-42c1d6a73dfa)**\n\n(0xA1N-MalZaMes-ZainWare) March 11, 2023\n\n(0xA1N-MalZaMes-ZainWare)\n\nMar 11\n\n\n-----\n\n11 min read\n\nGuLoader [figure 1]\n\nSo we need to know what does GuLoader do for living, but before that let us discuss and talk\nabout its history.\n\n## GuLoader history:\n\nGuLoader also known as CloudEyE and vbdropper. First seen in the wild was in December\n2019 and it’s delivered via spam emails (Malspam) as an attachment fooling users and\nacting like a legit mail.\n\nHere’s some examples:\n\nMalspam using DHL theme to push GuLoader, MalwareBytes [Figure 2]\nanother Malspam, CrowdStrike [Figure 3]\nanother Malspam, PCrisk [Figure 4]\nFrom AhnLab [Figure 5]\n\nGuLoader got its name as Google Drive is frequently used as its download URL.\n(ASEC analysis team)\n\n**GuLoader is written in VB6(wrapper)containing the shellcode that gives GuLoader the**\nneeded flexibility to be heavily obfuscated to evade and escape from AVs and that gives\nGuLoader low detection on VT.\n\nGuloader has a lot of capabilities that we will discuss in a moment, After doing its work it\ndrops a lot of different malwares like RATs, stealers and ransomwares (ex: Formbook,\nRemcos, Lokibot, NanoCore, AgentTesla, Arkei/Vidar, NetWire, Hakbit, etc.) using clouds like\ngoogle drive(not always), at 2020(when GuLoader distributed and was so active) using cloud\nservices was a trend to deliver your malware and from a legitimate website was a big benefit\n(still a good thing for adversaries of course).\n\nAt 2020 Check Point exposed GuLoader as it’s related to CloudEye (CloudEyE is an italian\nsecurity software company intended for “Protecting windows applications from cracking,\n_tampering, debugging, disassembling, dumping”)._\n\n[here’s the link](https://research.checkpoint.com/2020/guloader-cloudeye/)\n\nWe will discuss GuLoader’s career through the past years 2020, 2021, 2022, and the latest\nItalian e-commerce attack(Feb 2023) using NSIS.\n\n\n-----\n\nA lot of its capabilities will continue through years and GuLoader s author will modify some\ncode implementations for them and some interesting techniques will be added.\n\n**So let’s start our analysis…**\n\n## At 2020 (GuLoader’s birth)\n\nAccording to Lawrence Abrams he said that first discovered this spam campaign is\nMalwareHunterTeam. I tried to get an early sample of it and the earliest sample i got(my\nstarting point) from Jan 15 2020:\n\nmd5:cf3e7341f48bcc58822c4aecb4eb6241\n\nGuLoader once executed will download an encrypted file from google drive and decrypt it\nthen inject it(not always) into wininit.exe(lgeitimate windows process) and evade\ndetection.They also impersonated WHO in Covid-19 pandemic.\n\nGuLoader as WHO (Malwarebytes) [Figure 6]\n\n## Process injection:\n\nHow does it excute?\n\nGuLoader uses process hollowing but Here shellcode doesn’t unmap memory code of\nlegitimate processes; instead it uses the NtCreateSection:\n\nBy calling CreateProcessInternalW to create the legitimate process\nRegAsm.exe(C:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\RegAsm.exe) or if it doesn’t\nfind it will loop(in the same path) to find MSbuild.exe or RegSvcs.com(they all a part of.NET\nframework maybe will distribute .NET malware) and create it in susbended state\nCREATE_SUSPENDED(0x00000004) then will use zwOpenFile to open a file handle to\nmstsc.exe or msvbvm60.dll then will call NtCreateSection for this fila handle to create a\nsection of memory with the desired access parameter then this section mapped in the\nlegitimate process that in suspended state (ex: RegAsm.exe) using NtMapViewOfSection\nwith base address 0x400000 instead of a normal high load address then will call\nNtWriteVirtualMemory to write the shellcode in this new section. Now after writting the\nshellcode in this newly allocated memory GuLoader needs to excutes it by using\nNtSetContextThread to change the context of the only thread running in the targeted process\nthat is still in a suspended state. now this context change sets the EIP register to the address\nthat points to the begining of the shellcode that will make the shellcode runs by using\nNtResumeThread. The shellcode will do some anti debugging, analysis, vm and some other\ninteresting techniques.that’s what we will talk about next.\n\n## Anti AVs:\n\n\n-----\n\nGuLoader is wrapped in a VB6 and changing in every campaign to evade AV detections and\ninside it the shellcode and\n\nthe downloaded payloads are encrypted with a hard coded 4 bytes XOR key embedded\ninside the malware to make it difficult for AVs so it won’t identify the payload as malicious.\n\n## Anti Debugging:\n\nGuLoader does hooks for functions DbgBreakPoint and DbgUiRemoteBreakin. And patches\nthese two APIs by replacing the INT3 opcode of DbgBreakPoint with opcode 90 (NOP or no\noperation to do nothing) and for DbgUiRemoteBreakin it replaces the first few bytes with a\ndummy call to cause a crash.\n\nCrash message [Figure 7]\nand another thing that GuLoader does is to hide its running thread from debuggers by calling\nNtSetInformationThreadpushing with the value (0x11) as the second parameter and that\nvalue is ThreadHideFromDebugger.\n\nAlso GuLoader checks for both hardware and software breakpoints by checking DR0-DR7\nregisters (that registers responsible for hardware breakpoints by debuggers)\n```\n//Hardware breakpoint checkscmp dword ptr ds:[eax+4],0jne Crash_fncmp dword ptr ds:\n[eax+8],0jne Crash_fntest bl,blcmp dword ptr ds:[eax+C],0jne Crash_fncmp dword ptr\nds:[eax+10],0jne Crash_fntest ecx,ecxcmp dword ptr ds:[eax+14],0jne Crash_fncmp dword\nptr ds:[eax+18],0jne Crash_fncmp ah,ah\n\n```\n[eax+4] = DR 0\n\n[eax+8] = DR 1\n\n[eax+C] = DR 2\n\n[eax+10] = DR 3\n\n[eax+14] = DR 4\n\n[eax+18] = DR 5\n\nand this Crash_fn that responsible for showing the crash message box[Figure 7].\n\nand the software breakpoints by looking for 0xCC (INT3), 0x3C and 0xB0F and if a\nbreakpoint is found it will cause a crash (same as the message above)[Figure 7].\n```\npop eaxtest bx,bxmov bl,byte ptr ds:[eax]cmp bl,CC         //CC je\nCrash_fnmov bx,word ptr ds:[eax]cmp bx,3CD        //3CDje Crash_fncmp\nedx,ebxmov bx,word ptr ds:[eax]cmp bx,B0F        //B0Fje Crash_fn// I didn't\nfind assembly so i chose less cuz it's making the code colorful. :)\n\n```\nthis Crash_fn that responsible for showing the crash message box[Figure 7].\n\n## Anti Sandboxing and VMs (virtualization):\n\n\n-----\n\nGuLoader is using EnumWindows API to count all the windows on the screen and if it s less\nthan 12 (by checking EAX value if less than 12)it calls TerminateProcess.\n```\ncall eax    // EAX containing <user32.EnumWindows>pop eaxcmp eax,C   // 12jge\nTerminateProcess_fn\n\n```\n**Using CPUID:**\n\ncalling CPUID then do\n\nbt ecx,1F // 31\n\ncause if it’s running inside a debugger or vm the 31st bit will be set to one\n\n(by default it’s zero)\n\nand then showing the crash message box[Figure 7].\n\ncalling CPUID will generate a VM exit to the VM manager and that takes much more time\nthan running in a physical machine.\n\n**Using RDTSC:**\n\nRDTSC(Read Time-Stamp Counter) is the same and takes so much time and slower if it’s in\na vm but in GuLoader it’s using:\n\nmov ecx,186A0\n\n(that’s 100,000 times). Storing it in ECX it’s the number of times EDI will be incremented\nwith.\n\nthen decrement ecx and then compare it with 0 if not zero will return again till ecx becomes\nzero\n\nand we said that edi will be incremented, it’ll be incremented till it comares it with\n\ncmp edi,68E7780\n\n(that’s 110,000,000 times). cause if it reachs that number will enter the loop again and it will\nbe an infinte loop.\n\nAs you can see GuLoader choosing specific time and numbers for that so of course these\nnumbers mean something. I guess he estimated everything in a virsualized environment.\n\nGuLoader also uses instruction hammering we have seen this techniques in so many\nmalware samples by executing massive amounts of delay that exceeds the execution time\non a sandbox or any analyzer so the payload execution is never reached. GuLoader also\n\n\n-----\n\nuses ZwQueryVirtualMemory to lacate any pages that contains any strings that related to\nVMs(scaning the process’s memory)with the handle 0xffffffff(to retrieve the base address of\nevery page) and if it finds any, will create the Crash message box[Figure 7].\n\n## Api resolving:\n\nGuLoader uses a DJB2 hash algorithm for resolving APIs to hide them from the IAT( import\naddress table). When it needs any windows API it resolves it first as it first generates the\nhashs for every function in Kernel32.dll then when it needs any API it’ll call it by its hash\nvalue.Like if it needs CreateProcessInternalW will use 9688DA44.\n\n**DJB2**\n```\nunsigned long\nhash(unsigned char *str)\n{\n\n unsigned long hash = 5381;\n int c;\n\n while (c=*str++)\n  hash = ((hash << 5) + hash) + c;\n return hash;}\n\n```\nusing 5381 in this alogrithm cause fewer collisions and better avalanching\n\nusing 33 never explained\n\nusing (hash << 5) + hash that’s bit shifting and it’s faster for CPU than performing hash*32\nand that’s shifting it five bits to left as multiplying it with 2⁵ (32) and adding it to itself means it\nbecoming 33.\n\n## Entering Heaven:\n\nGuloader is a 32-bit application and if it’s running on 64-bit systems could trick the operating\nsystem into executing 64-bit code, despite initially declaring itself as 32-bit process. How\ndoes it happen? by calling 32-bit ntdll.dll then wow64.dll (windows on windows) and that will\ncall wow64cpu.dll and then call wow64Transition and that’s the heaven’s gate and then\nperforms a far jmp instruction that switches into 64-bit and use ntdll.dll but the 64 version of\nit.How do you know if it’s using Heaven’s gate or not?\n\nby using FS:[0xC0] register value(containing a pointer to FastSysCall in wow64) to see if the\nsystem is x64 or not so if it’s a 64 it will use heaven’s gate.\n\n(mov ebx, dword ptr FS:[C0]).\n\n\n-----\n\n[in this year 2020, when CheckPoint exposed CloudEyE at June 8 2020,GuLoader was](https://research.checkpoint.com/2020/guloader-cloudeye/)\nboomin at June 9:\n\nMalware Bazzar[Figure 8]\nCheckPoint[Figure 9]\nHere you can see it was active at that month and at June 10 Sebastiano said:\n\nService Suspension temporarily[Figure 10]\nbut CheckPoint came again after this Message:\n\nTaking down The top malicious dropper of 2020 said by CheckPoint[Figure 11]\nResume_service Malwarebytes[Figure 12]\nSo i think that’s enough for 2020 let’s discuss 2021.\n\nNumber of GuLoader samples submitted to MalwareBazaar during Jan-Oct 2021(deepinstict)\n\n[Figure 13]\n2021’s code is the same as 2020 plus some features. I’ll discuss these features as the\nprevious ones i already talked about above.\n\n## Anti VMs:\n\nGuLoader searches for Qemu emulator and virtualizer\n\nC:\\Program Files\\Qemu-ga\\qemu-ga.exe\n\nand also searching for qga (Qemu gues agent).\n\nC:\\Program Files\\qga\\qga.exe\n\nChecking the installed softwares by using MsiEnumProductsA, MsiGetProductInfoA.\n\nThe MsiEnumProductsA function enumerates through all the products currently installed.\n\nThe MsiGetProductInfoA function returns product information for published and installed\nproducts.\n\nby using OpenSCManagerA GuLoader opens a specific service control manager database\nand checks for running processes by using EnumServicesStatusA.\n\nOpenSCManagerA establishes a connection to the service control manager on the specified\ncomputer and opens the specified service control manager database.\n\nEnumServicesStatusA function Enumerates services in the specified service control\nmanager database. The name and status of each service are provided, along with additional\ndata based on the specified information level. Examples of some services GuLoader is\nlooking for:VMware tools, VMware snapshot provider.\n\n\n-----\n\nChecking windows drivers by using EnumDeviceDrivers and GetDeviceDriverBaseName.\n\nEnumDeviceDrivers receives the list of load addresses for the device drivers.\n\nGetDeviceDriverBaseName Retrieves the base name of the specified device driver.\n\nExamples of some drivers GuLoader is looking for:vm3dmp.sys, vm3dmp_loader.sys,\nvmmouse.sys and vmusbmouse.sys.\n\n## Anti analysis:\n\nGuLoader uses a lot of useless and dummy calls like pushfd followed by popfd, using mov\nedx,edx or repeating some instructions or doing some arithmetic calculations for nothing.\nAnd using opaque predicate.\n\nOpaque predicates are conditions that always(constant) true or false and obfuscate it to hide\nthat they are constant and fool the disassembler that there’s two paths but in fact there’s only\none path.\n\nAll used APIs is hashed by DJB2 as we know but before using any of them GuLoader XOR\nthe shellcode then calling them and then xoring it again to return the instructions back. At this\nprocess the disassembler treats the xored instructions as data and doesn’t define it as\nfunctions.\n```\nsome code instructions then followed by\n;..............................................    db    db  random hex   \ndb\n\n## 2022\n\n```\nIn 2022 Guloader started to use NSIS.\n\nWhat is NSIS used for?\n\nNSIS (Nullsoft Scriptable Install System) is a tool that allows programmers to create\n**such installers for Windows. It is released under an open source license and is**\ncompletely free for any use. NSIS creates installers that are capable of installing,\nuninstalling, setting system settings, extracting files, etc.\n\ntrellix[Figure 14]\n\n## Anti debugging:\n\nlike any animal that lives in caves when searching for food he goes out and then return again\nto its cave not to be noticed.GuLoader when it uses any data will first decrypt it and then\nencrypt it again covering itself from being noticed Another example:the first 40 bytes of the\n\n\n-----\n\nshellcode is responsible for decrypting the code and after doing its job all the 40 bytes\nchanged to NOPs(90 No operation) like it’s destroying its key.\n\nBy using VEH(Vectored Exception Handling a function to handle all exceptions for the\napplication) GuLoader waste researchers time by raising expections and distrub the control\nflow of the sc pointing and jumping to other instructions handling it by using\nRtlAddVectoredExcepitionHandler API. Another use of Exception handler GuLoader uses it\nfor software breakpoints and hardware breakpoints if an exception is raised by any of them\nwill continue without jumping and excutes some invalid instructions and if non of them are set\nit’ll jump to a new value and continue.\n\nBy using NtQueryInformationProcess GuLoader checks for a presence of a remote debugger\nand by using 0x7 as the second parameter (ProcessDebugPort) by checking the return\nvalues if it’s non-zero it means the process is being debugged.\n\nBeside using RegAsm.exe(for process injection) GuLoader also used caspol.exe and\naspnet_compiler.exe. And after that it calls NtOpenFile on C:\\Windows\\syswow64\\iertutil.dll(I\nalready explained how process injection happens in GuLoader above).\n\n## Conclusion:\n\nGuLoader doesn’t targeting a specific nation or a specific industry but most of its attacks is\nE-Commerce.\n\n[Figure 15]\nIt’s just a service everyone can buy it(with minimum 100$) and do whatever he wants (if\nreally GuLoader is part of CloudEyE).\n\nGuLoader started long ago and still active and will remain active because it uses\npolymorphic Shellcode that always change and its DJB2 algorithm XORing the hashes\neverytime with a different key so no need for a table to save its API hashes because it’s\nchanging everytime and also using NSIS and improving it over time. Using a lot of anti\ndebugging it’s trivial and well known but with all these techniques it’s pain in the ass and time\nconsuming for reversing it.\n\n## Additional reading & Resources\n\n[GuLoader? No, CloudEyE.](https://research.checkpoint.com/2020/guloader-cloudeye/)\n\nMalware Analysis: GuLoader Dissection Reveals New Anti-Analysis Techniques and Code\nInjection Redundancy\n\n[GuLoader: Peering Into a Shellcode-based Downloader](https://www.crowdstrike.com/blog/guloader-malware-analysis/)\n\n\n-----\n\n[GuLoader: The NSIS Vantage Point](https://www.trellix.com/en-us/about/newsroom/stories/research/guloader-the-nsis-vantage-point.html)\n\n[Defeating Guloader Anti-Analysis Technique](https://unit42.paloaltonetworks.com/guloader-variant-anti-analysis/)\n\n[GuLoader: A fileless shellcode based malware in action](https://securitynews.sonicwall.com/xmlpost/guloader-a-fileless-shellcode-based-malware-in-action/)\n\n[[Down]loaded by GuLoader Malware | DeepInstinct](https://www.deepinstinct.com/blog/-down-loaded-by-guloader-malware)\n\n[The evolution of GuLoader](https://www.vmray.com/cyber-security-blog/malware-analysis-spotlight-guloader/)\n\n[Spoofed Saudi Purchase Order Drops GuLoader: Part 1](https://www.fortinet.com/blog/threat-research/spoofed-saudi-purchase-order-drops-guloader?utm_source=blog&utm_medium=blog&utm_campaign=spoofed-saudi-purchase-order-drops-guloader)\n\n[Spoofed Saudi Purchase Order Drops GuLoader — Part 2](https://www.fortinet.com/blog/threat-research/spoofed-saudi-purchase-order-drops-guloader-part-two)\n\n[GuLoader: The RAT Downloader](https://blog.morphisec.com/guloader-the-rat-downloader)\n\n[Dissecting the new shellcode-based variant of GuLoader (CloudEyE)](https://www.spamhaus.com/resource-center/dissecting-the-new-shellcode-based-variant-of-guloader-cloudeye/)\n\n[Dancing With Shellcodes: Cracking the latest version of Guloader](https://elis531989.medium.com/dancing-with-shellcodes-cracking-the-latest-version-of-guloader-75083fb15cb4)\n\n[Playing with GuLoader Anti-VM techniques](https://outpost24.com/blog/playing-with-guloader-anti-vm-techniques-malware)\n\nand so many others but i don’t remember :(\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-11 - Analyzing GuLoader.pdf"
    ],
    "report_names": [
        "2023-03-11 - Analyzing GuLoader.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660581,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1680510830,
    "ts_modification_date": 1680510830,
    "files": {
        "pdf": "https://archive.orkl.eu/e57ea3d065a0a49488f9c55fe040945bfe0f0cc8.pdf",
        "text": "https://archive.orkl.eu/e57ea3d065a0a49488f9c55fe040945bfe0f0cc8.txt",
        "img": "https://archive.orkl.eu/e57ea3d065a0a49488f9c55fe040945bfe0f0cc8.jpg"
    }
}