{
    "id": "1661cc5d-1ea0-4c51-a932-47817f0334eb",
    "created_at": "2023-01-12T15:02:15.379494Z",
    "updated_at": "2025-03-27T02:05:42.934178Z",
    "deleted_at": null,
    "sha1_hash": "2cc0c7a5ab76ec0cdc464ea376e8fb6f53d982bd",
    "title": "2017-01-04 - Technical analysis of CryptoMix-CryptFile2 ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T03:33:01Z",
    "file_modification_date": "2022-05-28T03:33:01Z",
    "file_size": 1422188,
    "plain_text": "# Technical analysis\n\n**[cert.pl/en/news/single/technical-analysis-of-cryptomixcryptfile2-ransomware/](https://www.cert.pl/en/news/single/technical-analysis-of-cryptomixcryptfile2-ransomware/)**\n\n## Campaign\n\nCryptoMix is another ransomware family that is trying to earn money by encrypting victims\nfiles and coercing them into paying the ransom.\n\nUntil recently it was more known as CryptFile2, but for reasons unknown to us it was\nrebranded and now it’s called CryptoMix.\n\nIt was observed in the wild being served by the Rig-V exploit kit.\n\nThis malware stands out from among others, but not necessarily in a good way.\n\n### Price\n\nFirst unusual thing about this family is very large amount of money requested – 5 bitcoins is\nan insane amount of money (especially considering that CryptoMix is really primitive under\nthe hood, but we’ll get to it). We don’t know how many victims have paid, but probably few\nwere desperate enough.\n\nAdditionally we have stumbled upon following comment discouraging anyone from paying\nthe ransom:\n\n\n-----\n\nDO NOT PAY FOR THIS!!!\nwe were infected and they asked for 10 bitcoins, after some negotiations the price was\nlowered to 6 bitcoins. they provided 1 decrypted file to prove concept. we paid 6\nbitcoins and they asked for another .6 as the c&c server will not provide the key due to\nlate payment. after promptly paying another .6 bitcoins (about $4800 in total) there has\nbeen no communication from them! its been 2 weeks and nothing.\nWHATEVER YOU DO, DO NOT TRUST THEM, THEY WILL NOT DECRYPT YOUR\nFILES!!!!\n\nWe can’t verify if this is true, but it sounds plausible – if someone is desperate enough to pay\n6 bitcoins for his files, he probably can be coerced into paying even more. As usual, we\ndiscourage anyone from supporting the criminals by paying the ransom.\n\n### Payment portal\n\nAdditionally CryptoMix doesn’t have any payment portal in the Tor network. Or any payment\nportal, for that matter – victim have to write an email and literally wait some time before\nmalware operators kindly send the decryption keys\n\n(assuming that they will do it, instead of bargaining for even more money).\n\nFor example, ransom message can look like this (most recent variant):\n\nOr like this (older variant):\n\nWe don’t think that this strategy was well thought out. First of all, using emails for\ncommunication with victims is bothersome and need constant attention.\n\nAutomated portal would be much more reliable and secure for both sides. Additionally,\nemails are prone to being deleted/locked, effectively cutting malware authors from their\n“clients”.\n\n### Charity\n\nContent of exchanged emails is very unusual too. Actors claim to be a charity organization (!)\nthat is going to sponsor presents and medical help for children. For example:\n\nThat’s really original, but unfortunately also obviously false.\n\nLeaving aside strange quirks of ransomware “interface”, let’s get more technical. In its heart,\nCryptoMix is just a bare bones encryptor – it doesn’t have any fancy features, it doesn’t have\na web portal, it doesn’t change user wallpaper, the only thing it does is encrypting every file\non the victim’s disk and on the mounted network drives.\n\nCryptoMix is protected by a very primitive packer – the real binary is stored in resources, and\nxored with a hardcoded key. For some reason, Cuckoo has problems with automatic\nunpacking of cryptomixer, so we had to write our own unpacker. Using pefile and Yara is very\n\n\n-----\n\neasy:\n\nAfter decryption ransomware checks whether it’s being debugged – but no antiVM\ntechniques are employed, so everything works as it should under VirtualBox.\n\nBefore file encryption starts, the ransomware checks internet connectivity (using\nInternetOpenUrl function). If everything is ok, an encryption key is generated on victim’s PC\nand sent to the C&C server.\nOtherwise, depending on malware version, either a hardcoded encryption key is used or\nmalware is spinning in an infinite loop until the internet connection is restored.\n\nThe main function can be expressed as follows:\n\nAfter encryption key is generated/selected, it is stored in windows registry. Registry key used\nfor malware specific data varies depending on version, but for example\nSoftWare\\Microsoft\\Windows\\Shell\\Nodes Slots,\nSoftWare\\Microsoft\\Windows\\Shell\\FlashPlayerPluginK or Software\\Adobe Reader\nLicensionSoftWare\\AdobeLicensionSoftWare can be used (malware probably tries to hide its\npresence by impersonating another software).\n\nThe list of supported extensions constains more than 1250 entries:\n\nThat’s quite a lot of extensions, but nothing special (for comparsion: CryptXXX supports 933\nextensions, CrypMIC 901). Most unusual thing here is inclusion of another ransomware\nextensions (for example .zepto, .locky, .crypt, .locked, .cryptolocker, .cryptowall, etc).\n\n## Encryption\n\nLet’s get back to ransom message for a while:\n\nMalware claims that our files are “encrypted with 2048bit RSA KEY”. Well, it’s not entirely\ntrue. Yes, 2048bit RSA key is generated with windows Crypto API – but after RSA key is\nselected, it is hashed with SHA256 to create a real encryption key and every file on disk is\nencrypted with that key. Encryption algorithm used is AES 256 in CBC mode without\ninitialization vector.\n\nEncryption routine can be summarized with this (simplified) code:\n\nThis function is called for every file, so hashing rsaKey and deriving AES key every time\ndoesn’t make much sense. But there is bigger problem with it – there is no need for such\nthings as “public” and “private” keys, because this encryption routine is entirely symmetric –\nRSA serves here just as (unnecesarily slow) random number generator.\n\nSo yes, in a way RSA is “used for encryption”, but files are not encrypted with RSA and\nencryption is entirely symmetric.\n\n\n-----\n\nUserID given by CryptoMix is not random – it is generated from username and serial number\nfor first disk.\n\nThis doesn’t seem like a good idea, because UserIDs absolutely have to be unique, and\nneither username nor volume serial number is designed to be unique – so userID collisions\nare possible and very plausible (after taking low entropy of userID and birthday paradox into\naccount).\nWhy is this a problem? Because when UserID collision happens, malware creators have no\nway of distinguishing two users apart – so they don’t know which encryption key belongs to\nwhich user, and can’t send the right one. It’s also possible that in case of collision old key will\nbe overwritten in database and lost.\n\nFinally, CryptoMix achieves persistence by copying itself to user documents and writing to\nHKEY_CURRENT_USER\\SoftWare\\Microsoft\\Windows\\CurrentVersion\\Run registry key.\n\nAs a final measure, all shadow copies are removed (if user doesn’t have admin account,\nUAC window is shown before):\n\n## Cryptomix Decryptor\n\nDue to a cryptographic flaw in encryption, we are able to decrypt CryptoMix (and CryptFile2),\n**but only sometimes and only if files were encrypted with a vulnerable version.**\n\nIf your files were encrypted by CryptoMix and you don’t want to pay a ransom, you can\ncontact us at [[email protected] and we’ll see what we can do.](https://www.cert.pl/cdn-cgi/l/email-protection#8feceafdfbcfeceafdfba1ffe3)\n\nPlease attach a single encrypted file without changing it’s filename after encryption (for\n[example warnings.h.email[[email protected]]id[7e5973f5e0ce337d].lesli).](https://www.cert.pl/cdn-cgi/l/email-protection)\n\n## Hashes/patterns\n\nCryptomix packer (old and new):\n\nCryptomix payload (after unpacking):\n\nhashes:\n\nc2f30cd537c79b6bcd292e6824ea874e sample0\n\nbefc0e43b38fe467ddc3ddd73150a9fc sample0 decrypted\n\n8c413e31f39a54abf78c3585444051f7 sample1\n\n0d1206246bf15c521474cee42f13fc09 sample1 decrypted\n\nb778bda5b97228c6e362c9c4ae004a19 sample2\n\n042a38a32cd20e3e190bb15b085b430a sample2 decrypted\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-01-04 - Technical analysis of CryptoMix-CryptFile2 ransomware.pdf"
    ],
    "report_names": [
        "2017-01-04 - Technical analysis of CryptoMix-CryptFile2 ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535735,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653708781,
    "ts_modification_date": 1653708781,
    "files": {
        "pdf": "https://archive.orkl.eu/2cc0c7a5ab76ec0cdc464ea376e8fb6f53d982bd.pdf",
        "text": "https://archive.orkl.eu/2cc0c7a5ab76ec0cdc464ea376e8fb6f53d982bd.txt",
        "img": "https://archive.orkl.eu/2cc0c7a5ab76ec0cdc464ea376e8fb6f53d982bd.jpg"
    }
}