{
    "id": "16ab5b70-d854-43df-8b51-b6dda75e4a5b",
    "created_at": "2023-01-12T15:04:51.059231Z",
    "updated_at": "2025-03-27T02:06:00.322513Z",
    "deleted_at": null,
    "sha1_hash": "6ed168cbff2224d80c85b125b1810fd2a0c20f2c",
    "title": "2020-09-22 - Uniklinik Düsseldorf- Ransomware -DoppelPaymer- soll hinter dem Angriff stecken",
    "authors": "",
    "file_creation_date": "2022-05-29T01:27:33Z",
    "file_modification_date": "2022-05-29T01:27:33Z",
    "file_size": 734430,
    "plain_text": "# Uniklinik Düsseldorf: Ransomware \"DoppelPaymer\" soll hinter dem Angriff stecken\n\n**[heise.de/news/Uniklinik-Duesseldorf-Ransomware-DoppelPaymer-soll-hinter-dem-Angriff-stecken-4908608.html](https://www.heise.de/news/Uniklinik-Duesseldorf-Ransomware-DoppelPaymer-soll-hinter-dem-Angriff-stecken-4908608.html)**\n\nOlivia von Westernhagen\n\nDie Verantwortlichen für den Angriff auf die Uniklinik sitzen laut Justizministerium\nmöglicherweise in Russland. Die Ermittlungen und Aufräumarbeiten dauern an.\n\nLesezeit: 4 Min.\n\nIn Pocket speichern\n[vorlesen](https://app-eu.readspeaker.com/cgi-bin/rsent?customerid=4407&lang=de_de&readid=meldung&url=https%3A%2F%2Fwww.heise.de%2Fnews%2FUniklinik-Duesseldorf-Ransomware-DoppelPaymer-soll-hinter-dem-Angriff-stecken-4908608.html%3Fseite%3Dall) [Druckansicht Kommentare lesen](https://www.heise.de/news/Uniklinik-Duesseldorf-Ransomware-DoppelPaymer-soll-hinter-dem-Angriff-stecken-4908608.html?view=print) 57 Beiträge\n\n\n-----\n\n(Bild: Shutterstock/BlurryMe)\n\n22.09.2020 14:19 Uhr\nSecurity\n\nVon\n\nOlivia von Westernhagen\n\nNach dem Angriff auf die Düsseldorfer Uni-Klinik führt eine mögliche Spur der Täter laut\nJustizministerium nach Russland. So hätten die Angreifer eine Schadsoftware namens\n\"DoppelPaymer\" in das System geschleust. Dieser Verschlüsselungstrojaner sei bereits in\nzahlreichen anderen Fällen weltweit gegen Unternehmen und Institutionen von einer\nkriminellen Hacker-Gruppe eingesetzt worden, die nach Einschätzung privater\nSicherheitsunternehmen in der Russischen Föderation beheimatet sein soll. Das teilte das\nMinisterium von Nordrhein-Westfalen am Dienstag laut dpa in einem Bericht an den\nRechtsausschuss mit.\n\nDie Cybercrime-Bande hinter DoppelPaymer hat sich ähnlich wie die mit der Emotet-Gang\nzusammenarbeitende Trickbot-Bande auf das Erpressen von Firmen und Organisationen\nspezialisiert. Sie setzen ebenfalls sehr ausgefeilte Techniken ein, um sich in den Netzen\nauszubreiten und dabei unbemerkt zu bleiben, bis sie tatsächlich Daten verschlüsseln. Ihre\nLösegeldforderungen richten sich nach dem \"Wert\" des jeweiligen Angriffsziels und können\nMillionenhöhe erreichen. Mitte März dieses Jahres hatte die DoppelPaymer-Gang, wie auch\n[einige andere Ransomware-Gruppen, eine \"Corona-Pause\" für Krankenhäuser versprochen](https://www.heise.de/meldung/Medizinische-Einrichtungen-laut-Interpol-verstaerkt-im-Visier-von-Ransomware-4698733.html)\n– ein Versprechen, das sie dann doch nicht einhielt.\n\n### Einbruch via \"Shitrix\" bestätigt\n\n\n-----\n\nDie Ermittler wissen inzwischen, dass die kriminellen Hacker zunächst einen sogenannten\n\"Loader\" zum Nachladen des eigentlichen Schadprogramms ins System der Uni-Klinik\neinschmuggelten. Offen blieb in dem Bericht, wann das war. Das Bundesamt für Sicherheit\nin der Informationstechnologie (BSI) hatte vergangene Woche mitgeteilt, dass die\nentsprechende Sicherheitslücke in Software von Citrix bereits seit dem Jahreswechsel\nbekannt war. Dabei handelte es sich um eine Lücke in der Citrix-VPN-Software, die unter\ndem Namen \"Shitrix\" bekannt wurde (CVE-2019-19781):\n\nLesen Sie auch\n\n## Cyber-Angriff auf Uniklinik Düsseldorf: #Shitrix schlug zu\n\n[Die Uni-Klinik hatte nach eigenen Angaben damals sofort reagiert. Zwei Spezialfirmen hätten](https://www.heise.de/news/Uniklinik-zum-Cyber-Angriff-Alles-richtig-gemacht-4905686.html)\ndas System noch einmal überprüft – ohne Hinweis auf eine Gefährdung durch die nun\ngeschlossene Sicherheitslücke. Offenbar schlummerte der \"Loader\" da aber bereits auf\neinem Server der Uni-Klinik.\n\nDas wahrscheinlichste Szenario ist somit derzeit, dass die Cyberkriminellen die Shitrix-Lücke\nsehr bald nach ihrem Bekanntwerden und noch vor der Bereitstellung des Patches durch\nCitrix ausgenutzt haben. Sie sind dann darüber in das Netz der Uni-Klinik eingedrungen und\nhaben dort heimlich eine Backdoor platziert. Das kann durchaus auch auf einem anderen\nSystem als dem eigentlichen VPN-Server geschehen sein, sodass die Hintertür beim\nInstallieren der Citrix-Updates nicht gefunden wurde. Erst jetzt, viele Monate später, haben\nsie diese Backdoor benutzt, um wieder Zugriff auf das Netz der Uni-Klinik zu erlangen.\n\n### Täter halfen nach \"Irrtum\" beim Entschlüsseln\n\n\n-----\n\nDer eigentliche Angriff durch die nachgeladene Verschlüsselungssoftware passierte erst in\nder Nacht vom 10. auf den 11. September. 30 Server der Uni-Klinik wurden durch das\nSchadprogramm verschlüsselt – wobei die Cyberkriminellen eigentlich wohl die Düsseldorfer\nUniversität attackieren wollten. Zu der hatten sie ein digitales Erpresserschreiben adressiert.\nAls die Polizei den Tätern ihren mutmaßlichen Fehler mitteilte, schickten diese einen\ndigitalen Schlüssel, um das Krankenhaus wieder zum Laufen zu bekommen.\n\nDie Ermittler vermuten laut dem Bericht an den Landtag, dass die Uni-Klinik Opfer einer\n[\"weltweiten kommerziellen Malware-Kampagne\" geworden sein könnte. Weitere Details](https://www.heise.de/thema/Malware)\nnannte ein Sprecher der zuständigen Staatsanwaltschaft bei der Zentrale- und\nAnsprechstelle Cybercrime (ZAC) am Dienstag nicht. Laut einer Statistik der USamerikanischen Temple University liegt die Frequenz der Attacken mit Erpresser-Software\ndieses Jahr auf dem Höchststand seit 2013. Dabei gezählt wurden allerdings nur die\nöffentlich bekannten Angriffe. Ermittler gehen von einer hohen Dunkelziffer aus, bei der zum\nBeispiel Unternehmen auf die Forderungen der Erpresser eingehen.\n\n### Ermittlungen und Bereinigung laufen weiter\n\n[Die Ermittlungen um den Verdacht der fahrlässigen Tötung einer Patientin liefen unterdessen](https://www.heise.de/news/Hackerangriff-auf-Uniklinik-Duesseldorf-Ermittlungen-wegen-fahrlaessiger-Toetung-4904134.html)\nweiter, erklärte der ZAC-Sprecher. Die Frau war statt in die nahe Uni-Klinik in ein weiter\nentferntes Krankenhaus nach Wuppertal gebracht worden und gestorben. Für den Vorwurf\nder fahrlässigen Tötung könnte unter anderem entscheidend sein, ob die Frau eine\nÜberlebenschance gehabt hatte, wenn sie in die Uni-Klinik gekommen wäre.\n\nDie IT des Krankenhauses ist unterdessen weiter nicht voll einsatzbereit. Die größte Klinik\nder Landeshauptstadt rechnet nach Angaben eines Sprechers damit, dass die Zentrale\nNotaufnahme diese Woche eventuell ihren Dienst wieder aufnehmen kann. Noch seien aber\nnicht alle entsprechenden Systeme wieder hochgefahren.\n\nLesen Sie auch\n\n\n-----\n\n## Cybercrime: Erpressung auf neuem Niveau\n\n[(ovw)](http://10.10.0.46/mailto:ovw@heise.de)\n\n\n-----",
    "language": "DE",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-22 - Uniklinik Düsseldorf- Ransomware -DoppelPaymer- soll hinter dem Angriff stecken.pdf"
    ],
    "report_names": [
        "2020-09-22 - Uniklinik Düsseldorf- Ransomware -DoppelPaymer- soll hinter dem Angriff stecken.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535891,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653787653,
    "ts_modification_date": 1653787653,
    "files": {
        "pdf": "https://archive.orkl.eu/6ed168cbff2224d80c85b125b1810fd2a0c20f2c.pdf",
        "text": "https://archive.orkl.eu/6ed168cbff2224d80c85b125b1810fd2a0c20f2c.txt",
        "img": "https://archive.orkl.eu/6ed168cbff2224d80c85b125b1810fd2a0c20f2c.jpg"
    }
}