{
    "id": "16ca97ba-443f-4201-95b5-ad8c26b3a872",
    "created_at": "2022-10-25T16:48:13.558992Z",
    "updated_at": "2025-03-27T02:14:57.44278Z",
    "deleted_at": null,
    "sha1_hash": "fdf388b793a73c47a7caab35a5c4645c83c0931a",
    "title": "Dino: The Latest Spying Malware From An Allegedly French Espionage Group Analyzed",
    "authors": "ESET",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1402962,
    "plain_text": "**Security news, views and insight from the ESET experts**\n\n\n# Dino – the latest spying malware from an allegedly French espionage group analyzed\n\n**BY** **[JOAN CALVET POSTED 30 JUN 2015 ­ 11:12AM](http://www.welivesecurity.com/author/joan/)**\n\nIn this blog we describe a sophisticated backdoor, called Dino by its creators. We believe this malicious\nsoftware has been developed by the Animal Farm espionage group, who also created the infamous **[Casper,](http://www.welivesecurity.com/2015/03/05/casper-malware-babar-bunny-another-espionage-cartoon/)**\n**[Bunny and](http://www.cyphort.com/evilbunny-malware-instrumented-lua/)** **[Babar malware. Dino contains interesting technical features, and also a few hints that the](http://www.cyphort.com/babar-suspected-nation-state-spyware-spotlight/)**\ndevelopers are French speaking\n\n\n-----\n\ny y g p y\nCommunications Security Establishment (CSE) in **[a set of slides leaked by Edward Snowden in March 2014.](http://www.spiegel.de/media/media-35683.pdf)**\nIn those slides CSE assess with “moderate certainty” that this group is a French intelligence agency. Since\nthen, several examples of malware created by Animal Farm have been found and publicly documented, in\nparticular:\n\nCasper, a stealthy first­stage implant, **[documented by ESET in last March](http://www.welivesecurity.com/2015/03/05/casper-malware-babar-bunny-another-espionage-cartoon/)**\n\nBunny, a Lua­based backdoor, documented by **[Marion Marschalek (Cyphort)](http://www.cyphort.com/evilbunny-malware-instrumented-lua/)**\n\nBabar, an espionage platform, also analyzed by **[Marion Marschalek](http://www.cyphort.com/babar-suspected-nation-state-spyware-spotlight/)**\n\nThe connection between those pieces of malware and the group described in CSE slides has been convincingly\nestablished, for example by **[Paul Rascagnères (G Data).](https://blog.gdatasoftware.com/blog/article/babar-espionage-software-finally-found-and-put-under-the-microscope.html)**\n\nIn this blog post we add a new piece to the puzzle with Dino, another malicious program belonging to Animal\nFarm’s arsenal.\n\n## Introduction\n\nThe sample of Dino documented in this blog post was used in 2013 against targets in Iran. The original means\nof infection is unknown, though we believe Dino was installed by another program, as it contains an\nuninstallation command without the corresponding installation procedure. Given the set of commands it can\nreceive, Dino’s main goal seems to be the exfiltration of files from its targets.\n\nThe binary’s original name, “Dino.exe”, has been left visible by its authors, as was the case with Casper. Dino –\nwhich could be referring to the pet character from **[The Flintstones cartoon show – was already mentioned in a](http://en.wikipedia.org/wiki/Dino_(The_Flintstones))**\nrecent **[Kaspersky blog as a “full­featured espionage platform,” but no technical analysis has been published](https://securelist.com/blog/research/69114/animals-in-the-apt-farm/)**\nyet.\n\nRoughly, Dino can be described as an elaborate backdoor built in a modular fashion. Among its technical\ninnovations, there is a custom file system to execute commands in a stealthy fashion, and a complex task­\nscheduling module working in a similar way to the “cron” Unix command. Interestingly, the binary contains a lot\nof verbose error messages, allowing us to see Dino’s developers’ choice of wording. Also, a few technical\nartefacts suggest that Dino was authored by native French speakers.\n\n## Dino Basics\n\n### Modules List\n\nDino has been developed in C++ and presents a well­defined modular architecture. The following array lists the\nmodules contained in this Dino binary; the module names are those assigned by the developers.\n\n\n-----\n\n|PSM|Encrypted on­disk copy for Dino modules|\n|---|---|\n|CORE|Configuration storage|\n|CRONTAB|Task scheduler|\n|FMGR|File upload and download manager|\n|CMDEXEC|Command execution manager|\n|CMDEXECQ|Storage queue for commands to execute|\n|ENVVAR|Storage for environment variables|\n\n\n### Data Structure\n\nDino heavily relies on a custom data structure named “DataStore” by the Animal Farm developers. In particular,\nall Dino’s modules store their content inside this structure, making its understanding one of the keys to\nanalyzing Dino.\n\nA DataStore is a **[map from string keys to values of 8 possible types, such as integers or strings. The](http://en.wikipedia.org/wiki/Associative_array)**\nimplementation of this data structure is based on a **[hash table. It means that to retrieve the value associated](http://en.wikipedia.org/wiki/Hash_table)**\nwith a key, one has to calculate the hash of the key to locate a bucket from which the value can be retrieved.\n\nDino’s hash is a one­byte value calculated with a series of XOR operations on the key, and each bucket starts a\nlinked list containing key/value pairs. The code responsible for retrieving the value associated with a key is\nshown in Figure 1.\n\n\n-----\n\nFigure 1\n\n\nFinally, DataStore objects can be serialized in a custom format, which begins with the magic word “DxSx”. This\nis used in particular by the PSM module to save the content of Dino modules in an encrypted file. More\nprecisely, when a modification is made to a module’s content in memory, the PSM module saves it as a\nserialized DataStore. When Dino restarts, the module is deserialized from the file and loaded into memory.\nFunnily enough, the key serving to encrypt the file on disk is “PsmIsANiceM0du1eWith0SugarInside”.\n\n### Configuration\n\nDino’s configuration is initially stored in a serialized DataStore object contained in a zip archive at the end of the\nDino binary. At runtime this object is deserialized and stored inside the CORE module. We can list the\nconfiguration’s content with Dino’s “conf –l CORE” command – described later – which displays on separate\nrows each key’s name, its associated value and the type of this value:\n\n**Started:5523F782 QWORD**\n**InitialWaitDone:00000001 DWORD**\n**InteractiveDelay:00000005 DWORD**\n**MaxNothingSaidCount:00000078 DWORD**\n**InstallDate: 5523F782 QWORD**\n**fields:78537844…[REDACTED]…66B3900 BYTES**\n**recID:11173­01­PRS WIDESTR**\n**Version:1.2 WIDESTR**\n**BD Keys: 4D41474943424F58** [REDACTED] 9EB3506 BYTES\n\n\n-----\n\n**ComServer0:hXXp://www.azhar.bf/…[REDACTED]…/postal.php STR**\n**ComServer1:hXXp://www.rsvniima.org/…[REDACTED]…/din12/postal.php STR**\n**ComServer2:hXXp://www.azhar.bf/…[REDACTED]…/postal.php STR**\n**ComServer3:hXXp://www.rsvniima.org/…[REDACTED]…/din12/postal.php STR**\n**ComServer4:hXXp://dneprorudnoe.info//…[REDACTED]…/postal.php STR**\n**ComServer5:hXXp://dneprorudnoe.info//…[REDACTED]…/postal.php STR**\n**ComServer6:hXXp://dneprorudnoe.info//…[REDACTED]…/postal.php STR**\n**NextSendReceive:5CC33097FB72D001 BYTES**\n**CC:000064F7­72E4­3F7D­C817­474D­A9BDBDF7 STR**\n**DaysOfLife:00000000 DWORD**\n**GUID:12FEB4A9EEDEE411B283000C29FD2872 BYTES**\n**InitialDelay:00000000 DWORD**\n**now:5523F78E QWORD**\n**hash:A88E8181CA5CE35AE70C76145DFB820D BYTES**\n**InitialCommands:78537844…[REDACTED]…000000 BYTES**\n**xT0rvwz:DC188352A…[REDACTED]…00000 BYTES**\n**tr4qa589:K/[RAFtIP?ciD?:D STR**\n**jopcft4T:a.ini WIDESTR**\n\nWhile most of the keys have self­explanatory names, we would like to focus on the following keys:\n\n“recID”: Animal Farms binaries contain an ID whose decimal value appears to identify the target, “11173­01­\nPRS” in this case. For example Casper used an “ID” value set to “13001”, whereas some Babar samples\nused “12075­01” and “11162­01”. We do not know the meaning of the “PRS” suffix added in the case of\nDino.\n\n“ComServer”: These keys contain the command and control (C&C) servers’ URLs. All the URLs were down\nwhen we started our analysis. Those C&Cs were compromised legitimate websites, which is standard\noperating procedure for Animal Farm.\n\n“Version”: Dino’s code version; here set to “1.2”, which is confirmed by the “din12” folder used in one of the\nC&C URLs. For the record, a “d13” folder has been seen on another Animal Farm C&C (see “3.7 Calling\nhome” of **[Marschalek’s Babar report), indicating that Dino version 1.3 has also likely been deployed at](https://drive.google.com/file/d/0B9Mrr-en8FX4dzJqLWhDblhseTA/edit)**\nsome point.\n\n“BD_Keys” and “CC_Keys” contain cryptographic keys to encrypt the network communications with C&C\nservers. Their values start with the word “MAGICBOX”.\n\nThe three last keys are displayed with obfuscated names (“xT0rvwz”, “tr4qa589” and “jopcft4T”) and store\nparameters for the custom file system we will describe later.\n\n### Commands\n\n\n-----\n\nEach of those commands can take one or more arguments.\n\n|Command|Purpose|\n|---|---|\n|sysinfo|Retrieve reconnaissance information from the machine|\n|killBD|Uninstall Dino using the custom file system (see ramFS description below for details)|\n|!|Execute Windows batch command passed as a parameter|\n|cd|Change the current work directory|\n|pwd|Retrieve the current work directory path|\n|dir|List files in a given directory with various additional information|\n|set|Set or remove environment variables stored in the ENVVAR module|\n|conf|Display or update module content|\n|search|Search for files whose names match given patterns. The files found are packed in an archive, which is then scheduled for upload to the C&C using the FMGR module.|\n|archive|Create an archive from given file paths|\n|unarchive|Unpack an archive to a given location|\n|download|Schedule a file transfer to the C&C using the FMGR module|\n|cancel|Remove the next file transfer scheduled in the FMGR module|\n|cancelall|Remove all scheduled file transfers in the FMGR module|\n|cronadd|Schedule a command to be executed at a certain time by the CRONTAB module (see CRONTAB description below for details)|\n|cronlist|List registered entries in the CRONTAB module|\n|crondel|Remove an entry in the CRONTAB module|\n|wakeup|Schedule a wake­up of the malware after a certain amount of time using the CRONTAB module|\n|restart|N/A: the command is actually not implemented|\n|showip|Display the public IP of the infected machine|\n|cominfos|Display information about the currently used C&C server|\n|comallinfos|Display information about all known C&C servers|\n|wget|Download a file from the currently used C&C server onto the machine|\n|delayttk|Delay the de­installation of the malware, if scheduled|\n\n\n-----\n\nexample, it can provide all files with a “.doc” extension, the size of which is bigger than 10 kilobytes, and that\nwere modified in the last 3 days. We believe this exfiltration of files to be Dino’s end goal.\n\nAt startup Dino executes successively the commands stored in the “InitialCommands” field in its configuration;\nin the sample we analyzed they are:\n\nsysinfo\ncominfos\n!ipconfig /all\n!ipconfig /displaydns\n!tracert **[www.google.com](http://www.google.com/)**\n\nThose commands serve as a reconnaissance step for the operators. Their execution is managed by the\nCMDEXEC module, the commands being stored in a queue inside the CMDEXECQ module. The result is\nreported to the C&C server.\n\nAfter having described Dino’s basics, we are now going to dig into two particularly interesting components; first,\na custom file system used by the malware, and then the CRONTAB module in charge of task scheduling.\n\n## RamFS: A Temporary File System\n\nDino contains a custom file system named “ramFS” by its developers. It provides a complex data structure to\nstore files in memory, each of them bearing a name corresponding to filenames used by usual file systems.\nRamFS also comes with a set of custom commands that can be stored in files and executed. It should be\nnoticed that ramFS is also present in other Animal Farm binaries (see attribution paragraph below), but since\nwe are unaware of previous analysis of ramFS, we are describing our findings here.\n\n### Architecture\n\nRamFS content is initially stored encrypted in Dino’s configuration under the key “xT0rvwz”, whereas the\ncorresponding RC4 key is stored under the key “tr4qa589”. Once the file system has been decrypted, it is\nstored in memory as a linked list of 512­byte memory chunks, each one of them being individually RC4­\nencrypted. When looking for a file in ramFS, each chunk is decrypted, processed and then re­encrypted. Hence\nthere are very few noticeable traces of ramFS during its use.\n\nHere are some high­level characteristics of this file system:\n\nFile names and file content are encoded in Unicode\n\nFile names length is limited to 260 characters\n\nOnce decrypted, file content is manipulated as chunks of 540 bytes\n\n\n-----\n\ntherefore we believe this file system to be an original creation of the Animal Farm group.\n\n### Commands\n\nSeveral commands can be executed in the context of ramFS, as listed in the following Table.\n\n**Command** **Meaning**\n\nChange the current work directory on the real file\nCD\n\nsystem\n\nMD N/A: the command is actually not implemented\n\nInstallation or de­installation of Dino, in Windows\nINSTALL\n\nregistry and/or as a service\n\nEXTRACT Extracts a file stored in ramFS onto the machine\n\nDELETE Deletes a file stored on the machine\n\nEXEC Executes a file stored in ramFS\n\nINJECT Injects a file stored in ramFS into a running process\n\nSLEEP Sleeps for a given amount of time\n\nKILL Terminates a running process\n\nAUTODEL N/A: the command is actually not implemented\n\n### Usage of ramFS in Dino\n\nIn the case of Dino, ramFS serves as protected storage for one specific file containing the instructions to\nremove the malware from the machine. The developers named this file the “cleaner” and it is executed when\nDino receives the command “killBD” (the “BD” acronym is the developers’ designation of the malware).\n\nFigure 2 shows the code responsible for executing this cleaner file. First, it retrieves the name of the file from\nDino’s configuration (“a.ini”), then it retrieves the key to decrypt ramFS, and it finally mounts the file system in\nmemory in order to execute the cleaner file stored inside. The verbosity of the error messages makes it\nparticularly easy to understand the purpose of the code.\n\n|Command|Meaning|\n|---|---|\n|CD|Change the current work directory on the real file system|\n|MD|N/A: the command is actually not implemented|\n|INSTALL|Installation or de­installation of Dino, in Windows registry and/or as a service|\n|EXTRACT|Extracts a file stored in ramFS onto the machine|\n|DELETE|Deletes a file stored on the machine|\n|EXEC|Executes a file stored in ramFS|\n|INJECT|Injects a file stored in ramFS into a running process|\n|SLEEP|Sleeps for a given amount of time|\n|KILL|Terminates a running process|\n|AUTODEL|N/A: the command is actually not implemented|\n\n\n-----\n\nFigure 2\n\n\nThe cleaner file contains the string “INSTALL ­A “wusvcd” ­U” which, once executed, will uninstall the malware\nfrom the machine – “wusvcd” being the name used to register Dino on the machine.\n\nHence, ramFS serves as a protected container for files to be executed on the machine, offering a disposable\nexecution environment to the operators and leaving very few traces on the system.\n\n## Tasks scheduling in a Unix fashion\n\nThe commands “cronadd”, “cronlist” and “crondel” serve respectively to add, list, and remove scheduled tasks\nregistered in the CRONTAB module. Those tasks are Dino’s commands.\n\nThe syntax to define scheduled tasks is similar to the one used by the **[cron Unix command. In particular the](http://en.wikipedia.org/wiki/Cron)**\ntime at which to run a command is given by a string following the format “minute hour day month year\ndayofweek”. Alternatively, this string can be replaced by “@boot” for a command to run at each startup –\nwhereas some Unix cron implementations accept “@reboot”.\n\nAs an example, here is the output of the “cronlist” command after a “wakeup” command has been scheduled to\n\nrun on 7[th] April 2015 at 15:44:\n\n\n-----\n\nAs we can see, each entry is identified by an “Id”, an incrementing hexadecimal number starting at 0xC0. The\npurpose of the “Local” field remains unclear (the other possible value being “­l”). The “Count” parameter counts\nthe number of times a command has been executed, “­1” indicating the command will be executed only once.\nFinally, the “Visibility” field defines whether the command execution will be reported to the C&C (the other\npossible value being “Silent”).\n\n## Attribution\n\n### Dino Belongs To The Farm\n\nThe amount of shared code between Dino and known Animal Farm malware leaves very little doubt that Dino\nbelongs to Animal Farm’s arsenal. Among these shared features, we can cite the following:\n\nAt the very beginning of Dino execution, the current process name is checked against process names used\nby some sandboxes:\n\n\nFigure 3\n\n\nA very similar check (against “klavme”, “myapp”, “TESTAPP” and “afyjevmv.exe”) is present in Bunny samples,\nand in some first­stage implants deployed by Animal Farm.\n\nTo hide its calls to certain API functions, Dino employs a classic Animal Farm ploy: a hash is calculated from\n\n\n-----\n\nexclusive­or (XOR) operations.\n\nThe Dino’s custom file system – the so­called ramFS – is present in several droppers used by Animal Farm.\nIn those binaries the file system serves to set the persistence of the payload. For example, here is the\ncommand executed by some NBOT droppers in the context of ramFS:\n\nAs a final indication that Dino belongs to Animal Farm menagerie, it is noticeable that the output of Dino’s\nsysinfo command looks like an updated version of the “beacon” from the SNOWBALL implant described in\nthe leaked CSE slides – part of operation SNOWGLOBE, which led to the discovery of Babar:\n\n**Dino’s sysinfo example output**\n\nLogin/Domain (owner): Administrator/JOHN (john)\nComputer name: JOHN\nOrganization (country): (United States)\nRecId: 11173­01­PRS\nMaxDelay: 3600\nVersion: 1.2\nOS version (SP): 5.1 (Service Pack 3)\nWOW64: No\nDefault browser: firefox.exe\nIE version: Mozilla/4.0 (compatible; MSIE 7.0; Win32)\nFirst launch: 04/01/2015 – 18:31:14\nTime to kill: N/A\nLast launch : 04/01/2015 – 19:21:44\nMode: N/A | Rights: Admin | UAC: No\nID: 4635BEF0­D89D­11E4­B283­000C­29FD2872\nInstallAv: 0\nInj: Yes\n\n**SNOWBALL implant beacon**\n\n\n-----\n\nAll these indicators together make us very confident that Dino was developed by the Animal Farm group.\n\n### French speaking Developers\n\nDino adds at least two more indicators to those already documented suggesting that Animal Farm developers\nare French speaking:\n\nDino’s binary contains a resource whose language code value is 1036. The original purpose of this language\ncode is to allow developers to provide resources (menus, icons, version information…) for different locations\nin the world in the corresponding language. Interestingly, when a developer does not manually specify the\nlanguage code, the compiler sets it to the language of the developer’s machine. So, which language\ncorresponds to the value 1036, or 0x40c in hexadecimal? **[French (France).](https://msdn.microsoft.com/en-us/library/windows/desktop/dd318693(v=vs.85).aspx)**\n\nOf course a non­French speaking developer could have deliberately set this value to mislead attribution efforts.\nBut in more recent Animal Farm binaries (for example Casper), this language code has been set to the classical\nEnglish (USA) language code. Therefore, it seems that Animal Farm developers forgot to set this value in their\nfirst creations, realized their mistake at some point, and decided to set a standard value. Someone using the\nlanguage code as a false flag would have likely kept the strategy going.\n\n\n-----\n\nDino’s binary is statically linked with the **[GnuMP library, which is used to manipulate big numbers in](https://gmplib.org/)**\ncryptography algorithms. The GnuMP code in Dino contains file paths coming from the developer’s machine:\n\n..\\..\\src\\arithmetique\\mpn\\mul.c\n..\\..\\src\\arithmetique\\printf\\doprnt.c\n..\\..\\src\\arithmetique\\mpn\\tdiv_qr.c\n..\\..\\src\\arithmetique\\mpn\\mul_fft.c\n..\\..\\src\\arithmetique\\mpn\\get_str.c\n\nAs the attentive reader has probably guessed, “arithmetique” is the French translation of “arithmetic”.\n\n## Conclusion\n\nDino’s binary shows an intense development effort, from custom data structures to a homemade file system. As\nwith other Animal Farm binaries, it bears the mark of professional and experienced developers.\n\nBut Dino also shows a poor knowledge, or interest, from these developers in anti­analysis techniques – contrary\nto what was seen in Casper – as demonstrated, for example, by the verbosity of some Dino’s log messages:\n\nAll those messages provide substantial help in understanding Dino’s internal workings. One will also appreciate\nthe numerous misspellings contained in the messages.\n\nRegarding Dino’s victims, we know very little except that they were located in Iran in 2013. This is in\naccordance with the victimology described by Canada’s CSE in its presentation:\n\n\n-----\n\nThat leads us to the final point of this blog: several signs suggest that Dino’s creators are French speaking\ndevelopers. These signs add to the pretty long list of indicators already supporting this hypothesis, in particular\nthe ones mentioned by **[Canada’s CSE.](http://www.spiegel.de/media/media-35683.pdf)**\n\n## Indicators of Compromise\n\n**Indicator** **Value**\n\nSample SHA1 _BF551FBDCF5A982705C01094436883A6AD3B75BD_\n\nC&C URL hXXp://www.azhar.bf/modules/mod_search/found/cache/postal.php\n\nC&C URL hXXp://www.rsvniima.org/templates/rsv/icons/din12/postal.php\n\nC&C URL hXXp://dneprorudnoe.info/sxd/lang/i18n/charcodes/postal.php\n\nPath C:\\Program Files\\Common Files\\wusvcd\\wusvcd.exe\n\nDefault storage file C:\\Program Files\\Common Files\\wusvcd\\wusvcd00000000­0000­\nnames 0000­0000­0000­00000000.{dax,dat,lck}\n\nDownloaded file\n.tmp_dwn\nname extension\n\nRegistry key Software\\Microsoft\\Windows\\Windows\\CurrentVersion\\Run\\wusvcd\n\nAuthor **[Joan Calvet, ESET](https://plus.google.com/u/0/104185472052604521400/posts)**\n\n|Indicator|Value|\n|---|---|\n|Sample SHA1|BF551FBDCF5A982705C01094436883A6AD3B75BD|\n|C&C URL|hXXp://www.azhar.bf/modules/mod_search/found/cache/postal.php|\n|C&C URL|hXXp://www.rsvniima.org/templates/rsv/icons/din12/postal.php|\n|C&C URL|hXXp://dneprorudnoe.info/sxd/lang/i18n/charcodes/postal.php|\n|Path|C:\\Program Files\\Common Files\\wusvcd\\wusvcd.exe|\n|Default storage file names|C:\\Program Files\\Common Files\\wusvcd\\wusvcd00000000­0000­ 0000­0000­0000­00000000.{dax,dat,lck}|\n|Downloaded file name extension|.tmp_dwn|\n|Registry key|Software\\Microsoft\\Windows\\Windows\\CurrentVersion\\Run\\wusvcd|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/wavmm2zrlt4n1jri8byn31b9fb1wo35i",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.06.30.dino-spying-malware-analyzed/Dino%20%E2%80%93%20the%20latest%20spying%20malware%20from%20an%20allegedly%20French%20espionage%20group%20analyzed.pdf"
    ],
    "report_names": [
        "ESET_Dino_French",
        "Dino – the latest spying malware from an allegedly French espionage group analyzed"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e09a7338-fb16-4e39-b579-c3bfc3140c47",
            "created_at": "2022-10-25T16:07:24.207294Z",
            "updated_at": "2025-03-27T02:02:10.140203Z",
            "deleted_at": null,
            "main_name": "Snowglobe",
            "aliases": [
                "ATK 8",
                "Animal Farm",
                "SIG20",
                "Snowglobe"
            ],
            "source_name": "ETDA:Snowglobe",
            "tools": [
                "Babar",
                "Casper",
                "Chocopop",
                "Dino",
                "EvilBunny",
                "Nbot",
                "TFC",
                "Tafacalou"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "548a4081-aa8f-4e2a-bcb3-0c9dfa61944f",
            "created_at": "2023-01-06T13:46:38.443779Z",
            "updated_at": "2025-03-27T02:00:02.835042Z",
            "deleted_at": null,
            "main_name": "SNOWGLOBE",
            "aliases": [
                "Snowglobe",
                "ATK8",
                "Animal Farm"
            ],
            "source_name": "MISPGALAXY:SNOWGLOBE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041697,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/fdf388b793a73c47a7caab35a5c4645c83c0931a.pdf",
        "text": "https://archive.orkl.eu/fdf388b793a73c47a7caab35a5c4645c83c0931a.txt",
        "img": "https://archive.orkl.eu/fdf388b793a73c47a7caab35a5c4645c83c0931a.jpg"
    }
}