{
    "id": "16d8b99d-d7e0-4672-8b55-e27731e93110",
    "created_at": "2023-01-12T14:58:53.431588Z",
    "updated_at": "2025-03-27T02:08:57.083957Z",
    "deleted_at": null,
    "sha1_hash": "f2caa601b0d759b49eff1959492af9b2f83308a2",
    "title": "2021-03-24 - OAuth Abuse- Think SolarWinds-Solorigate Campaign with Focus on Cloud Applications",
    "authors": "",
    "file_creation_date": "2022-05-27T22:51:34Z",
    "file_modification_date": "2022-05-27T22:51:34Z",
    "file_size": 175731,
    "plain_text": "# OAUTH ABUSE: THINK SOLARWINDS/SOLORIGATE CAMPAIGN WITH FOCUS ON CLOUD APPLICATIONS\n\n**[proofpoint.com/us/blog/cloud-security/oauth-abuse-think-solarwindssolorigate-campaign-focus-cloud-applications](https://www.proofpoint.com/us/blog/cloud-security/oauth-abuse-think-solarwindssolorigate-campaign-focus-cloud-applications)**\n\nMarch 12, 2021\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Cloud Security](https://www.proofpoint.com/us/blog/cloud-security)\nOAUTH ABUSE: THINK SOLARWINDS/SOLORIGATE CAMPAIGN WITH FOCUS ON\nCLOUD APPLICATIONS\n\n\n-----\n\nMarch 23, 2021 Itir Clarke and Assaf Friedman\n\nEnterprise app stores such as Microsoft AppSource and Google Workspace Marketplace\noffer millions of useful OAuth apps and add-ons: analytics, security, CRM, document\nmanagement, project management and more. An OAuth app is an application that integrates\nwith a cloud service and may be provided by a vendor other than the cloud service provider.\nThese apps add business features and user-interface enhancements to cloud services such\nas Microsoft 365 and Google Workspace. Most OAuth apps request permission to access\nand manage user information and data and sign into other cloud apps on the user’s behalf.\nFor example, they can access users’ files, read their calendars, send emails on their behalf\nand more. Given the broad permissions they can have to your core cloud applications,\nOAuth apps have become a growing attack surface and vector. Attackers use various\nmethods to abuse OAuth apps, including compromising app certificates, which was also\nused in the SolarWinds/Solorigate campaign.\n\n## Risk of Cloud-to-Cloud Integration with OAuth\n\nThese add-on apps use OAuth authentication to obtain limited access to cloud services.\nOAuth enables a user’s account information or data to be used by apps without exposing the\nuser’s password. OAuth works over HTTPS, using access tokens (rather than login\ncredentials) to authorize devices, APIs, servers, and applications. OAuth apps can be added\nto an entire domain or to an individual user account. OAuth apps can easily be exploited.\nAttackers can use OAuth access to compromise and takeover cloud accounts. Until the\nOAuth token is explicitly revoked, the attacker has persistent access to the user’s account\nand data. In simple terms, we can describe these risky apps as malicious, vulnerable and\nabused.\n\n## Malicious apps phish users for permissions to access cloud resources\n\nA malicious application is cloud malware that uses various tricks such as OAuth token\nphishing and app impersonation to manipulate account owners into consent.\n\n\n-----\n\nThese apps usually require sensitive user delegated permissions so they can avoid being\ndetected by an IT administrator and still get access to the sensitive resources. Such\nresources may include:\n\nEmail, which allows reading, sending on users' behalf and setting up mail-forwarding\nrules\nFiles to exfiltrate data or plant malware to share with contacts\nOther resources that allow access to data or enable lateral movement within the\norganization\n\nIn 2020 alone, we discovered more than 180 malicious applications, most of them were\nattacking multiple tenants. The ones that were the most widespread attacked more than 200\ndifferent tenants with one app instance. An example of such a widespread and ongoing\n[attack is “MexOAuth\\TA2552.” It targets Spanish-speaking users (specifically Mexican](https://www.proofpoint.com/us/blog/threat-insight/ta2552-uses-oauth-access-token-phishing-exploit-read-only-risks)\ncitizens). This attack starts with [phishing emails sent to enterprise users. The phishing URL](https://www.proofpoint.com/us/threat-reference/phishing)\nredirects to the enterprise login and app consent page. The page impersonates the Mexican\ntax authorities, Facebook or Amazon. It even sometimes has a COVID-19 theme. Many\nfamilies of malicious applications attack specifically VPs, Managers, HR leaders and other\nsenior accounts with high visibility to sensitive assets.\n\n## Bad coding or design can make OAuth apps vulnerable to attackers\n\nVulnerable applications are applications that are susceptible to a hostile takeover by a bad\nactor due to bad coding or design. Such applications will not require interaction between the\nattacker and the target accounts to turn rogue. Instead, an attacker will compromise the\napplications’ assets or mechanisms. Such examples were observed in the Microsoft Teams\n[application in March 2020, where sharing a GIF may result in an account takeover.](https://www.cyberark.com/resources/threat-research-blog/beware-of-the-gif-account-takeover-vulnerability-in-microsoft-teams)\n\n## OAuth abuse often rides on the coattails of account compromise\n\nAbused applications are legitimate applications that are authorized and/or used by an\nattacker to perform a non-legitimate activity such as exfiltrate data, maintain persistence on\nspecific resources while compromising an account or any other goal.\n\nThe main reason for choosing that method would be the low footprint and the durability:\n\nWith abused applications, the attacker can either add a legitimate application to the\ncloud tenant or use an existing one previously authorized by the account owner. The\nactual consent of a new app would raise no questions and the logs would be legitimate.\nIn contrast, malicious applications usually require abnormal consent from the account\nowner.\nSuch attacks are resistant to password changes and multifactor authentication (MFA)\nsetups, which are the two main tools used against account compromise. This also is\ntrue for malicious OAuth apps.\n\n\n-----\n\n**OAuth abuse is widespread**\n\nOAuth application abuse follows on the coattails of account compromise. Proofpoint monitors\nthousands of cloud tenants and over 20 million active cloud users. In a study of 2020 data,\nProofpoint observed the following:\n\n95% of organizations were targeted\n52% of organizations had at least one compromised account\n32% of compromised organizations had post-access activity such as file manipulation,\nemail forwarding, and OAuth app activity\n10% of organizations had authorized malicious OAuth apps\n\nWithout visibility to OAuth app abuse, your cloud users and data are not safe from threat\nactors. So, let’s dig deeper into the topic of OAuth abuse.\n\n**Application abuse: When and Why?**\n\nAn application abuse is not a usual \"exploit\" or a vulnerability, but simply the misuse of a\nlegitimate application for the following reasons:\n\nMaintain persistence:\n\nAuthorization of an application in most cases is a one-time effort. The application\nwill maintain access to the resources owned by the account owner until the\nOAuth token is revoked (refresh token) or the app is deleted.\nSetting MFA or changing credentials will not affect the application token\ngeneration capabilities.\nLeave a low footprint:\n\nAbusing a legitimate application will raise no questions upon consent, application\nsign-in, or activity.\nOther than consent to an application in a compromised session, there will be little\ncorrelation between the abuse setup and the malicious activity.\nFrom an attacker's standpoint, setting up an application for abuse can be performed\neasily or automatically, using CLI \\ PowerShell scripts.\nIn most cases, an attacker will have to compromise the target account first to abuse an\napplication. The attacker can achieve this by malicious login to the target account,\nman-in-the-middle attacks (session hijack), malicious applications, etc. Compromising\na target account refers to an in-session attack. An attack that will not require the user\nsession such as endpoint malware refers to an out-of-session attack.\n\n## How attackers abuse OAuth apps and how to spot different methods:\n\n**Application login:**\n\nAn attacker can abuse an application by directly accessing it. This can be done in several\nmethods:\n\n\n-----\n\nLogging into the target s existing application from the attacker s device: This method\nrequires the target’s credentials and can be achieved by password spraying or\ncredentials stuffing attacks, phishing and others. The app can be accessed from any\ndevice. However, credentials brute force is likely to be noisy (with many unsuccessful\nlogins) and is not simple to conduct.\nAuthorizing a new application while compromising an account and setting it up for\nexternal use:\n\nThis method requires the attacker to authorize an application with wide and sensitive\npermissions including one that allows external API usage. Most likely, the account owner will\nnot even notice the abused application added to his library. However, this method has a\nslightly higher footprint - an unknown consent to an application can be monitored. Having\nsaid that, in most organizations consenting to an application is not an abnormal event and\nmay go unnoticed.\n\nIn November 2020, we observed an application consent during a compromised session. An\nattacker who managed to compromise an account authorized an application named\n\"Mailbird\". This application is an email client, which allows integration between many\nservices, such as mail service, WhatsApp, Facebook, Dropbox and others. As such, it\nrequires native mail permissions (use IMAP, POP and SMTP on user’s behalf). So, how can\nthis application be abused? As this application allows a \"unified account\", the attackers can\nadd an account created for the sake of the attack to the active mail account used by the\naccount owner. This would allow full control over the attacked account mailbox remotely. As\nthis application is being used by several other users in the tenant, such authorization and\nusage is unlikely to raise flags or create security alerts of any kind. Again, this is not a\nvulnerability or a flaw in the abused application.\n\n**Certificate update (used in the SolarWinds/Solorigate campaign):**\n\nIn the recent SolarWinds attack, X.509 certificates played a crucial role. These certificates\nare used in many Internet protocols to transfer data privately and securely between a server\nand a client. When signed by a trusted certificate authority, this digital certificate verifies that\nyou are who you say you are - the domain, organization, or the individual contained within\nthe certificate. Attackers can steal certificates or create them by compromising signing\nsystems.\n\nThis method was key in maintaining persistence on accounts affected by the attack on\nSolarWinds application update. The attacker was able to generate signed certificates from an\nadmin’s compromised endpoint. After generating the certificate, the attacker added it to the\napplication service principal visible in the applications “certificates and secrets” section in the\nAzure portal.\n\n\n-----\n\nThe attacker chose a previously authorized application, one with highly privileged\npermissions, such as application type mail scopes or even directory roles. Once the attacker\nchose an application and added the certificate, an OAuth2.0 token was generated by\nsending a JSON Web Token (JWT) post request to the authorization server. The list of\nOAuth2.0 authorization and token generation endpoints (as well as SAML and federated\nsign-on endpoints) is available on the application section of Azure Active Directory (Azure\nAD). After the token was granted, the attacker used it to access the resources permitted to\nthe abused application, bypassing the application altogether.\n\nThis type of attack has an exceptionally low footprint. It is rarely detectable, especially since\nsuch an operation can only be tracked in the audit logs for 7 days (in most cases) and is\nconsidered to be a completely legitimate action. Authentications are also logged, however,\nit's likely to be done by the application and the audit logs cannot trace which certificate was\nused to authenticate.\n\nNote that self-signed certificates can also be used to complete such authentication.\n\nAlthough the SolarWinds attack was not a cloud-based attack, it did utilize this method in\norder to maintain persistence and have mail visibility that would not have been available\nwhen using the Sunburst malware alone.\n\n**Client Secret abuse:**\n\nA client secret is an application password. It is used in a way similar to that of application\ncertificates. A client secret is created in the same Azure AD dashboard as certificates.\nSecrets can be used with OAuth2.0 flows other than “Authorization Code Flow” (i.e.\nmobile\\native apps). The secrets are usually 34 bytes long and immutable. The secret can\nbe stored and transferred as plain text. The secret can be copied upon secret creation before\nit is obfuscated. In many cases, this compels the account owner to store the secret as a plain\ntext in a file, mail or note.\n\nWhile an attacker can create a secret and use it in a similar way to a certificate, the actual\noperation of secret addition is logged and can be tracked by security analysts. Using an\nexisting secret will eliminate this.\n\nFirst, the attacker will look for a target application with sensitive permissions and a client\nsecret. Since the “hint” (usually the first 3 characters) for the secret is stored in the\napplication manifest, the attacker will seek a 34 bytes long passphrase starting with the “hint”\nin the files and mails of the compromised user. If found, this will allow the attacker to\ngenerate tokens for the abused application untracked.\n\n**Configuration changes:**\n\n\n-----\n\nOnce an account has been compromised, the attacker has clear visibility to the account\nowner applications list. Every application has its own settings. Many allow several types of\ncollaborations or interfaces with other accounts or applications. The attacker can configure\nan application of choice to interact with an account or an application set on the attacker's\nend. Although changing settings is simple, detecting the change is not straightforward. There\nis a huge list of available applications and internal application activity is not logged.\n\nLet’s take the popular Outlook application as an example. While compromising an account\nand logging in to the Outlook application, an attacker can change settings:\n\nAdd an email delegation with full email access (read, write and send mails, tasks,\ncalendar events, contacts and notes)\nAdd a forwarding rule - a straightforward way of getting notifications on important mails\n(or a full mail replication) to an external account\nAdd a certificate authentication, as described above\n\nOf course, an attacker can do the same using malicious applications.\n\n**Abuse reply \\ redirect URL**\n\nWhen an application is authenticated, the token is shared with a reply URL, which can\ndesignate the application host or the user client. After compromising an account, an attacker\ncan add a reply URL (web\\SSO) to an existing application in the app registration section to\nabuse it. The \"owned applications\" section in Azure AD lists all applications owned by the\ncompromised user. By simply registering a new URL, the attacker can obtain the application\nsecret or token, but only after the account owner logs in to the application. An admin\naccount, if compromised, can edit every application in Azure AD and use them to access\nresources belonging to any user account. This attack method leaves a small footprint – the\napplication will have more than one redirection with a different domain.\n\n**Side by side comparison of OAuth abuse:**\n\n\n**Evasiveness** **Attacker**\n**value**\n\n\n**Persistence** **Implementation** **In \\ Out**\n**of**\n**Session**\n\n\n**Certificate**\n**abuse**\n\n\nMedium High Medium Medium Out\n\n\n**Secret abuse** High High Medium Hard Out\n\n\n**Application**\n**login**\n\n\nMedium High High Easy In\n\n\n-----\n\n**Configuration**\n**changes**\n\n\nMedium Medium High Easy In\n\n\n**Reply URL** Low Medium High Medium Out\n\n## App governance is key to mitigating OAuth abuse\n\nApplication abuse, an attacker using a legitimate application, is not an application\nvulnerability\nOrganizations should actively govern OAuth applications, minimizing the granted\npermissions to applications and managing the user list to reduce risk\nApplications with admin roles and app-delegated permissions pose a greater risk\nbecause when abused, they provide wider access to an attacker\nNever store plain text secrets and code signing keys\nManage roles – an application should have owners who understand the application’s\nresource access mechanism and track its changes. Do not allow every user to sign\ncertificates.\nNote anomalies – odd consent to an uncommon application; addition of secrets,\ncertificates and reply URLs of unfamiliar domains.\n\n## How Proofpoint CASB can help:\n\nProofpoint [Cloud App Security Broker (Proofpoint CASB) detects, assesses and revokes](https://www.proofpoint.com/node/79161)\nOAuth permissions for third-party apps and scripts that access your IT-approved core cloud\nservices. Our in-depth analysis helps identify risky apps, including malicious ones, and\nreduce your attack surface. Based on risk score and context, you can define or automate\nactions. For example, you can manually or automatically revoke OAuth tokens for Microsoft\n365 and Google apps that can pose risk if abused.\n\nProtect users and data with Proofpoint’s people-centric security for cloud apps. Proofpoint\nCloud App Security Broker combines compromised account detection, data loss prevention\n[(DLP), cloud and third-party apps governance with adaptive access controls to help you](https://www.proofpoint.com/us/threat-reference/dlp)\n[secure Microsoft 365, Google Workspace, Box, Salesforce, AWS, Azure, Slack and more.](https://www.proofpoint.com/us/solutions/microsoft-365-security-compliance)\n\nFor more information on OAuth apps and how to govern them, download our\nwhitepaper, [What Every Security Professional Should Know About Third-party OAuth Apps.](https://www.proofpoint.com/node/92901)\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-24 - OAuth Abuse- Think SolarWinds-Solorigate Campaign with Focus on Cloud Applications.pdf"
    ],
    "report_names": [
        "2021-03-24 - OAuth Abuse- Think SolarWinds-Solorigate Campaign with Focus on Cloud Applications.pdf"
    ],
    "threat_actors": [
        {
            "id": "6b88f18e-81b7-46b6-a20d-79e03220447d",
            "created_at": "2024-02-06T02:00:04.101887Z",
            "updated_at": "2025-03-27T02:00:03.316982Z",
            "deleted_at": null,
            "main_name": "TA2552",
            "aliases": [],
            "source_name": "MISPGALAXY:TA2552",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75febd40-3628-491d-be18-366270cb33b1",
            "created_at": "2022-10-25T16:07:24.267099Z",
            "updated_at": "2025-03-27T02:02:10.15549Z",
            "deleted_at": null,
            "main_name": "TA2552",
            "aliases": [],
            "source_name": "ETDA:TA2552",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535533,
    "ts_updated_at": 1743041337,
    "ts_creation_date": 1653691894,
    "ts_modification_date": 1653691894,
    "files": {
        "pdf": "https://archive.orkl.eu/f2caa601b0d759b49eff1959492af9b2f83308a2.pdf",
        "text": "https://archive.orkl.eu/f2caa601b0d759b49eff1959492af9b2f83308a2.txt",
        "img": "https://archive.orkl.eu/f2caa601b0d759b49eff1959492af9b2f83308a2.jpg"
    }
}