{
    "id": "173453c9-0142-4680-9d66-bd3fb0a90c5a",
    "created_at": "2023-01-12T15:02:54.603597Z",
    "updated_at": "2025-03-27T02:05:45.209899Z",
    "deleted_at": null,
    "sha1_hash": "a582414bf5641868c606729035cf22fc14c7ff07",
    "title": "2022-05-23 - Fake Trading Apps",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:44Z",
    "file_modification_date": "2022-06-01T12:23:44Z",
    "file_size": 7150221,
    "plain_text": "# Fake Trading Apps\n\n**silentpush.com/blog/fake-trading-apps**\n\nMay 23\nWritten By [Ken Bagnall](http://10.10.0.46/blog?author=6081bc3c4920d358398731f8)\n\n\nMay 23, 2022\n\n\nThere is a very persistant fake mobile trading apps scam going on currently. This scam has\nbeen building in popularity for some time. It is spreading to a wider global victim base than\nbefore. A lot of money has been stolen from victims all over the world. In just Crypto scams\nthe 2021 figure was over $7billion, however this scam includes more traditional trading\nplaforms as well.\n\nWe will give the full details in this article and information on how to spot these fraudsters.\nThere are a very large number of spoofed trading platforms involved in this scam. It\ninvolves both main stream regulated platforms like the worlds largest financial exchanges\nand reaches all the way down to very new crypto exchanges. The following report is\nprovided by The Silent Push Labs team.\n\n\n-----\n\nThis is a fake trading platform pretending to be the legitimate platform Epoch Financial\n\n## Outline\n\nThe Silent Push Labs team uncovered a threat actor launching several websites, Android\nand iOS applications with counterfeit versions of trading platforms, targeting not only\nregular stock based fintech companies but also cryptocurrency focused ones.\n\nThese meticulously designed fake platforms which mimic well known financial organizations\nsuch as Australian Securities Exchange (ASX), AvaTrade, Bolsas y Mercados Españoles,\n_Coinbase, CoinSmart, eToro, Eurex, itBitTradingView, Nasdaq, Rakuten Wallet, Saxo Bank,_\n_Timex Trading, among others, purposely lure unsuspecting victims into trusting their_\nservices, only to steal their investments.\n\nThis group has scammed and stolen money from countless individuals worldwide.\n\nTherefore, we have conducted a large investigation on this malicious actor, collecting\nhundreds of Indicators of Compromise, as well as reports from victims which allowed us to\nmap their infrastructure and trace a profile on the course of their actions.\n\n\n-----\n\nExample of a spoofed Nasdaq application download page- image 1\n\n## Threat actor profile and history\n\nAlthough, we are unable to pin-point a date when this threat actor began its activity, we\nfound that several active items of this malicious infrastructure were deployed in early 2021.\nAdditionally, we had access to reports which described several occurrences with similar\ncharacteristics to this group around that time period. Given that these victims were\n**located on Asian countries and that we found a small number of websites written in**\n**Asian dialects, we are compelled to claim that this threat actor is located in Asia.**\n\nOn the other hand and after analyzing their current infrastructure, we consider that\n**American and European organizations and users are currently at the most risk.**\n\n\n-----\n\nChinese version of a fake trading platform spoofing a known brand\n\n## Platform design -brandable kit\n\nWhile navigating throughout this malicious infrastructure, an evident visual pattern\nemerged amongst the websites we investigated. Despite having a particular name and logo,\nthe pages unfold in the same style: there is an initial website similar to the one displayed on\n_Image 5, which is used as an initial landing page to attract possible victims. From this_\nwebsite, one can navigate to one of the following two pages:\n\n**-** **the app download page, similar to the one displayed on Image 1;**\n\n**- or the website login page, where users can register and login into an account. We**\nbelieve that this is a web version alternative to the app, which allows the users to transact\nfunds and analyze fake stock indexes as can be seen on Image 3.\n\n_This fits into the Crime-as-a-service model with the fraudulent platform being distributed by_\n_different affiliate providers._\n\n\n-----\n\nExample fake trading app content- image 3\n\n## Victims' reports\n\nWe found many complaints concerning this malicious agent surfacing on the internet.\n[As suspected, the majority of them were written by scammed individuals but also by](https://www.forexpeacearmy.com/community/threads/hifly-scam-https-h5-hifly93750-top.71737/)\npeople who wish to take down this organization.\n\nInitial interactions with the threat actors vary due to a possible affiliate scheme. We have\n[seen varying reports from Romance Scams (hence Sophos referring to this as Cryptorom)](https://news.sophos.com/en-us/2021/10/13/cryptorom-fake-ios-cryptocurrency-apps/)\nto Forum recommendations. Whatever the initial introduction and resulting\n**conversation the victim eventually puts money into the fake account. Unfortunately,**\nonce the victim tries to withdrawal the money, they see themselves logged out of their\naccount and unable to log in, while the threat actors keep their funds and plan the next\ntarget.\n\nWe found similar messages on various websites as well as announcements from some\nfintechs reporting this robbery scheme.\n\n\n-----\n\nMessages concerning one of the distributions of this scam on the Forexpeacearmy website\n\n## Installation process.\n\n**The primary target is mobile devices. The threat actors encourage users to download**\n**a mobile app or use a “Webapp”. There are download links for iOS, and Android.**\n\nAnalyzing the way the application is distributed on iOS **equipment, it appears that the**\nattackers exploit two main ways to get around the Apple approvals process:\n\n1. The first one is done by simply creating a Configuration profile, which is a\n\n`.mobileconfig` **file that can be easily shared.**\n\n2. The second one is through Testflight, a tool created by Apple, that allows developers\n\nto test their applications and provide Beta versions of new apps without facing the\n**severe verification protocols found on Apple Store.**\n\nThis can allow public direct link downloads to up to 10000 accounts.\n\n\n-----\n\nOn the other hand, when it comes to Android users, an `.apk` **file with a tailored name**\nmatching the specific website gets downloaded. If at first glance this file appears to be\nauthentic, a more careful look reveals some obfuscated information using a combination\nof a tool called String Fog, base 64 and a XOR operation to encrypt suspicious data.\nHowever, our team was able to decrypt some of this information, namely a few servers and\nconfig URLs.\n\nThere are some claims online that mention the existence of malware (Trojan) on the\n**apps. Unfortunately, we can not assuredly deny or confirm this information, at the time of**\nthe publication of this blog post.\n\n## Final remarks\n\nTaking everything into account, we are confident that this threat actor will continue to\ndevelop and distribute trading platforms, in order to exploit and steal funds from individuals.\n\nThe methods of delivery will vary as expected with an affiliate program.\n\nWe recommend blocking access to the uderlying app download infrastructure.\n\n\n-----\n\nWith that in mind, we have collected an extensive list of Indicators of Compromise, which\nare available for the Silent Push costumers. Additionally, these users have access to pre**built modifiable queries that allow them to navigate through this operating**\n**infrastructure, as well as access to whois information, server information, curated risk**\n**scores and other innovative functionality.**\n\n\n-----\n\n-----\n\n-----\n\nAnother fake Coinbase site\n\n## IOCs of Fake Trading Apps\n\nThese IOCs are relevant on the day of publication, but for ongoing dynamic lists that stay\nup to date every day please subscribe to our service.\n\n**Subdomains:**\n\n```\nd.appk12036[.]xyz\n\n```\n```\nd.appk56295[.]xyz\n\n```\n```\nd.appkoi65y[.]xyz\n\n```\n```\nd.appl8965[.]xyz\n\n```\n```\nd.appl9035[.]xyz\n\n```\n```\nd.appr6552[.]xyz\n\n```\n```\nd.atfxwqe[.]xyz\n\n```\n```\nd.avatradewqd[.]xyz\n\n```\n```\nd.bbexsbcv[.]xyz\n\n```\n```\nd.bitcudbf[.]xyz\n\n```\n```\nh5.amcoinbhd.buzz\n\n```\n```\nh5.ascifgm[.]top\n\n```\n```\nh5.asxnvds[.]cc\n\n```\n```\nh5.biupsdfe[.]cc\n\n```\n```\nh5.blyg367[.]top\n\n```\n\n-----\n\n```\nh5.bqsbkomh[.]net\n\n```\n```\nh5.bsxkiso[.]cc\n\n```\n```\nh5.cnfalwk[.]top\n\n```\n```\nh5.coinbasekp.buzz\n\n```\n```\nh5.coindealmip[.]cc\n\n```\n```\nh5.dbag-prot[.]com\n\n```\n```\nh5.dbagde[.].cc\n\n```\n```\nh5.dcgbyre[.]shop\n\n```\n```\nh5.dcgtbh[.]com\n\n```\n```\nh5.eurexvky[.]cc\n\n```\n```\nh5.fegeh42415[.]top\n\n```\n```\nwww.hifly01569[.]top\n\n```\n```\nwww.hifly22787[.]top\n\n```\n```\nwww.hifly22878[.]top\n\n```\n```\nwww.hifly27702[.]top\n\n```\n```\nwww.hifly38283[.]top\n\n```\n```\nwww.hifly56982[.]top\n\n```\n```\nwww.hifly76862[.]top\n\n```\n```\nwww.hifly85086[.]top\n\n```\n```\nwww.hiflyk47344[.]top\n\n```\n```\nwww.hiflyk87327[.]top\n\n```\n\n**Android apk file download URLs:**\n\n```\nhxxps://a.digitalsurgeno[.]top/apk/digitalsurge[.]apk\n\n```\n```\nhxxps://a.edgecryptoge[.]top/apk/edgecrypto[.]apk\n\n```\n```\nhxxps://a.etorodes[.]buzz/apk/etoro[.]apk\n\n```\n```\nhxxps://a.exnessge[.]top/apk/exness[.]apk\n\n```\n\n-----\n\n```\nhxxps://a.ftxano[.]top/apk/ftx[.]apk\n\n```\n```\nhxxps://a.jubinok[.]top/apk/jubi[.]apk\n\n```\n```\nhxxps://a.masteryptge[.]top/apk/masterypto[.]apk\n\n```\n```\nhxxps://a.okcoinge[.]top/apk/opkcoin[.]apk\n\n```\n```\nhxxps://a.olymptradeno[.]top/apk/olymptrade[.]apk\n\n```\n```\nhxxps://a.opkcoinno[.]top/apk/opkcoin[.]apk\n\n```\n```\nhxxps://a.parvestano[.]top/apk/parvesta[.]apk\n\n```\n```\nhxxps://a.timexdes[.]buzz/apk/timex[.]apk\n\n```\n```\nhxxps://a.tycoonsege[.]top/apk/tycoonse[.]apk\n\n```\n\n**Apple Configuration profile download URLs:**\n\n```\nhxxps://www.bfefe96b[.]top/files/ios-config/olymptrade[.]mobileconfig\n\n```\n```\nhxxps://www.gniyfe35f[.]xyz/files/ios-config/opkcoinabc[.]mobileconfig\n\n```\n```\nhxxps://www.grgrnt55y[.]top/files/ios-config/parvesta[.]mobileconfig\n\n```\n```\nhxxps://www.hifly69972[.]xyz/files/ios-config/timex[.]mobileconfig\n\n```\n```\nhxxps://www.hiflyf14255[.]top/files/ios-config/tycoonse[.]mobileconfig\n\n```\n```\nhxxps://www.hiflyg41344[.]top/files/ios-config/exness[.]mobileconfig\n\n```\n```\nhxxps://www.hiflyg66779[.]xyz/files/ios-config/etoro123[.]mobileconfig\n\n```\n```\nhxxps://www.hutyfr688[.]top/files/ios-config/okcoin1[.]mobileconfig\n\n```\n```\nhxxps://www.kod89h5[.]top/files/ios-config/ftx[.]mobileconfig\n\n```\n```\nhxxps://www.lkqv215[.]xyz/files/ios-config/masterypto[.]mobileconfig\n\n```\n```\nhxxps://www.niyfe35f[.]xyz/files/ios-config/opkcoinabc[.]mobileconfig\n\n```\n```\nhxxps://www.pade00bg[.]top/files/ios-config/digitalsurge[.]mobileconfig\n\n```\n```\nhxxps://www.pkofe675[.]top/files/ios-config/jubi[.]mobileconfig\n\n```\n```\nhxxps://www.tvao183[.]xyz/files/ios-config/edgecrypto123[.]mobileconfig\n\n```\n\n-----\n\nIf you have been affected by the Counterfeit Trading scams please share the details with us\nso we can keep trying to get them taken down as we find them. Contact us using\n\n[[email protected] or the form below.](http://10.10.0.46/cdn-cgi/l/email-protection)\n\nName *\nMust be a work account\nThank you!\n\n[Ken Bagnall](http://10.10.0.46/blog?author=6081bc3c4920d358398731f8)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-23 - Fake Trading Apps.pdf"
    ],
    "report_names": [
        "2022-05-23 - Fake Trading Apps.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535774,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1654086224,
    "ts_modification_date": 1654086224,
    "files": {
        "pdf": "https://archive.orkl.eu/a582414bf5641868c606729035cf22fc14c7ff07.pdf",
        "text": "https://archive.orkl.eu/a582414bf5641868c606729035cf22fc14c7ff07.txt",
        "img": "https://archive.orkl.eu/a582414bf5641868c606729035cf22fc14c7ff07.jpg"
    }
}