{
    "id": "17470cb4-371b-4e4d-bfad-5079076768a7",
    "created_at": "2022-10-25T16:48:17.074497Z",
    "updated_at": "2025-03-27T02:15:13.837862Z",
    "deleted_at": null,
    "sha1_hash": "4847ac85009d57c2f3b32022f5da496afbe97663",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-03-02T02:18:33Z",
    "file_modification_date": "2022-03-02T02:18:33Z",
    "file_size": 768559,
    "plain_text": "# Water Pamola Attacked Online Shops Via Malicious Orders\n\n**[trendmicro.com/en_us/research/21/d/water-pamola-attacked-online-shops-via-malicious-orders.html](https://www.trendmicro.com/en_us/research/21/d/water-pamola-attacked-online-shops-via-malicious-orders.html)**\n\nApril 28, 2021\n\nAPT & Targeted Attacks\n\nSince 2019, we have been tracking a threat campaign we dubbed as “Water Pamola.” The\ncampaign initially compromised e-commerce online shops in Japan, Australia, and\nEuropean countries via spam emails with malicious attachments.\n\nBy: Jaromir Horejsi, Joseph C Chen\nApril 28, 2021\nRead time: 6 min (1791 words)\n\nSince 2019, we have been tracking a threat campaign we dubbed as “Water Pamola.” The\ncampaign initially compromised e-commerce online shops in Japan, Australia, and\n[European countries via spam emails with malicious attachments.](https://twitter.com/_re_fox/status/1238188943587377155)\n\nHowever, since early 2020, we’ve noticed some changes to Water Pamola’s activity.\nVictims are now mainly located only in Japan. Recent telemetry data indicates that the\nattacks are not being launched via spam anymore. Instead, malicious scripts are being\nexecuted when the administrators look into customer orders in their online shop’s\nadministration panel.\n\nFigure 1. The Water Pamola attack chain\n\n\n-----\n\nAfter further searching, we noticed that an online store administrator asked about a\n[strange online order that contains JavaScript code inserted into the field where the](https://xoops.ec-cube.net/modules/newbb/viewtopic.php?topic_id=25580&forum=11)\ncustomer’s address or company name would normally be located. This script is likely\n[activated by exploiting a cross-site scripting (XSS) vulnerability in the said store’s](https://owasp.org/www-community/attacks/xss/)\nadministration portal.\n\nFigure 2. The question asked on a forum showing the payload related to Water Pamola.\n\n[The above is a screenshot of the text in a forum, which is translated by Google Translate](https://xoops.ec-cube.net/modules/newbb/viewtopic.php?topic_id=25580&forum=11)\nas Problem, there is an order that seems to be a mischievous order. The following\n_characters are included in the address and company name._\n\nThe script connects to the Water Pamola’s server and downloads additional payloads.\nTaken together, this led us to believe that Water Pamola places orders with this\nembedded XSS script across many targeted online shops. If they are vulnerable to this\nXSS attack, these will be loaded when the victim (i.e., an administrator at the targeted\nmerchant) opens the order within their management panel.\n\nWe have collected many attack scripts they delivered to different targets. The malicious\nbehavior performed by the scripts includes page grabbing, credential phishing, web shell\ninfection, and malware delivery.\n\nThis campaign appears to be financially motivated. In at least one instance, a site that\nWater Pamola attacked later disclosed that they had suffered a data breach. Their server\nwas illegally accessed and personal information, which included names, credit card\nnumbers, card expiration dates, and credit card security codes, were potentially leaked.\nThis breach might be associated with Water Pamola, and it hints that this campaign’s\n[overall goal is to steal the credit card data (similar to Magecart campaigns).](https://www.trendmicro.com/en_us/research/19/j/fin6-compromised-e-commerce-platform-via-magecart-to-inject-credit-card-skimmers-into-thousands-of-online-shops.html)\n\n**Analysis of the XSS attack**\n\nAs previously mentioned, Water Pamola sent online shopping orders appended with a\nmalicious XSS script to attack e-commerce administrators.\n\nIt’s worth mentioning that they are not targeting a specific e-commerce framework, but\ne-commerce systems in general. If the store’s e-commerce system is vulnerable to XSS\nattacks, the malicious script will be loaded and executed on the merchant’s management\n\n\n-----\n\npanel once someone (like a system administrator or store employee) opens the said\norder.\n\n[These scripts were managed with an XSS attack framework called “XSS.ME,” which](https://cloud.tencent.com/developer/article/1677625)\nhelps attackers deal with their attack scripts and the stolen information. The source code\nof this framework is shared across many Chinese public forums. The basic attack script\nprovided by the framework could report the victim’s location and browser cookies. We\nobserved that the scripts used during the attacks were customized. The attackers\ndelivered a variety of different XSS scripts, which could include one or more of the\nfollowing behaviors:\n\n**Page Grabber**\n\nThe script sends an HTTP GET request to a specified URL address and forwards the\nreceived response to Water Pamola’s server. This is usually used during an early stage of\nthe attack to grab content from the victim’s management page. Doing so allows the\nthreat actor to understand the environment and design attack scripts appropriate to the\nvictim’s environment.\n\nFigure 3. The script for grabbing page content and sending it back to the attacker\n\n**Credential Phishing**\n\nSome of the delivered scripts revealed that the campaign was trying to obtain\nadministrator credentials for e-commerce websites using two different approaches. The\nfirst way involves appending a fake login form to the page. The script hooks the mouse\nclick event. If the victim enters the credential in the fake form and clicks anywhere on\nthe page, the script will take the credentials, encode them using base64, replace some\ncharacters with custom substrings, and then upload these to Water Pamola’s server.\n\n\n-----\n\nFigure 4. The script to create and delete fake login form for credential phishing\n\nThe other approach involves showing an authorization error message and then\nredirecting the user to a phishing website that asks users to enter their credentials. The\nsubdomains of their phishing sites were configured to match the names of the targets’\ndomain, such as “{victim’s domain}[.]basic-authentication[.]live”.\n\nFigure 5. The script replaces the page content with an authorization error message and redirects\n\nusers to the phishing website\n\n**Webshell/PHP backdoor injection**\n\nSome of the delivered malicious scripts attempt to install backdoors to the websites built\n[with the EC-CUBE framework, which is popular in Japan. The attack we found only](https://www.ec-cube.net/)\nworks on Series 2 of EC-CUBE; the current version is Series 4, with Series 2 now under\nextended support.\n\nThere are three different approaches used to upload the backdoor. The first method is\nuploading a PHP web shell file by calling the native API provided by the framework. The\nname of the web shell file is hardcoded to be either “ec_ver.php,” “log3.php,” or\n“temp.php.” The web shell can execute any PHP code sent by an HTTP POST request to\nthe web shell.\n\nNote the screenshot in Figure 6: The same web shell with the same “only_pcd” keyword\n[is mentioned in this Chinese blog post. The blog post describes a web shell with two](http://achineseboy.com/archives/49)\ncomponents — a PHP script and an HTML uploading file — however, the second one is\nnot needed as the proper POST request can be created with any custom or third-party\ntool (e.g., Fiddler).\n\n\n-----\n\nFigure 6. The script for uploading the PHP web shell to an e-commerce website\n\nThe second method is modifying the page header to inject PHP code, which will then\nexecute any PHP code, sent by the parameter “ec_ver2update” in the HTTP request.\nNote that the PHP code below is obfuscated. First, the $IDFX variable uses XOR\noperation (see character ^) to decode the string “create_function”, then the resulting\nbase64 string is decoded to @eval($_REQUEST['ec_ver2update']); which is the\nbackdoor’s code.\n\nFigure 7. The script for modifying the shop page header to inject a web shell\n\nThe third method is installing a malicious plugin embedded in a file named\n“MakePlugin.tar.gz” to the e-commerce framework. The plugin has been designed to\ndrop multiple PHP web shell files on the server.\n\nFigure 8. The script for uploading and installing the malicious plugin, “MakePlugin.tar.gz”\n\n\n-----\n\nFigure 9. The malicious plugin installs several files with web shells\n\n**Malware Delivery**\n\nIn this case, the attack script will show an alert prompt with a message that reads “Your\nFlash version is too low, please install the latest version and try again!” and then\nredirects the victim to the fake Flash installer download website they control. (Note that\n[Flash has been declared end-of-life by Adobe since December 31, 2020.)](https://www.adobe.com/products/flashplayer/end-of-life.html)\n\nIf the victim downloads and executes the installer downloaded from this page, the victim\nwill be infected with a variant of Gh0stRat malware, previously also named Gh0stCringe\nor CineregRAT. This RAT’s code is based on leaked Gh0st RAT source code; however, its\ntraffic encryption is customized and it added some new features, like QQ number theft.\nThe Gh0st RAT samples related to this campaign are obfuscated executable files, which\ndecrypt the main payload in memory and execute its main export function named\n“Shellex.”\n\nFigure 10. The script showing the error message and redirect to the fake Flash installer\n\n\n-----\n\nFigure 11. The fake Flash installer download website\n\n**Analysis of the fake Flash installer**\n\nAs described earlier, the XSS attack script redirects the victim to a fake Flash download\nsite. Clicking on the “Install now” button downloads a .ZIP archive, which contains\nseveral legitimate files as well as a few malicious ones, which are usually in form of DLL\nlibraries. These libraries will be sideloaded when the legitimate executable gets executed.\n\nIn this example,\nAdobeAirFlashInstaller.exe\n(legitimate file) sideloads xercesc_2_1_0.dll (patched legitimate\nfile), which then sideloads ulibs.dll\n(malicious file). Ulibs.dll loads\n\nFigure 12. The package of downloaded Flash installer\n\nAdob.dll, which is a ZIP archive.\nAfter extracting the content of the\nAdob.dll zip archive, two legitimate and signed executable files are present and executed,\nand a similar sideloading process happens once more.\n\n\nHere, svchost.exe (renamed\nlegitimate and signed\nLauncher.exe file from Tencent)\nsideloads Utility.dll (patched\nlegitimate file). This patched file\ncontains one new section called\n\n\nFigure 13. The package inside Adob.dll\n\n\n-----\n\n.newimp (new import), which adds a new import item with a reference to the oplib.dll\nlibrary. This oplib.dll library is then sideloaded.\n\nFigure 14. Oplib.dll side-loading\n\nThis new import was very likely added manually by using a utility called Stud_PE. This\nutility has a feature called “Import Adder,” while “.newimp” is the default name of a\nnewly added section containing newly added imports. Oplib.dll then loads a lib.DAT file\nfrom the windowsfiles directory, decodes and decrypts its contents (from a hexadecimal\nstring; XOR 0x42), and loads it into the newly created svchost.exe process. In addition,\npersistence via registry keys and Scheduled Tasks are configured.\n\n\nAt the end, the last payload of this infection chain is a\nvariant of a Gh0st RAT. Communication with C&C uses\nsockets and is encrypted with simple SUB 0x46, XOR 0x19\nencryption.\n\n\nFigure 15. XOR routine and\n\nsvchost injection\n\n\nFigure 16. XOR routine that encrypts C&C communication\n\nThis Gh0st RAT variant implements additional\nfeatures for stealing QQ messenger user information,\nfor example, a list of users on a given machine and\ntheir QQ messenger numbers.\n\nThe code below obtains QQ numbers that are\n[currently logged on the machine, mentioned here.](https://www.bilibili.com/read/cv2715942/)\n\nFigure 17. A packetFlag “xy” was\n\nfound inside this Gh0st RAT\n\nvariant\n\n\n-----\n\nFigure 18. The code used to obtain user QQ numbers\n\n**Protecting e-commerce platforms from Water Pamola’s attacks**\n\nWater Pamola attacked online merchants with an XSS script appended onto online\nshopping orders. They also perpetrated social engineering attacks to phish credentials or\nprompt the download of a remote access tool. Online shop administrators should be\naware that potential attacks may come not only from spam but also from different — and\nunexpected — infection vectors. We also recommend that administrators keep the\nversions of any e-commerce platforms in use by their websites up to date to prevent any\npotential vulnerabilities, including XSS attacks.\n\nOrganizations can benefit from having Trend Micro™ endpoint solutions such as Trend\n[Micro Smart Protection Suites and Worry-Free™ Business Security. These can protect](https://www.trendmicro.com/en_us/small-business/worry-free-services-suites.html)\nusers and businesses from threats by detecting malicious files and spammed messages\nas well as blocking all related malicious URLs.\n\n[Indicators of compromise can be found in this appendix.](https://documents.trendmicro.com/assets/Appendix_Water-Pamola-Attacked-Online-Shops-Via-Malicious-Orders.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.04.28.Water_Pamola/Water%20Pamola%20Attacked%20Online%20Shops%20Via%20Malicious%20Orders.pdf"
    ],
    "report_names": [
        "Water Pamola Attacked Online Shops Via Malicious Orders"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041713,
    "ts_creation_date": 1646187513,
    "ts_modification_date": 1646187513,
    "files": {
        "pdf": "https://archive.orkl.eu/4847ac85009d57c2f3b32022f5da496afbe97663.pdf",
        "text": "https://archive.orkl.eu/4847ac85009d57c2f3b32022f5da496afbe97663.txt",
        "img": "https://archive.orkl.eu/4847ac85009d57c2f3b32022f5da496afbe97663.jpg"
    }
}