{
    "id": "176d672e-67a6-4113-b6ad-8688a9a92fea",
    "created_at": "2023-01-12T15:08:48.853807Z",
    "updated_at": "2025-03-27T02:05:34.403847Z",
    "deleted_at": null,
    "sha1_hash": "8dee8dc7710a53a38fe121e92cba73406a8dd4b1",
    "title": "2021-11-10 - Stories from the SOC - Powershell, Proxyshell, Conti TTPs OH MY!",
    "authors": "",
    "file_creation_date": "2022-05-28T01:55:54Z",
    "file_modification_date": "2022-05-28T01:55:54Z",
    "file_size": 285466,
    "plain_text": "# Stories from the SOC - Powershell, Proxyshell, Conti TTPs OH MY!\n\n**[cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-powershell-proxyshell-conti-ttps-oh-my](https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-powershell-proxyshell-conti-ttps-oh-my)**\n\n[1. AT&T Cybersecurity](https://cybersecurity.att.com/)\n[2. Blog](https://cybersecurity.att.com/blogs)\n\n[November 10, 2021 | Josh Gomez](https://cybersecurity.att.com/blogs/author/josh-gomez)\nStories from the SOC is a blog series that describes recent real-world security incident\ninvestigations conducted and reported by the AT&T SOC analyst team for AT&T Managed\nThreat Detection and Response customers.\n\n## Executive summary\n\nIn the second half of 2021 the AT&T Managed Threat Detection and Response (MTDR)\nsecurity operations center (SOC) observed an increasing number of attacks against\nvulnerable Exchange servers. A number of these attacks were attempting to leverage\nproxyshell vulnerability to gain access to customer’s networks. In one particular instance, a\ncoordinated effort between the SOC analysts, Threat Hunters and the Incident Response\nteam from AT&T Cybersecurity Consulting allowed AT&T Cybersecurity to quickly identify\nand mitigate the threat before real damage was done.\n\n\n-----\n\nDue to the various tactics, techniques, and procedures (TTPs) observed, this attack has\nbeen associated with the ransomware-as-a-service (RaaS) group known as Conti. The team\nobserved several tactics associated with Conti affiliates including Proxyshell usage,\nCobaltStrike Payload, and various remote desktop software such as AnyDesk, Atera, and\nSplashtop. If not for the quick response by the MTDR SOC, the next steps would have likely\ninvolved the exfiltration and encryption of critical customer data.\n\n## Investigation\n\n### Initial alarm review\n\n**Indicators of Compromise (IOC)**\n\nInitial alarm came in for remote use of powershell in order to download a file from IP\n“redacted” and drop it under the C: drive. Shortly after this alarm, the SOC analysts and\nThreat Hunters began conducting log analysis on the impacted Exchange server. The\ndropped file “new.dll” had signatures associated with CobaltStrike which is believed to have\nbeen used for lateral movement.\n\n\n-----\n\n### Expanded investigation\n\n**Events Search**\n\nUpon diving into the logs, the team quickly uncovered a number of alarming events. Around\nthe time the remote powershell was executed, we uncovered the attacker dropping a shell on\nto publicly accessible directories on the Exchange server in order to execute arbitrary remote\ncommands. The `New-MailboxExportRequest cmdlet was used to write the shell from`\nimpersonated users account. The log below shows the webshell “rwobn.aspx ” being written\nto an accessible directory. This vulnerability/exploit leveraged CVE-2021-31207.\n\nNext we observed the attacker downloading two additional executables “vmhelp.exe” and\n“fix.exe”. The IP ranges seen in these two outbound request have been seen in CobaltStrike\nbeaconing ranges. Following Conti TTPs, it’s believed these additional executables could\nhave been enumeration or scanning tools used in the coming events uncovered.\n\n### Event deep dive – Lateral movement\n\nWe then observed the attacker performing lateral movement pivoting from the Exchange\nserver on to a domain controller.\n\nPinging to domain controller\n\nRDP login onto domain controller\n\n\n-----\n\nAudit logs were cleared on domain controller\n\nReviewing for Additional Indicators – Remote Tools\n\nThe attacker then made system firewall rule exceptions in order to allow the usage of\nremote tools “Splashtop.exe” and “Anydesk.exe”. It is at this point that MTDR team was able\nto undertake mitigation actions and stop the attack from progressing.\n\n## Response\n\n### Building the Investigation\n\n\n-----\n\nThanks to the quick response of the MTDR team, all impacted assets were quickly identifed\nallowing the customer to quickly isolate them from the network. We also recommended the\ncustomer reset admin credentials, as these privileged accounts were leveraged in some of\nthe TTPs observed.\n\nIn the detection, containment, and eradication phases, the MTDR team leveraged the deep\nvisibility capilities of SentinelOne to further investigate the customers assets and ensure any\nuncovered remnants of the attack were quarantined and removed from the affected systems,\nincluding the executables detailed in this report.\n\nThe MTDR SOC continued close monitoring efforts in search of evidence of back-door\npersistance or potential dormant malware. As seen in the screen shot below, the team was\nable to uncover additional malware, related to Cryptominer, that would have been detrimental\nto the recovery process of the customer.\n\n## Customer interaction:\n\nUpon discovering these events, the customer was contacted immediately and call was\nestablished to communicate our findings to key stakeholders. This investigation\nencompassed many hours and involved the efforts of several team members within MTDR. A\nspecial thanks goes out to Kenneth NG and Amer Amer, MTDR Threat Hunters, whose\nexpertise and knowledge assisted the customer in identifying and remediating the affected\nsystems. Due to the collective effort of the MTDR team, customer was able to stop the attack\nfrom progressing which could have crippled the customers network and business\noperations.\n\n### Share this with others\n\nTags: [stories from the soc](https://cybersecurity.att.com/blogs/tag/stories+from+the+soc)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-10 - Stories from the SOC - Powershell, Proxyshell, Conti TTPs OH MY!.pdf"
    ],
    "report_names": [
        "2021-11-10 - Stories from the SOC - Powershell, Proxyshell, Conti TTPs OH MY!.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536128,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653702954,
    "ts_modification_date": 1653702954,
    "files": {
        "pdf": "https://archive.orkl.eu/8dee8dc7710a53a38fe121e92cba73406a8dd4b1.pdf",
        "text": "https://archive.orkl.eu/8dee8dc7710a53a38fe121e92cba73406a8dd4b1.txt",
        "img": "https://archive.orkl.eu/8dee8dc7710a53a38fe121e92cba73406a8dd4b1.jpg"
    }
}