{
    "id": "17b2b24a-97a8-44f3-8b65-0c67016d2f78",
    "created_at": "2023-01-12T15:09:48.015532Z",
    "updated_at": "2025-03-27T02:05:57.352685Z",
    "deleted_at": null,
    "sha1_hash": "2bb146834e640e395656c22689e12c1cc13d3215",
    "title": "2020-01-30 - Competitions on Russian-language cybercriminal forums- Sharing expertise or threat actor showboating-",
    "authors": "",
    "file_creation_date": "2022-05-28T22:03:06Z",
    "file_modification_date": "2022-05-28T22:03:06Z",
    "file_size": 723990,
    "plain_text": "# Competitions on Russian-language cybercriminal forums: Sharing expertise or threat actor showboating?\n\n**digitalshadows.com/blog-and-research/competitions-on-russian-language-cybercriminal-forums-sharing-expertise-or-**\nthreat-actor-showboating/\n\nJanuary 30, 2020\n\nYou might be feeling the pinch at this time of year… The financial demands of Christmas\nhave taken their toll and that expensive new gym membership is burning a hole in your\nwallet. Winning a competition with a healthy prize fund could be just the cash injection you\nneed to get your finances back on track.\n\nThings are no different in the [cybercriminal underground. The Russian-language](https://www.digitalshadows.com/blog-and-research/how-the-cybercriminal-underground-mirrors-the-real-world/)\ncybercriminal forum XSS recently announced its third forum-wide competition, offering\nmembers the chance to win a share of $15,000 in return for writing an article on a set list of\ntopics. In fact, competitions have been a feature of the Russian-language cybercriminal\nscene practically since the advent of cybercriminal forums (for more on the dynamics of\n[cybercriminal forums, check out our recent report, The Modern Cybercriminal Forum).](https://resources.digitalshadows.com/whitepapers-and-reports/the-modern-cybercriminal-forum)\n\n## The History of Cybercriminal Forum Competition: Humble beginnings\n\nTracing the history of the forum competition back to the early days of one prominent\nRussian-language cybercriminal forum, Exploit, reveals that the format, value, and scope of\nforum competitions have changed considerably since Exploit’s launch in 2005.\n\n\n-----\n\nEarly competitions seem almost innocent in nature compared with the serious events that\nforums organize nowadays. These first competitions often aimed to foster a sense of\ncommunity on the forum. In February 2007, for example, Exploit members were invited to\nparticipate in a quiz featuring questions about the history of the forum. Questions included\n“What was the forum’s first domain?”\n\n_February 2007 competition to celebrate Exploit’s birthday_\n\nToday’s competitions usually require demonstrable skill and technical knowledge, with\nparticipants often required to submit original articles containing videos or source code. In\ncontrast, back in January 2008 Exploit ran a competition in which the user with the longest\ntenure on the forum to post in a specific thread would win $25. In October 2007 members\nwere offered the chance to guess how many registered members the forum had on a specific\ndate.\n\n\n-----\n\nThese early competitions also prized creativity. In December 2010 Exploit users were invited\nto design a graphic that best represented the Russian-language segment of the Internet (the\n“Runet”) to win an iPad, while a competition in November 2008 sought the best original\ndesktop wallpaper. In March 2012 a competition offered a monetary prize to the user who\nsubmitted the best hand-drawn depiction of what Exploit represented.\n\n_Call for members to design a pictorial representation of Exploit_\n\nThese early competitions are notable for their lack of specific aim and for their small scale.\nEarly competitions appear to have been intended to inject a sense of fun and togetherness\ninto Exploit at a time when the site was trying to build a community and attract new\nmembers. In terms of scale, while competitions now offer multi-thousand-dollar prize funds,\nthese early examples show that competition winners back in the mid-2000s could expect to\nreceive a much more modest sum. This situation is replicated on other high-profile Russianlanguage cybercriminal forums such as XSS.\n\n\n-----\n\n## The Evolution of Forum Competitions: First signs of change\n\nThe first mention of a forum competition as we now know it appeared on Exploit in October\n2013. One user lamented the slipping standard of coding on the forum and suggested a\ncompetition to raise the collective skill level on the site. The user proposed that each\ncompetition participant should contribute $10 to a shared pot, with the eventual winner taking\nthe entire pool. However, other forum members were far from enthusiastic about the idea,\nwith some users pointing out that attempts to organize such contests on other cybercriminal\nforums had failed. The competition went ahead regardless, but the winners were never\npublicly announced.\n\nOne major difference between the early competitions and those of today—and something\nthat seems to have been a contributing factor in the eventual success of the competition\nmodel—is the involvement of the forum administration team. While early competitions were\norganized by individual members, the competition model really took off when the forum\nadministration teams got involved. In December 2015 the Exploit administrator organized a\ncompetition to find who could write the best article on “Using SI and NLP tools to install\nsoftware on a user’s computer”. The victor would win $1,000, with $200 consolation prizes\nfor second and third place. After that, the annual winter competition was born. Exploit’s\nDecember 2016 competition included a list of set topics on which users could pen an article,\nincluding “malware”, “phreaking” and “hacking”, in return for a $2,000 prize fund. Fastforward to 2019 and the competition prize fund stood at $10,000, with rules stipulating a\nword count and content requirements.\n\n\n-----\n\n_Announcement of 2019 competition on Exploit_\n\n## Forum Competitions Seen Across the Board\n\nThe competition development arc is similar on other Russian-language cybercriminal\nplatforms, such as XSS. Since its relaunch as XSS, the former Damagelabs has organized\nthree articles competitions, all with four- or five-figure prize funds. However, the phenomenon\nis not universal across the scene. The carding forum Verified, for example, last held an\narticles competition back in February 2010. In 2016 the Verified administrator organized a\ncontest to design new forum buttons (although prizes consisted of VPN service accounts,\nrather than monetary payment). The Russian-language hacking forum Korovka has not\norganized an articles competition since 2012, while the carding forum Omerta has only seen\na couple of small-scale competitions on the site, neither of which were organized by the\nadministrator.\n\n\n-----\n\n_Competition to design forum buttons on Verified_\n\nInterestingly, what connects these forums without a strong tradition of competitions is their\ncommon lack of a strong sense of community. Users on successful forums such as Exploit\nand XSS strongly identify as members of those sites and see the value in participating not\nonly for their own benefit but also for the good of the forum. After all, helping the\ndevelopment of the forum is one of the major drivers behind organizing competitions:\nCybercriminal forums need to attract and retain members in order to survive, and being able\nto present a site as a valuable repository of articles discussing pertinent cybercriminal issues\nis a real draw. Articles competitions raise the level of collective expertise on the forum, thus\nincreasing the site’s objective “value” as a hacking resource. Articles competitions may also\nencourage trading in the subjects discussed in the pieces, which in turn benefits the site via\nearned commission. Finally, fostering a sense of community is an important part of\ncompetitions that should not be overlooked: Forums with the strongest feelings of\ntogetherness tend to be the most disciplined, which in turn leads to a better user experience\nfor all involved.\n\n## Cybercriminal Forum Competitions: Latest developments\n\nThe latest development in forum competition organization may actually be a return to form.\nWay back in October 2005 the Exploit administrator initiated a thread calling for competition\nsponsors (i.e. users willing to put up the winners’ prize), indicating that sponsoring a\ncompetition would be a huge boost to a user’s reputation within the cybercriminal community.\nIn fact, while the most successful competitions nowadays are generally organized by the\n\n\n-----\n\nforum administrators, in the early days of forum competitions, regular forum members would\noften organize small-scale competitions for personal gain. Forum users who needed a new\navatar, for example, could hold a competition to get other forum members to design one in\nreturn for a small financial prize or a six-digit ICQ number (a prized commodity in the early\ndays of the Russian-language cybercriminal underground). The arrangement was win-win: A\nskilled graphics designer could knock up an avatar with little personal effort and win a small\nprize in the process and the competition organizer would get the new profile picture that they\nlacked the skills to design themselves, along with a sense of increased standing in the forum\ncommunity for having organized a mass event.\n\nFollowing years of administrator-funded competitions, Russian-speaking cybercriminals now\nseem to be remembering the benefits of not-so-benevolently offering a competition prize\nfund. In December 2019 the XSS administrator announced a third annual forum articles\ncompetition. Accepted topics for original articles included (translated from Russian):\n\n_“Searching for 0day and 1day vulnerabilities. Developing exploits for them_\n_APT attacks. Hacking LAN, elevating rights, hijacking domain controller, attack_\n_development_\n_Interesting combinations, algorithms. Writing your own crypto algorithms and hacking_\n_other people’s_\n_Innovative functionality, reviews, analysis of interesting algorithms that are used,_\n_development prospects_\n_Forensics. Digital forensics. Software, tricks, methods”_\n\n\n-----\n\n_Announcement of third annual articles competition on XSS_\n\nThe competition winner would win $5,000, with prizes decreasing by $1,000 each time for\nsecond through fifth place, totaling an overall prize fund of $15,000. At the end of the\ncompetition announcement, the administrator revealed that the competition had been\nsponsored and funded by the Sodinokibi (aka REvil) ransomware team, which has\nrepresentatives on the forum. The most “suitable” competition finalist would also win the\nopportunity to “work with” the Sodinokibi team under “mutually beneficial conditions”. The\nforum community’s reaction to the competition announcement has been mixed. Some opined\nthat the competition would help to raise the level of collective expertise on the forum.\nHowever, many users pointed out that the choice of topics was likely influenced by the forum\nsponsor. In late January 2020, the XSS admin posted that the competition had not received\nmany entries. It is unclear whether this is due to the competition’s proximity to the previous\ncontest (December 2019 and then January 2020) or forum members’ reluctance to take part\nin this sponsored event.\n\n\n-----\n\nIn theory, by sponsoring a competition in which forum users pen articles on topics related to\nransomware, the Sodinokibi team can increase awareness of ransomware on the forum\n(thus potentially increasing their sales) and perhaps gain valuable intelligence they could use\nin their future malware development. If competition entries do increase for this event, it may\nbe that in the coming months more cybercriminals will come to realize the advantageous\ncost-benefit calculation associated with organizing a forum competition and that similar\ncompetitions will become more frequent. It appears that, after a slow start, the forum\ncompetition in some form or another is here to stay.\n\nWant to gain visibility into criminal and fraudulent activity impacting your brand on the deep\n[and dark web? Learn how we help businesses with dark web monitoring.](https://www.digitalshadows.com/dark-web-monitoring/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-30 - Competitions on Russian-language cybercriminal forums- Sharing expertise or threat actor showboating-.pdf"
    ],
    "report_names": [
        "2020-01-30 - Competitions on Russian-language cybercriminal forums- Sharing expertise or threat actor showboating-.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536188,
    "ts_updated_at": 1743041157,
    "ts_creation_date": 1653775386,
    "ts_modification_date": 1653775386,
    "files": {
        "pdf": "https://archive.orkl.eu/2bb146834e640e395656c22689e12c1cc13d3215.pdf",
        "text": "https://archive.orkl.eu/2bb146834e640e395656c22689e12c1cc13d3215.txt",
        "img": "https://archive.orkl.eu/2bb146834e640e395656c22689e12c1cc13d3215.jpg"
    }
}