{
    "id": "17db80c0-9209-4b65-a251-abdcc07102d5",
    "created_at": "2023-01-12T15:06:29.290207Z",
    "updated_at": "2025-03-27T02:08:40.485893Z",
    "deleted_at": null,
    "sha1_hash": "f6b558f7e042c91b0484a3ed81f5951b64281c69",
    "title": "2021-10-26 - Protect your business from password sprays with Microsoft DART recommendations",
    "authors": "",
    "file_creation_date": "2022-05-27T23:12:34Z",
    "file_modification_date": "2022-05-27T23:12:34Z",
    "file_size": 746254,
    "plain_text": "# Protect your business from password sprays with Microsoft DART recommendations\n\n**microsoft.com/security/blog/2021/10/26/protect-your-business-from-password-sprays-with-microsoft-dart-**\nrecommendations/\n\nOctober 26, 2021\n\nOver the past year, the Microsoft Detection and Response Team (DART), along with\n[Microsoft’s threat intelligence teams, have observed an uptick in the use of password sprays](https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray)\nas an attack vector. This threat is a moving target with techniques and tools always\nchanging, and Microsoft continues to find new ways to detect these types of attacks and help\nprotect its customers.\n\nIn this blog, we are going to define what password sprays are, detail DART’s investigation\ntechniques and approach to responding to password spray attacks, and outline our\nrecommendations for protecting against them.\n\n## Why are identity-based attacks suddenly so popular?\n\n\n-----\n\nPreviously, threat actors focused on attacking computers to gain access into an environment.\nAs software becomes more intelligent at detecting abnormal programs and vulnerabilities,\nattacks against our customers are rapidly becoming more focused on breaking into identities\nrather than breaking into a network.\n\nThe approach to securing user accounts is well-intentioned, but it is often incomplete, with a\nlarge investment that typically goes into areas such as complex password policies and\nlimiting access to resources from networks perceived as secure. While these mitigations are\nnecessary best practices, in the case of a compromised trusted user, they are ineffective at\npreventing unauthorized access.\n\nThis is why identity attacks have become so popular. Once attackers have gained the\ncredentials to an account, they can access any sensitive resources that users can access\nand have the malicious activity appear as normal. This creates a repeating cycle attack\npattern, where one compromised account can lead to access to resources where additional\ncredentials can be harvested, and thus even further resource access.\n\n_Figure 1. Identity-based attack lifecycle._\n\n## The anatomy of a password spray attack\n\n\n-----\n\nTo understand how to protect against, and investigate a password spray attack, it is\nimportant to understand what it is. Password spray attacks are authentication attacks that\nemploy a large list of usernames and pair them with common passwords in an attempt to\n“guess” the correct combination for as many users as possible. These are different from\nbrute-force attacks, which involve attackers using a custom dictionary or wordlist and\nattempting to attack a small number of user accounts.\n\nSophisticated password spray techniques include some of the following qualities:\n\n### Password spray methods:\n\n**Low and slow: Patience is key for a determined threat actor. The most sophisticated**\npassword sprays will use several individual IP addresses to attack multiple accounts at\nthe same time with a limited number of curated password guesses.\n**Availability and reuse: With a new breach being announced publicly every month, the**\namount of compromised credentials posted on the dark web is rising rapidly. Attackers\ncan utilize this tactic, also called “credential stuffing,” to easily gain entry because it\nrelies on people reusing passwords and usernames across sites.\n\n### Password spray identifiers:\n\n**User agents: This is not an immutable variable and is simple to spoof, so don’t always**\nrely on the user agent string to tell the truth. That said, some example user agents\noften seen during a password spray are:\n\nBAV2ROPC / CBAinPROD / CBAinTAR: These user agent strings represent a\nconnection from a client that uses legacy authentication, a popular tool for a\npassword spray attack.\nFirefox/Chrome: More sophisticated password sprays using REST APIs often use\nheadless browsers [a browser that doesn’t have a graphical user interface (GUI)]\nto target the API endpoints.\nPython requests package: This is an automation library that can be used to\ngenerate requests to a website without user interaction.\n**Targets: Password sprays have often targeted applications that are unsecured and**\nuse legacy authentication protocols. This is due to the fact that these protocols don’t\n[offer a rich audit trail and are not able to enforce a multifactor authentication (MFA)](https://www.microsoft.com/en-us/security/business/identity-access-management/mfa-multi-factor-authentication#:~:text=Multifactor%20authentication%20(MFA)%20adds%20a,a%20code%20received%20by%20phone.)\nrequirement. More recently, things have changed somewhat, and we are seeing\nattackers switch to targeting applications that utilize the REST API, often considered to\nbe more secure. Some commonly targeted applications are:\n\nExchange ActiveSync\nIMAP, POP3, SMTP Auth\nExchange Autodiscover\n\nMicrosoft has [implemented new and improved password spray detections over the last year](https://techcommunity.microsoft.com/t5/azure-active-directory-identity/advancing-password-spray-attack-detection/ba-p/1276936)\nto help continue to address password spray attacks.\n\n\n-----\n\n## Help! I ve been sprayed!\n\nDART is no stranger to password spray attacks. When it comes to investigating cybersecurity\nincidents, our team’s primary goal is to establish the facts and see where they lead us. Here\nare some of the questions our team typically considers at the start of each password spray\nattack incident:\n\n**“Was the password spray successful?” This is perhaps the most important question**\nto ask because it determines whether there is potential unauthorized access present in\nthe environment. If it was determined to be successful, the investigator can continue\ndown the list to gain additional information to understand how to proceed.\n**“Which users are affected?” Enumerating the users that were victims of the**\npassword spray attack can change the direction of our investigation. For example, if the\nlist of users affected is particularly targeted (maybe just in one department or all the\nstaff members of a particular project), we can assume our threat actor knows what they\nare looking for and has done their research. This helps us adapt an action plan based\non the permissions and access rights that a particular user has. We call this “scoping”\nthe incident—in other words, understanding what machines and resources the\nattackers accessed, and determining the number of compromised users. This\nknowledge helps us with remediation and preventing attackers from entering the\nenvironment again in the future.\n**“Were administrative accounts compromised?” If administrative control over a**\ntenant is lost, the situation changes. A compromised tenant is a very different situation\nfrom a compromised user and has the potential to be much more damaging, so this is\nan important distinction for us to make.\n**“What indicators do we have?” Information such as the time the spray was**\nconducted, targeted user agent and endpoint, IP addresses, and other identifying\ninformation can help us understand if this was carried out by an opportunistic attacker\nor determined human adversary. There is also the possibility that we can use our threat\nintelligence to identify some potential next steps our adversary may have taken and the\noverall scope of compromise.\n\nOur [password spray investigations playbook contains in-depth guidance around investigating](https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray)\npassword spray attacks and offers information about Microsoft Active Directory Federation\nServices (ADFS), Microsoft’s solution for single sign-on (SSO), and web-based\nauthentication.\n\n## Am I a target?\n\nIt’s important to understand the targets of the password spray to correctly determine the\nscope of the potential compromise. Recently, DART has seen an uptick in cloud\nadministrator accounts being targeted in password spray attacks, so understanding the\n\n\n-----\n\ntargets is a good place to start. Enumerate the users with the below permissions as the initial\nlist to investigate, and then add users to it as the analysis proceeds:\n\nSecurity administrator\nExchange service administrator\nGlobal administrator\nConditional Access administrator\nSharePoint administrator\nHelpdesk administrator\nBilling administrator\nUser administrator\nAuthentication administrator\nCompany administrator\n\nIn addition to privileged accounts such as these, identities with a high profile (such as C-level\nexecutives), or identities with access to sensitive data are also popular targets. It is easy to\nmake exceptions to policy for staff who are in executive positions, but in reality, these are the\nmost targeted accounts. Be sure to apply protection in a democratic way to avoid creating\nweak spots in configuration.\n\n## How can I check for suspicious activity?\n\nTo perform a thorough cloud investigation, exportation of logs and installation of PowerShell\nmodules is inevitable and discussed in detail in our password spray investigation playbook,\nbut there are other methods to gain insights quickly.\n\n### Microsoft Cloud App Security\n\nThe [Microsoft Cloud App Security portal is a great first place to check for suspicious activity.](https://signup.microsoft.com/get-started/signup?OfferId=757c4c34-d589-46e4-9579-120bba5c92ed&ali=1&culture=en-us&country=US&products=757c4c34-d589-46e4-9579-120bba5c92ed)\nIf you have Cloud App Security enabled, follow these steps to check for suspicious activity.\n\n1. Go to the [Cloud App Security portal and sign in with the Security Administrator](https://signup.microsoft.com/get-started/signup?OfferId=757c4c34-d589-46e4-9579-120bba5c92ed&ali=1&culture=en-us&country=US&products=757c4c34-d589-46e4-9579-120bba5c92ed)\n\ncredentials.\n2. Go to Alerts.\n3. Filter for the users that you enumerated in the first step, check for any alerts associated\n\nwith these users.\n\n\n-----\n\n_Figure 2. Sample alerts in Cloud App Security related to possible password spray attacks._\n\nHere are some alerts that could be associated with a password spray incident:\n\nActivity from anonymous IP address.\nActivity from infrequent country.\nActivity from suspicious IP address.\nImpossible travel.\n\n[We describe additional Cloud App Security alerts in our documentation.](https://docs.microsoft.com/en-us/cloud-app-security/investigate-anomaly-alerts)\n\n### User investigation priority\n\nFor the accounts of interest, check the Cloud App Security investigation priority by navigating\nto the account under Users and accounts. The investigation priority score is based on\nsecurity alerts, abnormal activities, and potential business and asset impact related to each\nuser to help you assess how urgent it is to investigate each specific user.\n\n1. Go to the [Cloud App Security portal.](http://portal.cloudappsecurity.com/)\n2. Go to Investigate then Users and accounts.\n3. Check the investigation priority for all users of interest and, if needed, view related\n\nactivity.\n\n\n-----\n\n_Figure 3. The user page in Cloud App Security shows the investigation priority._\n\n### Azure Active Directory\n\n[Microsoft Azure Active Directory (Azure AD) incorporates behavioral analysis algorithms into](https://azure.microsoft.com/en-us/services/active-directory/#overview)\nits detection logic natively, so there is a chance that an alert already exists about a password\nspray attack. Below are several places to check within the portals before going through the\nhassle of log exporting. Use the indicators of compromise (IOCs) from these alerts to further\npivot such as user, IP address, time range, and more.\n\n### Identity Protection\n\n[Identity Protection is a tool in Azure AD designed to identify potential risky behavior](https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/overview-identity-protection)\nsurrounding authentication events. Users with an Azure AD Premium P2 license may follow\nthese steps to check for suspicious activity:\n\n1. Go to the [Microsoft Azure portal.](http://portal.azure.com/)\n2. Use the search bar to locate Azure AD.\n3. Select Security from the left blade.\n4. Review the reports under Risky sign-ins and Risky users for any of the users that\n\nyou enumerated from the list.\n\n\n-----\n\n_Figure 4. Azure AD can display a list of risky sign-ins to identify potential risky behavior._\n\n### Revoke user access\n\nIf an identity is considered compromised, action should be taken immediately to ensure that\naccess is revoked. This should include disabling the user’s device(s), a password reset,\naccount disablement, and token revocation in Azure AD.\n\n## Recommendations for protecting against password sprays\n\nPassword sprays are worrisome but when we look at the statistics according to the Digital\nShadows report “From Exposure to Takeover,” there are over five billion unique credential\npairs available for sale worldwide, with new caches of credentials being exposed on a\nregular basis. This kind of volume tells us that we should assume that a breach will occur1\nand consider that a compromised username or password in any given organization is\ninevitable.\n\n\n-----\n\nThis doesn t mean we should give up on passwords altogether, but the rabbit hole of\npassword policies, and the potentially endless discussions about complexity, length, and\n“correct battery horse staple” (Don’t know what we are talking about? Look it up!) should be\n[avoided in favor of applying Zero Trust logic to identity and authentication. This includes](https://www.microsoft.com/en-us/security/business/zero-trust)\nareas like:\n\n**MFA and legacy authentication: You have probably heard this recommendation**\nbefore: disabling legacy authentication and enabling MFA for all users is a critical step\nin [securing your identity infrastructure and should be a priority if it has not already been](https://docs.microsoft.com/en-us/azure/security/fundamentals/steps-secure-identity)\ndone.\n**Rethinking the password policy: The future is a world without passwords because it**\nis too common that people reuse them between applications or create easily\n[discoverable passwords. Passwordless authentication methods such as the Microsoft](https://www.microsoft.com/en-us/security/business/identity-access-management/passwordless-authentication)\nAuthenticator App, [Windows Hello for Business, and](https://docs.microsoft.com/en-us/windows/security/identity-protection/hello-for-business/hello-overview) [Fast Identity Online (FIDO) keys](https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-authentication-passwordless#fido2-security-key-providers)\nhelp improve both the user experience and security level of an authentication event. If\na password must be used, ensure that the password policy does not allow key phrases\nrelated to the organization or commonly used passwords. Having a password policy of\neight characters with an uppercase, lowercase, number, and symbol, is no longer\nsecure with today’s graphics processing unit (GPU) capabilities. Attackers can crack a\npassword with these elements in a matter of hours. 20-character small sentences may\nbe easy for users to remember and are more secure than a complex 8-character\npassword!\n**MFA registration: The most effective way to protect against a password spray leading**\nto a successful authentication is by using MFA. However, if the user is enabled for\nMFA, but never completes the registration process, they are left unprotected. Even\nworse, if a threat actor signs in and is prompted for MFA, they can register their own\nMFA details. This is an excellent cover for a threat actor because the authentication\nevent is much less suspicious when MFA is satisfied. DART doesn’t recommend using\nlocation-based MFA policies (like only applying MFA when outside the corporate\nnetwork) as this leaves room for this kind of loophole. Additionally, DART recommends\n[that customers configure an MFA registration policy if possible to ensure that all](https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/howto-identity-protection-configure-mfa-policy)\nenabled users register for MFA.\n**Mailbox auditing: Use** [this script to ensure that the recommended mailbox auditing](https://github.com/o365soa/Scripts/blob/master/Configure-MailboxAuditLogging.ps1)\nactions are configured on every mailbox in the organization. This ensures that postexploitation auditing is as robust as possible, allowing for a more effective investigation.\n**Administrative accounts: These are the keys to the kingdom and should have an**\n[extra level of protection. Ensure that administrative accounts are cloud-only and are not](https://docs.microsoft.com/en-us/azure/active-directory/roles/best-practices)\nsynchronized from Activity Directory. MFA should always be applied, and emergency\naccess accounts should be created also.\n\n\n-----\n\n**Policy gaps: Ensuring that weaknesses do not exist in your identity policies and**\nprocesses is critical. All too often, DART finds that small misconfigurations can lead to\nan entry point for a threat actor. Let’s explore this idea further:\n\n**Conditional Access policies: These policies are a great way to apply access**\ncontrol logic to complex environments, helping customers walk the tightrope\nbetween protecting the organization and allowing staff to get on with their jobs.\nWith complexity comes risk, and as previously mentioned, misconfigurations are\nall too common. Some pitfalls to watch out for:\n\n**Cloud Apps: Let’s look at a real-world example. A DART customer**\nexperienced a cloud identity breach and had in place an MFA policy for\nadministrative accounts, applied to the Office 365 cloud app. However, the\nthreat actor used the Azure Service Management API to connect to the\nenvironment. This cloud app was outside of the scope of the MFA\nConditional Access policy, giving the threat actor access to the environment\nwithout requiring MFA. Make sure to have in place a Conditional Access\npolicy that covers all cloud apps and applies MFA to give you a base level\nof protection.\n\n_Figure 5. Conditional Access policy in Azure AD._\n\n\n-----\n\n**Policy exceptions: During day-to-day operations, changes are often made**\nto a product configuration to facilitate business functions. One typical\nexample of this kind of change is an account being removed or exempted\nfrom a security policy. This is something to be careful of—policy exceptions\noften begin as a temporary change but end up being permanent for one\nreason or another. It is also not uncommon for DART to observe exceptions\nfor sensitive or high-profile accounts; the very type of account that makes\nan ideal target for cybercriminals. Use processes and technical solutions to\nensure those policy exceptions are temporary and tracked. If they must\nremain, put in place some mitigating controls to reduce the attack surface of\nthat particular account.\n\n## Assume breach\n\n[Password spray attacks are the perfect combination of low effort and high value for](https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray)\nattackers, and even the most secure companies are likely to fall victim to them. However,\npreventing catastrophic damage is not a hopeless endeavor. By assessing both sides of the\nsituation, the protection against the attack as well as the capabilities to investigate and\nremediate an attack, you can ensure a substantial amount of coverage against password\nspray destruction.\n\nDART utilizes these strategies for everyday investigations. We encourage our customers to\n[adopt passwordless technology and](https://www.microsoft.com/en-us/security/business/identity-access-management/passwordless-authentication) [enable MFA, regardless of the provider. While attackers](https://www.microsoft.com/en-us/security/business/identity-access-management/mfa-multi-factor-authentication/)\nare most likely continuously exploring new ways to break into an environment, by assuming\nbreach, we can help to safeguard against inevitable detrimental harm.\n\n## Learn more\n\n[Want to learn more about DART? Read our past blog posts.](https://www.microsoft.com/security/blog/microsoft-detection-and-response-team-dart-blog-series/)\n\n[To learn more about Microsoft Security solutions, visit our website. Bookmark the](https://www.microsoft.com/en-us/security/business/solutions) Security\nblog to keep up with our expert coverage on security matters. Also, follow us\nat [@MSFTSecurity for the latest news and updates on cybersecurity.](https://twitter.com/@MSFTSecurity)\n\n[1From Exposure to Takeover: The 15 billion stolen credentials allowing account takeover,](https://resources.digitalshadows.com/whitepapers-and-reports/from-exposure-to-takeover)\n\nDigital Shadows Photon Research Team, Digital Shadows.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-26 - Protect your business from password sprays with Microsoft DART recommendations.pdf"
    ],
    "report_names": [
        "2021-10-26 - Protect your business from password sprays with Microsoft DART recommendations.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535989,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653693154,
    "ts_modification_date": 1653693154,
    "files": {
        "pdf": "https://archive.orkl.eu/f6b558f7e042c91b0484a3ed81f5951b64281c69.pdf",
        "text": "https://archive.orkl.eu/f6b558f7e042c91b0484a3ed81f5951b64281c69.txt",
        "img": "https://archive.orkl.eu/f6b558f7e042c91b0484a3ed81f5951b64281c69.jpg"
    }
}