{
    "id": "17edf90a-b29e-4685-9b1c-158ac8adb6b2",
    "created_at": "2023-01-12T15:03:47.300717Z",
    "updated_at": "2025-03-27T02:16:20.875277Z",
    "deleted_at": null,
    "sha1_hash": "ba6f4c4cee0fd301cd3d5e0c516bc88b2f3d4f20",
    "title": "2019-06-11 - The InterPlanetary Storm- New Malware in Wild Using InterPlanetary File System’s (IPFS) p2p network",
    "authors": "",
    "file_creation_date": "2022-05-28T18:07:09Z",
    "file_modification_date": "2022-05-28T18:07:09Z",
    "file_size": 730199,
    "plain_text": "# The InterPlanetary Storm: New Malware in Wild Using InterPlanetary File System’s (IPFS) p2p network\n\n**[anomali.com/blog/the-interplanetary-storm-new-malware-in-wild-using-interplanetary-file-systems-ipfs-p2p-network](https://www.anomali.com/blog/the-interplanetary-storm-new-malware-in-wild-using-interplanetary-file-systems-ipfs-p2p-network)**\n\nResearch | June 11, 2019\n\nby Anomali Threat Research\n\n\n-----\n\n## Summary\n\nIn May 2019, a new malware was found in the wild that uses a peer-to-peer (p2p) network\non top of InterPlanetary File System’s (IPFS) p2p network. The malware found in the wild\ntargets Windows machines and allows the threat actor to execute any arbitrary PowerShell\ncode on the infected machines. The use of a legitimate p2p network can make it difficult to\ndiscover the malicious traffic as it potentially is blended in with legitimate traffic to the\nlegitimate p2p network. It can also make it harder to sinkhole the botnet since there is a risk\nthe legitimate p2p network is also taken down with it.\n\n## Introduction\n\nWhen a threat actor wants to commandeer a machine, a Command and Control (C2)\ncommunication channel needs to be established. With this communication channel, the\nthreat actor can send commands to the infected machines and the response can be sent\nback from the infected machines to the actor. In general, there are two types of schemes\nthat can be used. The first type is a p2p model, and the second type is a server-client\nmodel.\n\n## Server-Client Model\n\nIn a server-client model, the infected machines connect to a set of C2 servers that provides\nthe infected machines with instructions and handles the responses sent back. A threat actor\nmay use these C2 servers directly to control the infected machines by having the\nadministrator panel hosted on these servers. Another option is that the threat actor uses a\n\n\n-----\n\nsecond layer of C2 servers. These servers never talk directly to the infected machines.\nInstead, the commands are sent from the second layer to the first, which relays the\ncommands and the responses between infected machines and the second row of C2\nservers, acting more like a proxy. This has the potential of protecting the second layer from\nbeing detected and possibly taken over by the authorities. Using two layers of C2 servers\nmay also increase stealth. The threat actor can, for example, use a non-malicious website\nto proxy or relay the communication.\n\nIn recent years, threat actors have started using legitimate web services for C2\ncommunications. For example, Twitter, Github, and Instagram are legitimate services that\nhave been misused by threat actors.[1] The use of legitimate services have multiple\nadvantages to the threat actor. By default, all of these services are using encrypted\ncommunication via TLS. This means the threat actors do not need to configure and\nmaintain certificates because it is all done for them. Another benefit is that these services\nare common on home and corporate networks. The malware talks to the same servers as\nnormal web browsers visiting the websites, essentially allowing the malicious traffic to blend\nin with the legitimate communications. While this method allows malware traffic to hide\nbetter, it is easier for authorities to take down. One way of making takedowns harder is to\nuse a p2p model instead of a server-client model.\n\n## P2P Model\n\nIn a p2p model, the infected machines are not necessarily communicating directly with\nservers controlled by the threat actor. Instead, the machines are connected directly to each\nother via a p2p network, commonly called a p2p botnet. All the threat actor has to do is\nsend a single command to one infected machine and that command will automatically\npropagate to all other infected machines. A p2p model is generally more difficult for a threat\nactor to implement because there are different problems that need to be solved than when\nusing the server-client model. The first problem is bootstrapping. How does the newly\ninfected machine find other infected machines to connect to? One method is to include a list\nof known peers in the malware that it can connect to. On the defender side, a known\nbootstrapping list can be used for both detection and prevention; blocking access to the\nmachines on the list at the perimeter. The other problem the threat actor needs to solve is\nNetwork Address Translation (NAT) traversal for machines not directly connected to the\ninternet.[2] A p2p network works by having the peers connected to each other. If a machine\nis not directly connected to the internet but instead is connected via a NAT router, it cannot\nbe reached by a machine on the internet. This is because the NAT router will only let\nthrough communication that is initiated from behind the NAT. This means if the p2p network\nhas all nodes behind NAT, none of the nodes would be able to connect to each other.\n\nWhen comparing to the server-client model, p2p botnets do not have the opportunity to hide\ntheir traffic amongst legitimate traffic. Up until recently, p2p communication on a corporate\nnetwork could be taken as suspicious activity. In present day, more and more legitimate\n\n\n-----\n\nservices are utilizing p2p technology that is slowly creeping into the enterprise space. For\nexample, Microsoft Windows 10 has a feature called “Delivery Optimization” that delivers\nupdates to machines via a p2p network established by machines connected to the same\nActive Directory domain.[3] Similar to misusing web services to hide malicious traffic, threat\nactors misuse legitimate p2p network to hide their traffic. In addition to blending with the\nnormal traffic, the botnet is intertwined with the legitimate nodes in such a way making it\nimpossible to take down the malicious botnet without taking down the legitimate p2p\nnetwork. In May 2019, a new botnet was discovered that utilizes the IPFS p2p network.\n\nIPFS is a project that aims to improve today’s internet by making it more decentralized.[4]\nThe project is designed to be a distributed p2p filesystem, and the filesystem can be used\nto host any kind of files, including static web pages that can be viewed with a web browser.\nThe files hosted on IPFS can be accessed by using a client or via public gateways. For\nexample, Cloudflare runs a public IPFS gateway.[5] The network code for IPFS is released\nas an open source project called “libp2p”, which is a modular network stack that allows\nanyone to take advantage of the network code used by IPFS (7). The library’s support\nincludes bootstrapping, NAT-traversal, relays, peer discovery, pubsub functionality. It can be\nused to construct an independent p2p network by providing bootstrapping nodes.The library\nalso includes IPFS’s bootstrapping nodes that can be used to layer the new p2p network on\ntop of IPFS’s p2p network. A functionality that can be appealing to threat actors.\n\nThe malware discovered in May 2019 by Anomali Threat Research, does use libp2p to\nlayer its p2p network on top of IPFS’s. The malware has been named IPStorm\n(InterPlanetary Storm) from its use of IPFS’s p2p network and the project name used by the\nthreat actor.\n\n## Technical breakdown\n\nIPStorm is a malware written in Go (Golang). The samples found in the wild have been\ntargeting the Windows operating system. The analyzed binaries include the path\n“/Users/brokleg/go/src/storm/” which suggests it has been developed on a macOS machine\nand the malware author has named the project “storm”, possibly after 2007’s worm named\nStorm that used a p2p network for C2 communication. The malware is a large, with the\nunpacked binary being around 15 MB in size. The code is split up into multiple Go\npackages. The packages are listed below:\n\nstorm/avbypass\nstorm/backshell\nstorm/ddb\nstorm/filetransfer\nstorm/logging\nstorm/node\nstorm/powershell\n\n\n-----\n\nstorm/util\nstorm/ddbinterface\nstorm/nodeinterface\n\nThe malware has some simple antivirus (AV) evasion techniques. It uses sleeps, memory\nallocations and generation of random numbers. The “allocateMemory” function is very\nsimple. The core function body is shown in Figure 1. It allocates 100 byte arrays with a size\nof 3 MB each.\n\n_Figure 1: Showing memoryAllocation function. The function creates 100 (0x64) byte arrays_\n_with space for 3 MB (0x2dc6c0)._\n\nInstead of using Mutexes or window names to ensure singe execution, IPStorm uses the\nthird-party package “single” (github.com/marcsauter/single). Single uses lock files to ensure\nonly one instance is running. The “single” name used by the malware is “n3R1PYfY”, the\nlock file is placed in the %TMP% folder (%TMP% 3R1PYfY.lock). When the malware is sure\nonly one instance is running, it performs an enumeration of the infected machine. It uses\nthe third-party package goInfo (github.com/matishsiao/goInfo) and PowerShell commands\nto collect most of the information. The collected user information is published to the p2p\nnetwork is shown in the struct below:\n\n\n-----\n\n```\ntype node.NodeInfo struct {\n  HostID string\n  Version string\n  Platform string\n  SystemInfo goInfo.GoInfoObject\n  Uid string\n  Gid string\n  UserName string\n  UserDisplayName string\n  UserHomeDir string\n  IsAdmin bool\n  ExecutablePath string\n  ComputerID string\n}\n\n```\nTo ensure the malware can connect to the p2p network, it adds a rule to the firewall. For the\nnetworking part, the malware uses “libp2p”. The underlying protocol used by the library is\n“protobuf”. The malware uses the PubSub functionality provided by the project. It uses two\ntopics: “info” and “cmd”. To find other peers, it uses libp2p’s support for distributed hash\ntables (DHT). The new bot uses a hardcoded string to advertise its presence and to find\nother peers.\n\nThe malware has support for downloading and uploading files. It is performed by sending\nthe content over the PubSub network. Each bot in the network serve its executable file and\nthe threat actor uses this method to distribute newer versions of the bot. It also has a\n“reverse shell” (called “backshell” by the author) functionality. With this functionality, the\nthreat actor can execute any arbitrary PowerShell code on the infected machine. The\nmalware installs itself under the following location:\n```\n\\.PHYSICALDRIVE0AppDataLocalPackages%s_%sAppData\n\n```\nFor the first “%s”, the malware does a random selection from one of the folder names in the\nlist below.\n\nMicrosoft.AAD.BrokerPlugin\nMicrosoft.AccountsControl\nMicrosoft.AsyncTextService\nMicrosoft.BioEnrollment\nMicrosoft.CredDialogHost\nMicrosoft.ECApp\nMicrosoft.LockApp\nAdobe.Photoshop\nAdobe.Illustrator\nAdobe.Reader\n\n\n-----\n\nThe second %s is replaced with a random string of 13 characters. The malware selects\ncharacters from the following alphabet:\n“qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM1234567890”.\n\nThe name of the executable is randomly selected from the following list:\n\nsvchost\ncsrss\nrundll32\nwinlogon\nsmss\ntaskhost\nunsecapp\nAdobeARM\nwinsys\njusched\nBCU\nwscntfy\nconhost\ncsrss\ndwm\nsidebar\nADService\nAppServices\nacrotray\nctfmon\nlsass\nrealsched\nspoolsv\nRTHDCPL\nRTDCPL\nMSASCui\n\nFor persistence, the malware adds an entry to\n“HKCU:SoftwareMicrosoftWindowsCurrentVersionRun”.\n\n## Analysis\n\nThe malware has a relatively simple set of core functionalities but utilizes a complex\nnetwork stack. The use of IPFS’s network stack allows the malicious botnet to hide within a\nlegitimate p2p network. This makes it unclear which peers are infected bots or legitimate\nIPFS peers. Just as an example during the bootstrap processing, the malware uses the\nsame bootstrapping peers as the IPFS network does. It is likely the bots are in the\n\n\n-----\n\ndevelopment process and more functions will be added in the future. Bot version found in\nthe analyzed samples ranges from “0.0.2n” to “0.0.2y”, suggesting early stage of the bot\nevolution.\n\nFrom the analysis of an estimated source code tree structure, generated using metadata in\nthe samples, it is possible the malware either can be compiled for other operating systems\nthan Windows or are in the process of being developed for other operating systems. The\ntree structure below shows that most of the code for the “backshell” was located in the file\n“backshell.go” while one function is located in the file named “backshell_windows.go”. This\nsuggests the author uses Go’s build tags support to select which “openLocalShell” function\nto compile depending on the target operating system. It can also be concluded that the\nmalware was compiled on a macOS machine.\n```\nPackage storm/backshell: /Users/brokleg/go/src/storm/backshell\nFile: backshell.go\n    (init)ializers Lines: 16 to 16 (0)   \n    StartServer Lines: 18 to 23 (5)\n    handleStream Lines: 23 to 36 (13)    \n    handleLocalShellIn Lines: 36 to 63 (27)\n    handleLocalShellOut Lines: 63 to 64 (1)\nFile: backshell_windows.go\n    openLocalShell Lines: 11 to 16 (5)\n\n```\nThe botnet size is likely in the lower thousands because during a ten-hour collection, 2847\nunique p2p nodes announced themselves with the identifier used by the malware and were\nadded to the DHT. This number does not correspond the number of bots in the botnet since\nthe bot generates a new libp2p id each time it is started up but is a good estimate of the\nupper bound of the botnet size. The size of the botnet may be indicative of it still being in its\nearly stage of evolution.\n\n## Conclusion\n\nIn general, the network architecture for botnets can be described either as a server-client\nmodel or a p2p model. The p2p model is usually much harder to implement but also more\nresilient against take-downs. A downside to the p2p model is it’s noisier than the serverclient model. The server-client model uses legitimate web services to blend hide its traffic\namong the legitimate traffic. In May 2019, a new malware was discovered that uses IPFS’s\np2p network to hide its p2p traffic. This is the first malware found in the wild that is using\nIPFS’ p2p network for its C2 communication. By using a legitimate p2p network, the\nmalware can hide its network traffic among legitimate p2p network traffic. This method also\nprovides some protection against takedowns, since sinkholing the p2p network potentially\ncould take down the whole IPFS network. With a good open source library that allows any\nthreat actor to implement a p2p network with relative ease, is this just the beginning of a\nnew evolution of p2p botnets?\n\n[Threatstream enterprise users can read a more detailed analysis here.](https://ui.threatstream.com/tip/326880)\n\n\n-----\n\n## IOCs\n\n2545175418021b0bcdce1fa055dc292500fa9895857c6df86461f9d74a342d15\n41ec6577b3a362cf9e5b136ca3971204147bc6c171b65bab3546f631a5c2efe0\n49c3fa3a2b7b5894559a28456ad611fa4692f72c1ec86eee925df81735278d53\n5918446d82bd8d6c40c6cdf5ab70a012f27939e9154e26f79a7c9870811cad8c\n5d980fa37aef47022941f6afffe718ed0eed4de746edd7f494a407f84e75fd50\n7f731d2502dd39cbc16193ca7e9d147fe158c10236e00c634bb0680e2bfc4bfa\n8531921258132a4eb9b4b4545e85c72c2815d53c22f72f92822c199a15562a7c\n8b24e640338654fbda233f50766136a9cf33f1a5444fd98162edbc2bdaf324c2\nc0cfc62c5c349523884d502088234026c3eb67c802d7d02018e7aa9337930e0b\nc19b34621a7a57d831113e0b854bbc1fa7217d578ca9bd477d805f56a73a0100\ncc124869cbc871ec99d3470f2287df816a5f75a05eaf79df65a8ecf9a8283eb9\nf987928992a9c43c65429d2abe93b4683a027b520d79246248fca49c31f234d7\nfe8dc4955f2e04bbf800e913d29848c2b99999554a802226e72ce68b6d8c71f7\n01658e8cc706056aca50304b29bfcab92a60cd38771f2b3069ba94f525661122\n039ae75eff58a5b1125c6d3248dfce338573a9040709b3a9e8cf910a1b4ada75\n2accb615e375b99bb92c67655ad9558c44782148d8264ef94e5a0a7d4dc1c5da\n2e751a9874267b100b10196ebbef58cfcf46644651b099c8a9cd1dd7cee64e8f\n3276bcd9b95a28234c1ea5205d8c2358f5040e694331a16cef09d273b6238178\n365480a61e39b67234692ba8b75b95749434aba28c952ac32f70ed777d25810a\n36d652460b71f6e9aca16ba331197fc384f323f70ea879ec8ea40a7a5f554a7e\n4549a271e2c4b157c8abe099d2e84c8f3d7c18782956267429e0be6e17eaed41\n500f004eb51f282c14939ba52a5d85ac71f85e1f0ede00803a6ae3a2f01c272d\n66d3799fc8132376d87f326f0131c41afecef560b0368bc54cc27b816025d9e6\n948042a3071a4a6e1063f2e09717fd70f23e2c37cbdf024ccded76477b94778e\na2d36f477e2a87acab32a1988f77b00ce9f24d61a4a21e63a8c67747ff2633fd\naf32455f41865094da020cad2675775bddd907020ed12d4ed68de5051ed62643\nde0b86fe66be7ef3f30f28d514c8bbced2973e78d9473671f16f4365e05e5a99\ne093152a3e44279259839e1c35eeaeb5ea0803611747b8b38acaffd65a83f83a\nf5ac2e7a6cfe6ce576a9c0df3721f90c5be93b5e4694716470ec7ea3c7492f59\n\n## Mitre ATT&CK\n\n References\n\n\n-----\n\n1. Jean-Ian Boutin, Turla s watering hole campaign: An updated Firefox extension\n\nabusing Instagram,” ESET, accessed May 28, 2019, published June 6, 2017,\nhttps://www.welivesecurity.com/2017/06/06/turlas-watering-hole-campaign-updatedfirefox-extension-abusing-instagram/; FireEye Threat Intelligence, “HAMMERTOSS:\nStealthy Tactics Define a Russian Cyber Threat Group,” FireEye Blog, accessed May\n28, 2019, published July 29, 2015, https://www.fireeye.com/blog/threatresearch/2015/07/hammertoss_stealthy.html.\n2. James Wyke, “The ZeroAccess Botnet – Mining and Fraud for Massive Financial\n\nGain,” Sophos, accessed May 28, 2019, published September 2012,\nhttps://www.sophos.com/enus/medialibrary/PDFs/technical%20papers/Sophos_ZeroAccess_Botnet.pdf.\n3. Windows IT Pro Center, \"Delivery Optimization for Windows 10 updates,\" Microsoft,\n\naccessed May 29, 2019, published May 31, 2019, https://docs.microsoft.com/enus/windows/deployment/update/waas-delivery-optimization.\n4. “A modular network stack,” Protocol Labs, accessed May 31, 2019, https://ipfs.io.\n5. “Distributed Web Gateway,” Cloudflare, accessed publication May 31, 2019,\n\nhttps://www.cloudflare.com/distributed-web-gateway.\n6. “A modular network stack,” Protocol Labs, accessed May 31, 2019, https://ipfs.io.\n\n\n-----\n\nTopics: Research\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-11 - The InterPlanetary Storm- New Malware in Wild Using InterPlanetary File System’s (IPFS) p2p network.pdf"
    ],
    "report_names": [
        "2019-06-11 - The InterPlanetary Storm- New Malware in Wild Using InterPlanetary File System’s (IPFS) p2p network.pdf"
    ],
    "threat_actors": [
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535827,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653761229,
    "ts_modification_date": 1653761229,
    "files": {
        "pdf": "https://archive.orkl.eu/ba6f4c4cee0fd301cd3d5e0c516bc88b2f3d4f20.pdf",
        "text": "https://archive.orkl.eu/ba6f4c4cee0fd301cd3d5e0c516bc88b2f3d4f20.txt",
        "img": "https://archive.orkl.eu/ba6f4c4cee0fd301cd3d5e0c516bc88b2f3d4f20.jpg"
    }
}