{
    "id": "17f9db49-d540-4fea-a7a9-50a90095f0ec",
    "created_at": "2022-10-25T16:48:17.28772Z",
    "updated_at": "2025-03-27T02:05:37.931256Z",
    "deleted_at": null,
    "sha1_hash": "20fa586304cbbfaf23453c1bbe7033de398bd9fb",
    "title": "Micro-Targeted Malvertising Via Real-Time Ad Bidding",
    "authors": "Invincea",
    "file_creation_date": "2014-10-27T15:55:21Z",
    "file_modification_date": "2014-10-27T15:55:21Z",
    "file_size": 2175333,
    "plain_text": "# Invincea White Paper\n\n## “Micro-Targeted Malvertising via Real-time Ad Bidding”\n\n### UPDATED: Includes New CryptoWall Malvertising Campaign\n\n Release date: October 27, 2014\n\n\n### DETECTION | PREVENTION | INTELLIGENCE\n\n# Invincea White Paper\n\n\n**Invincea White Paper**\n\n\n# Invincea White Paper\n\n## “Micro-Targeted Malvertising via Real-time Ad Bidding”\n\n### : Includes New CryptoWall Malvertising Campaign\n\n\n-----\n\n#### Table of Contents\n\n##### Executive Summary ............................................................................................................... 2\n\n Introduction .......................................................................................................................... 3\n\n**Operation DeathClick: Targeting the US Industrial Base ...................................................................4**\n\n**Summary for Incident at Fleaflicker.com .........................................................................................4**\n\n**Summary for Incident at Gpokr.com ...............................................................................................9**\n\n**Summary for Webmail.earthlink.net ............................................................................................. 11**\n\n**Summary of Incidents in Operation DeathClick ............................................................................. 13**\n\n##### Real-Time Bidding Networks: How it works .......................................................................... 13\n\n**Malvertisers have Weaponized RTB ............................................................................................. 16**\n\n**Competitive Service Offerings for RTB .......................................................................................... 16**\n\n**Major Players in RTB .................................................................................................................... 20**\n\n**How Malvertisers Get $$ to Bid on RTB ......................................................................................... 21**\n\n**Where Malvertisers Host Exploits ................................................................................................. 22**\n\n**Real World Examples of RTB Malvertising Captured by Invincea .................................................... 23**\n\n##### Ransomware Campaign via Malvertising ............................................................................. 26\n\n**Analysis of CryptoWall Malvertising Infections .............................................................................. 27**\n\n##### Central Hosting of Clean Content ......................................................................................... 30\n\n How to Protect Yourself from Micro-targeted Malvertising ................................................. 31\n\n Release Notes ...................................................................................................................... 32\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Executive Summary\n\nMost targeted attacks against organizations originate as spear-phish campaigns or watering hole style\nweb driveby attacks. Within the last six months, Invincea has discovered and stopped **_targeted_**\nmalvertizing attacks against specific companies -- particularly those in the Defense Industrial Base. The\ncombination of traditional cyber crime methods (malvertising) with targeted attacks against Defense\nindustrials for theft of IP represents another development in the on-going blending of techniques from\ncyber crime and advanced threat actors with nation state agendas. We are tracking an on-going campaign\nagainst US Defense companies under the code name Operation DeathClick.\n\nTraditional malvertizing has been an effective but indiscriminate method cyber crime gangs use to\ncompromise endpoints to perpetrate ad fraud, identity fraud, and banking credential theft. In this new\n**targeted variation of malvertizing, the perpetrators are attacking specific organizations by leveraging real-**\ntime ad bidding networks and micro-targeting techniques developed over the last decade in online\nadvertising. The objective of these micro-targeted attacks against the Defense sector is likely theft of\nIntellectual Property more than ad fraud and indicates motive and sophistication characteristic of\nadvanced threat actors. Since these attacks were blocked by Invincea prior to compromise of the machine\nor network, we cannot confirm the specific IP the perpetrators are after – only the Tactics, Techniques,\nand Protocols (TTPs) used which we describe herein, similar to methods used to provide backdoor access\nand command and control over compromised networks.\n\nWhile we discovered these attacks across multiple Defense companies, we expect it will not be long, if\nnot already, before other highly targeted segments including Federal, Financial Services, Manufacturing,\nand HealthCare are victimized with the same micro-targeted malvertising. The campaign described here\ndoes not represent a single flaw, 0-day, or unpatched bug, but rather a significant development in the\nadversary’s capabilities and strategy to leverage legitimate online advertising platforms on well-known ad\nsupported websites via a technique called Real-Time Ad Bidding. In other words, this problem will not be\n**patched on Tuesday.**\n\n**UPDATE:** We have updated this document to include a new section on a campaign of distributing\nCryptoWall ransomware via malvertising. While the attack vector is the same, we believe this to be\nmotivated by cybercrime rather than theft of IP from Defense companies.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Introduction\n\nMalvertising has seen meteoric rise in 2014. Threat actors create a corporate front, advertise on\ncommonly visited sites, then later switch out the landing pages for their ads to pages that host exploit\nkits, or simply create a temporary redirection from their usual content to the malicious landing page.\nThese exploit kits are hosted on compromised web servers across the world. In other words, they leverage\nlegitimate ad-supported popular websites together with compromised websites for hosting exploit\nlanding pages, defeating black-listing techniques. The lifetime of these ads and landing pages are\nmeasured in hours.\n\nIn the campaign described here, Operation DeathClick, traditional malvertising has been armed with a\nmicro-targeting system using IP address ranges, geographically narrowed down to zip codes, and interests\nof the user (recorded in cookies) to target specific companies, company types, and user\ninterests/preferences. They are employing the tactics of real-time ad bidding to guarantee malicious ad\ndelivery to intended targets of the campaign – building on a decade of work in real-time analytics for\nonline ad placement, but for nefarious purposes.\n\nThe threat actors redirect their ads for just minutes at a time and then abandon their exploit kit pages\nforever. This means that list-based threat intelligence feeds are rendered ineffective. The domains used\ndo not appear in any proxy blacklist, and the malware droppers delivered by the exploit pages always\nemploy different signatures, evading traditional network and endpoint detection technology.\n\nAd delivery networks today are not incentivized to address the problem in a credible manner as they\nderive revenue from the criminal enterprise, while not being held accountable. Turning a blind eye to the\nproblem is rewarded economically. Meanwhile the perpetrators are able to use traditional malvertising\nand ad fraud bots to fund the criminal enterprise.\n\nWithout cooperation of ad networks to vet the advertisers working through front companies, this attack\nvector will go unchecked. And now, with the advent of real-time ad bidding, these threat actors have\nweaponized ad delivery networks to target victims based on:\n\n  - User-Agent strings (versions of flash, OS, java and browser)\n\n  - Interest-related content (click bait articles, industry specific software or hardware, like medical\nsupplies, radar mapping software, ammunition sales, stocks forums)\n\n  - Advertising Profiles derived from cookies (someone with specific tastes, may shop for shoes,\nhandbags, cars, luxury vacations)\n\n  - Geographic region (malvertisers can target specific neighborhoods or states via geoip direct\nadvertising)\n\n  - **Specific corporate IP ranges (targeted malvertising can target the public IP space of your network**\nor an Industrial Vertical)\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nReal-time ad bidding allows advertisers, and by extension, adversaries, to micro-target ad delivery on an\nextremely granular basis. For example, oppressive regimes trying to gather intelligence on activist\nprotests can deliver ads to people getting email from within a specific locality where they are protesting.\nToday, it is commonplace for micro-targeting techniques to be used as part of the toolset in legitimate\nonline advertising. For instance, a defense contractor, trying to win a new omnibus contract, can deliver\ntargeted ads to online news sites frequented by Government program personnel. The latest software\nproduct release can be delivered to Windows users visiting PC Magazine’s website. A local car dealership\ncan sense when someone is in the market for a new car and can deliver advertising to those users, based\nsolely on browsing history.\n\nNow advanced threat actors are able to target an organization directly via micro-targeted malvertising,\nbased solely on their corporate network IP range. Thus, it doesn’t matter where in the world you point\nyour web browser -- an online video poker room, a fantasy football club homepage, a Pakistani news\nhomepage, or even checking your own webmail at a trusted email provider. Those ad windows can and\nare being used to deliver malware if the bidding price is right.\n\n#### Operation DeathClick: Targeting the US Industrial Base\n\nRecently, multiple US Defense/Aerospace contractors were targeted by a malvertising campaign. These\ncontractors had deployed world-class enterprise security defense in depth approaches to protect their\nintellectual property. They had next generation firewalls that relied on threat intelligence feeds to do\nauto-blocking of known malicious sites. They had malware interception technology that relied on known\nbad hashes to prevent malicious downloads. The multiple proxies in place subscribed to real time feeds\nof known bad URLs. They deployed AV at the gateways and on the endpoints.\n\nBut in a two week period, these organizations were hit with dozens of micro-targeted malvertising attacks,\neach of which would have provided a beachhead for the threat actors from which to compromise the\nnetwork, if successful. In each instance, the attacks were carried out by targeting these Defense\ncontractors directly via real-time ad bidding. Once targeted, an end user only needed to browse to any\nwebsite, anywhere in the world, which contained a DoubleClick ad-partner embedded window. Invincea\nstopped these attacks on the endpoints by containing the delivered exploits in secure virtual containers,\nwhile producing the forensics that led to this discovery.\n\nNext we go in some detail about example attacks perpetrated against the defense firms.\n\n_It is important to note that the websites we show next that served up targeted malvertising were victims_\n_of malvertising campaigns with no knowledge of the malicious ads they were serving up. These malicious_\n_ads were served up by 3[rd] party networks, who are unwittingly sourcing malicious content. As we will_\n_discuss later, the 3[rd] party ad networks themselves are falling victim to malicious content campaigns._\n\n#### Summary for Incident at Fleaflicker.com\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nA user visited his online fantasy football league homepage at Fleaflicker.com. As soon as the page loaded,\na malicious ad delivered a backdoor Trojan via a Java-based exploit.\n\nFigure 1 shows a screenshot of the page that was visited. You will notice the two inline ad placements\nfor DoubleClick ad delivery. The malware delivered came from a compromised Polish website, and\nwould have installed a generic backdoor Trojan.\n\n**Figure 1: Fleaflicker.com website**\n\nNote the prominent ad placements by AdChoice, a DoubleClick affiliate. Figure 2 shows an event tree of\nthe exploit and malware delivered from an ad by visiting Fleaflicker.com.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n**Figure 2: Event tree for infection from Fleaflicker.com Incident**\n\nThe event tree in Figure 2 taken from Invincea’s Threat Management Console shows the exploited Java\nprocess dropped a file called fvJcrgR0.exe, and that it likely came from Pubmatic, an ad delivery network\nthat allows for real time bidding to deliver ads. In this instance, the Pubmatic server redirected to a Web\nserver in Poland that dropped the malware. The timeline below shows the exact times and URLs visited.\n\n**Figure 3:** **Timeline for Fleaflicker.com Incident**\n\nNote the number of re-directs from Fleaflicker.com to different outside properties in Figure 3.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n**Figure 4: Process Launch for Malware fvJcrgR0.exe from Fleaflicker.com Incident**\n\nInvincea Threat Management provides a quick way to search for an MD5 hash on third party sites (see\nFigure 4). By clicking the VirusTotal link, the analyst will see the following VirusTotal report in Figure 5:\n\n**Figure 5: VirusTotal Report for Malware fvJcrgR0.exe from Fleaflicker.com Incident**\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nFrom the VirusTotal report in Figure 5, you will see that this malware is a Trojan backdoor that would likely\nbe used to download additional malware or to provide remote persistent access to the attacker.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Summary for Incident at Gpokr.com\n\nAn employee at a defense contractor visited a free Texas Poker online game. The Poker site had\nadvertisements on the page, one of which launched a similar attack as seen in before on other websites\nvisited by employees at this firm.\n\n**Figure 6: Screenshot of Gpokr.com**\n\nIt should be noted that Gpokr.com no longer appears to be serving advertisements from their site. At the\ntime of the incident, as seen in the logs below, an ad window was previously present. In the event tree\nshown in Figure 7, you will see that the winning bid redirected to a direct-to-IP site instead of a site via\ndomain name. Also, above is the first indication of specific executable DLL files. Searches for these\nfilenames returned zero results on VirusTotal.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n**Figure 7: Event Tree for Gpokr.com**\n\nThis event on September 14 (Figure 8) shows that delivery.first-impression.com redirected directly to an\nIP address, not a domain name to deliver its malicious payload. Note the multiple DLL files written to disk\nand the spawning of rundll32.exe. At this point, the Invincea-protected host recognized the unauthorized\nprocess and reverted itself to a clean state.\n\n**Figure 8:** **Timeline View for Event 5 – Gpokr.com**\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Summary for Webmail.earthlink.net\n\nIn another incident an employee checked their online Earthlink account. When they replied to an email,\na new ad was loaded on a page that attempted to exploit Java. This malvertising was from the same IP\naddress seen in other incidents.\n\n**Figure 9: Screenshot of Webmail.earthlink.net**\n\nYou will notice the inline advertisements on this page in Figure 9. The event tree in Figure 10 notes that\nthis was likely a spear-phish attack. The timeline will show that when the user replied to an email, the ads\non the Earthlink page refreshed, dropping the exploit code via Java.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n**Figure 10: Event Tree for Incident 6 Webmail.earthlink.net**\n\nNote in the timeline in Figure 11, how there was a 7 minute gap between the DoubleClick ad redirect and\nthe delivery.first-impression.com ad. This is an indication that the page was refreshed or the ad was\nrefreshed on the page. The same exploit IP address from the Gpokr event is present. This event is the\noldest, happening on September 11.\n\n**Figure 11: Timeline for Incident 6 Webmail.earthlink.net**\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Summary of Incidents in Operation DeathClick \n\nThe three examples above are samples of the more than two dozen micro-targeted attacks we have\nwitnessed and blocked as part of Operation DeathClick since mid-September. Defense Industrial Base\ncustomers witnessed micro-targeted malvertising at a rate six times that of comparable private sector\ncompanies with similar defense-in-depth capabilities.\n\n#### Real-Time Bidding Networks: How it works \n\nWe observed in Operation DeathClick that real-time ad bidding networks are being used by criminal\nenterprise to target companies with malicious content in order to gain persistent remote access. In\nthese third-party arrangements, the content is frequently not vetted because billions of impressions are\nrendered in real-time. Most of the content is legitimate ads. A small fraction is malicious content linking\nto landing pages that infect users. Real-time ad networks are being used, often unwittingly, and some\n_have taken steps to try and combat malicious use of their networks. The Online Trust Alliance is one such_\n_industry group comprised of major software companies and ad networks working together to try and_\n_address this problem. Our goal in this paper is to shed light on the micro-targeting of companies by_\n_criminal enterprise employing real-time ad networks, and to aid the industry in collectively addressing_\n_this problem._\n\n[Real-time ad bidding networks have evolved over the last ten years as a means of micro-targeting](http://vimeo.com/10084328)\ncustomers with advertising content they are more likely to click-on.\n\n[From Wikipedia:](http://en.wikipedia.org/wiki/Real-time_bidding)\n\n**_Real-time bidding (RTB) refers to the means by which ad inventory is bought and sold on a per-_**\n\n_[impression basis, via programmatic instantaneous auction, similar to financial markets.[[1]]](http://en.wikipedia.org/wiki/Real-time_bidding#cite_note-adfonic-1)_ _With_\n\n_real-time bidding, advertising buyers bid on an impression and, if the bid is won, the buyer’s ad is_\n\n_[instantly displayed on the publisher’s site.[[2]] Real-time bidding lets advertisers manage and](http://en.wikipedia.org/wiki/Real-time_bidding#cite_note-dmnews-2)_\n\n_optimize ads from multiple ad-networks by granting the user access to a multitude of different_\n\n_networks, allowing them to create and launch advertising campaigns, prioritize networks and_\n\n\n_allocate advertising stock._\n\n\n_Real-time bidding is a dynamic bidding process where each impression is bid for in (near) real time,_\n\n\n_against a static auction where the impressions are typically bundled in groups of 1,000._\n\n\n_A typical transaction begins with a user visiting a website. This triggers a bid request that can_\n\n_include various pieces of data such as the user’s demographic information, browsing history,_\n\n_location, and the page being loaded. The request goes from the publisher to an ad exchange,_\n\n_which submits it and the accompanying data to multiple advertisers who automatically submit_\n\n_bids in real time to place their ads. Advertisers bid on each ad impression as it is served. The_\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n_impression goes to the highest bidder and their ad is served on the page.This process is repeated_\n\n_for every ad slot on the page. Real time bidding transactions typically happen within 100_\n\n\n_milliseconds from the moment the ad exchange received the request._\n\n\n_The bidding happens autonomously and advertisers set maximum bids and budgets for an_\n\n_advertising campaign. The criteria for bidding on particular types of consumers can be very_\n\n_complex, taking into account everything from very detailed behavioral profiles to conversion data._\n\nThe following infographic summarizes how advanced adversaries are now micro-targeting companies\n\n\nusing malvertising.\n\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Malvertisers have Weaponized RTB \n\nThe marketplace and auction of ads sounds great for actual ads. But what if the landing pages that are\nsupposed to be ads are actually malicious PHP pages with embedded malware? The bidding and ad\nplacements work the same, but instead of seeing a flashy ad banner, the highest bidder for the placement\nserves malware. The price to win the bid to push malvertising to any page you happen to visit ranges from\n45 to 75 cents per impression.\n\nA malicious advertiser on a network may serve crafted, seemingly normal ads, a majority of the time. In\nfact, the ads are often stolen copies from legitimate advertisers. This establishes the attacker’s legitimacy\nand trust on the ad network. Of course with real-time ad bidding, he can simply offer up low bids and his\ncontent would consistently lose in the marketplace.  But it is very simple to replace the redirection code\nto switch from a legitimate ad banner to a drop site that hosts an exploit kit, typically based on Java, Flash,\nSilverlight, or all three. Once the malvertiser detects that he has several infected hosts, he removes the\nredirection code and goes back to serving standard ad banners. He then “burns” his temporary exploit kit\ndrop site, moving his exploits to another location for a new campaign.\n\nThis allows the malicious advertiser to perform hit and run attacks, infect whomever he wants at whatever\ntime he wants, and maintain his presence on the advertising marketplace without drawing undue\nattention to his activities.\n\nIn the sections below, we will provide highlights of the RTB industry, its targeting capabilities, and show\nhow malvertisers have been mis-appropriating RTB networks to deliver malware.\n\n#### Competitive Service Offerings for RTB \n\nThe RTB ad networks provide significant micro-targeting capabilities that have long been used to serve\nlegitimate content to users more likely to click on them. In the following, we describe these capabilities\nto show the state of the art in RTB network capabilities. The quoted material below are direct quotes from\nReal Time Bidding service providers linked. Emphasis added by Invincea.\n\n**_[Pubmatic:](http://www.pubmatic.com/media-buyers-inventory-and-audiences.php)_**\n\n**_Audience Targeting: Bid on the audiences most valuable to you. Each impression in the PubMatic_**\n_auction can be enhanced with first- and third-party data;_ **_giving buyers targeting capabilities_**\n**_across display, mobile, tablet and video inventory. Media buyers can also cookie sync with_**\n**_publisher audiences to incorporate CRM, retargeting and exclusion strategies in their digital_**\n_advertising._\n\n_Buyers have access to proprietary audience segments either directly through Private Marketplace_\n_deals or through the open market. With hundreds of parameters available to you, PubMatic has_\n_your best audiences waiting for you._\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n_With PubMatic, buyers are able to access pre-defined vertical or audience packages, seasonal_\n_packages, publisher and/or site-specific inventory packages as well as pre-selected publisher_\n_packages and pricing available in Private Marketplaces._\n\n**_[First-Impression.com](http://first-impression.com/home/)_**\n\n_“First-Impression Buy-Side offers the granular targeting, tracking, and reporting needed to help_\n_our clients make the most of their spend, along with an expert support team to advise when_\n_needed. By leveraging real time buying, First-Impression Buy-Side gives media buyers the full_\n_control to maximize the value of an impression.”_\n\nCould Malvertisers Track Exploits and their cost per impression? Yes. Many RTB networks provide a\ncontrol panel to track advertising campaigns in real-time, along with notifications that bids have been won\nand who exactly was served the malware.\n\nBelow is a URL redirection log from First-Impression.com from a winning bid by a malvertiser. In the URL\nare parameters such as the type of ad, the type of user-agent string of the ad reader specified (which\ndiscloses browser and java versions), whether it is a retargeted ad based off of cookies (this one was not),\nthe price paid, which is 65.4 cents, and the notification to the malvertiser that his malvertising was\ndelivered.\n```\nhttp://delivery.firstimpression.com/delivery?action=serve&ssp_id=3&ssp_wsid=2191400908&dssp_id=100&domain_\nid=2191400908&ad_id=748271&margin=0.4&cid=155380&bn=sj14&ip_addr=24.234.123.133&ua=15\n40937276&top_level_id=24.234.123.133&second_level_id=1540937276&page=thanhniennews.co\nm&retargeted=null&height=90&width=728&idfa=null&android_id=null&android_ad_id=null&bi\nd_price=0.654&count_notify=1&win_price=$AAABSMPg1dmFEPqXEZe5_CYviub3uOlabldGew\n\n```\n**_DoubleClick.net_**\n\nDoubleClick discusses their targeting capabilities in online documentation. Since they specialize in\nknowing the location of their ad windows, they market those ad spaces to the actual advertisers and\nmalvertisers, along with targeted demographics about the content pages, the visitors to the sites and\nmore.\n\n_To showcase the variety of impression-level data available to buyers, consider the data made_\n_available through a connection to DoubleClick Ad Exchange’s real-time bidding API. With ADX, a_\n_buyer could consider any of the following data passed from the seller with each impression:_\n\n_• Ad slot parameters: visibility (above or below the fold), size, excluded creative attributes,_\n_excluded advertiser URLs, allowed vendor or ad technology._\n\n_• Geo parameters: country, region, metro, city._\n\n_• Content parameters: site URL, site language, seller network, vertical or category._\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n_• User parameters: browser, operating system, anonymous cookie (hashed), cookie age._\n\n_Just like when considering one type of data, by using the anonymous cookie parameter, buyers_\n_can consider first-party retargeting or third-party audience data from a data provider. However,_\n_they can go further in the evaluation by looking at more of these parameters. This helps a buyer_\n_learn much more about a particular user and a particular impression, gain a smarter answer to_\n_the three essential questions and make a more data-driven decision._\n\n**_[Twitter, Facebook and other RTB ads can now target mobile devices by their phone](http://www.adexchanger.com/social-media/twitter-rolls-out-lookalike-audiences-new-mobile-ad-ids-targeting-by-phone-number/)_**\n**_numbers._**\n\nThis sounds like a great way to advertise if you are in the marketing industry. Consider how granularly a\nperson can be targeted if this service is used maliciously. If not targeted by the desktop, how about on\nthe mobile platform?\n\n_Twitter’s Tailored Audiences just got a little more tailored._\n_Advertisers can_ **_now augment their customer data using mobile advertising IDs and mobile_**\n**_phone numbers as a way to reach existing customers and increase audience size. In essence, the_**\n_move is an extension of Twitter’s Tailored Audiences for CRM retargeting, which allows advertisers_\n_to use hashed non-PII email address to retarget existing customers. (email addresses are twitter_\n**_IDs- so you could be targeted for ad delivery based on your account name or known phone_**\n**_number)_**\n\n_Twitter also rolled out the ability to target lookalike audiences, a function that seems pretty similar_\n_to Facebook’s tool of the same name. Twitter’s lookalike modeling uses a proprietary algorithm_\n_that examines modeled users looking for similarities related to behaviors,_ **_interests, location,_**\n**_demographic attributes and engagement patterns._**\n\n_Twitter described its enhanced as “part of improved targeting options to help advertisers reach_\n_additional users similar to their existing audiences.”_\n\n_Tailored Audiences, Twitter’s seeming answer to the Facebook Exchange (FBX), officially launched_\n_back in December after running retargeting and database matching tests in July. Twitter has_\n_appeared to follow Facebook’s lead with a number of its recent roll-outs, including site retargeting,_\n_CRM targeting and now retargeting via lookalike audiences. (Facebook also makes it possible to_\n**_target users by phone numbers through Custom Audiences.)_**\n\n**_[Neustar.biz](http://www.neustar.biz/resources/faqs/display-advertising)_**\n\nNeustar does provide a real-time bidding ad exchange, but their real market is IP intelligence that they\nsell to other advertising networks for the purposes of better targeting specific users. In Europe, laws\nrequire that advertising networks allow people to opt out of having tracking cookies, which is how many\nadvertisers used to rely upon for ad campaign targeting. To get around this, Neustar perfected IP based\ntargeting, which avoids cookies. They are able to build IP specific browsing profiles based on IP subnets.\nIn a blog post below, Neustar boasts about their direct to IP range and enterprise advertising.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n_How can Neustar IP Intelligence target by IP?_\n_While IP intelligence has been around for many years, the ability to effectively target advertising_\n_by audience, based on IP is very new. Neustar IP Intelligence is currently working with select DSP_\n_platforms to buy impressions off of the exchanges based on the IP address rather than cookies._\n**_This has only been possible with the recent emergence of real time bidding (RTB)._** _The secret_\n_sauce is in understanding the IP and the methodology necessary for targeting ads appropriately_\n**_against it._**\n\n_Is an IP Address like a cookie?_\n_No, an IP address only identifies devices on a network. The IP address does not contain any PII and_\n_does not track or store any consumer usage or behavioral information._ **_(But IP ranges are_**\n**_registered by IANA, and you can easily know who owns the ranges)_**\n\n_Product Specific Questions_\n_Q1: How does the process work?_\n_The process works exactly like any advertising network. Instead of buying inventory based on a_\n_cookie, Neustar is buying inventory based on an IP address. We run the targeting specifics against_\n_our proprietary database and_ **_create a custom IP list to target against. Neustar has set up_**\n_relationships with partners that have built the functionality for this to work end-to-end for our_\n_advertisers._\n\n_Neustar offers a full service ad network. Brand marketers who wish to advertise using IP Audience_\n_Targeting can work directly with Neustar to determine custom IP placements, run campaigns,_\n_optimization, reporting and billing. Much like any traditional online publisher or online ad network,_\n_Neustar manages the entire process._\n\n_How does Neustar deliver its ads?_\n_We use industry standard methods for delivering our ads, but what makes our approach special is_\n_that we bake in the IP data before delivering the inventory with our network partners,_ **_which_**\n**_allows us to target display ad campaigns to a specific business or organization. We obtain_**\n_inventory from ad exchanges, but have our own ad server._\n\n**_Zedo_**\n\nZedo, blamed for recent malvertising via DoubleClick, [say they are now trying to protect against](http://www.zedo.com/news/zedo-takes-immediate-action-stem-malware-attack/)\n[malvertisers in this blog here. Less than a week after this announcement, they published another blog](http://www.zedo.com/news/zedo-takes-immediate-action-stem-malware-attack/)\npost that describes how they can push advertising to specific platforms, devices, as well as specific markets\nand networks:\n\n_[ZEDO Advertising Technology](http://www.zedo.com/zedo-advertising-technology-updates-september-2014/)_ _Updates – September 2014_\n\n**_Device Targeting_**\n_Users can now target ads to a specific device when trafficking ads. An option for “Device_\n_Targeting” is now available under “Targeting”. A creative targeted to a specific Device will serve_\n_only on that Device. All major manufacturers/models are supported by this feature. If a creative is_\n_not targeted to any specific device than it will serve on all device._\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n**Figure 13: Targeting by Device Manufacturer/Model**\n\nApart from device, a user can target various devices based on different categories. At any given\npoint of time, a user can target multiple manufacturers and categories.\n\n**Figure 14: Targeting by Device Category**\n\n**_Reach Report by Creative_**\n_Apart from existing campaign reach report a user can now pull a reach report by creative. The_\n_creative reach report is available along with all the existing parameters and can be pulled by_\n_month, week or day. Creative reach report will show creative wise reach. It will help to analyze_\n_how effective the reach of a creative was._\n\n#### Major Players in RTB \n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nTo be clear, RTB networks are legitimate platforms for displaying ads on ad-supported websites. They\nenable micro-targeting of user’s interest, delivering content that a viewer would likely want to see. As we\nhave detailed here, they can also be mis-appropriated unwittingly by malvertisers using these same tools\nand techniques to target companies with malware for persistent remote access in addition to traditional\nclick fraud, phishing, and identity theft.\n\nBelow are links to RTB providers to learn more.\n\n[http://www.sovrn.com/](http://www.sovrn.com/)\n[http://www.turn.com/](http://www.turn.com/)\n[http://indexexchange.com/](http://indexexchange.com/)\n[https://www.dataxu.com/](https://www.dataxu.com/)\n[http://www.sitescout.com/rtb/](http://www.sitescout.com/rtb/)\n[http://first-impression.com/home/](http://first-impression.com/home/)\n[http://www.zedo.com/](http://www.zedo.com/)\n\n#### How Malvertisers Get $$ to Bid on RTB \n\nInvincea has shown logs from a winning malvertising bid in the price range of 65 cents per impression.\nThat is one ad, on one page, paid for by the malvertiser’s account. This implies that malvertisers have\ndeep pockets, spending hundreds of dollars on ad impressions. So how do they get money to spend on\nthese malicious campaigns?\n\nInvincea recently saw a malvertiser win a bid and delivered a Java exploit. This exploit copied a fully\nfunctional version of Chrome into the Java cache directory, and that version of Chrome launched in the\nbackground and proceeded to visit websites and click on specific ad banners. It is presumed that these\nad banners paid revenue via referral bonuses to the malvertiser. By paying 65 cents to install a\nbackground web browser that does nothing but click fraud, the malvertiser is able to reap hundreds if not\nthousands of dollars in advertising referral income. It is a pretty good return on investment, which in turn\nallows the malvertiser to fund his micro-targeted malvertising attack campaign.\n\nIt is ironic, however, that click fraud is what is driving the prices of RTB advertising so high. Malvertising\nis not only a danger to end users, but it is a danger to the advertising industry as well. The image from\nFigure 14 below shows a log file of Chrome, in this instance, renamed Oajvliewxpge.exe, injected via Java\nto run in the background. Invincea detected this attack and killed the infection attempt. This is one\ninstance where the malvertiser wasted his 65 cents.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n##### Figure 16: Event tree of click fraud malvertising exploit\n\nIt should be noted that Invincea is uniquely capable of stopping this type of attack. The introduction of\nChrome as a browser, which is whitelisted by hash across the AV industry, would go unchecked by the AV\nand whitelisting applications industry. In this instance, the host was almost converted to a click-fraud bot.\nBut the malware delivery could have been intended for data exfiltration, banking Trojans, or any other\nmore insidious purpose.\n\n#### Where Malvertisers Host Exploits \n\nThe ability for advertisers and malvertisers to automatically redirect to self-hosted ad content or exploit\npages is driving RTB malvertising. Invincea has witnessed a rash of exploit kits and landing pages hosted\non:\n\n\n\n- Compromised WordPress Blogs\n\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n  - Unconfigured Apache hosts\n\n  - Cloud-based NGINX subdirectories\n\n  - Government and News pages in Poland\n\n  - Free Hosting sites such as ua.in\n\nIn most instances, the landing pages are preconfigured with the exploit kit. The malvertiser creates the\nredirection in his normal ad prior to raising his bids to winning levels. Once several victims are confirmed,\nthose malicious landing pages have the content erased, and the automatic redirection removed to serve\n“normal” ads again.\n\n#### Real World Examples of RTB Malvertising Captured by Invincea\n\nFigures 17 through 21 in the following are screenshots from Invincea’s Threat Management console from\nvarious RTB-based malvertising incidents with highlighted URLs for malvertising delivered via RTB ad\nbidding.\n\n\n##### Figure 17: Recent Blaze.Com RTB Kryptik malvertising via GumGum\n\n\n##### Figure 18: Online Ammunition Forum had RTB malvertising delivered. Exploit landing page in In.ua.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n##### Figure 19: Largest Trading Online Forum Trade2Win.com delivered RTB malvertising via German provider:\n\n Figure 20: Answers.com click bait articles hosted winning RTB bids dropping Kryptik from Polish government landing page exploit kits.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n##### Figure 21: Online Poker Room and targeted RTB attack against Defense Contractor. Java exploit hosted at unconfigured Nginx host.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Ransomware Campaign via Malvertising\n\nIn September and October of 2014, Invincea saw a sharp spike of malvertising delivering CryptoWall\nransomware attacks via Real Time Ad Bidding. We observed Real Time Ad bidding platforms, including\nOpenX, GoogleAds, Yahoo, AOL, and first-impression.com, fall victim to the ransomware malvertising\nscheme by unwittingly delivering the CryptoWall 2.0 ransomware ads.\n\nRansomware is a particularly pernicious form of malware that fully encrypts the victim’s disk and data\nfiles, including remote storage, then demands payment of anywhere from $300 to $1000 in return for the\ndecryption key. Users are held hostage from their own work, pictures, personal, and proprietary material.\n[To learn more about the scourage of ransomware, see this blog.](https://www.linkedin.com/pulse/article/20140702135307-262891-why-ransomware-will-be-a-game-changer-and-what-to-do-about-it?trk=mp-details-rc)\n\nBased on analysis of Invincea logs in would-be victims targeted by these ads, we have insight into the\nattacker that is delivering the malicious ads. According to Invincea analysis of ads delivered from firstimpression.com, winning ad bids ranging from as low as 30 cents and as high as $1.70, were delivered by\na block of unique identifiers. It is highly likely that the same attackers are using other RTB ad platforms.\n\n[This campaign matches the characteristics described by Proofpoint in its blog](http://www.proofpoint.com/threatinsight/posts/malware-in-ad-networks-infects-visitors-and-jeopardizes-brands.php) in terms of the exploitation\nmethods. Legitimate ad copy is stolen, 3[rd] party ad networks used to distribute malware, and popular adsupported websites displaying the malicious ads that exploit unsuspecting visitors with drive-by web\nexploits. Merely visiting any ad-supported site may result in a CryptoWall ransomware infection.\n\nCryptowall 2.0 utilizes the TOR network to hide its communications, but it quickly encrypts all local files\non the disk, and demands bitcoin payment to unlock the files. Many companies have fallen prey to this\nattack over the past few months, making this one of the most successful Ransomware campaigns to date.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n#### Analysis of CryptoWall Malvertising Infections\n\n Mitigated Infection Event Sports.Yahoo.com\n\nBelow is a typical Cryptowall 2 infection as seen in the Invincea Management Server logs. This winning\nad placement ran on sports.yahoo.com – an Alexa Top 4 rated site. Highlighted in order in Figure 22 is\nthe common filename of obupdat.exe, which has ever changing hashes, followed by the TOR port, and\nthe 3[rd] party ad platform of first-impression.com.\n\n**Analysis (Original report):**\n\n**Figure 22: CryptoWall 2.0 infection report**\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\n**Timeline Analysis (Original Report):**\n\nBelow in Figure 23 is the timeline of the Tor connections and SSL connections employed by CryptoWall.\n\n**Figure 23: Network connections from CryptoWall 2.0**\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nIn addition, you can see the ransom note being written to disk on an infected machine in the audit logs\nin Figure 24.\n\n**Figure 24: File writes including the ransom note from CryptoWall infection**\n\nFigure 25 shows the winning malvertising bid via RTB ad delivery from first-impression.com. Items\nhighlighted in the URL below is userid, and the winning bid price to place malvertising of Cryptowall on\nsports.yahoo.com, which is 60 cents.\n\n**Figure 25: Winning malvertising bid with fields embedded in URL**\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nIn Figure 26 below, we show the unique identifiers for the userID and campaigns to deliver CryptoWall\nmalware that were blocked and audited by Invincea, including the websites that delivered the ads via a\nthird-party ad network over the past month.\n\n**userID, CampaignID and CommonName** **Website Delivering Malvertising**\n748568&margin=0.4&cid=155493&bn=wheelie Hotair.com\n748568&margin=0.4&cid=155493&bn=wheeljack webmail comcast\n748163&margin=0.4&cid=155330&bn=wheeljack theblaze.com\n748566&margin=0.4&cid=155493&bn=redalert sports.yahoo.com\n746705&margin=0.4&cid=154897&bn=dc16 (unknown) www.searchtempest.com\n748480&margin=0.4&cid=155474&bn=redalert viewmixed.com\n748600&margin=0.4&cid=155528&bn=inferno rr webmail\n748418&margin=0.4&cid=155453&bn=inferno lucianne.com\n748270&margin=0.4&cid=155380&bn=sj10 (skipjack) thanhniennews.com\n748417&margin=0.4&cid=155453&bn=wheeljack mariowiki.com\n\n**Figure 26: Malware campaigns delivered via 3[rd] party ad network and the websites that hosted the**\n**ads**\n\nTo reiterate, neither the websites listed here, nor the 3[rd] party ad network, necessarily was aware of the\nmalicious ads they were serving to the website visitors. It is likely they were not aware without ad\nscreening technology.\n\nIn each event above, Invincea blocked an attempt to infect an endpoint with Cryptowall 2.0 and\nprevented CryptoWall from encrypting the user’s file system and holding it hostage. Had the user not\nbeen running Invincea, the attack would likely have been successful, and the only way the user would\nhave had to recover the encrypted files would be to pay the attacker the ransom. This is an effective\nransom technique, and one that is paying off well for the attackers, who use the income from the\nattacks to purchase Real Time Ad Bids on RTB networks to infect more users.\n\n#### Central Hosting of Clean Content \n\nMost RTB ad providers allow for advertisers to host their own ad content. This allows advertisers to\ndirectly collect web impression data of who is hitting which ads, from where, by which IPs, which useragent strings, and just about anything else you could log about a website visit. In addition, the advertising\nnetwork doesn’t have to utilize their own disk space to host the image files, the flash videos or other\nonline content. RTB networks simply do the auctioneering and redirection to the winning content.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nIt is this weakness in security that malvertisers are taking advantage of. If ad networks were to switch to\na model where all content is actually hosted by them (1[st] party hosting), in a cloud, then the risk of\nmalvertising would drop dramatically.\n\nThe [RubiconProject](http://www.rubiconproject.com/seller-cloud/) has a Seller’s Cloud, which could be a security model for the RTB industry. It is\ninherently more secure way of hosting ad content.\n\n#### How to Protect Yourself from Micro-targeted Malvertising\n\nOperation DeathClick is an active campaign to micro-target companies via malvertising in order to\ncompromise their networks. Unfortunately, the micro-targeting malvertising technique evades almost all\nnetwork controls and traditional endpoint anti-virus solutions. Invincea can protect users from this attack\ntype among other targeted and opportunistic web-based threats. For half the price of a candy bar,\nattackers have the unprecedented ability to deliver malware to you through your web browser simply\nbecause of your IP address space and your industry vertical.  Most of the attacks featured here were not\ndetected by standard Anti-Virus because the malware hashes constantly change.\n\nWeb proxy blocking updates, even in real time, will not stop new malvertising landing pages that appear\nand disappear within minutes.\n\nIntelligence feeds from the premier intelligence providers, based on hostname, IP, URL or domain will not\nbe able to block malicious malvertisers quickly enough.\n\nInvincea protected users can simply browse and click anything online without fear of compromise or\ntargeted malvertising attacks.\n\nNon-Invincea users can attempt to OptOut of directed targeting where you can. European privacy laws\nfor forcing most ad providers to offer the opt-out service; however, you often have to visit each ad\nprovider individually to choose to opt out.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----\n\nNote, that opting out merely places a blocking cookie in your browser. This means that ad providers will\nnot target or retarget based on cookies. But as shown above, the new targeted advertising is via IP\nintelligence.\n\n[http://www.rubiconproject.com/privacy/consumer-online-profile-and-opt-out/](http://www.rubiconproject.com/privacy/consumer-online-profile-and-opt-out/)\n[http://preferences-mgr.truste.com/](http://preferences-mgr.truste.com/)\n[http://www.ghosteryenterprise.com/global-opt-out/](http://www.ghosteryenterprise.com/global-opt-out/)\n\n#### Release Notes\n\n10/27: For clarification, Invincea has added additional notes in this version that the websites shown here\nand the 3[rd] party real-time ad networks are being used unwittingly and their resources misappropriated\nby malvertisers to target companies for persistent remote access, click fraud, and other nefarious\nactivities. This is not a reflection on these companies, nor the services they provide. This paper\nhighlights the problem for greater awareness so the industry collectively can combat this problem\nperhaps with more effective screening at the source prior to displaying ads.\n\nInvincea Inc Release Date: 10 27 2014\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/fy9ss400cv8irbkyrw7i72dc8xaf5xiv",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.10.27.Micro-Targeted_Malvertising/Micro-Targeted-Malvertising-WP-10-27-14-1.pdf"
    ],
    "report_names": [
        "Micro-Targeted-Malvertising-WP-10-27-14-1"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1414425321,
    "ts_modification_date": 1414425321,
    "files": {
        "pdf": "https://archive.orkl.eu/20fa586304cbbfaf23453c1bbe7033de398bd9fb.pdf",
        "text": "https://archive.orkl.eu/20fa586304cbbfaf23453c1bbe7033de398bd9fb.txt",
        "img": "https://archive.orkl.eu/20fa586304cbbfaf23453c1bbe7033de398bd9fb.jpg"
    }
}