{
    "id": "1839f065-ef74-447c-b367-0008013a414b",
    "created_at": "2023-01-12T15:01:40.230945Z",
    "updated_at": "2025-03-27T02:05:42.487399Z",
    "deleted_at": null,
    "sha1_hash": "7fb51d36b9ed9965d2a256f9e1314349b6721c7e",
    "title": "2021-11-18 - Introducing Mandiant's Digital Forensics and Incident Response Framework for Embedded OT Systems",
    "authors": "",
    "file_creation_date": "2022-05-28T19:37:42Z",
    "file_modification_date": "2022-05-28T19:37:42Z",
    "file_size": 1444926,
    "plain_text": "# Introducing Mandiant's Digital Forensics and Incident Response Framework for Embedded OT Systems\n\n**mandiant.com/resources/mandiant-dfir-framework-ot**\n\nBlog\n\nChris Sistrunk, Ken Proska, Glen Chason, Daniel Kapellmann\n\nNov 18, 2021\n\n10 mins read\n\nThreat Research\n\nIncident Response\n\nOperational Technology\n\n\n-----\n\nCollecting and analyzing forensic data is a core component of the incident response process.\nThis process is central to determining the existence, and subsequent scope of a\ncompromise, the tools used by adversaries, and their capabilities. However, obtaining digital\nforensics and incident response (DFIR) data is not always a simple task, especially when\noperational technology (OT) systems are involved.\n\nOT networks often include a variety of uncommon and sometimes obscure products that\nregularly leverage embedded software and firmware components. A good example of this is\nreal-time operating systems (RTOS) that support low latency communications for precise and\ncontinuous operation of physical production environments.\n\nAs embedded systems are normally outside of the scope of traditional forensic\nmethodologies, defenders need to identify or define tools and methodologies to gather data\nfrom these systems. A systematic approach is therefore needed to gather forensic data, build\ncollection frameworks, set security baselines, and establish structured incident response\nprocesses.\n\nIn this post, we discuss Mandiant’s “DFIR Framework for Embedded Systems,” which is built\nupon Mandiant’s world-renowned incident response methodology. Our framework explains\nhow to leverage native functionality built into OT devices and other commonly available tools\nto help asset owners prepare incident response efforts. To exemplify how to apply the last\nstep of the framework, we collect data from an example remote terminal unit (RTU) in a lab\nsetting.\n\n[Want to learn more? Enroll in our Digital Forensics and Incident Response for PLCs training](https://www.mandiant.com/media/12511/download)\ncourse.\n\n## Why Do We Need A DFIR Framework for Embedded OT Devices?\n\nTools such as [Mandiant’s Redline,](https://www.fireeye.com/services/freeware/redline.html) [FTK Imager,](https://accessdata.com/products-services/forensic-toolkit-ftk/ftkimager) [Volatility Framework, and many others have](https://github.com/volatilityfoundation/volatility)\nestablished a standard for DFIR information across IT endpoints and OT intermediary\nsystems. Based on our experience, these tools have limited value when collecting data from\nembedded systems. A DFIR framework for embedded systems is needed for the following\nreasons:\n\nGathering forensic data from OT assets helps to establish baselines for identifying\nanomalous activity, to investigate incidents, or assist vulnerability and asset\nmanagement programs.\nEmbedded OT systems often rely on non-conventional operating systems—such as\nVxWorks, QNX, or Windows CE—that support real-time functionalities in physical\nprocesses and environments. User interaction with an RTOS is not always simple and\noften limited in scope but helps us to gather forensic information.\n\n\n-----\n\nOT devices may be standalone, segmented, or air-gapped, often leading to a lack of\nvisibility and/or centralized data aggregation. Manual collection of data may be\nrequired, which can be time-consuming and problematic when responding to an\nincident.\nOrganizations that follow a structured framework to collect and analyze this information\nare likely to have increased visibility of critical assets. This provides opportunities to\nidentify malicious activity and respond promptly if there is an incident.\nOrganizations often track forensic data from assets even without realizing it. This\nhappens in the form of procurement, maintenance, or other engineering processes.\n\n## Mandiant DFIR Framework for Embedded Systems\n\nMandiant’s DFIR Framework for Embedded Systems is comprised of three steps focused on\npreparation and gathering information from embedded devices during the early stages of the\nincident response process. Although we do provide an example for data collection, this\ndocument is not intended to make readers experts in digital forensics, but instead as a guide\nto understand and apply the framework to devices they operate.\n\n\n-----\n\nFigure 1: Mandiant DFIR Framework for Embedded Systems\nThree steps to preparation:\n\n1. Identify and document the inventory of embedded devices in an environment.\n\nDetermine the tools that can be used to extract information from them.\n\n\n-----\n\n2. Collaborate with engineering team(s) and original equipment manufacturers (OEMs) to\n\nidentify additional methods, tools, data sources, and vendor points of contact that may\nassist in supporting incident response and recovery efforts.\n3. Collect data that could be useful when responding to an unexpected condition or\n\nincident.\n\nThese steps share many overlaps with forensic engineering processes familiar to OT\npersonnel, such as Root Cause Analysis (RCA) or Failure Mode and Effects Analysis\n(FMEA). While RCA and FMEA are focused on collecting and analyzing evidence for events\naffecting industrial processes, the DFIR framework for embedded systems adds the context\nof an adversary performing unauthorized activity through digital means. As a result, the\napplication of this framework is most likely to succeed when supported by both cyber security\nand engineering personnel.\n\n### Step 1: Device and Tool Identification\n\nIn this step, engineering and security teams collaborate to identify devices to collect data\nfrom, perform physical walkdowns, and review documentation—such as technical\nprocedures or vendor manuals. Information from field observations and product\ndocumentation yields important details on the different methods available to communicate\nwith a device. The most common methods are:\n\nSoftware applications utilized to connect to the device for configuration, diagnostics,\nand troubleshooting.\nTerminal, Secure Shell (SSH), File Transfer Protocol (FTP), Telnet, or other\ncommunication protocols deployed to establish command-line access to the device.\nEnabled web server to access a graphical user interface (GUI).\nPhysical ports and interfaces, such as portable media or proprietary cabling.\n\nA structured record of methods for communicating with different products is necessary to\nsustain systematic data collection. Such documentation must describe details such as\nproduct features that are disabled or blocked due to security controls, or assets that are\nsegmented and can only be accessed via portable media. The following table illustrates\ndifferent well-known OT products and the methods of communication they rely on. This\nincludes software from different OEM and different physical ports. In some cases, the\ncommunications listed may not be required or utilized for normal operations but can provide\nalternative methods of access to the device(s) when responding to an incident.\n\n\n-----\n\nTable\n\n1: Asset communications inventory example\nDefenders must also document supporting data resources such as locations for back-up\nconfigurations, device-specific technical procedures/vendor manuals, credentials, and\nindividuals responsible for performing maintenance, troubleshooting, and configurations. This\ndocumentation will help to shorten the time to recovery (TTR) and prevent unnecessary\ndelays when responding to an incident.\n\n### Step 2: OEM Collaboration\n\nIn-depth information about the functioning and features of embedded devices is most easily\nobtained with the support of OEMs. Vendors in charge of designing and producing\nembedded devices hold access to privileged information and tools that can support the\nforensic process. Oftentimes an operator will have to decide between asking the vendor for\nsupport or developing costly specialized tools to gather information from a device.\n\nGiven that most industrial environments use equipment from multiple OEMs, incident\nresponse preparation and training must also be supported with formal documentation on\nmethods to communicate with devices. Gathering this data is easier with the support of\nOEMs that often have access to more in-depth knowledge and tools to interact with their\nproducts.\n\n\n-----\n\nOEMs can help to preemptively identify what data (both volatile and non-volatile) is\navailable and how to collect it.\nOEMs often have proprietary tools or equipment that can be used to quickly collect\ndata of value or perform analysis for devices they manufacture.\nOEMs may provide replacement devices to substitute for compromised equipment\ntaken out of service.\nOEMs’ support may be needed if device specific software licenses are required\nurgently when responding to an incident.\nOEMs may have incident response guidance for asset owners to incorporate into their\nprocedures.\n\n### Step 3: Data Identification and Collection\n\nStakeholders from security and operational teams (e.g. engineering, operations, and\nmaintenance) collaborate to collect data from embedded devices based on the findings from\nthe previous steps. Collaboration from both sides helps prevent unexpected or unintentional\nadverse impacts on production. Information collected during this third step makes it possible\nto help build or enhance asset inventories and, in some cases, help establish a baseline.\n\nData identification and collection from embedded OT devices should follow the same\nstandard best practices as IT forensics—such as following the order of volatility, documenting\nthe chain of custody, and evidence preservation. However, in this case we look for different\nphysical and digital inputs that help us know more about the status of the device. The\nfollowing list provides a non-exhaustive reference of data that we consider useful for incident\nresponse and intrusion analysis.\n\n\n-----\n\nTable\n\n2: Physical and digital data from embedded OT devices\nWhile there is not a single specific solution for acquiring forensic data from embedded\ndevices, the process of becoming familiar with a device and learning how to gather\ninformation about it is consistent from one device to the next. Taking this into consideration\nwe decided to illustrate the third step of the framework using a General Electric D20MX RTU\n[that General Electric provided to Mandiant in support of research into DFIR for embedded](https://www.blackhat.com/us-16/briefings.html#whats-the-dfirence-for-ics)\n[devices. This research led to the creation of ics_mem_collect, a tool to perform basic](https://github.com/fireeye/ics_mem_collect)\nVxWorks memory collection and analysis.\n\n\n-----\n\nFigure 2: D20MX features and specifications based on publicly available information\nWe explored two alternatives to collect information from the D20MX: a command line shell\nand a GUI-based proprietary application. Using both methods we obtained different types of\ninformation.\n\n### D20M Shell\n\nAn initial exploration of available commands indicated that this method would enable us to\ncollect information for building a baseline of the device performance and perform live\nresponse when required. Information accessible via D20M shell includes device user/error\nlogs and performance, serial and configuration data. Although we tested command-line\naccess to the D20MX using the standard D20M shell, we highlight that the D20MX has two\nadditional shells that provide further access and availability to data. These shells have\nsupport for other advanced capabilities such as reading and writing memory or performing\npacket captures.\n\n\n-----\n\nFigure 3: D20MX command list\n\n### SGConfig & DS Agile Studio\n\nAn alternative to the D20M shell is SGConfig, a proprietary GUI-based application that\nadministrates many types of General Electric devices such as PLCs, RTUs, input/output\ndevices, and intelligent electronic devices (IEDs).\n\nWhile SGConfig is primarily used to manage information associated with RTU and perform\nconfiguration actions, some of its functionalities are well suited to support incident\nresponders. For example, SGconfig can export configuration data in a variety of forms\nincluding but not limited to text, binary, and compressed, and XML formatted data (Figure 4).\nOffering different file formats is useful to support analysis with different tools and\nmethodologies.\n\n\n-----\n\nFigure 4: SGConfig configuration export options\nSGConfig also contains a tool to compare binary format configuration files. Figure 5 provides\nan example of comparing a baseline export (left) to a newer exported configuration file\n(right). In our example, we modified the D20MX configuration by adding a user via the\nSGCONFIG software. Using the SGConfig “Config Compare” feature, we were able to\nidentify the user we created with the name “BackupAdmin.” The “Config Compare” feature\nidentifies the configuration table that contains the modified data. In this case per the device\nmanual, table B014USER “contains information about a user’s login name, passwords,\napplication access and other user specific information”.\n\nFigure 5: Snippet of SGConfig compare\n\n\n-----\n\n## Outlook\n\nMandiant’s DFIR Framework for Embedded Devices proposes a systematic approach to\ncollect and handle data from embedded devices. As such, the application of the framework\nshould rely on collaboration between security groups, engineers, maintenance workers, and\noperators to collect and analyze data that support response to cyber incidents. Many of the\nactions suggested in the framework leverage existing processes and procedures that can\nalso support other tasks such as disaster recovery or engineering RCA and FMEA.\n\nAlthough it was out of the scope of this framework to provide various examples of data\ncollection from different embedded products, in most cases engineering personnel may\nalready be acquainted with tools that can help your organization to follow the steps we\nsuggest. We also provide the following recommendations:\n\nCollaborate with OT teams and OEMs.\n\nIdentify OT teams and OEM point of contacts that will support incident response\nefforts. This should include engineering, operations, and maintenance teams.\nIdentify individuals with knowledge and expertise of the process and its\nembedded devices.\nWork with and communicate with these individuals to walk through the concepts\nand processes highlighted in this framework.\nIncorporate the processes described in this report into existing procedures.\n\nInclude specific verbiage and sections in incident response and/or engineering\nprocedures for cyber incidents affecting embedded industrial equipment.\nAppend inventories of embedded devices, the tools and communication methods\nidentified, and data checklists.\n\nReview data sources available and customize these lists where feasible, as\ndevice/environment configuration will vary amongst sites and industries.\nCreate processes to update and review documentation for newly acquired\nembedded industrial equipment.\nIncorporate embedded industrial equipment in incident response training and\nexercises.\n\nDevelop table-top exercises emulating cyber incident(s) affecting embedded\nindustrial equipment and practice procedure execution.\nDevelop awareness training for OT teams covering cyber-attacks and embedded\ndevices.\nWalk through the process of collecting data from embedded equipment using the\ntools documented through the first steps of this framework.\n\n[Want to learn more? Enroll in our Digital Forensics and Incident Response for PLCs training](https://www.mandiant.com/media/12511/download)\ncourse.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-18 - Introducing Mandiant's Digital Forensics and Incident Response Framework for Embedded OT Systems.pdf"
    ],
    "report_names": [
        "2021-11-18 - Introducing Mandiant's Digital Forensics and Incident Response Framework for Embedded OT Systems.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535700,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653766662,
    "ts_modification_date": 1653766662,
    "files": {
        "pdf": "https://archive.orkl.eu/7fb51d36b9ed9965d2a256f9e1314349b6721c7e.pdf",
        "text": "https://archive.orkl.eu/7fb51d36b9ed9965d2a256f9e1314349b6721c7e.txt",
        "img": "https://archive.orkl.eu/7fb51d36b9ed9965d2a256f9e1314349b6721c7e.jpg"
    }
}