{
    "id": "186d3eaf-a8ce-4410-90a6-3b4091b92265",
    "created_at": "2023-01-12T15:07:21.800323Z",
    "updated_at": "2025-03-27T02:06:10.849685Z",
    "deleted_at": null,
    "sha1_hash": "08b757473543cdd4238d2887a91f872cef4d095b",
    "title": "2021-12-21 - The Log Keeps Rolling On- Evaluating Log4j Developments and Defensive Requirements",
    "authors": "",
    "file_creation_date": "2022-05-28T19:41:22Z",
    "file_modification_date": "2022-05-28T19:41:22Z",
    "file_size": 290277,
    "plain_text": "# The Log Keeps Rolling On: Evaluating Log4j Developments and Defensive Requirements\n\n**[blog.gigamon.com/2021/12/21/the-log-keeps-rolling-on-evaluating-log4j-developments-and-defensive-requirements/](https://blog.gigamon.com/2021/12/21/the-log-keeps-rolling-on-evaluating-log4j-developments-and-defensive-requirements/)**\n\nDecember 21, 2021\n\n[Threat Research / December 21, 2021](https://blog.gigamon.com/category/threat-research/)\n\n[Joe Slowik &nbsp](https://blog.gigamon.com/author/joeslowik/)\n\n## Background\n\nThe information security world was turned upside down by the initial public disclosure of\n[vulnerability CVE-2021-44228 in the Log4j application on December 10, 2021, colloquially](http://cve.mitre.org/cgi-bin/cvename.cgi?name=2021-44228)\n[referred to as “Log4Shell.” Subsequent investigation indicated initial exploitation of the Log4j](https://nakedsecurity.sophos.com/2021/12/13/log4shell-explained-how-it-works-why-you-need-to-know-and-how-to-fix-it/)\n[application started in advance of public release, beginning as early as December 1 and](https://www.zdnet.com/article/log4j-rce-activity-began-on-december-1-as-botnets-start-using-vulnerability/)\n[proceeding through December 2. The following timeline provides an overview of events over](https://blog.talosintelligence.com/2021/12/apache-log4j-rce-vulnerability.html)\nthe past few weeks.\n\n[Although covered by various](https://www.mandiant.com/resources/log4shell-recommendations) [entities near time of initial release, including a previous](https://www.trendmicro.com/en_us/research/21/l/patch-now-apache-log4j-vulnerability-called-log4shell-being-acti.html)\nGigamon article on network observations and defensive guidance, circumstances continue to\nevolve related to Log4j exploitation activity. This blog seeks to update earlier observations\nand provide extended guidance for defenders and network owners.\n\n## Trends Since Initial Release\n\nGigamon ATR observes several trends since initial disclosure of CVE-2021-44228:\n\n1. Continued, high-volume scanning for CVE-2021-44228 by researchers and information\n\nsecurity companies, as well as potential threat actors\n[2. Expansion of use beyond cryptocurrency miner and](https://blog.checkpoint.com/2021/12/14/a-deep-dive-into-a-real-life-log4j-exploitation/) [botnet installation to access](https://blog.netlab.360.com/threat-alert-log4j-vulnerability-has-been-adopted-by-two-linux-botnets/)\n\ndevelopment and ransomware-related operations\n\n\n-----\n\n3. Increasing hype over the vulnerability as information concerning CVE-2021-44228 and\n\nother potential issues with Log4j spreads to more general audiences and non-technical\ndecisionmakers\n\nThe combination of the above items results in a confusing and difficult landscape for security\nprofessionals and leaders. While weaponization of this vulnerability now extends to a\nbroader set of more concerning adversaries (Item #2), continued scanning and related\nactivity generate significant noise making identification of truly concerning exploitation\nattempts difficult (Item #1). With the addition of more widespread awareness of the problem\n(Item #3), security teams find themselves under increasing pressure to resolve issues in a\nchaotic, uncertain network environment.\n\nTo reduce confusion, the following represents a summary of key items of interest in Log4j\nactivity since our initial publication on December 14.\n\n### State-Directed Exploitation\n\n[Reported initially by Microsoft on December 14 and extending to other security vendors](https://www.microsoft.com/security/blog/2021/12/11/guidance-for-preventing-detecting-and-hunting-for-cve-2021-44228-log4j-2-exploitation/)\nshortly thereafter, state-directed exploitation (commonly referred to as “APT” activity) of\nLog4j now appears alongside more opportunistic, less-targeted use. For defenders, it is\nimportant to note that this date represents time of disclosure rather than time of activity.\nWhile specific information unfortunately remains unavailable, the exploitation window\n(starting potentially as early as December 1) means some adversaries (including potential\nstate-nexus entities) had over a week to target this vulnerability before public disclosure.\nSecurity teams must take this into consideration when scoping investigations and framing\nforensic searches and queries for evidence of historical activity.\n\nGigamon ATR anticipates that state-directed (and other) adversaries will continue to leverage\nthis vulnerability for both initial access to victim networks and lateral movement opportunities\nfollowing a breach. As noted below, identifying and patching vulnerable services remains\ncritical, but defenders must also be diligent in pursuing post-exploitation activity and similar\nbehaviors as Log4j exploitation extends to increasingly capable and stealthy adversaries.\n\nWhile the above activity is concerning, state-directed operations will likely remain focused on\naccess development and information gathering for the foreseeable future. Organizations may\nbe concerned that CVE-2021-44228 could be used for a potentially destructive cyber\n[incident, such as the 2017 NotPetya event. While the possibility exists, Gigamon ATR](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/)\nassesses any such use would be incidental to the vulnerability in question and highly unlikely\nto spread in an uncontrolled fashion like NotPetya.\n\nAlthough some social media reports exist claiming “wormable” malware linked to Log4j\nexploitation may exist (allowing for NotPetya-like scenarios), further analysis of known\npayloads indicates reliance on static lists of targets, use of a central resource for capability\ndeployment, or other critical dependencies that remove true worm-like functionality.\n\n\n-----\n\nUltimately Log4j exploitation requires reference to a known, hosted resource to distribute\nwhatever payload is retrieved and executed by the exploit, and this dependency presents a\ncritical barrier to effective weaponization for widespread disruptive purposes. Log4j\nexploitation therefore just appears as “yet another” initial access mechanism that could be\nused for a variety of purposes, and does not appear especially capable or concerning from\nthe standpoint of enabling a widespread disruptive cyber event.\n\n### Ransomware Operations\n\nLikely more immediately critical to many organizations, ransomware-related entities appear\nto increasingly seek ways of using Log4j vulnerabilities to further operations. Starting on\nDecember 13, security firms identified possible attempts to use CVE-2021-44228 as part of\n[ransomware distribution. These observations increased in subsequent days to include](https://www.crn.com/news/security/conti-ransomware-hitting-vmware-vcenter-with-log4j-exploit)\noperations linked to entities working for or with ransomware distribution networks such as\nConti.\n\nGiven the nature of the Log4j vulnerability, Gigamon ATR assesses that most ransomware\noperations will leverage this for developing initial access to targets instead of immediately\ndeploying ransomware as part of exploitation. The general shift toward “big game”\nransomware operations — encrypting entire networks instead of individual systems —\nmeans that Log4j-focused deployment would be limited in scope if used directly. This\nobservation is reflected in Conti-related activity, where Log4j appears used as an access\nvector to then [enable follow-on lateral movement within the network](https://www.advintel.io/post/ransomware-advisory-log4shell-exploitation-for-initial-access-lateral-movement) en route to mass\ndistribution of ransomware in victim environments.\n\nLog4j activity becomes concerning for ransomware defense though given the relative ease of\n[exploitation and ability to do so external to victim networks. Given the division of labor in](https://www.digitalshadows.com/blog-and-research/ransomware-as-a-service-rogue-affiliates-and-whats-next/)\n[modern ransomware operations, where activities are divided between access brokers,](https://www.digitalshadows.com/press-releases/organizations-at-growing-risk-from-initial-access-brokers-a-fast-growing-class-of-cybercriminal-who-breach-firms-and-then-charge-others-to-do-the-dirty-work/)\nexploitation teams, and actual ransomware deployment and negotiation entities, CVE-202144228 represents an amazing opportunity to rapidly expand into a variety of potential victim\nnetworks. Such access may not be immediately utilized, but instead sold to other entities\nwho will then engage in more protracted infiltration of the victim network leading ultimately to\nransomware deployment.\n\nFrom a defender’s perspective, this activity is deeply concerning, but the sheer volume of\nactivity may represent an opportunity as well. Simply put, the overwhelming number of\npotential new access points for ransomware operators may buy defenders time in identifying\nsuch intrusions before they are handed over to other entities for follow-on actions. As with\nthe previous section, prioritizing post-exploitation behavior identification along with attack\nsurface reduction will be key both in minimizing future exploitation and in identifying existing\nadversary intrusions.\n\n### Opportunistic Scanning\n\n\n-----\n\nWhile defenders cope with the above threats, various organizations continue to scan, and at\ntimes exploit, CVE-2021-44228 for multiple purposes. On the benign (but annoying) side,\nvulnerability researchers and trackers continue to scope the extent and prevalence of\nvulnerable systems for reporting and analysis purposes. While not leading to any malicious\nactivity, the subsequent network traffic provides opportunities for more malicious entities to\n“hide” while also burning out front-line defenders responding to alerts and alarms. For\nexample, Gigamon has observed hundreds of thousands of instances of CVE-2021-44228\nexploitation activity in just a 24 hour period within a monitored environment — simply\ntracking scanning and exploitation attempts as individual alerts therefore becomes not just\nburdensome, but functionally impossible.\n\nGigamon ATR anticipates this activity will continue, albeit at a lower level following initial\nsweeps post-disclosure, for the foreseeable future. As a result, defensive postures seeking\nto identify and alert on any instance of CVE-2021-44228 exploitation or probing will likely\nresult in significant “noise” for security operations. Defenders should therefore work to\nminimize rapid response to network traffic indicative of simply attempting Log4j exploitation.\nInstead, security personnel should focus on higher-fidelity analytic or composite alerting\napproaches linking such actions with higher-confidence observations, or focusing on postexploit signs of activity across both host and network visibility.\n\n## Mitigations and Defenses\n\nDefenders face a variety of problems related to CVE-2021-44228. One item that especially\ncauses problems in scoping and understanding this vulnerability is its indirect nature. For\nexample, a vulnerable server need not be directly accessible for exploitation to occur. A\nvulnerable system (e.g., a log aggregator or similar device) needs only to receive\ncommunications or parse information using a vulnerable service for successful exploitation to\ntake place. As shown in the diagram below, an attacker initiates communication with an\nexternal-facing resource, but the actual attack payload is passed on to a remote logging\nsystem inside the victim network. This device actually processes the attack payload while\nparsing logs using the Log4j library, resulting in exploitation and subsequent communication\nto adversary infrastructure.\n\n\n-----\n\nGiven this issue, simply prioritizing external-facing servers and applications for patching and\ndefense is insufficient to address Log4j exploitation. Instead, defenders will need to identify\nsubsequent communication links and dependencies to adequately reduce or eliminate attack\nsurface. Defenders can take a variety of approaches to satisfy these needs, described in\ngreater detail in the following sections.\n\n### Patch — Or Wait?\n\nThe first and most obvious solution to this issue is to patch vulnerable systems. However,\nthis approach has several problems:\n\n1. The sheer volume of scanning and exploitation activity means that many organizations\n\nare likely already facing a compromised environment from earlier operations,\npotentially even extending to prior public release of the CVE-2021-44228 patch\n2. Patching Log4j instances directly only addresses code bases directly owned and\n\nmaintained by the organization — multiple other vendors and application developers\nwill need to patch their software to address nested use and system dependencies\n3. Log4j patching itself has become confusing with the release of multiple patches since\n\nCVE-2021-44228 identification\n\nPoint #3 is especially vexing as organizations that rushed to apply patches as soon as\npossible find themselves having to do the same thing again with each subsequent release. In\nthis case, it is worth noting that only CVE-2021-44228 allows for remote code execution\n(RCE) in default configurations of Log4j, and is addressed in version 2.15 and completely\nresolved in 2.16 by disabling JNDI. Subsequent releases address other security concerns,\nbut either of lower potential value (e.g., denial of service conditions, the impact of which will\nvary depending on the application and business purpose) or in non-default configurations.\n\n\n-----\n\nAsset owners and network defenders are strongly encouraged to read and understand\nrelease notes from the development team to understand what post-2.16 patches address.\nDepending on specific circumstances, organizations may need only be (immediately)\nconcerned with the 2.16 update, and can de-emphasize subsequent patches if CVE-202144228 and similar worries are already addressed.\n\nPoint #2 is frustrating as it applies to systems and applications outside of the defender’s\nhands. Multiple third-party software suites and applications leverage Log4j either directly or\nindirectly for functionality. Furthermore, the patching cycles of these organizations will vary\ndepending upon the complexity of the software and the resources allocated to identifying\ndependencies then fixing them. The result is organizations will likely deal with vulnerable\napplications for many weeks — if not months — to come as third parties work to address this\nissue. Defenders and decisionmakers must understand these limitations and recognize that\nvulnerability to CVE-2021-44228 will likely persist for some time irrespective of the efforts of\none’s own team.\n\nThat leads to Point #1, where organizations must come to terms with the likelihood that they\nwill face an intrusion due to this vulnerability — if they have not been breached already. This\napproach requires vectoring defensive resources and monitoring to post-exploitation activity\nand behaviors to ensure layered defense.\n\n### Post-Exploitation Monitoring\n\nMost if not all organizations will find themselves in the position of either dealing with\nintrusions already achieved via CVE-2021-44228 exploitation, or unable to completely\nmitigate exposure from this attack vector for many weeks if not months. Defenders thus find\nthemselves in the unfortunate position of dealing with intruders that have already succeeded\nin gaining access to networks. While less than desirable, this arguably reflects the reality\nnetwork defenders already manage, only instead of a phishing message or other\nmechanism, personnel must deal with this (indirect) access route instead.\n\nDefenders may find the exploitation route diagram above insightful for this activity as it\nreveals multiple opportunities for post-exploit detection. Assuming Log4j exploitation “lands”\non a supporting, internal server instead of directly impacting the device receiving the initial\nnetwork traffic, adversaries are placed in what initially appears to be an advantageous\nposition as they have already breached the perimeter. For example, a potential intruder may\nblindly scan one’s systems (or even just IP space) with an embedded exploit string. Even if\nnone of these systems are directly vulnerable, or return a message such as an HTTP 404\nresponse, any remote logging or forwarding may impact a vulnerable system linked to the\nexternal-facing service resulting in successful exploitation away from the network perimeter.\n\nThe above situation is challenging as it involves a web of dependencies, not all of which may\nbe known or obvious to IT or security personnel. Yet defenders can look for the following\ngeneral behaviors to identify post-exploitation activity:\n\n\n-----\n\n1. Identifying anomalous or unexpected traffic from an internal server (especially a high\nvalue device such as a logging or related system) to an external resource. Depending\non an organization’s tolerance and availability posture, such traffic could be blocked or\nfiltered in addition to simply observed to preemptively reduce potential attack vectors.\n2. Identifying remote authentication activity from an internal server to other hosts in the\n\nnetwork instead of the reverse. This behavior reflects an adversary attempting to\nexpand out of an initial “beachhead” in the network, but doing so by reversing the\nnormal, expected flow of remote logon activity. Essentially, we expect clients to\nauthenticate to servers, and not the opposite.\n3. Monitoring for mass connectivity events, such as attempting to write to remote shares,\n\nscanning other systems, or attempting to remotely execute commands, from a server\nwithin the network, especially a system not tasked with active network management\nand administration tasks.\n\nThe above items all rely on a degree of asset identification and role understanding (e.g.,\ndifferentiating a server from a client). But if an organization has already achieved some level\nof visibility and asset classification, powerful detection and defensive possibilities emerge for\nnot only CVE-2021-44228 post-exploitation defense, but for entire categories of adversary\ntradecraft. If this type of defense and visibility is not already present within the defended\nnetwork, asset owners should prioritize such efforts for future defensive planning and\nimplementation.\n\nIn addition to the general traffic items above, available information thus far indicates after\ninitial exploitation via CVE-2021-44228, adversaries revert to more typical, and well-known,\nintrusion techniques. For example, the Conti-related intrusions discussed previously may use\nCVE-2021-44228 as a novel form of initial access, but then use existing tradecraft\ncompromising VMWare vCenter systems to achieve follow-on lateral movement and network\nexploitation.\n\nEven more direct instances of post-exploitation activity, such as recently-identified use of\nLog4j exploitation to install Dridex or Meterpreter, requires follow-on functionality (either\nMSHTA in Windows environments or a Python script in Linux environments) for\neffectiveness. Monitoring for such activity across both host and network visibility, and\nespecially chaining or linking events between such views, can identify such suspicious\nsequences of behavior for investigation and further action — but also reveals that\nadversaries remain committed to standard tradecraft following abuse of CVE-2021-44228.\n\n## Visibility and Vigilance\n\nOverall, CVE-2021-44228 and subsequent Log4Shell activity shows the necessity of\nensuring visibility of network traffic flows and host operations. Organizations with robust\ninsights into these items have several opportunities to identify and then respond to intrusions\n\n\n-----\n\nleveraging even a nasty, widespread, trivially exploited vulnerability such as that in earlier\nversions of Log4j.\n\nWhere such visibility is lacking, network defenders and decision makers are at a loss for\nimmediate events — but should use this long-running incident as an opportunity to influence\nand guide subsequent planning and investment. Essentially, CVE-2021-44228 is a terrible\ncombination of accessibility and availability for a vulnerability, but it is not the first case of\nsuch activity, nor will it be the last. Furthermore, this vulnerability will likely persist as an issue\nfor months to come as various vendors and software developers unwind and identify product\ndependencies and subsequently fix them.\n\nBy identifying appropriate lessons from this event and its weaponization by various threat\nactors, network defenders and other stakeholders can identify priorities for future security\ninvestments. This should start with ensuring that organizations possess the necessary\nvisibility to even determine what is happening within the network, and being able to answer\nquestions such as what actions are taking place not just at the external network boundary\nbut within the organization’s environment as well.\n\n## Conclusions\n\nCVE-2021-44228 represents a very concerning security issue with immediate repercussions.\nThere are a variety of steps that security teams must take in the near-term to address these\nchallenges — but organizations and security leaders must also recognize that full response\nand mitigation of this vulnerability will likely require months of examination, patching, and\ncontinuous post-exploitation hunting to address.\n\nThe above observations and security advice represent general items applicable to all\nenvironments able to adequately view and aggressively query their network for signs of\nexploitation and follow-on activity. For organizations unable to implement this advice, this\nevent should serve as a strong signal to begin implementing programs and procedures to\nimprove insight into the defended environment so that administrators, defenders, and others\ncan respond to and reduce the impact from the next major vulnerability to emerge.\n\nMultiple stakeholders will be dealing with Log4j and its long tail of dependencies and\ninstallation instances through much of 2022. By continuously understanding how such a\nvulnerability is weaponized by attackers through intelligence and improving own-network\nvisibility and monitoring through security operations, defenders can appropriately vector\ndefenses to respond to these events and ensure that initial, potentially unavoidable breaches\nare quickly identified and removed.\n\nLike most security operations, CVE-2021-44228 response will represent a test of long-term\nendurance and planning over months rather than a quickly realized sprint to security lasting a\nfew days or weeks. The sooner network owners and defenders understand this approach,\n\n\n-----\n\nthe better the overall community will be able to respond and begin mitigating this and similar,\nfuture events.\n\n**Featured Webinars**\n\n[Hear from our experts on the latest trends and best practices to optimize your network](https://www.gigamon.com/resources/resource-library/webinar-hub.html?intcid=blog)\nvisibility and analysis.\n\nCONTINUE THE DISCUSSION\n\nPeople are talking about this in the Gigamon Community’s Network Detection & Response\nGroup.\n\n**Share your thoughts today**\n\n## RELATED CONTENT\n\nREPORT\n\n2022 Ransomware Defense Report\n\nGET YOUR COPY\n\nWEBINAR\n\nThreatINSIGHT: Eliminating Adversaries’ Dwell Time Advantage\n\nWATCH ON DEMAND\n\nWEBINAR\n\nDeep Dive INSIGHTS: Fighting Ransomware and Shifting Security Priorities\n\nWATCH ON DEMAND\n\n\n-----\n\nREPORT\n\nGigamon ThreatINSIGHT Guided-SaaS Network Detection and Response\n\nGET YOUR COPY\n\nOLDER ARTICLE\n\n[Revisiting Threat Models in the Cloud Era: A Webinar Series from ESG and Gigamon](https://blog.gigamon.com/2021/12/21/revisiting-threat-models-in-the-cloud-era-a-webinar-series-from-esg-and-gigamon/)\nNEWER ARTICLE\n\n[Customer-Based Orchestration Maximizes Choice and Eases Deployments](https://blog.gigamon.com/2021/12/22/customer-based-orchestration-maximizes-choice-and-eases-deployments/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-21 - The Log Keeps Rolling On- Evaluating Log4j Developments and Defensive Requirements.pdf"
    ],
    "report_names": [
        "2021-12-21 - The Log Keeps Rolling On- Evaluating Log4j Developments and Defensive Requirements.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536041,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1653766882,
    "ts_modification_date": 1653766882,
    "files": {
        "pdf": "https://archive.orkl.eu/08b757473543cdd4238d2887a91f872cef4d095b.pdf",
        "text": "https://archive.orkl.eu/08b757473543cdd4238d2887a91f872cef4d095b.txt",
        "img": "https://archive.orkl.eu/08b757473543cdd4238d2887a91f872cef4d095b.jpg"
    }
}