{
    "id": "189909f6-ec1c-4744-af1f-fad0a335bb96",
    "created_at": "2023-01-12T14:58:54.022049Z",
    "updated_at": "2025-03-27T02:05:54.058224Z",
    "deleted_at": null,
    "sha1_hash": "f211ddc8cd7f245681295b4f41a9a79f4fce812a",
    "title": "2022-02-26 - DiskKill-HermeticWiper, a disruptive cyber-weapon targeting Ukraine’s critical infrastructures",
    "authors": "",
    "file_creation_date": "2022-05-28T15:44:29Z",
    "file_modification_date": "2022-05-28T15:44:29Z",
    "file_size": 1041626,
    "plain_text": "# DiskKill/HermeticWiper, a disruptive cyber-weapon targeting Ukraine’s critical infrastructures\n\n**[yoroi.company/research/diskkill-hermeticwiper-a-disruptive-cyber-weapon-targeting-ukraines-critical-infrastructures/](https://yoroi.company/research/diskkill-hermeticwiper-a-disruptive-cyber-weapon-targeting-ukraines-critical-infrastructures/)**\n\nFebruary 26, 2022\n\n**Introduction**\n\nDuring the early hours of Thursday 24 February 2022, Russia launched an attack on the\ncountry of Ukraine due to the ongoing dispute over its possible inclusion within NATO\ncountries. This event has led to a tense geo-political climate within the eurozone.\n\nAll the shared Initial information shows that the attack by Russian troops was anticipated by a\nseries of cyber-attacks aimed at delaying communications and creating services interruptions\nin IT infrastructures of Ukrainian political and military bodies.\n\nThe analyzed samples are connected to a new cyber tool dubbed DiskKill/HermeticWiper,\nthis dangerous malware was designed to make every disk unusable connected to a server\ninfected with the malicious code.\n\n\n-----\n\nAccording to the technical analysis of Yoroi CERT it has been observed the use of two\ndistinct variants of the sample: one developed by the cyber-warfare departments of GRU, on\n23 February at 12:48:53 of Moscow’s time zone, a day before the invasion, meanwhile the\nsecond one at 11:37:16 of Moscow’s time zone on 28 December 2021 58 days before the\nstart of offensive operations in the Ukraine territory.\n\nCERT-Yoroi proceeded with an elevated urgency to analyze samples related to the current\ninvasion retrieved from the European intelligence community.\n\n**Technical Analysis**\n\nHermeticWiper is a cyber weapon aimed at disrupting the victim system and making\npostmortem forensic analyses harder. It has been published on VirusTotal platform the day\n2022-02-23 at 18:14:17 UTC\n\nThe sample has the following static information\n\nHash 1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\n\nThreat DiskKill/HermeticWiper\n\n\nBrief\nDescription\n\n\nWiper used in the Cyberattacks against Ukraine\n\n\nSSDEEP 1536:sBOoa7Nn52wurilmw9BgjKu1sPPxaSLyqC:sBOoa7P2wxlPwV1qPkSuqC\n\nTable 1: static information about the sample\nOnce executed, it tries to manipulate the privileges using the technique T1134 described in\nMITRE ATT&CK and elevate itself to “SeBackupPrivilege” and “SeLoadDriverPrivilege”.\n\nThe code performing this manipulation is the following:\n\n\n-----\n\n**Figure 1: Evidence of Privilege Escalation**\nWhen these privileges are successfully gained, the malware can execute all its malicious\noperations, and the most disruptive is the disk and backup manipulation. DiskKill abuses\nlegitimate drivers to manipulate and modify the disks. These drivers are located inside the\nsample’s resources as you can see from the following code:\n\n\n-----\n\nFigure 2: Loading\n\nthe drivers\nRCDATA Resource contains these drivers compiled for both 32 and 64-bit architectures, in\norder to adapt the right execution to the victim machine. Each resource is compressed by\nusing ms-compress. In particular, the driver is a legit component of the “EaseUS Partition\nMaster” tool, a widely used disk management utility. This allows attackers to manipulate and\ncorrupt the accesses to the disk drives leveraging the LOLbas attack methods.\n\nFigure 3: Content of RCDATA\nAfter loading the necessary drivers, the malware stores the just extracted file into the special\npath %System32%, before using it:\n\n\n-----\n\nFigure 4: Disabling Shadow copy\nThen, the sample proceeds to disable the dump feature in case of a crash modifying the\nregistry key “HKLM\\SYSTEM\\CurrentControlSet\\Control\\CrashControl”\n\nFigure 5: Disabling the CrashDump feature\nAnother interesting capability presented by the sample is to the Shadow Copy service\ndisabling, in order to avoid even a partial recovery of the files and the\n\nFigure 6: Disabling Shadow copy\n\n\n-----\n\nThe destructive capability of the malware is tampering and wiping the disk data, by carrying\nout a cycle of 100 iterations on the “\\\\.\\PhysicalDrive” object who it can access thanks to the\npermissions it gained before thanks to DeviceIoControl:\n\nFigure 7: Gaining access to the Physical Driver\nOnce the malware gets access to the disk, it checks if it uses NTFS or FAT file systems,\nthrough parsing the table formats. After that, depending on the case it starts to compromise\nthe drives by using the functions “CryptAcquireContextW” and “CryptGenRandom” from the\nMicrosoft Crypto API.\n\n\n-----\n\nFigure 8: Evidence of the access to the NTFS and FAT partitions\nAnother interesting feature of the sample is the use of multi-threaded functions to execute all\nthe malicious operations, efficiently parallelizing every malicious activity on the disk.\n\nFigure 9: Multithread uses\n\n**Conclusion**\n\nHermeticWiper is a new type of sabotage malware aimed to slowing down the\ncommunications among the critical infrastructures in Ukraine. In this moment, there are no\nevidence of cyber-attacks of this kind are targeting other parts of the world, anyway, it is\ncomprehensible that organizations need to re-evaluate their current cyber-risk, considering\nthe fact that we are possibly entering into a larger cyber operation.\n\n\n-----\n\nHowever, during these last critical hours, where the real war has been anticipated by the\nspreading of sabotage cyber weapons, like DDoS attacks and wipers, like this one just\nanalyzed, in the other part of the world, many companies and organizations are shocked and\nare going into a panic. The cyber defender job is lead by ethics, and critical thinking to\nanalyze and provide the strategy to protect our customers from cyber-attacks in the best way,\ntrying to limit the panic and the confusion created by such attacks, and at the same time by\nproviding actionable information for our customers, and the security community.\n\n**Indicator of Compromise**\n\n1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\n96b77284744f8761c4f2558388e0aee2140618b484ff53fa8b222b340d2a9c84\n0385eeab00e946a302b24a91dea4187c1210597b8e17cd9e2230450f5ece21da\n\n**Yara Rules**\n```\nrule hermetic_wiper { \n  meta: \n    description = \"Yara rule for the detection of DiskKill/HermeticWiper sample\" \n    author = \"Yoroi Malware ZLab\" \n    last_updated = \"2022-02-24\" \n    tlp = \"WHITE\" \n    category = “informational” \n  strings: \n    $a =\n{458c660fd6459cffd350ffd78bf885ff0f84f70000006a008d8578ffffff506a60576a006a006864000900\n  condition: \n    $a and uint16(0) == 0x5A4D \n}\n\n```\n_This blog post was authored by Luigi Martire, Carmelo Ragusa, and Luca Mella of Yoroi_\n_Malware ZLAB_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-26 - DiskKill-HermeticWiper, a disruptive cyber-weapon targeting Ukraine’s critical infrastructures.pdf"
    ],
    "report_names": [
        "2022-02-26 - DiskKill-HermeticWiper, a disruptive cyber-weapon targeting Ukraine’s critical infrastructures.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535534,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653752669,
    "ts_modification_date": 1653752669,
    "files": {
        "pdf": "https://archive.orkl.eu/f211ddc8cd7f245681295b4f41a9a79f4fce812a.pdf",
        "text": "https://archive.orkl.eu/f211ddc8cd7f245681295b4f41a9a79f4fce812a.txt",
        "img": "https://archive.orkl.eu/f211ddc8cd7f245681295b4f41a9a79f4fce812a.jpg"
    }
}