{
    "id": "18ac2e00-efef-4e7d-941e-32ef88b720dc",
    "created_at": "2023-01-12T15:01:46.931884Z",
    "updated_at": "2025-03-27T02:17:02.458897Z",
    "deleted_at": null,
    "sha1_hash": "5342194f9c24792d6dea583a91b4cc8638d7df08",
    "title": "2022-02-09 - ModifiedElephant APT and a Decade of Fabricating Evidence",
    "authors": "",
    "file_creation_date": "2022-05-28T02:34:58Z",
    "file_modification_date": "2022-05-28T02:34:58Z",
    "file_size": 437500,
    "plain_text": "# ModifiedElephant APT and a Decade of Fabricating Evidence\n\n**[sentinelone.com/labs/modifiedelephant-apt-and-a-decade-of-fabricating-evidence/](https://www.sentinelone.com/labs/modifiedelephant-apt-and-a-decade-of-fabricating-evidence/)**\n\nTom Hegel\n\n## Executive Summary\n\nOur research attributes a decade of activity to a threat actor we call ModifiedElephant.\nModifiedElephant is responsible for targeted attacks on human rights activists, human\nrights defenders, academics, and lawyers across India with the objective of planting\nincriminating digital evidence.\nModifiedElephant has been operating since at least 2012, and has repeatedly targeted\nspecific individuals.\nModifiedElephant operates through the use of commercially available remote access\ntrojans (RATs) and has potential ties to the commercial surveillance industry.\nThe threat actor uses spearphishing with malicious documents to deliver malware,\nsuch as NetWire, DarkComet, and simple keyloggers with infrastructure overlaps that\nallow us to connect long periods of previously unattributed malicious activity.\n\n[Read the Full Report](https://s1.ai/mod-elephant?lb-mode=overlay)\n\n## Background\n\n\n-----\n\nIn September 2021, SentinelLabs published research into the operations of a Turkish-nexus\n[threat actor we called EGoManiac, drawing attention to their practice of planting incriminating](https://www.sentinelone.com/labs/egomaniac-an-unscrupulous-turkish-nexus-threat-actor/)\nevidence on the systems of journalists to justify arrests by the Turkish National Police. A\nthreat actor willing to frame and incarcerate vulnerable opponents is a critically\nunderreported dimension of the cyber threat landscape that brings up uncomfortable\nquestions about the integrity of devices introduced as evidence. Emerging details in an\n[unrelated case caught our attention as a potentially similar scenario worthy of more scrutiny.](https://www.washingtonpost.com/world/asia_pacific/india-bhima-koregaon-activists-jailed/2021/02/10/8087f172-61e0-11eb-a177-7765f29a9524_story.html)\n\nLong-standing racial and political tensions in India were inflamed on January 1st, 2018 when\n[critics of the government clashed with pro-government supporters near Bhima Koregaon.](https://www.theguardian.com/world/2021/aug/12/bhima-koregaon-case-india-conspiracy-modi)\nThe event led to subsequent protests, resulting in more violence and at least one death.\n\nIn the following months, Maharashtra police linked the cause of the violence to the banned\nNaxalite-Maoist Communist party of India. On April 17th, 2018, police conducted raids and\narrested a number of individuals on terrorism-related charges. The arresting agencies\nidentified incriminating files on the computer systems of defendants, including plans for an\nalleged assassination attempt against Prime Minister Modi.\n\nThanks to the public release of digital forensic investigation results by Arsenal Consulting\nand those referenced below, we can glean rare insights into the integrity of the systems of\nsome defendants and grasp the origin of the incriminating files. It turns out that a\n[compromise of defendant systems led to the planting of files that were later used as](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-I.zip)\nevidence of terrorism and justification for the defendants’ imprisonment. The intrusions in\nquestion were not isolated incidents.\n\nOur research into these intrusions revealed a decade of persistent malicious activity\ntargeting specific groups and individuals that we now attribute to a previously unknown threat\nactor named ModifiedElephant. This actor has operated for years, evading research attention\nand detection due to their limited scope of operations, the mundane nature of their tools, and\ntheir regionally-specific targeting. ModifiedElephant is still active at the time of writing.\n\n## ModifiedElephant Targets & Objectives\n\nThe objective of ModifiedElephant is long-term surveillance that at times concludes with the\ndelivery of ‘evidence’—files that incriminate the target in specific crimes—prior to\nconveniently coordinated arrests.\n\nAfter careful review of the attackers’ campaigns over the last decade, we have identified\nhundreds of groups and individuals targeted by ModifiedElephant phishing campaigns.\nActivists, human rights defenders, journalists, academics, and law professionals in India are\nthose most highly targeted. Notable targets include individuals associated with the Bhima\nKoregaon case.\n\n## Infection Attempts\n\n\n-----\n\nThroughout the last decade, ModifiedElephant operators sought to infect their targets via\nspearphishing emails with malicious file attachments, with their techniques evolving over\ntime.\n\nTheir primary delivery mechanism is malicious Microsoft Office document files weaponized to\ndeliver the malware of choice at the time. The specific payloads changed over the years and\nacross different targets. However, some notable trends remain.\n\nIn mid-2013, the actor used phishing emails containing executable file attachments with\nfake double extensions (filename.pdf.exe).\nAfter 2015, the actor moved on to less obvious files containing publicly available\nexploits, such as `.doc,` `.pps,` `.docx,` `.rar, and password protected` `.rar files.`\nThese attempts involved legitimate lure documents in `.pdf,` `.docx, and` `.mht`\nformats to captivate the target’s attention while also executing malware.\nIn 2019 phishing campaigns, ModifiedElephant operators also took the approach of\nproviding links to files hosted externally for manual download and execution by the\ntarget.\n[As first publicly noted by Amnesty in reference to a subset of this activity, the attacker](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\nalso made use of large `.rar archives (up to 300MB), potentially in an attempt to`\nbypass detection.\n\n[Observed lure documents repeatedly made use of CVE-2012-0158,](https://nvd.nist.gov/vuln/detail/cve-2012-0158) [CVE-2014-1761,](https://nvd.nist.gov/vuln/detail/CVE-2014-1761) CVE2013-3906, [CVE-2015-1641 exploits to drop and execute their malware of choice.](https://nvd.nist.gov/vuln/detail/CVE-2015-1641)\n\nThe spearphishing emails and lure attachments are titled and generally themed around\ntopics relevant to the target, such as activism news and groups, global and local events on\nclimate change, politics, and public service. A public deconstruction of two seperate 2014\n[phishing emails was shared by Arsenal Consulting in early 2021.](https://web.archive.org/web/20210421135320/https://twitter.com/ArsenalArmed/status/1384867766675595264)\n\nSpearphishing email containing malicious attachment attributed to ModifiedElephant\nModifiedElephant continually made use of free email service providers, like Gmail and\nYahoo, to conduct their campaigns. The phishing emails take many approaches to gain the\nappearance of legitimacy. This includes fake body content with a forwarding history\ncontaining long lists of recipients, original email recipient lists with many seemingly fake\n\n\n-----\n\naccounts, or simply resending their malware multiple times using new emails or lure\ndocuments. Notably, in specific attacks, the actor would be particularly persistent and attempt\nto compromise the same individuals multiple times in a single day.\n\nBy reviewing a timeline of attacker activity, we can observe clear trends as the attacker(s)\nrotate infrastructure over the years.\n\nTimeline sample of ModifiedElephant and SideWinder C2 Infrastructure\nFor example, from early-2013 to mid-2016, a reasonably clear timeline can be built with little\noverlap, indicating a potential evolution or expansion of activities. Dates are based on first\nand last spearphishing emails observed delivering samples that communicate with a given\ndomain. Notably, a separate Indian-nexus threat actor, SideWinder, is placed alongside\nModifiedElephant in this graph as they were observed targeting the same individuals.\n\n## Weapons of Choice\n\nThe malware most used by ModifiedElephant is unsophisticated and downright mundane,\nand yet it has proven sufficient for their objectives–obtaining remote access and unrestricted\ncontrol of victim machines. The primary malware families deployed were NetWire and\nDarkComet remote access trojans (RATs). Both of these RATs are publicly available, and\nhave a long history of abuse by threat actors across the spectrum of skill and capability.\n\n\n-----\n\nOne particular activity revolves around the file `Ltr_1804_to_cc.pdf, which contains`\ndetails of an assassination plot against Prime Minister Modi. A forensic report by Arsenal\n[Consulting showed that this file, one of the more incriminating pieces of evidence obtained](https://web.archive.org/web/20210917152050/https://scroll.in/article/991095/why-isnt-the-government-looking-for-the-source-of-modi-assassination-malware-on-rona-wilsons-pc)\n[by the police, was one of many files delivered via a NetWire RAT remote session that we](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-I.zip)\n[associate with ModifiedElephant. Further analysis showed how ModifiedElephant was](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Surendra-Gadling-Report-III.zip)\nperforming nearly identical evidence creation and organization across multiple unrelated\nvictim systems within roughly fifteen minutes of each other.\n\n**Incubator Keylogger**\n\nKnown victims have also been targeted with keylogger payloads stretching as far back as\n[2012 (0a3d635eb11e78e6397a32c99dc0fd5a). These keyloggers, packed at delivery, are](https://www.virustotal.com/gui/file/d780446e89cb71d5346ac7a389266c15b0c0d5c42e46c7a88003f93aab2ba8b5)\nwritten in Visual Basic and are not the least bit technically impressive. Moreover, they’re built\nin such a brittle fashion that they no longer function.\n\nThe overall structure of the keylogger is fairly similar to code openly shared on Italian\nhacking forums in 2012. Further details of the ModifiedElephant variant can be found in our\nfull report.\n\nIn some cases, the attacker conducted multiple unique phishing attempts with the same\npayloads across one or more targets. However, ModifiedElephant generally conducts each\ninfection attempt with new malware samples.\n\n**Android Trojan**\n\nModifiedElephant also sent multiple phishing emails containing both NetWire and Android\nmalware payloads at the same time. The Android malware is an unidentified commodity\n[trojan delivered as an APK file (0330921c85d582deb2b77a4dc53c78b3).](https://www.virustotal.com/gui/file/4dbb14ff2836733b34594956c4234d2a54c04257710dd31a0884b1926d35d7bc)\n\nWhile the Android trojan bears marks of being designed for broader cybercrime, its delivery\nat the same time as ModifiedElephant Netwire samples indicates that the same attacker was\nattempting to get full coverage of the target on both endpoint and mobile. The full report\ncontains further details about the Android Trojan.\n\n## Relations to Other Threat Clusters\n\nOur research into this threat actor reveals multiple interesting threads that highlight the\ncomplex nature of targeted surveillance and tasking, where multiple actors swoop in with\ndiverse mechanisms to track the same group of individuals. These include private sector\noffensive actors (PSOAs) and groups with possible commercial facades to coordinate their\nillicit activities.\n\nBased on our analysis of ModifiedElephant, the group operates in an overcrowded target\nspace and may have relations with other regional threat actors. From our visibility, we can’t\nfurther disambiguate the shape of that relationship–whether as part of an active umbrella\n\n\n-----\n\norganization, cooperation and sharing of technical resources and targets across threat\ngroups, or simply coincidental overlaps. Some interesting overlaps are detailed below.\n\nMultiple individuals targeted by ModifiedElephant over the years have also been either\n[targeted or confirmed infected with mobile surveillance spyware. Amnesty International](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\nidentified NSO Group’s Pegasus being used in targeted attacks in 2019 against human\nrights defenders related to the Bhima Koregaon case. Additionally, the Bhima\nKoregaon case defendant Rona Wilson’s iPhone was targeted with Pegasus since\n[2017 based on a digital forensics analysis of an iTunes backup found in the forensic](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-IV.zip)\ndisk images analyzed by Arsenal Consulting.\nBetween February 2013 and January 2014 one target, Rona Wilson, received phishing\nemails that can be attributed to the SideWinder threat actor. The relationship between\nModifiedElephant and SideWinder is unclear as only the timing and targets of their\nphishing emails overlap within our dataset. This could suggest that the attackers are\nbeing provided with similar tasking by a controlling entity, or that they work in concert\nsomehow. [SideWinder is a threat actor targeting government, military, and business](https://github.com/malwarekiwi/Public-Content/raw/master/Global%20Perspective%20of%20the%20SideWinder%20APT.pdf)\nentities primarily throughout Asia.\n[ModifiedElephant phishing email payloads (b822d8162dd540f29c0d8af28847246e)](https://www.virustotal.com/gui/file/828de55ffbfb1c1b6ffcbb56b838486dbaecc9b41a0d111fcca290978ed05e95)\n[share infrastructure overlaps (new-agency[.]us) with Operation Hangover. Operation](https://web.archive.org/web/20210226131047/https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2013/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf)\nHangover includes surveillance efforts against targets of interest to Indian national\nsecurity, both foreign and domestic, in addition to industrial espionage efforts against\norganizations around the world.\nAnother curious finding is the inclusion of the string “Logs from Moosa’s” found in a\nkeylogger sample closely associated with ModifiedElephant activity in 2012\n[(c14e101c055c9cb549c75e90d0a99c0a). The string could be a reference to Moosa](https://www.virustotal.com/gui/file/b665efe9b3dd575e17631146706d6a950d642aa7b7401ac794480c2bb557594c)\n[Abd-Ali Ali, the Bahrain activist targeted around the same time, with FinFisher spyware.](https://www.theverge.com/2015/1/21/7861645/finfisher-spyware-let-bahrain-government-hack-political-activist)\nWithout greater information, we treat this as a low confidence conjecture in need of\ngreater research.\n\n## Attribution\n\nAttributing an attacker like ModifiedElephant is an interesting challenge. At this time, we\npossess significant evidence of what the attacker has done over the past decade, a unique\nlook into who they’ve targeted, and a strong understanding of their technical objectives.\n\nWe observe that ModifiedElephant activity aligns sharply with Indian state interests and that\nthere is an observable correlation between ModifiedElephant attacks and the arrests of\nindividuals in controversial, politically-charged cases.\n\n## Conclusion\n\n\n-----\n\nThe Bhima Koregaon case has offered a revealing perspective into the world of a threat\nactor willing to place significant time and resources into seeking the disruption of those with\nopposing views. Our profile of ModifiedElephant has taken a look at a small subset of the\ntotal list of potential targets, the attackers techniques, and a rare glimpse into their\nobjectives. Many questions about this threat actor and their operations remain; however, one\nthing is clear: Critics of authoritarian governments around the world must carefully\nunderstand the technical capabilities of those who would seek to silence them.\n\nFurther details, Indicators of Compromise and Technical References are available in the full\nreport.\n\n[Read the Full Report](https://s1.ai/mod-elephant?lb-mode=overlay)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-09 - ModifiedElephant APT and a Decade of Fabricating Evidence.pdf"
    ],
    "report_names": [
        "2022-02-09 - ModifiedElephant APT and a Decade of Fabricating Evidence.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88854a9f-641a-4412-89db-449b4d5cbc51",
            "created_at": "2022-10-25T16:07:23.963599Z",
            "updated_at": "2025-03-27T02:02:10.051548Z",
            "deleted_at": null,
            "main_name": "Operation HangOver",
            "aliases": [
                "Monsoon",
                "Operation HangOver",
                "Viceroy Tiger"
            ],
            "source_name": "ETDA:Operation HangOver",
            "tools": [
                "AutoIt backdoor",
                "BADNEWS",
                "BackConfig",
                "JakyllHyde",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd350b-de30-4d29-bbee-28159f26c8c2",
            "created_at": "2023-01-06T13:46:38.433736Z",
            "updated_at": "2025-03-27T02:00:02.832565Z",
            "deleted_at": null,
            "main_name": "VICEROY TIGER",
            "aliases": [
                "OPERATION HANGOVER",
                "Donot Team",
                "APT-C-35",
                "SectorE02",
                "Orange Kala"
            ],
            "source_name": "MISPGALAXY:VICEROY TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67e56ffa-aad6-4a0d-89fe-ac443dfb2f1b",
            "created_at": "2023-01-06T13:46:39.364262Z",
            "updated_at": "2025-03-27T02:00:03.062992Z",
            "deleted_at": null,
            "main_name": "ModifiedElephant",
            "aliases": [],
            "source_name": "MISPGALAXY:ModifiedElephant",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535706,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1653705298,
    "ts_modification_date": 1653705298,
    "files": {
        "pdf": "https://archive.orkl.eu/5342194f9c24792d6dea583a91b4cc8638d7df08.pdf",
        "text": "https://archive.orkl.eu/5342194f9c24792d6dea583a91b4cc8638d7df08.txt",
        "img": "https://archive.orkl.eu/5342194f9c24792d6dea583a91b4cc8638d7df08.jpg"
    }
}