{
    "id": "18ae7a05-12b1-4a52-99b2-e8f2890fa1f1",
    "created_at": "2023-01-12T15:02:51.694172Z",
    "updated_at": "2025-03-27T02:14:39.092118Z",
    "deleted_at": null,
    "sha1_hash": "dd60d02cddaba2c089ecfc8ce7d505ff581f2ee5",
    "title": "2021-09-01 - Fake pirated software sites serve up malware droppers as a service",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:47Z",
    "file_modification_date": "2022-05-28T01:22:47Z",
    "file_size": 5940480,
    "plain_text": "# Fake pirated software sites serve up malware droppers as a service\n\n**[news.sophos.com/en-us/2021/09/01/fake-pirated-software-sites-serve-up-malware-droppers-as-a-service/](https://news.sophos.com/en-us/2021/09/01/fake-pirated-software-sites-serve-up-malware-droppers-as-a-service/)**\n\nSeptember 1, 2021\n\n[During our recent investigation into an ongoing Raccoon Stealer (an information stealing](https://news.sophos.com/en-us/2021/08/03/trash-panda-as-a-service-raccoon-stealer-steals-cookies-cryptocoins-and-more/)\nmalware) campaign, we found that the malware was being distributed by a network of\nwebsites acting as a “dropper as a service,” serving up a variety of other malware packages\n—often bundling multiple unrelated malware together in a single dropper. These malware\nincluded an assortment of clickfraud bots, other information stealers, and even ransomware.\n\nWhile the Raccoon Stealer campaign we tracked on these sites took place between January\nand April, 2021, we continue to see malware and other malicious content distributed through\nthe same network of sites. Multiple front-end websites targeting individuals seeking “cracked”\nversions of popular consumer and enterprise software packages link into a network of\ndomains used to redirect the victim to the payload designed for their platform.\n\n\n-----\n\nWe discovered multiple networks using the same basic tactics in our research. All of these\nnetworks use search engine optimization to put a “bait” webpage on the first page of results\nfor search engine queries seeking “crack” versions of a variety of software products.\n\nAs we researched the Raccoon Stealer campaign, we discovered multiple other cases where\nsome of these sites had been tied to other malware campaigns. We found a variety of\ninformation stealers, clickfraud bots, and other malware delivered through the sites, including\nConti and STOP ransomware. So we began to investigate the networks behind the sites\nthemselves.\n\n## Come download me, bro\n\nMost of the bait pages we found are hosted on WordPress blog platforms. Download buttons\non these pages link to another host, passing a set of parameters that includes the package\nname and affiliate identifier codes to an application that then redirects the browser session to\nyet another intermediary site, before finally arriving at a destination.\n\nSome clicks on bait pages are directed to a download site that hosts a packaged archive\ncontaining malware. Others are steered to browser plugins or applications that fall in a\n_potentially unwanted grey area._\n\nVisitors who arrive on these sites are prompted to allow notifications; If they allow this to\nhappen, the websites repeatedly issue false malware alerts. If the users click the alerts,\nthey’re directed through a series of websites until they arrive at a destination that’s\ndetermined by the visitor’s operating system, browser type, and geographic location.\n\nThe downloads contained a variety of potentially unwanted applications and malware. We\n[downloaded installers for Stop ransomware, the Glupteba backdoor, and a variety of](https://news.sophos.com/en-us/2020/06/24/glupteba-report/)\nmalicious cryptocurrency miners (in addition to Raccoon Stealer)\n\nIn a bit of irony, many of these malware were delivered by downloads purporting to be\ninstallers for antivirus products, including 15 we examined that claimed to be licensing[bypassed versions of the Sophos-owned HitmanPro.](https://www.hitmanpro.com/en-us)\n\nBecause the dynamic delivery network acts as an intermediary between the bait sites and\nthe download sites, the same faked “cracked” product download page can deliver multiple\nmalicious campaigns at the same time, and switch from one deliverable download to another\nwhen the malware actor “customer” has burned through their paid deliveries.\n\nThese networks work in a fashion similar to those behind the “fake alert” scams we\nresearched last year. All of these activities are the product of an underground marketplace\nfor paid download services, advertised on web boards frequented by would-be\ncybercriminals. A few hundred US dollars worth of cryptocurrency can buy a malware actor\nhundreds or thousands of downloads—though the price goes up if there’s a specific\ngeographic targeting desired.\n\n\n-----\n\n(As a rule, these services do not target network addresses in Commonwealth of Independent\nStates countries.)\n\n## Special delivery\n\n“Traffic exchanges” are an old standby of malware campaigns. Often mocked on\nunderground boards as old-fashioned, these marketplaces for “software installs” are still part\nof the toolkit for a variety of malware actors and other cybercriminals, particularly for entrylevel criminals with very few skills who want to spread malware.\n\nMany of these services advertise on the same boards where they are mocked. Criminal\naffiliates can set up accounts quickly, but most require a deposit paid in Bitcoin before they\ncan begin distributing installers. InstallBest (on installs[.]info, shown below), is hosted in\nRussia. The site provides very direct instructions on how to get started, in Russian and\nEnglish:\n\nThe site also offers some advice on “best practices,” recommending against using\nCloudflare-based hosts for downloaders, as well as using URLs within Discord’s CDN,\nBitbucket, or other cloud services. As evidenced by our discovery of some of these installers\non Discord, affiliates don’t always heed this advice.\n\n\n-----\n\nOnce the affiliate deposits Bitcoin, they can set up campaigns using a simple web form.\n\nThe form allows for the selection of specific geographic distribution areas, charging more for\ntargets in the United States, Canada, and Australia.\n\n\n-----\n\nFor two dollars a drop, you can buy 1,000 downloads through this service’s distribution\nchain.\nAnother Russian-based site, shop1[.]host, promoted on underground web boards, is\napparently pivoting as it claims to be putting its payment system into maintenance for “a\nmonth or two.”\n\n## Malware middlemen\n\nSome of these services provide their own delivery networks. Others simply act as gobetweens to established traffic suppliers, including malvertising networks that pay blog\npublishers for traffic.\n\n\n-----\n\nOne of these, tied to several of the malware campaigns we found hosted on the cracked\nsoftware blogs, was powered in part by InstallUSD, an advertising network based in\nPakistan which promises a payment of up to $5 US for every software install delivered.\n\nThe homepage of InstallUSD, which brags about the network’s ability to reroute ads if they\nfail to pass Chrome’s safe browsing tests.\nInstallUSD’s site allowed site owners to register to publish download links, but required them\nto complete registration through Skype chat with a “publishers manager,” referred to as\n_Jamashad. We attempted to contact InstallUSD about their program, but received no_\nresponse.\n\nFurther investigation of InstallUSD uncovered a Facebook page for the group. A phone\nnumber provided on the organization’s Facebook page is also connected to a Facebook\npage for WorkingKeys[.]org, a website that purports to host cracked software downloads. In\nfact, that site also is connected to InstallUSD through the links that lead to the malware.\n\nThe WorkingKeys website’s domain name servers (ns1.installusd.online and\n**ns2.installusd.online) also act as domain name servers for about 150 other domains with**\nnames related to cracked software. Some of them are inactive, and some have no outbound\nlinks to downloads, but several of them are serving up malware.\n\n\n-----\n\nAs we investigated the other malicious websites tied to droppers-as-a-service, we found\nmany of them were connected to InstallUSD’s malvertising infrastructure.\n\n## Following the downloads\n\nDuring our Raccoon Stealer investigation, we found a campaign that deployed the\ninformation stealing malware via a number of .zip archives. The hosting for these files was\ntraced back to several websites purporting to distribute “cracked” versions of software\npackages, offering downloads of installers with license-bypassing schemes.\n\nThese “cracked” bait sites have continued to serve up new malware campaigns well after the\noriginal Raccoon Stealer campaign ended. Leveraging search engine optimization\ntechniques, they have jockeyed for position at the top of search engine results for cracked\nversions of a wide range of software products, but especially information security products\nand more expensive business software tools.\n\nWe appended “crack” to the names of several well-known commercial software products,\nand consistently found 15 sites on the first two pages of results. These sites fell into three\ndistinct groups, based on how they delivered victims to malware, but they all followed the\nsame general approach, and all used the same payload wrapping scheme for their\ndownloaders—leading us to believe that they were connected to a common dropper-asservice.\n\n**Method 1: InstallUSD affiliate system**\n\nA group of eight of our initial group of 15 “bait” blogs connected to infrastructure we tied to\nthe InstallUSD install-as-a-service network. These sites had download buttons driven by a\nremote JavaScript that redirected visitors through a series of sites, including trackers that\nchecked campaign-related information and generated redirects based on verification of the\ninbound link and assessment of the operating system and browser information from the\nUser-Agent headers sent with each request. The tracker sites, and many of the bait blogs,\nwere behind Cloudflare’s CDN, and almost all were registered through Namecheap.\n\nIf a user tried to download the files using a mobile, MacOS, or Linux browser, or if they had\nbrowser security plugins installed, the redirects would lead to a different monetizing\ndestination:\n\nA fake alert for mobile devices promoting the installation of a VPN or security app\nA page insisting the user install a browser plug-in to view content\n“Captcha” pages that required allowing notifications be enabled, which led to fake\nmalware alert notifications spamming to the target system\nRedirects through other affiliate programs for paid traffic, including bogus Yahoo news\npages, adult web games, and “dating” sites\n\n\n-----\n\nAn alternative destination attempts to get the victim to install a browser extension to get to\nthe download they’ll never see.\nFor those who clicked and passed the User-Agent screening, the redirects would eventually\nlead to a download page on another server. Completing the download resulted in the delivery\nof a malware payload.\n\nHow InstallUSD delivers malware droppers as a service.\n\n\n-----\n\nThe JavaScript that controlled the behavior of the download button on these eight sites came\nfrom a number of different source servers, but they all had the same basic signature. First,\nthey opened a new browser tab using forwarding links passed through referral proxies—sites\nintended to create “anonymous” links (that scrubbed the forward of any referrer reference to\nthe originating site). In early investigations, this refer proxy was nullrefer[.]com; By late July\nand August, the scripts providing the forwarding changed to the proxy href[.]li (a service\noperated by WordPress’ parent company, Automattic).\n\nThe destination site embedded in the request to the referral proxies were concealed in\nHTTPS, which concealed the actual destination from inspection by browser security tools.\nAlso embedded in the destination URL were base64-encoded text that pointed to a common\ncommand and control server.\n\nThe cross-site scripts loaded for the download buttons on these sites were fairly uniform.\nThey were all generated dynamically based on data passed as part of the URL source for the\nscript. For example this script call for a link to an copy of (ostensibly) Avast’s antivirus\nproduct:\n\n**hxxps://undesirablez[.]xyz/index.php?**\n**id=127&user=576&hash=5c20216270730bf35431cb722fef6a67&q=Avast Premier**\n**21.6.2474%20 Crack + License Key [Latest Release]**\n\nYielded this script:\n\n\n-----\n\nThe URIs generated for these scripts followed these patterns:\n\nhttps://nullrefer[.]com/?https://[first stage tracker server hostname]/index.php?\nlander=[base64 encoded URI]&pageDisplay=0\nhttps://href.li/?https://[first stage tracker server hostname]?arch=[base64 encoded\n**URL]&pageDisplay=0**\n\nEach retrieval of the script resulted in a new tracker server hostname as part of the URL, so\nno two click-throughs followed the same redirection path. However, at least some of these\nhostnames resolved to the same endpoint, as we discovered when testing some of the\ndomains.\n\nThe button scripts opened these links in a new browser tab or window. The referrer proxy\nthen redirected the page to the first stage tracker server. Decoding the Base64 text in the\nrequest they were forwarded revealed how all these trackers were tied together—in both\nformats, the text contained a URI pointing to a subdomain of InstallUSD[.]com, in this format:\n\n\n-----\n\nhxxps://landing2.installusd[.]com/display/index.php?page=querycpc/items/&aduid=[unique\n**identifier]&button=1&displaytype=0&pid=[identifying integer]&time=[Unix timestamp of**\n**request]&hash=[md5 hash of file]&q=[the name the archive was advertised under]**\n\nSo, for example, a click on a button alleged to connect to a “cracked” copy of HitmanPro,\nmade at 18:08:55 GMT on August 4, 2021 transmitted this Base64-encoded tracker link:\n\nAfter being forwarded by the proxy, the script running on the intermediary advertising tracker\nsite would process the URL. The Base64-encoded URL on landing2.installusd[.]com\nresolved to a JSON document providing confirmation of the referrer name and the payload\nexpected, in this format:\n\n{“result”:”success”,”trackUrl”:”https://href.li/?https://[second tracker server\n**hostname/{pubid}/[advertised name of download]/{hash_code}&[lowercase and no**\n**punctuation name of download file]“,”adID”:”[an identifying number for the**\n**campaign]“,”triggerTime”:0}**\n\n[So, for example, a JSON response for a click on a fake Nitro Pro download we followed](https://www.gonitro.com/download)\nyielded this JSON from landing2.installusd[.]com:\n\nUsing this JSON, the tracker server builds the link to the second stage tracker server, and\nredirects the victim’s browser to that URL (again using href.li as a proxy), in the format:\n\n\n-----\n\nhxxps://[hostname]/[the ID of the originating site]/[name of fake product]/[hash code\n**generated from the lowercase, unpunctuated filename]**\n\nThe second stage tracker would then process the name and hash, and redirect the browser\nto a download server. These servers, redirected to IP addresses, were largely short-lived\nAmazon EC2 instances.\n\nWe disrupted this delivery pipeline when we reported the landing2.installusd[.]com host to\nCloudflare, and they put an interstitial page up blocking requests. But that was not the end of\nmalware delivery for those sites. Two days later, some of the sites we tracked started using a\nslightly modified version of the same tracker architecture, using a new “lander” host and the\nsame source hosts for the downloader button scripts. Additionally, the new lander host\nrejected requests from outside the network for the JSON object, to complicate analysis.\n\n**Download Plan B**\n\nSome of the disrupted sites did not shift to the new infrastructure. Instead, using the same\nscripting hosts they had originally pointed to, they received JavaScript that launched an\nabbreviated version of the original redirect system, linking to a tracker server that redirected\ndirectly to the download server for the payload. Some did not use the href.li redirector.\n\nThe redirect scheme used to replace InstallUSD’s scheme once it was disrupted.\n\n\n-----\n\nThe URL for retrieving the button script contains three variables: s (an integer identifying\nthe source of the link), “q”(the name of the download), and “g” (another integer unique to the\nsource “blog”). These values are reflected in the returned script as variables:\n\nThe entry point of the JavaScript for “download” buttons on sites using the shorter version of\nthe redirect network.\nA function named “getThere” opens a new browser window with a URL pointing at the\ntracker server. The URL follows this format:\n\nhxxps://[tracker host name]/?s=[the integer passed as the “s” variable]&q=[the name of the\nfake cracked software product]&dedica=[the integer passed as the “g” variable]&hmac=[a\nbase64-encoded block of text]\n\n\n-----\n\nThe “getThere” function.\nThe base64-encoded text, which when decoded, is revealed to be data set of hash values.\n\nA\n\nsmaller number of sites had this style link embedded in the page code, either in a JavaScript\nfunction connected to the button or as a raw link. However, the sites that had a raw link\nassociated with the button had HTML artifacts that suggested the link may have been\nrendered by a back-end PHP plug-in—concealing the connection to the C2 providing the\nscripts behind the server.\n\nThe new tracker site itself did not appear to inspect the browser User-Agent; we reached the\nintended payload for Windows from a variety of browser agent types. However, some of the\ndownload servers did their own check, and a click on the download button from a nonWindows agent yielded a redirect to another monetizing link, such as a fake alert or “naughty\ndating” site. These sites were localized by the IP range the browser was visiting from as well.\n\nAnother set of servers implemented a different set of JavaScript.\n\n## The downloads, please\n\nRegardless of how they got to the downloads, all of these delivery methods dropped\npackages with the same basic characteristics. The download was a .zip archive file named\nafter the alleged “cracked” product sought by the target. Inside, all the archives each\ncontained an additional .zip archive and a file with “password” in its name.\n\n\n-----\n\nThe\n\ncontents of a dropper archive from the download sites.\nThese text files contained numeric passwords for the archives, and in some cases ASCII art.\n\n\n-----\n\nWhile the payload\n\npackages all use the same structure, their contents varied over time, and by site. Over the\ncourse of our investigation, we observed multiple types of droppers deployed using this\nscheme.\n\nBecause the malicious payloads are in password-protected archives–and in formats that\ncannot be opened natively by Windows Explorer–they cannot be scanned by endpoint\nsecurity tools during download (though they may be blocked by reputation by browsers, or\nbrowser plugins).\n\nThe droppers investigated during the Raccoon Stealer campaign often carried multiple\npayloads.They included a modified version of a legitimate Windows installer package\n(gdiview.msi). The contents appear to be a version of NirSoft’s GDIview freeware system\nutility, compiled in 2016.\n\n\n-----\n\nThe .MSI installer screen launched by the dropper.\n\n\n-----\n\nThe properties tab for the GDIview executable packed in the dropper show its compile date:\nDecember 4, 2016.\n\n\n-----\n\nThe readme file of the packed installer.\nThe installer package drops this legitimate (but old) version of GDIview, along with what\nappears to be an unsigned executable named Icon.controlPanelIcon.exe. It’s actually a\ndesktop icon file, and when it gets loaded in the context of GDIview, it causes an error:\n\nAll of this is a\n\ndiversion intended to make the user believe the install of the “cracked” application they\nthought they downloaded had failed. Meanwhile, the real second-stage installer is calling\nhome to retrieve yet another payload.\n\nA capture of web requests from from the dropper show an argument suggesting that this was\na paid install — with seller, price, and other metadata. The dropper here was itself sold as a\nservice, and was then distributed via a download-as-a-service network.\n\n\n-----\n\nThe first call home to the dropper’s own command and control server.\nIn our sample, this phone-home was followed by the retrieval of a third-stage dropper\nexecutable from another domain (dream[.]pics).\n\nThe strings in the real second-stage dropper includes a number of anti-analysis checks,\nlooking for virtual machine artifacts, tools used for web traffic analysis, and other sandboxing\ntools:\n\nThere is an embedded certificate in the binary. It is a decoy file, used for detecting already\ninfected systems.\n\n\n-----\n\nThe third-stage binary deploys a malicious browser extension. It also steals Facebook\ncookies to obtain account details (including linked Instagram accounts and saved credit card\ndata), grabs saved passwords from browsers on the affected machine, and installs a\nmalicious DLL the purpose of which is to forge clicks on the “like” and “subscribe” buttons of\nspecific YouTube channels.\n\n## Droppers reloaded\n\nIn our follow-up research, we found several different distinct droppers being used, most of\nthem clearly operating as droppers as a service. Among them was one much like Raccoon\nStealer, in that it was both an information stealer and a dropper-as-a-service.\n\n\n-----\n\nThe dropper is a 1.5 megabyte executable, named setup_x86_x64_install.exe in every\ndownload package we found. And we found a lot of them, in part thanks to a\nmisconfiguration of the download server that allowed us access to all the .zip archives\nstaged on it.\n\nWe managed to retrieve 286 .zip archives from this server, all containing the same dropper.\nBut the dropper samples we analyzed, while virtually identical in size and basic behavior,\neach had varying configurations, with different C2 domains and payloads. Some of the\ndroppers stored in these archives triggered ransomware alerts from Windows Defender on\nour baseline target machine–specifically for Conti. But the primary payload of this malware\ndropper appears to be the CryptBot information stealer.\n\nEvery version we found of setup_x86_x64_install.exe in these archives were 32-bit Windows\nexecutable files. Each has its own alphabet-salad name and version information:\n\n\n-----\n\nThe version.txt info embedded in the dropper.\nThe first-stage dropper’s payload is a set of set of files packed in a .cab archive named\nCABINET. In most of the samples we studied, these files were labeled as PowerPoint (.pptx)\nfiles. Others had extensions that associate them with graphics files, Word template files, and\nother (normally) benign filetypes. But they were not any of these. Instead, these files were a\nset of scripts and executables disguised to evade detection by antimalware tools. The\ndropper launches one of them with cmd.exe, essentially using it as a batch script to create\nthe second-stage malware.\n\nOne contained shell commands to extract another second-stage executable:\n\nThese domains went dark shortly after we began evaluating the droppers. But they aren’t the\nonly source of malware delivered by these groups.\n\n\n-----\n\nThis batch file does the following:\n\nIt performs a bit of anti-analysis by checking to see if the target has a system name that\nincludes “DESKTOP-“. If it does, it uses the ping command as a timer to delay execution long\nenough to cause some sandbox environments and analysis tools to time out.\n\nIt then uses the Windows findstr command to extract text from another dropped file that is\ndefinitely not a PowerPoint document (Vecchie.pptx in this sample) using a regular\nexpression to match a block of code, and writes that to an executable file (in this sample,\n**Trarre.exe.com)–an AutoIT script.**\n\nNext, it copies a third file (Fra.pptx) to a file with a single letter name (H here). That file\ncontains an obfuscated script and then passes that as a runtime parameter to the justextracted AutoIT script. A fourth dropped file is read and deleted. Then the batch script runs\nping again for 30 seconds as a timer before the AutoIT script executes itself again.\n\nThis time, the script searches for environmental settings indicating the presence of antivirus\nprotection, and looks for the location of browser cookies and cryptocurrency wallet files. It\nthen tries to download a second executable from a C2 server domain. Each dropper\nappeared to have a different C2 server, but all were all hosts with .top top-level domains,\nregistered through NiceNic.net.\n\nThe organization tied to the domains’ registrations was “Boris Godunov,” which appears to\n[have been a play on the name of the Soviet villain Boris Badunov from the 1960s-era Rocky](https://en.wikipedia.org/wiki/Boris_Badenov)\nand Bullwinkle Show. At least this threat actor has a sense of humor and a taste for eclectic\npop culture.\n\n\n-----\n\nDomain registration for one of the many .top domains used by the dropper.\nThe third stage also gathers up all system information, passwords and cookies from\nbrowsers, and other data (with strings such as cryptocurrency, Electrum, wallets, and\ndefault_wallet included in a search for cryptocurrency wallets and credentials). All this data is\npacked into a .zip archive for upload, along with a screen shot of the victim’s system:\n\nThe .zip archive, stored in\n\nthe victim’s Temp file directory.\n\n\n-----\n\nThe _information.txt file contains data about installed applications in addition to basic system\n\ninformation. The password file format, containing\n\ncredentials scraped from browsers.\n\n## The malware-industrial complex\n\n\n-----\n\nAs we noted in our Raccoon Stealer research, malware-as-a-service platforms make it\nrelatively inexpensive for would-be cybercriminals with limited skills to get started. The\nbusiness model of these services based largely on the market for stolen credentials and\ncryptocurrency fraud. The same is true of CryptBot and the other malware we saw in our\ncontinued research; they largely focused on credential theft and cryptocurrency fraud, with\nadditional fraud thrown in as a bonus.\n\nDropper packages and the malware delivery platforms that deliver them, such as the website\nnetworks we’ve investigated here, have been around for a long time, but they continue to\nthrive because of the same sort of market dynamics as those that make stealers as a service\nso profitable. They cover every other aspect of getting any malware—whether it is malwareas-a-service, off-the-shelf malware, or crafted by its operator—onto a victim’s machine, with\nlittle technical skill required from the “customer.”\n\nThe sort of “watering hole” attack we saw here uses carefully cultivated search engine\noptimization to draw in a specific kind of victim: computer users seeking pirated software.\nWhile there are sites that actually deliver key generators and “cracked” versions of software\nproducts, these sites have been intentionally crafted, along with the redirect networks they\nconnect to, to cater to a particular subset of people (with the right operating system and level\nof browser protection) with download sites laden with malware, and to make cash off of all\nother visitors by redirecting them to other paying customers. These networks are also\nresilient, using disposable domains and short-term downloader hosting for much of their\ninfrastructure.\n\nThe demand for cloud service, business email, and social media credentials sold in bulk is\nthe primary reason why otherwise low-value targets such as victims searching for cracked\nsoftware products is economically viable, and why entry-level and unskilled cybercriminals\ncontinue to purchase malware, dropper, and downloader as a service offerings.\n\nWhile in the past this may not have posed a large threat to enterprises, the blend of\nincreased work from home and increased business use of personal or shared devices makes\nthese malware campaigns an increased threat to businesses. And the use of business\nproducts as bait for these campaigns appears to target smaller businesses seeking to cut\nsome corners on software expenses.\n\nAlmost all of these malware droppers are easily detectable, and all of them were detected\neither by signature or behavior by Sophos products. But because these packages are in\nencrypted archives, they do not get detected until they are unpacked.\n\nIndicators of compromise relating to this research have been posted to the SophosLabs\nGithub.\n\n**_SophosLabs would like to thank Anand Ajjan and Andrew Brandt for their_**\n**_contributions to this report._**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-01 - Fake pirated software sites serve up malware droppers as a service.pdf"
    ],
    "report_names": [
        "2021-09-01 - Fake pirated software sites serve up malware droppers as a service.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9041c438-4bc0-4863-b89c-a32bba33903c",
            "created_at": "2023-01-06T13:46:38.232751Z",
            "updated_at": "2025-03-27T02:00:02.778714Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove"
            ],
            "source_name": "MISPGALAXY:Nitro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b44a04-a080-4465-973d-976ce53777de",
            "created_at": "2022-10-25T16:07:23.911791Z",
            "updated_at": "2025-03-27T02:02:10.025108Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove",
                "Nitro"
            ],
            "source_name": "ETDA:Nitro",
            "tools": [
                "AngryRebel",
                "Backdoor.Apocalipto",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCClient",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Spindest",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535771,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1653700967,
    "ts_modification_date": 1653700967,
    "files": {
        "pdf": "https://archive.orkl.eu/dd60d02cddaba2c089ecfc8ce7d505ff581f2ee5.pdf",
        "text": "https://archive.orkl.eu/dd60d02cddaba2c089ecfc8ce7d505ff581f2ee5.txt",
        "img": "https://archive.orkl.eu/dd60d02cddaba2c089ecfc8ce7d505ff581f2ee5.jpg"
    }
}