{
    "id": "191a3b60-c28e-4dcc-9ea9-7ac1e7bd45e6",
    "created_at": "2023-01-12T15:03:35.764606Z",
    "updated_at": "2025-03-27T02:14:58.863784Z",
    "deleted_at": null,
    "sha1_hash": "c19fd74246a4df814fb424f3f2e58dbb611f44dd",
    "title": "2016-11-15 - CryptoLuck Ransomware being Malvertised via RIG-E Exploit Kits",
    "authors": "",
    "file_creation_date": "2022-05-06T08:50:45Z",
    "file_modification_date": "2022-05-06T08:50:45Z",
    "file_size": 4224570,
    "plain_text": "# TRITON Attribution: Russian Government-Owned Lab Most Likely Built Custom Intrusion Tools for TRITON Attackers\n\n**[mandiant.com/resources/triton-attribution-russian-government-owned-lab-most-likely-built-tools](https://www.mandiant.com/resources/triton-attribution-russian-government-owned-lab-most-likely-built-tools)**\n\n## Overview\n\n[In a previous blog post we detailed the TRITON intrusion that impacted industrial control](https://www.mandiant.com/blog/threat-research/2017/12/attackers-deploy-new-ics-attack-framework-triton.html)\nsystems (ICS) at a critical infrastructure facility. We now track this activity set as\nTEMP.Veles. In this blog post we provide additional information linking TEMP.Veles and\ntheir activity surrounding the TRITON intrusion to a Russian government-owned research\ninstitute.\n\nTRITON Intrusion Demonstrates Russian Links; Likely Backed by Russian Research Institute\n\nFireEye Intelligence assesses with high confidence that intrusion activity that led to\ndeployment of TRITON was supported by the Central Scientific Research Institute of\nChemistry and Mechanics (CNIIHM; a.k.a. ЦНИИХМ), a Russian government-owned\ntechnical research institution located in Moscow. The following factors supporting this\nassessment are further detailed in this post. We present as much public information as\npossible to support this assessment, but withheld sensitive information that further\ncontributes to our high confidence assessment.\n\n1. FireEye uncovered malware development activity that is very likely supporting\n\nTEMP.Veles activity. This includes testing multiple versions of malicious software,\nsome of which were used by TEMP.Veles during the TRITON intrusion.\n2. Investigation of this testing activity reveals multiple independent ties to Russia,\n\nCNIIHM, and a specific person in Moscow. This person’s online activity shows\nsignificant links to CNIIHM.\n3. An IP address registered to CNIIHM has been employed by TEMP.Veles for multiple\n\npurposes, including monitoring open-source coverage of TRITON, network\nreconnaissance, and malicious activity in support of the TRITON intrusion.\n4. Behavior patterns observed in TEMP.Veles activity are consistent with the Moscow\n\ntime zone, where CNIIHM is located.\n5. We judge that CNIIHM likely possesses the necessary institutional knowledge and\n\npersonnel to assist in the orchestration and development of TRITON and TEMP.Veles\noperations.\n\nWhile we cannot rule out the possibility that one or more CNIIHM employees could have\nconducted TEMP.Veles activity without their employer’s approval, the details shared in this\npost demonstrate that this explanation is less plausible than TEMP.Veles operating with the\nsupport of the institute.\n\n\n-----\n\n## Detail\n\nMalware Testing Activity Suggests Links between TEMP.Veles and CNIIHM\n\nDuring our investigation of TEMP.Veles activity, we found multiple unique tools that the\ngroup deployed in the target environment. Some of these same tools, identified by hash, were\nevaluated in a malware testing environment by a single user.\n\n_Malware Testing Environment Tied to TEMP.Veles_\n\nWe identified a malware testing environment that we assess with high confidence was used to\nrefine some TEMP.Veles tools.\n\nAt times, the use of this malware testing environment correlates to in-network activities\nof TEMP.Veles, demonstrating direct operational support for intrusion activity.\n\nFour files tested in 2014 are based on the open-source project, cryptcat. Analysis\nof these cryptcat binaries indicates that the actor continually modified them to\ndecrease AV detection rates. One of these files was deployed in a TEMP.Veles\ntarget’s network. The compiled version with the least detections was later retested in 2017 and deployed less than a week later during TEMP.Veles activities in\nthe target environment.\nTEMP.Veles’ lateral movement activities used a publicly-available PowerShellbased tool, WMImplant. On multiple dates in 2017, TEMP.Veles struggled to\nexecute this utility on multiple victim systems, potentially due to AV detection.\nSoon after, the customized utility was again evaluated in the malware testing\nenvironment. The following day, TEMP.Veles again tried the utility on a\ncompromised system.\nThe user has been active in the malware testing environment since at least 2013, testing\ncustomized versions of multiple open-source frameworks, including Metasploit, Cobalt\nStrike, PowerSploit, and other projects. The user’s development patterns appear to pay\nparticular attention to AV evasion and alternative code execution techniques.\nCustom payloads utilized by TEMP.Veles in investigations conducted by Mandiant are\ntypically weaponized versions of legitimate open-source software, retrofitted with code\nused for command and control.\n\n_Testing, Malware Artifacts, and Malicious Activity Suggests Tie to CNIIHM_\n\nMultiple factors suggest that this activity is Russian in origin and associated with CNIIHM.\n\n\n-----\n\nA PDB path contained in a tested file contained a string that appears to be a unique\nhandle or user name. This moniker is linked to a Russia-based person active in Russian\ninformation security communities since at least 2011.\n\nThe handle has been credited with vulnerability research contributions to the\nRussian version of Hacker Magazine (хакер).\nAccording to a now-defunct social media profile, the same individual was a\nprofessor at CNIIHM, which is located near Nagatinskaya Street in the NagatinoSadovniki district of Moscow.\nAnother profile using the handle on a Russian social network currently shows\nmultiple photos of the user in proximity to Moscow for the entire history of the\nprofile.\nSuspected TEMP.Veles incidents include malicious activity originating from\n87.245.143.140, which is registered to CNIIHM.\n\nThis IP address has been used to monitor open-source coverage of TRITON,\nheightening the probability of an interest by unknown subjects, originating from\nthis network, in TEMP.Veles-related activities.\nIt also has engaged in network reconnaissance against targets of interest to\nTEMP.Veles.\nThe IP address has been tied to additional malicious activity in support of the\nTRITON intrusion.\nMultiple files have Cyrillic names and artifacts.\n\nFigure 1: Heatmap of TRITON attacker operating hours, represented in UTC time\n\nBehavior Patterns Consistent with Moscow Time Zone\n\nAdversary behavioral artifacts further suggest the TEMP.Veles operators are based in\nMoscow, lending some further support to the scenario that CNIIHM, a Russian research\norganization in Moscow, has been involved in TEMP.Veles activity.\n\n\n-----\n\nWe identified file creation times for numerous files that TEMP.Veles created during\nlateral movement on a target’s network. These file creation times conform to a work\nschedule typical of an actor operating within a UTC+3 time zone (Figure 1) supporting a\nproximity to Moscow.\n\nFigure 2: Modified service config\n\nAdditional language artifacts recovered from TEMP.Veles toolsets are also consistent\nwith such a regional nexus.\n\nA ZIP archive recovered during our investigations, schtasks.zip, contained an\ninstaller and uninstaller of CATRUNNER that includes two versions of an XML\nscheduled task definitions for a masquerading service ‘ProgramDataUpdater.’\nThe malicious installation version has a task name and description in English,\nand the clean uninstall version has a task name and description in Cyrillic. The\ntimeline of modification dates within the ZIP also suggest the actor changed the\nRussian version to English in sequential order, heightening the possibility of a\ndeliberate effort to mask its origins (Figure 2).\n\n\n-----\n\nFigure 3: Central Research Institute of Chemistry and Mechanics (CNIIHM) (Google Maps)\n\nCNIIHM Likely Possesses Necessary Institutional Knowledge and Personnel to Create TRITON and\nSupport TEMP.Veles Operations\n\nWhile we know that TEMP.Veles deployed the TRITON attack framework, we do not have\nspecific evidence to prove that CNIIHM did (or did not) develop the tool. We infer that\nCNIIHM likely maintains the institutional expertise needed to develop and prototype\nTRITON based on the institute’s self-described mission and other public information.\n\nCNIIHM has at least two research divisions that are experienced in critical\ninfrastructure, enterprise safety, and the development of weapons/military equipment:\n\n[The Center for Applied Research creates means and methods for protecting](https://web.archive.org/web/20180216050244/http:/cniihm.ru:80/about/napravlenie/tspr/)\ncritical infrastructure from destructive information and technological impacts.\n[The Center for Experimental Mechanical Engineering develops weapons as well](https://web.archive.org/web/20180205043945/http:/cniihm.ru:80/about/napravlenie/tsemash/)\nas military and special equipment. It also researches methods for enabling\nenterprise safety in emergency situations.\n\n\n-----\n\n[CNIIHM officially collaborates with other national technology and development](https://web.archive.org/web/20180317065353/http:/cniihm.ru/)\norganizations, including:\n\nThe Moscow Institute of Physics and Technology (PsyTech), which specializes in\napplied physics, computing science, chemistry, and biology.\nThe Association of State Scientific Centers “Nauka,” which coordinates 43\nScientific Centers of the Russian Federation (SSC RF). Some of its main areas of\ninterest include nuclear physics, computer science and instrumentation, robotics\nand engineering, and electrical engineering, among others.\nThe Federal Service for Technical and Export Control (FTEC) which is responsible\nfor export control, intellectual property, and protecting confidential information.\nThe Russian Academy of Missile and Artillery Sciences (PAPAH) which\nspecializes in research and development for strengthening Russia’s defense\nindustrial complex.\n[Information from a Russian recruitment website, linked to CNIIHM’s official domain,](https://hh.ru/employer/920436)\nindicates that CNIIHM is also dedicated to the development of intelligent systems for\ncomputer-aided design and control, and the creation of new information technologies\n(Figure 4).\n\nFigure 4: CNIIHM website homepage\n\n**Primary Alternative Explanation Unlikely**\n\nSome possibility remains that one or more CNIIHM employees could have conducted the\nactivity linking TEMP.Veles to CNIIHM without their employer’s approval. However, this\nscenario is highly unlikely.\n\n\n-----\n\nIn this scenario, one or more persons – likely including at least one CNIIHM employee,\nbased on the moniker discussed above – would have had to conduct extensive, highrisk malware development and intrusion activity from CNIIHM’s address space without\nCNIIHM’s knowledge and approval over multiple years.\nCNIIHM’s characteristics are consistent with what we might expect of an organization\nresponsible for TEMP.Veles activity. TRITON is a highly specialized framework whose\ndevelopment would be within the capability of a low percentage of intrusion operators.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Triton/TRITON Attribution - Russian Government-Owned Lab Most Likely Built Custom Intrusion Tools for TRITON Attackers.pdf"
    ],
    "report_names": [
        "TRITON Attribution - Russian Government-Owned Lab Most Likely Built Custom Intrusion Tools for TRITON Attackers.pdf"
    ],
    "threat_actors": [
        {
            "id": "5fb9f77b-1273-4658-884e-49f5f511dcd7",
            "created_at": "2022-10-25T15:50:23.591795Z",
            "updated_at": "2025-03-27T02:00:55.503775Z",
            "deleted_at": null,
            "main_name": "TEMP.Veles",
            "aliases": [
                "TEMP.Veles",
                "XENOTIME"
            ],
            "source_name": "MITRE:TEMP.Veles",
            "tools": [
                "Mimikatz",
                "PsExec",
                "TRITON"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20012494-3f05-48ce-8c0f-92455e46a4f9",
            "created_at": "2022-10-25T16:07:24.319939Z",
            "updated_at": "2025-03-27T02:02:10.169843Z",
            "deleted_at": null,
            "main_name": "TEMP.Veles",
            "aliases": [
                "ATK 91",
                "Xenotime"
            ],
            "source_name": "ETDA:TEMP.Veles",
            "tools": [
                "Cryptcat",
                "HatMan",
                "Mimikatz",
                "NetExec",
                "PsExec",
                "SecHack",
                "TRISIS",
                "TRITON",
                "Trisis",
                "Triton",
                "Wii"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0f09b73e-caa9-40e6-bd0b-c13503e4e94c",
            "created_at": "2023-01-06T13:46:39.001286Z",
            "updated_at": "2025-03-27T02:00:02.974113Z",
            "deleted_at": null,
            "main_name": "TEMP.Veles",
            "aliases": [
                "Xenotime",
                "G0088",
                "ATK91"
            ],
            "source_name": "MISPGALAXY:TEMP.Veles",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535815,
    "ts_updated_at": 1743041698,
    "ts_creation_date": 1651827045,
    "ts_modification_date": 1651827045,
    "files": {
        "pdf": "https://archive.orkl.eu/c19fd74246a4df814fb424f3f2e58dbb611f44dd.pdf",
        "text": "https://archive.orkl.eu/c19fd74246a4df814fb424f3f2e58dbb611f44dd.txt",
        "img": "https://archive.orkl.eu/c19fd74246a4df814fb424f3f2e58dbb611f44dd.jpg"
    }
}