{
    "id": "191fb5ef-47c3-420e-893a-2ba3dfcfd320",
    "created_at": "2023-01-12T15:08:09.955669Z",
    "updated_at": "2025-03-27T02:16:08.439033Z",
    "deleted_at": null,
    "sha1_hash": "20614f6c16cc5d086a962c7096dc36f1f5e31bf9",
    "title": "2018-10-25 - New Techniques to Uncover and Attribute Cobalt Gang Commodity Builders and Infrastructure Revealed",
    "authors": "",
    "file_creation_date": "2022-05-29T01:00:06Z",
    "file_modification_date": "2022-05-29T01:00:06Z",
    "file_size": 960443,
    "plain_text": "# New Techniques to Uncover and Attribute Cobalt Gang Commodity Builders and Infrastructure Revealed\n\n**[unit42.paloaltonetworks.com/unit42-new-techniques-uncover-attribute-cobalt-gang-commodity-builders-infrastructure-revealed/](https://unit42.paloaltonetworks.com/unit42-new-techniques-uncover-attribute-cobalt-gang-commodity-builders-infrastructure-revealed/)**\n\nUnit 42 October 25, 2018\n\nBy [Unit 42](https://unit42.paloaltonetworks.com/author/unit42/)\n\nOctober 25, 2018 at 6:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Cobalt](https://unit42.paloaltonetworks.com/tag/cobalt/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-new-techniques-uncover-attribute-cobalt-gang-commodity-builders-infrastructure-revealed/)\n\nNowadays, it’s very easy for an advanced attacker to use commodity tools and malware along with very simple initial delivery methods to keep\na low profile and stay away from possible attribution. One of the most common approaches is the use of spear phishing emails employing\n[social engineering or commonly used exploits (such as CVE-2017-0199 or the](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0199) [ThreadKit builder) to trick the employees of organizations of](https://www.proofpoint.com/us/threat-insight/post/unraveling-ThreadKit-new-document-exploit-builder-distribute-The-Trick-Formbook-Loki-Bot-malware)\ninterest. Once the initial infection has occurred is when the attacker becomes more sophisticated, deploying advanced custom pieces of\n[malware, more advanced tools, and/or using living-off-the land tools (such as the use of PowerShell, or tools like CMSTP or](https://attack.mitre.org/wiki/Technique/T1191) [Regsvr32).](https://attack.mitre.org/wiki/Technique/T1117)\n\nThis approach makes it more difficult for threat hunters and defenders to find those needles in the haystack necessary to identify a campaign\nand its objectives. However even if an attacker uses commodity builders and tools, there is always a chance to find specific signals or\ncharacteristics that help to identify and track an actor’s infrastructure. One of the groups well known for following these TTPs is the Cobalt\n[Gang, which is still active even after the arrest of their alleged leader in Spain this year.](https://www.europol.europa.eu/newsroom/news/mastermind-behind-eur-1-billion-cyber-bank-robbery-arrested-in-spain)\n\nDuring October 2018, Unit 42 has been investigating ongoing Cobalt Gang campaigns, as well as leveraging the latest information publicly\n[reported in research reports, such as the ones described by Talos or](https://blog.talosintelligence.com/2018/07/multiple-cobalt-personality-disorder.html) [Morphisec, to help discover and tie new infrastructure to this attack group.](https://blog.morphisec.com/cobalt-gang-2.0)\n\nAs a result, we have been able to identify both the use of a common macro builder as well as specific document metadata which have allowed\nus to track and cluster new activity and infrastructure associated with the Cobalt Gang.\n\nA Recent Effective Example of Delivery\n\nOne of the latest examples related to the campaign under analysis was used in attacks just a few days ago. It shows the simplicity of the attack\ndelivery employed by this group.\n\nThe attack reinforces the fact that email is still one of the primary attack vectors we continuously observe. This attack begins by targeting\nemployees at several banking entities across the globe using an email with subject “Confirmations on October 16, 2018”.\n\nThe sample shown in Figure 1 can already be found in popular public online malware repositories.\n\n(SHA256: 5765ecb239833e5a4b2441e3a2daf3513356d45e1d5c311baeb31f4d503703e).\n\n\n-----\n\n_Figure 1. Example of Email delivery_\n\nThe attachment is just a PDF document without any kind of code or exploit. Instead it seeks to use social engineering to convince the user\nclick a link to download a malicious macro. This is a method used before by the Cobalt Gang and discussed in previous research as for\n[example by Talos.](https://blog.talosintelligence.com/2018/07/multiple-cobalt-personality-disorder.html)\n\n_Figure 2. PDF sample with embedded link_\n\nThe PDF is simple and embeds a link that will open a legitimate Google location, and redirect the browser to a malicious document from there:\n\n_Figure 3. Malicious doc browser redirect_\n\nIn order to be effective against static analysis tools, the PDF that attackers crafted the PDF to seem more authentic: it contains empty pages\nas well as some text pages that help in not raising red flags during analysis, shown in Figures 4 and 5. Keep in mind that PDFs with low\nnumber of pages or high entropy in the content can raise suspicious flags in static analysis.\n\n\n-----\n\n_Figure 4. PDF static analysis_\n\n_Figure 5. PDF text used to fill pages_\n\nBy employing these two techniques the PDF avoids almost all traditional AV detection, resulting in a very effective transport of the first stage of\nthe attack via email.\n\nIf the attack progresses, the user will be taken to the download of an MS Word document containing malicious macros that has very low\ndetection rate at the moment of this campaign delivery. From a metadata standpoint, the document does not include any specific signal or\ncharacteristic that would help us tracking documents from the same author, as shown in Figure 6.\n\n\n-----\n\n_Figure 6. Doc102018.doc metadata_\n\n[The downloaded malicious macro uses cmstp.exe to run a “scriptlet”, a technique well known to bypass AppLocker, and continues with the](https://attack.mitre.org/wiki/Technique/T1191)\nnext stages of the payload delivery. The objective of this research is not the payload analysis, but to focus on all possible aspects of the attack\ndelivery for further tracking on the actors’ campaign and its associated infrastructure.\n\nSo, the question is now… how can this simple delivery method help identify the campaign and objectives?\n\nMacro Builder Identification\n\nThe attack also achieves quite low detection results with its macro code, so one of the first focuses of the investigation is the identification of a\npossible underlying builder. By looking into the macro code for “Doc102018.doc”, we can posit multiple theories.\n\nThe macro code is over 1500 lines in length, and starts declaring a set of variables with a very specific nomenclature (in this sample,\nletXX(num)):\n\n_Figure 7. Example of format of macro variables_\n\nSome of the variables are used in long encoding / decoding routines based on individual character assignations:\n\n\n-----\n\n_Figure 8. Using specific variable format in decoding routines_\n\nProcedures and functions are also defined using the same nomenclature (in this sample, letXX()):\n\n_Figure 9. Procedures and Functions in VBA code_\n\nAnd it makes use of the API call “CallByName” to invoke methods at runtime:\n\n_Figure 10. Use of CallByName in VBA code_\n\n[If we analyze some previous samples linked to Cobalt Gang, such as the ones depicted by Morphisec, this pattern is also observable (in this](https://blog.morphisec.com/cobalt-gang-2.0)\ncase, using PkXX instead of letXX):\n\n\n-----\n\n_gu e_ _patte_ _ot e docu_ _e ts_\n\nOne initial approach to hunt for the pattern can be based on the following regular expressions for the different areas:\n\nVariable definitions /[A-Za-z]k[0-9]{2}([0-9]{1})/\nFunction definitions /Private Function [A-Za-z]{2,5}[0-9]{2,3}\\(/\n\nProcedure definitions /Sub [A-Za-z]{2,5}[0-9]{2,5}\\(/\n\nIn order to test our hypothesis for the builder we created the following Yara rules:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n\n\nrule cmstp_macro_builder_rev_a\n{\nmeta:\ndescription=\"CMSTP macro builder based on variable names and runtime invoke\"\nauthor=\"Palo Alto Networks Unit42\"\nstrings:\n$method=\"CallByName\"\n$varexp=/[A-Za-z]k[0-9]{2}([0-9]{1})/\ncondition:\n$method and\n#method == 2 and\n#varexp > 10\n}\nrule cmstp_macro_builder_rev_b {\nmeta:\ndescription=\"CMSTP macro builder based on routines and functions names and runtime invoke\"\nauthor=\"Palo Alto Networks Unit42\"\nstrings:\n$func=/Private Function [A-Za-z]{1,5}[0-9]{2,3}\\(/\n$sub=/Sub [A-Za-z]{1,5}[0-9]{2,5}\\(/\n$call=\"CallByName\"\ncondition:\n$call and\n#func > 1 and\n#sub > 1\n}\n\n\nHunting with these Yara rules leads to very positive results identifying this builder as well as a set of malicious documents using it. But the\ndocuments identified are not always targeting the finance or banking industries, and so, we cannot guarantee that this builder is only used by\nthis specific Cobalt Gang group and its campaigns against those industries.\n\nHowever, using this in combination with other aspects such as the target, payload, or dropper characteristics, becomes very useful in tracking\nthis group’s campaigns, as we will see in the following sections.\n\nLet’s focus then on the first stage of the delivery, the PDF documents.\n\nCommon Signals in PDF Documents\n\nAs we have seen, the use of a commodity PDF file with an embedded Google redirect link results in a very effective social engineering artifact.\nAs there is no exploit or code executed, our research will now be focused on the metadata information from the document for further analysis.\n\n\n-----\n\n_Figure 12. PDF Exiftool metadata_\n\nOur next hypothesis would be to check if the PDF documents could have been created based on a template document, where the author\nmodifies the embedded link in the PDF and saves different document versions over time.\n\nBased on the [XMP specification, we will pay attention to the values of the “DocumentID” and “InstanceID” Media Management Properties:](https://wwwimages2.adobe.com/content/dam/acom/en/devnet/xmp/pdfs/XMP%20SDK%20Release%20cc-2016-08/XMPSpecificationPart1.pdf)\n\n_Figure 13. XMP Media Management Properties_\n\nIn order to confirm this hypothesis, let’s focus on the Document ID metadata field. Basically, saving the same template twice with 2 different\nlinks would produce the same Document ID but multiple Instance ID values (one per saved document).\n\nSearching our telemetry data for this metadata content produces interesting results.\n\nIn order to help hunting for the content, the following Yara rule also could be used:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n\nrule cobaltgang_pdf_metadata_rev_a{\nmeta:\ndescription=\"Find documents saved from the same potential Cobalt Gang PDF template\"\nauthor=\"Palo Alto Networks Unit 42\"\nstrings:\n$ = \"<xmpMM:DocumentID>uuid:31ac3688-619c-4fd4-8e3f-e59d0354a338\" ascii wide\ncondition:\nany of them\n}\n\n\nThe results confirm our hypothesis (see Appendix for IOCs), and we have been able to find multiple PDF files that the attacker has saved with\ndifferent contents but starting on the same “template”, all of them sharing the same characteristics.\n\n(different content)\n\n\n-----\n\n_Figure 14. Example PDF document_\n\nFurther analysis on the subsequent stages of the attack will allow us to confirm if the samples are related to Cobalt Gang campaigns.\n\nFor example, let’s analyze the following document:\n\n**Observed File Name** **SHA256**\n\nREMITTER REFERENCE PMT.pdf 1d0aae6cff1f7a772fac67b74a39904b8b9da46484b4ae8b621a6566f7761d16\n\nThe document was delivered by email, with the subject “Fund Transfer 08-October-2018\", targeting banking customers:\n\n_Figure 15. Email data associated to REMITTER REFERENCE PMT.pdf_\n\nAnd it contains the embedded link redirecting to the following URL:\n\nhxxps://fundswp[.]com/Document082018.doc\n\nWhich downloads the document:\n\n**Observed File Name** **SHA256**\n\nDocument082018.doc 020ba5a273c0992d62faa05144aed7f174af64c836bf82009ada46f1ce3b6eee\n\nBy extracting the macro code, we can validate how it matches the macro builder described in the previous section. The following output shows\nhow running the Yara rule searching for the macro builder against the extracted VBA contents of the document produces the expected match\nin its contents:\n\n\n1\n2\n3\n4\n5\n6\n7\n\n\n❯ yara cmstp_macro_builder.yar 020ba5a273c0992d62faa05144aed7f174af64c836bf82009ada46f1ce3b6eee_subfiles\n\ncmstp_macro_builder_2\n020ba5a273c0992d62faa05144aed7f174af64c836bf82009ada46f1ce3b6eee_subfiles/e657fe761effbe7e11e3cc343ba6845c2c9a6c989e7b80\n\ncmstp_macro_builder_2\n020ba5a273c0992d62faa05144aed7f174af64c836bf82009ada46f1ce3b6eee_subfiles/8a6d2cccb6f2007cb7fa29d3f009f9fbe305bffc45dc35d3\n\n\nThe pieces of our puzzle start to match for this campaign if we now put things in perspective:\n\n1. Hunting for PDF files that are created with the same “DocumentID” management metadata field result in a set of files that have been\n\nused in email delivery against banking entities.\n2. All of the PDF files embed a link based on a Google redirect, leading to the download of a Microsoft Office document file.\n3. The Microsoft Office document files contain macros for code execution. Those macros match the characteristics of the builder that we\n\nhave characterized.\n\nDiscovering the Attacker’s Infrastructure\n\n\n-----\n\nt t ese esu ts obta ed, e ca sta t to o e to a ds d g attac e ast uctu e p eces based o u t p e aspects, suc as t e u t g\nrules defined in previous sections, session data obtained by our telemetry, or public WHOIS registrar data.\n\n**Using our “hunting rules”**\n\nBased on the metadata and builder characteristics, we have tracked a set of malicious PDF and Office files (see Appendix) that provide us with\ndomains and Office files in use by the attacker.\n\nSome examples of the PDF and embedded C2 links and document names are below in Table 1:\n\n**SHA256** **Embedded Link**\n\n1fd9ba8eb97bf03cd4d3cbaac867595c920f1f36ebfbe9c1fc76558ea5e0ece5 hxxp://www[.]pedidoslalacteo[.]com[.]ar/Proof-of-payment19.09.2018.doc\n\n5ac1612535b6981259cfac95efe84c5608cf51e3a49b9c1e00c5d374f90d10b2 hxxps://s3[.]sovereigncars[.]org[.]uk/inv005189.pdf\n\n07f60611836c0a679c0fb2e25f5caeb4d29cd970919d47f715666b80be46f45c hxxps://alotile[.]biz/Document092018.doc\n\n9d6fd7239e1baac696c001cabedfeb72cf0c26991831819c3124a0a726e8fe23 hxxps://goo[.]gl/mn7iGj\nWhich redirects to: hxxps://document[.]cdnone[.]biz/doc000512.pdf\n\n444c63bb794abe3d2b524e0cb2c8dcc174279b23b1bce949a7125df9fab25c1c hxxps://safesecurefiles[.]com/doc041791.pdf\n\na5f2ad08b5afdbd5317b51d0d2dd8f781903522844c786a11a0957a81abfd29e hxxp://www[.]mky[.]com/Proof-of-payment-19.09.2018.doc\n\ndf18e997a2f755159f0753c4e69a45764f746657b782f6d3c878afb8befe2b69 hxxps://mail[.]halcyonih[.]com/uploads/doc004718538.pdf\n\n_Table 1. Example PDF and embedded links_\n\nThe PDF documents and URLs allowed us to discover multiple overlaps between this new infrastructure and the existing knowledge about\nCobalt Gang attributed activity in previous research, corroborating new infrastructure belonging to the same attacker.\n\nLet’s see a couple of examples of PDF documents from the list which belong to the same Document ID.\n\n**Observed File Name** **SHA256**\n\ninv005189.pdf 5ac1612535b6981259cfac95efe84c5608cf51e3a49b9c1e00c5d374f90d10b2\n\n[This sample has been already documented in previous campaigns, being related to s3[.]sovereigncars[.]org[.]uk domain. See the Talos blog.](https://blog.talosintelligence.com/2018/07/multiple-cobalt-personality-disorder.html)\n\n**Observed File Name** **SHA256**\n\ndoc000512.pdf 9d6fd7239e1baac696c001cabedfeb72cf0c26991831819c3124a0a726e8fe23\n\nThe sample embeds the URL hxxps://goo[.]gl/mn7iGj which is actually a shortened URL resolving to hxxps://document[.]cdnone[.]biz/doc000512.pdf.\n\nDomain cdn-one[.]biz is a well-known Cobalt Gang attributed domain in previous analysis.\n\nThe complete list of domains used by the PDF identified can be found in the Appendix section.\n\n**Pivoting on Email Sender Telemetry**\n\nBased on email delivery data, our telemetry helps us collecting samples related and indicators related to the campaign.\n\nLet’s put a simple example of how tracking session data lead us to new infrastructure, by using some of the email sender data that is identified\nin malicious email sessions sending the PDF documents.\n\nFor example, the following senders belong to the recent campaign and are spoofing both legitimate email domains and senders:\n\n[dominique.denis-berube.1@ulaval.ca](http://10.10.0.46/mailto:dominique.denis-berube.1@ulaval.ca)\n\n[billb@verticalwebmedia.combillb@verticalwebmedia.com](http://10.10.0.46/mailto:billb@verticalwebmedia.com)\n\n[benoit.filion.2@ulaval.cabenoit.filion.2@ulaval.ca](http://10.10.0.46/mailto:benoit.filion.2@ulaval.ca)\n\ndominique.denis-berube.1@ulaval.ca\n\nSome of the samples delivered by these senders and their embedded links are shown below in Table 2:\n\n\n-----\n\n**SHA256** **Embedded link**\n\n1c1a6bb0937c454eb397495eea034e00d1f7cf4e77481a04439afbc5b3503396 hxxps://alotile.biz/Document092018.doc\n\n187e0d911cd0393caad1364ded1c394257cd149898b31f9718c7c6319af79818 hxxps://alotile.biz/Document042018.doc\n\n988d430ce0e9f19634cf7955eac6eb03e3b7774b788010c2a9742b38016d1ebf hxxps://fundsxe.com/Document09202018.doc\n\n852f11e5131d3dab9812fd8ce3cd94c1333904f38713ff959f980a168ef0d4ce hxxps://fundsxe.com/Document09222018.doc\n\n_Table 2. Email sender associated PDFs and embedded links_\n\nThese sample are delivered under the following file names:\n\nREMITTER REFERENCE PMT.pdf\n\nAml_S0680260A79301.pdf\n\nCIT180126-000768.pdf\n\nAMENDMENT.pdf\n\nCiti720TEME171440008_Query.pdf\n\nQuery _S-170526-005399.pdf\n\nBoth the domains and file names correlate with the results of the domains obtained based on hunting for PDFs metadata and macro builder\nstructure, allowing us to keep tracking new activity over time.\n\nWHOIS Registrar Overlaps\n\nTwo of the newly discovered domains used by the collected PDF documents have very interesting registrant information, pointing to a public\nregistrant name, “grigoredanbadescu”.\n\n_Figure 16. Historical DNS data on safesecurefiles[.]com_\n\n**Domains:**\n\nsafesecurefiles[.]com\n\ndocument[.]cdn-one[.]biz\n\n**WHOIS registrar information:**\n\ngrigoredan@centrum.cz\nGrigoredanbadescu\n\n+4001289858474 (Romania)\n\nBrasov\n\nRomania\n\nBy pivoting on infrastructure related to the same registrant data we can obtain a very interesting set of domains:\n\narubrabank[.]com\n\n\n-----\n\nout oo 368[ ]co\n\nusasecurefiles[.]com\n\nsafesecurefiles[.]com\n\nms-server838[.]com\n\nmsoffice-365[.]com\n\ntotal-share[.]biz\n\nbank-net[.]biz\n\ncdn-one[.]biz\n\ntotal-cloud[.]biz\n\nweb-share[.]biz\n\ncloud-direct[.]biz\n\nn-document[.]biz\n\nmy-documents[.]biz\n\nfirstcloud[.]biz\n\nyourdocument[.]biz\n\nxstorage[.]biz\n\nsafe-cloud[.]biz\n\nvia24[.]biz\n\nzstorage[.]biz\n\nwebclient1[.]biz\n\nbnet1[.]biz\n\nfirstcloud[.]biz\n\nmycontent[.]biz\n\ntotal7[.]biz\n\nfreecloud[.]biz\n\ncontents[.]bz\n\njudgebin[.]bz\n\nMany of the domains listed are already known as malicious domains attributed to other Cobalt Gang campaigns.\n\nAs an important note “arubrabank[.]com” is a new domain registered on 2019-09-18 and still not observed in an active campaign.\n\nThe domain seems to be intended to mimic the legitimate Arubabank website for further activity:\n\n_Figure 17 Arubabank legitimate site_\n\n\n-----\n\nast uctu e e at o s ps\n\nLet’s summarize all the pieces of our puzzle, now that we can put together all the relationships we observed.\n\n_Figure 18. Maltego graph. Summary of relations and overlaps._\n\nAs it can be observed in the different clusters of activity:\n\n1. The initial cluster of PDF documents, on the left, links to specific domains for the download of Microsoft Office files using the macro\n\nbuilder structure.\n2. Some of the domains in use are publicly registered with the name of “grigoredanbanescu” and allow us to find other related domains,\n\nwhich are already linked to previous Cobalt Gang activity.\n3. Some of the initial PDFs have relations with Microsoft Office files linked to “grigoredanbanescu” activity, confirming again the\n\nrelationships.\n\nConclusion\n\nCommodity attacks are widely used for both criminal and more targeted attacks, making identification difficult for networks defenders and\nthreat hunters. One actor that makes extensive use of this approach to compromise victims is the Cobalt Gang.\n\nBy focusing on specific aspects of the macro builders and metadata the actors left behind we were able to develop new mechanisms to track\nand hunt Cobalt Gang activity and infrastructure.\n\nPalo Alto Networks customers are protected in the following ways:\n\nWildFire detects malware samples used by this campaign.\nTraps prevents these attacks at the endpoint.\nAll involved malicious domains have been covered by PAN-DB URL Filtering.\n[An Autofocus tag has been created for tracking CobaltGang actor group.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.CobaltGang)\n\nAppendix – Indicators of Compromise\n\n**Initial example**\n\n**Type** **SHA256**\n\nEmail 2f74c8b55292d59ab66960f21a4413d4d54f8b7500bb385954e7ffe68d775443\n\nPDF 57f65ecb239833e5a4b2441e3a2daf3513356d45e1d5c311baeb31f4d503703e\n\nMicrosoft Office Document 07a3355f81ff69a197c792847d0783bfc336181d66d3a36e6b548d0dbd9f5a9a\n\nDomain transef[.]biz\n\n**Outlook messages**\n\n477c432382c97648767ee45c264f0f2aaf8d3d9f9ed547d8418db12b7c140760\n\ne0f1dbc10088b68f772ee73b0785c3d67b8e5f147b687911613d163ad5ebda6d\n\ne6a17617eaa98c49bfb2c9d3d090ffea69bb0c1864c43861bdf8d027339ea847\n\n\n-----\n\n**c oso t O** **ce** **ocu** **e t (** **ac o bu de )**\n\n020ba5a273c0992d62faa05144aed7f174af64c836bf82009ada46f1ce3b6eee\n\n8004601c08983420408d2784e2a4aa79de426d41a09726a884edcb21f83ee7f8\n\nd8a2384a51cd59f6390e6a4fcb04b51358cdbd5e04cae5be23daae548c306a73\n\n161ba501b4ea6f7c2c8d224e55e566fef95064e1ed059d8287bc07e790f740e8\n\n62a278119d732e4c839ee074553f087588a9040be027bdf9e617413c6fd2e9af\n\n641d692386dab5ca60f4c6b1da0edecc5c3473c9a7d187dad6098786404780a3\n\n07a3355f81ff69a197c792847d0783bfc336181d66d3a36e6b548d0dbd9f5a9a\n\n161ba501b4ea6f7c2c8d224e55e566fef95064e1ed059d8287bc07e790f740e8\n\n12ecb6b3780cd19ea84f6e84e816a701e8231441bf90145481baa0648139e001\n\na6f941fcec01fb006fc51df96396aeeb826cdf3864756669e19cb145fe41692f\n\n19dc9b93870ddc3beb7fdeea2980c95edc489040e39381d89d0dfe0a825a1570\n\ncb5644bd670dcd9caf5185ebe396996e514ed1d93982157186611135aea79bd3\n\na0111977c79f4eb30511f22055b54e4e973c0501240f3ba462691b1b4999d561\n\n**PDF Documents**\n\n3a7525ffa571775aca45551ebd2c192d9b8ed45db1a61bdd8398d91db885d7a2\n\n1d0aae6cff1f7a772fac67b74a39904b8b9da46484b4ae8b621a6566f7761d16\n\n1c1a6bb0937c454eb397495eea034e00d1f7cf4e77481a04439afbc5b3503396\n\n187e0d911cd0393caad1364ded1c394257cd149898b31f9718c7c6319af79818\n\n988d430ce0e9f19634cf7955eac6eb03e3b7774b788010c2a9742b38016d1ebf\n\n852f11e5131d3dab9812fd8ce3cd94c1333904f38713ff959f980a168ef0d4ce\n\n9d6fd7239e1baac696c001cabedfeb72cf0c26991831819c3124a0a726e8fe23\n\n5ac1612535b6981259cfac95efe84c5608cf51e3a49b9c1e00c5d374f90d10b2\n\ndf18e997a2f755159f0753c4e69a45764f746657b782f6d3c878afb8befe2b69\n\na5f2ad08b5afdbd5317b51d0d2dd8f781903522844c786a11a0957a81abfd29e\n\n66bd5e492531adf675897de5de8aee427b896c9b2c406daff006ce6a4e8aa810\n\n1fd9ba8eb97bf03cd4d3cbaac867595c920f1f36ebfbe9c1fc76558ea5e0ece5\n\nd5328e519daadaf1520619da1f24f6d81d23c84222640058bbb366752be93537\n\n94c9fa812cebb733eda3a4eed33a0a49b60c207bb0f9153c0d08724c8b30f578\n\n07f60611836c0a679c0fb2e25f5caeb4d29cd970919d47f715666b80be46f45c\n\n7b9c183dc40c8d765e98024f8fb6565c69dee2bb97957c5ba754a23d2698bf7a\n\n195580b78e144f66ac1f9be2b927d7828ed1dc3974dc1897e0ed59a96ac8f4e1\n\n444c63bb794abe3d2b524e0cb2c8dcc174279b23b1bce949a7125df9fab25c1c\n\n07f60611836c0a679c0fb2e25f5caeb4d29cd970919d47f715666b80be46f45c\n\n7629dfcc9345578626a250afb67027955c6f78dd80b771c2968c5be0d4b11c59\n\n195580b78e144f66ac1f9be2b927d7828ed1dc3974dc1897e0ed59a96ac8f4e1\n\nb92707ebfaa15225064ff3a1a7d279b3dde1e70200e37d0074e9acc160cb16a7\n\n\n-----\n\neb 309ecd6c a09 e 5 d9e90 d30 b bd3e d 6 9 0 5bdb9cc38bca\n\n57f65ecb239833e5a4b2441e3a2daf3513356d45e1d5c311baeb31f4d503703e\n\n**Domains**\n\nalotile[.]biz\n\nfundsxe[.]com\n\ns3[.]sovereigncars[.]org[.]uk\n\nsafesecurefiles[.]com\n\ndocument[.]cdn-one[.]biz\n\nmail[.]halcyonih[.]com\n\ntransef[.]biz\n\n**Domains registered by “grigoredanbanescu”**\n\narubrabank[.]com\n\noutlook-368[.]com\n\nusasecurefiles[.]com\n\nsafesecurefiles[.]com\n\nms-server838[.]com\n\nmsoffice-365[.]com\n\ntotal-share[.]biz\n\nbank-net[.]biz\n\ncdn-one[.]biz\n\ntotal-cloud[.]biz\n\nweb-share[.]biz\n\ncloud-direct[.]biz\n\nn-document[.]biz\n\nmy-documents[.]biz\n\nfirstcloud[.]biz\n\nyourdocument[.]biz\n\nxstorage[.]biz\n\nsafe-cloud[.]biz\n\nvia24[.]biz\n\nzstorage[.]biz\n\nwebclient1[.]biz\n\nbnet1[.]biz\n\nfirstcloud[.]biz\n\nmycontent[.]biz\n\ntotal7[.]biz\n\nfreecloud[.]biz\n\n\n-----\n\nco te ts[ ]b\n\njudgebin[.]bz\n\n**URLs**\n\nhxxp://www[.]pedidoslalacteo[.]com[.]ar/Proof-of-payment-19.09.2018.doc\n\nhxxps://s3[.]sovereigncars[.]org[.]uk/inv005189.pdf\n\nhxxps://alotile[.]biz/Document092018.doc\n\nhxxps://goo[.]gl/mn7iGj\n\nhxxps://document[.]cdn-one[.]biz/doc000512.pdf\n\nhxxps://safesecurefiles[.]com/doc041791.pdf\n\nhxxp://www[.]mky[.]com/Proof-of-payment-19.09.2018.doc\n\nhxxps://mail[.]halcyonih[.]com/uploads/doc004718538.pdf\n\nhxxps://e-dropbox[.]biz/doc058915654e.pdf\n\nhxxp://www[.]bit[.]do/etaYk\n\nhxxps://cloud-direct[.]biz/doc0047581678.pdf\n\nhxxps://transef[.]biz/Doc102018.doc\n\n**Observed File Names**\n\nDocument082018.doc\n\nREMITTER REFERENCE PMT.pdf\n\nAml_S0680260A79301.pdf\n\nCIT180126-000768.pdf\n\nAMENDMENT.pdf\n\nCiti720TEME171440008_Query.pdf\n\nQuery _S-170526-005399.pdf\n\nDocument092018.doc\n\nProof of payment 19.09.2018.doc\n\nDocument092018.doc\n\ndoc005681.doc\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-10-25 - New Techniques to Uncover and Attribute Cobalt Gang Commodity Builders and Infrastructure Revealed.pdf"
    ],
    "report_names": [
        "2018-10-25 - New Techniques to Uncover and Attribute Cobalt Gang Commodity Builders and Infrastructure Revealed.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "220e1e99-97ab-440a-8027-b672c5c5df44",
            "created_at": "2022-10-25T16:47:55.773407Z",
            "updated_at": "2025-03-27T02:05:17.379427Z",
            "deleted_at": null,
            "main_name": "GOLD KINGSWOOD",
            "aliases": [
                "Cobalt Spider ",
                "Cobalt Gang "
            ],
            "source_name": "Secureworks:GOLD KINGSWOOD",
            "tools": [
                " Buhtrap",
                " Carbanak",
                " Cobalt Strike",
                " CobtInt",
                " Cyst",
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " SpicyOmelette",
                "ATMSpitter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536089,
    "ts_updated_at": 1743041768,
    "ts_creation_date": 1653786006,
    "ts_modification_date": 1653786006,
    "files": {
        "pdf": "https://archive.orkl.eu/20614f6c16cc5d086a962c7096dc36f1f5e31bf9.pdf",
        "text": "https://archive.orkl.eu/20614f6c16cc5d086a962c7096dc36f1f5e31bf9.txt",
        "img": "https://archive.orkl.eu/20614f6c16cc5d086a962c7096dc36f1f5e31bf9.jpg"
    }
}