{
    "id": "1965a7ca-088f-4aed-b2f2-fd0bf1accaad",
    "created_at": "2023-01-12T15:04:25.587901Z",
    "updated_at": "2025-03-27T02:05:45.279489Z",
    "deleted_at": null,
    "sha1_hash": "ae1b37e382a32e9520f52e23500e78fc0a51041c",
    "title": "2021-08-24 - Ransomware Groups to Watch- Emerging Threats",
    "authors": "",
    "file_creation_date": "2022-05-28T16:58:20Z",
    "file_modification_date": "2022-05-28T16:58:20Z",
    "file_size": 3890746,
    "plain_text": "# Ransomware Groups to Watch: Emerging Threats\n\n**[unit42.paloaltonetworks.com/emerging-ransomware-groups/](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)**\n\nDoel Santos, Ruchna Nigam August 24, 2021\n\nBy [Doel Santos and](https://unit42.paloaltonetworks.com/author/doel-santos/) [Ruchna Nigam](https://unit42.paloaltonetworks.com/author/ruchna-nigam/)\n\nAugust 24, 2021 at 3:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Ransomware,](https://unit42.paloaltonetworks.com/category/ransomware/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Avos,](https://unit42.paloaltonetworks.com/tag/avos/) [AvosLocker,](https://unit42.paloaltonetworks.com/tag/avoslocker/) [Cybercrime,](https://unit42.paloaltonetworks.com/tag/cybercrime/) [HelloKitty,](https://unit42.paloaltonetworks.com/tag/hellokitty/) [Hive,](https://unit42.paloaltonetworks.com/tag/hive/) [Hive Leaks,](https://unit42.paloaltonetworks.com/tag/hive-leaks/) [LockBit 2.0](https://unit42.paloaltonetworks.com/tag/lockbit-2-0/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/emerging-ransomware-groups/)\n\n## Executive Summary\n\nAs part of Unit 42’s commitment to stop ransomware attacks, we conduct ransomware\nhunting operations to ensure our customers are protected against new and evolving\nransomware variants. We monitor the activity of existing groups, search for dark web leak\nsites and fresh onion sites, identify up-and-coming players and study tactics, techniques and\nprocedures. During our operations, we have observed four emerging ransomware groups\nthat are currently affecting organizations and show signs of having the potential to become\nmore prevalent in the future:\n\n\n-----\n\nAvosLocker is ransomware as a service (RaaS) that started operations in late June,\nusing a blue beetle logo to identify itself in communications with victims and “press\nreleases” aimed at recruiting new affiliates. AvosLocker was observed promoting its\nRaaS program and looking for affiliates on dark web discussion forums and other\nforums. Like many of its competitors, AvosLocker offers technical support to help\nvictims recover after they’ve been attacked with encryption software that the group\nclaims is “fail-proof,” has low detection rates and is capable of handling large files. This\nransomware also has an extortion site, which claims to have impacted six\norganizations in the following countries: the U.S., the U.K., the U.A.E., Belgium, Spain\nand Lebanon. We have observed initial ransom demands ranging from $50,000 to\n$75,000.\nHive Ransomware is double-extortion ransomware that started operations in June.\nSince then, Hive has impacted 28 organizations that are now listed on the group’s\nextortion site, including a European airline company and three U.S.-based\norganizations. Hive uses all tools available in the extortion toolset to create pressure on\nthe victim, including the date of initial compromise, countdown, the date the leak was\nactually disclosed on their site, and even the option to share the disclosed leak on\nsocial media.\nHelloKitty is not a new ransomware group; it can be tracked as early as 2020, mainly\ntargeting Windows systems. However, in July, we observed a Linux variant of HelloKitty\ntargeting VMware’s ESXi hypervisor, which is widely used in cloud and on-premises\ndata centers. We also observed two clusters of activity. Across the observed samples,\nsome threat actors preferred email communications, while others used TOR chats for\ncommunication with the victims. The observed variants impacted five organizations in\nItaly, Australia, Germany, the Netherlands and the U.S. The highest ransom demand\nobserved from this group was $10 million, but at the time of writing, the threat actors\nhave only received three transactions that sum up to about $1.48 million.\nLockBit 2.0 (previously known as ABCD ransomware) is a three-year-old RaaS\noperator that has been linked to some high-profile attacks lately following the June\nlaunch of a slick marketing campaign to recruit new affiliates. It claims to offer the\nfastest encryption on the ransomware market. LockBit 2.0 has impacted multiple\nindustries – 52 victims are listed on the group’s leak site. Its victims include\norganizations in the U.S., Mexico, Belgium, Argentina, Malaysia, Australia, Brazil,\nSwitzerland, Germany, Italy, Austria, Romania and the U.K.\n\nHere, we share information we've gathered from our observations of the behavior of these\nransomware groups to help organizations defend against them.\n\n[Palo Alto Networks Next-Generation Firewall customers are protected from these threats](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\nwith [Threat Prevention and](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) [WildFire security subscriptions. Customers are also protected](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nwith [Cortex XDR and can use](https://www.paloaltonetworks.com/cortex/cortex-xdr) [AutoFocus for tracking related entities.](https://www.paloaltonetworks.com/cortex/autofocus)\n\n## AvosLocker\n\n\n-----\n\n[AvosLocker is new ransomware that was first observed on July 4, 2021, and follows the](https://www.bleepingcomputer.com/forums/t/754311/avoslocker-ransomware-avos-support-topic/)\nRaaS model. The ransomware operator of the same name, avos, advertised their affiliate\nprogram on Dread (Figure 1). Dread is a Reddit-like dark web discussion forum featuring\nnews and sub-dreads around darknet markets. The announcement of the program includes\ninformation about features of the ransomware and lets affiliates know that AvosLocker\noperators will take care of negotiation and extortion practices. The user Avos has also been\nobserved trying to recruit individuals on the Russian forum XSS.\n\nFigure 1. AvosLocker announcement in Dread.AvosLocker, when executed, first opens a\nWindows shell showing the progress of the encryption process. After encryption is complete,\n\n\n-----\n\nit then appends the .avos extension to the encrypted files and drops the ransom note\nGET_YOUR_FILES_BACK.TXT in every encrypted directory (Figure 2). We observed\nanother AvosLocker sample that behaves exactly the same way as the initial observed\nsample, but also included a string called “Message from the agent” letting the victim know\ntheir files were exfiltrated.\n\nFigure 2a. AvosLocker ransom note\n\nFigure 2b. Encrypted files.\nThe ransom note includes information and an ID used to identify victims, and instructs the\nvictim to visit the AvosLocker TOR site (Figure 3).\n\n\n-----\n\nFigure 3. AvosLocker landing page.\nAfter submitting the ID, the victim will encounter a support chat and the request for ransom.\nFrom the available instances observed, we have seen payment requests as low as $50,000\nand as high as $75,000 in Monero (XMR). As seen with other ransomware groups,\nAvosLocker increases the ransom price if the victim doesn’t pay in the designated time\nperiod, as shown in Figure 4.\n\n\n-----\n\nFigure 4. AvosLocker support page.\nWhile exploring their site, we discovered that this group has already affected seven\norganizations: two law firms, one in the U.K. and one in the U.S.; a logistics company in\nSpain; a real estate agency in Belgium; a holdings company in Turkey; a Syrian\ntransportation organization and a city in the U.S. Some of the leaked data displayed on their\nsite include private organization documents and personal identifiable information.\n\nAvosLocker's first site post, on Jan. 1, 2021, was an announcement that the site was\nofficially online (Figure 5). The user avos also announced they started leaking data on\nmultiple sub-dreads as well. We believe this was done to attract more affiliates and traffic to\ntheir site.\n\n\n-----\n\nFigure 5. AvosLocker leak site and multiple advertisements on Dread.\n\n## Hive Ransomware\n\nHive ransomware began operations in June 2021 and has already shown notable disregard\nfor its victims’ welfare, attacking organizations including healthcare providers and mid-size\norganizations ill-equipped for managing a ransomware attack. Hive published their first victim\non their leak site, Hive Leaks, in late June (Figure 6). Since then, 28 victims have been\npublished on the Hive Leaks site, including a European airline company and three U.S.based organizations, one each in hardware retail, manufacturing and law. The posts include\nthe date and time the victim was affected.\n\n\n-----\n\nFigure 6. Hive Leaks.\n\nWhen this ransomware is executed, it drops two batch scripts. The first script, hive.bat, tries\nto delete itself, and the second script is in charge of deleting the shadow copies of the\nsystem (shadow.bat). Hive ransomware adds the [randomized characters].hive extension to\nthe encrypted files and drops a ransom note titled HOW_TO_DECRYPT.txt containing\ninstructions and guidelines to prevent data loss (Figure 7). The ransom note includes a\ngenerated login credential for the victim to chat with what the threat actors claim is their\n“sales” department. The TOR link directs the “customer” to a login page, and after the\ncredentials are submitted, it opens up a chat room for communication between the operators\nand the victim (Figure 8).\n\n\n-----\n\nFigure 7. Hive ransom\n\nnote.\nWe noticed that the login credentials provided by the ransom note were for a specific victim.\nWith this in mind, we then hunted for additional samples and found two more victims that\nwere affected but not yet listed on the leak site at the time of writing. After logging in, the\nvictim will see a chat where they can talk to the operators and get their decryptors (Figure 8).\n\nFigure 8. Hive chat (left) and login page (right).\nWe don’t yet have information on how Hive ransomware is being delivered, but ransomware\noperators are known for buying access to certain networks, brute-forcing credentials or\nspear-phishing for initial access.\n\n\n-----\n\n## HelloKitty: Linux Edition\n\nHelloKitty is a ransomware family that first surfaced at the end of 2020, primarily targeting\n[Windows systems. The malware family got its name due to its use of a Mutex with the same](https://www.webopedia.com/definitions/mutex/)\nname: HelloKittyMutex. The ransomware samples seem to evolve quickly and frequently,\nwith different versions making use of the .crypted or .kitty file extensions for encrypted files.\nSome newer samples make use of a Golang packer that ensures the final ransomware code\nis only loaded in memory, most likely to evade detection by security solutions.\n\nIn July 2021, we came across a Linux (ELF) sample with the name funny_linux.elf containing\na ransom note with verbiage that directly matched ransom notes seen in later samples of\nHelloKitty for Windows. This led to the discovery of other samples of this Linux strain of the\nHelloKitty ransomware, dating as far back as October 2020. However, starting in March, the\n[samples began targeting ESXi, a target of choice for recent Linux ransomware variants.](https://www.vmware.com/products/esxi-and-esx.html)\n\nOddly enough, the preferred mode of communication shared by attackers in the ransom\nnotes across the different samples is a mix between TOR URLs and victim-specific\nProtonmail email addresses. This could indicate different campaigns or even entirely different\nthreat actors making use of the same malware codebase. Since the samples we found\ncontained victim-specific ransom notes, we were able to get an idea of the ransomware’s\ntargets. We observed six organizations impacted by Hello Kitty, including Italian and Dutch\npharmaceutical organizations, a Germany-based manufacturer, an Australian industrial\nautomation solutions organization, and a medical office and a stock broker in the U.S. One\nsample, oddly enough, didn’t contain any contact information in its ransom note.\n\nWe also observed that the ransom demanded by the operator varies depending on the\nimpacted organization; we saw demands as high as $10 million and as low as $950,000 in\nMonero (Figure 9). The operators behind HelloKitty are also open to using bitcoin (BTC), but\nthey charge higher for bitcoin transactions due to its associated fees. We were able to look\nup the BTC wallet address they provided for victims\n(bc1ql5f3m75qx3ueu2pz5eeveyqsw6pdjs3ufk8r20) and confirm that three transactions were\nmade to that address, summing up to $1,477,872.41.\n\nFigure 9 HelloKitty chats.\n\n\n-----\n\nThe samples found primarily made use of different combinations of the arguments described\nin Table 1.\n\n**Argument** **Description** **Value(s)**\n\nv Verbose mode 0 or 1\n\nd Run the process as a daemon 0 or 1\n\n\ne When the flag is set, the ransomware only encrypts files\nwith the extensions .vmdk, .vmx, .vmsd and .vmsn\nIt is not set by default, which means that all files under the\nstart path that don’t match certain ransomware-specific file\nextensions will be encrypted\n\nk When this flag is set, the ransomware tries to kill VMs\nrunning on the host using the esxcli tool.\nIt is not set by default\n\n\n0 or 1\n\n0 or 1\n\n\nm Mode 5 (default) or\n10 or 20 or 25\nor 33 or 50\n\nc (Unsure of purpose)\n\n_Table 1. Arguments accepted by the Linux HelloKitty ransomware._\n\nThe following esxcli commands are executed to kill running VMs, when the k flag is set:\n\nesxcli vm process list\nesxcli vm process kill -t=soft -w=%d %(PID)\nesxcli vm process kill -t=force -w=%d %(PID)\n\nThe malware samples log their output to a work.log file in their execution path.\n\nFinally, the ransomware makes use of the Elliptic Curve Digital Signature Algorithm (ECDSA)\nfor encrypting files using functions from the shared library libcrypto.so for encryption. The\nencrypted file is saved with the extension .crypt. Each encrypted file has a corresponding file\nwith the extension .README_TO_RESTORE containing the ransom note. Additional details\ncan be found in the appendix of this report.\n\n## LockBit 2.0\n\nLockBit is another ransomware group that follows the RaaS model. According to their\nwebsite, this ransomware affiliate program has been active since September 2019. While\nLockBit has been known for some time, we included this group in this blog because of their\n\n\n-----\n\nrecent evolution to LockBit 2.0. In June 2021, the operators behind this ransomware\nrevamped their site and rebranded as LockBit 2.0.\n\nSince June 2021, they have compromised 52 organizations in accounting,automotive,\nconsulting, engineering, finance, high tech, hospitality, insurance, law enforcement,l egal\nservices, manufacturing, non-profit energy, retail, transportation and logistics industries,\nutilities in the following countries: Argentina, Australia, Austria, Belgium, Brazil, Germany,\nItaly, Malaysia, Mexico, Romania, Switzerland, the U.K. and the U.S. All the posts by the\nthreat actors on their leak site include a countdown until confidential information is released\nto the public, which creates additional pressure on the victim (Figure 10).\n\nFigure 10. Affiliation program description (left) and leak site (right).\nThe threat actors behind this ransomware claim that their current variant is the fastest\nencryption software in operation. To attract more affiliates, they include a table comparing\ndifferent ransomware families, including their previous variant (Figure 11).\n\n\n-----\n\nFigure 11. Encryption speeds comparison released by LockBit.\nWhen LockBit is executed, it starts encrypting files and appends the .lockbit extension.\nAdditionally, the ransomware changes the icon of the encrypted file to the LockBit 2.0 logo\n(Figure 12.b). After encryption is complete, LockBit then drops the ransom note titled,\nRestore-My-Files.txt (Figure 12.a).\n\n\n-----\n\nFigure 12a. Ransom Note.\n\nFigure 12b. Encrypted files.\n[Similar to REvil, LockBit 2.0 ransomware modifies the victim’s desktop wallpaper if the](https://unit42.paloaltonetworks.com/revil-threat-actors/)\nencryption process is successful, making the victim aware of their compromise. The\nwallpaper also includes an advertisement aimed at encouraging insider threats that all\norganizations could fall prey to. (Figure 13).\n\n\n-----\n\nFigure 13. Modified LockBit 2.0 wallpaper.\nThe advertisement states that the threat actors are interested in methods of access, such as\nRDP, VPN and corporate email credentials. In exchange, they offer a cut of paid ransom.\n\nIf the victim wants to communicate with Lockbit operators to get their data back, the\noperators include a “Decryption ID” and a TOR link (and their clearnet mirror: decoding[.]at)\non the ransom note. This information allows the user to log in and start the negotiation\nprocess (Figure 14).\n\n\n-----\n\nFigure 14. Support site login (left) and LockBit Support chat (right).\n\n## Conclusion\n\nWith major ransomware groups such as REvil and Darkside lying low or rebranding to evade\nlaw enforcement heat and media attention, new groups will emerge to replace the ones that\nare no longer actively targeting victims. Here, we shared information on some of the\nobserved malicious activity of the ransomware groups trying to become the next key players.\nWhile LockBit and HelloKitty have been previously active, their recent evolution makes them\na good example of how old groups can re-emerge and remain persistent threats. Unit 42 will\ncontinue to monitor these ransomware families – and new ones that may emerge in the\nfuture.\n\nPalo Alto Networks customers are protected against these ransomware families with Cortex\nXDR or the [Next-Generation Firewall with](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Threat Prevention and](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) [WildFire security](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[subscriptions. Customers can use AutoFocus for tracking related entities using the](https://www.paloaltonetworks.com/cortex/autofocus)\nAvosLocker, Hive, LockBit and HelloKitty tags, respectively. Full visualization of the\n[techniques observed can be seen in the Unit 42 ATOM viewer.](https://unit42.paloaltonetworks.com/atoms/)\n\nPalo Alto Networks has shared these findings, including file samples and indicators of\ncompromise, with our fellow Cyber Threat Alliance members. CTA members use this\nintelligence to rapidly deploy protections to their customers and systematically disrupt\nmalicious cyber actors. Visit the [Cyber Threat Alliance for more information.](https://cyberthreatalliance.org/)\n\n\n-----\n\nIf you think you may have been impacted by any of these ransomware families, please email\nunit42-investigations@paloaltonetworks.com or call (866) 486-4842 – (866) 4-UNIT42 – for\nU.S. toll-free; (31-20) 299-3130 in EMEA; or (65) 6983-8730 in JAPAC. The Unit 42 Incident\nResponse team is available 24/7/365. You can also take preventative steps by requesting a\n[Ransomware Readiness Assessment.](https://www.paloaltonetworks.com/ransomware-readiness-assessment)\n\n**Indicators of Compromise**\n\nAvosLocker\n\n43b7a60c0ef8b4af001f45a0c57410b7374b1d75a6811e0dfc86e4d60f503856\n\nfb544e1f74ce02937c3a3657be8d125d5953996115f65697b7d39e237020706f\n\n3984968230c96d52d78af1905ea1b224e7de36776a6af398a0462321f3c22020\n01792043e07a0db52664c5878b253531b293754dc6fd6a8426899c1a66ddd61f\n\nHive Ransomware\n\nA0b4e3d7e4cd20d25ad2f92be954b95eea44f8f1944118a3194295c5677db749\n\n1e21c8e27a97de1796ca47a9613477cf7aec335a783469c5ca3a09d4f07db0ff\n\nFdbc66ebe7af710e15946e1541e2e81ddfd62aa3b35339288a9a244fb56a74cf\n\n88f7544a29a2ceb175a135d9fa221cbfd3e8c71f32dd6b09399717f85ea9afd1\n\nHello Kitty (Linux)\n\n16a0054a277d8c26beb97850ac3e86dd0736ae6661db912b8782b4eb08cfd36e\n556e5cb5e4e77678110961c8d9260a726a363e00bf8d278e5302cb4bfccc3eed\n\n9f82f22c137688d0b3e7912d415605d2bbc56478311fd0b3dc265f8d0006aa8c\n\n8f3db63f70fad912a3d5994e80ad9a6d1db6c38d119b38bc04890dfba4c4a2b2\n\nbedf30bbcefc54bc48432674255856f47c0ba2ec46e913d078a53e66ac9dcff8\n\nCa607e431062ee49a21d69d722750e5edbd8ffabcb54fa92b231814101756041\n\nb4f90cff1e3900a3906c3b74f307498760462d719c31d008fc01937f5400fb85\n\nLockbit 2.0\n\nF32e9fb8b1ea73f0a71f3edaebb7f2b242e72d2a4826d6b2744ad3d830671202\n\n4de287e0b05e138ab942d71d1d4d2ad5fb7d46a336a446f619091bdace4f2d0a\n\nF3e891a2a39dd948cd85e1c8335a83e640d0987dbd48c16001a02f6b7c1733ae\n\nEa028ec3efaab9a3ce49379fef714bef0b120661dcbb55fcfab5c4f720598477\n\nBcdb59232137e570d4afb3c635f8df19ceb03e3f57fe558f4fc69a0be778c6ab\n\n4efcd774d9d224137c5840e9a2d0f9e56c976e8e7a49158e3c15135dd9fbae9c\n\n00260c390ffab5734208a7199df0e4229a76261c3f5b7264c4515acb8eb9c2f8\n\nE32dc551a721b43da44a068f38928d3e363435ce0e4d2e0479c0dfdb27563c82\n\n16a707a3965ebd71ebc831b68863b855b2c8d60aef8efdef1e0c0a6cc28e9bc7\n\nBc0b54c19949f407da972f0bedf7f429c0fe25181564d1fb6d053b989925898f\n\nAcad2d9b291b5a9662aa1469f96995dc547a45e391af9c7fa24f5921b0128b2c\n\n0545f842ca2eb77bcac0fd17d6d0a8c607d7dbc8669709f3096e5c1828e1c049\n\nBcbb1e388759eea5c1fbb4f35c29b6f66f3f4ca4c715bab35c8fc56dcf3fa621\n\n717585e9605ac2a971b7c7537e6e311bab9db02ecc6451e0efada9b2ff38b474\n\n\n-----\n\n73406e0e7882addf0f810d3bc0e386fd5fd2dd441c895095f4125bb236ae7345\n90af3848d5a0c5eb9c6ddc1ee2e6c539dd6cb5ec5a433d00a6dae22fb221c446\n4bb152c96ba9e25f293bbc03c607918a4452231087053a8cb1a8accb1acc92fd\n21879b5a8a84c5fe5e009c85744caf74b817c57203020bf919037d7ccb6b6a58\n56fd91787c641c2329a86813497d0e6ff219c81a4d61ac10fedef9cd68c3baed\n9dd6cc25b2f920b825e15682a4d06435a42b281674ba6e99c8e2b2222c9d638f\n23984141a918be3345296bb6bf50d8d356229cb832c726833499fbb950037d00\n91d1ab6c305552685996f4d80c44cc1c694355ae7d09243df027827d1df61631\n1dbe9f956514460774290197ffccb11d817d1a5a5aeab81877ae7b74daa1b592\n1e3bf358c76f4030ffc4437d5fcd80c54bd91b361abb43a4fa6340e62d986770\n69d9dd7fdd88f33e2343fb391ba063a65fe5ffbe649da1c5083ec4a67c525997\n26b6a9fecfc9d4b4b2c2ff02885b257721687e6b820f72cf2e66c1cae2675739\nCa57455fd148754bf443a2c8b06dc2a295f014b071e3990dd99916250d21bc75\n5072678821b490853eff0a97191f262c4e8404984dd8d5be1151fef437ca26db\n410c884d883ebe2172507b5eadd10bc8a2ae2564ba0d33b1e84e5f3c22bd3677\n0a937d4fe8aa6cb947b95841c490d73e452a3cafcd92645afc353006786aba76\n286bffaa9c81abfb938fe65be198770c38115cdec95865a241f913769e9bfd3f\nE3f236e4aeb73f8f8f0caebe46f53abbb2f71fa4b266a34ab50e01933709e877\n0f178bc093b6b9d25924a85d9a7dde64592215599733e83e3bbc6df219564335\n1b109db549dd0bf64cadafec575b5895690760c7180a4edbf0c5296766162f18\nFfbb6c4d8d704a530bdd557890f367ad904c09c03f53fda5615a7208a0ea3e4d\n76a77def28acf51b2b7cdcbfaa182fe5726dd3f9e891682a4efc3226640b9c78\nfaa3453ceb1bd4e5b0b10171eaa908e56e7275173178010fcc323fdea67a6869\n12a435aa3fe7fc3fa531b9e02ee63b907f343b4aa7acc137105e48eb7b32075a\ne32dc551a721b43da44a068f38928d3e363435ce0e4d2e0479c0dfdb27563c82\nbc0b54c19949f407da972f0bedf7f429c0fe25181564d1fb6d053b989925898f\n14b3827e821ee2d719d20c265d873e7e1471df40df1089175adbbe31a83fc0eb\nacad2d9b291b5a9662aa1469f96995dc547a45e391af9c7fa24f5921b0128b2c\nbcbb1e388759eea5c1fbb4f35c29b6f66f3f4ca4c715bab35c8fc56dcf3fa621\nd089d57b8b2b32ee9816338e96680127babc5d08a03150740a8459c29ab3ba78\n32f8eed5b2ada44b51cb251bce22355604d8cafef77e33bce769469926dc8cd7\n92ec3373b528e0040fae1c34b6edc8d623d03eac84267bd3ed408fe547b9c944\nf32e9fb8b1ea73f0a71f3edaebb7f2b242e72d2a4826d6b2744ad3d830671202\nf3e891a2a39dd948cd85e1c8335a83e640d0987dbd48c16001a02f6b7c1733ae\nd52f0647e519edcea013530a23e9e5bf871cf3bd8acb30e5c870ccc8c7b89a09\nea028ec3efaab9a3ce49379fef714bef0b120661dcbb55fcfab5c4f720598477\nbcdb59232137e570d4afb3c635f8df19ceb03e3f57fe558f4fc69a0be778c6ab\n1008af117f3f9f5c2d7f634c7c88fdb2af0dc2a8d01be203f0d69897559d3e05\n60b5aa993eaef3342252f8cb3f4c9d7c6272ebf2180a27bac8db516af32e8393\n459e6ff44674568233b2b2fbfd56e1456e5d72147fe919c063b5fc87d8fb3365\n0bbd59147cf0893d16829d705dcb6bed82487efc77c78fb17c1f2dcffa08875e\na8dfd303f2ff18416ccb88a8156298892689767121206b137a92ece8577e7403\n\n\n-----\n\nebe038b29b9f535f975ac7e6c256b7b0597ff93710c2328e8c43a63c750b441d\nb0ae47c915e7ed46e7badb3ed3888debf505c0a9f0a88e1ee18757df74cecb5f\n0b856337d9d3255fc3b07635fdadecbe83e23eb5c205eccab83c21c2fb76edc9\n3dcb5aa76118a5af24c3e01290d2ad0f71adcc21d3e2b337210bbeb97f73881a\nade83273f178c3dd5f82c22f42015dcf1aa1a2c961b6e4bf80068b7b5986cc2f\nb2b29c358242d49da3c9ef237695e02817b3e5b3fbb75fa94b5762e2a4210f8f\nd2ab5785e0dcf9c7657d960b7b7e86f1373408226a95946400f98e5957faf631\naa727a827c9e978520f5703e9100b52551b97cfc1e15e683cf27ce5212035548\n5b9e6d9275e9523aa3945be891745442a07b936ee5236e23934250ba3844f65f\n3e3801d5441c63661aca495f3e540ff77c669437924aff64dc340f594fbb185a\n99d781a0e9ac3dfaa7f9958cc62051f47ba116835e75b5d61835ff63afc98571\ne2e140d6d84e377c313006ae8d0848583f74a1ee7aad0fcd758a1888f9b04694\nb2f1ec9408272cc125b96a4f3b7c06c23742d69845e9b6a24f7eafad4da72faa\ne7a81e3c2bd77a237a3b75806197cb18db5cbf06fda246739bb3904ac117d013\ne15903faaad61d6d6499148c596d8051a51c80973cc1190336769b84a1eca1c8\n743ecc953dcd83a48140c82d8a7dcac1af28e0839aed16628ddfc9454bec8dfa\n626a4fa1f52623e89b3011c37c2d3ca4069dc5a4d3f5c4f74d4579c2d3d50356\n8013232fb7c254269c1029f91a915b80ed7ded53043d239a4be9a0b1fe37fa2c\n953bdc65d1d3316ffb2761da09a3b8587228bd40095d72eae95fc373488732cc\ne82315985f8eab415f6fabab7f805f0a76db6ca58b851070c946142f0ba29cbd\nfab378dbd88af235421174b73ad06d1e5f2c614c70b9bab318602f51da544d5e\na718c499a7a3c505828f5253862c9b2f3c40e2d80132de96e5cc19e3c161730b\nb735c0169ecdddba6676c6c490199358f6ab7cc9724391fee2482676a3efc6e5\na7591e4a248c04547579f014c94d7d30aa16a01bb2a25b77df36e30a198df108\n98900768d564c6962981edde2759889fdda11bb1113c851468e5c40ddafe1d4d\n6d26226f99724c18faf355a4e07b74bad72f5837e0de8c8361f7d9a18525b5ae\n5f99cdba09aa3e03e531fc34bc5fcee96f61ec0b83b575911d79573da7109906\ncd2287122277237a9c507ce9ba5f114ddd48faa1b3f87b33ed1a8b19f65c8a14\n93b0c6576c73b48dcb47f6572a31defc1304fd3c4464d50592195fa64edbcafe\n34e6f4317e223d712a9464cd2e6ba9e6d7915eac75a8c06648813ea1d7a80b80\n36446a57a54aba2517efca37eedd77c89dfc06e056369eac32397e8679660ff7\nf17ca8f7527669a35eee12edb7050a81ef91e3f0ea7b3935ddf554a6f731e374\n4edbf2358a9820e030136dc76126c20cc38159df0d8d7b13d30b1c9351e8b277\n0906a0b27f59b6db2a2451a0e0aabf292818e32ddd5404d08bf49c601a466744\n0d6524b9a1d709ecd9f19f75fa78d94096e039b3d4592d13e8dbddf99867182d\n\nDomains\n\nDecoding[.]at\nbigblog[.]at\nlockbit-decryptor[.]com\nlockbit-decryptor[.]top\n\n**Appendix (Hello Kitty)**\n\n\n-----\n\nExtensions that are ignored for encryption:\n\n.crypt\n.README_TO_RESTORE\n.tmp_\n.a\n.so\n.la\n\nDirectories ignored for encryption:\n\n/bin\n/boot\n/dev\n/etc\n/lib\n/lib32\n/lib64\n/lost+found\n/proc\n/run\n/sbin\n/usr/bin\n/usr/include\n/usr/lib\n/usr/lib32\n/usr/lib64\n/usr/sbin\n/sys\n/usr/libexec\n/usr/share\n/var/lib\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-24 - Ransomware Groups to Watch- Emerging Threats.pdf"
    ],
    "report_names": [
        "2021-08-24 - Ransomware Groups to Watch- Emerging Threats.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535865,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653757100,
    "ts_modification_date": 1653757100,
    "files": {
        "pdf": "https://archive.orkl.eu/ae1b37e382a32e9520f52e23500e78fc0a51041c.pdf",
        "text": "https://archive.orkl.eu/ae1b37e382a32e9520f52e23500e78fc0a51041c.txt",
        "img": "https://archive.orkl.eu/ae1b37e382a32e9520f52e23500e78fc0a51041c.jpg"
    }
}