{
    "id": "1988d9ce-2865-4cf0-85d3-f3a89b31a5d9",
    "created_at": "2022-10-25T16:48:13.541326Z",
    "updated_at": "2025-03-27T02:17:22.834756Z",
    "deleted_at": null,
    "sha1_hash": "d9d80ef14c3661af4dbc68e654e9e023947fb50f",
    "title": "VB2020 paper: Unveiling the CryptoMimic",
    "authors": "",
    "file_creation_date": "2020-09-14T17:29:19Z",
    "file_modification_date": "2020-09-16T10:34:28Z",
    "file_size": 3945083,
    "plain_text": "### rintaro.koike@global.ntt\n\n\n-----\n\n**ABSTRACT**\n\nCryptoMimic (also called Dangerous Password) is an APT actor that has been observed since around March 2018. It is\nreported that CryptoMimic attacks international businesses and organizations, in particular targeting cryptocurrency\ncompanies. Several security researchers all over the world have already published reports on this attack, but they have only\ndealt with the initial part of the attack. CryptoMimic is very careful and it is extremely difficult to observe the attack under\nvirtual environments including in a sandbox. As a result, there has been no detailed report that deals with the malware that\nthe attacker finally executes or how it behaves during the attack.\n\nIn this paper, we will reveal the analysis of an unknown malware sample (never reported before) and the picture of the\nwhole attack. We first introduce two initial samples (a LNK file and a macro-embedded MS Office file) used by\nCryptoMimic. Then, focusing on the attack using the LNK file, we disclose the whole picture of CryptoMimic that we\nobserved in February 2020.\n\nWe detail how the attack proceeds from the initial sample to the final malware execution, along with the results of analysis\nof the attacker’s behaviours and the executed malware. We also describe the various metadata that we discovered the\nattacker had left on the victim. By leveraging the metadata, we try to unveil the attacker’s profile or attribution.\n\n**INTRODUCTION**\n\n**Profile**\n\nCryptoMimic, the APT attack group we are chasing, is an actor also known as Dangerous Password, CageyChameleon and\nLeery Turtle. Since April 2018, the group has been active with almost unchanged TTPs.\n\nAs reported [1, 2, 3], CryptoMimic targets banks and finance-related organizations, in particular those that are related to\ncryptocurrencies. Targeted organizations exist worldwide, including in Japan, Russia, Europe and the US. Unlike other APT\nattack groups, it seems that the group’s main objective is to earn money. The group’s activity is very vigorous, and we\nmonitored 15 attacks in March 2020 (see Figure 1). Interestingly, there were no attacks on Sundays.\n\n_F igure 1: Attack monitoring in March 2020._\n\nAlthough the group actively attacks many organizations all over the world, the attributes of the group, including the country\nfrom which it originates and the attack actors it relates to, remain unknown.\n\n**TTPs**\n\n**_Initial access_**\n\nThe majority of CryptoMimic attacks start with an email containing a link to a website or a LinkedIn message (see Figure\n2). In most cases, the link to the website is shortened by Bitly. As soon as a user opens the link, a file is downloaded from a\ncloud service such as OneDrive via a server prepared by the group. The email is tailored to each target. It sometimes\npretends to be sent by the CEO of the target organization or includes the name of the organization or service in the email\nbody or attached file.\n\n\n-----\n\n_Fi gure 2: Attack flow until file download._\n\n**_Execution_**\n\nThe downloaded Zip file includes a document file, such as .doc or .pdf, and a LNK file. In many cases, the name of the\nLNK file is something like ‘Password.txt.lnk’. Because the document file is password protected (Figure 3), the user is\nfooled into opening the LNK file to check the password, which initiates the attack.\n\n_Fig ure 3: Password-protected document file._\n\nThe downloaded Zip file and the document file are sometimes designed to attract the target’s interest. The document file\nmight include the name of the target organization or contents relating to the target organization. The name of LNK file is\nalso changed according to targets. For example, if a target uses Japanese, the name of LNK file could be ‘パスワード.txt.\nlnk’ (Figure 4).\n\n_Figu re 4: Content of downloaded Zip file._\n\nBesides the LNK file, the group might use a document file with macros (see Figure 5) or a .chm file. But in recent attacks\nthe group has mainly used LNK files.\n\nAs soon as the LNK (or other) file is opened, it accesses a website using mshta.exe. The link to the website is shortened by\n_Bitly. The VBScript embedded in the website (Figure 6) is then read and executed by mshta.exe. The script subsequently_\ndownloads other scripts and finally gains functionality as a RAT. In this manner, CryptoMimic gains control of the target\ncomputer and steals sensitive information.\n\n\n-----\n\n_Figur e 5: Document file with macro._\n\n_Figure 6: VBScript downloaded from C&C server._\n\nCryptoMimic seems to go to great lengths to avoid providing the malicious file to third parties other than original target.\nThe download URL for the Zip file sent to the target becomes invalid promptly. Files including the Zip file are supplied by\nleveraging a redirect from the website the group prepared to a cloud service such as OneDrive, but redirecting is available\nfor only two or three days. Even if the redirecting is available, the downloaded file may be replaced with a benign one. The\nDNS record for the domain for the website the group prepared is deleted and becomes unreachable after a week or so. If\nyou receive and open the malicious file, the lifetime of the URL that mshta.exe accesses is as short as the download URL of\nthe malicious file.\n\n\n-----\n\n**_Discovery_**\n\nAs the attack goes on, CryptoMimic sends a RAT called Cabbage RAT, written in VBScript in stages. In its early stage, it\nchecks the target’s environment. To be more specific, Cabbage RAT-B collects and sends the system and task information\nof its working environment to the C&C server. If CryptoMimic doesn’t judge it as an attractive target, the attack won’t go\nany further. It seems that the group identifies targets by IP or MAC address. The attack will stop if either were included in\nthe past target history. Existing public reports [1, 2, 3] don’t discuss the breach beyond Cabbage RAT-B.\n\n**_Command and control_**\n\nCabbage RAT-C is controlled by CryptoMimic interactively. When we observed the attack, the group reviewed various\ndirectories and stole files that the group thought interesting. The group’s favourite was files that include personal or\nsensitive information, or financially-related ones. The group then investigated the system or network, and downloaded and\nexecuted three executable files on the target system. They were a highly sophisticated RAT and malware for information\ntheft.\n\nThough the attack by CryptoMimic has been ongoing, no detailed research has been published so far and the attributes of\nthe group remain unknown.\n\n**OBSERVATION**\n\n**Overview**\n\nIn February 2020 we successfully observed the whole sequence of an attack that started with a LNK file. We believe that\nthe observed attack was performed by CryptoMimic. As a result of deep analysis, it became clear that the group had used\nsome unknown malware never before reported, and executed commands on the victim host using a RAT during the attack.\nThe rest of this chapter will be dedicated to describing the attack we observed.\n\n**Attack flow**\n\nFigure 7 shows the overall picture of the attack we observed. Table 1 summarizes the components of the attack, including\nfiles and malware. The attack started with a LNK file and the victim was infected by a RAT and malware that steals\ninformation. Focusing on the former half of the attack, there are several similarities with CryptoMimic’s past attacks. For\nexample, there is a report that, in the past, the group used the technique to leverage a LNK file to let a victim download and\nexecute a dropper written in VBScript [3]. In addition, the source code of Cabbage RAT-A is almost same as that of the\nRAT the group used in the past [3]. The usage of a decoy also has similarities with past attacks. All these similarities gave\nus great insight into isolating the attacking group. On the other hand, prior to our study, it has never been reported that the\ngroup uses msoRAT or a credential stealer.\n\n_Figure 7: Overall picture of the observed attack._\n\n\n-----\n\n|Item|File path|Past report|Description|\n|---|---|---|---|\n|Downloader -A|Password.txt.lnk|Exists|LNK file downloading and executing dropper|\n|Dropper|(fileless)|Exists|Dropper written in VBScript|\n|Decoy|%APPDATA%\\Local\\Temp\\ Password.txt|Exists|Decoy text file|\n|Downloader -B|%APPDATA%\\Roaming\\ Microsoft\\Windows\\ StartMenu\\Programs\\Startup\\ Xbox.lnk|Exists|LNK file installed on startup for persistence|\n|Cabbage RAT-A|%APPDATA%\\Local\\Temp\\ kohqxrz.vbs|Exists|RAT written in VBScript downloading and executing Cabbage RAT-B|\n|Cabbage RAT-B|(fileless)|Exists|RAT written in VBScript downloading and executing Cabbage RAT-C|\n|Cabbage RAT-C|(fileless)|Does not exist|RAT written in VBScript downloading and executing browser info stealer|\n|Browser info stealer|C:\\Users\\Public\\ RuntimeBroker.exe|Does not exist|Executable file stealing information saved by browser|\n|msoRAT|C:\\Users\\Public\\NTUser.dat|Does not exist|DLL file with RAT functionality|\n|Credential stealer|C:\\Windows\\System32\\bcs.dll|Does not exist|DLL file stealing OS authentication information|\n\n\n_Table 1 : Malware and files observed during the attack._\n\n**Timeline**\n\nTable 2 summarizes the timeline of the attack we observed. It shows that as soon as Downloader-A was executed, Cabbage\nRAT-A initiated HTTP access to the C&C server and received a response after about an hour. It also shows that the whole\nattack was completed in three hours or so. According to the timeline, the Windows event log was deleted at 12:27 and the\nfile we copied was deleted at 12:29. The attacker then performed destructive activity and left the victim. It is likely that the\nattacker noticed that his activity had been observed and tried to wipe the traces of attack.\n\n**Time** **Subject** **Description**\n\n09:33 Downloader-A Downloader-A downloaded and executed dropper\n\n09:33 Dropper Dropper created decoy text file and opened with notepad.exe\n\n09:33 Dropper Dropper created Downloader-B and gained persistence using startup directory\n\nDropper created and executed Cabbage RAT-A; Cabbage RAT-A initiated\n09:33 Dropper\nHTTP access to C&C server\n\n10:30 Cabbage RAT-A Cabbage RAT-A downloaded and executed Cabbage RAT-B\n\n10:30 Cabbage RAT-B Cabbage RAT-B downloaded and executed Cabbage RAT-C\n\nCabbage RAT-C downloaded and executed browser info stealer; browser info\n11:15 - 11:34 Cabbage RAT-C\nstealer itself and its output were deleted after execution\n\n11:35 Cabbage RAT-C Cabbage RAT-C downloaded and executed msoRAT\n\n11:38 - 11:40 msoRAT msoRAT downloaded credential stealer and gained persistence\n\n11:47 msoRAT msoRAT injected something into lsass.exe process\n\nCabbage RAT-A\n\nProcesses for Cabbage RAT-A, Cabbage RAT-B and Cabbage RAT-C were\n\n11:48 Cabbage RAT-B\n\nterminated\n\nCabbage RAT-C\n\n12:23 lsass.exe lsass.exe deleted credential stealer\n\n12:26 lsass.exe lsass.exe deleted registry entry for persistence\n\n12:27 - 12:33 lsass.exe lsass.exe deleted Windows event log via wevutil.exe\n\nlsass.exe deleted copied credential stealer on the other directory; we copied\n12:29 lsass.exe\nthis credential stealer to bring out for further research\n\n12:43 lsass.exe lsass.exe was terminated\n\n_Table 2: Timeline of the observed attack._\n\n|Time|Subject|Description|\n|---|---|---|\n|09:33|Downloader-A|Downloader-A downloaded and executed dropper|\n|09:33|Dropper|Dropper created decoy text file and opened with notepad.exe|\n|09:33|Dropper|Dropper created Downloader-B and gained persistence using startup directory|\n|09:33|Dropper|Dropper created and executed Cabbage RAT-A; Cabbage RAT-A initiated HTTP access to C&C server|\n|10:30|Cabbage RAT-A|Cabbage RAT-A downloaded and executed Cabbage RAT-B|\n|10:30|Cabbage RAT-B|Cabbage RAT-B downloaded and executed Cabbage RAT-C|\n|11:15 - 11:34|Cabbage RAT-C|Cabbage RAT-C downloaded and executed browser info stealer; browser info stealer itself and its output were deleted after execution|\n|11:35|Cabbage RAT-C|Cabbage RAT-C downloaded and executed msoRAT|\n|11:38 - 11:40|msoRAT|msoRAT downloaded credential stealer and gained persistence|\n|11:47|msoRAT|msoRAT injected something into lsass.exe process|\n|11:48|Cabbage RAT-A Cabbage RAT-B Cabbage RAT-C|Processes for Cabbage RAT-A, Cabbage RAT-B and Cabbage RAT-C were terminated|\n|12:23|lsass.exe|lsass.exe deleted credential stealer|\n|12:26|lsass.exe|lsass.exe deleted registry entry for persistence|\n|12:27 - 12:33|lsass.exe|lsass.exe deleted Windows event log via wevutil.exe|\n|12:29|lsass.exe|lsass.exe deleted copied credential stealer on the other directory; we copied this credential stealer to bring out for further research|\n|12:43|lsass.exe|lsass.exe was terminated|\n\n\n-----\n\n**Windows commands**\n\nIn this attack, RATs written in VBScript or implemented as DLLs were used. The attacker launched several Windows\ncommands on the victim host via these RATs. Table 3 shows the list of commands that we observed. We think that the\nattacker stole information on the victim host or investigated other hosts on the same network by leveraging these\ncommands. It is widely known that attackers who engage in APT attacks frequently use standard Windows commands to\navoid detection [4]. It seems that the same theory was also applied to this attack.\n\n**command**\n\ncmd.exe\n\ncmdkey.exe\n\ncopy.exe\n\nfind.exe\n\nipconfig.exe\n\nnet.exe group\n\nnet.exe localgroup\n\nnet.exe user\n\nnet.exe view\n\nnetstat.exe\n\nping.exe\n\nrmdir.exe\n\nsysteminfo.exe\n\nwhoami.exe\n\nwevutil.exe\n\n_Table 3: Windows commands executed on victim via RAT._\n\n**MALWARE ANALYSIS**\n\n**Downloader-A**\n\nThe origin of the attack was a LNK file named Password.txt.lnk. Figure 8 shows the command line prepared at the link\ntarget of the LNK file. As shown, VBScript code will be executed as a result of downloading the HTML file from the C&C\nserver by leveraging mshta.exe.\n\n_F igure 8: Command line prepared at the link target of LNK file._\n\n**Dropper**\n\nThe dropper is a VBScript file downloaded and executed by Downloader-A. It creates and executes a decoy, Downloader-B\nand Cabbage RAT-A.\n\n**_Drop and open decoy_**\n\nFigure 9 shows the code that the dropper uses to create the decoy file (the code is partially modified here for better\nunderstanding). It performs the following tasks:\n\n - Creates the file ‘%TEMP%Password.txt’ using the echo command.\n\n - Opens the file using notepad.exe.\n\n - Deletes ‘%TEMP%Password.txt’ using the del command.\n\n_Fi gure 9: Code that the dropper uses to create the decoy file (modified)._\n\n\n-----\n\n**_Drop and execute Cabbage RAT-A_**\n\nFigure 10 shows the code that the dropper uses to create Cabbage RAT-A. It decodes the data stored in the variable ‘ln’\nusing Base64 and saves the decoded data in a file. The saved file is Cabbage RAT-A.\n\n_Fig ure 10: Code that the dropper uses to create Cabbage RAT-A (modified)._\n\nNext, Cabbage RAT-A is executed by the code below (Figure 11). The former part of the code checks whether there is any\nexisting process whose name contains the string ‘kwsprot’ or ‘npprot’. Its objective is to check if the Kingsoft Antivirus or\n_Net Protector anti-virus software is working on the victim. If found, Cabbage RAT-A is launched using cscript.exe. If not, it_\nis launched using wscript.exe.\n\n_Figu re 11: Code that the dropper uses to launch Cabbage RAT-A (modified)._\n\n**_Drop and persist Downloader-B_**\n\nFigure 12 shows the code that the dropper uses to create Downloader-B. Downloader-B is configured to download a file\nfrom the C&C server and execute it using mshta.exe. Apparently because we didn’t reboot the victim, we couldn’t observe\nthe file download and execution by Downloader-B.\n\n_Figur e 12: Code that the dropper uses to create Downloader-B (modified)._\n\nFigure 13 shows the code that the dropper uses to set persistence on Downloader-B. The dropper realizes persistence by\nplacing Downloader-B in the startup directory. During this task, the dropper checks if there is any existing process whose\nname contains the string ‘hudongf’ or ‘qhsafe’ Its objective is to detect Qihoo 360 security products. If found,\nDownloader-B is deleted from the victim.\n\n\n-----\n\n_Figure 13: Code that the dropper uses to set persistence on Downloader-B (modified)._\n\nWe confirmed that the shortened URL that Downloader-B accesses is redirected to the URL shown in Figure 14. Because\nno file was downloaded when we accessed the URL, its detail remains unknown.\n\n_Figure 14: Target URL for shortened redirection URL Downloader-B accesses._\n\n**Cabbage RAT-A**\n\nAs explained in the attack flow, three different VBScript RATs were used in the attack we observed. Because one VBScript\nRAT creates another VBScript RAT in stages, we named them Cabbage RAT after their characteristics. Cabbage RAT-A,\nwritten in VBScript, was downloaded and executed by the dropper. Figure 15 shows the code of Cabbage RAT-A. It\nexecutes the data received from the C&C server using the Execute method. The target C&C server is given by the first\nargument of Cabbage RAT-A.\n\n_Figure 1 5: Code of Cabbage RAT-A (modified)._\n\n**Cabbage RAT-B**\n\nCabbage RAT-B, written in VBScript, was downloaded and executed by Cabbage RAT-A. It sends an HTTP request that\nincludes information about the victim host to the C&C server once per minute. Figure 16 shows the data sent to the C&C\nserver (this is a sample and not the actual data we monitored).\n\n_Figure 16 : Data that Cabbage RAT-B sends to the C&C server._\n\n\n-----\n\nIn accordance with the response to the above HTTP request, Cabbage RAT-B performs the following tasks. The C&C\nserver sometimes responds ‘22’, which means ‘do nothing’ (Table 4).\n\n**Response data** **Description**\n\nIncludes string ‘20#’ Downloads VBScript code from the target included in the response (described later).\n\n‘21’ Stops Cabbage RAT-B.\n\nIncludes string ‘23#’ Executes VBScript code included in the response. The code is encoded in Base64.\n\n_Table 4: List of tasks that Cabbage RAT-B performs._\n\nIf the response data includes the string ‘20#’, VBScript code is downloaded by the NStep function. Figure 17 shows the\npart of the NStep function that downloads the VBScript. Response data from the C&C server is passed to the NStep\nfunction via the argument cmd. As shown, the response data beyond ‘#’ is part of a URL. Cabbage RAT-B composes the\ncomplete URL by adding a query parameter and downloads the VBScript code using the GET method. It then decodes the\ndownloaded VBScript code in the following order: Base64, XOR and Base64.\n\n_F igure 17: Part of the code executed if the response data contains the string ‘20#’._\n\nDuring the attack we observed, Cabbage RAT-B downloaded Cabbage RAT-C from the URL included in the response and\nexecuted it.\n\n**Cabbage RAT-C**\n\nCabbage RAT-C, written in VBScript, was downloaded and executed by Cabbage RAT-B. Figure 18 shows the code of\nCabbage RAT-C. Cabbage RAT-C decodes the string stored in a variable using Base64 and executes it using the Execute\nmethod. Its functionality as a RAT is implemented in the code executed by this Execute method. The variable ‘pu’ is a part\nof a target URL with which the Cabbage RAT-C communicates.\n\n_Fi gure 18: Code of Cabbage RAT-C._\n\nFigure 19 shows a flow chart of the code executed by the Execute method. It should be noted that without receiving a\nproper response from C&C server, the subsequent command won’t be executed.\n\n_Fig ure 19: Flow chart of the code executed by the Execute method._\n\n|Response data|Description|\n|---|---|\n|Includes string ‘20#’|Downloads VBScript code from the target included in the response (described later).|\n|‘21’|Stops Cabbage RAT-B.|\n|Includes string ‘23#’|Executes VBScript code included in the response. The code is encoded in Base64.|\n\n\n-----\n\nTable 5 shows a list of commands for Cabbage RAT-C. As shown in the response format column, the response from the\nC&C server had multiple lines. The first line represents the type of command, and the second line represents the command\nargument. Cabbage RAT-A and Cabbage RAT-B, described previously, had fewer commands and their main function was to\nexecute VBScript code downloaded from the C&C server, but Cabbage RAT-C has an additional function that enables it to\nsteal information from the victim host, to download or to upload files. Judging from the fact that the Windows commands\nlisted in Table 3 were executed by Cabbage RAT-C, it is natural to think that this is the one of main RATs that CryptoMimic\nuses after successful breaching.\n\n**Response format** **Description**\n\n‘s’\nStop Cabbage RAT-C\n‘k’\n\n‘s’\nSet interval (in seconds) for accessing the C&C server using the number in the second line\n(number)\n\n‘l’\nSend drive information of a victim to C&C server\n‘/’\n\n‘l’\nSend file and directory information designated in the second line to C&C server\n(folder path)\n\n‘c’ Execute command designated in the second line using WSH and send standard output to C&C\n(command) server\n\n‘cd’\nSet current directory\n(folder path)\n\n‘ps’\nExecute VBScript code\n(VBScript code)\n\n‘psi’\nExecute VBScript code encoded in Base64\n(encoded data)\n\n‘r’\nDelete directory or file\n(path)\n\n‘e’\n(command) Execute command using WSH. Arguments are optional\n(arguments)\n\n‘u’\nDownload binary data from C&C server and save to designated filepath\n(filepath)\n\n‘d’\nEncode file in designated file path using Base64 and upload to C&C server\n(file path)\n\n‘k’ Do nothing\n\n_Tab le 5: Command list of Cabbage RAT-C._\n\n**Browser info stealer**\n\nThe browser info stealer is an executable file downloaded and executed by Cabbage RAT-C. We confirmed that it has\nfunctionality to steal cookies and passwords stored by Google Chrome.\n\n**_Argument_**\n\nIt is already known that the browser info stealer can perform tasks in accordance with the passed argument. Figure 20\nshows an example usage of an argument.\n\n_F igure 20: Example usage of argument for browser info stealer._\n\nFigure 21 shows part of the decompilation of the main function. As shown, the mbsicmp function evaluates the second\nargument to perform the corresponding task.\n\n|Response format|Description|\n|---|---|\n|‘s’ ‘k’|Stop Cabbage RAT-C|\n|‘s’ (number)|Set interval (in seconds) for accessing the C&C server using the number in the second line|\n|‘l’ ‘/’|Send drive information of a victim to C&C server|\n|‘l’ (folder path)|Send file and directory information designated in the second line to C&C server|\n|‘c’ (command)|Execute command designated in the second line using WSH and send standard output to C&C server|\n|‘cd’ (folder path)|Set current directory|\n|‘ps’ (VBScript code)|Execute VBScript code|\n|‘psi’ (encoded data)|Execute VBScript code encoded in Base64|\n|‘r’ (path)|Delete directory or file|\n|‘e’ (command) (arguments)|Execute command using WSH. Arguments are optional|\n|‘u’ (filepath)|Download binary data from C&C server and save to designated filepath|\n|‘d’ (file path)|Encode file in designated file path using Base64 and upload to C&C server|\n|‘k’|Do nothing|\n\n\n-----\n\n_Fi gure 21: Part of the decompile result for main function._\n\nTable 6 shows valid options for second arguments and their descriptions. By passing certain options, the browser info\nstealer extracts cookies or passwords stored in the victim host.\n\n**Option** **Description**\n\n-c Extract stored cookie to a file\n\n-c2 Extract stored cookie to a file in different format\n\nExtract stored cookie for domains related Google (google.com or mail.google.com) to a file.\n-g\nOutput format is same as option ‘-c’\n\n-p Extract stored password to a file\n\n_Ta ble 6: List of options passed as second argument._\n\n**_Output format_**\n\nFigures 22, 23 and 24 show the formats in which the browser info stealer outputs cookies or passwords.\n\n_F igure 22: Output format for option ‘-c’._\n\n|Option|Description|\n|---|---|\n|-c|Extract stored cookie to a file|\n|-c2|Extract stored cookie to a file in different format|\n|-g|Extract stored cookie for domains related Google (google.com or mail.google.com) to a file. Output format is same as option ‘-c’|\n|-p|Extract stored password to a file|\n\n\n-----\n\n_Fi gure 23: Output format for option ‘-c2’._\n\n_Fig ure 24: Output format for option ‘-p’._\n\n**_Change encryption method of Google Chrome_**\n\n_Google Chrome stores cookie and password information on a local host, but they are part-encrypted. Figure 25 shows_\nhow the browser info stealer decrypts them by using the CryptUnprotectData function. However, Google changed the\nencryption method in Google Chrome 80, released on 4 February 2020 [5]. This change rendered the browser info\nstealer unable to decrypt the cookies and passwords stored by Google Chrome 80 and later. We observed the attack on\n10 February 2020, which was rather close to the date Google Chrome 80 was released, which would explain why\nCryptoMimic couldn’t cope with the decryption. Since the decryption algorithm for the latest encryption method is\nalready publicly available on the Internet [6], we expect that, sooner or later, the group will update their tools to follow\nthe change.\n\n_Figu re 25: Part of the code for the browser info stealer._\n\n**msoRAT**\n\nmsoRAT is a DLL file downloaded and executed by Cabbage RAT-C. This malware’s name comes from the file name it\nreads and writes: ‘c:\\windows\\apppatch\\msomain.sdb’. From here, we’ll focus on the analysis of msoRAT.\n\n**_Packing_**\n\nmsoRAT is packed. Figure 26 shows msoRAT’s sections. It is only the .dat1 and .reloc sections that contain code or data.\n\n\n-----\n\n_Figur e 26: Analysis of msoRAT using PEView._\n\nThe unpack process is implemented on the .dat1 section and unpacked code or data is written into the .text or .data section\n(Figure 27, Figure 28). After unpacking, the function passed by argument ‘#1’ is executed.\n\n_Figure 27: .text section before unpacking._\n\n_Figure 28: .text section after unpacking._\n\n**_Encrypted argument_**\n\nFigure 29 shows the command that Cabbage RAT-C uses to launch msoRAT. As shown, Cabbage RAT-C executes\nNTUser.dat using rundll32.exe. The ‘#1’ string included in the command line is a value that specifies the target function.\n‘4pG2hIBvptiLeqF7MtBTTJ2fMSIlkJXBFH/9upgop6tiD3o=’ is an argument of the function.\n\n_Figure 2 9: Command that Cabbage RAT-C uses to launch msoRAT._\n\n\n-----\n\nWe found that the argument of the function is a string encrypted using RC4 and encoded using Base64. The key for RC4 is\nincluded in NTUser.dat. The decrypted string was separated by space. The latter two blocks represent the C&C server\nconnecting information (IP address and port number).\n\n_Figure 30 : Decrypted argument._\n\n**_Obfuscation of DLL function_**\n\nThe process to call the DLL function in msoRAT is obfuscated and the obfuscation method has a unique characteristic.\nFigure 31 shows the result of disassembly where msoRAT calls the ReadFile function. The dat0_ReadFile and dat0_\nReadFile_Main function obfuscate the DLL function calling process. ‘dat0’, which is included in the name of the\nobfuscating function, represents the name of a section. Including other cases, the obfuscating process for the DLL function\ncalling is always implemented on the dat0 section. There are multiple jmp instructions in the DLL function calling process.\nThough dat0_ReadFile_Main, shown in Figure 31, also contains a conditional jump (jnz) instruction, the same ReadFile\nfunction is called regardless of the condition.\n\n_Figure 31: Result of disassembly where the ReadFile function is called._\n\nMoreover, msoRAT can call a function without using a call instruction. Generally, a function is called using a call\ninstruction in assembly. rip register represents the memory address for the code currently executing and the call instruction\ncalls the target function by setting the memory address of the target function to rip register. Figure 32 shows how msoRAT\ncalls the target function using the xchg and retn instructions in combination. When it calls the ReadFile function, it swaps\nthe value stored in rsi and [rsp] using the xchg instruction. Because the rsi register stores the target DLL function address,\nthis xchg instruction means that the value stored in the top of the stack is replaced by the ReadFile function address. The\nretn instruction is an instruction that stores the value in the top of the stack to rip register. By setting the ReadFile function\naddress in the top of stack to rip register, the ReadFile function is eventually called.\n\n_Figure 32: Calling target function using xchg and retn instructions in combination._\n\n**_Command list_**\n\nmsoRAT has RAT functionality and performs various tasks in accordance with orders received from the C&C server. Table\n7 shows a list of the commands that msoRAT accepts. We confirmed various commands including collecting victim host\n\n\n-----\n\ninformation, uploading and downloading, all of which are implemented in ordinary RATs. Unlike Cabbage RAT-C, it has\ncommands that require WINAPI, such as privilege escalation or injection. One of its other characteristics is that it uses\nHTTPS to communicate with the C&C server.\n\n**Command ID** **Description**\n\n43E04420456043D Send computer name, Windows version and edition to C&C server\n\n43E044204340440 Send drive information to C&C server\n\n43A043004400435 Send file information of designated directory to C&C server\n\n44004350436043D Send size of designated directory to C&C server\n\n437043C043A0430 Set current directory\n\n43F0440043E0431 Execute designated command\n\n43F043E04310440 Execute a command after assigning SeDebugPrivilege privilege to designated user\n\n432043804420438 Delete designated file\n\n447044004320444 Change date of creation, last access and last update for designated file\n\n7A0441043A0430 Compress designated directory and upload\n\n441043A04300447 Upload a file\n\n437043004320430 Download a file\n\n442043E0437043E Steal process information\n\n43F044004320431 Terminate process with designated PID\n\n43A043E043C0430 Execute designated command and send its standard output to C&C server\n\n43F0440043E0433 Add registry\n\n43F043E043C0435 Send beacon\n\n43E0442043A043E Compress ‘c:\\windows\\apppatch\\msomain.sdb’ and send to C&C server.\n\n43D0430043A043E Write data received from C&C server to ‘c:\\windows\\apppatch\\msomain.sdb’\n\n442043F04560434 Initialize a socket\n\n441043F0430043B Write a value to ‘c:\\windows\\apppatch\\msomain.sdb’\n\n434043E00700065 Inject PE file in designated path to explorer.exe\n\nInject PE file received from C&C server; it is possible to execute it after assigning\n456043D00700065\nSeDebugPrivilege privilege to designated user\n\n4450440043F0435 Execute RuntimeBroker.exe twice, with -c option and with -p option\n\n43E0437043C0432 Execute OpenEvent function\n\n438043D04440441 Send PuTTY and WinSCP information to C&C server\n\n43F04300440043E Execute RUntimeBroker.exe with -p option\n\n_Table 7: Co mmand list of msoRAT._\n\n**Credential stealer**\n\nThe credential stealer is a file that is downloaded and persisted by msoRAT. Figure 33 shows the command used to realize\npersistence. Windows has a system called Security Packages to handle the authentication of third-party systems. Security\nPackages is a DLL file loaded by lsass.exe and its abuse enables the attacker to steal credentials (password for logged on\nuser, etc.) [7]. The command in Figure 33 sets a DLL file named ‘bcs’ as Security Packages.\n\n_F igure 33: Command line that persisted the credential stealer._\n\nWe found that this credential stealer is packed using Themida (see Figure 34). Themida is commercial packer and can be\nused to obfuscate malware. We also found that this file was previously named bnt.dll (see Figure 35).\n\n|Command ID|Description|\n|---|---|\n|43E04420456043D|Send computer name, Windows version and edition to C&C server|\n|43E044204340440|Send drive information to C&C server|\n|43A043004400435|Send file information of designated directory to C&C server|\n|44004350436043D|Send size of designated directory to C&C server|\n|437043C043A0430|Set current directory|\n|43F0440043E0431|Execute designated command|\n|43F043E04310440|Execute a command after assigning SeDebugPrivilege privilege to designated user|\n|432043804420438|Delete designated file|\n|447044004320444|Change date of creation, last access and last update for designated file|\n|7A0441043A0430|Compress designated directory and upload|\n|441043A04300447|Upload a file|\n|437043004320430|Download a file|\n|442043E0437043E|Steal process information|\n|43F044004320431|Terminate process with designated PID|\n|43A043E043C0430|Execute designated command and send its standard output to C&C server|\n|43F0440043E0433|Add registry|\n|43F043E043C0435|Send beacon|\n|43E0442043A043E|Compress ‘c:\\windows\\apppatch\\msomain.sdb’ and send to C&C server.|\n|43D0430043A043E|Write data received from C&C server to ‘c:\\windows\\apppatch\\msomain.sdb’|\n|442043F04560434|Initialize a socket|\n|441043F0430043B|Write a value to ‘c:\\windows\\apppatch\\msomain.sdb’|\n|434043E00700065|Inject PE file in designated path to explorer.exe|\n|456043D00700065|Inject PE file received from C&C server; it is possible to execute it after assigning SeDebugPrivilege privilege to designated user|\n|4450440043F0435|Execute RuntimeBroker.exe twice, with -c option and with -p option|\n|43E0437043C0432|Execute OpenEvent function|\n|438043D04440441|Send PuTTY and WinSCP information to C&C server|\n|43F04300440043E|Execute RUntimeBroker.exe with -p option|\n\n\n-----\n\n_Fi gure 34: Result of analysis of credential stealer using Exeinfo PE._\n\n_Fig ure 35: Result of analysis of credential stealer using PsStudio._\n\nFor now, we can’t confirm how the credential stealer works. But we suspect that it is a piece of malware that steals\ncredentials because it uses Security Packages.\n\n**Attribution**\n\nAs mentioned previously, CryptoMimic targets the finance industry, in particular organizations related to cryptocurrency.\nBecause the group attacks many organizations all over the world, we believe that the group’s main objective is earning\nmoney. There are many attack groups motivated by money, but the number of groups that mainly target the cryptocurrency\nindustry using sophisticated techniques and that can optimize the attack for each target is limited. The most notorious attack\ngroup is Lazarus [8].\n\nSummarizing the information gathered from initial samples provides some insight as to the identity of the attack group.\nCryptoMimic mainly uses LNK files, but it also uses a document file with macros or a chm file. These characteristics are\nsimilar to those of Lazarus activity as reported by Proofpoint [9]. According to this report, Lazarus used a LNK file (Figure\n36), a document file with macros or a chm file, and targeted the cryptocurrency industry. The method using a URL\nshortening service is also similar to CryptoMimic (see Figure 37).\n\n_Figu re 36: Target URL included in Lazarus LNK file._\n\n_Figur e 37: Target URL included in CryptoMimic LNK file._\n\nIn addition, there are similarities in the process implemented on the chm file to execute malicious code (see Figures 38,\n39 and 40).\n\nWe focused on the Bitly shortened URL that CryptoMimic used and performed a deeper analysis. Adding ‘+’ at the end of\nthe URL provides extra information on the shortened URL, including its time of creation. Because our study of the time of\n\n\n-----\n\n_Figure 38: Result of decompile for Lazarus chm file (1)._\n\n_Figure 39: Result of decompile for Lazarus chm file (2)._\n\n_Figure 4 0: Result of decompile for CryptoMimic chm file._\n\n\n-----\n\ncreation showed that there was no regularity in the time of creation, we think that the group created shortened URLs as\nnecessary. At first glance, it seems that the group’s working hours are round the clock. One APT attack group that has the\nsame working hours is Lazarus. A graph of Lazarus’ working hours was reported by Lexfo [10]. The graph we created\nbased on CryptoMimic’s Bitly URL creation time (Figure 41) has a similar shape to the one reported by Lexfo. Both show\nthat the main working hours are from 8:00 a.m. to 8:00 p.m., with a lunch break around noon.\n\n_Figure 41 : Bitly URL creation time in CryptoMimic._\n\nRegarding the second sample, Cabbage RAT, Cabbage RAT-B is rather simple and Cabbage RAT-C is full-featured.\nAlthough all RATs have some similarity in essence, Cabbage RAT-A and Cabbage RAT-B share some particular similarities\nwith PowerRatankba.A. For example, their command structure and URL pattern (use of port 8080 and inclusion of a\nrandom value in URL parameters) look alike.\n\nThe third sample, msoRAT, is packed, but it has peculiar behaviour. The prime example is its injection method against\nlsass. msoRAT injects a DLL file by adding the registry key ‘Security Packages’ to SYSTEM\\CurrentControlSet\\Control\\\nLsa. According to the report created by US-CERT [11], the same method was used by a RAT called HOPLIGHT during an\nattack by HIDDEN COBRA. Besides, CryptoMimic performed destructive activities at the end of our observation. In\nparticular, the group deleted all the created files, cleared the event log and also deleted numerous irrelevant files. As a\nresult, the victim became unable to boot Windows OS. Not many APT attack groups carry out such destructive activities,\nand the best known group that behaves in this way is Lazarus.\n\nAs a result of studying a sample that was thought to have been used by Lazarus (bfcsvc.dll), we found multiple\nsimilarities with msoRAT and the credential stealer. An analysis report by Intezer says that the origin of bfcsvc.dll is\nLazarus [12]. Other opinions that suggest a relationship between bfcsvc.dll and Lazarus can be found on VirusTotal [13]\nand Twitter [14].\n\nThe following are the similarities we found in bfcsvc.dll compared to the samples used we observed during the attack:\n\n - bfcsvc.dll is packed using a similar method to msoRAT.\n\n - bfcsvc.dll implements obfuscation techniques like msoRAT in calling functions.\n\n - bfcsvc.dll accesses ‘c:\\windows\\apppatch\\msomain.sdb’ like msoRAT.\n\n - The DLL name is exactly same as the credential stealer.\n\n - Like the Credential Stealer, bfcsvc.dll has a function related to Security Packages.\n\nFigure 42 shows bfcsvc.dll’s sections. As shown, there are sections without period, such as ‘text’ and ‘data’. It is only\nthe .cat1 and .reloc sections that contain valid code or data. It is confirmed that, as a result of the unpacking process,\nvalid data is written into the .text or .data section (see Figure 43). We also found a process that calls the DLL function\nusing xchg and retn instructions after multiple jmp instructions (see Figure 44). Moreover, a hybrid analysis report\nshows that bfcsvc.dll accesses ‘c:\\windows\\apppatch\\msomain.sdb’ [15]. All of these features are the same as those of\nmsoRAT.\n\n\n-----\n\n_Figure 42: Analysis of bfcsvc.dll using PEView._\n\n_Figure 43: Comparison of .text section of bfcsvc.dll before / after unpacking._\n\n_Figure 44: P rocess that bfcsvc.dll uses to call DLL function._\n\nFigure 45 shows the analysis of bfcsvc.dll using PeStudio. It suggests that its original name was bnt.dll. Figure 46 shows\nthe functions that bfcsvc.dll exports. As shown, the SpInitInstance and SpLsaModeInitialize functions are exported. Both of\nthese functions are also exported by the credential stealer.\n\nTaking these similarities into consideration, we believe that CryptoMimic and Lazarus have some connection. However,\nthere is no clear evidence that proves our supposition, which is just inference from a series of circumstantial evidence.\nThere could be a third attack group that masquerades as Lazarus, or all of these similarities might be coincidence.\n\n**Hunting & defence**\n\nCryptoMimic prefers to use a LNK file as an initial sample. The easiest way to detect the group’s LNK file is to create a\nsignature that detects the filename, such as ‘Password.txt.lnk’ or ‘パスワード.txt.lnk’ (Figure 47). The group has been\nusing the same filename for two years and will keep this convention. The fact that the link target of the LNK file is\nmshta.exe and the link created by Bitly is passed as an argument are other notable characteristics.\n\n\n-----\n\n_Figure 45: An alysis of bfcsvc.dll using PeStudio._\n\n_Figure 46: Fun ctions exported by bfcsvc.dll._\n\n_Figure 47: File name customized by target._\n\nThere are various traces on the group’s LNK files. Their Machine ID or MAC address are always different, but Volume\nSerial Number and parsing path are sometimes the same. Table 8 shows the metadata of the LNK file that we collected. The\nVolume Serial Number is the most interesting. Although there seem to be several environments that create LNK files, it will\nwork as a signature to some extent.\n\n**Volume Serial Number** **Parsing path** **Date modified**\n\nF2C4D353 C:\\Windows\\System32\\cmd.exe 02/13/2020 02:10:28\n\n64C0E1A7 C:\\Users\\Public\\Downloads\\Lists\\Password.txt 02/23/2020 04:14:58\n\nC4B156EA C:\\Users\\Public\\System\\New Text Document.txt 01/23/2020 02:51:53\n\nC6192C1F C:\\Windows\\System32\\mshta.exe 03/19/2019 04:45:40\n\nDE285B24 C:\\Windows\\System32\\cmd.exe 08/07/2019 04:27:35\n\n32F76E3A Y:\\Works_2018\\16.June\\06.22\\Trading Sheet (June 2018)\\ReadMe.txt 06/22/2018 06:45:29\n\nCE1FA155 Y:\\Works_2018\\16.June\\06.22\\Trading Sheet (June 2018)\\ReadMe.txt 06/22/2018 06:45:29\n\n1AEEE0BD C:\\Users\\BEST\\Desktop\\vbox_share\\vaccine\\js\\1.txt 08/09/2017 02:34:55\n\n_Table 8: Metad ata of LNK file._\n\n|Volume Serial Number|Parsing path|Date modified|\n|---|---|---|\n|F2C4D353|C:\\Windows\\System32\\cmd.exe|02/13/2020 02:10:28|\n|64C0E1A7|C:\\Users\\Public\\Downloads\\Lists\\Password.txt|02/23/2020 04:14:58|\n|C4B156EA|C:\\Users\\Public\\System\\New Text Document.txt|01/23/2020 02:51:53|\n|C6192C1F|C:\\Windows\\System32\\mshta.exe|03/19/2019 04:45:40|\n|DE285B24|C:\\Windows\\System32\\cmd.exe|08/07/2019 04:27:35|\n|32F76E3A|Y:\\Works_2018\\16.June\\06.22\\Trading Sheet (June 2018)\\ReadMe.txt|06/22/2018 06:45:29|\n|CE1FA155|Y:\\Works_2018\\16.June\\06.22\\Trading Sheet (June 2018)\\ReadMe.txt|06/22/2018 06:45:29|\n|1AEEE0BD|C:\\Users\\BEST\\Desktop\\vbox_share\\vaccine\\js\\1.txt|08/09/2017 02:34:55|\n\n\n-----\n\nDocument files with macros have some features. In many cases, where the macro isn’t enabled, the document file returns a\nmessage like ‘This document is protected by GDPR. To see data enable content’. Sometimes ‘Authors’ or ‘Last saved by’\nstay the same for long periods. These would be good candidates for a signature.\n\nThe C&C server with which the initial and second sample communicate also has several characteristics. For example, the\nC&C server with which Cabbage RAT-A and Cabbage RAT-B communicate keep working for about a month. The C&C\nserver with which Cabbage RAT-C communicates stays unchanged for about two months. It seems that these servers are\nbuilt by XAMPP on Windows, but their IP addresses were varied. Because an IP address managed by an educational\ninstitution was included, some could be cracked by CryptoMimic. Most of the domains used for C&C servers pretend to be\ncloud services. The group used the DDNS service in the first part of 2018, but has started registering its own domains since\nthen. The group’s favourite domain name registers are NameCheap, NameSilo and PublicDomainRegistry. Table 9 shows\nsome domain names that CryptoMimic used. Special attention would be required for such odd domain names that pretend\nto be legitimate services.\n\n**Domain**\n\noffice.onedriveglobal[.]com\n\nonedrive.onedriveglobal[.]com\n\nmail.gdrvup[.]xyz\n\ndocs.gdriveshare[.]top\n\ndrives.googlecloud[.]live\n\n_Table 9: Example domain names that CryptoMimic used._\n\nThe URL for the C&C server used by Cabbage RAT-C also has an interesting feature. Until April 2018, the group used\n/content.php. But from October 2018 to August 2019, the URL was /open plus a dynamic parameter starting with ‘id’.\nSince then, the URL has been /edit plus a dynamic parameter starting with ‘id’, which has remained unchanged for years.\n\n**CONCLUSION**\n\nCryptoMimic is an active APT attack group that mainly targets cryptocurrency organizations, that has been active since\n2018. The group starts its attack with a LNK or document file, investigates the victim’s environment or steals information\nusing a RAT written in VBScript. It also uses msoRAT or a tool that can steal credentials. In this paper, we have discussed\nan actual attack by CryptoMimic that we observed and have introduced the attack origin and the malware used along with\nthe results of our detail analysis.\n\nAt the same time, we have considered the attribution of the group from all aspects. Unfortunately, there is no clear\nevidence, but we note that the group’s objective and attacking technique are similar to those of Lazarus. There might be\nsome relationship between CryptoMimic and Lazarus. We continue to consider the attribution of CryptoMimic.\n\nFinally, it is likely that CryptoMimic continues working actively, targeting the finance industry, especially cryptocurrency\norganizations, worldwide. To protect yourself from CryptoMimic attack, we recommend leveraging the information that we\nproposed in this paper for detecting and defending.\n\n**REFERENCES**\n\n[1] JPCERT/CC. Spear Phishing against Cryptocurrency Businesses. https://blogs.jpcert.or.jp/en/2019/07/spearphishing-against-cryptocurrency-businesses.html.\n\n[2] ThreatBook. The Nightmare of Global Cryptocurrency Companies - Demystifying the “DangerousPassword” of\nthe APT Organization. https://threatbook.cn/ppt/The%20Nightmare%20of%20Global%20Cryptocurrency%20\nCompanies%20-%20Demystifying%20the%20%E2%80%9CDangerousPassword%E2%80%9D%20of%20the%20\nAPT%20Organization.pdf.\n\n[3] Cyber Struggle. Leery Turtle Threat Report. https://cyberstruggle.org/delta/LeeryTurtleThreatReport_05_20.pdf.\n\n[4] MITRE. Command and Scripting Interpreter: Windows Command Shell. https://attack.mitre.org/beta/techniques/\nT1059/003/.\n\n[5] NirSoft. Tools update for the new encryption of Chrome / Chromium version 80. https://blog.nirsoft.net/2020/02/\n19/tools-update-new-encryption-chrome-chromium-version-80/.\n\n[6] GitHub. GitHub - agentzex - chrome_v80_password_grabber. https://github.com/agentzex/chrome_v80_password_\ngrabber.\n\n[7] MITRE. Security Support Provider. https://attack.mitre.org/techniques/T1101/.\n\n[8] malpedia. Lazarus Group. https://malpedia.caad.fkie.fraunhofer.de/actor/lazarus_group.\n\n\n-----\n\n[9] Proofpoint. North Korea Bitten by Bitcoin Bug: Financially motivated campaigns reveal new dimension of the\nLazarus Group. https://www.proofpoint.com/us/threat-insight/post/north-korea-bitten-bitcoin-bug-financiallymotivated-campaigns-reveal-new.\n\n[10] Lexfo. The Lazarus Constellation. https://blog.lexfo.fr/ressources/Lexfo-WhitePaper-The_Lazarus_Constellation.\npdf.\n\n[11] US-CERT. MAR-10135536-8 – North Korean Trojan: HOPLIGHT. https://www.us-cert.gov/ncas/analysis-reports/\nAR19-100A.\n\n[12] Intezer. Intezer Analyze - 777f03eda81f380b0da33d96968dcf9476e6e10459a457f107fec019bc26734b.\nhttps://analyze.intezer.com/#/files/777f03eda81f380b0da33d96968dcf9476e6e10459a457f107fec019bc26734b.\n\n[13] VirusTotal. VirusTotal - 777f03eda81f380b0da33d96968dcf9476e6e10459a457f107fec019bc26734b.\nhttps://www.virustotal.com/gui/file/777f03eda81f380b0da33d96968dcf9476e6e10459a457f107fec019bc26734b/\ndetection.\n\n[14] Twitter. Twitter - blackorbird. https://twitter.com/blackorbird/status/1176745824329424896.\n\n[15] Hybrid Analysis. Hybrid Analysis - 777f03eda81f380b0da33d96968dcf9476e6e10459a457f107fec019bc26734b.\nhttps://hybrid-analysis.com/sample/777f03eda81f380b0da33d96968dcf9476e6e10459a457f107fec019bc26734b.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://vblocalhost.com/uploads/VB2020-Takai-etal.pdf"
    ],
    "report_names": [
        "VB2020-Takai-etal.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041842,
    "ts_creation_date": 1600104559,
    "ts_modification_date": 1600252468,
    "files": {
        "pdf": "https://archive.orkl.eu/d9d80ef14c3661af4dbc68e654e9e023947fb50f.pdf",
        "text": "https://archive.orkl.eu/d9d80ef14c3661af4dbc68e654e9e023947fb50f.txt",
        "img": "https://archive.orkl.eu/d9d80ef14c3661af4dbc68e654e9e023947fb50f.jpg"
    }
}