{
    "id": "19a159a1-7c80-4828-9966-2a8366f6c9b1",
    "created_at": "2023-01-12T15:07:36.35278Z",
    "updated_at": "2025-03-27T02:08:40.597099Z",
    "deleted_at": null,
    "sha1_hash": "bca1dd4429d85bcd06a06ef94ace3c96e8dd008d",
    "title": "2017-10-19 - A New IoT Botnet Storm is Coming",
    "authors": "",
    "file_creation_date": "2022-05-28T17:40:55Z",
    "file_modification_date": "2022-05-28T17:40:55Z",
    "file_size": 1307520,
    "plain_text": "# A New IoT Botnet Storm is Coming\n\n**research.checkpoint.com/new-iot-botnet-storm-coming/**\n\nOctober 19, 2017\n**Key Points:**\n\n\nOctober 19, 2017\n\n\nA massive Botnet is forming to create a cyber-storm that could take down the internet.\nAn estimated million organizations have already been scanned with an unknown\namount actually infected.\nThe Botnet is recruiting IoT devices such as IP Wireless Cameras to carry out the\nattack.\n\nNew cyber-storm clouds are gathering. Check Point Researchers have discovered a brand\nnew Botnet, dubbed ‘IoTroop’, evolving and recruiting IoT devices at a far greater pace and\nwith more potential damage than the Mirai botnet of 2016.\n\nIoT Botnets are Internet connected smart devices which have been infected by the same\nmalware and are controlled by a threat actor from a remote location. They have been behind\nsome of the most damaging cyberattacks against organizations worldwide, including\nhospitals, national transport links, communication companies and political movements.\n\nWhile some technical aspects lead us to suspect a possible connection to Mirai, this is an\nentirely new and far more sophisticated campaign that is rapidly spreading worldwide. It is\ntoo early to guess the intentions of the threat actors behind it, but with previous Botnet DDoS\nattacks essentially taking down the Internet, it is vital that organizations make proper\npreparations and defense mechanisms are put in place before an attack strikes.\n\n\n-----\n\nOminous signs were first picked up via Check Point s Intrusion Prevention System (IPS) in\nthe last few days of September. An increasing number of attempts were being made by\nhackers to exploit a combination of vulnerabilities found in various IoT devices.\n\nWith each passing day the malware was evolving to exploit an increasing number of\nvulnerabilities in Wireless IP Camera devices such as GoAhead, D-Link, TP-Link, AVTECH,\nNETGEAR, MikroTik, Linksys, Synology and others. It soon became apparent that the\nattempted attacks were coming from many different sources and a variety of IoT devices,\nmeaning the attack was being spread by the IoT devices themselves.\n\nSo far we estimate over a million organizations have already been scanned worldwide,\nincluding the US, Australia and everywhere in between, and the number is only increasing.\n\nOur research suggests we are now experiencing the calm before an even more powerful\nstorm. The next cyber hurricane is about to come.\n\n**Research Background**\n\nCreating networks of infected devices is not a quick task for an attacker. In order to establish\nan effective Botnet, the attacker needs to be able to control a vast number of devices. As\nsending the malicious code to each device individually would be a large and time consuming\ntask, it is much easier to have each infected device spreading the malicious code to other\nsimilar devices themselves. This method of attack is considered a propagation attack, and is\nessential in quickly creating a large network of controlled devices.\n\n\n-----\n\nOur research began at the end of September 17 after noticing an increase in attempts to\npenetrate our IoT IPS protections. Following this suspicious activity, we soon realized we\nwere witnessing the recruitment stages of a vast IoT Botnet.\n\n**Analyzing A Node In The Chain**\n\nWith the Check Point Global Threat Map showing a large number of hits on our IoT IPS\nprotections, our team started to look into some of the attack sources in order to get a better\npicture of what was going on. Below is an analysis of one of these devices.\n\nFrom looking at this site, we can gather that this specific IP (blurred above) belongs to a\nGoAhead camera with an open Port 81 running over TCP. This is just one example of an\ninfected device type. There are many others – e.g. D-Link, NETGEAR and TP-Link devices\nto name a few.\n\nOn further inspection, the System.ini file (shown below) of the device at this IP was accessed\nto check for compromise. On a normal machine, this file would contain the credentials of the\nuser. What was found on this device, however, was an edited version with a ‘Netcat’\ncommand which opened a reverse shell to the attack’s IP. This tells us that this machine was\n\n\n-----\n\nmerely one link in the chain and that it was both infected and then also transmitting the\ninfection. In this case the ‘CVE-2017-8225’ vulnerability was used to penetrate the GoAhead\ndevice and, after infecting a target machine, that same target started to look for other devices\nto infect.\n\nUpon further research, it was found that numerous devices were both being targeted and\nlater sending out the infection. These attacks were coming from many different types of\ndevices and many different countries, totaling approximately 60% of the corporate networks\nwhich are part of the ThreatCloud global network.\n\n\n-----\n\nTo conclude, in the last few days a new botnet has been evolving. While some technical\naspects lead us to suspect a possible connection to the Mirai botnet, this is an entirely new\ncampaign rapidly spreading throughout the globe. It is too early to assess the intentions of\nthe threat actors behind it, but it is vital to have the proper preparations and defense\nmechanisms in place before an attack strikes.\n\n**IPS Coverage**\n\nWhile this may be an emerging threat of millions of attacks being conducted, the methods of\ninfection are already being prevented by Check Point IPS. The vulnerability listed has been\ncovered, and devices are currently being monitored for new variants. The table below\noutlines the IoT protections released by IPS that are related and potentially related to this\nattack.\n\n**Vendor** **Protection Name** **Seen in the**\n**Context of the**\n**current Attack?**\n\n\nGoAhead Wireless IP Camera (P2P)\nWIFICAM Cameras\nInformation Disclosure\n\n\nWireless IP Camera (P2P)\nWIFICAM Cameras Remote Code\nExecution\n\n\n+\n\n\nD-Link D-Link 850L Router Remote\nCode Execution\n\n\n+\n\n+\n\n\n-----\n\nD-Link DIR800 Series Router\nRemote Code Execution\n\nD-Link DIR800 Series Router\nInformation Disclosure\n\nD-Link 850L Router Remote\nUnauthenticated Information\nDisclosure\n\nD-Link 850L Router Cookie\nOverflow Remote Code Execution\n\nDlink IP Camera Video Stream\nAuthentication Bypass – Ver2\n\nDlink IP Camera Luminance\nInformation Disclosure – Ver2\nD-Link DIR-600/300 Router\nUnauthenticated Remote Command\nExecution\n\nDlink IP Camera Authenticated\nArbitrary Command Execution –\nVer2\n\n\n+\n\n+\n\n+\n\n+\n\n+\n\n+\n+\n\n–\n\n\nTP-Link TP-Link Wireless Lite N\nAccess Point Directory\nTraversal\n\n\nTP-LINK WR1043N Multiple CrossSite Request Forgery\n\n\n–\n\nNetgear DGN\nUnauthenticated Command\nExecution\nNetgear ReadyNAS Remote\nCommand Execution\n\n\n–\n\n+\n+\n\n–\n\n\nNETGEAR Netgear DGN2200\ndnslookup.cgi Command\nInjection\n\n\nNetgear ProSAFE NMS300\nfileUpload.do Arbitrary File Upload\n\nNETGEAR Routers Authentication\nBypass\n\n\n–\n\n–\n\n\n-----\n\nNETGEAR ReadyNAS np_handler\nCode Execution\n\nNetgear R7000 and R6400 cgi-bin\nCommand Injection\n\n\n–\n\n–\n\n\nAVTECH AVTECH Devices Multiple\nVulnerabilities\n\nMikroTik MikroTik RouterOS SNMP\nSecurity Bypass\n\n\nMikroTik RouterOS Admin\nPassword Change\n\nMikrotik Router Remote Denial Of\nService\n\n\n–\n\n–\n\n\nLinksys Belkin Linksys WRT110\nRemote Command Execution\n– Ver2\n\n\n+\n\n–\n\n–\n\n–\n\n+\n\n\nLinksys WRH54G HTTP\nManagement Interface DoS Code\nExecution – Ver2\n\nBelkin Linksys WRT110 Remote\nCommand Execution\n\nBelkin Linksys Multiple Products\nDirectory Traversal\n\nBelkin Linksys E1500/E2500\nRemote Command Execution\n\nCisco Linksys PlayerPT ActiveX\nControl Buffer Overflow\n\nCisco Linksys PlayerPT ActiveX\nControl SetSource sURL Argument\nBuffer Overflow\n\n\n–\n\n–\n\n–\n\n+\n\n–\n\n–\n\n\nSynology Synology DiskStation\nManager SLICEUPLOAD\nCode Execution\n\nLinux Linux System Files\nInformation Disclosure\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-19 - A New IoT Botnet Storm is Coming.pdf"
    ],
    "report_names": [
        "2017-10-19 - A New IoT Botnet Storm is Coming.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536056,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653759655,
    "ts_modification_date": 1653759655,
    "files": {
        "pdf": "https://archive.orkl.eu/bca1dd4429d85bcd06a06ef94ace3c96e8dd008d.pdf",
        "text": "https://archive.orkl.eu/bca1dd4429d85bcd06a06ef94ace3c96e8dd008d.txt",
        "img": "https://archive.orkl.eu/bca1dd4429d85bcd06a06ef94ace3c96e8dd008d.jpg"
    }
}