{
    "id": "19b4097b-cde1-456a-a9ea-5b59f2c60c7f",
    "created_at": "2023-01-12T15:05:29.542319Z",
    "updated_at": "2025-03-27T02:13:16.64624Z",
    "deleted_at": null,
    "sha1_hash": "a1eaa549fc181799552bae0caeb17598794d7063",
    "title": "2021-06-07 - Adventures in Contacting the Russian FSB",
    "authors": "",
    "file_creation_date": "2022-05-28T04:11:12Z",
    "file_modification_date": "2022-05-28T04:11:12Z",
    "file_size": 4581843,
    "plain_text": "# Adventures in Contacting the Russian FSB\n\n**[krebsonsecurity.com/2021/06/adventures-in-contacting-the-russian-fsb/](https://krebsonsecurity.com/2021/06/adventures-in-contacting-the-russian-fsb/)**\n\nKrebsOnSecurity recently had occasion to contact the Russian Federal Security Service\n(FSB), the Russian equivalent of the U.S. Federal Bureau of Investigation (FBI). In the\nprocess of doing so, I encountered a small snag: The FSB’s website said in order to\ncommunicate with them securely, I needed to download and install an encryption and virtual\nprivate networking (VPN) appliance that is flagged by at least 20 antivirus products as\nmalware.\n\nThe FSB headquarters at Lubyanka Square, Moscow. Image: Wikipedia.\n\nThe reason I contacted the FSB — one of the successor agencies to the Russian KGB —\nironically enough had to do with security concerns raised by an infamous Russian hacker\nabout the FSB’s own preferred method of being contacted.\n\n[KrebsOnSecurity was seeking comment from the FSB about a blog post published by](https://cybersec.org/anews/czib-fsb-rasprostranyaet-troyan-pri-obrashheniyah-pod-vidom-generatora-sluchajnyh-chisel.html)\n[Vladislav “BadB” Horohorin, a former international stolen credit card trafficker who served](https://en.wikipedia.org/wiki/Vladislav_Horohorin)\nseven years in U.S. federal prison for his role in the theft of $9 million from RBS WorldPay in\n2009. Horohorin, a citizen of Russia, Israel and Ukraine, is now back where he grew up in\nUkraine, running a cybersecurity consulting business.\n\n\n-----\n\nHorohorin’s BadB carding store, badb[.]biz, circa 2007. Image: Archive.org.\n\nVisit the FSB’s website and you might notice its web address starts with http:// instead of\nhttps://, meaning the site is not using an encryption certificate. In practical terms, any\ninformation shared between the visitor and the website is sent in plain text and will be visible\nto anyone who has access to that traffic.\n\nThis appears to be the case regardless of which Russian government site you visit.\nAccording to [Russian search giant Yandex, the laws of the Russian Federation demand that](https://browser.yandex.com/help/tls/tls.html)\n[encrypted connections be installed according to the Russian GOST cryptographic algorithm.](https://en.wikipedia.org/wiki/GOST_(block_cipher))\n\nThat means those who have a reason to send encrypted communications to a Russian\ngovernment organization — including ordinary things like making a payment for a\ngovernment license or fine, or filing legal documents — need to first install CryptoPro, a\nWindows-only application that loads the GOST encryption libraries on a user’s computer.\n\nBut if you want to talk directly to the FSB over an encrypted connection, you can just install\ntheir own client, which bundles the CryptoPro code. Visit the FSB’s site and select the option\nto “transfer meaningful information to operational units,” and you’ll see a prompt to install a\n“random number generation” application that is needed before a specific contact form on the\nFSB’s website will load properly.\n\nMind you, I’m not suggesting anyone go do that: Horohorin pointed out that this random\nnumber generator was flagged by 20 different antivirus and security products as malicious.\n\n“Think well before contacting the FSB for any questions or dealing with them, and if you\nnevertheless decide to do this, it is better to use a virtual machine,” Horohorin wrote. “And a\nspacesuit. And, preferably, while in another country.”\n\n\n-----\n\nAntivirus product detections on the FSB’s VPN software. Image: VirusTotal.\n\nIt’s probably worth mentioning that the FSB is the same agency that’s been sanctioned for\nmalicious cyber activity by the U.S. government on multiple occasions over the past five\nyears. According to the most recent sanctions by the U.S. Treasury Department, the FSB is\nknown for recruiting criminal hackers from underground forums and offering them legal cover\nfor their actions.\n\n“To bolster its malicious cyber operations, the FSB cultivates and co-opts criminal hackers,\n[including the previously designated Evil Corp., enabling them to engage in disruptive](https://krebsonsecurity.com/2019/12/inside-evil-corp-a-100m-cybercrime-menace/)\nransomware attacks and phishing campaigns,” reads a Treasury assessment from April\n2021.\n\nWhile Horohorin seems convinced the FSB is disseminating malware, it is not unusual for a\n[large number of security tools used by VirusTotal or other similar malware “sandbox” services](https://www.virustotal.com/)\nto incorrectly flag safe files as bad or suspicious — an all-too-common condition known as a\n“false positive.”\n\nLate last year I [warned my followers on Twitter to put off installing updates for their Dell](https://twitter.com/briankrebs/status/1326235217250672641)\nproducts until the company could explain why a bunch of its software drivers were being\ndetected as malware by two dozen antivirus tools. Those all turned out to be false positives.\n\nTo really figure out what this FSB software was doing, I turned to Lance James, the founder\nof [Unit221B, a New York City based cybersecurity firm. James said each download request](https://www.unit221b.com/)\ngenerates a new executable program. That is because the uniqueness of the file itself is part\nof what makes the one-to-one encrypted connection possible.\n\n\n-----\n\nEssentially it is like a temporary, one-time-use VPN, using a separate key for each\ndownload” James said. “The executable is the handshake with you to exchange keys, as it\nstores the key for that session in the exe. It’s a terrible approach. But it’s what it is.”\n\nJames said the FSB’s program does not appear to be malware, at least in terms of the\nactions it takes on a user’s computer.\n\n“There’s no sign of actual trojan activity here except the fact it self deletes,” James said. “It\nuses GOST encryption, and [the antivirus products] may be thinking that those properties\nlook like ransomware.”\n\nJames says he suspects the antivirus false-positives were triggered by certain behaviors\nwhich could be construed as malware-like. The screenshot below — from VirusTotal — says\nsome of the file’s contents align with detection rules made to find instances of ransomware.\n\nSome of the malware detection rules triggered by the FSB’s software. Source: VirusTotal.\n\nOther detection rules tripped by this file include program routines that erase event logs from\nthe user’s system — a behavior often seen in malware that is trying to hide its tracks.\n\nOn a hunch that just including the GOST encryption routine in a test program might be\nenough to trigger false positives in VirusTotal, James wrote and compiled a short program in\n[C++ that invoked the GOST cipher but otherwise had no networking components. He then](https://en.wikipedia.org/wiki/C%2B%2B)\nuploaded the file for scanning at VirusTotal.\n\n\n-----\n\nEven though James test program did nothing untoward or malicious, it was flagged by six\nantivirus engines as potentially hostile. Symantec’s machine learning engine seemed\nparticularly certain that James’ file might be bad, awarding it the threat name\n“ML.Attribute.HighConfidence” — the same designation it assigned to the FSB’s program.\n\nKrebsOnSecurity installed the FSB’s software on a test computer using a separate VPN, and\nstraight away it connected to an Internet address currently assigned to the FSB\n(213.24.76.xxx).\n\nThe program prompted me to click on various parts of the screen to generate randomness\nfor an encryption key, and when that was done it left a small window which explained in\nRussian that the connection was established and that I should visit a specific link on the\nFSB’s site.\n\nThe FSB’s random number generator in action.\n\nDoing so opened up a page where I could leave a message for the FSB. I asked them if they\nhad any response to their program being broadly flagged as malware.\n\n\n-----\n\nThe contact form that ultimately appeared after installing the FSB’s software and clicking a specific\n\nlink at fsb[.]ru.\n\nAfter all the effort, I’m disappointed to report that I have not yet received a reply. Nor did I\n[hear back from S-Terra CSP, the company that makes the VPN software offered by the FSB.](https://wikileaks.org/plusd/cables/06MOSCOW12936_a.html)\n\nJames said that given their position, he could see why many antivirus products might think\nit’s malware.\n\n“Since they won’t use our crypto and we won’t use theirs,” James said. “It’s a great\nexplanation on political weirdness with crypto.”\n\nStill, James said, a number of things just don’t make sense about the way the FSB has\nchosen to deploy its one-time VPN software\n\n\n-----\n\nThe way they have set this up to suddenly trust a dynamically changing exe is still very\nconcerning. Also, why would you send me a 256 random number generator seed in an exe\nwhen the computer has a perfectly valid and tested random number generator built in?\nYou’re sending an exe to me with a key you decide over a non-secure environment. Why the\nfuck if you’re a top intelligence agency would you do that?”\n\nWhy indeed. I wonder how many people would share information about federal crimes with\nthe FBI if the agency required everyone to install an executable file first — to say nothing of\none that looks a lot like ransomware to antivirus firms?\n\nAfter doing this research, I learned the FSB recently launched a website that is only\n[reachable via Tor, software that protects users’ anonymity by bouncing their traffic between](https://www.torproject.org/)\ndifferent servers and encrypting the traffic at every step of the way. Unlike the FSB’s clear\nweb site, the agency’s Tor site does not ask visitors to download some dodgy software\nbefore contacting them.\n\n“The application is running for a limited time to ensure your safety,” the instructions for the\nFSB’s random number generator assure, with just a gentle nudge of urgency. “Do not forget\nto close the application when finished.”\n\nYes, don’t forget that. Also, do not forget to incinerate your computer when finished.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-07 - Adventures in Contacting the Russian FSB.pdf"
    ],
    "report_names": [
        "2021-06-07 - Adventures in Contacting the Russian FSB.pdf"
    ],
    "threat_actors": [
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535929,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1653711072,
    "ts_modification_date": 1653711072,
    "files": {
        "pdf": "https://archive.orkl.eu/a1eaa549fc181799552bae0caeb17598794d7063.pdf",
        "text": "https://archive.orkl.eu/a1eaa549fc181799552bae0caeb17598794d7063.txt",
        "img": "https://archive.orkl.eu/a1eaa549fc181799552bae0caeb17598794d7063.jpg"
    }
}