{
    "id": "19d21d1b-faf8-4b27-a322-0bb0ab932d46",
    "created_at": "2023-01-12T15:04:23.698293Z",
    "updated_at": "2025-03-27T02:16:26.142558Z",
    "deleted_at": null,
    "sha1_hash": "a3d4a9252e4445f738fe3d924b16c6499cb69955",
    "title": "2016-10-05 - FastPOS Updates in Time for the Retail Sale Season",
    "authors": "",
    "file_creation_date": "2011-12-20T14:35:24Z",
    "file_modification_date": "2011-12-20T16:33:20Z",
    "file_size": 5142269,
    "plain_text": "## Cisco 2011Annual\n Security Report\n\n###### Highlighting global security threats and trends\n\n\n-----\n\n###### The Cisco[®] Annual Security Report\n provides an overview of the combined\n security intelligence of the entire Cisco\n organization. The report encompasses\n threat information and trends collected\n between January and November 2011.\n It also provides a snapshot of the state\n of security for that period, with special\n attention paid to key security trends\n expected for 2012.\n\n\n-----\n\n###### PART 1\n\n 3 Welcome to the Connected World \n\n 5 Your Future Workers: Loaded with Devices, and Not Overly Concerned About Security\n\n 8 Social Media: Now, It’s a Productivity Tool\n\n 10 Remote Access and BYOD: Enterprises Working to Find Common Ground with Employees\n\n 16 The Influence of Mobile Devices, Cloud Services, and Social Media on Security Policy  in the Enterprise\n\n PART 2\n\n 22 Cyber Threat Outlook for 2012: The Hacktivism Factor\n\n 23 Geopolitical Trends: Social Media Wields “Gathering” Power\n\n 24 Announcing the 2011 Winners of the Cisco Cybercrime Showcase\n\n 26 The Cisco Cybercrime Return on Investment (CROI) Matrix\n\n 28 2011 Vulnerability and Threat Analysis\n\n 29 Global Spam Update: Dramatic Decline in Spam Volume\n\n 31 The Cisco Global ARMS Race Index\n\n 32 The Internet: A Fundamental Human Necessity?\n\n 35 Cisco Security Intelligence Operations\n\n\n###### PART 2\n\n\n-----\n\n# 1\n\n\n-----\n\n#### Welcome to the Connected World\n\n\n#### Welcome to the Connected World\n\n\nFor instance, most college students (81 percent)\nsurveyed globally believe they should be able to choose\nthe devices they need to do their jobs—either by having\ntheir employers pay for them or bringing their own\npersonal devices to work. In addition, almost threequarters of students surveyed believe they should be\nable to use such devices for both business and personal\nuse. Multiple devices are becoming commonplace:\n77 percent of surveyed employees worldwide have\nmultiple devices in use, such as a laptop and a\nsmartphone or multiple phones and computers. (See\n“Your Future Workers: Loaded with Devices, and Not\nOverly Concerned About Security,” page 5.)\n\n###### A Balanced, Flexible Approach to Security\n\nTrends such as the influx of consumer devices in the\nworkplace will require more flexible and creative solutions\nfrom IT staff for maintaining security while enabling\naccess to collaborative technologies. Given the desire\nof workers to bring the devices they use at home into\nthe workplace, enterprises need to adopt a “bring your\nown device” (BYOD) vision—that is, securing the network\nand data regardless of how workers access information.\n(See “Remote Access and BYOD: Enterprises Working\nto Find Common Ground with Employees,” page 10.)\n\n\nImagine the 1960s office of the fictional advertising\nagency portrayed on the American television show\n“Mad Men”: When it came to technology, workers\ncould avail themselves of typewriters and telephones\n(both operated largely by the secretarial pool)—which\nwere basically all they had in the way of productivityenhancing equipment. Employees attended perhaps\none or two meetings a day; work began when people\narrived at the office, and stopped when they went home.\n\nToday’s workers get more done over breakfast or during\nthe morning commute than their 1960s predecessors\naccomplished in an entire day. Thanks to the array of\ntechnology innovations flooding into the workplace—\neverything from tablets to social networking to videoconferencing systems such as telepresence—employees\ncan work almost anywhere and anytime they need\nto, provided the right technology is there to support\nconnectivity and, even more importantly, provide security.\nIn fact, the modern workplace may differ from its 1960s\ncounterpart most dramatically in terms of the lack of\nactual people: Showing up at the office is less and\nless necessary.\n\nAlong with the onslaught of technology innovations,\nthere’s also been a shift in attitude. Today’s workers\nhave become so accustomed to the productivity benefits\nand ease of use of their devices, social networks, and\nweb applications that they see no reason why they\n\n\ncan’t use all these tools for work as well as for play.\nThe boundaries between work and home are nearly\nnonexistent: These workers chat with their supervisors\non Facebook, check work email on Apple iPads after\nwatching a movie with the kids, and turn their own\nsmartphones into mini-workstations.\n\nUnsurprisingly, many enterprises are questioning the\nimpact of technology innovation and flexible work habits\non corporate information security—and sometimes, take\nthe drastic step of banning devices or restricting access\nto web services that workers say they need (and do\nneed, in most cases). But organizations that don’t allow\nworkers this flexibility—for instance, allowing them to use\nonly a given company-owned smartphone—will soon find\nthey can’t attract talent or remain innovative.\n\n[Research conducted for the Cisco Connected World](http://www.cisco.com/en/US/netsol/ns1120/index.html)\n_[Technology Report study (www.cisco.com/en/US/netsol/](http://www.cisco.com/en/US/netsol/ns1120/index.html)_\n[ns1120/index.html) documents changing attitudes toward](http://www.cisco.com/en/US/netsol/ns1120/index.html)\nwork, technology, and security among college students\nand young professionals around the globe, who are\ndriving the next waves of change in the enterprise.\n(Workers of all ages have been responsible for increasing\nadoption of consumer devices in the workplace and\nanytime/anywhere information access, but younger\nworkers and new graduates are drastically speeding up\nthe pace of change.) This year’s edition of the Cisco\n_Annual Security Report highlights many key findings from_\nthis research, exploring the impact on enterprises and\nsuggesting strategies for enabling innovation.\n\n\n-----\n\nWorkers must be part of this compromise: They need\nto see the value of cooperating with IT so they can use\nthe tools they have come to rely on—and help lay the\ngroundwork for a process that will enable faster adoption\nof new technologies in the workplace as they emerge.\n\nAnother fundamental adjustment by enterprises and their\nsecurity teams is the acceptance of the public nature of\nbusiness. According to the Connected World study, young\nprofessionals and students see far fewer boundaries\nbetween work life and personal life: 33 percent of\ncollege students say they don’t mind sharing personal\ninformation online.\n\n“The older generation assumes everything is private,\nexcept what they choose to make public,” explains\nDavid Evans, chief futurist for Cisco. “To the younger\ngeneration, everything is public, except what they\nchoose to make private. This default position—that\neverything is public—goes against how enterprises have\nworked in the past. They’ve competed and innovated\nbased on protecting their information from being exposed.\nHowever, they need to realize that the benefits they\nreceive from sharing information are greater than the\nrisks of keeping information within their walls.”\n\nThe good news for IT is that their role as enablers\nof collaboration and sharing should lead to greater\nresponsibility—and hopefully, more budget—for the\nenterprise’s growth and development. “Success is\nwhen IT can enable these dramatic changes in the\nworkplace, not inhibit them,” says John N. Stewart,\nvice president and chief security officer for Cisco.\n“We should not focus on specific issues, like whether\nto allow people to use their iPads at work, because it’s\na foregone conclusion. Rather, focus on solutions to\nthe bigger business challenge: enabling technology\nfor competitive advantage ”\n\n\n“Today’s IT departments need to enable the chaos that\ncomes from a BYOD environment,” says Nasrin Rezai,\nCisco’s senior director of security architecture and chief\nsecurity officer for the Collaboration Business Group.\n“This doesn’t mean accepting high levels of risk, but\nbeing willing to manage some risks in exchange for\nattracting talent and delivering innovation. It’s about\nmoving to a world in which not every technology asset\ncan be managed by IT.”\n\n\nA willingness to balance risks and benefits is a hallmark\nof IT’s new posture toward security. Instead of outright\nbans on devices or access to social media, enterprises\nmust exchange flexibility for controls that workers agree\nto. For instance, IT staff may say, “You can use your\npersonal smartphone to read and respond to company\nemail, but we need to manage that asset. And if you lose\nthat phone, we’ll need to erase data remotely, including\nyour personal apps and pictures of your family.”\n\n\n-----\n\n### Your Future Workers:\n#### Loaded with Devices, and Not Overly Concerned About Security\n\n\n-----\n\n###### Ten years ago, employees were assigned laptops and told not to lose them. They were given logins Prefers an unconventional work schedule, to the company network, and told not to tell working anytime and anywhere anyone their password. End of security training.\n\n Today, your “millennial” employees—the people you Believes he should be allowed to access social media want to hire because of the fresh ideas and energy and personal websites from company-issued devices they can bring to your business—show up to their first day on the job toting their own phones, tablets, and laptops, and expect to integrate them into their work Checks Facebook page\n\nat least once a day\n\n###### life. They also expect others—namely, IT staff and chief information officers—to figure out how they can use their treasured devices, anywhere and anytime T H E A N Y T I M E , A N Y W H E R E Y O U N G W O R K E R they want to, without putting the enterprise at risk. Security, they believe, is not really their responsibility:\n\nDoesn’t believe he needs to be in the office\n\n###### They want to work hard, from home or the office, on a regular basis using social networks and cloud applications to get the job done, while someone else builds seamless security into their interactions. Believes that IT is ultimately responsible\n\nfor security, not him\n\n###### Research from the Connected World study offers a snapshot of how younger workers and college students about to enter the workforce view security, Will violate IT policies if it’s access to information, and mobile devices. Here’s a necessary to get the job done snapshot of who you’ll be hiring, based on findings from the study:\n\nOwns multiple devices, such as laptops, tablets,\nand mobile phones (often more than one)\n\n\n-----\n\nWould hesitate to work at a company\nthat banned access to social media\n\nWants to choose devices to bring to work—\neven her personal laptop and gadgets\n\nDoesn’t want to work in the office all the time—believes she’s\nmore productive when she can work from anywhere, anytime\n\n###### T H E C O N N E C T E D C O L L E G E S T U D E N T\n\nIf forced to choose, would pick\nInternet access over having a car\n\nNot very concerned about\nprotecting passwords\n\nSource: Cisco Connected World Technology Report\n\nChecks Facebook page\nat least once a day\n\nAllows other people—even strangers—\nto use her computers and devices\n\n\n-----\n\n#### Social Media: Now, It’s a Productivity Tool\n\n\n#### Social Media:\n\n\nFacebook and Twitter long ago moved beyond mere\nnovelty sites for teens and geeks, and became vital\nchannels for communicating with groups and promoting\nbrands. Young professionals and college students know\nthis, and weave social media into every aspect of their\nlives. (And while Facebook and Twitter are the dominant\nplayers in much of the world, many other regional\nsocial networks are becoming just as essential to online\ninteraction—for instance, Qzone in China, VKontakte in\nRussia and former Soviet-bloc countries, Orkut in Brazil,\nand Mixi in Japan.)\n\nHowever, enterprises may not understand the extent\nto which social media has made inroads into the public\nand private lives of their employees, especially younger\nworkers—and therefore, do not feel the need to yield to\ngrowing demand in their workforce for unfettered access\nto social networks like Facebook or content-sharing sites\nsuch as YouTube. Unfortunately, this inertia may cost\nthem the talent they need to grow and succeed. If access\nto social networks isn’t granted, young professionals\nwho expect to have it are likely to seek work at companies\nthat do provide such access. These attitudes are even\nmore prevalent among college students, who have been\nusing social media from a young age.\n\nAccording to research for the Connected World study,\ncollege students and young workers center their social\nand business interactions around Facebook. Eightynine percent of college students surveyed check their\nFacebook page at least once a day; seventy-three percent\nof young professionals do so as well. For young workers,\n\n\ntheir social media connections often extend into the\nworkplace: Seven out of 10 employees said they have\nfriended managers or co-workers on the social media site.\n\nGiven their level of activity on Facebook—and the lack of\ndistinction between personal and business use of the\nsocial media site—it stands to reason that young workers\nwant to carry their Facebook use into the office. Among\ncollege students surveyed, almost half (47 percent)\nsaid they believe companies should maintain flexible\nsocial media policies, presumably to allow them to stay\nconnected in their work and personal lives at any time.\n\nIf students encounter a workplace that discourages\nsocial media usage, they may avoid these companies\naltogether—or if they’re stuck working in these environ–\nments, they may try to subvert the rules blocking access\nto their favorite sites. More than half of college students\nsurveyed globally (56 percent) said if they encountered\na company that banned access to social media, they\nwould either not accept a job there, or would join and\nthen find a way to access social media despite corporate\npolicies. Two out of three college students (64 percent)\nsaid they plan to ask about social media usage policies\nduring job interviews, and one in four (24 percent) said\nsuch policies would be a key factor in their decision to\naccept a position.\n\n###### The Upside of Social Media Access\n\nSince social media is already so entrenched in the\ndaily lives of young professionals and future workers,\nenterprises can no longer view it as a passing nuisance\nor a negative, disruptive force. In fact, companies that\nblock or narrow access to social media likely will find\nthemselves at a competitive disadvantage.\n\n\nWhen enterprises accept social media use by the\nworkforce, they are providing their employees with the\ntools—and the culture—they need to be more productive,\ninnovative, and competitive. For example, hiring managers\ncan use social networks to recruit new talent. Marketing\nteams can monitor social media channels to track the\nsuccess of advertising campaigns or consumer sentiment\nabout brands. And customer service teams can respond\nto consumers who use social media to ask questions\nand provide feedback to companies.\n\nFears around security and data loss are a leading reason\nwhy many businesses don’t embrace social media,\nbut these concerns are likely out of proportion with the\ntrue level of risk (see “Myth vs. Reality: Social Media Is\nDangerous to the Enterprise” on facing page); in any\ncase, risks can be mitigated through the application of\ntechnology and user controls. For instance, web traffic\ncontrols can halt malware such as Koobface[1] that finds\n\n\n-----\n\ndon’t inhibit workers from browsing social media and\nusing it to connect with colleagues, customers, and\nbusiness partners. They are stopped from social media\nactivity only when they are in danger of downloading\nan infected file or clicking on a suspicious link. The\nprotection is invisible to users, and is built into the\nnetwork, not computers or devices. Workers get the\nsocial media access they demand, and businesses get\nthe information safety they require. (See more on social\nmedia protections in “The Future for Acceptable Use\nPolicies,” page 19.)\n\nSocial media sites themselves have responded to\nrequests to offer greater levels of control over what\nusers can see within a network. For example, a business\ncan allow workers to access YouTube to view videos\nrelated to its industry or product, but block access\nto adult content or gambling sites. And technology\nsolutions can filter social media traffic for incoming\nmalware or outgoing data (for instance, company files\nthat should not be emailed via social media or other\nweb-based services).\n\nTo protect a business’s users against unauthorized\naccess to their accounts, Facebook has steadily\nintroduced privacy features. While these are individual\nuser controls as opposed to network controls, businesses\ncan engage in discussion with workers and offer training\nabout the most useful privacy features for maintaining\ninformation security.\n\nBefore limiting access to social media, enterprises\nshould consider the business value of social media\nversus the risk of allowing it. Considering the findings\nof the Connected World study and the passion young\nworkers have for social media and its collaborative\npowers, businesses are likely to discover the benefits\noutweigh the risks—provided they find the right balance\nbetween acceptance and security.\n\n\n###### Myth vs. Reality:  Social Media Is Dangerous to the Enterprise\n\n**Myth:**\nAllowing employees to use social media opens the door wide to malware in the company network, and\nwill cause productivity to plummet. In addition, employees will divulge company secrets and inside gossip\non Facebook and Twitter, damaging the enterprise’s competitive position.\n\n\n###### Social Media Is Dangerous to the Enterprise\n\n**Myth:**\nAllowing employees to use social media opens the door wide to malware in the company network, and\nwill cause productivity to plummet. In addition, employees will divulge company secrets and inside gossip\non Facebook and Twitter, damaging the enterprise’s competitive position.\n\n**Reality:**\nThere’s no doubt that criminals have used social media networks to lure victims into downloading malware\nand handing over login passwords. But the fear of threats delivered via social media may be overblown.\nEmail messages remain the most popular way to get malware into networks.\n\nCertainly, enterprises should be concerned about loss of intellectual property, but social media doesn’t\ndeserve full blame for such losses. Employees who haven’t been trained to protect their employer’s\ninformation can unleash secrets by indiscreet chats in public places or via email as fast as they can tweet,\nand they can download company documents onto thumb drives as easily as trading information over\nFacebook email. The answer to IP leakage is not an outright ban on social media. It’s imbuing trust in the\nworkforce so workers don’t feel compelled to disclose sensitive information.\n\n“The loss of productivity due to social networking has been the subject of many media scare stories,” says\nJeff Shipley, manager of Cisco Security Research and Operations. “However, the truth is that employees\ncan do more work, and do so better and faster, when they use tools that let them rapidly collaborate on\nprojects and talk to customers. Today, social media networks are those tools. The productivity gains make\nup for the occasional downtime inherent in social networking.”\n\n######     “The truth is that employees can do more work, and do so better and faster, when they            use tools that let them rapidly collaborate  on projects and talk to customers.”\n\n—Jeff Shipley, manager of Cisco Security Research and Operations\n\n\n-----\n\n#### Remote Access and BYOD:\n###### Enterprises Working to Find Common Ground with Employees\n\n\n#### Remote Access and BYOD:\n\n\nAs for today’s college students, most can’t even imagine\na future work experience that did not include the ability to\naccess work remotely. According to the Cisco Connected\n_World Technology survey, nearly two in three college_\nstudents expect that, when they are in the workforce, they\nwill be able to access their corporate network using\ntheir home computer. Meanwhile, about half of college\nstudents expect to do the same using their personal\nmobile devices. And more than likely, if the enterprise\ndoes not allow them to do these things, these future\nworkers will find a way to overcome obstacles to access.\n\nThe report also reveals that most college students\n(71 percent) share the view that company-issued devices\nshould be available for both work and play because\n“work time often blends with personal time … It’s the way\nit is today and the way it will be in the future.” That latter\nstatement is very true, which is why more enterprises\nare moving to implement a BYOD practice. Other factors,\nincluding workforce mobility, the proliferation of new\n\n\nWhile the question of whether to allow employees\nto access social media during work hours and with\ncompany assets is top of mind for many organizations,\na more pressing concern is finding the right balance\nbetween allowing their employees to have access to\nthe tools and information they need to do their jobs\nwell—anytime, anywhere—while also keeping sensitive\ncorporate data, such as intellectual property and\nemployees’ personal information, secure.\n\nEnterprises across industries are starting to understand\nthey must adapt soon to “consumerization of IT”\n(employees’ introduction and adoption of consumer\ndevices in the enterprise) and the remote working\ntrends already under way in their organizations. It is\nbecoming increasingly clear that if they don’t change,\nthey cannot stay competitive, innovate, maintain a\nproductive workforce, and attract and keep top talent.\nAt the same time, they are realizing that maintaining\n\n**INTERNAL**\n\n###### Figure 1. The Stages of ACCESS Workforce Access Along the Any Device Journey\n\n\npreviously defined security borders is no longer possible.\n“IT organizations, particularly those in large companies,\nhave not been able to keep pace with the Internet-speed\ngrowth of new devices and the immediate adoption of\nthose devices by employees—especially younger workers,”\nsays Gavin Reid, Computer Security Incident Response\nTeam (CSIRT) manager for Cisco.\n\nThere clearly is an expectation among tomorrow’s young\nprofessionals—as well as many of today’s—that they will\nbe able to access whatever they need from wherever\nthey are in order to do their jobs. And if they aren’t\nprovided with that access, the consequences for the\nenterprise are potentially significant. As an example, the\n_Connected World study revealed that three in 10 young_\nprofessionals globally admit that the absence of remote\naccess would influence their job decisions, such as leaving\nan existing job sooner than later or declining job offers\noutright. They also indicate they would be more likely to\nslack off while on the job and experience lower morale.\n\n\n**INTERNAL**\n**ACCESS**\n\nHad to come into\nthe office to access\nresources\n\n\n**ANY DEVICE,**\n**ANYWHERE**\n\nAccess resources\nfrom anywhere with\nany device\n\n\n**VIRTUAL**\n**ENTERPRISE**\n\nEnterprise becomes\nvirtual, fully location-\nand service-independent\n\n\n**MARKET**\n\n**TREND**\n\nConsumerization\nof Services\n\n\n-----\n\n###### Technology Making a Safer Journey to BYOD for Cisco\n\nAs part of the decision to allow employees to use determines whether to allow or reject the entire\nany device for work, including unmanaged personal website, or individual objects on the website, based\ndevices, Cisco IT, along with CSIRT, sought a tool [on a reputation score from the Cisco IronPort](http://www.senderbase.org)\nthat would block malicious websites before they [SenderBase® Security Network (www.senderbase.](http://www.senderbase.org)\nloaded onto browsers. In short, they wanted protection [org) cloud-based email and web traffic monitoring](http://www.senderbase.org)\n\ndevices, and acquisition integration and management against zero-day threats—specifically those without a service. SenderBase assigns each website a\nof offshore and offsite outsource relationships, are also known signature. However, the solution also needed reputation score ranging from –10 to 10. Websites\nkey drivers. to preserve the user experience—not only to ensure with scores from –6 to –10 are blocked automatically,\n\nproductivity, but also to prevent employees from without scanning. Websites with scores from 6 to\n\nCisco is one organization already making the transition\n\nchanging their browser settings. 10 are allowed, also without scanning.\n\nto BYOD—and is learning quickly that this transformation\nrequires both long-term commitment and cross- Cisco IT and CSIRT achieved their goal by deploying Cisco deployed the Cisco IronPort S670 WSA\nfunctional engagement in the organization. Depicted the Cisco IronPort® S670 Web Security Appliance throughout its organization in three phases, which\nin Figure 1 on the previous page are the five stages (WSA), a web proxy that inspects and then either began with a six-month proof-of-concept program in\nof workforce access along what Cisco calls its “Any forwards or drops web traffic based on reputation one building of the Cisco campus in Research Triangle\nDevice” journey toward becoming a “virtual enterprise.” filters or the outcome of inline file scanning. (Cisco Park (RTP), North Carolina, followed by a two-year\nBy the time Cisco reaches the last stage of its planned does not use the WSA’s web-filtering capabilities to pilot program (2009–2011) in which the solution was\njourney, which will take several years, the organization block entire website categories because its policy is extended to all 3000 employees at the RTP campus.\nwill be increasingly location- and service-independent— to trust employees to use their time productively.) In 2011, the WSA was rolled out to other large\nand enterprise data still will be secure.[2] campus sites worldwide and tens of thousands of\n\nWhen a Cisco employee clicks a link or enters a employees. As of November 2011, Cisco’s global\n\nThe specific demands of an organization’s industry URL, the request is sent by way of Web Cache WSA deployment is 100 percent complete.\nsegment (regulatory demands) and corporate culture Communication Protocol (WCCP) to a load-balanced\n(risk tolerance versus innovation) drive BYOD decisions. pool of Cisco IronPort S670 WSAs. The WSA “Cisco is now experiencing its highest-ever level\n“I think for many organizations today, the BYOD issue is of protection from web-based threats,” says Jeff\nless a matter of ‘No, we can’t do it’ and more a question Bollinger, senior information security investigator for\nof ‘How do we do it? What positive, responsive actions Cisco. “We average 40,000 blocked transactions\nshould we take to manage the mobile device situation per hour. And in just one day, the WSAs blocked\nin our organization?’” says Nasrin Rezai, Cisco’s senior 7.3 million transactions, including 23,200 Trojan\ndirector of security architecture and chief security officer downloader attempts, over 6800 Trojan horses,\nfor the Collaboration Business Group. 700 worms, and nearly 100 phishing URLs.”\n\nOne common theme among organizations moving Learn more about Cisco’s deployment of the Cisco\ntoward the practice of BYOD is that there is buy-in [IronPort S670 WSA at: www.cisco.com/web/about/](http://www.cisco.com/web/about/ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_case_study_wsa_executive_summary.pdf)\nfrom top executives who are helping not only to bring [ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_](http://www.cisco.com/web/about/ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_case_study_wsa_executive_summary.pdf)\nthe matter to the forefront in the company, but also [case_study_wsa_executive_summary.pdf.](http://www.cisco.com/web/about/ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_case_study_wsa_executive_summary.pdf)\n\n2 F dditi l ti i t d th BYOD d l d t l b t th fi t f Ci ’ “A D i ” j _Ci_ _A_ _D_ _i_ _Pl_ _i_ _P_ _d_ _ti_ _S_ _d C_ _titi_ _F t_\n\n\nAs part of the decision to allow employees to use determines whether to allow or reject the entire\nany device for work, including unmanaged personal website, or individual objects on the website, based\ndevices, Cisco IT, along with CSIRT, sought a tool [on a reputation score from the Cisco IronPort](http://www.senderbase.org)\nthat would block malicious websites before they [SenderBase® Security Network (www.senderbase.](http://www.senderbase.org)\nloaded onto browsers. In short, they wanted protection [org) cloud-based email and web traffic monitoring](http://www.senderbase.org)\nagainst zero-day threats—specifically those without a service. SenderBase assigns each website a\nknown signature. However, the solution also needed reputation score ranging from –10 to 10. Websites\nto preserve the user experience—not only to ensure with scores from –6 to –10 are blocked automatically,\nproductivity, but also to prevent employees from without scanning. Websites with scores from 6 to\nchanging their browser settings. 10 are allowed, also without scanning.\n\nCisco IT and CSIRT achieved their goal by deploying Cisco deployed the Cisco IronPort S670 WSA\nthe Cisco IronPort® S670 Web Security Appliance throughout its organization in three phases, which\n(WSA), a web proxy that inspects and then either began with a six-month proof-of-concept program in\nforwards or drops web traffic based on reputation one building of the Cisco campus in Research Triangle\nfilters or the outcome of inline file scanning. (Cisco Park (RTP), North Carolina, followed by a two-year\ndoes not use the WSA’s web-filtering capabilities to pilot program (2009–2011) in which the solution was\nblock entire website categories because its policy is extended to all 3000 employees at the RTP campus.\nto trust employees to use their time productively.) In 2011, the WSA was rolled out to other large\n\ncampus sites worldwide and tens of thousands of\n\nWhen a Cisco employee clicks a link or enters a employees. As of November 2011, Cisco’s global\nURL, the request is sent by way of Web Cache WSA deployment is 100 percent complete.\nCommunication Protocol (WCCP) to a load-balanced\npool of Cisco IronPort S670 WSAs. The WSA “Cisco is now experiencing its highest-ever level\n\nof protection from web-based threats,” says Jeff\nBollinger, senior information security investigator for\nCisco. “We average 40,000 blocked transactions\nper hour. And in just one day, the WSAs blocked\n7.3 million transactions, including 23,200 Trojan\ndownloader attempts, over 6800 Trojan horses,\n700 worms, and nearly 100 phishing URLs.”\n\nLearn more about Cisco’s deployment of the Cisco\n[IronPort S670 WSA at: www.cisco.com/web/about/](http://www.cisco.com/web/about/ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_case_study_wsa_executive_summary.pdf)\n[ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_](http://www.cisco.com/web/about/ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_case_study_wsa_executive_summary.pdf)\n[case_study_wsa_executive_summary.pdf.](http://www.cisco.com/web/about/ciscoitatwork/downloads/ciscoitatwork/pdf/cisco_it_case_study_wsa_executive_summary.pdf)\n\n\n-----\n\ndrive it further. Rezai explains, “Executives are playing a\nlead role in driving adoption of BYOD in the enterprise.\nThey’re taking the risk of embracing the chaos, but also\nsaying, ‘We will do this systemically and architecturally,\nand evaluate our progress every step of the way.’” (See\nsidebar, “Questions to Ask Along Your Own ‘Any Device’\nJourney,” on facing page.)\n\nGovernance also is critical to the success of a BYOD\npractice. Cisco, as an example, maintains a BYOD steering\ncommittee, which is led by IT but includes key stakeholders\nfrom other business units, such as human resources\nand legal. Without formal governance, companies cannot\ndefine a clear path for how to move the organization\nsuccessfully and strategically from a managed world to\nan unmanaged or “borderless” world, where the security\nperimeter is no longer defined and IT does not manage\nevery technology asset in use in the organization.\n\n“Many people think BYOD is about the endpoint, but\nit’s much broader than that,” says Russell Rice, director\nof product management for Cisco. “It’s about ensuring\nconsistency of the user experience working from any\ndevice, whether it’s in a wired or wireless environment\nor in the cloud. It’s about the policy elements of interaction.\nAnd it’s about your data, how it’s secured, and how it\ntraverses inside all of those different environments.\nAll of these things must be taken into account when\nmoving to BYOD—it really is a change in mindset.”\n\n\n###### Myth vs. Reality: Workers Won’t Accept Enterprise Control  of Their Mobile Devices\n Myth: Employees will not accept an employer’s requirement to have some remote control over  the personal mobile device that they want to use for both work and play.\n\n\n###### Workers Won’t Accept Enterprise Control  of Their Mobile Devices\n Myth: Employees will not accept an employer’s requirement to have some remote control over  the personal mobile device that they want to use for both work and play.\n\n Reality:  Enterprises and employees must find common ground, with the company recognizing the individual’s need to use the device of his or her choice and the worker understanding that the company must do whatever is necessary to enforce its security policy and stay in compliance  with regulatory requirements related to data security.\n\nOrganizations must be able to identify unique devices when they enter the corporate network, link\ndevices to specific users, and control the security posture of devices used to connect to corporate\nservices. Technology is evolving that would allow the “containerization” of a device—that is, a virtual phone\nwithin a phone that could be shut off by an employer in the event the device is lost or stolen, without\ncompromising a user’s personal data, which is kept separate. Within the next few years, viable security\nsolutions based on this technology should be available for widespread enterprise use.\n\nUntil then, employees who want to use their personal device\nof choice for work must accept that the enterprise, for security\nreasons, retains certain rights in order to protect the device.\nThis includes requiring, among other things:\n\n   - Passwords\n\n   - Data encryption (including device and removable\nmedia encryption)\n\n   - Remote management options that allow IT to remotely\nlock or wipe a device if it is lost, stolen, or otherwise\ncompromised, or if the employee is terminated\n\nIf a worker does not accept policy enforcement and asset\nmanagement requirements that are designed to elevate a mobile\ndevice’s status to “trusted” according to the enterprise’s security\nstandards, then IT will not permit the employee to access\nsafeguarded company assets with his or her device of choice.\n\n\n-----\n\n###### Questions to Ask Along Your Own Any Device Journey\n\n\nWhen Cisco first embarked on its “Any Device” journey, the company identified 13 critical business areas affected by this new paradigm. The table below highlights\nthese focus areas and provides a list of questions that have helped Cisco identify—and avoid—potential pitfalls and determine how best to approach these\nconsiderations. Enterprises that want to adopt a BYOD practice should consider these questions as well.[3]\n\n**Business Area** **Business Questions to Answer**\n\nBusiness continuity planning Should noncorporate devices be granted access or restricted from business continuity planning?\nand disaster recovery Should there be an ability to remotely wipe any end device accessing the network if it is lost or stolen?\n\nHost management (patching) Will noncorporate devices be permitted to join existing corporate host-management streams?\n\nClient configuration management and\nHow will device compliance to security protocols be validated and kept up to date?\ndevice security validation\n\nWho should be entitled to what services and platforms on which devices?\nRemote-access strategies\n\nShould a contingent worker be given the same entitlement to end devices, applications, and data?\n\nShould policy change to permit installation of corporate-licensed software on noncorporate devices?\nSoftware licensing\n\nDo existing software agreements account for users accessing the same software application through multiple devices?\n\nEncryption requirements Should noncorporate devices comply with existing disk-encryption requirements?\n\nAuthentication and authorization Will noncorporate devices be expected or permitted to join existing Microsoft Active Directory models?\n\nRegulatory compliance management What will organizational policy be on the use of noncorporate devices in high-compliance or high-risk scenarios?\n\nAccident management and investigations How will corporate IT security and privacy manage incidents and investigations with noncorporate-owned devices?\n\nApplication interoperability How will the organization handle application interoperability testing with noncorporate devices?\n\nAsset management Does the organization need to change how it identifies the devices it owns to also identify what it does not own?\n\nSupport What will the organization’s policies be for providing support to noncorporate-owned devices?\n\n\n-----\n\n###### Mobile Device Distribution in the Enterprise and Malware Encounters\n\nThe Connected World survey revealed that three Even more startling, perhaps, is that Apple Inc.’s\nout of four employees worldwide (77 percent) have iPhone, iPad, and iPod touch devices are currently\nmultiple devices, such as a laptop and a smartphone the most dominant platform—significantly so. Google says the malware is not targeted specifically at\nor multiple phones and computers. Thirty-three Android holds the second spot, with Nokia/Symbian\npercent of young professionals (one in three) say devices ranking third.** These results underscore the\nthey use at least three devices for work. But which powerful impact that consumerization of IT has had impact on those devices.\nmobile device platforms are favored by most on enterprises in just a short period: The first iPhone\nworkers today, in general? was released in 2007; the first commercially available\n\nAndroid phone was launched in 2008.\n\nIn conducting research for the latest Cisco Global\n_Threat Report, Cisco ScanSafe took a close look at_ Cisco ScanSafe’s research also provides insight into\nthe types of mobile device platforms that workers which mobile device platforms are encountering\naround the world are using in the enterprise.* malware. The answer: all of them. (See chart below.) that target mobile device users, see the “Cisco\nSurprisingly, RIM BlackBerry devices—which While BlackBerry devices are currently experiencing\nhave long been accepted in most enterprise\nenvironments—are now the fourth most popular\nplatform among workers.\n\n###### Mobile Device Use by Enterprise Normalized Distribution of Encounters\n\n Android\n\n Nokia/Symbian\n\n BlackBerry\n\nSource: Cisco ScanSafe\n\n- Ci S S f billi f b d il S l b d l i f li d b\n\n\nThe Connected World survey revealed that three Even more startling, perhaps, is that Apple Inc.’s the majority of encounters (over 80 percent), Cisco’s\nout of four employees worldwide (77 percent) have iPhone, iPad, and iPod touch devices are currently senior security threat researcher Mary Landesman\nmultiple devices, such as a laptop and a smartphone the most dominant platform—significantly so. Google says the malware is not targeted specifically at\nor multiple phones and computers. Thirty-three Android holds the second spot, with Nokia/Symbian BlackBerry devices or users, and it’s doubtful the\npercent of young professionals (one in three) say devices ranking third.** These results underscore the malware encountered has infected or had any other\nthey use at least three devices for work. But which powerful impact that consumerization of IT has had impact on those devices.\nmobile device platforms are favored by most on enterprises in just a short period: The first iPhone\nworkers today, in general? was released in 2007; the first commercially available Landesman adds, “Wherever users go, cybercriminals\n\nAndroid phone was launched in 2008. will follow. As mobile device use continues to grow\n\nIn conducting research for the latest Cisco Global among enterprise users, malware targeting those\n_Threat Report, Cisco ScanSafe took a close look at_ Cisco ScanSafe’s research also provides insight into devices—and thus, users—also will grow. (For more\nthe types of mobile device platforms that workers which mobile device platforms are encountering on cybercriminals’ increasing investment in exploits\naround the world are using in the enterprise.* malware. The answer: all of them. (See chart below.) that target mobile device users, see the “Cisco\nSurprisingly, RIM BlackBerry devices—which While BlackBerry devices are currently experiencing Cybercrime Return on Investment Matrix,” page 26.)\nhave long been accepted in most enterprise\nenvironments—are now the fourth most popular\nplatform among workers.\n\n###### Mobile Device Use by Enterprise Normalized Distribution of Encounters\n\n Android\n\n iPhone/iPad/iPod touch\n\n Nokia/Symbian\n\n BlackBerry\n\n Windows Mobile\n\nSource: Cisco ScanSafe\n\n\n-----\n\n###### The iPad Revolution: Tablets and Security\n\n\nWhen the Apple iPad tablet computer launched Regardless of whether enterprises or workers A more strategic decision is to shift the security\nin 2010, it was positioned (and embraced by the are driving adoption of iPads and other tablets, the conversation away from specific devices, and toward\npublic) as a consumer device: Watching movies devices are generating questions and concerns about a BYOD enablement strategy with access based\nwith the kids, browsing the web while sitting on securing company information accessed via tablets. on user, role, and device type (for more on BYOD\nthe couch, and reading books were among the Unlike smartphones, iPads and tablets offer more practice, see page 10). The key to enabling any device\nfavorite use cases. robust compute platforms, with which workers can in the enterprise, whether it’s company-owned or\n\naccomplish more than they can with smartphones. brought from home, is identity management—that is,\n\nHowever, many industry sectors, like healthcare and Forward-thinking enterprises want to enable the understanding who’s using the device, where they’re\nmanufacturing, quickly saw the appeal of a powerful, inclusion of tablets, without compromising security. using it, and what information they’re accessing.\neasy-to-use mobile device for business use that In addition, enterprises welcoming tablet use in the\nwould bridge the gap between smartphones (too Innovation has caused constant change in IT—and the workplace will need methods for device management\nsmall) and laptops (too bulky). In a recent earnings rate of change is increasing. Companies that design (e.g., wiping data from lost devices), just as they\ncall, Apple’s chief financial officer said that 86 their device strategy around 2011’s popular choice have for smartphones and laptops.\npercent of Fortune 500 businesses and 47 percent (in this case, the iPad) will have to start the clock on\nof Global 500 companies are deploying or testing re-engineering their systems in a few years’ time, For tablets—and indeed, whatever new-and-cool\nthe iPad; companies such as General Electric Co. when new vendors, products, and features emerge. devices come into the enterprise next—security\nand SAP are creating custom iPad apps for internal professionals need to preserve the user experience\nprocesses; and Alaska Airlines and American Airlines even as they add security features. For instance,\npilots are using the iPad in cockpits to replace iPad users love the device’s touchscreen controls,\npaper-based navigational information.[4] such as moving fingers across the screen to view\n\nor zoom in on images. If IT departments build in\n\nAt the same time, workers who use iPads and other security that restricts these much-loved features,\ntablets at home are asking their employers to let users will balk at the changes.\nthem use the devices at the office—yet another\nconsumerization of IT milestone. This is reflected “The best approach to tablet security is one that\nin the Cisco Connected World study, in which 81 allows the ability to isolate business and personal\npercent of college students said they expect to apps and data reliably, applying appropriate security\nbe able to choose the device for their jobs, either policy to each,” says Horacio Zambrano, product\nreceiving budget to buy devices of their choice, or manager for Cisco. “Policy happens in the cloud or\nbringing in their own personal devices. with an intelligent network, while for the employee,\n\ntheir user experience is preserved and they can\nleverage the native app capabilities of the device.”\n\n\n-----\n\n#### The Influence of Mobile Devices, Cloud Services, and Social Media on\n Security Policy in the Enterprise\n\n\n#### Cloud Services, and Social Media on\n\n\n#### The Influence of Mobile Devices,\n\n\nsheets containing customer data, with controls to prevent\ndownloading or moving the data from centralized\napplications or databases, the chance of an employee\ndownloading that data to a personal or mobile device\nbefore leaving the company is greatly reduced.”\n\nPaschich also warns enterprises not to overlook a lower\nprofile but very potent threat to data security—USB devices.\n“While companies are worrying about whether or not\nto let an employee connect to the network with an\niPhone because they are concerned about undermining\nenterprise security, they are allowing their workers to\nplug USB devices into their laptops and copy whatever\ndata they want.”\n\nHe offers an additional tip for shoring up data protection\nin the enterprise: laying out DLP measures and acceptable\nuse policies (AUPs) in separate documents. “These\nefforts are interlocking, certainly, but they are different,”\nsays Paschich. (See “The Future for Acceptable Use\nPolicies,” page19.)\n\n###### Securing Enterprise Data in the Cloud\n\nCloud-based file sharing has become a popular and\nconvenient method for sharing large files across the\nInternet, and it represents another potential risk area for\nenterprise data security. The idea of sensitive corporate\ninformation being passed back and forth among webbased cloud services—which are not managed by the\nenterprise—can cause sleepless nights for security\nprofessionals.\n\n\n#### Security Policy in the Enterprise\n\n\nThe cost of just one data breach can be staggering\nfor an enterprise. Ponemon Institute estimates range\nanywhere from US$1 million to US$58 million.[5] The\ncost is not just financial, either: Damage to corporate\nreputation and loss of customers and market share are\npotential side effects of a high-profile data loss incident.\n\nAs more employees become mobile workers and use\nmultiple devices to access company assets and rely\non collaborative applications to work with others while\noutside the traditional “four walls” of the enterprise,\nthe potential for data loss grows. As an example, the\n_[Cisco Connected World survey (www.cisco.com/en/US/](http://www.cisco.com/en/US/netsol/ns1120/index.html)_\n[netsol/ns1120/index.html) found that almost half (46](http://www.cisco.com/en/US/netsol/ns1120/index.html)\npercent) of young professionals send work emails via\npersonal accounts.\n\n“The potential for data loss is high,” says David\nPaschich, web security product manager for Cisco.\n“Enterprises are steadily losing control over who has\naccess to their corporate network. And the simple fact\nthat more employees are using mobile devices for\nwork—and sometimes, multiple devices—means that\nthe potential for data loss due to theft or loss of a\ndevice is greater.”\n\nCybercriminals’ growing preference toward the use of\nlow-volume, targeted attacks, such as spearphishing\ncampaigns (see “Global Spam Update: Dramatic Decline\nin Spam Volume”, page 29), to steal information from\nhigh-value targets, and the increasing use of cloudbased file sharing services by enterprises to increase\n\n\nefficiency and reduce costs (see next section, “Securing\nEnterprise Data in the Cloud”) are also heightening the\npotential for data to be stolen or compromised.\n\nIn this landscape, it’s not surprising that more enterprises\nare renewing their focus on data loss prevention (DLP)\nefforts. “Today, businesses are evaluating their DLP\nprograms to determine two things: if they are protecting\nthe right data and if they are doing the right things to keep\nthat data safe,” says John N. Stewart, vice president and\nchief security officer for Cisco.\n\nWhen categorizing data that must be kept safe, a good\nstarting place for many organizations is to determine\nwhat data types require protection and security, based\non applicable laws and regulations, which can vary by\nindustry and geographic location (e.g., state, country).\n“You can’t build rings of security around what you need\nto protect if you don’t know what those things are,” says\nJeff Shipley, manager for Cisco Security Research and\nOperations. “This is a major shift in thinking for many\norganizations that focus their security controls on the\nsystems and network, not the granularity of the actual\ndata on the various systems, across multiple systems,\nor the network.” He adds that enterprises should not\noverlook intellectual property when categorizing data to\nbe secured.\n\nShipley also cautions enterprise IT departments not to\nmiss obvious opportunities to prevent data from “walking\nout the front door.” He says, “Here’s an example: If an\nenterprise would protect its sensitive files, such as Excel\n\n\n-----\n\nCloud-based file sharing is gaining ground because\nit’s easy to use: The signup process for services like\nBox.net or Dropbox is fast and simple, the services don’t\nrequire hardware or advanced software, and they are\nfree or low cost.\n\nThey also streamline collaboration between workers\nand external consultants and partners, since files can be\nshared without generating time-consuming and complex\nmethods for accessing corporate networks. Younger\nworkers, who are conditioned to rely on cloud services\nsuch as webmail and social networks, will no doubt\nembrace cloud file sharing and drive its greater adoption\nin the enterprise.\n\nCeding control of corporate data to the cloud, especially\na piece of the cloud that an enterprise doesn’t control,\nraises legitimate questions about information security.\n“Many new vendors in this market are startups with\nlimited experience in providing enterprise-wide services,\nand with challenges it brings to the table,” says Amol\nGodbole, information security lead for the Cisco Security\n\n\nPrograms Organization (CSPO). “In addition, security\nand encryption standards can vary widely from provider\nto provider. The benefits of file sharing in the cloud\nare many, but enterprises should ask tough questions\nof file sharing providers about their policies for\nmaintaining security.”\n\nThese questions include:\n\n- What kind of encryption controls does\nthe vendor provide?\n\n- Which personnel have access to customer data?\n\n- Who manages incident response and\nmonitoring—the vendor or the customer?\n\n- Does the vendor outsource some services to other\nsuppliers? Are these suppliers caching data?\n\n- Are DLP policies in place?\n\n- Does the vendor conduct periodic\nsecurity assessments?\n\n- What redundancy measures are in place?\nHow and where are backup files stored?\n\n\nto establish corporate policy on file sharing in the cloud\nshould take the following steps:\n\nEstablish a system for classifying data. Documents\ncan be classified by their sensitivity level—for instance,\n“public,” “confidential,” “highly confidential,” and so\non, depending on business needs. Workers should\nbe trained in how to apply these designations, and\nunderstand how they may affect the ability to share\nfiles in the cloud.\n\nEstablish a system for handling specialized data.\nData that has legal or compliance implications needs\nspecial handling in terms of retention policies, physical\nlocation, and backup media requirements. Enterprises\nneed to define policies around sending such data to\nexternal audiences, in addition to its classification per\nsensitivity levels.\n\nImplement a DLP solution. File sharing vendors may not\noffer the granular level of DLP control that enterprises\nrequire. A DLP solution within the network can block data\nfrom being uploaded to file sharing services based on\nclassifications—for instance, tax files or source code.\n\nProvide identity management to control access. Users\nshould be authenticated by the network before they\nare permitted to upload or download files. Leveraging\ncorporate identity and identity federation for internal\nand external collaboration and managing the life cycle\nof provisioned accounts are key.\n\nSet expectations from the vendor. Clear and well-defined\npolicies and services should be part of the service level\nagreement (SLA)—for instance, redundancy systems\nand encryption controls, practices around access to\ndata by third parties (e.g., law enforcement), defining\nshared responsibilities that might include incident response,\nmonitoring and administrative functions, and data transfer/\npurging activities prior to termination of the contract.\n\n\n-----\n\n###### U.S. Lawmakers Pursue Data Breach Disclosure Measures\n\nSeveral high-profile data breaches in 2011, including\nincidents involving Sony Corp.[6] and Citigroup Inc.[7], have\nhad U.S. lawmakers working to pass legislation that will\nimpact how businesses protect consumer information\nand notify the public about cybersecurity incidents.\n\nThree data breach and privacy bills were approved\nand passed by the U.S. Senate’s Judiciary Committee\nin September 2011; the Senate Commerce Committee\nand the House Energy and Commerce Committee\nare working on versions as well. In the Senate, any\nversion that passes likely will be a compromise of all\nversions that pass Senate committees and, perhaps,\nrolled into any larger comprehensive cyber bill that\nmoves through the Senate. The versions that passed\nthe Senate Judiciary Committee are:\n\nThe Data Breach Notification Act of 2011[8]\nThis measure would require federal agencies and\nbusinesses that “engage in interstate commerce”\nand possess data containing sensitive personally\nidentifiable information to disclose any breaches.\n\nThe Personal Data Protection\nand Breach Accountability Act[9]\n\nThe Personal Data Privacy and Security Act of 2011[10] At the time reporting for the Cisco 2011 Annual\n\nThe act would establish a process to help companies\n\nThis measure would establish a national standard for _Security Report was concluded, federal data breach_\n\ncreate appropriate minimum security standards to\n\ncompanies to follow when reporting data breaches. notification legislation was still pending in the U.S.\n\nsafeguard sensitive consumer information. It also\n\nAdditionally, it would require businesses to implement Congress, along with comprehensive cybersecurity\n\nwould require companies to issue prompt notification\n\ndata privacy and security programs designed to legislation designed to help protect financial networks,\n\nto individuals following a data breach.\n\nprevent data breaches from occurring. The bill also transportation systems, and power grids. The Senate\nincludes criminal penalties. has been working on comprehensive cybersecurity\n\nlegislation for over a year; in May 2011, the Obama\nadministration shared its view of what such legislation\nshould include.[11]\n\n[6 “Sony Playstation Suffers Massive Data Breach,” by Liana B. Baker and Jim Finkle, Reuters.com, April 26, 2011, www.reuters.com/article/2011/04/26/us-sony-stoldendata-idUSTRE73P6WB20110426.](http://www.reuters.com/article/2011/04/26/us-sony-stoldendata-idUSTRE73P6WB20110426)\n\n[7 “Citi Says Many More Customers Had Data Stolen by Hackers,” by Eric Dash, The New York Times, June 16, 2011, www.nytimes.com/2011/06/16/technology/16citi.html.](http://www.nytimes.com/2011/06/16/technology/16citi.html)\n\n[8 The Data Breach Notification Act of 2011: www.govtrack.us/congress/billtext.xpd?bill=s112-1408.](http://www.govtrack.us/congress/billtext.xpd?bill=s112-1408)\n\n[9 The Personal Data Protection and Breach Accountability Act: http://judiciary.senate.gov/legislation/upload/ALB11771-Blumenthal-Sub.pdf.](http://judiciary.senate.gov/legislation/upload/ALB11771-Blumenthal-Sub.pdf)\n\n[10 The Personal Data Privacy and Security Act: www.govtrack.us/congress/billtext.xpd?bill=s112-1151.](http://www.govtrack.us/congress/billtext.xpd?bill=s112-1151)\n\n11 “L H f R i d S h Ad i i i ’ b i l ” Whi H M 12 2011\n\n\nSeveral high-profile data breaches in 2011, including\nincidents involving Sony Corp.[6] and Citigroup Inc.[7], have\nhad U.S. lawmakers working to pass legislation that will\nimpact how businesses protect consumer information\nand notify the public about cybersecurity incidents.\n\nThree data breach and privacy bills were approved\nand passed by the U.S. Senate’s Judiciary Committee\nin September 2011; the Senate Commerce Committee\nand the House Energy and Commerce Committee\nare working on versions as well. In the Senate, any\nversion that passes likely will be a compromise of all\nversions that pass Senate committees and, perhaps,\nrolled into any larger comprehensive cyber bill that\nmoves through the Senate. The versions that passed\nthe Senate Judiciary Committee are:\n\nThe Data Breach Notification Act of 2011[8]\nThis measure would require federal agencies and\nbusinesses that “engage in interstate commerce”\nand possess data containing sensitive personally\nidentifiable information to disclose any breaches.\n\nThe Personal Data Protection\nand Breach Accountability Act[9]\n\nThe Personal Data Privacy and Security Act of 2011[10] At the time reporting for the Cisco 2011 Annual\n\nThe act would establish a process to help companies\n\nThis measure would establish a national standard for _Security Report was concluded, federal data breach_\n\ncreate appropriate minimum security standards to\n\ncompanies to follow when reporting data breaches. notification legislation was still pending in the U.S.\n\nsafeguard sensitive consumer information. It also\n\nAdditionally, it would require businesses to implement Congress, along with comprehensive cybersecurity\n\nwould require companies to issue prompt notification\n\ndata privacy and security programs designed to legislation designed to help protect financial networks,\n\nto individuals following a data breach.\n\nprevent data breaches from occurring. The bill also transportation systems, and power grids. The Senate\nincludes criminal penalties. has been working on comprehensive cybersecurity\n\nlegislation for over a year; in May 2011, the Obama\nadministration shared its view of what such legislation\nshould include.[11]\n\n\n-----\n\n###### The Future for Acceptable Use Policies\n\n\n###### Myth vs. Reality: AUPs Cannot Be Enforced\n\n**Myth:**\nAUPs have no impact because they cannot be\nenforced—and they are simply too difficult for\nthe enterprise to create in the first place.\n\n\nMany acceptable use policies (AUPs) were born out of\na need for enterprises to set down rules for how workers\ncould access the Internet during work hours using\ncorporate assets. Over time, many policies have become\nbloated catch-all documents designed to cover everything from Internet access to social media use to what\nemployees cannot say about their company while\nengaging in online channels during off-hours. As a result,\nthese policies, well intentioned as they are, have been\ndifficult for employees to absorb and adhere to, and\nalmost impossible for enterprises to enforce.\n\nGiven the results of the Cisco Connected World survey,\nit would appear that most AUPs are ineffective for another\nreason: Workers don’t think they play a role in helping\nthe enterprise to enforce such policies. The research\nreveals that three in five employees (61 percent) believe\nthey’re not responsible for protecting corporate information\nand devices; instead, their view is that IT and/or service\nproviders are accountable. So the question is, what’s the\npoint of having an AUP?\n\n“Acceptable use policies are important for many reasons,\nincluding for regulatory compliance, but most aren’t\nrealistic,” says Gavin Reid, Cisco CSIRT manager. “Too\nmany are long laundry lists filled with ‘you-can’t-do-this’\nitems. They are really just a way for the enterprise to say\nto the employee, their legal department, or investigators,\nin the event of a security incident, ‘Well, we said not to\ndo that.’”\n\n\nReid says a better approach is for enterprises to rethink\nthe AUP to make it relevant and enforceable, and adds\nthat many organizations are already doing that. The\nnew AUPs coming out of this process are leaner and\nstronger. They are generally much shorter lists—some\ninclude only a handful of items, such as making it\nclear that employees cannot use peer-to-peer (P2P)\napplications or send spam from their desktop. And\nevery item on these lists is “technically enforceable,”\naccording to Reid, meaning that the organization has\nthe technology in place to identify AUP violations.\n\n“The current trend with AUPs is that businesses are\ntaking a much more risk-based approach,” says Nilesh\nBhandari, product manager for Cisco. “Companies are\nhoning in on what they absolutely must include in an\nAUP, and what makes the most sense for the business,\nespecially in terms of time and cost required to monitor\nemployees’ adherence to the policy.”\n\nHe adds that a well-defined AUP is easier for\nemployees to understand and follow—and it gives the\ncompany greater leverage with its workforce. “Users\nwill pay attention to an AUP when they fully understand\nwhat will happen if they fail to adhere to the policy,”\nsays Bhandari.\n\n\n######      “The current trend with AUPs is that businesses\n are taking a much more risk-based approach.”\n\n—Nilesh Bhandari, product manager, Cisco\n\n\n###### AUPs Cannot Be Enforced\n\n**Myth:**\nAUPs have no impact because they cannot be\nenforced—and they are simply too difficult for\nthe enterprise to create in the first place.\n\n**Reality:**\nOrganizations cannot effectively enforce catch-\nall policies. While it does take time and research\nto determine what an AUP should include and\nwhether or not each item truly can be enforced,\nthe end result will be a policy that is easier for\nemployees to understand and follow—and that\nis more likely to enhance enterprise security.\n\nSpecial focus should be given to educating\nemployees on safe use of email and the web,\nas these are avenues cybercriminals typically\ntake to infiltrate and infect networks, steal\nintellectual property and other sensitive data,\nand compromise individual users.\n\n\n-----\n\n###### Getting Started with Collaboration Security\n\n\n###### Social Media: Policies Paired with Technology Controls\n\n\nJudging from the results of the Connected World study,\ncollege students and young professionals are likely to\nfind ways around restrictions on social media access\nif it suits their needs—regardless of corporate policies.\nThree in four employees surveyed believe their companies\nshould allow them to access social media and personal\nsites with their work-issued devices.\n\nAdditionally, 40 percent of college students said they\nwould break a company’s social media rules. That’s a\nsignificant slice of the potential workforce surveyed in\nthis study—and it serves as a warning to enterprises as\nthey grapple with their AUPs for social media. In other\nwords, you can ban or restrict social media, but odds\nare good that your employees will access it anyway.\n\nOrganizations with AUPs that put a stranglehold on social\nmedia access for employees will likely find it hard to\nattract the best and the brightest young talent. Twentynine percent of students surveyed said they would\ndecline a job offer from a company that did not allow\nthem to access social media during working hours. And\nof those students who would accept such a job, only\n30 percent said they would abide by the stated policies.\n\n“Access to social media and technology freedom of\nchoice will become make-or-break benefits for younger\nworkers considering where to start their careers,” says\nChris Young, senior vice president for the Security\nGroup at Cisco. “HR organizations need to account for\nthese factors in corporate culture and policy to retain a\ncompetitive edge. Enterprises should define a realistic\ncompromise between the desires of employees to\nshare and the business requirements of maintaining\nIT security, data, privacy, and asset protection.”\n\n\nSuch a compromise involves granting access to social\nmedia and other collaboration technologies while using\ntechnology controls to deflect threats such as malware\nor phishing messages. In most cases, the security\nsettings in social networks are controlled by users, not\nby IT. To compensate for this lack of control, additional\nsecurity measures can be implemented—for instance, an\nintrusion prevention system to protect against network\nthreats, and reputation filtering to detect suspicious\nactivity and content.\n\nTechnology controls should be paired with user\ntraining that clarifies the enterprise’s expectations for\nappropriate behavior and practices while accessing\nsocial media on company devices or via company\nnetworks. As discussed earlier (see “Social Media:\nNow, It’s a Productivity Tool,” page 8), young\nprofessionals have become so comfortable sharing\ninformation in the social media environment that they\nmay not realize—nor have they ever been taught—that\neven small pieces of information posted on a social\nnetwork can cause damage to a business. Lack of both\nuser training about collaboration security concerns and\nguidelines for disclosing information online can be\ncauses for this risk exposure.\n\n\n###### Collaboration Security\n\nEnterprises can use the following steps to help\nestablish security policies, technologies, and\nprocesses related to collaboration and social\nmedia security:\n\n  - Create a business plan for collaboration and\nsocial networking solutions, starting with the\nbusiness need.\n\n  - Craft clear security governance mechanisms\nfor collaboration.\n\n  - Create policies on information confidentiality\nand expectations for employee activity when\ninteracting on collaboration sites.\n\n  - Define policies on network security measures,\nsuch as remote access by mobile devices,\nlevel of password protection, and use of direct\nfile sharing.\n\n  - Identify regulatory and compliance\nrequirements that might restrict use of or\ninformation disclosure on social media.\n\n  - Create training resources for all users.\n\n\n-----\n\n###### Part\n# 2\n\n\n-----\n\n###### Cyber Threat Outlook for 2012: The Hacktivism Factor\n\nToday’s enterprises are grappling with an array of statement and grab the attention of a wide audience,\nsecurity issues brought about by changing attitudes and motivate others to pursue similar actions.\nand work habits among their employees, and the (See “Social Media Wields ‘Gathering’ Power,” on\ndynamics of a more collaborative, connected, and opposite page.)\nmobile world. As this half of the Cisco 2011 Annual\n_Security Report will examine, enterprises also must_ Behind Operation Payback was a group known as\ncontinue to protect against a wide range of potent the Anonymous collective, which has been growing\nthreats that cybercriminals are already reaping in both membership and influence worldwide ever\nrewards from, and are investing additional resources since. (For more on Anonymous, see the “Cisco\nin refining—among them are advanced persistent Cybercrime Showcase,” on page 24.) Most recently,\nthreats (APTs), data theft Trojans, and web exploits. Anonymous has been connected to the Occupy\n\nWall Street movement.[13 ] The “Occupy” protests\n\nHowever, enterprises now must consider another began in New York City, but quickly spawned similar\npotential security threat that could be even more gatherings in more than 900 cities around the world.\ndisruptive to their operations if they were to be Activists representing the Anonymous collective have\ntargeted: hacktivism. encouraged members to participate in the movement,\n\nwhich generally has been peaceful, but has led to\n\n“Hacktivism is a morph of traditional hacking,” says violent clashes with law enforcement in some cities,\nJohn N. Stewart, vice president and chief security including Rome, Italy,[14] and Oakland, California.[15]\nofficer for Cisco. “Hackers used to hack for fun and At times, factions of Anonymous that identify with\nnotoriety. Then, it was for a prize or monetary gain. the Occupy movement have threatened greater target—or all of the above.”\nNow, it’s often about sending a message, and you disruption, such as hacking campaigns to halt the\nmay never know what made you a target. We’re operations of major financial exchanges.\ndefending a new domain now.”\n\nIncidents of hacktivism by other groups in the last\n\nHacktivism—a blend of hacking and activism— year have helped to elevate this threat to the top tier\ncatapulted to the top tier of security concerns in of cyber threat concerns for enterprises. LulzSec,\nlate 2010 when supporters of WikiLeaks.org launched for example, focused its efforts on law enforcement\ndistributed denial of service (DDoS) attacks against organizations, executing DDoS attacks and data theft\ninstitutions such as PayPal and MasterCard; the initiative against a U.K. cybercrime organization and Arizona\nwas dubbed “Operation Payback.”[12] In many ways, law enforcement.[16] In July, a related group, known as\nhacktivism is a natural extension of how people are “Script Kiddies,” hacked Fox News Twitter accounts\nusing the Internet today—to connect with like-minded to post that U.S. President Barack Obama had been\npeople all over the globe. The Internet serves as assassinated.[17 ]\na powerful platform for those who want to make a\n\n[12 “‘Anonymous’ Launches DDoS Attacks Against WikiLeaks Foes,” by Leslie Horn, PCMag.com, December 8, 2010, www.pcmag.com/article2/0,2817,2374023,00.asp#fbid=jU1HvGyTz7f.](http://www.pcmag.com/article2/0,2817,2374023,00.asp#fbid=jU1HvGyTz7f)\n\n[13 Occupy Wall Street website: http://occupywallst.org/.](http://occupywallst.org)\n\n[14 “Occupy protests spread around the world; 70 injured in Rome,” by Faith Karimi and Joe Sterling, CNN.com, October 15, 2011, www.cnn.com/2011/10/15/world/occupy-goes-global/index.html.](http://www.cnn.com/2011/10/15/world/occupy-goes-global/index.html)\n\n[15 “Occupy Oakland Violence: Peaceful Occupy Protests Degenerate Into Chaos,” Associated Press, The Huffington Post, November 3, 2011, www.huffingtonpost.com/2011/11/03/occupy-oakland-violence-_n_1073325.html.](http://www.huffingtonpost.com/2011/11/03/occupy-oakland-violence-_n_1073325.html)\n\n16 “LulzSec Releases Arizona Law Enforcement Data, Claims Retaliation for Immigration Law,” by Alexia Tsotsis, TechCrunch.com, June 23, 2011,\n[http://techcrunch com/2011/06/23/lulzsec releases arizona law enforcement data in retaliation for immigration law/](http://techcrunch.com/2011/06/23/lulzsec-releases-arizona-law-enforcement-data-in-retaliation-for-immigration-law)\n\n\nToday’s enterprises are grappling with an array of statement and grab the attention of a wide audience, Hacktivism can happen quickly and without warning\nsecurity issues brought about by changing attitudes and motivate others to pursue similar actions. —although Anonymous did announce some of its\nand work habits among their employees, and the (See “Social Media Wields ‘Gathering’ Power,” on intended targets, such as HBGary Federal, a firm\ndynamics of a more collaborative, connected, and opposite page.) hired by the U.S. federal government to track down\nmobile world. As this half of the Cisco 2011 Annual cyberactivists targeting organizations that had\n_Security Report will examine, enterprises also must_ Behind Operation Payback was a group known as pulled support from WikiLeaks.org. While the threat\ncontinue to protect against a wide range of potent the Anonymous collective, which has been growing of hacktivism may seem remote, it’s very real, and\nthreats that cybercriminals are already reaping in both membership and influence worldwide ever represents a shift in the nature of cybercrime itself.\nrewards from, and are investing additional resources since. (For more on Anonymous, see the “Cisco\nin refining—among them are advanced persistent Cybercrime Showcase,” on page 24.) Most recently, “Understanding criminal motivation has been a guiding\nthreats (APTs), data theft Trojans, and web exploits. Anonymous has been connected to the Occupy principle in charting security strategy. However, the\n\nWall Street movement.[13 ] The “Occupy” protests hacktivists’ goal of mayhem undermines this model,\n\nHowever, enterprises now must consider another began in New York City, but quickly spawned similar as any enterprise can be targeted at any time for any\npotential security threat that could be even more gatherings in more than 900 cities around the world. reason by anybody,” explains Patrick Peterson, senior\ndisruptive to their operations if they were to be Activists representing the Anonymous collective have security researcher for Cisco. “What an enterprise\ntargeted: hacktivism. encouraged members to participate in the movement, would try to protect from being compromised in\n\nwhich generally has been peaceful, but has led to a ‘traditional’ security breach, such as intellectual\n\n“Hacktivism is a morph of traditional hacking,” says violent clashes with law enforcement in some cities, property, may be of no interest to this type of hacker.\nJohn N. Stewart, vice president and chief security including Rome, Italy,[14] and Oakland, California.[15] The ‘value’ derived from the action is when the hacker\nofficer for Cisco. “Hackers used to hack for fun and At times, factions of Anonymous that identify with can disrupt, embarrass, or make an example of their\nnotoriety. Then, it was for a prize or monetary gain. the Occupy movement have threatened greater target—or all of the above.”\nNow, it’s often about sending a message, and you disruption, such as hacking campaigns to halt the\nmay never know what made you a target. We’re operations of major financial exchanges. Stewart adds, “Planning ahead for an incident of\ndefending a new domain now.” hacktivism means creating a clear action plan that\n\nIncidents of hacktivism by other groups in the last outlines what the organization would say and do after\n\nHacktivism—a blend of hacking and activism— year have helped to elevate this threat to the top tier an event has occurred. Developing this plan should be\ncatapulted to the top tier of security concerns in of cyber threat concerns for enterprises. LulzSec, a cross-functional effort that includes management,\nlate 2010 when supporters of WikiLeaks.org launched for example, focused its efforts on law enforcement security teams, legal, and even communications\ndistributed denial of service (DDoS) attacks against organizations, executing DDoS attacks and data theft professionals. If this happens to your business, handle\ninstitutions such as PayPal and MasterCard; the initiative against a U.K. cybercrime organization and Arizona it well, as it can result in lasting damage to your brand.\nwas dubbed “Operation Payback.”[12] In many ways, law enforcement.[16] In July, a related group, known as As is true with many things, be prepared and have\nhacktivism is a natural extension of how people are “Script Kiddies,” hacked Fox News Twitter accounts your game plan in place before an incident occurs.”\nusing the Internet today—to connect with like-minded to post that U.S. President Barack Obama had been\npeople all over the globe. The Internet serves as assassinated.[17 ]\na powerful platform for those who want to make a\n\n[12 “‘Anonymous’ Launches DDoS Attacks Against WikiLeaks Foes,” by Leslie Horn, PCMag.com, December 8, 2010, www.pcmag.com/article2/0,2817,2374023,00.asp#fbid=jU1HvGyTz7f.](http://www.pcmag.com/article2/0,2817,2374023,00.asp#fbid=jU1HvGyTz7f)\n\n[13 Occupy Wall Street website: http://occupywallst.org/.](http://occupywallst.org)\n\n[14 “Occupy protests spread around the world; 70 injured in Rome,” by Faith Karimi and Joe Sterling, CNN.com, October 15, 2011, www.cnn.com/2011/10/15/world/occupy-goes-global/index.html.](http://www.cnn.com/2011/10/15/world/occupy-goes-global/index.html)\n\n[15 “Occupy Oakland Violence: Peaceful Occupy Protests Degenerate Into Chaos,” Associated Press, The Huffington Post, November 3, 2011, www.huffingtonpost.com/2011/11/03/occupy-oakland-violence-_n_1073325.html.](http://www.huffingtonpost.com/2011/11/03/occupy-oakland-violence-_n_1073325.html)\n\n16 “LulzSec Releases Arizona Law Enforcement Data, Claims Retaliation for Immigration Law,” by Alexia Tsotsis, TechCrunch.com, June 23, 2011,\n\n\n-----\n\n###### Geopolitical Trends: Social Media Wields Gathering Power\n\n\nIf anyone still needed evidence that social media in the current global environment of frustration toward Twitter responded by pointing to a blog post from\ncan spark social change at lightning speed, 2011 perceived privileged groups, this increases both earlier in 2011 affirming the company’s commitment\nwas the year that this power was proven. The “Arab physical and virtual security concerns.” to keeping the service up and running no matter\nSpring” protests early in the year, and the riots in what world-shaking events were being discussed\nLondon and other British cities during the summer, In addition, enterprises can expect to undergo serious via tweets: “We don’t always agree with the things\nshowed that social media disseminates calls to business disruption if offices or employees are based people choose to tweet, but we keep the information\naction like no other medium before it. In both cases, in areas undergoing such upheaval—for instance, lack flowing irrespective of any view we may have about\nTwitter and Facebook were used to drive attendance of Internet access if local authorities shut it down as the content.”[21]\nat public gatherings—and, also in both cases, a security measure. It’s also possible organizations\ngovernment entities suggested blocking access to seen as aiding or abetting a corrupt regime could be Security watchers anticipate a tug-of-war between\nsocial media by cutting off Internet access or seizing targeted, or could suffer a backlash if they are viewed governments—which will increasingly demand access\npersonal account records. as trying to stifle a revolutionary movement. to user data in order to maintain law and order—\n\nand privacy advocates, who will protest any such\n\nA September 2011 University of Washington study Also on enterprises’ radar is the increasing tendency disclosures from technology providers. As an example,\nfound that social media, especially Twitter, “played a of government organizations to seek to block social India has expressed concern over its ability to access\ncentral role in shaping political debates in the Arab media or even Internet service on a broad scale, or such data (for instance, to track terrorist activity), and\nSpring,” particularly in Egypt and Tunisia, according to request access to social media account or mobile has made an agreement with RIM that the government\nthe study’s summary. “Conversations about revolution device information that is normally private. For example, can request the company’s private user data on a\noften preceded major events on the ground, and during the riots in the United Kingdom, people used case-by-case basis. The European Data Retention\nsocial media carried inspiring stories of protest across BlackBerry Messenger (BBM), the instant messaging Directive, which was created in 2006 and calls for\ninternational borders.”[18] Social media watchers expect service for BlackBerry users, to trade information communications data to be retained in case it is\nthis trend to continue, as anti-government frustration about sites to loot, or where protestors should gather. needed by law enforcement authorities, has been\nfinds a voice in social media networks.[19] BBM is encrypted phone-to-phone messaging that, implemented by some countries in the European\n\ngenerally speaking, is harder for law enforcement Union, yet delayed by others.[22]\n\nThe implications for enterprises and for their security authorities to trace. RIM, BlackBerry’s creator, agreed\nlie in the possibility of social media being used to to cooperate with U.K. police teams trying to identify “What is clear is that governments globally are\ncause upheaval within their own organizations or BBM users who advocated riots or looting, although struggling to apply the new facts of technology and\ntoward their brands or industries. (See “Cyber Threat the company did not say what type of BBM account communications to the underlying principles of law\nOutlook for 2012: The Hacktivism Factor,” page 22.) information it would disclose.[20] and society,” says Adam Golodner, director of global\n“The perception of anonymity online increases the risk security and technology policy for Cisco. “This has\nof unintended consequences if so-called netizens feel In the aftermath of the riots, British officials warned always been the case as technology moves forward,\nat liberty to lay blame but skip fact-checking,” says that, in the future, the government might request and in cyber, this application of the new facts to the\nCisco global threat analyst Jean Gordon Kocienda. extended police powers to curb unrest, and proposed old principles will be the core policy issue for the\n“For companies and corporate executives, particularly asking social media providers to restrict access to foreseeable future.”\n\ntheir services during such emergency situations.\n\n18 “Opening Closed Regimes: What Was the Role of Social Media During the Arab Spring?”, Project on Information Technology and Political Islam,\n[http://pitpi.org/index.php/2011/09/11/opening-closed-regimes-what-was-the-role-of-social-media-during-the-arab-spring/.](http://pitpi.org/index.php/2011/09/11/opening-closed-regimes-what-was-the-role-of-social-media-during-the-arab-spring/)\n\n[19 “U.K. social media controls point to wider ‘info war’,” by Peter Apps, Reuters, August 18, 2011, www.reuters.com/article/2011/08/18/us-britain-socialmedia-idUSTRE77H61Y20110818.](http://www.reuters.com/article/2011/08/18/us-britain-socialmedia-idUSTRE77H61Y20110818)\n\n[20 “London Rioters’ Unrequited Love For BlackBerry,” by Nidhi Subbaraman, FastCompany.com, August 8, 2011, www.fastcompany.com/1772171/london-protestors-unrequited-love-for-blackberry.](http://www.fastcompany.com/1772171/london-protestors-unrequited-love-for-blackberry)\n\n\n-----\n\n###### THE GOOD\n Microsoft Third, Microsoft has aggressively pursued legal actions\n Announcing the against cybercriminals. In 2010, Microsoft took legal\n\nMicrosoft’s technology has always attracted the action to shut down the Waledac botnet—which had\n\n###### 2011 Winners of the attention of criminals because of its pervasiveness in infected hundreds of thousands of computers worldwide\n\nthe enterprise and among consumers. In particular, and was sending as many as 1.5 billion spam messages\n\n###### Cisco Cybercrime botnet owners have exploited the Windows operating daily—by asking a federal judge to file a restraining\n\nsystem using social engineering, web-based attacks, order against almost 300 Internet domains believed to\n\n###### Showcase and unpatched vulnerabilities. In recent years, Microsoft be controlled by Waledac-related criminals. This action\n\nhas fought back against botnets in three big ways. cut off communications between the botnet’s command-\n\nand-control centers and its compromised computers,\n\n###### There will always be villains and heroes, First, Microsoft has dramatically effectively “killing” the botnet.[23] and the security industry is no exception. improved product security. Key\n\ndevelopments include aggressive In early 2011, Microsoft lawyers and U.S. marshals seized\n\n###### The cast of characters may change, but\n\nvulnerability discovery and weekly command-and-control servers for the Rustock botnet,\n\n###### every year, malicious actors are doing their patch cycles; implementation of which were housed at several web-hosting providers best to identify new ways to steal money Microsoft Security Development across the United States. Malware promulgated by\n\nLifecycle (SDL) to dramatically Rustock, which was operated by Russian criminals and\n\n###### and information and cause mayhem through\n\nincrease product security; auto-update systems mostly delivered fake pharmaceuticals spam, dropped\n\n###### online channels—and cybercrime fighters for all of Microsoft’s software products; significant dramatically, and the botnet’s activity slowed to a halt. are working tirelessly to thwart them. In changes to Windows Internet Explorer, including  Additionally, Microsoft offered a US$250,000 reward for\n\na new security model for ActiveX controls; and information leading to the arrest of Rustock’s creators.[24]\n\n###### this, the third annual Cisco Cybercrime\n\ndevelopment of the Malicious Software Removal Tool According to the Cisco IronPort SenderBase Security\n\n###### Showcase, we once again recognize (MSRT), which surgically removes malware from Network, since Rustock has been sidelined, daily spam representatives from both the “good side” PCs. MSRT has been deployed against malware volume worldwide has dropped dramatically.\n\nfamilies powering more than 150 of the world’s\n\n###### and “bad side” of the security battlefield In September 2011, Microsoft used similar legal tactics\n\nlargest botnets, including Zeus (Zbot), Cutwail,\n\n###### who have had a notable impact on the Waledac and Koobface, to remove hundreds of to shut down the Kelihos botnet—and in legal filings\n\nactually named a defendant for the first time, calling\n\n###### cybersecurity landscape, for better and  millions of PC malware infections. Cisco research\n\nout the alleged owner of the web domain controlling\n\nhas shown massive declines year over year in\n\n###### for worse, in the past year. the botnet.[25 ]\n\nweb exploit toolkits’ successful exploitation of\nMicrosoft technologies.\n\nMicrosoft’s anti-botnet actions—combined with the\n\n23“Deactivating botnets to create a safer, more trusted Internet,” Second, Microsoft has led the security community in company’s record numbers of vulnerability patch\n[Microsoft.com: www.microsoft.com/mscorp/twc/endtoendtrust/](http://www.microsoft.com/mscorp/twc/endtoendtrust/vision/botnet.aspx) releases, which also help clamp down on criminal\n\nthe fight against cybercrime. Microsoft’s Digital Crimes\n\n[vision/botnet.aspx.](http://www.microsoft.com/mscorp/twc/endtoendtrust/vision/botnet.aspx) activity—have turned it into a cybercrime crusader.\n\n24 “Rustock take-down proves botnets can be crippled, Unit hosts the annual Digital Crimes Consortium (DCC), The company’s Project MARS (Microsoft Active\nsays Microsoft,” Computerworld.com, July 5, 2011, which provides an opportunity for law enforcement\n[www.computerworld.com/s/article/9218180/Rustock_take_down_](http://www.computerworld.com/s/article/9218180/Rustock_take_down_proves_botnets_can_be_crippled_says_Microsoft) officials and members of the technology security Response for Security), which oversees these botnet\n[proves_botnets_can_be_crippled_says_Microsoft.](http://www.computerworld.com/s/article/9218180/Rustock_take_down_proves_botnets_can_be_crippled_says_Microsoft) takedown efforts, also has shared its findings about\n\ncommunity to discuss enforcement efforts involving\n\n25 “How Microsoft Took Down Massive Kelihos Botnet,” The botnets with members of the security industry.\n[Huffington Post, October 3, 2011, www.huffingtonpost.](http://www.huffingtonpost.com/2011/10/03/microsoft-kelihos-botnet_n_992030.html) cybercrime worldwide. This year’s event included\n[com/2011/10/03/microsoft-kelihos-botnet_n_992030.html.](http://www.huffingtonpost.com/2011/10/03/microsoft-kelihos-botnet_n_992030.html) 340 attendees from 33 countries.\n\n\n-----\n\n###### THE\n BAD\n\nIn 2011, Anonymous has been associated with a number the Anonymous mix who truly want to cause\n\n###### Anonymous of high-profile hacking incidents, some announced in damage—or if the group takes things one step too\n\nadvance and all intended to make a statement, including far when trying to make a statement—there could\n\nAnonymous, described as a “decentralized online\n\ndirect attacks on the websites of: be a real problem.”\n\ncommunity acting anonymously in a coordinated manner,”\nis a “loose coalition of Internet denizens” that has been\n\n                                 - Numerous U.S. law enforcement organizations, Consider this almost-incident that had the potential\n\naround for several years, but making headlines more\n\nwhich resulted in the release of peace officer to send shockwaves through an already uncertain\n\noften lately as the group becomes increasingly associated\n\nand confidential informant personal information global economy: In October, factions of Anonymous\n\nwith collaborative, international hacktivism. (For more\n\naimed big by threatening to “erase” the New York\n\n                                    - The government of Tunisia, as part of the\n\non hacktivism, see “Cyber Threat Outlook for 2012:\n\nStock Exchange on October 10, 2011, through a\n\n“Arab Spring” movement (see “Social Media\n\nThe Hacktivism Factor,” page 22.)\n\ndistributed DDoS attack in a show of support for\n\nWields ‘Gathering’ Power,” page 23)\n\nthe Occupy Wall Street movement.[26] One possible\n\nThose who identify with the Anonymous            - Security firm HBGary Federal\n\nreason the group did not carry through with its\n\ncollective are located all over the world\n\n                               - Sony Computer Entertainment America promise to bring down the exchange is because\n\nand connect with one another through\n\n“the rallying cry drew out criticism from supporters\n\nInternet forums, imageboards, and other What threat does Anonymous pose moving forward?\n\nand detractors alike, with most decrying the effort.”[27]\n\nweb-based venues such as 4chan, “This group has the ability to inflict real damage,” says\n\nSo it would appear that Anonymous, loosely\n\n711chan, Encyclopedia Dramatica, IRC Scott Olechowski, threat research manager for Cisco.\n\nconnected as it is right now, can be influenced by\n\nchannels, and even mainstream sites such as YouTube “Most of what we’ve seen from them so far hasn’t been\n\nits collective conscience not to inflict serious\n\nand Facebook. “This is a group that is fairly well too extreme—arguably, more disruption than the actual\n\ndamage—at least, in this case.\n\norganized, yet loosely affiliated,” says Patrick Peterson, damage they are capable of. You could define them as\nsenior security researcher for Cisco. “The people mischievous right now. But if you add some people into\ninvolved are highly talented—and incredibly ambitious.\nIn many cases, their actions are not motivated by profit.\nIt’s more a case of ‘Look what I can do.’ And when\nthey’re done, they disassemble and disappear as quickly\nas they came together.” “The people involved are highly talented — and incredibly\n\n######    ambitious. In many cases, their actions are not motivated  by profit. It’s more a case of ‘Look what I can do.’”\n\n—Patrick Peterson, senior security researcher, Cisco\n\n26 “‘Anonymous’ Hackers Group Threat to New York Stock Exchange,” by Ned Potter, ABC News, October 10, 2011,\n[http://abcnews.go.com/Technology/anonymous-hackers-threaten-erase-york-stock-exchange-site/story?id=14705072.](http://abcnews.go.com/Technology/anonymous-hackers-threaten-erase-york-stock-exchange-site/story?id=14705072)\n\n27 “Blink and You Missed It: Anonymous Attacks NYSE,” by Chris Barth, Forbes.com, October 10, 2011,\n[www.forbes.com/sites/chrisbarth/2011/10/10/blink-and-you-missed-it-anonymous-attacks-nyse/.](http://www.forbes.com/sites/chrisbarth/2011/10/10/blink-and-you-missed-it-anonymous-attacks-nyse/)\n\n\n-----\n\n#### The Cisco Cybercrime Return on Investment (CROI) Matrix\n\n**POTENTIALS** **RISING STARS**\n\n\nfinancially motivated cybercrime operations, which\nincreasingly are managed and organized in ways\nsimilar to sophisticated, legitimate businesses. This\nmatrix specifically highlights the types of aggressive\nactions Cisco security experts predict cybercriminals\nare likely to focus most of their resources toward\ndeveloping, refining, and deploying in the year ahead.\n\nPotentials: Mass Account Compromise, a\nnewcomer to this year’s Cisco CROI Matrix,\nessentially involves cybercriminals “making use\nof table scraps left from data theft,” according to Patrick\nPeterson, senior security researcher for Cisco. They\npiece together information gathered from data theft\nTrojans to extract low-value username/password\ncredentials. The credentials are then used as “stepping\nstones” to find credential reuse on a valuable online\nbanking site, or to use webmail credentials to spy on a\nvictim’s personal email in order to lay groundwork for a\nmore aggressive action. “Cybercriminals are looking at\nthe tons and tons of information they’re collecting in a\ndifferent way. They’re now thinking, ‘Could this webmail\nor dating site username/password I have be the skeleton\nkey to a high-value account? Or could it be a stepping\nstone for a webmail exploit that will allow me to do other\nthings, like password resets and reconnaissance, that\ncould lead to even bigger prizes?” says Peterson.\n\n\n**RISING STARS**\n\nCloud\nInfrastructure\nHacking\n\nMobile\nDevices Money\n\nLaundering\n(Muling)\n\n\n**POTENTIALS**\n\nVoIP\nAbuse\n\nMass\nAccount\nCompromise\n\n\n#### The Cisco Cybercrime Return\n\n\n**DOGS** **CASH COWS**\n\nSocial\nNetworking Web\nAttacks Exploits\n\nClick/\nRedirect\nFraud\n\nPharma\nSpam\n\nPhishing\n1.0 Spyware/\n\nAdvanced Scareware\nFee Fraud\n\n\n**CASH COWS**\n\nWeb\nExploits\n\nData Theft\nTrojans\n\nClick/\nRedirect\nFraud\n\nSpyware/\nScareware\n\n\n#### on Investment (CROI) Matrix\n\n\n###### Low High\n\n Scalability/Revenue\n\n\n**DOGS**\n\nSocial\nNetworking\nAttacks\n\nPharma\nSpam\n\nPhishing\n1.0\n\nAdvanced\n\nDDoS Fee Fraud\n\n\n_The Cisco CROI Matrix predicts cybercrime techniques that will be “winners” and “losers” in 2012._\n\n\nCybercriminals are also accelerating investment in VoIP\nand other telephony abuse techniques. As reported\nin the Cisco 2010 Annual Security Report, many\nmiscreants already have found success in targeting\nsmall or midsize businesses with this technique, causing\nsignificant financial losses for some organizations. VoIP\nAbuse, which was listed as a “Potential” on last year’s\nmatrix, involves the hacking of private branch exchange\n(PBX) systems. VoIP abusers place fraudulent, longdistance calls—usually international calls. Some criminals\nuse VoIP systems for more sophisticated “vishing”\nscams (telephone-based phishing), designed to collect\nsensitive information from users, such as Social Security\nnumbers. Caller ID spoofing attacks against phonebased verification systems are also on the rise.\n\n\n-----\n\nis expected to remain a key focus area for\ncybercrime investment in 2012. Discussed in\ndetail in the Cisco 2010 Annual Security Report, criminals\nleveraging data theft malware have access to numerous\nonline bank accounts but face a bottleneck in extracting\nfunds safely overseas without leaving a direct trail.[28]\nMoney mules provide this solution. Muling operations\nhave become increasingly elaborate and international in\nscope recently with some of the best data coming from\n“Operation Trident Breach,” the arrest of more than 60\ncybercriminals who successfully stole US$70 million\nusing money mules.[29] While it is estimated that only one\nin three money mule transactions are successful—and\nmoney mules are easy to arrest, at least in the United\nStates—mule networks continue to grow as real criminals\nhave plenty of bank accounts and mules to burn.\n\nA not-so-surprising newcomer among the “Rising Stars”\nis Mobile Devices, which was listed in the “Potentials”\ncategory in the 2010 matrix. Cybercriminals, as a\nrule, focus their attention on where the users are, and\nincreasingly, people are accessing the Internet, email,\nand corporate networks via powerful mobile devices.\nMobile device attacks have been around for years\nnow, but historically have not been widespread, and\nwere more akin to research projects than successful\ncybercrime businesses. But that’s changing—fast.\n\nMobile campaigns not only are becoming more prevalent,\nbut also, successful—and therefore, important to cybercriminals. New mobile OS platforms present new security\nvulnerabilities to exploit. Many cybercriminals are reaping\nrewards with fake mobile applications that serve up malware.\nAnd with mobile devices quickly replacing traditional PCs\nas business computing tools, cybercriminals are investing\nmore resources in developing APTs to exploit two-factor\nauthorization and help them gain access to corporate\nnetworks where they can steal data and/or conduct\n“reconnaissance missions.”\n\n\nand hosted services, cybercriminals are also looking to\nthe cloud in search of moneymaking opportunities with\nCloud Infrastructure Hacking. “Criminals see the potential\nto get more return on their investment with cloud attacks,”\nsays Scott Olechowski, threat research manager for Cisco.\n“Why focus all your efforts on hacking into one enterprise\nwhen you can compromise hosted infrastructure and\npotentially access information belonging to hundreds or\neven thousands of companies?”\n\nOlechowski adds that recent data security incidents—\nsuch as hackers gaining access to customer names and\nemail addresses stored in the systems of email marketer\nEpsilon Data Management LLC[30]—underscore the\ngrowing trend toward “hack one to hack them all.”\n\nCash Cows: Two of 2010’s “Rising Stars”—\nData Theft Trojans and Web Exploits—have\nmade their way to the 2011 “Cash Cows”\ncategory, as they are now among the favorite moneymakers for cybercriminals. But this move isn’t just\nbecause criminals have perfected their skills with these\ntechniques; the prevalence of cheap and easy-to-use\nweb exploit toolkits and data theft Trojan exploits means\nanyone who wants to get into the game can do so with\nrelatively little effort or investment. Other old favorites\nsuch as Spyware/Scareware and Click/Redirect Fraud\nhave lost a little luster, but maintained their role as loyal\nworkhorses for cybercriminals during 2011—and will\ncontinue to do so in 2012.\n\nDogs: Two new entrants to the “Dogs”\ncategory are Pharma Spam and Advanced\nFee Fraud. Pharma spam, a “Cash Cow” in\nthe 2010 Cisco CROI Matrix, has fallen out of favor due to\nlaw enforcement activities and botnet shutdowns. (See\nthe Cisco Cybercrime Showcase, “The Good: Microsoft,”\npage 24.) Numerous pharma spam criminals have been\narrested or have gone underground to avoid capture,\n\n\nVrublevsky of RX-Promotions/Eva Pharmacy; Oleg\nNikolaenko, operator of the massive Mega-D botnet;\nGeorg Avanesov, operator of the Bredolab botnet; and\nmany others. With so many of the once-massive botnets\nsuch as Waledac, Mariposa, Cutwail (reportedly the\nlargest botnet ever), Rustock, Bredolab, and Mega-D\neither long gone or severely crippled, and authorities\nmore vigilantly scanning the horizon for prolific spammers,\npushing out pharma spam simply does not generate the\nreturns it used to for cybercriminals.[31]\n\nMeanwhile, another “Cash Cow” from last year,\nAdvanced Fee Fraud, is now making its way toward the\nexit door. Today’s users are simply better educated—\nand spam filters are better tuned—which means this\ntechnique is no longer delivering significant returns to\ncybercriminal operations. The labor-intensive “Nigerian\nprince” scam still runs, but profits continue to decline.\n\nOld dogs still hanging around on the matrix are Phishing\n1.0 scams and DDoS attacks. Social Networking Attacks\ncontinue to take a backseat as users become even\nsavvier about navigating the online “Social Sphere.”\nMany more users are now instinctively less trusting of\nothers they don’t know who try to interact with them on\nsocial networks. They also are taking advantage of privacy\ncontrols from their social network providers, and generally,\nbeing less open when sharing personal information on\nthese sites. Social networking attacks will not fade away\ncompletely, but sophisticated cybercriminals are unlikely to\ncontinue investing their resources in refining or expanding\nsuch exploits. Making these types of scams work has\nsimply become too labor-intensive and time-consuming,\nespecially now that many in the shadow economy are\nmaking a specific effort to be more strategic when\ninvesting their resources.\n\n\n[28  Cisco 2010 Annual Security Report, www.cisco.com/en/US/prod/collateral/vpndevc/security_annual_report_2010.pdf.](http://www.cisco.com/en/US/prod/collateral/vpndevc/security_annual_report_2010.pdf)\n\n[29 “Ukraine Detains 5 individuals Tied to $70 million in U.S. eBanking Heists,” Brian Krebs, Krebs on Security blog, October 2, 2010, http://krebsonsecurity.com/tag/operation-trident-breach/.](http://krebsonsecurity.com/tag/operation-trident-breach/)\n\n30 “Breach Brings Scrutiny: Incident Sparks Concern Over Outsourcing of Email Marketing,” by Ben Worth, The Wall Street Journal, April 5, 2011,\n\n\n-----\n\n#### 2011 Vulnerability and Threat Analysis\n\n\n#### 2011 Vulnerability and Threat Analysis\n\n\nThe Cisco Annual Security Report provides a\ncomparison of the rise and fall of vulnerabilities and\nthreats by category, as well as the estimated impact\nof these exploits.\n\nThe Vulnerability and Threat Categories chart below\nshows a slight increase in recorded vulnerabilities and\nthreats—a significant trend, since they generally have\nbeen on the decline since 2008. One factor causing the\nincrease is vulnerabilities in major software vendors’ open\nsource packages or code, such as those using the open\nsource browser engine WebKit. A single vulnerability in\nan open source product like WebKit can impact multiple\nmajor products and result in multiple advisories, updates,\nand patches. Apple continued to release large updates\nthis year for several of its products, relating to the\ninclusion of open source software.\n\n\nGoing into 2012, security experts are watching\nvulnerabilities in industrial control systems and\nsupervisory control and data acquisition systems,\nalso known as ICS/SCADA systems. These systems\npresent a growing area of concern, and government\ncyber defense initiatives are focused on addressing\nthese vulnerabilities. As reported in the Cisco 2010\n_Annual Security Report, the Stuxnet network worm was_\ndesigned to infect and tamper with these systems.\n\nThe good news for 2011 is a decline in basic coding\nerrors: buffer overflows, denial of service, arbitrary\ncode execution, and format string vulnerabilities.\nHowever, this does not include vulnerabilities and\ncorrections related to flaws that allow SQL injection\nattacks, which continue to be a widespread problem.\n\n\nThe Cisco IntelliShield Alert Severity Ratings\nreflect the impact level of successful vulnerability\nexploits. In 2011, severity levels continued along\na slight decline evident since 2009, which mirrors\nrecent declines in vulnerabilities and threats. Moving\nforward into 2012, severity levels are expected to\nremain at current levels, with no widespread attacks\nor exploits of specific vulnerabilities.\n\nCisco IntelliShield Alert Urgency Ratings reflect\nthe level of threat activity related to specific\nvulnerabilities. 2011 is notable for a significant spike\nin Urgency 3, meaning a limited number of exploits\nwere detected, but additional exploits still could be\npossible. This increase indicates that while there are\na greater number of active threats in circulation on\nthe Internet, they generally do not rise to the level of\n\n\n###### Vulnerability and Threat Categories Cisco IntelliShield Alert Severity Ratings Cisco IntelliShield Alert Urgency Ratings\n\n\nBuffer Overflow\n\nDenial of Service\n\nArbitrary Code Execution\n\nCross-Site Scripting\n\nPrivilege Escalation\n\nInformation Disclosure\n\nSoftware Fault (Vul)\n\nDirectory Traversal\n\nUnauthorized Access\n\nSpoofing\n\nFormat String\n\n\n0 100 200 300 400 500 600 700\n\n2009\n\n2010\n\n2011\n\n|Col1|Col2|Col3|Col4|Col5|2 2 2|009 010 011|\n|---|---|---|---|---|---|---|\n\n\n-----\n\n###### Global Spam Update:  Dramatic Decline in Spam Volume\n\n\nUrgency 4 (several incidents of exploitation have\nbeen reported across a variety of sources) or Urgency 5\nalerts (widespread incidents of exploitation have been\nreported across a variety of sources, and exploits are\neasy to perform).\n\nThreats and exploits also are more narrowly focused, as\nopposed to widespread exploits involving Internet worms\nand malicious code. The threats tend to be associated\nwith attack toolkits, which assist in launching attacks\nusing individual vulnerabilities on individual systems.\n\n[As discussed in the Cisco 2010 Annual Security Report,](http://www.cisco.com/en/US/prod/collateral/vpndevc/security_annual_report_2010.pdf)\nlarge botnets such as Zeus—which commandeered as\nmany as 2 million to 3 million computers worldwide—\nhave been used to steal banking information and login\ndata for years. Recently, botnet creators have launched\nattack toolkits, in which botnet code is built in, enabling\nthe creation of a host of smaller botnets.\n\nInstead of just a few very large botnets, usually managed\nby established criminal enterprises, there are now dozens\nof smaller botnets engaging in criminal activity. “When\nthere were only a few large botnets in existence, it was\neasier to track them and understand how they operated,”\nsays Jeff Shipley, manager for Cisco Security Research\nand Operations. “The availability of botnet toolkits has\ngreatly increased the number of botnets, allowed more\nvariations, and complicates the task of analyzing their\nbehavior patterns and providing protection from them.”\n\nThe new smaller botnets still aim to gather bank\naccount information, as the larger Zeus botnets do.\nHowever, the number and variety of these smaller\nbotnets make it challenging for security professionals\nto track their movements.\n\n\n###### Dramatic Decline in Spam Volume\n\nThanks to criminals’ preference for targeted But events over the past year have disrupted\ncampaigns, spam does not appear to be as lucrative traditional spammers’ business models so\nas it used to be. According to Cisco Security significantly that many have been forced to channel\nIntelligence Operations (SIO), spam volume dropped their resources toward developing targeted attacks.\nfrom more than 379 billion messages daily to about Beginning in 2010 and continuing into 2011, law\n124 billion messages daily between August 2010 enforcement authorities and security organizations\nand November 2011—levels not seen since 2007. around the world have been working closely together\n\nto shut down or severely limit the activity of some of\n\nBefore 2011, some cybercriminals had already the biggest spam-sending botnets. SpamIt, a large\nstarted to shift their focus toward more targeted spam-sending affiliate network, closed down in\nattacks, using their resources to reach out to specific 2010 after Russian police pressed charges against\npeople in an organization (such as financial or IT its owner. In addition, major botnets were crippled or\npersonnel) with a scam message designed to obtain shut down, including Rustock, Bredolab, and Mega-D.\nsensitive network login data or other account\ninformation. Targeted scams need only a single The impact on the business of cybercrime is\nresponse from a recipient to be considered significant: Cisco SIO estimates that the cyber-\nsuccessful, whereas mass spam campaigns require criminal benefit resulting from traditional mass\na much higher response rate to be profitable. email-based attacks declined more than 50 percent\n\n(on an annualized basis) from June 2010 to June\n2011—from US$1.1 billion to US$500 million.[32]\n\n400B\n\n350B\n\n300B\n\n250B\n\n200B\n\n150B\n\n100B\n\n50\n\n0\n\nSource: Cisco SIO\n\n\n-----\n\n###### Spam Volume by Country: 2011 Highlights\n\n|4/5 3 4/5|Col2|\n|---|---|\n\n\nCisco SIO also tracks spam volume originating China, which was seventh on the list in 2010, maintains Cisco SIO’s research also reveals that Brazil had\nfrom countries worldwide. As of September 2011, the same position in the current lineup. However, while spam volume of about 4.5 percent in September\nIndia had the highest percentage of spam volume that country’s spam volume has increased only slightly 2011. Brazil now ranks eighth among the top spam\n(13.9 percent). In 2010, the country ranked second in overall, from 3.6 percent in December 2010 to 4.7 nations, after topping the list in 2009 and earning\nspam volume, behind the United States, which saw percent in September 2011, it was by far the highest- third place on last year’s list. However, the country’s\nits spam volume drop dramatically from January to ranking spam nation for a short period this year. From spam volumes did fluctuate throughout 2011, nearly\nSeptember 2011, from 10.1 percent to 3.2 percent. May to June, China’s total spam volume leapt from doubling to 8 percent by April 2011 before beginning\nThe United States now ranks ninth in total spam 1.1 percent to just over 10 percent. Its spam volume a steady decline to 4.5 percent.\nvolume worldwide. peaked at 18 percent in July, and then edged down to\n\n11.5 percent in August before dropping dramatically\n\nHolding second place on this year’s list of spam to 4.7 percent percent in September.\nnations is the Russian Federation, with 7.8 percent.\nIts spam volume increased during the first half of\n2011, rising from 7.6 percent in January to a peak\nof 9 percent in May, but has been experiencing a\nsteady decline in volume since.\n\nThird on the list for 2011 is Vietnam, which, like India\nand the Russian Federation, was among the top five\nspam nations in the Cisco 2010 Annual Security Report. **2**\nVietnam’s spam volume hovered between 3 and\n4 percent for much of the year, but then jumped to\nnearly 6 percent in August 2011 and grew again\n\n**4/5**\n\nto nearly 8 percent in September 2011.\n\nRounding out this year’s top five spam nations are **1**\nthe Republic of Korea and Indonesia, each with **3**\n6 percent in total spam volume, according to Cisco\n\n**4/5**\n\nSIO’s research. Neither country appeared among\nthe top 12 spam nations in last year’s report.\n\nRussian India Vietnam Republic\nFederation of Korea/\nIndonesia\n\n\n-----\n\n#### The Cisco Global ARMS Race Index\n\n\n#### The Cisco Global ARMS Race Index\n\n\nThe annual Cisco Global ARMS Race Index, inspired\nby the Richter Scale used to measure earthquake\nmagnitude, tracks “Adversary Resource Market Share”\n(ARMS). The index provides a way to measure the\noverall level of compromised resources worldwide—\nthe networks and machines currently under “adversarial\ncontrol.” Cisco security experts created the index as\na way to gain a better understanding of overall trends\nbased on the global online criminal community’s\nactivities and their rates of success at compromising\nboth enterprise and individual users.\n\nAccording to data collected for this year’s index,\nthe aggregate number that represents the level of\ncompromised resources at the end of 2011 is 6.5, down\nslightly from the December 2010 level of 6.8. When the\nCisco Global ARMS Race Index debuted in the Cisco\n_2009 Annual Security Report, the aggregate number_\nwas 7.2, which meant enterprise networks at the time\nwere experiencing persistent infections, and consumer\nsystems were infected at levels capable of producing\nconsistent and alarming levels of service abuse.\n\nSince then, consumer and enterprise systems have seen\na constant decline in infection rate, but levels are still\nbetween “capable of producing consistent and alarming\nlevels of service abuse” and “capable of broad (but not\nsustained) high-level service abuse.” Unfortunately, the\nmagnitude decline does not tell the whole story, as each\ncopy of a criminal’s APT malware is doing far more\ndamage than in years past.\n\nWhat’s behind this year’s decline in the level of\ncompromised resources worldwide? The decrease\nin the number of massive botnets driven by law\nenforcement and botnet takedowns has had a significant\nimpact. As discussed earlier in this report, sophisticated\n\n\n**December**\n\n###### 6.8 2010\n\n**December**\n\n###### 7.2 2009\n\n\n_According to the Cisco Global ARMS Race Index, the level of_\n_resources under adversarial control worldwide was 6.5 at the_\n_end of 2011. This is a decline from the 2010 level of 6.8,_\n_showing that infections of enterprise networks and consumer_\n_systems are less frequent compared to 12 months ago._\n\n\ncriminal operations are moving away from the massive\nbotnets commonplace in years past because law\nenforcement and the security industry are keeping a\nclose watch on this activity. However, many smaller\nbotnets have been developed—with each one capable\nof inflicting more damage per bot.\n\nAdditionally, many in the shadow economy now center\ntheir efforts on infecting specific high-value targets with\nAPTs and launching targeted attacks that are more likely\nto yield a lucrative payout. The prevalence of featurerich data theft malware such as Zeus/SpyEye has\nenabled many criminal gangs to launch such attacks.\n“The ‘Ocean’s 11’ gangs are out there,” says Patrick\nPeterson, senior security researcher for Cisco. “They’re\nfocusing tremendous energy on compromising a small\nnumber of high-value targets versus the carpetbombing techniques of the past.”\n\n###### Methodology\n\nTo arrive at this year’s measurement on the 10-point\nCisco Global ARMS Race Index, Cisco relied on leading\nbotnet-tracking estimates of total bots and other data\npoints derived through internal research and other expert\nsources, such as The Shadowserver Foundation, which\ntracks cybercriminal activity and is composed of volunteer\nsecurity professionals from around the world. The\nmethodology for the Global ARMS Race Index is based on:\n\n- Current aggregate botnet size\n\n- Statistics used to estimate the total number of\nInternet-connected systems in the world\n\n- Estimates of home and work infection rates, which\nmeasure factors such as resource availability\n\n\n-----\n\n#### The Internet: A Fundamental Human Necessity?\n\n\n#### The Internet:\n\n\nBut many enterprises are trying to change. Cisco\nsecurity experts interviewed for the 2011 Annual Security\n_Report have reported seeing many firms making strides_\nin both evolving their security model so it is relevant for\ntoday’s connected world, and in trying to find common\nground with employees who are demanding access to\napplications and devices that they want to use for work.\nThey’re also re-evaluating their AUPs and business\ncodes of conduct, reinvigorating their DLP efforts, and\ntaking the enterprise security discussion—and the\nresponsibility for preserving desired levels of security—\nbeyond the IT function and into departments throughout\nthe organization, from marketing to human resources\nand legal right up to the management level.\n\nAs we’ve learned in this report, Cisco is among them.\nLike countless organizations worldwide, it is working to\nfind the right balance between seizing new opportunities\nand maintaining network and data security. Cisco’s\n“Any Device” initiative, designed to allow the company’s\nemployees greater choice in devices, while maintaining\na common, predictable user experience that maintains or\nenhances global organizational competitiveness and\n\n\n2011 saw the Internet being used in new and powerful\nways—in particular, to bring together people on a mass\nscale to create change that has altered the landscape of\nour global community. Its influence on our everyday life,\nboth work and personal, is only growing as well. So it\nbegs the question: If we have become so reliant on the\nInternet and its power to connect us with information\nand people from anywhere in the world, is it now a\nfundamental human necessity?\n\nAccording to one in three college students and young\nprofessionals surveyed for Cisco’s Connected World\nstudy, it is. In fact, they consider it to be as important to\ntheir lives as air, water, food, and shelter. To some, this\nattitude may seem extreme, but more than likely, it is\na view that will be commonplace among those in the\nnext-generation workforce. While today we observe how\nthe line between personal and professional use of the\nInternet and Web 2.0 tools and technologies is blurring,\nsoon there may be no discernible delineation whatsoever.\n\nMeanwhile, there is no question that for today’s businesses,\nthe Internet is a necessity—for both basic operations and\ncompetitive advantage. For that reason alone, it would\nseem there should be no debate in the enterprise around\nwhether any technology that will significantly enhance\nproductivity, efficiency, and innovation—and the satisfaction\nof workers—should be embraced and put in use strategically\nthroughout the organization. However, many businesses\nare finding it difficult to adapt to so much change so\nquickly. They cite security concerns as a primary hurdle\n\n\nto leveraging new technologies. But many are beginning\nto understand that a wait-and-see approach, while meant\nto protect the enterprise and its assets, may actually\nundermine their competitive edge—if not now, then\ndefinitely in the future.\n\nMoving too slowly doesn’t just mean that enterprises\nrisk taking advantage of innovations that can help their\nbusiness achieve new levels of success. They also risk\nnot being able to recruit or retain their most important\nasset: talent. As discussed in this report, many of today’s\nemployees would be inclined not to take a job if a potential\nemployer told them their access to corporate networks\nand applications would be severely limited or prohibited.\n(See “Remote Access and BYOD: Enterprises Working\nto Find Common Ground with Employees,” page 10.)\n\nLikewise, more than half of college students surveyed\nfor the Connected World study said if they encountered\na company that banned access to social media, they\nwould either not accept a job with that organization,\nor would join and find a way to access social media\ndespite corporate policies. (See “Social Media: Now It’s\na Productivity Tool,” page 8.)\n\n\n###### “The rapid erosion of this perimeter that took        20 years to build has left many enterprises stunned and feeling vulnerable as they           embark on the BYOD journey.”\n\n—Ofer Elzam, integrated security solutions architect, Cisco\n\n\n-----\n\ndisrupters and criminals to connect and assemble quickly,\nanonymously, and unpredictably for a specific goal that\nmay not be motivated by money or have a purpose that\nis easy for others, including targets, to decipher. “Some\nof the things we’ve witnessed over the past year are like\nnothing we’ve ever seen before,” says Gavin Reid, Cisco\nCSIRT manager. “Some events have been absolutely\ncrushing, and this is not a good sign.”\n\nLike our own planet, the connected world has a light\nside and dark side at all times. Enterprise security can\nexist here, but building an effective model requires new\nthinking as well as some risk-taking—and maintaining it\ndemands more vigilance than ever before. The core\nchallenge for today’s businesses is that they must find\nthe right mix of technology and policy to meet their\nunique combination of needs. This is not an easy\nprocess, but the end result will be a more agile business\nbetter prepared to adapt—both swiftly and securely—to\nchanges in technology that tomorrow inevitably will bring.\n\n“The connected world is a more fluid world. And it’s literally\n‘sink or swim’ time now for enterprises that have yet\nto accept that change is no longer just at their door—it’s\nalready in their workplace,” says Chris Young, senior vice\npresident for the Security Group at Cisco. “By embracing\nthe technologies that their employees, and their\ncustomers, inevitably will use, enterprises can create\na better overall security solution by addressing reality\ninstead of wondering about the ‘what if.’”\n\n\nsecurity, is an important start. However, even building\nthe foundation for movement toward a BYOD model can\nbe a challenge.\n\n“Modern smartphones and tablets are a huge IT disruption,”\nsays Ofer Elzam, integrated security solutions architect\nfor Cisco. “Enterprises are conditioned to maintaining\na defined security perimeter and fiercely protecting\neverything inside of it. The rapid erosion of this perimeter\nthat took 20 years to build has left many enterprises\nstunned and feeling vulnerable as they embark on the\nBYOD journey.”\n\n\nIn many ways, their feelings of vulnerability are not\nmisplaced. While living in a connected world means\nwe are closer to our co-workers, business partners,\ncustomers, friends, and family, we and the organizations\nwe work for and do business with are also within easier\nreach of the criminal economy. The openness and\ninterconnectedness that mobile devices, social networks,\nand Web 2.0 applications support provide new avenues\nfor malicious actors to steal from others, disrupt business,\nor simply, make a statement.\n\nCybercriminals are investing more toward “R&D” to find\nways to use mobile devices and penetrate the cloud to\nseize the data they need to make a profit or undermine a\ncompany’s success. And as the hacktivism trend clearly\nindicates, today’s technology allows like-minded social\n\n\n-----\n\n##### 2012 Action Items for Enterprise Security\n\n\n##### 2012 Action Items for Enterprise Security\n\nEven though organizations need to develop an\napproach to network and data security that will 4 Know where your data is and understand how 8 Create an incident response plan. “IT-related\n\n(and if) it is being secured. “Identify every third party risk should be treated like any other business risk.\n\nsupport the specific needs of their workforce and\n\nthat has permission to store your company’s data— This means enterprises need to have a clear plan\n\nhelp them to achieve key business objectives,\n\nfrom cloud providers to email marketers—and confirm in place to respond quickly and appropriately to\n\nthere are several things that any enterprise can do\n\nthat your information is being secured appropriately. any type of security event, whether it’s a data breach\n\nto improve its security posture both immediately\n\nCompliance requirements, and now the trend in resulting from a targeted attack, a compliance\n\nand over the long term. Following are 10\n\ncybercrime toward ‘hack one to hack them all,’ violation due to an employee’s carelessness, or\n\nrecommendations from Cisco’s security experts:\n\nmeans enterprises must never assume their data an incident of hacktivism.”\nis secure, even when they put it in the hands of Pat Calhoun, vice president and general manager of Cisco’s\n\n###### 1 Assess the totality of your network. “Know those they trust.” Secure Network Services Business Unit\nwhere your IT infrastructure begins and ends—so\n\nScott Olechowski, threat research manager for Cisco\n\nmany enterprises simply have no idea of the entirety\n\n###### 9 Implement security measures to help\n\nof their network. Also, know what your ‘normal’ is so\n\ncompensate for lack of control over social\n\nyou can quickly identify and respond to a problem.” 5 Assess user education practices. “Long\n\nnetworks. “Do not underestimate the power of\n\nseminars and handbooks aren’t effective. Younger\n\nJohn N. Stewart, vice president and chief security officer for Cisco technology controls, such as an intrusion prevention\n\nemployees will be more receptive to a targeted\n\nsystem for protecting against network threats.\n\napproach to user education, with shorter sessions\n\n###### 2 Re-evaluate your acceptable use policy and Reputation filtering is also an essential tool for\n\nand ‘just-in-time’ training. Peer training also works\n\nbusiness code of conduct. “Get away from the detecting suspicious activity and content.”\n\nwell in today’s collaborative work environment.”\n\nlaundry list approach with security policies. Focus David Evans, chief futurist for Cisco Rajneesh Chopra, director of product management,\nonly on those things you know you must and Cisco Security Technology Group\ncan enforce.”\n\nGavin Reid, Cisco CSIRT manager not enough enterprises do it—although compliance 6 Use egress monitoring. “This is a basic thing, but 10 Monitor the dynamic risk landscape and\n\nkeep users informed. “Enterprises and their\n\ndemands have more organizations adopting this\n\n###### 3 Determine what data must be protected. practice. Egress monitoring is a change in focus security teams need to be vigilant about a much\n“You cannot build an effective DLP program if broader range of risk sources, from mobile devices\n\nfrom just blocking ‘the bad’ from coming in. You\n\nyou don’t know what information in the enterprise and the cloud to social networking and whatever\n\nmonitor what is being sent out of your organization\n\nmust be secured. You also must determine who in new technology tomorrow may bring. They should\n\nand by whom and to where—and block things from\n\nthe enterprise is allowed to have access to that take a two-step approach: reacting to security\n\nleaving that shouldn’t be.”\n\ninformation, and how they are allowed to access it.” vulnerability disclosures, while also being proactive\n\nJeff Shipley, manager for Cisco Security Research and Operations\n\nDavid Paschich, web security product manager for Cisco about educating their employees on how to protect\n\nthemselves and the enterprise from persistent and\n\n###### 7Prepare for the inevitability of BYOD.\n\npotent cyber threats.”\n\n“Organizations need to stop thinking about when\nthey are going to move to a BYOD model and start Ofer Elzam, integrated security solutions architect for Cisco\nthinking more about how.”\n\nNasrin Rezai, senior director of security architecture and chief\nsecurity officer for Cisco’s Collaboration Business Group\n\n\n-----\n\n#### Cisco Security Intelligence Operations\n\n\n#### Intelligence Operations\n\n\nIt has become an increasing challenge to manage\nand secure today’s distributed and agile networks.\nOnline criminals are continuing to exploit users’ trust in\nconsumer applications and devices, increasing the risk\nto organizations and employees. Traditional security,\nwhich relies on layering of products and the use of\nmultiple filters, is not enough to defend against the\nlatest generation of malware, which spreads quickly, has\nglobal targets, and uses multiple vectors to propagate.\n\nCisco stays ahead of the latest threats using real-time\nthreat intelligence from Cisco Security Intelligence\nOperations (SIO). Cisco SIO is the world’s largest\ncloud-based security ecosystem, using SensorBase\ndata of almost 1 million live data feeds from deployed\nCisco email, web, firewall, and intrusion prevention\nsystem (IPS) solutions.\n\n\n#### Cisco Security\n\n\nCisco SIO weighs and processes the data, automatically\ncategorizing threats and creating rules using more than\n200 parameters. Security researchers also collect and\nsupply information about security events that have the\npotential for widespread impact on networks, applications,\nand devices. Rules are dynamically delivered to deployed\nCisco security devices every three to five minutes.\nThe Cisco SIO team also publishes security best\npractice recommendations and tactical guidance for\nthwarting threats.\n\nCisco is committed to providing complete security\nsolutions that are integrated, timely, comprehensive,\nand effective—enabling holistic security for organizations\nworldwide. With Cisco, organizations can save time\nresearching threats and vulnerabilities, and focus more\non taking a proactive approach to security\n\n\n**Cisco Security IntelliShield Alert Manager**\n**Service provides a comprehensive, cost-effective**\nsolution for delivering the vendor-neutral security\nintelligence organizations need to identify, prevent,\nand mitigate IT attacks. This customizable,\nweb-based threat and vulnerability alert service\nallows security staff to access timely, accurate,\nand credible information about threats and\nvulnerabilities that may affect their environments.\nIntelliShield Alert Manager allows organizations\nto spend less effort researching threats and\nvulnerabilities, and focus more on a proactive\napproach to security.\n\nCisco offers a free 90-day trial of the Cisco\nSecurity IntelliShield Alert Manager Service. By\nregistering for this trial, you will have full access\nto the service, including tools and threat and\nvulnerability alerts.\n\nTo learn more about Cisco Security IntelliShield\n[Alert Manager Services, visit: https://intellishield.](https://intellishield.cisco.com/security/alertmanager/trial.do?dispatch=4)\n[cisco.com/security/alertmanager/trialdo?dispatch=4](https://intellishield.cisco.com/security/alertmanager/trial.do?dispatch=4)\n\n\nFor early-warning intelligence, threat\nand vulnerability analysis, and proven\nCisco mitigation solutions, please visit:\n[www.cisco.com/go/sio.](http://www.cisco.com/go/sio)\n\n\n-----\n\n###### Cisco SecureX\n\n\nThe Cisco SecureX architecture is a next-generation, The Cisco SecureX architecture: Leverages Cisco SIO for robust, real-time insights\ncontext-aware framework that meets the evolving into the global threat environment.\n\nEnforces context-aware policy across a wide range\n\nsecurity needs of borderless network environments.\n\nof form factors to deliver security flexibly, when and\n\nEnables simplified business policies that will\n\nwhere you need it.\n\nUnlike legacy security architectures that were built correlate directly between what IT must enforce and\nto enforce policies based on a single data point, the organization’s business rules.\n\nManages context-aware security policies\n\nCisco SecureX enforces policies based on the full\n\nthroughout the network, providing deep insights\n\ncontext of the situation. Context-aware policies use Integrates comprehensive, extensible APIs that\n\ninto—and effective controls over—who is doing what,\n\na high-level language that aligns closely to business allow Cisco’s own management systems and partners\n\nwhen, where, and how.\n\npolicy. This greatly simplifies policy administration to plug in and complete the security ecosystem.\nwhile simultaneously providing more effective security Provides secure access from a full range of\n\nFor more information on Cisco SecureX, go to\n\nand control. As a result, networks are far more devices—from traditional PCs and Mac-based\n\n[www.cisco.com/en/US/netsol/ns1167/index.html.](http://www.cisco.com/en/US/netsol/ns1167/index.html)\n\nsecure, while business efficiency and flexibility are computers, to smartphones, tablets, and other\nmaximized. mobile devices—anytime, anywhere.\n\n\n-----\n\n###### For More Information\n\n**Cisco Security Intelligence Operations**\n[www.cisco.com/security](http://www.cisco.com/security)\n\n**Cisco Security Blog**\n[blogs.cisco.com/security](http://blogs.cisco.com/security)\n\n**Cisco Remote Management Services**\n[www.cisco.com/en/US/products/ps6192/](http://www.cisco.com/en/US/products/ps6192/serv_category_home.html)\n[serv_category_home](http://www.cisco.com/en/US/products/ps6192/serv_category_home.html)\n\n**Cisco Security Products**\n[www.cisco.com/go/security](http://www.cisco.com/go/security)\n\n**Cisco Corporate Security**\n**Programs Organization**\n[www.cisco.com/go/cspo](http://www.cisco.com/go/cspo)\n\n\n-----\n\nAmericas Headquarters\nCisco Systems, Inc.\nSan Jose, CA\n\n\nAsia Pacific Headquarters\nCisco Systems (USA) Pte. Ltd.\nSingapore\n\n\n###### Report available for download at  www.cisco.com/go/securityreport\n\nEurope Headquarters\nCisco Systems International BV Amsterdam,\nThe Netherlands\n\n\n[Cisco has more than 200 offices worldwide. Addresses, phone numbers, and fax numbers are listed on the Cisco Website at www.cisco.com/go/offices.](http:// www.cisco.com/go/offices)\n\nCi d th Ci L t d k f Ci S t I d/ it ffili t i th U S d th t i A li ti f Ci ’ t d k b f d t i / /t d k Thi d t t d k ti d th\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Cisco - Annual Security Report - 2011.pdf"
    ],
    "report_names": [
        "Cisco - Annual Security Report - 2011.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535863,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1324391724,
    "ts_modification_date": 1324398800,
    "files": {
        "pdf": "https://archive.orkl.eu/a3d4a9252e4445f738fe3d924b16c6499cb69955.pdf",
        "text": "https://archive.orkl.eu/a3d4a9252e4445f738fe3d924b16c6499cb69955.txt",
        "img": "https://archive.orkl.eu/a3d4a9252e4445f738fe3d924b16c6499cb69955.jpg"
    }
}