{
    "id": "19f2ba08-4b45-4876-b9bd-6883e160ca4d",
    "created_at": "2023-01-12T15:02:38.216212Z",
    "updated_at": "2025-03-27T02:12:51.73042Z",
    "deleted_at": null,
    "sha1_hash": "7539bc21765043153751da9f7f50bc2cf2d7a896",
    "title": "2022-03-19 - Behind the hack-and-leak scandal in Poland (UNC1151)",
    "authors": "",
    "file_creation_date": "2022-05-28T01:31:34Z",
    "file_modification_date": "2022-05-28T01:31:34Z",
    "file_size": 218617,
    "plain_text": "# Behind the hack-and-leak scandal in Poland\n\n**[vsquare.org/behind-the-hack-and-leak-scandal-in-poland/](https://vsquare.org/behind-the-hack-and-leak-scandal-in-poland/)**\n\nAnna Gielewska 19.03.2022\n\n**There were over 60,000 emails in Michał Dworczyk’s hacked mailbox. We have new**\n**evidence that UNC1151, a group related to the Belarusian government and serving a**\n**“Ghostwriter” operation in Russia’s interest, is behind the attack.**\n\n**FRONTSTORY.PL has reasons to believe that attackers may still have a vast amount of**\n**sensitive data from VIPs’ emails up their sleeves.**\n\n[This article was originally published in Polish on FRONTSTORY.PL](https://frontstory.pl/afera-mailowa-dworczyk-obajtek-rosja-zhakowany/)\n\nSince June 2021, all of Poland has been reading the contents of Michał Dworczyk’s mailbox,\nright-hand man of Prime Minister Mateusz Morawiecki. The Polish government consistently\nplays down the importance of the breach, even though it exposed poor defense against\ncyber-attacks, and negligence on the part of politicians when it comes to sharing sensitive\ndata. Dworczyk’s emails uncover the backstage of Mateusz Morawiecki’s administration –\nstrategic decisions made with PR in mind, government media treated as useful tools,\ndefamatory campaigns aimed against specific groups.\n\n## Key to Dworczyk’s mailbox\n\n\n-----\n\nWe covered the multi-layered operation called Ghostwriter, with trails leading to Belarus\n[and Russia, almost a year ago on vsquare.org and](https://vsquare.org/privet-you-have-just-been-hacked/) [tvn24.pl. Since then, we have been](https://tvn24.pl/premium/cyberbezpieczenstwo-jak-hakerzy-przejmuja-konta-politykow-i-po-co-to-robia-5058485)\ninvestigating its consecutive phases, trying to establish what goes on behind the scenes.\n\nIn one of the [recent publications, we described how one of the phishing emails sent by](https://vsquare.org/the-ghostwriter-scenario/)\nattackers opened the door to Dworczyk’s mailbox. Phishing is a form of fraud – a criminal\npretends to be somebody else or an entity (i.e. email service provider), in order to trick the\nrecipient and obtain credentials.\n\nAfter publishing that story, we asked Marcin Siedlarz, an expert from Mandiant, an\ninternational company specializing in cyber-security, for additional analysis of data from a\nphishing email.\n\nHis conclusions? – The message was sent from an IP address used previously in other\nconfirmed attacks by the UNC1151 group. This attribution is made with high confidence –\nassesses Siedlarz.\n\nAnd what that means? We can assume with high probability, the attack on Dworczyk’s\nmailbox was carried out by Belarusian hackers, who also serve a multi-layered cyberespionage operation called “Ghostwriter”. In cyber-security terminology “attribution” means\naccrediting a specific hacker group with a particular cyber attack.\n\nMandiant is one of the biggest companies assessing cyber-threats. In November 2021\nreport, its analysts revealed that members of hacker group UNC1151, who are responsible\nfor attacks on people and institutions in Ukraine, Lithuania, Latvia, Poland, and Germany,\nand provide technical support for the “Ghostwriter” campaign, operate from Minsk, Belarus.\n\n“UNC1151 provides technical support to the Ghostwriter information operations campaign,\nand is linked to the Belarusian government,” stated the report. According to analysts,\n“Belarus is also likely at least partially responsible for the Ghostwriter campaign.” The\nexperts didn’t rule out Russian contribution to the attacks, or its influence.\n\nNow, we have also a confirmed link between the so-called Dworczyk Leaks and UNC1151\nactivities.\n\nSo what links “Ghostwriter” operation and disinformation attacks consistent with Kremlin\nagenda, with activities of a hacker group that is directly tied to Belarusian special services?\n\nThere are few possible answers. It is likely that UNC1151 is one of the groups providing\ntechnical support for a multi-layered Russian operation. Even more so, since UNC1151\n[seems to emulate the GRU patterns, as we reported in August 2021. They gather](https://vsquare.org/the-ghostwriter-scenario/)\ninformation that might benefit different autonomous operations: the “Ghostwriter” campaign,\nofficial Belarusian propaganda, but also reconnaissance and intelligence operations, and\neven blackmail. Given Russia’s war in Ukraine, it is also likely that UNC1151 works closely\nwith Russian hacker groups, and is responsible for getting access to designated targets.\n\n\n-----\n\nThe scale of the operation conducted simultaneously in different countries, its geopolitical\ngoals, and content distribution in the Russian-speaking social media might go way beyond\nthe capabilities of Belarusian services. Russian involvement was also investigated by\nGerman intelligence. Series of phishing attacks aimed at Bundestag members were linked to\n[the “Ghostwriter” operation and were attributed to GRU. At the end of October 2021, the](https://www.reuters.com/world/europe/russia-responsible-cyber-attacks-german-parliament-german-foreign-ministry-2021-09-06/)\nCouncil of the European Union condemned Russia for the “Ghostwriter” campaign.\n\n## Hack&Leak Operation\n\nWhen on 24 February Russia invades Ukraine, the website Poufna Rozmowa (“Confidential\nConversation”), which has been posting Michał Dworczyk’s emails for the past nine months,\ndoesn’t notice it. It continues its work as usual, publishing new screens with emails that\nreveal how PiS (Law and Justice) politicians and people close to Prime Minister Morawiecki\ndo their business.\n\nOne week after the attack, a disinformation campaign focused on refugees starts. Suspicious\nlocal Facebook groups circulate false content against people of colour and non-Ukrainian\nrefugees who cross the Polish-Ukrainian border. When Poufna Rozmowa posts a text that\nsays: “If those savages cross into Poland, days of PiS are numbered,” its connotations are\nobvious. In fact, it is a screen of an email from 2016, extracted from, most likely, hacked\nmailbox belonging to Joachim Brudziński, a politician and PiS member. Someone forwarded\nhim at that time a group email titled: “Voices of Poles/protecting border with Ukraine.”\n\nThree days later Poufna posts the Ukrainian flag with words: “Solidarity with Ukraine.”\n\n[Breach into Dworczyk’s mailbox is a special case of Hack&Leak operation (we wrote about](https://vsquare.org/the-ghostwriter-scenario/)\nthe most famous Hack&Leak operations – an attack on John Podesta, former chairman of\nHilary Clinton’s campaign, and attack on Emmanuel Macron – in August). It is special,\nbecause screens with emails belonging to the Chief of Chancellery, with attached photos and\ntitles, are being dosed and spoon-fed to general public almost daily for the last nine months.\n\nFrom June 2021, the contents of Dworczyk’s mailbox were distributed through a Telegram\nchannel. But it was blocked for Polish viewers in July. Few days later, on 27 July, after\nexperimenting with other platforms (i.e. Yandex.com chat and profile on Russian social\nnetwork vk.com), website Poufna Rozmowa was registered and immediately launched (the\nnext day another website publishing military materials and documents in Russian was also\nlaunched).\n\nWe don’t know who registered both websites – trail stops with a service anonymizing owners’\nnames, in Iceland.\n\nNew Telegram channel promoting Poufna Rozmowa website has been online since August\n2021. Original chat created by channel authors has 1500 members – mostly anti-vaxxer\naccounts.\n\n\n-----\n\n## Website posts during work hours\n\nOur analysis shows that Poufna Rozmowa usually posts new materials from Monday to\nFriday during working time (6 AM to 4 PM CET). Usually, it is two screens per day. Between\nJuly 2021 and February 2022, website posted a total number of 366 entries. Monthly, it is\nviewed by 240,000 users (this number has been dropping in last weeks). Most traffic is made\nthrough browsers or search engines – the heaviest traffic is generated by people typing the\naddress directly or searching words “poufna rozmowa” (“confidential conversation”), and\n“maile Dworczyka” “Dworczyk’s emails”).\n\nWe have found out that attackers, who hacked Dworczyk’s mailbox, might have gained\naccess to a vast amount of materials. Dworczyk was using it for over 20 years, including\nperiods when he served as Deputy Minister of National Defence (2017), and Chief of\nChancellery. At the time of the breach, his mailbox included over 60,000 emails.\n\nWe can’t rule out the possibility that Dworczyk’s mailbox has been used by attackers as a\n“mother box” – a database containing private addresses of people with whom Dworczyk\nexchanged emails. And as such, it could serve as a reference for future phishing attacks.\n\nWe still don’t know at what phase the whole operation is right now. According to our unofficial\nfindings, screens of emails leaked from the Chief of Chancellery’s mailbox published so far\nare genuine. But the content of a few attached files that were published initially on the\n[Telegram channel has been modified. We have reported such manipulations in our previous](https://vsquare.org/privet-you-have-just-been-hacked/)\n[articles.](https://vsquare.org/the-ghostwriter-scenario/)\n\nLeaking some genuine material doesn’t mean that all screens will stay genuine in the future.\nThe strategy called “tainted leaks” has been described by John Railton from CitizenLab (who\nalso investigates the Pegasus scandal). Once the attackers gain public trust, they can use\nsuch credibility to publish complete false content. This threat seems even bigger now, amid\nRussia’s war in Ukraine.\n\n## One hundred accounts of people in power\n\n[In August 2021, shortly after the scandal broke, we reported some evidence points to](https://vsquare.org/the-ghostwriter-scenario/)\n“Dworczyk Leaks” being a part of bigger operation:\n\nDworczyk’s email address and address of his wife (both created in wp.pl domain) were\ntargets of phishing attacks carried out between 2020-21. Attackers hacked Facebook\naccount belonging to Dworczyk’s wife and posted a fabricated message with a link to\nthe Telegram channel informing about the leak. This post started “the hack-and-leak\nscandal.”\n\n\n-----\n\ncontent distribution in social media – creators of the Russian-speaking Telegram\nchannel might have access to Dworczyk’s mailbox a few months before the launch of\nPoufna Rozmowa website and the Polish-speaking Telegram channel. Telegram\nchannel (in Russian) was used extensively as a fuel for Belarussian propaganda, which\naccused Poland of organizing and funding protests in Belarus. The same content was\ndistributed through other Russian-speaking channels.\n\nApart from the content of Dworczyk’s mailbox, Poufna Rozmowa posted screens from private\nmailboxes of Joachin Brudziński (PiS politician) and Piotr Bączek, former chief of Military\nCounterintelligence Service (SKW). And this means the authors of Poufna Rozmowa have,\nor receive from somebody else, a selected excerpt of emails from hacking attacks.\n\nSKW is conducting a separate investigation regarding Bączek’s case but refuses to\ncomment.\n\nIn June 2021, two weeks after the breach into Dworczyk’s mailbox was made public, Polish\nInternal Security Agency (ABW) [informed that “at least 4350 email addresses” were](https://www.gov.pl/web/sluzby-specjalne/ustalenia-abw-i-skw-dot-atakow-hakerskich)\nattacked, and “at least 500 users responded to phishing emails (…). Among attacked\naddresses, over 100 belong to public figures – former and current ministers, members of\nparliament, senators, local government officials.”\n\nOur investigation suggests that private addresses of Bączek and Brudziński were on the list\nof compromised emails mentioned in the ABW’s statement.\n\n## PiS office warns against phishing\n\nWe have followed a trail left by ABW, and asked new questions. What other mailboxes were\ntargets and which might have been compromised? Who was informed by the police about\nthe attacks on their mailboxes?\n\nWe have also researched the content distribution from previously known hacked accounts\nand cyber-attacks patterns (i.e. spoofing domains’ lists included in cyber threat reports).\n\nFinally, we have reconstructed a partial list of attacked mailboxes. FRONTSTORY.PL has\nreasons to believe that apart from Dworczyk’s mailbox, attackers may have compromised\nprivate mailboxes belonging to Paweł Szrot, Chief of Cabinet of President; Mariusz Kamiński,\nMinister-Special Services Coordinator, and Daniel Obajtek, head of PKN Orlen, as well as\nfew high-ranking military officials, both in active service and retired, and family members of\npeople who died in Smolensk plane crash.\n\nWhen we asked about the possible breaches (we sent emails before publication), we didn’t\nget any comment neither from Orlen’s press office nor from Stanisław Żaryn, spokesman of\nMinister-Special Services Coordinator. Paweł Szrot declined any comments on the phone.\n\n\n-----\n\nDay after publication in the Polish media, Żaryn sent us a statement: There is no reason to\nclaim that anyone gained unauthorised access to the mailbox used by Mariusz Kaminski.\nMinister Kaminski did not open the content of any information which could have been used to\ncompromise his mailbox. He also did not provide access passwords on sites that were used\nto phish for such passwords. After verification, security of the email box used by Minister\nKaminski was confirmed by authorised cyber security institutions.”\n\nŻaryn didn’t reply to our question whether Kamiński’s private email was listed among the\nhundred accounts belonging to the public figures mentioned in the ABW’s statement in 2021.\n\nWhy hackers choose such targets in particular? And to what purpose? How many mailboxes\nwere they able to hack? Police and prosecutor’s office are very reluctant to answer these\nquestions.\n\nMore forthcoming are people whose social media accounts have been used in previous onetime disinformation attacks.\n\nIwona Michałek, former deputy minister in the Ministry of Development, was informed about\nthe attack by her co-workers on 12 January 2021. “I saw a post on my account, and I wasn’t\nthe author,” told us the member of Agreement (Porozumienie) party. Hackers also gained\naccess to her mailbox and Twitter account. “I used this address both for private and official\nbusinesses, but very seldom for the latter. I don’t think I discussed politics there. It was not\nlinked with ministerial mailbox,” said Michałek. When she received a notification about the\nbreach, she reported it to the police. “Soon after, me and my co-workers were questioned,”\nshe recalled.\n\nThree weeks later, a phishing email is sent to Bogdan Rzońca, member of EP and PiS party.\n“I was on a plane, flying from Brussels. I was going through my mail, and accidentally\nopened one of the messages with pornographic content,” said Rzońca. When he landed in\nWarsaw, he received a call from PiS offices. “Someone called and said that I was a target of\na phishing attack, and asked if I logged to my mailbox this morning. I said yes, but I didn’t\nread the message,” explained Rzońca. Then, he was told a similar email was sent earlier to\nMarek Suski, a member of the Polish Parliament. “I was instructed to change the password,”\nsaid Rzońca. His assistant managed to block a Twitter account before attackers made use of\nit. Rzońca didn’t report the incident to the police or prosecutor’s office.\n\n## Prosecutor writes to Panama\n\nPhishing attacks, if successful, allowed hackers to gain access to emails. If hacked\nmailboxes were linked with social media accounts, attackers could use them to post false\ncontent on Facebook and Twitter. Most often, such posts were aligned with Russian and\nBelarussian propaganda goals (i.e. attacks on NATO or Polish-Lithuanian relations).\n\n\n-----\n\nSometimes, they included links to fabricated stories posted on hacked websites belonging to\nlocal media or public institutions. We have covered these tactics and methods in our\n[previous articles, analysing particular](https://view.genial.ly/60621d7a727be90d482e08a0) [attacks in detail.](https://view.genial.ly/60621d7e727be90d482e08a1)\n\nSimilar attack was carried out on private mailbox of general Bogusław Pacek in November\n2021. Attackers also hacked his Facebook and Twitter accounts, and used them to post antiUkrainian content. Hacked website belonging to a local media outlet was also used to spread\na fabricated message supposedly written by Pacek. The title read: “Shame on our\nauthorities! Modern-day Banderians will come to Poland.”\n\nGeneral’s private address was probably not on the ABW list, because he didn’t receive any\nwarning from the police prior to the attack. Pacek immediately informed the media about the\nattack. What happened after? “People from NCBC (National Center for Cyberspace Security)\noffered me help in retrieving my accounts. I was surprised, but they delivered on a promise. It\nwas my old, private mailbox. I used it very seldom, so I don’t think the attackers gained\nanything from it, apart from one-time action with an anti-Ukrainian post,” said Pacek.\n\nThe attackers have used at least 25 public accounts in similar attacks thus far. They\nbelonged to members of Parliament Marcin Duszek, Marek Suski, Arkadiusz Czartoryski,\nIwona Arent, and Joanna Borowiak, Minister Marlena Maląg, Marshal of the Sejm Elżbieta\nWitek (all from the ruling coalition), Andrzej Melak, as well as right-wing publicists and local\ngovernment officials. Some of the faked posts published in those attacks can still be found\nonline.\n\nProsecutor’s Office in Toruń handed the investigation of hacker attacks to the Cybercrime\nDepartment of Bydgoszcz Provincial Police Headquarters. We have asked if any real\nprogress has been made on the case, but received an enigmatic answer suggesting only that\n14 people are victims of the attacks investigated by the prosecutor’s office. Prosecutors also\nasked German, Austrian, French, Swedish, Dutch, Spanish, Panamanian, and Indian\nauthorities for help.\n\nMeanwhile, separate investigation regarding Dworczyk’s mailbox is being carried out by\nProsecutor’s Office in Warsaw. Did prosecutors manage to find out who hacked Prime\nMinister’s aide so many months ago? “The proceedings pertinent to the case are still being\ncarried out, which means that no charges have been filed thus far. Currently, the\nProsecutor’s Office is in the process of gathering evidence. Bearing the interest of the\nproceedings in mind, Prosecutor’s Office in Warsaw will not disclose any detailed information\npertaining to the findings, and any actions, performed or planned,” informed us the Warsaw\noffice.\n\nBoth offices extended their investigations for additional months.\n\n## Questions still to answer\n\n\n-----\n\nFor months, Polish security services weren t answering key questions about the biggest\ncyber-espionage operation in the history of Polish politics. An operation that should have,\ngiven the dangers of information warfare, put all intelligence on high alert. Meanwhile, Polish\nsecurity services compiled its report in October 2021, and closed the so-called “critical\nincident”, although emails leaked from Dworczyk’s mailbox are being published almost every\nday.\n\nFew of the questions we have asked while researching the “Ghostwriter” operation remain\nunanswered: how many groups might be involved in the entire operation? In what way their\nactions might be coordinated? Do they cooperate or are they acting independently,\n“providing services” for the multi-layered cyber-operation? And finally, whether any human\nresources of Russian intelligence in Poland might be involved?\n\n[As we stressed in previous](https://vsquare.org/privet-you-have-just-been-hacked/) [publications, the immediate goal of such attacks is to cause](https://vsquare.org/the-ghostwriter-scenario/)\nconfusion, chaos, and incite negative emotions through sensitive topics. Attacks may also\nhave another aspect – they are used for testing reactions, coverage, infrastructure, and even\nfor profiling or blackmailing specific targets.\n\n## UNC1151 attacks Ukraine\n\n[On 27 February, Facebook published a report, informing about the increased “Ghostwriter”](https://about.fb.com/news/2022/02/security-updates-ukraine/)\nactivity in Ukrainian internet, and the attacks carried out mostly against military officials and\npublic figures. “Ghostwriter typically targets people through email compromise and then uses\nthat to gain access to their social media accounts and post disinformation,” wrote the authors\nof the report. “We detected attempts to target people on Facebook to post YouTube videos\nportraying Ukrainian troops as weak and surrendering to Russia, including one video\nclaiming to show Ukrainian soldiers coming out of a forest while flying a white flag of\nsurrender.”\n\nUkrainian CERT warned about mass phishing attacks and increased activity of UNC1151\ngroup in Ukrainian internet even before the invasion. “The Minsk-based group ‘UNC1151’ is\nbehind these activities. Its members are officers of the Ministry of Defence of the Republic of\nBelarus,” informed CERT-UE. “Besides Ukrainian and Polish targets, the group is attacking\nBelarusians.”\n\nOn 25 February, CERT-UA posted an additional message on Facebook with a list of domains\nused in attacks.\n\nAnalysts from [Proofpoint informed that cyber-attackers used hacked mailboxes belonging to](https://www.proofpoint.com/us/blog/threat-insight/asylum-ambuscade-state-actor-uses-compromised-private-ukrainian-military-emails)\nUkrainian military officials to send fabricated messages to “target European government\npersonnel involved in managing the logistics of refugees fleeing Ukraine” in order to trick\nthem into downloading malicious software. According to Proofpoint, this time the goal was “to\ngain intelligence regarding the logistics surrounding the movement of funds, supplies, and\npeople within NATO member countries.”\n\n\n-----\n\nAnother company, Secureworks, analysed domains used in recent phishing attacks (the list\nwas published by Ukrainian CERT, and the attacks were attributed to UNC1151 group), and\nfound an additional domain cluster (accounts registered by “Apolen Zork” and “Radek\nDominik”).\n\nNew domains, exposed during the attacks, were registered in November 2021 and\nafterwards. Some of them pose as Polish service providers which means that the attacks are\n[ongoing, and aimed against military facilities in Poland.](https://www.secureworks.com/research/threat-profiles/moonscape)\n\n## “Let’s not talk about the scandal”\n\nIn days following the breaking of the hack-and-leak scandal, some PiS members attentively\nmonitored the list of names and contacts leaked from Dworczyk’s mailbox. In unofficial talks,\nfew politicians even voiced their regret for not making the “email group.” Why? The group\nwas viewed as a circle of people closest to Prime Minister Mateusz Morawiecki. This\nperspective changed only after subsequent publications of Poufna Rozmowa website. Today,\nmembers of the ruling party are afraid of whose emails could be published next. Dworczyk\nand his aides were allegedly thinking about resigning, but preparations were put on hold due\nto Russia’s war in Ukraine. To this day, no one took responsibility for the scandal, or any\nother incident stemming from emails leaked from Dworczyk’s mailbox.\n\nSpecial services and politicians of the ruling party don’t want to answer questions regarding\nthe scandal and keep repeating statements that make chaos surrounding the so-called\nDworczyk Leaks only worse.\n\nWhen Krzysztof Izdebski from the Stefan Batory Foundation filed a motion to the Chancellery\nof the Prime Minister in February 2021, asking for disclosure of detailed information\nregarding the scandal, he was pointed to statements published previously by ABW.\nFRONTSTORY.PL team has been treated exactly the same for many months.\n\nWhat motives drive the “ghost” behind this operation? The hack-and-leak scandal seems to\nhave a broader dimension than influencing the current state of political affairs in Poland. It is\nrather a part of a multi-layered cyber operation aimed at destabilisation of the whole region.\n\nWe are starting a series of reports on Russian connections and influences in Poland. We\nhave been covering major figures of pro-Kremlin propaganda, and their operations, for years\n[on our vsquare.org and](https://vsquare.org/) [FRONTSTORY.PL websites and other media, publishing texts](https://frontstory.pl/)\nwritten by Paweł Reszka, Anna Gielewska, Pavla Holcova, Szabolsc Panyi, Konrad\nSzczygieł, Wojciech Cieśla, and many more. In 2016-21, we have uncovered behind-thescenes actions of Alexander Usovski, Bela Kovacs and Mateusz Piskorski. We have\nexposed the gears of pro-Kremlin propaganda machine, its disinformation operations, and\nassets accumulated in Poland and Central Europe. We have watched closely, how radical\n\n\n-----\n\ngroups and organizations act, including the arson attack on cultural center in Uzhorod. In\n2019, we have uncovered the assets and modus operandi of Russian bank operating in\nVisegrád countries.\n\nBelow, you’ll find a list of selected articles on Russian connections and influences (in\nEnglish).\n\n[Putin’s Orchestra: The Supporter, 10.03.2022](https://vsquare.org/putins-orchestra-the-supporter/)\n\n[Travel Agency “Eye of Sauron”, 4.08.2021](https://vsquare.org/travel-agency-eye-of-sauron/)\n\n[The Ghostwriter Scenario, 13.08.2021](https://vsquare.org/the-ghostwriter-scenario/)\n\n[Privet, You Have Just Been Hacked, 30.03.2021](https://vsquare.org/privet-you-have-just-been-hacked/)\n\n[The Nuclear Influence. How Russia Acts on the Central European Energy Market,](https://vsquare.org/the-nuclear-influence-how-russia-acts-on-the-central-european-energy-market/)\n20.03.2020\n\n[Russia-Related Accounts and Cyberattack in Poland, 9.05.2020](https://vsquare.org/russia-related-accounts-and-a-cyberattack-in-poland/)\n\n[Inland, Though Offshore. How Russia Planned to Secure Its Money, 3.08.2019](https://vsquare.org/inland-though-offshore-how-russia-planned-to-secure-its-money/)\n\n[Elections under the Polish and Russian Watchful Eyes,30.08.3019](https://vsquare.org/under-polish-and-russian-watchful-eye-what-were-the-observers-doing-in-madagascar/)\n\n[Budapest. A Welcoming Gateway to Europe for a Russian Bank, 18.07.2019](https://vsquare.org/budapest-a-welcoming-gateway-to-europe-for-a-russian-bank-iib/)\n\n[Make Spain Great Again, 26.04.2019](https://vsquare.org/make-spain-great-again/)\n\n[German Politician and Polish Nationalists in the Kremlin’s Service, 22.04.2019](https://vsquare.org/german-politician-and-polish-nationalists-in-the-kremlins-service/)\n\n[Poland’s New Minister: Nationalist, Supporter of Russia, 7.01.2019](https://vsquare.org/polands-new-minister-nationalist-supporter-of-russia/)\n\n[Nuclear Lobbyists, Judo Championship and Putin’s Tricks, 15.02.2018](https://vsquare.org/nuclear-lobbyists-judo-championship-and-putin/)\n\n[Target or Ally? Hungary Faces the Elections Battle, 3.04.2018](https://vsquare.org/russia-target-or-ally-hungary-faces-the-elections-battle/)\n\n[Usovsky’s Network Active in Poland, 18.05.2018](https://vsquare.org/usovsky-network-active-in-poland/)\n\n[Western Ukraine Burning. How Russia Sets Fire to the EU’s External Border, 27.06.2018](https://vsquare.org/zakarpattia-western-ukraine-burning-how-russia-sets-fire-to-the-eus-external-border/)\n\n[From Internet Brigades to Troll Factories, 28.12.2017](https://vsquare.org/from-kremlin-web-brigades-to-russian-troll-factories/)\n\n[The Dogs of War, The Dogs of Disinformation, 24.11.2017](https://vsquare.org/polish-snipers-in-donbass-myth/)\n\n[Satan’s Hand: Russian Meddling Behind Budapest’s Metro Chaos, 27.10.2017](https://vsquare.org/satans-hand-russian-meddling-behind-budapests-metro-chaos/)\n\n[The Hunter of Russian Propaganda, 21.10 2017](https://vsquare.org/the-hunter-of-russian-propaganda/)\n\n\n-----\n\n[Information Warfare. Journalists Are the Target, Manipulation is a Tool, 4.10.2017](https://vsquare.org/information-warfare-journalists-are-the-target/)\n\n[The Man Who Wanted More, 14.10.2017](https://vsquare.org/the-man-who-wanted-more/)\n\n[A Story of the Snake That Ate Its Own Tail, 4.10.2017](https://vsquare.org/a-snake-that-ate-its-own-tail/)\n\n[A Pocket Revolution Bought With Russian Money, 4.10.2017](https://vsquare.org/a-small-revolution-bought-with-russian-money/)\n\n[The Great Escape of ‘KGBéla’, Hungarian MEP Accused of Spying for Russia, 4.10.2017](https://vsquare.org/the-great-escape-of-kgb/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-19 - Behind the hack-and-leak scandal in Poland (UNC1151).pdf"
    ],
    "report_names": [
        "2022-03-19 - Behind the hack-and-leak scandal in Poland (UNC1151).pdf"
    ],
    "threat_actors": [
        {
            "id": "c1ac2a5e-0225-47a4-8ac5-5fa898c96bde",
            "created_at": "2023-01-06T13:46:38.472883Z",
            "updated_at": "2025-03-27T02:00:02.84253Z",
            "deleted_at": null,
            "main_name": "ProjectSauron",
            "aliases": [
                "Sauron",
                "Project Sauron",
                "G0041"
            ],
            "source_name": "MISPGALAXY:ProjectSauron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535758,
    "ts_updated_at": 1743041571,
    "ts_creation_date": 1653701494,
    "ts_modification_date": 1653701494,
    "files": {
        "pdf": "https://archive.orkl.eu/7539bc21765043153751da9f7f50bc2cf2d7a896.pdf",
        "text": "https://archive.orkl.eu/7539bc21765043153751da9f7f50bc2cf2d7a896.txt",
        "img": "https://archive.orkl.eu/7539bc21765043153751da9f7f50bc2cf2d7a896.jpg"
    }
}