{
    "id": "1a30e2df-2b45-4272-96ea-213827192079",
    "created_at": "2022-10-27T08:36:03.624435Z",
    "updated_at": "2025-03-27T02:05:28.977179Z",
    "deleted_at": null,
    "sha1_hash": "d77f937b2a9dedc913d0018ee73afb5de439d294",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-06-06T16:53:43Z",
    "file_modification_date": "2022-06-06T16:54:23Z",
    "file_size": 6231023,
    "plain_text": "# Fake Cracked Software Caught Peddling\n Redline Stealers\n\n### By Akshat Pradhan\n\n\n-----\n\n## Table of Contents\n\n###### 3 Executive Summary\n\n 3 Key Research Findings\n\n 4 Inside the Malware-as-a-Service\n Industry\n\n 7 Technical Analysis of Redline\n InfoStealer Campaign\n\n 7 Archive Analysis\n\n 10 Simple Loader Analysis\n\n 14 PureCrypter Analysis\n\n16 Delay Module\n\n16 Exclusion Module\n\n19 Fake Message Module\n\n19 Debugger/Sandbox Check Module\n\n22 Discord Module\n\n23 Binder Module\n\n\n###### 29 Conclusion\n\n 30 ATT&CK Mapping\n\n 31 Appendix\n\n 33 IOCs\n\n 33 Discord Attachment URLs\n\n 33 Dropper URLs\n\n 34 Dropper Samples\n\n 34 Redline CnC IP\n\n 34 Redline InfoStealer\n\n 34 About Qualys\n\n\n23 StartUp Module\n\n24 Injection Module\n\n###### 26 Redline Stealer Analysis\n\n\n-----\n\n## Executive Summary\n\n##### Qualys Threat Research continues our efforts to identify and document\n\n previously unseen adversary activity to better understand their tactics,\n\n techniques, and procedures (TTPs) and defend against them. As a result\n\n of this endeavour, we identified a new Redline InfoStealer campaign that\n\n spreads via fake cracked software hosted on Discord’s content delivery\n\n network (CDN). The campaign was actively observed from the end of\n\n January to March 2022 and utilized commercial malware families. This\n\n makes attribution particularly difficult due to overlap in IOCs and TTPs.\n\n The main objective of this campaign was to acquire Redline logs for\n\n monetary gain. In this whitepaper, we dissect the entire campaign in-depth\n\n and delve into underground markets to examine the complexity and\n\n replicability of the overall flow.\n\n## Key Research Findings\n\n9 Zip archives with fake cracked software that ultimately deployed Redline\n\n9 URL shorteners and fake sites that redirected victims to zip archives hosted on Discord’s CDN\n\n9 Archive contained simple loaders for PureCrypter with a hijacked certificate from Exodus Movement Inc\n\n9 PureCrypter injection module was used to deploy Redline InfoStealer\n\n\n-----\n\n## Inside the Malware-as-a-Service Industry\n\nWe will describe the various commercial malware that were part of the campaign in this section.\n\nAt Qualys, we use the term “Simple Loader” to refer to a large group of samples that use MSIL stub codes to\nperform download and execution of second stage payloads (Fig.10). They also contain multiple junk functions\nfrom legitimate applications. Due to the large number of samples that have been observed using this\ntechnique, it is highly likely that multiple tools have emerged that build these stubs. These stub loaders are\n[often observed in commercial malware campaigns.](https://twitter.com/ESETresearch/status/1483161464106098689)\n\nPureCrypter is a commercial tool for obfuscation, evasion, and injection that is often sold on hacking forums\n(Fig.0). PureCrypter claims that it is ‘fully undetected’ (FUD) and offers a variety of features from evasion checks,\nexclusion additions, multiple injection techniques, multiple persistence methods, etc. PureCrypter has multiple\npricing packages and costs $59 for 30 days (Fig.1). The team also has other projects for sale such as miners,\nRATs, worms, and more.\n\n_Fig.0 PureCrypter advertisement_\n\n_Fig.1 PureCrypter pricing packages_\n\n\n-----\n\nRedline Stealer is a commercially available infostealer that is sold on underground markets (Fig.2).\n\n_Fig.2 Advertisement for Redline on underground markets, with translations_\n\nTranslating these advertisements on its official market and support channels revealed an impressive list of features:\n\n9 Grab logins and passwords\n\n9 Grab cookies\n\n9 Grab autofill data\n\n9 Grab credit cards\n\n9 Files from file grabbers\n\n9 Grab FTP/IM client data\n\n9 Create/edit tasks\n\n9 Download a file via direct links\n\n9 Inject a 32-bit PE file\n\n9 Download and execute PE\n\n9 Open link in default browser\n\n9 Grab system information\n\n9 Grab data from browsers\n\n9 Various log sorters to sift through acquired data and grab interesting data.\n\n9 Cloning certificates\n\n9 Built in builder with parameters\n\n9 Blacklist countries where the stealer won’t work\n\n9 Crypto scanner\n\n9 Creating a loader with embedded links\n\n9 Check AV detections using Dyncheck\n\n\n-----\n\nThe prices for Redline’s subscription at the time of publication was about $150 per month. The standalone\npro version costs about $800 and includes free lifetime updates and support. We even observed a user asking\nfor help in building a Redline panel who was then directed to customer support. The market also has various\nsellers advertising:\n\n9 Manuals on various topics such as hosting your own stealer, SEO for fake sites with cracked software,\n\ncarding, etc.\n\n9 Redline logs\n\n9 Credentials for popular sites such as AOL, Yahoo, Amazon, etc.\n\n9 RDP access\n\n9 Offers to buy web shells\n\n9 Escrow services\n\n9 Banking details such as card details, ATM pins, credentials etc.\n\n9 SMS and mail senders\n\nMembers also posted specific requests such as country-specific site access, Coinbase accounts, gift cards,\nand other inquiries. This highlights how organized the Redline market is. It was surprising to observe the\ncommercialization and mature organizational structure of the malware-as-a-service industry.\n\nIn the next section, we will review the entire campaign flow in depth.\n\n\n-----\n\n## Technical Analysis of Redline InfoStealer Campaign\n\n#### Archive Analysis\n\nWe identified several zip files that contained droppers for Redline InfoStealers. The zips were named after\npopular software that were thematically spread across NFTs, games, editing, and installers (Fig.3).\n\n_Fig.3 Zips with popular software names_\n\nThere were several indicators that pointed to these zip files being authored by the same tool or adversary.\nThe folder structures, obfuscation used, contacted IPs, dropping methodology, and other indicators were all\nidentical (Fig.4).\n\n_Fig.4 Folder structure_\n\n\n-----\n\nThe hackers tried to lend an air of legitimacy to the setup binary (simple loader) by bundling decoy files, icons,\nand resources from legitimate applications. They also used a hijacked certificate from Exodus Movement Inc., a\ncrypto wallet application (Fig.5).\n\n_Fig.5 Hijacked certificate detail_\n\nHowever, the sample 06f65e5d32f58944fe0a50f12d8eb5c4 did not have this certificate and was unsigned. We\nare unclear on whether this was a mistake on the attacker’s part or not.\n\nAn interesting example of the customization per sample was observed by dumping the manifest of the binary,\nwhereby the theme of the sample was maintained.\n\n_Fig.6 Customized manifests_\n\nHere, Gigaland is an NFT marketplace and Dinox is an NFT-themed collectible game (Fig.6).\n\n\n-----\n\nThe dropper binaries also had large sections of padding to avoid automated analysis with size limits (Fig.7).\n\n_Fig.7 Padding_\n\nThe zip files were hosted via Discord attachments. At times, the attackers used a URL shortening service that\nultimately resolved to the Discord attachment. Discord URLs are public by default without any access control\nand have the format:\n\n###### https://cdn[.]discordapp[.]com/attachments/[ChannelID]/[AttachmentID]/[filename]\n\nThe ChannelID here is the unique id of the text channel where this message was initially published. Multiple\nchannels like this make up a server. This information is not sufficient to identify the message author and the\nserver on which it was initially sent.\n\n[There has been a steady increase in Discord CDN abuses and other vendors have also documented such attacks.](https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/)\nThe full list of identified URLs and their redirects are listed under the IOC section at the end of this paper.\n\n\n-----\n\n#### Simple Loader Analysis\n\n**Sample MD5: a90d58052bcacd0194d1dfc0dd9d7929**\n\nInterestingly, all the droppers identified were functionally the same yet have varying degrees of obfuscation\nand complexity. Some notable obfuscation techniques are listed in the table below. It is unclear exactly which\nobfuscator was used on these simple loaders.\n\n**OBFUSCATION** **DESCRIPTION** **OBSERVED SAMPLES**\n\nReflective method calls Sample uses static method, reflection, 7f6de92ece5a366cc15af5574701fe98,\nand byte arrays to dynamically map 1c8112b8e1f13ca4129cae22f3387d47,\nmethods. (Fig. 6). 06f65e5d32f58944fe0a50f12d8eb5c4,\n\n771a4fea6f33eac0771b108e8933703a\n\nEmbedded command Sample uses hex encoded string bytes 06f65e5d32f58944fe0a50f12d8eb5c4,\nthat are xored and/or text replaced. 154bda18ddf65e3d79caa9abeb7c4468\n\nOverloaded methods Overloading methods and using an a90d58052bcacd0194d1dfc0dd9d7929\narray with a variable to define which\nmethod is called.\n\nHashed method names Sample uses the embedded command 154bda18ddf65e3d79caa9abeb7c4468\nobfuscation technique with hashed\nmethod names to obfuscate flow.\n\nThe dropper first created a new PowerShell process to pause the program (Fig.8):\n\n###### Powershell.exe -enc YwBtAGQAIAAvAGMAIAB0AGkAbQBlAG8AdQB0ACAAMgAxAA==\n\nThe encoded command decoded to cmd /c timeout 21. Another variant used the command (Fig.9):\n\n###### powershell.exe -enc UwB0AGEAcgB0AC0AUwBsAGUAZQBwACAALQBzACAAMgAwAA==\n\nWhich decodes to Start-Sleep -s 20.\n\n|OBFUSCATION|DESCRIPTION|OBSERVED SAMPLES|\n|---|---|---|\n|Refel ctive method calls|Sample uses static method, refel ction, and byte arrays to dynamically map methods. (Fig. 6).|7f6de92ece5a366cc15af5574701fe98, 1c8112b8e1f13ca4129cae22f3387d47, 06f65e5d32f58944fe0a50f12d8eb5c4, 771a4fea6f33eac0771b108e8933703a|\n|Embedded command|Sample uses hex encoded string bytes that are xored and/or text replaced.|06f65e5d32f58944fe0a50f12d8eb5c4, 154bda18ddf65e3d79caa9abeb7c4468|\n|Overloaded methods|Overloading methods and using an array with a variable to defni e which method is called.|a90d58052bcacd0194d1dfc0dd9d7929|\n|Hashed method names|Sample uses the embedded command obfuscation technique with hashed method names to obfuscate fol w.|154bda18ddf65e3d79caa9abeb7c4468|\n\n\n-----\n\n_Fig.8 Process creation in sample 7f6de92ece5a366cc15af5574701fe98_\n\n_Fig.9 Process creation in sample a90d58052bcacd0194d1dfc0dd9d7929_\n\nThe next step was to connect to the IP 81[.]4[.]105[.]174 to download the PureCrypter injector which had\nRedline Stealer embedded as a resource. The URL typically followed the format of:\n\n###### Protocol:ip/.Net AssemblyName.extension\n\n\n-----\n\nThe file extension used here was typically .jpg, .png or .log to make the URL seem innocuous (Fig.10). The full\n[list of URLs can be found in the IOC section. We have also created a VT graph to highlight similar URLs and the](https://www.virustotal.com/graph/embed/g6ec980f3eff04923944fd33f42ecf83e4b9efe22a19744f4b3cc50dfaaabd543)\ncommunicating samples.\n\n_Fig.10 Download in sample a90d58052bcacd0194d1dfc0dd9d7929_\n\n\n-----\n\nThe downloaded content was in reverse order and thus, the bytes were reversed before execution (Fig.11).\n\n_Fig.11 Bytes reversed in a90d58052bcacd0194d1dfc0dd9d7929_\n\nThe full list of dropper URLs and the hashes of the reversed downloaded samples are listed in the IOC section.\nExecution of the next stage payload was achieved by loading the dropped dll and calling its method to pass\nexecution (Fig.12). This was functionally similar in all observed samples.\n\n_Fig.12 Execution of payload in a90d58052bcacd0194d1dfc0dd9d7929_\n\n\n-----\n\n#### PureCrypter Analysis\n\n**Sample MD5: 57bf626239b8db6e1434dbc8ee7cef86**\n\nWe are certain that the second stage payload was obfuscated PureCrypter instances. We were able to identify\ntwo samples that were packed with SmartAssembly and were able to unpack them (Fig.13).\n\n_Fig.13 de4dot obfuscator detection output_\n\nSmartAssembly encrypts strings that the sample used and thus we needed to decrypt them. The way SmartAssembly\ndoes this is by replacing the string with a call to a getString(int) function call that is delegated at runtime. This\nfunction xors the integer value with a key and subtracts the offset to retrieve the encoded string stored in a\nresource file. The strings are stored in the format LengthBase64EncodedString. The decoded strings for this sample can\nbe found in the Appendix. The decoding routine is heavily used at the start of the sample to import functions.\n\nOther variants have resource files with a {z} header followed by a switch that determines the kind of decryption or\ndecompression to be done. This ultimately results in strings stored in the same LengthBase64EncodedString format.\n\nThe sample started by extracting its settings from a hardcoded byte array that was reversed, decompressed,\nunserialized, and casted to a protobuf structure (Fig.14).\n\n_Fig.14 Settings extraction and mapping it to protobuf_\n\n\n-----\n\nThe settings schema is shown below. This sample is primarily used for injecting Redline. However, we redirected\nexecution to different Modules to fully explore PureCrypter’s capabilities by modifying these settings (Fig.15).\n\n_Fig. 15 Settings Proto Schema._\n\n\n-----\n\n###### Delay Module\n\nThe Delay module checked whether the setting IsDelay is enabled and goes into an infinite loop with periodic\nsleeps of 1000 milliseconds until the Delay variable is set to 0 (Fig.16). This module is probably used as a means\nof evading automated analysis by timing them out.\n\n_Fig. 16 Delay module_\n\n###### Exclusion Module\n\nThe Exclusion module is used to add an exclusion to defender for the root drive from which the process\nis executed.\n\nThe module initially checked whether StartupSettings is enabled. If it is, it verified that the current executing\nprocess’s ImagePath matches the file path as defined in its settings. The module exits if this check fails (Fig.17).\nThe Module skips this check if StartupSettings is disabled.\n\n\n-----\n\n_Fig.17 File full path check_\n\nThe module then performed a check for whether the current process has admin privileges and restarted itself if\nit didn’t:\n\n###### Cmd /k START “””” “”<FilePath>“” & EXIT\n\nThis command included the verb runas to execute with admin privileges (Fig.18). The user thinks he is installing\na cracked application and so the UAC prompt does not raise any suspicion.\n\n_Fig.18 Process restarted via cmd_\n\n\n-----\n\nThe sample then closed the Mutex (Hejrqayc) if it is created to avoid interference with the elevated process\nbefore killing itself (Fig.19).\n\n_Fig.19 Non elevated process exits_\n\nThe module then retrieved the drive name from the file path. It prepended the string Set-MpPreference\n_-ExclusionPath and Base64 encoded it. The module then started a new PowerShell process with the Base64_\nencoded command line and waited for it to exit (Fig.20).\n\n###### Powershell “-enc\n\n AHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgAC0ARQB4AGMAbAB1AHMAaQBvA\n\n G4AUABhAHQAaAAgACcAQwA6AFwAJwA=” UwBlAHQALQBNAHAAUAByAGUAZgBlAHIAZQBuAG\n\n MAZQAgAC0ARQB4AGMAbAB1AHMAaQBvAG4AUABhAHQAaAAgACcAQwA6AFwAJwA=”\n\n_Fig.20 Powershell adding defender exclusion_\n\n\n-----\n\n###### Fake Message Module\n\nThe Fake Message module displayed a message box, possibly to dissuade user suspicions.\n\nThis module started by performing the same StatupSettings check as the Exclusion module. The module also\nperformed an additional check to verify whether the sample started from one of the special folders. If any\ncheck failed, the module exits. The module then displayed a message box with the description and message\nbox type retrieved from its settings and, the title retrieved from the embedded resource (NULL, therefore the\ntitle is Error) (Fig.21).\n\n_Fig.21 Fake Message Module_\n\n###### Debugger/Sandbox Check Module\n\nThe Debugger/Sandbox module performed multiple checks to identify an analysis environment.\n\nThe first check is for the presence of a debugger by using CheckRemoteDebuggerPresent and by enumerating\nloaded modules to identify SbieDll.dll (Fig.22).\n\n_Fig.22 Debugger Check_\n\n\n-----\n\nThe module checked the output of WMI queries to identify a virtual or sandbox environment (Fig.23).\n\n###### Select * From Win32_BIOS; retrieve the version and SerialNumber. Concatenate and checked\n\n against VMWare|Virtual|A M I|Xen\n\n Select * from Win32_ComputerSystem; retrieve the manufacturer and model. Concatenate\n\n and checked against Microsoft|VMWare|Virtual\n\n_Fig.23 WQL check_\n\n\n-----\n\nThe module also checked monitor dimensions to identify a sandbox environment. Finally, it performed another\ncheck to see if the username of the current logged in user is not anna, john or xxxxxxxx. This is possibly to\nidentify some sandbox environments where they are the default users (Fig.24).\n\n_Fig.24 Sandbox checks_\n\nIf any of these failed, the sample started a clean-up operation by using PowerShell to delete itself from disk,\nclosing its mutex, and exiting (Fig.25).\n\n###### powershell Start-Sleep -s 10; Remove-Item -Path “ <PATH> “ -Force\n\n_Fig.25 Sample clean-up_\n\n\n-----\n\n###### Discord Module\n\nThe Discord module is used to collect information about the current system and upload it to a URL specified in\nsettings. The following details about the current environment are collected and sent via a POST request.\n\n**USERNAME** **PURECRYPTER**\n\ncontent :loudspeaker: *NEW EXECUTION*\n:one: **User** = <username>\n:two: **Date UTC** = <UTC Time>\n:three: **File** = <File Name>\n\nThis appears to be an initial call back to register the victim to a C2 server (Fig.26).\n\n_Fig.26 Data collection and redirected output to netcat_\n\n|USERNAME|PURECRYPTER|\n|---|---|\n|content|:loudspeaker: *NEW EXECUTION* :one: **User** = <username> :two: **Date UTC** = <UTC Time> :three: **File** = <File Name>|\n\n\n-----\n\n###### Binder Module\n\nThe Binder module decompressed the embedded byte array payload, wrote it to temp, and executed it via\nanother dropped vbs file with a randomly generated name based on a randomly picked file or directory (Fig.27).\nWe did not have the byte array payload to explore this further.\n\n###### CreateObject(“WScript.Shell”).Run “”” <File Name> “””, 1, False\n\n_Fig.27 Payload drop and execute_\n\n###### StartUp Module\n\nThe StartUp module is used to set up delayed execution of the PureCrypter payload based on a variety of\nregistry-related persistence techniques.\n\nThe module started by dropping PureCrypter in the same directory as the loader and then killing the running\nloader. The module then establishes persistence based on the value of EnumStartup (Fig.28). Therefore,\nPureCrypter can establish persistence via:\n\n9 Run keys\n\n9 Explorer User Shell Folder and Shell Folders\n\n9 Winlogon\n\n_Fig.28 StartUp Module_\n\n\n-----\n\n###### Injection Module\n\nThe final module – and the one for which our sample is configured – is the Injection module. This module\nessentially has three different techniques to decode an embedded resource payload (Nbehtoiv) and inject it into\na running process (Fig.29).\n\nThe first technique reversed the resource, Gunziped it, loaded it via Assembly.Load and invoked its entrypoint.\n\n_Fig.29 Assembly Load_\n\nThe second technique reversed the resource, Gunziped it, wrote it to the current processes memory, and then\npassed control over to it (Fig.30).\n\n_Fig.30 Memory injection_\n\nThe final method also reversed and Gunziped the embedded resource. It then checked the file to inject into by\nchecking the .NET runtime directory appended with the InjectionPath setting string (Fig.31). If that file did not\nexist, the module injected into a currently running process by enumerating all processes to find a target.\n\n_Fig.31 Injection target check_\n\nAfter identifying a likely injection target and acquiring a handle to it (Fig.32), the module enumerated its loaded\nmodules to check if they have sufficient size for the injection payload. This occurs till a target is found. The\nmodule then tried to write the injection payload into the process at the identified loaded module address and\npassed control over to it (Fig.33).\n\n\n-----\n\n_Fig.32 Identifying injection target_\n\n_Fig.33 Writing payload to target process_\n\nThe injected payload is Redline InfoStealer.\n\n\n-----\n\n#### Redline Stealer Analysis\n\n**Sample MD5: c827633ffacf2424112957e2ba523909**\n\nRedline started with the following hardcoded arguments.\n\n**NAME** **VALUE (DECODED)**\n\nIP 193.203.203.82:23108\n\nID B1\n\nMessage “”\n\nKey Oscular\n\nVersion 2\n\n193.203.203.82 is a known Command and Control (CnC) Panel that has been active since as far back as\n[September 2021. It has also been identified as part of other Redline attributed activity.](https://www.virustotal.com/graph/embed/ge532e31f3fb44dfdb9789d38e6867a0a659cadeb343545aba990a0d6d9d72a42)\n\n|NAME|VALUE (DECODED)|\n|---|---|\n|IP|193.203.203.82:23108|\n|ID|B1|\n|Message|“”|\n|Key|Oscular|\n|Version|2|\n\n\n-----\n\nRedline started by displaying an error message box with the contents of Message argument in a new thread.\nIt then attempted to connect to the CnC server over TCP every 5 seconds. Once the connection is established,\nRedline attempted to poll the server every second to retrieve its settings (Fig.34).\n\n_Fig.34 Redline polling server_\n\nIt then sent the ID and the version to the CnC server to register itself and retrieved its tasks. These define which\nmodule is to be executed (Fig.35).\n\n_Fig.35 Registering client and polling tasking_\n\n\n-----\n\nRedline also had an update method to update command lines, tasks and download and execute a patch (Fig.36).\n\n_Fig.36 Redline update routine_\n\nWe will briefly go over some of the more interesting Redline modules which highlight its capabilities.\n\n**MODULE NAME** **DESCRIPTION**\n\nCryptoHelper Routines for Aes, hashing and other cryptographic methods\n\nAllWallets Collects crypto wallets by scanning directories with keywords related to wallets\n\nBrEx Collects login data, cookies, form data, extension details from browser paths\n\nConfigReader Collects directory structure of a given directory or drive\n\nDataBaseConnectionHandler Collects data from identified SQL databases\n\nDesktopMessanger Collects data from Telegram desktop\n\nDiscord Collects logs, tokens etc. from Discord desktop\n\nFileExt Reads specified file\n\nFileSearcher Performs searches to find files\n\nFileScanning Performs searches to find directories\n\nFileZilla Collects Filezilla related data such as credentials, recent files etc.\n\nFullInfoSender Collects processor details, graphic card details, RAM details, browser details,\ninstalled programs, antivirus details, running processes, installed languages,\noutput from all modules, username, Windows version, current language,\nexecution location, serial number and current time zone\n\nGameLauncher Collects data from Steam launcher\n\ng_E_c_k_0 Collects data from browsers using Gecko engine\n\nNordApp Collects Nord VPN related data.\n\nOpenVPN Collects Open VPN related data.\n\nРrоtoнVРN Collects Proton VPN related data.\n\nMost of the data collection modules are functionally similar with arguments to a file scanner interface that\ndefines the location and the data that should be stolen (Fig.37). Modules also implement targeted applicationspecific functions to extract interesting data such as credentials, form fields, VPN configs, and more.\n\n|MODULE NAME|DESCRIPTION|\n|---|---|\n|CryptoHelper|Routines for Aes, hashing and other cryptographic methods|\n|AllWallets|Collects crypto wallets by scanning directories with keywords related to wallets|\n|BrEx|Collects login data, cookies, form data, extension details from browser paths|\n|Confgi Reader|Collects directory structure of a given directory or drive|\n|DataBaseConnectionHandler|Collects data from identifei d SQL databases|\n|DesktopMessanger|Collects data from Telegram desktop|\n|Discord|Collects logs, tokens etc. from Discord desktop|\n|FileExt|Reads specifei d flie|\n|FileSearcher|Performs searches to fni d flies|\n|FileScanning|Performs searches to fni d directories|\n|FileZilla|Collects Filezilla related data such as credentials, recent flies etc.|\n|FullInfoSender|Collects processor details, graphic card details, RAM details, browser details, installed programs, antivirus details, running processes, installed languages, output from all modules, username, Windows version, current language, execution location, serial number and current time zone|\n|GameLauncher|Collects data from Steam launcher|\n|g_E_c_k_0|Collects data from browsers using Gecko engine|\n|NordApp|Collects Nord VPN related data.|\n|OpenVPN|Collects Open VPN related data.|\n|РrоtoнVРN|Collects Proton VPN related data.|\n\n\n-----\n\n_Fig. 37 Scanning arguments for BrEx_\n\n## Conclusion\n\nRedline has become one of the most widely used infostealers due to its wide range of capabilities and a thriving\nstructured underground MaaS market.\n\nIt was fascinating to observe the flow of an entire campaign from obfuscated loaders loading SmartAssembly\nand PureCrypter injectors that in the end injected Redline to steal data from infected machines.\n\nAdversaries have continued their usage of legitimate services to host their payloads and defenders need to\naccount for it. Existing security detections that identify data collection will trigger due to Redline activity.\n\n\n-----\n\n## ATT&CK Mapping\n\n[Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder T1547.001](https://attack.mitre.org/techniques/T1547/001/)\n\n[Non-Application Layer Protocol T1095](https://attack.mitre.org/techniques/T1095/)\n\n[Non-Standard Port T1571](https://attack.mitre.org/techniques/T1571/)\n\n[Credentials from Password Stores T1555](https://attack.mitre.org/techniques/T1555/)\n\n[Automated Collection T1119](https://attack.mitre.org/techniques/T1119/)\n\n[Data from Local System T1005](https://attack.mitre.org/techniques/T1005/)\n\n[Process Injection T1055](https://attack.mitre.org/techniques/T1055/)\n\n[Command and Scripting Interpreter: Visual Basic T1059.005](https://attack.mitre.org/techniques/T1059/005/)\n\n[Indicator Removal on Host: File Deletion T1070.004](https://attack.mitre.org/techniques/T1070/004/)\n\n[Virtualization/Sandbox Evasion T1497](https://attack.mitre.org/techniques/T1497/)\n\n[Impair Defenses: Disable or Modify Tools T1562.001](https://attack.mitre.org/techniques/T1562/001/)\n\n[Windows Management Instrumentation T1047](https://attack.mitre.org/techniques/T1047/)\n\n\n-----\n\n## Appendix\n\n|LEN (DEC)|DECODED STRING|\n|---|---|\n|4|'|\n|4|,'|\n|44|Set-MpPreference -ExclusionPath|\n|12|kernel32|\n|24|UmV@zdW1l@VGhyZWFk -> ResumeThread|\n|40|V293NjRT@ZXRUaHJlYWRDb250ZXh0 -> Wow64SetThreadContex|\n|36|U2V0@VGhyZ@WFkQ29udGV4dA== -> SetThreadContext|\n|36|R2@V0VGhyZWFkQ@29udGV4dA== -> GetThreadContext|\n|32|VmlydHVh@bEFsbG9@jRXg= -> VirtualAllocEx|\n|36|V3JpdGVQcm9j@ZXNzT@WVtb3J5 -> WriteProcessMemory|\n|08|ntdll|\n|40|WndVbm1h@cFZpZXd@PZlNlY3Rpb24= -> ZwUnmapViewOfSection|\n|40|Q3JlY@XRlU@HJvY2Vzc0E= -> CreateProcessA|\n|24|Q2xv@c2VI@YW5kbGU= -> CloseHandle|\n|36|Um@VhZFByb2N@lc3NNZW1vcnk= -> ReadProcessMemory|\n|04|@|\n|04|032E02 (hex representation) / NULL|\n|12|Nbehtoiv|\n|16|Powershell|\n|8|-enc|\n|8|.vbs|\n|52|CreateObject(\"WScript.Shell\").Run \"\"\"|\n|20|\"\"\", 1, False|\n|88|Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders|\n|12|Startup|\n|92|Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders|\n|92|%USERPROFILE%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\|\n|72|Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon|\n|08|Shell|\n|20|explorer.exe,\"|\n|4|“,|\n|64|Software\\Microsoft\\Windows\\CurrentVersion\\Run\\|\n|04|\"|\n|08|.exe|\n|04|20 (hex)|\n|12|ToInt32|\n|52|- (Windows|Microsoft) Internet Explorer|\n|12|iexplore|\n|52|Start-Sleep -s 10; Remove-Item -Path \"|\n|12|\" -Force|\n|16|powershell|\n|04|cmd|\n|20|/k START \"\" \"|\n|12|\" & EXIT|\n|08|runas|\n\n\n-----\n\n|LEN (DEC)|DECODED STRING|\n|---|---|\n|04|.|\n|16|SbieDll.dll|\n|08|john|\n|08|anna|\n|12|xxxxxxxx|\n|32|select * from Win32_BIOS|\n|40|Unexpected WMI query failure|\n|12|version|\n|16|SerialNumber|\n|32|VMware|VIRTUAL|A M I|Xen|\n|48|select * from Win32_ComputerSystem|\n|16|manufacturer|\n|08|model|\n|32|Microsoft|VMWare|Virtual|\n|12|username|\n|16|PureCrypter|\n|12|content|\n|68|:loudspeaker: *NEW EXECUTION* :one: **User** =|\n|32|:two: **Date UTC** =|\n|28|:three: **File** =|\n|04|20 0D 0A (hex) | \\r\\n|\n|04|x2|\n|16|.compressed|\n|12|costura|\n|40|costura.costura.dll.compressed|\n|16|protobuf-net|\n|48|costura.protobuf-net.dll.compressed|\n\n\n-----\n\n## IOCs\n\n##### Discord Attachment URLs\n\nhttps://cdn[.]discordapp[.]com/attachments/928009932928856097/936319550855716884/Windows11InstallationAssistant.zip\n\nhttp://cdn[.]discordapp[.]com/attachments/928009932928856097/936319550855716884/Windows11InstallationAssistant.zip\n\nhttps://cdn[.]discordapp[.]com/attachments/934931217160212483/936418434353352734/Adobe_Premiere_Pro_2022.zip\n\nhttps://cutt[.]ly/JOutnwm ->\nhttps://cdn[.]discordapp[.]com/attachments/934931217160212483/936418434353352734/Adobe_Premiere_Pro_2022.zip\n\nhttps://adobepremierpro[.]tiny[.]us/download ->\nhttps://cdn[.]discordapp[.]com/attachments/630849870097416212/937402126634717214/Premier_Pro_Crack_Installer_\nv22.1.1.zip\n\nhttps://cdn[.]discordapp[.]com/attachments/630849870097416212/937402126634717214/Premier_Pro_Crack_Installer_\nv22.1.1.zip\n\nhttps://cdn[.]discordapp[.]com/attachments/630857695402131498/939484341749309560/Premiere_Pro_Crack_Installer_\nv22.1.1.zip\n\nhttps://adobepremierepro[.]tiny[.]us/download -> https://cdn[.]discordapp[.]com/\nattachments/630857695402131498/939484341749309560/Premiere_Pro_Crack_Installer_v22.1.1.zip\n\nhttp://gg[.]gg/xqbt3 -> https://cdn[.]discordapp[.]com/attachments/904314549568675903/936336280999051315/Installer.zip\n\nhttps://cdn[.]discordapp[.]com/attachments/904314549568675903/936336280999051315/Installer.zip\n\nhttps://best-plugins[.]tiny[.]us/autotunepro ->\nhttps://cdn[.]discordapp[.]com/attachments/630849870097416212/936622136003538984/Setup_Auto-Tune_Pro_v9.1.0.zip\n\nhttps://sonyvegaspro[.]tiny[.]us/download ->\nhttps://cdn[.]discordapp[.]com/attachments/630857695402131498/940285843447353374/MAGIX.Vegas.Pro.v19.0.458.zip\n\nhttps://expres-v[.]com/download/Installer.zip\n\n|Dropper URLs|Col2|Col3|\n|---|---|---|\n|DROPPER|URL|DROPPED SAMPLE|\n|06f65e5d32f58944fe0a50f12d8eb5c4|http://81[.]4[.]105[.]174/Epujhn[.]jpg|d3ca123f9e81ad8f8e8ae4cc3803f590|\n|1c8112b8e1f13ca4129cae22f3387d47|http://81[.]4[.]105[.]174/Bkcmvj[.]jpg|7aeac72fd0ef3b77e8c6bf0212bc99dd|\n|154bda18ddf65e3d79caa9abeb7c4468|http://81[.]4[.]105[.]174/Mujov[.]log|bd0592b2c25c38a7cf353095cc97bdc8|\n|a90d58052bcacd0194d1dfc0dd9d7929|http://81[.]4[.]105[.]174/AdobeFile[.]log|701f36ba3ecdc890710413ed7a26861d|\n|7f6de92ece5a366cc15af5574701fe98|http://81[.]4[.]105[.]174/Ipqtn[.]jpg|dc815147f7fe11d08d7d64213f9032e7|\n|5acd1037872f39b9034707ae3618f3a3|http://81[.]4[.]105[.]174/Jiupcw[.]png|bf285233dc836f62bc82a209c5dab48b|\n|771a4fea6f33eac0771b108e8933703a|http://81[.]4[.]105[.]174//win11[.]jpg|6dfa84ac778aa418adcb649651d17ccd|\n\n|URL|DROPPED SAMPLE (REVERSED)|\n|---|---|\n|http://81[.]4[.]105[.]174/Nyszfp[.]png|57bf626239b8db6e1434dbc8ee7cef86|\n|http://81[.]4[.]105[.]174/Ezzivoo[.]png|9b85cd189f7b8f6ba4213470523a0f59|\n|http://81[.]4[.]105[.]174/Rdxgbxvf[.]jpg|c79bb6ecc930cb9a6aba43de47e02013|\n|http://81[.]4[.]105[.]174/Cqstk[.]png|5545a2f4f 2f03e95661aba7eb080ce17|\n|http://81[.]4[.]105[.]174/Obqjyz[.]log|7e16c22ecc22113854b247f5886c98f5|\n|http://81[.]4[.]105[.]174/PythonFile[.]jpg|45cf0a81dc1a3b75b0f3cf598566d315|\n|http://81[.]4[.]105[.]174/CcleanerInstaller[.]jpg|8a6ce4ad539d027b4cbbdd147158af4d|\n|http://81[.]4[.]105[.]174/Ikgvjkeu[.]jpg|cd39fa7364d13fe521aad91b8e99760f|\n|http://81[.]4[.]105[.]174/Jfuygzod[.]png|0d9ac7274be792796eeebed217cc6e58|\n|http://81[.]4[.]105[.]174/Win11ClubHelloAgain[.]jpg|b8312c8e83bab1f003d03eacc10c8054|\n|http://81[.]4[.]105[.]174/Liafandgotica[.]png|3f6ec963e276603ece3af20d5a3075cc|\n|http://81[.]4[.]105[.]174/lavgimu[.]jpg|92d939fabae206a9e5df8ba2e8a10877|\n|http://81[.]4[.]105[.]174/VideoPublicAllocation[.]log|63fdd2a00dc456a3189a2c4fd3d499d1|\n\n\n-----\n\n|Dropper Samples|Col2|\n|---|---|\n|NAME|HASH|\n|Windows11InstallationAssistant.exe|771a4fea6f33eac0771b108e8933703a|\n|Setup Auto-Tune Pro v9.1.0.exe, Premier Pro Crack Installer v22.1.1.exe, Premiere Pro Crack Installer v22.1.1.exe, NEXUS INSTALLER.exe, MAGIX.Vegas.Pro.v19.0.458.exe, FAB_FILTER_ INSTALLER.exe, COD MERCY v1.7.exe, Sapphire Installer.exe|7f6de92ece5a366cc15af5574701fe98|\n|Set-Up.exe|a90d58052bcacd0194d1dfc0dd9d7929|\n|Installer.exe|06f65e5d32f58944fe0a50f12d8eb5c4|\n|InstallerZnanoz.exe|5acd1037872f39b9034707ae3618f3a3|\n|Eye-Saver-Setup.exe|154bda18ddf65e3d79caa9abeb7c4468|\n|Dinox_installer.exe|1c8112b8e1f13ca4129cae22f3387d47|\n\n\n#### Redline CnC IP\n\n193.203.203.82:23108\n\n#### Redline InfoStealer\n\nc827633ffacf2424112957e2ba523909\n\n**About Qualys**\n\nQualys, Inc. (NASDAQ: QLYS) is a pioneer and leading provider of disruptive cloud-based Security, Compliance and IT solutions with more than 10,000 subscription\ncustomers worldwide, including a majority of the Forbes Global 100 and Fortune 100. Qualys helps organizations streamline and automate their security and\ncompliance solutions onto a single platform for greater agility, better business outcomes, and substantial cost savings. Qualys, Qualys VMDR® and the Qualys logo\nare proprietary trademarks of Qualys, Inc. All other products or names may be trademarks of their respective companies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.qualys.com/docs/whitepapers/qualys-wp-fake-cracked-software-caught-peddling-redline-stealers-v220606.pdf"
    ],
    "report_names": [
        "qualys-wp-fake-cracked-software-caught-peddling-redline-stealers-v220606.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666859763,
    "ts_updated_at": 1743041128,
    "ts_creation_date": 1654534423,
    "ts_modification_date": 1654534463,
    "files": {
        "pdf": "https://archive.orkl.eu/d77f937b2a9dedc913d0018ee73afb5de439d294.pdf",
        "text": "https://archive.orkl.eu/d77f937b2a9dedc913d0018ee73afb5de439d294.txt",
        "img": "https://archive.orkl.eu/d77f937b2a9dedc913d0018ee73afb5de439d294.jpg"
    }
}