{
    "id": "1a4bff46-a580-4020-9d71-9148bfd2e176",
    "created_at": "2022-10-25T16:48:24.745602Z",
    "updated_at": "2025-03-27T02:05:47.676597Z",
    "deleted_at": null,
    "sha1_hash": "2f1d3e32c9da31ff908cec146868133a2133e16c",
    "title": "Microsoft Word - Cuba Ransomware FLASH NOV11292021(1)",
    "authors": "",
    "file_creation_date": "2021-12-02T17:25:24Z",
    "file_modification_date": "2021-12-02T17:25:24Z",
    "file_size": 1461378,
    "plain_text": "## 02 Dec 2021 The following information is being provided by the FBI, with no guarantees or warranties, for potential\n\n_use at the sole discretion of recipients to protect against cyber threats. This data is provided in order_\n_to help cyber security professionals and system administrators to guard against the persistent malicious_\n\nFLASH Number\n\n_actions of cyber actors. This FLASH was coordinated with DHS/CISA._\n\n#### CU-000156-MW This FLASH has been released TLP:WHITE\n\n\n**WE NEED YOUR HELP!** If you identify any suspicious activity within your enterprise or have related information,\n\nplease contact your local FBI Cyber Squad immediately with respect to the procedures outlined in the\n\nReporting Notice section of this message.\n\n*Note: By reporting any related information to FBI Cyber Squads, you are assisting in sharing information that allows the FBI to track\n\n_malicious actors and coordinate with private industry and the United States Government to prevent future intrusions and attacks._\n\n# Indicators of Compromise Associated with Cuba\n\n Ransomware\n\n## Summary\n\nThe FBI has identified, as of early November 2021 that Cuba ransomware actors have\ncompromised at least 49 entities in five critical infrastructure sectors, including but not limited\nto the financial, government, healthcare, manufacturing, and information technology sectors.\nCuba ransomware is distributed through Hancitor malware, a loader known for dropping or\nexecuting stealers, such as Remote Access Trojans (RATs) and other types of ransomware, onto\nvictims’ networks. Hancitor malware actors use phishing emails, Microsoft Exchange\nvulnerabilities, compromised credentials, or legitimate Remote Desktop Protocol (RDP) tools to\ngain initial access to a victim’s network. Subsequently, Cuba ransomware actors use legitimate\nWindows services—such as PowerShell, PsExec, and other unspecified services—and then\nleverage Windows Admin privileges to execute their ransomware and other processes\nremotely. Cuba ransomware actors compromise a victim network through the encryption of\ntarget files with the “.cuba” extension. Cuba ransomware actors have demanded at least US\n$74 million and received at least US $43.9 million in ransom payments.\n\n\n-----\n\n## Technical Details\n\nCuba ransomware, upon compromise, installs and executes a CobaltStrike beacon as a service\non the victim’s network via PowerShell. Once installed, the ransomware downloads two\nexecutable files, which include “pones.exe” for password acquisition and “krots.exe,” also\nknown as KPOT, enabling the Cuba ransomware actors to write to the compromised system’s\ntemporary (TMP) file. Once the TMP file is uploaded, the “krots.exe” file is deleted and the TMP\nfile is executed in the compromised network. The TMP file includes Application Programming\nInterface (API) calls related to memory injection that, once executed, deletes itself from the\nsystem. Upon deletion of the TMP file, the compromised network begins communicating with a\nreported malware repository located at Montenegro-based Uniform Resource Locator (URL)\nteoresp.com.\n\nFurther, Cuba ransomware actors use MimiKatz malware to steal credentials, and then use RDP\nto log into the compromised network host with a specific user account. Once an RDP\nconnection is complete, the Cuba ransomware actors use the CobaltStrike server to\ncommunicate with the compromised user account. One of the initial PowerShell script\nfunctions allocates memory space to run a base64-encoded payload. Once this payload is\nloaded into memory, it can be used to reach the remote command-and-control (C2) server and\nthen deploy the next stage of files for the ransomware. The remote C2 server is located at the\nmalicious URL kurvalarva.com\n\n## Indicators\n\nThe following are characteristics of a Cuba ransomware compromise, as of mid-October 2021:\n\n|Cuba Ransomware Associated Files and Hashes, as of Mid-October 2021|Col2|Col3|\n|---|---|---|\n|File Name File Path File Hash|||\n|MD5: 7b6f996cc1ad4b5e131e7bf9b1c33253 SHA-1: 2841848ef59dfe7137e15119e4c9ce5e873e3607 SHA-256: c:\\inetput\\wwwro b14341b1ffe9e2730394b9066c6829b4e2f59a4234765ae2e qcklo.aspx ot\\aspnet_client 97cfc6d4593730a|||\n|MD5: 7b6f996cc1ad4b5e131e7bf9b1c33253 SHA-1: 2841848ef59dfe7137e15119e4c9ce5e873e3607 SHA-256: c:\\inetput\\wwwro b14341b1ffe9e2730394b9066c6829b4e2f59a4234765ae2e haqdu.aspx ot\\aspnet_client 97cfc6d4593730a|||\n|komar.ps1|c:\\windows\\temp|MD5: ba83831700a73661f99d38d7505b5646 SHA-1: 209ffbc8ba1e93167bca9b67e0ad3561c065595d SHA-256:|\n\n\n-----\n\n|79d6b1b6b1ecb446b0f49772bf4da63fcec6f6bfc7c2e1f4924 cb7acbb3b4f53|Col2|Col3|\n|---|---|---|\n|MD5: 3fe1a3aaca999a5db936843c9bdfea14 SHA-1: 25ebe54beb3c422ccd2d90aa8ae89087f71b0bed SHA-256: e82cc49c03320a0fb6ec3512c0ca3332eb1b40070cc53a78bc aa.bat c:\\windows\\temp 80b77b4aba975c|||\n|MD5: d907be57b5ef2af8a8b45d5f87aa4773 SHA-1: 867d41458d94e985f6b3e2bae1dfb75e14cbc57f SHA-256: 4b5eefa1727b97b6f773be3937a8cc390f0434ddc2f01dc24b aa.dll c:\\windows\\temp 68b690fafbcc93|||\n|netping.dll c:\\windows\\temp|||\n|check.txt c:\\windows\\temp|||\n|result.txt c:\\windows\\temp|||\n|protoping.exe c:\\windows\\temp|||\n|MD5: ba83831700a73661f99d38d7505b5646 SHA-1: 209ffbc8ba1e93167bca9b67e0ad3561c065595d SHA-256: 79d6b1b6b1ecb446b0f49772bf4da63fcec6f6bfc7c2e1f4924 agent32.ps1 c:\\windows\\temp cb7acbb3b4f53|||\n|MD5: ee2f71faced3f5b5b202c7576f0f52b9 SHA-1: d1ff26ea3d2d2ced4b7e76d971a60533817048d7 SHA-256: 5cd95b34782ca5acf8a34d9dc184cb880a19b6edcaf4a4553f new.dll c:\\programdata a0619b597c2f50|||\n|MD5: 99c7cad7032ec5add3a21582a64bb149 SHA-1: 4de5d433af5701462517719ce097bb4c0e5676c9 SHA-256: 7f4bdf94a0e0457f41bdd1a8d8d9fc39fc383d3d0a33104882 run.txt c:\\windows\\temp 8d391bbf727a1e|||\n|MD5: 72a60d799ae9e4f0a3443a2f96fb4896 SHA-1: a304497ff076348e098310f530779002a326c264 SHA-256: 6d5ca42906c60caa7d3e0564b011d20b87b175cbd9d44a96 agent32.bin c:\\windows\\temp 673b46a82b07df68|||\n|dc.exe|||\n|iv.exe|||\n|ivnet.exe|||\n|shar.bat|||\n|psexesrv.exe|||\n|82.ps1|||\n|process 66-87.dll;|||\n|install.cmd|||\n|||ce3a6224dae98fdaa712cfa6495cb72349f333133dbfb339c9 e90699cbe4e8e|\n\n\n-----\n\n188E66158E0F96AD1FFD3F090E2570B8644CD80733C7AAF\nB931E893A4F280165\n\n|141b2190f51397dbd0dfde0e3904b264c91b6f81febc823ff0 c33da980b69944|Col2|Col3|\n|---|---|---|\n|1d142c36c6cdd393fe543a6b7782f25a9cbafca17a1cfa0f3fc 0f5a9431dbf3f|||\n|81bdd622f0cb9d7e2ac5325a74606fa7818bd4205f37184eb a68cdcbe96942f6|||\n|d010fbb1afeb610338c49ae2425b6b7c4a9f4c469aedd096a 15b32527565d7db|||\n|7e765942d89cd3bfaca41034cd959b8d741085bd8bcedbb7 41e15ed685227a5e|||\n|05f90cad3627f5253e1a03156793bc6cada7f4ce0d510f5513 9f0285fcff589d|||\n|EEDC68C92C50BE88C5935651D6B772D4728C3566581BE1F 24D4CE7EF63A76D2E|||\n|3468C6DEB3827F5C161A8622E7D794444C7B38225F6F150 02193D2572A4D132E|||\n|02B17677BEC8A4FBB77FDDB347BFDCC651FF2B25187131C CE45C326E3CF42FE5|||\n|||188E66158E0F96AD1FFD3F090E2570B8644CD80733C7AAF B931E893A4F280165|\n\n|Cuba Ransomware Associated Email Addresses, as of Mid-October 2021|Col2|\n|---|---|\n|Email Provider Email Addresses||\n|Protonmail ad_default@protonmail.com||\n|admansmit001@protonmail.com||\n|afts_agent@protonmail.com||\n|helpadmin1@protonmail.com||\n|helpallen@protonmail.com||\n|helpallen@protonmail.com||\n|mail_supportRG@protonmail.com||\n|roselondon@protonmail.com||\n|system_admC@protonmail.com||\n|Protonmail.ch dark_sysadmin@protonmail.ch||\n|iracomp1@protonmail.ch||\n|iracomp3@protonmail.ch||\n|LR_FWS_H2M_ET@protonmail.ch||\n|under_amur@protonmail.ch||\n|Cock.li cloudkey@cock.li||\n|fiaadministrator@cock.li||\n|frankstore@cock.li||\n|helpallen@cock.li||\n|iracomp@cock.li||\n||ivantisupport@cock.li|\n\n\n-----\n\nlogme@cock.li\nmfra@cock.li\nmorebeerplease@cock.li\nroselondon@cock.li\n**Cuba-supp.com** admin@cuba-supp.com\n\n\n**Cuba Ransomware Associated Jabber Address, as of Mid-October 2021**\n\n\ncuba_support@exploit.im\n\n\n**IP Addresses Associated with Cuba Ransomware, as of Mid-October 2021**\n\n\n37.120.193.123\n\n\n40.115.162.72\n\n\n157.245.70.127\n\n\n31.44.184.82\n\n\n185.153.199.176\n\n**Bitcoin Wallet Receiving Ransom Payments, as of Mid-October 2021**\nbc1qvpk8ksl3my6kjezjss9p28cqj4dmpmmjx5yl3y\nbc1qhtwfcysclc7pck2y3vmjtpzkaezhcm6perc99x\nbc1qft3s53ur5uq5ru6sl3zyr247dpr55mnggwucd3\nbc1qp7h9fszlqxjwyfhv0upparnsgx56x7v7wfx4x7\n\n\n**Sample Cuba Ransom Note, as of Mid-October 2021**\n\n\nGood day. All your files are encrypted. For decryption contact us.\nWrite here iracomp3@protonmail.com\nWe also inform that your databases, ftp server and file server were downloaded by us to our servers.\n\n - Do not rename encrypted files\n\n - Do not try to decrypto your data using third party software,\nit may cause permanent data loss.\n\n## Information Requested:\n\nThe FBI is seeking any information that can be shared, to include boundary logs showing\ncommunication to and from foreign IP addresses, Bitcoin wallet information, the decryptor file,\nand/or a benign sample of an encrypted file. The FBI does not encourage paying ransoms.\nPayment does not guarantee files will be recovered. It may also embolden adversaries to target\n\n\n-----\n\nadditional organizations, encourage other criminal actors to engage in the distribution of\nransomware, and/or fund illicit activities. However, the FBI understands that when victims are\nfaced with an inability to function, all options are evaluated to protect shareholders, employees\nand customers. Regardless of whether you or your organization have decided to pay the\nransom, the FBI urges you to promptly report ransomware incidents to your local field office.\nDoing so provides the FBI with critical information needed to prevent future attacks by\nidentifying and tracking ransomware attackers and holding them accountable under US law.\n\n## Recommended Mitigations:\n\nFBI recommends network defenders to apply the following mitigations to reduce the risk of\ncompromise by Cuba ransomware:\n\n  - **Require all accounts with password logins (e.g., service account, admin accounts, and**\n\n**domain admin accounts) to have strong, unique passwords. Passwords should not be**\nreused across multiple accounts or stored on the system where an adversary may have\naccess. Note: Devices with local administrative accounts should implement a password\npolicy that requires strong, unique passwords for each individual administrative\naccount.\n\n  - **Require multi-factor authentication for all services to the extent possible, particularly**\n\nfor webmail, virtual private networks, and accounts that access critical systems.\n\n  - **Keep all operating systems and software up to date. Timely patching is one of the most**\n\nefficient and cost-effective steps an organization can take to minimize its exposure to\ncybersecurity threats.\n\n  - **Remove unnecessary access to administrative shares, especially ADMIN$ and C$. If**\n\nADMIN$ and C$ are deemed operationally necessary, restrict privileges to only the\nnecessary service or user accounts and perform continuous monitoring for anomalous\nactivity.\n\n  - **Use a host-based firewall to only allow** connections to administrative shares via server\n\nmessage block (SMB) from a limited set of administrator machines.\n\nAdversaries use system and network discovery techniques for network and system visibility and\nmapping. To limit an adversary from learning the organization’s enterprise environment, limit\ncommon system and network discovery techniques by taking the following actions:\n\n  - **Segment networks to prevent the spread of ransomware. Network segmentation can**\n\nhelp prevent the spread of ransomware by controlling traffic flows between—and\naccess to—various subnetworks and by restricting adversary lateral movement.\n\n  - **Identify, detect, and investigate abnormal activity and potential traversal of the**\n\n**indicated ransomware with a networking monitoring tool. To aid in detecting the**\nransomware, implement a tool that logs and reports all network traffic, including lateral\n\n\n-----\n\nmovement activity on a network. Endpoint detection and response (EDR) tools are\nparticularly useful for detecting lateral connections as they have insight into common\nand uncommon network connections for each host.\n\n  - **Implement time-based access for accounts set at the admin level and higher. For**\n\nexample, the Just-in-Time (JIT) access method provisions privileged access when needed\nand can support enforcement of the principle of least privilege (as well as the Zero Trust\nmodel). This is a process where a network-wide policy is set in place to automatically\ndisable admin accounts at the AD level when the account is not in direct need. When\nthe account is needed, individual users submit their requests through an automated\nprocess that enables access to a system, but only for a set timeframe to support task\ncompletion.\n\n  - **Disable command-line and scripting activities and permissions. Privilege escalation and**\n\nlateral movement often depend on software utilities that run from the command line. If\nthreat actors are not able to run these tools, they will have difficulty escalating\nprivileges and/or moving laterally.\n\n  - **Maintain offline backups of data, and regularly maintain backup and restoration. This**\n\npractice will ensure the organization will not be severely interrupted, have irretrievable\ndata.\n\n  - **Ensure all backup data is encrypted, immutable (i.e., cannot be altered or deleted), and**\n\ncovers the entire organization’s data infrastructure.\n\n## Additional Resources\n\nFor additional resources related to the prevention and mitigation of ransomware, go to\nhttps://www.stopransomware.gov as well as the CISA-Multi-State Information Sharing and\nAnalysis Center (MS-ISAC) Joint Ransomware Guide. Stopransomware.gov is the Government’s\nnew, official one-stop location for resources to tackle ransomware more effectively.\n\n\n-----\n\n## Reporting Notice\n\nThe FBI encourages recipients of this document to report information concerning suspicious or\ncriminal activity to their local FBI field office. With regards to specific information that appears\nin this communication; the context, individual indicators, particularly those of a nondeterministic or ephemeral nature (such as filenames or IP addresses), may not be indicative of\na compromise. Indicators should always be evaluated in light of your complete information\nsecurity situation.\n\nField office contacts can be identified at www.fbi.gov/contact-us/field-offices. When available,\neach report submitted should include the date, time, location, type of activity, number of\npeople, and type of equipment used for the activity, the name of the submitting company or\norganization, and a designated point of contact.\n\n## Administrative Note\n\nThis product is marked TLP:WHITE. Subject to standard copyright rules, the information in this product\nmay be shared without restriction.\n\n\n### Your Feedback Regarding this Product is Critical\n\n#### Was this product of value to your organization? Was the content clear and concise?  Your comments are very important to us and can be submitted anonymously. Please take a moment to complete the survey at the link below. Feedback should be specific to your experience with our written products to enable the FBI to make quick and continuous improvements to such products. Feedback may be submitted online here:\n\n## https://www.ic3.gov/PIFSurvey\n\n#### Please note that this survey is for feedback on content and value only. Reporting of technical information regarding FLASH reports must be submitted through your local FBI office.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/Media/News/2021/211203-2.pdf"
    ],
    "report_names": [
        "211203-2.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1638465924,
    "ts_modification_date": 1638465924,
    "files": {
        "pdf": "https://archive.orkl.eu/2f1d3e32c9da31ff908cec146868133a2133e16c.pdf",
        "text": "https://archive.orkl.eu/2f1d3e32c9da31ff908cec146868133a2133e16c.txt",
        "img": "https://archive.orkl.eu/2f1d3e32c9da31ff908cec146868133a2133e16c.jpg"
    }
}