{
    "id": "1a501e14-84fa-4b77-900d-8ff10d993e25",
    "created_at": "2022-10-25T16:48:23.075021Z",
    "updated_at": "2025-03-27T02:16:26.328548Z",
    "deleted_at": null,
    "sha1_hash": "71914dfcb0481a35c66ab32001cd00e49c098fa2",
    "title": "Banking Web Injects Are Top Cyber Threat For Financial Sector",
    "authors": "",
    "file_creation_date": "2020-10-15T15:31:02Z",
    "file_modification_date": "2020-10-15T15:32:24Z",
    "file_size": 1472995,
    "plain_text": "## CYBER THREAT ANALYSIS By Insikt Group®\n\n##### CTA-2020-1016\n\n# BANKING WEB INJECTS  ARE TOP CYBER THREAT \n\n\n-----\n\n_Recorded Future analyzed current data from the Recorded Future® Platform,_\n_dark web sources, and open-source intelligence (OSINT) to identify banking web_\n_injects and the most referenced developers of the banking injects that target multiple_\n_financial organizations worldwide. This report expands upon findings addressed in_\n_[the report “Automation and Commoditization in the Underground Economy,” following](https://www.recordedfuture.com/underground-economy-automation/)_\n_[reports on database breaches, checkers and brute forcers, loaders and crypters, and](https://www.recordedfuture.com/database-breaches-analysis/)_\n_[credit card sniffers. This report will be of most interest to network defenders, security](https://www.recordedfuture.com/credit-card-sniffers/)_\n_researchers, and executives charged with security risk management and mitigation._\n\n#### Executive Summary\n\nBanks and financial organizations are the primary targets for\n\ncybercriminals attempting to steal personally identifiable information\n\n(PII), money, and financial data. Banking web injects are one of the\n\nmost effective methods of acquiring that data. Web injects leverage the\n\nman-in-the-browser (MitB) attack vector, usually in combination with\n\nbanking trojans, to modify the content of a legitimate bank web page\n\nin real time by performing API hooking. Web injects are widely available\n\non underground forums. In this report, Recorded Future profiles five\n\nof the primary developers and sellers of different banking web inject\n\nvariants on the dark web, provides an example of how one banking\n\ninject works, and offers some strategies for reducing the risk of these\n\nkinds of attacks.\n\n#### Key Judgments\n\n  - Banking web injects are powerful malicious tools integrated with\n\nmultiple banking trojans that permit a threat actor to bypass\n\ntwo-factor authentication (2FA) and compromise a user’s bank\n\naccount.\n\n  - The primary methods used by threat actors to distribute banking\n\nweb injects are phishing and exploit kits.\n\n  - The most notorious developers and sellers of banking web\n\ninjects on the dark web are “yummba”, “Validolik”, “Kaktys1010”,\n\n“Pw0ned”, and ANDROID-Cerberus.\n\n  - Banking web injects are highly customized to particular websites;\n\nas a result, clients can monitor their web inject developers and\n\npotential attacks on their infrastructure.\n\n  - Recorded Future assesses that the recent release of the source\n\ncode of Cerberus Android bot will allow cybercriminals to\n\ndevelop new injects based on the source code to target banks\n\nand financial organizations worldwide.\n\n\n#### Background\n\nBanking injects are popular and powerful tools for performing\n\nfraud. They are usually used with banking trojans to inject malicious\n\nHTML or JavaScript code into a web page before it is redirected to\n\na legitimate bank website. Typically, a web inject would serve as an\n\noverlay, resembling a legitimate bank login web page that requests a user\n\nto input additional confidential data such as payment card data, Social\n\nSecurity numbers (SSN), PINs, credit card verification codes (CVV), or\n\nadditional PII, even if it is not actually required by the bank.\n\n[Banking injects are part of a MitB attack in which the banking trojan](https://attack.mitre.org/techniques/T1185/)\n\ncan modify the content of a legitimate bank web page in real time by\n\nperforming API hooking. Modified infected content that is designed to be\n\nadded to the legitimate web page is located in a web inject configuration\n\nfile, which is typically hosted on a remote command and control (C2)\n\nserver and downloaded to the infected machine or device. Attackers can\n\nupdate the configuration files on the server and on infected machines\n\nautomatically. Cybercriminals encrypt and obfuscate these configuration\n\nfiles to evade detection by antivirus software.\n\nMany banking web injects target Windows and Android operating\n\nsystems and integrate with multiple banking trojans, allowing both the\n\ncompromise of the user’s bank account. Among the most popular banking\n\ntrojans usually integrated with web injects are Cerberus, Anubis, Mazar,\n\nExoBot, Loki Bot, and RedAlert.\n\nSome technically advanced web injects use an Automatic\n\nTransfer System (ATS) that can initiate wire money transfers from the\n\ncompromised victim machine. This method does not require logging into\n\nthe victim’s account and bypassing 2FA. ATS injects scripts linked to the\n\ncommand and control (C2) server with banking information such as bank\n\naccounts, account balances, and other personal information and can\n\ninitiate a money transfer. If the transfer is authorized, the funds will be\n\nredirected to the account controlled by cybercriminals.\n\nMany web injects also have the following technical functionalities:\n\n      - Some web injects can bypass 2FA.\n\n      - Web injects that are integrated with banking trojans\n\nhave control panels and can obtain full control over the\n\nuser machine.\n\n      - Banking web injects are delivered in different ways, but\n\nmost commonly they are distributed through phishing\n\nemails and exploit kits.\n\nSome banking web inject developers offer both off-the-shelf web\n\ninjects and customized web injects created individually per customer\n\nrequests. These products are significantly more expensive, and prices\n\ncan reach up to $1,000 USD, whereas the average price range for the\n\nless technically sophisticated single banking inject, the functionality of\n\nwhich is similar to that of a simple phishing page, is $40 to $70 USD.\n\nAs a rule, web injects are customized to target a particular\n\norganization or website. If organizations track specific web injects\n\ntargeting a particular organization when they are advertised on the dark\n\nweb, they may be able to identify evolving cybercriminal campaigns.\n\nBased on research and analysis, Recorded Future identified the\n\nfollowing five threat actors to be the most technically capable and\n\nreferenced banking web inject creators on the dark web: yummba,\n\nValidolik, Kaktys1010, Pw0ned, and “ANDROID-Cerberus”.\n\n\n-----\n\n_Banking web injects on the dark web (Source: Recorded Future)_\n\n#### The Threat Actors Behind Customized Banking Web Inject Variants\n\n yummba\n\nThe threat actor known as yummba is a highly proficient, Russian-speaking\n\nhacker and the author of ATS web injects, which have targeted multiple financial\n\norganizations all over the world and caused damage estimated at tens of millions\n\nof dollars. The threat actor first registered on Verified forum in October 2012.\n\nThe threat actor has been linked to notorious cybercriminals, including another\n\nRussian-speaking actor, “lauderdale,” and was a member of top underground\n\ncommunities where they advertised malicious software. yummba is established as\n\na developer of highly customized tools, some of which are created specifically for\n\na customer. These products are significantly more expensive, with prices upwards\n\nof $1,000 USD. As a rule, web injects delivered by yummba include full source\n\ncode, which the threat actor has permitted buyers to resell at any time. While\n\nyummba has stopped selling web injects openly on forums, they may be selling\n\nthem to customers privately.\n\nyummba’s customized web injects are compatible with all versions of available\n\ntrojans, such as the Zeus banking trojan. yummba has strictly prohibited the use\n\nof their products from targeting Russia or other countries that are members of\n\nthe Commonwealth of Independent States (CIS). This is a common measure taken\n\nby threat actors living in Russia or the CIS region to attempt to shield themselves\n\nfrom local law enforcement. Recorded Future has observed the threat actor’s web\n\ninjects targeting multiple international financial and payment systems, as well as\n\nsocial media and e-commerce companies, but they appear to have focused efforts\n\nthe most on French organizations.\n\n[According to Akamai Technologies, yummba’s software is more powerful than](https://www.akamai.com/us/en/multimedia/documents/state-of-the-internet/yummba-webinject-tools-threat-advisory.pdf)\n\nits analogs because of its ATS Engine web injects, which not only compromise\n\na client’s device or network but also permit cross-site scripting, phishing, and\n\nd i b d l d tt k\n\n\n#### Validolik\n\nValidolik, also known as “Validol,” “Валидолик,” and “Валидол,” is, or has\n\nbeen, a member of several top-tier Russian-language forums, including Exploit,\n\nXSS, Verified, and the currently defunct low-tier forums WT1 and HackZona. The\n\nthreat actor has been one of the leading developers of Android web injects. On\n\nMay 16, 2017, Validolik released multiple Android injects on Exploit forum that\n\nwere specifically designed to be used in targeted attacks against a large number\n\nof U.S. and international banks, as well as financial, e-commerce, software, and\n\nsocial media organizations. Per the threat actor’s postings, the web injects were\n\ncompatible with a majority of Android trojans (Mazar, ExoBot, Loki Bot, Anubis,\n\nand RedAlert) and used HTML and JavaScript.\n\nThe threat actor has offered more than 210 web injects targeting banks\n\nin over 20 countries, including Australia, Austria, Canada, the Czech Republic,\n\nFrance, Germany, Hungary, Hong Kong, Hungary, India, Ireland, Japan, Kenya, the\n\nNetherlands, New Zealand, Poland, Romania, Spain, Turkey, and the United States.\n\nThe service provided by the Validolik has included three options:\n\n      - “Subscription” — provided all service subscribers access to all\n\nweb injects for the following five trojans: Mazar, ExoBot, Loki Bot,\n\nAnubis, and RedAlert, with subsequent discounts and benefits\n\nfor the subscribers. The one-time payment for the subscription\n\nservice was $1,500 USD.\n\n      - “Follow” — provided all service subscribers access to all web\n\ninjects without additional benefits. The one-time payment for the\n\nsubscription service was $1,200 USD.\n\n      - “Like” — service subscribers obtained access to any of 50 web\n\ninjects from the full list regardless of the price. The one-time\n\npayment for the subscription service is $500 USD.\n\n\n-----\n\nValidolik has sold both single web injects for a particular victim or in bulk,\n\ntargeting different banks and financial organizations in the same country. For\n\ninstance, one starting price for a single web inject stealing login/password\n\ninformation was $10 USD. The average price for such web injects has been $20\n\nto $40 USD. The price per web inject pack has depended on the number of web\n\ninjects per pack, ranging from $120 to $180 USD.\n\nValidolik has also sold a modified version of Anubis banking trojan, offering\n\ntwo versions: “Light” for $1,500 USD and “Premium” for $5,000 USD.\n\nIn January 2020, Validolik received multiple negative complaints and refund\n\nrequests on Anubis botnet from other cybercriminals across dark web forums due\n\nto the aforementioned botnet’s reportedly poor quality. As a result, the threat actor\n\nwas banned on Exploit and Verified forums.\n\n_Austrian bank inject pack created by Validolik (Source: Exploit forum)_\n\n_Example of two-stage bank web injects with credit card grabber by Validolik (Source: Exploit forum)_\n\n\n#### Kaktys1010\n\nKaktys1010, a member of the forums Exploit, XSS, and VLMI as well as the\n\ncurrently defunct Infraud forum, is a developer of Windows and Android web\n\ninjects and fake web pages with and without SMS/token interception. Furthermore,\n\nthe threat actor is the operator of the onion website “KTS” that advertises the\n\nabove-referenced Windows and Android web injects. The threat actor has been\n\nselling banking web injects on the dark web since at least 2015. The website KTS\n\noffers a wide range of HTML web injects, designed to target multiple banks and\n\nfinancial organizations worldwide, that are divided into the following categories:\n\n  - Android web injects\n\n  - Fake web pages\n\n  - Dynamic web pages\n\n  - Static web pages\n\n  - TrueLogin web pages\n\n  - Injects\n\n  - Uncategorized\n\n_KTS shop landing web page listing web injects (Source: KTS)_\n\nThe threat actor is selling web injects that are purportedly designed to\n\ntarget organizations primarily located in the following countries: Belgium, Canada,\n\nColombia, the Czech Republic, Denmark, France, Germany, Iran, Ireland, Italy,\n\nMexico, the Netherlands, Poland, Spain, Turkey, and the United Kingdom.\n\nKaktys1010 also develops web injects that require the victim to enter their\n\nemail address, personal documents, and Verified by Visa (VBV) and MasterCard\n\nSecureCode (MC) numbers to login. Per the threat actor’s statements, some\n\nAndroid banking web injects require downloading the Android application package\n\n(apk) file, a file format used by the Android, and other Android-based operating\n\nsystems for distribution and installation of mobile applications.\n\nThe price range of the web injects varies from $60 to $500 USD. KTS presents\n\nbanking web injects for sale with list prices and a cart feature; however, if the\n\ncustomer wants to buy the product and adds it to the cart, they are redirected to\n\nthe forum Exploit where they need to negotiate with the seller. There is no option to\n\npurchase web injects directly from KTS. The KTS website contains video tutorials\n\nwith instructions on how the listed web injects work. Recorded Future identified\n\nthat the threat actor does not sell Windows banking injects on the website but\n\ncreates specially crafted ones according to customer requests.\n\n\n-----\n\n_Banking web inject crafted to target Bank of Ireland by Kaktys1010 (Source: KTS)_\n\nThe threat actor also develops and sells Android web injects crafted\n\nspecifically for social media and messengers with payment card grabber function.\n\nFor instance, on April 11, 2016, the threat actor released a web inject pack that\n\ntargeted Facebook, Instagram, WhatsApp, Viber, Skype, and Google Play for\n\n$450 USD. The actor embeds the phishing generator function in their web injects,\n\nallowing attackers to change the color, font, and location of the elements on the\n\nphishing web page, as well as other properties.\n\nKaktys1010’s web injects can be controlled with an admin panel called\n\n“uAdmin” (universal admin). The admin panel is linked to the following plugins:\n\n  - Log parser\n\n  - Event logger\n\n  - Virtual Network Computing (VNC) — provides connection to the botnet\n\nAPI via VNC and SOCKS\n\n  - Token interception\n\n  - Victim tracker\n\n  - Additional framework plugins, including text manager and money drop\n\nmanager\n\n_‘uAdmin’ panel developed by Kaktys1010 (Source: Exploit forum)_\n\nDespite the threat actor using English and Russian to advertise web injects\n\non dark web forums, Recorded Future identified that the threat actor who operates\n\nthe Telegram account associated with this moniker does not speak Russian and\n\nis not a native English-speaking individual. It is likely the account “kaktys1010” is\n\noperated by a network of individuals.\n\n\n#### Pw0ned\n\nPw0ned, also known as “ws0,” “pwoned1,” “Fent,” “Felothis,” “Yan Okrasov,”\n\n”Ян Окрасов,” “User Tester,” and “ini,” is an experienced Russian-speaking hacker,\n\npenetration tester, and carder with above-average knowledge of JavaScript and\n\nPHP. The threat actor was first observed operating on the Russian-speaking forum\n\nYouHack in late April, 2013. However, it was not until 2015 that Pw0ned became\n\na consistently active participant across dark web sources, with the threat actor\n\ncreating multiple accounts across at least six of the following Russian-speaking\n\ncriminal forums: Exploit, Verified, FuckAV, BHF, WWH Club, and Antichat. Since\n\n2019, the threat actor has been primarily known as a developer of fake web pages\n\nfor popular social media brands, including Instagram and VKontakte (VK), and email\n\nservice providers such as Gmail, AOL, and Yandex. This development has included\n\nremote admin panels, fake HTML letters for spamming campaigns, and fake copies\n\nof websites. Recorded Future previously investigated Pw0ned’s activities and\n\nassessed that Pw0ned was a resident of Kyiv or Kyiv region, Ukraine, whose date\n\nof birth is likely March 19, 1998. It is also highly likely that his first name is Mikhail\n\n(in Russian, Михаил).\n\nBesides the development and sales of the abovementioned phishing web\n\npages, the threat actor is a creator of banking web injects that are compatible\n\nwith Cerberus Android Bot and Anubis Android trojan. In late July 2020, Recorded\n\nFuture identified that the developer or seller of the project “ANDROID-Cerberus”\n\nwas auctioning off the Cerberus Android bot project on Exploit and XSS forums.\n\nThe threat actor was selling the malware with its source code, source code of the\n\nadmin panel, malware servers, and the customer database with all active licenses\n\nand contact information. The starting price of the auction was $25,000 USD or\n\nthe malware could be purchased directly for $100,000 USD. Later, the threat actor\n\npublicly shared the source code of the botnet on the dark web. Pw0ned stated\n\nthat he created more than 210 web injects for the Cerberus Android botnet. As\n\nsoon as it was auctioned off on the dark web, the threat actor offered all web\n\ninjects for only $150 USD.\n\n#### ANDROID-Cerberus\n\nANDROID-Cerberus, also known as “Android” or “Cerberus,” is a member of\n\nmultiple underground communities and the creator of the Cerberus Android Bot.\n\nThe threat actor shut down their criminal enterprise on August 11, 2020, allegedly\n\ndue to a lack of time to devote to the malware, and shared the source code of\n\nthe Cerberus Android Bot infrastructure that includes “Cerberus v1 + Cerberus\n\nv2 + install scripts + admin panel + SQL DB.” The threat actor also shared the full\n\nset of available web injects. Recorded Future analysts examined the source code\n\npacked by the actor in the archive and identified multiple well-crafted web pages\n\nimpersonating banks, financial institutions, and social networks.\n\nThe web injects released are the apps supported by the Cerberus Android\n\ntrojan for credential stealing. Cerberus supports the theft of credential information\n\nfrom their specific Android app, and can determine which app to target based on\n\nthe Android identifier of the name. For example, the web injects’ folder contains two\n\nfiles that have the identifier for Google’s Gmail application (com[.]google.android[.]\n\ngm) followed by “.html” and “.png.” Since Cerberus is abusing the accessibility\n\nfunctionality of Android to do this injection and appears to have access to a wide\n\nvariety of data on the user’s phone (including text messages, Google Authenticator\n\n[codes, and the unlock pattern for the device), 2FA would not necessarily mitigate](https://www.buguroo.com/en/labs/full-report-on-cerberus-an-android-banking-trojan)\n\nthe threat. Recorded Future believes that banking and financial institutions will\n\nsee a spike in fraud attempts since the source code was released to the general\n\naudience. Hundreds if not thousands of threat actors will likely use the leaked code\n\nand methodology in their daily fraudulent activity.\n\n\n-----\n\n#### Analysis of Cerberus Android Bot Banking Injects\n\nRecorded Future conducted an analysis of source code of the Cerberus\n\nAndroid bot that was publicly shared on the dark web. The code contains a\n\nclass called “srvSccessibility,” which is the main routine for managing the inject\n\nfunctionality. This function extends the Android AccessibilityService class, which\n\nprovides enhancements to the user interface. “srvSccessibility” is a [developer-](https://developer.android.com/guide/topics/ui/accessibility/service)\n\n[defined “Accessibility Service.” Accessibility services run in the background and](https://developer.android.com/guide/topics/ui/accessibility/service)\n\nallow developers to “listen” for some context change, such as the click of a button\n\nor a change in window focus, and also to query for the content of the active\n\nwindow. When not used maliciously, they are intended to help developers better\n\nserve users who may require alternative interface feedback.\n\nTo support this functionality, the developer must then implement the\n\nfunctions required, including “onAccessibilityEvent,” which is called when an event\n\noccurs that matches the event filtering parameters specified by an accessibility\n\nservice. A brief description is as follows:\n\n1. This function is called when an “Accessibility Event” occurs, such as when\n\nthe in-focus application changes or the user inputs text to an application.\n\n2. The application collects the package name of the application in focus\n\nand places it in the “app_inject” variable. This would be the name of\n\nthe application that has now launched, for example, “com.bankaustria.\n\nandroid.olb”. (1).\n\n3. The application checks to see if the name of the application is among those\n\nlisted as being of interest to collect information from (2). An application is\n\nof interest if it matches the list of mail services or application services to\n\ncollect from. These application names include:\n\n      - Mail services: Gmail (com.google.android[.]gm), the mail[.]com\n\nAndroid application (com.mail.mobile.android[.]mail), Hotmail\n\n(com.connectivityapps[.]hotmail), Outlook (com.microsoft.\n\noffice[.]outlook), and Yahoo! (com.yahoo.mobile.client.android[.]\n\nmail)\n\n      - Application services: Google Play App Store (com.android[.]\n\nvending), Telegram (org.telegram[.]messenger), Uber (com[.]\n\nubercab), WhatsApp (com[.]whatsapp), WeChat (com.tencent[.]\n\nmm), Viber (com.viber[.]voip), Snapchat (com.snapchat[.]\n\nandroid), Instagram (com.instagram[.]android), imo messenger\n\n(com.imo.android[.]imoim), and Twitter (com.twitter[.]android)\n\n4. If the application determines that this application is of interest, based on\n\nthe criteria above, it begins the injection process by creating an instance\n\nof the “actViewInjection” class and starting it. This class is created by the\n\nthreat actor and is responsible for creating the overlay. (3)\n\n5. The code for the injection loading functions by creating a “web view,” and\n\nsetting the contents to either the fake web page HTML of the specific\n\nbanking application (if available in the list of supported injects), the fake\n\nweb page HTML of the application service, or the fake web page HTML of\n\nthe mail service application. (4)\n\n6. Finally, the view is placed over the screen so that the user of the\n\napplication thinks they are on the legitimate website when in reality,\n\nCerberus is ready to steal their personal information. (5)\n\nRecorded Future observed that the “commented out” code in “srvSccessibility.\n\n[java” file looks very similar to the code discussed by researchers who analyzed](https://www.threatfabric.com/blogs/cerberus-a-new-banking-trojan-from-the-underworld.html)\n\nCerberus Android in August 2019. This suggests that the threat actor refactored\n\nthe code, while still using the overlay functionality described in the report.\n\n\n#### Example of Banking Web Inject\n\nBelow is an example web inject for one of the banks, showing the screen(s)\n\nthat are locally overlaid to the user, during step 6 of the above “srvSccessibility”\n\nanalysis. There are four main parts to the inject:\n\n1. Collection of the bank username and password\n\n2. Collection of additional PII such as date of birth and Social Security number\n\n3. Collection of credit card number, expiration date, and Card Verification\n\nValue (CVV)\n\n4. Redirection to legitimate bank website\n\n_Web inject overlays and workflow (Source: Recorded Future)_\n\nThe HTML source code behind the banking web inject is below. It uses forms\n\nfor each overlay window. The entered data is verified for the correct format and\n\nthen sent to an internal “process” function.\n\n_Web inject HTML source code (Source: Recorded Future)_\n\nThe process function is called after each overlay and will record the user\ninputted data. After the last overlay asking for the credit card number, the user is\n\nredirected to the legitimate https://bank[.]com website.\n\n_Web inject process function (Source: Recorded Future)_\n\n\n-----\n\n#### Cerberus Admin Panel Functionality\n\nRecorded Future installed and analyzed the Cerberus V2 Administrative panel\n\nto gain a better understanding of its capabilities. The image below shows the main\n\nlanding page for the admin panel. The main page provides the user with statistics\n\non bots as well as the ability to modify or view information and settings related\n\nto the malware. The user can view or modify: General list of bots (Bots), Inject\n\nlogs (Logs), List of injections for applications (Inject List), Settings (Settings).\n\nAdditionally, from the main page, a user can use the builder to create a malicious\n\nAndroid Package (APK) for distribution.\n\n_Main page of Cerberus Android bot admin panel_\n\nThe “Bots” page, as shown below, allows the user to see a list of their\n\ncompromised bots and to execute specific commands related to the bots. The\n\nuser is able to remove dead bots, or “kill” them, and monitor the status of bots.\n\nFor each bot, the user can view the Android version of the victimized device, the\n\nindividual name of the collected APK (Tag), the bot’s country, the last time the bot\n\nwas online, statistics related to the bot’s operation, the number of applications\n\nfor which there are injections currently on the victim’s device, the IP address of\n\nthe bot, and date of infection. This management interface also allows the user\n\nto create a comment about the bot. Each bot is identified by a unique number\n\n(bot ID).\n\n_Cerberus Android bot admin panel — “Main BOTS table”_\n\nEach bot has four basic settings, and the user can set up a list of working\n\ninjections for the bot:\n\n  - Hide SMS: Activates hiding SMS messages on the victim’s device. Hidden\n\nSMS messages are visible in the bot information window (SMS, USSD,\n\nEvents)\n\n  - Lock device: Engages device lock function\n\n  - Off sound: Mutes the sound on the device\n\n  - Enable keylogger: Activates the keylogger on the victim’s device\n\n\n_Cerberus Android bot admin panel — Bots Settings_\n\nThe following image shows the administration panel for supplying commands\n\nto the bot. The available commands for bots are:\n\n  - Send SMS: Sends an SMS from the victim’s device\n\n  - Send USSD (Unstructured Supplementary Service Data): Sends USSD\n\nfrom the victim’s device\n\n  - Forward call: Forwards calls from the victim’s phone to another phone\n\nnumber\n\n  - Open Inject: Forces a web injection for the applications that are\n\ndownloaded to the victim’s device\n\n  - Run app: Runs a specified application on the victim’s device\n\n  - Send push: Sends push notifications to the victim’s device\n\n  - Open URL: Opens a URL on the victim’s phone browser\n\n  - Get data from bots: Gets installed applications, contacts, and SMS\n\nmessages from the victim’s device\n\n  - Delete app: Deletes a specific application from the victim’s device\n\n  - Update Module or app list: Updates bot module or inject list on victim’s\n\ndevice\n\n  - Google Authenticator grabber: Gets data from Google Authenticator on\n\nthe victim’s device\n\n  - Bot commands: Runs other commands such as “Get admin rights” and\n\n“Kill Bots”\n\nIn the Injection list tab, the user can see the list of available injections\n\nprovided by the developer, as well as add additional injections. The user can also\n\nsee a visual of the overlay(s) used for the selected injection.\n\n\n-----\n\n#### Outlook\n\nThe sale of customized web injects is a profitable business across the dark\n\nweb. Many notorious cybercriminals specifically craft web injects for banking trojan\n\ndevelopers and operators targeting multiple financial organizations worldwide,\n\nwhich are delivered primarily via phishing campaigns and exploit kits.\n\nRecorded Future believes that banking web injects will likely remain one of\n\nthe primary attack vectors targeting the financial sector, especially in light of the\n\nrecent publication of Cerberus Android bot source code.\n\n\n_Cerberus Android bot admin panel — bots commands_\n\n_Cerberus Android bot admin panel — inject list_\n\n#### Mitigations\n\nThere are good rules to follow to help detect and prevent a web inject attack.\n\nWe recommend the following mitigation strategies:\n\n  - Redesign the login web page for an application so that it appears\n\ndifferent from the PNG image in the leaked source code. Consider adding\n\na watermark of some sort that is client-specific, or changes based on\n\nthe time, since Cerberus Android uses static images for each supported\n\nbank. Provide clients with the guidance that if they do not see the image/\n\nwatermark, it is not an authentic login web page for that app.\n\n  - Keep all software and applications up to date; in particular, operating\n\nsystems, antivirus software, applications, and core system utilities.\n\n  - For users, install an antivirus solution, schedule signature updates, and\n\nmonitor the antivirus status on all equipment.\n\n  - Use only an HTTPS connection on the internet.\n\n  - Educate employees and conduct training sessions with mock phishing\n\nscenarios.\n\n  - Use multi-factor authentication (MFA) if possible.\n\n  - Deploy a spam filter that detects viruses, blank senders, and so on.\n\n  - Deploy a web filter to block malicious websites.\n\n  - Encrypt all sensitive company information on the device.\n\n  - Advise users to only download apps and files from trusted sources.\n\n\n-----\n\n#### Appendix A — List of Web Injects Publicly Shared by ANDROID-Cerberus\n\n\n\n- ABN Amro\n\n- Akbank\n\n- Alior Bank\n\n- Allegro\n\n- Amazon\n\n- Asseco\n\n- ATT\n\n- Banco Itau\n\n- Bank Austria\n\n- Bank Inter\n\n- Bank of America\n\n- Bank of Queensland\n\n- Bankowoskmobila\n\n- Banksa\n\n- Banque Populair\n\n- Barclays\n\n- BBVA\n\n- Bendigo bank\n\n- BienLinea\n\n- BitBank\n\n- Blockchain\n\n- BMO\n\n- BNL\n\n- BOCHK\n\n- BPH\n\n- BTLR\n\n- Caixageral\n\n- Chase Bank\n\n- CIBC\n\n- ClairMail\n\n- Coincheck\n\n- Commbank\n\n- CommerzBanking\n\n- ConsorsBank\n\n- Copper GMPS\n\n- Credem Mobil\n\n- Creditagricole\n\n- CSOB\n\n- Discover Financial\n\n- Eleader\n\n- Empik\n\n- Eurobank PL\n\n- Evobanco\n\n- Finansbank\n\n- Finanteq\n\n- Garanti BBVA\n\n- Getin group\n\n- GMOwallet\n\n- Google\n\n- Groupe Caisse d’épargne\n\n- GRPPL\n\n- Grupo Cajamar\n\n- HSBC\n\n- Ibercaja\n\n- ICICI\n\n- Ideo Mobile\n\n\n\n- IKO\n\n- ImaginBank\n\n- IMO\n\n- Ingdiba\n\n- Ingdirect\n\n- Inmitte\n\n- Instagram\n\n- Konylabs\n\n- Kutxabank\n\n- Kuveytturk\n\n- La tua banca\n\n- La caixa\n\n- Laposte\n\n- Liberbank\n\n- Lynx SPA\n\n- MBank\n\n- Mibanco\n\n- Microsoft Office Outlook\n\n- Mobillium\n\n- Mobiwik\n\n- Moje Orange\n\n- MoneyBookers\n\n- Mtel\n\n- NetBK\n\n- Nogood\n\n- Noris Bank\n\n- Oxigen\n\n- PayPal\n\n- PCB\n\n- Pekao\n\n- Pocket Bank\n\n- Popso\n\n- PostBank\n\n- PosteItaliane\n\n- Pozitron\n\n- PWCC\n\n- Quoine\n\n- Raiffeisenbank\n\n- Rakuten Bank\n\n- Royal Bank of Canada\n\n- RSI\n\n- SBI\n\n- Snapchat\n\n- Suncorp Bank\n\n- Suntrust\n\n- Targo\n\n- TEB Türk Ekonomi Bankası\n\n- Tecnocom\n\n- Telegram\n\n- Tencent\n\n- Tmobtech\n\n- Twitter\n\n- Ubercab\n\n- Unicredit\n\n- Unicredit Group\n\n- Union Bank\n\n\n\n- USAA\n\n- US Bank\n\n- Vakifbank\n\n- Viber\n\n- Volksbank\n\n- WellsFargo\n\n- WesternUnion\n\n- WhatsApp\n\n- Yahoo\n\n- YKB\n\n- Zira\n\n\n-----\n\n###### About Recorded Future\n\nRecorded Future arms security teams with the only complete security intelligence\n\nsolution powered by patented machine learning to lower risk. Our technology\n\nautomatically collects and analyzes information from an unrivaled breadth of sources\n\nand provides invaluable context in real time and packaged for human analysis or\n\nintegration with security technologies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2020-1016.pdf"
    ],
    "report_names": [
        "cta-2020-1016.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1602775862,
    "ts_modification_date": 1602775944,
    "files": {
        "pdf": "https://archive.orkl.eu/71914dfcb0481a35c66ab32001cd00e49c098fa2.pdf",
        "text": "https://archive.orkl.eu/71914dfcb0481a35c66ab32001cd00e49c098fa2.txt",
        "img": "https://archive.orkl.eu/71914dfcb0481a35c66ab32001cd00e49c098fa2.jpg"
    }
}