{
    "id": "1a7043c4-4b85-468d-9435-1c26f0845c66",
    "created_at": "2023-01-12T15:09:59.152419Z",
    "updated_at": "2025-03-27T02:05:22.367517Z",
    "deleted_at": null,
    "sha1_hash": "0d31acc9b6e55f44f53e76a788a307d3167f12ec",
    "title": "2021-03-16 - The Brief Glory of Cabassous-FluBot — a private Android banking botnet",
    "authors": "",
    "file_creation_date": "2022-05-28T04:49:06Z",
    "file_modification_date": "2022-05-28T04:49:06Z",
    "file_size": 1989304,
    "plain_text": "# The Brief Glory of Cabassous/FluBot — a private Android banking botnet\n\n**[medium.com/csis-techblog/the-brief-glory-of-cabassous-flubot-a-private-android-banking-botnet-bc2ed7917027](https://medium.com/csis-techblog/the-brief-glory-of-cabassous-flubot-a-private-android-banking-botnet-bc2ed7917027)**\n\nAleksejs Kuprins March 16, 2021\n\n[Aleksejs Kuprins](https://medium.com/@aku_12953?source=post_page-----bc2ed7917027--------------------------------)\n\nMar 16, 2021\n\n\n12 min read\n\n## Introduction\n\nA novel piece of banking malware for Android OS has surfaced around December 2020,\nattacking users in Spain. In this article, we will discuss the timeline of its existence, the\ntargeted apps, the current size and the spread of the botnet as well as the techniques and\ncapabilities, which the authors have employed, and speculate about how effective they are.\n\nWe have found neither indications of its name/alias, nor any sales threads within the\nunderground forums. The latter fact suggests that the malware is likely a private bot, which\nmeans that it will have a small client base in the future and no advertisement campaigns.\n\n\n-----\n\n## Timeline of Events\n\nWe have discovered the first in-the-wild samples during late December 2020. Since then, the\n‘version’ field in the malware’s configuration file was being incremented rather frequently with\nnew features and fixes added every week. The first piece of analysis about Cabassous that\nwe can find came on January 06 from ThreatFabric.\n\nMoving onward, several researchers have been publicly documenting the malware’s\nspreading campaign on Twitter. Our sinkhole statistics were showing that Cabassous was\ngrowing very fast, until it reached around 60,000 infections. By that moment, it suffered a\nmajor blow from the Spanish law enforcement authorities on the day of publication of\n[analysis by PRODAFT.](https://raw.githubusercontent.com/prodaft/malware-ioc/master/FluBot/FluBot.pdf)\n\nThe Spanish authorities coordinated with PRODAFT and arrested 4 suspected members of\nthe criminal group on March 05.\n\nCatalan police released the video of the arrest\nUnfortunately, the arrest did not bring the operation to a complete halt. The C&C server was\noffline during March 05, however, the campaign was restored a couple of days later. On the\nday of writing, Cabassous is alive and well, spreading the malware, defrauding its victims\nand even continuing the development of the bot, although the rate of new infections has\nslowed down.\n\nAlberto Segura reports on the changes in the malware, days after the arrests in Spain\nThe same week, the malware has started to spread in Poland with the similar phishing\ntheme. The list of targeted apps did not change yet, the latest known version at the moment\nof writing is 3.6.\n\nOur sinkhole stats indicate that there has indeed been a fall in the spreading of Cabassous\nafter 5th of March, when the number of infections dropped from ~40k unique connections per\nday down to ~15k in two days. The statistics continue to fall after that for a different reason\n— the authors have updated the domain generation algorithm in the newly distributed\nsamples.\n\n\n-----\n\nStats from the sinkholed domain nfiuerwtftasnuk[.]com\n\n## Attention: This is a sinkhole\n\nSpeaking of sinkholes, the C&C server’s proxy used to display a curious message back in\nJanuary, which was intended to either deter researchers from looking at the server or just an\nattempt at humor. Likely the latter. It is quite simple — the server’s HTTP response to the\nroot “/” URI was the following text: “Attention: this is a sinkhole”. Sinkhole is a term used by\nsecurity researchers and describes a web server, which was set up to have malicious\ndomains pointing at it. This is done in order to monitor or hijack a botnet, as the malware\nwould connect to it, believing that it is the legitimate C&C server. However in this case, it is\njust a fake message that means nothing and it is in fact the real C&C server’s proxy into its\nbackend.\n\nIndex page of the C&C server\nAround the end of February 2021, the above message was changed to a strongly worded\ngreeting phrase for researchers in Russian. Also a quote by Dmitriy Medvedev and a video\nmontage of him dancing to an old Russian pop song about “American boy” and “Balalaika”\nfrom the 90s. Obviously, this page is reserved for the “public relations” and the original\nmessage about the sinkhole is more of a joke rather than a legitimate attempt to conceal the\nserver’s location.\n\n\n-----\n\n“Greetings, researcher-****s. We wish you well, good mood and health!”\n\n## Spreading\n\nThe main target and most of the current bot pool is the mobile banking and cryptocurrency\nusers from Spain. The spreading campaign is the widely-tested scheme of impersonation of\npostal and delivery services. A given victim first receives an SMS message about a package\ndelivery with a link to the fake page of the postal service. Upon visiting, the victim is\nprompted to download the package tracking app, which in fact is the malware. The majority\nof infections likely come from the bot’s SMS spam: upon infection, the bot sends the local\ncontact list over to the C&C server, then requests the spam message and receives it with the\nnumber to be sent to.\n\nSamples of the SMS spam\nThe less frequently seen versions of the malware lure impersonate the DHL and FedEx\ndelivery services:\n\n\n-----\n\nDelivery services themed lures\nWe have estimated the botnet to currently be of the size of around 60k unique infections in\ntotal.\n\nCurrent spread of Cabassous around Europe\nAbout half of the infected devices are running Android 10. Supporting the latest versions of\nAndroid OS seems to be working out very well for Cabassous:\n\n\n-----\n\nDistribution of infected operating systems\nThe following applications are targeted by overlay attacks (aka injects). Spanish banking\napps:\n```\n“Bankinter Móvil” — com.bankinter.launcher“BBVA Spain | Online banking” —\ncom.bbva.bbvacontigo“Cajasur” — com.cajasur.android“Grupo Cajamar” —\ncom.grupocajamar.wefferent“Imagin. Much more than an app to manage your money” —\ncom.imaginbank.app“Kutxabank” — com.kutxabank.android“ruralvía” — com.rsi“Banca Móvil\nLaboral Kutxa” — com.tecnocom.cajalaboral“Santander” — es.bancosantander.apps“Bankia”\n— es.cm.android“EVO Banco móvil” — es.evobanco.bancamovil“Ibercaja” —\nes.ibercaja.ibercajaapp“CaixaBankNow” — es.lacaixa.mobile.android.newwapicon“Banca\nDigital Liberbank” — es.liberbank.cajasturapp“Openbank — banca móvil” —\nes.openbank.mobile“Pibank” — es.pibank.customers“UnicajaMovil” —\nes.univia.unicajamovil“Banco Sabadell App. Your mobile bank” —\nnet.inverline.bancosabadell.officelocator.android“ING España. Banca Móvil” —\nwww.ingdirect.nativeframe\n\n```\nCryptocurrency apps:\n```\n“Binance: Bitcoin Marketplace & Crypto Wallet” — com.binance.dev“Coinbase — Buy &\nSell Bitcoin. Crypto Wallet” — com.coinbase.android“Blockchain.com Wallet — Buy\nBitcoin, ETH, & Crypto” — piuk.blockchain.android\n\n```\nHere are a few examples of the inject screens:\n\n\n-----\n\nWebinjects targeting Spanish speaking users\n\n## Capabilities\n\nAs mentioned above, the Cabassous’s main business is banking fraud. It provides the\nfollowing functionality:\n\nIntercept SMS messages\nSend SMS messages and automated contact list spam\nDisplay overlays/injects for banking and cryptocurrency apps, as well as a generic\ncredit card phishing screen\nSteal contacts\nOpen URLs\nDisable PlayProtect\nRun USSD commands\nUninstall App\nSOCKS proxy\n\nThe overlays are displayed using the standard WebView.\n\n\n-----\n\nCabassous loading an overlay\n\n## Techniques\n\nThere are two techniques that are worthy of noting in this case. The obfuscation and the\nC&C communication.\n\nMost of the samples are packed with Tencent’s Legu Packer application. This solution\nencrypts the APK file and hides its content from the simple sandbox services. However, it is\nalso trivial to unpack using either software like Frida, Xposed Framework, or the apklab.io\nservice.\n\nThe second layer of obfuscation is the string encryption. The software package for that was\ntaken from a [public github repository. This means that after the first layer (Tencent Legu) is](https://github.com/MichaelRocks/paranoid)\nunpacked — you are still looking at the malware code with all of its strings packed into a\nsingle class in an encrypted state, while any uses of the strings are replaced with calls to the\nobfuscator’s de-obfuscation routine, which only allows the strings to be decrypted during\nruntime. This obfuscation is also trivial to bypass using any runtime hooking method, such as\nFrida or Xposed Framework.\n\nPublic Github repository of the string obfuscation module\n\n## Communication\n\n\n-----\n\nThe specialty about the C&C communication of this malware is the rare use of a DGA\nmodule (Domain Generation Algorithm). Normally a piece of any malware comes with a\ndomain name or an IP address of the C&C server embedded into it. The use of DGA is a\ndifferent approach — instead of connecting to a predefined address, the malware carries a\nblock of code, which would manipulate text and/or digits in a specific way. The output of this\noperation is a list of possible domain addresses, typically a lot of them — 2000 (5000 as of\nversion 3.6) in case of Cabassous.\n\nEvery time the malware starts up, it generates a set of possible domain names of the C&C\nserver, tries to resolve them and then connects to the first one that resolves to an IP address\nand is not offline. The strength of this technique is the resilience against the domain\ntakedowns. In the event of the current C&C server domain getting seized and taken down by\neither the law enforcement or the domain registry service, the malware still has a lots of other\ndomains to use. The threat actors can then simply register a new domain from the list and all\nof the infected devices will automatically connect to it, thus being completely unaffected by\nthe takedown.\n\nUsually a malware with a DGA module will begin its domain generation from a given seed\nvalue, like a short string. This value can be frequently updated by the criminals in order to\nprevent the investigators from being able to predict their future domains and blocking them\nall before they are even used. However, the authors of Cabassous took a different approach:\nthe seed of their algorithm is the combined string of the digits of the current year and month.\nThey have also not added any mechanism to update the seed, or the malware itself.\nBasically this means that anyone can run their malware on an analysis device with a system\ndate set to the next month and predict all of the future generated domains. The can then\nblock all of these domains on the DNS level within their organization.\n\nThe DGA seed is based on the current year and month\nThe order of the generated domains in this case is also intentionally randomized, but not to a\ngreat extent. It appears that the generated lists of domains are very similar with just a few\ndifferences. In our tests we observed a certain degree of predictability. To measure it, we ran\n\n\n-----\n\nthe malware on a device with the date set to the first day of the next month, then we wrote\ndown the first 10 out of 2000 generated domains. Then we ran the test 10 more times.\nAround 5 domains from the first run’s first 10 domains would appear within the first 10\ndomains in the following 10 tests, usually on almost identical position in the order of\ngeneration.\n\nDGA order randomization feature\nThe version 3.6 of Cabassous has introduced an actual full randomization of the domain\norder, using the standard Java library — Collections.shuffle().\n\nThe DGA module also protects the botnet from hijacking. Since the domains can be\npredicted and anyone can register the future domains of the malware, in theory one should\nbe able to steal all of the bots from the criminals. However, Cabassous has implemented a\nserver verification mechanism. The bot’s outgoing messages to the C&C are encrypted with\nthe server’s public key. This means that no one will be able to decrypt the hijacked traffic\nuntil they obtain the private key from the C&C server. The incoming traffic is encrypted with\nthe simple XOR, which does not matter much.\n\nWhenever the bot first connects to a server, it sends it a PKI encrypted bot ID string. It then\nexpects the server to be able to decrypt it and send it back. The DGA module will move on to\nthe next domain if the server does not respond with the same bot ID.\n\nOutgoing traffic encryption with an embedded public key\nThe listing of the set of commands, which the server can exchange with the bot are included\nin the IOC section of this article\n\n\n-----\n\nThe DGA domains point to a server running an instance of PRIVOXY, which is a software\nthat redirects the requests to the real server, as another measure of takedown resilience.\nEarly on in the campaign we have observed the server to leak the real backend address via\nthe PRIVOXY info page:\n```\nhkwl6qgewwvj2q7rtfxehu3jq3cypvr435u4vby3dwo4lwuxi47i5bqd[.]onion . Very soon\n\n```\nthe misconfiguration was fixed and the onion address was changed.\n\nMisconfigured PRIVOXY info page\n\n## Summary\n\nThe threat actors in this case are definitely somewhat savvy and hardly beginners in the\nbusiness. The authors have started out with targeting just one country, knowing fully well that\ndefrauding even one country takes a lot of effort. There is no need to make too much noise\nin the other countries, when you know up front that you will not have enough time to fraud\ntheir victims. While taking those careful steps, they probably felt that their private malware\ncould become unique, so they stuffed it with a DGA algorithm. Domain generation is very\nrarely used in Android malware.\n\nThe authors release updates to the malware code every few days, which is quite frequent.\nDespite the many successes, the arrests have still taken place and we may see more of\nthem.\n\n\n-----\n\nThe implementation of the DGA is unique and secure. Throwing PKI cryptography on the\nbot’s outgoing messages and only simple XOR on the incoming messages shows that the\ncriminals know about the hijacking risks and how to address the issue. We speculate that the\ncriminals might rent the botnet out for use by other carders, at which point we will start\nseeing other countries to be targeted by it.\n\nFor now, we recommend being very careful about dealing with your package tracking since\nthis infection vector has proven itself incredibly viable and effective. Whenever you expect a\npackage, we recommend that you copy the tracking number from your email and then\nnavigate to the website of the delivery service manually. This way, you avoid clicking the\nlinks, which you receive over SMS or email. Also, your delivery service would always have\ntheir real tracking app published on the official application stores — that is Apple AppStore\nfor iOS devices and GooglePlay for Android devices. Getting the app only from the official\nstore makes it far less likely that you will download a fake malicious version instead.\n\n## References\n\n— ThreatFabric’s initial report on Cabassous\n— PRODAFT’s analysis paper\n— Alberto Segura’s report on the version 3.4 after the arrests in Spain\n— Daniel López’s collection of spam domains\n— OpenSource string obfuscator “paranoid”\n— powerful runtime debugging framework for Android and other platforms\n— Runtime hooking framework Xposed\n— the free web proxying software which the Cabassous criminals have used to hide\ntheir real malware backend\n— Analysis of the Tencent’s Legu packer\n\n## IOC\n\nBot Commands\n```\nPREPINGPINGLOGSMS_RATEGET_SMSGET_INJECTGET_INJECTS_LISTCONTACTSSMSINTERCEPTINGINTERCEP\n\n```\nC2 proxy IPs\n```\n8.209.76.918.209.80.738.208.101.253\n\n```\nold C2 backend onion address\n```\nhkwl6qgewwvj2q7rtfxehu3jq3cypvr435u4vby3dwo4lwuxi47i5bqd[.]onion\n\n```\nSpam/APK delivery URLs (cheers to @danlopgom on his )\n\n\n-----\n\n```\n7277320[.]ru/app/acoi[.]my/fedex/ailnoir[.]com/app/aminatech[.]net/fedex/amzstudy[.]co\ncost[.]com/app/colegioaugustoribeiro[.]com[.]br/fedex/contornosdesign[.]pt/pkg/cwfplac\nnetwork[.]com/web/ganesha[.]com[.]py/web/geeklevi[.]com/fedex/illuminate[.]org/info/in\ndh[.]nl/pack/lavozislamica[.]com/www/lgklgklgk[.]com/fedex/magicboximportados[.]com[.]\ndaikou[.]com/info/prtysh[.]in/app/raeloficial[.]com/pkg/raisegroup[.]it/fedex/rasf[.]s\n-thvitstorec7a[.]com/pack/yangbin[.]100cuo[.]com/pack/ylem222[.]com/p/yourelectricians[.]co[.]uk/\n\n```\nSHA256\n```\nd22c5db75f6260823e83057721a2d3e90a9821bdbc81ec52683e8cce49d9a49d80260cc2e49e1014d64f87\n\n```\nC2 proxy DGA domains (a short batch of them for the sake of example)\n```\nafhckrfcucjbpln.comaoeaqxivuikhhdp.cnarymabkciiyygmh.combdoefrixkguoivh.rubfsggebsrhig\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-16 - The Brief Glory of Cabassous-FluBot — a private Android banking botnet.pdf"
    ],
    "report_names": [
        "2021-03-16 - The Brief Glory of Cabassous-FluBot — a private Android banking botnet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536199,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653713346,
    "ts_modification_date": 1653713346,
    "files": {
        "pdf": "https://archive.orkl.eu/0d31acc9b6e55f44f53e76a788a307d3167f12ec.pdf",
        "text": "https://archive.orkl.eu/0d31acc9b6e55f44f53e76a788a307d3167f12ec.txt",
        "img": "https://archive.orkl.eu/0d31acc9b6e55f44f53e76a788a307d3167f12ec.jpg"
    }
}