{
    "id": "1a927f78-d803-4bc4-b1ab-28af0c38d6b4",
    "created_at": "2023-01-12T15:07:37.48725Z",
    "updated_at": "2025-03-27T02:12:51.737076Z",
    "deleted_at": null,
    "sha1_hash": "987f9ae63d27c4bae845fbaba7df90829669e5f5",
    "title": "2022-03-01 - Asylum Ambuscade_State Actor Uses Compromised Private Ukrainian Military Emails to Target European Governments and Refugee Movement",
    "authors": "",
    "file_creation_date": "2022-05-26T02:23:03Z",
    "file_modification_date": "2022-05-26T02:23:03Z",
    "file_size": 2453855,
    "plain_text": "# Asylum Ambuscade: State Actor Uses Compromised Private Ukrainian Military Emails to Target European Governments and Refugee Movement\n\n**[proofpoint.com/us/blog/threat-insight/asylum-ambuscade-state-actor-uses-compromised-private-ukrainian-military-emails](https://www.proofpoint.com/us/blog/threat-insight/asylum-ambuscade-state-actor-uses-compromised-private-ukrainian-military-emails)**\n\nMarch 1, 2022\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nAsylum Ambuscade: State Actor Uses Compromised Private Ukrainian Military Emails to Target European\nGovernments and Refugee Movement\n\nMarch 01, 2022 Michael Raggi, Zydeca Cass and the Proofpoint Threat Research Team\n\n## Key Takeaways\n\n\n-----\n\n[Proofpoint has identified a likely nation state sponsored phishing campaign using a possibly](https://www.proofpoint.com/us/threat-reference/phishing)\ncompromised Ukrainian armed service member’s email account to target European government\npersonnel involved in managing the logistics of refugees fleeing Ukraine.\nThe email included a malicious macro attachment which attempted to download a Lua-based malware\ndubbed SunSeed.\nThe infection chain used in this campaign bears significant similarities to a historic campaign\nProofpoint observed in July 2021, making it likely the same threat actor is behind both clusters of\nactivity.\nProofpoint is releasing this report in an effort to balance accuracy with responsibility to disclose\nactionable intelligence during a time of high-tempo conflict.\n\n## Overview\n\n“Ambuscade: To attack suddenly and without warning from a concealed place”\n\nProofpoint researchers have identified a phishing campaign originating from an email address (ukr[.]net) that\nappears to belong to a compromised Ukranian armed service member. This discovery comes on the heels\nof [alerts by the Ukrainian Computer Emergency Response Team (CERT-UA) and the State Service of](https://www.cyberscoop.com/ukrainian-cyber-officials-warn-of-new-wave-of-phishing-attacks/)\nSpecial Communications and Information Protection of Ukraine about widespread phishing campaigns\ntargeting private email accounts of Ukrainian armed service members by ‘UNC1151’, which Proofpoint\ntracks as part of TA445. The email observed by Proofpoint may represent the next stage of these attacks.\nThe email included a malicious macro attachment which utilized social engineering themes pertaining to the\nEmergency Meeting of the NATO Security Council held on February 23, 2022. The email also contained a\nmalicious attachment which attempted to download malicious Lua malware named SunSeed and targeted\nEuropean government personnel tasked with managing transportation and population movement in Europe.\nWhile Proofpoint has not definitively attributed this campaign to the threat actor TA445, researchers\nacknowledge that the timeline, use of compromised sender addresses aligning with Ukrainian government\nreports, and the victimology of the campaign align with published TA445 tactics to include the targeting and\ncollection around refugee movement in Europe.\n\nProofpoint assesses that, in light of the ongoing Russia-Ukraine war, actions by proxy actors like TA445 will\ncontinue to target European governments to gather intelligence around the movement of refugees from\nUkraine and on issues of importance to the Russian government. TA445, which appears to operate out of\n[Belarus, specifically has a history of engaging in a significant volume of disinformation operations intended](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\nto manipulate European sentiment around the movement of refugees within NATO countries. These\ncontrolled narratives may intend to marshal anti-refugee sentiment within European countries and\nexacerbate tensions between NATO members, decreasing Western support for the Ukrainian entities\n[involved in armed conflict. This approach is a known factor within the hybrid warfare model employed by the](https://carnegieendowment.org/2019/07/03/west-fears-russia-s-hybrid-warfare.-they-re-missing-bigger-picture-pub-79412)\nRussian military and by extension that of Belarus.\n\n## Delivery\n\nOn February 24, 2022, Proofpoint detected an email originating from a ukr[.]net email address which was\nsent to a European government entity. The email utilized the subject \"IN ACCORDANCE WITH THE\nDECISION OF THE EMERGENCY MEETING OF THE SECURITY COUNCIL OF UKRAINE DATED\n24.02.2022\" and included a macro enabled XLS file titled “list of persons.xlsx,” which was later determined\nto deliver SunSeed malware. The social engineering lure utilized in this phishing campaign were very timely,\nfollowing a NATO Security Council meeting on February 23, 2022 and a news story about a Russian\ngovernment “kill list” targeting Ukrainians that began circulating in Western media outlets on February 21,\n2022. The format of the subject included the date “24.02.2022” at the end of subject line and was\nsuperficially similar to emails reported by the State Service of Special Communications and Information\nProtection of Ukraine (SSSCIP) on February 25, 2022. This alert indicated that mass phishing campaigns\nwere targeting “Citizens’ e-mail addresses” in Ukraine. The timing of the Proofpoint observed campaign is\nnotable as it occurred within close proximity to the campaigns reported by Ukrainian state agencies.\n\n\n-----\n\n_[Figure 1. SSSCIP Ukraine reported email including date format 24.02.2022.](https://twitter.com/dsszzi/status/1497103078029291522)_\n\n_Figure 2. CERT-UA_ _[reports of UNC1151 targeting private accounts of Ukrainian military personnel.](https://www.facebook.com/UACERT/posts/312939130865352)_\n\nOpen-source research on the sender email address identified the account on a Ukrainian public\nprocurement document for a Stihl lawn mower in 2016. The email account was listed as the contact address\non the purchase, while the customer was listed as “Військова частина А2622” or military unit A2622. This\ntitle, as well as the address listed, appear to refer to a military barracks that houses a military unit in\n“Чернігівська область” or the Chernihiv region of Ukraine. While Proofpoint has not definitively determined\nthat this detected campaign is aligned with the phishing campaigns reported by the Ukrainian government or\n\n\n-----\n\nthat this activity can be attributed to TA445, researchers assess that this may represent a continuation of the\ncampaigns that utilize compromised Ukrainian personal accounts of armed service members to target the\ngovernments of NATO members in Europe.\n\n\n-----\n\n_Figure 3. Ukrainian military procurement documents including possible compromised sender email as_\n_contact._\n\n## Macro Enabled Attachments\n\nThe malicious XLS attachment observed in the email was laden with a simple but distinct macro. When\nenabled, it executes a VB macro named “Module1” which creates a Windows Installer (msiexec.exe) object\ninvoking Windows Installer to call out to an actor-controlled staging IP and download a malicious MSI\n[package. It also sets a Microsoft document UILevel equal to “2” which specifies a user interface level of](https://docs.microsoft.com/en-us/windows/win32/msi/uilevel)\n“completely silent installation.” This hides all macro actions and network connections from the user. The\n[actor accesses the delivery IP via the Microsoft Installer InstallProduct method which is intended to obtain](https://docs.microsoft.com/en-us/windows/win32/msi/downloading-an-installation-from-the-internet)\nan MSI install file from a URL, save it to a cached location, and finally begin installation of the MSI package.\nSince the actor is utilizing an MSI package as an installer for a Lua-based malware, this method is well\nsuited to be deployed via a malicious macro-laden document delivered via phishing.\n\n\n-----\n\n_Figure 4. Observed malicious macro within list of persons.xlsx._\n\n## SunSeed Lua Malware Installation\n\nAnalysis of the actor-controlled delivery infrastructure identified an MSI package which installed a series of\nLua-based dependencies, executed a malicious Lua script that Proofpoint has dubbed SunSeed, and\nestablished persistence via an LNK file installed for autorun at Windows Startup. This file, named\n[qwerty_setup.msi, was previously identified publicly by security researcher Colin Hardy in response to](https://twitter.com/cybercdh/status/1497486233743863812)\nProofpoint’s initial [content regarding this threat. The package installs 12 legitimate Lua dependencies, a](https://twitter.com/threatinsight/status/1497355737844133895)\nWindows Lua interpreter, a malicious Lua script (SunSeed), and a Windows shortcut LNK file for\npersistence. Notably, the legitimate Windows Lua interpreter sppsvc.exe has been modified so it does not\nprint any output to the Windows Console. This is likely an effort to conceal the malware installation from the\ninfected user. All files, except for the LNK file, are installed to the folder C:\\ProgramData\\.security-soft\\. The\nLNK persistence script, which executes the SunSeed command “print.lua” via the Window Lua interpreter, is\nsaved to the directory C:\\ProgramData\\.security-soft\\sppsvc.exe to be executed at startup. This executes\nthe malicious SunSeed Lua script “print.lua” that attempts to retrieve additional malicious Lua code from the\nactor command and control (C2) server.\n\n**Legitimate Files and Lua Dependencies:**\n\nluacom.dll (LuaCom Library)\nltn12.lua (LuaSocket: LTN12 module)\nmime.lua (MIME support for the Lua language)\nhttp.lua (HTTP library for Lua)\nurl.lua (luasocket)\n\n\n-----\n\ntp.lua (luasocket)\nsocket.lua (luasocket)\ntp.lua\ncore.dll\nmime.dll\nlua51.dll\nsppsvc.exe (Lua Windows Standalone Interpreter – modified to suppress console output)\n<6 characters>.rbs (Windows Installer Rollback Script)\n\n**Persistence File:**\n\nSoftware Protection Service.lnk\n\nInstallation Directory:\n\n~\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\Software Protection Service.lnk\n\n**Malicious SunSeed Lua Script:**\n\nprint.lua| 7bf33b494c70bd0a0a865b5fbcee0c58fa9274b8741b03695b45998bcd459328\n\n_Figure 5. Asylum Ambuscade - Campaign Snapshot._\n\nProofpoint researchers observed several distinct and unusual aspects about the MSI package upon closer\ninspection. The actor utilized the Japanese Shift-JIS code base, resulting in a Japanese language\ninstallation message upon launching the MSI package. This may be a rudimentary false flag intended to\nconceal the spoken language of the threat actor. Additionally, examination of the cryptography calls made by\nthe package during installation indicates that the MSI file appears to have been created using a dated\nversion of WiX Toolset version 3.11.0.1528. This is an open-source software that allows users to “build MSIs\nwithout requiring additional software on a build server” from the command line. This version was last\nupdated in 2017 with a more recent update being pushed in 2019 and an entirely new version of the toolset\nmade available in May 2021.\n\n\n-----\n\n_Figure 6. Japanese code base MSI package installation display._\n\n_Figure 7. MSI package cryptography call indicating Windows Installer XML version._\n\n## SunSeed Malware Capabilities: A Lua Downloader\n\nBased on decoding of the SunSeed print.lua malicious second stage payload script, it appears to be a\nsimple downloader which obtains the C Drive partition serial number from the host, appends to a URL\nrequest via a Lua socket, consistently pings the C2 server for additional Lua code, and executes the code\nupon receiving it within a response. At the time of analysis, Proofpoint did not receive additional Lua code\nfrom the C2 server. However, researchers believe that this is likely intended to deliver subsequent stage\npayloads to the infected host. Further attempts to decode the SunSeed Lua host included several notable\nstrings that may suggest a possible response from the actor-controlled server. These strings do not appear\nto be part of the initial SunSeed script’s functionality in the absence of a C2 server response. Observed\nstring values include, but are not limited to:\n\n\n-----\n\nserial\n“string”\n“luacom”\n“CreateObject”\n“Scripting.FileSystemObject”\n“Drives”\n“SerialNumber”\n“socket.http”\n“request”\n“http://84.32.188[.]96/”\n“ socket”\n“sleep”\n\n## Command and Control\n\nThe SunSeed malware when executed issues GET requests over HTTP via port 80 using a Lua Socket. The\nrequests are issued to the C2 server every three seconds anticipating a response. The malware specifies\nthe user agent as “LuaSocket 2.0.2” and appends the infected target’s C Drive partition serial number to the\nURI request. This is a unique decimal digit value assigned to a drive upon creation of the file system. It may\nbe an attempt by actors to track infected victims on the backend per their unique serial number. Additionally,\nthis may allow operators to be selective about which infections are issued a next stage payload response.\nBased on the observed strings in the Lua script, researchers speculate that the server response may include\nfurther malicious commands, or a Lua based installer code which is executed as a response to the SunSeed\npayload, depending on the received serial identification number.\n\n_Figure 8. SunSeed Lua malware C2 communication._\n\n## Victimology and Targeting\n\nWith the finite data set available to Proofpoint surrounding this campaign, limited conclusions can be drawn\nregarding targeting. The Proofpoint-observed email messages were limited to European governmental\nentities. The targeted individuals possessed a range of expertise and professional responsibilities. However,\nthere was a clear preference for targeting individuals with responsibilities related to transportation, financial\nand budget allocation, administration, and population movement within Europe. This campaign may\nrepresent an attempt to gain intelligence regarding the logistics surrounding the movement of funds,\nsupplies, and people within NATO member countries.\n\n## Attribution Remains Unclear\n\nSeveral temporal and anecdotal indicators exist which suggest that this activity aligns with reported\n[campaigns by the threat actor TA445/UNC1151/Ghostwriter. However, Proofpoint has not yet observed](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\nconcrete technical overlaps which would allow us to definitively attribute this campaign to this actor. In\naddition to the notable overlaps with Ukrainian government reported campaigns referenced previously, the\nvictimology of this campaign with prominent NATO governments being targeted and a possible focus on the\nmovements of refugees in NATO countries recalls historic motivations of TA445’s information operations\ncirca 2021. Specifically, the anti-migratory narratives disseminated by the group also referred to as\nGhostwriter during the 2021 migratory crisis in which Belarus intentionally funneled refugees to the Polish\nborder belies a possible connection between this 2022 campaign and TA445’s historic mandate. Mainly both\ncampaigns may indicate the weaponization of migrants and refugees of war through a hybrid information\n\n\n-----\n\nwarfare and targeted cyber attack model. Researchers at Mandiant addressed these tactics by UNC1151 s\n[information operation team referred to as Ghostwriter (collectively TA445) in a recent presentation (12:17](https://www.youtube.com/watch?v=l2KqGBkDwww)\ntime stamp), disclosing the existence of the group and attributing the activity to Belarus. Proofpoint also\nnotes that, in addition to the Asylum Ambuscade operation, in recent days researchers have detected TA445\ncredential harvesting activity that aligns with Mandiant’s description of this threat group to include the use of\nGoPhish to deliver malicious email content. This activity appears distinct from the Asylum Ambuscade\ncampaign. Proofpoint is currently tracking the actor responsible for Asylum Ambuscade as distinct from\nTA445 until a technical relationship can be further established.\n\n**Tactic** **Asylum Ambuscade Campaign** **TA445**\n\n**Document Attachment Phishing**\n\n**Focus on Refugee Issues and NATO**\n\n**Use of Macro Enabled Documents**\n\n**Use of GoPhish**\n\n**Use of MSI Packages**\n\n**Use of Lua Based Malware**\n\n**Use of Compromised Sender Infrastructure**\n\n_Figure 9. Comparison of Asylum Ambuscade campaign and TA445 TTPs._\n\nWhile Proofpoint has not definitively determined attribution at this time, researchers assess with moderate\nconfidence that this campaign and a historic campaign from July 2021 were conducted by the same threat\nactor. The July 2021 campaign utilized a highly similar macro-laden XLS attachment to deliver MSI\npackages that install a Lua malware script. Similarly, the campaign utilized a very recent government report\n[as the basis of the social engineering content and titled the malicious attachment “list of participants of the](https://www.virustotal.com/gui/file/a8fd0a5de66fa39056c0ddf2ec74ccd38b2ede147afa602aba00a3f0b55a88e0)\nbriefing.xls.” In addition to the file name being quite similar to the Asylum Ambuscade campaign, the Lua\nscript created a nearly identical URI beacon to the SunSeed sample, which was composed of the infected\nvictim’s C Drive partition serial number. Analysis of the cryptography calls in both samples revealed that the\nsame version of WiX 3.11.0.1528 had been utilized to create the MSI packages. Finally, the macros in this\nhistoric campaign utilized the identical technique as the Asylum Ambuscade campaign, using Windows\nInstaller to retrieve an MSI package from an actor-controlled IP resource and suppressing indications of\ninstallation from the user. The July 2021 campaign targeted senior cyber security practitioners and\ndecisionmakers at private US-based companies, including those in the defense sector.\n\n\n-----\n\n_Figure 10. Historic malicious macro seen in July 2021._\n\n## Conclusion: Balancing Accurate Reporting in a Timely Fashion\n\nThis activity, independent of attribution conclusions, represents an effort to target NATO entities with\ncompromised Ukrainian military accounts during an active period of armed conflict between Russia, its\nproxies, and Ukraine. In publishing this report, Proofpoint seeks to balance the accuracy of responsible\nreporting with the quickest possible disclosure of actionable intelligence. The onset of hybrid conflict,\nincluding within the cyber domain, has accelerated the pace of operations and reduced the amount of time\nthat defenders have to answer deeper questions around attribution and historical correlation to known\nnation-state operators. However, these are issues that Proofpoint will continue to research while protecting\ncustomers globally. Proofpoint invites additional details and input around any observed activity that aligns\nwith these reports. While the utilized techniques in this campaign are not groundbreaking individually, if\ndeployed collectively, and during a high tempo conflict, they possess the capability to be quite effective. As\nthe conflict continues, researchers assess similar attacks against governmental entities in NATO countries\nare likely. Additionally, the possibility of exploiting intelligence around refugee movements in Europe for\ndisinformation purposes is a proven part of Russian and Belarussian-state techniques. Being aware of this\nthreat and disclosing it publicly are paramount for cultivating awareness among targeted entities.\n\n**Indicators of Compromise (IOCs)**\n\n\n**IOC** **Type of**\n\n**IOC**\n\n\n**Description**\n\n\n-----\n\n<redacted>@ukr[.]net Sender\n\nEmail\n\n\nFebruary 24,\n\n2022\n\n\nIN ACCORDANCE WITH THE DECISION OF THE EMERGENCY MEETING\nOF THE SECURITY COUNCIL OF UKRAINE DATED 24.02.2022\n\n\nEmail\nSubject\n\n\nFebruary 24,\n\n2022\n\n\nlist of persons.xls\n1561ece482c78a2d587b66c8eaf211e806ff438e506fcef8f14ae367db82d9b3\n\n\nAttachment February 24,\n\n2022\n\n\n84.32.188[.]96 IP Actor\nControlled IP\n\n\nqwerty_setup.msi\n\n31d765deae26fb5cb506635754c700c57f9bd0fc643a622dc0911c42bf93d18f\n\n\nMSI\nPackage\n\n\nMalicious MSI\n\nPackage\n\n\nprint.lua\n7bf33b494c70bd0a0a865b5fbcee0c58fa9274b8741b03695b45998bcd459328\n\n\nluacom.dll\nf97f26f9cb210c0fcf2b50b7b9c8c93192b420cdbd946226ec2848fd19a9af2c\n\nltn12.lua\nb1864aed85c114354b04fbe9b3f41c5ebc4df6d129e08ef65a0c413d0daabd29\n\nmime.lua\ne9167e0da842a0b856cbe6a2cf576f2d11bcedb5985e8e4c8c71a73486f6fa5a\n\nhttp.lua\nd10fbef2fe8aa983fc6950772c6bec4dc4f909f24ab64732c14b3e5f3318700c\n\nsocket.dll\n3694f63e5093183972ed46c6bef5c63e0548f743a8fa6bb6983dcf107cab9044\n\nmime.dll\n976b7b17f2663fee38d4c4b1c251269f862785b17343f34479732bf9ddd29657\n\nlua5.1.dll\nfbbe7ee073d0290ac13c98b92a8405ea04dcc6837b4144889885dd70679e933f\n\nurl.lua\n269526c11dbb25b1b4b13eec4e7577e15de33ca18afa70a2be5f373b771bd1ab\n\nsppsvc.exe\n737f08702f00e78dbe78acbeda63b73d04c1f8e741c5282a9aa1409369b6efa8\n\ntp.lua\n\n343afa62f69c7c140fbbf02b4ba2f7b2f711b6201bb6671c67a3744394084269\n\nsocket.lua\n15fd138a169cae80fecf4c797b33a257d587ed446f02ecf3ef913e307a22f96d\n\n\nLua Script Malicious Lua\n\nScript\nPayload\n\nFiles Legitimate\n\nLua\nDependencies\n\n\nSoftware Protection Service.lnk File Name Persistence\n\nFile Name\n\n\nAppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\Software\nProtection Service.lnk\n\n\nDirectory\n\nPath\n\n\nPersistence\nFile Directory\n\n\n-----\n\nC:\\ProgramData\\.security-soft Directory\n\nPath\n\n\nLua Files\nInstallation\n\nDirectory\n\n\nhxxp://84.32.188[.]96/<hexadecimal_value> URL Command\nand Control\n\n\nlist of participants of the briefing.xls\n\na8fd0a5de66fa39056c0ddf2ec74ccd38b2ede147afa602aba00a3f0b55a88e0\n\n\nFile Phishing\nAttachment\n\n\nJuly 2021\n\n\n157.230.104[.]79 IP Actor\nControlled IP\n\n\nJuly 2021\n\n\ni.msi\n\n2e1de7b61ed25579e796ec4c0df2e25d2b98a1f8d4fdb077e2b52ee06c768fca\n\n\nMSI\nPackage\n\n\nMalicious MSI\n\nPackage\n\nJuly 2021\n\n\nhxxp://45.61.137[.]231/?id=<hexdecimal_value> URL Command\nand Control\n\n\n-----\n\nwlua5.1.exe\n\n737f08702f00e78dbe78acbeda63b73d04c1f8e741c5282a9aa1409369b6efa8\n\ncore.lua\n\n737f08702f00e78dbe78acbeda63b73d04c1f8e741c5282a9aa1409369b6efa8\n\nluacom.dll\n\nf97f26f9cb210c0fcf2b50b7b9c8c93192b420cdbd946226ec2848fd19a9af2c\n\nstruct.dll\n\n5b317f27ad1e2c641f85bef601740b65e93f28df06ed03daa1f98d0aa5e69cf0\n\nltn12.lua\n\nb1864aed85c114354b04fbe9b3f41c5ebc4df6d129e08ef65a0c413d0daabd29\n\nmime.lua\n\ne9167e0da842a0b856cbe6a2cf576f2d11bcedb5985e8e4c8c71a73486f6fa5a\n\nhttp.lua\n\nd10fbef2fe8aa983fc6950772c6bec4dc4f909f24ab64732c14b3e5f3318700c\n\nsocket.dll\n\n3694f63e5093183972ed46c6bef5c63e0548f743a8fa6bb6983dcf107cab9044\n\ncore.dll\n\n9aa3ca96a84eb5606694adb58776c9e926020ef184828b6f7e6f9b50498f7071\n\ncore.lua\n\n20180a8012970453daef6db45b2978fd962d2168fb3b2b1580da3af6465fe2f6\n\nmime.dll\n\n976b7b17f2663fee38d4c4b1c251269f862785b17343f34479732bf9ddd29657\n\nlua5.1.dll\n\nfbbe7ee073d0290ac13c98b92a8405ea04dcc6837b4144889885dd70679e933f\n\nurl.lua\n\n269526c11dbb25b1b4b13eec4e7577e15de33ca18afa70a2be5f373b771bd1ab\n\nalien.lua\n\n303e004364b1beda0338eb10a845e6b0965ca9fa8ee16fa9f3a3c6ef03c6939f\n\ntp.lua\n\n343afa62f69c7c140fbbf02b4ba2f7b2f711b6201bb6671c67a3744394084269\n\nsocket.lua\n\n15fd138a169cae80fecf4c797b33a257d587ed446f02ecf3ef913e307a22f96d\n\n\nFiles Lua\nDependencies\n\n\nJuly 2021\n\n\n**YARA Signatures**\n\n\n-----\n\nrule WindowsInstaller_Silent_InstallProduct_MacroMethod\n\n{\n\nmeta:\n\nauthor = \"Proofpoint Threat Research\"\n\ndate = \"20210728\"\n\nhash = \"1561ece482c78a2d587b66c8eaf211e806ff438e506fcef8f14ae367db82d9b3;\na8fd0a5de66fa39056c0ddf2ec74ccd38b2ede147afa602aba00a3f0b55a88e0\"\n\nreference = \"This signature has not been quality controlled in a production environment. Analysts\nbelieve that this method is utilized by multiple threat actors in the wild\"\n\nstrings:\n\n$doc_header = {D0 CF 11 E0 A1 B1 1A E1}\n\n$s1 = \".UILevel = 2\"\n\n$s2 = \"CreateObject(\\\"WindowsInstaller.Installer\\\")\"\n\n$s3 = \".InstallProduct \\\"http\"\n\ncondition:\n\n$doc_header at 0 and all of ($s*)\n\n}\n\n**Emerging Threats Signatures**\n\n2035360  SunSeed Lua Downloader Activity (GET)\n\n2035361  SunSeed Downloader Retrieving Binary (set)\n\n2035362  SunSeed Download Retrieving Binary\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-01 - Asylum Ambuscade_State Actor Uses Compromised Private Ukrainian Military Emails to Target European Governments and Refugee Movement.pdf"
    ],
    "report_names": [
        "2022-03-01 - Asylum Ambuscade_State Actor Uses Compromised Private Ukrainian Military Emails to Target European Governments and Refugee Movement.pdf"
    ],
    "threat_actors": [
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536057,
    "ts_updated_at": 1743041571,
    "ts_creation_date": 1653531783,
    "ts_modification_date": 1653531783,
    "files": {
        "pdf": "https://archive.orkl.eu/987f9ae63d27c4bae845fbaba7df90829669e5f5.pdf",
        "text": "https://archive.orkl.eu/987f9ae63d27c4bae845fbaba7df90829669e5f5.txt",
        "img": "https://archive.orkl.eu/987f9ae63d27c4bae845fbaba7df90829669e5f5.jpg"
    }
}