{
    "id": "1aaa6b43-76bb-401d-9417-3a462103f40b",
    "created_at": "2023-01-12T15:06:46.69997Z",
    "updated_at": "2025-03-27T02:06:13.925967Z",
    "deleted_at": null,
    "sha1_hash": "ecde16c30159ccbc2e2427eb45605573b8e3f568",
    "title": "2022-03-22 - Dissecting a Phishing Campaign with a Captcha-based URL",
    "authors": "",
    "file_creation_date": "2022-09-01T10:07:02Z",
    "file_modification_date": "2022-09-01T10:07:02Z",
    "file_size": 538282,
    "plain_text": "# Dissecting a Phishing Campaign with a Captcha-based URL\n\n**[trustwave.com/en-us/resources/blogs/spiderlabs-blog/dissecting-a-phishing-campaign-with-a-captcha-based-url](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/dissecting-a-phishing-campaign-with-a-captcha-based-url)**\n\nIn today’s environment, much of the population are doing their banking or financial\ntransactions online with online banking and wire transfers have become a huge necessity.\nRecently, we received a phishing email that is targeting PayPal accounts that uses a\ncaptcha to avoid detection.\n\nThe email header contains an alarming subject and the From: address is a spoofed PayPallike domain.\n\nThe Message-Id is also highly suspicious as it uses web hosting site DreamHost which is\nnot related to PayPal.\n\nThe body of the email explains that there is a report of an unauthorized activity linked to the\nPayPal account that has caused PayPal to limit use of the account.\n\n\n-----\n\nAt the end of the email body, it asks the victim to log-in to their Paypal account with a\nclickable link that leads to a phishing site hxxps://mbj[.]unimap[.]edu[.]my/wpincludes/css/dist/ppllll/\n\nUpon clicking the link in the email, the browser is redirected to an initial page that uses a\ncaptcha before proceeding to the final phishing page.\n\nLooking at the source-code of the phishing captcha page, it was inserted with French\nfolklore ‘Bluebeard’ to make the code longer and not get easily detected.\n\n\n-----\n\nMoreover, the captcha checking in the phishing page is done in the script ‘signin.js’.\n\nThis JavaScript file contains several functions dedicated to captcha checking that includes\nusing predefined math methods for checking the length of the string and character matching\nof the captcha or even to produce a new captcha.\n\nFinally, there is a malicious ‘xscex.js’ that is responsible for the captcha submission.\n\n\n-----\n\nThe id ‘xyssubmitsecx’ under the button tag will trigger the execution of the ‘xscex.js’ which\neventually redirects to the actual PayPal phishing site. The button tag also has a value that\ncontains German words “Ich bin kein Roboter” and when translated in English means “I am\nnot a robot”.\n\nUsing the Fiddler tool, we can also see the exact resource URL of the malicious js file.\n\nOnce the correct captcha has been entered, it will proceed to the final phishing URL\nredirection that uses the same domain, yet a different path:\n\nhxxps://mbj[.]unimap[.]edu[.]my/wp-includes/css/dist/ppllll/app/signin\n\n\n-----\n\nLooking closer at the source-code of the actual “log-in” page of PayPal phishing site, we\nsee it also contains some useless salad words. Interestingly, the code indicates an author\nnamed ‘morpheous’. We can also see a hex value at the top or beginning of the sourcecode of the redirected page.\n\nUpon further analysis, we found another file ‘xappx.css’ that checks for hex value in the\ncontent of a file that serves as an indicator if the character input or log-in was a success or\nfailure.\n\n\n-----\n\nComplete infection chain:\n\nhxxps://mbj[.]unimap[.]edu[.]my/wp-content/ppllll/app/\n\n-> https://mbj[.]unimap[.]edu[.]my/wp-content/ppllll/app/index\n\n-> https://mbj[.]unimap[.]edu[.]my/wp-content/ppllll/app/captcha\n\n-> hxxps://mbj[.]unimap[.]edu[.]my/wp-includes/css/dist/ppllll/app/signin\n\nUpon investigating the domain hxxps://mbj[.]unimap[.]edu[.]my/, we found that it is a\ncompromised blog site. Using a compromised URLs is a common technique in phishing\nattacks.\n\nAt the time of analysis, we saw about a dozen samples of the PayPal phishing email that\ncontains the same email subject “Your PayPal account is temporarily limited” and contains\nlinks to the captcha-based phishing pages. A large number of samples were seen in\nJanuary and another one sample was spotted in February.\n\n\n-----\n\nTo wrap up, this analysis outlines an example of captcha-based phishing. While using\ncaptcha in phishing is not new, there has been a recent uptick in its use. The phishers are\ngravitating towards captchas to avoid automated phishing page discovery tools. While\n[Trustwave MailMarshal defends against this phishing campaign, this type of obfuscation](https://www.trustwave.com/en-us/services/email-security/)\nand evasion to prevent detection has a long tradition among cybercriminals. This is why\n“defense in depth” and layered security controls are essential.\n\nIn the end, our last line of defense is often the user behind the keyboard, which is why\nongoing Security Awareness training that includes phishing identification is an essential\ncomponent for any information security program.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-22 - Dissecting a Phishing Campaign with a Captcha-based URL.pdf"
    ],
    "report_names": [
        "2022-03-22 - Dissecting a Phishing Campaign with a Captcha-based URL.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536006,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1662026822,
    "ts_modification_date": 1662026822,
    "files": {
        "pdf": "https://archive.orkl.eu/ecde16c30159ccbc2e2427eb45605573b8e3f568.pdf",
        "text": "https://archive.orkl.eu/ecde16c30159ccbc2e2427eb45605573b8e3f568.txt",
        "img": "https://archive.orkl.eu/ecde16c30159ccbc2e2427eb45605573b8e3f568.jpg"
    }
}