{
    "id": "1aabc2c4-49bc-46d7-9f53-a215f3c6b7da",
    "created_at": "2023-01-12T15:07:03.914142Z",
    "updated_at": "2025-03-27T02:15:35.605991Z",
    "deleted_at": null,
    "sha1_hash": "7e3fc106cbcc18c6c361c1d4d89026225e9736ae",
    "title": "2022-07-27 - Untangling KNOTWEED- European private-sector offensive actor using 0-day exploits",
    "authors": "",
    "file_creation_date": "2022-08-18T04:02:42Z",
    "file_modification_date": "2022-08-18T04:02:42Z",
    "file_size": 2117759,
    "plain_text": "# Untangling KNOTWEED: European private-sector offensive actor using 0-day exploits\n\n**[microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/](https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/)**\n\nJuly 27, 2022\n\nThe Microsoft Threat Intelligence Center (MSTIC) and the Microsoft Security Response Center (MSRC)\nfound a private-sector offensive actor (PSOA) using multiple Windows and Adobe 0-day exploits,\n[including one for the recently patched CVE-2022-22047, in limited and targeted attacks against](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-22047)\nEuropean and Central American customers. The PSOA, which MSTIC tracks as KNOTWEED,\ndeveloped malware called Subzero which was used in these attacks.\n\nThis blog details Microsoft’s analysis of the observed KNOTWEED activity and related malware used in\ntargeted attacks against our customers. This information is shared with our customers and industry\npartners to improve detection of these attacks. Customers are encouraged to expedite deployment of\nthe July 2022 Microsoft security updates to protect their systems against exploits using CVE-202222047. Microsoft Defender Antivirus and Microsoft Defender for Endpoint have also implemented\ndetections against KNOTWEED’s malware and tools.\n\nPSOAs, which [Microsoft also refers to as cyber mercenaries, sell hacking tools or services through a](https://blogs.microsoft.com/on-the-issues/2022/07/27/private-sector-cyberweapons-psoas-knotweed/)\nvariety of business models. Two common models for this type of actor are access-as-a-service and\nhack-for-hire. In access-as-a-service, the actor sells full end-to-end hacking tools that can be used by\nthe purchaser in operations, with the PSOA not involved in any targeting or running of the operation. In\n\n\n-----\n\nhack-for-hire, detailed information is provided by the purchaser to the actor, who then runs the targeted\noperations. Based on observed attacks and news reports, MSTIC believes that KNOTWEED may blend\nthese models: they sell the Subzero malware to third parties but have also been observed using\nKNOTWEED-associated infrastructure in some attacks, suggesting more direct involvement.\n\n## Who is KNOTWEED?\n\nKNOTWEED is an Austria-based PSOA named DSIRF. The [DSIRF website [web archive link] says they](https://web.archive.org/web/20220713203741/https:/dsirf.eu/about/)\nprovide services “to multinational corporations in the technology, retail, energy and financial sectors”\nand that they have “a set of highly sophisticated techniques in gathering and analyzing information.”\nThey publicly offer several services including “an enhanced due diligence and risk analysis process\n_through providing a deep understanding of individuals and entities” and “highly sophisticated Red_\n_Teams to challenge your company’s most critical assets.”_\n\nHowever, [multiple](https://www.intelligenceonline.com/surveillance--interception/2022/04/06/after-finfisher-s-demise-berlin-explores-cyber-tool-options,109766000-art) [news](https://www.focus.de/politik/vorab-aus-dem-focus-volle-kontrolle-ueber-zielcomputer-das-raetsel-um-die-spionage-app-fuehrt-ueber-wirecard-zu-putin_id_24442733.html) [reports have linked DSIRF to the development and attempted sale of a](https://netzpolitik.org/2021/dsirf-wir-enthuellen-den-staatstrojaner-subzero-aus-oesterreich)\nmalware toolset called Subzero. MSTIC found the Subzero malware being deployed through a variety\nof methods, including 0-day exploits in Windows and Adobe Reader, in 2021 and 2022. As part of our\ninvestigation into the utility of this malware, Microsoft’s communications with a Subzero victim revealed\nthat they had not commissioned any red teaming or penetration testing, and confirmed that it was\nunauthorized, malicious activity. Observed victims to date include law firms, banks, and strategic\nconsultancies in countries such as Austria, the United Kingdom, and Panama. It’s important to note that\nthe identification of targets in a country doesn’t necessarily mean that a DSIRF customer resides in the\nsame country, as international targeting is common.\nMSTIC has found multiple links between DSIRF and the exploits and malware used in these attacks.\nThese include command-and-control infrastructure used by the malware directly linking to DSIRF, a\nDSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF\nbeing used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.\n\n## Observed actor activity\n\n### KNOTWEED initial access\n\nMSTIC found KNOTWEED’s Subzero malware deployed in a variety of ways. In the succeeding\nsections, the different stages of Subzero are referred to by their Microsoft Defender detection names:\n_Jumplump for the persistent loader and Corelump for the main malware._\n\n**KNOTWEED exploits in 2022**\n\nIn May 2022, MSTIC found an Adobe Reader remote code execution (RCE) and a 0-day Windows\nprivilege escalation exploit chain being used in an attack that led to the deployment of Subzero. The\nexploits were packaged into a PDF document that was sent to the victim via email. Microsoft was not\nable to acquire the PDF or Adobe Reader RCE portion of the exploit chain, but the victim’s Adobe\nReader version was released in January 2022, meaning that the exploit used was either a 1-day exploit\ndeveloped between January and May, or a 0-day exploit. Based on KNOTWEED’s extensive use of\nother 0-days, we assess with medium confidence that the Adobe Reader RCE is a 0-day exploit. The\nWindows exploit was analyzed by MSRC, found to be a 0-day exploit, and then patched in July 2022 as\n\n\n-----\n\nCVE-2022-22047. Interestingly, there were indications in the Windows exploit code that it was also\ndesigned to be used from Chromium-based browsers, although we’ve seen no evidence of browserbased attacks.\n\n[The CVE-2022-22047 vulnerability is related to an issue with activation context caching in the Client](https://docs.microsoft.com/windows/win32/sbscs/activation-contexts)\nServer Run-Time Subsystem (CSRSS) on Windows. At a high level, the vulnerability could enable an\nattacker to provide a crafted assembly manifest, which would create a malicious activation context in\nthe activation context cache, for an arbitrary process. This cached context is used the next time the\nprocess spawned.\n\nCVE-2022-22047 was used in KNOTWEED related attacks for privilege escalation. The vulnerability\nalso provided the ability to escape sandboxes (with some caveats, as discussed below) and achieve\nsystem-level code execution. The exploit chain starts with writing a malicious DLL to disk from the\nsandboxed Adobe Reader renderer process. The CVE-2022-22047 exploit was then used to target a\nsystem process by providing an application manifest with an undocumented attribute that specified the\npath of the malicious DLL. Then, when the system process next spawned, the attribute in the malicious\nactivation context was used, the malicious DLL was loaded from the given path, and system-level code\nexecution was achieved.\n\nIt’s important to note that exploiting CVE-2022-22047 requires attackers to be able to write a DLL to\ndisk. However, in the threat model of sandboxes, such as that of Adobe Reader and Chromium, the\nability to write out files where the attacker cannot control the path isn’t considered dangerous. Hence,\nthese sandboxes aren’t a barrier to the exploitation of CVE-2022-22047.\n\n**KNOTWEED exploits in 2021**\n\n[In 2021, MSRC received a report of two Windows privilege escalation exploits (CVE-2021-31199 and](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-31199)\n[CVE-2021-31201) being used in conjunction with an Adobe Reader exploit (CVE-2021-28550), all of](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-31201)\nwhich were patched in June 2021. MSTIC was able to confirm the use of these in an exploit chain used\nto deploy Subzero.\n\nWe were later able to link the deployment of Subzero to a fourth exploit, one related to a Windows\n[privilege escalation vulnerability in the Windows Update Medic Service (CVE-2021-36948), which](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36948)\nallowed an attacker to force the service to load an arbitrary signed DLL. The malicious DLL used in the\nattacks was signed by ‘DSIRF GmbH’.\n\nFigure 1. Valid digital signature from DSIRF on\n\nMedic Service exploit DLL\n\n\n-----\n\n**Malicious Excel documents**\n\nIn addition to the exploit chains, another method of access that led to the deployment of Subzero was\nan Excel file masquerading as a real estate document. The file contained a malicious macro that was\nobfuscated with large chunks of benign comments from the Kama Sutra, string obfuscation, and use of\nExcel 4.0 macros.\n\nFigure 2: Two examples of KNOTWEED Excel macro obfuscation\nAfter de-obfuscating strings at runtime, the VBA macro uses the ExecuteExcel4Macro function to call\nnative Win32 functions to load shellcode into memory allocated using VirtualAlloc. Each opcode is\nindividually copied into a newly allocated buffer using memset before CreateThread is called to execute\nthe shellcode.\n\nFigure 3: Copying opcodes\n\nFigure 4: Calling CreateThread on shellcode\nThe following section describes the shellcode executed by the macro.\n\n### KNOTWEED malware and tactics, techniques, and procedures (TTPs)\n\n**Corelump downloader and loader shellcode**\n\nThe downloader shellcode is the initial shellcode executed from either the exploit chains or malicious\nExcel documents. The shellcode’s purpose is to retrieve the Corelump second-stage malware from the\nactor’s command-and-control (C2) server. The downloader shellcode downloads a JPEG image that\ncontains extra encrypted data appended to the end of the file (past the 0xFF 0xD9 marker that signifies\nthe end of a JPEG file). The JPEG is then written to the user’s %TEMP% directory.\n\n\n-----\n\nFigure 5: One of the images embedded with the\n\nloader shellcode and Corelump\nThe downloader shellcode searches for a 16-byte marker immediately following the end of JPEG. After\nfinding the marker, the downloader shellcode RC4 decrypts the loader shellcode using the next 16\nbytes as the RC4 key. Finally, the loader shellcode RC4 decrypts the Corelump malware using a\nsecond RC4 key and manually loads it into memory.\n\n**Corelump malware**\n\n_Corelump is the main payload and resides exclusively in memory to evade detection. It contains a_\nvariety of capabilities including keylogging, capturing screenshots, exfiltrating files, running a remote\nshell, and running arbitrary plugins downloaded from KNOTWEED’s C2 server.\n\nAs part of installation, Corelump makes copies of legitimate Windows DLLs and overwrites sections of\nthem with malicious code. As part of this process, Corelump also modifies the fields in the PE header to\naccommodate the nefarious changes, such as adding new exported functions, disabling Control Flow\nGuard, and modifying the image file checksum with a computed value from CheckSumMappedFile.\nThese trojanized binaries (Jumplump) are dropped to disk in\n_C:\\Windows\\System32\\spool\\drivers\\color\\, and COM registry keys are modified for persistence (see_\nthe Behaviors section for more information on COM hijacking).\n\n**Jumplump loader**\n\n_Jumplump is responsible for loading Corelump into memory from the JPEG file in the %TEMP%_\ndirectory. If Corelump is not present, Jumplump attempts to download it again from the C2 server. Both\n_Jumplump and the downloader shellcode are heavily obfuscated to make analysis difficult, with most_\ninstructions being followed by a jmp to another instruction/jmp combination, giving a convoluted control\nflow throughout the program.\n\n\n-----\n\nFigure 6: Disassembly\n\nshowing the jmp/instruction obfuscation used in Jumplump\n\n**Mex and PassLib**\n\nKNOTWEED was also observed using the bespoke utility tools Mex and PassLib. These tools are\ndeveloped by KNOTWEED and bear capabilities that are derived from publicly available sources. Mex,\nfor example, is a command-line tool containing several red teaming or security plugins copied from\nGitHub (listed below):\n\n[Chisel](https://github.com/jpillora/chisel) [mimikatz](https://github.com/ParrotSec/mimikatz) [SharpHound3](https://github.com/BloodHoundAD/SharpHound3)\n\n[Curl](https://github.com/curl/curl) [Ping Castle](https://github.com/vletoux/pingcastle) [SharpOxidResolver](https://github.com/S3cur3Th1sSh1t/SharpOxidResolver)\n\n[Grouper2](https://github.com/l0ss/Grouper2) [Rubeus](https://github.com/GhostPack/Rubeus) [PharpPrinter](https://github.com/rvrsh3ll/SharpPrinter)\n\n[Internal Monologue](https://github.com/eladshamir/Internal-Monologue) [SCShell](https://github.com/Mr-Un1k0d3r/SCShell) [SpoolSample](https://github.com/leechristensen/SpoolSample)\n\n[Inveigh](https://github.com/Kevin-Robertson/Inveigh) [Seatbelt](https://github.com/GhostPack/Seatbelt) [StandIn](https://github.com/FuzzySecurity/StandIn)\n\n[Lockless](https://github.com/GhostPack/Lockless) [SharpExec](https://github.com/anthemtotheego/SharpExec)\n\nPassLib is a custom password stealer tool capable of dumping credentials from a variety of sources\nincluding web browsers, email clients, LSASS, LSA secrets, and the Windows credential manager.\n\n**Post-compromise actions**\n\nIn victims where KNOTWEED malware had been used, a variety of post-compromise actions were\nobserved:\n\nSetting of UseLogonCredential to “1” to enable plaintext credentials:\n\n_reg add HKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest /v_\n_UseLogonCredential /t REG_DWORD /d 1 /f_\n\nCredential dumping via comsvcs.dll:\n\n_rundll32.exe C:\\Windows\\System32\\comsvcs.dll, MiniDump_\n\nAttempt to access emails with dumped credentials from a KNOTWEED IP address\nUsing Curl to download KNOTWEED tooling from public file shares such as vultrobjects[.]com\nRunning PowerShell scripts directly from a GitHub gist created by an account associated with\nDSIRF\n\n\n-----\n\n### KNOTWEED infrastructure connections to DSIRF\n\nPivoting off a known command-and-control domain identified by MSTIC, acrobatrelay[.]com, RiskIQ\nexpanded the view of KNOTWEED’s attack infrastructure. Leveraging unique patterns in the use of SSL\ncertificates and other network fingerprints specific to the group and associated with that domain, RiskIQ\nidentified a host of additional IP addresses under the control of KNOTWEED. This infrastructure,\nlargely hosted by Digital Ocean and Choopa, has been actively serving malware since at least February\nof 2020 and continues through the time of this writing.\n\nRiskIQ next utilized passive DNS data to determine which domains those IPs resolved to at the time\nthey were malicious. This process yielded several domains with direct links to DSIRF, including\n_demo3[.]dsirf[.]eu (the company’s own website), and several subdomains that appear to have been_\nused for malware development, including debugmex[.]dsirflabs[.]eu (likely a server used for debugging\nmalware with the bespoke utility tool Mex) and szstaging[.]dsirflabs[.]eu (likely a server used to stage\nSubzero malware).\n\n## Detection and prevention\n\nMicrosoft will continue to monitor KNOTWEED activity and implement protections for our customers.\nThe current detections and IOCs detailed below are in place and protecting Microsoft customers across\nour security products. Additional advanced hunting queries are also provided below to help\norganizations extend their protections and investigations of these attacks.\n\n### Behaviors\n\n_Corelump drops the Jumplump loader DLLs to C:\\Windows\\System32\\spool\\drivers\\color\\. This is a_\ncommon directory used by malware as well as some legitimate programs, so writes of PE files to the\nfolder should be monitored.\n\n_Jumplump uses COM hijacking for persistence, modifying COM registry keys to point to the Jumplump_\nDLL in C:\\Windows\\System32\\spool\\drivers\\color\\. Modifications of default system CLSID values should\nbe monitored to detect this technique (e.g., HKLM\\SOFTWARE\\Classes\\CLSID\\{GUID}\\InProcServer32\n_Default value). The five CLSIDs used by Jumplump are listed below with their original clean values on_\nWindows 11:\n\n{ddc05a5a-351a-4e06-8eaf-54ec1bc2dcea} = “%SystemRoot%\\System32\\ApplicationFrame.dll“\n{1f486a52-3cb1-48fd-8f50-b8dc300d9f9d} = “%SystemRoot%\\system32\\propsys.dll“\n{4590f811-1d3a-11d0-891f-00aa004b2e24} = “%SystemRoot%\\system32\\wbem\\wbemprox.dll“\n{4de225bf-cf59-4cfc-85f7-68b90f185355} = “%SystemRoot%\\system32\\wbem\\wmiprvsd.dll“\n{F56F6FDD-AA9D-4618-A949-C1B91AF43B1A} = “%SystemRoot%\\System32\\Actioncenter.dll“\n\nMany of the post-compromise actions can be detected based on their command lines. Customers\nshould monitor for possible malicious activity such as PowerShell executing scripts from internet\nlocations, modification of commonly abused registry keys such as\n_HKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest, and LSASS credential dumping_\nvia minidumps.\n\n## Recommended customer actions\n\n\n-----\n\nThe techniques used by the actor and described in the Observed actor activity section can be mitigated\nby adopting the security considerations provided below:\n\n[All customers should prioritize patching of CVE-2022-22047.](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-22047)\nConfirm that Microsoft Defender Antivirus is updated to security intelligence update 1.371.503.0\nor later to detect the related indicators.\nUse the included indicators of compromise to investigate whether they exist in your environment\nand assess for potential intrusion.\n[Change Excel macro security settings to control which macros run and under what circumstances](https://support.microsoft.com/office/change-macro-security-settings-in-excel-a97c09d2-c082-46b8-b19f-e8621e8fe373)\n[when you open a workbook. Customers can also stop malicious XLM or VBA macros by ensuring](https://www.microsoft.com/security/blog/2021/03/03/xlm-amsi-new-runtime-defense-against-excel-4-0-macro-malware/)\n[runtime macro scanning by Antimalware Scan Interface (AMSI) is on. This feature—enabled by](https://docs.microsoft.com/windows/win32/amsi/antimalware-scan-interface-portal)\ndefault—is on if the Group Policy setting for Macro Run Time Scan Scope is set to “Enable for All\nFiles” or “Enable for Low Trust Files”.\nEnable multifactor authentication (MFA) to mitigate potentially compromised credentials and\nensure that MFA is enforced for all remote connectivity. Note: Microsoft strongly encourages all\n[customers download and use password-less solutions like Microsoft Authenticator to secure](https://www.microsoft.com/account/authenticator/)\naccounts.\nReview all authentication activity for remote access infrastructure, with a particular focus on\naccounts configured with single factor authentication, to confirm authenticity and investigate any\nanomalous activity.\n\n## Indicators of compromise (IOCs)\n\nThe following list provides IOCs observed during our investigation. We encourage our customers to\ninvestigate these indicators in their environments and implement detections and protections to identify\npast related activity and prevent future attacks against their systems. All sample hashes are available in\nVirusTotal.\n\n**Indicator** **Type** **Description**\n\n\n78c255a98003a101fa5ba3f49c50c6922b52ede601edac5db036ab72efc57629 SHA256\n\n0588f61dc7e4b24554cffe4ea56d043d8f6139d2569bc180d4a77cf75b68792f SHA256\n\n441a3810b9e89bae12eea285a63f92e98181e9fb9efd6c57ef6d265435484964 SHA256\n\ncbae79f66f724e0fe1705d6b5db3cc8a4e89f6bdf4c37004aa1d45eeab26e84b SHA256\n\nfd6515a71530b8329e2c0104d0866c5c6f87546d4b44cc17bbb03e64663b11fc SHA256\n\n5d169e083faa73f2920c8593fb95f599dad93d34a6aa2b0f794be978e44c8206 SHA256\n\n\nMalicious\nExcel\ndocument\nand VBA\n\nMalicious\nExcel\ndocument\nand VBA\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nJumplump\nmalware\n\n\n-----\n\n**Indicator** **Type** **Description**\n\n\n7f29b69eb1af1cc6c1998bad980640bfe779525fd5bb775bc36a0ce3789a8bfc SHA256\n\n02a59fe2c94151a08d75a692b550e66a8738eb47f0001234c600b562bf8c227d SHA256\n\n7f84bf6a016ca15e654fb5ebc36fd7407cb32c69a0335a32bfc36cb91e36184d SHA256\n\nafab2e77dc14831f1719e746042063a8ec107de0e9730249d5681d07f598e5ec SHA256\n\n894138dfeee756e366c65a197b4dbef8816406bc32697fac6621601debe17d53 SHA256\n\n4611340fdade4e36f074f75294194b64dcf2ec0db00f3d958956b4b0d6586431 SHA256\n\nc96ae21b4cf2e28eec222cfe6ca903c4767a068630a73eca58424f9a975c6b7d SHA256\n\nfa30be45c5c5a8f679b42ae85410f6099f66fe2b38eb7aa460bcc022babb41ca SHA256\n\ne64bea4032cf2694e85ede1745811e7585d3580821a00ae1b9123bb3d2d442d6 SHA256\n\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nJumplump\nmalware\n\nCorelump\nmalware\n\nMex tool\n\nPasslib tool\n\n\nacrobatrelay[.]com Domain C2\n\nfinconsult[.]cc Domain C2\n\nrealmetaldns[.]com Domain C2\n\n**NOTE: These indicators should not be considered exhaustive for this observed activity.**\n\n## Detections\n\n### Microsoft Defender Antivirus\n\nMicrosoft Defender Antivirus detects the malware tools and implants used by KNOTWEED starting with\nsignature build 1.371.503.0 as the following family names:\n\n_Backdoor:O97M/JumplumpDropper_\n_Trojan:Win32/Jumplump_\n_Trojan:Win32/Corelump_\n_HackTool:Win32/Mexlib_\n_Trojan:Win32/Medcerc_\n_Behavior:Win32/SuspModuleLoad_\n\n### Microsoft Defender for Endpoint\n\n\n-----\n\nMicrosoft Defender for Endpoint customers may see the following alerts as an indication of a possible\nattack. These alerts are not necessarily an indication of KNOTWEED compromise:\n\n_COM Hijacking – Detects multiple behaviors, including JumpLump malware persistence_\ntechniques.\n_Possible privilege escalation using CTF module – Detects a possible privilege escalation behavior_\nassociated with CVE-2022-2204; also detects an attempt to perform local privilege escalation by\nlaunching an elevated process and loading an untrusted module to perform malicious activities\n_KNOTWEED actor activity detected – Detects KNOTWEED actor activities_\n_WDigest configuration change – Detects potential retrieval of clear text password from changes to_\n_UseLogonCredential registry key_\n_Sensitive credential memory read – Detects LSASS credential dumping via minidumps_\n_Suspicious Curl behavior – Detects the use of Curl to download KNOTWEED tooling from public_\nfile shares\n_Suspicious screen capture activity – Detects Corelump behavior of capturing screenshots of the_\ncompromised system\n\n## Hunting queries\n\n### Microsoft Sentinel\n\nThe following resources are available to Microsoft Sentinel customers to identify the activity outlined in\nthe blog post.\n\n**Microsoft Defender Antivirus detections related to KNOTWEED**\n\nThis query identifies occurrences of Microsoft Defender Antivirus detections listed in this blog post:\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/MultipleDataSources/KNOTWEEDAVDetection.yaml\n\n**File hash IOCs related to KNOTWEED**\n\nThis query identifies matches based on file hash IOCs related to KNOTWEED across a range of\ncommon Microsoft Sentinel data sets:\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/MultipleDataSources/KNOTWEEDFileHashesJuly2022.yaml\n\n**Domain IOCs related to KNOTWEED**\n\nThis query identifies matches based on domain IOCs related to KNOTWEED across a range of\ncommon Microsoft Sentinel data sets:\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/MultipleDataSources/KNOTWEEDC2DomainsJuly2022.yaml\n\n**COM registry key modified to point to Color Profile folder**\n\n\n-----\n\nThis query identifies modifications to COM registry keys to point to executable files in\n_C:\\Windows\\System32\\spool\\drivers\\color\\:_\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Detections/MultipleDataSources/COMRegistryKeyModifiedtoPointtoFileinColorDri](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/COMRegistryKeyModifiedtoPointtoFileinColorDrivers.yaml)\nvers.yaml\n\n**PE file dropped in Color Profile folder**\n\nThis query looks for PE files being created in the C:\\Windows\\System32\\spool\\drivers\\color\\ folder:\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/DeviceFileEvents/PEfiledroppedinColorDriversFolder.yaml\n\n**Abnormally large JPEG downloaded from new source**\n\nThis query looks for downloads of JPEG files from remote sources, where the file size is abnormally\nlarge, and not from a common source:\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/AbnormallyLargeJPEGFiledDownloade](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/AbnormallyLargeJPEGFiledDownloadedfromNewSource.yaml)\ndfromNewSource.yaml\n\n**Downloading new file using Curl**\n\nThis query looks for new files being downloaded using Curl.\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Hunting%20Queries/MultipleDataSources/DownloadofNewFileUsingCurl.yaml\n\n**Suspected credential dumping**\n\nThis query looks for attackers using comsvcs.dll to dump credentials from memory\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Hunting%20Queries/SecurityEvent/SuspectedLSASSDump.yaml\n\n**Downgrade to plaintext credentials**\n\nThis query looks for registry key being set to enabled plain text credentials\n\nhttps://github.com/Azure/AzureSentinel/blob/master/Detections/SecurityEvent/WDigestDowngradeAttack.yaml\n\n### Microsoft 365 Defender advanced hunting\n\nMicrosoft 365 Defender customers can run the following advanced hunting queries to locate IOCs and\nrelated malicious activity in their environments.\n\n**Microsoft Defender Antivirus detections related to KNOTWEED**\n\nThis query identifies detection of related malware and tools by Microsoft Defender Antivirus:\n\n\n-----\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KN](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KNOTWEED-AVDetections.yaml)\nOTWEED-AVDetections.yaml\n\n**File hash IOCs related to KNOTWEED**\n\nThis query surfaces KNOTWEED file hash IOCs across Microsoft Defender for Endpoint tables:\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KN](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KNOTWEED-FileHashIOCsJuly2022.yaml)\nOTWEED-FileHashIOCsJuly2022.yaml\n\n**Domain IOCs related to KNOTWEED**\n\nThis query identifies matches based on domain IOCs related to KNOTWEED against Microsoft\nDefender for Endpoint device network connections:\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KN](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KNOTWEED-DomainIOCsJuly2022.yaml)\nOTWEED-DomainIOCsJuly2022.yaml\n\n**COM registry key modified to point to Color Profile folder**\n\nThis query identifies modifications to COM registry keys to point to executable files in\n_C:\\Windows\\System32\\spool\\drivers\\color\\:_\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KN](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KNOTWEED-COMRegistryKeyModifiedtoPointtoColorProfileFolder.yaml)\nOTWEED-COMRegistryKeyModifiedtoPointtoColorProfileFolder.yaml\n\n**PE file dropped in Color Profile folder**\n\nThis query looks for PE files being created in the C:\\Windows\\System32\\spool\\drivers\\color\\ folder:\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KN](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KNOTWEED-PEFileDroppedinColorProfileFolder.yaml)\nOTWEED-PEFileDroppedinColorProfileFolder.yaml\n\n**Downloading new file using Curl**\n\nThis query looks for new files being downloaded using Curl.\n\nhttps://github.com/Azure/Azure[Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KN](https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Campaigns/KNOTWEED/KNOTWEED-DownloadingnewfileusingCurl.yaml)\nOTWEED-DownloadingnewfileusingCurl.yaml\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-27 - Untangling KNOTWEED- European private-sector offensive actor using 0-day exploits.pdf"
    ],
    "report_names": [
        "2022-07-27 - Untangling KNOTWEED- European private-sector offensive actor using 0-day exploits.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8e3cc644-b09e-4ed2-bdf8-b836e4f21319",
            "created_at": "2024-02-02T02:00:04.014083Z",
            "updated_at": "2025-03-27T02:00:03.288837Z",
            "deleted_at": null,
            "main_name": "Denim Tsunami",
            "aliases": [
                "DSIRF"
            ],
            "source_name": "MISPGALAXY:Denim Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536023,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1660795362,
    "ts_modification_date": 1660795362,
    "files": {
        "pdf": "https://archive.orkl.eu/7e3fc106cbcc18c6c361c1d4d89026225e9736ae.pdf",
        "text": "https://archive.orkl.eu/7e3fc106cbcc18c6c361c1d4d89026225e9736ae.txt",
        "img": "https://archive.orkl.eu/7e3fc106cbcc18c6c361c1d4d89026225e9736ae.jpg"
    }
}