{
    "id": "1abf8917-94ed-480f-b69d-745d081c3c05",
    "created_at": "2023-01-12T15:01:40.171628Z",
    "updated_at": "2025-03-27T02:05:43.091041Z",
    "deleted_at": null,
    "sha1_hash": "65aebbc9dad5b5e6ff590c14427d64638c1aa3ae",
    "title": "2021-06-01 - Critical 0-day in Fancy Product Designer Under Active Attack",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:01Z",
    "file_modification_date": "2022-05-28T01:22:01Z",
    "file_size": 550747,
    "plain_text": "# Critical 0-day in Fancy Product Designer Under Active Attack\n\n**[wordfence.com/blog/2021/06/critical-0-day-in-fancy-product-designer-under-active-attack/](https://www.wordfence.com/blog/2021/06/critical-0-day-in-fancy-product-designer-under-active-attack/)**\n\nJune 1, 2021\n\n_Update: A patched version of Fancy Product Designer, 4.6.9, is now available as of June 2,_\n_2021. This article has been updated to reflect newly available information, including_\n_Indicators of Compromise._\n\nOn May 31, 2021, the Wordfence Threat Intelligence team discovered a critical file upload\nvulnerability being actively exploited in Fancy Product Designer, a WordPress plugin installed\non over 17,000 sites.\nWe initiated contact with the plugin’s developer the same day and received a response within\n24 hours. We sent over the full disclosure the same day we received a response, on June 1,\n2021. Due to this vulnerability being actively attacked, we are publicly disclosing with minimal\ndetails until users have time to update to the patched version in order to alert the community\nto take precautions to keep their sites protected.\n\nWhile the Wordfence Firewall’s built-in file upload protection sufficiently blocks the majority of\nattacks against this vulnerability, we determined that a bypass was possible in some\nconfigurations. As such, we released a new firewall rule to our premium customers on May\n31, 2021. Sites still running the free version of Wordfence will receive the rule after 30 days,\non June 30, 2021.\n\n\n-----\n\nAs this is a Critical 0-day under active attack and is exploitable in some configurations even if\nthe plugin has been deactivated, we urge anyone using this plugin to update to the latest\nversion available, 4.6.9, immediately.\n\n**Description: Unauthenticated Arbitrary File Upload and Remote Code Execution**\n**Affected Plugin: Fancy Product Designer**\n**Plugin Slug:** [fancy-product-designer](https://codecanyon.net/item/fancy-product-designer-woocommercewordpress/6318393)\n**Affected Versions: < 4.6.9**\n**CVE ID: CVE-2021-24370**\n**CVSS Score: 9.8 (Critical)**\n**CVSS Vector:** [CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H](https://www.first.org/cvss/calculator/3.1#CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H)\n**Researcher/s: Charles Sweethill/Ram Gall**\n**Fully Patched Version: 4.6.9**\nFancy Product Designer is a WordPress plugin that offers the ability for customers to upload\nimages and PDF files to be added to products. Unfortunately, while the plugin had some\nchecks in place to prevent malicious files from being uploaded, these checks were\ninsufficient and could easily be bypassed, allowing attackers to upload executable PHP files\nto any site with the plugin installed. This effectively made it possible for any attacker to\nachieve Remote Code Execution on an impacted site, allowing full site takeover.\n\nWe will provide a more detailed technical explanation of the vulnerability once more users\nhave updated to a patched version.\n\n## How do I update?\n\nIn most cases you will need to login to codecanyon.net. Once you are logged in, you should\nbe able to visit the product page at https://codecanyon.net/item/fancy-product-designerwoocommercewordpress/6318393. In the Overview sidebar on the right-hand side of the\nproduct page you should see a Download link:\n\nOnce you have downloaded the patched version of the plugin, you should be able to login to\nyour WordPress site and go to Plugins->Add New->Upload Plugin to upload the patched\nplugin.\n\n\n-----\n\n## Indicators of Compromise\n\nIn most cases a successful attack results in a number of files which will appear in a subfolder\nof either\n```\nwp-admin\n\n```\nor\n```\nwp-content/plugins/fancy-product-designer/inc\n\n```\nwith the date the file was uploaded. For instance:\n```\nwp-content/plugins/fancy-productdesigner/inc/2021/05/30/4fa00001c720b30102987d980e62d5e4.php\n\n```\nor\n\n```\nwp-admin/2021/05/31/4fa00001c720b30102987d980e62d5e4.php\n\n```\n\n_Update – the filenames in question are deterministic and we have added filenames_\n_associated with this vulnerability._\nThe following filenames and MD5 hashes are associated with this attack:\n```\nass.php – MD5 3783701c82396cc96d842839a291e813 . This is the initial payload, a\n\n```\ndropper that then retrieves additional malware from a 3rd party site.\n```\nop.php – MD5 29da9e97d5efe5c9a8680c7066bb2840 . A password-protected Webshell.\nprosettings.php – MD5 e6b9197ecdc61125a4e502a5af7cecae . A Webshell found in\n\n```\nolder infections.\n```\n4fa00001c720b30102987d980e62d5e4.php – MD5\n4329689c76ccddd1d2f4ee7fef3dab71 . This payload decodes and loads a separate\n\n```\nWebshell.\n```\n4fa00001c720b30002987d983e62d5e1.jpg – MD5\nc8757b55fc7d456a7a1a1aa024398471 . The compressed webshell loaded by\n4fa00001c720b30102987d980e62d5e4.php . Cannot be executed without the loader script.\n\n```\nThe majority of attacks against this vulnerability are coming from the following IP addresses:\n```\n69.12.71.82\n92.53.124.123\n46.53.253.152\n\n```\nThis attacker appears to be targeting e-commerce sites and attempting to extract order\ninformation from site databases. As this order information contains personally identifiable\ninformation from customers, site owners are in a particularly difficult position if they are still\nrunning vulnerable versions of this plugin as it risks the e-commerce merchant’s PCI-DSS\ncompliance.\n\n\n-----\n\nOur research indicates that this vulnerability is likely not being attacked on a large scale but\nhas been exploited since at least May 16, 2021. Update: Our Threat Intelligence Team has\n_now found evidence of this vulnerability being exploited as early as January 30, 2021._\n\n## Timeline\n\n**May 31, 2021 15:05 UTC – Wordfence Security Analyst Charles Sweethill finds evidence of**\na previously unknown vulnerability during malware removal and forensic investigation as part\nof a [site cleaning and begins investigating possible attack vectors.](https://www.wordfence.com/wordfence-site-cleanings/?promo_id=blog20210601&promo_name=get-site-clean&promo_creative=txt&promo_position=conclusion)\n\n**May 31, 2021 15:45 UTC – Charles notifies the Wordfence Threat Intelligence team and a**\nfull investigation begins.\n\n**May 31, 2021 16:20 UTC – We develop an initial proof of concept and begin work on a**\nfirewall rule.\n\n**May 31, 2021 17:06 UTC – We initiate contact with the plugin developer.**\n\n**May 31, 2021 18:59 UTC – We release the firewall rule protecting against this vulnerability to**\nWordfence Premium customers.\n\n**June 1, 2021 09:03 UTC – The plugin developer responds to our initial contact.**\n\n**June 1, 2021 13:35 UTC – We send over full disclosure.**\n\n**June 2, 2021 – The plugin developer releases a patched version, 4.6.9, of the plugin.**\n\n**June 30, 2021 – Firewall rule becomes available to free Wordfence users.**\n\n## Conclusion\n\nIn today’s article, we covered a critical 0-day vulnerability in Fancy Product Designer that is\nbeing actively attacked and used to upload malware onto sites that have the plugin installed.\n\n[While Wordfence Premium users should be protected against this vulnerability, we urge any](https://www.wordfence.com/wordfence-signup/?promo_id=blog20210601&promo_name=get-premium&promo_creative=txt&promo_position=conclusion)\nusers of this plugin to update to the latest version of the plugin, 4.6.9, immediately, as it is\npossible in some configurations to exploit the vulnerability even if the plugin is deactivated.\n\nWe will continue to monitor the situation and follow up as more information becomes\navailable.\n\n_Special Thanks to Wordfence Security Analyst Charles Sweethill for discovering the_\n_vulnerability, determining the most likely vectors and indicators of compromise, and testing_\n_the firewall rule during a holiday. We also wanted to extend kudos the the plugin developer,_\n_radykal for quickly developing a patch for this issue._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-01 - Critical 0-day in Fancy Product Designer Under Active Attack.pdf"
    ],
    "report_names": [
        "2021-06-01 - Critical 0-day in Fancy Product Designer Under Active Attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535700,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653700921,
    "ts_modification_date": 1653700921,
    "files": {
        "pdf": "https://archive.orkl.eu/65aebbc9dad5b5e6ff590c14427d64638c1aa3ae.pdf",
        "text": "https://archive.orkl.eu/65aebbc9dad5b5e6ff590c14427d64638c1aa3ae.txt",
        "img": "https://archive.orkl.eu/65aebbc9dad5b5e6ff590c14427d64638c1aa3ae.jpg"
    }
}