{
    "id": "1b2cc8ca-3e5b-404b-aef5-ac91cef2ab9b",
    "created_at": "2023-01-12T15:09:06.383671Z",
    "updated_at": "2025-03-27T02:17:22.96927Z",
    "deleted_at": null,
    "sha1_hash": "d2f288e8bbf816a39755a24140962dd83e9df271",
    "title": "2021-02-17 - Alert (AA21-048A)- AppleJeus- Analysis of North Korea’s Cryptocurrency Malware",
    "authors": "",
    "file_creation_date": "2022-05-29T01:06:16Z",
    "file_modification_date": "2022-05-29T01:06:16Z",
    "file_size": 521485,
    "plain_text": "# AppleJeus: Analysis of North Korea’s Cryptocurrency Malware\n\n**us-cert.cisa.gov/ncas/alerts/aa21-048a**\n\n## Summary\n\n_This Advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge_\n_(ATT&CK®) framework. See the_ _[ATT&CK for Enterprise for all referenced threat actor tactics](https://attack.mitre.org/versions/v8/techniques/enterprise/)_\n_and techniques._\n\nThis joint advisory is the result of analytic efforts among the Federal Bureau of Investigation\n(FBI), the Cybersecurity and Infrastructure Security Agency (CISA), and the Department of\nTreasury (Treasury) to highlight the cyber threat to cryptocurrency posed by North Korea,\nformally known as the Democratic People’s Republic of Korea (DPRK), and provide\nmitigation recommendations. Working with U.S. government partners, FBI, CISA, and\nTreasury assess that Lazarus Group—which these agencies attribute to North Korean statesponsored advanced persistent threat (APT) actors—is targeting individuals and companies,\nincluding cryptocurrency exchanges and financial service companies, through the\ndissemination of cryptocurrency trading applications that have been modified to include\nmalware that facilitates theft of cryptocurrency.\n\nThese cyber actors have targeted organizations for cryptocurrency theft in over 30 countries\nduring the past year alone. It is likely that these actors view modified cryptocurrency trading\napplications as a means to circumvent international sanctions on North Korea—the\napplications enable them to gain entry into companies that conduct cryptocurrency\ntransactions and steal cryptocurrency from victim accounts. As highlighted in FASTCash 2.0:\nNorth Korea's BeagleBoyz Robbing Banks and [Guidance on the North Korean Cyber Threat,](https://us-cert.cisa.gov/ncas/alerts/aa20-106a)\nNorth Korea’s state-sponsored cyber actors are targeting cryptocurrency exchanges and\n[accounts to steal and launder hundreds of millions of dollars in cryptocurrency.[1][2][3] The](https://us-cert.cisa.gov/ncas/alerts/aa20-239a)\nU.S. Government refers to malicious cyber activity by the North Korean government as\nHIDDEN COBRA. For more information on HIDDEN COBRA activity, visit https://www.uscert.cisa.gov/northkorea.\n\nThe U.S. Government has identified malware and indicators of compromise (IOCs) used by\nthe North Korean government to facilitate cryptocurrency thefts; the cybersecurity community\nrefers to this activity as “AppleJeus.” This report catalogues AppleJeus malware in detail.\nNorth Korea has used AppleJeus malware posing as cryptocurrency trading platforms since\nat least 2018. In most instances, the malicious application—seen on both Windows and Mac\noperating systems—appears to be from a legitimate cryptocurrency trading company, thus\nfooling individuals into downloading it as a third-party application from a website that seems\n\n\n-----\n\nlegitimate. In addition to infecting victims through legitimate-looking websites, HIDDEN\nCOBRA actors also use phishing, social networking, and social engineering techniques to\nlure users into downloading the malware.\n\nRefer to the following Malware Analysis Reports (MARs) for full technical details of\nAppleJeus malware and associated IOCs.\n\n[Click here for a PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/publications/Joint_Cybersecurity_Advisory_AppleJeus%E2%80%93Analysis%20of%20North%20Korea%E2%80%99s%20Cryptocurrency%20Malware.pdf)\n\n## Technical Details\n\nThe North Korean government has used multiple versions of AppleJeus since the malware\nwas initially discovered in 2018. This section outlines seven of the versions below. The\nMARs listed above provide further technical details of these versions. Initially, HIDDEN\nCOBRA actors used websites that appeared to host legitimate cryptocurrency trading\nplatforms to infect victims with AppleJeus; however, these actors are now also using other\ninitial infection vectors, such as phishing, social networking, and social engineering\ntechniques, to get users to download the malware.\n\n## Targeted Nations\n\nHIDDEN COBRA actors have targeted institutions with AppleJeus malware in several\nsectors, including energy, finance, government, industry, technology, and\ntelecommunications. Since January 2020, the threat actors have targeted these sectors in\nthe following countries: Argentina, Australia, Belgium, Brazil, Canada, China, Denmark,\nEstonia, Germany, Hong Kong, Hungary, India, Ireland, Israel, Italy, Japan, Luxembourg,\nMalta, the Netherlands, New Zealand, Poland, Russia, Saudi Arabia, Singapore, Slovenia,\nSouth Korea, Spain, Sweden, Turkey, the United Kingdom, Ukraine, and the United States\n(figure 1).\n\n\n-----\n\n_Figure 1: Countries targeted with AppleJeus by HIDDEN COBRA threat actors since 2020_\n\n## AppleJeus Versions Note\n\nThe version numbers used for headings in this document correspond to the order the\nAppleJeus campaigns were identified in open source or through other investigative means.\nThese versions may or may not be in the correct order to develop or deploy the AppleJeus\ncampaigns.\n\n## AppleJeus Version 1: Celas Trade Pro\n\n**Introduction and Infrastructure**\n\nIn August 2018, open-source reporting disclosed information about a trojanized version of a\nlegitimate cryptocurrency trading application on an undisclosed victim’s computer. The\nmalicious program, known as Celas Trade Pro, was a modified version of the benign Q.T.\nBitcoin Trader application. This incident led to the victim company being infected with a\nRemote Administration Tool (RAT) known as FALLCHILL, which was attributed to North\nKorea (HIDDEN COBRA) by the U.S. Government. FALLCHILL is a fully functional RAT with\nmultiple commands that the adversary can issue from a command and control (C2) server to\ninfected systems via various proxies. FALLCHILL typically infects a system as a file dropped\n[by other HIDDEN COBRA malware (Develop Capabilities: Malware [T1587.001]). Because](https://attack.mitre.org/versions/v8/techniques/T1587/001/)\nof this, additional HIDDEN COBRA malware may be present on systems compromised with\n[FALLCHILL.[4]](https://us-cert.cisa.gov/ncas/alerts/TA17-318A)\n\n\n-----\n\nFurther research revealed that a phishing email from a Celas LLC company (Phishing:\n_Spearphishing Link_ [[T1566.002]) recommended the trojanized cryptocurrency trading](https://attack.mitre.org/versions/v8/techniques/T1566/002/)\napplication to victims. The email provided a link to the Celas’ website, `celasllc[.]com`\n[(Acquire Infrastructure: Domain [T1583.001]), where the victim could download a Windows](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\nor macOS version of the trojanized application.\n\nThe `celasllc[.]com domain resolved to the following Internet Protocol (IP) addresses`\nfrom May 29, 2018, to January 23, 2021.\n```\n   45.199.63[.]220\n   107.187.66[.]103\n   145.249.106[.]19\n   175.29.32[.]160\n   185.142.236[.]213\n   185.181.104[.]82\n   198.251.83[.]27\n   208.91.197[.]46\n   209.99.64[.]18\n\n```\nThe `celasllc[.]com domain had a valid Sectigo (previously known as Comodo) Secure`\n[Sockets Layer (SSL) certificate (Obtain Capabilities: Digital Certificates [T1588.004]). The](https://attack.mitre.org/versions/v8/techniques/T1588/004/)\nSSL certificate was “Domain Control Validated,” a weak security verification level that does\nnot require validation of the owner’s identity or the actual business’s existence.\n\n**Celas Trade Pro Application Analysis**\n\n**_Windows Program_**\n\nThe Windows version of the malicious Celas Trade Pro application is an MSI Installer\n( .msi ). The MSI Installer installation package comprises a software component and an\napplication programming interface (API) that Microsoft uses for the installation, maintenance,\nand removal of software. The installer looks legitimate and is signed by a valid Sectigo\ncertificate that was purchased by the same user as the SSL certificate for celasllc[.]com\n(Obtain Capabilities: Code Signing Certificates [[T1588.003]). The MSI Installer asks the](https://attack.mitre.org/versions/v8/techniques/T1588/003/)\nvictim for administrative privileges to run (User Execution: Malicious File [[T1204.002]).](https://attack.mitre.org/versions/v8/techniques/T1204/002)\n\nOnce permission is granted, the threat actor is able to run the program with elevated\nprivileges (Abuse Elevation Control Mechanism [[T1548]) and MSI executes the following](https://attack.mitre.org/versions/v8/techniques/T1548/)\nactions.\n\nInstalls `CelasTradePro.exe in folder` `C:\\Program Files (x86)\\CelasTradePro`\nInstalls `Updater.exe in folder` `C:\\Program Files (x86)\\CelasTradePro`\nRuns `Updater.exe with the` `CheckUpdate parameters`\n\n\n-----\n\nThe `CelasTradePro.exe program asks for the user s exchange and loads a legitimate-`\nlooking cryptocurrency trading platform—very similar to the benign Q.T. Bitcoin Trader—that\nexhibits no signs of malicious activity.\n\nThe `Updater.exe program has the same program icon as` `CelasTradePro.exe . When`\nrun, it checks for the `CheckUpdate parameter, collects the victim’s host information`\n(System Owner/User Discovery [[T1033]), encrypts the collected information with a](https://attack.mitre.org/versions/v8/techniques/T1033)\nhardcoded XOR encryption, and sends information to a C2 website (Exfiltration Over C2\n_[Channel [T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)_\n\n**_macOS X Program_**\n\nThe macOS version of the malicious application is a DMG Installer that has a disk image\nformat that Apple commonly uses to distribute software over the internet. The installer looks\nlegitimate and has a valid digital signature from Sectigo (Obtain Capabilities: Digital\n_[Certificates [T1588.004]). It has very similar functionality to the Windows version. The](https://attack.mitre.org/versions/v8/techniques/T1588/004/)_\ninstaller executes the following actions.\n\nInstalls `CelasTradePro in folder`\n```\n   /Applications/CelasTradePro.app/Contents/MacOS/\n\n```\nInstalls `Updater in folder` `/Applications/CelasTradePro.app/Contents/MacOS`\nExecutes a `postinstall script`\n\nMoves `.com.celastradepro.plist to folder` `LaunchDaemons`\nRuns `Updater with the` `CheckUpdate parameter`\n```\nCelasTradePro asks for the user’s exchange and loads a legitimate-looking\n\n```\ncryptocurrency trading platform—very similar to the benign Q.T. Bitcoin Trader—that exhibits\nno signs of malicious activity.\n```\nUpdater checks for the CheckUpdate parameter and, when found, it collects the victim’s\n\n```\n[host information (System Owner/User Discovery [T1033]), encrypts the collected information](https://attack.mitre.org/versions/v8/techniques/T1033)\nwith a hardcoded XOR key before exfiltration, and sends the encrypted information to a C2\n[website (Exfiltration Over C2 Channel [T1041]). This process helps the adversary obtain](https://attack.mitre.org/versions/v8/techniques/T1041)\npersistence on a victim’s network.\n\nThe `postinstall script is a sequence of instructions that runs after successfully installing`\nan application (Command and Scripting Interpreter: Unix Shell [[T1059.004]). This script](https://attack.mitre.org/versions/v8/techniques/T1059/004/)\nmoves property list ( plist ) file `.com.celastradepro.plist from the installer package`\nto the `LaunchDaemons folder (Scheduled Task/Job: Launchd` [[T1053.004]). The leading “.”](https://attack.mitre.org/versions/v8/techniques/T1053/004/)\nmakes it unlisted in the Finder app or default Terminal directory listing (Hide Artifacts: Hidden\n_Files and Directories_ [[T1564.001]). Once in the folder, this property list ( plist ) file will](https://attack.mitre.org/versions/v8/techniques/T1564/001/)\nlaunch the `Updater program with the` `CheckUpdate parameter on system load as Root`\nfor every user. Because the `LaunchDaemon will not run automatically after the` `plist file`\n\n\n-----\n\nis moved, the `postinstall script launches the` `Updater program with the`\n```\nCheckUpdate parameter and runs it in the background (Create or Modify System Process:\n\n```\n_[Launch Daemon [T1543.004]).](https://attack.mitre.org/versions/v8/techniques/T1543/004/)_\n\n**_Payload_**\n\nAfter a cybersecurity company published a report detailing the above programs and their\nmalicious extras, the website was no longer accessible. Since this site was the C2 server,\nthe payload cannot be confirmed. The cybersecurity company that published the report\nstates the payload was an encrypted and obfuscated binary (Obfuscated Files or Information\n\n[[T1027]), which eventually drops FALLCHILL onto the machine and installs it as a service](https://attack.mitre.org/versions/v8/techniques/T1027)\n[(Create or Modify System Process: Windows Service [T1543.003]). FALLCHILL malware](https://attack.mitre.org/versions/v8/techniques/T1543/003)\nuses an RC4 encryption algorithm with a 16-byte key to protect its communications\n(Encrypted Channel: Symmetric Cryptography [[T1573.001]). The key employed in these](https://attack.mitre.org/versions/v8/techniques/T1573/001)\n[versions has also been used in a previous version of FALLCHILL.[5][6]](https://us-cert.cisa.gov/ncas/alerts/TA17-318A)\n\n[For more details on AppleJeus Version 1: Celas Trade Pro, see MAR-10322463-1.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048a)\n\n## AppleJeus Version 2: JMT Trading\n\n**Introduction and Infrastructure**\n\nIn October 2019, a cybersecurity company identified a new version of the AppleJeus\nmalware—JMT Trading—thanks to its many similarities to the original AppleJeus malware.\nAgain, the malware was in the form of a cryptocurrency trading application, which a\nlegitimate-looking company, called JMT Trading, marketed and distributed on their website,\n\n`jmttrading[.]org (Acquire Infrastructure: Domain` [[T1583.001]). This website contained a](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\n“Download from GitHub” button, which linked to JMT Trading’s GitHub page (Acquire\n_Infrastructure: Web Services_ [[T1583.006]), where Windows and macOS X versions of the](https://attack.mitre.org/versions/v8/techniques/T1583/006)\nJMT Trader application were available for download (Develop Capabilities: Malware\n\n[[T1587.001]). The GitHub page also included .zip and tar.gz files containing the source code.](https://attack.mitre.org/versions/v8/techniques/T1587/001/)\n\nThe `jmttrading[.]org domain resolved to the following IP addresses from October 15,`\n2016, to January 22, 2021.\n\n\n-----\n\n```\n198.54.117[.]197\n\n```\n\nThe `jmttrading[.]org domain had a valid Sectigo SSL certificate (Obtain Capabilities:`\n_[Digital Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak](https://attack.mitre.org/versions/v8/techniques/T1588/004/)_\nsecurity verification level that does not require validation of the owner’s identity or the actual\nbusiness’s existence. The current SSL certificate was issued by Let’s Encrypt.\n\n**JMT Trading Application Analysis**\n\n**_Windows Program_**\n\nThe Windows version of the malicious cryptocurrency application is an MSI Installer. The\ninstaller looks legitimate and has a valid digital signature from Sectigo (Obtain Capabilities:\n_Digital Certificates_ [[T1588.004]). The signature was signed with a code signing certificate](https://attack.mitre.org/versions/v8/techniques/T1588/004/)\npurchased by the same user as the SSL certificate for `jmttrading[.]org (Obtain`\n_Capabilities: Code Signing Certificates_ [[T1588.003]). The MSI Installer asks the victim for](https://attack.mitre.org/versions/v8/techniques/T1588/003/)\nadministrative privileges to run (User Execution: Malicious File [[T1204.002]).](https://attack.mitre.org/versions/v8/techniques/T1204/002)\n\nOnce permission is granted, the MSI executes the following actions.\n\nInstalls `JMTTrader.exe in folder` `C:\\Program Files (x86)\\JMTTrader`\nInstalls `CrashReporter.exe in folder` `C:\\Users\\`\n```\n   <username>\\AppData\\Roaming\\JMTTrader\n\n```\nRuns `CrashReporter.exe with the` `Maintain parameter`\n\nThe `JMTTrader.exe program asks for the user’s exchange and loads a legitimate-looking`\ncryptocurrency trading platform—very similar to `CelasTradePro.exe and the benign Q.T.`\nBitcoin Trader—that exhibits no signs of malicious activity.\n\nThe program `CrashReporter.exe is heavily obfuscated with the ADVObfuscation library,`\nrenamed “snowman” (Obfuscated Files or Information [[T1027]). When run, it checks for the](https://attack.mitre.org/versions/v8/techniques/T1027)\n```\nMaintain parameter and collects the victim’s host information (System Owner/User\n\n```\n_Discovery_ [[T1033]), encrypts the collected information with a hardcoded XOR key before](https://attack.mitre.org/versions/v8/techniques/T1033)\nexfiltration, and sends the encrypted information to a C2 website (Exfiltration Over C2\n_[Channel [T1041]). The program also creates a scheduled SYSTEM task, named](https://attack.mitre.org/versions/v8/techniques/T1041)_\n```\nJMTCrashReporter, which runs CrashReporter.exe with the Maintain parameter at\n\n```\nany user’s login (Scheduled Task/Job: Scheduled Task [[T1053.005]).](https://attack.mitre.org/versions/v8/techniques/T1053/005)\n\n**_macOS X Program_**\n\n\n-----\n\nThe macOS version of the malicious application is a DMG Installer. The installer looks\nlegitimate and has very similar functionality to the Windows version, but it does not have a\ndigital certificate and will warn the user of that before installation. The installer executes the\nfollowing actions.\n\nInstalls `JMTTrader in folder` `/Applications/JMTTrader.app/Contents/MacOS/`\nInstalls `.CrashReporter in folder`\n```\n   /Applications/JMTTrader.app/Contents/Resources/\n\n```\nNote: the leading “.” makes it unlisted in the Finder app or default Terminal\ndirectory listing.\nExecutes a `postinstall script`\n\nMoves `.com.jmttrading.plist to folder` `LaunchDaemons`\nChanges the file permissions on the `plist`\nRuns `CrashReporter with the` `Maintain parameter`\nMoves `.CrashReporter to folder` `/Library/JMTTrader/CrashReporter`\nMakes `.CrashReporter executable`\n\nThe `JMTTrader program asks for the user’s exchange and loads a legitimate-looking`\ncryptocurrency trading platform—very similar to `CelasTradePro and the benign Q.T.`\nBitcoin Trader—that exhibits no signs of malicious activity.\n\nThe `CrashReporter program checks for the` `Maintain parameter and is not obfuscated.`\nThis lack of obfuscation makes it easier to determine the program’s functionality in detail.\nWhen it finds the `Maintain parameter, it collects the victim’s host information (System`\n_Owner/User Discovery_ [[T1033]), encrypts the collected information with a hardcoded XOR](https://attack.mitre.org/versions/v8/techniques/T1033)\nkey before exfiltration, and sends the encrypted information to a C2 website (Exfiltration Over\n_[C2 Channel [T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)_\n\nThe `postinstall script has similar functionality to the one used by` `CelasTradePro, but`\nit has a few additional features (Command and Scripting Interpreter: Unix Shell [[T1059.004]).](https://attack.mitre.org/versions/v8/techniques/T1059/004/)\nIt moves the property list ( plist ) file `.com.jmttrading.plis t from the Installer package`\nto the `LaunchDaemons folder (Scheduled Task/Job: Launchd [T1053.004]), but also`\nchanges the file permissions on the `plist file. Once in the folder, this property list`\n( plist ) file will launch the `CrashReporter program with the` `Maintain parameter on`\nsystem load as Root for every user. Also, the `postinstall script moves the`\n```\n.CrashReporter program to a new location /Library/JMTTrader/CrashReporter and\n\n```\nmakes it executable. Because the `LaunchDaemon will not run automatically after the`\n```\nplist file is moved, the postinstall script launches CrashReporter with the\nMaintain parameter and runs it in the background (Create or Modify System Process:\n\n```\n_Launch Daemon_ [[T1543.004]).](https://attack.mitre.org/versions/v8/techniques/T1543/004/)\n\n**_Payload_**\n\n\n-----\n\nSoon after the cybersecurity company tweeted about JMT Trader on October 11, 2019, the\nfiles on GitHub were updated to clean, non-malicious installers. Then on October 13, 2019, a\ndifferent cybersecurity company published an article detailing the macOS X JMT Trader, and\nsoon after, the C2 `beastgoc[.]com website went offline. There is not a confirmed sample`\nof the payload to analyze at this point.\n\n[For more details on AppleJeus Version 2: JMT Trading, see MAR-10322463-2.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048b)\n\n## AppleJeus Version 3: Union Crypto\n\n**Introduction and Infrastructure**\n\nIn December 2019, another version of the AppleJeus malware was identified on Twitter by a\ncybersecurity company based on many similarities to the original AppleJeus malware. Again,\nthe malware was in the form of a cryptocurrency trading application, which was marketed\nand distributed by a legitimate-looking company, called Union Crypto, on their website,\n\n`unioncrypto[.]vip (Acquire Infrastructure: Domain` [[T1583.001]). Although this website is](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\nno longer available, a cybersecurity researcher discovered a download link,\n```\nhttps://www.unioncrypto[.]vip/download/W6c2dq8By7luMhCmya2v97YeN, recorded\n\n```\non VirusTotal for the macOS X version of `UnionCryptoTrader . In contrast, open-source`\nreporting stated that the Windows version might have been downloaded via instant\nmessaging service Telegram, as it was found in a “Telegram Downloads” folder on an\n[unnamed victim.[7]](https://securelist.com/operation-applejeus-sequel/95596/)\n\nThe `unioncrypto[.]vip domain resolved to the following IP addresses from June 5,`\n2019, to July 15, 2020.\n```\n   104.168.167[.]16\n   198.54.117[.]197\n   198.54.117[.]198\n   198.54.117[.]199\n   198.54.117[.]200\n\n```\nThe domain `unioncrypto[.]vip` had a valid Sectigo SSL certificate (Obtain Capabilities:\n_Digital Certificates_ [[T1588.004]). The SSL certificate was “Domain Control Validated,” a weak](https://attack.mitre.org/versions/v8/techniques/T1588/004/)\nsecurity verification level that does not require validation of the owner’s identity or the actual\nbusiness’s existence.\n\n**Union Crypto Trader Application Analysis**\n\n**_Windows Program_**\n\nThe Windows version of the malicious cryptocurrency application is a Windows executable\n( .exe ) (User Execution: Malicious File [[T1204.002]), which acts as an installer that extracts](https://attack.mitre.org/versions/v8/techniques/T1204/002)\na temporary MSI Installer.\n\n\n-----\n\nThe Windows program executes the following actions.\n\nExtracts `UnionCryptoTrader.msi to folder` `C:\\Users\\`\n```\n   <username>\\AppData\\Local\\Temp\\{82E4B719-90F74BD1-9CF1-56CD777E0C42}\n\n```\nRuns `UnionCryptoUpdater.msi`\n\nInstalls `UnionCryptoTrader.exe in folder` `C:\\Program`\n```\n      Files\\UnionCryptoTrader\n\n```\nInstalls `UnionCryptoUpdater.exe in folder C:\\Users\\`\n```\n      <username>\\AppData\\Local\\UnionCryptoTrader\n\n```\nDeletes `UnionCryptoUpdater.msi`\nRuns `UnionCryptoUpdater.exe`\n\nThe program `UnionCryptoTrader.exe loads a legitimate-looking cryptocurrency arbitrage`\napplication—defined as “the simultaneous buying and selling of securities, currency, or\ncommodities in different markets or in derivative forms to take advantage of differing prices\nfor the same asset”—which exhibits no signs of malicious activity. This application is very\nsimilar to another cryptocurrency arbitrage application known as Blackbird Bitcoin Arbitrage.\n\n[[8]](https://github.com/butor/blackbird)\n\nThe program `UnionCryptoUpdater.exe first installs itself as a service (Create or Modify`\n_System Process: Windows Service_ [[T1543.003]), which will automatically start when any](https://attack.mitre.org/versions/v8/techniques/T1543/003)\nuser logs on (Boot or Logon Autostart Execution [[T1547]). The service is installed with a](https://attack.mitre.org/versions/v8/techniques/T1547/)\ndescription stating it “Automatically installs updates for Union Crypto Trader.” When\n[launched, it collects the victim’s host information (System Owner/User Discovery [T1033]),](https://attack.mitre.org/versions/v8/techniques/T1033)\ncombines the information in a string that is MD5 hashed and stored in the `auth_signature`\nvariable before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel\n\n[[T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)\n\n**_macOS X Program_**\n\nThe macOS version of the malicious application is a DMG Installer. The installer looks\nlegitimate and has very similar functionality to the Windows version, but it does not have a\ndigital certificate and will warn the user of that before installation. The installer executes the\nfollowing actions.\n\nInstalls `UnionCryptoTrader in folder`\n```\n   /Applications/UnionCryptoTrader.app/Contents/MacOS/\n\n```\nInstalls `.unioncryptoupdater in folder`\n```\n   /Applications/UnionCryptoTrader.app/Contents/Resources/\n\n```\nNote: the leading “.” makes it unlisted in the Finder app or default Terminal\ndirectory listing\n\n\n-----\n\nExecutes a `postinstall script`\n\nMoves `.vip.unioncrypto.plist to folder` `LaunchDaemons`\nChanges the file permissions on the `plist to Root`\nRuns `unioncryptoupdater`\nMoves `.unioncryptoupdater to folder`\n```\n      /Library/UnionCrypto/unioncryptoupdater\n\n```\nMakes `.unioncryptoupdater executable`\n\nThe `UnionCryptoTrader program loads a legitimate-looking cryptocurrency arbitrage`\napplication, which exhibits no signs of malicious activity. The application is very similar to\nanother cryptocurrency arbitrage application known as Blackbird Bitcoin Arbitrage.\n\nThe `.unioncryptoupdater program is signed ad-hoc, meaning it is not signed with a valid`\ncode-signing identity. When launched, it collects the victim’s host information (System\n_Owner/User Discovery_ [[T1033]), combines the information in a string that is MD5 hashed](https://attack.mitre.org/versions/v8/techniques/T1033)\nand stored in the `auth_signature variable before exfiltration, and sends it to a C2 website`\n[(Exfiltration Over C2 Channel [T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)\n\nThe `postinstall script has similar functionality to the one used by JMT Trading`\n(Command and Scripting Interpreter: Unix Shell [[T1059.004]). It moves the property list](https://attack.mitre.org/versions/v8/techniques/T1059/004/)\n( plist ) file `.vip.unioncrypto.plist from the Installer package to the`\n\n`LaunchDaemons folder (Scheduled Task/Job: Launchd` [[T1053.004]), but also changes the](https://attack.mitre.org/versions/v8/techniques/T1053/004/)\nfile permissions on the `plist file to Root. Once in the folder, this property list ( plist ) file`\nwill launch the `.unioncryptoupdater on system load as Root for every user. The`\n```\npostinstall script moves the .unioncryptoupdater program to a new location\n/Library/UnionCrypto/unioncryptoupdater and makes it executable. Because the\nLaunchDaemon will not run automatically after the plist file is moved, the postinstall\n\n```\nscript launches `.unioncryptoupdater and runs it in the background (Create or Modify`\n_System_ _Process: Launch Daemon_ [[T1543.004]).](https://attack.mitre.org/versions/v8/techniques/T1543/004/)\n\n**_Payload_**\n\nThe payload for the Windows malware is a Windows Dynamic-LinkLibrary. `UnionCryptoUpdater.exe does not immediately download the stage 2 malware`\nbut instead downloads it after a time specified by the C2 server. This delay could be\nimplemented to prevent researchers from directly obtaining the stage 2 malware.\n\nThe macOS X malware’s payload could not be downloaded, as the C2 server is no longer\naccessible. Additionally, none of the open-source reporting for this sample contained copies\nof the macOS X payload. The macOS X payload is likely similar in functionality to the\nWindows stage 2 detailed above.\n\n[For more details on AppleJeus Version 3: Union Crypto, see MAR-10322463-3.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048c)\n\n## Commonalities between Celas Trade Pro JMT Trading and Union Crypto\n\n\n-----\n\n**Hardcoded Values**\n\nIn each AppleJeus version, there are hardcoded values used for encryption or to create a\nsignature when combined with the time (table 1).\n\n_Table 1: AppleJeus hardcoded values and uses_\n\n**AppleJeus Version** **Value** **Use**\n\n1: Celas Trade Pro Moz&Wie;#t/6T!2y XOR encryption to send data\n\n1: Celas Trade Pro W29ab@ad%Df324V$Yd RC4 decryption\n\n2: JMT Trader Windows X,%`PMk--Jj8s+6=15:20:11 XOR encryption to send data\n\n2: JMT Trader OSX X,%`PMk--Jj8s+6=\\x02 XOR encryption to send data\n\n3: Union Crypto Trader 12GWAPCT1F0I1S14 Combined with time for signature\n\nThe Union Crypto Trader and Celas LLC (XOR) values are 16 bytes in length. For JMT\nTrader, the first 16 bytes of the Windows and macOS X values are identical, and the\nadditional bytes are in a time format for the Windows sample. The structure of a 16-byte\nvalue combined with the time is also used in Union Crypto Trader to create the\n```\nauth_signature .\n\n```\nAs mentioned, FALLCHILL was reported as the final payload for Celas Trade Pro. All\nFALLCHILL samples use 16-byte hardcoded RC4 keys for sending data, similar to the 16byte keys in the AppleJeus samples.\n\n**Open-Source Cryptocurrency Applications**\n\nAll three AppleJeus samples are bundled with modified copies of legitimate cryptocurrency\napplications and can be used as originally designed to trade cryptocurrency. Both Celas LLC\nand JMT Trader modified the same cryptocurrency application, Q.T. Bitcoin Trader; Union\nCrypto Trader modified the Blackbird Bitcoin Arbitrage application.\n\n**Postinstall Scripts, Property List Files, and LaunchDaemons**\n\nThe macOS X samples of all three AppleJeus versions contain `postinstall scripts with`\nsimilar logic. The Celas LLC `postinstall script only moves the` `plist file to a new`\nlocation and launches `Updater with the` `CheckUpdate parameter in the background. The`\nJMT Trader and Union Crypto Trader also perform these actions and have identical\nfunctionality. The additional actions performed by both `postinstall scripts are to change`\nthe file permissions on the `plist, make a new directory in the` `/Library folder, move`\n```\nCrashReporter or UnionCryptoUpdater to the newly created folder, and make them\n\n```\nexecutable.\n\n\n-----\n\nThe `plist files for all three AppleJeus files have identical functionality. They only differ in`\nthe files’ names and one default comment that was not removed from the Celas LLC\n```\nplist . As the logic and functionality of the postinstall scripts and plist files are almost\n\n```\nidentical, the `LaunchDaemons created also function the same.`\n\nThey will all launch the secondary executable as Root on system load for every user.\n\n## AppleJeus Version 4: Kupay Wallet\n\n**Introduction and Infrastructure**\n\nOn March 13, 2020, a new version of the AppleJeus malware was identified. The malware\nwas marketed and distributed by a legitimate-looking company, called Kupay Wallet, on their\nwebsite `kupaywallet[.]com (Acquire Infrastructure: Domain` [[T1583.001]).](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\n\nThe domain `www.kupaywallet[.]com resolved to IP address` `104.200.67[.]96 from`\nMarch 20, 2020, to January 16, 2021. CrownCloud US, LLC controlled the IP address\n(autonomous system number [ASN] 8100), and is located in New York, NY.\n\nThe domain `www.kupaywallet[.]com had a valid Sectigo SSL certificate (Obtain`\n_Capabilities: Digital Certificates_ [[T1588.004]). The SSL certificate was “Domain Control](https://attack.mitre.org/versions/v8/techniques/T1588/004/)\nValidated,” a weak security verification level that does not require validation of the owner’s\nidentity or the actual business’s existence.\n\n**Kupay Wallet Application Analysis**\n\n**_Windows Program_**\n\nThe Windows version of the malicious cryptocurrency application is an MSI Installer. The\nMSI executes the following actions.\n\nInstalls `Kupay.exe in folder` `C:\\Program Files (x86)\\Kupay`\nInstalls `KupayUpgrade.exe in folder` `C:\\Users\\`\n```\n   <username>\\AppData\\Roaming\\KupaySupport\n\n```\nRuns `KupayUpgrade.exe`\n\nThe program `Kupay.exe loads a legitimate-looking cryptocurrency wallet platform, which`\nexhibits no signs of malicious activity and is very similar to an open-source platform known\nas Copay, distributed by Atlanta-based company BitPay.\n\nThe program `KupayUpgrade.exe first installs itself as a service (Create or Modify System`\n_Process:_ _Windows Service_ [[T1543.003]), which will automatically start when any user logs](https://attack.mitre.org/versions/v8/techniques/T1543/003)\non (Boot or Logon _Autostart Execution_ [[T1547]). The service is installed with a description](https://attack.mitre.org/versions/v8/techniques/T1547/)\n\n\n-----\n\nstating it is an Automatic Kupay Upgrade. When launched, it collects the victim s host\ninformation (System Owner/User Discovery [[T1033]), combines the information in strings](https://attack.mitre.org/versions/v8/techniques/T1033)\nbefore exfiltration, and sends it to a C2 website (Exfiltration Over C2 _Channel_ [[T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)\n\n**_macOS X Program_**\n\nThe macOS version of the malicious application is a DMG Installer. The installer looks\nlegitimate and has very similar functionality to the Windows version, but it does not have a\ndigital certificate and will warn the user of that before installation. The installer executes the\nfollowing actions.\n\nInstalls `Kupay in folder` `/Applications/Kupay.app/Contents/MacOS/`\nInstalls `kupay_upgrade in folder` `/Applications/Kupay.app/Contents/MacOS/`\nExecutes a `postinstall script`\n\nCreates `KupayDaemon folder in` `/Library/Application Support folder`\nMoves `kupay_upgrade to the new folder`\nMoves `com.kupay.pkg.wallet.plist to folder` `/Library/LaunchDaemons/`\nRuns the command `launchctl load to load the` `plist without a restart`\nRuns `kupay_upgrade in the background`\n```\nKupay is likely a copy of an open-source cryptocurrency wallet application, loads a\n\n```\nlegitimate-looking wallet program (fully functional), and its functionality is identical to the\nWindows `Kupay.exe program.`\n\nThe `kupay_upgrade program calls its function` `CheckUpdate (which contains most of the`\nlogic functionality of the malware) and sends a `POST to the C2 server with a connection`\nnamed “Kupay Wallet 9.0.1 (Check Update Osx)” (Application Layer Protocol: Web Protocols\n\n[[T1071.001]). If the C2 server returns a file, it is decoded and written to the victim’s folder](https://attack.mitre.org/versions/v8/techniques/T1071/001)\n```\n/private/tmp/kupay_update with permissions set by the command chmod 700 (only\n\n```\nthe user can read, write, and execute) (Command and Scripting Interpreter [[T1059]). Stage 2](https://attack.mitre.org/versions/v8/techniques/T1059/)\nis then launched, and the malware, `kupay_upgrade, returns to sleeping and checking in`\nwith the C2 server at predetermined intervals (Application Layer Protocol: Web Protocols\n\n[[T1071.001]).](https://attack.mitre.org/versions/v8/techniques/T1071/001)\n\nThe `postinstall script has similar functionality to other AppleJeus scripts (Command and`\n_Scripting Interpreter: Unix Shell_ [[T1059.004]). It creates the](https://attack.mitre.org/versions/v8/techniques/T1059/004/) `KupayDaemon folder in`\n```\n/Library/Application Support folder and then moves kupay_upgrade to the new\n\n```\nfolder. It moves the property list ( plist ) file `com.kupay.pkg.wallet.plist from the`\nInstaller package to the `/Library/LaunchDaemons/ folder (Scheduled Task/Job: Launchd`\n\n[[T1053.004]). The script runs the command](https://attack.mitre.org/versions/v8/techniques/T1053/004/) `launchctl load to load the` `plist without a`\n[restart (Command and Scripting Interpreter [T1059]). But, since the LaunchDaemon will not](https://attack.mitre.org/versions/v8/techniques/T1059/)\nrun automatically after the `plist file is moved, the` `postinstall script launches`\n```\nkupay_upgrade and runs it in the background (Create or Modify System Process: Launch\n\n```\n_[Daemon [T1543.004]).](https://attack.mitre.org/versions/v8/techniques/T1543/004/)_\n\n\n-----\n\n**_Payload_**\n\nThe Windows malware’s payload could not be downloaded since the C2 server is no longer\naccessible. Additionally, none of the open-source reporting for this sample contained copies\nof the payload. The Windows payload is likely similar in functionality to the macOS X stage 2\ndetailed below.\n\nThe stage 2 payload for the macOS X malware was decoded and analyzed. The stage 2\nmalware has a variety of functionalities. Most importantly, it checks in with a C2 and, after\nconnecting to the C2, can send or receive a payload, read and write files, execute\ncommands via the terminal, etc.\n\nFor more details on AppleJeus Version 4: Kupay Wallet, see [MAR-10322463-4.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048d)\n\n## AppleJeus Version 5: CoinGoTrade\n\n**Introduction and Infrastructure**\n\nIn early 2020, another version of the AppleJeus malware was identified. This time the\nmalware was marketed and distributed by a legitimate-looking company called CoinGoTrade\non their website `coingotrade[.]com (Acquire Infrastructure: Domain` [[T1583.001]).](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\n\nThe domain `CoinGoTrade[.]com resolved to IP address` `198.54.114[.]175 from`\nFebruary 28, 2020, to January 23, 2021. The IP address is controlled by NameCheap Inc.\n(ASN 22612) and is located in Atlanta, GA. This IP address is in the same ASN for\n```\nDorusio[.]com and Ants2Whale[.]com .\n\n```\nThe domain `CoinGoTrade[.]com had a valid Sectigo SSL certificate (Obtain Capabilities:`\n_Digital Certificates_ [[T1588.004]). The SSL certificate was “Domain Control Validated,” a weak](https://attack.mitre.org/versions/v8/techniques/T1588/004/)\nsecurity verification level that does not require validation of the owner’s identity or the actual\nbusiness’s existence.\n\n**CoinGoTrade Application Analysis**\n\n**_Windows Program_**\n\nThe Windows version of the malicious application is an MSI Installer. The installer appears to\nbe legitimate and will execute the following actions.\n\nInstalls `CoinGoTrade.exe in folder` `C:\\Program Files (x86)\\CoinGoTrade`\nInstalls `CoinGoTradeUpdate.exe in folder` `C:\\Users\\`\n```\n   <username>\\AppData\\Roaming\\CoinGoTradeSupport\n\n```\nRuns `CoinGoTradeUpdate.exe`\n```\nCoinGoTrade.exe loads a legitimate-looking cryptocurrency wallet platform with no signs\n\n```\nof malicious activity and is a copy of an open-source cryptocurrency application.\n\n\n-----\n\n```\nCoinGoTradeUpdate.exe first installs itself as a service (Create or Modify System Process:\n\n```\n_[Windows Service [T1543.003]), which will automatically start when any user logs on (Boot or](https://attack.mitre.org/versions/v8/techniques/T1543/003)_\n_[Logon Autostart Execution [T1547]). The service is installed with a description stating it is an](https://attack.mitre.org/versions/v8/techniques/T1547/)_\n“Automatic CoinGoTrade Upgrade.” When launched, it collects the victim’s host information\n[(System Owner/User Discovery [T1033]), combines the information in strings before](https://attack.mitre.org/versions/v8/techniques/T1033)\nexfiltration, and sends it to a C2 website (Exfiltration Over C2 _[Channel [T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)_\n\n**_macOS X Program_**\n\nThe macOS version of the malicious application is a DMG Installer. The installer looks\nlegitimate and has very similar functionality to the Windows version, but it does not have a\ndigital certificate and will warn the user of that before installation. The installer executes the\nfollowing actions.\n\nInstalls `CoinGoTrade in folder`\n```\n   /Applications/CoinGoTrade.app/Contents/MacOS/\n\n```\nInstalls `CoinGoTradeUpgradeDaemon in folder`\n```\n   /Applications/CoinGoTrade.app/Contents/MacOS/\n\n```\nExecutes a `postinstall script`\n\nCreates `CoinGoTradeService folder in` `/Library/Application Support`\nfolder\nMoves `CoinGoTradeUpgradeDaemon to the new folder`\nMoves `com.coingotrade.pkg.product.plist to folder`\n```\n      /Library/LaunchDaemons/\n\n```\nRuns `CoinGoTradeUpgradeDaemon in the background`\n\nThe `CoinGoTrade program is likely a copy of an open-source cryptocurrency wallet`\napplication and loads a legitimate-looking, fully functional wallet program).\n\nThe `CoinGoTradeUpgradeDaemon program calls its function` `CheckUpdate (which`\ncontains most of the logic functionality of the malware) and sends a `POST to the C2 server`\nwith a connection named “CoinGoTrade 1.0 (Check Update Osx)” (Application Layer\n_Protocol: Web Protocols_ [[T1071.001]). If the C2 server returns a file, it is decoded and written](https://attack.mitre.org/versions/v8/techniques/T1071/001)\nto the victim’s folder `/private/tmp/updatecoingotrade with permissions set by the`\ncommand `chmod 700 (only the user can read, write, and execute) (Command and`\n_[Scripting Interpreter [T1059]). Stage 2 is then launched, and the malware,](https://attack.mitre.org/versions/v8/techniques/T1059/)_\n```\nCoinGoTradeUpgradeDaemon, returns to sleeping and checking in with the C2 server at\n\n```\npredetermined intervals (Application Layer Protocol: Web Protocols [[T1071.001]).](https://attack.mitre.org/versions/v8/techniques/T1071/001)\n\nThe `postinstall script has similar functionality to the other scripts (Command and`\n_[Scripting Interpreter: Unix Shell [T1059.004]) and installs](https://attack.mitre.org/versions/v8/techniques/T1059/004/)_ `CoinGoTrade and`\n```\nCoinGoTradeUpgradeDaemon in folder\n/Applications/CoinGoTrade.app/Contents/MacOS/ . It moves the property list (plist) file\ncom.coingotrade.pkg.product.plist to the /Library/LaunchDaemons/ folder\n\n```\n\n-----\n\n[(Scheduled Task/Job: Launchd [T1053.004]). Because the](https://attack.mitre.org/versions/v8/techniques/T1053/004/) `LaunchDaemon will not run`\nautomatically after the `plist file is moved, the` `postinstall script launches`\n\n`CoinGoTradeUpgradeDaemon and runs it in the background (Create or Modify` _System_\n_Process: Launch Daemon_ [[T1543.004]).](https://attack.mitre.org/versions/v8/techniques/T1543/004/)\n\n**_Payload_**\n\nThe Windows malware’s payload could not be downloaded because the C2 server is no\nlonger accessible. Additionally, none of the open-source reporting for this sample contained\ncopies of the payload. The Windows payload is likely similar in functionality to the macOS X\nstage 2 detailed below.\n\nThe stage 2 payload for the macOS X malware was no longer available from the specified\ndownload URL. Still, a file was submitted to VirusTotal by the same user on the same date as\nthe macOS X `CoinGoTradeUpgradeDaemon . These clues suggest that the submitted file`\nmay be related to the macOS X version of the malware and the downloaded payload.\n\nThe file `prtspool is a 64-bit Mach-O executable with a large variety of features that have`\nall been confirmed as functionality. The file has three C2 URLs hardcoded into the file and\ncommunicates to these with HTTP POST multipart-form data boundary string. Like other\nHIDDEN COBRA malware, `prtspool uses format strings to store data collected about the`\nsystem and sends it to the C2s.\n\nFor more details on AppleJeus Version 5: CoinGoTrade, see [MAR-10322463-5.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048e)\n\n## AppleJeus Version 6: Dorusio\n\n**Introduction and Infrastructure**\n\nIn March 2020, an additional version of the AppleJeus malware was identified. This time the\nmalware was marketed and distributed by a legitimate-looking company called Dorusio on\ntheir website, `dorusio[.]com (Acquire Infrastructure: Domain` [[T1583.001]). Researchers](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\ncollected samples for Windows and macOS X versions of the Dorusio Wallet (Develop\n_Capabilities: Malware_ [[T1587.001]). As of at least early 2020, the actual download links](https://attack.mitre.org/versions/v8/techniques/T1587/001/)\nresult in `404 errors. The download page has release notes with version revisions claiming`\nto start with version 1.0.0, released on April 15, 2019.\n\nThe domain dorusio[.]com resolved to IP address `198.54.115[.]51 from March 30,`\n2020 to January 23, 2021. The IP address is controlled by NameCheap Inc. (ASN 22612)\nand is located in Atlanta, GA. This IP address is in the same ASN for `CoinGoTrade[.]com`\nand `Ants2Whale[.]com.`\n\nThe domain `dorusio[.]com had a valid Sectigo SSL certificate (Obtain Capabilities: Digital`\n_[Certificates [T1588.004]). The SSL certificate was “Domain Control Validated,” a weak](https://attack.mitre.org/versions/v8/techniques/T1588/004/)_\nsecurity verification level that does not require validation of the owner’s identity or the actual\n\n\n-----\n\nbusiness s existence.\n\n**Dorusio Application Analysis**\n\n**_Windows Program_**\n\nThe Windows version of the malicious application is an MSI Installer. The installer appears to\nbe legitimate and will install the following two programs.\n\nInstalls `Dorusio.exe in folder` `C:\\Program Files (x86)\\Dorusio`\nInstalls `DorusioUpgrade.exe in folder` `C:\\Users\\`\n```\n   <username>\\AppData\\Roaming\\DorusioSupport\n\n```\nRuns `DorusioUpgrade.exe`\n\nThe program, `Dorusio.exe, loads a legitimate-looking cryptocurrency wallet platform with`\nno signs of malicious activity and is a copy of an open-source cryptocurrency application.\n\nThe program `DorusioUpgrade.exe first installs itself as a service (Create or Modify`\n_System Process:_ _Windows Service_ [[T1543.003]), which will automatically start when any](https://attack.mitre.org/versions/v8/techniques/T1543/003)\nuser logs on (Boot or Logon Autostart Execution [[T1547]). The service is installed with a](https://attack.mitre.org/versions/v8/techniques/T1547/)\ndescription stating it “Automatic Dorusio Upgrade.” When launched, it collects the victim’s\nhost information (System Owner/User Discovery [[T1033]), combines the information in](https://attack.mitre.org/versions/v8/techniques/T1033)\nstrings before exfiltration, and sends it to a C2 website (Exfiltration Over C2 Channel\n\n[[T1041]).](https://attack.mitre.org/versions/v8/techniques/T1041)\n\n**_macOS X Program_**\n\nThe macOS version of the malicious application is a DMG Installer. The installer looks\nlegitimate and has very similar functionality to the Windows version, but it does not have a\ndigital certificate and will warn the user of that before installation. The installer executes the\nfollowing actions.\n\nInstalls `Dorusio in folder` `/Applications/Dorusio.app/Contents/MacOS/`\nInstalls `Dorusio_upgrade in folder`\n```\n   /Applications/Dorusio.app/Contents/MacOS/\n\n```\nExecutes a `postinstall script`\n\nCreates `DorusioDaemon folder in` `/Library/Application Support folder`\nMoves `Dorusio_upgrade to the new folder`\nMoves `com.dorusio.pkg.wallet.plist to folder`\n```\n      /Library/LaunchDaemons/\n\n```\nRuns `Dorusio_upgrade in the background`\n\nThe `Dorusio program is likely a copy of an open-source cryptocurrency wallet application`\nand loads a legitimate-looking wallet program (fully functional). Aside from the Dorusio logo\nand two new services, the wallet appears to be the same as the Kupay Wallet. This\n\n\n-----\n\napplication seems to be a modification of the open-source cryptocurrency wallet Copay\ndistributed by Atlanta-based company BitPay.\n\nThe `Dorusio_upgrade program calls its function` `CheckUpdate (which contains most of`\nthe logic functionality of the malware) and sends a `POST to the C2 server with a connection`\nnamed “Dorusio Wallet 2.1.0 (Check Update Osx)” (Application Layer Protocol: Web\n_Protocols_ [[T1071.001]). If the C2 server returns a file, it is decoded and written to the victim’s](https://attack.mitre.org/versions/v8/techniques/T1071/001)\nfolder `/private/tmp/Dorusio_update with permissions set by the command` `chmod 700`\n[(only the user can read, write, and execute) (Command and Scripting Interpreter [T1059]).](https://attack.mitre.org/versions/v8/techniques/T1059/)\nStage 2 is then launched, and the malware, `Dorusio_upgrade, returns to sleeping and`\nchecking in with the C2 server at predetermined intervals (Application Layer Protocol: Web\n_Protocols_ [[T1071.001]).](https://attack.mitre.org/versions/v8/techniques/T1071/001)\n\nThe `postinstall script has similar functionality to other AppleJeus scripts (Command and`\n_Scripting Interpreter: Unix Shell_ [[T1059.004]). It creates the](https://attack.mitre.org/versions/v8/techniques/T1059/004/) `DorusioDaemon folder in`\n```\n/Library/Application Support folder and then moves Dorusio_upgrade to the new\n\n```\nfolder. It moves the property list ( plist ) file `com.dorusio.pkg.wallet.plist from the`\nInstaller package to the `/Library/LaunchDaemons/ folder (Scheduled Task/Job: Launchd`\n\n[[T1053.004]). Because the](https://attack.mitre.org/versions/v8/techniques/T1053/004/) `LaunchDaemon will not run automatically after the` `plist file is`\nmoved, the `postinstall script launches` `Dorusio_upgrade and runs it in the`\nbackground (Create or Modify System Process: Launch Daemon [[T1543.004]).](https://attack.mitre.org/versions/v8/techniques/T1543/004/)\n\n**_Payload_**\n\nNeither the payload for the Windows nor macOS X malware could be downloaded; the C2\nserver is no longer accessible. The payloads are likely similar in functionality to the macOS X\nstage 2 from CoinGoTrade and Kupay Wallet, or the Windows stage 2 from Union Crypto.\n\n[For more details on AppleJeus Version 6: Dorusio, see MAR-10322463-6.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048f)\n\n## AppleJeus 4, 5, and 6 Installation Conflictions\n\nIf a user attempts to install the Kupay Wallet, CoinGoTrade, and Dorusio applications on the\nsame system, they will encounter installation conflicts.\n\nIf Kupay Wallet is already installed on a system and the user tries to install CoinGoTrade or\nDorusio:\n\nPop-up windows appear, stating a more recent version of the program is already\ninstalled.\n\nIf CoinGoTrade is already installed on a system and the user attempts to install Kupay\nWallet:\n\n\n-----\n\n```\n   Kupay.exe will be installed in the C:\\Program Files (x86)\\CoinGoTrade\\\n   folder .\n\n```\nAll `CoinGoTrade files will be deleted.`\nThe folders and files contained in the `C:\\Users\\`\n```\n   <username>\\AppData\\Roaming\\CoinGoTradeSupport will remain installed.\n   KupayUpgrade.exe is installed in the new folder C:\\Users\\\n   <username>\\AppData\\Roaming\\KupaySupport .\n\n```\nIf Dorusio is already installed on a system and the user attempts to install Kupay Wallet:\n```\n   Kupay.exe will be installed in the C:\\Program Files (x86)\\Dorusio\\ folder .\n\n```\nAll `Dorusio.exe files will be deleted.`\nThe folders and files contained in `C:\\Users\\`\n```\n   <username>\\AppData\\Roaming\\DorusioSupport will remain installed.\n   KupayUpgrade.exe is installed in the new folder C:\\Users\\\n   <username>\\AppData\\Roaming\\KupaySupport .\n\n## AppleJeus Version 7: Ants2Whale\n\n```\n**Introduction and Infrastructure**\n\nIn late 2020, a new version of AppleJeus was identified called “Ants2Whale.” The site for this\nversion of AppleJeus is `ants2whale[.]com (Acquire Infrastructure: Domain` [[T1583.001]).](https://attack.mitre.org/versions/v8/techniques/T1583/001/)\nThe website shows a legitimate-looking cryptocurrency company and application. The\nwebsite contains multiple spelling and grammar mistakes indicating the creator may not have\nEnglish as a first language. The website states that to download Ants2Whale, a user must\ncontact the administrator, as their product is a “premium package” (Develop Capabilities:\n_Malware_ [[T1587.001]).](https://attack.mitre.org/versions/v8/techniques/T1587/001/)\n\nThe domain `ants2whale[.]com resolved to IP address` `198.54.114[.]237 from`\nSeptember 23, 2020, to January 22, 2021. The IP address is controlled by NameCheap, Inc.\n(ASN 22612) and is located in Atlanta, GA. This IP address is in the same ASN for\n```\nCoinGoTrade[.]com and Dorusio[.]com .\n\n```\nThe domain `ants2whale[.]com had a valid Sectigo SSL certificate (Obtain Capabilities:`\n_Digital Certificates_ [[T1588.004]). The SSL certificate was “Domain Control Validated,” a weak](https://attack.mitre.org/versions/v8/techniques/T1588/004/)\nsecurity verification level that does not require validation of the owner’s identity or the actual\nbusiness’s existence.\n\n**Ants2Whale Application Analysis**\n\n**_Windows Program_**\n\nAs of late 2020, the Windows program was not available on VirusTotal. It is likely very similar\nto the macOS X version detailed below.\n\n\n-----\n\n**_macOS X Program_**\n\nThe macOS version of the malicious application is a DMG Installer. The installer looks\nlegitimate and has very similar functionality to the Windows version, but it does not have a\ndigital certificate and will warn the user of that before installation. The installer executes the\nfollowing actions.\n\nInstalls `Ants2Whale in folder`\n```\n   /Applications/Ants2whale.app/Contents/MacOS/Ants2whale\n\n```\nInstalls `Ants2WhaleHelper in folder` `/Library/Application`\n```\n   Support/Ants2WhaleSupport/\n\n```\nExecutes a `postinstall script`\n\nMoves `com.Ants2whale.pkg.wallet.plist to folder`\n```\n      /Library/LaunchDaemons/\n\n```\nRuns `Ants2WhaleHelper in the background`\n\nThe `Ants2Whale and` `Ants2WhaleHelper programs and the` `postinstall script`\nfunction almost identically to previous versions of AppleJeus and will not be discussed in\ndepth in this advisory.\n\n[For more details on AppleJeus Version 7: Ants2Whale, see MAR-10322463-7.v1.](https://us-cert.gov/ncas/analysis-reports/ar21-048g)\n\n## ATT&CK Profile\n\nFigure 2 and table 2 provide summaries of the MITRE ATT&CK techniques observed.\n\n\n-----\n\n_Figure 2: MITRE ATT&CK enterprise techniques used by AppleJeus_\n\n_Table 2: MITRE ATT&CK techniques observed_\n\n\n**Tactic Title**\n\nResource Development\n\n[TA0042]\n\nResource Development\n\n[TA0042]\n\nResource Development\n\n[TA0042]\n\nResource Development\n\n[TA0042]\n\nResource Development\n\n[TA0042]\n\n\n**Technique**\n**ID** **Technique Title**\n\nT1583.001 Acquire Infrastructure: Domain\n\nT1583.006 Acquire Infrastructure: Web Services\n\nT1587.001 Develop Capabilities: Malware\n\nT1588.003 Obtain Capabilities: Code Signing\nCertificates\n\nT1588004 Obtain Capabilities: Digital Certificates\n\n\n[Initial Access [TA0001]](https://attack.mitre.org/versions/v8/tactics/TA0001) T1566.002 Phishing: Spearphishing Link\n\n[Execution [TA0002]](https://attack.mitre.org/versions/v8/tactics/TA0002) T1059 Command and Scripting Interpreter\n\n[Execution [TA0002]](https://attack.mitre.org/versions/v8/tactics/TA0002) T1059.004 Command and Scripting Interpreter: Unix\nShell\n\n[Execution [TA0002]](https://attack.mitre.org/versions/v8/tactics/TA0002) T1204.002 User Execution: Malicious File\n\n[Persistence [TA0003]](https://attack.mitre.org/versions/v8/tactics/TA0003) T1053.004 Scheduled Task/Job: Launchd\n\n[Persistence [TA0003]](https://attack.mitre.org/versions/v8/tactics/TA0003) T1543.004 Create or Modify System Process: Launch\nDaemon\n\n[Persistence [TA0003]](https://attack.mitre.org/versions/v8/tactics/TA0003) T1547 Boot or Logon Autostart Execution\n\n\nPrivilege Escalation\n\n[TA0004]\n\n\nT1053.005 Scheduled Task/Job: Scheduled Task\n\n\n[Defense Evasion [TA0005]](https://attack.mitre.org/versions/v8/tactics/TA0005) T1027 Obfuscated Files or Information\n\n[Defense Evasion [TA0005]](https://attack.mitre.org/versions/v8/tactics/TA0005) T1548 Abuse Elevation Control Mechanism\n\n[Defense Evasion [TA0005]](https://attack.mitre.org/versions/v8/tactics/TA0005) T1564.001 Hide Artifacts: Hidden Files and Directories\n\n[Discovery [TA0007]](https://attack.mitre.org/versions/v8/tactics/TA0007) T1033 System Owner/User Discovery\n\n[Exfiltration [TA0010]](https://attack.mitre.org/versions/v8/tactics/TA0010) T1041 Exfiltration Over C2 Channel\n\n\n-----\n\n**Tactic Title**\n\nCommand and Control\n\n[TA0011]\n\nCommand and Control\n\n[TA0011]\n\nCommand and Control\n\n[TA0011]\n\n## Mitigations\n\n Compromise Mitigations\n\n\n**Technique**\n**ID** **Technique Title**\n\nT1071.001 Application Layer Protocol: Web Protocols\n\nT1573 Encrypted Channel\n\nT1573.001 Encrypted Channel: Symmetric\nCryptography\n\n\nOrganizations that identify AppleJeus malware within their networks should take immediate\naction. Initial actions should include the following steps.\n\nContact the FBI, CISA, or Treasury immediately regarding any identified activity related\nto AppleJeus. (Refer to the Contact Information section below.)\nInitiate your organization’s incident response plan.\nGenerate new keys for wallets, and/or move to new wallets.\nIntroduce a two-factor authentication solution as an extra layer of verification.\nUse hardware wallets, which keep the private keys in a separate, secured storage\narea.\nTo move funds out off a compromised wallet:\n\nDo not use the malware listed in this advisory to transfer funds, and\nForm all transactions offline and then broadcast them to the network all at once in\na short online session, ideally prior to the attacker accessing them.\nRemove impacted hosts from network.\nAssume the threat actors have moved laterally within the network and downloaded\nadditional malware.\nChange all passwords to any accounts associated with impacted hosts.\nReimage impacted host(s).\nInstall anti-virus software to run daily deep scans of the host.\nEnsure your anti-virus software is setup to download the latest signatures daily.\nInstall a Host Based Intrusion Detection (HIDS)-based software and keep it up to date.\nEnsure all software and hardware is up to date, and all patches have been installed.\nEnsure network-based firewall is installed and/or up to date.\nEnsure the firewall’s firmware is up to date.\n\n## Pro-Active Mitigations\n\n\n-----\n\nConsider the following recommendations for defense against AppleJeus malware and related\nactivity.\n\n**_Cryptocurrency Users_**\n\nVerify source of cryptocurrency-related applications.\nUse multiple wallets for key storage, striking the appropriate risk balance between hot\nand cold storage.\nUse custodial accounts with multi-factor authentication mechanisms for both user and\ndevice verification.\nPatronize cryptocurrency service businesses that offer indemnity protections for lost or\nstolen cryptocurrency.\nConsider having a dedicated device for cryptocurrency management.\n\n**_Financial Service Companies_**\n\nVerify compliance with Federal Financial Institutions Examination Council (FFIEC)\n[handbooks at https://ithandbook.ffiec.gov, especially those related to information](https://ithandbook.ffiec.gov/)\nsecurity.\nReport suspicious cyber and financial activities. For more information on mandatory\nand voluntary reporting of cyber events via suspicious activity reports, see the Financial\nCrimes Enforcement Network (FinCEN) Advisory FIN-2016-A005: Advisory to Financial\nInstitutions on Cyber- Events and Cyber-Enabled Crime at\nhttps://www.fincen.gov/sites/default/files/advisory/2016-1025/Cyber%20Threats%20Advisory%20-%20FINAL%20508_2.pdf and FinCEN’s\nSection 314(b) Fact Sheet at\n[https://www.fincen.gov/sites/default/files/shared/314bfactsheet.pdf.](https://www.fincen.gov/sites/default/files/shared/314bfactsheet.pdf)\n\n**_Cryptocurrency Businesses_**\n\nVerify compliance with the Cryptocurrency Security Standard at\n[http://cryptoconsortium.github.io/CCSS/.](http://cryptoconsortium.github.io/CCSS/)\n\n**_All Organizations_**\n\nIncorporate IOCs identified in CISA’s Malware Analysis Reports on https://uscert.cisa.gov/northkorea into intrusion detection systems and security alert systems to\nenable active blocking or reporting of suspected malicious activity.\nSee table 3 below, which provides a summary of preventative ATT&CK mitigations\nbased on observed techniques.\n\n_Table 3: MITRE ATT&CK mitigations based on observed techniques_\n\n**Mitigation** **Description**\n\n\n-----\n\n**Mitigation** **Description**\n\n\nUser Training\n\n[M1017]\n\nUser Training\n\n[M1017]\n\nUser Account\n[Management](https://attack.mitre.org/versions/v8/mitigations/M1018)\n\n[M1018]\n\nUser Account\n[Management](https://attack.mitre.org/versions/v8/mitigations/M1018)\n\n[M1018]\n\nSSL/TLS Inspection\n\n[M1020]\n\nRestrict Web-Based\nContent [M1021]\n\nRestrict Web-Based\nContent [M1021]\n\nRestrict Web-Based\nContent [M1021]\n\nRestrict File and\nDirectory\nPermissions [M1022]\n\nPrivileged Account\n[Management](https://attack.mitre.org/versions/v8/mitigations/M1026)\n\n[M1026]\n\nPrivileged Account\n[Management](https://attack.mitre.org/versions/v8/mitigations/M1026)\n\n[M1026]\n\nOperating System\n[Configuration](https://attack.mitre.org/versions/v8/mitigations/M1028)\n\n[M1028]\n\n\nTrain users to identify social engineering techniques and\nspearphishing emails.\n\nProvide users with the awareness of common phishing and\nspearphishing techniques and raise suspicion for potentially\nmalicious events.\n\nLimit privileges of user accounts and remediate Privilege\nEscalation vectors so only authorized administrators can create\nnew Launch Daemons.\n\nLimit privileges of user accounts and remediate Privilege\nEscalation vectors so only authorized administrators can create\nscheduled tasks on remote systems.\n\nUse SSL/TLS inspection to see encrypted sessions’ contents to\nlook for network-based indicators of malware communication\nprotocols.\n\nDetermine if certain websites that can be used for spearphishing\nare necessary for business operations and consider blocking\naccess if the activity cannot be monitored well or poses a\nsignificant risk.\n\nBlock Script extensions to prevent the execution of scripts and\nHTA files that may commonly be used during the exploitation\nprocess.\n\nEmploy an adblocker to prevent malicious code served up through\nads from executing.\n\nPrevent all users from writing to the `/Library/StartupItems`\ndirectory to prevent any startup items from getting registered since\n```\nStartupItems are deprecated.\n\n```\nWhen PowerShell is necessary, restrict PowerShell execution\npolicy to administrators. Be aware that there are methods of\nbypassing the PowerShell execution policy, depending on\nenvironment configuration.\n\nConfigure the Increase Scheduling Priority option only to allow the\nAdministrators group the rights to schedule a priority process.\n\nConfigure settings for scheduled tasks to force tasks to run under\nthe authenticated account’s context instead of allowing them to run\nas SYSTEM.\n\n\n-----\n\n**Mitigation** **Description**\n\n\nNetwork Intrusion\nPrevention [M1031]\n\nExecution Prevention\n\n[M1038]\n\nExecution Prevention\n\n[M1038]\n\nBehavior Prevention\non Endpoint [M1040]\n\nDisable or Remove\n[Feature or Program](https://attack.mitre.org/versions/v8/mitigations/M1042)\n\n[M1042]\n\nCode Signing\n\n[M1045]\n\n\nUse network intrusion detection and prevention systems that use\nnetwork signatures to identify traffic for specific adversary malware\nand mitigate activity at the network level.\n\nUse application control tools where appropriate.\n\nUse application control tools to prevent the running of executables\nmasquerading as other files.\n\nConfigure endpoint (if possible) to block some process injection\ntypes based on common sequences of behavior during the\ninjection process.\n\nDisable or remove any unnecessary or unused shells or\ninterpreters.\n\nWhere possible, only permit the execution of signed scripts.\n\n\n[Audit [M1047]](https://attack.mitre.org/versions/v8/mitigations/M1047) Audit logging for `launchd events in macOS can be reviewed or`\ncentrally collected using multiple options, such as Syslog,\nOpenBSM, or OSquery.\n\n[Audit [M1047]](https://attack.mitre.org/versions/v8/mitigations/M1047) Toolkits like the PowerSploit framework contain PowerUp modules\nthat can be used to explore systems for permission weaknesses in\nscheduled tasks that could be used to escalate privileges.\n\n\nAntivirus/Antimalware\n\n[M1049]\n\n## Contact Information\n\n\nUse an antivirus program to quarantine suspicious files\nautomatically.\n\n\nRecipients of this report are encouraged to contribute any additional information that they\nmay have related to this threat.\n\nFor any questions related to this report or to report an intrusion and request resources for\nincident response or technical assistance, please contact:\n\n[The FBI through the FBI Cyber Division (855-292-3937 or CyWatch@fbi.gov) or a](http://10.10.0.46/mailto:CyWatch@fbi.gov) local\nfield office,\n[CISA (888-282-0870 or Central@cisa.dhs.gov), or](http://10.10.0.46/mailto:Central@cisa.dhs.gov)\nTreasury Office of Cybersecurity and Critical Infrastructure Protection (Treasury\n[OCCIP) (202-622-3000 or OCCIP-Coord@treasury.gov).](http://10.10.0.46/mailto:OCCIP-Coord@treasury.gov)\n\n## References\n\n\n-----\n\n## Revisions\n\nFebruary 17, 2021: Initial Version\n\nApril 15, 2021: Updated MITRE ATT&CK technique from Command and Scripting Interpreter:\nAppleScript [T1059.002] to Command and Scripting Interpreter: Unix Shell [T1059.004].\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa21-048a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-17 - Alert (AA21-048A)- AppleJeus- Analysis of North Korea’s Cryptocurrency Malware.pdf"
    ],
    "report_names": [
        "2021-02-17 - Alert (AA21-048A)- AppleJeus- Analysis of North Korea’s Cryptocurrency Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "fdf8d396-bbe4-454c-970a-81c4c3093b27",
            "created_at": "2022-10-25T16:07:23.763387Z",
            "updated_at": "2025-03-27T02:02:09.970069Z",
            "deleted_at": null,
            "main_name": "BeagleBoyz",
            "aliases": [
                "BeagleBoyz",
                "Operation FASTCash"
            ],
            "source_name": "ETDA:BeagleBoyz",
            "tools": [
                "Cyruslish",
                "ECCENTRICBANDWAGON",
                "FASTCash",
                "NACHOCHEESE",
                "NachoCheese",
                "PSLogger",
                "TWOPENCE",
                "VIVACIOUSGIFT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "679e335a-38a4-4db9-8fdf-a48c17a1f5e6",
            "created_at": "2023-01-06T13:46:38.820429Z",
            "updated_at": "2025-03-27T02:00:02.927526Z",
            "deleted_at": null,
            "main_name": "FASTCash",
            "aliases": [],
            "source_name": "MISPGALAXY:FASTCash",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536146,
    "ts_updated_at": 1743041842,
    "ts_creation_date": 1653786376,
    "ts_modification_date": 1653786376,
    "files": {
        "pdf": "https://archive.orkl.eu/d2f288e8bbf816a39755a24140962dd83e9df271.pdf",
        "text": "https://archive.orkl.eu/d2f288e8bbf816a39755a24140962dd83e9df271.txt",
        "img": "https://archive.orkl.eu/d2f288e8bbf816a39755a24140962dd83e9df271.jpg"
    }
}