{
    "id": "1b9ff44f-e979-4546-9844-3ba053795950",
    "created_at": "2023-01-12T15:00:46.088646Z",
    "updated_at": "2025-03-27T02:05:40.51924Z",
    "deleted_at": null,
    "sha1_hash": "589b8ace589e6c1af3812548fa6facddc34550bf",
    "title": "2022-07-26 - On the FootSteps of Hive Ransomware",
    "authors": "",
    "file_creation_date": "2022-08-18T03:32:03Z",
    "file_modification_date": "2022-08-18T03:32:03Z",
    "file_size": 7068628,
    "plain_text": "# On the FootSteps of Hive Ransomware\n\n**yoroi.company/research/on-the-footsteps-of-hive-ransomware/**\n\n07/26/2022\n\n## Introduction\n\n\nJuly 26, 2022\n\n\nHive ransomware is one of the most active financially motivated threat actors of this period, adopting the current Double Extorsion model. They\nstarted their malicious activities in June of the past year, and just in a year of activity they collected a big number of victims, demonstrating the\ncapability to hit even critical infrastructures.\n\nThe criminal group distinguished from other ones also for attacking healthcare organization during the 2021 when we had to face off the Covid[19 pandemic. It was emblematic that one of the first victims was the Memorial Health System in August 2021.](https://therecord.media/hive-ransomware-shuts-down-california-health-care-organization/)\n\nFor these reasons, Yoroi’s Malware ZLab decided to keep track of this infamous threat actor and observe any modification of its modus\noperandi, in order to provide a guideline focusing on the evolution of the locker sample of the cyber gang.\n\n## About Hive\n\nHive (TH-313) is a Ransomware group firstly spotted in June 2021 and it gathered a big popularity inside the cybersecurity community\nbecause it was able to attack a large variety of sectors, starting from healthcare facilities and arriving to critical infrastructures, passing through\nmanufacturers during just a year of activity.\n\nIn addition, the group was able to refine its toolkit and then its TTPs with a surprising speed: the business model is the Double-Extorsion and\nRansomware-as-a-Service, with a self-made ransomware payload.\n\n\n-----\n\nFigure 1: Hive (TH-313)\n\nSo, in this report we have decided to focus our attention on the ransomware payload evolution, providing a timeline of the development of Hive\nRansomware Payloads.\n\n## Timeline of the development of Hive Ransomware\n\nInside the criminal group, there is surely a high-profile development team, with deep knowledge of programming in both newer and older\nprogramming languages. The first versions of the encryptor payload are written in Golang, then, starting from the v5 version, the dev team of\nHive switched into Rust.\n\nFigure 2: Leak Site\n\nIn the following timeline, we provide a quick overview of the evolution of the malware and how the cyber gang adopted an incremental\ndevelopment process on its TTPs:\n\n\n-----\n\nFigure 3: Hive Timeline\n\nIn the same way, even the Ransom Note changed during the evolution: first, the credentials were hardcoded inside the sample, but now the\noperators pass them as a parameter when the locker process is launched. Below a comparison between an earlier version and a later one:\n\nFigure 4:\n\nRansom note comparison\n\n## Victimology\n\nDuring its activity, Hive Group hit a large number of victims and during that period some of them paid the ransom, after that the victims were\nremoved from the “walk of shame”. We tracked a total of 130 victims listed on their leak site, the affected companies belong to different sectors\nand nations. However, we have evidence that occasionally some victims of the group, despite being attacked by the threat actor, are never\nreported onto the site.\n\n\n-----\n\no eo e, t e g oup does ot e c ude osp ta s, co pa es t at p o de ed ca equ p e t a d o p o t o ga at o s e a p e s t e\nattack on the \"Memorial Health System\" in August 2021 or more recently on the \"Partnership HealthPlan of California\", a non-profit\norganization.\n\nThe following graph shows the total progress of the victims so far, indicating that the group is consolidating its role as one of the principal\nthreats in the panorama.\n\nFigure 5: Hive Ransomware Victims Progress over time\nAnother view of the same information is represented in the following graph, where the focus is pointed to highlight the month in which most\nvictims were published on their leak site, which turns out to be July 2021, shortly after the group started. So, it means that the ransomware\noperators gathered a consistent number of victims during the startup phase, in order to create a solid placement inside the threat landscape.\nAfter that phase, the gang continued to threaten with huge aggression.\n\n\n-----\n\nFigure 6: Hive Victims Per Month\n\n## Hive v1\n\nHash 88f7544a29a2ceb175a135d9fa221cbfd3e8c71f32dd6b09399717f85ea9afd1\n\nThreat Ransomware\n\n\nBrief\nDescription\n\n\nHive Ransomware v1\n\n\nSSDEEP 12288:CinNFNkY/yU97ppM4NSBG81Np2C9H4S3iDjlLtc4wCIITIQaOI6NrwacVYV+4MsT:CinN3n/y67jM4v4kCSPDjlLtbwt8IQLH\n\n_Table 1: Hive v1_\nThe first version, written in Golang, was a sophisticated encryptor program, but, due to the newness of the malicious activity, there is no track\nof obfuscation, and the strings can be easily seen, the following figure shows some of the available parameters:\n\n\n-----\n\nFigure 7: Available parameters\n\nThe initial effort of the gang was to make a product quite customizable according to the infection and the encryption process to perform. In this\nway, the malware writers provided a series of parameters to launch an ad-hoc infection profile.\n\nThe following table describes all the available parameters found in this version:\n\n**Parameter** **Description**\n\n-kill Regex, names of the processes to kill. Default values: “mspub|msdesktop”\n\n-no-clean Skip clean disk space stage\n\n-skip Regex, names of the files to skip. Default values: “\\\\.lnk”\n\n-skip-before Skip files before a specific date. Defaut value: “03.09.2016”\n\n-stop Regex, names of the services to stop. Default values: \"bmr|sql|oracle|postgres|redis|vss|backup|sstp\"\n\n-t Number of threads\n\n_Table 2: Hive v1 Parameters_\nOnce the parameters are parsed, creating the desired infection profile, the control flow passes to the core malicious operations.\n\n\n-----\n\n_Figure 8: Hive core function_\n\nThe locker sample proceeds to export the key, to kill the processes and services specified and to remove the shadow copies then it iterates the\ndirectories and starts encrypting the files.\n\nThe core of the encryption scheme of Hive ransomware is a union of XOR+RSA algorithms. In the figure below we can see the XOR related\nroutine:\n\n_Figure 9: Usage of XOR algorithm_\n\nThen, in this first version, it uses “.hive” as extension to the encrypted files, later it is used a unique ID instead. Moreover, the RemoveItself\n**routine drops “hive.bat” to remove itself. But, since the second version of the malware calls the related function after the encryption is**\ncomplete:\n\n_Figure 10: hive.bat_\n**RemoveShadowCopies drops “shadow.bat” to remove the shadow copies, from the second version will directly execute the command instead**\nof dropping a .bat:\n\n\n-----\n\n_Figure 11: shadow.bat_\n\n## Hive V2\n\nHash 25bfec0c3c81ab55cf85a57367c14cc6803a03e2e9b4afd72e7bbca9420fe7c5\n\nThreat Ransomware\n\nBrief Description Hive Ransomware v2\n\nSSDEEP 12288:Sw41dVZvThPCsM18GLHe7wlDdkPAQEtxr0fflvRmhEBWtdUJiAUtP/T/kAfMvgV:dod1HDmlDdkZ4YXPpaTTXMw\n\nTable 3: Hive v2\nWith the second version of Hive, the malware writers started to complicate the code in order to make the analysis more difficult for the analyst.\nThe initial step is to obfuscate the “Go Build ID” header present in all golang- written binaries.\n\n_Figure 12: Strings comparison_\nThe simple trick causes that, when opening a disassembler, like IDA, the analyst can immediately see Golang not being recognized. However,\na simple fix provides the overwriting of the build-id with a legit one.\n\n_Figure 13: “Go Build ID” patch_\nIn addition, now the strings are obfuscated, and the names of the functions present inside the main are not visible in cleartext:\n\n\n-----\n\n_Figure 14: Obfuscated parameters_\n\nIn the following screen two different routines for the strings obfuscation is provided:\n\n_Figure 15: Strings decryption routines_\nThe help command has also changed, it has more default values, the “-t” and “-skip” parameters have been removed, “-grant” has been added\nand “-no-clean” renamed to “-no-wipe”\n\n**Parameter** **Description**\n\n-grant Grant permissions to all files\n\n-kill Regex, names of the processes to kill. Default values: \"agntsvc|sql|CNTAoSMgr|dbeng50|dbsnmp|encsvc|excel|firefoxconfig|infopat\n\n-no-wipe Skip wipe of free space\n\n\n-----\n\n-stop Regex, names of the services to stop. Default values: \"acronis|AcrSch2Svc|Antivirus|ARSM|AVP|backup|bedbg|CAARCUpdateSvc|C\n|mfemms|mfevtp|MMS|MsDtsServer|MsDtsServer100|MsDtsServer110|msexchange|msmdsrv|MSOLAP|MVArmor|MVarmor64|NetM\n\n_Table 4: Hive v2 parameters_\nThe string obfuscation process does not impact the structure of the main function, following a comparison of these two versions.\n\n_Figure_\n\n_16: Functions name comparison_\n\n## Hive V3\n\nHash 8a461e66ae8a53ffe98d1e2e1dc52d015c11d67bd9ed09eb4be2124efd73ccd5\n\nThreat Ransomware\n\nBrief Description Hive Ransomware v3\n\nSSDEEP 49152:gWVNVvSGbjmrb/T6vO90dL3BmAFd4A64nsfJuhQ8jmp4S3C5CEg+eNgiQJfOqAD:gWYQjPhQCmppnMfO\n\n_Table 5: Hive v3_\nIn this version the “-skip” parameter has been restored and, in another sample\n(3858e95bcf18c692f8321e3f8380c39684edb90bb622f37911144950602cea21), we found a new parameter named “scan”:\n\n**Parameter** **Description**\n\n-scan Scan local network for shares\n\n_Table 6: Hive v3 Additional parameters_\nComparing the logs from the v1 we can spot the following differences:\n\nThe key name is longer and it has a random extension\nIt shows the time elapsed for the encryption of each file\n\n_Figure 17: Comparison of logs_\n\n\n-----\n\n## Linux/FreeBSD version\n\nThe third version of the development of Hive ransomware saw the porting of the codebase for other operating systems, such as\nLinux/FreeBSD and ESXi.\n\nThe Linux (12389b8af28307fd09fe080fd89802b4e616ed4c961f464f95fdb4b3f0aaf185) and FreeBSD\n(bdf3d5f4f1b7c90dfc526340e917da9e188f04238e772049b2a97b4f88f711e3) versions are almost identical to the Windows one, despite the\nobvious OS differences. One of those differences is the following function “KillNonRoot” aimed at killing all non-root processes:\n\n_Figure 18: “KillNonRoot” Function_\n\n## Hive v3 ESXI\n\nHash 822d89e7917d41a90f5f65bee75cad31fe13995e43f47ea9ea536862884efc25\n\nThreat Ransomware\n\nBrief Description Hive Ransomware v3\n\nSSDEEP 3072:3Zp7gZzdfvjRCMj1Yk36ioyJ1zgjIlOhXYopNL+V7o0xvvkB/37Nt7xhew8A2Mz:P7gDj8S1Hlx14+opNClvk977ew8A2M\n\n_Table 7: Hive v3 ESXI_\nIn this case, the malware is written in C/C++, in order to have a better compatibility with the target operating system, the strings are not\nobfuscated, and we have found some new parameters:\n\n**Parameter** **Description**\n\n-no-stop Don’t stop virtual machines\n\n-low-cpu Single thread encryption\n\n_Table 8: Hive v3 ESXI Parameters_\nAfter the routine of exporting the keys already seen in the previous paragraphs, the sample stops all the running virtual machines in order to\nencrypt them without problems:\n\n\n-----\n\n_Figure 19: “Stopping virtual machines_\nThe ransom note contains also a reference to not delete or reinstall the virtual machines:\n\n_Figure 20: Ransom note_\n\nAs said, the objective of this version is to encrypt the virtual machines hosted on the ESXi server, so, the malware goes to find the virtual\nmachines deployed on the server, by using a custom regex aimed at finding the words “vm” or “vs”.\n\n_Figure 21: Regex for ESXI version_\n\n## Hive v4\n\nHash 33aceb3dc0681a56226d4cfce32eee7a431e66f5c746a4d6dc7506a72b317277\n\nThreat Ransomware\n\nBrief Description Hive Ransomware v4\n\nSSDEEP 49152:e2NiZPNNirb/T2vO90dL3BmAFd4A64nsfJk0NuXCdmTQb0/6VCrrPrsbg11VgWA:e2ANB04yIa0hsirubO\n\n_Table 9: Hive v4_\nThe fourth version of Hive locker is an effort to obfuscate also the code. We haven’t noticed new features or upgrades except for a more\nserious obfuscation of the code and changes in the details of the key generation and encryption.\n\nIn detail, this version adopts the control flow flattering obfuscation technique, which is largely adopted by many attackers, thanks to its actual\neffectiveness. Below an example of that technique:\n\n\n-----\n\n_Figure 22: Control flattening_\n\n_obfuscation_\n\n## Hive v5\n\nThe fifth version of hive represents a sort of revolution inside the entire codebase. In this version, the major differences include the changing of\nthe base programming language and the refinement encryption algorithm.\n\nHash b6b1ea26464c92c3d25956815c301caf6fa0da9723a2ef847e2bb9cd11563d8b\n\nThreat Ransomware\n\nBrief Description Hive Ransomware v5.2\n\nSSDEEP 12288:BLF6OtM1z8JLbA689tSfvTvFSYIzp4yzhrWbttQfaa4Gxjzgdlo/AhwN/eh9z/E:BLF6gb0xqx9z/EO3BxhR\n\n_Table 10: Hive v5_\nHive is now written in Rust and for this reason the difficulty has increased, along with a complex encryption scheme makes the analysis harder\neven for experienced analysts.\n\nThe refinement of the encryption process considers the passing from “XOR+RSA” of the previous versions, arriving to\n“ECDH+Curve25519+XChaCha20-Poly1305”\n\nFor this version we found the following parameters:\n\n**Parameter** **Description**\n\n-no-local Don’t encrypt local files\n\n-no-mounted Don’t encrypt on mounted network volumes\n\n-no-discovery Don’t discover network volumes\n\n-local-only Encrypt only local files\n\n-network-only Encrypt only network volumes\n\n-explicit-only Encrypt specified folders\n\n-min-size Minimum file size\n\n-timerze-only N/A\n\n-da N/A\n\n_Table 11: Hive v5 parameters_\nOnce executed, the sample checks for the parameter “-u”, which should contain the “username:password” used as credentials for the victim\nand written in the ransom note, if this unique parameter is missing, the program exits.\n\n\n-----\n\n_Figure 23: -u_\n\n_parameter_\nEven the routine to decrypt the ransom note changed. In this case, the protection of the ransom note relies on a XOR key.\n\n_Figure 24: Decrypted Ransom Note_\n\nAnother update is the expansion on the other drives. The sample generates an array of drive labels and uses GetDriveTypeW to check if the\npath is invalid:\n\n_Figure 25: Finding of logical drives_\n\nOnce the attached volumes are found, it calls FindFirstVolumeW and SetVolumeMountPointW to mount eventual unmounted volumes:\n\n\n-----\n\n_Figure 26: Mounting_\n\n_available volumes_\nAfter that, the operation of privilege escalation is performed though abusing the “TrustedInstaller” service to recover its access token. In this\nway, the malware is able to read and write files with the same privileges of TrustedInstaller Group.\n\n_Figure_\n\n_27: Retrieving TrustedInstaller access token_\nMoreover, in the previous versions, we saw bat files and other escamotages for the erasing of the backup mechanisms provided by the\nMicrosoft Environment.\n\nIn the fifth version analyzed, there are the following tricks:\n\nvssadmin.exe delete shadows /all /quiet\n\n_Figure_\n\n_28: vssadmin_\n\nbcedit /set {default} bootstatuspolicy ignoreallfailures\n\n\n-----\n\n_29: bcedit_\n\nwbadmin delete systemstatebackup –keepversions:3\n\n_30: wbadmin_\n\n## Conclusion\n\n\n_Figure_\n\n_Figure_\n\n\nHive threat actor is one of the most sophisticated active threats. It does not care about the target, the only objective is to maximize the illicit\nprofits, even by causing the interruption of critical services. The continuous development of the ransomware payload should not be\nunderestimated, and in the same way organizations must upgrade their cyber protections.\n\nWe at Yoroi ZLab believe that collaboration and sharing more information possible about attackers is the right way to pursue to defend these\nentities. We know that having to deal with these threats is challenging, so we are pointing to create the best expertise needed to handle such\nincidents whether they happen.\n\nIn conclusion, we need to create a solid and reliable strategy to defend our customers. we encourage our customers to make assessments\nand awareness campaigns for their employees. The goal of the Defence Center of Yoroi is to guarantee the best protection in every phase of\nthe attack, starting from the continuous monitoring arriving to the Incident Response engagements.\n\n## Appendix\n\n### Indicators of Compromise\n\nHive v1\n\n88f7544a29a2ceb175a135d9fa221cbfd3e8c71f32dd6b09399717f85ea9afd1 (Sample)\nd158f9d53e7c37eadd3b5cc1b82d095f61484e47eda2c36d9d35f31c0b4d3ff8 (shadow.bat)\n\nHive v2:\n\n25bfec0c3c81ab55cf85a57367c14cc6803a03e2e9b4afd72e7bbca9420fe7c5\n\nHive v3\n\n8a461e66ae8a53ffe98d1e2e1dc52d015c11d67bd9ed09eb4be2124efd73ccd5\n\nHive v3 Linux/FreeBSD\n\n12389b8af28307fd09fe080fd89802b4e616ed4c961f464f95fdb4b3f0aaf185 (Linux)\nBdf3d5f4f1b7c90dfc526340e917da9e188f04238e772049b2a97b4f88f711e3 (FreeBSD)\n\nHive v3 ESXI\n\n\n-----\n\n8 d89e 9 d a90 5 65bee 5cad3 e 3995e 3 ea9ea53686 88 e c 5\n\nHive v4\n\n33aceb3dc0681a56226d4cfce32eee7a431e66f5c746a4d6dc7506a72b317277\n\nHive v5.2\n\nb6b1ea26464c92c3d25956815c301caf6fa0da9723a2ef847e2bb9cd11563d8b\n\n### Yara Rules\n\n\n-----\n\n```\n{\n\n strings:\n\n  $1 = {648b0d140000008b89000000003b61080f86e401000083ec40e8?2f?feff8b04248b4c240485c90f8556010000b94100000031d231db8d2d?4??\n6300eb0341d1e883f95a0f8f29010000a90100000074ed895c2434896c243c894c242489542430894424288d44242c}\n\n condition:\n\n  $1 and uint16(0) == 0x5A4D\n\n}\n\nrule hive_v1_64_win\n\n{\n\n strings:\n\n  $1 = { 65 4? 8b 0c ?5 28 00 00 00 4? 8b 89 00 00 00 00 4? 3b 61 10 0f 86 ?? ?? ?? ?? 4? 83 ec 40 4? 89 6c ?4 38 4? 8d 6c ?4 38\n4? 8b 44 ?4 48 4? 89 04 ?4 e8 ?? ?? ?? ?? 4? 8b 44 ?4 08 4? 8b 4c ?4 10 4? 83 7c ?4 08 00 0f 85 ?? ?? ?? ?? 4? 89 44 ?4 20 4? 89 4c\n?4 18 4? 8b 44 ?4 48 4? 89 04 ?4 90 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89 04 ?4 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89 04 ?4 0f 1f 40 00\ne8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89 04 ?4 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89 04 ?4 0f 1f 40 00 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89\n04 ?4 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89 04 ?4 0f 1f 40 00 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 4? 89 04 ?4 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48\n4? 89 04 ?4 0f 1f 40 00 e8 ?? ?? ?? ?? 4? 8b 44 ?4 48 80 78 48 00 74 ?? 90 0f 57 c0 0f 11 44 ?4 28 4? 8d 05 ?? ?? ?? ?? 4? 89 ?? ?4\n28 4? 8d 05 ?? ?? ?? ?? 4? 89 ?? ?4 30 4? 8d 44 ?4 28 4? 89 04 ?4 4? c7 44 ?4 08 01 00 00 00 4? c7 44 ?4 10 01 00 00 00 e8 ?? ?? ??\n?? 4? 8b 44 ?4 20 4? 89 44 ?4 50 4? 8b 44 ?4 18 4? 89 44 ?4 58 4? 8b 6c ?4 38 4? 83 c4 40 c3 4? 89 04 ?4 e8 ?? ?? ?? ?? eb ?? 4? 89\n44 ?4 50 4? 89 4c ?4 58 4? 8b 6c ?4 38 4? 83 c4 40 c3 }\n\n condition:\n\n  $1 and uint16(0) == 0x5A4D\n\n}\n\nrule hive_v2_v3_32_win\n\n{\n\n strings:\n\n//prenotify routine\n\n  $1 = { 64 8b 0d 14 00 00 00 8b 89 00 00 00 00 3b 61 08 0f 86 ?? ?? ?? ?? 83 ec ?? c7 44 ?4 04 ?? ?? ?? ?? c7 04 ?4 ?? ?? ?? ??\ne8 ?? ?? ?? ?? e8 ?? ?? ?? ?? 8b 04 ?4 8b 4c ?4 04 c7 44 ?4 4c 00 00 00 00 c7 44 ?4 50 00 00 00 00 89 04 ?4 89 4c ?4 04 e8 ?? ?? ??\n?? 8b 44 ?4 08 8d 0d ?? ?? ?? ?? 89 4c ?4 4c 89 44 ?4 50 8d 44 ?4 4c 89 04 ?4 c7 44 ?4 04 01 00 00 00 c7 44 ?4 08 01 00 00 00 e8 ??\n?? ?? ?? 8b 44 ?4 68 89 04 ?4 e8 ?? ?? ?? ?? 8b 44 ?4 04 89 44 ?4 48 8b 4c ?4 08 89 4c ?4 38 31 d2 eb ?? }\n\n condition:\n\n  $1 and uint16(0) == 0x5A4D\n\n}\n\nrule hive_v2_64_win\n\n{\n\n strings:\n\n   $1 = {654?8b0c?5280000004?8b89000000004?8d44????4?3b41100f86????????4?81ec????????4?89ac??????????4?8dac??????????4?\nb8????????????????4?8904?4e8????????e8????????4?8b04?44?8b4c?4080f57c00f1184??????????4?8904?44?894c?408e8????????4?8b44?4104?\n8d0d????????4?898c??????????4?8984??????????4?8d84??????????4?8904?44?c744?408010000004?c744?41001000000e8????????4?8b84??????????\n4?8904?40f1f440000e8????????4?8b44?4084?8b4c?4104?85c97e??4?89?c} \n\n condition:\n\n  $1 and uint16(0) == 0x5A4D\n\n}\n\nrule hive_v3_v4_64_win\n\n{\n\n strings:\n\n  $1 = {4? 3b 66 10 0f 86 ?? ?? ?? ?? 4? 83 ec 30 4? 89 6c ?4 28 4? 8d 6c ?4 28 4? 89 44 ?4 20 0f 1f 00 e8 ?? ?? ?? ?? 4? 85 c0\n0f 85 ?? ?? ?? ?? 4? 8b 44 ?4 20 e8 ?? ?? ?? ?? 4? 85 c0 74 ?? 4? 8b 6c ?4 28 4? 83 c4 30 c3 4? 89 44 ?4 10 4? 89 5c ?4 18 4? 8b 44\n?4 20 e8 ?? ?? ?? ?? 4? 8b 44 ?4 20 e8 ?? ?? ?? ?? 4? 8b 44 ?4 20 e8 ?? ?? ?? ?? 4? 89 c3 4? 8b 44 ?4 20 e8 ?? ?? ?? ?? 4? 8b 44 ?4\n20 e8 ?? ?? ?? ?? 4? 8b 44 ?4 20 e8 ?? ?? ?? ?? 4? 8b 44 ?4 20 e8 ?? ?? ?? ?? 4? 8b 44 ?4 20 90 e8 ?? ?? ?? ?? 4? 8b 44 ?4 10 4? 8b\n5c ?4 18 4? 8b 6c ?4 28 4? 83 c4 30 c3 4? 8b 6c ?4 28 4? 83 c4 30 c3}\n\n condition:\n\n  $1 and uint16(0) == 0x5A4D\n\n}\n\nrule hive_v5_32_win\n\n{\n\n strings:\n\n  $1 = {5589e553575681ec440400008b75108b7d0c89d3894dc88d85b0fbffff68000400006a0050e8????????\n83c40c0fbec3b9abaaaaaa8b0485c0b949008945e889f0f7e1d1ea8d045229c683f60389f0f7e131c9d1ea8d04528d570229c68b45148955cc8975e48b00}\n\n condition:\n\n  $1 and uint16(0) == 0x5A4D\n\n}\n\n\nrule hive_v5_64_win\n\n{\n\n strings:\n\n  $1 =\n{4157415641554154565755534881ec880400004c89cd448844243789d648894c2450488b9c24f0040000488bbc24f8040000488d8c248800000041b80004000031d\n00480fbec6488d0d??????\n004c8b24c148b9abaaaaaaaaaaaaaa4889d848f7e148d1ea488d04524989de4929c64983f6034c89f048f7e148d1ea488d04524929c6488b07}\n\n   di i\n\n```\n\n-----\n\n```\n}\n\nrule hive_v3_esxi\n\n{\n\n strings:\n\n  $s1 = \"+ prenotify %s\"\n\n  $s2 = \"Stopping VMs\"\n\n  $s3 = \"(.+)\\\\.(.+?)\\\\.%s$\"\n\n  $s4 = \"\\\\.(vm|vs)\\\\w+$\"\n\n  $c = {f3 0f 1e fa 55 4? 89 e5 4? 83 ec 20 4? 89 7? ?? 4? 8b 4? ?? 4? 89 c7 e8 ?? ?? ?? ?? 89 4? ?? 83 7? ?? 00 74 ?? 8b 4? ??\neb ?? 4? 8b 4? ?? 4? 89 c7 e8 ?? ?? ?? ?? 89 4? ?? 83 7? ?? 00 74 ?? 4? 8d 3d ?? ?? ?? ?? e8 ?? ?? ?? ?? 8b 4? ?? eb ?? 4? 8b 4? ??\n4? 89 c7 e8 ?? ?? ?? ?? 4? 8b 4? ?? 4? 89 c7 e8 ?? ?? ?? ?? 4? 8b 4? ?? 4? 89 c7 e8 ?? ?? ?? ?? 4? 8b 4? ?? 4? 89 c7 e8 ?? ?? ?? ??\n4? 8b 4? ?? 4? 89 c7 e8 ?? ?? ?? ?? b8 00 00 00 00 c9 c3}\n\n condition:\n\n  (all of ($s*) or $c) and uint32(0) == 0x464C457F\n\n}\n\n\n\n```\n_This blog post was authored by Luigi Martire, Carmelo Ragusa of Yoroi Malware ZLAB_\n\n[Download The Report](https://yoroi.company/wp-content/uploads/2022/07/Yoroi-On-The-Footsteps-of-Hive-Ransomware.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-26 - On the FootSteps of Hive Ransomware.pdf"
    ],
    "report_names": [
        "2022-07-26 - On the FootSteps of Hive Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535646,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1660793523,
    "ts_modification_date": 1660793523,
    "files": {
        "pdf": "https://archive.orkl.eu/589b8ace589e6c1af3812548fa6facddc34550bf.pdf",
        "text": "https://archive.orkl.eu/589b8ace589e6c1af3812548fa6facddc34550bf.txt",
        "img": "https://archive.orkl.eu/589b8ace589e6c1af3812548fa6facddc34550bf.jpg"
    }
}