{
    "id": "1bd0d55a-86be-4b52-a7f1-14ccfbf25b84",
    "created_at": "2023-01-12T15:05:48.819516Z",
    "updated_at": "2025-03-27T02:16:26.431253Z",
    "deleted_at": null,
    "sha1_hash": "e821ee4c1f079613cb966daf53dc37afb17e70eb",
    "title": "2017-10-12 - The Beer Drinker’s Guide to SAML",
    "authors": "",
    "file_creation_date": "2022-05-28T19:13:07Z",
    "file_modification_date": "2022-05-28T19:13:07Z",
    "file_size": 951398,
    "plain_text": "# The Beer Drinker’s Guide to SAML\n\n**duo.com/blog/the-beer-drinkers-guide-to-saml**\n\n[Product](https://duo.com/product)\n## Product\n\n[Explore Our Products](https://duo.com/product)\nDuo provides secure access to any application with a broad range of capabilities.\n\n### Duo in Action\n\nClick through our instant demos to explore Duo features.\n\n[Explore Demos](https://duo.com/demos)\n\nWant access security that’s both effective and easy to use? You need Duo.\n\n[Start a Free Trial](https://signup.duo.com/)\n\n\n-----\n\n[Editions & Pricing](https://duo.com/editions-and-pricing)\n## Editions & Pricing\n\n[Compare Editions](https://duo.com/editions-and-pricing)\nGet the security features your business needs with a variety of plans at several price points.\n\n### Pricing Questions?\n\nGet in Touch\n\nHave questions about our plans? Not sure where to begin? Get in touch with us. We’ll help you\nchoose the coverage that’s right for your business.\n\n[Contact a Duo Representative](https://duo.com/about/contact)\n\n\n-----\n\n[Solutions](https://duo.com/solutions)\n## Solutions\n\n[Explore Our Solutions](https://duo.com/solutions)\nDuo provides secure access for a variety of industries, projects, and companies.\n\n### Passwordless Authentication\n\nUsers can log into apps with biometrics, security keys or a mobile device instead of a password.\n\n[Learn More](https://duo.com/solutions/passwordless)\n\n### Customer Story\n\nDuo Helps Box Enable Remote Work\n\n“Duo’s solution was really easy to deploy and is simple to manage.”\n\n**Mark Schooley, Senior Director, IT Operations & Engineering, Box**\n\n[Read The Customer Story](https://duo.com/solutions/customer-stories/box)\n\n\n-----\n\n[Partnerships](https://duo.com/partnerships)\n## Partnerships\n\n[Learn About Partnerships](https://duo.com/partnerships)\nPartner with Duo to bring secure access to your customers.\n\n### Customer Story\n\nEnfo Loves Duo's Customer Support\n\n“We feel that Duo really listens to the customers and delivers the product we need!”\n\n**Tuukka Vainiomäki - Senior Specialist of IT Security**\n\n[Read The Customer Story](https://duo.com/solutions/customer-stories/enfo)\n\n\n-----\n\n[Support](https://duo.com/support)\n## Support\n\n[See All Support](https://duo.com/support)\nHave questions? We’re here to help! Our support resources will help you implement Duo, navigate\nnew features, and everything in between.\n\n### Dedicated Support\n\nDedicated Support\n\nDuo Care is our premium support package. With a dedicated Customer Success team and\nextended support coverage, we'll help you make the most of your investment in Duo, long-term.\n\n[Learn More About Duo Care](https://duo.com/support/duo-care)\n\n\n-----\n\n[Resources](https://duo.com/resources)\n## Resources\n\n[See All Resources](https://duo.com/resources)\nExplore research, strategy, and innovation in the information security industry.\n\n### Duo Labs Research\n\nWe disrupt, derisk, and democratize complex security topics for the greatest possible impact.\n\n[Explore Labs Research](https://duo.com/labs)\n\n### Featured\n\nPasswordless: The Future of Authentication\n\nWith the rise of passwordless authentication technology, you'll soon be able to ki$$ Pa$$words\ng00dby3. Learn how to start your journey to a passwordless future today.\n\n[Get the Guide](https://duo.com/resources/ebooks/passwordless-the-future-of-authentication)\n\n[Contact Sales](https://duo.com/about/contact) [Free Trial](http://signup.duo.com/)\n[Contact Sales](https://duo.com/about/contact) [Free Trial](http://signup.duo.com/)\n\n\n-----\n\n**[Product & Engineering](https://duo.com/blog/category/product-and-engineering)**\nOctober 12th, 2017 [Greg Seador](https://duo.com/blog/post-author/gseador)\n\n## What Is SAML, and Why Does It Exist?\n\nThere’s often a knowledge gap in IT organizations when it comes to understanding how exactly SAML\nworks. Many administrators and engineers are familiar with traditional network-based authentication\nprotocols like RADIUS, LDAP and SSH, but reliance on SAML will increase as organizations continue to\ntransition to cloud-based vendors and services.\n\nThis blog post is intended to remove the mystery from SAML, explain the mechanics behind some of the\nmost common SAML use cases, and draw parallels to the unfortunately-fictional BaaS – Beer as a\nService, that is.\n\nSimply put, Security Assertion Markup Language (better known as its acronym, SAML) is a protocol for\nauthenticating to web applications. Federating identities is a common practice that amounts to having\nuser identities stored across discrete applications and organizations. SAML allows these federated apps\nand organizations to communicate and trust one another’s users.\n\nSAML provides a way to authenticate users to third-party web apps (like Gmail for Business, Office 365,\nSalesforce, Expensify, Box, Workday, etc.) by redirecting the user’s browser to a company login page,\nthen after successful authentication on that login page, redirecting the user’s browser back to that thirdparty web app where they are granted access. The key to SAML is browser redirects!\n\nTo combine analogies, if you think of single sign-on (SSO) as “one password to rule them all,”\nthink of SAML as the glue that binds them all together.\n\nSAML is most frequently the underlying protocol that makes web-based SSO possible. A company\nmaintains a single login page - behind it an identity store and various authentication rules - and can\neasily configure any web app that supports SAML, allowing their users to log in all web apps from the\nsame login screen with a single password. It also has the security benefit of neither forcing users to\nmaintain (and potentially reuse) passwords for every web app they need access to, nor exposing\npasswords to those web apps.\n\n## SAML in Action\n\nLet’s start with an example of Beer Drinker Bob, who wants to buy a beer at a concert. Beer as a\nService:\n\n\n-----\n\n1. Bob first walks over to the Wristband Tent, where his ID is checked and a wristband is provided.\n\nThe Wristband Tent is the identity provider; its purpose is to verify Bob’s identity and make sure he\nmeets the necessary criteria to get a wristband.\n\n1. Next, Bob walks over to the Beer Tent. The Beer Tent guy sees Bob’s wristband and hands him a\n\nbeer.\n\nThe Beer Tent is the service provider; it’s providing the thing Bob ultimately wants access to: beer!\n\nNow for an example with Software User Stu, who wants to log in to Salesforce. Software as a Service:\n\n1. Stu first navigates to a dashboard his company has configured, where he’s asked to authenticate\n\n(username + password + two-factor) and then can see all the applications he has access to.\n\nThe login process and dashboard are part of the identity provider; its main purpose is to verify\nStu’s identity\n\n1. Next, Stu clicks the Salesforce icon and is signed into Salesforce.\n\nSalesforce is the service provider; it’s the thing Stu ultimately wants access to.\n\nAnd that’s SAML in action! Stu logged into his company dashboard and automatically had access to\nevery cloud app his company uses, including Salesforce. When Stu clicked on the Salesforce icon, his\ncompany's identity provider generated an SAML assertion (a message asserting his identity), his\nbrowser navigated to Salesforce, and finally Salesforce validated that SAML Assertion and granted him\naccess.\n\n## Behind the Scenes With SAML\n\nIn SAML lingo what happened? Let’s start by defining some terms:\n\n\n-----\n\n**Identity Provider (IdP) - The software tool or service (often visualized by a login page and/or**\ndashboard) that performs the authentication; checking usernames and passwords, verifying\naccount status, invoking two-factor, etc. This was the Wristband Tent.\n\n**Service Provider (SP) - The web application where user is trying to gain access. This was the**\nBeer Tent.\n\n**SAML Assertion - A message asserting a user’s identity and often other attributes, sent over**\nHTTP via browser redirects. This was the wristband itself.\n\n### Step 1 Explained: Beer Drinker Bob Goes to the Wristband Tent, and Software User Stu Goes to the Company Dashboard\n\nThis step is where authentication by the IdP happens.\n\nFor Bob, authentication entailed the Wristband Tent checking to make sure he was who he said he was\n(his face matched the picture on his ID) and making sure he met the requirements (he was of drinking\nage).\n\nFor Software User Stu, authentication entailed checking his username and password, making sure his\naccount was active, and invoking two-factor authentication to make sure he actually was who he said he\nwas.\n\nThis is a good time to explain that it’s best to think of the IdP as a role in the SAML authentication\nworkflow, relative to the SP. The IdP is simply an authority that the SP trusts. What specifically the IdP\ndoes to verify a user isn’t of concern to the SP. The SP only cares if its one-and-only IdP approves of\nthe user and issues a SAML assertion.\n\nWhat the Wristband Tent does to verify a drinker’s identity before giving out a wristband is of no concern\nto the Beer Tent - they only care if the drinker has a wristband or not. The Wristband Tent could require\neach drinker present a driver’s license, passport, proof of residency, turn their clothes inside out, then do\n20 pushups.\n\nIt could even require they visit another tent - maybe a Necklace Tent - then return to the Wristband Tent\nwearing a necklace to get a wristband. The Beer Tent has no idea about any of this, nor does it care.\nThe only concern of the Beer Tent is whether or not a drinker arrives with a wristband.\n\nAgain, what the IdP does to verify a user’s identity is of no concern to the SP, Salesforce. Typically, IdPs\nask for a user’s credentials, but they can also ask for certificates, invoke two-factor authentication,\nrequire the user be on a particular network - and, you guessed it, they can even redirect the user\nsomewhere else to have the user pass yet even more tests. What an IdP does to verify a user’s identity\nis configured by the user’s company and can be influenced (or limited) by capabilities of the IdP solution\nitself.\n\nThinking of the IdP as a role can be helpful for understanding that many products on the market today\nfulfill the role of IdP. Duo Access Gateway, Microsoft AD FS, Okta, OneLogin, Ping, Centrify and\nShibboleth all serve the role of the IdP, to name a few.\n\n\n-----\n\nAfter the user is successfully authenticated, many IdP products then display a dashboard with tiles or\nicons of all the SPs available for that user to click on and be logged into. In our example, Stu clicked the\nSalesforce icon, which told his IdP to generate a SAML assertion for Salesforce that adheres to all of\nSalesforce’s requirements: what attributes need to be included in that assertion, and how it should be\nformatted for Stu to successfully gain access to Salesforce.\n\n### Step 2 Explained: Bob Goes to the Beer Tent and Stu Goes to Salesforce\n\nThis step is where verification of the SAML Assertion by the SP happens.\n\nFor Bob, verification entailed the Beer Tent checking to make sure his wristband was legitimate and\nissued by the Wristband Tent they trust.\n\nFor Stu, verification entailed Salesforce checking the SAML assertion to make sure it came from the IdP\nthat Salesforce trusts. In addition to checking the authenticity and validity of the SAML assertion,\nSalesforce also looks in the SAML assertion to see who Stu is and who he should be logged into\nSalesforce as.\n\nThere are often many SPs configured to a single IdP. So while Stu went to Salesforce this time, maybe\nnext time he’ll go to Gmail and his company dashboard (IdP) will generate a different SAML assertion\nthat adheres to Gmail’s requirements. This is like having many different tents - a Wine Tent, a Liquor\nTent, and our favorite Beer Tent - all who trust a single Wristband Tent. The Wristband Tent can issue a\ndifferent wristband for each of the Wine, Liquor or Beer Tents depending on where the drinker wants to\ngo.\n\n## IdP-Initiated vs SP-Initiated\n\n\n-----\n\nIdP-initiated versus SP-initiated refers to where the authentication workflow starts. It s often asked about\nbecause some service providers support SP-initiated logins while others don’t. What’s unique about the\nSP-initiated login is a SAML request.\n\nAn IdP-initiated login starts with the user first navigating to the IdP (typically a login page or dashboard),\nand then going to the SP with a SAML assertion. This is like first going to the Wristband Tent, then going\nto the Beer Tent after having received a wristband. The examples above where a user is logging into\nSalesforce and getting beer were both IdP-initiated.\n\nAn SP-initiated login starts with the user first navigating to the SP, getting redirected to the IdP with a\n_SAML request, then redirected back to the SP with a SAML assertion. This is like first going to the Beer_\nTent, getting sent over to the Wristband Tent because you don’t have a wristband, then returning to the\nBeer Tent when you do have a wristband.\n\nWhy does this matter, and what does it mean? What is a SAML Request? It matters because these\nredirects (go to the Wristband Tent, then come back to the Beer Tent) require that the SP issue a SAML\nrequest. A SAML request says, “This user is trying to log in, but they don’t have a SAML assertion yet.\nPlease help them get a SAML assertion, then send them back here.”\n\nHowever, not all SPs can issue SAML requests, which limits logging into that SP only as IdP-initiated.\n(And seriously, SPs, if this is you it’s time to join the party.) A SAML request is like someone going to the\nBeer Tent without a wristband, the Beer Tent writing a note saying, “This guy wants beer. Give him a\nwristband and send him back,” pinning the note to his shirt and shoving him toward the Wristband Tent.\nIt makes it easier for people who like to drink beer, and that’s why we prefer it.\n\n\n-----\n\n## Configuring SAML\n\nWe’ve covered the basics of what SAML is, how logging in with SAML works, and a few of the most\ncommon SAML scenarios. Now, let’s talk configuration specifics: setting up the tents.\n\nConfiguration for SAML must be done in two places: at the IdP and at the SP.\n\nThe IdP needs to be configured so it knows where and how to send users when they want to log in to a\nspecific SP. This is like setting up the Wristband Tent and making sure its workers know they’re checking\nIDs so that people can be served beer (and that they shouldn’t let minors have a wristband), and after\nthey issue a wristband to point people toward the Beer Tent (rather than, say, a T-shirt Tent or out of the\nconcert venue).\n\nThe SP needs to be configured so it knows it can trust SAML assertions signed by the IdP. This is like\nsetting up the Beer Tent and making sure its workers know to look for wristbands that match the\nwristbands that their trusted Wristband Tent are issuing (as opposed to a friendship bracelet someone\njust happens to be wearing).\n\n### IdP Configuration\n\nSpecifications for a SAML assertion - what it should contain and how it should be formatted - are\nprovided by the SP and set at the IdP. This is like the Beer Tent dictating what they expect to be on a\nwristband and the Wristband Tent being made aware of those expectations.\n\nThe following values must be set at the IdP for each SP, and there’s often quite a few of them. This is\nlike a Beer Tent, a Whiskey Tent and a Wine Tent all trusting the same Wristband Tent. Often, IdP\nproducts can set these automatically behind the scenes, but as an admin you’ll need to provide at least\n_some of this information:_\n\n\n-----\n\n**EntityID - A globally unique name for the SP. Formats vary, but it s increasingly common to see this**\nvalue formatted as a URL.\n\nReal Example: `<EntityDescriptor entityID=\"https://beertent.com/concert\">`\nBeer Example: “Greg’s Concert Beers”\n\n**Assertion Consumer Service (ACS) - The URL location where the SAML assertion is sent.**\n\nReal Example: `https://beertent.com/saml/consume/`\nBeer Example: “Arrive at the left side of the Beer Tent. That’s where the line starts.”\n\n**ACS Validator - A security measure in the form of a regular expression (regex) that ensures the SAML**\nassertion is sent to the correct ACS. This only comes into play during SP-initiated logins where the\nSAML request contains an ACS location, so this ACS validator would ensure that the SAML requestprovided ACS location is legitimate.\n\nReal Example: `^https:\\/\\/beertent\\.com\\/saml\\/consume\\/$`\nBeer Example: “Make sure you’re going to this Beer Tent and not some other tent.”\n\n**Attributes - The number of and format of attributes can vary greatly. There’s usually at least one**\nattribute, the nameID, which is typically the username of the user trying to log in.\n\nReal Examples:\nNameID Format\nNameID Attribute\n\nBeer Examples:\n“The wristband shows your name is Bob Boozer.”\n“The wristband shows that was your first name and your last name.”\n\n**RelayState - Not required. Deep linking for SAML. This tells the SP where to take the user once they’ve**\nsuccessfully logged in.\n\nReal Example: `https://beertent.com/taps/lager/`\nBeer Example: “After the Beer Tent approves of your wristband, ask for a lager.”\n\n**SAML Signature Algorithm - SHA-1 or SHA-256. Less commonly SHA-384 or SHA-512. This**\nalgorithm is used in conjunction with the X.509 certificate mentioned below.\n\nReal Example: SHA-256\nBeer Example: “The wristband has a hologram, so you know it’s real.”\n\n### SP Configuration\n\nThe reverse of the section above, this section speaks to information provided by the IdP and set at the\nSP. This would be the information we provide to the Beer Tent to give them a way to validate that the\nwristbands drinkers arrive with were truly issued by the Wristband Tent they trust.\n\n**X.509 Certificate - A certificate provided by the IdP, used to verify the public key as passed by the IdP**\nin the metadata of the SAML assertion. It allows the SP to verify the SAML assertion is actually coming\nfrom the IdP it trusts. SAML assertions are usually signed, however SAML requests can also be signed.\n\n\n-----\n\nTypically, it s downloaded or copied from the IdP and configured by uploading or pasting it to into the SP.\n\n**Issuer URL - Unique identifier of the IdP. Formatted as a URL containing information about the IdP so**\nthe SP can validate that the SAML assertions it receives are issued from the correct IdP.\n\nReal Example:\n```\n   <saml:Issuer>https://access.wristbandtent.com/saml2/idp/metadata.php</saml:Issuer>\n\n```\nBeer Example: “Only accept SAML assertions that are issued from a Wristband Tent that matches\nthis description.”\n\n**SAML SSO Endpoint / Service Provider Login URL - An IdP endpoint that initiates authentication**\nwhen redirected here by the SP with a SAML request.\n\n**SAML SLO (Single Log-out) Endpoint - An IdP endpoint that will close the user’s IdP session when**\nredirected here by the SP, typically after the user clicks “Log out.”\n\nReal Example: `https://access.wristbandtent.com/logout`\nBeer Example: “Go to this location at the Wristband Tent to have your wristband removed.”\n\n## How Is SAML Different From Oauth and Web Services Federation?\n\nWe hear about these other SAML alternatives in passing, but how do they differ? Should you have an\nopinion on which one is best? Understand that SAML, OAuth, and Web Services Federation (WS-Fed)\nall vary technically, as well as how they’re best put to use.\n\n**SAML - Most commonly used by businesses to allow their users to access services they pay for.**\nSalesforce, Gmail, Box and Expensify are all examples of service providers an employee would\ngain access to after a SAML login. SAML asserts to the service provider who the user is; this is\nauthentication.\n\n**WS-Fed - Web Services Federation is used for the same purposes as SAML, to federate**\nauthentication from service providers to a common identity provider. It’s well supported with certain\nIdPs, like Microsoft Active Directory Federation Services (AD FS), but it’s not prevalent with cloud\nservice providers. WS-Fed is arguably simpler than SAML for developers to implement, but its\nlimited support among IdPs and SPs alike make it a tough sell.\n\n**OAuth - Most commonly used by consumer apps and services so users don’t have to sign up for a**\nnew username and password. “Sign in with Google” and “Log in with Facebook” are examples of\nOAuth in the real world. OAuth delegates access to a person’s Google or Facebook account by a\nthird party.\n\nTypically the app the user is signing into can directly read information from the user’s profile or take\nactions (like post pictures or make updates) on their behalf; this is authorization. This would be like\ngoing to the Beer Tent and instead of the Beer Tent sending Bob to the Wristband Tent, they ask Bob to\nhand them his ID and sign off that the Beer Tent workers can go over to the Wristband Tent on his behalf\nand represent him; he is authorizing them.\n\nWhat’s more important is to look at prevalence of each technology for each use case. SAML is\nubiquitous in the workplace for cloud-based apps, while WS-Fed is not. Conversely, OAuth is ubiquitous\namong consumer apps.\n\n\n-----\n\n## Microsoft & AD FS Terminology\n\nMicrosoft’s Active Directory Federation Services has their own terminology and approach to SAML, so it\nwarrants a short explanation. Microsoft AD FS is an identity provider. Think of it as Microsoft’s solution\nto the Wristband Tent: tricky to understand if you’re new to the world of Wristband Tents, but very\ncustomizable.\n\n**Relying Party is the term that Microsoft AD FS uses to mean Service Provider.**\n\n**Claims Rules is another term that only Microsoft AD FS uses. Claims Rules are just that: rules**\nyou can apply to alter how or when to invoke authentication. For example, an admin could set up a\nclaims rule that only applies when a user comes to AD FS as they’re trying to get to Dropbox.\nPlus, it prevents them from using a mobile device, allowing that user to log in with a laptop or\ndesktop device but not their Android or iPhone. Some IdPs other than AD FS can create similar\nrules, but AD FS allows for some of the most robust and complex rule creation.\n\n**ImmutableID is the Microsoft Azure AD equivalent of an ObjectGUID. It’s not specific to AD FS,**\nbut it’s worth a mention.\n\n**WS-Fed is similar to SAML and abides by many of the same rules. It’s a protocol specifically**\ncreated by Microsoft and not widely supported by IdPs other than AD FS.\n\n## Troubleshooting Basics\n\nThe best way to troubleshoot SAML is the same way I recommend troubleshooting most issues: start\nwith the basics.\n\n1. Scope - Is the issue affecting all users, or just a few? If no users can sign in, that’s an immediate\n\nindicator of a service interruption or misconfiguration. If you’re setting up an IdP and SP for the\nfirst time, it’s probably a misconfiguration.\n\n2. Experience - What is the user experiencing that indicates an issue? Is the user getting an error on\n\nthe IdP login page? Or is the user getting an error generated by the SP after they successfully\nauthenticate to the IdP?\n\nBecause SAML “happens” via browser redirects, it’s usually pretty straightforward to determine where a\nproblem is occurring - just look at the URL. If a problem is occurring while on a URL belonging to your\nIdP, well, it’s probably an IdP issue. Same goes if it’s the URL of your destination SP.\n\n### Error at the IdP\n\nFor just a few users:\n\nIs there an error message? Does it give us any clues?\nIs the username and password valid?\nIs the user account unlocked?\nIs the user successfully passing two-factor authentication or any other authentication steps?\nTry again. Clear cache. Try in an incognito window. Try on a different machine. Is there a way to\nisolate and identify the issue?\nWhat do the logs show?\n\n\n-----\n\nFor all users:\n\nIs there an error message? Does it give us any clues?\nIs the user able to resolve the URL of the IdP and actually view the login page?\nIs your IdP able to communicate with your identity store (like Active Directory)?\nIf configurable, keep the authentication flow simple and get one step working at a time, i.e., work\nto make sure primary authentication is working successfully before moving on to troubleshoot twofactor authentication.\n\n### Error When Arriving to the SP\n\nFor just a few users:\n\nWhat is the error? Does it give us any clues?\nDoes the user have a valid username within the SP?\nCheck to make sure the username stored in the SP matches what is being passed in the SAML\n[assertion. My favorite tool for this is SAML Tracer, which allows you to easily view the contents of](https://addons.mozilla.org/en-US/firefox/addon/saml-tracer/)\na SAML assertion.\nDoes the user need to be in a specific group?\n\nFor all users:\n\nWhat is the error? Does it give us any clues?\nAre any users already provisioned within the SP?\nWhat does the SP expect the SAML assertion to look like? What are the required attributes and\ntheir formats?\nDo all users need to be in a specific group?\n\nNow that we've talked about the ins and outs of SAML, there's just one thing left to say: Cheers!\n\n### Authors\n\nGreg Seador\n\nSenior Solutions Engineer\n\n### Fresh Security News. Right to Your Inbox.\n\nSubscribe to get a monthly email featuring blog posts, research, infographics, videos, e‑books, security\nindustry news, all handcrafted by Duo. You may unsubscribe any time.\n\n\n-----\n\nSuccess! Thanks for signing up!\n\n[I have read and understand the Privacy Statement.](https://www.cisco.com/c/en/us/about/legal/privacy-full.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-12 - The Beer Drinker’s Guide to SAML.pdf"
    ],
    "report_names": [
        "2017-10-12 - The Beer Drinker’s Guide to SAML.pdf"
    ],
    "threat_actors": [
        {
            "id": "1c97ccfd-1888-492c-b7b9-bb52c4c3809b",
            "created_at": "2023-01-06T13:46:38.940529Z",
            "updated_at": "2025-03-27T02:00:02.957652Z",
            "deleted_at": null,
            "main_name": "Operation ShadowHammer",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation ShadowHammer",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535948,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653765187,
    "ts_modification_date": 1653765187,
    "files": {
        "pdf": "https://archive.orkl.eu/e821ee4c1f079613cb966daf53dc37afb17e70eb.pdf",
        "text": "https://archive.orkl.eu/e821ee4c1f079613cb966daf53dc37afb17e70eb.txt",
        "img": "https://archive.orkl.eu/e821ee4c1f079613cb966daf53dc37afb17e70eb.jpg"
    }
}