{
    "id": "1c0b99c8-a5a5-448e-806d-7a97642f66f1",
    "created_at": "2023-01-12T14:59:56.302773Z",
    "updated_at": "2025-03-27T02:16:26.330931Z",
    "deleted_at": null,
    "sha1_hash": "8e88f69e10cc5d60c700216b5f074c66d80fa51c",
    "title": "2020-09-02 - Cybersquatting- Attackers Mimicking Domains of Major Brands Including Facebook, Apple, Amazon and Netflix to Scam Consumers",
    "authors": "",
    "file_creation_date": "2022-05-27T22:34:40Z",
    "file_modification_date": "2022-05-27T22:34:40Z",
    "file_size": 9782737,
    "plain_text": "# Cybersquatting: Attackers Mimicking Domains of Major Brands Including Facebook, Apple, Amazon and Netflix to Scam Consumers\n\n**unit42.paloaltonetworks.com/cybersquatting/**\n\nZhanhao Chen, Janos Szurdi September 1, 2020\n\nBy [Zhanhao Chen and](https://unit42.paloaltonetworks.com/author/zhachenpaloaltonetworks-com/) [Janos Szurdi](https://unit42.paloaltonetworks.com/author/janos-szurdi/)\n\nSeptember 1, 2020 at 3:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [DNS security,](https://unit42.paloaltonetworks.com/tag/dns-security/) [Phishing,](https://unit42.paloaltonetworks.com/tag/phishing/) [scam,](https://unit42.paloaltonetworks.com/tag/scam/) [threat prevention,](https://unit42.paloaltonetworks.com/tag/threat-prevention/) [WildFire](https://unit42.paloaltonetworks.com/tag/wildfire/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/cybersquatting/)\n\n## Executive Summary\n\nUsers on the internet rely on domain names to find brands, services, professionals and\npersonal websites. Cybercriminals take advantage of the essential role that domain names\nplay on the internet by registering names that appear related to existing domains or brands,\nwith the intent of profiting from user mistakes. This is known as cybersquatting. The purpose\nof squatting domains is to confuse users into believing that the targeted brands (such as\nNetflix) own these domain names (such as netflix-payments[.]com) or to profit from users’\n\n\n-----\n\ntyping mistakes (such as whatsalpp[.]com for WhatsApp). While cybersquatting is not always\n\n[1]\n\nmalicious toward users, it is illegal in the U.S., and squatting domains are often used or\nrepurposed for attacks.\n\nThe Palo Alto Networks squatting detector system discovered that 13,857 squatting domains\nwere registered in December 2019, an average of 450 per day. We found that 2,595\n(18.59%) squatted domain names are malicious, often distributing malware or conducting\nphishing attacks, and 5,104 (36.57%) squatting domains we studied present a high risk to\nusers visiting them, meaning they have evidence of association with malicious URLs within\n[the domain or are utilizing bulletproof hosting.](https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-new-features/content-inspection-features/edl-for-bulletproof-isps)\n\nWe also ranked the Top 20 most abused domains in December 2019 based on adjusted\nmalicious rate, which means that a domain is either a target of many squatting domains or\nmost of these squatting domains are confirmed malicious. We found that domain squatters\nprefer profitable targets, such as mainstream search engines and social media, financial,\nshopping and banking websites. When visiting these sites, users are often prepared to share\nsensitive information, which opens them up to phishing and scams to steal sensitive\ncredentials or money if they can be deceived into visiting a squatting domain instead.\n\n\n-----\n\nFrom December 2019 to date, we observed a variety of malicious domains with different\nobjectives:\n\n**Phishing: A domain mimicking Wells Fargo (secure-wellsfargo[.]org) targeting**\ncustomers to steal sensitive information, including email credentials and ATM PINs.\nAlso, a domain mimicking Amazon (amazon-india[.]online) set up to steal user\ncredentials, specifically targeting mobile users in India.\n**Malware distribution: A domain mimicking Samsung (samsungeblyaiphone[.]com)**\nhosting Azorult malware to steal credit card information.\n**Command and control (C2): Domains mimicking Microsoft (microsoft-store-drm-**\nserver[.]com and microsoft-sback-server[.]com) attempting to conduct C2 attacks to\ncompromise an entire network.\n**Re-bill scam: Several phishing sites mimicking Netflix (such as**\n**netflixbrazilcovid[.]com) set up to steal victims’ money by first offering a small initial**\npayment for a subscription to a product like weight loss pills. However, if users don’t\ncancel the subscription after the promotion period, a much higher cost will be charged\nto their credit cards, usually $50-100.\n**Potentially unwanted program (PUP): Domains mimicking Walmart**\n(walrmart44[.]com) and Samsung (samsungpr0mo[.]online) distributing PUP, such as\nspyware, adware or a browser extension. They usually perform unwanted changes, like\nchanging the browser's default page or hijacking the browser to insert ads. Of note, the\nSamsung domain looks like a legitimate Australia educational news website.\n**Technical support scam: Domains mimicking Microsoft (such as microsoft-**\nalert[.]club) trying to scare users into paying for fake customer support.\n**Reward scam: A domain mimicking Facebook (facebookwinners2020[.]com)**\nscamming users with rewards, such as free products or money. To claim the prize,\nusers need to fill out a form with their personal information such as date of birth, phone\nnumber, occupation and income.\n**Domain parking: A domain mimicking RBC Royal Bank (rbyroyalbank[.]com)**\nleveraging a popular parking service, ParkingCrew, to generate profit based on how\nmany users land on the site and click the advertisements.\n\nWe studied domain squatting techniques including typosquatting, combosquatting, levelsquatting, bitsquatting and homograph-squatting (all defined below). Malicious actors can\nuse these techniques to distribute malware or to conduct scams and phishing campaigns.\n\nTo detect squatting domains, Palo Alto Networks developed an automated system to capture\n[emerging campaigns from newly registered domains, as well as from passive DNS (pDNS)](https://unit42.paloaltonetworks.com/newly-registered-domains-malicious-abuse-by-bad-actors/)\ndata. We continue to detect currently active cybersquatting domains – we identify malicious\nand suspicious squatting domains and designate them to the appropriate categories (such as\nphishing, malware, C2 or grayware). Protections against domains classified in these\ncategories are available in multiple Palo Alto Networks security subscriptions, including URL\nFiltering and [DNS Security.](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/dns-security)\n\n\n-----\n\nWe recommend that enterprises block and closely monitor traffic from these domains, while\nconsumers should make sure that they type domain names correctly and double-check that\nthe domain owners are trusted before entering any site. More tips can be found in this post\n[on how to protect against cyberattacks.](https://blog.paloaltonetworks.com/2020/04/network-working-from-home/)\n\n## Squatting Techniques\n\n**Typosquatting is one of the most common types of domain registration abuse.**\nTyposquatters intentionally register misspelled variants (such as whatsalpp[.]com) of target\ndomain names (whatsapp[.]com) to profit from users’ typing mistakes or to deceive users into\nbelieving that they are visiting the correct target domain. The most frequent typosquatting\ntechniques include registering names one edit distance from the original domain, as these\nare the most common and overlooked mistakes users make. For more information, readers\n[can refer to academic research papers on the scale and](https://www.usenix.org/system/files/conference/usenixsecurity14/sec14-paper-szurdi.pdf) [malicious use of typosquatting.](https://lirias.kuleuven.be/retrieve/290976)\n\n**Combosquatting is another widespread registration abuse that combines popular**\ntrademarks with words such as “security,” “payment” or “verification.” Combosquatting\ndomains like netflix-payments[.]com are often used in phishing emails, by scam websites\nand for social engineering attacks to convince users that they are visiting web content\nmaintained by the targeted trademark. For more information, readers can refer to this\n[academic paper on a longitudinal study of combosquatting.](https://dl.acm.org/doi/10.1145/3133956.3134002)\n\n**Homographsquatting domains take advantage of internationalized domain names (IDNs),**\nwhere Unicode characters are allowed (such as microsofŧ[.]com). Attackers usually replace\none or more characters in the target domain with visually similar characters from another\nlanguage. These domains can be perfectly indistinguishable from their targets, as in the case\nof apple.com, where the English letter \"a\" (U+0061) was replaced with the Cyrillic letter \"а\"\n[(U+0430). For more information, readers can refer to academic research papers on IDNs.](http://liubaojun.org/uploads/1/1/8/3/118316462/internationalized-domain-dsn18.pdf)\n\n**Soundsquatting domains take advantage of homophones, i.e., words that sound alike (for**\nexample, weather and whether). Attackers can register homophone variants of popular\ndomains, such as 4ever21[.]com for forever21[.]com. As text-to-speech software like Siri and\nGoogle Assistant becomes prevalent, more and more users will become vulnerable to the\nabuse of soundsquatting domains. For more information, readers can refer to this academic\n[research paper on soundsquatting.](https://link.springer.com/chapter/10.1007%2F978-3-319-13257-0_17)\n\n**Bitsquatting domains have a character that differs in one bit (such as micposoft[.]com) from**\nthe same character as the targeted legitimate domain (microsoft[.]com). Bitsquatting can\nbenefit attackers because a hardware error can cause a random bit-flip in memory where\ndomain names are stored temporarily. Thus, even though users type the correct domains,\nthey may still be led to malicious ones. Although such hardware errors are usually rare, an\n[academic research paper has shown that bitsquatting is a real threat.](https://www.securitee.org/files/bitsquatting_www2013.pdf)\n\n\n-----\n\n**Levelsquatting domains, such as the case of**\nsafety.microsoft.com.mdmfmztwjj.l6kan7uf04p102xmpq[.]bid, include the targeted brand’s\ndomain name as a subdomain. In this example, the victims of the phishing attack might\nbelieve they are visiting safety.microsoft.com, when instead, they are visiting the attacker’s\nwebsite. This attack is especially worrisome for mobile users because the browser's address\nbar might not be wide enough to display the entire domain name. For more information,\nreaders can refer to this academic paper for a more comprehensive study of levelsquatting\ndomains.\n\n## Detection of Various Squatting Techniques\n\nWe leverage lexical analysis to detect candidate squatting domains among the Palo Alto\n[Networks newly registered domain (NRD) and pDNS feeds. Our list of target domains is the](https://unit42.paloaltonetworks.com/newly-registered-domains-malicious-abuse-by-bad-actors/)\ncombination of popular domains in general and domains popular in specific categories, such\nas shopping and business. We generate the aforementioned squatting variants of the target\ndomains, and match them against our NRD feed and pDNS hostnames. Additionally, we\ncluster weekly collections of NRDs to see if registration campaigns target known brands.\n[After the initial discovery step, we leverage WHOIS data to filter out defensive registrations](https://icannwiki.org/Defensive_Registration)\nand a heuristic rule-based classifier to identify which domains are true squatting domains.\n\nFigure 1 shows the daily detection statistics for December 2019. During this period, we\ndetected 13,857 squatting domains (~450 per day). Since then, the number of daily\ndetections fluctuate from 200-900. To understand how these domains are leveraged for\n[abuse, we use URL Filtering to categorize them. We label domain names as malicious if](https://urlfiltering.paloaltonetworks.com/)\nthey are involved in distributing malware or phishing, or if they are being used for command\nand control (C2) communication. We label domains categorized as grayware, parked,\nquestionable, insufficient content and high-risk as suspicious. The average malicious rate of\nthe 13,857 squatting domains is 18.59% (2,595) and the average suspicious rate is 36.57%\n(5,104).\n\n\n-----\n\nFigure 1. Volume and malicious and suspicious rates of daily domain squatting in December\n2019.\nNext, we compare our detection of squatting domains to vendors found on VirusTotal.\nConsidering detection delays, we allow a 10-day time window for malicious squatting\ndomains to appear on VirusTotal. Figure 2 shows how well the top 10 vendors detected\nthese malicious and high-risk domains. The best-performing vendor covers about 25% of the\nmalicious or high-risk squatting domains that we detected. Meanwhile, other vendors cover\nless than 20% of our detections. Lastly, we found that 55% of malicious or high-risk squatting\ndomains are not detected by any vendors.\n\n\n-----\n\nFigure 2. Malicious and high-risk squatting domain detection on VirusTotal in December\n2019.\n\n## The Domain Squatting Ecosystem\n\nTo identify malicious infrastructure hotspots, we studied specific network elements and\nentities that typosquatters depend on for their operations. Specifically, we studied popular\nregistrars, name services, autonomous systems and certificate authorities used by domain\nsquatters.\n\nFor each chart outlined below, we considered the number of squatting detections to reflect\ntheir popularity among domain squatters, and the malicious IOC rate to quantify the degree\nof threat to users. Combining these two metrics, we calculated the adjusted malicious rate of\neach entity. Thus, a high adjusted malicious rate means that an entity is either targeted by\nmany squatting domains or most of these squatting domains are malicious.\n\n**Top 20 Most Abused Domains**\n\nDomain squatters prefer popular and thus profitable targets. Figure 3 shows the Top 20 most\nabused domains. These targets are popular websites, such as mainstream search engines\nand social media, financial, shopping and banking websites. Squatting domains mimicking\nthese websites benefit from their credibility to attract more users that can be scammed.\nTherefore, these targets have relatively high squatting detection numbers.\n\n\n-----\n\nFigure 3. Top 20 most abused domains in December 2019.\n\n**Top 10 Most Abused DNS Services and Autonomous Systems**\n\nNext, we look at the DNS services and the autonomous systems (AS) used by squatting\ndomains to understand their infrastructure preferences. An AS is a set of IP subnets\nmaintained by one or more network operators.\n\nThe name service used by domain squatters often signifies which registrar was used to\nregister the domain, where the squatting web page is hosted or which parking service these\ndomains utilize to profit from user traffic. Figure 4 displays the most abused name services of\nsquatting domains. Freenom.com and dnspod.com are often used by domain squatters, as\nthey provide cheap or free domain registration and domain hosting. DNSPod is known for\n[hosting shady DNS records and for providing services for malicious bulletproof hosting](https://abuse.ch/blog/dot-bit-the-next-generation-of-bulletproof-hosting/)\noperators. Level-squatters might choose to use registrar.eu as it supports an unlimited\nnumber of subdomains and free URL forwarding, which reduces the cost of deploying and\nscaling attacks.\n\n\n-----\n\nFigure 4. Top 10 most abused DNS services in December 2019.\nAdditionally, parkingcrew.net and above.com are popular parking services because they\nprovide a simple monetization avenue to domain owners, achieved by pointing domain\nnames’ DNS records to their name servers. Parking services usually show users parked\npages laden with ads or redirect users to affiliate marketing or malicious websites.\n\nAs hosting services often have their own AS, we observed that the AS distribution is\nsomewhat consistent with the name service distribution. The top three most abused AS\n(19495, 48635, 262254) belong to the three most abused name service providers,\nrespectively (freenom.com, registrar.eu, ddos-guard.net). The fourth most abused AS\n(40034) is owned by ztomy.com, a service [favored for DNS hijacking attacks.](https://blogs.cisco.com/security/hijacking-of-dns-records-from-network-solutions)\n\n\n-----\n\nFigure 5. Top 10 most abused autonomous systems in December 2019.\n\n**Top 10 Most Abused Registrars**\n\nRegistrars are entities that sell domain names to users. The most abused registrar,\nInternet.bs, provides free services preferred by domain squatters, including privacy-protected\nregistration and URL forwarding. We captured several level-squatting campaigns at this\nregistrar. In these campaigns, attackers set up hundreds of subdomains mimicking popular\ntarget domains under com-secure-login[.]info and com-finder-me[.]info. An example levelsquatting subdomain is www.icloud.com-secure-login[.]info. The second-most abused\nregistrar, Openprovider, offers cheap and easy bulk registrations, attracting many squatting\nregistrations. Additionally, we observed many domains from this registrar having their\nWHOIS records redacted for privacy. Our system discovered many level-squatting domains\nregistered at TLD Registrar Solutions using the .support TLD (top-level domain), including\n**icloud.com-iphone[.]support and apple.com.recover[.]support, which users might confuse**\nwith legitimate Apple technical support services.\n\n\n-----\n\nFigure 6. Top 10 most abused registrars in December 2019.\n\n**Top 5 Most Abused Certificate Authorities**\n\nAs HTTPS became common, cybercriminals increased the use of certificates to make their\nwebsites appear legitimate. Figure 7 provides an overview of the certificate authorities (CAs)\npreferred by squatting sites. The most popular CA is Cloudflare, as it offers a bundle,\nincluding free SSL encryption. The second most popular CA, cPanel Inc CA, is preferred by\ndomain squatters because of the convenience and the ease of its AutoSSL services.\nThrough cPanel’s management interface, their customers are able to finish all steps of SSL\n\n\n-----\n\nencryption, including certificate purchase, automatic installation and renewal. Thawte CA is\nnot a trusted CA anymore, and browsers will label their certificate as suspicious, but\nsquatting domains are still using it.\n\nFigure 7. Top 5 most abused certificate authorities in December 2019.\n\n## Malicious Usages and Threats\n\nIn this section, we discuss in detail different types of abuse leveraging squatting domains. It\nincludes malware distribution, phishing, C2 communication, potentially unwanted programs\n(PUPs), scams, ad-laden sites and affiliate marketing.\n\n**Phishing**\n\n\n-----\n\nPhishing is one of the most popular threats leveraging squatting domains. All of the different\nsquatting techniques we discussed can be used to lure users into believing that a squatting\ndomain is owned by the legitimate brand and to increase the efficiency of phishing and scam\ncampaigns.\n\nOne example is a combosquatting domain, secure-wellsfargo[.]org, which targets Wells\nFargo’s customers. This domain hosts a copy of Wells Fargo’s official site, as illustrated in\nFigure 8.a. However, this site is only the front-end portion of the original site, redirecting all\nclicks to the same login page (shown in Figure 8.b) to steal customers’ sensitive information,\nincluding email credentials and ATM PINs.\n\nFigure 8.a. Fake Wells Fargo website: secure-wellsfargo[.]org\n\n\n-----\n\nFigure 8.b. Phishing login page for secure-wellsfargo[.]orgFigure 9 demonstrates how\nanother combosquatting domain, amazon-india[.]online, mimicking Amazon, is set up to\nsteal user credentials, specifically targeting mobile users in India. As a common strategy, all\nlinks on this site first redirect users to the same product page (the middle screenshot in\nFigure 9) and then to the payment page. In this particular case, the perpetrators did not even\ngo through the trouble of optimizing the phishing page for desktop users.\n\nFigure 9. Fake Amazon website: amazon-india[.]online\n\n\n-----\n\n**Malware Distribution**\n\nSquatting domains are also often used to distribute malware. A combosquatting domain\nmimicking Samsung (samsungeblyaiphone[.]com) hosts Azorult malware\n5acd6d9ac235104f90f9a39c11807c37cdfb103d6c151cc1a2e4e38bf3dbe41f on the URL\n**samsungeblyaiphone[.]com/dolce.exe. Azorult malware is a credential and payment card**\ninformation stealer, usually spread by phishing emails. It has been an active threat since\n[2016 and is one of the top malware families. Once the malware executes, it will generate a](https://any.run/malware-trends/azorult)\nunique identifier for the compromised machine based on the machine’s globally unique\nidentifier and username. Then the malware will contact the C2 server with this identifier, and\nit will retrieve the configuration of the infected machine, including the running processes and\nservices. Additionally, Azorult malware often downloads payload from other compromised\nservers. The new payload can collect and send out sensitive data such as cookies, browser\ncredentials and cryptocurrency information.\n\nAnalyzing the malware sample downloaded from samsungeblyaiphone[.]com, we found that\nit attempted to send a POST request to samsungeblyaiphone[.]com/index.php, which is\nconsistent with this malware family’s [known behavior to exfiltrate data. Besides the observed](https://unit42.paloaltonetworks.com/unit42-new-wine-old-bottle-new-azorult-variant-found-findmyname-campaign-using-fallout-exploit-kit/)\nnetwork activity, the malware also displayed suspicious behaviors such as changing the\nsettings of Internet Explorer.\n\n**Command & Control (C2)**\n\nMalware instances on infected machines typically need to “phone home” to a C2 server for\nfurther commands to execute, to download new payloads or to perform data exfiltration.\nMalware often relies on domain names to locate C2 servers, and these domains are called\nC2 domains. While using squatting domains for C2 is uncommon, we speculate that the\nintention of those who do so is to evade automated detection (such as Domain Generation\nAlgorithm detection) and manual analysis.\n\nOur squatting detection system captured squatting domains mimicking Microsoft, microsoftstore-drm-server[.]com on January 30, 2020, and microsoft-sback-server[.]com on February\n[3, 2020. From the Palo Alto Networks WildFire Malware Analysis Engine, we retrieved](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nsimilar malware samples, including\nfa28b59eb0ccd21d3994b0778946679497399b72c2e256ebf2434553cb7bf373 and\ne7fb436bf7d8784da092315bce1d3511a6055da41fe67362bad7a4c5d3f0294e, connecting to\nthem. These two domain names used the previously mentioned DNSPod for name\n[resolution, which is infamous for being slow in responding to abuse investigations. First, the](https://www.spamhaus.org/news/article/784/)\nmalware resolved these domains to the same IP address 217.182.227[.]117. Then, it\ncommunicated through SSL traffic with the same [JA3 (SSL fingerprint):](https://github.com/salesforce/ja3)\n6312930a139fa3ed22b87abb75c16afa on client-side and\n4192c0a946c5bd9b544b4656d9f624a4 on server-side. Observing the same behavior, we\nconclude they were using the identical SSL application and were part of the same campaign.\n\n\n-----\n\nSimilar to most C2 domains, these two squatting domains were short-lived. They were only\nused for one to two days after registration and were then abandoned by attackers. Tracking\n217.182.227[.]117, we are able to find other C2 domains used by this campaign: store-inbox[.]com from Jan. 27-28, stt-box[.]com from Jan. 29-31, microsoft-store-drm-server[.]com\nfrom Jan. 31-Feb. 2, and microsoft-sback-server[.]com on February 3.\n\n**Potentially Unwanted Program (PUP)**\n\nA PUP could be either standalone software, like spyware or adware, or a browser extension.\nPUPs usually perform unwanted changes, like changing the browser's default page or\nhijacking the browser to insert ads. Researchers have shown that some PUP downloaders\nare also [repurposed for malware campaigns. Websites hosting PUPs usually try to scare](https://dl.acm.org/doi/pdf/10.1145/3321705.3329807)\nusers by showing them warning messages like “Your computer is infected!” or “Your license\nhas expired!” to convince them to download the advertised software.\n\nFigure 10 shows a combosquatting domain mimicking Walmart (walrmart44[.]com) that\ndistributes PUP. Depending on the browser used, it redirects users to landing pages offering\ndifferent types of PUPs for download. When we visit this domain in Safari, it tells us that our\nFlash player might be outdated and offers us the chance to download the newest version\nfrom their site, as illustrated in Figure 10.a. While using Chrome, we get a “click continue and\ninstall extension” page, as shown in Figure 10.b, which redirects users to the Chrome store\nfor the “Security for Chrome” extension. Alternatively, this website will occasionally redirect\nusers to various legitimate ecommerce websites, including Walmart, Amazon and Aliexpress.\nAfter repeated visits, it will remember the source IP address and reject further visits even if\nwe use different browsers (Figure 10.c).\n\n\n-----\n\nFigure 10.a. Redirection to PUP installation in Safari from walrmart44[.]com\n\nFigure 10.b. Redirection to PUP installation in Chrome from walrmart44[.]com\n\nFigure 10.c.\n\nwalrmart44[.]com blocks crawlers when visited too frequently.A combosquatting domain\nmimicking Samsung (samsungpr0mo[.]online) looks like a legitimate Australian educational\n\n\n-----\n\nnews website with a valid SSL certificate. However, visiting this site, users are faced with\npopup windows, warning them about security flaws (Figure 11.a). Clicking on the warnings,\nusers are redirected to a fake virus scanning page, which recognizes their operating system\nto increase credibility but will always display the same list of detected viruses (Figure 11.b).\nFinally, clicking the “Proceed” button takes users to a download page for a system repair tool,\nwhich is legitimate but potentially unwanted.\n\nFigure 11.a. samsungpr0mo[.]online displaying warning messages in the top right corner.\n\nFigure 11.b. A fake virus scanning page displays after clicking on a warning message from\nsamsungpr0mo[.]online\n\n\n-----\n\n**Technical Support Scam**\n\nTechnical support scams are social engineering attacks. An associated website’s purpose is\nto scare people with audio and visual warnings into believing that their machine is\ncompromised. It prompts people to call the displayed fake technical support center’s phone\nnumber. When people call the number, scammers will try to persuade them that the only way\nto save their machine is by paying for the fraudulent support service. In the case of\ncombosquatting, the domain name often contains keywords like “security,” “alert” and\n“warning.” An example domain mimicking Microsoft (microsoft-alert[.]club) shown in Figure\n12.a was registered on June 11, 2020. This website presents warning messages in\nJapanese (translated to English in Figure 12.b), renders dynamic content, such as a running\ncommand line window, and plays audio alerts.\n\nFigure 12.a. A technical support scam page hosted on microsoft-alert[.]club\n\n\n-----\n\nFigure 12.b. Translated to English.\n\n**Re-bill Scam**\n\nRe-bill scammers first offer a subscription to products such as weight loss pills in exchange\nfor a small initial payment. However, if users don’t cancel the subscription after the promotion\nperiod, a much higher cost will be charged to their credit cards, usually $50-100. Additional\ninformation on this type of scam can be found in Unit 42’s previous research on deceptive\naffiliate marketing. The combosquatting domain netflixbrazilcovid[.]com leverages both\nNetflix and the COVID-19 pandemic. The main page looks like the Portuguese Netflix site\n(Figure 13.a), and has the purpose of obtaining user email addresses. (It is shown translated\nto English in Figure 13.b.) A deceptive reward message (Figure 13.c) is then shown to\npotential victims. Finally, users are redirected to a survey and then to a re-bill scam page\n(Figure 13.d).\n\n\n-----\n\nFigure 13.a. A fake Netflix main page hosted on netflixbrazilcovid[.]com\n\nFigure 13.b. Translated to English.\n\nFigure 13.c. Deceptive social engineering reward email.\n\n\n-----\n\nFigure 13.d. A re-bill scam page distributed by deceptive reward email.\n\n**Reward Scam**\n\nAnother popular scam offers users rewards such as free products or money. When we\ninitially captured facebookwinners2020[.]com, it was under development with placeholder\nimages and texts, as shown in Figure 14.a. However, the perpetrators recently replaced\nplaceholders with meaningful content. From the screenshot, we could tell the page mimics a\nfree lottery related to Facebook. To claim the prize, users need to fill out a form with their\npersonal information such as date of birth, phone number, occupation and income (Figure\n14.b).\n\n\n-----\n\nFigure 14.a. Reward scam page under development: facebookwinners2020[.]com\n\nFigure 14.b. An application form on facebookwinners2020[.]com requesting personal\ninformation.\n\n**Domain Parking**\n\n\n-----\n\nA common and easy way to monetize user traffic is to use a parking service by pointing the\nsquatting domain’s IP address or NS record to the parking service’s servers. Figure 15\nprovides an example of a parked domain mimicking RBC Royal Bank, rbyroyalbank[.]com,\nleveraging a popular parking service, ParkingCrew, to generate profit based on how many\nusers land on the site and click the advertisements. In some cases, parking services also\nredirect users to scam and phishing pages. As the hostname in the certificate is different\nfrom the squatting domain, the browser will label it as “Not secure.” Parked pages usually\nshow users a list of advertisements related to the parked domain. In our example, the ads\nshown are related to financial services.\n\nFigure 15. A parked page for rbyroyalbank[.]com\n\n## Conclusion\n\nIn summary, domain squatting techniques leverage the fact that users rely on domain names\nto identify brands and services on the Internet. These squatting domains are often used for\nnefarious activities, including phishing, malware and PUP distribution, C2 and various\nscams. A high rate of malicious and suspicious usage among squatting domains was\nobserved. Therefore, continuous monitoring and analysis of these domains are necessary to\nprotect users.\n\nPalo Alto Networks monitors newly registered domains and newly observed hostnames from\npDNS and Zone files to capture emerging squatting campaigns. Our automatic pipeline\npublishes the domains it detects to URL Filtering and DNS Security using the appropriate\ncategory, including malware, phishing, C2 or grayware.\n\n\n-----\n\nAnalyzing the squatting ecosystem, we found that domain squatters prefer certain types of\ntarget domains, registrars, hosting services and certificate authorities. The following\nattributes are common in cases of malicious squatted domains:\n\nDomain names that are targeting known financial, shopping and banking domains.\nDomains that use frequently abused registrars and hosting services.\nDomains that do not have completely validated SSL certificates.\n\nTherefore, we advise everyone to be more careful when encountering these domains.\n\n[Palo Alto Networks customers using URL Filtering,](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/web-security) [DNS Security,](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/dns-security) [WildFire and](https://www.paloaltonetworks.com/products/secure-the-network/wildfire) Threat\nPrevention are protected from the threats related to squatting domains mentioned in this\n[blog. Using AutoFocus, our customers can further study the malware mentioned in this blog](https://www.paloaltonetworks.com/cortex/autofocus)\nby using the tag [AzoRult.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.AzoRult)\n\n## Acknowledgements\n\nSpecial thanks to Daiping Liu, Kelvin Kwan, Laura Novak, Jun Javier Wang, Vicky Ray, Eddy\nRivera, Erica Naone and Arun Kumar for their help with improving the blog.\n\n## IOCs\n\n**Sha256**\n\n5acd6d9ac235104f90f9a39c11807c37cdfb103d6c151cc1a2e4e38bf3dbe41f\n\nfa28b59eb0ccd21d3994b0778946679497399b72c2e256ebf2434553cb7bf373\n\ne7fb436bf7d8784da092315bce1d3511a6055da41fe67362bad7a4c5d3f0294e\n\n**JA3 Pair**\n\n**Client JA3: 6312930a139fa3ed22b87abb75c16afa**\n\n**Sever JA3: 4192c0a946c5bd9b544b4656d9f624a4**\n\n**Malware/Phishing Squatting Hostname**\n\namazon-india[.]online\n\napple.com.recover[.]support\n\ncom-finder-me[.]info\n\ncom-secure-login[.]info\n\nfacebook.com-account-login-manage.yourfiresale[.]com\n\nicloud.com-iphone[.]support\n\n\n-----\n\nmicrosoft-alert[.]club\n\nmicrosoft-sback-server[.]com\n\nmicrosoft-store-drm-server[.]com\n\nmicrosofŧ[.]com (xn--microsof-wyb[.]com)\n\nnetflix-payments[.]com\n\nnetflixbrazilcovid[.]com\n\nrbyroyalbank[.]com\n\nsafety.microsoft.com.mdmfmztwjj.l6kan7uf04p102xmpq[.]bid\n\nsamsungeblyaiphone[.]com\n\nsamsungpr0mo[.]online\n\nsecure-wellsfargo[.]org\n\nstore-in-box[.]com\n\nstt-box[.]com\n\nwww.icloud.com-secure-login[.]info\n\n**Grayware Hostname**\n\n4ever21[.]com\n\nfacebookwinners2020[.]com\n\nmicposoft[.]com\n\nwalrmart44[.]com\n\nwhatsalpp[.]com\n\n**URL**\n\nsamsungeblyaiphone[.]com/dolce.exe\n\nsamsungeblyaiphone[.]com/index.php\n\n**IP**\n\n217.182.227[.]117\n\n1. Anti-cybersquatting Consumer Protection Act (ACPA) (15 USC §1125(d)) ↑\n\n\n-----\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-02 - Cybersquatting- Attackers Mimicking Domains of Major Brands Including Facebook, Apple, Amazon and Netflix to Scam Consumers.pdf"
    ],
    "report_names": [
        "2020-09-02 - Cybersquatting- Attackers Mimicking Domains of Major Brands Including Facebook, Apple, Amazon and Netflix to Scam Consumers.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535596,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653690880,
    "ts_modification_date": 1653690880,
    "files": {
        "pdf": "https://archive.orkl.eu/8e88f69e10cc5d60c700216b5f074c66d80fa51c.pdf",
        "text": "https://archive.orkl.eu/8e88f69e10cc5d60c700216b5f074c66d80fa51c.txt",
        "img": "https://archive.orkl.eu/8e88f69e10cc5d60c700216b5f074c66d80fa51c.jpg"
    }
}