{
    "id": "1c101ff6-fd7a-45a1-8a4c-d2989710cc56",
    "created_at": "2023-01-12T15:02:36.479997Z",
    "updated_at": "2025-03-27T02:05:27.764777Z",
    "deleted_at": null,
    "sha1_hash": "f616079dee308416489b9192a0fe8cf32fd752de",
    "title": "2021-08-30 - LockFile ransomware uses intermittent encryption to evade detection",
    "authors": "",
    "file_creation_date": "2022-05-27T22:57:38Z",
    "file_modification_date": "2022-05-27T22:57:38Z",
    "file_size": 1242547,
    "plain_text": "# LockFile ransomware uses intermittent encryption to evade detection\n\n**[csoonline.com/article/3631517/lockfile-ransomware-uses-intermittent-encryption-to-evade-detection.html](https://www.csoonline.com/article/3631517/lockfile-ransomware-uses-intermittent-encryption-to-evade-detection.html)**\n\nLucian Constantin\n\nA new ransomware threat called LockFile has been victimizing enterprises worldwide since\nJuly. Key to its success are a few new tricks that make it harder for anti-ransomware\nsolutions to detect it.\n\nThe threat uses what researchers from antivirus vendor Sophos call “intermittent encryption,”\nmeaning it only encrypts chunks of data inside a file instead of its complete contents. This\nspeeds the encryption process, or better said data corruption process, significantly but also\ntricks ransomware protection systems that rely on statistical analysis to detect potentially\nunauthorized file encryption.\n\n## LockFile built with evasion in mind\n\nLockFile uses multiple techniques designed to evade detection, starting with its own\nexecutable file which is both packed and malformed. The first section of the file is full of\nzeroes and is followed by a second section that contains encoded data. Three functions\n\n\n-----\n\nlocated at the end decode the data from the second section, place it into the first section, and\nthen jump to that code to execute it. The goal of this routine is to throw off endpoint\nprotection software that monitors file execution.\n\nThe malware then leverages the Windows Management Interface (WMI) to scan for and kill\nimportant processes associated with business applications including Hyper-V virtual\nmachines, Oracle VM Virtual Box manager, Oracle VM Virtual Box services, Microsoft SQL\nServer, MySQL database, Oracle MTS Recovery Service, Oracle RDBMS Kernel, Oracle\nTNS Listener and VMware virtual machines.\n\nThe goal of killing these processes is to remove any system locks put on databases, virtual\nmachines, or configuration files put by those applications so that the ransomware can\nencrypt them. By leveraging the WMI, the processes will appear to be terminated by the\nsystem itself, not by the ransomware executable. This is another detection evasion technique\nthat is also designed to complicate incident response.\n\nAnother noteworthy trick is the way in which LockFile performs operations on files. The\nmalware doesn't directly modify files on disk, but maps them into the system's RAM memory\nfirst, performs the modifications there and then relies on the Windows System process to\ncommit the modifications to disk.\n\nTo a behavior monitoring product, this will appear as input/output (I/O) operations performed\nby the OS itself, not by a potentially suspicious process. It will also happen with a delay that\ncan range from seconds to minutes, depending on how busy the disk is.\n\nLockFile is not the first ransomware threat to use memory mapped I/O. Maze and\nWastedLocker have also used this technique, but it is not very common, Mark Loman,\n[Sophos's director of engineering for Next-Gen Technologies, said in a blog post.](https://news.sophos.com/en-us/2021/08/27/lockfile-ransomwares-box-of-tricks-intermittent-encryption-and-evasion/)\n\n## Intermittent encryption\n\nThe use of intermittent encryption, however, is a new development that the Sophos\nresearchers have not seen before in ransomware. Other threats like LockBit 2.0, DarkSide\nand BlackMatter have used partial encryption, encrypting only the beginning of documents to\nspeed the process, but LockFile's approach is different and significant.\n\nFrom a security perspective, incomplete encryption is bad because it leaves data exposed,\nbut the goal of ransomware is not data privacy. It is controlled and reversible data corruption\nthat just uses encryption as a tool. Therefore, ransomware doesn't need to encrypt the full\ncontents of files but just enough to make them unusable to the user, which is what LockBit\n2.0, DarkSide and BlackMatter achieve by encrypting the starting portion of files.\n\nLockFile's approach, however, is to encrypt every other 16 bytes of a file. So, the resulting\nfiles will contain 16 bytes of scrambled data, followed by 16 bytes of untouched original data,\nfollowed by another 16 bytes of scrambled data and so on This process is not as fast as\n\n\n-----\n\nencrypting just the starting portion but has another benefit: It skews statistical analysis.\n\nSome ransomware detection programs use statistical analysis tests to detect if a file\nmodification is the result of file encryption. If the test indicates that a file has been encrypted,\nthe program will block the process from modifying additional files.\n\nThis works because encrypted files, which are made up of random data, look very different\nfrom an unencrypted file to statistical analysis. One of the tests commonly used to detect\nstatistically significant differences in data is called the chi-squared (chi^2) test.\n\n\"An unencrypted text file of 481KB (say, a book) has a chi^2 score of 3850061. If the\ndocument was encrypted by DarkSide ransomware, it would have a chi^2 score of 334 –\nwhich is a clear indication that the document has been encrypted,\" Loman explained. \"If the\nsame document is encrypted by LockFile ransomware, it would still have a significantly high\nchi^2 score of 1789811.\" In other words, if a detection program is calibrated by its creators to\nonly detect and act on very big statistical differences to avoid false positives, it could miss the\nencryption performed by LockFile.\n\nThe last trick in LockFile's playbook is to delete itself after finishing the encryption process.\nThis can frustrate incident response because responders will search for a ransomware\nbinary to analyze and clean off the system.\n\n## LockFile distribution\n\nThe LockFile ransomware has been distributed by exploiting a series of vulnerabilities in\n[Microsoft Exchange servers known collectively as ProxyShell (CVE-2021-34473, CVE-2021-](https://www.zerodayinitiative.com/blog/2021/8/17/from-pwn2own-2021-a-new-attack-surface-on-microsoft-exchange-proxyshell)\n34523 and CVE-2021-31207). Patches for these vulnerabilities have been available since\n[April and May, but despite being more serious and easier to exploit than the ProxyLogon](https://www.csoonline.com/article/3616699/the-microsoft-exchange-server-hack-a-timeline.html)\nvulnerability exploited to install web shells on Exchange servers, they have not received the\nsame level of attention. As a result, many organizations have not patched their servers.\n\nThe group behind the ransomware is also leveraging an NTLM relay attack known as\n[PetitPotam to gain access to domain controllers inside corporate networks.](https://support.microsoft.com/en-us/topic/kb5005413-mitigating-ntlm-relay-attacks-on-active-directory-certificate-services-ad-cs-3612b773-4043-4aa9-b23d-b87910cd3429)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-30 - LockFile ransomware uses intermittent encryption to evade detection.pdf"
    ],
    "report_names": [
        "2021-08-30 - LockFile ransomware uses intermittent encryption to evade detection.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535756,
    "ts_updated_at": 1743041127,
    "ts_creation_date": 1653692258,
    "ts_modification_date": 1653692258,
    "files": {
        "pdf": "https://archive.orkl.eu/f616079dee308416489b9192a0fe8cf32fd752de.pdf",
        "text": "https://archive.orkl.eu/f616079dee308416489b9192a0fe8cf32fd752de.txt",
        "img": "https://archive.orkl.eu/f616079dee308416489b9192a0fe8cf32fd752de.jpg"
    }
}