{
    "id": "1c12c4e3-7e5a-4925-8611-b32e39ab128a",
    "created_at": "2022-10-25T16:48:21.329105Z",
    "updated_at": "2025-03-27T02:10:04.318205Z",
    "deleted_at": null,
    "sha1_hash": "38220419779f7259ef5e2aaebe1dcbbf882f66a6",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-09-14T15:22:59Z",
    "file_modification_date": "2016-09-22T21:34:43Z",
    "file_size": 10631211,
    "plain_text": "## The evolution of the Nymaim Criminal Enterprise Threat Intelligence & Analytics\n\n### Threat Study\n\n\n-----\n\n# Contents\n\n### Prologue \b 03\n\n Executive Summary \b 04\n\n Origins and Ownership \b 04\n\n Shifting Infection Vectors \b 04\n\n The Shift form Ransomeware to Banking Trojans and Emergence of GozNym      09\n\n Stealth Features \b 10\n\n Geographic Distribution and Targeting \b 10\n\n Conclusion \b 11\n\n Recommendations \b 11\n\n Indicators of Compromise (IOCs) \b 12\n\n References \b 15\n\n\n-----\n\n**Prologue**\nFinancially motivated threat actors often operate\nin ways similar to those of legitimate businesses,\ndespite the illegal nature of their actions. As with\nlegitimate businesses, some criminal operations\nare more customer-centric than others. Threat\nactors that collect payment card information (PCI),\nonline banking credentials, personally identifiable\ninformation (PII), or protected health information\n(PHI) usually sell that data to criminal customers\non underground markets, who use it for fraud.\nConsumers of such data often seek data from\nspecific geographic areas or financial institutions,\nso as to facilitate its monetization through\nwhatever fraud infrastructure they may have, such\nas a network of mules to cash out bank accounts,\nreceive fraudulently purchased packages, or\nuse fraudulent copies of credit cards for in-store\npurchases.\n\nThe monetization of ransomware infections\nis simpler than that of compromised banking\ncredentials, PCI, PII, or PHI. Ransomware actors\ncollect payments directly from their victims,\nrather than selling their victims’ data to third\nparties. Ransomware operations thus do not\nhave customers per se, although the ransom\nnotes of some ransomware families may address\ntheir victims as if they were the customers of a\nlegitimate business, in the hopes of persuading\nvictims to pay. The simpler monetization of\nransomware may have contributed to the\nescalating number of ransomware attacks and\nproliferation of new ransomware families in the\nfirst half of 2016.\n\nAt least one criminal group has defied this\noverwhelming trend in favor of ransomware –\nthe one responsible for the Nymaim malware\ndownloader and its GozNym banking Trojan\nvariant. This group shifted from its previous use\nof ransomware against victims for nearly two\nyears and has instead begun to target their online\nbanking credentials. There is no indication of why\nthis group would undertake this shift after using\nransomware for so long and go against the leading\ntrend in criminal malware in order to conduct\n\n\na type of attack whose monetization is more\ncomplex. It is possible that the group concluded\nthat the ransomware market was saturated and\nthus decided to move into online banking attacks\ninstead, but this shift began in November 2015 –\nbefore the current spike in ransomware attacks\nand proliferation of new ransomware families\nbegan.\n\nAnother possibility is that the obsolescence of\nthis group’s historic police ransomware payloads\nleft it less capable of competing with the newer\nand more sophisticated crypto-ransomware\nfamilies. Police ransomware locks a victim’s\nscreen and uses a law enforcement-themed\nmessage to demand a “fine” for allegedly illegal\nonline activities. This form of ransomware has\ndeclined, as crypto-ransomware, which encrypts a\nvictim’s files and holds them for ransom, has now\nbecome the prevailing form of ransomware. This\npoint nonetheless raises the question of why the\ngroup did not simply begin to use a newer, more\nadvanced crypto-ransomware payload instead.\n\nLike legitimate businesses, criminal threat actors\nmay have criminal vendors from whom they\npurchase products and services that they need\nfor their own operations. Like many legitimate\ntechnology providers, they may also complement\nany proprietary or third-party products or\nservices with openly available code. In the case\nof criminal actors, this freely available code may\ncome from leaks or the recycling of source code\nfor criminal malware families on underground\nthreat actor forums. In the case of the Nymaim\ngroup, they may have originally recycled their\nhistoric ransomware payload from that of another\ngroup. The Nymaim group also reused existing\nbanking Trojan code when it shifted to online\nbanking attacks as well. Indeed, it is possible that\nthe Nymaim downloader, the core of this group’s\noperations, may be its only original contribution\nto those operations. In any event, it has made that\ndownloader the centerpiece of an enterprise that\notherwise relies extensively on products, services,\nand code from other actors.\n\n\n-----\n\n**Executive Summary**\nThe Nymaim malware family, which includes\nits original downloader and its newer GozNym\nbanking Trojan variant, has been active since at\nleast 2013. Its origins are unclear, and it may be\nthe proprietary product of a criminal actor or\ngroup that developed it and retains exclusive\naccess to it. Some trends in the use of Nymaim\nand its variants over the past three years lend\nadditional credence to that possibility. If Nymaim\nactivity is the product of just one group, that\ngroup has nonetheless relied extensively on a\nvariety of external services and sources for both\ninitial infection vectors and second-stage malware\npayloads.\n\nNymaim’s infection vectors have shifted repeatedly\nover the course of three years. A recurring theme\nin many of those infection vectors has been the\ninvolvement of other threat actors and groups\nthat may have provided these infection-enabling\nservices to Nymaim operators. These other actors\nhave included TA530, Dmitry “Paunch” Fedotov, and\nthe operators of the botnet that spreads the Dridex\nbanking Trojan and Locky ransomware. Despite\nthese shifts in infection vectors, lure documents\nthat mimic the branding of accounting software\nvendors have been a recurring theme in Nymaimrelated attacks since 2015.\n\nPolice ransomware was Nymaim’s typical secondstage payload from its emergence in 2013 until\n2015. Nymaim operators may have recycled\nelements of previous Romanian ransomware\ninto their own ransomware payloads. Nymaim\nshifted toward the compromise of online banking\ncredentials. This shift culminated in the April 2016\nemergence of GozNym, which combined elements\nof both Nymaim and the Gozi ISFB banking Trojan,\nAKA Ursnif.[1]\n\nNymaim’s early ransomware payloads targeted\na wide range of countries. Its geographic focus\nnarrowed as it shifted toward online banking\nattacks. Key areas of interest include\nEnglish-speaking North America, German-speaking\nCentral Europe, Poland, Portugal and Brazil.[2]\n\n\n**Origins and Ownership**\nThe source and origins of the Nymaim downloader\nremain an intelligence gap for the security\ncommunity nearly three years after Nymaim’s\nemergence. There is no specific information\non who developed Nymaim and who has been\ndeploying it in the wild. As of this writing, there\nis no significant evidence that it is available to\nthe criminal actor community on underground\nforums, either for sale or via leaks of its source\ncode.\n\nThis ostensible unavailability to the general\ncriminal community raises the likely possibility\nthat the unidentified developers of Nymaim\nhave retained exclusive use of and access to it as\ntheir own proprietary downloader.[3] Although the\ninfection vectors and payloads of Nymaim-related\nattacks have shifted over time, other factors would\nbe consistent with the coordinated operations of\na single group. These factors include: the degree\nof consistency in Nymaim-related attacks; the\nrecurring accounting software theme in their lure\ndocuments; and their clearer geographic focus\nsince the 2015 shift to online banking targets.\n\n**Shifting Infection Vectors**\nNymaim first surfaced in July 2013 as one of\nmany payloads that the “Home Campaign” of\na specific instance of the Black Hole Exploit Kit\n(BHEK) delivered.[4] The arrest of BHEK operator\nDmitry “Paunch” Fedotov may have prompted\nNymaim to switch its infection vector to blackhat\nsearch engine optimization (SEO) in fall 2013. This\napplication of SEO techniques raised the Google\nsearch engine ranking of links that redirected\nvictims to archives that contained malicious\nexecutables with file names relevant to the\ntargeted search terms. Users may have been\nmore likely to open these files because they had\nbeen searching for such information.[5] Blackhat\nSEO services are widely available on underground\nforums.\n\nSpam had become another infection vector\nfor Nymaim by December 2015, when Nymaim\nsamples surfaced in a spam run from the botnet\nthat distributes both the Dridex banking Trojan\n\n\n-----\n\nand Locky ransomware.[6] By February 2016,\nhowever, Nymaim operators had begun using\na novel infection vector: legitimate bulk email\nmarketing services, which may have enabled this\ncampaign to bypass spam filters. These email\nmessages contained malicious attachments or\nlinks to malicious documents that used malicious\nmacros to infect victims. It is unclear if the group\nused compromised accounts for such services or\ngained access to them via legitimate means.[7]\n\nAs of Q1 2016, Nymaim had also begun to\nappear as one of several different payloads in\nspear-phishing attacks by TA530, a provider of\nspear-phishing services to other actors. The\ndistinctive feature of TA530 campaigns is the\ncustomization of spear-phishing email messages\nto individual targets on an unusually large scale,\nsuch as the use of correct names and contact\nand employment information for hundreds\nof thousands of targets. Those TA530 spearphishing attacks that delivered Nymaim payloads\nused documents with malicious macros. These\nNymaim attacks may have specifically aimed to\ninfect the computers of employees who might\nconduct online banking sessions on behalf of\ntheir companies, which Nymaim operators could\ncompromise with web injection attacks after\n\n**Figure 1: TA530 Nymaim attack email message [14]**\n\n\ndelivering Gozi ISFB as a second-stage payload.[8 ]\n\nTA530 continued to use malicious macros to\ndeliver Nymaim payloads to North American\ntargets as of late May 2016.[9]\n\nThe only Nymaim infection vector to persist from\n2013 to 2016 is the deployment of Nymaim as\na second-stage payload via the separate Pony\nloader, AKA Fareit.[10]The Pony loader is available in\nunderground threat actor communities, both for\nsale and through leaks of its source code.[11]\n\nAnother recurring theme in Nymaim attacks has\npersisted in their lure documents since the 2015\nshift to banking attacks, despite shifts in infection\nvectors. This recurring theme further suggests\nthat these Nymaim attacks may have specifically\naimed to compromise the computers of\nemployees with access to corporate bank\naccounts. These attacks have often disguised their\nmalicious documents or links as either invoices or\nother transaction documents generated by Intuit\naccounting software, such as Quicken or\nQuickbooks, or as updates for such Intuit software\npackages.[12] In April 2016, some Nymaim samples\nalso began to mimic the branding of Freshbooks, a\ndifferent brand of accounting software, in similar\nlure documents.[13]\n\n\n-----\n\nInvoices are a typical financial theme for malicious\ndocuments or links in criminal spam or phishing\nattacks in general. It is also common for threat\nactors to disguise malicious files or links as\nupdates for popular software, such as Adobe Flash\n\n\nPlayer. Nonetheless, this repeated mimicking of\nthe branding of specific accounting software\npackages in social engineering lures, for both\nfinancially-themed attacks and fake software\nupdates, is uncommon.[15]\n\n\n**Figure 2: Nymaim attack email message from legitimate marketing service[16\n]**\n\nThe use of such social engineering content would be consistent with the targeting of corporate bank\naccounts. The branding of such accounting software may be familiar to employees who have access to\ncorporate bank accounts, such as those in Accounts Payable or Accounts Receivable. Such employees\nmay thus be more likely to fall for this social engineering and click on the malicious link or document\nout of force of habit. Other employees would be less likely to recognize the branding of this accounting\nsoftware or associate it with their official responsibilities, and their computers would be of less value to\nbanking Trojan actors, given the lower likelihood of compromising online banking credentials on\nthose computers.\n\n\n-----\n\n**Figure 3: TA530 malicious macro document that delivered Nymaim[17]**\n\n\n-----\n\n**Figure 4: TA530 malicious macro document that delivered Nymaim[18]**\n\n**Figure 5: Malicious macro document that delivered Nymaim[19]**\n\n\n-----\n\n**Figure 6: Spam to disguise Nymaim as an Intuit software update[20]**\n\n**The Shift from Ransomware to Banking Trojans and the Emergence of GozNym**\nNymaim’s typical second-stage payload in its early years (2013-2015) was police ransomware. It locked\nvictims’ screens with a message that accused them of illegal activities, such as the downloading of\ncopyrighted material or the viewing of child pornography, and instructed them to pay a fine. It displayed\ncustomized lock screens that mimicked the branding of various North American and European law\nenforcement agencies, based on a victim’s ostensible location. The ransom note offered Romanian\nvictims the opportunity to pay in either euros or Romanian currency, the latter of which was cheaper. This\nidiosyncrasy had previously appeared in other forms of police ransomware and may have reflected the\nrecycling of code among threat actors.[21]\n\nThe shift from police ransomware to online banking attacks began in 2015. Nymaim had begun\ndownloading a Gozi ISFB web injection dynamic link library (DLL) module to use in attacks on online\nbanking sessions by November 2015.[22] Nymaim later began infecting victims with full second-stage Gozi\nISFB payloads by February 2016.[23\n]\n\nThe hybrid GozNym banking Trojan was first detected in April 2016. It combines Nymaim’s stealth and\npersistence features with a modified version of Gozi ISFB’s web injection functionality. Nymaim operators\nmay have obtained and recycled elements of Gozi ISFB source code from leaks, modified its web injection\nfunctionality, and integrated and recompiled it into the existing Nymaim source code base.[24] Accordingly,\nmost anti-virus software vendors detect GozNym as Nymaim and not as a separate malware family or\na variant of Gozi ISFB, as most of its non-banking behaviors reflect those of Nymaim, rather than Gozi.\nIt may therefore be more accurate to describe GozNym as a variant of Nymaim than a variant of Gozi.\nGozNym samples have used some of the same command and control (C2) infrastructure as Nymaim\nsamples, which further substantiates the belief that GozNym is a product of the Nymaim operators.[25]\n\n\n-----\n\n**Stealth Features**\nEarly (2013) Nymaim samples concealed their C2 servers by communicating with them through a list\nof proxies hard-coded into the binary. It encrypted its normal traffic with RC4 encryption but added\na second, mixed layer of RSA and custom encryption when it downloaded second-stage malware\npayloads.[26] By October 2015, Nymaim samples featured a domain generation algorithm (DGA).[27] As of\nApril 2016, post-infection traffic for some Nymaim samples used the HTTPS, TCP, and UDP protocols,[28]\nwhile an April 2016 GozNym sample sent its traffic in the clear via HTTP.[29]\n\nOther Nymaim stealth techniques include the obfuscation of control flow and API calls and the\nencryption of strings in the binary.[30] As of November 2015, Nymaim had begun to use a time check as an\nanti-analysis technique. The binary would not execute completely after a certain date–for example, two\ndays after its distribution in the wild.[31] GozNym inherited this time check from Nymaim, and samples of it\nwill not execute after an expiration date.[32]\n\n**Geographic Distribution and Targeting**\nCountry-specific lock screens for victims of Nymaim’s early (2013-2015) police ransomware covered 12\ncountries: the United States, Canada, Mexico, the United Kingdom, Ireland, the Netherlands, Norway,\nGermany, Austria, France, Spain, and Romania. The amount that it demanded from victims in the United\nStates ($300) was approximately twice as high as the amounts that it demanded from victims in other\ncountries, which averaged around $150.[33]\n\nAs of May 2015, Germany had the highest concentration of Nymaim infections by far (76%), with other\nsignificant concentrations in the United States (9%), Austria (8%), Poland (4%), and Portgual (3%).[34]\nNymaim was also active in Switzerland as of August 2015.[35] As of March and early April 2016, the highest\nconcentrations of GozNym infections were also in the United States, Austria, and Germany (in that order).\nPoland and Portugal also had high numbers of GozNym victims relative to the sizes of their respective\npopulations but declined in relative significance as GozNym spread further beyond North America and\nEurope to developing and more populous countries in the Middle East, Latin America, South Asia, and\nSoutheast Asia.[36\n]\n\nThe first configuration of the early GozNym samples that originally surfaced in April 2016 targeted 22\nU.S. financial institutions and e-commerce platforms and two Canadian financial institutions.[37] A second\nGozNym configuration that surfaced later in April 2016 targeted 17 Polish banks, one Portuguese bank,\nand one U.S. bank.[ 38]  A third GozNym configuration that targeted thirteen German financial institutions\nsurfaced in August 2016.[39]\n\n\n-----\n\n**Conclusion**\nNymaim highlights the importance of\nunderground threat actor forums and markets\nboth to the threat actors themselves and as a\nsource of intelligence for the security community.\nIn the absence of evidence that Nymaim is\navailable in such underground communities,\none can reasonably assess that its developer(s)\nretained exclusive access to it for their own attacks\nover the past three years. If so, the developer(s)\nhave used it as the proprietary centerpiece of\na criminal enterprise that otherwise depends\nheavily on products and services from other\nactors and external sources, both for its initial\ninfection vectors and its second-stage payloads.\nUnderground communities are typically where\nthreat actors establish these vendor-client\nrelationships or obtain malware source code via\npurchases or leaks.\n\nNymaim’s shift away from ransomware and\ntoward online banking attacks goes against the\ncurrent trend toward the proliferation of new\nransomware families and the growing numbers,\nscale, sophistication, and severity of ransomware\nattacks. Perhaps Nymaim operators decided\nthat ransomware had already saturated the\n\n**Recommendations**\n\n\nmarket, or that the ransomware bandwagon has\nleft a vacuum in the market for online banking\ncredentials to fill. Nymaim operators also never\nmade the transition from police ransomware\nto crypto-ransomware that most ransomware\nattacks and operators have made. Police\nransomware has since faded in significance and\ngrown obsolete as crypto-ransomware, which\nencrypts files and holds them for ransom, has\nlargely replaced it.\n\nNymaim attacks have acquired a clearer\ngeographic focus since 2015, the year in which\nNymaim operators shifted from ransomware to\nonline banking attacks. This clearer focus may\nreflect the tendency of many financial institutions\nto serve customers in certain geographic areas.\nThe focus on English-speaking North America\nand German-speaking Central Europe reflects\nthe typical focus of criminal actors on wealthier\nmarkets. Nymaim operators’ interest in Poland\ncould reflect either the prevalence of such criminal\nactors in Eastern Europe, Poland’s extensive\neconomic ties to neighboring Germany, or some\ncombination of both. The reason for the Nymaim\noperators’ interest in Portugal, a smaller and less\nlucrative target, remains unclear.\n\n\n\n**•• Prioritize the education of users with access to corporate bank accounts about social engineering**\n\nthreats. These users may be more susceptible to the common financial themes of malicious\nattachments and links in many criminal attacks, and the infection of their workstations with banking\nTrojans poses a greater risk of financial loss.\n\n**•• Block users from enabling macros, especially when they are in Microsoft Office attachments to email**\n\nmessages from outside your corporate network. New features in Microsoft Office 2016 facilitate the\nblocking of macros in such higher-risk situations.\n\n**•• If your anti-virus software detects a threat as Nymaim, remember that it might actually be either**\n\nGozNym or Nymaim.\n\n**•• Use the below indicators to block or detect Nymaim and GozNym attacks.**\n\n\n-----\n\n**Indicators of Compromise (IOCs)**\n**GozNym payloads (MD5)**\n2a9093307e667cdb71884ecc1b480245\nf652ff6f745ac302e7067e5a347bb644\nb954391bc225c662d4720bc8ae5f95cc\n0058b5a2cbf64b536ea15c390e60de20\n58d893c9074233d83ae694a180a28d01\nc5ab408b9f710ebd63a515217a975274\n20d6fe2353f3044d25d4fdc9f2872f39\ne17a79a6f7c8fe7f920dad8cbcee3df0\n\n**Nymaim payloads (MD5)**\nd16b01a3b3852c0d64b5aa752e22e1be\nf10cbacb7782ede3ab789e1b4fa21495\n71022aab0b23aef9b69f6ac42d1c2c01\n12abc10d3c37841f4f4f7e193b045f6b\n563a1f54b9d90965951db0d469ecea6d\n60b2009138d1b21c1b93b7093bc66109\n\n**Documents that download GozNym payloads (SHA256)**\ncf608be7dc6738dd178dc5a63bb21925e70800667a5876f2742bed59b5f6f5a1\nef4b06c20fae78d44c41402163d7624833fbbff4993d228682718b6b637fd637\nae56c3c196a60d380782a61d318065577b3f6abd04489c7c24d50fef1ed1429e\n976ec8a4ed5026842ad397565c9ae1ee6911ffdd4007d2761e9b573e79f41384\n\n**Documents that download Nymaim payloads (SHA256)**\nce0c220603d23fbb072f91a6a813c07e0c1d02559f54f9899d3d3be1db6d8851\n617f3001d64cfc1edb3ccd70a084f888a34cb7f2e39d92e0685461baa23a4e5d\nc788fd4cae05844344b04629d97be324d1f85dbefdfc8352489154341f888aa9\n18e2461c250aaada1847b2aba8aef43f7686477f11b64e7597c325ee557f5128\n3e522c5873f976078e2c31681771640c73ee8a4e192ecbbcf6fe4e8b3a486920\nd78e20396efc39af29717d8dcceaf48a241ebd36a2f89d0c903ecf81fa9f5d0c\n5cdf41ef8cc330a5ea7fa06de6e220afdd8c2d5b708041296801f45bcafa16e3\nd4e3fb25f0d397967f1e88baffb97cfd6f40953d0c9f998d1c4694d1982d2d65\n8efdfcf63f1dbfa9666bce23246f49c5788ec8c8edacc722038d9110375d89b5\ne5c5385b79743ced00adebc0daae5fa619cf3836417bc2b0379f98a24f81c4bb\nc0515052e8bc2e2772b29cbb694e72af9a6c2be8ebceba5766bcdaf26fe955da\nb5b6b37f28dc16bbbac8df75af51f66436f7a4b4dec7ee3d911fb2601c1bb3b5\n642420b08d6333b8cf48014b62c60f9bd1f51be4b3c00b6023e824987d177b73\n4d0c14edfa616c0a5618b312f5ca90b3a29188288f35c5d8c1c2ae37ef11371f\na8ae681463b75470be8dc911f0cf7ca01a2eaea87005564263a5bbe38d652369\n\n**URLs for documents that download Nymaim payloads**\nhxxp://intuit.secureserver17[.]com/invoices/Invoice_897-84579.doc\nhxxp://secure.secureserver17[.]com/invoices/Invoice_11471.doc\nhxxp://quickbooks.intuit-invoices[.]com/invoices/qb_invoice_1147630.doc\nhxxp://kompuser[.]com/system/logs/update/doc.php?r=download&id=INTUIT-Browser-up1247.zip\n\n\n-----\n\n**Domains, URLs, and IPs that host Nymaim**\n**payloads**\n160.153.16.52\n46.249.54.179\ntraptractors[.]eu/system/logs/office.exe\nbanyoperdem[.]com/system/logs/office.exe\narabtradenet[.]com/info/content.dat\ndalinumsdeli42[.]com/posts/dli506.exe\nbillpay-center[.]com/invoices/007448322.doc\nforget42gibb[.]com/post/506pblpks.exe\nfini4kbimm[.]com\nforget42gibb[.]com\ngrotesk14file[.]com\nintro12duction1[.]com\nfiniki45toget[.]com\njoreshi50indo[.]com\nepay-solution[.]com\nbillpay-center[.]com\namoretaniintrodano36[.]com\namoretanioontradano37[.]com\namoretanoenntrodano38[.]com\namoretanoentrodano33[.]com\namoretanointrodanio39[.]com\namoretanointrodano31[.]com\namoretanoontrodano34[.]com\namoretanopintrodano40[.]com\namoretanopntrodano35[.]com\namoretanountrodano32[.]com\ndalinamsdela41[.]com\ndalinamsdele45[.]com\ndalinamsdelo43[.]com\ndalinamsdelu44[.]com\ndalinamsdelu46[.]com\ndalinumsdeli42[.]com\nsecureserver17[.]com\n\n\n**Nymaim and GozNym C2 infrastructure**\n31.210.116.68\n31.210.116.90\n24.97.2.82\n94.230.0.230\n188.247.102.215\n89.163.249.75\n95.173.164.212\n85.171.195.89\n45.32.152.165\n194.149.138.49\n54.186.122.88\n82.13.46.90\n168.235.72.204\nfilm-carpet-birth[.]com\nbeginninghang[.]com\nkcrznhnlpw[.]com\nmediapartnersallowallow[.]pw\nhxxp://ytugctbfm.com/bewfa5ovkx/index.php\nhxxp://viestisete[.]com/kz49uagxyo/index.php\nhxxp://mcwcly[.]com/zzpwgdu/index.php\nhxxp://67.211.221[.]36/zzpwgdu/index.php\nhxxp://89.163.247[.]186/zzpwgdu/index.php\nhxxp://94.125.120[.]12/zzpwgdu/index.php\nhxxp://eoquecwpt[.]com/16lqp/index.php\nhxxp://onbrk[.]in/p7yqpgzemv/index.php\n\n\n-----\n\n**References**\n\n1 L. Kessem, “Gozi Goes to Bulgaria–Is Cybercrime Heading to Less Charted Territory?” Security Intelligence, 18 August 2015\n\n[Online]. Available: https://securityintelligence.com/gozi-goes-to-bulgaria-is-cybercrime-heading-to-less-chartered-territory/.\n\n[Accessed 12 May 2016].\n\n2 Staff, “Hybrid GozNym banking Trojan targets North American financial sector,” Deloitte TIA, 14 April 2016 [Online]. W-TNEN-16-00265; Staff, “New version of GozNym banking Trojan, Deloitte TIA, 25 April 2016 [Online]. G-TN-EN-16-00290.\n\n3 L. Keshet and L. Kessem, \"Meet GozNym: the banking malware offspring of Gozi ISFB and Nymaim,\" Security Intelligence, 14\nApril 2016. [Online]. Available: https://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-andnymaim/. [Accessed 14 April 2016].\n\n4 S. Duquette, “The Home Campaign: overstaying its welcome,” We Live Security, 2 July 2013 [Online]. Available: http://www.\nwelivesecurity.com/2013/07/02/the-home-campaign-overstaying-its-welcome/. [Accessed 22 April 2016].\n\n5 J. Boutin, “Nymaim: Browsing for trouble,” We Live Security, 23 October 2013 [Online]. Available: http://www.welivesecurity.\ncom/2013/10/23/nymaim-browsing-for-trouble/. [Accessed 22 April 2016].\n\n6 Staff, “Dridex actors get in the ransomware game with Locky,” Proofpoint, 16 February 2016 [Online]. Available: http://\nproofpoint.com/us/threat-insight/post/Dridex-Actors-Get-In-the-Ransomware-Game-With-Locky. [Accessed 22 April 2016].\n\n7 Staff, “What Is Old Is New Again - Nymaim Moves Past Its Ransomware Roots,” Proofpoint, 21 April 2016 [Online]. Available:\nhttps://www.proofpoint.com/us/what-old-new-again-nymaim-moves-past-its-ransomware-roots-0. [Accessed 21 April 2016].\n\n8 M. Mesa, “Phish Scales: Malicious Actor Combines Personalized Email, Variety of Malware to Target Execs,” Proofpoint, 5\nApril 2016 [Online]. Available: https://www.proofpoint.com/us/threat-insight/post/phish-scales-malicious-actor-target-execs.\n\n[Accessed 21 April 2016].\n\n9 Staff, “Malicious Macros Add Sandbox Evasion Techniques to Distribute New Dridex,” Proofpoint, 2 June 2016 [Online].\nAvailable: https://www.proofpoint.com/us/threat-insight/post/malicious-macros-add-to-sandbox-evasion-techniques-todistribute-new-dridex. [Accessed 9 June 2016].\n\n10 J. Boutin, “Nymaim – obfuscation chronicles,” We Live Security, 26 August 2013 [Online]. Available:  http://www.\nwelivesecurity.com/2013/08/26/nymaim-obfuscation-chronicles/. [Accessed 22 April 2016]; Staff, “What Is Old Is New Again\n\n- Nymaim Moves Past Its Ransomware Roots,” Proofpoint, 21 April 2016 [Online]. Available: https://www.proofpoint.com/us/\nwhat-old-new-again-nymaim-moves-past-its-ransomware-roots-0. [Accessed 21 April 2016]; L. Keshet and L. Kessem, \"Meet\nGozNym: the banking malware offspring of Gozi ISFB and Nymaim,\" Security Intelligence, 14 April 2016. [Online]. Available:\nhttps://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-and-nymaim/. [Accessed 14 April\n2016].\n\n11 Hasherezade, “No money, but Pony! From a mail to a Trojan horse,” Malwarebytes, 19 November 2015 [Online]. Available:\nhttps://blog.malwarebytes.org/threat-analysis/2015/11/no-money-but-pony-from-a-mail-to-a-trojan-horse/. [Accessed 12 May\n2016]; I. Palmer, “Pony loader 2.0 steals credentials and bitcoin wallets: source code for sale,” Damballa, 24 June 2014 [Online].\nAvailable: https://www.damballa.com/pony-loader-2-0-steals-credentials-bitcoin-wallets-source-code-sale/. [Accessed 12 May\n2016].\n\n12 C. Longmore, “Mystery INTUIT QuickBooks” spam leads to unknown malware,” Dynamoo Blog, 18 November 2015 [Online].\nAvailable: http://blog.dynamoo.com/2015/11/mystery-intuit-quickbooks-spam-leads-to.html. [Accessed 22 April 2016].\n\n13 Staff, “Malicious Word doc downloads Nymaim and info stealer,” Broad Analysis 19 April 2016 [Online]. Available: http://www.\nbroadanalysis.com/2016/04/19/malicious-word-doc-downloads-nymaim-and-info-stealer/. [Accessed 22 April 2016].\n\n14 M. Mesa, “Phish Scales: Malicious Actor Combines Personalized Email, Variety of Malware to Target Execs,” Proofpoint, 5\nApril 2016 [Online]. Available: https://www.proofpoint.com/us/threat-insight/post/phish-scales-malicious-actor-target-execs.\n\n[Accessed 21 April 2016].\n\n15 Staff, “Malicious Word Doc sends Nymaim and SSL data Exfiltration,” Broad Analysis, 12 April 2016 [Online]. Available: http://\nwww.broadanalysis.com/2016/04/12/malicious-word-doc-sends-nymaim-and-ssl-data-exfiltration/. [Accessed 22 April 2016].\n\n16 Staff, “What Is Old Is New Again - Nymaim Moves Past Its Ransomware Roots,” Proofpoint, 21 April 2016 [Online]. Available:\nhttps://www.proofpoint.com/us/what-old-new-again-nymaim-moves-past-its-ransomware-roots-0.\n\n17 Staff, “Malicious Macros Add Sandbox Evasion Techniques to Distribute New Dridex,” Proofpoint, 2 June 2016 [Online].\nAvailable: https://www.proofpoint.com/us/threat-insight/post/malicious-macros-add-to-sandbox-evasion-techniques-todistribute-new-dridex. [Accessed 9 June 2016].\n\n18 M. Mesa, “Phish Scales: Malicious Actor Combines Personalized Email, Variety of Malware to Target Execs,” Proofpoint, 5\nApril 2016 [Online]. Available: https://www.proofpoint.com/us/threat-insight/post/phish-scales-malicious-actor-target-execs.\n\n[Accessed 21 April 2016].\n\n\n-----\n\n19 Staff, “Malicious Word doc downloads Nymaim and info stealer,” Broad Analysis 19 April 2016 [Online]. Available: http://www.\nbroadanalysis.com/2016/04/19/malicious-word-doc-downloads-nymaim-and-info-stealer/. [Accessed 22 April 2016].\n\n20 C. Longmore, “Mystery INTUIT QuickBooks” spam leads to unknown malware,” Dynamoo Blog, 18 November 2015 [Online].\nAvailable: http://blog.dynamoo.com/2015/11/mystery-intuit-quickbooks-spam-leads-to.html. [Accessed 22 April 2016].\n\n21 J. Boutin, “Nymaim: Browsing for trouble,” We Live Security, 23 October 2013 [Online]. Available: http://www.welivesecurity.\ncom/2013/10/23/nymaim-browsing-for-trouble/. [Accessed 22 April 2016].\n\n22 L. Keshet and L. Kessem, \"Meet GozNym: the banking malware offspring of Gozi ISFB and Nymaim,\" Security Intelligence, 14\nApril 2016. [Online]. Available: https://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-andnymaim/. [Accessed 14 April 2016].\n\n23 Staff, “What Is Old Is New Again - Nymaim Moves Past Its Ransomware Roots,” Proofpoint, 21 April 2016 [Online]. Available:\nhttps://www.proofpoint.com/us/what-old-new-again-nymaim-moves-past-its-ransomware-roots-0. [Accessed 21 April 2016].\n\n24 L. Keshet and L. Kessem, \"Meet GozNym: the banking malware offspring of Gozi ISFB and Nymaim,\" Security Intelligence, 14\nApril 2016. [Online]. Available: https://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-andnymaim/. [Accessed 14 April 2016].\n\n25 Staff, “GozNym malware,” Team Cymru, 2 May 2016 [Online]. Available: https://blog.team-cymru.org/2016/05/goznymmalware/. [Accessed 3 May 2016].\n\n26 J. Boutin, “Nymaim: Browsing for trouble,” We Live Security, 23 October 2013 [Online]. Available: http://www.welivesecurity.\ncom/2013/10/23/nymaim-browsing-for-trouble/. [Accessed 22 April 2016].\n\n27 Staff, “Neue DGA domains für Matsnu/Nymaim aktiv,” Bits, Bytes, and My 5 Cents, 13 October 2015 [Online]. Available: http://\nblog.encodingit.ch/tag/nymaim/. [Accessed 22 April 2016].\n\n28 Staff, “Malicious Word Doc sends Nymaim and SSL data Exfiltration,” Broad Analysis, 12 April 2016 [Online]. Available: http://\nwww.broadanalysis.com/2016/04/12/malicious-word-doc-sends-nymaim-and-ssl-data-exfiltration/. [Accessed 22 April 2016].\n\n29 Staff, “GozNym malware,” Team Cymru, 2 May 2016 [Online]. Available: https://blog.team-cymru.org/2016/05/goznymmalware/. [Accessed 3 May 2016].\n\n30 J. Boutin, “Nymaim – obfuscation chronicles,” We Live Security, 26 August 2013 [Online]. Available:  http://www.\nwelivesecurity.com/2013/08/26/nymaim-obfuscation-chronicles/. [Accessed 22 April 2016].\n\n31 Staff, “Nymaim malware obfuscation and system time check,” Neutralize Cyber Threats, 1 December 2015 [Online]. Available:\nhttp://www.neutralizethreat.com/2015/12/nymaim-malware-obfuscation-and-system.html. [Accessed 22 April 2016].\n\n32 Staff, “GozNym malware,” Team Cymru, 2 May 2016 [Online]. Available: https://blog.team-cymru.org/2016/05/goznymmalware/. [Accessed 3 May 2016].\n\n33 J. Boutin, “Nymaim: Browsing for trouble,” We Live Security, 23 October 2013 [Online]. Available: http://www.welivesecurity.\ncom/2013/10/23/nymaim-browsing-for-trouble/. [Accessed 22 April 2016].\n\n34 N. Periquito, “Germany Meets Nymaim,” Anubis Networks, 26 May 2015 [Online]. Available: http://blog.anubisnetworks.com/\nblog/germany-meets-nymaim. [Accessed 22 April 2016].\n\n35 Staff, “Nymaim in der Schweiz wieder aktiv,” Bits, Bytes, and My 5 Cents, 24 August 2015 [Online]. Available: http://blog.\nencodingit.ch/2015/08/nymaim-in-der-schweiz-wieder-aktiv/.\n\n[Accessed 22 April 2015].\n\n36 Staff, “GozNym malware,” Team Cymru, 2 May 2016 [Online]. Available: https://blog.team-cymru.org/2016/05/goznymmalware/. [Accessed 3 May 2016].\n\n37 L. Keshet and L. Kessem, \"Meet GozNym: the banking malware offspring of Gozi ISFB and Nymaim,\" Security Intelligence, 14\nApril 2016. [Online]. Available: https://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-andnymaim/. [Accessed 14 April 2016].\n\n38 L. Kessem, “Time is Money: GozNym Launches Redirection Attacks in Poland,” Security Intelligence, 25 April 2016 [Online].\nAvailable: https://securityintelligence.com/time-is-money-goznym-launches-redirection-attacks-in-poland/.\n\n[Accessed 25 April 2016].\n\n39 L. Kessem, “GozNym’s Euro Trip: Launching Redirection Attacks in Germany,” Security Intelligence, 23 August 2016 [Online].\nAvailable: https://securityintelligence.com/goznyms-euro-trip-launching-redirection-attacks-in-germany/. [Accessed 24 August\n2016].\n\n\n-----\n\nThis report contains general information only and Deloitte is not, by means\nof this report, rendering accounting, business, financial, investment, legal,\ntax, or other professional advice or services. This report is not a substitute for\nsuch professional advice or services, nor should it be used as a basis for any\ndecision or action that may affect your business. Before making any decision or\ntaking any action that may affect your business, you should consult a qualified\nprofessional advisor. -\n\nDeloitte shall not be responsible for any loss sustained by any person who relies\non this report.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www2.deloitte.com/content/dam/Deloitte/us/Documents/risk/us-aers-the-evolution-of-the-nymaim-criminal-enterprise.pdf"
    ],
    "report_names": [
        "us-aers-the-evolution-of-the-nymaim-criminal-enterprise.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8fd6c94-f1bf-43b8-8613-edc46ca097ee",
            "created_at": "2022-10-25T16:07:24.285532Z",
            "updated_at": "2025-03-27T02:02:10.160396Z",
            "deleted_at": null,
            "main_name": "TA530",
            "aliases": [],
            "source_name": "ETDA:TA530",
            "tools": [
                "AbaddonPOS",
                "August Stealer",
                "Bugat v5",
                "CryptoWall",
                "Dofoil",
                "Dridex",
                "Gozi ISFB",
                "H1N1",
                "H1N1 Loader",
                "ISFB",
                "Nymaim",
                "Pandemyia",
                "Sharik",
                "Smoke Loader",
                "SmokeLoader",
                "SpY-Agent",
                "TVRAT",
                "TVSpy",
                "TeamSpy",
                "TeamViewerENT",
                "TinyLoader",
                "nymain"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "af77521e-c35f-4030-a95d-bcd1eaeeaac1",
            "created_at": "2023-01-06T13:46:38.476089Z",
            "updated_at": "2025-03-27T02:00:02.843358Z",
            "deleted_at": null,
            "main_name": "TA530",
            "aliases": [],
            "source_name": "MISPGALAXY:TA530",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1473866579,
    "ts_modification_date": 1474580083,
    "files": {
        "pdf": "https://archive.orkl.eu/38220419779f7259ef5e2aaebe1dcbbf882f66a6.pdf",
        "text": "https://archive.orkl.eu/38220419779f7259ef5e2aaebe1dcbbf882f66a6.txt",
        "img": "https://archive.orkl.eu/38220419779f7259ef5e2aaebe1dcbbf882f66a6.jpg"
    }
}