{
    "id": "1c1da9f9-fcf2-4f28-998d-85e046d637ec",
    "created_at": "2023-01-12T15:02:10.378839Z",
    "updated_at": "2025-03-27T02:16:57.977532Z",
    "deleted_at": null,
    "sha1_hash": "9c13dd466764f4ba3f4cfc3c7c4dc4effbaef056",
    "title": "2021-07-09 - REvil-ution – A Persistent Ransomware Operation",
    "authors": "",
    "file_creation_date": "2022-05-28T23:37:20Z",
    "file_modification_date": "2022-05-28T23:37:20Z",
    "file_size": 7403635,
    "plain_text": "# REvil-ution – A Persistent Ransomware Operation\n\n**cyjax.com/2021/07/09/revilevolution/**\n\nBlog\n\nBy [William Thomas 9th July 2021](https://www.cyjax.com/author/will/)\n\n\nJuly 9, 2021\n\n\nREvil (short for Ransomware Evil) is a revolutionary ransomware operation. Its predecessor,\nGandCrab, which was retired in early 2019, pioneered the concept of ransomware-as-aservice (RaaS) for “big game hunting” campaigns (where corporate targets are selected\naccording to their annual turnover). REvil’s operators (also known as GoldSouthfield or\nPinchySpider) continued where GandCrab left off, and thrived. This success encouraged\nother ransomware strains to be distributed as a RaaS. REvil is known to have many affiliates,\nmany of which crossover with those of GandCrab. Password spraying, exploiting unpatched\nsystems, and initial access malware families – such as IcedID or Qakbot – and now supply\n\n-----\n\nchain attacks, are all methods of distributing REvil. The tactics, techniques, and procedures\n(TTPs) of this group continue to evolve and it remains one of the primary threats to large\norganisations.\n\nOn 2 July, reports emerged of a widespread ransomware supply-chain attack on US-based\nfirm Kaseya, a remote management and monitoring (RMM) tool used by multiple managed\nservice providers (MSPs). Kaseya warned customers to immediately shut down their VSA\nserver as REvil ransomware was spreading through its auto-update function. By design,\nKaseya’s RMM software gives administrators the right to install new software on multiple\nsystems. This mechanism was hijacked by the ransomware operators to launch REvil with\nhigh-level privileges. Kaseya has reported that up to 60 MSPs, with as many as 1,500 client\norganisations, are affected. REvil stated in a post on its darknet leaks site, Happy Blog, that\nover one million systems had been encrypted, demanding a $70 million ransom in Bitcoin for\na universal decryptor.\n\n_Fig. 1 – Kaseya appearing on REvil’s Happy Blog darknet leaks site_\n\nOn the cybercrime forums, the REvil RaaS is represented by a user called UNKN (or\nUnknown) who recruited the first customer for the ransomware’s affiliate program in July\n2019. As the ransomware’s reputation grew, by hitting larger targets in the public and private\nsector and making more money, increasingly talented affiliates were brought on board.\nUNKN’s interviews with journalists reveal just how successful the group has been. UNKN\nclaims that the group makes a profit of $100 million each year and is aiming to make at least\n$1 billion.\n\nThe REvil development team is said to consist of around ten individuals with as many as 60\naffiliates that perform the active deployment of the ransomware. In February 2020, REvil’s\ndata-theft-extortion campaign accelerated with the launch of the Happy Blog. REvil’s\nnotoriety increases the chances of securing a ransom payment. The group’s high-profile\nleaks are frequently covered by mainstream outlets, which works as further motivation for\norganisations that initially refuse to pay a ransom to engage with the threat actors.\n\n\n-----\n\n_Fig. 2 – The auction site used to sell stolen data if the ransom is not paid_\n\nREvil is at the top of a pyramid of around 30 other ransomware groups that perform Big\nGame Hunting (BGH) campaigns. As noted above, BGH sees groups target large\norganisations, from both the private and public sectors, with high annual revenues, so that\ntheir victims’ are more likely to be able to pay multi-million dollar ransom demands. These\namounts, however, have increased significantly since 2019, peaking at a $50 million demand\nfrom Acer (it is unknown if they paid) and securing an $11 million ransom from JBS foods,\nafter originally asking for $22.5 million in Bitcoin. Other significant victims targeted by REvil\nover the last two years include 20 Texas local administrations, Travelex, SoftwareOne,\nQuest, GSM Law, Banco Estado, Quanta, FujiFilm, Sol Oriens, Invenergy, and more recently\n[French Connection. [1,](https://www.scmagazine.com/home/security-news/ransomware/revil-seeks-to-extort-apple-and-hits-supplier-with-50-million-ransom/) [2,](https://www.bleepingcomputer.com/news/security/jbs-paid-11-million-to-revil-ransomware-225m-first-demanded/) [3,](https://www.theregister.com/2021/06/15/us_nuclear_weapons_contractor_sol_oriens/) [4]](https://www.bleepingcomputer.com/news/security/revil-ransomware-threatens-to-leak-a-list-celebrities-legal-docs/)\n\n\n-----\n\n_Fig. 3 – Example of the REvil ransom note_\n\n\n-----\n\n_Fig. 4 – The REvil decryption site_\n\nWhen it was first discovered in April 2019, REvil was delivered via exploiting vulnerabilities in\nOracle WebLogic web servers. Since then, the ransomware has been deployed in a number\nof ways, including via malicious spam campaigns, exploit kits, and RDP brute-forcing. To\nescalate privileges, REvil also exploits CVE-2018-8453, a Win32k vulnerability, which is rare\namong ransomware families. REvil’s BGH campaign has been successful in leveraging\nexploits for unpatched VPN products for initial access. This includes Pulse Connect Secure\n(vulnerable to CVE-2019-11510) and Citrix ADC gateway (CVE-2019-19781), as well as the\nBlueGate vulnerabilities affecting the Windows Remote Desktop Gateway (tracked as CVE2020-0609 and CVE-2020-0610). This is no coincidence: during the COVID-19 pandemic,\nsince March 2020, VPNs and RDP have become widely used, with many forced to work from\n[home and establish remote connections to the office. [1,](https://doublepulsar.com/big-game-ransomware-being-delivered-to-organisations-via-pulse-secure-vpn-bd01b791aad9) [2,](https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/) [3]](https://www.advanced-intel.com/post/an-interview-with-unkn-sheds-light-on-revil-s-operations-future-victims)\n\nIn the last six months, there have been several reports of REvil ransomware deployment\nfollowing an initial IcedID or Qakbot infection. IcedID and Qakbot are reportedly developed\nby LunarSpider and MallardSpider, respectively. These top-tier malware developers\ncollaborate with affiliates and act as Access-as-a-Service brokers for several ransomware\ngangs, such as Conti or RansomExx, alongside REvil. Both are currently pushed by the\nShathak botnet, operated by a group known as TA551 (also called GoldCabin). IcedID and\nQakbot both began life as banking Trojans, used for fraud and hijacking accounts. Infections\nby either malware family are usually now followed by Cobalt Strike and hands-on-keyboard\nactivity that enables threat actors to move laterally, steal data, and encrypt target networks to\n[hold them to ransom. [1,](https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/) [2]](https://www.advanced-intel.com/post/from-qbot-with-revil-ransomware-initial-attack-exposure-of-jbs)\n\nThe fame and profits achieved by the REvil ransomware gang inevitably attracted other\ncybercriminal syndicates. C&C servers belonging to the infamous FIN7 group (also called\nCarbonSpider or Carbanak) was linked by security researchers to REvil’s infrastructure,\nindicating that it was likely FIN7 was an operator and affiliate. This is a burgeoning trend, as\ncybercriminal APT groups shift from Point-of-Sale malware to ransomware, with the former\nno longer being as profitable as it once was. This has been accelerated by the closure of\nJoker’s Stash – once the largest darknet market for stolen credit cards. A vacuum was left by\nits shutting down, making it harder for the carders to cash out after a heist, leading many to\n[turn to RaaS and BGH campaigns. [1,](https://go.crowdstrike.com/rs/281-OBQ-266/images/Report2021GTR.pdf) [2,](https://threatintel.blog/OPBlueRaven-Part2/) [3]](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/sodinokibi-ransomware-cobalt-strike-pos)\n\nMost updates about the REvil RaaS project come from the underground Russian-speaking\nforums. Here, UNKN announces major developments to the RaaS, including technical\nupdates and strategies. It was on the forums that we first learned about the RaaS, the\nextortion site, affiliate recruitment drives, notifications to NASDAQ, acquisition of the KPOT\nstealer, the arrival of DDoS attacks, calling victims and the media, and the Linux version of\nREvil. These updates are posted across multiple darknet forums where UNKN recruits\naffiliates for the REvil. These adverts are a key part of the REvil operation because the RaaS\nis ultimately competing with other offerings that may give their affiliates a greater split of the\n[ransom [1 2 3]](https://www.linkedin.com/feed/update/urn:li:activity:6727251164305350656/)\n\n\n-----\n\n_Fig. 5 – Example of UNKN’s posts to underground cybercrime forums_\n\nThe most recent update to REvil is the addition of a variant to encrypt Linux systems and\nVMware ESXi virtual machines. In May, UNKN announced that the group was developing a\nLinux version of the ransomware and one for network-attached storage (NAS) devices. The\nLinux version of REvil, which also targets ESXi, has now been discovered in the wild. It is an\nELF64 executable file that includes the same configuration options utilised by the more\ncommon Windows executable version of REvil. When executed on ESXi servers, it will run\nthe ESXCLI tool to list all running ESXi virtual machines and terminate them. It will then close\nany open virtual machine disk (VMDK) files so that the ransomware can encrypt them.\n\nThe targeting of VMware ESXi servers has proven successful for ransomware operators and\nwill continue to be so while so many remain unsecured. By targeting the management\nservers this way, ransomware can encrypt multiple virtual machines at once with a single\ncommand. Here, REvil is following a trend pioneered by others. Ransomware operations\nsuch as Babuk, RansomExx, DarkSide, and Hellokitty have all previously created Linux\n[encryptors to target ESXi virtual machines. [1,](https://twitter.com/VK_Intel/status/1409601311092490248) [2]](https://twitter.com/malwrhunterteam/status/1409577829289934851)\n\n_Fig. 6 – Timeline of the REvil ransomware campaign by Cyjax_\n\n\n-----\n\nThe REvil campaign continues to evolve. Over 260 victims have been leaked to the Happy\nBlog (all of which have been recorded by the Cyjax Portal) and countless others will have\npaid a ransom to prevent a listing. To evade international law enforcement, UNKN stated that\nthe group members never travel and claim to be “absolutely apolitical”, which is why they\nhave allegedly “never been contacted by any local intelligence offices” in countries in which\nthey operate.\n\nUNKN also admitted to journalists that the arrests of other ransomware gangs benefit the\nREvil operation. The closure of Maze ransomware, for example, saw REvil’s number of\naffiliates increase. In May 2021, during the aftermath of the Colonial Pipeline ransomware\nattack perpetrated by the DarkSide gang, the underground cybercriminal community\nannounced a ban on ransomware on multiple forums. This has significantly affected REvil’s\nability to advertise as a semi-public RaaS offering. However, UNKN stated that REvil will be\nmoving to a closed affiliate program that can only be contacted directly. This is not the end of\nthe REvil RaaS, although it will undoubtedly have impacted their ability to recruit affiliates.\n\nREvil’s latest campaign against Kaseya and its MSP customers is by far the group’s most\ndevastating to date. It was always likely that one of the many well-resourced ransomware\ngangs would launch a widespread supply-chain attack. At the end of 2020, we saw two\nsimilar disruptive incidents: Cl0p ransomware exploiting Accellion FTA servers and the\nSolarWinds SUNBURST campaign. Targeting vulnerable software or distributing Trojanised\nupdates makes for a highly effective attack campaign, especially against IT service\nproviders. Compromising one software update can lead to thousands of victims. REvil has\nshown itself to be capable of rapid evolution. Expect to hear more from them throughout\n2021.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-09 - REvil-ution – A Persistent Ransomware Operation.pdf"
    ],
    "report_names": [
        "2021-07-09 - REvil-ution – A Persistent Ransomware Operation.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa5b200f-a6c6-4d17-bc65-911d9a7bf4ef",
            "created_at": "2022-10-25T16:07:23.866039Z",
            "updated_at": "2025-03-27T02:02:10.002227Z",
            "deleted_at": null,
            "main_name": "Mallard Spider",
            "aliases": [
                "Gold Lagoon"
            ],
            "source_name": "ETDA:Mallard Spider",
            "tools": [
                "Egregor",
                "Mimikatz",
                "Oakboat",
                "PinkSlip",
                "Pinkslipbot",
                "ProLock",
                "PwndLocker",
                "QakBot",
                "Qbot",
                "QuackBot",
                "QuakBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "475ea823-9e47-4098-b235-0900bc1a5362",
            "created_at": "2022-10-25T16:07:24.506596Z",
            "updated_at": "2025-03-27T02:02:10.263346Z",
            "deleted_at": null,
            "main_name": "Lunar Spider",
            "aliases": [
                "Gold SwathMore"
            ],
            "source_name": "ETDA:Lunar Spider",
            "tools": [
                "BokBot",
                "IceID",
                "IcedID",
                "NeverQuest",
                "Vawtrak",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c2385aea-d30b-4dbc-844d-fef465cf3ea9",
            "created_at": "2023-01-06T13:46:38.916521Z",
            "updated_at": "2025-03-27T02:00:02.950071Z",
            "deleted_at": null,
            "main_name": "LUNAR SPIDER",
            "aliases": [
                "GOLD SWATHMORE"
            ],
            "source_name": "MISPGALAXY:LUNAR SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d5cb8d20-b5b9-4ec6-9660-3dded9bd3c89",
            "created_at": "2023-01-06T13:46:39.204681Z",
            "updated_at": "2025-03-27T02:00:03.020862Z",
            "deleted_at": null,
            "main_name": "MALLARD SPIDER",
            "aliases": [
                "GOLD LAGOON"
            ],
            "source_name": "MISPGALAXY:MALLARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7961bf6e-e429-484c-93e2-bd1d36fa5588",
            "created_at": "2023-01-06T13:46:39.275053Z",
            "updated_at": "2025-03-27T02:00:03.037764Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [],
            "source_name": "MISPGALAXY:GOLD SOUTHFIELD",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535730,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653781040,
    "ts_modification_date": 1653781040,
    "files": {
        "pdf": "https://archive.orkl.eu/9c13dd466764f4ba3f4cfc3c7c4dc4effbaef056.pdf",
        "text": "https://archive.orkl.eu/9c13dd466764f4ba3f4cfc3c7c4dc4effbaef056.txt",
        "img": "https://archive.orkl.eu/9c13dd466764f4ba3f4cfc3c7c4dc4effbaef056.jpg"
    }
}