{
    "id": "1c21dd5b-9fd7-4f76-bebb-a54ab0cfac55",
    "created_at": "2023-01-12T15:06:38.099607Z",
    "updated_at": "2025-03-27T02:09:07.243432Z",
    "deleted_at": null,
    "sha1_hash": "0226b31f2026088d68bea92f65abaedd8e67a4af",
    "title": "2022-04-05 - Peace through Pegasus Jordanian Human Rights Defenders and Journalists Hacked with Pegasus Spyware",
    "authors": "",
    "file_creation_date": "2022-05-27T18:59:05Z",
    "file_modification_date": "2022-05-27T18:59:05Z",
    "file_size": 1330976,
    "plain_text": "# Peace through Pegasus Jordanian Human Rights Defenders and Journalists Hacked with Pegasus Spyware\n\n**citizenlab.ca/2022/04/peace-through-pegasus-jordanian-human-rights-defenders-and-journalists-hacked-with-pegasus-**\nspyware/\n\nApril 5, 2022\n\n[Research](https://citizenlab.ca/category/research/)\n\n\n-----\n\n[Targeted Threats](https://citizenlab.ca/category/research/targeted-threats/)\nBy [Mohammed Al-Maskati,](https://citizenlab.ca/author/mohammed-al-maskati/) [Bill Marczak,](https://citizenlab.ca/author/bmarczak/) [Siena Anstis, and](https://citizenlab.ca/author/siena-anstis/) [Ron Deibert](https://citizenlab.ca/author/profd/)\n\n[1] Front Line Defenders\n\n[2] Citizen Lab, University of Toronto\n\nApril 5, 2022\n\n## Key Findings\n\nPhones belonging to four Jordanian human rights defenders, lawyers, and journalists\nwere hacked with NSO Group’s Pegasus spyware between August 2019 and\nDecember 2021.\nWe assess that at least two of the four targets were hacked by Pegasus operators\nprimarily focused on Jordan, based on SMS messages containing Pegasus links that\nmap to a cluster of domain names focusing on Jordanian themes.\nOne of the targets’ iPhones was successfully hacked on December 5, 2021, showing\nthat NSO Group has remained active on Apple’s platform even after Apple sued NSO\nGroup and notified Pegasus targets in November 2021.\nWe identify two Pegasus operators that we believe are likely agencies of the Jordanian\ngovernment. The first, which we name MANSAF, has been active since at least\nDecember 2018, and the second, which we name BLACKIRIS, has been active since\nat least December 2020.\n[Our findings build on an earlier report from Front Line Defenders, which found that the](https://www.frontlinedefenders.org/sites/default/files/unsafe-anywhere_-women-human-rights-defenders-speak-out-about-pegasus-attacks_en.pdf)\nphone of Hala Ahed Deeb, a Jordanian lawyer and woman human rights defender, was\ninfected with Pegasus.\n\n## 1. Human Rights in Jordan\n\n\n-----\n\nJordanian human rights defenders (HRDs) work in a generally hostile environment. Since the\nArab Spring in 2011, grassroots protests have emerged, reflecting growing discontent with\ngovernment corruption and wealth inequality, among other issues. In response, authorities\nhave often arrested activists and curtailed freedoms.\n\nJordan saw a wave of protests in 2011, as part of the Arab Spring. Protests were driven\npartly by the Hirak, groups of youth activists not connected with traditional centres of political\npower in Jordan. Protests flared up again in June 2018, galvanised by a government plan to\nincrease taxes and reduce subsidies, as required by the International Monetary Fund (IMF).\nMore than 30 trade unions called a general strike, and protesters occupied the Fourth Circle\narea of Amman near the Prime Minister’s office. In response, the government temporarily\nwithdrew the bill, and re-introduced it in September 2018 with minor changes. When the bill’s\nfinal text was published in the Official Gazette in December 2018, activists once again held\n[protests in the Fourth Circle that persisted into 2019. In March 2019, Jordanian authorities](https://apnews.com/article/3524656d142b4642ba1dd63dc9b95cd5)\n[began a wave of arrests against Hirak members, charging them with “insulting the King” and](https://www.hrw.org/news/2019/06/04/jordan-crackdown-political-activists)\n“undermining the political regime.”\n\n[In September 2019, Jordan’s largest union, the Jordanian Teachers Syndicate (JTS),](https://web.archive.org/web/20190907055321/http://nagabh.blogspot.com/)\nannounced a strike for higher wages. The strike shut down most schools in Jordan for a\n[month, and the government was forced to agree to a pay increase. However, in April 2020,](https://www.aljazeera.com/news/2019/10/6/jordan-teachers-end-four-week-strike-in-pay-deal-with-government)\nthe government cancelled the pay increase, citing the COVID-19 pandemic. When JTS\n[planned a new wave of protests, the government arrested JTS’ entire board, ordered their](https://english.alaraby.co.uk/news/jordan-orders-two-year-closure-teachers-union)\n[offices closed for two years, and issued a gag order preventing public discussion of the](https://english.alaraby.co.uk/news/jordan-orders-two-year-closure-teachers-union)\ncase. Nevertheless, teachers protested again in July 2020, and Jordanian security forces\n[responded by arresting around 1000 teachers.](https://www.theguardian.com/world/2020/aug/19/jordan-arrests-1000-teachers-in-crackdown-on-union)\n\nFebruary and March 2022 saw additional crackdowns on activists. Detainees were charged\nwith “spreading false news” and “inciting strife.”\n\n## 2. Hacking of Jordanian Targets\n\n[In January 2022, Front Line Defenders published a report finding that the phone of Hala](https://www.frontlinedefenders.org/en/resource-publication/unsafe-anywhere-women-human-rights-defenders-speak-out-about-pegasus-attacks)\nAhed Deeb, a Jordanian lawyer and woman human rights defender, was infected with\n[Pegasus. Following publication, Front Line Defenders received numerous requests from](https://www.frontlinedefenders.org/en/programme/digital-protection)\nJordanian human rights defenders, journalists, and other civil society activists to inspect their\ndevices. Front Line Defenders checked more than 60 iPhones in collaboration with the\n[Citizen Lab, with case referrals from the Jordan Open Source Association. Three of the](https://josa.ngo/)\nvictims consented to be identified (listed below), while one wished to remain anonymous.\nThe results of our forensic analysis were peer reviewed by Amnesty International’s Security\nLab.\n\n### Victim: Ahmed Al-Neimat\n\n\n-----\n\n[Ahmed Al-Neimat is a human rights defender, an anti-corruption activist, and a member of](https://www.frontlinedefenders.org/en/profile/ahmed-al-neimat)\n[the Hirak movement. In 2019, Al-Neimat was arrested for “insulting the king”. In 2020, Al-](https://www.hrw.org/news/2019/06/04/jordan-crackdown-political-activists#)\nNeimat was [arrested after he filed a complaint at the National Center for Human Rights](https://ammannet.net/%D8%A3%D8%AE%D8%A8%D8%A7%D8%B1/%D8%A8%D8%B9%D8%AF-%D9%85%D8%B1%D8%A7%D8%AC%D8%B9%D8%AA%D9%87-%D8%A7%D9%84%D9%85%D8%B1%D9%83%D8%B2-%D8%A7%D9%84%D9%88%D8%B7%D9%86%D9%8A-%D9%84%D8%AD%D9%82%D9%88%D9%82-%D8%A7%D9%84%D8%A7%D9%86%D8%B3%D8%A7%D9%86-%D8%A7%D9%84%D8%A7%D9%85%D9%86-%D9%8A%D8%B9%D8%AA%D9%82%D9%84-%D8%A7%D9%84%D9%86%D8%A7%D8%B4%D8%B7-%D8%A3%D8%AD%D9%85%D8%AF-%D8%A7%D9%84%D9%86%D8%B9%D9%8A%D9%85%D8%A7%D8%AA)\n(Jordan’s national human rights body), and was only released after signing a pledge to never\nreturn to the Center. In 2021, Al-Neimat was [again arrested after he posted bail for another](https://dawnmena.org/jordan-monarchy-weaponizes-judiciary-laws-to-persecute-reform-activists/)\n[arrested Hirak activist. In February 2022, Al-Neimat was again arrested in a case relating to](https://jo24.net/article/429098)\n[protests against the situation at Al-Salt State Hospital, where lack of oxygen killed several](https://www.france24.com/en/middle-east/20210314-protests-in-jordan-after-covid-19-patients-die-due-to-hospital-oxygen-shortages)\nCOVID-19 patients. He is currently in prison as of the publication of this report.\n\n**Figure 1: Ahmed Al-Neimat.**\n\n### Hacking of Ahmad Al-Neimat\n\nAl-Neimat’s phone logs show that his phone was hacked on or around January 28, 2021 for\na period of approximately two days. The logs indicate that this was a zero-click exploit, likely\nthe **_[FORCEDENTRY exploit. We had not previously seen any cases of FORCEDENTRY](https://citizenlab.ca/2021/09/forcedentry-nso-group-imessage-zero-click-exploit-captured-in-the-wild/)_**\ndeployed before February 2021, making this the earliest suspected FORCEDENTRY case.\n\n### Victim: Malik Abu Orabi\n\n[Malik Abu Orabi is a human rights lawyer and a member of the National Forum for the](https://www.frontlinedefenders.org/en/profile/malik-abu-orabi)\n[Defense of Liberties. Orabi is one of the lawyers defending the JTS, and is also the lawyer of](https://jo24.net/article/429098)\nAl-Neimat. Orabi was [arrested at a protest in March 2021, and fined 100 Jordanian dinars](https://alawalnews.com/news/2021/03/24/129127-khbfwf/)\n\n\n-----\n\n[(approximately 110 USD) for violating COVID-19 restrictions. Front Line Defenders has](https://euromedmonitor.org/en/article/4668/Jordan:-Maintaining-Defense-Law-despite-epidemiological-situation-improvement-cannot-be-justified)\n[documented Orabi’s case.](https://www.frontlinedefenders.org/en/profile/malik-abu-orabi)\n\n**Figure 2: Malik Abu Orabi.**\n\n### Hacking of Malik Abu Orabi\n\nWe identified the following text messages on Orabi’s phone that contain links to Pegasus\nservers.\n\n\n-----\n\n**Figure 3: SMS messages containing Pegasus links sent to Malik Abu Orabi.**\nWe translate the messages sent to Orabi below:\n\n**Sender**\n**and Date** **Message Translation**\n\n\n**From:**\nSMSALERT\n**Date: 22**\nSep 2019,\n15:32\n\n**From:**\nSMSALERT\n**Date: 29**\nSep 2019,\n17:10\n\n**From: Info**\n**Date: 20**\nMar 2020,\n12:49\n\n\nA letter to the governor without limitations and with a high stakes from\nBashar Al-Rawashdeh [a Jordanian political activist] received high reactions\namong Hirak and Islamic circles, for details [link]\n\nSalem Al-Falahat and Mr. Peel, a critical statement indicating the\npoliticization of the Teachers Syndicate and its wrapping under the cloak of\nthe Muslim Brotherhood, for details [link]\n\nLawyer Malik Abu Orabi and running for the upcoming parliamentary\nelection, for details [link]\n\n\n**Table 1: Translation of Pegasus messages sent to Malik Abu Orabi.**\n\n\n-----\n\nOrabi s phone was hacked at least 21 times between August 2019 and July 2021 (see\n**Appendix A for a full list of dates).**\n\n### Victim: Suhair Jaradat\n\n**[Suhair Jaradat is a human rights defender and journalist, who won the Al-Hussain Prize for](https://www.frontlinedefenders.org/en/profile/suhair-jaradat)**\nCreativity in Journalism in 2006 and in 2018. Jaradat serves on the Executive Committee of\n[the International Federation for Journalists (IFJ), and is an advocate for women’s issues in](https://www.almaghribtoday.net/en/446/suhair-jaradat-expresses-her-anger-165030)\nmedia.\n\n**Figure 4: Suhair Jaradat.**\n\n### Hacking of Suhair Jaradat\n\nWe identified the following SMS message on Jaradat’s phone containing a link to the\nPegasus spyware:\n\n\n-----\n\n**Figure 5: SMS message containing Pegasus link sent to Suhair Jaradat.**\nWe also identified the following WhatsApp messages on Jaradat’s phone, impersonating a\n[popular anti-government Twitter user in Jordan https://twitter.com/GeneralInspect2:](https://twitter.com/GeneralInspect2)\n\n\n-----\n\n**Figure 6: WhatsApp messages containing Pegasus links sent to Suhair Jaradat. We**\n**redact the December 2021 domain name.**\nWe translate the messages sent to Jaradat below:\n\n**Sender and**\n**Date** **Message Translation**\n\n\n**From: Routee**\n**Date: 11 May**\n2020, 11:20\n\n**From:**\n+3197010210453\n**Date: 4 Jan**\n2021, 11:32\n\n\nJaradat is waging war on the rich and the government that sponsors\nthem [link]\n\nI would like to present to you my humble account for your evaluation,\nas I will direct the account to support the free people and raise the\nexisting injustice towards teachers, journalists, and lawyers [link]\n\n\n-----\n\n**Sender and**\n**Date** **Message Translation**\n\n\n**From:**\n+3197010210453\n**Date: 5 Dec**\n2021, 09:32\n\n\nGreat article and realistic projections [link]\n\n\n**Table 2: Translation of Pegasus messages sent to Suhair Jaradat.**\n\nJaradat’s iPhone was hacked six times between February and December 2021 (see\n**Appendix A for a full list of dates).**\n\n### Victim: WHRD and Journalist A\n\n**WHRD and Journalist A is a Jordanian Woman Human Rights Defender (WHRD) and**\njournalist, who has chosen to remain anonymous due to the risks that she faces. Her phone\nwas hacked at least twice, once on or around 2021-10-03, and once on or around 2021-1005.\n\n## 3. Spyware in Jordan\n\nThe Jordanian Government appears to have used spyware for a number of years, including\n[FinFisher spyware, which the Citizen Lab detected in December 2014. However, no civil](https://citizenlab.ca/2015/10/mapping-finfishers-continuing-proliferation/)\nsociety targets of FinFisher spyware in Jordan have been publicly identified.\n\n### Suspected Jordanian Use of Pegasus\n\nBased on our Internet scanning and monitoring of NSO Pegasus servers at the Citizen Lab,\nwe believe that there are two Pegasus customers that are primarily focused on spying in\nJordan.\n\nOne of the customers, which we name MANSAF, appears to be spying primarily in Jordan,\nwith limited additional operations in Iraq, Lebanon, and Saudi Arabia. We believe that\n**MANSAF has been operating since December 2018.**\n\nThe other customer, which we name BLACKIRIS, appears to be spying almost exclusively in\n[Jordan, and has been active since at least December 2020. An April 2021 report in Axios](https://www.axios.com/israeli-cyber-firm-nso-negotiates-with-jordan-dfbc49f1-6b2f-4907-b0fc-f36fbda4813d.html)\nmentioned negotiations between NSO Group and Jordanian authorities “in recent months,”\nwith one source mentioning a contract had been signed.\n\n### Targets in this Case\n\n\n-----\n\nBoth Jaradat and Orabi received text messages (Figures 3, 5, 6) that included links to\nPegasus websites. The websites matched our Internet scanning for Pegasus servers, and\nappear to all have been registered by Dreamhost. This is noteworthy as we have typically\nobserved different Pegasus customers’ infrastructure set up with different hosting providers.\n\nWe provide a list of all Dreamhost websites that we detected in scanning below. We redact\nseveral names given that they contain themes suggestive of targeting terrorist groups:\n\n**Domain Name** **What is it?**\n\nakhbar-almasdar[.]com\n\nakhbar-islamyah[.]com\n\nakhbarnew[.]com\n\nal-nusr[.]net\n\nal-taleanewsonline[.]net May impersonate Jordanian news website al-taleanews[.]net\n\nal7erak247[.]com May be a reference to the Jordanian Hirak movement\n\nalrainew[.]com May impersonate Jordanian news website alrai[.]com\n\narabia-islamion[.]com\n\ncozmo-store[.]net May impersonate Jordanian retailer Cozmo\n\nkhilafah-islamic[.]com\n\nlogin-service[.]net\n\nmangoutlet[.]net May be a reference to Mango, a Spanish clothing retailer with\nstores in dozens of countries around the world\n\nmobiles-security[.]net\n\nrss-me[.]com\n\ntalabatt[.]net May impersonate Talabat food delivery service that operates in\nthe Middle East\n\nunsubscribe-now[.]net\n\nwww.al7eraknews[.]com May be a reference to the Jordanian Hirak movement\n\n\nwww.honaalrabe3[.]com\n\n\nMay be a reference to the Fourth Circle (اﻟﺪوار اﻟﺮاﺑﻊ) area of\nAmman, which is near Jordan’s Prime Ministry, and is often a\nfocal point of protests\n\n\n**Table 3: Pegasus websites hosted on Dreamhost detected in Internet scanning.**\n\n\n-----\n\nWhile we cannot directly connect these names to any specific Pegasus operator (because of\nthe way the domain names are set up), we do believe that this cluster of domains shows a\nfocus indicative of Jordan.\n\n## 4. Conclusion\n\nIn this report, we find once again that a government client of NSO Group has used Pegasus\nto spy on civil society targets that are neither terrorists nor criminals. This case adds to the\nlarge number of other cases of abuse of Pegasus worldwide, which amount to an\nindisputable indictment against NSO Group, and its ownership, for their inability or\nunwillingness to put in place even the most basic human rights-respecting safeguards. The\nfact that the targeting we uncovered happened after the widespread publicity around Apple’s\nlawsuit and notifications to victims is especially remarkable; a firm that truly respected such\nconcerns would have at least paused operations for government clients, like Jordan, that\nhave a widely publicised track record of human rights concerns and had enacted emergency\npowers giving authorities widespread latitude to infringe on civil liberties.\n\n### Gender Dimensions of Online Surveillance\n\n[The targeting of women HRDs merits special attention. Our research, and that of a](https://citizenlab.ca/2017/11/submission-un-special-rapporteur-violence-women-causes-consequences/) [growing](https://repository.law.umich.edu/mlr/vol108/iss3/3/)\n[number of](https://www.tandfonline.com/doi/full/10.1080/1369118X.2017.1348535) [others, has](https://www.reuters.com/article/tech-women-surveillance-idINL8N2P91KX) [documented a disturbing rise in gender-based digital repression](https://digitallibrary.un.org/record/1641160?ln=en)\npractices. Pegasus mercenary spyware guarantees the state’s clients to have full control\nover the infected devices’ camera, microphone, emails, applications, text messages, call\nlogs, and to obtain unlimited amounts of the targets’ data. In the case of female targets, the\nrisk is higher. It is seriously concerning that private chats, private photographs, and other\npersonal data may have been exfiltrated from the female targets’ devices.\n\nWomen are also disproportionately vulnerable to online harms, blackmail, and digitallyrelated acts of violence or technology-facilitated gender-based violence, especially in\n[patriarchal societies and in countries with discriminatory practices and laws against women.](https://jordan.unwomen.org/sites/default/files/Field%20Office%20Jordan/Images/publications/2019/IRCKHF/IRCKHF_Gender%20Discrimination%20JO_Report_EN%20FINAL.pdf)\nIn conservative countries like Jordan, women are also frequently the subject of “family\n[honour” and “honour crimes,” which are rendered immune by state regulations and practices.](https://achrs.org/english/wp-content/uploads/2020/12/Honor-crimes-in-Jordan-between-legislation-and-womens-experience_final.pdf)\nThere are multifold and severe impacts on female activists and journalists who experience\ndevice hacking, such as blackmail and harassment, judicial consequences, social impacts,\nphysical or emotional harm, the undermining of freedom of expression, self censorship, loss\nof employment, and a negative impact on self-worth and dignity. Moreover, such attacks are\nnot isolated to the victims themselves; they can impact the lives of vulnerable people in their\ncommunities who journalists and activists document and on whose behalf they undertake\nadvocacy. As [Lama Fakih, director of Middle East and North Africa at Human Rights Watch,](https://www.hrw.org/news/2022/01/26/interview-phone-hrw-director-attacked-using-pegasus-spyware)\n[who was also targeted with Pegasus, pointed out: “My first thought when I found out I was](https://english.alaraby.co.uk/analysis/menas-women-activists-are-pegasus-spywares-biggest-victims)\ntargeted was ‘How does this impact the people I am advocating for in my network?”\n\n\n-----\n\n[According to sociologist Sarah Sobieraj, [e]ntering and using digital publics to share work,](https://www.tandfonline.com/doi/abs/10.1080/1369118X.2017.1348535?journalCode=rics20)\nideas, opinions, and experiences often comes at a great cost for women” who “bear the brunt\nof digital hate.”\n\n[As Access Now and Front Line Defenders noted in a previous report regarding the targeting](https://www.accessnow.org/women-human-rights-defenders-pegasus-attacks-bahrain-jordan/)\nof women HRDs in Bahrain and Jordan with Pegasus spyware, the impacts for women are\nparticularly severe, causing women to “live in a perpetual state of fear, become socially\nisolated and restricted in their social lives, work, and activism.” Our latest report adds yet\nanother troubling indicator to the NSO Group file and to the deeply harmful impact that the\nuse of Pegasus spyware has on women activists. The fact that Jaradat and WHRD /\nJournalist A are also both women journalists compounds and amplifies these concerns.\nThere can be no doubt that NSO Group has become one of the world’s leading purveyors of\nthese harms, and its continued use will invariably contribute to further discrimimation against\n[women and marginalized groups. Going forward, further research into the impact of digital](https://english.alaraby.co.uk/analysis/menas-women-activists-are-pegasus-spywares-biggest-victims)\nrepression on women HRDs in the Global South is critical. Amplifying the voices of women in\nthe Global South targeted by Pegasus spyware, as well as other forms of digital repression,\nis important to showing how severe the impacts of digital repression are—particularly in\nregions where human rights are routinely disregarded—and bringing accountability to an\nindustry running wild.\n\n## Acknowledgements\n\nThanks to a contributor who wishes to remain anonymous. Thanks to the Jordan Open\n[Source Association (JOSA) for case referrals. Thanks to Amnesty International’s Security](https://josa.ngo/)\nLab for peer review. Thanks to John Scott-Railton, Adam Senft, and Miles Kenyon for review\nand assistance.\n\n## Appendix A:\n\n**Dates of Hacking of Ahmed Al-Neimat**\n\nOn or around 2021-01-28\n\n**Dates of Hacking of Malik Abu Orabi**\n\nOn or around 2019-08-25\nOn or around 2019-08-26\nOn or around 2019-09-05\nOn or around 2020-03-20\nOn or around 2021-03-16\nOn or around 2021-03-17\nOn or around 2021-03-20\nOn or around 2021-03-24\nOn or around 2021-04-16\n\n\n-----\n\nOn or around 2021-04-22\nOn or around 2021-04-25\nOn or around 2021-04-28\nOn or around 2021-05-02\nOn or around 2021-05-06\nOn or around 2021-05-20\nOn or around 2021-06-06\nOn or around 2021-06-11\nOn or around 2021-06-27\nOn or around 2021-07-01\nOn or around 2021-07-04\nOn or around 2021-07-09\n\n**Dates of Hacking of Suhair Jaradat**\n\nOn or around 2021-02-08\nOn or around 2021-02-21\nOn or around 2021-04-09\nOn or around 2021-06-07\nOn or around 2021-07-17\nOn or around 2021-12-05\n\n**Dates of Hacking of WHRD and Journalist A**\n\nOn or around 2021-10-03\nOn or around 2021-10-05\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-05 - Peace through Pegasus Jordanian Human Rights Defenders and Journalists Hacked with Pegasus Spyware.pdf"
    ],
    "report_names": [
        "2022-04-05 - Peace through Pegasus Jordanian Human Rights Defenders and Journalists Hacked with Pegasus Spyware.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535998,
    "ts_updated_at": 1743041347,
    "ts_creation_date": 1653677945,
    "ts_modification_date": 1653677945,
    "files": {
        "pdf": "https://archive.orkl.eu/0226b31f2026088d68bea92f65abaedd8e67a4af.pdf",
        "text": "https://archive.orkl.eu/0226b31f2026088d68bea92f65abaedd8e67a4af.txt",
        "img": "https://archive.orkl.eu/0226b31f2026088d68bea92f65abaedd8e67a4af.jpg"
    }
}