{
    "id": "1c411abb-ff51-42c9-8f4f-f2327ca88898",
    "created_at": "2023-01-12T15:06:00.193809Z",
    "updated_at": "2025-03-27T02:09:30.345382Z",
    "deleted_at": null,
    "sha1_hash": "e4078945ef971aa11cce11779d8712b382d7b3cc",
    "title": "2022-08-31 - ERMAC 2.0- Perfecting the Account Takeover",
    "authors": "",
    "file_creation_date": "2022-09-12T11:59:19Z",
    "file_modification_date": "2022-09-12T11:59:19Z",
    "file_size": 2706106,
    "plain_text": "# ERMAC 2.0: Perfecting the Art of Account Takeover\n\n**[intel471.com/blog/rmac-2-0-perfecting-the-art-of-account-takeover](https://intel471.com/blog/rmac-2-0-perfecting-the-art-of-account-takeover)**\n\n## ERMAC 2.0: Perfecting the Account Takeover\n\n**ERMAC, an Android banking trojan enables bad actors to determine when certain**\n**apps are launched and then overwrites the screen display to steal the user’s**\n**credentials; putting billions of users at risk.**\n\nAug 31, 2022\n\nAndroid device security has improved dramatically in recent years, motivated by market and\ncompetitive forces. In part, Android security development teams have accomplished this by\nfocusing on the tools used by malware developers and mitigating their effectiveness.\nMalware developers, in response, have had to get creative to achieve their nefarious tasks.\n\nOne example is ERMAC, an Android banking trojan that surfaced in August 2021. Based on\nthe Cerberus banking trojan, ERMAC abuses a built-in feature in the Android Accessibility\nSuite intended for users with disabilities. The feature enables actors to accomplish tasks on\nAndroid devices that they otherwise could not do. Specifically, ERMAC uses the Accessibility\nSuite to determine when certain apps are launched and then overwrites the screen display to\nsteal the user’s credentials. Users are usually infected with ERMAC through fake browser\nupdate sites.\n\n\n-----\n\n### Overlay Attacks\n\nCommonly known as an \"Overlay\" or \"Web Injection\" attack, ERMAC targets over 400\nbanking, financial and ecommerce mobile applications – including Amazon, PayPal, and\nMicrosoft - to hijack credentials. Injections are amongst the oldest and most dangerous\nattacks aimed at applications. In this case, HTML code is injected, resulting in overwritten\napps that fool users.\n\n\n-----\n\nFigure 1: Examples of the phishing pages that ERMAC overlays on top of legitimate\napplications.\n\nUsers of those apps think they have opened a legitimate app but are presented with\nillegitimate content from the malware. When users enter their credentials, the ERMAC trojan\ncaptures them. From the end-user perspective, it is hard to discern whether anything is\ndifferent or wrong.\n\nUsers must explicitly grant ERMAC access to the Accessibility Suite to perform the overlay\nattack. ERMAC typically attempts this by asking users to grant access via a pop-up. If\naccess is granted, users unknowingly give this set of privileges to the malware.\n\n\n-----\n\nFigure 2: ERMAC generates a window, prompting the user to grant Accessibility privileges.\n\nOnce active, the malware performs actions such as knowing which apps are being launched\nand redrawing the screen while another app is in focus. Further, it gathers and forwards a list\nof all installed apps to the command-and-control server. In response, the server sends back\ninjection content for other applications.\n\n### Subverting Multi-factor Authentication\n\nAccording to Duo Labs (Cisco/Duo Security) State of the Auth report, multi-factor\nauthentication (MFA) has gained significant adoption, with 79% of respondents using it in\n2021. And most end users do feel they have strong protection against credential theft and\naccount takeover when using MFA for their online and mobile transactions. After all, if your\ncredentials are stolen but MFA is enabled, your data and apps are still safe, right?\n\nWrong! What makes ERMAC so formidable is its ability to get around authentication\nmethods, thus circumventing MFA. An ERMAC feature known as Google Authentication\nGrabber essentially turns ERMAC into an account takeover tool as it steals Google\nAuthentication tokens. ERMAC can also steal authentication tokens sent via SMS. So, even\nif you are doing all the right things – strong passwords and MFA – you are still subject to\naccount takeover.\n\n\n-----\n\nFigure 3: Screenshot of ERMAC control panel, showing commands available to the operator.\n\n### The Bigger Picture\n\nIt is easy to become complacent and categorize any malware as a one-off. But a detailed\nanalysis reveals that a highly sophisticated e-crime ecosystem supports ERMAC, its\ndevelopers and users.\n\nAs reported by researchers, the mastermind group promoting the ERMAC malware is\n**DukeEugene, aka Duke Eugene or Eugene. They rent the malware, as a service (MaaS),**\non underground forums for $5,000 per month, facilitate client communications and provide\naccess to the malware control panel. DukeEugene has history and expertise in this area,\nclaiming to be the 2020 author of the BlackRock Android banking trojan. That trojan also\nused the MaaS model.\n\n\n-----\n\nThe online forums serving as a marketplace for selling ERMAC and other MaaS offerings are\nhosted by \"bulletproof posting (BPH) services,\" which provide infrastructure and hosting\nservices to criminal actors. These BPHs offer the basic building blocks for illicit command\nand control servers and services. BPH providers advertise specific services but often provide\nsupport beyond what they tout on the underground forums.\n\n[One of the world’s “top tier” bulletproof hosting providers, actor Yalishanda is associated](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/)\nwith ERMAC. Intel 471’s research revealed that some bot configurations, designed for\nERMAC to connect to command and control servers, lead to Yalishanda's bulletproof hosting\ninfrastructure. Yalishanda has been active for years, reportedly moving between China and\nRussia. His methods and longevity underscore that this high level of e-crime sophistication is\nnot going away.\n\nERMAC will likely continue to undergo feature enhancements just like any other app. But it is\nessential to realize this is not just another clever, creative piece of malware; it is malware\nsupported by a sophisticated criminal group with expertise, longevity and infrastructure.\nAndroid users who rely on banking, financial and ecommerce apps must thus remain vigilant\nand aware of this persistent threat.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-31 - ERMAC 2.0- Perfecting the Account Takeover.pdf"
    ],
    "report_names": [
        "2022-08-31 - ERMAC 2.0- Perfecting the Account Takeover.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535960,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1662983959,
    "ts_modification_date": 1662983959,
    "files": {
        "pdf": "https://archive.orkl.eu/e4078945ef971aa11cce11779d8712b382d7b3cc.pdf",
        "text": "https://archive.orkl.eu/e4078945ef971aa11cce11779d8712b382d7b3cc.txt",
        "img": "https://archive.orkl.eu/e4078945ef971aa11cce11779d8712b382d7b3cc.jpg"
    }
}