{
    "id": "1c57d24c-f681-4326-acfc-29816c1435f4",
    "created_at": "2023-01-12T14:59:14.070319Z",
    "updated_at": "2025-03-27T02:13:34.631171Z",
    "deleted_at": null,
    "sha1_hash": "36a9a0a476c8ebc9f7aebb2d4637cd41a432744b",
    "title": "2020-08-12 - Prioritizing critical vulnerabilities A threat intelligence perspective",
    "authors": "",
    "file_creation_date": "2022-05-25T12:12:04Z",
    "file_modification_date": "2022-05-25T12:12:04Z",
    "file_size": 380491,
    "plain_text": "# Prioritizing “critical” vulnerabilities: A threat intelligence perspective\n\n**[intel471.com/blog/prioritizing-critical-vulnerabilities-a-threat-intelligence-perspective](https://intel471.com/blog/prioritizing-critical-vulnerabilities-a-threat-intelligence-perspective)**\n\nBy the Intel 471 Intelligence Analysis team.\n\nRecently, there have been many vendor security advisories containing multiple critical\nvulnerabilities potentially impacting organizations that may be conflicted with patch\nprioritization when looking at the variables seen for each reported vulnerability. Threat\nintelligence can supplement publicly disclosed information and provide a contextual view of\nexploitation efforts and general interest in open source reported vulnerabilities from an\nunderground threat actor perspective. For instance, our vulnerability intelligence product\nuses information disclosed by vendor advisories, open source repositories and research\ncompanies’ analyses to determine a certain level of risk, but we also take into consideration\nthe scope of underground activity that can be seen surrounding critical vulnerability\nannouncements. It is important to note that our risk assessment is assigned as a probability\nof current, active exploitation versus organization-specific risk.\n\nOver the course of a year, we observed consistency across underground activity responding to\ncritical vulnerability disclosures and leading up to exploit development. These indicators\ncould further help identify potential elevation of risk to your organization by recognizing\nevents such as spikes of activity that commonly occur prior to successful exploitation\nattempts. This is far from a one-size-fits-all approach and won’t necessarily give you an easyto-prioritize list, but through the examples shown below, you will see this theory applied to\nrecent critical vulnerabilities overlaid with threat actor activity observed over time.\n\n## Disclosure to exploitation\n\nAfter the initial open source disclosure of a critical vulnerability that reportedly received the\nhighest severity rating available, a pattern of activity can be observed in the underground.\nThere is an initial surge in posts made by threat actors who copy and paste information\ndirectly from open source reports. Additionally, there are several forum threads started\nwhere threat actors discuss the possibility of exploitation or seek partners to assist in the\ndevelopment of proof of concept (PoC) and exploit code that leverage the newly announced\nvulnerability. Closely following these discussions, several threat actors will advertise claims\nof PoCs and exploits that have successfully been developed, however, claims within this\ntimeframe are typically false.\n\nAfter this initial deluge of information, activity surrounding mentions of the vulnerability\nslows and there are fewer observed reposts of open source information. Paired with this, a\nfew threat actors may advertise high dollar PoCs or exploits in a limited supply. For example,\nan actor will claim to have an exploit for a recently disclosed critical vulnerability, including\n\n\n-----\n\nthe common vulnerabilities and exposures (CVE) ID or its alias in the initial post. The\nprivately developed code will be priced around US $1,000 to US $4,000 and the actor will\nstate only a few copies are available for purchase. It is common to see this activity reported as\nalleged code development as they would need to be purchased or verified by a reliable\nsecondary source to report them as a source of truth. Vendors and vulnerability researchers\nlikely would include information of existing credible exploit development and successful\nexploitation of a vulnerability. These sources also may expedite the development of exploits,\nsuch as when you see a successful PoC released after patching information for impacted\nproducts is provided by the vendor.\n\nOnce threat actors share advertisements of code development, publicly available PoCs are not\nfar behind, if not already released. If you are not immediately aware of publicly available\ncode, conversations on the pricey exploit advertisement threads will point to it. Threat actors\nwill share links to open source PoCs or exploits in response to the initial sales post and will\nleave comments such as “this is a rip off,” “it must be fake, you can get this for free” and\nmore. Notably, successful exploit development does not necessarily indicate all interested\nfinancially motivated cybercriminals will leverage the vulnerability for attacks. While there\nmight be an increase in exploitation attempts, many threat actors will lack the sophistication\nrequired to take their interest to the next level.\n\nAs the disclosure to exploit cycle ends, reporting on threat actors successfully leveraging the\nvulnerability in attack techniques and procedures may be delayed. Attackers can be cautious\nand use nonspecific details if they report initial entry methods at all, such as claiming to\nleverage a type of vulnerability or only providing the name of the vulnerable system.\nEvidence of this activity allows us to identify threat actors that claim to leverage a specific\nvulnerability to carry out consistently intrusive cybercriminal activity.\n\n## Priority indicators to assess risk of exploitation\n\nThe threat intelligence variables that add contextual risk to critical vulnerability\nprioritization can be cumbersome if your organization is affected by many recent advisories.\nIn essence, you would be trying to monitor trends for 20 or more high severity\nvulnerabilities. The observations presented above can be summarized into five indicators that\nshould trigger an increase in priority ranking.\n\n1. Indicator one – Extensive coverage in open source reporting. This will naturally\n\nincrease an actor’s interest in the vulnerability and will not solely be based on the\ncriticality of the reported CVE.\n2. Indicator two – Increase in observed underground conversations and posts related to\n\nthe reported vulnerability. This increase will be significant and easily observed in\ncomparison to other vulnerabilities being discussed on underground forums and\nmessaging services.\n\n\n-----\n\n3. Indicator three – Fake and private development and sale of PoC and exploit code. This\n\nidentifies a clear objective from threat actors seeking to leverage the vulnerability for\nfuture attacks.\n4. Indicator four – Publicly available, legitimate PoC code and threat actors claiming they\n\nare attempting to use this code for exploit development. Publicly released PoC code will\nbe shared as a link or direct copy-paste on underground forums and referenced across\nall related initial post threads.\n5. Indicator five – Full exploit widely available and possibly concurrent claims of the code\n\nbeing implemented in an attack framework. Additionally, you might begin to see\nreporting on a small number of threat actors leveraging this vulnerability in attacks.\n\n## Theory into practice\n\nUsing the indicators above, you can begin to map these trends across current critical\nvulnerabilities. Below you will see three critical vulnerabilities reviewed against this\npatterned activity including a timeline of underground activity and risk score.\n\n## CVE-2019-19781\n\nThis Citrix Application Delivery Controller, Citrix Gateway and Citrix SD-WAN WANOP\nappliance vulnerability, CVE-2019-19781, was disclosed in December 2019 and last updated\nin the U.S. National Vulnerability Database (NVD) in January 2020. In December 2019, we\nbegan to see less sophisticated threat actors share information from open source reports\nabout CVE-2019-19781 and new forum threads started where actors sought to buy an exploit\nfor the vulnerability. Discussions about the potential exploitation of the vulnerability\ncontinued until a publicly available exploit was observed in January 2020 and subsequently\nshared in the underground. Several exploit variants were circulated by threat actors\ncommonly known for sharing publicly available PoC and exploit code.\n\n\n-----\n\nThis vulnerability continues to be high risk to organizations with unpatched affected Citrix\nsystems. We reported on threat actors who claimed this vulnerability allowed them access\ninto vulnerable systems as they attempted to move laterally through impacted networks. The\noverall risk of exploitation score is high.\n\n**December 2019**\n\nSeveral actors across multiple popular cybercrime forums posted information from\nopen source reporting about the disclosure of CVE-2019-19781.\nA long-standing member of the Russian-language underground community started a\npost thread where the actor advertised funds available to purchase an exploit for the\nCitrix vulnerability. Several actors replied expressing a similar interest or discussing\nexploitability of CVE-2019-19781.\nA prolific seller of network access possibly leveraged the vulnerability to gain\nunauthorized network access to several organizations. The assessment was not\nconfirmed but the timing of the disclosure and advertised accesses were concurrent.\n\n**January 2020**\n\nAn exploit for the Citrix vulnerability was publicly available. An actor posted the\nGitHub link on a previously opened post thread and several actors circulated exploits\nfor the vulnerability.\nAn actor shared several code variants for CVE-2019-19781. This actor commonly shares\ncopied PoC and exploit code from open sources including Exploit DB, Packet Storm and\nGitHub.\n\n**February 2020**\n\nA Russian-speaking actor was suspected to have leveraged the Citrix vulnerability after\nreleased compromised access revealed the impacted company uses Citrix System\nSoftware, however, the assessment was not confirmed.\n\n**May 2020**\n\nA relatively new actor allegedly leveraged CVE-2019-19781 to sell compromised\nnetwork accesses on underground forums. The actor claimed to use publicly available\ncode for exploitation after scanning the internet for vulnerable hosts.\n\n**June 2020**\n\nA handful of actors, including a notable threat actor with a positive underground\nreputation, claimed responsibility for many compromised network accesses likely using\nthe Citrix vulnerability as an initial attack vector into compromised victim\norganizations.\n\n## CVE-2020-5902\n\n\n-----\n\nThe F5 Traffic Management User Interface (TMUI), also referred to as the Configuration\nutility, reportedly had an RCE vulnerability in multiple versions of BIG-IP that was disclosed\npublicly as CVE-2020-5902 June 30, 2020. This vulnerability quickly cycled through the\npriority indicators of underground activity, which added to the vulnerability’s criticality and\noverall risk of possible exploitation. The vendor reported the vulnerability with a Common\nVulnerability Scoring System (CVSS) of 10.0, the highest score a CVE can receive. The F5\nvulnerability allowed unauthenticated attackers or authenticated users with network access\nto execute arbitrary system commands, create or delete files, disable services and execute\narbitrary Java code. Although the vendor released fixed versions and mitigation information,\nthere was rapid development of exploit code and implementation into an attack framework.\n\nFollowing common trends, several actors shared information from multiple open source\nreports that discussed the vulnerability, an actor shared an alleged nmap exploit for CVE2020-5902. Once a Metasploit module was observed publicly, an actor known for copying\ncode from open sources shared it on an underground forum. Because the vulnerability was\nquickly productized and there was evidence of threat actors attempting to leverage the CVE\nin attacks, the overall risk of exploitation score is high.\n\n**July 2020**\n\nSeveral actors posted information from open source reporting about the disclosure of\nCVE-2020-5902.\n\nAn actor posted an alleged nmap exploit for the F5 BIG-IP vulnerability stating: “Here\nI’m posting nmap script to exploit it. I am loving this vulnerability.”\nA notable Turkish-speaking actor shared an exploit and Metasploit module for CVE2020-5902. The actor commonly shares PoC and exploit code available in open sources\nincluding Exploit DB, GitHub and Packet Storm.\n\n## CVE-2020-1350\n\nThe Microsoft Windows domain name system (DNS) servers remote code execution (RCE)\nvulnerability, CVE-2020-1350, was disclosed in July 2020 and is still cycling through the\ninitial priority indicators of observed underground activity. There was an extensive amount\nof open source coverage of this vulnerability, which referenced risk scoring previously\nassigned to the BlueKeep vulnerability CVE-2019-0708. The criticality of the vulnerability,\nimpacted vendor, type of vulnerability and widespread reporting of CVE-2020-1350 were\nindicators of its severity. Following the outlined behavior, after the disclosure of the\nvulnerability and released patching information, we observed a near-immediate increase in\nunderground mentions of this vulnerability including rick-rolling PoCs repeatedly shared.\n\nThere is clear underground interest in CVE-2020-1350 based on threat actor posts seeking to\ndevelop code to leverage this vulnerability. However, a closer look at the actors that\nexpressed an initial interest in leveraging the vulnerability shows no specific historical\nactivity to indicate these individuals are sophisticated enough to carry out an exploitation of\n\n\n-----\n\nthe SIGRed vulnerability alone. The activity remains an indicator of increase in risk scoring\nand probability of exploitation, but there likely will be many follow-on indicators that will\npress the severity higher. The current overall risk of exploitation score is medium.\n\n**July 2020**\n\nSeveral threat actors posted information from open source reporting about CVE-20201350 and evidence of publicly available imitation PoC code was observed.\nA relatively new actor started a post thread in a popular English-language cybercrime\nforum expressing interest in exploring the vulnerability and potentially building\nsomething with it, but there was no observed interest in the actor’s post. The actor\npreviously advertised dumped databases obtained by exploiting enterprise resource\nplanning software.\nA denial of service (DoS) PoC was released publicly on GitHub.\n\n## Wrap up\n\nUnderstanding the phases of underground activity driven by critical vulnerability disclosures\ncan contextualize new and existing high-impact CVEs. The five indicators provided above\nwere established based on general trend analysis as a point of reference to assist in\ndeveloping a priority assessment for critical CVEs.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-12 - Prioritizing critical vulnerabilities A threat intelligence perspective.pdf"
    ],
    "report_names": [
        "2020-08-12 - Prioritizing critical vulnerabilities A threat intelligence perspective.pdf"
    ],
    "threat_actors": [
        {
            "id": "08c8f238-1df5-4e75-b4d8-276ebead502d",
            "created_at": "2023-01-06T13:46:39.344081Z",
            "updated_at": "2025-03-27T02:00:03.056208Z",
            "deleted_at": null,
            "main_name": "Copy-Paste",
            "aliases": [],
            "source_name": "MISPGALAXY:Copy-Paste",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535554,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653480724,
    "ts_modification_date": 1653480724,
    "files": {
        "pdf": "https://archive.orkl.eu/36a9a0a476c8ebc9f7aebb2d4637cd41a432744b.pdf",
        "text": "https://archive.orkl.eu/36a9a0a476c8ebc9f7aebb2d4637cd41a432744b.txt",
        "img": "https://archive.orkl.eu/36a9a0a476c8ebc9f7aebb2d4637cd41a432744b.jpg"
    }
}