{
    "id": "1c8af496-fb73-46d2-9e9c-c10ed2bd4b82",
    "created_at": "2022-10-25T16:48:11.206439Z",
    "updated_at": "2025-03-27T02:17:05.765796Z",
    "deleted_at": null,
    "sha1_hash": "cb5e7d56d5b9b968249a6af8f66eeb17b00c9d33",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-10-04T00:25:13Z",
    "file_modification_date": "2016-10-07T10:28:57Z",
    "file_size": 5006697,
    "plain_text": "###### 2 0 1 5 G L O B A L T H R E A T R E P O R T\n\n INSIDE:\n\n    -\n###### Targeted Intrusions\n\n    -\n###### Criminal and \n Hacktivist Activity\n\n    -\n###### 2016 Predictions\n\n PROVIDED BY\n\n\n-----\n\nL E T T E R F R O M T H E C E O\n\nIf there’s one thing that businesses, boards of directors and C-level execs can take from **CrowdStrike’s 2015 Threat**\n\n**Report, it is that the paradigm has broadened beyond people, processes, and technology to now include integrated,**\n\ncrowdsourced, and enriched threat intelligence.\n\nOur Global Threat Report highlights that today’s threats, more than ever before, are driven by geopolitical and eco\nnomic events around the world. The primary motivation behind global cyber activity has now shifted from disparate\n\nactivities carried out by individuals, groups and criminal gangs pursuing short-term financial gain, to skilled adversaries\n\ndriven by strategic global conflicts. The economic downturn and new Five Year Plan in China will continue to drive\n\ntheir state-sponsored cyber espionage activities. The situation in the Ukraine and falling oil prices will continue to fuel\n\ntargeted intrusions from Russia. The conflict in the Middle East between Saudi Arabia and Iran over Yemen will continue\n\nto generate hacktivism from that region. CEOs and boards of directors who ignore or disregard the ramifications of\n\nglobal events such as these will pay for it in the loss of revenue, jobs, intellectual property, and shareholder value.\n\nThis shift underscores the importance for an effective intelligence program about the motivations of\n\nyour adversary. The mantra “people, processes and technology” is no longer enough for cyber se\ncurity. In today’s threat environment, it takes **people, processes, technology AND** **intelligence.**\n\nIntelligence is no longer a “nice-to-have.” It is a mandatory element of stopping breaches.\n\nHow can you expect to win if you do not have a solid understanding of how your adversary\n\noperates, what their tendencies are, what their goals are, and what motivates them? Recognize\n\nwhy they would want to come after you and your company. If you don’t know the game plan\n\nof your adversary, you will fail to defend your corporation. It sounds like common sense, but\n\nit is something that is lost in the outdated discussion of people, processes and technology.\n\nCompanies must have intelligence, either home-grown or provided by third-party sources who\n\nhave the trained personnel to monitor, capture and analyze threat data effectively.\n\nEmphasizing intelligence has been a cornerstone for CrowdStrike’s approach to security since the foun\ndation of the company five years ago: Providing cloud-based security powered by comprehensive, in-house\n\nthreat intelligence. With our Falcon Platform and Threat Intelligence team, we have a unique bird’s-eye view by having\n\nour endpoint sensors deployed in more than 170 different countries, handling more than ten billion events per day,\n\nas well as providing incident response services in response to some of the largest breaches. The “brains” behind our\n\nFalcon Platform is our Threat Graph engine, which constantly collects and analyzes billions of events, both in real time\n\nand retrospectively. As a result, on a weekly basis, we are identifying and mitigating hundreds of breaches for which\n\ntraditional defenses silently fail.\n\nThe CrowdStrike team has put tremendous effort into capturing this real attack telemetry, analyzing it, distilling how\n\nadversaries operate, and more importantly, what motivates them. We hope our experiences and the lessons learned that\n\nare manifested in the 2015 Threat Report will provide companies a sampling of the intelligence they need to protect\n\nthemselves in 2016 and beyond.\n\n**George Kurtz. President, CEO & Co-Founder**\n\n\n-----\n\n###### 2 0 1 5 G L O B A L T H R E A T R E P O R T\n\n**RUSSIA 23**\n\n**25 Resurgence of Russian Power**\n\n& Expansion of Intel Gathering\n\n## CON\n**28 The Fifth Domain - The**\n\nInformation Battlespace in Ukraine\n\n**29 CyberBerkut**\n\n**30 BERSERK BEAR**\n\n**NORTH KOREA 31**\n\n**31 North Korean Cyber Espionage in 2015**\n\n**33 Milmanbag**\n\n**33 Hawup**\n\n**33 AIMRAT**\n\n## TENTS 35\n\n\n###### H A C K T I V I S T |  5 7- 6 8\n\n**59 The Rise of Hacktivism in the Middle East**\n\n**59 Iran-Related Groups**\n\n**59 Parastoo, Remember EMAD, and SOBH Cyber Jihad**\n\n**60 Yemen Cyber Army**\n\n**61 Pro-/Anti-ISIS Activity**\n\n**63 Intrusion Capabilities of ISIS**\n\n**63 GEKKO JACKAL Demonstrates Resilience**\n\nand a Criminal Motivation in 2015\n\n###### L O O K I N G F O R WA R D T O 2 0 1 6 |  6 9 - 9 1\n\n**69 Review of 2014 Predictions**\n\n**71 Adversary Operational Security**\n\n**71 Increased Targeting of Embedded Devices**\n\n**71 China Will Continue Conducting Espionage**\n\n**71 Joint Plan of Action as a Catalyst**\n\n**71 Cyber Spillover from Regional Conflict**\n\n**72 Point-of-Sale Attacks in the Wake of EMV**\n\n**72 Destructive and Disruptive Attacks**\n\n**72 R&D**\n\n**73 x86 System and Firmware Security**\n\n**74 State of the TLS Ecosystem**\n\n**74 Attacks and Incidents**\n\n**75 New Developments**\n\n**75 Changes to the Protocol**\n\n**76 Container and Virtualization Security**\n\n**76 Containers**\n\n**77 Virtual Machines**\n\n**78 Targeted Intrusion**\n\n**78 China**\n\n**78 Chinese Intentions in Cyberspace**\n\n**79 The Shifting Dynamics of China’s Cyber Operators**\n\n**80 China’s 13th Five-Year Plan**\n\n**81 Russia**\n\n**82 Iran**\n\n**88 North Korea**\n\n**88 Criminal**\n\n**88 Targeted Criminal Intrusion**\n\n**88 Commodity Malware**\n\n**89 Extortion**\n\n**89 Hacktivism**\n\n**89 Motivation**\n\n**89 DDoS**\n\n|Col1|Col2|\n|---|---|\n\n\n### 35\n\n\n### 31\n\n\n###### I N T R O D U C T I O N | 3 - 4\n\n TA R G E T E D I N T R U S I O N | 5 - 4 6\n\n**CHINA 5**\n\n**07 PII Breaches**\n\n**10 Legal and Regulatory Challenges**\n\nPosed by PII-Focused Targeted\n\nIntrusion Operations\n\n**12 Hacking Team Campaigns**\n\n**12 Possible Timeline**\n\n**13 Censorship, Corruption, and**\n\nChina’s “Cyber Sovereignty”\n\n**14 Rise of the MPS**\n\n**18 Corruption Crackdown and**\n\nMilitary Reorganization\n\n**19 Island-Building in the South China Sea**\n\n**21 TURBINE PANDA**\n\n\n**IRAN 35**\n\n**35 Iranian Control of Western Influence**\n\n**37 Black Spider and the**\n\nArrests of Iranians\n\n**38 Supreme Leader Streamlines &**\n\nObtains Further Control\n\nOver the Internet\n\n**39 Iran Prioritizes its National**\n\nInternet, Network Infrastructure,\n\nand Cyber Capabilities\n\n**42 ROCKET KITTEN**\n\n**43 INDIA**\n\n**45 SOUTH AMERICA**\n\n###### E - C R I M E |  4 7- 5 6\n\n**49 Trends in eCrime Activity - 2015**\n\n**51 Emergence of Extortion-Based**\n\nCriminal Operations\n\n**52 I ntelligence-Powered Social**\n\nEngineering Scams\n\n**54 Blurring Lines Between**\n\n\n### 31\n\n\n-----\n\n## INTRODUCTION\n\n###### At CrowdStrike, a fundamental belief is that intelligence powers everything we do. It drives our next-generation endpoint protection, it fuels our incident response teams so they can resolve incidents faster, and it is consumed by our customers and their enterprise tools, allowing them to detect and stop attacks.\n\n\nwell-known proverb captures the\n\nessence of intelligence: In the land\n\nof the blind, the one-eyed man is\n\nking. One who is better informed\n\nthan his adversaries will have the advantage. A\n\nIntelligence helps remove uncertainty from\n\ndecision making; businesses around the world\n\nuse various types of intelligence to ascertain\n\nwhat markets they should focus on, and how they\n\nshould enter those markets. Intelligence about\n\nwhat personnel, which business units, or what\n\nproducts are being targeted by malicious threat\n\nactors can similarly aid in the decision-making\n\nprocess for the business. This transcends the\n\nsecurity operations center and incident response\n\nmeasures. This information can help the business\n\nmake more informed decisions, from the IT team,\n\nthe C-suite, and even the board of directors.\n\nIncreasingly, organizations around the globe are\n\nusing threat intelligence to make their enterprises\n\nsmarter and more resilient. These organizations\n\nuse threat intelligence to stay ahead of the adver\nsary. As more and more organizations begin to\n\nutilize threat intelligence, the value in understand\ning what these threats mean to the business be\ncomes evident. Intelligence powers everything we\n\ndo, and it can power everything you do as well.\n\n\nThis year’s CrowdStrike Intelligence Global\n\nThreat Report contains a wealth of intelligence\n\nregarding adversary behavior, capabilities, and\n\nintentions. More importantly, it ties it back to\n\nthe events that influenced those activities. By\n\nunderstanding the events that shape the beliefs\n\nand motivations of threat actors—regardless if\n\nthey are criminal, nation-state, or hacktivist—it\n\nis possible to comprehend what drove the\n\nadversaries to behave as they did, and perhaps\n\nto understand what this will mean for the future.\n\nThe hope is that this report will provide a lens\n\nby which the reader can begin to view the world\n\nthrough the eyes of the attacker and use that\n\ninformation to stay ahead of the adversary—or\n\nas some might say, “to the left of boom”.\n\nCrowdStrike buckets more than 70 designated\n\nadversaries into three different motivations.\n\nThese motivations—Targeted Intrusion, eCrime,\n\nand Hacktivism—can be influenced by a wide\n\nrange of external factors. Targeted intrusion\n\nis most frequently executed by nation-states\n\nseeking to collect intelligence to facilitate\n\npublic and private decision making. These\n\nnations have collected intelligence from private\n\nenterprises, non-governmental organizations,\n\nmilitary and defense related businesses, foreign\n\n\ngovernments, and individuals deemed to be\n\ndangerous to the aggressor. Electronic crime\n\n(eCrime) is financially motivated activity by\n\nthreat actors targeting any number of victims\n\nranging from individuals to corporations. Tar\ngeted eCrime is an issue that is emergent and\n\ncovered in the report as well. Hacktivism can\n\npop up at any time, for any reason, anywhere;\n\nhacktivist actors may be nationalists, social\n\nactivists, terrorist supporters, or pranksters.\n\nThis report is organized differently from our\n\nprevious Global Threat Reports. In years past, the\n\nreports contained a review of notable activity\n\nfollowed by adversary-specific information, and\n\nthey culminated in a looking forward section.\n\nThese reports were contiguous and meant to be\n\nread from start to finish. This report is designed\n\nto flow more like a magazine; there are feature\n\nreports on various topics, smaller pieces meant\n\nto augment those topics, and profiles of select\n\nadversaries. The basic structure covers the three\n\nadversary motivations tracked by CrowdStrike:\n\nTargeted Intrusion, eCrime, and Hacktivism. This\n\nis followed by a review of predictions from last\n\nyear’s report to track how those predictions\n\npanned out, and what to expect for 2016.\n\n\n-----\n\n###### Throughout the year, the\n 2 0 1 5\n CrowdStrike Intelligence team G L O B A L provides numerous intelligence summaries to customers with T H R E A T varying periodicity. These R E P O R T intelligence summaries are meant to memorialize what occurred in a specified period of time. It is our hope that by reviewing previous activity, we can begin to peer around the corner to predict what may occur in the future.\n LOOKING\n Adversaries are human; they have patterns, preferences, and short- and long-term plans. If we pay close attention, these patterns can lead to a better understanding of the mindset of the adversary, and ultimately allow us to know their next move. The Looking Forward section is a sample of the CrowdStrike Intelligence analysts, peering around the corner to see what the coming year may hold.\n\n REVIEW OF  2014 PREDICTIONS\n\nThe 2014 Global Threat Report had many\n\npredictions based on analytic judgements\n\nabout what might happen in 2015. We believe\n\nthat when we make such assessments, it is a\n\ngood exercise to review them each year so\n\nwe can continue to improve our tradecraft. [FORWARD]\n\n\n###### 2 0 1 5 G L O B A L T H R E A T R E P O R T\n\n LOOKING\n\n# [FORWARD]\n\n\n-----\n\n**Adversary Operational Security**\n\nIn the 2014 report, CrowdStrike assessed that\n\nthe launch of the free SSL certificate service\n\nLet’s Encrypt might have an impact on increased\n\nusage of secure communication protocols by\n\nadversary tools. Let’s Encrypt did not launch\n\nas expected, and it only entered public beta in\n\nthe final weeks of 2015. Even with the late 2015\n\nlaunch, public reporting indicates that certificates\n\nfrom Let’s Encrypt were misused in an Angler\n\ncampaign within weeks of the public beta.\n\nCrowdStrike also advised that it was pos\nsible that adversaries would deploy more\n\nsophisticated encryption schemes in 2015.\n\nCrowdStrike did observe a number of adver\nsaries increasingly implementing Virtual Private\n\nNetworks (VPNs), novel encryption schemes,\n\nand Point-to-Point encryption solutions in\n\n2015. This dynamic by multiple actors was\n\nobserved across all adversary motivations.\n\n**Increased Targeting of Embedded Devices**\n\nCrowdStrike assessed that we would see in\ncreased targeting of embedded devices by various\n\nactors. This is well highlighted by the actions of\n\nGEKKO JACKAL, who deployed a massive botnet\n\nusing a weakness introduced by the Shellshock\n\nvulnerability on embedded routers, cameras,\n\nand other network-attached devices. Targeted\n\nintrusion actors were observed compromising\n\nCisco routers and switches in victim environments,\n\nand an unknown actor has been tracked com\npromising embedded devices across the globe.\n\n**China Will Continue Conducting Espionage**\n\nCrowdStrike did not need a crystal ball for this\n\none; we assessed that China would continue\n\nconducting espionage that supported objectives\n\nlaid out in the 12th Five-Year Plan, supported\n\ntheir agenda in the South China Sea, and worked\n\nagainst an increasingly defiant Taiwan. We further\n\nassessed that China would continue to conduct\n\nattacks in support of “soft power” initiatives,\n\n\nfrom which efforts such as the Shanghai Coop\neration Organization (SCO) and the Silk Road\n\nInitiative would benefit. All of these activities\n\nwere observed throughout the course of 2015,\n\nwith Chinese intrusion activity expanding in\n\nall directions to include increased targeting in\n\nsupport of anti-corruption measures implement\ned by the government under President XI.\n\n**Joint Plan of Action as a Catalyst**\n\nThe CrowdStrike Intelligence team’s 2014 predic\ntions around Iranian intrusion activity vis-a-vis the\n\nsuccess or failure of the JPOA were thankfully not\n\ntested. The prediction pertained to the likelihood\n\nthat Iran would conduct retaliatory cyber attacks\n\nif the JPOA was perceived by Iran as taking a\n\ndisadvantageous turn, or outright failing. Fortu\nnately, neither of those scenarios came to fruition,\n\neven though the JPOA negotiation process\n\ntook longer than expected and was arduous.\n\nFurthermore, increased escalation of activity\n\nin Yemen by Houthi fighters and the military\n\naction of other nations diverted much of Iran’s\n\nattention to that region. Further escalation\n\nin the Syrian civil war further distracted Ira\nnian actors whose attention appears to have\n\nbeen focused on Gulf Cooperation Council\n\n(GCC) members, specifically Saudi Arabia.\n\n**Cyber Spillover from Regional Conflict**\n\nUkraine, the South China Sea, Syria, and global\n\nenergy prices were all identified in the 2014\n\nreport as being potential flash points for cyber\n\nactivity. This was all very much the case in 2015.\n\nUkraine was a hotbed of activity by a variety\n\nof Russian Federation-based adversaries who\n\nconducted extensive intelligence-collection op\nerations and possibly even kinetic attacks using\n\ncyber means. The South China Sea continued\n\nto be an issue between various nations in that\n\nregion as China continued to develop airstrips\n\nand naval stations in the contested atolls.\n\n\nChinese intrusion activity against Vietnam, the\n\nPhilippines, and Taiwan occurred routinely as the\n\nChinese sought to collect critical intelligence on\n\npotential repercussions of their aggressive pos\nture. ISIS activity in Syria and abroad spawned\n\nnumerous groups on both sides of Da’esh, who\n\nsniped at each other with compromises, data\n\nleaks, and disruptive attacks. The impact of\n\neconomic sanctions and global energy prices\n\nsurely had an impact on Russian intrusion activ\nity, as it conducted operations against countries\n\nfrom the Commonwealth of Independent States\n\n(CIS), across Europe, and into the United States.\n\n**Point-of-Sale Attacks in the Wake of EMV**\n\nCrowdStrike assessed that the instances of point\nof-sale (PoS) malware would sharply decline as\n\nEMV became the predominant technology in the\n\nUnited States. In October 2015, many payment\n\nprocessors implemented a fraud liability shift for\n\nvendors not supporting EMV technology. This\n\ntechnology does make commodity PoS malware\n\nas it existed ineffective—an unforeseen occur\nrence, despite increased usage of PoS malware at\n\nthe end of 2015. As criminals realized that the PoS\n\ntools they had developed would be rendered use\nless, they rapidly deployed their malware in a last\nditch effort to collect as much data as possible.\n\n**Destructive and Disruptive Attacks**\n\nCrowdStrike, as expected, observed an increase\n\nin disruptive and destructive attacks. The\n\nlion’s share of these attacks was conducted by\n\nhacktivist actors conducting DDoS attacks for\n\na variety of motivations. Attacks by extortionist\n\nactors such as PIZZO SPIDER, MIMIC SPIDER, and\n\nother copycat groups became an almost-daily\n\noccurrence, moving from Bitcoin businesses to\n\nlarge-scale financial and technology companies.\n\nRansomware also increased substantially in\n\ndistribution and variety over the course of 2015,\n\na constant threat with the potential to devastate\n\nanyone from an individual, small/medium business\n\nup through massive enterprises. Destructive\n\n\nattacks by nation-state actors continued through\n\n2015, with activity by VOODOO BEAR domi\nnating the headlines toward the end of 2015.\n\n###### R&D\n\nA key component of understanding the\n\nthreat landscape and where it is going is to\n\nobserve the direction of security research.\n\nTomorrow’s exploitable vulnerability or security\n\nbypass is likely being explored by research\ners today. Time and time again the security\n\ncommunity’s research has been picked up by\n\nsavvy attackers and forged into a weapon\n\nused by adversaries to achieve their goals.\n\nIn 2015, issues with encryption dominated\n\nthe headlines of attacks, as well as being\n\nrelentlessly tested by security researchers\n\nseeking to find flaws in these systems that\n\nprotect our personal data and business secrets.\n\nSecure boot processes are a key component\n\nof trusted computing; if the boot process has\n\nbeen compromised, then it’s game over.\n\nOver the years, an arms race has been raging\n\nbetween system designers and researchers\n\ndriving down to the silicon chips that support\n\nthe boot process, exposing previously unknown\n\nflaws in software that we rely on every day.\n\nThis leads to enhanced protections, and in\n\nsome cases, wily attackers can use the flaws\n\nto compromise systems at a very low level.\n\nVirtual Machine computing is another area of\n\nintense research. In the last year, it became\n\napparent here, too, that low-level drivers and\n\ncode to support antiquated devices could\n\ndiminish the security of the overall system.\n\nWith these research stories slowly percolating\n\ninto the mainstream media, it is important\n\nto keep an eye on novel research that may\n\nlead to critical exposures in the future.\n\n\n-----\n\n- In March of 2015, the Chinese root CA CNNIC\n\nwas removed from some major browsers\n\nafter a security incident was revealed by the\n\nGoogle Chrome team. CNNIC had issued a\n\nfull root CA certificate to a third party that\n\nhad used it for testing in network equipment\n\ndesigned to do transparent TLS interception.\n\n- March 2015 also saw the first large-scale attack\n\nof the so-called Great Cannon of China. In this\n\nincident, unsuspecting international visitors\n\nof the Baidu search engine had malicious\n\nJavaScript injected into their connection. As\n\nCrowdStrike pointed out at BlackHat USA\n\n2015, this attack would have been impossible\n\nwith HTTPS in place, a lesson that many large\n\nChinese companies have not yet taken to heart.\n\n- In December, the government of Kazakhstan\n\nannounced that it would require Internet users\n\nto install a custom root CA certificate, thereby\n\nmaking it possible for the government to inter\ncept all of the HTTPS connections of its citizens.\n\nOne alarming trend is for security software, such\n\nas anti-virus programs, to do TLS interception\n\nand inspection by installing their own certificate\n\ninto the browser root CA store. While these\n\ntools generate a certificate for each installation,\n\nthey sometimes introduce other weaknesses.\n\nDuring a survey, it was discovered that commonly\n\nused AV software such as Avast, Kaspersky,\n\nand ESET would degrade the security of TLS\n\nby being susceptible to the FREAK and CRIME\n\nattacks. This is facilitated by not implementing\n\nHTTP Public Key Pinning (HPKP) or Online\n\nCertificate Status Protocol (OCSP), stapling,\n\nand in general supporting older, less-secure\n\nciphers. Due to the difficulty of implementing\n\nTLS correctly, it is perhaps not surprising that\n\nrunning additional software to do TLS intercep\ntion increases the attack surface of a system.\n\n\n**x86 System and Firmware Security**\n\nAfter seeing adversaries deploy Basic Input\n\nOutput System (BIOS) implants for some time, the\n\ntopic of system and firmware security seems to\n\nhave finally arrived in mainstream security discus\nsions. The Hacking Team leak revealed them to be\n\ndeveloping a BIOS persistence implant deployed\n\nvia physical access; other government-backed\n\nactors such as ENERGETIC BEAR have also been\n\nobserved by CrowdStrike Intelligence to scout\n\nBIOS dumps after remote system compromise,\n\npotentially enabling BIOS implantation. Besides\n\ndeploying BIOS implants after remote compro\nmise, ensuring the integrity of a system after\n\nphysical access due to border inspections or\n\nsupply chain interdiction is a growing concern for\n\nmany medium- and high-ranking business officials.\n\n###### “ TOMORROW’S  EXPLOITABLE VULNERABILITY  OR SECURITY BYPASS\n IS LIKELY BEING \n EXPLORED BY  RESEARCHERS \n TODAY.\n\n ”\n\nModern flash chips that store BIOS images,\n\ncolloquially known as Read Only Memory (ROMs),\n\nshould be write-protected after system boot\n\nto protect against simple firmware reflashing\n\nattacks, which can occur after privileges have\n\nbeen escalated in the running operating system.\n\nEven with such protection, vulnerabilities in\n\nthe boot process (or sometimes after the boot\n\n\nprocess) can be exploited to circumvent this\n\nsimple write-protection. Pedro Vilaça uncovered\n\na vulnerability in how Apple OS X manages\n\nflash chip write-protection: Upon resume after\n\nsuspend-to-RAM, the boot code failed to ensure\n\nwrite-protection, effectively leaving the flash chip\n\nunprotected following the first suspend-resume\n\niteration. Since a suspend can generally also\n\nbe triggered by malicious software running\n\non the system, this effectively enables BIOS\n\nimplant deployment after remote compromise.\n\nPolish security researcher Joanna Rutkowska\n\ncovered the state of establishing a trust\nworthy boot chain on the x86 architecture\n\nin a much broader analysis in her excellent\n\npaper “Intel x86 considered harmful”. While\n\nher analysis paints a rather grim picture of the\n\ncurrent state of affairs, it is an accurate picture\n\nof analysis from a paranoid perspective.\n\nThe Purism company attempted to create a\n\n“fully liberated” laptop that did not depend on\n\nany binary or closed-source firmware for any\n\nof its components. However, to date they have\n\nnot managed to “liberate” the different firmware\n\npackages required for running modern Intel\n\nprocessors (see also Rutkowska’s analysis of Intel\n\nME and associated binary blobs). Google Chrome\nbooks rely on the open-source Coreboot firmware\n\nfor initializing the system and can be seen as fully\n\nopen-source boot chain implementation. Yet even\n\nthey have to rely on binary blobs supplied by Intel\n\nto support chipset and processor initialization\n\nand memory training. Multiple researchers are\n\nactively working on reverse engineering Intel\n\nME firmware binary blobs, and CrowdStrike\n\nexpects more publications on this in 2016.\n\nIt appears impossible to create a fully\n\nuser-controlled boot chain on x86 going\n\nforward, and it is expected that there will be\n\nfurther research into the closed binary blobs\n\nand uncovering of associated vulnerabilities.\n\n\nA new extension to the Intel processors called\n\nSoftware Guard Extensions (SGX) has been\n\ngaining attention by security researchers. SGX\n\nwas designed to bootstrap a trusted enclave in\n\nan untrusted ecosystem (such as cloud com\nputing), but it may also be abused for Digital\n\nRights Management (DRM) or rootkit purposes\n\naccording to multiple researchers’ assessments.\n\nAs the first processors implementing SGX\n\nbecome available in 2016, CrowdStrike expects\n\noffensive and defensive research leveraging\n\nthis technology to follow suit promptly.\n\n**State of the TLS Ecosystem**\n\nTransport Layer Security (TLS) is the centerpiece\n\nof modern connected systems providing a secure\n\ncommunication protocol. As such, it was not\n\nsurprising that 2015 saw a wealth of attacks on\n\nthe TLS protocol. During the same time, standards\n\nbodies were actively improving the protocol and\n\nphasing out old and insecure aspects of it in\n\norder to help mitigate possible attack surface.\n\n**ATTACKS AND INCIDENTS**\n\nThroughout 2015 numerous notable events took\n\nplace that demonstrated potential misuse of\n\nTLS and possible implications of such misuse.\n\n- In February 2015, it was revealed that com\nputer maker Lenovo had been pre-installing\n\nthe Superfish Visual Search software on its\n\ncomputers running Windows. This software\n\ninstalled a static TLS root certificate authority\n\n(CA) and corresponding private key into the\n\nsystem, thereby placing every user at risk of\n\nbeing attacked via a Man-In-The-Middle attack\n\non the TLS protocol. Lenovo published an\n\napology to its users and released a removal tool\n\nas open-source software. Later in 2015, it was\n\ndiscovered that Dell had also been pre-installing\n\na root CA and key on its Windows machines,\n\nresulting in the same security risks for users.\n\n\n-----\n\n**New Developments**\n\nOn 3 December, the first free and automated\n\nTLS Root Certificate Authority launched to the\n\ngeneral public. Called Let’s Encrypt, it offers\n\nfree certificates for manual and automated\n\nconsumption. Contrary to existing CAs, it\n\ndoes not require any manual interaction to\n\nget or refresh a TLS certificate for a website,\n\nwhich is why certificates issued by Let’s\n\nEncrypt will only be valid for three months.\n\nThe HTTP/2 specification was finalized by\n\nthe Internet Engineering Task Force (IETF) in\n\nMay 2015 (RFC 7540). It is a major overhaul of\n\nthe venerable HTTP protocol that will greatly\n\nincrease the performance of resource-heavy\n\ninteractive websites and speed up browsing\n\nfor mobile users. While the IETF working group\n\nrefrained from making TLS/HTTPS (and thus\n\nencryption) mandatory for HTTP/2, a number\n\nof browser vendors have already announced\n\nthat they will only support HTTP/2 with HTTPS.\n\nSupport for HTTP/2 already exists in major\n\nbrowsers and web servers, but it remains to be\n\nseen whether the added functionality will result\n\nin new vulnerabilities. HTTP/2 will require less\n\nperformance trickery by application developers,\n\nand it makes dedicated external Content Delivery\n\nNetworks (CDNs) for JavaScript less attractive.\n\nIn April 2015, the Public Key Pinning Extension\n\nfor HTTP (HPKP, RFC 7469) was published by\n\nthe IETF. This is an HTTP header which tells\n\nbrowser to “pin” a public key certificate for the\n\ncurrent website, only accepting this particular\n\ncertificate for a specific time range. Used\n\ncorrectly, this extension will make intermittent\n\nTLS Man-In-The-Middle practically impossible.\n\nIn January, the Certificate Transparency project\n\nby Google started to be made mandatory for\n\nExtended Validation (EV) certificates in the\n\nChrome browser. This project, which is basically\n\na verifiable log of issued certificates, will make it\n\n\nimpossible for a CA to issue a certificate without\n\nthe rightful domain owner becoming aware of it.\n\nOther software on the web landscape is also\n\ncreating a noticeable incentive for the adoption\n\nof TLS/HTTPS. The HTML5 ServiceWorker spec\n\nwill enable fast, near-native online and offline\n\napplications, but it will only work on HTTPS\n\nwebsites. The Chrome browser will now display\n\nmixed-content warnings (HTTP and HTTPS\n\ncontent) like plain unencrypted websites. W3C\n\ninitiatives like Subresource Integrity (SRI) and\n\nthe Content Security Policy 2.0 (CSP), both\n\nactively developed during 2015, greatly increase\n\nthe security and robustness of web applications.\n\nFurthermore, these measures can mitigate some\n\nof the inherent risk emanating from insecure\n\nwebsites. In 2015, multiple (free) services ap\npeared that aid users in checking for insecure\n\nweb-server and header settings and offer\n\nready-made configuration snippets to achieve\n\nA-grade TLS security without much effort.\n\n**Changes to the Protocol**\n\nThe IETF is currently in the process of developing\n\nversion 1.3 of the TLS protocol. While TLS v1.3\n\nis still in draft state, a number of promising\n\nimprovements have already emerged. TLS v1.3\n\nwill no longer support any type of handshake that\n\ndoes not offer perfect forward secrecy (PFS).\n\nA number of cryptographically weak ciphers\n\nand options will be removed in v1.3. In terms\n\nof performance, TLS v1.3 will also enable faster\n\nhandshakes that use fewer round trips between\n\nclient and server. This will greatly increase\n\nperformance, thus further driving TLS adoption.\n\n**Looking Ahead**\n\nWhile an automated and free CA will hopefully\n\ndrive the adoption of TLS, it can also be used for\n\nmalicious purposes. The end of 2015 already saw\n\nLet’s Encrypt being employed for malicious ads.\n\nOur prediction for 2016 is that we will encounter\n\nmore incidents where actors leverage the ease\n\n\nand anonymity of creating TLS certificates to\n\nenable attacks and hide their tracks. With a\n\nvalid TLS certificate, malicious content can be\n\nreferenced across domains without triggering\n\nmixed content warnings. If an attacker can host\n\ncontent on a subdomain of a legitimate business,\n\nhe will be able to create a TLS certificate for\n\nthat domain that will look authentic to a user.\n\nTraffic protected by TLS can bypass systems\n\nlike an IDS more easily, as it is encrypted. As\n\nthe “green lock” of TLS-protected websites\n\nbecome more prevalent on the Internet, users\n\nwill have to be educated that it does not imply\n\ntrustworthiness of the site. In the face of these\n\nchallenges to network-based security solutions,\n\nnext-generation endpoint protection will become\n\neven more critical to enterprise security.\n\n###### CONTAINER AND VIRTUALIZATION SECURITY\n\nIn 2015, virtualization was still the go-to tech\nnology to achieve multi-tenancy for a number\n\nof applications. Dozens of companies have\n\nemerged that either offer such infrastructure\n\nas a service or provide solutions for monitoring\n\nand managing the ever-growing fleet of virtual\n\nmachines. It is not surprising that the demand\n\nfor secure deployment guidelines has surged.\n\n**Containers**\n\nAnother emerging trend in terms of multi-tenancy\n\nis the containerization of applications. Containers\n\nare not as heavyweight as VMs, and thus are\n\neasier to set up and significantly more re\nsource effective than VMs on shared hardware.\n\nFor many users, the only reason to employ VMs\n\nis the perceived lack of isolation that popular\n\ncontainer software offers at this time. Providing\n\na secure isolation layer will be paramount for\n\ndriving the future adoption of containers.\n\nDocker is a container solution built on recently\n\nadded features of the Linux kernel, and it is\n\narguably the most prominent and widely used\n\n\n###### “IN THE FACE OF THESE\n\n CHALLENGES TO NETWORK\n BASED SECURITY \n\n SOLUTIONS, NEXT- GENERATION ENDPOINT PROTECTION WILL BECOME EVEN MORE CRITICAL TO ENTERPRISE SECURITY.”\n\n\n-----\n\ncontainer software today. There has been some\n\nconfusion as to the purpose of Docker containers\n\nand the level of isolation these can offer. Since\n\napplications can easily escape Docker containers\n\nunder certain circumstances, even proponents\n\nof containers have gone so far as to point to\n\nVMs for isolation of possibly malicious code.\n\nFrom the attacks on the Docker ecosystem\n\nand the ensuing discussions in the community,\n\nit is apparent that users are frequently not\n\neducated about the implications of running\n\ncontainers with potentially malicious code.\n\nCurrently, the lack of support for user name\nspaces in Docker means that it is easy to\n\ninadvertently run an application inside a Docker\n\ncontainer as root. In 2015, Docker also added\n\nsignature verification for images, a feature that\n\nenterprise customers had been waiting for.\n\nThe Docker container ecosystem offers a way for\n\nusers to share the containers they created via\n\nthe so-called Docker Hub. This repository holds\n\na large number of pre-installed Docker container\n\nimages, both from official software vendors\n\nas well as regular users. Users can typically\n\nexpect to find an existing Docker image for the\n\nsoftware they want to run inside a container.\n\nIn May, there was an automated survey of\n\nthe official Docker images, i.e., those from\n\nthe actual software vendors. It found that\n\nabout 40 percent of the images suffered from\n\nsevere vulnerabilities that were discovered\n\nand fixed in the course of the previous year\n\n(e.g., Shellshock, POODLE, Heartbleed).\n\nDocker itself saw a number of Common Vulner\nability and Exposures (CVEs) assigned in 2015,\n\nmost of them relating to ways the container\n\ncould either disable or circumvent Linux security\n\nmodels and affect the host system. The Docker\n\nEngine is the actual software behind Docker\n\nthat is responsible for creating and managing\n\n\ncontainers on a host system. Because of the\n\npower that the Docker Engine wields with\n\nregard to the host system, tools instrumenting\n\nit will be a prime target for attackers.\n\n**Virtual Machines**\n\nThere have been a number of critical advisories\n\nrelated to virtualization technology such as Xen\n\nand KVM. For Xen, there were 10 advisories in\n\n2015 that described a way for the guest OS to\n\nescape its confinement, potentially compro\nmising the host system. Another 15 advisories\n\ndescribed various ways for guests to perform\n\na Denial of Service (DoS) of the host system.\n\nIn May, CrowdStrike discovered a vulnerability in\n\nXen that allowed x86 HVM guests to escape to\n\nthe host system through the QEMU floppy disk\n\ncontroller. The vulnerability was patched as part of\n\nXSA-133. Like other privilege-escalation vulnerabil\nities, this one affected more than one virtualization\n\nsolution since it originated in the QEMU emulator,\n\nwhich is used by multiple projects such as Xen,\n\nKVM, and VirtualBox. Other companies came for\nward with similar bugs, showing the vested inter\nest that a wide range of industries has in keeping\n\nthe security model of VMs robust and intact.\n\nBlackHat USA 2015 and DefCon featured talks\n\non cross-VM covert channel communication\n\nusing the CPU. These kinds of attacks are\n\ncertainly quite complex and may be hard to\n\nexecute, yet they show the multitude of potential\n\npitfalls for providers offering VMs to users.\n\n**Looking Ahead**\n\nCrowdStrike expects a number of new challenges\n\nto arise as a result of an increased adoption of\n\ncontainerization technology. The most obvious\n\none will be the fact that more developers and\n\nusers will use containers for external reasons. Ef\nficiency and the continuous march toward virtual\n\nappliances and cross-platform deployment will\n\ndrive increased adoption of these technologies.\n\n\nCurrently, the user base of containers can prob\nably be described as “educated early adopters”,\n\nwhile future generations of users might not be\n\nso savvy. As a result, there will likely be cases\n\nwhere insecure software inside of containers is\n\nnot updated because users lack the knowledge\n\nto do so or because they don’t understand the\n\nsecurity implications. Current operating systems\n\nfrequently offer automatic updates for software\n\ninstalled through system facilities, such as shared\n\nlibraries or servers. Containers, on the other hand,\n\nrequire a different approach to dealing with the\n\nupdate process. Even if the need to update is\n\nevident to the user, it remains to be seen whether\n\ncontainer and software deployment processes\n\ncan keep up with the pace of security issues.\n\n###### TARGETED INTRUSION: CHINA\n\n2016 looks to be a pivotal year for China-based,\n\nstate-sponsored cyber adversaries as China enters\n\na transformational period in terms of its economy,\n\nits global status, and the cyber methods it uses to\n\nachieve its strategic goals. This is most easily dis\ncussed by separating out Chinese intentions in cy\nberspace, the changing dynamics of Chinese cyber\n\noperators, and China’s new Five-Year Plan (FYP).\n\n**Chinese Intentions in Cyberspace**\n\nFor China, cyber operations have previously\n\nbeen a relatively inexpensive means to some\n\nof these strategic ends: It has conducted cyber\n\nreconnaissance on its neighbors to make cal\nculated territorial maneuvers; used extensive\n\ncyber monitoring capabilities to simultaneously\n\nsuppress dissidents and manage a growing\n\npopulation of domestic Internet users; and\n\nconducted cyber espionage in order to steal\n\nintellectual property, fill technological gaps,\n\nand maintain its impressive economic growth.\n\nEfforts by the private sector and the U.S. gov\nernment to expose Chinese cyber operations\n\nover the past several years has raised the cost\n\n\nof these operations both from a financial as\n\nwell as an economic perspective for Beijing,\n\nand in 2015 it came to a boiling point. The\n\nthreat of U.S. economic sanctions and potential\n\ndiplomatic fallout appears to have finally forced\n\nmeaningful dialogue between governments.\n\nIf observed campaigns in late 2015 were any\n\nindication, it is unlikely China will completely\n\ncease its cyber operations, and 2016 will show\n\nthe new direction it is headed. Although China\n\nand the U.S. signed a cyber agreement and\n\nrestarted cyber dialogue between the two nations\n\nfollowing President XI’s September 2015 visit to\n\nWashington, the wording was described by most\n\nanalysts as extremely vague and largely open to\n\ninterpretation. A short time later, China sought\n\nto sign identical agreements with the UK and\n\nGermany, and even sought to normalize a similar\n\nagreement at U.N. proceedings not long after.\n\nBeneath the surface, however, China has not\n\nappeared to change its intentions where cyber is\n\nconcerned. This is best illustrated by how Beijing\n\ntreats its allies as opposed to its rivals. Whereas\n\nthe agreements that China has been attempting to\n\nnormalize specify not hacking for economic espio\nnage purposes, China signed a May 2015 pact with\n\nRussia, a known ally, with both sides abolishing\n\nmalicious hacking of any type against one another.\n\nYet CrowdStrike actually observed an increase in\n\nactivity against Russian targets from HAMMER\n\nPANDA directly following the agreement. The Rus\nsian targeting continued over several months after\n\nthe friendly agreement had been signed, sug\ngesting that Chinese intentions are far removed\n\nfrom the agreements they sign, even with allies.\n\nChina was also observed targeting the website of\n\nthe Permanent Court of Arbitration in the Hague\n\nduring a week-long hearing on its SCS dispute\n\nwith the Philippines. The tribunal was intended\n\nto be a neutral ground to resolve international\n\ndisputes, but Beijing refused to acknowledge the\n\n\n-----\n\ncase as valid, instead infecting the website and\n\npotentially any victims interested in the landmark\n\ncase. This further shows Chinese intentions to\n\ncontinue to use cyber as a means to gain the\n\nupper hand in any international disputes, even\n\nwhen the victim is an impartial judge designed\n\nto equalize opponents and prevent bullying.\n\nObserved activity has shown that China may\n\nchange tactics and reduce its cyber activity\n\nwhen under close inspection. Examples of\n\nthese reductions are apparent in the drop-off of\n\nCOMMENT PANDA activity after the May 2014\n\nPLA indictments, or the cessation of PUTTER\n\nPANDA following the public release of Crowd\nStrike’s analysis of their activity in June 2014.\n\nChina has demonstrated that their operators\n\nwill resume normal activities when scrutiny has\n\ndiminished. The cyber agreements appear to be\n\nan attempt to appease the U.S., avoid economic\n\nsanctions, and offer a chance for China to seize\n\nupon a global initiative to “normalize” sanctioned\n\ncyber activity. China has promised new cyber tact,\n\nhowever the reality of its intentions is far divorced\n\nfrom what it has promised. Given its remaining\n\ntechnological gaps and the strategic edge cyber\n\ncan provide its economy, there is still plenty of\n\nincentive for China to engage in commercial\n\ncyber espionage when opportunities arise.\n\n**The Shifting Dynamics of China’s Cyber Operators**\n\nA reduction in activity by China-based adversaries\n\nin 2016 is possible; such a reduction would be\n\nindicative of a shift in the way China goes about\n\ncyber espionage. The cyber agreements come\n\nat a time when President XI has been preparing\n\na massive military overhaul that would see\n\na bloated PLA trimmed and more resources\n\ndistributed to the PLAAF and PLAN. President XI\n\nhas said that a joint-command structure similar\n\nto the U.S. military is necessary to provide China\n\nwith a modern, nimble fighting force capable of\n\ndefending China’s territory. This carries obvious\n\nimplications for enforcing China’s interests as well\n\n\nas defending them from a physical standpoint,\n\nand will likely make the SCS a continued flash\n\npoint as the reorganization will likely allow\n\nChinese military forces more mobility and\n\nfaster response times to potential conflict.\n\nThe reorganization may also split China’s military\n\ncyber forces into their own division and likely\n\nserves the dual purpose of revamping China’s\n\ncyber forces at a time when more oversight\n\nis needed while giving the impression of a\n\nreduction in U.S. targeting. CrowdStrike has\n\nfrequently observed duplicated collection efforts\n\nby multiple groups, indicating relatively little\n\noversight or coordination between units. At\n\npresent, preventing an outright violation of the\n\ncyber agreement with the U.S. is a high priority\n\nfor China, as economic sanctions would place a\n\nsevere strain on its already-troubled economy. The\n\npotential embarrassment of soldiers moonlighting\n\nas contractors and carrying out operations on\n\nbehalf of Chinese companies has likely prompted\n\na significant drop in normal activity by Chinese\n\nmilitary operators as they undergo a funda\nmental shift in how they carry out operations.\n\nThis reorganization will not happen overnight. It\n\nis slated for completion by 2020; however, cyber\n\nwill likely be a priority due to China’s emphasis\n\non winning informatized wars, meaning that the\n\nshift may be observed soonest in that arena.\n\nPotential signals that the reorganization has made\n\nChina’s cyber forces more efficient would include\n\nimproved tradecraft, better sharing of tools\n\nbetween groups, and coordination on targets.\n\nAs China’s military cyber forces undergo\n\nchanges, China will likely increase its reliance on\n\nits civilian intelligence agencies and associated\n\ncontractors, all of which generally employ better\n\ntradecraft. This includes the Ministry of Public\n\nSecurity (MPS), which has already seen some\n\nmonumental changes to its mission in 2015\n\nsuch as increased overseas operations, as well\n\n\nas the Ministry of State Security (MSS), which\n\nhas typically employed top-tier contractors.\n\nTo illustrate this point, DEEP PANDA, which\n\nCrowdStrike associates as being one of the\n\nnon-military cyber organizations China regularly\n\nuses, has engaged in activity across a wide variety\n\nof sectors since the cyber agreement with the\n\nU.S., and it is expected to continue to do so.\n\nOverall, Chinese cyber activity may shift dy\nnamics, but it is not expected to cease anytime\n\nsoon. Beijing views winning informatized wars\n\nas integral to its rejuvenation as a “great nation”,\n\nand despite the promotion of domestically\n\nsourced innovation and technologies, China\n\nstill has numerous intelligence gaps that cy\nber espionage can assist in filling to accomplish\n\nits long-term strategic goals. A cessation of\n\nintrusions associated with China is unlikely.\n\n**China’s 13th Five-Year Plan**\n\nNotably, China’s economy has reached a tipping\n\npoint as it looks to maintain medium/high growth\n\ntrajectory and to better satisfy its exponentially\n\ngrowing middle class with better access to\n\nquality food, affordable healthcare, and job\n\nopportunities. President XI and senior officials\n\nhave frequently alluded to economic reforms\n\nmultiple times in the past two years, highlighting\n\nthat the CCP recognizes a troubled economy\n\nconstitutes one of the largest threats to party rule.\n\nChina will look to transform its global status as an\n\nexporter of cheap goods (i.e., “Made in China”) to\n\nthat of a domestic powerhouse and innovator.\n\nChina also suffered two serious embarrassments\n\non a global scale: the Chinese stock market crash\nes in mid-2015 and its issuing a pollution red alert\n\nfor Beijing during the Paris climate talks. Both\n\nof these events showed significant weaknesses\n\nwhere China has been looking to brand itself as a\n\nglobal leader, and it is likely that China will seek\n\nto avoid any further incidents that reflect nega\ntively on China in the financial and energy sectors.\n\n\n###### “CHINA SIGNED A MAY 2015 PACT WITH RUSSIA, A\n\n KNOWN ALLY, WITH BOTH\n\n SIDES ABOLISHING MALICIOUS\n\n HACKING OF ANY TYPE\n\n AGAINST ONE ANOTHER.YET CROWDSTRIKE ACTUALLY OBSERVED AN INCREASE IN ACTIVITY AGAINST RUSSIAN TARGETS FROM HAMMER PANDA DIRECTLY FOLLOWING THE AGREEMENT.”\n\n\n-----\n\nThese factor heavily into the first draft of China’s\n\n13th Five-Year Plan, which was released in Novem\nber 2015 and will be finalized in early 2016. These\n\nplans typically provide a roadmap for what China\n\nwill target using cyber means. Alternative energy\n\nand domestic technological innovations will have\n\na renewed focus as China looks to transform its\n\nstandard of living and become less reliant on\n\nforeign technology. This will likely resonate with\n\nChinese citizens as increased opportunity, both\n\nin terms of everyday prospects and entrepre\nneurship, which the CCP is promoting heavily\n\nalong with private sector/military cooperation\n\nas a way to stimulate growth and innovation.\n\nThe combination of China becoming increasingly\n\nuntrusting of western information technology\n\nand a desire to promote its own sectors of\n\nindustrial manufacturing and retail may lead\n\nto a gradual tapering off of targeting against\n\nthese sectors. However, it will also likely\n\nmean increased cyber targeting in areas like\n\nagriculture, healthcare, and alternative energy\n\nthat China deems crucial to promoting the\n\nwellbeing of its growing middle class, and\n\nwhere it has the most technological gaps.\n\n2016 may see Chinese cyber operators targeting\n\nthese sectors not just for intellectual property,\n\nbut also for know-how such as building native\n\nsupply chains and administrative expertise. The\n\ntargeting of U.S. healthcare institutions in 2015\n\nwas suspected to be for espionage purposes,\n\nthough it may have had the dual purpose\n\nof providing western models for supplying\n\naffordable healthcare to citizens as China looks\n\nto modify its current healthcare system.\n\nIt is no coincidence that a plethora of key state\n\nprojects have completion goals of 2020. 2021 will\n\nmark the 100th anniversary of the founding of the\n\nCCP, and the party intends to have myriad suc\ncesses to present to the Chinese people in order\n\nto reinforce its political legitimacy. These projects\n\n\nand targets are wide ranging, with some very\n\nspecific goals (e.g., achieve a 60 percent urban\nization rate, complete the Chinese space station,\n\nreveal a domestically produced aircraft carrier,\n\ndouble 2010 levels of growth) and some extremely\n\nvague goals (e.g., become an “Internet Power” and\n\nbecome a “moderately well-off society”). However,\n\nthere are several stated goals that have strategic\n\nand economic implications for several sectors.\n\n**The included infographic gives a further break-**\n\n**down of potential targets across sectors based**\n\n**on China’s 13th FYP and its strategic projects**\n\n**that are slated for completion by 2020.**\n\n###### RUSSIA\n\nThe Russian National Security Strategy, released\n\non 31 December 2015, both establishes the plans\n\nthe leadership aims to implement throughout\n\n2016 and reflects the desire for the nation to\n\nrealign its interests, focus domestically, and\n\nimprove its influence and standing. A realignment\n\nof interests orients Russia eastward toward\n\nChina and India and places a greater focus on\n\nregional partnerships, such as the Collective\n\nSecurity Treaty Organization (CSTO), as it\n\ndistances itself from NATO. This shift portends\n\nfurther military joint training engagements and\n\nmay also be either complicated or reinforced by\n\nattempts at intelligence collection associated\n\nwith nations in Russia’s sphere of interest.\n\nThe domestic focus alluded to in the strategy\n\nis multifaceted, but in terms of technology the\n\nnation is poised to increase investments in the\n\ntechnology sector. Some of these investments\n\nwere announced or had already begun in 2015\n\nas reports of intent to develop mobile operating\n\nsystems and nationally developed hardware\n\nproliferated. Supplementing the growth in the\n\nnational technological sector will be the increasing\n\ninternalization of data resources and application\n\nof control over content. In 2015 Roskomnadzor,\n\n\nRussia’s communication, information technology,\n\nand mass media service, had enforced legislation\n\ngoverning how private data of Russian citizens’\n\ninformation is handled. The service cracked\n\ndown on foreign companies who operate in\n\nRussia and do not comply. Per legal guidance,\n\ncompanies that possess data belonging to\n\nRussian citizens must provide the government\n\naccess to the data or house their servers within\n\nRussian territory. In terms of content control,\n\nRussia has surreptitiously employed teams of\n\nonline bloggers, commentators, and “trolls” to\n\ndisseminate false information, drown out the\n\nvoices of legitimate users, and direct discussion in\n\na manner chosen by the government. Operating\n\nunder the broad moniker “Internet Research\n\nAgency,” these operators have employed their\n\ntechniques following high-profile events such\n\nas the assassination of political activist Boris\n\nNemtsov in late February, and they are expected\n\nto continue their operations throughout 2016.\n\nAdditionally expected in 2016 are domestic\n\ndeployments of systems that may allow ex\npanded government control of online resources.\n\nGosSOPKA is a government system reportedly\n\ndesigned to detect and eliminate computer\n\nattacks. First imagined in 2013, GosSOPKA is\n\nintended for development and management\n\nby the FSB. It potentially supplements existing\n\nforms of online overwatch such as SORM, but\n\nit also adds an aspect of real-time defense.\n\nGosSOPKA began its initial implementations\n\nin 2015 on Ministry of Economic Development\n\nnetwork resources. Wider plans for distribu\ntion in 2016 and beyond include government\n\nagencies as well as Russia’s diplomatic offices\n\nand consular bureaus located overseas.\n\nIn an effort to improve status and influence, Russia\n\nis still expected to project military power in the\n\nform of bomber training flights and joint military\n\nexercises, but these will likely be seen less fre\n\nquently than in 2015 due to economic challenges\n\nfaced domestically. Improvement of the economy\n\nwas a major talking point within the strategy and\n\na large portion of Russia’s focus on domestic\n\nissues. The improvements will most likely come in\n\nconcrete forms such as sales of natural resources,\n\nbut also in terms of changes to financial policy\n\nand development of partnerships for domestic in\nvestment. These shifts will most likely necessitate\n\ninformation for decision making, and therefore\n\nthey portend increased intelligence collection\n\nby Russia-based adversaries particularly against\n\nregional targets and global energy companies.\n\n###### IRAN\n\nDue to the intense concern of possible\n\nfuture degradation of Iran’s Islamic values\n\nas businesses (primarily western) renew\n\ntrade with Iran, it is highly likely the Iranian\n\ngovernment will react by increasing Internet\n\nmonitoring and censorship on a national scale\n\nas quickly and as effectively as possible.\n\nIt is likely, too, that Iran will also conduct in\ncreasing domestic cyber espionage operations\n\nto be vigilant of any influence of western ideals\n\non Iran, threatening its Islamic culture. Subse\nquently, it is also likely that arrests of Iranians\n\nfor content offensive to Islam or threatening\n\nto the Iranian government (both statements\n\nthat are broad in application to activities) will\n\nincrease as more technical apparatus is put in\n\nplace to monitor and censor network traffic.\n\nFurthermore, the Iranian government will almost\n\ncertainly be concerned about the contents\n\nof any reports from investigative regulatory\n\nbodies on Iran’s continued compliance with\n\nthe nuclear agreement. The relief of sanctions\n\nfrom the JCPOA is of vital importance to Iran\n\nand its economy. During the JPOA negotiations\n\nthrough 2014 and into 2015, Iranian adversary\n\n\n-----\n\n#### CHINA\n\n###### GLOBAL THREAT REPORT\n\n\n###### High Speed Rail Projects Electric/Hybrid Transportation Airlines •• Unmanned Aerial Vehicle technologies PACOM logistics support and cleared\n**IMPACT:** **IMPACT:** **IMPACT:** contractors in SCS\n\n                - Railway project bidding                - Electric car/bus production facilities                - Passenger Name Records\n\n               - Government Transportation               - Charging Station/Rechargeable Battery               - Mergers and Acquisitions Information\nAuthorities Technology                 - Logistics/Operations/Processes information\n\n               - High Speed Rail R&D               - Companies developing component technologies               - Route Information\n\n83 84\n\n\n###### Navy/Air Forces\n**IMPACT:**\n\n                                          - Aircraft/Carrier Operations\nand Technology Targeting\n\n                                     - Sea based weapon technology\n\n                                       - Unmanned Aerial Vehicle technologies\n\n                                        - PACOM logistics support and cleared\ncontractors in SCS\n\n\n###### COMPRE- HENSIVE\n\n\n\n                                        - Aircraft/Carrier Operations\nand Technology Targeting\n\n                                   - Sea based weapon technology\n\n                                    - Unmanned Aerial Vehicle technologies\n\n                                     - PACOM logistics support and cleared\ncontractors in SCS\n\n\n###### Intelligence\n\n\nAcademic\nEducational\n\n\nAerospace\nResearch design\n\n\nAutomotive\nIOrganizatiosn\n\n\nCasino\nFacilities that house\n\n\nChemical\nOrganizations that\n\n\nDefense\nGov’t & commercial\n\n\nDissident\nIndividuals &\n\n\nEnergy\nOrganizations\n\n\nEngineering\nOrganizations that\n\n\nEntertainment\nOrganizations that\n\n\nMining Financial Gaming\nExtraction of valuable Provide financial Organizations\n\n\n-----\n\n###### 9 Chinese Adversaries\n\n\n###### 9 Chinese Adversaries 11 Chinese Adversaries\n\n\n###### Think Tanks 9\n**IMPACT:** Chinese\nPolicy and analysis related Adversaries\nto CN financial issues\nPolicy and analysis related to\nglobal economic forecasts\nPolicy and analysis of\nTaiwan/SCS issues\n\n###### Media\n\nCoverage and analysis of CN issues and events\n\n\n\n   - Meeting/conference agendas, rosters\n\n   - Targeting of traditional GPS market\ndominance (new rivalry with Beidou\nSatellites)\n\n                                   \n                                   \n                                  \n\nAnalysis and reporting on economic\n\n\n85 86\n\n\n###### Pharmaceuticals\n\n**IMPACT:**\n\n              - Theft of Manufacturing processes/formulas\n\nfor humans and livestock\n\n              - Domestically produced competitive products\n\n                        - Supply Chain/Logistics to\n\ndeliver drugs to patients\n\n                                                                                 \n\nGovernment\nInstitutions\n\n\nHealthcare\nProvide goods and\n\n\nInternet\nServices\n\n\nManufacturing\nMechanical physical\n\n\nMedia\nOrganizations whose\n\n\nOil/Gas\nInvolved in the\n\n\nPharmaceutical\nOrganizations that\n\n\nPolitical\nEntities responsible\n\n\nProfessional\nServices\n\n\nRetail\nOrganizations involved\n\n\nShipping Telecommunication Think Tank/NGO\nOrganizations engaged Organizations that design Provide advice &\n\n\n-----\n\nROCKET KITTEN was observed continuing to\n\ntarget European and regional targets in cyber\n\nespionage campaigns with the likely intent (at\n\nleast in part) of obtaining an advantage in the\n\nnegotiating process. Thus, reporting associations,\n\nreceiving parties, and third parties such as host\n\ngovernments for meetings should expect it is\n\nlikely they would be included in targeting by\n\nIranian cyber espionage operations for knowledge\n\ngathering. The threat is increased if Iran violates,\n\nor is accused of violating, the JCPOA and risks\n\nthe re-establishment of economic sanctions.\n\nLastly, as assessed once evaluating the U.S.\n\nGovernment report in June 2015, Iran separates\n\nits nuclear policy (and the JCPOA agreement\n\nwith the P5+1 countries) from its foreign policy\n\nin the Middle East. Through 2014, regardless of\n\nongoing nuclear negotiations, Iran continued to\n\nsupport Lebanese Hezbollah, a number of Iraqi\n\nShia militant groups, Hamas, Palestine Islamic\n\nJihad, and the regime of Syrian President Bashar\n\nal-Assad. Although the report was from 2014, U.S.\n\nofficials claim the activities continued into 2015.\n\nAdditionally, Iran is also strongly suspected of\n\nproviding various means of logistical and financial\n\nsupport for the Zaidi Shiite insurgent group\n\nknown as the Houthis throughout 2014 and 2015.\n\nThere are no indications that the Iranian gov\nernment will shift from its current foreign policy\n\nsupporting the aforementioned groups. Specifical\nly, there are increasing tensions between the two\n\nregional powers of Iran and the Kingdom of Saudi\n\nArabia (KSA) that increase the likelihood that Iran\n\nwould use its proven cyber capabilities in 2016,\n\ntargeting Saudi Arabia and regional governments\n\nthat are becoming involved in the two countries’\n\ndispute by choosing to align with Saudi Arabia.\n\nOne escalating tension is the Yemen conflict,\n\nin which Iran has supported the Houthi rebels\n\nagainst a Saudi-backed Yemeni government in\n\nexile. The Saudi-led coalition announced on 2\n\n\nbureaus, which have participated in illegal drugs,\n\ncounterfeiting, and other illicit activity. The cyber\n\nagreement between the U.S. and South Korea is\n\nonly likely to exacerbate the DPRK’s justification\n\nfor continuing to target the the two countries.\n\nCrowdStrike anticipates continued intelligence col\nlection activity and incremental improvements in\n\nthe technological capabilities of the DPRK in 2016.\n\n###### CRIMINAL\n\n**Targeted Criminal Intrusion**\n\nDuring 2015, cases of targeted intrusion were\n\nobserved by groups dubbed Carbanak, Butterfly\n\n(a.k.a. Wild Newtron), and FIN4. These groups\n\nhave all used customized malware to target large\n\norganizations for high-value financial gain. Crowd\nStrike assesses it is likely that targeted criminal ac\ntivity will continue to increase in the coming year.\n\nGroups operating globally but often originating\n\nout of Lagos, Nigeria used opportunistic targeting\n\nin 2015 to gain a foothold in organizations using\n\nreadily available remote access tools. These\n\ngroups used this foothold to collect intelligence\n\nabout lexicon, organizational charts, and business\n\nprocesses to conduct highly targeted social\n\nengineering. Similar groups focused research\n\non publicly available information to collect their\n\nintelligence. Such activity is likely to continue\n\ninto 2016, as the potential financial reward is high\n\nand the prosecution of such activity is difficult.\n\n**Commodity Malware**\n\nMarkets used to obtain banking Trojans and\n\nransomware will both increase and diversify with\n\nmore malware family authors attempting to gain\n\nincreased market share. Criminal actors often ob\ntain malware, exploits, and binders (packers) from\n\nunderground markets and forums; competition in\n\nthese forums has been observed and continues\n\nto increase. Authors are constantly looking to\n\ngrow their user base through novel features and\n\nincreased stealth from anti-virus technology;\n\n\nJanuary 2016 that the 15 December 2015 cease\nfire agreement, which had been violated multiple\n\ntimes by both sides, would end on that day at\n\n1100 GMT, meaning the conflict is far from over. A\n\nSaudi Arabian air strike on 8 January 2016 resulted\n\nin the near-bombing of Iran’s embassy in Sanaa,\n\nYemen. Erroneously, Iran media first reported that\n\nthe embassy had been hit during the air strike.\n\nOn the same day as the end of the Yemeni cease\nfire on 2 January 2016, Saudi Arabia executed\n\nShiite cleric Nimr Al-Nimr. Sheikh Al-Nimr had\n\nbeen charged with instigating unrest while he\n\nparticipated in protests against the Saudi gov\nernment during the Arab Spring in 2011. Al-Nimr\n\nwas convicted in October 2012, sentenced to\n\ndeath, and had been scheduled for execution with\n\n46 other prisoners at an undetermined date.\n\nFollowing the executions, Iranian protestors—\n\nmotivated by the execution of a prominent\n\nShiite cleric and seeing the action as an offense\n\nagainst Shiite Muslims by the Sunni-ruled Saudi\n\nArabia—attacked the Saudi Arabian embassy in\n\nTehran. Saudi Arabia was forced to remove its\n\ndiplomatic personnel from the embassy. Adding to\n\nthe tensions, the governments of Bahrain, Sudan,\n\nQatar, Kuwait, and the United Arab Emirates\n\n(UAE) also severed or downgraded diplomatic\n\nties in support of their alliance with Saudi Arabia.\n\nWith the regional tensions heading into 2016,\n\nthere is increased likelihood Iran would use its\n\ncyber capabilities—which are also expected to\n\nstrengthen and improve going forward—against\n\nits perceived enemies, particularly Saudi Arabia,\n\nregional governments, and their allies. This would\n\nlikely occur for a few primary reasons: to conduct\n\nnetwork reconnaissance activities to prepare for\n\nany future offensive or retaliatory cyber oper\nations; to conduct retaliatory cyber operations\n\ndamaging or destroying networks; or to obtain\n\ninformation to answer any current intelligence\n\ngaps of its enemy’s political strategies, military\n\n\nobjectives, and mission details. The lifting of\n\nsanctions will likely improve economic conditions\n\nin Iran and make infrastructure and technology\n\npurchases significantly easier. This potentially\n\nforeshadows an increase in both augmented capa\nbilities and the ability to operate more globally for\n\nIranian threat actors.\n\n###### NORTH KOREA\n\nWhile the Democratic People’s Republic of\n\nKorea (DPRK) has been involved in offensive\n\ncyber operations since at least 2009, the activity\n\nidentified in 2015 suggests a growing confidence\n\nto leverage such operations for espionage\n\npurposes during periods of heightened tension.\n\nChina has been historically inconsistent in di\nrecting North Korean behavior, recently publicly\n\ncondemning nuclear tests but privately providing\n\nmore aid, while fearing any escalation that could\n\nlead to a spillover of North Korean refugees into\n\nChinese territory. China has been the DPRK’s\n\nnumber one source of aid and trade in recent\n\nyears, and potentially a gateway for North Korean\n\ncyber operations; however, its increasing respon\nsibility in the global community consistently puts\n\nit at odds with protecting the rogue state. The\n\nDPRK has been observed increasing its ties with\n\nthe Russian Federation, potentially reducing the\n\ninfluence Beijing has over the rogue nation.\n\nA major shift in Chinese support may cause the\n\nDPRK to seek more a more aggressive cyber\n\nposture, on the high end as a preparation for\n\nmilitary readiness and on the low end as a means\n\nto reiterate its demands on the international stage\n\nby provoking western powers. It also cannot\n\nbe dismissed that DPRK cyber operations may\n\nfurther branch out into criminal activity as a\n\nway to increase the regime’s financial position.\n\nMonetization of cyber intrusion is consistent with\n\nthe responsibilities of the so called “3rd floor”\n\n\n-----\n\nwhich often mistakenly target unrelated websites.\n\nCrowdStrike assesses that the risk of organizations\n\nbeing affected as collateral damage in hacktivist\n\ncampaigns will remain prevalent throughout 2016.\n\n###### “ CROWDSTRIKE ASSESSES IT IS LIKELY THAT TARGETED CRIMINAL\n ACTIVITY WILL CONTINUE TO INCREASE IN THE COMING YEAR.\n ”\n\nThis report previously discussed GEKKO JACKAL’s\n\ndevelopment of a botnet-based DDoS-for-hire\n\nservice using a lightaidra malware variant called\n\nbashlite. The source code for GEKKO JACKAL’s\n\nbashlite implant was publicly leaked in January\n\n2015. CrowdStrike has subsequently observed\n\na proliferation of this malware across multiple\n\nhacktivist communities and therefore assesses\n\nthat its prevalence will likely increase during 2016.\n\nSimilarly, the presence of bashlite infrastructure in\n\nidentified attacks will likely no longer be intrinsi\ncally indicative of GEKKO JACKAL involvement.\n\nIn addition to GEKKO JACKAL, CrowdStrike\n\nhas observed similar copycat hacktivist activ\nity during 2015. Like GEKKO JACKAL, these\n\ngroups originate largely from online gaming\n\ncommunities, which is often reflected in their\n\ntargeting of entertainment sector organizations.\n\nA recent example of such activity was the DDoS\n\nattacks against Xbox Live, PlayStation, and other\n\ngaming networks during the 2015 Christmas\n\nholiday by groups including Phantom Squad\n\nand OurMine Team. These groups are motivated\n\nprimarily by public recognition, and their ac\ntivity will likely remain prominent in 2016.\n\n\nthis drives the complexity of such malware up,\n\nproviding criminal elements who intend to use the\n\nmalware with increased revenue-generating oppor\ntunities. It is probable that in 2016, the introduction\n\nof new malware families with increased complexity\n\nand stealth will continue to expand. Ransomware\n\nhas been a growth market for criminals in 2015, and\n\nthis trend shows no sign of abating.\n\n###### EXTORTION\n\nExtortion actors in 2015 were extremely prevalent;\n\ngroups such as PIZZO SPIDER, MIMIC SPIDER,\n\nand other copycats targeted all manner of\n\nbusinesses. This activity may continue, however\n\ndue to increased awareness and lack of paying\n\nvictims, it is unlikely that these groups will see\n\nhigh return on investment and may disband.\n\nDue to the high visibility of these attacks,\n\ncoordinated investigation and disruption is\n\nlikely by international law enforcement.\n\nAnalysis of transactions to Bitcoin addresses\n\nobserved in various extortion schemes indicates\n\na very low number of paying victims. Businesses\n\nthat are extorted for Bitcoin often have no idea\n\nhow to find the necessary funds, and the delivery\n\nof ransom notes to email addresses that may not\n\nbe monitored or to users who have no idea what\n\nthe note is referring to result in slow response\n\ntimes. During those slow response times, the\n\nactors often move on to another target.\n\n###### HACKTIVISM\n\n**Motivation**\n\nRegional conflicts will likely remain a primary\n\ndriver of nationalistic hacktivist activity in\n\n2016. Gulf Cooperation Council (GCC) military\n\ninvolvement in Yemen, for example, has been\n\ncited by hacktivist actors operating on both\n\nsides of the conflict. These hacktivist cam\npaigns often occur in near-real time to the\n\n\nreal-world events that inspire them, and as\n\nsuch they can often be difficult to anticipate.\n\nWhile some nationalist groups are well estab\nlished and maintain a public web presence,\n\nsuch as DEADEYE JACKAL, others often\n\nmaterialize—seemingly instantaneously—to\n\ncarry out a sensational attack in retaliation to a\n\nreal-world event. Examples of the latter include\n\nthe previously discussed Yemen Cyber Army and,\n\nmore recently, the January 2016 compromise of\n\nSaudi-owned broadcaster Al Arabiya’s website\n\nby the Defenders of the Hijaz group. 2016 will\n\nalmost certainly see a continuation of hacktivist\n\nactivity mirroring regional conflict events.\n\nIn addition to politically motivated actors,\n\nhacktivists seeking public recognition will also\n\nlikely continue to be prominent in 2016. GEKKO\n\nJACKAL provides an example trajectory of\n\nhow such groups can increase in skill level and\n\nthus ultimately begin to move toward a finan\ncially motivated criminal operation. Copycat\n\ngroups, such as Phantom Squad, are currently\n\ninvolved primarily in DDoS attacks against\n\ngaming-sector targets; however, it should be\n\nexpected that these attacks, as seen in the case\n\nof GEKKO JACKAL, will broaden to include\n\nadditional verticals. International events such\n\nas the 2016 Olympic Games in Brazil will almost\n\ncertainly attract hacktivist actors seeking to\n\ncapitalize on the global visibility of the event.\n\n**DDoS**\n\n2015 saw a notable increase—both in frequency\n\nand effects—in DDoS attacks carried out by\n\nhacktivist actors. DDoS-based hacktivist activity\n\nthroughout the year varied in motivation and\n\nincluded more traditional protest-style cam\npaigns as well as those carried out by actors\n\ndriven solely by a desire for media attention.\n\nOne common trend identified as being in part\n\nresponsible for this increase in DDoS activity\n\nis the widespread availability of paid network\n\n\nstress testing, or stresser services. CrowdStrike\n\nassesses that the increasing adoption of paid\n\nstresser services for use in hacktivist opera\ntions will likely continue throughout 2016.\n\nThese DDoS-for-hire services allow low or\n\nunskilled actors to carry out disruptive attacks\n\nleveraging amplification TTPs. Such functionality\n\nrepresents a marked improvement over that\n\noffered by traditionally popular, freely available\n\nDDoS tools such as LOIC, Torshammer, or PyLoris.\n\nAdditionally, the use of third-party web-based\n\nDDoS services reduces the risk of attribution\n\nto the attacker, since disruptive traffic is not\n\ngenerated from the attacker’s own network as it\n\nis with the aforementioned freely available tools.\n\nIn addition to their ease of use and relatively low\n\ncost, stresser services have proven to be a power\nful tool in the hands of low-sophistication hacktiv\nist actors, enabling them to disrupt the operations\n\nof victim organizations. Attacks carried out in\n\nearly 2015 by actor Bitcoin Baron, for example,\n\nunderscore the disruptive and dangerous capa\nbility provided by such services. In March 2015,\n\nBitcoin Baron launched a series of attacks against\n\nstate and local government agencies in Wisconsin\n\nin protest of an alleged incident of police brutality.\n\nThe ensuing DDoS attack disrupted not only the\n\npublic websites of the city of Madison and local\n\nbanks, but also affected internal networks used\n\nfor emergency communication by the department\n\nof public safety. Specifically, police officer mobile\n\ndata terminals (MDT) as well as payment-pro\ncessing systems were reportedly impacted.\n\nAdditionally, due to the low barrier to entry,\n\nrelatively low risk of attribution, and ease of use\n\nassociated with stresser services, hacktivist cam\npaigns leveraging them are increasingly employing\n\nlittle vetting of target lists to ensure victim organi\nzations are in line with the operation’s stated aims.\n\nThis is best evidenced, as previously discussed,\n\nin Anonymous-led DDoS attacks opposing ISIS,\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://conferences.law.stanford.edu/cyberday/wp-content/uploads/sites/10/2016/10/2a_15GlobalThreatReport_Extracted.pdf"
    ],
    "report_names": [
        "2a_15GlobalThreatReport_Extracted.pdf"
    ],
    "threat_actors": [
        {
            "id": "2799bc47-e502-49f0-a289-87e3cc95ecc6",
            "created_at": "2022-10-25T15:50:23.706367Z",
            "updated_at": "2025-03-27T02:00:55.530488Z",
            "deleted_at": null,
            "main_name": "FIN4",
            "aliases": [
                "FIN4"
            ],
            "source_name": "MITRE:FIN4",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "abd17060-62f6-4743-95e8-3f23c82cc229",
            "created_at": "2022-10-25T15:50:23.428772Z",
            "updated_at": "2025-03-27T02:00:55.466186Z",
            "deleted_at": null,
            "main_name": "Putter Panda",
            "aliases": [
                "Putter Panda",
                "APT2",
                "MSUpdater"
            ],
            "source_name": "MITRE:Putter Panda",
            "tools": [
                "pngdowner",
                "3PARA RAT",
                "4H RAT",
                "httpclient"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5f6ade4c-e2db-46f0-b1b4-529ea52d040b",
            "created_at": "2022-10-25T16:07:23.611546Z",
            "updated_at": "2025-03-27T02:02:09.886928Z",
            "deleted_at": null,
            "main_name": "FIN4",
            "aliases": [
                "FIN4",
                "Wolf Spider"
            ],
            "source_name": "ETDA:FIN4",
            "tools": [
                "UpDocX"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e4ccfe5c-4d77-4503-bf1c-36076dbd78d0",
            "created_at": "2022-10-25T16:07:24.522697Z",
            "updated_at": "2025-03-27T02:02:10.271394Z",
            "deleted_at": null,
            "main_name": "OurMine",
            "aliases": [
                "ATK 128",
                "TAG-HA10"
            ],
            "source_name": "ETDA:OurMine",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "808d8d52-ca06-4a5f-a2c1-e7b1ce986680",
            "created_at": "2022-10-25T16:07:23.899157Z",
            "updated_at": "2025-03-27T02:02:10.019417Z",
            "deleted_at": null,
            "main_name": "NetTraveler",
            "aliases": [
                "APT 21",
                "Hammer Panda",
                "NetTraveler",
                "TEMP.Zhenbao"
            ],
            "source_name": "ETDA:NetTraveler",
            "tools": [
                "Agent.dhwf",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "NetTraveler",
                "Netfile",
                "PlugX",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "TravNet",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "254f2fab-5834-4d90-9205-d80e63d6d867",
            "created_at": "2023-01-06T13:46:38.31544Z",
            "updated_at": "2025-03-27T02:00:02.802896Z",
            "deleted_at": null,
            "main_name": "APT21",
            "aliases": [
                "HAMMER PANDA",
                "TEMP.Zhenbao",
                "NetTraveler"
            ],
            "source_name": "MISPGALAXY:APT21",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f498e6b-3f0e-4f26-8cc7-52121e675643",
            "created_at": "2023-01-06T13:46:38.447274Z",
            "updated_at": "2025-03-27T02:00:02.835821Z",
            "deleted_at": null,
            "main_name": "Deadeye Jackal",
            "aliases": [
                "SyrianElectronicArmy"
            ],
            "source_name": "MISPGALAXY:Deadeye Jackal",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b57a3b93-3a22-4889-af28-37cc53e824e7",
            "created_at": "2023-01-06T13:46:39.24034Z",
            "updated_at": "2025-03-27T02:00:03.028955Z",
            "deleted_at": null,
            "main_name": "MIMIC SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:MIMIC SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4e2776db-982d-4c07-8dd5-3888242aa7bc",
            "created_at": "2023-01-06T13:46:38.437237Z",
            "updated_at": "2025-03-27T02:00:02.833387Z",
            "deleted_at": null,
            "main_name": "PIZZO SPIDER",
            "aliases": [
                "DD4BC",
                "Ambiorx"
            ],
            "source_name": "MISPGALAXY:PIZZO SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a080173e-7141-4d46-831d-a5f15ebef31a",
            "created_at": "2023-01-06T13:46:38.629955Z",
            "updated_at": "2025-03-27T02:00:02.877857Z",
            "deleted_at": null,
            "main_name": "APT26",
            "aliases": [
                "JerseyMikes",
                "TURBINE PANDA",
                "BRONZE EXPRESS",
                "TECHNETIUM"
            ],
            "source_name": "MISPGALAXY:APT26",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "92c0dae2-e255-4b90-8d8f-be88e393ab8d",
            "created_at": "2022-10-25T16:07:24.402328Z",
            "updated_at": "2025-03-27T02:02:10.209983Z",
            "deleted_at": null,
            "main_name": "Wild Neutron",
            "aliases": [
                "Butterfly",
                "Morpho",
                "Sphinx Moth",
                "The Postal Group",
                "Wild Neutron"
            ],
            "source_name": "ETDA:Wild Neutron",
            "tools": [
                "HesperBot",
                "Jiripbot",
                "JripBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "468b7acd-895c-4c93-b572-b42f4035b4d4",
            "created_at": "2023-01-06T13:46:38.265636Z",
            "updated_at": "2025-03-27T02:00:02.788514Z",
            "deleted_at": null,
            "main_name": "APT2",
            "aliases": [
                "G0024",
                "PLA Unit 61486",
                "PUTTER PANDA",
                "MSUpdater",
                "4HCrew",
                "SearchFire",
                "TG-6952"
            ],
            "source_name": "MISPGALAXY:APT2",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "76fc6d92-0710-4640-bfa7-3000fe3940a5",
            "created_at": "2022-10-25T16:07:24.251595Z",
            "updated_at": "2025-03-27T02:02:10.151254Z",
            "deleted_at": null,
            "main_name": "Syrian Electronic Army (SEA)",
            "aliases": [
                "ATK 196",
                "Deadeye Jackal",
                "Syria Malware Team",
                "Syrian Electronic Army",
                "TAG-CT2"
            ],
            "source_name": "ETDA:Syrian Electronic Army (SEA)",
            "tools": [
                "AndoServer",
                "CypherRat",
                "SLRat",
                "SandroRAT",
                "SilverHawk",
                "SpyNote",
                "SpyNote RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3571da12-0890-45e7-85d3-04fac7070b52",
            "created_at": "2023-01-06T13:46:38.414772Z",
            "updated_at": "2025-03-27T02:00:02.827631Z",
            "deleted_at": null,
            "main_name": "WOLF SPIDER",
            "aliases": [
                "FIN4",
                "G0085"
            ],
            "source_name": "MISPGALAXY:WOLF SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4b066585-3591-4ddd-b3cc-f4e19e0e00ef",
            "created_at": "2022-10-25T16:07:24.086915Z",
            "updated_at": "2025-03-27T02:02:10.103556Z",
            "deleted_at": null,
            "main_name": "Putter Panda",
            "aliases": [
                "APT 2",
                "Group 36",
                "Putter Panda",
                "SearchFire",
                "TG-6952"
            ],
            "source_name": "ETDA:Putter Panda",
            "tools": [
                "3PARA RAT",
                "4H RAT",
                "4h_rat",
                "MSUpdater",
                "httpclient",
                "pngdowner"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "74f1da67-5bc9-49ee-ba8e-b7e8b452a2c2",
            "created_at": "2023-01-06T13:46:39.021238Z",
            "updated_at": "2025-03-27T02:00:02.979195Z",
            "deleted_at": null,
            "main_name": "OurMine",
            "aliases": [],
            "source_name": "MISPGALAXY:OurMine",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1475540713,
    "ts_modification_date": 1475836137,
    "files": {
        "pdf": "https://archive.orkl.eu/cb5e7d56d5b9b968249a6af8f66eeb17b00c9d33.pdf",
        "text": "https://archive.orkl.eu/cb5e7d56d5b9b968249a6af8f66eeb17b00c9d33.txt",
        "img": "https://archive.orkl.eu/cb5e7d56d5b9b968249a6af8f66eeb17b00c9d33.jpg"
    }
}