{
    "id": "1ccc2be9-b2be-42c7-8f1d-be953748ce07",
    "created_at": "2023-01-12T15:01:09.913338Z",
    "updated_at": "2025-03-27T02:13:33.815143Z",
    "deleted_at": null,
    "sha1_hash": "a15e261ca4a40e72d291343e1bede5c3e8d106f2",
    "title": "2021-03-12 - Good old malware for the new Apple Silicon platform",
    "authors": "",
    "file_creation_date": "2022-05-28T16:11:30Z",
    "file_modification_date": "2022-05-28T16:11:30Z",
    "file_size": 581171,
    "plain_text": "# Good old malware for the new Apple Silicon platform\n\n**[securelist.com/malware-for-the-new-apple-silicon-platform/101137/](https://securelist.com/malware-for-the-new-apple-silicon-platform/101137/)**\n\nAuthors\n\nIlya Mogilin\n\n## Introduction\n\n[A short while ago, Apple released Mac computers with the new chip called Apple M1. The](https://support.apple.com/en-us/HT211814)\nunexpected release was a milestone in the Apple hardware industry. However, as technology\nevolves, we also observe a growing interest in the newly released platform from malware\nadversaries. This inevitably leads us to new malware samples compiled for the Apple Silicon\nplatform. In this article, we are going to take a look at threats for Macs with the Apple M1\nchip on board. Also, we prepared a short F.A.Q. section at the end of the article for those\nwho want to understand better the security risks of M1 malware. Let’s dive in.\n\n## XCSSET malware\n\n[Last year, a threat called XCSSET was discovered for the first time. It targets mainly Mac](https://www.trendmicro.com/en_us/research/20/h/xcsset-mac-malware--infects-xcode-projects--uses-0-days.html)\ndevelopers using a unique way of distribution: injecting a malicious payload into Xcode IDE\nprojects on the victim’s Mac. This payload will be executed at the time of building project files\n\n\n-----\n\nin Xcode. XCSSET modules have numerous capabilities, such as:\n\nReading and dumping Safari cookies,\nInjecting malicious JavaScript code into various websites,\nStealing user files and information from applications, such as Notes, WeChat, Skype,\nTelegram, etc.,\nEncrypting user files.\n\nAll these various features, in combination with high stealth and an unusual way of\ndistribution, make XCSSET a dangerous threat for Mac computers.\n\nWhile exploring the various executable modules of XCSSET, we found out that some of them\nalso contained samples compiled specially for new Apple Silicon chips. For example, a\n[sample with the MD5 hash sum 914e49921c19fffd7443deee6ee161a4 contains two](https://opentip.kaspersky.com/914e49921c19fffd7443deee6ee161a4/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\narchitectures: x86_64 and ARM64.\n\nThe first one corresponds to previous-generation, Intel-based Mac computers, but the\nsecond one is compiled for ARM64 architecture, which means that it can run on computers\nwith the new Apple M1 chip. According to VirusTotal, this sample was first uploaded on 2021[02-24 21:06:05 and the original research report did not contain this hash or a module named](https://documents.trendmicro.com/assets/pdf/XCSSET_Technical_Brief.pdf)\n“metald”, the name of the executable file. With this information on hand, we can assume that\nthe XCSSET campaign is probably still ongoing. This leads us to the thought that more and\nmore malware writers are actively recompiling their samples to have an opportunity to run on\nnew Apple Silicon Macs natively.\n\n## Silver Sparrow threat\n\n\n-----\n\nXCSSET is not the only family which has adapted to run natively on Apple Silicon. According\nto a [RedCanary report, a new threat called Silver Sparrow has been identified. This threat](https://redcanary.com/blog/clipping-silver-sparrows-wings/)\nintroduces a new way for malware writers to abuse the default packaging functionality:\ninstead of placing a malicious payload in preinstall or postinstall scripts, malware writers hid\none in the Distribution XML file.\n\nThis payload uses JavaScript API to run bash commands in order to download a JSON\nconfiguration file.\n\n**_Downloading of JSON config_**\n\nAnd after successfully downloading that configuration file, the sample extracts a URL from\nthe downloadURL field for the next download.\n\n**_Downloading and executing a payload_**\n\nAlso, an appropriate Launch Agent is created for persistent execution of the malicious\nsample.\n\n\n-----\n\n**_Malware persistence_**\n\nThis JavaScript payload can be executed regardless of chip architecture, but in the package\n[file with the MD5 hash sum fdd6fb2b1dfe07b0e57d4cbfef9c8149, there is a “fat” Mach-O](https://opentip.kaspersky.com/fdd6fb2b1dfe07b0e57d4cbfef9c8149/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\ncontaining two supported architectures (ARM64 and x86_64), as compared to the old\n[package with the MD5 hash sum 30c9bc7d40454e501c358f77449071aa. This means that](https://opentip.kaspersky.com/30c9bc7d40454e501c358f77449071aa/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\nthe malware actors are trying to expand their attack coverage by supporting a wider range of\nplatforms.\n\n## Adware threats for the new platform\n\nHowever, there are not just malware samples that can be launched on Apple Silicon. A\n[known Mac malware researcher Patrick Wardle recently published a post covering Pirrit](https://objective-see.com/blog/blog_0x62.html)\nadware. Though it is an old and well-known adware family, it is still actively updated by their\nauthors and new samples are encountered in the wild quite often.\n\nThese updates include:\n\nAnti-debug techniques such as using ptrace syscall with a PT_DENY_ATTACH flag,\nControl flow obfuscation techniques,\nDynamic imports with dlsym calls to avoid static analysis,\nVirtual machine detection anti-analysis.\n\n\n-----\n\n**_Control flow obfuscation; dynamic symbols resolving with dlsym_**\n\nBesides these improvements in regular Intel x86_64 samples, new ARM64 samples were\nintroduced. These are crafted specifically for the Apple Silicon M1 chip, but the\nconsequences of running these are roughly the same: launching Pirrit adware results in popups, banners and various annoying advertisements displayed on the victim’s Mac.\n\nPirrit is not the only adware family to have begun supporting the Apple Silicon platform\nrecently. For example, we also observed an ARM64 Bnodlero adware sample (MD5\n**[82e02c1ca8dfb4c60ee98dc877ce77c5), which runs a bash downloader script using the](https://opentip.kaspersky.com/82e02c1ca8dfb4c60ee98dc877ce77c5/?utm_source=SL&utm_medium=SL&utm_campaign=SL)**\n**system() function.**\n\n**_Bash downloader executed by Bnodlero sample_**\n\n\n-----\n\n## Frequently Asked Questions\n\n**What is so special about M1 threats?**\n\nWell, there is not much special about them, frankly speaking. The only thing that\ndistinguishes the new Apple M1 threats from previous ones targeting Intel-based Mac\ncomputers is the architecture of the Mac processor for which the executable is compiled. In\norder to get their applications to run on Apple Silicon, software developers should recompile\ntheir code into executables which can run on the M1 chip. The same is true for malware\nadversaries.\n\n**Is Apple M1 chip less secure than Intel ones?**\n\nNo, it is just a matter of platform support in malware executables.\n\n**Are Intel-based Macs affected by M1 threats?**\n\nYes and no. On the one hand, code that is compiled exclusively for the Apple Silicon platform\ncannot be natively executed on the Intel x86_64 architecture. On the other hand, malicious\nsamples are often delivered in so-called “fat” Mach-O, which usually contains the same code\nbut is compiled for several architectures. This means that running this “fat” executable will\nresult in launching the right malicious code depending on your platform architecture. Pirrit\nand Bnodlero samples are great examples of this approach.\n\n**Can threats for Intel-based Macs run on Apple M1?**\n\nYes, they can. Due to the [Rosetta 2 feature, newly released Mac computers with Apple M1](https://developer.apple.com/documentation/apple_silicon/about_the_rosetta_translation_environment)\ncan also run malicious code written exclusively for Intel x86_64 architecture. This backward\ncompatibility will certainly be abused by malware operators until Apple completes the\ntransition to their proprietary chips.\n\n**Is there an upward trend in M1 malware?**\n\nYes, there certainly is, and it is absolutely to be expected. As soon as a platform becomes\nmore popular or highly anticipated, developers try to ensure that their software is available\nfor it. Malware developers are no exception.\n\n## Conclusion\n\nWith the new M1 chip, Apple has certainly pushed its performance and energy saving limits\non Mac computers, but malware developers kept an eye on those innovations and quickly\nadapted their executables to Apple Silicon by porting the code to the ARM64 architecture.\n\nWe have observed various attempts to port executables not just among typical adware such\nas Pirrit or Bnodlero samples, but also among malicious packages, such as the Silver\nSparrow threat and XCSSET downloadable malicious modules This certainly will give a\n\n\n-----\n\nkickstart to other malware adversaries to begin adapting their code for running on Apple M1\nchips.\n\n[Adware](https://securelist.com/tag/adware/)\n[Apple MacOS](https://securelist.com/tag/apple-macos/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\nIlya Mogilin\n\nGood old malware for the new Apple Silicon platform\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-12 - Good old malware for the new Apple Silicon platform.pdf"
    ],
    "report_names": [
        "2021-03-12 - Good old malware for the new Apple Silicon platform.pdf"
    ],
    "threat_actors": [
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535669,
    "ts_updated_at": 1743041613,
    "ts_creation_date": 1653754290,
    "ts_modification_date": 1653754290,
    "files": {
        "pdf": "https://archive.orkl.eu/a15e261ca4a40e72d291343e1bede5c3e8d106f2.pdf",
        "text": "https://archive.orkl.eu/a15e261ca4a40e72d291343e1bede5c3e8d106f2.txt",
        "img": "https://archive.orkl.eu/a15e261ca4a40e72d291343e1bede5c3e8d106f2.jpg"
    }
}