{
    "id": "1cf4cb23-527e-4d07-bb8a-ead175b1a560",
    "created_at": "2023-01-12T15:06:44.320248Z",
    "updated_at": "2025-03-27T02:09:35.133519Z",
    "deleted_at": null,
    "sha1_hash": "b3ee42b2c0abf9b74444dab891e8cdf634f67c62",
    "title": "2022-03-15 - Decoding a DanaBot Downloader",
    "authors": "",
    "file_creation_date": "2022-05-27T22:12:49Z",
    "file_modification_date": "2022-05-27T22:12:49Z",
    "file_size": 3619674,
    "plain_text": "# Decoding a DanaBot Downloader\n\n**security-soup.net/decoding-a-danabot-downloader/**\n\nadmin March 15, 2022\n\n## Summary\n\n[I came across a fairly interesting VBS-based DanaBot downloader the other day, and I](https://malpedia.caad.fkie.fraunhofer.de/details/win.danabot)\nfigured it was worth doing a quick write-up on the obfuscation scheme and a few of the other\nTPPs I observed. The social engineering pretext used in this campaign was interesting as it\nleveraged an “unclaimed property” themed lure and required user interaction to deliver the\nfirst stage payload. A VBS file then fetches the DanaBot downloader. The VBS file contains\nan embedded URL that is not obfuscated, but the actual execution mechanism is encoded in\na very long string.\n\n\n-----\n\nIn this blog, we will take a quick look at the social engineering pretext, then review the\nobfuscation scheme itself. Finally we will wrap up with coverage of three different methods to\nanalyze and decode the VBS (each in order of complexity and potential to make you hate\nyourself). The first method we will review is the usage of a VBS debugger for quick a win. We\nwill then review an alternative where we can debug the VBS file itself without any special\ntools, but just by editing a few lines of code in the file. Finally, we will conclude with\n(debatably) the ultimate exercise in futility, which is writing a Python decoder from scratch.\nThis method doesn’t do anything for us beyond instilling a sense of satisfaction and provide\nan opportunity to understand the underlying obfuscation scheme a little bit better, and learn a\nlittle Python to boot. Let’s go!\n\n\n-----\n\nFigure 1. This\n\n\nAnalyst’s thought process in meme format.\n\n## DanaBot Overview and Delivery\n\n\n-----\n\nI don t typically do much analysis on DanaBot as I simply don t see it as often as the other\neCrime variants that are delivered in massive volumes and in widespread campaigns. In this\ncase, I found it interesting based on the social engineering scheme that required user\ninteraction and the website landing page that had several elements that attempted to\nreassure victims and instill a sense of security. In addition, DanaBot caught my eye as it has\n[been covered in the news and via OSINT reports from Zscaler that have linked DanaBot to](https://www.zscaler.com/blogs/security-research/danabot-launches-ddos-attack-against-ukrainian-ministry-defense)\nrecent DDoS campaigns against Ukrainian organizations, possibly in support of strategic\nobjectives related to Russia’s war efforts. The authors make a point to stress that “It is\nunclear whether this is an act of individual hacktivism, state-sponsored, or possibly a false\nflag operation.” To be clear, there is no known link here observed between the campaign\ncovered in this blog and DDoS events in Ukraine — they are simply both linked to DanaBot.\n\nFigure 2. Execution chain for delivery of DanaBot\n[The DanaBot malware is a banker/infostealer originally discovered by Proofpoint researchers](https://www.proofpoint.com/us/threat-insight/post/danabot-new-banking-trojan-surfaces-down-under-0)\nin 2018. It is operated by a financially motivated criminal group tracked as “SCULLY\nSPIDER” by CrowdStrike in a Malware as a Service (MaaS) model with multiple affiliate\npartners. Although DanaBot’s core functionality has focused on stealing banking credentials,\nit has [been known to be used in DDoS operations before.](https://www.zscaler.com/blogs/security-research/spike-danabot-malware-activity#:~:text=DanaBot%20is%20a%20malware%2Das,affiliates%20to%20the%20threat%20landscape.)\n\nDanaBot has been delivered via a variety methods in the past, including cracked games,\nsabotaged code packages, and phishing emails. In this case the VBS files was hosted on a\nfake “unclaimed property” website: www[.]moneyunclaimed[.]net.\n\nFilename: [rpetitto-s980361ad.vbs](https://www.virustotal.com/gui/search/name%253Arpetitto-s980361ad.vbs)\n[SHA256: a4f1ea5dd434deee93bdf312f658a7a26f767c7683601fa8b23ef096392eef17](https://www.virustotal.com/gui/file/2186495019ee3d4838df3482eaa3c6b37f08d68b8ef0675342cb761ccf04c4fc)\n\nI have observed other domains in recent campaigns with a similar theme such as\nwww[.]unclaimed2[.]com and/or www[.]unclaimedhq[.]com. All of these sites lure a potential\nvictim to performing a “search” for unclaimed property. The threat actors use a questionable\nselection of thumbnail portraits, but I’m assuming most visitors won’t notice or care. The site\nis slick enough to likely fool most potential victims.\n\n\n-----\n\nFigure 3. The landing page\nAnd this is where things get interesting. The website is interactive, and in fact even requires\nuser interaction to complete the initial malware delivery. If a user clicks on “Search”, they will\nbe taken to a fake search page and prompted to input their First and Last Names and their\nstate of residence. It even has a captcha in an attempt to appear more legitimate! There are\nother themes leveraged in the page such as making reference to the McAfee and GoDaddy\nbrands in the sites’ footers to further cultivate a sense of trust and security with the victim.\n\n\n-----\n\nFigure 4. Running the property “report”\nIf the potential victim is “fortunate” enough to get results, they are prompted to download a\n“report” that allegedly contains their unclaimed property findings. However, in reality this ZIP\narchive that is downloaded contains a copy of winRAR and also the initial VBS downloader.\n\n## The Obfuscation Scheme\n\nThe URL is plainly available, but execution is not. If all you care about is IOCs, you can just\nstop here. But we don’t just care about IOCs. Because IOCs without contextual behavior\naren’t that helpful. We can do better. Unfortunately, simply accessing the VBS code turned\nout to be just the first stage of the battle. This particular file has two loops that encode the\nscript that is later executed as a function. In most analysis scenarios, speed is of the\nessence, so it is often better to rely on these tools to dump the code via dynamic analysis\nsandbox or debugger, but I often prefer to take a static analysis approach and manually\ndecode the scripts in order to teas out the underlying subtleties of their operation. It is also\njust a fun exercise, akin to putting together a puzzle or deciphering a riddle. This type of\napproach may also provide some insight into adversary tactics, techniques, and procedures\n(TTPs) that would otherwise be lost (or at least glossed over) when employing dynamic\nanalysis.\n\n\n-----\n\nFigure 5 . The entire VBS content\nThe primary obfuscation technique utilized in this script is a string operations. The URL that\nhosts the final DanaBot payload is in clear text, but the function containing the execution is\nencoded in a very long string (over 2,000 characters). There are two loops that iterate\nthrough this string. All of the text in comments or quotes is meaningless and can be ignored\nfor the purpose of analysis.\n\n\n-----\n\nFigure 6. Prettified VBS\nThe first loops takes slices of two characters each and adds them to a dictionary object. The\nsecond loop iterates through the string and takes slices of two characters and then looks up\nthose values in the dictionary it just created. It then accesses the key that corresponds to the\nlookup value. Since the dictionary is 256 keys long, each key correlates to a character in the\nextended ascii set. Finally, these keys are converted to their ascii values, stored in a final\nvariable and then executed as s function.\n\n## Decoding the Downloader 3 Ways\n\nSo at this point we have a basic understanding of how the code works and we have the\nnetwork IOC for the next stage payload. The final piece of information an analyst would\ntypically investigate is the manner in which the next stage is executed. This is important for\nmany reasons — but perhaps most importantly — the understanding of the specific tactics,\ntechniques, and procedures (TTPs) can provide helpful contextual enrichment for developing\ndetection content and identifying potential residual disk artifacts. In this next section, we will\ntake a look at 3 options at how one could go about fully decoding the script to isolate these\nexecution details.\n\n### Method 1: Using Vbsedit to debug\n\nFirst, and perhaps most viable, is simply using a debugger to execute the code in a\ncontrolled manner and capturing the result as output. I have found the tool that is easiest and\nbest for this purpose to be [VbsEdit. This tool is not free, however, the lifetime license is very](https://www.vbsedit.com/)\nreasonably priced. There is also an evaluation license that allows usage of the tool, but\n\n\n-----\n\nimplements some guardrails with an additional delay and some obstacles in the form of\nmessage prompts in the evaluation mode. Either way, the tool works great and you can set\nbreak points and use the debugger console to step through the code. You can use this to\npopulate variables and/or jump straight to the full output as shown below.\n\nFigure 7. Debugger output\nThis is is a powerful tool whose capability to debug the code for quick output is hard to beat.\nAutomatically de-obfuscating the code saves a ton of time, which can then be spent on other\nanalysis or using the gathered information to pivot further on an investigation. In this sample,\nwe uncovered multiple tool marks of interest: including the creation of a shell object and\nusage of wscript to kick off the script, the full path for the next stage payload written to disk,\nand the usage of rundll32 to execute that payload. This is a common technique that most\nEDR platforms should detect, but if you are following along at home, there are ATT&CK\ntagings below if you need to check for coverage.\n\n### Method 2: Modifying the VBS code to print to file\n\nThe second method we will look at is somewhat slower, but still provides quick output. The\nadvantage to this method is that it does not require any additional tooling beyond a text\neditor and the ability to run VBscript. The idea here with this approach is that instead of\nexecuting the script within a shell object, we will simply re-direct the script’s content as output\nto a file of our choosing. This requires the addition of just 4 extra lines of code. It should be\nnoted that using this method is safest to also comment out the “Execute(temp)” function by\nprepending the line with “REM”.\n```\nSet objFSO = CreateObject(\"Scripting.FileSystemObject\")\noutfile = \"<INSERT PATH TO FILE>\"\nsET objFile = objFSO.CreateTextFile(outFile,True)\nobjFile.Write <INSERT THE FUNCTION'S ARGUMENT HERE> & vbCrLf\n\n```\n\n-----\n\nThe variable names in the code don t matter. You can change them to whatever you wish. I\njust use what I copied off the guy that showed me how to do this. One additional note: the 4\nline in the above can be moved around to wherever you like, sort of like using it as a break\npoint, as that will output the script to file at that point in its execution. The fourth line also\nneeds to be modified with the specific argument that is called by the function being\ndebugged.\n\nFigure 8. File modification to write to file\n\n### Method 3: Writing a Python Script (slow and pointless?)\n\nAlright, so I’ve spent plenty of my time here writing a blog post that probably three people will\never read, and if you think that was a waste of time, well have I got a surprise for you…\nBecause I wasn’t content to just extract my IOCs and TTPs and write my little Yara rule (see\nbelow). No. I decided I wanted to commune with this code for a more deeper understanding\nof how it worked, and how it fit in with the greater mysteries of the Universe. Also, I hadn’t\nwritten any code in a while, and I thought it could be a fun exercise to crack the ole knuckles,\nscrape off the rust, and slap together some Python. Ultimately, I didn’t unlock any mysteries\nof the Universe, but I did write some dodgy Python and learned a few things — so I will count\nthat as a win in my book.\n\n\n-----\n\nFigure 9. If a Python falls in the forest with nobody around, does it still make a sound?\nThe [script here is very simple as you can see below. We don’t need any fancy imports or](https://github.com/Sec-Soup/Python-ToolBox/blob/master/vbs-decode-dana/vbs-decode-dana.py)\ndependencies, just plain ole Python does the trick. Basically, the Python script works exactly\nlike the VBScript. It first takes a string variable, then sets another variable to ensure we grab\na pair of characters from the string. We then take two slices of the string, the first being for\nthe creation of the dictionary, and the second used to build the command. After the first slice\nis converted into a dictionary, the second slice is simply indexed.\n\nWe then need to access the items in the dictionary and loop through the second slice’s\nindex. For each character pain in that loop, we look up the key for that value in the dictionary\nand convert the key’s decimal value it into its ascii character. Then it is just a matter of joining\nthe characters and printing them out to the console. Voilà!\n\n\n-----\n\nFigure 10 . The fruits of our labors.\n\n## Conclusion\n\nSo that’s it, my take on conducting analysis on a recent DanaBot downloader sample. This\ncampaign caught my eye as the social engineering tactic was fairly convincing. The VBScript\nitself used an interesting string obfuscation method as well, although nothing novel. I’ve\nshared a few resources and tools that can hopefully enable analysts to improve the velocity\ntheir data gathering for triage and investigations. ATT&CK tagging is provided below, and I’ve\nincluded some IOCs from similar campaigns, and include a quick Yara signature that could\nhelp detect this particular downloader. I hope some of the analysis techniques will be helpful\nto those learning the ropes and/or looking for new methods to add to their current toolkit.\nThanks for reading!\n\n## Detection\n\n\n-----\n\n```\nrule VBS_Downloader\n//Downloaders were observed delivering Danabot in February/March of 2022\n{\n meta: \n  description = \"Simple rule to detect VBS downloaders\"\n  created = \"2022-03-13\"\n  author = \"Ryan Campbell @sec_soup\"\nstrings:\n $a = \"CreateObject(\\\"Scripting.Dictionary\\\")\" \n $b = \"Dict.Add Mid(\"\n $c = \"-1,2), i\"\n $d = \"Mod 2 = 0 and Dict.count <> 256 then\"\n $e = \"Mod 2 = 0 and Dict.count = 256 then\"\n $f = \"Chrw(Dict.Item(Mid(\"\n $g = \"Execute(temp)\"\ncondition:\n 6 of ($a,$b,$c,$d,$e,$f,$g)\n filesize < 50KB\n}\n\n## IOCs\n\n```\nwww[.]moneyunclaimed[.]net\n\nwww[.]unclaimed2[.]com\n\nwww[.]unclaimedhq[.]com\n\nz3[.]goldfishcloud[.]top\n\n2186495019ee3d4838df3482eaa3c6b37f08d68b8ef0675342cb761ccf04c4fc\n\n## ATT&CK Tagging\n\n**Execution**\n\n**[User Execution (ATT&CK ID: T1204)](https://attack.mitre.org/techniques/T1204/)**\n**Command and Scripting Interpreter: Visual Basic** **[(ATT&ACK ID: T1059.005)](https://attack.mitre.org/techniques/T1059/005/)**\n**[Signed Binary Proxy Execution: Rundll32 (ATT&CK ID: T1218.011)](https://attack.mitre.org/techniques/T1218/011/)**\n**Defense Evasion**\n\n**[Deobfuscate/Decode Files or Information (ATT&CK ID: T1140)](https://attack.mitre.org/techniques/T1140/)**\n**[Masquerading (ATT&CK ID: T1036)](https://attack.mitre.org/techniques/T1036/)**\n**Command and Control**\n\n**[Remote File Copy (ATT&CK ID: T1105)](https://attack.mitre.org/techniques/T1105/)**\n\n## References\n\n[1] [https://malpedia.caad.fkie.fraunhofer.de/details/win.danabot](https://malpedia.caad.fkie.fraunhofer.de/details/win.danabot)\n\n\n-----\n\n[2] https://www.proofpoint.com/us/threat-insight/post/danabot-new-banking-trojan-surfacesdown-under-0\n\n[3] https://www.zscaler.com/blogs/security-research/danabot-launches-ddos-attack-againstukrainian-ministry-defense\n\n[4] https://go.crowdstrike.com/rs/281-OBQ266/images/Report2020CrowdStrikeGlobalThreatReport.pdf\n\n[5] https://www.zscaler.com/blogs/security-research/spike-danabot-malware[activity#:~:text=DanaBot%20is%20a%20malware%2Das,affiliates%20to%20the%20threat%](https://www.zscaler.com/blogs/security-research/spike-danabot-malware-activity#:~:text=DanaBot%20is%20a%20malware%2Das,affiliates%20to%20the%20threat%20landscape.)\n20landscape.\n\n[6] https://www.virustotal.com/gui/file/2186495019ee3d4838df3482eaa3c6b37f08d68b8ef067\n5342cb761ccf04c4fc\n\n[7] [https://www.vbsedit.com/](https://www.vbsedit.com/)\n\n[8] [https://github.com/Sec-Soup](https://github.com/Sec-Soup)\n\n[9] https://github.com/Sec-Soup/Python-ToolBox/blob/master/vbs-decode-dana/vbs-decodedana.py\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-15 - Decoding a DanaBot Downloader.pdf"
    ],
    "report_names": [
        "2022-03-15 - Decoding a DanaBot Downloader.pdf"
    ],
    "threat_actors": [
        {
            "id": "b3070c7b-c1e8-462c-94f1-62a0d2bdbc67",
            "created_at": "2023-01-06T13:46:39.116254Z",
            "updated_at": "2025-03-27T02:00:03.000406Z",
            "deleted_at": null,
            "main_name": "SCULLY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:SCULLY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e5c3b8-54b4-4170-b200-7f1fd361b5a9",
            "created_at": "2022-10-25T16:07:24.557505Z",
            "updated_at": "2025-03-27T02:02:10.280375Z",
            "deleted_at": null,
            "main_name": "Scully Spider",
            "aliases": [
                "Scully Spider",
                "TA547"
            ],
            "source_name": "ETDA:Scully Spider",
            "tools": [
                "DanaBot",
                "Lumma Stealer",
                "LummaC2",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "Rhadamanthys",
                "Rhadamanthys Stealer",
                "Stealc"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536004,
    "ts_updated_at": 1743041375,
    "ts_creation_date": 1653689569,
    "ts_modification_date": 1653689569,
    "files": {
        "pdf": "https://archive.orkl.eu/b3ee42b2c0abf9b74444dab891e8cdf634f67c62.pdf",
        "text": "https://archive.orkl.eu/b3ee42b2c0abf9b74444dab891e8cdf634f67c62.txt",
        "img": "https://archive.orkl.eu/b3ee42b2c0abf9b74444dab891e8cdf634f67c62.jpg"
    }
}