{
    "id": "1d1edaf1-8604-42be-8f68-e794e681d01d",
    "created_at": "2023-01-12T15:07:46.09239Z",
    "updated_at": "2025-03-27T02:05:22.721832Z",
    "deleted_at": null,
    "sha1_hash": "4b8f915814870a84abae91325cc99afb96288b15",
    "title": "2017-05-30 - Mole ransomware- analysis and decryptor",
    "authors": "",
    "file_creation_date": "2022-05-28T03:33:10Z",
    "file_modification_date": "2022-05-28T03:33:10Z",
    "file_size": 184955,
    "plain_text": "# Mole ransomware: analysis and decryptor\n\n**[cert.pl/en/news/single/mole-ransomware-analysis-and-decryptor/](https://www.cert.pl/en/news/single/mole-ransomware-analysis-and-decryptor/)**\n\nMole ransomware is almost month old ransomware (so it’s quite old from our point of view),\nthat was distributed mainly through fake online Word docs. It’s a member of growing\nCryptoMix family, but encryption algorithm was completely changed (…again).\n\nWe became interested in this variant after victims contacted us asking for a decryptor.\nRemembering that all members of this family so far were plagued with serious crypto flaws,\nwe decided to give it a try and reverse-engineered it thoroughly. It turned out to be a good\nidea – we were successful and managed to create working decryptor that you can download\nfrom: [https://nomoreransom.cert.pl/static/mole_decryptor.exe.](https://nomoreransom.cert.pl/static/mole_decryptor.exe)\n\nIn the rest of this article we will share detailed results of our research.\n\n## Campaign and Behaviour\n\nMole ransomware was distributed through malspam linking to fake Microsoft Word\ndocuments. Said documents prompted users to download and install a malicious plugin.\n\n\n-----\n\nBecause this variant is not new, it was analyzed by quite a lot of researchers before us. We\ndon’t intend to copy their good work, so for anyone interested in the dynamic analysis we\nrecommend looking at following links:\n\nInstead, we’ll focus on a static analysis of the code and the encryption method.\n\n## Static analysis\n\nAs in many malware families, Mole won’t run in most Russian-speaking countries. Literally\nthe first thing the binary does after being run is checking keyboard layout and charset –\ndetecting Russian ones leads to immediate process termination. Otherwise, malware\nachieves persistence (by adding itself to the Autorun in the system’s registry), removes\nshadow copies (after Windows’ version check), and proceeds to the actual encryption:\n\nAfter being started ransomware tries to bypass the UAC and displays fake dialog message:\n\nAfter that, UAC prompt is shown and the user probably clicks “Yes” believing that he/she\nagrees to “Display Color Calibration”. Instead, as usual, malware relaunches itself with admin\nprivileges, and Shadow Volumes are deleted.\n\nOf course ransomware doesn’t encrypt every file type. Interestingly, encrypted extensions\nare obfuscated – they were not hardcoded directly, but compared inside giant function, after\ntransformation with following algorithm:\n\nList of encrypted extensions:\n\nAnd as usual, the most interesting thing in any ransomware is actual file encryption\nalgorithm. In this case it can be summarized as follows (half-decompiled, half-handwritten\npseudo-c++ code with non essential parts omitted):\n\nOr in terse pseudocode:\n\nThis method is not perfect for a lot of reasons, but we’ll skip detailed cryptanalysis here.\n\nGeneral structure of encrypted file looks like this:\n\n\n-----\n\nIt’s very similar to Revenge ransomware, that is why we believe that Mole is next version of\nRevenge. On the other hand, RC4 is used here instead of more sophisticated (and stronger)\nAES. It doesn’t change much, as RC4 is still strong enough for most ransomware purposes,\nbut we’re not sure why ransomware creators decided to take this step back.\n\n## Hashes/patterns\n\nSha256 hashes of binaries:\n\nNetwork communication:\n\nRansom note:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-30 - Mole ransomware- analysis and decryptor.pdf"
    ],
    "report_names": [
        "2017-05-30 - Mole ransomware- analysis and decryptor.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536066,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1653708790,
    "ts_modification_date": 1653708790,
    "files": {
        "pdf": "https://archive.orkl.eu/4b8f915814870a84abae91325cc99afb96288b15.pdf",
        "text": "https://archive.orkl.eu/4b8f915814870a84abae91325cc99afb96288b15.txt",
        "img": "https://archive.orkl.eu/4b8f915814870a84abae91325cc99afb96288b15.jpg"
    }
}