{
    "id": "1d43c9fc-705d-43c2-8194-b71d7b324ec1",
    "created_at": "2022-10-25T16:48:15.700807Z",
    "updated_at": "2025-03-27T02:09:07.273824Z",
    "deleted_at": null,
    "sha1_hash": "7b800f4256d7a5db78fde200a35f8845d66ffade",
    "title": "Dark Matter: Uncovering the DarkComet RAT Ecosystem",
    "authors": "",
    "file_creation_date": "2020-01-26T20:06:19Z",
    "file_modification_date": "2020-01-26T20:06:19Z",
    "file_size": 1410836,
    "plain_text": "# Dark Matter: Uncovering the DarkComet RAT Ecosystem\n\n## ABSTRACT\n\nwhere an attacker interacts with each victim individually, scouring\n\ngreater individual harm they beget. Unfortunately, aside from a\n\npaper are the victims of RATs. A considerable challenge of studying\n\n## CCS CONCEPTS\n\n- Security and privacy → **Malware and its mitigation.**\n## KEYWORDS\n\n**ACM Reference Format:**\n\n2020. Dark Matter: Uncovering the DarkComet RAT Ecosystem. In Proceed_ings of The Web Conference 2020 (WWW ’20), April 20–24, 2020, Taipei, Taiwan._\n\n## 1 INTRODUCTION\n\n_WWW ’20, April 20–24, 2020, Taipei, Taiwan_\n\n\n-----\n\nWWW ’20, April 20–24, 2020, Taipei, Taiwan Farinholt, et al.\n\ntively. Most recently, Farinholt et al. [25] studied the behavior of\nDarkComet operators themselves in the wild, while Rezaeirad et\n_al. [58] investigated the DarkComet ecosystem by sinkholing thou-_\n\n◦ **Operator: Miscreant interactively controlling a victim’s com-**\n\n◦ **Victim: User whose computer is infected with a RAT stub, who**\n\n◦ **Controller: Software used by an operator to configure and**\n\n◦ **Stub: Malware on a victim’s computer that communicates with**\n\n\n❖ We describe a methodology for tracking controllers of Dark\n❖ We describe a methodology for identifying real DarkComet\n\n❖ We detail the process by which we collect information about\n\nour ethical and legal considerations. Section 4 describes how\n\n## 2 BACKGROUND\n\n 2.1 DarkComet RAT\n\n42, 46, 52, 59, 61]. Marczak et al. [42] provided a particularly detailed\n\n\n_2.1.1_ _Downloading Victim Databases. DarkComet allows an oper-_\n\n_any file from the controller, without operator notification. Further_\n\nfor research purposes. Breen’s dc-toolkit [7] provides a set of\n\nloaded with the dc-toolkit, highlighting some of its sensitive\n\n_2.1.2_ _Hack Pack Sharing. DarkComet was initially offered freely_\nfor download by its author, DarkCoderSc, from an official site [40].\n\nwhat is known as hacking packs or hack packs, collections of RATs\n```\nDarkComet.exe, run from a directory that contains its supporting\n\n```\nDLLs (e.g., SQLite.dll) that hack pack distributors simply com\nthe victim SQLite database, stored in a file called comet.db. Most\nhack packs also include this database file, which contains records of\n\n\n-----\n\nDark Matter: Uncovering the DarkComet RAT Ecosystem WWW ’20, April 20–24, 2020, Taipei, Taiwan\n\n## 3 DATA COLLECTION\n 2.2 RAT Controller Discovery\n\nin industry. Marczak et al. [42] created a scanner that was able\n\nMost recently, Farinholt et al. [25] presented a scanner that used\n\n## 2.3 Estimating Infected Population\n\n\nsurement studies. Ramachandran et al. [54] proposed a method for\n\nAntonakakis et al. [4] used a variety of techniques to gauge the\n\nrunning a so-called milker to obtain attack commands.\n\n## 2.4 Understanding Data Set Pollution\n\nKanich et al. [34] showed that data set pollution caused by interfer\nof the methodology showcased by Yokoyama et al. [63]. Specifically\nrelated to RAT malware, Rezaeirad et al. [58] recently investigated\n\n\n**Figure 1: Illustration of our data collection methodology,**\n**from sourcing DarkComet configurations from threat feeds**\n**to downloading databases from detected hosts.**\n\n## 3.1 Controller Discovery\n\naddresses. Of the sources in Figure 1, only Shodan does not provide\n\n_3.1.1_ _Anonymizing Infrastructure Usage. 16.5% of scanned Dark-_\n\nRelakks VPN.[1] Such a relatively small population of hosts using\n\n1We use MaxMind and Recorded Future to compile a list of anonymized IP ranges.\n\n\n-----\n\nWWW ’20, April 20–24, 2020, Taipei, Taiwan Farinholt, et al.\n\n\n_3.1.2_ _Dynamic DNS Usage. As Dynamic DNS (DDNS) is a popular_\n\n## 3.2 Victim Database Acquisition\n\nBreen released the dc-toolkit [7], a Python tool for blind file\n\nof this tool to collect victim databases and DarkComet configuration\n_files from DarkComet controllers discovered by our scanner._\n\n_3.2.1_ _DarkComet Victim Database. On execution, the DarkComet_\ncontroller executable (DarkComet.exe) creates or loads a file in\nits working directory named comet.db. This SQLite database man\ning Section 3.2.2. We downloaded this file from DarkComet.exe’s\n\ntim record (a taint) to its dc_users table (continue to Section 3.2.2\n\nrecords uniquely in the dc_users table.\n\n_3.2.2_ _Victim Database Schema. DarkComet uses a SQLite database,_\nstored in a file named comet.db, to manage victim connections\n\n**dc_users. This table contains a single row for every unique vic-**\n\nthis row are self-explanatory. userGroup references the groupId\nfield in dc_groups. UUID is the victim machine’s hardward profile\nID, returned by the function GetCurrentHwProfile, sometimes\n```\nuserIP and userName fields before storing them. Prior to hashing\n\n```\n\n**dc_keyloggers. This table stores victim keystrokes. Each row con-**\ntains the keystokes logged from a victim, denoted by a UUID that references dc_users, on a given day. The name field refers to the daily\n\npoint all stored daily logs are uploaded at once. The contents\n\n**dc_groups. This table allows for attackers to sort and annotate**\n\n_3.2.3_ _Databases from Hack Packs. To supplement our data set of_\n\n_3.2.4_ _Database Download Failures. In the first month of operation,_\n\ntacks. Since then, we have used SOCKS5 proxying to anonymize\n\ndue to SOCKS5 proxying during large file downloads. Additionally,\n\n## 3.3 DarkComet Configuration File\n\nDarkComet also uses an INI file named config.ini to manage\n\n\n-----\n\nDark Matter: Uncovering the DarkComet RAT Ecosystem WWW ’20, April 20–24, 2020, Taipei, Taiwan\n\n**Table** **Column** **Format** **Example**\n\ndc_keyloggers\n\n`dc_users` `UUID` <HWID>-<Unique suffix> `{846ee340-7039-11de-9d20-806e6f6e6963-12345678}` dc_users UUID\n`userIP` <WAN IP> / [<LAN IP>] : <Port> `8.8.8.8 / [10.0.0.5] : 1604`\n`userName` <Hostname> / <Username> `DESKTOP-432AHT11 / Administrator` UUID name\n`userOS` <OS> [<Build>] <Arch> ( <Drive> ) `Windows 7 Service Pack 1 [7601] 32 bit ( C:\\\\ )` userIP content\n`userGroup` <dc_groups:groupId> `0` userName\n\n`dc_keyloggers` `UUID` <dc_users:UUID> `{846ee340-7039-11de-9d20-806e6f6e6963-12345678}` userOS\n`name` <Date>-<Random integer>.dc `2015-12-10-5.dc` userGroup dc_groups\n```\n           content <hexified victim keystrokes>\n\n```\ngroupId\n\n`dc_groups` `groupId` <Sequential integer> `0`\n`groupTitle` <Operator-created title> `Webcam` groupTitle\n\n**Table 1: The schemas of the tables of importance in the DarkComet database.**\n\n\nuration section header with the victim’s database UUID. Further,\n```\nconfig.ini also contains automation information, listing the tasks\n\n## 3.4 Ethical and Legal Considerations\n\n```\n**Respect for persons. Since “participation” in this study is not**\n\n\n**Beneficence. We believe that our analysis does not create fur-**\n\n**Justice. The benefits of this work are distributed to the wider public,**\n\n**Respect for law and public interest. We describe the legal frame-**\n\ngal conduct, establishing legal proof of criminal conduct is not the\n\n## 4 DATA ANALYSIS & PROCESSING\n\n**However, the raw data we have downloaded is far from**\n**ready for analysis. We assert that a single IP address is not syn-**\n\ndatabase inheritance. Our technique uncovers unexpected operator\n_behaviors, also detailed in Section 4.1._\n\nmay not be real victims. Rezaeirad et al. [58] demonstrated that\n\napply the technique described by Rezaeirad et al., and then improve\n\n## 4.1 Database Attribution\n\n\n-----\n\nWWW ’20, April 20–24, 2020, Taipei, Taiwan Farinholt, et al.\n\n\ndownloaded databases to 1,162 controllers. 667 of these controllers\n\nfor each database in our data set. Therefore, 1,162 is an overestimate\n\nferent hostname, we use the records in dc_users to construct an\n\n_4.1.1_ _DarkComet Database Ancestry. The dc_users table in a_\n\nthe dc_users table. Returning users are identified by their UUIDs,\n\nthe order of the records in dc_users describes the order in which\n```\ndc_users table from a controller, we expect it to have new victims\n\n```\nappended to the end, so that the previously downloaded dc_users\n\nFurthermore, recall that we add a unique victim record, or taint,\nto the dc_users table each time we download it because the pro\ncontroller’s dc_users table should, therefore, not only contain a\n\nUsing the monotonic growth property of the dc_users table\n\ntrollers from 1,162 (identified by hostname only) to 1,029. Thus,\n\n_4.1.2_ _Database Divergence. If two controllers start with the same_\n\n\nand 3.2.3): their dc_users tables will each contain the set of victims\n\nvictims. We use the term divergence to describe cases where two\n```\ndc_users tables.\n\n```\ncontaining their common prefix, we infer such an ancestor database\n\nwith an edge from a parent to child if the dc_users table of the\nparent is a prefix of the dc_users table of the child, that is if the\n\nof convergence in the DarkComet inheritance tree because there is\n\ntroller reverts to an earlier version of the database. This happens\n\n_4.1.3_ _Hack Pack Prevalence. Of note is that 68% of controllers’_\n\n_4.1.4_ _Controller Attrition. We managed to download just a single_\n\n\n-----\n\n**Figure 2: Fragment of the reconstructed DarkComet database inheritance tree. Open circles are sequences of databases down-**\n**loaded from a single controller; grey rectangles are known hack packs; black rectangles are inferred hack packs not part of**\n**our corpus of hack packs; black circles are single-controller reversion points.**\n\n_4.2.1_ _Static Anomaly Detection. Rezaeirad et al. [58] indicated that_\n\nto the victim records in our DarkComet databases’ dc_users tables\n\nanomalous by these rules. Note that anomalies marked with a † are\n\n_4.2.2_ _Hack Pack Victim Detection. In Section 4.1.1 we described_\n\n**Description** **Records** **UUIDs**\n\n\nIn hack pack †\n\nMissing expected keystrokes †\n\n<0.1% <0.1%\nAnomalous keystrokes † <0.1% <0.1%\n<0.1% <0.1%\n<0.1% <0.1%\n<0.1% <0.1%\n<0.1% <0.1%\n\nNew anomalous victims †\n\nTotal victims in hack packs †\n**Total unique victims**\n\n**Table 2: Records and UUIDs filtered by our anomaly detec-**\n**tion logic. Many records exhibit more than one anomaly.**\n\n## 4.2 Identifying Victim Pollution\n\ntion efforts in terms of records, that is, rows in dc_users tables.\nIn the 6,620 databases’ dc_users tables, there are 7,704,586 total\n\n\n_4.2.3_ _Keylog Validation. Using metadata from the keylog table, we_\n```\ndc_keyloggers table, described in Section 3.2.2, contains a file per\n\n```\nand dumps them, a file per day, to the controller’s dc_keyloggers\n\nleaves a conservative estimate of 57,805 victims. Had we only\n\n\n-----\n\nWWW ’20, April 20–24, 2020, Taipei, Taiwan Farinholt, et al.\n\napplied the rules described by Rezaeirad et al. [58], we would have\n\n## 5 OBSERVATIONS & APPLICATIONS\n\n1.0 1.0 Hack Pack\n\n0.9 0.9 No Hack Pack\n\n0.8 0.8\n\n0.7 0.7\n\n0.6 0.6\n\n0.5 0.5\n\n0.4 0.4\n\n0.3 0.3\n\n0.2 0.2\n\n## 5.1 Operator Takedown 0.1 0.1\n\n\n**Figure 3: CDF of victim infec-**\n**tion duration (n=6,354).**\n\n\n**Figure 4: CDF of controller**\n**age (n=507).**\n\n\narrested a DarkComet operator with over 2,000 victims, an operator\n_we had also been tracking. In our data set, we find evidence of several_\n\n**Infection Rate. Over our 213-day measurement period, controllers**\n\nfrom each controller and the last, an aggregate rate of 69 new\n**victims per day, or a new victim every 20 minutes. Infection rates**\n\nof which infected 463 victims in just 23 days at a rate of 20 new\n_victims per day. Rapidly growing campaigns could be prioritized_\n\n**Total Victims. The total number of victims infected per controller**\n\nour data set have over 9,000 victims each; the next closest has 3,468.\n\n**Campaign Longevity. We consider the operational age of a con-**\n\n\n## 5.2 Infection Duration & Cleanup\n\nÇetin et al. [12, 13] have demonstrated the effectiveness of ISP\n\ntheir victims using group names, recorded in the dc_groups data\n\n-----\n\nDark Matter: Uncovering the DarkComet RAT Ecosystem WWW ’20, April 20–24, 2020, Taipei, Taiwan\n\n\n## 5.3 Operator and Victim Geography\n\n**Controller**\n\n**Country** **Count** **Footprint** **Victims**\n\n**Table 3: Sample of controller locations and victim counts.**\n**Controller footprint is the total number of victims con-**\n**trolled by all controllers from a given country.**\n\nto understand the geographic relationship between them.[2] This\n\narately in the Anonymous VPN row. Controllers whose location\nwe could not determine are counted in the Other row. Figure 5\n\n2We geo-locate IP addresses using MaxMind’s Precision Insights service [44].\n\n\nRezaeirad et al. [58] evince that attackers and victims in the\n\nthe majority of victim hosts (77%) are not in the same country\n\n74% of attackers are in the same country as the majority of their\nvictims. Colocation of operator and victim is the norm for operators\n\nment operations would likely be both successful and high-impact.\n\n**Figure 5: Number of victims for each combination of con-**\n**troller and victim country. Rows denote controller countries**\n**and columns victim countries, based on geo-located IP ad-**\n**dress (excluding VPN providers).**\n\n## 5.4 Observed Harm to Victims\n\nwe detected in our data set. We quantify the harm incurred by the\n\n\n-----\n\nWWW ’20, April 20–24, 2020, Taipei, Taiwan Farinholt, et al.\n\n\nThe 2,664 victims in this sample set had 210,835,801 keystrokes\ncaptured over 25,315 days, amounting to over 162,098 hours of\n\ntim’s webcam. We were able to download the config.ini file from\n\n## 6 DISCUSSION\n\n**Campaign Tracking. Our method of obtaining victim databases**\n\n**Victim Identification. The pollution reduction heuristics we im-**\n\n\nÇetin et al. [12, 13] demonstrated the potential for victim notifi\n**Understanding Victim Harm. Understanding the harms incurred**\n\n**Study Limitations & Extensibility. Our data collection method-**\n\n## 7 CONCLUSION\n\n ACKNOWLEDGMENTS\n\n\n-----\n\nDark Matter: Uncovering the DarkComet RAT Ecosystem WWW ’20, April 20–24, 2020, Taipei, Taiwan\n\n\n## REFERENCES\n\nunderstanding the botnet phenomenon. In ACM Internet Measurement\n_Conference (IMC), 2006._\n\n[2] N. Anderson. How an omniscient internet “sextortionist” ruined the lives of teen\n\nUnderstanding the Mirai Botnet. In USENIX Security Symposium (USENIX), 2017.\n\n_Security BSides London, 2015._\n\ngardens. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018),\n\nviolence. In 2018 IEEE Symposium on Security and Privacy (SP), pages 441–458.\n\n[16] D. Dagon, C. Zou, and W. Lee. Modeling Botnet Propagation Using Time Zones.\nIn Networked and Distributed System Security Symposium (NDSS), 2006.\n\nScanning and Its Security Applications. In USENIX Security Symposium\n_(USENIX), 2013._\n\n_Botnet Fighting Conference (Botconf), 2013._\n\n[23] B. Enright, G. M. Voelker, S. Savage, C. Kanich, and K. Levchenko. Storm: When\nresearchers collide. USENIX ;login:, 2008.\n\namateur darkcomet rat operators in the wild. In IEEE Symposium on Security and\n_Privacy (S&P). IEEE, 2017._\n\nenforcement actions announced. FBI News, 2014. https:\n\nsyrian activists promises security, delivers spyware. Electronic Frontier\n_Foundation, 2012._\n\n\n_Black Hat USA, 2017._\n\nbotnets: Overview and case study. In USENIX Workshop on Hot Topics in\n_Understanding Botnets (HotBots), 2007._\n\n[31] J. Hertz, S. Denbow, and J. Wetzels. Darkcomet server 3.2 remote file download.\n\n[34] C. Kanich, K. Levchenko, B. Enright, G. M. Voelker, and S. Savage. The heisenbot\nuncertainty problem: Challenges in separating bots from chaff. In USENIX\n_Conference on Large-scale Exploits and Emergent Threats (LEET), 2008._\n\n[35] B. Krebs. ‘luminositylink rat’ author pleads guilty. Krebs on Security, 2018.\n\n[36] B. Krebs. Canadian police raid ‘orcus rat’ author. Krebs on Security, 2019.\n\n_Network and Distributed System Security Symposium (NDSS), 2017._\n\n[39] S. Le Blond, A. Uritesc, C. Gilbert, Z. L. Chua, P. Saxena, and E. Kirda. A look at\ntargeted attacks through the lense of an ngo. In USENIX Security Symposium\n_[(USENIX), 2014. https://seclab.ccs.neu.edu/static/publications/sec2014ngo.pdf.](https://seclab.ccs.neu.edu/static/publications/sec2014ngo.pdf)_\n\ngovernments hack opponents: A look at actors and technology. In USENIX\n_Security Symposium (USENIX), 2014._\n\n[46] R. McMillan. How the boy next door accidentally built a syrian spy tool. Wired,\n\nperforming effective botnet takedowns. In ACM Conference on Computer and\n_Communications Security (CCS), 2013._\n\n_USENIX Workshop on Hot Topics in Understanding Botnets (HotBots), 2007._\n\nUsing DNSBL Counter-intelligence. In Steps to Reducing Unwanted Traffic on the\n_Internet - Volume 2, 2006._\n\n\n-----\n\nWWW ’20, April 20–24, 2020, Taipei, Taiwan Farinholt, et al.\n\n\ntrojan ecosystem. In USENIX Security Symposium (USENIX). USENIX\n\nsyrian conflict. Trend Micro: TrendLabs Security Intelligence Blog, 2012.\n\nTakeover. In ACM Conference on Computer and Communications Security (CCS),\n\n\n\n[63] A. Yokoyama, K. Ishii, R. Tanabe, Y. Papa, K. Yoshioka, T. Matsumoto, T. Kasama,\n\nMalware Sandboxes to Provide Intelligence for Sandbox Evasion. In Research in\n_Attacks, Intrusions, and Defenses, 2016._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.sysnet.ucsd.edu/sysnet/miscpapers/darkmatter-www20.pdf"
    ],
    "report_names": [
        "darkmatter-www20.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041347,
    "ts_creation_date": 1580069179,
    "ts_modification_date": 1580069179,
    "files": {
        "pdf": "https://archive.orkl.eu/7b800f4256d7a5db78fde200a35f8845d66ffade.pdf",
        "text": "https://archive.orkl.eu/7b800f4256d7a5db78fde200a35f8845d66ffade.txt",
        "img": "https://archive.orkl.eu/7b800f4256d7a5db78fde200a35f8845d66ffade.jpg"
    }
}