{
    "id": "1d48a63b-d357-4ade-9f6e-622f29408659",
    "created_at": "2023-01-12T15:09:16.042299Z",
    "updated_at": "2025-03-27T02:05:31.768038Z",
    "deleted_at": null,
    "sha1_hash": "d360455b1302cecd42dcc60e986b124df6a96a3f",
    "title": "2022-05-25 - ERMAC Back In Action- Latest Version Of Android Banking Trojan Targets Over 400 Applications",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:28Z",
    "file_modification_date": "2022-06-01T12:23:28Z",
    "file_size": 2312893,
    "plain_text": "# ERMAC Back In Action\n\n**blog.cyble.com/2022/05/25/ermac-back-in-action/**\n\nMay 25, 2022\n\n## Latest Version of Android Banking Trojan Targets over 400 Applications\n\n[Cyble Research Labs came across a Twitter post wherein a researcher mentioned the distribution of](https://twitter.com/ESETresearch/status/1526897310231322630)\nERMAC 2.0. ERMAC is an Android Banking Trojan that was first discovered in late August 2021, when it\nwas found targeting Poland. ERMAC 1.0 was capable of stealing the credentials of 378 applications. The\nThreat Actor was renting it out for $3K/month on a cybercrime forum.\n\nRecently, Cyble Research Labs observed that an upgraded version – ERMAC 2.0 – has been available on\nunderground forums for rent at $5K/month and targets 467 applications for stealing credentials.\n\n\n-----\n\n_Figure 1 – Cyber Crime Forum selling ERMAC 2.0_\nWe have observed that the ERMAC 2.0 is being delivered through fake sites. For example, via the Bolt\nFood site – a delivery platform that provides high-quality food delivery services. The fake app\nimpersonates the Bolt Food Android application and targets Polish Bolt Food users.\n\n_Figure 2 – Fake Bolt Food site distributing malware_\nApart from the fake Bolt Food site, EMRAC 2.0 spreads through fake browser update sites, as shown in\nFigure 3.\n\n\n-----\n\n_Figure 3 – Fake browser update site (Source_\n\n_– MalwareHunterTeam)_\nThe below image shows the Control Panel of ERMAC 2.0 Banking Trojan. In the UI, the Threat Actor (TA)\nhas named it “ERMVC PVNEL.”\n\n_Figure 4 – Control Panel_\n\n## Technical Analysis \n\n### APK Metadata Information \n\n\n-----\n\nApp Name: Bolt Food\nPackage Name: com.kototomumeci.nacipiyi\nSHA256 Hash: 2cc727c4249235f36bbc5024d5a5cb708c0f6d3659151afc5ae5d42d55212cb5\n\nFigure 5 shows the metadata information of an application.\n\n_Figure 5 – App Metadata Information_\n\n### Manifest Description \n\nThe malicious application asks for 43 permissions, of which the TA exploits 12. The malware’s harmful\npermission requests are listed below:\n\n**Permission** **Description**\n\n**REQUEST_INSTALL_PACKAGES** Allows an application to request installing  packages\n\n**CALL_PHONE** Allows an application to initiate a phone call  without going\nthrough the Dialer user  interface for the user to confirm the call\n\n**RECEIVE_SMS** Allows an application to receive SMS messages\n\n**READ_SMS** Allows an application to read SMS messages\n\n**SEND_SMS** Allows an application to send SMS  messages\n\n**READ_CONTACTS** Allows an application to read the user’s  contacts data\n\n**READ_PHONE_STATE** Allows read access to the device’s phone  number\n\n**SYSTEM_ALERT_WINDOW** Allows an app to create windows shown on  top of all other\napps.\n\n**READ_EXTERNAL_STORAGE** Allows an application to read from external storage\n\n**RECORD_AUDIO** Allows an application to record audio\n\n**WRITE_EXTERNAL_STORAGE** Allows an application to write to external  storage\n\n### Source Code Review \n\nApart from the application’s subclass, the rest of the components identified from the Manifest file are\nmissing. We can thus infer that the application is packed.\n\n\n-----\n\n_Figure 6 – Manifest File_\nUpon execution, the malicious application unpacks the DEX file present in the assets folder and then loads\nthe classes.\n\nIn this case, the dropped dex file name is “pqiRsn.json,” which has all the missing classes\n\nThe strings present in the classes are encoded using base64 and encrypted using the AES-128-bit\nalgorithm.\n\nThe Secret Key and IVparameter were dumped during dynamic analysis. Both Secret Key and\nIVparameter are used to decrypt hardcoded strings present in the file as well as encrypt the data sent to\nthe C&C server. The below image explains the decryption process.\n\n_Figure 7 – Encryption and Decryption Technique_\nOn installing the application, it prompts the user to turn on the Accessibility Service. When the victim\ngrants this permission, it starts abusing services by auto-enabling overlay activity and auto-granting\npermissions.\n\n\n-----\n\n_Figure 8 – Accessibility Service_\nAfter granting the Accessibility permission, the malware sends a list of installed applications on the victim’s\nAndroid device to the C&C server. The malware then downloads and installs the injection modules of\ntargeted applications based on this application list.\n\nFigure 9 showcases the C&C communications from the victim’s device, which sends the details of installed\napplications and receives a response, including a list of targeted applications to perform overlay activity. At\nthe time of our analysis, it was observed that the “Unocoin” wallet was the targeted application by the\nattacker.\n\n_Figure 9 – Sending application list and receiving the response for the targeted app_\nThe malware then receives an encrypted HTML phishing page, which will be decrypted and stored into the\nShared Preference file named “setting.xml” with the action status, as shown in the figure below.\n\n\n-----\n\n_Figure 10 – Downloaded injection saved in Shared Preference file_\nAs soon as the victim interacts with a targeted genuine application, the injected phishing page is displayed\nthrough setting.xml that can be used for credential harvesting.\n\nFigure 11 shows the phishing page for “Unocoin.” The malware sends the start_inject command to the\nC&C server before sending the credentials.\n\n_Figure 11 – Loading phishing page_\nThe harvested credentials are sent to the same C&C server in the encrypted format, as shown in Figure\n12. ERMAC 2.0 uses the command logs for code injection as well as data exfiltration functionalities.\n\n\n-----\n\nFigure 12 – Sending credentials to the C&C server\nThe TA can then use these credentials to steal cryptocurrency from the victim’s account.\n\nThe below image shows the TA’s phishing pages used to trick the victims into falling for a phishing scheme\nwhile attempting to access genuine applications.\n\n_Figure 13 – Fake injected window targeting different applications_\nCyble Research Labs witnessed that the malware has functionalities to target various banking applications\nof several banks worldwide.\n\nThe commands used by ERMAC 2.0 to execute malicious operations are:\n\n**Command** **Description**\n\ndownloadingInjections Sends the application list to download injections\n\nlogs Sends injection logs to the server\n\ncheckAP Check the application status and send it to the server\n\nregistration Sends device data\n\nupdateBotParams Sends the updated bot parameters\n\ndownloadInjection Used to receive the phishing HTML page\n\n## Conclusion\n\n\n-----\n\nThe Threat Actor behind ERMAC used the leaked code from a well-known malware variant named\n“Cerberus” and modified the code to sell the Android botnets in cybercrime forums. Interestingly, we\nobserved that ERMAC 2.0 is distributed rapidly through various phishing sites, primarily targeting Polish\nusers.\n\nERMAC 2.0 steals credentials from different crypto wallets and targets multiple banking applications\nworldwide. We foresee that the TA behind ERMAC 2.0 will continue to develop new versions with more\ntargeted applications, new TTPs, and new delivery methods.\n\n## Our Recommendations\n\nWe have listed some essential cybersecurity best practices that create the first line of control against\nattackers. We recommend that our readers follow the best practices given below:\n\n### How to prevent malware infection?\n\nDownload and install software only from official app stores like Google Play Store or the iOS App\nStore.\nUse a reputed anti-virus and internet security software package on your connected devices, such as\nPCs, laptops, and mobile devices.\nUse strong passwords and enforce multi-factor authentication wherever possible.\nEnable biometric security features such as fingerprint or facial recognition for unlocking the mobile\ndevice where possible.\nBe wary of opening any links received via SMS or emails delivered to your phone.\nEnsure that Google Play Protect is enabled on Android devices.\nBe careful while enabling any permissions.\nKeep your devices, operating systems, and applications updated.\n\n### How to identify whether you are infected?\n\nRegularly check the Mobile/Wi-Fi data usage of applications installed on mobile devices.\nKeep an eye on the alerts provided by Anti-viruses and Android OS and take necessary actions\naccordingly.\n\n### What to do when you are infected?\n\nDisable Wi-Fi/Mobile data and remove SIM card – as in some cases, the malware can re-enable the\nMobile Data.\nPerform a factory reset.\nRemove the application in case a factory reset is not possible.\nTake a backup of personal media Files (excluding mobile applications) and perform a device reset.\n\n### What to do in case of any fraudulent transaction?\n\nIn case of a fraudulent transaction, immediately report it to the concerned bank.\n\n### What should banks do to protect their customers?\n\nBanks and other financial entities should educate customers on safeguarding themselves from\nmalware attacks via telephone, SMS, or emails.\n\n\n-----\n\n## MITRE ATT&CK® Techniques\n\n**Tactic** **Technique ID** **Technique Name**\n\n**Initial Access** [T1476](https://attack.mitre.org/versions/v7/techniques/T1476/) Deliver Malicious App via Other Mean.\n\n**Initial Access** [T1444](https://attack.mitre.org/versions/v7/techniques/T1444) Masquerade as Legitimate Application\n\n**Defense Evasion** [T1406](https://attack.mitre.org/techniques/T1406/) Obfuscated Files or Information\n\n**Credential Access** [T1412](https://attack.mitre.org/techniques/T1636/004/) Capture SMS Messages\n\n**Discovery** [T1421](https://attack.mitre.org/techniques/T1421/) System Network Connections Discovery\n\n**Command and Control** [T1571](https://attack.mitre.org/techniques/T1571/) Non-Standard Port\n\n**Command and Control** [T1573](https://attack.mitre.org/techniques/T1573/) Encrypted Chanel\n\n**Collection** [T1432](https://attack.mitre.org/techniques/T1432/) Access Contact List\n\n**Collection** [T1507](https://attack.mitre.org/techniques/T1507) Network Information Discovery\n\n## Indicators of Compromise (IOCs)\n\n**Indicators** **Indicator**\n**Type**\n\n\n**Description**\n\n\n**2cc727c4249235f36bbc5024d5a5cb708c0f6d3659151afc5ae5d42d55212cb5** SHA256 Hash of the\nanalyzed\nAPK file\n\n**301e2ab9707abe193bb627c60f5e4b8736c86fe9** SHA1 Hash of the\nanalyzed\nAPK file\n\n**1e0586aef0f106031260fecb412c5cdf** MD5 Hash of the\nanalyzed\nAPK file\n\n**hxxp://bolt-food[.]site** URL Malware\ndistribution\nsite\n\n**hxxp://193[.]106.191[.]116** URL C&C Server\n\n**df298b0aba5aad2886ae720577557b3e48fba905055dcee0fd74336660bfd0a2** SHA256 Hash of the\nanalyzed\nAPK file\n\n**e2fb7981688060fc672f844c65e89d12f3e5cafe** SHA1 Hash of the\nanalyzed\nAPK file\n\n**1bb6da78e3c379afde1978aecfa067b8** MD5 Hash of the\nanalyzed\nAPK file\n\n\n-----\n\n**hxxp://boltfood[.]site** URL Malware\ndistribution\nsite\n\n**df298b0aba5aad2886ae720577557b3e48fba905055dcee0fd74336660bfd0a2** SHA256 Hash of the\nanalyzed\nAPK file\n\n**fe4a7d079cc00e730412c7a6e0b177829ee58a73** SHA1 Hash of the\nanalyzed\nAPK file\n\n**65f634ef24fd686225aa4765fc63fe2b** MD5 Hash of the\nanalyzed\nAPK file\n\n**hxxp://apkphoto.[co].NZ** URL Malware\ndistribution\nsite\n\n**hxxp://45[.]141.85[.]25** URL C&C Server\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-25 - ERMAC Back In Action- Latest Version Of Android Banking Trojan Targets Over 400 Applications.pdf"
    ],
    "report_names": [
        "2022-05-25 - ERMAC Back In Action- Latest Version Of Android Banking Trojan Targets Over 400 Applications.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536156,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1654086208,
    "ts_modification_date": 1654086208,
    "files": {
        "pdf": "https://archive.orkl.eu/d360455b1302cecd42dcc60e986b124df6a96a3f.pdf",
        "text": "https://archive.orkl.eu/d360455b1302cecd42dcc60e986b124df6a96a3f.txt",
        "img": "https://archive.orkl.eu/d360455b1302cecd42dcc60e986b124df6a96a3f.jpg"
    }
}