{
    "id": "1d795fe7-4ab5-43e3-82a9-3e67ae2f2090",
    "created_at": "2023-01-12T15:07:56.159365Z",
    "updated_at": "2025-03-27T02:16:26.204614Z",
    "deleted_at": null,
    "sha1_hash": "b1a39bc6944d64c46639db826aa86aa4fd811933",
    "title": "2021-04-05 - 2020 Phishing Trends With PDF Files",
    "authors": "",
    "file_creation_date": "2022-05-27T22:37:14Z",
    "file_modification_date": "2022-05-27T22:37:14Z",
    "file_size": 5103341,
    "plain_text": "# Phishing Trends With PDF Files\n\n**unit42.paloaltonetworks.com/phishing-trends-with-pdf-files/**\n\nAshkan Hosseini, Ashutosh Chitwadgi April 6, 2021\n\nBy [Ashkan Hosseini and](https://unit42.paloaltonetworks.com/author/ashkan-hosseini/) [Ashutosh Chitwadgi](https://unit42.paloaltonetworks.com/author/ashutosh-chitwadgi/)\n\nApril 5, 2021 at 6:00 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [malvertising,](https://unit42.paloaltonetworks.com/tag/malvertising/) [Phishing](https://unit42.paloaltonetworks.com/tag/phishing/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/phishing-trends-with-pdf-files/)\n\n## Executive Summary\n\nFrom 2019-20, we noticed a dramatic 1,160% increase in malicious PDF files – from 411,800 malicious files to 5,224,056. PDF files are an\nenticing phishing vector as they are cross-platform and allow attackers to engage with users, making their schemes more believable as\nopposed to a text-based email with just a plain link.\n\nTo lure users into clicking on embedded links and buttons in phishing PDF files, we have identified the top five schemes used by attackers in\n2020 to carry out phishing attacks, which we have grouped as Fake Captcha, Coupon, Play Button, _File Sharing and E-commerce._\n\n[Palo Alto Networks customers are protected against attacks from phishing documents through various services, such as Cortex XDR,](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n[AutoFocus and](https://www.paloaltonetworks.com/cortex/autofocus) [Next-Generation Firewalls with security subscriptions including WildFire,](https://www.paloaltonetworks.com/network-security/next-generation-firewall) [Threat Prevention,](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) [URL Filtering and](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/web-security) [DNS Security.](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/dns-security)\n\n## Data Collection\n\nTo analyze the trends that we observed in 2020, we leveraged the data collected from the Palo Alto Networks WildFire platform. We collected\na subset of phishing PDF samples throughout 2020 on a weekly basis. We then employed various heuristic-based processing and manual\nanalysis to identify top themes in the collected dataset. Once these were identified, we created Yara rules that matched the files in each\nbucket, and applied the Yara rules across all the malicious PDF files that we observed through WildFire.\n\n## Data Overview\n\nIn 2020, we observed more than 5 million malicious PDF files. Table 1 shows the increase in the percentage of malicious PDF files we\nobserved in 2020 compared to 2019.\n\n**Malware** **Total PDF Files Seen** **Percentage of PDF Malware** **Percentage Increase**\n\n2019 411,800 4,558,826,227 **0.009%** **1,160%**\n\n2020 5,224,056 6,707,266,410 **0.08%**\n\n\n-----\n\nThe pie chart in Figure 1 gives an overview of how each of the top trends and schemes were distributed. The largest number of malicious PDF\nfiles that we observed through WildFire belonged to the fake “CAPTCHA” category. In the following sections, we will go over each scheme in\ndetail. We do not discuss the ones that fall into the “Other” category, as they include too much variation and do not demonstrate a common\ntheme.\n\nFigure 1.\n\nMalicious PDF trends in 2020.\n\n## Usage of Traffic Redirection\n\nAfter studying different malicious PDF campaigns, we found a common technique that was used among the majority of them: usage of traffic\nredirection.\n\nBefore we review the different PDF phishing campaigns, we will discuss the importance of traffic redirection in malicious and phishing PDF\nfiles. The links embedded in phishing PDF files often take the user to a gating website, from where they are either redirected to a malicious\nwebsite, or to several of them in a sequential manner. Instead of embedding a final phishing website – which can be subject to frequent\ntakedowns – the attacker can extend the shelf life of the phishing PDF lure and also evade detection. Additionally, the final objective of the lure\ncan be changed as needed (e.g. the attacker could choose to change the final website from a credential stealing site to a credit card fraud\nsite). Not specific to PDF files, the technique of traffic redirection for malware-based websites is heavily discussed in “Analysis of Redirection\nCaused by Web-based Malware” by Takata et al.\n\nWe identified the top five phishing schemes from our dataset and will break them down in the order of their distribution. It is important to keep\nin mind that phishing PDF files often act as a secondary step and work in conjunction with their carrier (e.g., an email or a web post that\ncontains them).\n\n**1. Fake CAPTCHA**\n\nFake CAPTCHA PDF files, as the name suggests, demands that users verify themselves through a fake CAPTCHA. CAPTCHAs are\nchallenge-response tests that help determine whether or not a user is human. However, the phishing PDF files we observed do not use a real\nCAPTCHA, but instead an embedded image of a CAPTCHA test. As soon as users try to “verify” themselves by clicking on the continue\nbutton, they are taken to an attacker-controlled website. Figure 2 shows an example of a PDF file with an embedded fake CAPTCHA, which is\njust a clickable image. A detailed analysis of the full attack chain for these files is included in the section Fake CAPTCHA Analysis.\n\n\n-----\n\nFigure 2. Phishing PDF with a fake\n\nCAPTCHA asking users to click on “Continue” to verify themselves.\n\n**2. Coupon**\n\nThe second category that we identified were phishing PDF files that were coupon-themed and often used a logo of a prominent oil company. A\nconsiderable amount of these files were in Russian with notes such as “ПОЛУЧИТЬ 50% СКИДКУ” and “ЖМИТЕ НА КАРТИНКУ” which\ntranslate to “get 50% discount” and “click on picture” respectively. Figure 3 shows an example of these types of phishing PDF files:\n\n\n-----\n\nFigure 3.\n\nPhishing PDF file with a logo of a prominent oil company asking the user to click on the picture.\nSimilar to other campaigns we observed, these phishing files also leveraged traffic redirection for reasons mentioned previously. Upon\nanalyzing several of them, we found out that they use two traffic redirectors. Figure 4 shows the chain for a sample (SHA256:\n5706746b7e09b743a90e3458e5921367a66a5c3cfbd9417ed082dea586b7986e).\n\nFigure 4.\n\nAttack chain for a coupon-themed sample.\nThe gating website took us to another website (track[.]backtoblack.xyz), which was a redirector itself. Eventually, we were routed to an adult\ndating website through a GET request with some parameters filled such as click_id, which can be used for monetization as shown in Figure 5.\nAll these redirections happened through HTTP 302 response messages. Our research showed that the offer_id parameter of backtoblack[.]xyz\ncontrols what website the user lands on at the end.\n\n\n-----\n\nFigure 5.\n\nPhishing PDF sample lands the user on a registration page of an adult dating website.\n\n**3. Static Image With a Play Button**\n\nThese phishing files do not necessarily carry a specific message, as they are mostly static images with a picture of a play button ingrained in\nthem. Although we observed several categories of images, a significant portion of them either used nudity or followed specific monetary\nthemes such as Bitcoin, stock charts and the like to lure users into clicking the play button. Figure 6 shows a PDF file with a Bitcoin logo and a\nclickable play button.\n\nFigure 6. Bitcoin logo with a clickable play button.\n\nUpon clicking the play button, we were again, as expected, redirected to another website. In the majority of our tests, we were redirected to\nhttps://gerl-s[.]online/?s1=ptt1. From the domain name, one could assume the website is also within the realm of online dating. However, at the\ntime of this writing, this website had been taken down. Unlike the previous campaign, there was only one redirector involved, and we noticed\nthat all the redirectors had the format of: 6-digit-alphanumeric-unique-id[dot]sed followed by a main domain as listed below.\n\nhttp://pn9yozq[ ]sed notifyafriend com/\n\n\n-----\n\nttp // 8cag6 [ ]sed t ea ge to es co /\nhttp://9ltnsan[.]sed.roxannearian.com/\nhttp://wnj0e4l[.]sed.ventasdirectas.com/\nhttp://x6pd3rd[.]sed.ojjdp.com/\nhttp://ik92b69[.]sed.chingandchang.com/\nhttp://of8nso0[.]sed.lickinlesbians.com/\n\n**4. File Sharing**\n\nFigure 7.\n\nPhishing PDF with a logo of a popular file sharing platform asking the user to click on the button for access.\nThis category of phishing PDF files utilizes popular online file sharing services to grab the user’s attention. They often inform the user that\nsomeone has shared a document with them. However, due to reasons which can vary from one PDF file to another, the user cannot see the\ncontent and apparently needs to click on an embedded button or a link. Figure 7 shows a PDF with a Dropbox logo asking the user to click on\nthe button to request access. Figure 8 similarly shows a picture of a PDF file with a OneDrive logo, asking the user to click on “Access\nDocument” to view the content of the file. As the number of cloud-based file sharing services increases, it would not be surprising to see this\ntheme surge and continue to be among the most popular approaches.\n\n\n-----\n\nFigure 8.\n\nPhishing PDF file asking the user to click on “Access Document” to view the shared file.\n[Clicking on the “Access Document” button took us to a login page with an Atlassian logo, as shown in Figure 9. We were given two options to](https://www.atlassian.com/)\nuse for signing in: Microsoft email or other email services.\n\nFigure 9.\n\nPhishing website asking the user to log in with one of the provided email options.\nAtlassian Stack is geared towards enterprises, so we assume that this campaign was targeting enterprise users. Each of those links were\ndesigned to look like a legitimate email sign-on page. For instance, “Continue with Microsoft” took us to a page that looked somewhat similar to\n[what one would encounter upon entering the legitimate https://login.live.com, as shown in Figure 10.](https://login.live.com/)\n\n\n-----\n\nFigure 10.\n\nPhishing website looking like Microsoft’s login page. Note the URL, which gives away that the page is not legitimate.\nAfter we entered a fake email address, we proceeded to another page that asked us to enter our password, as shown in Figure 11.\n\n\n-----\n\nFigure 11. To\n\nclosely imitate login.live.com, the “Enter password” page comes after the user enters a valid username. Note the URL, which indicates a scam\nsite.\nWe observed that the stolen credentials were sent on the attacker's server through the parameters in a GET request, as shown in Figure 12.\n\nFigure 12.\n\nPhished credentials submitted to the attacker's server through a GET request.\nAfter entering the test credentials, we were taken back to the first login page. We would like to note that, at the time that we visited this\nwebsite, it was already flagged as phishing by major browsers such as Google Chrome and Mozilla Firefox. However, we clicked through the\nwarning page to investigate further.\n\n**5. E-commerce**\n\n[Incorporating e-commerce themes into phishing emails and documents is not a new trend. However, we observed an upward trend in the](http://cups.cs.cmu.edu/soups/2006/proceedings/p79_downs.pdf)\nnumber of fraudulent PDF files that used common e-commerce brands to trick users into clicking on embedded links. Figure 13 shows an\nexample phishing PDF file notifying the user that their credit card is no longer valid, and they need to “update payment information” to not have\ntheir Amazon Prime benefit interrupted. Figure 14, similarly, shows a PDF file telling the user their Apple ID account will be suspended if they\ndo not click on the link to update their information.\n\n\n-----\n\nFigure 13. Phishing\n\n\nPDF file claiming the user’s credit card is about to expire on a well-known e-commerce website.\n\n\n-----\n\nFigure 14.\n\nPhishing PDF file claiming the user’s Apple ID is about to be disabled.\nAt the time of this writing, all the websites for this specific campaign were taken down. It is worth noting that the majority of these e-commerce\nthemed phishing PDF files used https://t.umblr[.]com/ for redirection purposes. Examples include:\n\nhttps://t.umblr[.]com/redirect?\nz=https%3A%2F%2Fdulunggakada40.com%2F%3Fgdghrtjykuujttjkg&t=ZDJkNjIzMjY2ZDBlMDkyMDIwNTkwZDFiYTdlNGI5NTE3MTJlOWY0YyxlM\n\nhttps://t.umblr[.]com/redirect?\nz=https%3A%2F%2Fdulunggakada40.com%2F%3Fgdghrtjykuujttjkg&t=ZDJkNjIzMjY2ZDBlMDkyMDIwNTkwZDFiYTdlNGI5NTE3MTJlOWY0YyxlM\n\n## Fake CAPTCHA Analysis\n\nAs previously mentioned, close to 40% of phishing PDF files that we saw in 2020 were part of the fake CAPTCHA category. Figure 15 shows\nthe hex content of a fake CAPTCHA sample (SHA256: 21f225942de6aab545736f5d2cc516376776d3f3080de21fcb06aa71749fc18f). We can\nsee that the PDF file has an embedded Uniform Resource Identifier (URI) that points to https://ggtraff[.]ru/pify?\nkeyword=download+limbo+apk+full+game, which is a traffic redirector. As mentioned earlier, traffic redirection websites do not point to a fixed\nwebsite, and they often redirect the user to a different website upon each visit.\n\n\n-----\n\nFigure 15.\n\nEmbedded URL in a fake CAPTCHA sample.\nFigure 16 is the HTTP response body that we got from the aforementioned URI during one of our tries. The returned response from the\nredirector was a small JavaScript code stub that again redirects the user, but this time to: https://robotornotcheckonline[.]xyz/?\np=miywentfmi5gi3bpgizdqnzv&sub1=wbly&sub3=1h6oih4jofeu&sub4=download+limbo+apk+full+game.\n\nFigure 16. URL\n\nredirecting the user to robotornotcheckonline[.]xyz\nTo understand the whole chain, we followed the link from Figure 16. The response was a multi-function JavaScript code that can be seen in\nFigure 17.\n\n\n-----\n\nFigure 17.\n\nJavaScript code that asks the user to subscribe to push notifications.\nEssentially, the code listed above registers a browser push notification. Mozilla describes browser push notifications as follows: “Notifications\nAPI lets a web page or app send notifications that are displayed outside the page at the system level; this lets web apps send information to a\nuser even if the application is idle or in the background.” Figure 18 shows the permission request when visiting the website in a browser.\n\n\n-----\n\nFigure 18.\n\nrobotornotcheckonline[.]xyz asking the user to subscribe to their push notifications By clicking on “Allow”, the user is then redirected to another\nwebsite that asks them to subscribe to another push notification. When the user agrees and subscribes to the push notification, the function\nSubS() from Figure 17 is called, which sends a POST request to let the controller know that the user has subscribed to them. Figure 19 shows\nthe specific POST request. We can see that there are a few parameters with unique values such as “key” and “secret” that are sent along to\nfingerprint the user.\n\nFigure 19.\n\nPOST request notifying the controller that the user has subscribed to their notifications.\nThis loop can go on a few times. However, it is important to note that the site does not have to be open in the browser for the notifications to\npop. After completing the chain, we noticed two push notifications were registered in our browser, as shown in Figure 20. This now registers\nour browser as a “target” for these websites to send future popups for additional malvertising websites and extension installations.\n\n\n-----\n\nFigure 20.\n\nFake CAPTCHA sample resulting in the registration of two push notifications.\nAt the end, we landed on an online gaming website. Below is the HTTP GET request used:\n\nhttps://promo[.]???.com/glows-27628/na-en/?\npub_id=1374&xid=600889fbf85ac2000110370d&xid_param1=3047954&xid_param_2=&sid=SIDQVeAYOu1UbRxwVV690cyVM5sWOOfDAb7h_jd_AIcFGJbFBhqkUXwCszxjNr_9eJ1uoX1OdKr3vILRvqtbg9mcdeMNy5zbavbbqOxtJwEYgn1l5htPFMCsWv3Ft45e5BLHmpA0DQLcy&enctid=c\n\nAs we can see, there are a lot of parameters involved with the above GET request. It is our assumption that this is how the attackers generate\nrevenue. These identifiers tell the owner of the website how the user got there. If it was through the means that the attacker leveraged, the\n[attacker in return gets a commision of some sort for bringing the users to that website. We also noticed Urchin Tracking Module parameters](https://support.google.com/analytics/answer/1033863?hl=en)\nwere also used to evaluate the effectiveness of this “marketing” method. To keep a stream of revenue, instead of a one-time click, it appears to\nus that attackers are leveraging push notifications. That way they can, once in a while, use the notification mechanism to deceive subscribed\nusers into clicking on more links, and hence generate more revenue. As previously mentioned, our analysis has shown that fake CAPTCHA\nphishing samples have embedded links that point to traffic redirection websites, which then redirect the user to a different website upon each\nvisit. To better understand where else these phishing files can lead us to, we decided to visit them a few more times. On one of those\ninstances, we were not only presented with a page that asked us to subscribe to their push notifications, we were also asked to download a\nGoogle Chrome extension, as shown in Figure 21.\n\nFigure 21.\n\nTraffic redirection website taking us to a website that subscribes users to push notifications and asks them to download a Chrome extension\nWhen “Add to Chrome” was clicked, we were then taken to the Chrome Web Store (“CWS”). CWS is Google's online store that hosts browser\nextensions. Figure 22 shows the extension on the CWS with more than a thousand downloads.\n\nNote: at the time of the publication the extension was not available on Chrome Web Store anymore.\n\n\n-----\n\nFigure 22.\n\nHDSportSearch plugin with more than 1,000 downloads on Chrome Web Store.\nUpon downloading and analyzing the extension, the manifest.json file bundled in the extension package revealed that the HDSportSearch\n[extension is a search engine hijacker that overrides the search engine default values for the browser, as shown in Figure 23.](https://support.mozilla.org/en-US/kb/what-search-hijacking)\n\nFigure 23.\n\nmanifest.json for HDSportSearch plugin overriding Chrome’s settings.\nFigure 24 summarizes the paths we were able to explore for the PDF phishing file with a fake CAPTCHA.\n\nFigure 24. Paths\n\nand actions that a PDF with a fake CAPTCHA can take.\n\n## Conclusion\n\n\n-----\n\ne co e ed t e ost co o based p s g ca pa g s t at e sa 0 0 a o g t t e d st but o ata o [ece t yea s](https://enterprise.verizon.com/resources/reports/2020-data-breach-investigations-report.pdf)\ndemonstrates that the amount of phishing attacks continues to increase and social engineering is the main vector for attackers to take\n[advantage of users. Prior research has shown that large-scale phishing can have a click-through rate of up to 8%. Thus, it is important to verify](https://www.usenix.org/system/files/conference/cset17/cset17-paper-siadatti.pdf)\nand double check the files you receive unexpectedly, even if they are from an entity that you know and trust. For example, why was your\naccount locked out of nowhere, or why did someone share a file with you when you least expected it?\n\nPalo Alto Networks customers are protected against attacks from such phishing documents through various services:\n\nCortex XDR (protects against phishing document delivery and execution).\nNext-Generation Firewalls with security subscriptions including WildFire and Threat Prevention (protects against phishing document\ndelivery), URL Filtering (protects against redirectors and final phishing URLs) and DNS Security (protects against redirectors and final\nphishing domains).\nAutoFocus users can track some of these PDF phishing campaigns under the Autofocus tag GenericPhishingDocs.\n\n**Indicators of Compromise**\n\nCampaign SHA256\n\nFake CAPTCHA 7bb3553eea6e049a943bc2077949bc767daab2c3c993ce10011\n\n2df31f2ea1a434a034a1b3031f3e59bae6c6f73dff39e50fd37bd028577e2710\n\n9b2a875169db01332f5fbb59bb3021ad5dd1b241add17750924a85033798f8e7\n\nCoupon 5706746b7e09b743a90e3458e5921367a66a5c3cfbd9417ed08\n\n0cce9de0ff8e5bc07a8b54a95abbef49db08105b83c233a3c3647c09c06bdffb\n\n0e4d74dacdb72756c49438f81e3267a9e92c3ea9465a84aa5cf4fdaf82a6ed61\n\nPlay Button 6835fa030a50b9826612d1e6e3f0c1db2790b3783f62de029728\n\n2c361182748c44364b7e631280ca47fa09cb9736b06208285384d6d7826c67b9\n\n6835fa030a50b9826612d1e6e3f0c1db2790b3783f62de02972898f79be07265\n\nFile Sharing 0ce0cfb5c175f57efb02521d69020098d302bc3e37c4d7937213\n\n8c602aee3565491864da3b1040696b23b80cee2894c52b5cd982a11ad37977a3\n\n9a79cae2ba1ba1510d5940a1b5559dd1509b7377a6bd125866e65f96c12d8894\n\nE-commerce b330cbd30a2ab86e0f855e9a0d3a87aa7b91829db5c6bc34f4fa\n\n7e7f2726a892ada15a1bdf79bd6f967650c440a64e89d5f1b83e29afdece1f1c\n\ncccee5092d5986d34bfdead009d24d1b0dfb8284f291ed44093904cc9c494d7f\n\n**Related Autofocus Tag**\n\nGenericPhishingDocs\n\n**Redirectors**\n\npn9yozq[.]sed.notifyafriend.com\n\nl8cag6n[.]sed.theangeltones.com\n\n9ltnsan[.]sed.roxannearian.com\n\nwnj0e4l[.]sed.ventasdirectas.com\n\nx6pd3rd[.]sed.ojjdp.com\n\nik92b69[.]sed.chingandchang.com\n\nof8nso0[.]sed.lickinlesbians.com\n\nt.umblr[.]com/redirect?\nz=https%3A%2F%2Fdulunggakada40.com%2F%3Fgdghrtjykuujttjkg&t=ZDJkNjIzMjY2ZDBlMDkyMDIwNTkwZDFiYTdlNGI5NTE3MTJlOWY0YyxlM\n\nt.umblr[.]com/redirect?\nz=https%3A%2F%2Fdulunggakada40.com%2F%3Fgdghrtjykuujttjkg&t=ZDJkNjIzMjY2ZDBlMDkyMDIwNTkwZDFiYTdlNGI5NTE3MTJlOWY0YyxlM\n\n\n-----\n\nggt a [ ] u/p y ey o d do oad bo ap u ga\n\n**Final Hosts**\n\nrobotornotcheckonline[.]xyz/?p=miywentfmi5gi3bpgizdqnzv&sub1=wbly&sub3=1h6oih4jofeu&sub4=download+limbo+apk+full+game\n\ngerl-s[.]online/?s1=ptt1\n\ncreqwcf[.]tk/%23$%25%5e&\n\nget[.]hdsportsearch.com/?pid=58955&clickid=37590634811986352\n\n**Yara Rules Used**\n\nrule onedrive_category_2\n\n{\n\nmeta:\n\nauthor = \"Ashkan Hosseini\"\n\ndate = \"2021-01-08\"\n\ndescription = \"Onedrive Category 2 (Red Background)\"\n\nhash0 = \"af35c35a1b1fa09944c29000923076cc\"\n\nhash1 = \"5c199d1c59b93fa5b1e322ed7846f146\"\n\nhash2 = \"e1a267558a6d4fdbfc4502a27239c1b4\"\n\nhash3 = \"980bba53d02b9e4e53d13621b11ddfb5\"\n\nhash4 = \"26a670f532d702199c2c3f4b65f9c1e7\"\n\nhash5 = \"f8162f71caa3581c66a16c894f089320\"\n\nhash6 = \"0338637ab800cfea336ccf4f00b303f7\"\n\nhash7 = \"d05742fc803bcd719f1afc156e703910\"\n\nsample_filetype = \"pdf\"\n\nstrings:\n\n$string0 = \"4 0 obj\"\n\n$string1 = \"1 0 obj\"\n\n$string2 = \"endobj\"\n\n$string3 = \"9 0 obj\"\n\n$string4 = \"endstream\"\n\n$string5 = \"startxref\"\n\n$string6 = \"12 0 obj\"\n\n$string7 = \"11 0 obj\"\n\n$string8 = { 25 50 44 46 2d 31 2e 37 0d }\n\n$string9 = { 65 6e 64 6f 62 6a 0d }\n\n$string10 = { 72 6f 75 70 }\n\n$string11 = { 74 2f 53 75 62 74 79 70 65 2f }\n\n$string12 = { 29 4a a5 28 91 62 }\n\n$string13 = { 99 73 d9 79 }\n\n\n-----\n\nco d t o\n\nall of them\n\n}\n\nrule onedrive_category_1\n\n{\n\nmeta:\n\nauthor = \"Ashkan Hosseini\"\n\ndate = \"2021-01-08\"\n\ndescription = \"one drive category 1 (blue background)\"\n\nhash0 = \"4ed8e629b4175427abc3d8a96589d4db\"\n\nhash1 = \"64d2e35e875fedaa7b206cfea2762910\"\n\nhash2 = \"098db1edac07219b1a1fc8732b0ff6e3\"\n\nhash3 = \"0cb9d12551b22109f51feaadbfa4d9a1\"\n\nhash4 = \"6467377125be7da67a94d8d608d2b927\"\n\nhash5 = \"90fe53f54331a34b91523d12c65fbffa\"\n\nsample_filetype = \"pdf\"\n\nstrings:\n\n$string0 = \"W5M0MpCehiHzreSzNTczkc9d\"\n\n$string1 = \"http://ns.adobe.com/pdf/1.3/\"\n\n$string2 = \"adobe:ns:meta/\"\n\n$string3 = \"18 0 obj\"\n\n$string4 = \"</x:xmpmeta>\"\n\n$string5 = \"14 0 obj\"\n\n$string6 = \"endstream\"\n\n$string7 = \"</rdf:Description>\"\n\n$string8 = \"http://ns.adobe.com/xap/1.0/mm/\"\n\n$string9 = \"<xmpMM:VersionID>1</xmpMM:VersionID>\"\n\n$string10 = \"<xmpMM:RenditionClass>default</xmpMM:RenditionClass>\"\n\n$string11 = \"xmlns:pdf\"\n\n$string12 = \"xpacket end\"\n\n$string13 = \"11 0 obj\"\n\n$string14 = \"http://ns.adobe.com/xap/1.0/\"\n\n$string15 = { 2f 52 65 73 6f 75 72 63 }\n\n$string16 = { 3e 3e 3e 3e 3e 0d 65 6e 64 6f 62 6a 0d 32 20 30 20 6f 62 6a 0d 3c 3c }\n\n$string17 = { 2f 50 20 31 20 30 20 52 2f 41 20 33 20 30 }\n\n$string18 = { 29 3e 3e 0d 65 6e 64 6f 62 6a 0d 34 20 30 20 6f 62 6a 0d 3c 3c 2f 53 }\n\n$string19 = { 3e 3e 0d 65 6e 64 6f 62 6a 0d 35 20 30 20 6f 62 6a 0d 3c 3c }\n\n\n-----\n\n$st g 0 { 39 0 30 0 5 }\n\n$string23 = { 31 20 30 20 6f 62 6a 0d 3c 3c 2f 54 79 70 65 2f 50 61 67 65 2f 50 61 72 65 6e 74 }\n\n$uri = { 2f 55 52 49 }\n\n$string24 = { 0d 25 e2 e3 cf d3 0d 0a 31 20 30 20 6f 62 6a 0d 3c }\n\ncondition:\n\nall of($string*) and #uri < 20\n\n}\n\nrule filesharing_pdf_scams\n\n{\n\nmeta:\n\nauthor = \"Ashkan Hosseini\"\n\ndate = \"2021-01-07\"\n\ndescription = \"File Sharing PDF Scams\"\n\nhash0 = \"170ac152d30f98ca01db808b1dd397d2\"\n\nhash1 = \"00d9aa947875f80b3a23e7af4267633e\"\n\nhash2 = \"b797c0905cd784c2d457ac516791a154\"\n\nhash3 = \"ae5ae57576f4c6ce94e096867011eb65\"\n\nsample_filetype = \"pdf\"\n\nstrings:\n\n$string0 = \"W5M0MpCehiHzreSzNTczkc9d\"\n\n$string1 = \"4 0 obj\"\n\n$string2 = \"1 0 obj\"\n\n$string3 = \"6 0 obj\"\n\n$string4 = \"0000000000 65535 f\"\n\n$string5 = \"xpacket end\"\n\n$string6 = \"</x:xmpmeta>\"\n\n$string7 = \"<rdf:RDF xmlns:rdf\"\n\n$string8 = \"<</Filter/FlateDecode/Length 50>>stream\"\n\n$string9 = \"startxref\"\n\n$string10 = \"<</Type/Page/Parent 6 0 R/Contents 5 0 R/MediaBox[0 0 734.88 593.76001]/CropBox[0 0 734.88 593.76001\"\n\n$string11 = \"%PDF-1.4\"\n\n$string12 = \"0000000016 00000 n\"\n\n$string13 = \"http://ns.adobe.com/xap/1.0/\"\n\n$string14 = \"xmlns:pdf\"\n\n$string15 = \"<x:xmpmeta xmlns:x\"\n\n$string16 = \"456789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz\"\n\ncondition:\n\n\n-----\n\n6 o t e\n\n}\n\nrule ecommerce_pdf_scams\n\n{\n\nmeta:\n\nauthor = \"Ashkan Hosseini\"\n\ndate = \"2021-01-07\"\n\ndescription = \"Ecommerce PDF Scams\"\n\nhash0 = \"e7357d268430b36636e4fa1255eabbb4\"\n\nhash1 = \"d08be5516ffec6f4580f366ad7961d96\"\n\nhash2 = \"0999539a9900a7657d0d6e5dbc2e4ae0\"\n\nhash3 = \"7912091795d4ff92abf99a0239856fe1\"\n\nhash4 = \"87fdc6dfff4094cfb43f4bbd58f833da\"\n\nhash5 = \"752979a99536edb032d094e36cf556e8\"\n\nsample_filetype = \"pdf\"\n\nstrings:\n\n$string0 = \"2 0 obj\"\n\n$string1 = \"stream\"\n\n$string2 = \"0000000103 00000 n\"\n\n$string3 = \"8 0 obj\"\n\n$string4 = \"<</AIS false /BM /Normal /CA 1 /Type /ExtGState /ca 1>>\"\n\n$string5 = \"3 0 obj\"\n\n$string6 = \"10 0 obj\"\n\n$string7 = \"0000000016 00000 n\"\n\n$string8 = \"5 0 obj\"\n\n$string9 = \"82<.342\"\n\n$string10 = \"456789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz\"\n\n$string11 = {72 53 70 61 63 65 20 2f 44 65 76 69 63 65 52 47 42 20 2f 46 69 6c 74 65 72 20 2f 44 43 54 44 65 63 6f 64 65 20 2f 48 65 69 67\n68 74 20}\n\n$string12 = {3d 38 32 3c 2e 33 34 32 ff db 00 43 01 09 09 09 0c 0b 0c 18 0d 0d 18 32 21 1c 21 32 32 32 32 32 32 32 32 32 32 32 32 32 32 32\n32 32 32 32 32 32 32}\n\n$string13 = {72 d1 0a 16 24 34 e1 25 f1 17 18 19 1a 26 27 28 29 2a 35 36 37 38 39 3a 43 44 45 46 47 48 49 4a 53 54 55 56 57 58 59 5a 63\n64 65 66 67 68 69 6a 73}\n\n$string14 = {27 29 20 2f 53 75 62 6a 65 63 74 20 28 29 20 2f 54 69 74 6c 65 20 28 29 20 2f 54 72 61 70 70 65 64 20}\n\n$string15 = {27 29 20 2f 50 72 6f 64 75 63 65 72 20 28 29 20 2f 53 6f 75 72 63 65 4d 6f 64 69 66 69 65 64 20 28 44 3a 32 30 32 30}\n\n$string16 = {72 20 28 57 50 53 20 57 72 69 74 65 72 29 20 2f 4b 65 79 77 6f 72 64 73 20 28 29 20 2f 4d 6f 64 44 61 74 65 20 28 44 3a 32 30\n32 30}\n\n$string17 = {28 29 20 2f 43 72 65 61 74 69 6f 6e 44 61 74 65 20 28 44 3a 32}\n\n$string18 = {3e 3e 0d 0a 73 74 72 65 61 6d 0d 0a ff d8 ff e0 00 10 4a 46 49 46}\n\n\n-----\n\n$st g 9 { 3 65 6 69 6 6 6 65 }\n\n$string20 = {2F 52 65 73 6F 75 72 63 65 73 20 3C 3C 2F 45 78 74 47 53 74 61 74 65 20 3C 3C 2F 47 53 39 20 39 20 30 20 52 3E 3E }\n\n$string21 = {41 20 31 31 20 30 20 52 20 2F 42 53 20 3C 3C 2F 57 20 30 3E 3E 20 2F 46 20 34 20 2F 50 20 36 20 30 20 52 20 2F 52 65 63 74\n20 5B }\n\n$intro = {31 20 30 20 6F 62 6A 0D 3C 3C 2F 4E 61 6D 65 73 20 3C 3C 2F 44 65 73 74 73 20 34 20 30 20 52 3E 3E 20 2F 4F 75 74 6C 69 6E\n65 73 20 35 20 30 20 52 20 2F 50 61 67 65 73 20 32 20 30 20 52 20 2F 54 79 70 65 20 2F 43 61 74 61 6C 6F 67 3E 3E 0D 65 6E 64 6F 62\n6A 0D}\n\n$bitspercomp = {42 69 74 73 50 65 72 43 6F 6D 70 6F 6E 65 6E 74 20 38 20 2F 43 6F 6C 6F 72 53 70 61 63 65 20 2F 44 65 76 69 63 65 52\n47 42 20 2F 46 69 6C 74 65 72 20 2F 44 43 54 44 65 63 6F 64 65 20 2F 48 65 69 67 68 74 }\n\ncondition:\n\nall of them\n\n}\n\nrule coupon_click_image\n\n{\n\nmeta:\n\nauthor = \"Ashkan Hosseini\"\n\ndate = \"2021-01-11\"\n\ndescription = \"coupon\"\n\nhash0 = \"4bbdc201e69e5983a6b949eb3424f244\"\n\nhash1 = \"e02f52639d47f838ad13201602cc7a10\"\n\nhash2 = \"7638afe039ad5f405a9ef72b6b6437d4\"\n\nhash3 = \"a4b13e23f175c7da6b9e54357793235c\"\n\nhash4 = \"b1583913ea7f231bba979de191251f58\"\n\nsample_filetype = \"pdf\"\n\nstrings:\n\n$string0 = \"/CMapType 2 def\"\n\n$string1 = \"17 0 obj\"\n\n$string2 = \"/ca 1.0\"\n\n$string3 = \"12 dict begin\"\n\n$string4 = \"CMapName currentdict /CMap defineresource pop\"\n\n$string5 = \"/Pattern <<\"\n\n$string6 = \"11 0 obj\"\n\n$string7 = \"/Resources 13 0 R\"\n\n$string8 = \"endstream\"\n\n$string9 = \"begincmap\"\n\n$string10 = \"startxref\"\n\n$string11 = \"/Border [0 0 0]\"\n\n$string12 = \"Qt 4.8.\" wide\n\n$string13 = \"/GSa 3 0 R\"\n\n\n-----\n\n$st g /Co o Space / e ce G\n\n$string15 = \"/ExtGState <<\"\n\n$string16 = \"12 0 obj\"\n\n$string17 = \"13 0 obj\"\n\n$intro = { 54 69 74 6C 65 20 28 FE FF 29 0A 2F 43 72 65 61 74 6F 72 20 28 FE FF }\n\n$colorpsace = { 43 6F 6C 6F 72 53 70 61 63 65 20 3C 3C 0A 2F 50 43 53 70 20 34 20 30 20 52 0A 2F 43 53 70 20 2F 44 65 76 69 63 65 52\n47 42 0A 2F 43 53 70 67 20 2F 44 65 76 69 63 65 47 72 61 79 0A 3E 3E 0A 2F 45 78 74 47 53 74 61 74 65 20 3C 3C 0A 2F 47 53 61 20 33\n20 30 20 52 0A 3E 3E 0A 2F 50 61 74 74 65 72 6E 20 3C 3C 0A 3E 3E 0A 2F }\n\n$cidsysteminfo = {2F 43 49 44 53 79 73 74 65 6D 49 6E 66 6F 20 3C 3C 20 2F 52 65 67 69 73 74 72 79 20 28 41 64 6F 62 65 29 20 2F 4F 72\n64 65 72 69 6E 67 20 28 49 64 65 6E 74 69 74 79 29}\n\n$parent_content = {2F 50 61 72 65 6E 74 20 32 20 30 20 52 0A 2F 43 6F 6E 74 65 6E 74 73 20 31 31 20 30 20 52 0A 2F 52 65 73 6F 75 72\n63 65 73 20 31 33 20 30 20 52 0A 2F 41 6E 6E 6F 74 73 20 31 34 20 30 20 52 0A 2F 4D 65 64 69 61 42 6F 78 20 5B}\n\n$encoding = {49 64 65 6E 74 69 74 79 2D 48 0A 2F 44 65 73 63 65 6E 64 61 6E 74 46 6F 6E 74 73 20 5B 31 37 20 30 20 52 5D 0A 2F 54 6F\n55 6E 69 63 6F 64 65 20 31 38 20 30 20 52}\n\n$pattern_device_rgb = {2F 50 61 74 74 65 72 6E 20 2F 44 65 76 69 63 65 52 47 42}\n\ncondition:\n\nall of them\n\n}\n\nrule playbutton\n\n{\n\nmeta:\n\nauthor = \"Ashkan Hosseini\"\n\ndate = \"2021-01-11\"\n\ndescription = \"pdf image with play button\"\n\nhash0 = \"58a83df51c3e6324f335760b8088bef4\"\n\nhash1 = \"2ab112c5b8993429a1d217fd9401d889\"\n\nhash2 = \"88dcb68d71eaac9a6f95bf8e0fe83df9\"\n\nhash3 = \"c8e3d34ea4efdefb337875fc1e0b681f\"\n\nhash4 = \"bcb13edd31d78e15b3d98ccbfc1c5d41\"\n\nsample_filetype = \"pdf\"\n\nstrings:\n\n$string0 = \"[ 8 0 R 9 0 R 10 0 R ]\"\n\n$string1 = \"/Contents 12 0 R\"\n\n$string2 = \"/Filter /DCTDecode\"\n\n$string3 = \"/Type /Annot\"\n\n$string4 = \"1 0 obj\"\n\n$string5 = \"/Size 16\"\n\n$string6 = \"/ProcSet [/PDF /Text /ImageB /ImageC]\"\n\n$string7 = \"/SA true\"\n\n\n-----\n\n$st g8 / a e t 0\n\n$string9 = \"/Border [0 0 0]\"\n\n$string10 = \"trailer\"\n\n$string11 = \"/Pages 2 0 R\"\n\n$string12 = \"/Type /Pages\"\n\n$string13 = \"/Pattern <<\"\n\n$string14 = \"/ExtGState <<\"\n\n$string15 = \"/ColorSpace /DeviceRGB\"\n\n$string16 = \"/S /URI\"\n\n$string17 = \"/XObject <<\"\n\n$string18 = { 73 68 61 62 5F 68 74 6D 6C }\n\n$string19 = { 41 6E 6E 6F 74 73 20 31 35 20 30 20 52 0A 2F 4D 65 64 69 61 42 6F 78 20 5B }\n\n$string20 = {33 20 30 20 6F 62 6A 0A 3C 3C 0A 2F 54 79 70 65\n\n20 2F 45 78 74 47 53 74 61 74 65 0A 2F 53 41 20 74 72 75 65 0A 2F 53 4D 20 30 2E 30 32 0A 2F 63 61 20 31 2E 30 0A 2F 43 41 20 31 2E\n30 0A 2F 41 49 53 20 66 61 6C 73 65 0A 2F 53 4D 61 73 6B 20 2F 4E 6F 6E 65 3E 3E 0A 65 6E 64 6F 62 6A 0A }\n\n$string21 = {0A 31 35 20 30 20 6F 62 6A 0A 5B 20 38 20 30 20 52 20 39 20 30 20 52 20 31 30 20 30 20 52 20 5D 0A 65 6E 64 6F 62 6A 0A }\n\ncondition:\n\nall of them\n\n}\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-05 - 2020 Phishing Trends With PDF Files.pdf"
    ],
    "report_names": [
        "2021-04-05 - 2020 Phishing Trends With PDF Files.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536076,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653691034,
    "ts_modification_date": 1653691034,
    "files": {
        "pdf": "https://archive.orkl.eu/b1a39bc6944d64c46639db826aa86aa4fd811933.pdf",
        "text": "https://archive.orkl.eu/b1a39bc6944d64c46639db826aa86aa4fd811933.txt",
        "img": "https://archive.orkl.eu/b1a39bc6944d64c46639db826aa86aa4fd811933.jpg"
    }
}