{
    "id": "1d8d748e-4096-4343-9a53-913ce71ea6a5",
    "created_at": "2024-01-17T02:04:50.523799Z",
    "updated_at": "2025-03-27T02:16:23.22571Z",
    "deleted_at": null,
    "sha1_hash": "0b57681534b8f5cb21ca7bc51e5658350c44c2bb",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T05:00:42Z",
    "file_modification_date": "2024-01-16T05:00:42Z",
    "file_size": 2840097,
    "plain_text": "# Agonizing Serpens (Aka Agrius) Targeting the Israeli Higher Education and Tech Sectors\n\n**[unit42.paloaltonetworks.com/agonizing-serpens-targets-israeli-tech-higher-ed-sectors](https://unit42.paloaltonetworks.com/agonizing-serpens-targets-israeli-tech-higher-ed-sectors/)**\n\nOr Chechik, Tom Fakterman, Daniel Frank, Assaf Dahan November 6, 2023\n\n[By Or Chechik, Tom Fakterman, Daniel Frank and Assaf Dahan](https://unit42.paloaltonetworks.com/author/or-chechik/)\n\nNovember 6, 2023 at 3:00 AM\n\n[Category: Endpoint](https://unit42.paloaltonetworks.com/category/endpoint/)\n\n[Tags: advanced persistent threat, Agonizing Serpens, Agrius, APT, Cortex XDR, Cortex](https://unit42.paloaltonetworks.com/tag/advanced-persistent-threat/)\n[XSIAM, Education](https://unit42.paloaltonetworks.com/tag/cortex-xsiam/)\n\n[This post is also available in: 日本語 (Japanese)](https://unit42.paloaltonetworks.jp/agonizing-serpens-targets-israeli-tech-higher-ed-sectors/)\n\n## Executive Summary\n\nUnit 42 researchers have investigated a series of destructive cyberattacks beginning in\nJanuary 2023 and continuing as recently as October 2023, targeting the education and\ntechnology sectors in Israel.\n\nThe attacks are characterized by attempts to steal sensitive data, such as personally\nidentifiable information (PII) and intellectual property. Once the attackers stole the\ninformation, they deployed various wipers intended to cover the attackers’ tracks and to\nrender the infected endpoints unusable.\n\n\n-----\n\nOur investigation revealed the perpetrators of the attacks have strong connections to an\n[Iranian-backed APT group Unit 42 tracks as Agonizing Serpens (aka Agrius,](https://apt.etda.or.th/cgi-bin/showcard.cgi?g=Agrius&n=1)\n[BlackShadow, Pink Sandstorm, DEV-0022).](https://www.bleepingcomputer.com/news/security/blackshadow-hackers-extort-israeli-insurance-company-for-1-million/)\n\nUnit 42 researchers were also able to identify novel new wipers and tools that Agonizing\nSerpens used in their most recent attacks:\n\nMultiLayer wiper\nPartialWasher wiper\nBFG Agonizer wiper\nSqlextractor - a custom tool to extract information from database servers\n\nBased on forensic evidence, it appears that the Agonizing Serpens APT group has\nrecently upgraded their capabilities and they are investing great efforts and resources to\nattempt to bypass endpoint detection and response (EDR) and other security measures.\nTo do so, they have been rotating between using different known proof of concept (PoC)\nand pentesting tools as well as custom tools.\n\nFor the attacks described below, the attacker was unsuccessful at bypassing Cortex\nXDR. Cortex XDR and XSIAM detect and prevent the execution flow described. They also\nbuild behavioral profiles of user activity over time with machine learning, allowing them to\ndetect anomalous activity indicative of, for example, credential-based attacks.\n\nWe are sharing this research to provide detection, prevention and hunting\nrecommendations to help organizations protect against the threats associated with\nAgonizing Serpens.\n\n**Related Unit 42 Topics** **[APT, Education](https://unit42.paloaltonetworks.com/tag/APT/)**\n\n## Table of Contents\n\nWho Is the Agonizing Serpens APT Group?\nTechnical Analysis\nEntry Vector\nReconnaissance\nCredential Stealing\nLateral Movement\nStealing and Exfiltrating Data\nWiper Payloads\nPartialWasher Wiper\nBFG Agonizer Wiper\nAttempted Anti-EDR Activity\nAttribution\nConclusion\nProtections and Mitigations\n\n\n-----\n\nIndicators of Compromise\nAppendix\nAdditional References\n\n## Who Is the Agonizing Serpens APT Group?\n\nAgonizing Serpens (aka Agrius) is an Iranian-linked APT group that has been active since\n2020. The group is known for its destructive wiper and fake-ransomware attacks and\nmainly targets Israeli organizations across multiple industries and countries.\n\nThough earlier reports of these attacks mentioned ransomware and ransom notes, these\n[turned out to be a ruse (a trend noted in the 2023 Unit 42 Ransomware and Extortion](https://start.paloaltonetworks.com/2023-unit42-ransomware-extortion-report)\n[Report). In the most recent attacks, the attackers did not request ransom – rather, the](https://start.paloaltonetworks.com/2023-unit42-ransomware-extortion-report)\npotential result of the attacks was vast data loss and disruptions of business continuity.\n\nAttacks from Agonizing Serpens usually have two main goals, the first being stealing\nsensitive information that includes PII and intellectual property, which threat actors then\npublish on social media or Telegram channels. It seems likely that their motivation to\npublish on social media is to sow fear or inflict reputational damage. The second goal is\nwreaking havoc and inflicting considerable damage by wiping as many endpoints as\npossible.\n\nSince its emergence, the group has developed new custom tools and they have also\nleveraged known hacking tools and techniques to carry out their aggressive operations.\n\n## Technical Analysis\n\nThe following sections detail the different stages of a recent incident carried out by\nAgonizing Serpens in October 2023, as analyzed by Unit 42 researchers.\n\n### Entry Vector\n\nThe attackers gained initial access to the environment by exploiting vulnerable internet\nfacing web servers. Subsequently, they deployed multiple web shells, which granted them\na foothold in the network.\n\nThe web shells that threat actors used in the described attack (shown in Figure 1) contain\n[the same code as web shells that were observed in previous Agonizing Serpens attacks,](https://assets.sentinelone.com/sentinellabs/evol-agrius)\nwith variations to the naming of functions. The web shells appear to be variations of\nASPXSpy.\n\n\n-----\n\nFigure 1. Snippet from xcopy.aspx web shell.\n\nAnother web shell used in this attack was named Uploader.aspx. Figure 2 shows almost\nidentical code found in two web shells used by Agonizing Serpens, one from a recent\nattack and the other from a past attack.\n\nFigure 2. Top: snippet from Uploader.aspx, Bottom: Snippet from a web shell used in an Agonizing\n\nSerpens attack in the past against an Israeli company.\n\nFigure 3 shows how, shortly after the attackers deployed the web shells, they started to\nexecute basic reconnaissance commands via the web shells.\n\n\n-----\n\nFigure 3. Basic reconnaissance commands via the web shells shown in Cortex XDR.\n\n### Reconnaissance\n\nTo map out the network, the attackers used various known and publicly available\nscanners.\n\n**Nbtscan**\n\n[The attackers used Nbtscan, renamed as systems.txt, to scan the network for existing](https://attack.mitre.org/software/S0590/)\nhosts (shown in Figure 4).\n\nFigure 4. Nbtscan used to scan the network.\n\n**WinEggDrop**\n\nFigure 5 shows how the attackers used an open-source SYN/TCP port scanner by\n[WinEggDrop to scan particular hosts of interest.](https://github.com/kingron/s)\n\n\n-----\n\nFigure 5. WinEggdDrop scanner used for port scanning.\n\n**NimScan**\n\n[NimScan is another publicly available port scanner that the attackers used in the attack,](https://github.com/elddy/NimScan)\nas shown in Figure 6.\n\nFigure 6. NimScan being used for port scanning.\n\n### Credential Stealing\n\nA crucial phase of the attack consisted of obtaining credentials of users with\nadministrative privileges. To do so, the attackers tried multiple methods to obtain\ncredentials, which were prevented by the Cortex XDR platform:\n\nMimikatz (filename: Mimi.exe)\nSMB password spraying\nSMB password brute force (shown in Figure 7)\n\n\n-----\n\nFigure 7. Password brute forcing using SMB.\n\nDumping the SAM file (shown in Figure 8)\n\nFigure 8. Dumping the SAM file.\n\n### Lateral Movement\n\n[Figure 9 shows that to move laterally in the environment, the attackers mostly used Plink](https://manpages.ubuntu.com/manpages/trusty/man1/plink.1.html)\n(renamed as systems.exe) to create remote tunneling and establish connections to\nremote machines.\n\n\n-----\n\nFigure 9. Plink used to establish remote tunneling.\n\n### Stealing and Exfiltrating Data\n\nAttackers attempted to steal information from databases and other critical servers before\nexecuting wipers to cover their tracks. They then tried to exfiltrate this information to the\nattackers’ C2 servers, using different publicly available tools such as WinSCP and Putty.\n\n**Extracting Database Information Using Sqlextractor**\n\nThe attackers used a custom tool they named sqlextractor (binary name sql.net4.exe). Its\npurpose is to query SQL databases and extract sensitive PII data, such as the following:\n\nID numbers\nPassport scans\nEmails\nFull addresses\n\nThe data was saved into CSV files as shown in Figures 10 and 11. The tool writes the\ndata to a hard-coded staging path: C:\\windows\\temp\\s\\.\n\nFigure 10 shows the attackers then used 7za.exe to archive the extracted data in\npreparation for exfiltration.\n\n\n-----\n\nFigure 10. Sqlextractor and 7za.exe used to extract files and archive them.\n\nFigure 11. Sqlextractor writes extracted data to CSV files.\n\nFigure 12 shows the attackers also used 7zG.exe to archive interesting folders in the\ninfected environment.\n\nFigure 12. 7zG.exe used to archive various folders.\n\n**Data Exfiltration Using WinSCP**\n\nThe attackers attempted to use WinSCP to exfiltrate files from the environment, as shown\nin Figures 13 and 14.\n\n\n-----\n\nFigure 13. WinSCP being used to exfiltrate files.\n\nFigure 14. Exfiltration alerts by Cortex XDR.\n\n**Data Exfiltration Using Pscp.exe (PuTTY Secure Copy Protocol)**\n\nFigure 15 shows that another tool the attackers used for exfiltration is pscp.exe (PuTTY\nSecure Copy Protocol).\n\nThe attackers attempted to establish a connection to the C2, then searched for .7z and\n.ezip files that contain stolen data, as well as .dmp files created by ProcDump.\n\nFigure 15. pscp.exe used for exfiltration.\n\n### Wiper Payloads\n\nDuring the incident, the attackers attempted to use three separate wipers as part of the\ndestructive attack. While some of the wipers show code similarities to previously reported\nwipers the Agonizing Serpens group used, others are considered brand new. These have\nbeen used for the first time in this attack, as detailed in the following section.\n\n**MultiLayer Wiper**\n\nThe first wiper that the attackers used is .NET malware called MultiLayer. As its name\nsuggests, this wiper contains multiple layers and stages.\n\nIts compilation date is Oct. 14, 2093. As this is set to a future date, it is a clear sign of\nmetadata manipulation.\n\n\n-----\n\nFigure 16 shows that it contains two more binaries in its resources section, named\nMultiList and MultiWip.\n\nFigure 16. MultiLayer resources.\n\nMultiLayer drops and executes each of the aforementioned binaries, then deletes them\nright after their execution.\n\nThe MultiList Component - Setting the Target Files\n\nMultiList generates a list of all the files and their paths on the fixed drives on the system.\nIt does this by enumerating all files on the infected operating system while excluding\nspecific folders defined in a predefined list (shown in Figure 17). The attackers can define\nthe path to which this tool should store the list via the command line.\n\nFigure 17. MultiList exclusion functionality.\n\nMultiWip - the Core Wiper Component\n\nThe MultiWip component contains the actual file wiping functionality. It relies on the\nprevious component (MultiList) and reads the output list of files to wipe, which is passed\nas a command-line argument.\n\nMultiWip’s main function is called DoJob() and is responsible for carrying out the filewiping activity in the manner shown in Figure 18.\n\n\n-----\n\nFigure 18. Snippet from MultiWip’s main DoJob() function.\n\nThe malware takes the following steps in the order indicated:\n\n1. Files located on network drives are deleted immediately.\n2. Locally stored files are corrupted and overwritten with random data to thwart file\n\nrecovery efforts, as shown in Figure 19.\n\n\n-----\n\nFigure 19. Snippet of MultiWip File data destruction function.\n\n[3. The malware changes the original timestamps in the following FileSystemInfo](https://learn.microsoft.com/en-us/dotnet/api/system.io.filesysteminfo?view=net-7.0)\n\n[properties: LastAccessTime, LastWriteTime and CreationTime. This is a well-known](https://learn.microsoft.com/en-us/dotnet/api/system.io.filesysteminfo.lastaccesstime?view=net-7.0)\n[anti-forensic timestomping technique. The malware timestomps according to the file](https://attack.mitre.org/techniques/T1070/006/)\nsystem. If the file system is NTFS, the malware sets the timestamp to 1601.1.1. Any\nother file system, the malware sets it to 1980.1.1 (shown in Figure 20).\n\nFigure 20. MultiWip timestomp function.\n\n4. The malware changes the original paths of the deleted files, using\n\n[Path.GetRandomFileName, to make any recovery efforts extremely hard.](https://learn.microsoft.com/en-us/dotnet/api/system.io.path.getrandomfilename?view=net-7.0)\n5. Finally, the malware deletes the files.\n\nCovering Tracks and Rendering the System Unusable\n\nMultiLayer is designed to cover its tracks by erasing evidence of its execution. It does so\nby running various commands to prevent restoration of lost data and to render the disk\nunusable.\n\n\n-----\n\nFigure 21 shows that MultiLayer uses the DeleteLogs() function to create a scheduled\ntask that launches a batch script only once. The script then removes all the Windows\nEvent Logs.\n\nFigure 21. MultiLayer scheduled task to delete events logs.\n\nTo remain stealthy, MultiLayer removes all the files it uses after its execution, including\nitself. To remove itself, MultiLayer uses SelfDelete().\n\nThe removal is implemented by threat actors writing a batch file named remover.bat to\n%TEMP% and executing it. The batch file deletes the assembly file and the batch itself,\nand then it clears the file system cache memory, leveraging the ProcessIdleTasks export\nin advapi32.dll.\n\nTo further prevent data restoration, MultiLayer tries to remove all shadow copies on the\nsystem as shown in Figure 22, and then remove the Volume Shadow Copy (VSS) service\nitself.\n\nFigure 22. MultiLayer deletion of the shadow copies.\n\nFigure 23 shows that, to ensure that the system can no longer boot, MultiLayer opens a\nhandle to \\\\\\\\.\\\\PhysicalDrive0 and wipes the first 512 bytes (aka the boot sector).\n\nFigure 23. MultiLayer wiping the boot sector.\n\n\n-----\n\nFinally, after the boot sector is corrupted, MultiLayer adjusts its privileges to\n[SeShutdownPrivilege and calls the Windows API ExitWindowsEx with the](https://learn.microsoft.com/en-us/windows/win32/api/winuser/nf-winuser-exitwindowsex)\nEWX_REBOOT flag, which indicates system reboot. Once the system reboots, it will not\nbe able to boot again.\n\nThe attempt to execute MultiLayer was prevented by Cortex XDR, as depicted in Figure\n24 below.\n\nFigure 24. Blocked execution of the MultiLayer wiper by Cortex XDR platform.\n\nSimilarities to Apostle, IPsec Helper, and Fantasy\n\nThroughout our analysis of MultiLayer, we noticed multiple code overlaps with Apostle,\nIPsec Helper and Fantasy. These are custom tools previously used by Agonizing\nSerpens. This might be the result of a shared codebase or being written by the same\nteam of developers. When comparing the code of the aforementioned tools, it appears\nthat MultiLayer shares naming conventions and even entire code blocks with them.\n\n**Example 1: Self-Deletion Mechanism**\n[The self-deletion mechanism of MultiLayer is implemented in a similar manner to IPsec](https://assets.sentinelone.com/sentinellabs/evol-agrius)\n[Helper, Apostle and Fantasy. They share the same name for the function, named](https://assets.sentinelone.com/sentinellabs/evol-agrius)\nSelfDelete(). They also delete themselves by writing a batch file named remover.bat to\n%TEMP% and executing it, using the above mentioned functions shown in Figures 25\nand 26.\n\n\n-----\n\nFigure 25. MultiLayer’s SelfDelete() function.\n\n\n-----\n\nFigure 26. Code snippet of the IPsec Helper. Source: Figure 20 of SentinalLABS report\n\n[From Wiper to Ransomware: The Evolution of Agrius.](https://assets.sentinelone.com/sentinellabs/evol-agrius)\n\n**Example 2: Directory Listing Implementation**\n\nThe recursive directory listing mechanism of MultiList is implemented in a similar manner\nto Fantasy and Apostle. They share the same name for the function, named\nGetSubDirectoryFileListRecusrive.\n\nThey also both call GetSubDirectoryFileListRecusrive() and GetDirectoryFileList(), where\nGetSubDirectoryFileListRecusrive() is called recursively as shown in the code snippets in\nFigures 27 and 28.\n\n\n-----\n\nFigure 27. Recursive directory listing in MultiList.\n\n[Figure 28. Recursive directory listing in Fantasy. Source: Figure 6 in ESET blog \"Fantasy – a new](https://www.eset.com/hk/about/newsroom/press-releases/news/fantasy-a-new-agrius-wiper-deployed-through-a-supply-chain-attack0/)\n\nAgrius wiper deployed through a supply‑chain attack.\"\n\n**PartialWasher Wiper**\n\nDuring the attack, the attackers attempted to use a second wiper, which they call\nPartialWasher or PW. Figure 29 shows that it was compiled on Oct. 8 and, unlike other\n.NET wipers mentioned in this article, it is written in C++.\n\nFigure 29. The compilation timestamp of PartialWasher.\n\n\n-----\n\n[PartialWasher defines itself as a crucial process by calling NtSetInformationProcess, and](https://learn.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-setprocessinformation)\nit supports command-line arguments. In case no arguments are provided, the default\nfunctionality would be a wiper functionality.\n\nWhen passing 1 as an argument, the attacker can then use an interactive command-line\ninterface (CLI). There are several typos in the interface’s text, indicating that the authors\nare likely not native English speakers.\n\nFigure 30 shows an example of the passed arguments S /p. They trigger the malware to\ngather information about available drives on the infected machine.\n\nFigure 30. PartialWasher’s CLI and typos marked in red squares.\n\nThe supported commands demonstrate the wiper’s further capabilities to perform\nindividual wiping tasks at the request of its operators. These commands include:\n\nS - Scan drives and retrieve information about them, depending on the provided\nsecondary argument\n\n/a - Get all drive information and partition details\n/p - Get only drive information\n/v - Get only partition details\nD - Write around 420 MB of binary data to a provided device number, most likely to\nmake a drive unusable\nF - Wipe files in a specified folder and its subfolders if the files are not empty\nI - Wipe a specified file if it is not empty\nW - Change file attributes and wipe files\n\nThe attempt to execute PartialWiper was prevented by Cortex XDR, as depicted in Figure\n31 below.\n\n\n-----\n\nFigure 31. PartialWasher detected and prevented by Cortex XDR.\n\n**BFG Agonizer Wiper**\n\nThe BFG Agonizer\n\nA third wiper that the attackers used is called BFG Agonizer (bfg.exe), according to its\nPDB path (E:\\tools2\\BFG agonizer\\INFECTOR\\Dropper\\Dropper\\Release\\Dropper.pdb).\nThe file metadata indicates that it was compiled on Oct. 8, as shown in Figure 32.\n\nFigure 32. BGF Agonizer’s compilation timestamp.\n\nIt is worth noting that there are many code similarities between BFG Agonizer and an\nopen-source project called CRYLINE-v5.0, hosted on GitHub. We assess that BFG’s\nauthors copied, or at the very least, relied heavily on this publicly available code.\n\nBefore the wiper commences its wiping activity, it first attempts to circumvent security\nmeasures that might exist on the infected endpoint. It does so by implementing several\nanti-hooking techniques, which have not been reported thus far as part of the group's\nknown techniques. This suggests a possible upgrade of their capabilities.\n\nThe following sections list the anti-hooking functions BFG runs before its main payload.\n\nDLL Unhooking\n\n[DLL unhooking is an anti-hooking technique that attempts to remove the user mode inline](https://www.malwaretech.com/2015/01/inline-hooking-for-programmers-part-1.html)\n[hooks, which various security solutions often implement. The technique works by](https://www.malwaretech.com/2015/01/inline-hooking-for-programmers-part-1.html)\nrestoring the bytes of the hooked functions to their original disk values. This technique is\n[well known, and it is likely that the wipers’ authors largely adopted the following publicly](https://www.ired.team/offensive-security/defense-evasion/how-to-unhook-a-dll-using-c++)\n[available code.](https://www.ired.team/offensive-security/defense-evasion/how-to-unhook-a-dll-using-c++)\n\n\n-----\n\nImport Address Table (IAT) Unhooking\n\n[IAT unhooking is an anti-hooking technique that attempts to remove the user-mode IAT](https://www.ired.team/offensive-security/code-injection-process-injection/import-adress-table-iat-hooking)\n[hooks, which various security solutions often implement. Based on the wiper’s code, it is](https://www.ired.team/offensive-security/code-injection-process-injection/import-adress-table-iat-hooking)\n[likely that the authors largely adopted publicly available IAT unhooking code snippets.](https://alice.climent-pommeret.red/posts/how-and-why-to-unhook-the-import-address-table/)\n\nWiping the Boot Sector\n\nTo wipe the boot sector, the wiper retrieves a device handle to \\\\.\\PhysicalDrive0 as\nshown in Figure 33. In turn, it calls DeviceIoControl with the\n[IOCTL_DISK_GET_PARTITION_INFO control code to find the partition style.](https://learn.microsoft.com/en-us/windows/win32/api/winioctl/ni-winioctl-ioctl_disk_get_partition_info)\n\nFigure 33. BFG retrieves a device handle to \\\\.\\PhysicalDrive0.\n\n[If the partition style is master boot record (MBR) or GUID partition table (GPT) it infects](https://www.howtogeek.com/193669/whats-the-difference-between-gpt-and-mbr-when-partitioning-a-drive/)\nthe first 6 sectors as shown in Figure 34.\n\nFigure 34. BFG overwrites the boot sector.\n\n\n-----\n\nFinally, after the sectors are infected, the wiper adjusts its privileges to have the\n[SeShutdownPrivilege and calls the native API NtRaiseHardError, which triggers a blue](https://undocumented.ntinternals.net/index.html?page=UserMode%2FUndocumented%20Functions%2FError%2FNtRaiseHardError.html)\n[screen of death (BSOD) in the system with the error code of 0xC0000420. Once the](https://en.wikipedia.org/wiki/Blue_screen_of_death)\nsystem crashes, it will not be able to boot again (shown in Figure 35).\n\nFigure 35. BFG causing a BSOD on the system after corrupting the\n\nboot sector.\n\nThe attempt to execute BFG Agonizer wiper was prevented by Cortex XDR, as depicted\nin Figure 36 below.\n\nFigure 36. Execution of BFG Agonizer wiper blocked by the Cortex XDR\n\nplatform.\n\n## Attempted Anti-EDR Activity\n\nDuring the attack, the group specifically attempted to bypass EDR solutions to carry out\ntheir attack uninterrupted and with greater stealth. These attempts were blocked by the\nCortex XDR platform. It is interesting to note that the group tried multiple tools and\ntechniques, and each time they failed with one, they tried to leverage another.\n\nWhile most of the techniques are known and well-documented, the group has not used\nthem in previous publicly reported attacks. This could suggest that the group is becoming\nincreasingly advanced and aggressive in its approach.\n\nThe following sections list some of the EDR bypass tools and techniques in the order they\nleveraged them.\n\n### EDR Service Dependency Bypass\n\nThe threat actor attempted their first EDR bypass technique on Oct. 6. The actor tried to\nmanipulate the Cortex XDR service auto-start functionally. By leveraging previously\nobtained Administrator privileges, the attackers tried to modify the services Cortex XDR\ndepends on, so it would not be able to auto-start upon system startup.\n\nFigure 37 shows these attempts were prevented, and then the attackers shifted into using\n[custom tools that abuse the “bring your own vulnerable driver” (BYOVD) technique.](https://cybernews.com/security/bring-your-own-vulnerable-driver-attack/)\n\n\n-----\n\nFigure 37. Cortex XDR prevents service registry manipulation.\n\n### DrvIX: A Custom BYOVD Loader\n\nThe first custom tool the attackers used was a binary named agmt.exe, which was\ncompiled on Oct. 7. According to its PDB path\n(C:\\Users\\dude\\source\\repos\\drvix\\x64\\Release\\drvix.pdb), it appears that this tool’s\noriginal name is drvIX (shown in Figure 38).\n\nFigure 38. agmt.exe PDB path and compilation date.\n\nHowever, according to the binary help function shown in Figure 39, the name is Drvtopia.\n\nFigure 39. DrvIX help section mentions Drvtopia.\n\n[Agmt.exe is a custom loader and operator for the GMER driver, gmer64.sys (renamed to](https://www.gmer.net/)\nAGMT.sys). GMER’s original intended purpose is to detect and remove rootkits; however,\nthreat actors can also leverage it to remove security products. Using agmt.exe, the\nattackers can specify the PID of the target process they wish to terminate via the\ncommand line.\n\nAgmt.exe starts by registering GMER a new kernel driver (agmt.sys) as a service named\nAGMT and starting it, which in turn causes the operating system to load the driver into the\nkernel.\n\nTo communicate and abuse the GMER functionality of terminating processes, agmt.exe\nretrieves a device handle to GMER’s device object as shown in Figure 40.\n\nFigure 40. Agmt.exe opens a handle to the GMER device object.\n\n\n-----\n\n[Then, agmt.exe uses DeviceIoControl Windows API with the control code 0x9876C094,](https://learn.microsoft.com/en-us/windows/win32/api/ioapiset/nf-ioapiset-deviceiocontrol)\nwhile specifying the PID in the Input_Buffer parameter of the call (shown in Figure 41).\n\nFigure 41. Agmt.exe communicates with the GMER driver for terminating processes.\n\n[DeviceIoControl allows user mode processes to directly communicate with kernel drivers,](https://learn.microsoft.com/en-us/windows/win32/devio/calling-deviceiocontrol)\nallowing the processes to request the drivers to service certain operations for them.\n\nIn the case of agmt.exe, the DeviceIoControl API call triggers a process termination\noperation for the GMER driver. Figure 44 shows that by inspecting the GMER driver, we\ncan determine that the functionality of the 0x9876C094 control code is to terminate the\ntarget process provided by PID.\n\nFigure 42. GMER 0x9876C094 control code\n\nfunctionally.\n\n[The function opens a handle to the target process PID using ZwOpenProcess and then](https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/nf-ntddk-zwopenprocess)\n[terminates it by calling ZwTerminateProcess.](https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/nf-ntddk-zwterminateprocess)\n\nThe attempt to leverage the GMER driver failed, as shown in Figure 43 below.\n\nFigure 43. Loading of the GMER driver being blocked by the Cortex XDR Platform.\n\n### Second Vulnerable Driver Attempt (Rentdrv2 Driver)\n\nAs the attempt to exploit the GMER driver failed, the attackers tried arming their drvIX\ntool. They did so using a different vulnerable driver from a new publicly available PoC tool\n[called BadRentdrv2, first published in the beginning of October 2023.](https://github.com/keowu/BadRentdrv2/tree/main)\n\nThe attacker used the same project and compiled a modified version of the tool a day\nlater, on Oct. 8 as shown in Figure 44. This time, the binary’s original name drvIX.exe was\nnot changed.\n\nFigure 44. PDB path and compilation for drvIX.exe.\n\nThe loading code of the driver looks almost identical to the aforementioned drvIX version.\nSimilarly, drvIX.exe accepts the PID of the target process the attacker wishes to terminate\nvia the command line.\n\nDrvIX retrieves a device handle to its device object and communicates with the Rentdrv2\ndriver via DeviceIoControl. DrvIX then sends the target PID by specifying it in a structure\nsent as the Input_Buffer and specifies the control code as 0x22E010 (shown in Figure\n45).\n\nFigure 45. DrvIX communicates with Rentdrv2.\n\n\n-----\n\nSimilarly to the GMER driver, the 0x220E010 control code terminates the target process\nprovided by its PID, as shown in Figure 46.\n\nFigure 46. Rentdrv2 0x22E010 control code\n\nfunctionality.\n\n[The function opens a handle to the target process PID using ZwOpenProcess and](https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/nf-ntddk-zwopenprocess)\n[terminates it by calling ZwTerminateProcess.](https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/nf-ntddk-zwterminateprocess)\n\nFigure 47 shows this attempt was blocked and prevented by the Cortex XDR platform.\n\nFigure 47. Prevention of an attempt to terminate the Cortex XDR service.\n\n## Attribution\n\nBased on the Unit 42 attribution model, we assess with a high level of confidence that the\nattacks described in this article were carried out by the Iranian-linked Agonizing Serpens\nAPT group.\n\nThis assessment is based on the following reasons and evidence:\n\n**Multiple code similarities in wipers: The analysis of the MultiLayer wiper in this**\narticle shows multiple code similarities and similar naming convention to previously\n[documented Agonizing Serpens wipers known as Apostle, its successor Fantasy,](https://www.sentinelone.com/labs/new-version-of-apostle-ransomware-reemerges-in-targeted-attack-on-higher-education/)\nand the IPsec Helper backdoor.\n**Code similarity in web shells: The attackers used web shells variants that**\nconsisted of the same code, except for variable and function names that are\nreplaced for each sample.\n**Destructive nature of the attacks: The final step of the attacks implements a**\n“scorched earth” policy, using custom wipers to render the endpoints unusable and\ncover the tracks of the attackers. This is congruent with all previous reports about\nthe group’s activity.\n**Targeting Israeli organizations: Our telemetry did not detect non-Israeli**\norganizations affected by the attacks. This APT group seems to specifically target\nIsraeli entities.\n\n## Conclusion\n\nIn this article we provided a deep dive analysis of a recent destructive wiper attack carried\nout by the Iranian-linked Agonizing Serpens APT group. This attack is a part of a broader\noffensive campaign that targets Israeli organizations. Based on our telemetry, the most\ntargeted organizations belong to the education and technology sectors.\n\nOur investigation uncovered new tools in the group’s arsenal that include a set of three\npreviously undocumented wipers, as well as a database extractor tool. Analysis of the\nnew wipers revealed that the group has upgraded their capabilities, putting an emphasis\n\n\n-----\n\non stealth and evasive techniques designed to bypass security solutions such as EDR\ntechnology.\n\nAs shown throughout our research, the Cortex XDR platform can detect and prevent the\nvarious stages of the attack lifecycle.\n\n## Protections and Mitigations\n\nPalo Alto Networks customers receive protection from the different tools that were\nobserved during the recent Agonizing Serpens campaign. The Cortex XDR and XSIAM\nplatforms detect and prevent the execution flow described in the screenshots included in\nthe previous section.\n\nFor Palo Alto Networks customers, our products and services provide the following\ncoverage associated with this group.\n\n[Cortex XDR and XSIAM detect user and credential-based threats by analyzing user](https://www.paloaltonetworks.com/cortex/cortex-xdr?_gl=1*13pmp8e*_ga*NzQyNjM2NzkuMTY2NjY3OTczNw..*_ga_KS2MELEEFC*MTY2OTczNjA2MS4zMS4wLjE2Njk3MzYwNjEuNjAuMC4w)\nactivity from multiple data sources including the following:\n\nEndpoints\nNetwork firewalls\nActive Directory\nIdentity and access management solutions\nCloud workloads\n\nCortex XDR and XSIAM build behavioral profiles of user activity over time with machine\nlearning. By comparing new activity to past activity, peer activity and the expected\nbehavior of the entity, Cortex XDR and XSIAM detect anomalous activity indicative of\ncredential-based attacks.\n\nThey also offer the following protections related to the attacks discussed in this post:\n\nPrevent the execution of known malicious malware and also prevents the execution\n[of unknown malware using Behavioral Threat Protection and machine learning](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention?_gl=1*13pmp8e*_ga*NzQyNjM2NzkuMTY2NjY3OTczNw..*_ga_KS2MELEEFC*MTY2OTczNjA2MS4zMS4wLjE2Njk3MzYwNjEuNjAuMC4w)\nbased on the Local Analysis module\nProtect against credential gathering tools and techniques using the new Credential\nGathering Protection available from Cortex XDR 3.4\nProtect against exploitation of different vulnerabilities including ProxyShell and\nProxyLogon using the Anti-Exploitation modules as well as Behavioral Threat\nProtection\n\nCortex XDR Pro detects post-exploitation activity, including credential-based attacks, with\n[behavioral analytics.](https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-analytics-alert-reference/cortex-xdr-analytics-alert-reference/analytics-alerts-by-required-data-source)\n\nIf you think you might have been impacted or have an urgent matter, get in touch with the\n[Unit 42 Incident Response team or call:](https://start.paloaltonetworks.com/contact-unit42.html?_gl=1*13pmp8e*_ga*NzQyNjM2NzkuMTY2NjY3OTczNw..*_ga_KS2MELEEFC*MTY2OTczNjA2MS4zMS4wLjE2Njk3MzYwNjEuNjAuMC4w)\n\n\n-----\n\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\n\nPalo Alto Networks has shared these findings with our fellow Cyber Threat Alliance (CTA)\nmembers. CTA members use this intelligence to rapidly deploy protections to their\ncustomers and to systematically disrupt malicious cyber actors. Learn more about the\n[Cyber Threat Alliance.](https://www.cyberthreatalliance.org/)\n\n## Indicators of Compromise\n\nWeb shells\n\n1ea4d26a31dad637d697f9fb70b6ed4d75a13d101e02e02bc00200b42353985c\n62e36675ed7267536bd980c07570829fe61136e53de3336eebadeca56ab060c2\nabfde7c29a4a703daa2b8ad2637819147de3a890fdd12da8279de51a3cc0d96d\n\nNbtscan\n\n63d51bc3e5cf4068ff04bd3d665c101a003f1d6f52de7366f5a2d9ef5cc041a7\n\nWinEggDrop\n\n49c3df62c4b62ce8960558daea4a8cf41b11c8f445e218cd257970cf939a3c25\n\nNimScan\n\ndacdb4976fd75ab2fd7bb22f1b2f9d986f5d92c29555ce2b165c020e2816a200\ne43d66b7a4fa09a0714c573fbe4996770d9d85e31912480e73344124017098f9\n\nMimikatz\n\n2a6e3b6e42be2f55f7ab9db9d5790b0cc3f52bee9a1272fc4d79c7c0a3b6abda\n\nProcDump\n\n5d1660a53aaf824739d82f703ed580004980d377bdc2834f1041d512e4305d07\nf4c8369e4de1f12cc5a71eb5586b38fc78a9d8db2b189b8c25ef17a572d4d6b7\n\nPlink\n\n13d8d4f4fa483111e4372a6925d24e28f3be082a2ea8f44304384982bd692ec9\n\nSqlextractor\n\na8e63550b56178ae5198c9cc5b704a8be4c8505fea887792b6d911e488592a7c\n\nPscp.exe\n\n\n-----\n\na112e78e4f8b99b1ceddae44f34692be20ef971944b98e2def995c87d5ae89ee\n\nMultiLayer wiper\n\n38e406b17715b1b52ed8d8e4defdb5b79a4ddea9a3381a9f2276b00449ec8835\nf65880ef9fec17da4142850e5e7d40ebfc58671f5d66395809977dd5027a6a3e\n\nPartialWasher Wiper\n\nec7dc5bfadce28b8a8944fb267642c6f713e5b19a9983d7c6f011ebe0f663097\n\nBFG Agonizer Wiper\n\nc52525cd7d05bddb3ee17eb1ad6b5d6670254252b28b18a1451f604dfff932a4\n\nGMER Driver Loader - agmt.exe\n\n8967c83411cd96b514252df092d8d3eda3f7f2c01b3eef1394901e27465ff981\na2d8704b5073cdc059e746d2016afbaecf8546daad3dbfe4833cd3d41ab63898\n\nGMER Driver\n\n18c909a2b8c5e16821d6ef908f56881aa0ecceeaccb5fa1e54995935fcfd12f7\n\nRentdrv2 Loader - drvIX.exe\n\n2fb88793f8571209c2fcf1be528ca1d59e7ac62e81e73ebb5a0d77b9d5a09cb8\n\nRentdrv2 Driver\n\n9165d4f3036919a96b86d24b64d75d692802c7513f2b3054b20be40c212240a5\n\nInfrastructure\n\n185.105.46[.]34\n185.105.46[.]19\n93.188.207[.]110\n109.237.107[.]212\n217.29.62[.]166\n81.177.22[.]182\n\n## Appendix\n\n**Filename** **SHA256**\n\nUploader.aspx 1ea4d26a31dad637d697f9fb70b6ed4d75a13d101e02e02bc00200b4235\n\nxcopy.aspx 62e36675ed7267536bd980c07570829fe61136e53de3336eebadeca56a\n\n\n-----\n\ncss.aspx abfde7c29a4a703daa2b8ad2637819147de3a890fdd12da8279de51a3cc\n\n_Table 1. Web shell hash._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.11.06.Agrius_Israeli/Agonizing%20Serpens%20%28Aka%20Agrius%29%20Targeting%20the%20Israeli%20Higher%20Education%20and%20Tech%20Sectors.pdf"
    ],
    "report_names": [
        "Agonizing Serpens (Aka Agrius) Targeting the Israeli Higher Education and Tech Sectors"
    ],
    "threat_actors": [
        {
            "id": "21e01940-3851-417f-9e90-1a4a2da07033",
            "created_at": "2022-10-25T16:07:23.299369Z",
            "updated_at": "2025-03-27T02:02:09.725295Z",
            "deleted_at": null,
            "main_name": "Agrius",
            "aliases": [
                "AMERICIUM",
                "Agonizing Serpens",
                "BlackShadow",
                "DEV-0227",
                "Pink Sandstorm",
                "SharpBoys"
            ],
            "source_name": "ETDA:Agrius",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agrius",
                "BFG Agonizer",
                "BFG Agonizer Wiper",
                "DEADWOOD",
                "DETBOSIT",
                "Detbosit",
                "IPsec Helper",
                "Moneybird",
                "MultiLayer Wiper",
                "PW",
                "PartialWasher",
                "PartialWasher Wiper",
                "SQLShred",
                "Sqlextractor"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1f6ae238-765f-4495-9d54-6a7883d7a319",
            "created_at": "2022-10-25T16:07:24.573456Z",
            "updated_at": "2025-03-27T02:02:10.284644Z",
            "deleted_at": null,
            "main_name": "TA511",
            "aliases": [
                "MAN1",
                "Moskalvzapoe"
            ],
            "source_name": "ETDA:TA511",
            "tools": [
                "Agentemis",
                "Chanitor",
                "Cobalt Strike",
                "CobaltStrike",
                "Ficker Stealer",
                "Hancitor",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "89c0c674-c35d-47a6-bd7c-1e6c1b6beacc",
            "created_at": "2024-05-01T02:03:08.042533Z",
            "updated_at": "2025-03-27T02:05:17.3236Z",
            "deleted_at": null,
            "main_name": "COBALT SHADOW",
            "aliases": [
                "AMERICIUM ",
                "Agrius",
                "BlackShadow",
                "DEV-0227 ",
                "Malek Team",
                "Pink Sandstorm ",
                "Agonizing Serpens "
            ],
            "source_name": "Secureworks:COBALT SHADOW",
            "tools": [
                " DEADWOOD",
                " Fantasy wiper",
                " Host2IP",
                " IPsec Helper",
                " Jennlog Loader",
                " MiniDump",
                " Moneybird ransomware",
                " PSexec",
                " Plink",
                " Sandals",
                " SecretsDump",
                " SoftPerfect Network Scanner",
                "Apostle"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "542cf9d0-9c68-428c-aff8-81b6f59dc985",
            "created_at": "2023-02-15T02:01:49.554105Z",
            "updated_at": "2025-03-27T02:00:03.110991Z",
            "deleted_at": null,
            "main_name": "Moskalvzapoe",
            "aliases": [
                "MAN1",
                "TA511"
            ],
            "source_name": "MISPGALAXY:Moskalvzapoe",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4023e661-f566-4b5b-a06f-9d370403f074",
            "created_at": "2024-02-02T02:00:04.064685Z",
            "updated_at": "2025-03-27T02:00:03.304692Z",
            "deleted_at": null,
            "main_name": "Pink Sandstorm",
            "aliases": [
                "Agonizing Serpens",
                "AMERICIUM",
                "BlackShadow",
                "DEV-0022",
                "Agrius"
            ],
            "source_name": "MISPGALAXY:Pink Sandstorm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7d982d5b-3428-483c-8804-c3ab774f1861",
            "created_at": "2024-11-01T02:00:52.70975Z",
            "updated_at": "2025-03-27T02:00:55.517246Z",
            "deleted_at": null,
            "main_name": "Agrius",
            "aliases": [
                "Agrius",
                "Pink Sandstorm",
                "AMERICIUM",
                "Agonizing Serpens",
                "BlackShadow"
            ],
            "source_name": "MITRE:Agrius",
            "tools": [
                "NBTscan",
                "Mimikatz",
                "IPsec Helper",
                "Moneybird",
                "MultiLayer Wiper",
                "DEADWOOD",
                "BFG Agonizer",
                "ASPXSpy"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1705457090,
    "ts_updated_at": 1743041783,
    "ts_creation_date": 1705381242,
    "ts_modification_date": 1705381242,
    "files": {
        "pdf": "https://archive.orkl.eu/0b57681534b8f5cb21ca7bc51e5658350c44c2bb.pdf",
        "text": "https://archive.orkl.eu/0b57681534b8f5cb21ca7bc51e5658350c44c2bb.txt",
        "img": "https://archive.orkl.eu/0b57681534b8f5cb21ca7bc51e5658350c44c2bb.jpg"
    }
}