{
    "id": "1db63d79-8de8-4d35-8891-487e18f10432",
    "created_at": "2023-06-05T02:07:31.026249Z",
    "updated_at": "2025-03-27T02:06:15.372779Z",
    "deleted_at": null,
    "sha1_hash": "724a73412b395b29d86c3af96a717c8cf2b1afe6",
    "title": "2023-05-17 - Visualizing QakBot Infrastructure",
    "authors": "",
    "file_creation_date": "2023-06-04T12:50:36Z",
    "file_modification_date": "2023-06-04T12:50:36Z",
    "file_size": 6873796,
    "plain_text": "# Visualizing QakBot Infrastructure\n\n**team-cymru.com/post/visualizing-qakbot-infrastructure**\n\nS2 Research Team May 16, 2023\n\n### A Data-Driven Approach based on Analysis of Network Telemetry\n\nThis blog post seeks to draw out some high-level trends and anomalies based on our\nongoing tracking of QakBot command and control (C2) infrastructure. By looking at the data\nwith a broader scope, we hope to supplement other research into this particular threat family,\nwhich in general focuses on specific infrastructure elements; e.g., daily alerting on active C2\nservers.\n\n\n-----\n\nThis blog represents an ongoing piece of research, our analysis of QakBot is fluid with\nvarious hypotheses being identified and tested. As and when we uncover new insights into\nQakBot campaigns we will seek to provide further written updates.\n\nWe are not going to go over the entire history and functionality of Qakbot, for which there are\n[numerous, well written reports on the subject. However, there are a couple of details relevant](https://malpedia.caad.fkie.fraunhofer.de/details/win.qakbot)\nfor this analysis worth mentioning.\n\n\n-----\n\n1. Qakbot campaigns are tracked by the threat actors via affiliate IDs that are included in\n\nthe malware configurations, at present the most active are “Obama” and “BB”.\n\n2. Whilst each malware configuration includes a list of around 100 to 150 potential C2s,\n\nonly a fraction are actually used for bot communications.\n\nRefill your coffee and get comfortable, things are about to get data heavy.\n\n\n-----\n\n## Key Findings\n\nQakBot C2 servers are not separated by affiliate ID.\n\nQakBot C2 servers from older configurations continue to communicate with upstream\nC2 servers months after being used in campaigns.\n\nIdentification of three upstream C2 servers located in Russia, two of which behave\nsimilarly based on network telemetry patterns and the geolocations of the bot C2s\ncommunicating with them.\n\nWhen one upstream C2 server goes down for a period of time, other upstream C2\nservers see a spike in C2 traffic volume.\n\nThe majority of Qakbot bot C2 servers are likely compromised hosts that were\npurchased from a third-party. Based on our data, most of these compromised hosts are\nlocated in India.\n\n## Active C2 Servers\n\nBy analyzing outbound connections from known victim-facing C2 servers, we are able to\ndetermine upstream management (Tier 2) infrastructure based on communications with\ncommon peers. In most cases a particular management port is utilized and generally\ncommunications are ‘ongoing’ for extended periods.\n\nOnce this Tier 2 (T2) management layer is identified, we are able to further determine which\nvictim-facing C2 servers are currently active, based on the observation of connections to this\nT2 layer.\n\n**This is a family agnostic process, not limited to QakBot C2 infrastructure.**\n\nIn the case of Qakbot, C2 servers from campaigns associated with the affiliate IDs “Obama”\nand “BB” have been communicating with the same three upstream Russian T2 servers over\nTCP/443 for months.\n\n\n-----\n\nRussian IP space is often used in higher tiers of botnet infrastructure due to the protection it\noffers against (non-Russian) LEA activity and researcher visibility. It is a bit of a catch-22,\nhowever, since repeated outbound connections to Russian IP space from source IPs located\nin various random countries tend to stand out as anomalous, or at least, of interest.\n\nUsing C2 configuration data from April 2023 QakBot campaigns, we confirmed that the\nupstream Russian T2 servers remained unchanged. We then sifted through all of the C2\nservers to identify those that connected to them over TCP/443. Interestingly, most of the C2\nservers with this upstream traffic were listed in configurations from both Obama and BB\ncampaigns. Five IPs were unique to Obama campaigns, and only one was unique to BB\nwithin this timeframe (specifically BB23 with campaign ID 1681114726).\n\n​Obama & BB Obama BB\n\n\n-----\n\n23.30.22.225\n\n23.30.173.133\n\n27.0.48.233\n\n27.109.19.90\n\n43.243.215.206\n\n43.243.215.210\n\n69.242.31.249\n\n73.36.196.11\n\n73.161.176.218\n\n74.92.243.115\n\n75.149.21.157\n\n76.16.49.134\n\n96.87.28.170\n\n98.37.25.99\n\n103.42.86.42\n\n103.111.70.66\n\n103.113.68.33\n\n103.123.223.130\n\n103.123.223.141\n\n103.212.19.254\n\n114.143.176.235\n\n119.82.120.15\n\n119.82.123.160\n\n157.119.85.203\n\n183.87.163.165\n\n197.94.78.32\n\n202.142.98.62\n\n\n59.153.96.4\n\n73.22.121.210\n\n119.82.121.251\n\n189.151.95.176\n\n197.94.95.20\n\n\n174.171.130.96\n\n\n-----\n\n## Bot C2s to Upstream T2s\n\nThe graphs below display the volume of traffic flows from 1 March to 8 May 2023 for the\nactive C2 servers identified above, categorized by the affiliate configurations they appeared\nin. Each color represents one of the upstream Russian IPs, referred to as RU1, RU2, and\nRU3.\n\n### April C2 servers present in both Obama and BB campaigns\n\n April C2 servers only present in Obama campaigns\n\n\n-----\n\n### April C2 servers only present in BB campaigns\n\nIn general, the affiliates do not seem to be separated by the upstream infrastructure with\nwhich their C2 servers communicate. However, there are some exceptions. For instance, a\nsingle unique BB C2 was live for two days and mostly communicated with RU3, with one\nconnection to RU2 on the first day. C2s from the Obama campaigns primarily communicated\nwith RU2 and RU3, although there were a few interactions with RU1 in early April.\n\nIn April, there seems to be a gap in activity for RU2 and RU3. To gain a clearer\nunderstanding of the overall C2 to T2 traffic volumes, it is necessary to combine all active\nC2s from April, regardless of affiliation.\n\n### All April C2 Servers\n\n\n-----\n\nRU2 and RU3 exhibit similar patterns to each other, while RU1 follows a separate pattern.\nTraffic volumes consistently decrease over weekends for all three, a trend commonly\nobserved in e-crime infrastructure. Interestingly, RU2 and RU3 were nearly inactive from 21\nApril until 1 May 2023. Upon resuming activity, C2 communication over TCP/443 spiked to\nlevels twice as high as before the period of inactivity. During the inactivity period, there was a\nsignificant surge in traffic volume to RU1. However, just before the return of RU2 and RU3 in\nearly May, the traffic volume to RU1 reduced to roughly match their volume patterns.\n\nMany C2 servers from this timeframe became active around mid-March and increased their\nactivity beyond April. For comparison, the graph below includes all other confirmed or high\nconfidence C2 servers that communicated with the Russian IPs over TCP/443 since 26\nJanuary 2023 (but were not included in April campaigns).\n\n### C2 Servers First Active Prior to April 2023\n\n\n-----\n\nThese previous C2 servers experienced spikes in activity, presumably when they were\nincluded in malware configurations, as observed with the C2 servers identified as active\nduring April 2023. Subsequently, the traffic volume of these previous C2 servers significantly\ndecreased but remained active.\n\nIn a future blog post, we will revisit this topic and explore the timelines of C2 servers and the\nrelationships between affiliates.\n\nFrom this perspective, there are fewer similarities between RU2 and RU3, although they still\nshare more alignment than with RU1. It also appears there have been previous periods of\ninactivity when C2 servers ceased communicating with an upstream Russian IP, as observed\nwith RU1 from 25 February to 6 March 2023. These older C2 servers also stopped\ncommunicating with RU1 for approximately three weeks from the end of March through April,\nbut they resumed connections on 19 April 2023. C2 servers included in April campaigns\ncontinued to communicate with RU1 during this period.\n\n## Telemetry by IP Geolocation\n\nThere appears to be a potential relationship between RU2 and RU3 based on the April C2\ntraffic volume patterns. Hypothesizing from Qakbot's intermittent use of geofencing payloads,\nperhaps this relationship is influenced by geolocation. The following comparison shows\nconfirmed and high confidence C2s, active between 26 January and 8 May 2023,\ncategorized by geolocation for each of the three Russian T2s.\n\n\n-----\n\n**This section is caveated by the potential for observation bias. Team Cymru s global**\n**coverage varies from region to region, and from day to day based on sampling rates**\n**and data volumes.**\n\n### RU1\n\n RU2\n\n RU3\n\n\n-----\n\nThe volume and diversity of C2s for all three Russian T2s changed their patterns around the\nsecond week of March, with increased activity for India (IN) and United States (US) located\nIPs, and a decrease in the number of different GEOs with active C2 servers. RU2 and RU3\nonce again exhibit similar patterns and receive traffic from all US-based C2 servers, as well\nas C2s from other North American locations not observed with RU1.\n\nDuring this timeframe, RU1 showed less diversity compared to RU2 and RU3, predominantly\nutilizing hosts located in India. There were only two short periods in February and March\nwhen US and Czech Republic (CZ) C2 servers connected to RU1.\n\nThe CZ hosts were seen communicating with all three T2s around the same time period in\nFebruary. More recently, hosts geo-tagged as South African (ZA) have started\ncommunicating with all three T2s, but most consistently connect to RU1.\n\nOne last thing to note: Qakbot C2 servers are historically compromised machines, either\npurchased from third parties or infected and turned into bots (although the latter is less\ncommon). Combining the above information into one graph reveals that starting in March,\nIndia is by far the most prevalent country for active Qakbot C2s. These compromised\nmachines are most likely purchased from a broker serving the e-crime community.\n\n## Conclusion\n\n\n-----\n\nThis analysis provides a recent snapshot of the Qakbot infrastructure, highlighting observed\ntrends and anomalies. By visualizing this data through line charts, we have uncovered\nintriguing insights into the inner workings of Qakbot's infrastructure. While the data can be\nutilized to identify potential threats and implement proactive measures, the primary focus of\nthis post is to highlight the interesting data points that can be uncovered through network\ntelemetry analysis. By leveraging these insights, readers can gain a deeper understanding of\nthe tactics and strategies employed by cybercriminals to carry out their attacks.\n\n## Recommendations\n\nWe recommend that the IOCs listed at the end of this blog post are used by cyber\ndefenders to hunt for existing QakBot infections, as well as in blocking future attacks.\n\nFor users of Pure Signal™ Recon and Scout, the aforementioned Russian T2 servers\nare identifiable by querying against the IOC list; filtering on outbound connections to\nremote TCP/443.\n\nPivoting on inbound connections to the Russian T2 servers will illuminate new QakBot\nC2 infrastructure over time.\n\n## Indicators of Compromise\n\nBelow are the confirmed Qakbot bot C2 servers that we have identified communicating with\nupstream T2 infrastructure over TCP/443 this year.\n\n23.30.22.225\n\n23.30.173.133\n\n24.9.220.167\n\n27.0.48.205\n\n27.0.48.233\n\n27.109.19.90\n\n\n-----\n\n43.243.215.206\n\n43.243.215.210\n\n59.153.96.4\n\n64.237.207.9\n\n64.237.212.162\n\n64.237.221.254\n\n64.237.245.195\n\n64.237.251.199\n\n67.187.130.101\n\n68.62.199.70\n\n69.242.31.249\n\n73.22.121.210\n\n73.29.92.128\n\n73.36.196.11\n\n73.60.227.230\n\n73.78.215.104\n\n73.88.173.113\n\n73.155.10.79\n\n73.161.176.218\n\n73.161.178.173\n\n73.165.119.20\n\n73.215.22.78\n\n73.223.248.31\n\n73.228.158.175\n\n73 230 28 7\n\n\n-----\n\n74.92.243.113\n\n74.92.243.115\n\n74.93.148.97\n\n75.149.21.157\n\n76.16.49.134\n\n76.27.40.189\n\n89.203.252.238\n\n96.87.28.170\n\n98.37.25.99\n\n98.159.33.25\n\n98.222.212.149\n\n99.251.67.229\n\n99.252.190.205\n\n99.254.167.145\n\n103.11.80.148\n\n103.12.133.134\n\n103.42.86.42\n\n103.42.86.110\n\n103.42.86.238\n\n103.42.86.246\n\n103.71.20.249\n\n103.71.21.107\n\n103.87.128.228\n\n103.111.70.66\n\n103 111 70 115\n\n\n-----\n\n103.113.68.33\n\n103.123.221.16\n\n103.123.223.76\n\n103.123.223.121\n\n103.123.223.130\n\n103.123.223.131\n\n103.123.223.132\n\n103.123.223.141\n\n103.123.223.144\n\n103.123.223.168\n\n103.123.223.171\n\n103.212.19.254\n\n103.231.216.238\n\n103.252.7.228\n\n103.252.7.231\n\n103.252.7.238\n\n109.49.47.10\n\n114.143.176.234\n\n114.143.176.235\n\n117.248.109.38\n\n119.82.120.15\n\n119.82.120.175\n\n119.82.121.87\n\n119.82.121.251\n\n119 82 122 226\n\n\n-----\n\n119.82.123.160\n\n157.119.85.203\n\n174.58.146.57\n\n174.171.10.179\n\n174.171.130.96\n\n180.151.104.240\n\n180.151.108.14\n\n183.82.107.190\n\n183.82.112.209\n\n183.87.163.165\n\n183.87.192.196\n\n189.151.95.176\n\n197.92.136.122\n\n197.94.78.32\n\n197.94.95.20\n\n201.130.119.176\n\n201.142.195.172\n\n201.142.207.183\n\n201.142.213.13\n\n202.142.98.62\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-17 - Visualizing QakBot Infrastructure.pdf"
    ],
    "report_names": [
        "2023-05-17 - Visualizing QakBot Infrastructure.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1685930851,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1685883036,
    "ts_modification_date": 1685883036,
    "files": {
        "pdf": "https://archive.orkl.eu/724a73412b395b29d86c3af96a717c8cf2b1afe6.pdf",
        "text": "https://archive.orkl.eu/724a73412b395b29d86c3af96a717c8cf2b1afe6.txt",
        "img": "https://archive.orkl.eu/724a73412b395b29d86c3af96a717c8cf2b1afe6.jpg"
    }
}