{
    "id": "1de2ce0b-464c-4b61-ba27-40a0e894a172",
    "created_at": "2023-01-12T15:07:53.908622Z",
    "updated_at": "2025-03-27T02:05:38.062075Z",
    "deleted_at": null,
    "sha1_hash": "ae2067fa8250ee1a2e70cab2d03d7149935808c2",
    "title": "2022-08-24 - Ransomware Actor Abuses Genshin Impact Anti-Cheat Driver to Kill Antivirus",
    "authors": "",
    "file_creation_date": "2022-10-02T12:19:15Z",
    "file_modification_date": "2022-10-02T12:19:15Z",
    "file_size": 2391364,
    "plain_text": "# Ransomware Actor Abuses Genshin Impact Anti-Cheat Driver to Kill Antivirus\n\n**[trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html](https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html)**\n\nAugust 24, 2022\n\nRansomware\n\nWe investigate mhyprot2.sys, a vulnerable anti-cheat driver for the popular role-playing game\nGenshin Impact. The driver is currently being abused by a ransomware actor to kill antivirus\nprocesses and services for mass-deploying ransomware.\n\nBy: Ryan Soliven, Hitomi Kimura\nAugust 24, 2022\nRead time: ( words)\n\n[There have already been reports on code-signed rootkits like Netfilter,](https://www.gdatasoftware.com/blog/microsoft-signed-a-malicious-netfilter-rootkit) [FiveSys, and](https://www.bitdefender.com/blog/hotforsecurity/the-emergence-of-the-fivesys-rootkit-a-malicious-driver-signed-by-microsoft/) Fire\nChili. These rootkits are usually signed with stolen certificates or are falsely validated.\nHowever, when a legitimate driver is used as a rootkit, that’s a different story. Such is the\ncase of mhyprot2.sys, a vulnerable anti-cheat driver for the popular role-playing game\n[Genshin Impact. The driver is currently being abused by a ransomware actor to kill antivirus](https://www.trendmicro.com/vinfo/tmr/?/tmr/?/us/security/definition/ransomware)\nprocesses and services for mass-deploying ransomware. Security teams and defenders\nshould note that mhyprot2.sys can be integrated into any malware.\n\nWhat we found\n\nDuring the last week of July 2022, a ransomware infection was triggered in a user\nenvironment that had endpoint protection properly configured. Analyzing the sequence, we\nfound that a code-signed driver called “mhyprot2.sys”, which provides the anti-cheat\nfunctions for Genshin Impact as a device driver, was being abused to bypass privileges. As a\nresult, commands from kernel mode killed the endpoint protection processes.\n\nAs of this writing, the code signing for mhyprot2.sys is still valid. Genshin Impact does not\nneed to be installed on a victim’s device for this to work; the use of this driver is independent\nof the game.\n\nThis ransomware was simply the first instance of malicious activity we noted. The threat\nactor aimed to deploy ransomware within the victim’s device and then spread the infection.\nSince mhyprot2.sys can be integrated into any malware, we are continuing investigations to\ndetermine the scope of the driver.\n\nOrganizations and security teams should be careful because of several factors: the ease of\nobtaining the mhyprot2.sys module, the versatility of the driver in terms of bypassing\nprivileges, and the existence of well-made proofs of concept (PoCs). All these factors mean\n\n\n-----\n\nthat the usage of this driver is likely higher than those of previously discovered rootkits (such\nas the ones mentioned in the preceding section).\n\nMeanwhile, the timeline and attack sequence of the threat actor’s activities that we present\nhere are noteworthy for security teams. A list of the techniques used in this operation can be\nfound in the MITRE ATT&CK analysis at the end of this article.\n\nTimeline of activities\n\nFigure 1. Attack overview\n[The earliest evidence of compromise was a secretsdump from an unidentified endpoint of](https://github.com/SecureAuthCorp/impacket/blob/master/examples/secretsdump.py)\nthe targeted organization to one of the domain controllers. It was followed by the execution of\n[discovery commands using wmiexec in the context of the built-in domain administrator](https://github.com/SecureAuthCorp/impacket/blob/impacket_0_10_0/examples/wmiexec.py)\naccount. Both secretsdump — which dumps secrets from the remote machine without\nexecuting any agent there — and wmiexec — which executes commands remotely through\n[Windows Management Instrumentation (WMI) — are tools from Impacket, a free collection of](https://www.secureauth.com/labs/open-source-tools/impacket/)\nPython classes for working with network protocols.\n\n\n-----\n\nFigure 2. Early evidence of compromise\nShortly afterward, the threat actor connected to the domain controller via RDP using another\ncompromised administrator account. From there, everything was executed in the context of\nthat user account.\n\nFigure 3. The threat actor connecting to the domain controller via RDP\n_Note: The process rdpclip.exe running under the context of the compromised administrator_\n_account was the only destination system artifact supporting the use of RDP toward the_\n_domain controller. It facilitates clipboard sharing between RDP sessions._\n\nA malicious file, kill_svc.exe (C:\\users\\{compromised user}\\kill_svc.exe), and mhyprot2.sys\n_(C:\\users\\{compromised user}\\mhyprot2.sys) were transferred to the desktop. This was the_\nfirst time that the vulnerable driver was seen. The file kill_svc.exe installed the mhyprot2\nservice and killed antivirus services.\n\n\n-----\n\nFigure 4. The suspicious kill_svc.exe file executed\n\nFigure 5. The vulnerable device installed\nAnother malicious file, avg.msi, was transferred to the netlogon share \\\\\n_{domaincontroller}\\NETLOGON\\avg.msi. This Windows installer contains avg.exe, a_\nmalicious file masquerading as AVG Internet Security, and is responsible for dropping and\nexecuting the following:\n\n_logon.bat – A batch file that executes HelpPane.exe, kills antivirus and other services,_\nand executes svchost.exe.\n\n_HelpPane.exe – A malicious file masquerading as Microsoft Help and Support_\nexecutable; similar to kill_svc.exe, it installs mhyprot2.sys and kills antivirus services.\n_mhyprot2 sys – A vulnerable Genshin Impact anti-cheat driver_\n\n\n-----\n\n_svchost.exe – The ransomware payload._\n\nThis also shows that the threat actor intended to mass-deploy the ransomware using the\ndomain controller via startup/logon script.\n\nThe Windows installer avg.msi hosted on the netlogon share was deployed to one\nworkstation endpoint via Group Policy Object (GPO). We suspect that this was to test\nwhether deployment via GPO would be successful, but this case resulted in a failure.\n\nFigure 6. The Windows installer avg.msi deployed via GPO\nAfterward, the threat actor logged in to the workstation from the unidentified endpoint. Both\nLogon Type 3 (Network Logon) and Logon Type 10 (RemoteInteractive) were observed. The\nWindows installer avg.msi was manually installed three times, which also resulted in a failure\n— no encryption. However, it was successful in killing the antivirus services.\n\nFigure 7. Manual installation of avg.msi failing\n_Note: The installation of avg.msi might have failed but the product was also no longer_\n_working._\n\n\n-----\n\nThe file avg.exe, extracted from avg.msi, was also transferred to the desktop and executed\nthree times. However, in our analysis, we found that this step also did not work even though\nthe antivirus was no longer working. Apparently, using the the .msi or .exe file resulted in the\napplications’ being stuck.\n\nFigure 8. The malicious file avg.exe transferred to the desktop and executed three times\nIn an attempt to make things work, the threat actor transferred logon.bat to the desktop and\nexecuted it manually. The file logon.bat, supposedly dropped and executed by avg.exe, was\nused as a standalone.\n\nFigure 9.\n\nSection 1 of logon.bat, used for starting HelpPane.exe\n\n\n-----\n\nFigure 10. Section 2 of logon.bat, used for killing antivirus solutions and other services\n\n\n-----\n\nFigure 11. Section 3 of\n\nlogon.bat, used for disabling the boot loader from loading the Windows recovery\nenvironment, disabling the Windows recovery environment, clearing Windows event logs,\nkilling the mhyprot2 service and deleting it, and lastly, starting the ransomware svchost.exe.\nSurprisingly, executing logon.bat worked and the ransomware svchost.exe began dropping\nransom notes and encrypting files. Knowing this, the threat actor hosted three files\nnecessary for mass deployment on a shared folder named “lol”: mhyprot2.sys, kill_svc.exe\n(for killing antivirus services), and svchost.exe (the ransomware).\n\nFigure 12. The share folder containing the necessary component files\n\nfor mass deployment\nA batch file named “b.bat” (C:\\Users\\{compromised user}\\Desktop\\b.bat), responsible for\ncopying and executing the files mentioned above, was deployed via PsExec using the\ncredentials of the built-in domain administrator account. It listed target workstations in the file\n_ip.txt._\n\n\n-----\n\n(modified multiple times by the threat actor)\n\nactor deploying b.bat to other workstations\nA closer look at mhyprot2.sys\n\n\nFigure 13. Partial contents of b.bat\n\nFigure 14. The threat\n\n\nThe driver mhyprot2.sys is loaded by kill_svc.exe/HelpPane.exe using the NtOpenFile\nfunction.\n\nFigure 15. The driver\n\nmhyprot2.sys loaded by kill_svc.exe/HelpPane.exe\nAfter loading mhyprot2.sys, kill_svc.exe/HelpPane.exe checks a list of processes to be\nterminated.\n\n\n-----\n\nFigure 16. A list of processes to be terminated as checked by\n\nkill_svc.exe/HelpPane.exe\nAfterward, it passes this information to the driver using the DeviceIoControl function.\n\nFigure 17. The\nDeviceIoControl function\nThe control code 0x81034000 is sent to the driver, instructing it to terminate the processes in\nthe list.\n\nFigure 18. The mhyprot2.sys case function\n\n\n-----\n\nFigure 19.\n\nZwTerminateProcess inside 0x81034000, which terminates a process and all of its threads\nThe mhyprot2.sys driver that was found in this sequence was the one built in August 2020.\nGoing back to social media streams, we can see that shortly after Genshin Impact was\nreleased in September 2020, this module was discussed in the gaming community because\nit was [not removed even after the game was uninstalled and because it allowed bypassing of](https://www.gamepur.com/guides/does-genshin-impact-have-spyware)\nprivileges.\n\n[A PoC, provided by user kagurazakasanae, showed that a library terminated 360 Total](https://github.com/kagurazakasanae/Mhyprot2DrvControl)\n[Security. A more comprehensive PoC, provided by](https://github.com/kkent030315/evil-mhyprot-cli) [Kento Oki, had the following capabilities:](https://github.com/kkent030315)\n\nRead/Write any kernel memory with privilege of kernel from user mode.\n\nRead/Write any user memory with privilege of kernel from user mode.\nEnumerate a number of modules by specific process id.\nGet system uptime.\nEnumerate threads in a specific process, allowing reading of the PETHREAD structure\nin the kernel directly from the command-line interface (CLI).\nTerminate a specific process by process id with ZwTerminateProcess, which calls in the\nvulnerable driver context (ring-0).\n\nThe issue was also reported by Kento Oki to miHoYo, the developer of Genshin Impact, as a\nvulnerability. Kento Oki’s PoC led to more discussions, but the provider did not acknowledge\nthe issue as a vulnerability and did not provide a fix. Of course, the code-signing certificate is\nstill valid and has not been revoked until now and the digital signature for code signing as a\ndevice driver is still valid at this time.\n\nComplications of code signing as a device driver\n\nIt is still rare to find a module with code signing as a device driver that can be abused. The\npoint of this case is that a legitimate device driver module with valid code signing has the\ncapability to bypass privileges from user mode to kernel mode. Even if a vendor\nacknowledges a privilege bypass as a vulnerability and provides a fix, the module cannot be\n\n\n-----\n\nerased once distributed. This file has a code signature for the driver, which allows this\nmodule to be loaded in kernel mode. If the signature was signed for a malicious module\nthrough private key theft, the certificate can be revoked to invalidate the signature. However,\nin this case, it is an abuse of a legitimate module. It seems that there is no compromise of\nthe private key, so it is still not known if the certificate will be revoked. It remains valid, at\nleast for now.\n\nAs mentioned above, this module is very easy to obtain and will be available to everyone\nuntil it is erased from existence. It could remain for a long time as a useful utility for\nbypassing privileges. Certificate revocation and antivirus detection might help to discourage\nthe abuse, but there are no solutions at this time because it is a legitimate module.\n\nHow to counter abuse: monitoring and detection\n\nThere are only a limited number of driver files with valid signatures that are expected to have\nbehavior comparable to the privilege bypassing we report here. We recommend that security\nteams and network defenders monitor the presence of the hash values within their\norganizations. We have confirmed that privilege bypassing is possible in at least this file:\n\n_mhyprot2.sys (0466e90bf0e83b776ca8716e01d35a8a2e5f96d3)_\n\nIn addition, we recommend monitoring Windows event logs for the installation of the service\ncorresponding to the driver. If the installation of the service was not intended, compromise is\nstrongly suspected:\n\nWindows Event Log (System) – 7045: A new service was installed in the system.\nService name: mhyprot2.\n\nFigure 20. The\n\nproperties of Windows Event Log (System) – 7045\n\n\n-----\n\nRecommendations and solutions\n\nRansomware operators are continuously looking for ways to covertly deploy their malware\nonto users’ devices. Using popular games or other sources of entertainment is an effective\nway of baiting victims into downloading dangerous files. It is important for enterprises and\norganizations to monitor what software is being deployed onto their machines or have the\nproper solutions in place that can prevent an infection from happening.\n\nUsers and organizations can also benefit from security solutions that offer multilayered\n[detection and response such as Trend Micro Vision One™, which has multilayered](https://www.trendmicro.com/en_us/business/products/detection-response.html)\nprotection and behavior detection capabilities that help block suspicious behavior and tools\n[before ransomware can do any damage. Trend Micro Apex One™ also provides next-level](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html)\nautomated threat detection and response to protect endpoints against advanced issues, like\nhuman-operated ransomware.\n\n[For more information on the indicators of compromise, download this document.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus/IOCs-blog-Ransomware%20Actor%20Abuses%20Genshin%20Impact%20Anti-Cheat%20Driver%20to%20Kill%20Antivirus.txt)\n\n**_With additional insights from Nathaniel Gregory Ragasa and Eleazar Valles_**\n\nMITRE ATT&CK tactics and techniques\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-24 - Ransomware Actor Abuses Genshin Impact Anti-Cheat Driver to Kill Antivirus.pdf"
    ],
    "report_names": [
        "2022-08-24 - Ransomware Actor Abuses Genshin Impact Anti-Cheat Driver to Kill Antivirus.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536073,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1664713155,
    "ts_modification_date": 1664713155,
    "files": {
        "pdf": "https://archive.orkl.eu/ae2067fa8250ee1a2e70cab2d03d7149935808c2.pdf",
        "text": "https://archive.orkl.eu/ae2067fa8250ee1a2e70cab2d03d7149935808c2.txt",
        "img": "https://archive.orkl.eu/ae2067fa8250ee1a2e70cab2d03d7149935808c2.jpg"
    }
}