{
    "id": "1dfe4e29-44d2-4eb9-90b6-8567f88fc306",
    "created_at": "2023-01-12T15:09:20.532238Z",
    "updated_at": "2025-03-27T02:17:27.523421Z",
    "deleted_at": null,
    "sha1_hash": "d0588fbd7425cbc3774ccb82cea72d7cda1629b8",
    "title": "2017-02-15 - Inside OilRig -- Tracking Iran's Busiest Hacker Crew On Its Global Rampage",
    "authors": "",
    "file_creation_date": "2022-05-27T21:55:32Z",
    "file_modification_date": "2022-05-27T21:55:32Z",
    "file_size": 184500,
    "plain_text": "# Inside OilRig -- Tracking Iran's Busiest Hacker Crew On Its Global Rampage\n\n**[forbes.com/sites/thomasbrewster/2017/02/15/oilrig-iran-hackers-cyberespionage-us-turkey-saudi-arabia/](https://www.forbes.com/sites/thomasbrewster/2017/02/15/oilrig-iran-hackers-cyberespionage-us-turkey-saudi-arabia/#56749aa2468a)**\n\nThomas Brewster February 15, 2017\n\nThis article is more than 5 years old.\n\nIran has become one of the more prolific nations when it comes to cyberespionage, according to U.S.... [+]\n\nexperts. (AP Photo/Vahid Salemi)\n\nAI Squared, a small, mission-driven tech firm based in a verdant corner of Vermont, builds\nsoftware that alters websites to help those with visual impairment use the internet. It never\nexpected to become an innocent victim in an international cyberespionage campaign\nallegedly perpetrated by Iran.\n\nBut AI Squared is now living proof that any American business, be it Microsoft-sized or a\nminnow, is a potential victim of Iran's increasingly sophisticated and prolific digital army.\nIndeed, AI Squared has become the only known private American business to have been\ntargeted by a young crew from Iran known as OilRig. Since its birth in late 2015, OilRig has\nbecome one of the most active hacking organizations to be sponsored by the Iranian\ngovernment, according to cybersecurity experts and to U.S. and Israeli intelligence firms.\nFORBES is revealing a handful of its targets for the first time on Wednesday, showing its\nrapid infiltration of systems across the globe in little over a year.\n\n\n-----\n\nWhile most Iranian groups have typically targeted a niche set of domestic and foreign\ntargets, in particular government agencies and dissidents, OilRig is far more focused on\nprivate industry outside of Iran. \"What's interesting about OilRig is how much it's just foreign\nfocused and is interested in the private sector as much as it's interested in the diplomatic\nestablishment,\" said Collin Anderson, a Washington D.C.-based researcher who is drawing\nup a report for Carnegie Mellon on Iran's overall cyber power. And though it's unclear just\nwhat data OilRig has siphoned off target systems, the unit is representative of a shift in Iran's\ncyber strategy, from destructive attacks, such as the infamous hit on the Las Vegas Sands\nCasino in 2014, to stealthy monitoring of targets.\n\n**An American platform for attack**\n\nAI Squared's problems started in the second week of January, when the company received a\nstartling warning from security giant Symantec: Certificates for its technology that are\ndesigned to guarantee its authenticity had been compromised. What Symantec didn’t say,\nand what AI Squared is now investigating after FORBES’ disclosed the Iranian link to the\ncompany, was that OilRig was believed to have been responsible.\n\nThe crew stole AI Squared certificates and used them to disguise their own malware. The\ngoal was to make their surveillance tools appear legitimate to security systems of their many\n[targets across the Middle East, Europe and the U.S., as noted in a report from Israeli](http://www.clearskysec.com/oilrig/)\nsecurity provider ClearSky in early January. The OilRig hackers pushed those espionage\ntools over two fake Oxford University pages in November 2016, one claiming to offer jobs at\nthe institution, the other a conference sign-up website, ClearSky said. Both encouraged\nvisitors to download documents, one to complete registration for the fake event, the other for\nan Oxford University CV creator. Once clicked, the crew's malware, named Helminth, would\nrun, allowing the OilRig crew to control targets’ PCs and steal data.\n\nA fake Oxford University jobs site created by OilRig. Malware signed by an American firm's... [+]\n\ncertificates was delivered from the domain.\n\nAI Squared, owned by Florida-based VFO Group since a June 2016 acquisition, only\nreceived vague details on the compromise from Symantec and is only now launching an\ninvestigation. \"Could someone else have hacked into our systems? We’re pretty secure here,\nbut they hacked the White House, they can hack anywhere they want,\" said Scott Moore,\nmarketing VP at VFO Group, which claims to be \"the world's leading assistive technology\nprovider for the visually impaired.\" The company is yet to find any conclusive findings.\n\n**Gunning for government officials**\n\nMany other organizations have become victims of OilRig's crew in recent years. Intelligence\nfirms believe OilRig has taken control of multiple email accounts of public and private\norganizations. With that access, they’ve expanded their phishing campaigns in the U.S.,\nSaudi Arabia Turkey and beyond\n\n\n-----\n\nOne OilRig phishing email viewed by FORBES, dated July 2016, was addressed to three\nofficials at Turkey’s foreign ministry. They included an adviser to the Permanent Mission of\nTurkey to the United Nations, based in New York, a staffer at the Turkish embassy staff in\nRiga, Latvia, and another official based in Turkey. It was sent from an official Turkish Airlines\ncheck-in address, indicating the hackers had either compromised the airline’s email or\nspoofed the account. The message encouraged the recipient to provide login details via an\nattached Excel file. Once opened, the group’s Helminth malware would run.\n\nThe Turkish adviser in New York said he had never seen the phishing email and so couldn’t\nhave clicked on the link. At the time of publication, the other targets had not responded to\nmultiple requests for comment. Turkish Airlines also had not returned requests. Despite the\nphishing email itself showing who OilRig was trying to expose, it’s not known if either\norganization was successfully hacked.\n\nBut similar malicious documents were sent to multiple other government organizations\nacross the world, according to Palo Alto Networks, which first published the phishing email\nwithout naming the parties involved.\n\n**Private industry attacks**\n\nOilRig has gone after multiple private companies too. Another phish was attempted in May\n2016 by the hackers that, according to the metadata in the email headers, was sent from\nservers within Saudi Arabian government contractor and IT security supplier Al-Elm. That\ncould indicate a breach at Al-Elm, according to the security researcher who showed\nFORBES the email.\n\nThe message was injected into an ongoing email thread between Al-Elm and Samba, part of\n[the Samba Financial Group, the kingdom's third largest lender that reported $290 million](http://in.reuters.com/article/samba-financial-results-idIND5N1E902N)\nprofit last quarter. The message contained a version of OilRig’s Helminth surveillance kit,\nwhich would launch as soon as a recipient opened an attached document, in this case an\nExcel file called “notes.xls.” Neither Al-Elm nor Samba had responded to requests for\ncomment.\n\nAccording to a report released Wednesday by cyber intelligence firm SecureWorks, which\nhas dubbed the OilRig crew Cobalt Gypsy, the group was active this January, sending out\nmessages loaded with malware from legitimate email addresses belonging to one of Saudi\nArabia's biggest IT suppliers, the National Technology Group, and an Egyptian IT services\nfirm, ITWorx. From those email accounts, an unnamed Middle East entity was targeted with\nmessages promising links to job offers. Hidden in the attachments was PupyRAT, an open\nsource remote access trojan (RAT) that works across Android, Linux and Windows platforms.\n\nOne of OilRig's favorite methods of infection is sending out job ads. In this case, Egypt's ITWorx... [+] was\n\nused as a lure.\n\n\n-----\n\nNeither the National Technology Group nor ITWorx had responded to requests for comment.\nJust as in the case of Al-Elm, analysis of the headers of the phishing emails indicated they\noriginated from within the sender’s organization, and were not spoofed, SecureWorks said.\nThat indicated \"the threat actor previously compromised those organizations,\" according to\nSecureWorks intelligence analyst Allison Wikoff.\n\nThe SecureWorks Counter Threat Unit has repeatedly informed its customers across\ngovernment and private sector with “high confidence” that OilRig “is associated with Iranian\ngovernment-directed cyber operations.” CrowdStrike, which dubs the group Twisted Kitten,\nhas connected it with Iran too. And Israeli firm ClearSky has also traced the crew back to the\nMiddle East nation.\n\n\"They're very active, possibly the most active group [in Iran],\" said Rafe Pilling, security\nresearcher at SecureWorks. \"They are capable and have demonstrated that capability to\nleverage their phishing ops.\"\n\nThe Iranian government hadn't responded to a request for comment on the OilRig group at\nthe time of publication. In the past, Iran has denied involvement in cyberespionage and\ndigital attacks on foreign systems.\n\n**Iran's freewheeling cyber spies**\n\nOutside of OilRig, other reports of Iranian activity have caused alarm across the security\ncommunity in the last year, for both their sophistication and their novelty. One of only a\nhandful of [Mac malware samples was attributed to the Iranian government earlier this month.](https://iranthreats.github.io/resources/macdownloader-macos-malware/)\nJust last year, [the U.S. indicted seven Iranians for their alleged participation in an attacks on](http://www.forbes.com/sites/nathanvardi/2016/03/24/u-s-charges-iranian-hackers-for-attacking-banks-and-targeting-dam/)\nU.S. financial institutions. One was also charged with an attempt to hack the Bowman Dam\nin New York. The accused reside in Iran and are not expected to be extradited to stand trial.\nIran [denied involvement in the attacks.](http://www.latimes.com/nation/la-na-cyber-iran-indict-20160324-story.html)\n\nAnderson, who uncovered the Mac malware, said Iran had created a hodgepodge of\nhackers, some of whom were capable of causing severe harm. “It's chaotic, five or six-man\nshops that produce mediocre malware,” said Anderson, who tracks a substantial amount of\nIran cyber activity with fellow researcher Claudio Guarnieri. “Sometimes they do some\ncatastrophic damage, most of the time not so much.”\n\nU.S. cyber experts are now looking at how OilRig and its sister crews will respond to the\nTrump administration's stance on Iran, which will be looking at how the president's meeting\nwith Israeli prime minister Benjamin Netanyahu. \"The Iranians are being cautious about\nprovoking the US until they see how the Trump administration lines up on Iran policy,\" said\nJames Lewis, an intelligence and security specialist at the Center for Strategic and\nInternational Studies. \"Let’s see what happens with the Netanyahu visit.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-02-15 - Inside OilRig -- Tracking Iran's Busiest Hacker Crew On Its Global Rampage.pdf"
    ],
    "report_names": [
        "2017-02-15 - Inside OilRig -- Tracking Iran's Busiest Hacker Crew On Its Global Rampage.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6dbdb9e4-3569-404a-8a25-e8ce65994281",
            "created_at": "2023-01-06T13:46:38.380071Z",
            "updated_at": "2025-03-27T02:00:02.818889Z",
            "deleted_at": null,
            "main_name": "Sands Casino",
            "aliases": [],
            "source_name": "MISPGALAXY:Sands Casino",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536160,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1653688532,
    "ts_modification_date": 1653688532,
    "files": {
        "pdf": "https://archive.orkl.eu/d0588fbd7425cbc3774ccb82cea72d7cda1629b8.pdf",
        "text": "https://archive.orkl.eu/d0588fbd7425cbc3774ccb82cea72d7cda1629b8.txt",
        "img": "https://archive.orkl.eu/d0588fbd7425cbc3774ccb82cea72d7cda1629b8.jpg"
    }
}