{
    "id": "1e105e49-8b3f-4af8-a3f0-5af55e3a8f98",
    "created_at": "2023-01-12T15:10:06.598009Z",
    "updated_at": "2025-03-27T02:09:30.196915Z",
    "deleted_at": null,
    "sha1_hash": "9841220c42b03e6d974e72e6224c5ce460f76a55",
    "title": "2020-12-17 - Increase In Attack- SocGholish",
    "authors": "",
    "file_creation_date": "2022-05-28T21:36:40Z",
    "file_modification_date": "2022-05-28T21:36:40Z",
    "file_size": 1593155,
    "plain_text": "# Increase In Drive-by Attack: SocGholish Malware Downloads\n\n**menlosecurity.com/blog/increase-in-attack-socgholish**\n\nDecember 17, 2020\n\n[Back to blog](https://www.menlosecurity.com/blog/)\n\nMenlo Labs has uncovered a increase in a drive-by attack that impersonates legitimate\nbrowser, Flash, and Microsoft Teams updates\n\nIn the last two months, the Menlo Labs team has witnessed a surge in drive-by download\nattacks that use the “SocGholish” framework to infect victims. This particular framework is\nknown to be widely used to deliver malicious payloads by masquerading as a legitimate\nsoftware update. Isolation prevents this type of attack from delivering its payload to the\nendpoint. Here’s what we know.\n\n## What Is a Drive-by Attack?\n\nA drive-by attack is when a user visits an infected website and the website triggers a\nmalicious download without user intervention.\n\n## What Is SocGholish?\n\nThe term “Soc” in the “SocGholish” framework refers to the attack’s use of social engineering\ntoolkits masquerading as a software update. Thus far, Menlo has observed this particular\nframework using several social engineering themes that impersonate browser updates\n(Chrome/Firefox), Flash Player updates, and more recently, Microsoft Teams updates.\n\n\n-----\n\nMenlo Labs has also detected a fake Google Drive share link site that is served from an\niframe on a malicious website, although the malicious ZIP file is hosted on Google Drive. The\nZIP file has an embedded JScript file that, upon execution, downloads additional malware.\n\n## How Does SocGholish Operate in the Wild?\n\nThe following diagram depicts the typical kill chain used by the SocGholish framework:\n\n\n-----\n\n**Two key observations about the SocGholish framework within the browser context:**\n\nAttackers choose a way to host and serve the compromised website—usually using a\ncombination of a legitimate website that served the compromised website via an\niframe.\nThe drive-by download mechanism is used to trigger the download of the malicious ZIP\nfile to the endpoint. In the next section, we will delve into specific mechanisms used by\nthis framework in detail.\n\nUser interaction is still required to extract and execute the contents inside the malicious ZIP\nfile, but this is where social engineering and trust from the source of the file comes in.\nBecause the file is hosted in an iframe within a legitimate site, users are tricked into thinking\nthe file is from a legitimate source and encouraged to download and execute the file.\n\nThe malicious ZIP file has an embedded JScript file that, upon execution, uses living-off-theland binaries (PowerShell/CMD, etc.) to fetch a malicious download—providing additional\ncommand and control communication to download the final malware.\n\n[This framework is used to gain initial access to an endpoint. From past research, we’ve seen](https://attack.mitre.org/tactics/TA0027/)\nthis framework distribute the Dridex Banking Trojan and variations of the WastedLocker\nransomware family.\n\n## Why Doesn’t Categorization Block SocGholish?\n\nThe iframes that are used to serve content from malicious sites are hosted on sites that have\nbeen categorized as legitimate categories, such as download sites or other categories in\nwhich reasonably popular websites are often hosted.\n\n\n-----\n\nThe malicious ZIP file is usually delivered from popular cloud hosting providers. The\nfollowing chart shows a breakdown of the specific service providers that were used to host\nthese malicious ZIP files.\n\n## What Attack Vectors Are Being Used?\n\nFrom our analysis, we know that the drive-by download mechanisms used by the SocGholish\nframework did not involve any browser exploitation or exploit kits to deliver malicious\npayloads. Depending on the social engineering theme used, we have observed the following\nmechanisms used to trigger the drive-by download:\n\n\n-----\n\n**1) Using a watering hole:**\n\nVictims are lured into visiting a reasonably popular website within the Alexa top ~100K\nranking, where the attackers plant an iframe that sends users through a series of redirections\nto trigger the malicious download.\n\nThese redirections are usually from commonly used cloud hosting services (Bitbucket\nin the above example).\nThe final URL to deliver the malicious ZIP file is served from Amazon S3.\nAny approach that relies on website categorization to inspect downloads is tricked to\nbelieve that the ZIP file is downloaded from Amazon S3.\n\n**2) Using JavaScript to trigger a blob download:**\n\nThe attackers pick compromised sites that are hosted on content management systems such\nas WordPress to inject iframes that use JavaScript blobs to automatically trigger the ZIP file\ndownload.\n\n\n-----\n\nThis mechanism is very similar to the DURI campaign we wrote about recently. Since the\nentire payload is constructed within the endpoint, this method is commonly used to smuggle\npayloads and bypass legacy network proxies and sandboxes.\n\n**3) Using JavaScript to dynamically generate the link to trigger the download:**\n\nThis is the mechanism we observed in the sites.google.com fake share theme.\n\nAttackers use sites.google.com to deliver the malicious site via an iframe.\nThe iframe loads a JavaScript that dynamically creates a download link element and\nsimulates a click to trigger the malicious ZIP download.\nThe download link dynamically points to the ZIP file that is hosted on a legitimate\nGoogle Drive link.\n\n## A Note on Browser Security Controls around iframes\n\n\n-----\n\nRecently, [Chrome and](https://www.chromestatus.com/feature/5706745674465280) [Firefox developers have added a security feature that automatically](https://bugzilla.mozilla.org/show_bug.cgi?id=1558394)\nblocks downloads from sandboxed iframes. In the above techniques, downloads were\nallowed from iframes specified by the following settings:\n\nInjected iframe without the “sandbox” attribute specified, which would just allow\ndownloads from iframe.\nThe sites.google.com example has an iframe with the “sandbox” attribute, but also has\nthe “allow-downloads”, “allow-scripts”, “allow-forms”, etc. set.\n\n## Be Sure, Be Safe, Be Secure\n\nAs we head into the holiday season and 2020 winds down, it’s important to be vigilant\nagainst these types of sophisticated attacks that impersonate legitimate software updates to\ndeliver their malicious payload. Remember that many browsers, including Chrome, have\nautomated patching and updates—eliminating the kind of prompt that SocGholish requires.\n\nAlternatively, it may be time to think about implementing isolation—the only security\ntechnology that prevents all web-based attacks by preventing any content (risky or not) from\nexecuting on the endpoint, without impacting the native user experience. It’s simple:\nMalicious actors can’t infect something they can’t access. Learn more about isolation at\nmenlosecurity.com.\n\nPosted by Krishnan Subramanian on Dec 17, 2020\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-17 - Increase In Attack- SocGholish.pdf"
    ],
    "report_names": [
        "2020-12-17 - Increase In Attack- SocGholish.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536206,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653773800,
    "ts_modification_date": 1653773800,
    "files": {
        "pdf": "https://archive.orkl.eu/9841220c42b03e6d974e72e6224c5ce460f76a55.pdf",
        "text": "https://archive.orkl.eu/9841220c42b03e6d974e72e6224c5ce460f76a55.txt",
        "img": "https://archive.orkl.eu/9841220c42b03e6d974e72e6224c5ce460f76a55.jpg"
    }
}