{
    "id": "1e4b59bc-a799-47a7-859b-594de5aa009a",
    "created_at": "2023-01-12T15:05:28.259982Z",
    "updated_at": "2025-03-27T02:06:01.452124Z",
    "deleted_at": null,
    "sha1_hash": "a0888deab361fe4f140f83f609955c38da9f580c",
    "title": "2017-04-17 - Remove Search.searchetan.com Chrome New Tab Page",
    "authors": "",
    "file_creation_date": "2022-05-27T21:38:09Z",
    "file_modification_date": "2022-05-27T21:38:09Z",
    "file_size": 3310150,
    "plain_text": "# Remove Search.searchetan.com Chrome New Tab Page\n\n**[bleepingcomputer.com/virus-removal/remove-search-searchetan.com-chrome-new-tab-page](https://www.bleepingcomputer.com/virus-removal/remove-search-searchetan.com-chrome-new-tab-page)**\n\nBleepingComputer.com\n\nIf Google Chrome's new tab page is set to Search.searchetan.com then you most likely\n[have the Easy Television Access Now installed. This extension will configure Chrome's new](https://www.bleepingcomputer.com/virus-removal/remove-easy-television-access-now-chrome-extension)\ntab page to searchetan.com, whose search form will display search results from Yahoo.com.\n\n\n-----\n\n-----\n\n## How was Search.searchetan.com set in Google Chrome?\n\nSearch.searchetan.com is configured by the Easy Television Access Now extension. This\nextension is promoted through adware programs that display pop-up advertisements. One of\nthe advertisements that is displayed is for the Easy Television Access Now extension.\n\nIf Chrome's new tab page is configured to use Easy Television Access Now and you do not\nfind it useful, you can [remove the extension from Chrome. As this extension is commonly](https://www.bleepingcomputer.com/tutorials/how-to-remove-a-google-chrome-extension/)\nadvertised by adware, you may want to use the removal guide below to scan for and remove\nunwanted programs for free as well.\n\n## Self Help Guide\n\nThis guide contains advanced information, but has been written in such a way so that\nanyone can follow it. Please ensure your data is backed up before proceeding.\n\nIf you are uncomfortable making changes to your computer or following these steps, do not\n[worry! Instead you can get free one-on-one help by asking in the forums.](https://www.bleepingcomputer.com/forums)\n\n### To remove Search.searchetan.com Chrome New Tab Page, follow these steps:\n\n1\n\n\n-----\n\nThis removal guide may appear overwhelming due to the amount of the steps and numerous\nprograms that will be used. It was only written this way to provide clear, detailed, and easy to\nunderstand instructions that anyone can use to remove this infection for free. Before using\nthis guide, we suggest that you read it once and download all necessary tools to your\ndesktop. After doing so, please print this page as you may need to close your browser\nwindow or reboot your computer.\n\n2\n\nTo terminate any programs that may interfere with the removal process we must first\ndownload the Rkill program. Rkill will search your computer for active malware infections and\nattempt to terminate them so that they wont interfere with the removal process. To do this,\nplease download RKill to your desktop from the following link.\n\nRkill\n\n[Download Now](https://www.bleepingcomputer.com/download/rkill/)\nWhen at the download page, click on the Download Now button labeled iExplore.exe.\nWhen you are prompted where to save it, please save it on your desktop.\n\n3\n\nOnce it is downloaded, double-click on the iExplore.exe icon in order to automatically\nattempt to stop any processes associated with Search.searchetan.com Chrome New Tab\n**Page and other malware. Please be patient while the program looks for various malware**\nprograms and ends them. When it has finished, the black window will automatically close\nand a log file will open. Please review the log file and then close so you can continue with the\nnext step. If you have problems running RKill, you can download the other renamed versions\nof RKill from the [rkill download page. All of the files are renamed copies of RKill, which you](https://www.bleepingcomputer.com/download/rkill/)\ncan try instead. Please note that the download page will open in a new browser window or\ntab.\n\n**Do not reboot your computer after running RKill as the malware programs will start**\n**again.**\n\n4\n\nAt this point you should download Malwarebytes Anti-Malware, or MBAM, to scan your\ncomputer for any infections, adware, or potentially unwanted programs that may be present.\nPlease download Malwarebytes from the following location and save it to your desktop:\n\nMalwarebytes Anti-Malware\n\n[Download Now](https://www.bleepingcomputer.com/download/malwarebytes-anti-malware/)\n5\n\nOnce downloaded, close all programs and Windows on your computer, including this one.\n\n\n-----\n\n6\n\nDouble-click on the icon on your desktop named MBSetup-1878.1878-4.0.exe. This will start\nthe installation of MBAM onto your computer.\n\n7\n\nWhen the installation begins, keep following the prompts in order to continue with the\ninstallation process. Do not make any changes to default settings and when the program has\nfinished installing, a welcome screen will be displayed.\n\nAt this screen, click on the Get Started button where you will be prompted to buy and\nactivate a license. To continue using it for free, click on the 'Maybe Later' option and then\nselect 'Use Malwarebytes Free'.\n\nIt should be noted that the free version will scan for and remove malware, but not provide\nreal-time protection from threats that occur when not performing a scan.\n\nFinally, you will be shown a screen asking you to sign up for their newsletter. Just click on the\n'Open Malwarebytes Free' option to start the program.\n\n8\n\nMBAM will now start and you will be at the main screen as shown below.\n\n\n-----\n\nWe now need to enable rootkit scanning to detect the largest amount of malware and\nunwanted programs that is possible with MalwareBytes. To do this, click on the Settings\ngear on the top left side of the screen and you will be brought to the general settings section.\n\nNow click on the Security option at the top of the screen. You will now be shown the settings\nMalwareBytes will use when scanning your computer.\n\nScroll down until you see Scan option as shown below.\n\n\n-----\n\nAt this screen, please enable the Scan for rootkits setting by clicking on the toggle switch\nso it turns blue.\n\nNow that you have enabled rootkit scanning, click on the X button to close the settings to get\nback to the main screen.\n\n9\n\nYou should now click on the Scan button to begin scanning your computer for malware.\n\nThis process can take quite a while, so we suggest you do something else and periodically\ncheck on the status of the scan to see when it is finished.\n\n\n-----\n\n10\n\nWhen MBAM is finished scanning it will display a screen that displays any malware, adware,\nor potentially unwanted programs that it has detected. Please note that our guide's scan\nresults image may look different than the one you are shown in this version of Malwarebytes\nas it was created with an older version.\n\n\n-----\n\nYou should now click on the Quarantine button to remove all the selected items. MBAM will\nnow delete all of the files and registry keys and add them to the program's quarantine.\n\nWhen removing the files, MBAM may require a reboot in order to remove some of them. If it\ndisplays a message stating that it needs to reboot, please allow it to do so. Once your\ncomputer has rebooted, and you are logged in, please continue with the rest of the steps.\n\n11\n\nYou can now exit the MBAM program.\n\n12\n\nNow please download AdwCleaner and save it to your desktop. AdwCleaner will scan your\ncomputer for adware programs that may have been installed on your computer without your\nknowledge. You can download AdwCleaner from the following URL:\n\nAdwCleaner\n\n[Download Now](https://www.bleepingcomputer.com/download/adwcleaner/)\n13\n\n\n-----\n\nWhen AdwCleaner has finished downloading, please double-click on the AdwCleaner.exe\nicon that now appears on your desktop. Once you double-click on the icon the AdwCleaner\nprogram will open and you will be presented with the program's license agreement. After you\nread it, click on the I agree button if you wish to continue. Otherwise, click on the I disagree\nbutton to close the program. If Windows prompts you as to whether or not you wish to run\nAdwCleaner, please allow it to run.\n\nIf you selected to continue, you will be presented with the start screen as shown below.\n\n14\n\nNow click on the Scan button in AdwCleaner. The program will now start to search for known\nadware programs that may be installed on your computer. When it has finished it will display\nall of the items it has found in Results section of the screen above. Please look through the\nresults and try to determine if the programs that are listed contain ones that you do not want\ninstalled. If you find programs that you need to keep, then uncheck the entries associated\nwith them.\n\nFor many people, the contents of the Results section may appear confusing. Unless you see\na program name that you know should not be removed,please continue with the next step.\n\n15\n\nTo remove the adware programs that were detected in the previous step, please click on the\n**Clean button on the AdwCleaner screen. AdwCleaner will now prompt you to save any open**\nfiles or data as the program will need to close any open programs before it starts to clean.\n\n\n-----\n\nPlease save your work and then click on the OK button. AdwCleaner will now delete all\ndetected adware from your computer. When it is done it will display an alert that explains\nwhat PUPs (Potentially Unwanted Programs) and Adware are. Please read through this\ninformation and then press the OK button. You will now be presented with an alert that states\nAdwCleaner needs to reboot your computer.\n\nPlease click on the OK button to let AdwCleaner reboot your computer.\n\n16\n\nWhen your computer reboots and you are logged in, AdwCleaner will automatically open a\nlog file that contains the files, registry keys, and programs that were removed from your\ncomputer.\n\n\n-----\n\nPlease review this log file and then close the Notepad Window.\n\n17\n\nIf you are still having problems with Search.searchetan.com Chrome New Tab Page then\nyou should also reset your browsers back to their default configuration. Please note that this\nmethod will remove all add-ons, extensions, toolbars and other customizations but will leave\nyour bookmarks and favorites intact.\n\nFor each browser that you have installed on your computer, please click on the browsers\nicon below and follow the displayed steps to reset that browser.\n\nIn order to remove Search.searchetan.com Chrome New Tab Page completely you will\nneed to reset Chrome back to its initial settings. Doing these steps will erase all configuration\ninformation from Chrome such as your home page, tab settings, saved form information,\nbrowsing history, and cookies. This process will also disable any installed extensions. All of\nyour bookmarks, though, will be preserved.\n\nTo reset Chrome, open the program and click on the Chrome menu button ( ) in the top\n\nright-hand corner of the window. This will open the main menu for Chrome as shown below.\n\n\n-----\n\nNow click on the menu option labeled Settings as shown by the arrow in the picture above,\nwhich will open the basic settings screen. Scroll down to the very bottom and you will see a\n**Show advanced settings... option as shown in the image below.**\n\n\n-----\n\nClick on the Show advanced settings... option to open the advanced settings screen. Scroll\nto the very bottom until you see the reset button as shown in the image below.\n\n\n-----\n\nNow click on the Reset settings button as shown in the image above. Chrome will now open\na confirmation dialog asking if you are sure you wish to reset your browser.\n\n\n-----\n\nTo reset Chrome, click on the Reset button. Chrome will now erase all your personal data,\nbrowsing history, and disable all installed extensions. Your bookmarks, though, will remain\nintact and still be accessible. You can now close the Settings tab and continue with the rest\nof the instructions.\n\nIn order to remove Search.searchetan.com Chrome New Tab Page completely you will\nneed to reset Internet Explorer back to its initial settings. Doing these steps will erase all\nconfiguration information from Internet Explorer such as your home page, saved form\ninformation, browsing history, and cookies. This process will also disable any installed\ntoolbars and add-ons. All of your bookmarks, though, will be preserved.\n\nTo reset Internet Explorer, open the program and click on the Internet Explorer menu button (\n\n) in the top right-hand corner of the window. This will open the main menu for Internet\nExplorer as shown below.\n\nNow click on the menu option labeled Internet options as shown by the arrow in the picture\nabove, which will open the Internet Options screen.\n\n\n-----\n\nNow click on the Advanced tab as shown in the image above. This will open the Advanced\nSettings screen.\n\n\n-----\n\nNow click on the Reset... button as shown in the image above. Internet Explorer will now\nopen a confirmation dialog asking you to confirm that you wish to reset your browser.\n\n\n-----\n\nIn the reset dialog shown above, please put a check mark in Delete personal settings and\nthen click on the Reset button. Internet Explorer will now erase all your personal data,\nbrowsing history, and disable all add-ons and toolbars. Your favorites, though, will remain\nintact and still be accessible.\n\nOnce the Reset process has been completed, click on the Close button. You will now be\nprompted to restart Internet Explorer to complete the reset. Once you have restarted Internet\nExplorer, you can continue with the rest of the instructions.\n\nIn order to remove Search.searchetan.com Chrome New Tab Page completely you will\nneed to refresh Firefox back to its initial settings. It does this by removing all add-ons and\npersonalized configuration settings. All of your bookmarks, though, will be preserved.\n\nTo reset Firefox, open the program and click on the Firefox menu\n\nbutton ( ) in the top right-hand corner of the window. This will open the main menu for\n\nFirefox as shown below\n\n\n-----\n\nNow click on the question mark button ( ) as indicated by the arrow in the image\n\nabove. This will open up the Firefox help menu.\n\n\n-----\n\nNext click on the Troubleshooting Information option as indicated by the arrow in the\nimage above. This will bring you to a Troubleshooting page.\n\n\n-----\n\nTo begin the refresh process click on the Refresh Firefox.. button. When you do this a\nconfirmation will be shown asking if you wish to perform a Firefox refresh.\n\nTo refresh Firefox, click on the Refresh Firefox button. When the refresh process is finished\nyou will be shown an Import window that will automatically close. When that closes, Firefox\nwill be open and state that it has been refreshed.\n\n\n-----\n\nYou can now click on the Let's go! button to start using Firefox again.\n\nIn order to completely remove Search.searchetan.com Chrome New Tab Page you will\nneed to reset Safari back to its initial settings. Doing these steps will erase all configuration\ninformation from Safari such as your Top Sites, saved form information, browsing history, and\ncookies. This process will not erase your bookmarks or extensions, which will still be\navailable after you reset Safari.\n\nTo reset Safari, open the program and click on the gear ( ) in the top right-hand corner of\nthe window. This will open the main menu for Safari as shown below.\n\n\n-----\n\nNow click on the menu option labeled Reset Safari as shown by the arrow in the picture\nabove. This will open a window that allows you to select all the items you wish to reset.\n\n\n-----\n\nKeep the check marks in each option and then click on the Reset button. Safari will delete all\nof your personal data and then open a blank page, which means the process has finished.\n\nIt is important to note that this process does not delete your Bookmarks or any installed\nSafari Extensions. If you wish to remove your Safari Extensions as well, you can download\n[this batch file, which will reset Safari and delete all installed extensions, while still retaining](https://download.bleepingcomputer.com/reset-browsers/safari/reset-safari.bat)\nyour bookmarks.\n\n18\n\nNow you should download HitmanPro from the following location and save it to your desktop:\n\nHitmanPro\n\n[Download Now](https://www.bleepingcomputer.com/download/hitmanpro/)\nWhen you visit the above page, please download the version that corresponds to the bit-type\nof the Windows version you are using.\n\n19\n\nOnce downloaded, double-click on the file named HitmanPro.exe (for 32-bit versions of\nWindows) or HitmanPro_x64.exe (for 64-bit versions of Windows). When the program starts\nyou will be presented with the start screen as shown below.\n\n\n-----\n\nNow click on the Next button to continue with the scan process.\n\n20\n\nYou will now be at the HitmanPro setup screen. If you would like to install the 30 day trial for\nHitmanPro, select the Yes, create a copy of HitmanPro so I can regularly scan this\n**computer (recommended) option. Otherwise, if you just want to scan the computer this one**\ntime, please select the No, I only want to perform a one-time scan to check this\n**computer option.**\n\n\n-----\n\nOnce you have selected one of the options, please click on the Next button.\n\n21\n\nHitmanPro will now begin to scan your computer for infections, adware, and potentially\nunwanted programs. When it has finished it will display a list of all the items that Hitman has\nfound as shown in the image below. Please note that the items found may be different than\nwhat is shown in the image.\n\n\n-----\n\nYou should now click on the Next button to have HitmanPro remove the detected items.\nWhen it is done you will be shown a Removal Results screen that shows the status of the\nvarious programs that were removed. At this screen you should click on the Next button and\nthen if prompted you should click on the Reboot button. If HitmanPro does not prompt you to\nreboot, please just click on the Close button.\n\nOnce your computer has has restarted or you pressed the Close button, you should now be\nat your Windows desktop.\n\n22\n\nAs many malware and unwanted programs are installed through vulnerabilities found in outdated and insecure programs, it is strongly suggested that you use Secunia PSI to scan for\nvulnerable programs on your computer. A tutorial on how to use Secunia PSI to scan for\nvulnerable programs can be found here:\n\nHow to detect vulnerable and out-dated programs using Secunia Personal Software\nInspector\n\n\n-----\n\nYour computer should now be free of the Search.searchetan.com Chrome New Tab Page\nprogram. If your current security solution allowed this program on your computer, you may\n[want to consider purchasing the full-featured version of Malwarebytes Anti-Malware to](https://www.malwarebytes.com/lp/sem/en/?affiliate=1878%26x-at%3dsearchetan)\nprotect against these types of threats in the future.\n\nIf you are still having problems with your computer after completing these instructions, then\nplease follow the steps outlined in the topic linked below:\n\n[Preparation Guide For Use Before Using Malware Removal Tools and Requesting Help](https://www.bleepingcomputer.com/forums/t/34773/preparation-guide-for-use-before-using-malware-removal-tools-and-requesting-help/)\n\n## Are Your Protected?\n\nWhile Malwarebytes Anti-Malware & HitmanPro will scan and clean a computer for free, the\nfree versions do not offer real-time protection. If you want to be fully protected at all times\nthen it is recommended that you purchase a premium version.\n\n### Malwarebytes Anti-Malware\n\nPurchase the full-featured version of Malwarebytes Anti-Malware, which includes real-time\nprotection, scheduled scanning, and website filtering, to protect yourself against these types\nof threats in the future!\n\n[Purchase Premium](https://www.malwarebytes.com/lp/sem/en/?affiliate=1878%26x-at%3dsearchetan)\n\n### HitmanPro\n\nPurchase the full-featured version of HitmanPro, which includes discover viruses, trojans,\nrootkits, spyware and other malware on up-to-date and fully protected computers using cloud\nprotection and behavioral detections, to protect yourself against these types of threats in the\nfuture!\n\n\n-----\n\n[Purchase Premium](https://www.cleverbridge.com/747/?affiliate=1878&scope=cart&cart=69061)\nDisclaimer: While we do earn a commission from the sale of the above products, rest\nassured we only recommend them due to their effectiveness.\n\n### This is a self-help guide. Use at your own risk.\n\nBleepingComputer.com can not be held responsible for problems that may occur by using\nthis information. If you would like help with any of these fixes, you can ask for malware\nremoval assistance in our Virus,Trojan,Spyware, and Malware Removal Logs forum.\n\nIf you have any questions about this self-help guide then please post those questions in our\nAm I infected? What do I do? and someone will help you.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-17 - Remove Search.searchetan.com Chrome New Tab Page.pdf"
    ],
    "report_names": [
        "2017-04-17 - Remove Search.searchetan.com Chrome New Tab Page.pdf"
    ],
    "threat_actors": [
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535928,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653687489,
    "ts_modification_date": 1653687489,
    "files": {
        "pdf": "https://archive.orkl.eu/a0888deab361fe4f140f83f609955c38da9f580c.pdf",
        "text": "https://archive.orkl.eu/a0888deab361fe4f140f83f609955c38da9f580c.txt",
        "img": "https://archive.orkl.eu/a0888deab361fe4f140f83f609955c38da9f580c.jpg"
    }
}