{
    "id": "1e6e3f67-50d0-4ddb-84ac-0788df448300",
    "created_at": "2023-01-12T15:08:26.011083Z",
    "updated_at": "2025-03-27T02:17:05.834217Z",
    "deleted_at": null,
    "sha1_hash": "872035dae3fe22c7e06ec73eec8b5a6e9aee1e75",
    "title": "2021-02-09 - Water, Water Everywhere – But Nary a Hacker to Blame",
    "authors": "",
    "file_creation_date": "2022-05-28T19:40:13Z",
    "file_modification_date": "2022-05-28T19:40:13Z",
    "file_size": 606566,
    "plain_text": "# Water, Water Everywhere – But Nary a Hacker to Blame\n\n**[pylos.co/2021/02/09/water-water-everywhere-but-nary-a-hacker-to-blame/](https://pylos.co/2021/02/09/water-water-everywhere-but-nary-a-hacker-to-blame/)**\n\nJoe 02/09/2021\n\n[Multiple](https://www.tampabay.com/news/pinellas/2021/02/08/someone-tried-to-poison-oldsmars-water-supply-during-hack-sheriff-says/) [entities reported an attempt to dramatically alter operational parameters at a water](https://www.reuters.com/article/us-usa-cyber-florida/hackers-broke-into-florida-towns-water-treatment-plant-attempted-poisoning-sheriff-says-idUSKBN2A82FV)\ntreatment plant in [Oldsmar, Florida in the United States on 08 February 2021. The intrusion](https://goo.gl/maps/mneFSGTqbKPZ126VA)\nand manipulation focused on a municipally-owned treatment facility. As an item of potential\n[coincidence, the intrusion appears to have overlapped with the American football Super Bowl](https://en.wikipedia.org/wiki/Super_Bowl_LV)\n[located at Raymond James Stadium in Tampa Bay, Florida – approximately 13 miles away,](https://goo.gl/maps/Nni8xhabxv6dbZUr5)\nbut served by a completely separate water system. Irrespective of such tangential links,\nsubsequent reporting from Chris Bing identified an externally-accessible Teamviewer\ninstance as the source of the intrusion.\n\nOnce inside the network, details are scarce but apparently the entity increased levels of\n[sodium hydroxide in the treatment system. Likely via interaction with a Human Machine](https://www.chemicalsafetyfacts.org/sodium-hydroxide/#:~:text=Sodium%20Hydroxide%20in%20Water%20Treatment,sodium%20hypochlorite%2C%20a%20water%20disinfectant.)\nInterface (HMI) through the Teamviewer connection, the intruder increased sodium hydroxide\nlevels from 100 Parts per Million (PPM) to 11,100 PPM. Sodium hydroxide, referred to\n[colloquially as lye, is a caustic substance that can cause burns to soft tissues or damage to](https://www.britannica.com/science/lye)\nthe lungs when in aerosol form. While commonly used in water treatment operations, at such\nconcentrations as attempted by the entities in this incident, the substance would be harmful\n\n\n-----\n\nto any persons coming in contact with the tainted water. Luckily, operator monitoring of the\nenvironment caught the manipulation and mitigated the incident before any harm could\nresult.\n\nYet for all the concern and mounting hype around this issue, and despite it not resulting in\nany known significant impact, multiple questions come to mind. Primary in the minds of many\nwould be who is responsible, although personally I am more intrigued by intent. Looking at\n[the incident as described in reporting and local press conferences, it appears that the](https://www.youtube.com/watch?v=MkXDSOgLQ6M&ab_channel=PinellasSheriff)\nintruder authenticated to the network while it was monitored by personnel, resulting in not\nonly an alarm but quick action to reverse process changes which minimized impact. While\nwe can praise operators for reversing circumstances to prevent harm, the very fact that this\nwas possible presents some curious items for further analysis.\n\nPrincipally, the lack of alteration to or denial of process visibility and control in this case is\n[curious. As seen in previous industrial-targeting incidents, from the 2015 and](https://ics.sans.org/media/E-ISAC_SANS_Ukraine_DUC_5.pdf) [2016 Ukrainian](https://www.dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf)\npower events to the [2017 Petro Rabigh incident, attackers needed to either remove operator](https://www.eenews.net/stories/1060123327)\nvisibility and control (Ukraine) or completely evade operator attention (Petro Rabigh) to even\nhope to achieve mission success. Alteration of process parameters combined with continued\nvisibility and operator positive control over the environment means that any changes made\nthrough remote access can be quickly detected and reversed by engineers and staff. In the\ncase of the Oldsmar water treatment system, operators were not only still able to monitor the\nenvironment, but still possessed positive control over operations to quickly catch and prevent\nany significant adverse effect – a complete and abject failure for the unknown adversary.\n\nPlotted along a continuum of Industrial Control System (ICS) attack maturity, the Oldsmar\n“attack” seems both primitive and simplistic in nature. Given what limited information is\ncurrently available about the incident, the intruder appears to have leveraged an insecure or\nweakly-protected Teamviewer remote access instance to gain control over the system.\nSuperficially, this would appear no different from [two](https://www.otorio.com/blog/what-we-ve-learned-from-the-december-1st-attack-on-an-israeli-water-reservoir/) [waves of “opportunistic access” activity](https://www.timesofisrael.com/cyber-attacks-again-hit-israels-water-system-shutting-agricultural-pumps/)\nagainst water-related systems in Israel during 2020. In these instances, intruders leveraged\ninsecure remote access mechanisms to gain control over several water pumping or\ntreatment systems. While such operations are concerning given adversary brazenness and\nlack of concern, they also are incredibly unsophisticated in nature – representing a burglar\nopening an unlocked door more than a thief penetrating a well-resourced security system.\nWhile we do not know the particulars of the Oldsmar system at this time, limited evidence\nand significant experience points to a situation similar to what occurred in Israel, where\ninsecure systems were remotely accessible and entities simply took advantage of\ncircumstances.\n\nSo just what the hell was the intruder thinking when they penetrated the relevant control\nsystems? If this was in fact a state-nexus, cyber-physical disruption operation, that actor was\nboth ignorant and incompetent in how to successfully manipulate and undermine an ICS\nenvironment. In addition to failing to address operator view and control items, discussed\npreviously the adversary also entered a completely outlandish value for increasing sodium\n\n\n-----\n\nhydroxide levels – increasing the presence of this chemical by a factor of over 100. While we\ncannot completely know how this would work within the impacted environment, experience\nand process awareness indicate such astronomically high values would be identified,\nflagged, or even mitigated by engineering controls, whether through limiting the release of\nsodium hydroxide to the system to prevent overloading or triggering a shutdown in response\nto widely anomalous values. If a state-directed or -sponsored entity is responsible for this\nevent, they should return to their dayjob of DDoS’ing websites and similar low-capability\nactivity, as they’ve clearly demonstrated a lack of fitness for industrial intrusions.\n\nAlternatively, this intrusion may be the result of something more benign in nature although no\nless sinister in implication. Especially given Oldsmar’s location near the stadium hosting the\nAmerican football Super Bowl, probing for remotely accessible infrastructure in the general\narea would appear to be a tantalizing target for an ethically ambiguous researcher or similar\nentity. While in-depth process and infrastructure analysis would show that the stadium (and\nits environs) are served by a completely separate water supply, such insights are not\navailable to someone simply browsing Shodan for open access to critical systems. In the\ncourse of such exploration, bringing up a logon page is a simple click from the infrastructure\nscanning services’ web GUI – guessing common credentials an ethically significant but\ntechnically minor step further, provided any authentication was present on the link at all.\nWhile the following is pure speculation, the 11,000 PPM sodium hydroxide increase would\nseem to represent a “shot in the dark” value change as opposed to any operationally savvy\nactor’s adjustment of values to both maximize damage while minimizing detection. Although\nsuch an action would represent a significant degree of callousness and depravity, such a\nnice, “round” and outrageous number also implies lack of familiarity with the system in\nquestion.\n\nOverall, there remain many questions about this incident – but we can be fairly certain of\nsome observations:\n\n1. This event is clearly not on par with past, physically disruptive ICS-targeting events\n\nsuch as the Ukraine power incidents, the Petro Rabigh event, or Stuxnet.\n2. Based on available information and observations, this event appears to align more with\n\nopportunistic subversion of weakly-protected remote access mechanisms to gain entry\nto the victim network.\n3. Although deeply concerning, the lack of attempts to hide, mask, or otherwise obfuscate\n\noperations within the ICS environment not only led to rapid operator intervention to\nmitigate the incident, but also betrays a significant immaturity and lack of technical\nunderstanding on the part of the adversary.\n\nAlthough concerning for the simple fact that some unknown entity attempted to manipulate\nthe supply of a potentially noxious, corrosive chemical in a community’s water supply, the\nactual details as they are known right now indicate this was hardly a sophisticated or well\n\n-----\n\nplanned incident. In the absence of clarifying evidence, this incident appears more aligned\nwith the opportunistic intrusions into Israeli water systems than any other well-planned and\nthought-out manipulation to industrial control systems for damaging effect.\n\nHowever – it is worth noting that despite the lack of technical sophistication or even likely\nbasic understanding of the compromised network, some unknown entity still attempted this\noperation. This observation on its own is deeply concerning and far more significant than the\nlimited technical details of the event in question. That unknown, technically immature entities\nwould not only access a water treatment system remotely but then interact with its controls\nfor chemical dispersal is highly problematic. While our “primary concerns” in critical\ninfrastructure defense will remain sophisticated state-sponsored entities such as Sandworm\nfor the foreseeable future, events such as those which took place at Oldsmar show that there\nare a number of other, less mature but nonetheless quite concerning entities also probing\nthis space. While their efforts may be lacking or laughable depending on perspective, their\nintent remains an item of immediate worry – and an item emphasizing that critical\ninfrastructure asset owners and operators must take these threats (even the least\ncompetent) seriously.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-09 - Water, Water Everywhere – But Nary a Hacker to Blame.pdf"
    ],
    "report_names": [
        "2021-02-09 - Water, Water Everywhere – But Nary a Hacker to Blame.pdf"
    ],
    "threat_actors": [
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4ac28d1-66eb-4f2d-9f9b-a72394349fd0",
            "created_at": "2023-01-06T13:46:38.667954Z",
            "updated_at": "2025-03-27T02:00:02.887442Z",
            "deleted_at": null,
            "main_name": "APT4",
            "aliases": [
                "PLA Navy",
                "MAVERICK PANDA",
                "BRONZE EDISON",
                "SODIUM",
                "Salmon Typhoon"
            ],
            "source_name": "MISPGALAXY:APT4",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6fbff48b-7a3e-4e54-ac22-b10f11e32337",
            "created_at": "2022-10-25T16:07:23.318008Z",
            "updated_at": "2025-03-27T02:02:09.734465Z",
            "deleted_at": null,
            "main_name": "APT 4",
            "aliases": [
                "APT 4",
                "Bronze Edison",
                "Maverick Panda",
                "Salmon Typhoo",
                "Sodium",
                "Sykipot",
                "TG-0623",
                "Wisp Team"
            ],
            "source_name": "ETDA:APT 4",
            "tools": [
                "Getkys",
                "Sykipot",
                "Wkysol",
                "XMRig"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536106,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653766813,
    "ts_modification_date": 1653766813,
    "files": {
        "pdf": "https://archive.orkl.eu/872035dae3fe22c7e06ec73eec8b5a6e9aee1e75.pdf",
        "text": "https://archive.orkl.eu/872035dae3fe22c7e06ec73eec8b5a6e9aee1e75.txt",
        "img": "https://archive.orkl.eu/872035dae3fe22c7e06ec73eec8b5a6e9aee1e75.jpg"
    }
}