{
    "id": "1e73bbb8-61e8-482e-a33d-bc4a994389a7",
    "created_at": "2023-04-05T02:09:34.046175Z",
    "updated_at": "2025-03-27T02:05:39.872086Z",
    "deleted_at": null,
    "sha1_hash": "4597d984575c3b252a157226ece5f52c6a539187",
    "title": "2023-03-27 - DBatLoader- Actively Distributing Malwares Targeting European Businesses",
    "authors": "",
    "file_creation_date": "2023-04-03T08:57:09Z",
    "file_modification_date": "2023-04-03T08:57:09Z",
    "file_size": 4130168,
    "plain_text": "# DBatLoader Actively Distributing Malwares Targeting Europea\n\n**[zscaler.com/blogs/security-research/dbatloader-actively-distributing-malwares-targeting-european-businesses](https://www.zscaler.com/blogs/security-research/dbatloader-actively-distributing-malwares-targeting-european-businesses)**\n\nThis Zscaler ThreatLabz research article investigates the latest malware campaign of DBatLoader, which is being used by threat actors to\ntarget various businesses in European countries with Remcos RAT and Formbook. The article provides a detailed analysis of DBatLoader's\nbehavior and its attack process, which includes creating a mock trusted directory, using an executable to load the malicious DLL script, and\nexecuting powershell commands in BAT script to exclude Microsoft Defender scanning. The article also highlights the use of different file\nformats and obfuscation methods to avoid detection from antivirus engines. ThreatLabz in-depth analysis of DBatLoader includes the\nidentification of key indicators of compromise and mapped MITRE ATT&CK techniques used by the attackers. The researchers conclude by\nrecommending that users and organizations stay vigilant against such malspam phishing campaigns and use advanced security solutions to\ndefend against malware.\n\n## Introduction:\n\nThe ThreatLabz research team at Zscaler remains vigilant in monitoring active threat campaigns. Recently, the team identified a new campaign\ninvolving DBatLoader also known as ModiLoader that specifically targets manufacturing companies and various businesses in European\ncountries via phishing emails. The malware payload is distributed through WordPress websites that have authorized SSL certificates, which is\na common tactic used by threat actors to evade detection engines. Throughout this campaign, researchers observed multiple techniques\nemployed by the threat actor in the phishing emails to distribute Remcos RAT and Formbook via DBatLoader / ModiLoader.\n\n## Key Takeaways:\n\nZscaler's ThreatLabz Research team identified a new DBatLoader campaign distributing Remcos RAT and Formbook malware.\nThe campaign targets manufacturing companies and multiple businesses in European countries through phishing emails.\nThe malicious payload is distributed through WordPress sites with authorized SSL certificates.\nMultiple techniques are used in phishing emails to deceive users into downloading the payload, including using courier-themed schemes\nand disguising PDF attachments as Revised Order Documents, Payment Invoices, Quotations, Sales Orders, and similar items.\nThe attackers use multilayer obfuscation techniques and various file formats, such as PDF, HTML, ZIP, and OneNote, to deliver the\npayload.\nThe malwares analyzed during this investigation uses mock trusted directories to bypass Windows User Account Control (UAC) and\nelevate to higher privileges without displaying a UAC prompt.\nDBatLoader creates a copy of itself and a file with .url extension for persistence and creates an autorun registry key to survive reboots.\n\n_Fig.1 - Campaign targeting manufacturing companies - source: Zscaler Cloud_\n\n## RemcosRAT Campaign Overview:\n\nThis diagram illustrates how the Remcos RAT was distributed and executed on the victim's machine during the campaign:\n\n_Fig.2 - Attack chain and execution flow of RemcosRAT_\n\nThe attack begins with a phishing email titled \"Purchase Order SZ5-9-020\" that appears to come from a manufacturing company based on a\nquick examination of the domain and footer. The email is crafted to deceive users into opening the attachments without suspicion. The\nattached PDF file contains a malicious link labeled \"View Secured Document.\" Clicking on this link downloads a CAB file, which stores\ninstallation data and ultimately downloads and executes DBatLoader and Remcos RAT.\n\n\n-----\n\n_Fig.3 - Phishing email with attached malicious PDF_\n\nThe CAB file that is downloaded includes an LNK file with a PDF extension designed to trick users into opening it. Once the payload is\nextracted, a PowerShell script is executed to download and run DBatLoader.\n\n_Fig.4 - Downloaded CAB file and execution of LNK file_\n\nSeveral similar attacks have been observed from the beginning of this year, all originating from the same WordPress site, using\nDBatLoader/ModiLoader to download Remcos RAT. The threat actor(s) behind these attacks employs the same attack chain, but pretends to\nbe a different manufacturing company each time to evade detection and deceive victims.\n\n\n-----\n\n_g 5_ _S_ _a attac c a_ _t_ _d e e t p s_ _g e_ _a_\n\nDuring the investigation of active campaigns, various shortcut files with names like \"Quotation.pdf.lnk\" and\n\"Revised_Order_Document.pdf.lnk\" were discovered. These shortcuts were responsible for downloading DBatLoader/ModiLoader with\nRemcos RAT from the same WordPress site.\n\n## Formbook Stealer Campaign Overview:\n\nDuring investigation, a courier-themed phishing email was discovered, which delivered Formbook via DBatLoader/ModiLoader. The payload\nwas downloaded from a WordPress site with an .eu (European Union) top-level domain and authorized SSL certificate. Multiple malicious\nPDFs with embedded links were also found, which used a similar trick to the Remcos RAT campaign to download DBatLoader/Formbook from\nthe WordPress site.\n\n_Fig.6 - Formbook campaign attack chain_\n\n## Other Observed Techniques in DBatLoader Campaign:\n\nSeveral other phishing emails were discovered during the course of investigating this campaign, using malicious files in various formats such\nas HTML and OneNote as attachments. These are described below.\n\nIn an HTML-based campaign, the threat actor employs a multi-layered obfuscated HTML file as an attachment to deploy the DBatLoader\npayload on the targeted system.\n\n_Fig.7 - HTML-based attachment campaign_\n\nFlow of HTML file to drop ISO file which contains DBatLoader payload:\n\n\n-----\n\nase6 Ja asc pt ase6 SO op SO e at oade pay oad\n\nThe flow of the HTML file involves dropping an ISO file that contains the DBatLoader payload. The HTML file is first processed through Base64\nJavascript, which then leads to the Base64-encoded ISO file. Finally, the ISO file is dropped to execute the DBatLoader payload.\n\n_Fig.8 - HTML obfuscation to drop ISO file_\n\nIn a OneNote attachment campaign, threat actors utilized OneNote attachments to drop the DBatLoader in a campaign targeting various\nbusinesses. The latest technique involved hiding the embedded malicious payload behind a fake button, deceiving users into running the\nmalware. Since November 2022, an increase in the use of OneNote files as initial vectors for malware distribution has been observed. To learn\n[more, check out the Zscaler ThreatLabz research blog on OneNote released earlier this month for more detailed information on related](https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution)\ncampaigns and obfuscation techniques.\n\nTwo phishing attacks with the same malspam sender name were discovered in this campaign, and the attached OneNote files contained the\nembedded DBatLoader payload.\n\n\n-----\n\n_Fig.9 - OneNote attachment campaign_\n\n## Technical Analysis of DBatLoader/ModiLoader:\n\nDBatLoader/ModiLoader/NatsoLoader is a Delphi compiled binary that drops final payloads like Formbook, Remcos RAT, Netwire RAT, and\nWarzone RAT. It uses multi-layer obfuscation and image steganography techniques to hide the initial stage from detection engines and\ndownload obfuscated later stage payloads from public cloud services like OneDrive and Google Drive. The Loader doesn't use any AntiDebug/Anti-VM/Anti-Sandbox techniques.\n\n### Stage 1:\n\nIn the first stage, four steps are followed: Extraction, Decoding, Allocation, and Execution.\n\n**Step 1 - Extraction:**\n\nIn this stage Form has been created via the ‘TFormSplash_FormCreate’ in this there is a function named ‘Oncreate()’ which contains the\nactual Code for the Loader.\n\n_Fig.10 -Function Oncreate()_ _contains the Loadercode_\n\nDBatLoader's resource section contains a GIF image as the second stage encrypted payload.\n\n_Fi_ _11_ _E_ _t d GIF_ _l_ _d i_ _ti_\n\n\n-----\n\ne o o g u ct o at oade s espo s b e o ead g e coded data o t e us esou ce a e t t e e a d subseque t y\nloading it into memory.\n\n**Step 2 - Decoding:**\n\n_Fig.13 - Decoding function_\n\nThe following is an explanation of the function's logic:\n\nThe encrypted byte from the resource section is added to the number 79.\nIf the resulting value exceeds 255, an Overflow occurs, and the excess amount is ignored and stored in a variable.\nOtherwise, the result is stored in the same variable.\nThe resulting value is then converted from hexadecimal to string, and individual bytes are retrieved to decode the second stage DLL\npayload.\n\nExample python script used to decode the payload:\n\n_Fig.14 - Python script to decode payload_\n\n**Step 3 - Allocation:**\n\nOnce the payload has been decoded, the F_Execution_main function is responsible for allocating the decoded payload into memory.\n\n_Fig.15 -Function for memory allocation_\n\nThe decrypted payload will be allocated in the memory of the DBatLoader's own process through the use of the 'VirtualAlloc' API. This\ndecrypted payload constitutes the second stage DLL, which carries out additional malicious activities of the DBatLoader. It is worth noting that\nthe second stage payload can take the form of either a DLL or an executable (EXE) file.\n\n\n-----\n\n_Fig.16 - VirtualAlloc API used for memory allocation_\n\n**Step 4 - Execution:**\n\nThe main function calls another function, passing the decoded value of the second stage as an argument, in order to execute the final payload.\n\n_Fig.17 - Function for execution_\n\n### Stage 2:\n\nOnce the first-stage DBatLoader loads the decoded second-stage payload into memory, the second-stage payload drops four files on the\ninfected system's disk path 'C:\\Users\\Public\\Libraries'. The dropped files include two batch files named 'XdfiifagO.bat' and 'KDECO.bat',\none DLL file named 'netutils.dll', and one executable file named 'easinvoker.exe'.\n\n_Fig.18 - Initial Bat script_\n\nThe first 'XdfiifagO.bat' batch file then leverages a well-known technique of bypassing Windows User Account Control (UAC) called the 'Mock\nTrusted Directories Method' to escalate privileges without displaying a UAC prompt. This method involves creating a fake directory with extra\nwhitespace and the same name to a legitimate trusted location, such as \"C:\\Windows \\System32\", and copying the required files to it.\n\nSince the mock directory cannot be created through the Windows Explorer User Interface, the attacker uses a script to create it. Once the\ndirectory is created, the batch file copies the legitimate ‘easinvoker.exe’ executable, the malicious ‘netutils.dll’, and the ‘KDECO.bat’ script\ninto it. The script then executes ‘easinvoker.exe’ from the mock directory and adds a delay using the 'ping 127.0.0.1 -n 6 > nul' command.\nFinally, the mock directory is deleted.\n\nThe auto-elevated ‘easinvoker.exe’ executable is vulnerable to the 'relative path DLL Hijack' variant of DLL Hijacking. Windows\nautomatically elevates this process without displaying a UAC prompt if it is located in a trusted directory. Therefore, the attacker copies\n‘easinvoker.exe’ to the mock directory and uses it to load the malicious ‘netutils.dll’, which in turn executes the ‘KDECO.bat’ script.\n\n_Fig.19 - Second Bat script_\n\n\n-----\n\ne sc pt **CO bat** c udes o e S e co a ds t at e c ude t e C \\Use s d ecto y o be g sca ed by c oso t e e de\n\n_Fig.20 - Function to create .url file_\n\nDBatLoader achieves persistence by creating a copy of itself and a file called ‘gafiifdX.url’ in the 'C:\\Users\\Public\\Libraries' directory. The\n'gafiifdX.url' file is an internet shortcut that executes the dropped malicious payload on the system. By using this file, DBatLoader creates an\nautorun registry key under 'HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run' to survive a reboot.\n\nHere is the content of the 'gafiifdX.url' file:\n\n[InternetShortcut]\n\nURL=file:\"C:\\\\Users\\\\Public\\\\Libraries\\\\Xdfiifag.exe\"\n\nIconIndex=13\n\nHotKey=49\n\n## Conclusion\n\nIn conclusion, DBatLoader is a sophisticated malware that is actively targeting various businesses, primarily in European countries, with the\nRemcos RAT. It uses multiple file formats and obfuscation methods to avoid detection from antivirus engines. DBatLoader drops several files,\nincluding DLLs, EXEs, and batch files, to perform its malicious activities. The malware is distributed through a phishing campaign that\ncontinuously adapts to new distribution mechanisms. Zscaler's Threat Labs team analyzed the behavior of various files associated with\nDBatLoader using the MITRE ATT&CK framework and displayed the threat scores and techniques triggered. The team is continuously\nmonitoring the campaign and will bring to light any new findings they discover. Organizations must remain vigilant and employ best practices to\nprotect against such threats, including security awareness training and implementing multi-layered security defenses.\n\n## Zscaler Sandbox Coverage\n\nZscaler Sandbox was used to analyze the behavior of different files during the investigation of this campaign, the results show the threat\nscores and the specific MITRE ATT&CK techniques triggered as shown in the screenshots below.\n\n\n-----\n\n_Fig.21 - DBatLoader/ModiLoader Zscaler sandbox report_\n\nZscaler’s multilayered cloud security platform detects payloads with following threat names:\n\n## MITRE ATT&CK Techniques:\n\n**Tactic** **Technique ID** **Technique Name**\n\n\nExecution [T1064](https://attack.mitre.org/techniques/T1064)\n\n[T1059.001](https://attack.mitre.org/techniques/T1059/001)\n\n\nScripting\n\nPowerShell\n\n\nPersistence [T1547.001](https://attack.mitre.org/techniques/T1547/001) Registry Run Keys / Startup Folder\n\nPrivilege Escalation [T1574.002](https://attack.mitre.org/techniques/T1574/002) DLL Side-Loading\n\n\nDefense Evasion [T1562.001](https://attack.mitre.org/techniques/T1562/001)\n\n[T1140](https://attack.mitre.org/techniques/T1140)\n\n[T1064](https://attack.mitre.org/techniques/T1064)\n\n[T1027](https://attack.mitre.org/techniques/T1027)\n\n[T1027.002](https://attack.mitre.org/techniques/T1027/002)\n\n[T1070.006](https://attack.mitre.org/techniques/T1070/006)\n\n[T1574.002](https://attack.mitre.org/techniques/T1574/002)\n\n[T1070.004](https://attack.mitre.org/techniques/T1070/004)\n\n[T1036](https://attack.mitre.org/techniques/T1036)\n\n[T1497](https://attack.mitre.org/techniques/T1497)\n\n[T1055](https://attack.mitre.org/techniques/T1055)\n\n\nDisable or Modify Tools\n\nDeobfuscate/Decode Files or Information\n\nScripting\n\nObfuscated Files or Information\n\nSoftware Packing\n\nTimestomp\n\nDLL Side-Loading\n\nFile Deletion\n\nMasquerading\n\nVirtualization/Sandbox Evasion\n\nProcess Injection\n\n\n-----\n\nDiscovery [T1124](https://attack.mitre.org/techniques/T1124)\n\n[T1083](https://attack.mitre.org/techniques/T1083)\n\n[T1082](https://attack.mitre.org/techniques/T1082)\n\n[T1518.001](https://attack.mitre.org/techniques/T1518/001)\n\n[T1057](https://attack.mitre.org/techniques/T1057)\n\n[T1010](https://attack.mitre.org/techniques/T1010)\n\n[T1018](https://attack.mitre.org/techniques/T1018)\n\n[T1016](https://attack.mitre.org/techniques/T1016)\n\n\nSystem Time Discovery\n\nFile and Directory Discovery\n\nSystem Information Discovery\n\nSecurity Software Discovery\n\nProcess Discovery\n\nApplication Window Discovery\n\nRemote System Discovery\n\nSystem Network Configuration Discovery\n\n\nCollection [T1560](https://attack.mitre.org/techniques/T1560) Archive Collected Data\n\n\nCommand and Control [T1219](https://attack.mitre.org/techniques/T1219)\n\n[T1573](https://attack.mitre.org/techniques/T1573)\n\n[T1571](https://attack.mitre.org/techniques/T1571)\n\n[T1095](https://attack.mitre.org/techniques/T1095)\n\n[T1071](https://attack.mitre.org/techniques/T1071)\n\n\nRemote Access Software\n\nEncrypted Channel\n\nNon-Standard Port\n\nNon-Application Layer Protocol\n\nApplication Layer Protocol\n\n\n## Indicators of Compromise (IOCs):\n\n### Remcos RAT Campaign:\n\n**File Name** **Md5** **Description** **Network Activity/C2**\n\nPurchase Order SZ5-9-020.msg d51576e2e216292a72ce16821f9696d3 Phishing mail \n\nRevised Order Document.pdf 0e8aefd1dade4f059c2881c6e05f689f Malicious\nattachment\n\nRevised_Order_Document.cab ef02ba99d974787a70085537918117c4 Downloaded CAB\nfile\n\n\nhxxps://silverline[.]com[.]s\n\n\n\nRevised_Order_Quotation.pdf.lnk 4c39cdd2bfb2c7dde761a6e5b8c01321 Extracted LNK file hxxps://silverline[.]com[.]s\n\n\nXdfiifagcwrbrg.exe 85b2a41e98412f2867715c9ae5ad27ac DBatLoader/Remcos\nRAT\n\nSZ59020_JF_KOREA_Co_Ltd_Sales_Order.pdf c1d19535ded9e0ff8e293f6852b24b91 Malicious\nattachment\n\nSZ59020_JF_KOREA_Co_Ltd_Sales_Order.cab 1d1f8534ee6dbe1dbeade30e912a9136 Downloaded CAB\nfile\n\nSZ59020_JF_KOREA_Co_Ltd_Sales_Order.pdf.lnk f0b7bad0eb081c6b7d3df74e733efd1c Extracted LNK file\ndownload payload\n\nFsofwcqmhvvgna.exe 00c168883239c13aa213a5337aca3dae DBatLoader/Remcos\nRAT\n\nQuotation.pdf.lnk aa8836fa3879074748f6dca63476aba9 Malicious LNK file\ndownload payload\n\n\n185[.]246[.]220[.]63\n\nhxxps://silverline[.]com[.]s\n\n\nhttps://silverline[.]com[.]sg\n\n185[.]246[.]220[.]63\n\nhxxps://silverline[.]com[.]s\n\n\n-----\n\nDvicvwxfouxvgm.exe b2d368435d5896419751add4cc338fc4 DBatLoader/Remcos\nRAT\n\nRevised_Order_Document.pdf.lnk be889f4ab5ce7e99c131463c58205ba0 Malicious LNK file\ndownload payload\n\n### Formbook Stealer Campaign:\n\n\nhallowed247[.]duckdns[.]o\n\nhxxps://silverline[.]com[.]s\n\n\n**File Name** **Md5** **Description** **Network Activity/C2**\n\n\nA0034372876RFQ 02 14\n23.msg\n\n\nd9844515b7d09d74de188856b60c88c0 Phishing mail hxxps://sleda[.]sleda[.]eu/wpcontent/themes/A0034372876RFQ021423.ca\n\n\nA0034372876RFQ.pdf 10904cb6103086d04ba0d76bcf7a65dc Malicious PDF hxxps://sleda[.]sleda[.]eu/wpcontent/themes/A0034372876RFQ021423.ca\n\nA0034372876RFQ.pdf 1978b12cacb91b0d0f77a9979db9e671 Malicious PDF hxxps://sleda[.]sleda[.]eu/wpcontent/themes/A0034372876RFQ021423.ca\n\nA0034372876RFQ021423.cab 3dde7b13d4736c11a67bc8fbad976d37 Downloaded CAB File \nA0034372876RFQ021423.exe fb7dbeea12e4729cf11d6de8588f2b7e DBatLoader/Formbook thesquirrelgame[.]net\n\nb-yy[.]xyz\n\n### HTML Attached Campaign:\n\n**File Name** **Md5** **Description**\n\n - cdac8ab69c92d012de0650c64be1c335 Phishing Mail\n\nAttached Document.html eb4f0ea5aea6a1cab3d257cfb04023e2 Attached HTML File\n\nAttachment.ISO d9bfe352512b49e002a2744f9d80879a Dropped ISO File\n\nDOCX Specification and Drawing Document874559_PDF.exe 42d872a2eae6e4f0d171d1f291846e30 DBatLoader\n\n - 9e7212a41b4885094008bfe2c5e1b54e Phishing Mail\n\nNeue Anfrage 8748859GDTE.html e7ab3b74689203a229a62b87865f1e7c Attached HTML File\n\nNeue_Anfrage.iso 35e8d4c313c7e793a5cc92995147a310 Dropped ISO File\n\nNeue Anfrage 8748859GDTE.scr 1d177fccdcc51ad5d20545bd65d9c352 DBatLoader/NetWireRC RAT\n\n### OneNote Attached Campaign:\n\n**File Name** **Md5** **Description**\n\nPROPERTY PURCHASE & SALE.msg cac32da3ef6d2c4551e73ebfafef4393 Phishing Mail\n\nEstate Property.one 1c19601797e347b2c70c0cd48f7ccd9d Attached OneNote File\n\nXnsheycoorkeea.exe b11db475600ad34d68ad26fb30abe498 DBatLoader/Remcos RAT\n\n\n-----\n\nf3232e7b-fb3b-34f3-51bd-249570f678de.eml bc701846e84feb25a355f34194e2a957 Phishing Mail\n\nConstructionDocuments.one 04ecfc3fa0c53151d976f2d6fbd65c31 Attached OneNote File\n\nYokzgytdjocuus.exe b1b76651c4db6ab4742722ce54e38789 DBatLoader/Remcos RAT\n\n### DBatLoader/ModiLoader IoCs:\n\n**File Name** **Md5** **Description**\n\nXdfiifagO.bat 55aba243e88f6a6813c117ffe1fa5979 Initial Bat File\n\nKDECO.bat 213c60adf1c9ef88dc3c9b2d579959d2 Second Bat File\n\neasinvoker.exe 231ce1e1d7d98b44371ffff407d68b59 Legitimate Windows executable\n\nnetutils.dll b375e74a145c45d07190212e9157e5f8 Malicious DLL\n\n## Appendix:\n\n**Python script to decode encrypted resource section of DBatLoader -**\n\nwith open(\"<YourencodedFile>\", \"rb\") as f:\n\nbytes_read = f.read()\n\nwith open (\"my_file.dll\",\"wb\"):\n\npass\n\nfor b in bytes_read:\n\nnewb = b + 79\n\nif newb > 255:\n\nlower_bytes = (newb - 256)\n\nelse:\n\nlower_bytes = newb\n\nnew_format = format(lower_bytes,'x')\n\nif len(new_format) == 1:\n\nnew_format = \"0\" + new_format\n\nprint(new_format)\n\nwith open(\"my_file.dll\", \"ab\") as binary_file:\n\nbinary_file.write(bytes.fromhex(new_format))\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-27 - DBatLoader- Actively Distributing Malwares Targeting European Businesses.pdf"
    ],
    "report_names": [
        "2023-03-27 - DBatLoader- Actively Distributing Malwares Targeting European Businesses.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660574,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1680512229,
    "ts_modification_date": 1680512229,
    "files": {
        "pdf": "https://archive.orkl.eu/4597d984575c3b252a157226ece5f52c6a539187.pdf",
        "text": "https://archive.orkl.eu/4597d984575c3b252a157226ece5f52c6a539187.txt",
        "img": "https://archive.orkl.eu/4597d984575c3b252a157226ece5f52c6a539187.jpg"
    }
}