{
    "id": "1ea479fe-0337-4a07-922e-7ec4e4b7cd6c",
    "created_at": "2023-01-12T15:07:12.311702Z",
    "updated_at": "2025-03-27T02:06:00.104465Z",
    "deleted_at": null,
    "sha1_hash": "e63102bcc4aadf6faf2b25349604cf54451bcacc",
    "title": "2020-12-04 - The chronicles of Emotet",
    "authors": "",
    "file_creation_date": "2022-05-28T04:48:58Z",
    "file_modification_date": "2022-05-28T04:48:58Z",
    "file_size": 1878730,
    "plain_text": "# The chronicles of Emotet\n\n**securelist.com/the-chronicles-of-emotet/99660/**\n\nAuthors\n\nOleg Kupreev\n\nMore than six years have passed since the banking Trojan Emotet was first detected. During\nthis time it has repeatedly mutated, changed direction, acquired partners, picked up\nmodules, and generally been the cause of high-profile incidents and multimillion-dollar\nlosses. The malware is still in fine fettle, and remains one of the most potent cybersecurity\nthreats out there. The Trojan is distributed through spam, which it sends itself, and can\nspread over local networks and download other malware.\n\nAll its “accomplishments” have been described thoroughly in various publications and reports\nfrom companies and independent researchers. This being the case, we decided to\nsummarize and collect in one place everything that is currently known about Emotet.\n\n## 2014\n\n\n-----\n\n### June\n\nEmotet was first discovered in late June 2014 by TrendMicro. The malware hijacked user\n[banking credentials using the man-in-the-browser technique. Even in those early days, the](https://encyclopedia.kaspersky.com/glossary/man-in-the-browser-attack/?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\nmalware was multicomponent: browser traffic was intercepted by a separate module\ndownloaded from the C&C server. Its configuration file with web injections was also loaded\nfrom there. The banker’s main targets were clients of German and Austrian banks, and its\nmain distribution vector was spam disguised as bank emails with malicious attachments or\nlinks to a ZIP archive containing an executable file.\n\n**_Examples of malicious emails with link and attachment_**\n\n### November\n\n\n-----\n\nIn the fall of 2014, we discovered a modification of Emotet with the following components:\n\nModule for modifying HTTP(S) traffic\nModule for collecting email addresses in Outlook\nModule for stealing accounts in Mail PassView (a password recovery tool)\nSpam module (downloaded additionally as an independent executable file from\naddresses not linked to C&C)\nModule for organizing DDoS attacks\n\nWe came across the latter bundled with other malware, and assume that it was added to\nEmotet with a cryptor (presumably back then Emotet’s authors did not have their own and so\nused a third-party one, possibly hacked or stolen). It is entirely possible that the developers\nwere unaware of its presence in their malware. In any event, this module’s C&C centers were\nnot responsive, and it itself was no longer updated (compilation date: October 19, 2014).\n\nIn addition, the new modification had begun to employ techniques to steal funds from victims’\nbank accounts automatically, using the so-called Automatic Transfer System (ATS). You can\n[read more about this modification in our report.](https://securelist.com/the-banking-trojan-emotet-detailed-analysis/69560/)\n\n### December\n\nThe C&C servers stopped responding and the Trojan’s activity dropped off significantly.\n\n## 2015\n\n### January\n\nIn early 2015, a new Emotet modification was released, not all that different from the\nprevious one. Among the changes were: new built-in public RSA key, most strings encrypted,\nATS scripts for web injection cleared of comments, targets included clients of Swiss banks.\n\n### June\n\nThe C&C servers again became unavailable, this time for 18 months. Judging by the\nconfiguration file with web injects, the Trojan’s most recent victims were clients of Austrian,\nGerman and Polish banks.\n\n## 2016\n\n### December\n\nEmotet redux: for the first time in a long while, a new modification was discovered. This\nversion infected web-surfing victims using the RIG-E and RIG-V exploit kits. This distribution\nmethod was not previously used by the Trojan, and, fast-forwarding ahead, would not be\n\n\n-----\n\nemployed again. We believe that this was a trial attempt at a new distribution mechanism,\nwhich did not pass muster with Emotet’s authors.\n\nThe C&C communication protocol in this modification was also changed: for amounts of data\nless than 4 KB, a GET request was used, and the data itself was transmitted in the Cookie\nfield of the HTTP header. For larger amounts, a POST request was used. The RC4\nencryption algorithm had been replaced by AES, with the protocol itself based on a slightly\nmodified Google Protocol Buffer. In response to the request, the C&C servers returned a\nheader with a 404 Not Found error, which did not prevent them from transmitting the\nencrypted payload in the body of the reply.\n\n**_Examples of GET and POST requests used by Emotet_**\n\nThe set of modules sent to the Trojan from C&C was different too:\n\nOut was the module for intercepting and modifying HTTP(S) traffic\nIn was a module for harvesting accounts and passwords from browsers\n(WebBrowserPassView)\n\n## 2017\n\n### February\n\nUp until now, we had no confirmation that Emotet could send spam independently. A couple\nof months after the C&C servers kicked back into life, we got proof when a spam module was\ndownloaded from there.\n\n### April\n\nIn early April, a large amount of spam was seen targeting users in Poland. Emails sent in the\nname of logistics company DHL asked recipients to download and open a “report” file in\nJavaScript format. Interestingly, the attackers did not try the further trick of hiding the\nexecutable JavaScript as a PDF. The calculation seemed to be that many users would simply\nnot know that JavaScript is not at all a document or report file format.\n\n\n-----\n\nExample of JS file names used:\n**_dhl__numer__zlecenia___4787769589_____kwi___12___2017.js_**\n[(MD5:7360d52b67d9fbb41458b3bd21c7f4de)](https://opentip.kaspersky.com/7360d52b67d9fbb41458b3bd21c7f4de/)\n\nIn April, a similar attack involving fake invoices targeted British-German users.\n\n**invoice__924__apr___24___2017___lang___gb___gb924.js**\n[(MD5:e91c6653ca434c55d6ebf313a20f12b1)](https://opentip.kaspersky.com/e91c6653ca434c55d6ebf313a20f12b1/)\n**telekom_2017_04rechnung_60030039794.js**\n[(MD5:bcecf036e318d7d844448e4359928b56)](https://opentip.kaspersky.com/bcecf036e318d7d844448e4359928b56/)\n\nThen in late April, the tactics changed slightly when the spam emails were supplemented\nwith a PDF attachment which, when opened, informed the user that the report in JavaScript\nformat was available for download via the given link.\n\n**Document_11861097_NI_NSO___11861097.pdf (MD5:**\n[2735A006F816F4582DACAA4090538F40)](https://opentip.kaspersky.com/2735A006F816F4582DACAA4090538F40/)\n\n**_Example of PDF document contents_**\n\n**Document_43571963_NI_NSO___43571963.pdf (MD5:**\n[42d6d07c757cf42c0b180831ef5989cb)](https://opentip.kaspersky.com/42d6d07c757cf42c0b180831ef5989cb/)\n\n**_Example of PDF document contents_**\n\nAs for the JavaScript file itself, it was a typical Trojan-Downloader that downloaded and ran\nEmotet. Having successfully infected the system, the script showed the user a pretty error\nwindow.\n\n\n-----\n\n**_Error message displayed by the malicious JavaScript file_**\n\n### May\n\nIn May, the scheme for distributing Emotet via spam changed slightly. This time, the\nattachment contained an Office document (or link to it) with an image disguised as an MS\nWord message saying something about the version of the document being outdated. To\nopen the document, the user was prompted to enable macros. If the victim did so, a\nmalicious macro was executed that launched a PowerShell script that downloaded and ran\nEmotet.\n\n**_Screenshot of the opened malicious document ab-58829278.dokument.doc (MD5:_**\n**[21542133A586782E7C2FA4286D98FD73)](https://opentip.kaspersky.com/21542133A586782E7C2FA4286D98FD73/)**\n\nAlso in May, it was reported that Emotet was downloading and installing the banking Trojan\nQbot (or QakBot). However, we cannot confirm this information: among the more than 1.2\nmillion users attacked by Emotet, Qbot was detected in only a few dozen cases.\n\n### June\n\n\n-----\n\nStarting June 1, a tool for spreading malicious code over a local network (Network\nSpreader), which would later become one of the malware modules, began being distributed\nfrom Emotet C&C servers. The malicious app comprised a self-extracting RAR archive\ncontaining the files bypass.exe (MD5: [341ce9aaf77030db9a1a5cc8d0382ee1) and](https://opentip.kaspersky.com/42d6d07c757cf42c0b180831ef5989cb/)\n**[service.exe (MD5: ffb1f5c3455b471e870328fd399ae6b8).](https://opentip.kaspersky.com/ffb1f5c3455b471e870328fd399ae6b8/)**\n\n**_Self-extracting RAR archive with bypass.exe and service.exe_**\n\n**bypass.exe:**\n\nSearches network resources by brute-forcing passwords using a built-in dictionary\nCopies service.exe to a suitable resource\nCreates a service on the remote system to autorun service.exe\n\n**_Screenshot of the function for creating the service (bypass.exe)_**\n\n\n-----\n\n**_Screenshot with a list of brute-force passwords (bypass.exe)_**\n\nIn terms of functionality, service.exe is extremely limited and only sends the name of the\ncomputer to the cybercriminals’ server.\n\n**_Function for generating data to be sent to C&C_**\n\n\n-----\n\n**_Function for sending data to C&C_**\n\nThe mailing was obviously a test version, and the very next day we detected an updated\nversion of the file. The self-extracting archive had been furnished with a script for\nautorunning bypass.exe (MD5: [5d75bbc6109dddba0c3989d25e41851f), which had not](https://opentip.kaspersky.com/5d75bbc6109dddba0c3989d25e41851f/)\n[undergone changes, while service.exe (MD5: acc9ba224136fc129a3622d2143f10fb) had](https://opentip.kaspersky.com/acc9ba224136fc129a3622d2143f10fb/)\ngrown in size by several dozen times.\n\n**_Self-extracting RAR archive with bypass.exe and service.exe_**\n\nThe updated service.exe was larger because its body now contained a copy of Emotet. A\nfunction was added to save Emotet to disk and run it before sending data about the infected\nmachine to C&C.\n\n\n-----\n\n**_New functions in service.exe for saving Emotet to disk and running it_**\n\n### July\n\nAn update to the Emotet load module was distributed over the botnet. One notable change:\nEmotet had dropped GET requests with data transfer in the Cookie field of the HTTP header.\nHenceforth, all C&C communication used POST (MD5:\n[643e1f4c5cbaeebc003faee56152f9cb).](https://opentip.kaspersky.com/643e1f4c5cbaeebc003faee56152f9cb/)\n\n### August\n\nNetwork Spreader is included in the Emotet “distribution kit” as a DLL (MD5:\n[9c5c9c4f019c330aadcefbb781caac41), the compilation date of the new module is July 24,](https://opentip.kaspersky.com/9c5c9c4f019c330aadcefbb781caac41/)\n2017, but it was obtained only in August. Recall that it used to be a self-extracting RAR\narchive with two files: bypass.exe and service.exe. The distribution mechanism did not\nchange much, but the list of brute-force passwords was expanded significantly to exactly\n1,000.\n\n**_Screenshot of the decrypted password list_**\n\n### November\n\n\n-----\n\n[In November 2017, IBM X-Force published a report about the new IcedId banker. According](https://securityintelligence.com/new-banking-trojan-icedid-discovered-by-ibm-x-force-research/)\nto the researchers, Emotet had been observed spreading it. We got our hands on the first\nIcedId sample (MD5: [7e8516db16b18f26e504285afe4f0b21) in April, and discovered back](https://opentip.kaspersky.com/7e8516db16b18f26e504285afe4f0b21/)\nthen that it was wrapped in a cryptor also used in Emotet. The cryptor was not just similar,\nbut a near byte-for-byte copy of the one in the Emotet sample (MD5:\n[2cd1ef13ee67f102cb99b258a61eeb20), which was being distributed at the same time.](https://opentip.kaspersky.com/2cd1ef13ee67f102cb99b258a61eeb20/)\n\n## 2018\n\n### January\n\nEmotet started distributing the banking Trojan Panda (Zeus Panda, first discovered in 2016\nand based on the leaked Zbot banker source code, carries out man-in-the-browser attacks\nand intercepts keystrokes and input form content on websites).\n\n### April\n\n**April 9**\n\nIn early April, Emotet acquired a module for distribution over wireless networks (MD5:\n[75d65cea0a33d11a2a74c703dbd2ad99), which tried to access Wi-Fi using a dictionary](https://opentip.kaspersky.com/75d65cea0a33d11a2a74c703dbd2ad99/)\nattack. Its code resembled that of the Network Spreader module (bypass.exe), which had\nbeen supplemented with Wi-Fi connection capability. If the brute-force was successful, the\nmodule transmitted data about the network to C&C.\n\nLike bypass.exe, the module was distributed as a separate file (a.exe) inside a self[extracting archive (MD5: 5afdcffca43f8e7f848ba154ecf12539). The archive also contained](https://opentip.kaspersky.com/5afdcffca43f8e7f848ba154ecf12539/)\nthe above-described service.exe (MD5: [5d6ff5cc8a429b17b5b5dfbf230b2ca4), which, like](https://opentip.kaspersky.com/5d6ff5cc8a429b17b5b5dfbf230b2ca4/)\nits first version, could do nothing except send the name of the infected computer to C&C.\n\n**_Self-extracting RAR archive with a component for distribution over Wi-Fi_**\n\nThe cybercriminals quickly updated the module, and within a few hours of detecting the first\nversion we received an updated self-extracting archive (MD5:\n[d7c5bf24904fc73b0481f6c7cde76e2a) containing a new service.exe with Emotet inside](https://opentip.kaspersky.com/d7c5bf24904fc73b0481f6c7cde76e2a/)\n[(MD5: 26d21612b676d66b93c51c611fa46773).](https://opentip.kaspersky.com/26d21612b676d66b93c51c611fa46773/)\n\n\n-----\n\n**_Self-extracting RAR archive with updated service.exe_**\n\nThe module was first publicly described only in January 2020, by Binary Defense. The return\nto the old distribution mechanism and the use of code from old modules looked a little\nstrange, since back in 2017 bypass.exe and service.exe had been merged into one DLL\nmodule.\n\n**April 14**\n\nEmotet again started using GET requests with data transfer in the Cookie field of the HTTP\nheader for data transfer sizes of less than 1 KB simultaneously with POST requests for\n[larger amounts of data. (MD5: 38991b639b2407cbfa2e7c64bb4063c4). Also different was](https://opentip.kaspersky.com/38991b639b2407cbfa2e7c64bb4063c4/)\nthe template for filling the Cookie field. If earlier it took the form Cookie: %X=, now it was\n**Cookie: %u =. The newly added space between the numbers and the equals sign helped to**\nidentify Emotet traffic.\n\n**_Example of a GET request_**\n\n**April 30**\n\nThe C&C servers suspended their activity and resumed it only on May 16, after which the\nspace in the GET request had gone.\n\n**_Example of a corrected GET request_**\n\n\n-----\n\n### June\n\nYet another banking Trojan started using Emotet to propagate itself. This time it was Trickster\n(or Trickbot) — a modular banker known since 2016 and the successor to the Dyreza banker.\n\n### July\n\n[The so-called UPnP module (MD5: 0f1d4dd066c0277f82f74145a7d2c48e), based on the](https://opentip.kaspersky.com/0f1d4dd066c0277f82f74145a7d2c48e/)\nlibminiupnpc package, was obtained for the first time. The module enabled port forwarding\non the router at the request of a host in the local network. This allowed the attackers not only\nto gain access to local network computers located behind NAT, but to turn an infected\nmachine into a C&C proxy.\n\n### August\n\nIn August, there appeared reports of infections by the new Ryuk ransomware — a\nmodification of the Hermes ransomware known since 2017. It later transpired that the chain\nof infection began with Emotet, which downloaded Trickster, which in turn installed Ryuk.\nBoth Emotet and Trickster by this time had been armed with functions for distribution over a\nlocal network, plus Trickster exploited known vulnerabilities in SMB, which further aided the\nspread of the malware across the local network. Coupled with Ryuk, it made for a killer\ncombination.\n\nAt the end of the month, the list of passwords in the Network Spreader module was updated.\nThey still numbered 1,000, but about 100 had been changed (MD5:\n[3f82c2a733698f501850fdf4f7c00eb7).](https://opentip.kaspersky.com/3f82c2a733698f501850fdf4f7c00eb7/)\n\n**_Screenshot of the decrypted password list_**\n\n### October\n\n\n-----\n\n**October 12**\n\nThe C&C servers suspended their activity while we registered no distribution of new modules\nor updates. Activity resumed only on October 26.\n\n**October 30**\n\n[The data exfiltration module for Outlook (MD5:64C78044D2F6299873881F8B08D40995)](https://opentip.kaspersky.com/64C78044D2F6299873881F8B08D40995/)\nwas updated. The key innovation was the ability to steal the contents of the message itself.\nAll the same, the amount of stealable data was restricted to 16 KB (larger messages were\ntruncated).\n\n**_Comparison of the code of the old and new versions of the data exfiltration module for_**\n**_Outlook_**\n\n### November\n\nThe C&C servers suspended their activity while we registered no distribution of new modules\nor updates. Activity resumed only on December 6.\n\n### December\n\nMore downtime while C&C activity resumed only on January 10, 2019.\n\n## 2019\n\n### March\n\n**March 14**\n\n\n-----\n\nEmotet again modified a part of the HTTP protocol, switching to POST requests and using a\ndictionary to create the path. The Referer field was now filled, and Content-Type:\n**multipart/form-data appeared. (MD5:** [beaf5e523e8e3e3fb9dc2a361cda0573)](https://opentip.kaspersky.com/beaf5e523e8e3e3fb9dc2a361cda0573/)\n\n**_Code of the POST request generation function_**\n\n**_Example of a POST request_**\n\n**March 20**\n\nYet another change in the HTTP part of the protocol. Emotet dropped Content-Type:\n**multipart/form-data. The data itself was encoded using Base64 and UrlEncode (MD5:**\n[98fe402ef2b8aa2ca29c4ed133bbfe90).](https://opentip.kaspersky.com/98fe402ef2b8aa2ca29c4ed133bbfe90/)\n\n\n-----\n\n**_Code of the updated POST request generation function_**\n\n**_Example of a POST request_**\n\n### April\n\nThe first reports appeared that information stolen by the new data exfiltration module for\nOutlook was being used in Emotet spam mailings: the use of stolen topics, mailing lists and\nmessage contents was observed in emails.\n\n### May\n\nThe C&C servers stopped working for quite some time (three months). Activity resumed only\non August 21, 2019. Over the following few weeks, however, the servers only distributed\nupdates and modules with no spam activity being observed. The time was likely spent\nrestoring communication with infected systems, collecting and processing data, and\nspreading over local networks.\n\n### November\n\n\n-----\n\nA minor change to the HTTP part of the protocol. Emotet dropped the use of a dictionary to\ncreate the path, opting for a randomly generated string (MD5:\n[dd33b9e4f928974c72539cd784ce9d20).](https://opentip.kaspersky.com/dd33b9e4f928974c72539cd784ce9d20/)\n\n**_Example of a POST request_**\n\n### February\n\n**February 6**\n\nYet another change in the HTTP part of the protocol. The path now consisted not of a single\nstring, but of several randomly generated words. Content-Type again became\n**multipart/form-data.**\n\n**_Example of a POST request_**\n\nAlong with the HTTP part, the binary part was also updated. The encryption remained the\nsame, but Emotet dropped Google Protocol Buffer and switched to its own format. The\ncompression algorithm also changed, with zlib replaced by liblzf. More details about the new\n[protocol can be found in the Threat Intel and](https://medium.com/threat-intel/emotet-dangerous-malware-keeps-on-evolving-ac84aadbb8de) [CERT Polska reports.](https://www.cert.pl/en/news/single/whats-up-emotet/)\n\n### February 7\n\n\n-----\n\nC&C activity started to decline and resumed only in July 2020. During this period, the amount\nof spam fell to zero. At the same time, Binary Defense, in conjunction with various CERTs\n[and the infosec community, began to distribute EmoCrash, a PowerShell script that creates](https://www.binarydefense.com/emocrash-exploiting-a-vulnerability-in-emotet-malware-for-defense/)\nincorrect values for system registry keys used by Emotet. This caused the malware to\n“crash” during installation. This killswitch worked until August 6, when the actors behind\nEmotet patched the vulnerability.\n\n### July\n\nOnly a few days after the resumption of spam activity, online reports appeared that someone\nwas substituting the malicious Emotet payload on compromised sites with images and\nmemes. As a result, clicking the links in spam emails opened an ordinary picture instead of a\nmalicious document. This did not last long, and by July 28 the malicious files had stopped\nbeing replaced with images.\n\n## Conclusion\n\nDespite its ripe old age, Emotet is constantly evolving and remains one of the most current\nthreats out there. Save for the explosive growth in distribution after five months of inactivity,\nwe have yet to see anything previously unobserved; that said, a detailed analysis always\ntakes time, and we will publish the results of the study in due course. On top of that, we are\ncurrently observing the evolution of third-party malware that propagates using Emotet, which\nwe will certainly cover in future reports.\n\nOur security solutions can block Emotet at any stage of attack. The mail filter blocks spam,\nthe heuristic component detects malicious macros and removes them from Office\ndocuments, while the behavioral analysis module makes our protection system resistant not\nonly to statistical analysis bypass techniques, but to new modifications of program behavior\nas well.\n\nTo mitigate the risks, it is vital to receive accurate, reliable, before-the-fact information about\nall information security matters. Scanning IP addresses, file hashes and domains/URLs on\n[opentip can determine if an object poses a genuine threat based on risk levels and additional](https://opentip.kaspersky.com/howto/)\ncontextual information. Analyzing files with opentip, using our proprietary technologies,\nincluding dynamic, statistical and behavioral analysis, as well as our global reputation\nsystem, can help detect advanced mass and latent threats.\n\nAnd Kaspersky Threat Intelligence is there to track constantly evolving cyberthreats, analyze\nthem, respond to attacks in good time, and minimize the consequences.\n\n## IOC\n\n### Most active C&Cs in November 2020:\n\n\n-----\n\n[173.212.214.235:7080](https://opentip.kaspersky.com/173.212.214.235:7080?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[167.114.153.111:8080](https://opentip.kaspersky.com/167.114.153.111:8080?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[67.170.250.203:443](https://opentip.kaspersky.com/67.170.250.203:443?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[121.124.124.40:7080](https://opentip.kaspersky.com/121.124.124.40:7080?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[103.86.49.11:8080](https://opentip.kaspersky.com/103.86.49.11:8080?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[172.91.208.86:80](https://opentip.kaspersky.com/172.91.208.86:80?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[190.164.104.62:80](https://opentip.kaspersky.com/190.164.104.62:80?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[201.241.127.190:80](https://opentip.kaspersky.com/201.241.127.190:80?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[66.76.12.94:8080](https://opentip.kaspersky.com/66.76.12.94:8080?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n[190.108.228.27:443](https://opentip.kaspersky.com/190.108.228.27:443?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n### Links to Emotet extracted from malicious documents\n\nhxxp://tudorinvest[.]com/wp-admin/rGtnUb5f/\n\nhxxp://dp-womenbasket[.]com/wp-admin/Li/\n\nhxxp://stylefix[.]co/guillotine-cross/CTRNOQ/\n\nhxxp://ardos.com[.]br/simulador/bPNx/\n\nhxxps://sangbadjamin[.]com/move/r/\n\nhxxps://asimglobaltraders[.]com/baby-rottweiler/duDm64O/\n\nhxxp://sell.smartcrowd[.]ae/wp-admin/CLs6YFp/\n\nhxxps://chromadiverse[.]com/wp-content/OzOlf/\n\nhxxp://rout66motors[.]com/wp-admin/goi7o8/\n\nhxxp://caspertour.asc-florida[.]com/wp-content/gwZbk/\n\n### MD5s of malicious Office documents downloading Emotet\n\n[59d7ae5463d9d2e1d9e77c94a435a786](https://opentip.kaspersky.com/59d7ae5463d9d2e1d9e77c94a435a786/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[7ef93883eac9bf82574ff2a75d04a585](https://opentip.kaspersky.com/7ef93883eac9bf82574ff2a75d04a585/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[4b393783be7816e76d6ca4b4d8eaa14a](https://opentip.kaspersky.com/4b393783be7816e76d6ca4b4d8eaa14a/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n### MD5s of Emotet executable files\n\n[4c3b6e5b52268bb463e8ebc602593d9e](https://opentip.kaspersky.com/4c3b6e5b52268bb463e8ebc602593d9e/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[0ca86e8da55f4176b3ad6692c9949ba4](https://opentip.kaspersky.com/0ca86e8da55f4176b3ad6692c9949ba4/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[8d4639aa32f78947ecfb228e1788c02b](https://opentip.kaspersky.com/8d4639aa32f78947ecfb228e1788c02b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[28df8461cec000e86c357fdd874b717e](https://opentip.kaspersky.com/28df8461cec000e86c357fdd874b717e/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[82228264794a033c2e2fc71540cb1a5d](https://opentip.kaspersky.com/82228264794a033c2e2fc71540cb1a5d/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[8fc87187ad08d50221abc4c05d7d0258](https://opentip.kaspersky.com/8fc87187ad08d50221abc4c05d7d0258/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[b30dd0b88c0d10cd96913a7fb9cd05ed](https://opentip.kaspersky.com/b30dd0b88c0d10cd96913a7fb9cd05ed/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[c37c5b64b30f2ddae58b262f2fac87cb](https://opentip.kaspersky.com/c37c5b64b30f2ddae58b262f2fac87cb/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[3afb20b335521c871179b230f9a0a1eb](https://opentip.kaspersky.com/3afb20b335521c871179b230f9a0a1eb/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[92816647c1d61c75ec3dcd82fecc08b2](https://opentip.kaspersky.com/92816647c1d61c75ec3dcd82fecc08b2/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[Botnets](https://securelist.com/tag/botnets/)\n\n\n-----\n\n[Thematic spam](https://securelist.com/tag/thematic-spam/)\n[Trojan](https://securelist.com/tag/trojan/)\n[Trojan Banker](https://securelist.com/tag/trojan-banker/)\n[Vulnerabilities and exploits](https://securelist.com/tag/vulnerabilities-and-exploits/)\n\nAuthors\n\nOleg Kupreev\n\nThe chronicles of Emotet\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-04 - The chronicles of Emotet.pdf"
    ],
    "report_names": [
        "2020-12-04 - The chronicles of Emotet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536032,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653713338,
    "ts_modification_date": 1653713338,
    "files": {
        "pdf": "https://archive.orkl.eu/e63102bcc4aadf6faf2b25349604cf54451bcacc.pdf",
        "text": "https://archive.orkl.eu/e63102bcc4aadf6faf2b25349604cf54451bcacc.txt",
        "img": "https://archive.orkl.eu/e63102bcc4aadf6faf2b25349604cf54451bcacc.jpg"
    }
}