{
    "id": "1ead1138-078b-4225-80ce-09807574e624",
    "created_at": "2023-01-12T15:08:37.56145Z",
    "updated_at": "2025-03-27T02:09:30.294853Z",
    "deleted_at": null,
    "sha1_hash": "b91585c5e8110a869ca52f78b34b8373663dd1d0",
    "title": "2022-08-25 - New Golang Ransomware Agenda Customizes Attacks",
    "authors": "",
    "file_creation_date": "2022-09-01T10:26:52Z",
    "file_modification_date": "2022-09-01T10:26:52Z",
    "file_size": 1659326,
    "plain_text": "# New Golang Ransomware Agenda Customizes Attacks\n\n**[trendmicro.com/en_us/research/22/h/new-golang-ransomware-agenda-customizes-attacks.html](https://www.trendmicro.com/en_us/research/22/h/new-golang-ransomware-agenda-customizes-attacks.html)**\n\nAugust 25, 2022\n\nRansomware\n\nA new ransomware written in the Go language has been targeting healthcare and education\nenterprises in Asia and Africa. This ransomware is called Agenda and is customized per\nvictim.\n\nBy: Mohamed Fahmy, Nathaniel Gregory Ragasa, Earle Maui Earnshaw, Bahaa Yamany,\nJeffrey Francis Bonaobra, Jay Yaneza\nAugust 25, 2022\nRead time: ( words)\n\n[We recently discovered a new piece of targeted ransomware that was created in the Go](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware)\nprogramming language and that explicitly targeted one of our customers. This was\nevidenced by the specific email addresses and credentials the ransomware used. Malware\n[written in the Go language (aka Golang) has become common among threat actors. One](https://www.zdnet.com/article/go-malware-is-now-common-having-been-adopted-by-both-apts-and-e-crime-groups/)\npossible reason for this uptick in popularity is that Go statically compiles necessary libraries,\nmaking security analysis much harder.\n\nOur investigation revealed that the new ransomware in question targeted enterprises in Asia\nand Africa. Based on dark web posts by a user named “Qilin” (who seems to be connected to\nthe ransomware distributors) and through ransom notes, the ransomware is called\n“Agenda.”\n\nAgenda can reboot systems in safe mode, attempts to stop many server-specific processes\nand services, and has multiple modes to run. The samples of the ransomware that we\ncollected were customized for each victim, and they included unique company IDs and\nleaked account details.\n\nTargets\n\nAll collected samples were 64-bit Windows PE (Portable Executable) files written in Go, and\nthey were aimed at Windows-based systems. The group distributing the malware was\ntargeting healthcare and education organizations in Indonesia, Saudi Arabia, South Africa,\nand Thailand. Every ransomware sample was customized for the intended victim. Our\ninvestigation showed that the samples had leaked accounts, customer passwords, and\nunique company IDs used as extensions of encrypted files.\n\n\n-----\n\nWe believe that Qilin (or the Agenda ransomware group) offers affiliates options to customize\nconfigurable binary payloads for each victim, including details such as company ID, RSA key,\nand processes and services to kill before the data encryption. Also, the ransom amount\nrequested is different per company, ranging from US$50,000 to US$800,000.\n\nFigure 1. An example of Qilin’s ransom negotiations\n\nFigure 2. An example of ransom amount requested by Qilin\nSimilarities with other ransomware\n\n[We noticed some similarities between Agenda and the Black Basta, Black Matter, and](https://www.trendmicro.com/en_us/research/22/e/examining-the-black-basta-ransomwares-infection-routine.html) [REvil](https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-revil)\n(aka Sodinokibi) ransomware.\n\nIn terms of payment sites and the implementation of user verification on a Tor site, Agenda\nis very similar to Black Basta and Black Matter. Meanwhile, Agenda shares with Black Basta\nand REvil the same functionality of changing Windows passwords and rebooting in safe\nmode using this command:\n\n_C:\\windows\\system32\\bcdedit.exe /set safeboot{current} network_\n\nObserved kill chain\n\n\n-----\n\nInvestigating one incident involving this ransomware, we saw that the threat actor behind it\nused a public-facing Citrix server as a point of entry. We believe that the threat actor used a\nvalid account to access this server and later move inside the victim’s network. This was\nexpected since the actor configured the ransomware with valid and privileged accounts.\n\nThe threat actor used RDP on Active Directory using leaked accounts. The actor dropped\nscanning tools, Nmap.exe and Nping.exe, for scanning the network. Next, the scheduled\ntask was pushed by the group policy domain machine.\n\nFigure 3. The scheduled\n\ntask pushed by the group policy\n\nFigure 4. The scheduled task created on the machine\nWe observed that there was only a short period between accessing the Citrix server and the\nransomware infection: less than two days. The threat actor seemed to have scanned the\nnetwork on the first day, and then a Group Policy Object (GPO) was created and the\nransomware was deployed on the machines.\n\n\n-----\n\nFigure 5. The Agenda ransomware’s kill chain\nAnalysis and notable features\n\nThe Agenda ransomware is a 64-bit Windows PE file written in Go. Go programs are crossplatform and completely standalone, meaning they will execute properly even without a Go\ninterpreter installed on a system. This is possible since Go statically compiles necessary\nlibraries (packages).\n\nUpon execution, this ransomware accepts various command-line arguments that define the\nmalware flow and functionality, as listed in the table below.\n\n**Argument** **Description**\n\n-alter {int} Defines the port number for this child process\n\n\n-encryption\n{value}\n\n-ips {IP\nAddress}\n\n-min-size\n{value}\n\n\nAllows for redefining the embed encryptor config to the customized choice\n\nAllows for providing IP addresses\n\nDefines the minimum file size to encrypt (e.g., 1 KB, 1 MB, 1 GB, 666 KB)\n\n\n-no-proc Defines the processes that will not be killed\n\n\n-----\n\n-no-services Defines the services that will not be killed\n\n\n-password\n{string}\n\n-path\n{directory}\n\n\nDefines the password to enter landing\n\nDefines the path that parses directories; if this flag is used and left empty,\nall directories will be scanned\n\n\n-safe Boots in safe mode\n\n-stat Makes malware print its configuration (processes and services to be killed,\nencryption, etc.)\n\nTable 1. Command-line arguments accepted by Agenda\n\nAgenda builds a runtime configuration to define its behavior, including its public RSA key,\nencryption conditions, list of processes and services to terminate, encryption extension, login\ncredentials, and ransom note.\n\n**Runtime configuration component** **Description**\n\npublic_rsa_pem RSA public key\n\ndirectory_black_list Directories excluded from encryption\n\nfile_black_list File names excluded from encryption\n\nfile_pattern_black_list File name extensions excluded from encryption\n\nprocess_black_list Processes to terminate\n\nwin_services_black_list Services to terminate\n\ncompany_id Encryption extension\n\naccounts Login credentials\n\nnote Ransom note\n\nTable 2. The runtime configuration components of Agenda\n\nAs part of its initial routine, Agenda determines if the machine is running in safe mode by\nchecking the string safeboot in the data of this registry value:\n\n_HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control SystemStartOptions_\n\nIf it detects that the machine is running in safe mode, it terminates execution.\n\n\n-----\n\nThe ransomware then removes shadow volume copies via execution of vssadmin.exe delete\n_shadows /all /quiet, as well as terminating specific processes and services indicated in its_\nruntime configuration, some of which are antivirus-related processes and services.\n\n**Processes** **Services**\n\na2service.exe acronis vss provider\n\na2start.exe acronis vss provider\n\naawservice.exe acronisagent\n\nashserv.exe acronisagent\n\navengine.exe acronisagentd\n\navkwctl.exe avbackup\n\nblackd.exe avbackupd\n\ncfp.exe ccevtmgr\n\nfsav32.exe macmnsvc\n\nfsdfwd.exe macmnsvcd\n\nfsguiexe.exe masvc\n\nkpf4gui.exe masvcd\n\nmcods.exe mcshield\n\nmcpalmcfg.exe sentinelagent\n\nmcproxy.exe sentinelagentd\n\nmcregwiz.exe sentinelhelperservice\n\nmcsacore.exe sentinelhelperserviced\n\nmcshield.exe sentinelstaticengine\n\nmpfagent.exe sentinelstaticengined\n\nmpfservice.exe shmonitor\n\nmsmpeng.exe shmonitord\n\nmsscli.exe smcinst\n\nnisum.exe tmccsf\n\n\n-----\n\nntrtscan.exe tmccsfd\n\npccpfw.exe tmlisten\n\ntmntsrv.exe tmlistend\n\nTable 3. Some of the antivirus-related processes and services terminated by Agenda\n\nAfter its initial routine, Agenda proceeds to create the runonce autostart entry *aster pointing\nto enc.exe, which is a dropped copy of itself under the Public folder:\n\n_HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnce*aster_\n_= %Public%\\enc.exe_\n\n**Changing user passwords and rebooting in safe mode**\n\nAgenda also deploys a detection evasion technique during encryption: It changes the default\nuser’s password and enables automatic login with the new login credentials. This feature can\n[be enabled using the -safe command-line argument. Similar to REvil, Agenda reboots the](https://www.bleepingcomputer.com/news/security/revil-ransomware-now-changes-password-to-auto-login-in-safe-mode/amp/)\nvictim’s machine in safe mode and then proceeds with the encryption routine upon reboot.\n\nTo begin, Agenda lists all local users found on the device and then checks which one is set\nas the default user.\n\n\n-----\n\nFigure 6. The function used by Agenda to determine the default user from local users\nUpon finding the default user, Agenda changes the user’s password to Y25VsIgRDr.\n\nFigure 7. The function used by Agenda to change the default user’s password\nIt then proceeds to configure the Winlogon registry entry, setting the data to each of these\nvalues:\n\n_SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\_\n\n\n-----\n\n_AutoAdminLogon value =1_\n\n_DefaultUserName = {username}_\n\n_DefaultDomainName ={domainname}_\n\n_DefaultPassword={ Y25VsIgRDr}_\n\nFigure 8. The Winlogon registry entry configured by Agenda\nUpon changing the default user’s password and enabling automatic login, Agenda reboots\nthe victim’s machine in safe mode via this command:\n\n_C:\\windows\\system32\\bcdedit.exe /set safeboot{current} network_\n\nThe ransomware also reboots the machine in normal mode after the encryption using this\ncommand:\n\n_C:\\Windows\\System32\\bcdedit.exe /set safeboot network bcdedit /deletevalue {default}_\n_safeboot_\n\n**Impersonation of legitimate accounts**\n\nAnother feature of Agenda is its ability to abuse local account credentials to execute the\nransomware binary, using the embedded login credentials in its runtime configuration.\n\n\n-----\n\nFigure 9. Agenda’s embedded local account credentials\nAgenda begins the user impersonation by parsing the accounts in the runtime configuration\nand then separating them into username, domain, and password. It will use this data to\n[attempt logging a user on to the local computer via the API LogonUserW.](https://docs.microsoft.com/en-us/windows/win32/api/winbase/nf-winbase-logonuserw)\n\nFigure 10.\n\nThe function used by Agenda to parse the accounts field in the runtime configuration\n\nFigure 11. Agenda performing logon using a parsed account\nAgenda then proceeds to generate a random port number, which it will use in the execution\n[of the ransomware binary through the API CreateProcessAsUserW in conjunction with the](https://docs.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-createprocessasuserw)\ncommand-line argument -alter.\n\nFigure 12. Agenda creating a new process with the -alter argument\n\n\n-----\n\n**Allowing network sharing**\n\nAgenda is also associated with the compromise of an entire network and its shared drivers. It\nis not only about the encryption of data on one workstation.\n\nThe ransomware adds a registry and then restarts the LanmanWorkstation service. After\nadding a new registry, it uses key [EnableLinkedConnections = 1] in the Enabling Mapped\nDrives drivers and then in restarting the LanmanWorkstation service. This will allow Agenda\nto list network drives in elevated programs like cmd.\n\nFigure 13. Agenda changing the registry value of EnableLinkedConnection to 1\n\nFigure 14. Agenda restarting the LanmanWorkstation service\n**Encryption algorithm**\n\n\n-----\n\nAgenda uses AES-256 for encrypting files and RSA-2048 for encrypting the generated key.\nTo do so, it first generates the key and initialization vector (IV) that it will use for encryption\nby using the function generateKye, and then uses the API rand_read().\n\nFigure 15. The function used by Agenda to generate a random key\nWith this randomly generated key, Agenda proceeds to use AES-256 to encrypt target files.\nLastly, it encrypts the key using RSA-2048 through the embedded public key from the\nruntime configuration.\n\nAfter successful encryption, Agenda renames the encrypted files by appending the company\nID indicated in the runtime configuration. It then drops the ransom note {company_id}_RECOVER-README.txt in each encrypted directory._\n\nFigure 16. Agenda’s ransom note\n**Process injection**\n\nAgenda drops pwndll.dll, detected as Trojan.Win64.AGENDA.SVT, in the Public folder. The\n[file pwndll.dll is a patched DLL from the legitimate DLL WICloader.dll written in C, not Go.](https://www.dll-hub.com/unknown/wicloader/)\nAgenda injects this DLL into svchost.exe to allow continuous execution of the ransomware\nbinary.\n\n\n-----\n\nFigure 17. Agenda injecting pwndll.dll into svchost.exe\n\nFigure 18. Agenda using pwndll.dll to\n\nexecute the ransomware sample\nConclusion and solutions\n\nRansomware continues to evolve, developing more sophisticated methods and techniques to\ntrap organizations. Our investigation shows how the new targeted ransomware Agenda is\nwritten in the Go language, making it harder to detect and analyze.\n\nThis ransomware has techniques for evading detection by taking advantage of the “safe\nmode” feature of a device to proceed with its encryption routine unnoticed. The ransomware\nalso takes advantage of local accounts to log on as spoofed users and execute the\nransomware binary, further encrypting other machines if the logon attempt is successful. It\nalso terminates numerous processes and services, and ensures persistence by injecting a\nDLL into svchost.exe.\n\nEnd users and organizations alike can mitigate the risk of infection from ransomware like\nAgenda by following these security best practices:\n\nEnable multifactor authentication (MFA) to prevent attackers from performing lateral\nmovement inside a network.\n\n\n-----\n\n[Adhere to the 3-2-1 rule when backing up important files. This involves creating three](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/best-practices-backing-up-data)\nbackup copies on two different file formats, with one of the copies stored in a separate\nlocation.\n[Patch and update systems regularly. It’s important to keep operating systems and](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/vulnerabilities-and-exploits/virtual-patching-patch-those-vulnerabilities-before-they-can-be-exploited)\napplications up to date, preventing malicious actors from exploiting any software\nvulnerabilities.\n\nOrganizations can also benefit from security solutions that offer multilayered detection and\n[response, such as Trend Micro Vision One™, which has multilayered protection and](https://www.trendmicro.com/en_us/business/products/detection-response.html)\nbehavior detection capabilities that help block suspicious behavior and tools before\n[ransomware can do any damage. Trend Micro Apex One™ also provides next-level](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html)\nautomated threat detection and response to protect endpoints against advanced issues, like\nfileless threats and ransomware.\n\n**_Additional insights provided by Eleazar Valles and Sherif Magdy._**\n\n[For more information about the indicators of compromise, download this document.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/new-golang-ransomware-agenda-customizes-attacks/IOCs-blog-New%20Golang%20Ransomware%20Agenda%20Customizes%20Attacks.txt)\n\nMITRE ATT&CK tactics and techniques\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-25 - New Golang Ransomware Agenda Customizes Attacks.pdf"
    ],
    "report_names": [
        "2022-08-25 - New Golang Ransomware Agenda Customizes Attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536117,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1662028012,
    "ts_modification_date": 1662028012,
    "files": {
        "pdf": "https://archive.orkl.eu/b91585c5e8110a869ca52f78b34b8373663dd1d0.pdf",
        "text": "https://archive.orkl.eu/b91585c5e8110a869ca52f78b34b8373663dd1d0.txt",
        "img": "https://archive.orkl.eu/b91585c5e8110a869ca52f78b34b8373663dd1d0.jpg"
    }
}