{
    "id": "1ed12982-e297-4a23-9be8-12d945b4fec3",
    "created_at": "2023-01-12T15:07:26.596937Z",
    "updated_at": "2025-03-27T02:14:11.938863Z",
    "deleted_at": null,
    "sha1_hash": "49b46cff29864104bed75259ac216d2f1900a855",
    "title": "2022-03-24 - Threat Brief- Lapsus$ Group",
    "authors": "",
    "file_creation_date": "2022-05-29T01:00:40Z",
    "file_modification_date": "2022-05-29T01:00:40Z",
    "file_size": 738163,
    "plain_text": "# Threat Brief: Lapsus$ Group\n\n**unit42.paloaltonetworks.com/lapsus-group/**\n\nUnit 42 March 24, 2022\n\nBy [Unit 42](https://unit42.paloaltonetworks.com/author/unit42/)\n\nMarch 24, 2022 at 12:15 PM\n\n[Category: Threat Brief](https://unit42.paloaltonetworks.com/category/threat-briefs-assessments/threat-brief/)\n\nTags: [data exfiltration,](https://unit42.paloaltonetworks.com/tag/data-exfiltration/) [Lapsus$](https://unit42.paloaltonetworks.com/tag/lapsus/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/lapsus-group/)\n\n## Executive Summary\n\nThe Lapsus$ Group threat actor has grown in just a few months from launching a handful of\ndestructive attacks to stealing and publishing source code of multiple top-tier technology\ncompanies.\n\nThough sometimes called a ransomware group in reports, Lapsus$ is notable for not\ndeploying ransomware in extortion attempts. In today’s environment, threat actors favor\nusing ransomware to encrypt data and systems and often extort victims for significant\namounts of cryptocurrency in exchange for decryption keys, sometimes turning up the\npressure with the threat of publishing stolen data. Lapsus$, however, is unusual in its\napproach – for this group, notoriety most often appears to be the goal, rather than financial\ngain.\n\n\n-----\n\nUnit 42 has helped organizations respond to multiple Lapsus$ attacks. The Lapsus$ Group\ndoesn’t employ malware in breached victim environments, doesn’t encrypt data and in most\ncases, doesn’t actually employ extortion. They focus on using a combination of stolen\ncredentials and social engineering to gain access to victims. We’ve also seen them solicit\nemployees on Telegram for their login credentials at specific companies in industries\nincluding: telecom, software, gaming, hosting providers and call centers.\n\nHowever, the group’s attacks and leaking of stolen data even without extortion can be very\ndamaging. In addition, we’ve seen destructive Lapsus$ attacks where the actors got access\nto an organization’s cloud environment, wiped systems and destroyed over a thousand\nvirtual machines.\n\nAlthough there are no public indicators of compromise (IoCs), and no tactics, techniques and\nprocedures (TTPs) that are unique to Lapsus$ Group, here we will summarize what is known\nof this threat actor to better enable defenders in understanding and mitigating this threat.\n\nRelated Unit 42 Topics [Threat Briefs,](https://unit42.paloaltonetworks.com/#threat-brief) [Threat Assessments](https://unit42.paloaltonetworks.com/tag/threat-assessment/)\n\n## Table of Contents\n\nEarly Targets of Lapsus$\n\nEvolution of Targeted Organizations\n\nMitigation Actions\n\nConclusion\n\nAdditional Resources\n\n## Early Targets of Lapsus$\n\nWe first observed the “Lapsus$” handle mid-2021, but the first attack activity quoting that\nhandle was in August 2021, with some U.K. mobile phone customers reporting receiving\nthreatening texts (Figure 1).\n\n\n-----\n\nFigure 1. Early Lapsus$ activity.\n\nIn December 2021, the Ministry of Health of Brazil fell victim to an attack claimed by Lapsus$\n(Figure 2). This included the soon-to-be de rigueur data exfiltration and deletion technique,\nand also redirection of some DNS records. This was followed in short order by attacks on\nSouth American telecoms providers Claro and Embratel, Brazilian state-owned postal\nservice “Correios,” and Portuguese media giant Impresa. This initial focus has led to\nspeculation that Lapsus$ Group may be Brazilian, although we understand the choice of\ntargets to have been influenced by extended team members rather than the team leadership.\n\nFigure 2. Ministry of Health of Brazil defacement.\n\n## Evolution of Targeted Organizations\n\n\n-----\n\nApart from Argentinian eCommerce provider Mercado Libre / Mercado Pago, subsequent\nvictimology has departed South America and pivoted to focus on the high-tech sector.\n\nRecent public victims have included:\n\nNvidia\nSamsung\nUbisoft\nVodafone\nMicrosoft\nLG\nOkta\n\nIt should be understood that in addition there are likely any number of other victims, targeted\nby attacks not known in the public sphere. It is likely that some victims are not the intended\nend-target, but are rather breached in order to gain access to their customers, or for\nexample, to help bypass multi-factor authentication (MFA). To this end, we are aware of this\nactor’s involvement in vishing, SIM-swapping and soliciting third parties at providers for\ninsider access. For example, in the “proof” of the Okta breach posted on the Lapsus$\nGroup’s Telegram channel, the actor states: “… our focus was ONLY on okta customers”\n(Figure 3).\n\n\n-----\n\nFigure 3. Okta breach evidence posted on\n\n\nthe Lapsus$ Group’s Telegram channel.\n\n\n-----\n\nSeveral of the Lapsus$ Group s attacks involved the theft and publication of source code. In\nthe case of Nvidia, it was observed as a non-financial extortion attempt. In other cases, for\nexample that of Microsoft, there was simply publication without extortion, again supporting\nthe understanding that the primary motivation of this actor is notoriety rather than financial\ngain.\n\nHowever, as notoriety and success cause this group to grow, we should expect to see\ndiversity of membership reflected in a diversity of victimology, TTPs and action-on-objective\nmotivations.\n\n## Mitigation Actions\n\nOwing to the diversity of techniques used, and the lack of use of malware, there is no single\ndefense against or detection of Lapsus$ attacks specifically.\n\nA hallmark of this group is the diversity of techniques used both for initial access and actionon-objective. Credentials are harvested from dumps, purchased or spear-phished. When\nemployed, various techniques to bypass MFA are observed – from social engineering,\nthrough SIM-swapping and even compromising MFA/telecoms providers.\n\nZero Trust network architecture and strong security hygiene are the best defenses against\nthis type of threat actor. If Lapsus$ has purchased credentials for a network, they can\neffectively operate as an insider threat, taking advantage of the same privileges the\nemployee has inside the network.\n\nFocus on general information security best practices: MFA, access controls and network\nsegmentation. Ensure your organization has the ability to detect anomalous activity, including\nactivity that involves trusted third parties in your environments, and protect against nontechnical techniques such as vishing and SIM-swapping. Patching of internal systems that\nmight support lateral movement and privilege escalation should be prioritized, as well as\nagainst known public exploits that these actors might employ.\n\nAlthough the commodity malware RedLine Stealer has been implicated for credential\nharvesting in some attacks, it’s unclear if this is first- or third-party, and it cannot be used as a\ndefinitive indicator of Lapsus$-specific activity.\n\n## Conclusion\n\nLapsus$ Group has made headlines recently for high-profile attacks, with an apparent goal\nof gaining notoriety. They claim in some cases to have targeted organizations with the\nspecific goal of gaining access to customers.\n\n\n-----\n\nWhile referred to as a ransomware group in many reports, the Lapsus$ Group is more\naccurately called an attack group. Most notably, their focus to date does not appear to have\nbeen on extortion and financial gain. Even without extortion, the group’s attacks and leaks of\nstolen information can be damaging.\n\nBecause the group uses a diversity of techniques for attacks, no single technique can protect\nagainst Lapsus$ or detect its attacks. Because of this, we recommend that organizations\nfocus on observing general information security best practices as described in the Mitigation\nActions section above.\n\n[Unit 42, together with researchers at Unit 221b, identified the primary actor behind the](https://unit221b.com/)\nLapsus$ Group moniker in 2021, and have been assisting law enforcement in their efforts to\nprosecute this group.\n\nIf you think you may be subject to an active attack or have an urgent matter, get in touch with\nthe [Unit 42 Incident Response team or call North America Toll-Free: 866.486.4842](http://start.paloaltonetworks.com/contact-unit42.html)\n(866.4.UNIT42), EMEA: +31.20.299.3130, APAC: +65.6983.8730, or Japan:\n+81.50.1790.0200.\n\nPalo Alto Networks will update this Threat Brief with new information and recommendations\nas they become available.\n\n## Additional Resources\n\n[DEV-0537 criminal actor targeting organizations for data exfiltration and destruction](https://www.microsoft.com/security/blog/2022/03/22/dev-0537-criminal-actor-targeting-organizations-for-data-exfiltration-and-destruction/)\n\n[A Closer Look at the LAPSUS$ Data Extortion Group](https://krebsonsecurity.com/2022/03/a-closer-look-at-the-lapsus-data-extortion-group/)\n\nLapsus$ Telegram channel: t[.]me/minsaudebr\n\nEmail address associated with Lapsus$ Group: saudegroup[at]ctemplar[.]com\n\n_Updated March 25, 2022, at 8:30 a.m. PT._\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-24 - Threat Brief- Lapsus$ Group.pdf"
    ],
    "report_names": [
        "2022-03-24 - Threat Brief- Lapsus$ Group.pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536046,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1653786040,
    "ts_modification_date": 1653786040,
    "files": {
        "pdf": "https://archive.orkl.eu/49b46cff29864104bed75259ac216d2f1900a855.pdf",
        "text": "https://archive.orkl.eu/49b46cff29864104bed75259ac216d2f1900a855.txt",
        "img": "https://archive.orkl.eu/49b46cff29864104bed75259ac216d2f1900a855.jpg"
    }
}