{
    "id": "1f64bc4d-73b4-4a6d-99c0-73cc5c22e82b",
    "created_at": "2023-01-12T15:02:34.992668Z",
    "updated_at": "2025-03-27T02:16:25.869917Z",
    "deleted_at": null,
    "sha1_hash": "1a3bd7e8322826bd089a4c5144bade4b48750a9b",
    "title": "2013-05-08 - Alina- Casting a Shadow on POS",
    "authors": "",
    "file_creation_date": "2022-05-28T02:12:10Z",
    "file_modification_date": "2022-05-28T02:12:10Z",
    "file_size": 652803,
    "plain_text": "# Alina: Casting a Shadow on POS\n\n**[trustwave.com/Resources/SpiderLabs-Blog/Alina--Casting-a-Shadow-on-POS/](https://www.trustwave.com/Resources/SpiderLabs-Blog/Alina--Casting-a-Shadow-on-POS/)**\n\nOver the pastfew months, a number of malware families targeting Point of Sale (POS)\n[systems have been discussed. First there was Dexter (Seculert /](http://blog.seculert.com/2012/12/dexter-draining-blood-out-of-point-of.html) [SpiderLabs), then there](http://blog.spiderlabs.com/2012/12/the-dexter-malware-getting-your-hands-dirty.html)\n[was its big brother vSkimmer, and more recently there was Dump Memory Grabber /](http://blogs.mcafee.com/mcafee-labs/vskimmer-botnet-targets-credit-card-payment-terminals)\nBlackPOS. One of the most interesting threads of commonality between these samples is\nthe command and control (C&C) structure used between them. Utilizing a C&C\ncommunication channel for data exfiltration, while previously rare, has become more and\nmore common in POS malware. I'd like to use this blog post to discuss another similar\nsample that I recently got the chance to look at, named Alina. We've seen Alina on a\nnumber of active forensic cases in the past few months, which is how I was originally made\naware of this malware family.\n\nAlina is not completely unknown in the reversing community. Xylitol has a nice writeup on a\n[slightly older version, which you can find here. While an excellent read, I'd like to use this](http://www.xylibox.com/2013/02/alina-34-pos-malware.html)\nopportunity to dig into the mechanics of the malware further. There are a number of\nversions of the Alina malware family. For this post, I'm going to focus on version 4.0, which\nlooks to have been created on February 7th based on the PE timestamp information. I have\nsome newer versions, but I'm going to hold off talking about those until my next blog post,\nwhere I will discuss the evolution of this malware family and the changes made between\nrevisions. So without further adieu, let's dig in.\n\n\n-----\n\n**Startup**\n\nAlina has the ability to be run with a few different arguments. If the following argument is\nprovided, the malware will attempt to delete the specified file during execution.\n\nalina=<path_to_executable>\n\nAdditionally, it will skip the installation process. Both this argument and the installation\nprocess are described in further detail later on. Alina can also take the following argument,\nwhich will alert Alina to update itself with the executable specified.\n\nupdate=<orig_exe>;<new_exe>\n\nIn other words, we're updating the malware to a (presumably) newer version when we see\nthis argument.\n\nBy default, Alina will attempt to install itself to the victim machine.\n\n**Installation**\n\nInstallation is a multi-step process. Like many other pieces of malware, Alina makes use of\nthe HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run registry key. However, unlike\nmany other samples, this key is set to a random name from the following list:\n\njava\njusched\njucheck\ndesktop\nadobeflash\nwin-firewall\ndwm\n\nIf one of these keys are already found present on the system, it is deleted and a different\nname is used in its place. Additionally, the associated executable file that registry key\npointed to is also deleted. This technique is essentially used to ensure multiple copies of\nAlina are not installed simultaneously.\n\nOnce one of the names above are chosen, and the registry key is set, the malware will then\nattempt to copy itself to the victim user's %APPDATA% directory using that name plus\n'.exe'. So, for example, if Alina decided to install itself under the 'java' name, it would copy\nitself to %APPDATA%\\java.exe.\n\nOnce persistence has been achieved using this technique, the malware proceeds to call\nthis newly copied executable with the argument of 'alina=<path_to_original_executable>'.\nAs you may remember from earlier, this argument instructs Alina to delete that executable\nfile. So in essence, Alina copies itself to a different location and instructs that new copy to\n\n\n-----\n\ndelete the original when it s run. Just in case I ve confused anyone, I ve attempted to\nillustrate this process below:\n\n**Execution**\n\nSo at this point Alina is installed and persistence on the victim machine is set. Now we get\ninto the 'meat' of the sample. I.e. what does this thing actually do. Well, as mentioned at the\nbeginning of this post, Alina is POS malware, which means it will attempt to target track\ndata. Alina is in short a simple memory dumper with a lot of bells and whistles.\n\nAlina, like many other memory dumpers, makes use of the Windows API call\nCreateToolhelp32Snapshot() and Process32First() / Process32Next() in order to iterate\nthrough every process on the machine. In order to expedite the process of dumping\nmemory, Alina utilizes a blacklist approach to ignore well-known processes that may be\nrunning on the system. Specifically, the following process names are ignored:\n\nexplorer.exe\nchrome.exe\nfirefox.exe\niexplore.exe\nsvchost.exe\nsmss.exe\ncrss.exe\nwininit.exe\n\n\n-----\n\nsteam.exe\ndevenv.exe\nthunderbird.exe\nskype.exe\npidgin.exe\n\nIf the process isn't in this list, it is added to a list of processes that will be subsequently\nscanned for track data. Once this process completes, the malware then proceeds to\niteratively read through the process' memory and utilizes a series of regular expressions to\ndetermine if track data is present. As another technique to speed things up, the malware\nauthor decided to only look at memory pages that have the read/write attribute. If we take a\nsecond to think about the logic behind this, it makes complete sense. If a process is\nhandling track data, it will have to read and write to the memory location where this data is\nstored. This allows the malware author to only concern (him/her)self with sections of\nmemory that fit these attributes. The malware author is also concerning himself or herself\nwith memory that is accessible to the process, further saving time.\n\nI mentioned earlier that regular expressions were used by Alina to find track data.\nSpecifically, the following three regular expressions are used to find information that it\ndeems to be important:\n\nOnce Alina discovers any interesting data, it begins the exfiltration process.\n\n**Exfiltration**\n\nExfiltration takes place over plain HTTP in the form of a POST request. I hope you'll forgive\nme in not revealing the server IP addresses or domains, but unfortunately this information\nhas to remain confidential at this time. For what it's worth, plain HTTP is still by far one of\nthe most common exfiltration channels we at Trustwave SpiderLabs see when looking at\nPOS malware. To be fair, HTTP is easy to implement, and it works, so there's no real need\nfor these attackers to reinvent the wheel per se. We have begun seeing much more\nadvanced techniques for data encryption and exfiltration; however, these situations are still\nconsidered outliers.\n\nBefore exfiltration takes place, Alina encodes the data using a simple XOR key of \"0xAB\",\nand then proceeds to convert this data to its hex representation. This prevents the casual\nnetwork administrator from easily determining what data is being sent across the wire, and\nalso ensures that all data is within the ASCII range. We can see an example of this later on,\nalong with a simple decryption routine that shows us the original data.\n\n\n-----\n\nAlina has a number of POST parameters that contain various pieces of information\n(described in more detail in the C&C section). The parameter we care about below is the\n'ldata'/'cdata' param (Log Data / Card Data respectively).\n\n**Log Data Example**\n\n**Card Data Example**\n\nUsing my favorite scripting language (Ruby), we can easily extract the original data.\n\n**Log Data Decode**\n\n**Card Data Decode**\n\n\n-----\n\nI briefly mentioned the other POST parameters in these exfiltration requests. Let's look at\nthem in more detail. Through simply deduction, I've been able to determine the meaning\nbehind a number of these parameters, which I've outlined below:\n\nIn the event a correct request is made to the C&C server, it will respond with a 666 status\ncode, which is extremely odd for anyone that is familiar with HTTP.\n\nThose of you reading this blog post that are more awake than your sleepy friends might\nnotice the 'd' (Download) above, which I haven't spoken about yet. Remember way back in\nthe beginning of this blog post where I talked about how Alina can take the 'update=\n<orig_exe>;<new_exe>' argument, and has the ability to update itself? That's where this\ndownload option comes into play. Every 'x' seconds Alina will make this POST request and\nsee if there is a new version available.\n\nIf there is a new version available, we will see the remote server reply with data in the\nfollowing format:\niu:<update_interval>:<http_url>\n\nThe 'update_interval' parameter specifies the time to wait between making the update\nrequest. This value is read in as seconds. In order to add a bit of randomness to prevent\ndetections from network-based security products that may look for repeated patterns, the\nauthor adds a random value between 0 and 9 seconds to this value. By default, Alina is\nconfigured to set this update interval to 300 seconds. Therefore, by default, we will see\nthese update requests every 300 to 309 seconds.\n\n\n-----\n\nThe second parameter specifies the location of the updated copy of Alina. This file is\ndownloaded to the %TEMP% directory (using a random 10 letter name), and the malware\nupdates itself with this file using the 'update=' technique we saw in the Startup section of\nthis blog post.\n\nI realize this write-up is already becoming somewhat lengthy, but there's one more item I'd\nlike to talk about before I wrap things up. The following response can be provided by the\nserver when a log message is sent:\nli:<log_level>:<log_interval>\n\nThe log_level parameter specifies the level of logging used by the Alina malware. By\ndefault, this value is set to '2'. Setting this to '0' will configure Alina to a debugging state,\nwhere all messages will be uploaded via a series of POST requests. I've shown some of\nthese messages below (it's quite noisey):\n\nThe log_interval setting is used very similarly to the update_interval option used previously.\nThis setting specifies the amount of time to wait between when logs are uploaded. By\ndefault this value is set to 120 seconds. A random value between 0 and 9 seconds is added\nto this in order to prevent predictable POST requests.\n\n**Conclusion**\n\nOverall, Alina is a pretty interesting family of POS malware, simply because of the C&C\nstructure it employs. Alina does not appear to be installed on victim machines in any nonstandard way. Weak remote access passwords seem to be one of the largest ways this\nmalware is spreading. This should come to no surprise to anyone who has read our most\nrecent [Global Security Report, as this method of entry accounted for 47% of all breaches](https://www2.trustwave.com/2013GSR.html)\nwe've investigated this past year.\n\nAs we see POS malware authors evolve and continue to improve, it is likely that a C&C\nstructure will become increasingly common. While it is not my intention to scare anyone\nreading this, the prevalence of automation with regard to control and exfiltration should help\nto paint a picture of the currently threat landscape, as hackers are continuing to gain access\nto POS devices across the globe If you are responsible for managing a POS device please\n\n\n-----\n\nbe sure to set a strong remote access password, apply any necessary patches, remove\nunnecessary services, and follow general security practices to help prevent this sort of\nmalware from being installed on your device.\n\nWith that said, thanks for reading, and be sure to keep any eye out for my next post, where\nI will go into the evolution of Alina, and how the author(s) have continued to improve and\ntweak the malware over the course of the past seven months.\n[Continue Reading \"Alina: Following the Shadow Part 1\".](http://blog.spiderlabs.com/2013/05/alina-following-the-shadow-part-1.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-05-08 - Alina- Casting a Shadow on POS.pdf"
    ],
    "report_names": [
        "2013-05-08 - Alina- Casting a Shadow on POS.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535754,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653703930,
    "ts_modification_date": 1653703930,
    "files": {
        "pdf": "https://archive.orkl.eu/1a3bd7e8322826bd089a4c5144bade4b48750a9b.pdf",
        "text": "https://archive.orkl.eu/1a3bd7e8322826bd089a4c5144bade4b48750a9b.txt",
        "img": "https://archive.orkl.eu/1a3bd7e8322826bd089a4c5144bade4b48750a9b.jpg"
    }
}