{
    "id": "1f6d7f24-91ed-4747-9b5c-6cced2a04ea5",
    "created_at": "2023-01-12T15:04:07.530581Z",
    "updated_at": "2025-03-27T02:15:26.10813Z",
    "deleted_at": null,
    "sha1_hash": "8217135787c0387ee9f10957c4811d1b0653f5ba",
    "title": "2022-02-22 - Cybercrime Moves- Conti Ransomware Absorbs TrickBot Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:10:18Z",
    "file_modification_date": "2022-05-28T19:10:18Z",
    "file_size": 438044,
    "plain_text": "# Cybercrime Moves: Conti Ransomware Absorbs TrickBot Malware\n\n**[bankinfosecurity.com/cybercrime-moves-conti-ransomware-absorbs-trickbot-malware-a-18573](https://www.bankinfosecurity.com/cybercrime-moves-conti-ransomware-absorbs-trickbot-malware-a-18573)**\n\n[Critical Infrastructure Security,](https://www.bankinfosecurity.com/critical-infrastructure-security-c-525) [Cybercrime,](https://www.bankinfosecurity.com/cybercrime-c-416) [Cybercrime as-a-service](https://www.bankinfosecurity.com/cybercrime-as-a-service-c-417)\n\nTrickBot Being Used to Gain Initial Access to Victim's Network, Researchers Say Mathew J.\n[Schwartz (euroinfosec) • February 22, 2022](https://www.twitter.com/euroinfosec)\n\nTrickBot infections detected in the fall of 2020 (Source: AdvIntel)\nThe group that runs Conti ransomware has a new trick up its sleeve: hiring some of the top\nstaff responsible for having developed the venerable TrickBot malware.\n\n**See Also:** OnDemand | Understanding Human Behavior: Tackling Retail's ATO & Fraud\nPrevention Challenge\n\n[So reports New York-based threat intelligence firm Advanced Intelligence, aka AdvIntel,](https://www.advintel.io/post/the-trickbot-saga-s-finale-has-aired-but-a-spinoff-is-already-in-the-works)\nwhich says that Conti first began working with TrickBot a year ago, in an exclusive\narrangement giving it initial access to numerous networks.\n\n[While some other big-name ransomware operations have disappeared since last summer,](https://www.bankinfosecurity.com/9-ransomware-trends-more-leaks-higher-ransom-payments-a-18519)\nConti lives on. Experts say this seems to be due in part to its TrickBot ties, the operation\n[largely eschewing the use of third-party initial access brokers, and its being run as a tightly](https://www.bankinfosecurity.com/10-initial-access-broker-trends-cybercrime-service-evolves-a-17249)\n\n\n-----\n\ncontrolled group, including training its own network penetration specialists.\n\nSecurity experts say Conti-wielding attackers have likely earned profits worth hundreds of\nmillions of dollars. As of December 2021, a Conti ransom demand averaged $657,000,\n[according to ransomware incident response firm Coveware, based on thousands of incidents](https://www.coveware.com/conti-ransomware)\nit investigated.\n\nConti's single biggest known haul involved a ransom worth about $34 million, AdvIntel says.\n\n## Possible Ryuk Successor - or Splinter\n\nConti first appeared at the end of 2019. At the time, experts said that it reused code from\nRyuk, which debuted around August 2018. In June 2020, Conti attacks began surging, and in\nJuly 2020 Ryuk attacks began declining, which some read as a sign that there had been a\nchanging of the guard. Subsequently, however, a new version of Ryuk appeared.\n\n[As security firm Emsisoft has said, Conti could be a Ryuk splinter group.](https://blog.emsisoft.com/en/37866/ransomware-profile-conti/)\n\nConti has continued to evolve. In September 2020, the operation launched its own leak site,\nallowing it to name and shame victims and threaten to leak data via double-extortion tactics.\n\nTrickBot, meanwhile, debuted in late 2016 as a banking Trojan, before undergoing numerous\nmodifications. As with many other prior banking Trojans, TrickBot's developers continued to\nrefine the code and expand its capabilities, transforming it into information-stealing malware\nsporting modular capabilities. In particular, after infecting a system, TrickBot was designed to\nserve as a downloader for installing additional modules with specific capabilities. Some of\nthese modules have the ability to steal credentials, as well as web injection capabilities that\nallow the malware to spoof legitimate online banking and cryptocurrency exchange sites.\n\n\n-----\n\nTrickBot has been used to support many different types of attacks (Source: AdvIntel)\nBy 2020, TrickBot was often being used in combination with two other pieces of malware:\nEmotet and Ryuk ransomware (see: Emotet, Ryuk, TrickBot: 'Loader-Ransomware-Banker\n_Trifecta')._\n\nIn such attacks, Emotet was often used as a downloader for TrickBot, which then installed\n[tools such as Cobalt Strike penetration testing beacons, which attackers regularly repurpose](http://10.10.0.46/blogs/block-this-now-cobalt-strike-other-red-team-tools-p-3167%20)\nto use as malware. The goal: to try and obtain Domain Admin credentials to an organization's\nActive Directory, after which they could steal data and then deploy Ryuk ransomware to\nencrypt endpoints and hold them to ransom.\n\n## Close Ties to TrickBot\n\nSubsequently, Conti-wielding attackers began working with TrickBot, AdvIntel says. For\nTrickBot-infected endpoints, the malware provides remote access, giving Conti a beachhead\nfrom which it could attempt to access other parts of the victim's network, gain administrative\ncontrol in Active Directory and then deploy ransomware across the organization.\n\nOther security firms have also highlighted apparently close ties between Conti and TrickBot.\n[Last October, threat intelligence firm Mandiant detailed a cybercrime group with the code](https://www.mandiant.com/resources/fin12-ransomware-intrusion-actor-pursuing-healthcare-targets)\nname FIN12 that it says has used both Conti and Ryuk ransomware and that has an affinity\nfor [targeting the healthcare sector.](https://www.bankinfosecurity.com/fin12-ransomware-attacks-aggressively-targeting-healthcare-a-17717)\n\n\n-----\n\nWhether FIN12 is part of the core group that developed either strain of ransomware or an\naffiliate isn't clear. \"Mandiant has only directly observed FIN12 deploy Conti ransomware in\none case,\" it said. \"Based on information from various sources, we have high confidence that\nthe management and development staff of Conti and TrickBot are closely aligned.\"\n\n## In-House Approach\n\nSome ransomware operations, or oftentimes the affiliates of these operations who use the\nmalware to infect targets, will work with initial access brokers. Brokers sell ready access to\ncorporate networks, allowing affiliates and others to spend more time infecting targets,\nversus having to find targets in the first place.\n\nThrough TrickBot, however, Conti didn't need to rely on third parties, either to provide initial\naccess to victim networks or to distribute the malware, AdvIntel says.\n\n\"This partnership enables the Conti syndicate to answer the unfulfilled demand for initial\naccesses on an industrial scale, while competitor groups such as LockBit or Hive will need to\n[rely on individual low-quality access brokers,\" AdvIntel reported in December 2021 (see:](https://www.advintel.io/post/corporate-loader-emotet-history-of-x-project-return-for-ransomware)\n_[HHS Warns Health Sector About LockBit 2.0 Threats - Again).](https://www.bankinfosecurity.com/hhs-warns-health-sector-about-lockbit-20-threats-again-a-18486)_\n\nFrom a business standpoint, this arrangement turned out to be a wise move.\n\n\"Its relationship with TrickBot was one of the primary reasons for the rapid rise of Conti,\npossibly even for its survival,\" Yelisey Boguslavskiy, head of research at AdvIntel, says in a\nrecent report. \"With a stable and high-quality supply of accesses coming from a single\norganized source, Conti was able to maintain its image without any major structural\nchanges.\"\n\nWhereas ransomware-as-a-service operations typically share a massive amount of profit\nwith affiliates - the independent contractors who infect victims often get 70% or 80% of every\nransom paid - Conti instead appears to have focused on training staff and paying relatively\nlow wages, based in part on a leaked, Russian-language training manual. This means\ngreater profits for operators, and apparently also greater stability.\n\n\"As its competitors began going down one-by-one, either hit by the sudden crackdown of\nRussia's government or simply incapable of breaching enough networks to survive, Conti\nprospered,\" Boguslavskiy reports. \"Suddenly TrickBot, formally Conti's partner and equal,\nwas turning into its subsidiary. At the same time, Conti turned into the sole end-user of\nTrickBot's botnet product. By the end of 2021, Conti had essentially acquired TrickBot, with\nmultiple elite developers and managers joining the ransomware cosa nostra.\"\n\nBoguslavskiy's analysis is based in part on internal communications AdvIntel obtained\nbetween Conti and TrickBot.\n\n## Attack on Ireland's Health Service\n\n\n-----\n\nConti, however, has not been immune to missteps. In May 2021, Conti ransomware infected\nsystems at Ireland's Health Services Executive. While the group gave a decryptor to the Irish\ngovernment without charge, the damage was already done, and patient care in the country\nwas disrupted for months. Subsequently, the Irish government, backed by Interpol, began\ntargeting Conti's infrastructure for disruption.\n\nBoguslavskiy says that in the aftermath of the HSE attack, Conti reorganized. \"Conti split into\nseveral semi-autonomous groups,\" he tells Information Security Media Group. \"They do ally\nwith each other and support each other but have the different infrastructure, especially\neverything which is related to communication. This way they attempt to ensure that if some\ncomponents of their infrastructure are compromised, the entire organization is not affected.\nAdditionally, after this attack, Conti became more focused on internal security audits and\nthey are changing their servers once every several months.\"\n\n## Using Affiliates Carries Risks\n\nCompared to Conti, many other ransomware operations have fared less well. After an\n[affiliate of DarkSide hit Colonial Pipeline last May, causing Americans to panic-buy fuel,](https://www.bankinfosecurity.com/blogs/ransomware-groups-keep-blaming-affiliates-for-awkward-hits-p-3166)\npressure on the group led to it retiring the DarkSide name, to later reboot as BlackMatter and\nthen [BlackCat, aka Alphv. REvil, aka Sodinokibi, likewise went dark after hitting big targets](https://www.bankinfosecurity.com/blogs/ransomware-alphvblackcat-darksideblackmatter-reboot-p-3177)\nand then itself becoming the target of a Western law enforcement crackdown, backed by\nU.S. Cyber Command.\n\nConti, however, seems to have continued operating without interruption, despite the HSE hit.\n\"When the rest of the ransomware gangs were massively hiring random affiliates and\ndelegating them to breach corporate networks, Conti was working in a trust-based, teambased manner,\" Boguslavskiy reports. \"And when said random affiliates began to randomly\nhack Western infrastructure and randomly blackmail Western leaders, calling down the wrath\nof the Russian security apparatus on their heads, Conti merely kept a clear code of conduct\nand continued operations as normal.\"\n\n\n-----\n\nConti ransom note (Source: Coveware)\nTrickBot isn't the only third-party tool up Conti's sleeve. AdvIntel says the gang has continued\nto use the [Bazar backdoor, aka BazarBackdoor, to gain access to targets, and to run spam](https://www.bankinfosecurity.com/analysis-will-trickbot-takedown-impact-be-temporary-a-15167)\nemail campaigns that distributed Cobalt Strike beacons to gain remote access to systems.\n\n## TrickBot: Tough to Disrupt\n\nTrickBot has persisted despite multiple arrests and a large-scale attempt to disrupt it.\n\nA U.S. federal [indictment unsealed in June 2021 against Latvian national Alla Witte accused](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\nher of helping to design TrickBot \"to capture online banking login credentials and harvest\nother personal information, including credit card numbers, emails, passwords, dates of birth,\nSocial Security numbers and addresses,\" as well as to capture \"login credentials and other\nstolen personal information to gain access to online bank accounts, execute unauthorized\nelectronic funds transfers and launder the money through U.S. and foreign beneficiary\naccounts,\" and also to develop ransomware. Witte was arrested in Miami in February 2021\n(see: _[US Prosecutors Charge Latvian Woman in Trickbot Gang Case).](https://www.bankinfosecurity.com/us-prosecutors-charge-latvian-woman-in-trickbot-gang-case-a-16818)_\n\n\n-----\n\nSystems infected with Trickbot after its disruption in October 2020 (Source: Check Point\nSoftware)\n[TrickBot's infrastructure was disrupted in October 2020 but later returned.](https://www.bankinfosecurity.com/emotet-tactic-may-presage-more-rapid-ransomware-infections-a-18090)\n\nIf there's one piece of good news with the essential acquisition of TrickBot by Conti, it's that\nnothing lasts forever. AdvIntel reports that because TrickBot's indicators of compromise have\nbecome easy to detect, \"Conti is no longer using it.\"\n\nInstead, the group has been investing in the development of other tools. That includes\nmaking improvements to the Bazar backdoor, which was formerly part of TrickBot but is now\nstand-alone, AdvIntel says. Bazar appears now to be used solely to hit more high-value\ntargets, it says.\n\n+++\n**_Update - Feb. 23: Added additional comments from AdvIntel's Yelisey Boguslavskiy._**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-22 - Cybercrime Moves- Conti Ransomware Absorbs TrickBot Malware.pdf"
    ],
    "report_names": [
        "2022-02-22 - Cybercrime Moves- Conti Ransomware Absorbs TrickBot Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "a2d3f35f-3b29-4509-bff5-af2638140d39",
            "created_at": "2022-10-25T16:07:23.633982Z",
            "updated_at": "2025-03-27T02:02:09.898653Z",
            "deleted_at": null,
            "main_name": "FIN12",
            "aliases": [],
            "source_name": "ETDA:FIN12",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535847,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653765018,
    "ts_modification_date": 1653765018,
    "files": {
        "pdf": "https://archive.orkl.eu/8217135787c0387ee9f10957c4811d1b0653f5ba.pdf",
        "text": "https://archive.orkl.eu/8217135787c0387ee9f10957c4811d1b0653f5ba.txt",
        "img": "https://archive.orkl.eu/8217135787c0387ee9f10957c4811d1b0653f5ba.jpg"
    }
}