{
    "id": "1f719871-3ff0-4368-995c-95a40474b7af",
    "created_at": "2023-01-12T15:00:38.55205Z",
    "updated_at": "2025-03-27T02:15:06.241955Z",
    "deleted_at": null,
    "sha1_hash": "6007e41e68b2b081510bed3627f29b3b465c6863",
    "title": "2016-07-25 - Patchwork cyberespionage group expands targets from governments to wide range of industries",
    "authors": "",
    "file_creation_date": "2017-05-18T10:15:34Z",
    "file_modification_date": "2017-05-18T10:15:44Z",
    "file_size": 3935364,
    "plain_text": "# Hacker Machine Interface\n\n###### The State of SCADA HMI Vulnerabilities\n\n Trend Micro Zero Day Initiative Team\n\n\n-----\n\nTREND MICRO LEGAL DISCLAIMER\nThe information provided herein is for general information and\neducational purposes only. It is not intended and should not be\nconstrued to constitute legal advice. The information contained\nherein may not be applicable to all situations and may not reflect\nthe most current situation. Nothing contained herein should be\nrelied on or acted upon without the benefit of legal advice based\non the particular facts and circumstances presented and nothing\nherein should be construed otherwise. Trend Micro reserves the\nright to modify the contents of this document at any time without\nprior notice.\n\nTranslations of any material into other languages are intended\nsolely as a convenience. Translation accuracy is not guaranteed\nnor implied. If any questions arise related to the accuracy of a\ntranslation, please refer to the original language official version\nof the document. Any discrepancies or differences created in the\ntranslation are not binding and have no legal effect for compliance\nor enforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include accurate\nand up-to-date information herein, Trend Micro makes no warranties\nor representations of any kind as to its accuracy, currency, or\ncompleteness. You agree that access to and use of and reliance\non this document and the content thereof is at your own risk. Trend\nMicro disclaims all warranties of any kind, express or implied.\nNeither Trend Micro nor any party involved in creating, producing, or\ndelivering this document shall be liable for any consequence, loss,\nor damage, including direct, indirect, special, consequential, loss\nof business profits, or special damages, whatsoever arising out of\naccess to, use of, or inability to use, or in connection with the use\nof this document, or any errors or omissions in the content thereof.\nUse of this information constitutes acceptance for use in an “as is”\ncondition.\n\nWRITTEN BY:\n\nBrian Gorenc and Fritz Sands\n\nof the Trend Micro Zero Day Initiative Team\n\n\n### Contents\n\n#### 4\n\n##### Critical Infrastructure Attacks\n\n#### 6\n\n##### An Overview of the  HMI Industry\n\n#### 7\n\n##### Prevalent Vulnerability Types in Attack Surfaces\n\n#### 21\n\n##### Disclosure Statistics\n\n#### 24\n\n##### Researcher Guidance\n\n#### 26\n\n##### Conclusion\n\n\n-----\n\nThe impact of attacks targeting supervisory control and data acquisition (SCADA) systems\n\ndepends on the threat actors’ intent and the level of access and knowledge they have\n\nabout the target. The Stuxnet and Ukranian power grid attacks give us clear ideas about\n\nhow much damage a determined adversary can inflict not only on the business or operation\n\nconcerned, but also on the general public.\n\nThreat actors can use their access to SCADA systems to gather information such as a\n\nfacility’s layout, critical thresholds, or device settings for use in later attacks. Sabotage,\n\nincluding disrupting services or triggering dangerous and even lethal situations involving\n\nflammable or critical resources, represent an undesirable extreme.\n\nAttackers infiltrate SCADA systems through various means, one of which is through the\n\nexploitation of software vulnerabilities prevalent in Human Machine Interfaces (HMIs).\n\nAn HMI displays data from machines to a human and accepts commands from a human\n\noperator to machines. Through this interface, an operator monitors and responds to\n\nthe information displayed on a system. A modern HMI provides a highly advanced and\n\ncustomizable visualization about the current state of a system. More often than not, the\n\noperator controls a SCADA system through this interface, which is often installed on a\n\nnetwork-enabled location. As such, the HMI must be considered a primary target within a\n\nSCADA system, which should only be installed on an air-gapped or isolated on a trusted\n\nnetwork. Experience shows this is not always the case.\n\nDespite the obvious risks of obtaining unauthorized access to critical systems, the industry\n\nbehind the development of SCADA systems, specifically HMI vendors, tend to focus more\n\non equipment manufacture and less on securing the software designed to control them. The\n\nlack of global standards for HMI software further exacerbates software security problems\n\nwithin this field. We have also observed the same predictable software development\n\noversights, which demonstrate that HMIs are not utilizing basic defense-in-depth measures.\n\nThis research examines the current state of SCADA HMI security by reviewing all publicly\n\ndisclosed vulnerabilities in SCADA software that have been fixed from 2015 and 2016,\n\nincluding 250 vulnerabilities acquired through the Zero Day Initiative (ZDI) program. We\n\nfound that most of these vulnerabilities are in the areas of memory corruption, poor credential\n\nmanagement, lack of authentication/authorization and insecure defaults, and code injection\n\nbugs, all of which are preventable through secure development practices.\n\nFinally, we observed the average time between disclosing a bug to a SCADA vendor to\n\nreleasing a patch reaches up to 150 days, 30 more days than it would take highly deployed\n\nsoftware such as those of Microsoft or Adobe, but significantly less than enterprise offerings\n\nfrom companies such as Hewlett Packard Enterprise (HPE) and IBM. This means that it\n\ntakes an average of five months before SCADA vulnerabilities ever get patched. This, of\n\ncourse, differs among vendors. Some vendors may take as little as the same week while\n\nlarger ones can take up to 200 days to do so.\n\n\n-----\n\n## Critical Infrastructure Attacks\n\nThough you may not realize it, everyday modern life relies heavily on SCADA systems. These systems are\n\nresponsible for running industrial processes involved in activities such as power generation, manufacturing,\n\nmechanized production, and refining. SCADA systems are at the core of water treatment plants, gas\n\npipelines, electrical power distribution systems, wind farms, expansive communication systems, and even\n\ncivil defense sirens. In other words, behind most modern conveniences, there exists a SCADA system\n\nsomewhere that controls them. Therefore, attacks on SCADA systems have the potential to impact a wide\n\nrange of systems and numerous pieces of critical infrastructure. Such was the case for two well-known\n\nattacks—the Iranian nuclear systems attack, better known as “Stuxnet,” and the Ukrainian power grid\n\nattack.\n\n##### Stuxnet Attack on an Iranian Nuclear Plant\n\nMuch has already been written about Stuxnet. In fact, there is so much information available about this\n\npiece of malware that it has its own book[1] and movie.[2] While Stuxnet’s end goal was to sabotage Iran’s\n\nnuclear program by damaging programmable logic controllers (PLCs), the likely state-sponsored worm\n\ndid so by targeting the Siemens WinCC engineering software, which provides HMI-like functionality.[3]\n\nReports state that as many as one-fifth of Iran’s centrifuges were damaged by Stuxnet.[4] The emergence\n\nof malware that target the critical infrastructure of a foreign nation shows how critical finding and fixing\n\nproblems within SCADA systems has become.\n\n##### The Ukrainian Power Grid Attack\n\nOn 23 December 2015, unscheduled power outages began affecting a large number of customers\n\nserviced by Ukrainian power companies. There were also reports of malware infections affecting Ukrainian\n\ncompanies in a variety of critical infrastructure sectors. According to the Industrial Control Systems Cyber\n\nEmergency Response Team (ICS-CERT),[5] “During the cyber attacks, malicious remote operation of the\n\nbreakers was conducted by multiple external humans using either existing remote administration tools\n\n(RATs) at the OS level or remote ICS client software via virtual private network (VPN) connections.” In other\n\nwords, attackers turned off the lights for more than 230,000 customers with a few mouse clicks. These\n\n\n-----\n\nattacks did not target HMI vulnerabilities, but they did target the HMI solution. Because there was no\n\nnetwork isolation, the attacker was able to connect via VPN and used remote access solutions to disable\n\nsystems via the HMI.\n\nWhile some Ukrainians were quick to place the blame on their neighbors to the east, the truly frightening\n\npiece of this story is the acknowledgment that the Ukrainian power system was found to be more secure\n\nthan counterparts in the U.S.[6] Regardless of who was responsible or why, the attack showed what a\n\ndetermined actor could do to a nation’s power supply given enough time and resources.\n\n##### The Role of the U.S. ICS-CERT\n\nA part of the U.S. Department of Homeland Security, ICS-CERT is tasked with reducing risks within and\n\nacross all critical infrastructure sectors by partnering with law enforcement agencies and the intelligence\n\ncommunity, and coordinating efforts among federal, state, local, and tribal governments and control\n\nsystem owners, operators, and vendors.[7] When the ZDI program purchases vulnerabilities that affect\n\nSCADA systems, a majority are reported to ICS-CERT for resolution. In 2015, ICS-CERT responded to\n\n295 incidents and handled 486 vulnerability disclosures.[8]\n\n##### Why Target the HMI\n\nWhen going after SCADA systems, attackers tend to target the HMI for obvious reasons. The HMI\n\nrepresents the main hub for managing the critical infrastructure. If it can be compromised, just about\n\nanything can be done to the infrastructure itself, including causing physical damage to SCADA equipment.\n\nEven if the intent is not to harm the SCADA system, by controlling the HMI an attacker could harvest\n\ncritical architecture information for other purposes. Since the HMI acts as the main hub for managing\n\nthe critical infrastructure, controlling it allows an attacker to harvest information about its architecture.\n\nAn attacker could also disable alarms and notifications meant to alert operators to dangers to SCADA\n\nequipment.\n\n\n-----\n\n## An Overview of the  HMI Industry\n\nThe marketplace for SCADA HMI is very active, but often not as secure as desired due to a variety of\n\nreasons. The largest HMI vendors in the industry include Siemens, Advantech, and GE, but there are also\n\nsmaller players in many other countries. For instance, vendors in Asia specialize in systems for the region.\n\nThe same can be said for vendors in Europe and North America.\n\nFurthermore, since vendors of various sizes coexist, mergers and acquisitions happen frequently as well.\n\nIn some cases, a small vendor gets bought before a patch comes out, making it hard to track the state\n\nof vulnerability throughout the disclosure process. Additionally, SCADA system vendors tend to focus on\n\nthe actual industrial equipment and not on the software that manages them because they make the most\n\nprofit selling the hardware. In fact, often, the HMI for a system is freely downloadable.\n\nWhen it comes to the actual codes behind SCADA systems, a majority does not utilize basic defense-in\ndepth measures such as address space layout randomization (ASLR),[9] SafeSEH,[10] or stack cookies.[11] This\n\nmay be related to the mistaken belief that these solutions will operate in a completely isolated environment.\n\nSCADA solution developers often have little experience with regard to user interface (UI) construction.\n\nThis is coupled by the fact that developers do not know what the final operating environment will be like\n\nfor the systems. This causes developers to make assumptions that are often incorrect. Without a mature\n\ndevelopment life cycle program to guide them, SCADA developers will likely continue to make the same\n\nmistakes that application and OS developers made a decade ago.\n\n\n-----\n\n## Prevalent Vulnerability Types in Attack Surfaces\n\nIn order to determine what vulnerabilities exist in HMIs, ZDI researchers reviewed the 2015 and 2016 ICS\nCERT advisories to identify all of the solutions that had bugs fixed within the last two years. This data was\n\nthen cross-referenced with the more than 250 zero days purchased by the ZDI program. This information\n\nwas also compared with the Common Weakness Enumeration (CWE) to determine what existed within\n\nthis space. We have categorized these SCADA vulnerability types from this time period into memory\n\ncorruption, credential management, lack of authentication/authorization and insecure defaults, and code\n\ninjection.\n\n\nMemory corruption\n\nCredential management\n\nLack of authentication/\nauthorization and insecure\ndefaults\n\nCode injection\n\nOthers\n\nFigure 1: Vulnerability categories\n\n\n20.44%\n\n18.98%\n\n23.36%\n\n8.76%\n\n28.46%\n\n\nWhile some cross-site scripting (XSS) and Cross-Site Request Forgery (CSRF) issues were expected,\n\nmost of the HMIs are Windows- and not web-based applications. Some XSS and CSRF bugs do exist\n\nwithin the “Others” category, though they are not numerous. Instead, most of the vulnerabilities exist\n\nwithin one of the four areas, namely:\n\n  - Memory corruption\n\n  - Credential management\n\n  - Lack of authentication/authorization and insecure defaults\n\n  - Code injection\n\n\n-----\n\n##### Memory Corruption Issues\n\nMemory corruption issues represent 20% of the vulnerabilities identified. The weaknesses in this category\n\nrepresent classic code security issues such as stack- and heap-based buffer overflows and out-of-bounds\n\nread/write vulnerabilities. Memory corruption may occur in HMIs when the contents of a memory location\n\nare unintentionally modified due to errors somewhere in the code. This may also be referred to as violating\n\nmemory safety. When the corrupted memory contents are used later in that program, the program either\n\ncrashes or executes code that was not intended to run.\n\nMemory corruption 20.44%\n\n###### Case Study: Advantech WebAccess HMI Solution\n\nAt one point, the ZDI program received 100 separate reports involving the Advantech WebAccess HMI\n\non a single day. The majority of these cases turned out to be buffer overflows, most of which are similar\n\nto the example below.\n\nFigure 2: Advantech WebAccess dashboard\n\n\n-----\n\nOne interesting item to note about this product is that while it currently is a SCADA solution, it is also\n\nadvertised as an Internet of Things (IoT) solution. The solution contains the service webvrpcs.exe that\n\nruns in the context of a local administrative user. The service listens on Transmission Control Protocol\n\n(TCP) port 4592 by default and may be accessed over a Remote Procedure Call (RPC)-based protocol.\n\nThe service calls from the application are intended to resemble Microsoft® Windows® Device IoControl\n\nfunction calls. Each service call contains an input/output control (IOCTL) value that enables jump tables\n\nto be used to perform hundreds of service types. In this example, the parameter involved is the window\n\nname that is copied via the _sprintf function to a stack buffer that is 0x80 characters.\n\n\n0000154 05 00 00 03 10 00 00 00 c0 00 00 00 05 00 00 00 ....... ......\n\n0000164 a8 00 00 00 00 00 00 00 c0 3f 58 05 8b 38 01 00 ....... x..8..\n\n0000174 8c 00 00 00 8c 00 00 00 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n0000184 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n0000194 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n00001A4 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n00001B4 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n00001C4 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n00001D4 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n00001E4 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n00001F4 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f 7f ....... ......\n\n0000204 00 00 00 00 04 00 00 00 04 00 00 00 00 00 00 00 ....... ......\n\n\nThe area marked in yellow is the IOCTL code, followed by the buffer length (in and out)—both 0x8c bytes\n\nfollowed by a terminating null. Since the attack puts 0x8c bytes of data into a 0x80 byte length buffer, the\n\npredictable overflow results. As the process is not ASLR aware, the area ahead of the IOCTL is a binding\n\nhandle and connection ID, which is set up by an earlier call to register as a client of the service.\n\nReviewing the vulnerable code reveals the classic _sprintf call, which allows the overflow condition.\n\n\n.text:100015D6 loc_10015D6 ; CODE XREF: BwSvcFunction+44j\n\n.text:100015D6 ; DATA XREF: .text:off10001B08o\n\n.text:100015d6 push offset aRpc_dllBwcmd_g ; jumptable 10001124\n\ncase 20011\n\n.text:100015DB call sub_10001BB0\n\n.text:100015E0 move ebx, [esp+0F8h+arg_8]\n\n.text:100015E7 add esp, 4\n\n.text:100015EA lea edx, [esp+0F4h+WindowName]\n\n.text:100015EE push ebx\n\n.text:100015EF push offset aS ; “%s”\n\n.text:100015F4 push edx ; char *\n\n.text:100015F5 call _sprintf\n\n\n-----\n\nInspecting the stack layout reveals that WindowName is set to -80 with 0 as the return address. Since it\n\nwas not set during the compile[13] stage, there are no stack cookies set to aid in protection.\n\n\n.text:100010E0 lParam = dword ptr -0E4h\n\n.text:100010E0 var_E0 = dword ptr -0E0h\n\n.text:100010E0 var_DC = dword ptr -0DCh\n\n.text:100010E0 var_D8 = dword ptr -0D8h\n\n.text:100010E0 wParam = dword ptr -0D4h\n\n.text:100010E0 var_D0 = dword ptr -0D0h\n\n.text:100010E0 var_CC = byte ptr -0CCh\n\n.text:100010E0 var_C0 = byte ptr -0C0h\n\n.text:100010E0 File = byte ptr -0A0h\n\n.text:100010E0 WindowName = byte ptr -80h\n\n.text:100010E0 arg_0 = dword ptr 4\n\n.text:100010E0 arg_8 = dword ptr 0Ch\n\n.text:100010E0 arg_C = dword ptr 10h\n\n.text:100010E0 arg_10 = dword ptr 14h\n\n\nThe lack of stack cookies as well as of other protections such as ASLR and SafeSEH is likely due to the\n\noriginal code being written prior to the existence of these coding practices. However, the use of banned\n\napplication program interfaces (APIs) and the lack of defense-in-depth measures mean that an attacker\n\nmerely needs to overwrite the return address to the beginning of the attacker-controlled return-oriented\n\nprogramming (ROP) chain. With no ASLR, no complexities are required to execute attacker-controlled\n\ncode at an elevated privilege.\n\nThe patch analysis for this vulnerability also shows some interesting choices in cleaning up an aging code\n\nbase. The original offending function _sprintf was included in the Microsoft-banned API[14] list originally\n\nreleased in 2007. ZDI researchers expected Advantech to implement a banned-API list and remove known\n\nbad functions from its code. Instead, the patch for this bug changed the _sprintf function to the _snprintf\n\nfunction.\n\n\n.text:10001600 lea edx, [esp+0F4h+WindowName]\n\n.text:10001604 push ebx\n\n.text:10001605 push offset aS ; “%s”\n\n.text:1000160A push 7Fh ; size_t\n\n.text:1000160C push edx ; char *\n\n.text:1000160D call _snprintf\n\n\n-----\n\nHowever, _snprintf is also in the banned-API list. While _snprintf provides more resiliency to overflows\n\nthan _sprintf, it fails to null terminate when provided with too many characters. This means that when the\n\nstack is not cleaned out—a rare situation—it becomes possible for attackers to use string manipulation\n\non this WindowName to trick the program into thinking the buffer is 0x80 characters long when in reality,\n\nthe buffer is longer since it did not null terminate.\n\nOut of the 75 patches that Advantech produced, all were point fixes. In other words, the vendor fixed\n\nspecific issues but did not globally replace banned APIs or other problematic functions. Thousands of\n\n_sprintf and _snprintf functions remain in the code base. The probability that none of these remaining\n\nbanned APIs can be reached by attacker-controlled data is next to zero. Advantech did not release patches\n\nfor the remaining 25 issues reported by ZDI researchers. These issues were subsequently disclosed to the\n\npublic in accordance with the ZDI program’s policies.[15]\n\n##### Credential Management Issues\n\nCredential management issues represent 19% of the vulnerabilities identified. The vulnerabilities in the\n\ncategory represent cases such as using hard-coded passwords, storing passwords in a recoverable\n\nformat (e.g., clear text), and insufficiently protecting credentials.\n\nCredential management 18.98%\n\n###### Case Study: GE MDS PulseNET Hidden Support Account\n\nGeneral Electric (GE) MDS PulseNET is used to monitor devices and industrial communication networks\n\ndeployed in energy, water, and waste water sectors worldwide. The ZDI program received a vulnerability\n\nreport that stated, “The affected products contain a hard-coded support account with full privileges.”\n\nThe full investigation resulted in the disclosure of CVE-2015-6456 with a Common Vulnerability Scoring\n\nSystem (CVSS) rating of 9.0.\n\nA look at the user management panel indicates the existence of only two accounts in the system—\n\noperator and admin. However, as noted by Andrea Micalizzi (who also goes by the handle “rgod”), a\n\nhidden third account exists that has full admin privileges.\n\n\n-----\n\nFigure 3: GE MDS PulseNET user management panel\n\nUsing HeidiSQL[16] to extract information from the database exposes the account “ge_support” with a\n\npassword hash of <![HDATA[MD5$8af7e0cd2c76d2faa98b71f8ca7923f9. By cracking the MD5 hash, the\n\npassword is exposed as “Pu1seNET.”\n\nFigure 4: GE MDS PulseNET user management panel after logging in\n\nEven after logging in using the “ge_support” account, the third user name does not appear in the user\n\nmanagement panel.\n\n\n-----\n\n##### Lack of Authentication/Authorization and  Insecure Defaults\n\nThis category represents 23% of the SCADA vulnerabilities. It includes many insecure defaults, clear-text\n\ntransmission of sensitive information, missing encryption, and unsafe ActiveX controls marked safe for\n\nscripting.\n\n\nLack of authentication/\nauthorization and insecure\ndefaults\n\n\n23.36%\n\n\n###### Case Study: Siemens SINEMA Server Insecure File Permissions Privilege Escalation Vulnerability\n\nOne misconfiguration often seen in HMI products occurs when companies decide to create their own\n\nAccess Control Lists (ACLs) and top-level directory instead of using the default Windows Program Files\n\ndirectory. Instead of being properly protected, these top-level directories are by default world-writable,\n\nand the directory tree includes the solution’s service binaries. This allows any local user to drop new\n\nbinaries that will execute as a system service into the directory.\n\nThis issue manifested itself in the Siemens SINEMA Server and was addressed through CVE-2016-6486.[17]\n\nThe product installed itself in a directory tree with a weak ACL. By default, Microsoft sets up a directory—\n\nProgram Files—with secure ACLs.\n\nAdministrator: Command Prompt\n```\n            C:\\>icacls “Program Files”\n            Program Files NT SERVICE\\TrustedInstaller:(F)\n                   NT SERVICE\\TrustedInstaller:(CI)(IO)(F)\n                   NT AUTHORITY\\SYSTEM:(M)\n                   NT AUTHORITY\\SYSTEM:(OI)(CI)(IO)(F)\n                   BUILTIN\\Administrators:(M)\n                   BUILTIN\\Administrators:(OI)(CI)(IO)(F)\n                   BUILTIN\\Users:(RX)\n                   BUILTIN\\Users:(OI)(CI)(IO)(GR,GE)\n                   CREATOR OWNER:(OI)(CI)(IO)(F)\n                   APPLICATION PACKAGE AUTHORITY\\ALL APPLICATION PACKAGES:(RX)\n                   APPLICATION PACKAGE AUTHORITY\\ALL APPLICATION PACKAGES:(OI)(CI)(IO)(GR,GE)\n                   APPLICATION PACKAGE AUTHORITY\\ALL RESTRICTED APPLICATION PACKAGES:(RX)\n                   APPLICATION PACKAGE AUTHORITY\\ALL RESTRICTED APPLICATION PACKAGES:(OI)(CI)(IO)(GR,GE)\n            Successfully processed 1 files: Failed processing 0 files\n            C:\\>\n\n```\nFigure 5: Command line showing the Program Files standard permissions\n\n\n-----\n\nNote that only administrative and special accounts have the ability to write files into that tree. Users also\n\nhave read and execute permission.\n\nInstead of using Program Files or at least the same permissions found in Program Files, the Siemens\n\ninstaller creates its own top-level tree.\n\nFigure 6: Security permissions properties for Siemens SINEMA Server\n\nAs seen above, anyone on the system may append and write data to the files contained in this directory.\n\nUsers may also add files and subdirectories, which can lead to code execution because of localization\n\ndirectories. Even worse, if we examine the permissions where the programs reside, the results prove\n\ntroubling.\n\n\nC:\\Siemens\\SINEMAServer\\WinCC_OA>icacls 3.11\n\n3.11 NT AUTHORITY\\Authenticated Users:(I)(OI)(CI)(F)\n\nNT AUTHORITY\\SYSTEM:(I)(OI)(CI)(F)\n\nBUILTIN\\Administrators:(I)(OI)(CI)(F)\n\nBUILTIN\\Users:(I)(OI)(CI)(RX)\n\nBUILTIN\\Users:(I)(CI)(AD)\n\nBUILTIN\\Users:(I)(CI)(WD)\n\nCREATOR OWNER:(I)(OI)(CI)(IO)(F)\n\n\nAs noted by the highlighted string, Authenticated Users have full control. To join the Authenticated Users\n\ngroup, a user only needs to authenticate with the Windows domain. Essentially, that means almost\n\neveryone on the system will be in the Authenticated Users group. Examining a binary within this directory\n\nshows similar results.\n\n\n-----\n\nC:\\Siemens\\SINEMAServer\\WinCC_OA\\3.11\\bin>icacls WCCILpmon.exe\n\nWCCILpmon.exe NT AUTHORITY\\Authenticated Users:(I)(F)\n\nNT AUTHORITY\\SYSTEM:(I)(F)\n\nBUILTIN\\Administrators:(I)(F)\n\nBUILTIN\\Users:(I)(RX)\n\n\nIt is important to note that this particular binary starts a service that runs at the Local System level.\n\n\nC:\\Windows\\system32>sc qc sinema_server\n\n[SC] QueryServiceConfig SUCCESS\n\nSERVICE_NAME: sinema_server\n\nTYPE        : 10 WIN32_OWN_PROCESS\n\nSTART_TYPE     : 2  AUTO_START\n\nERROR_CONTROL   : 1  NORMAL\n\nBINARY_PATH_NAME  :\n\nC:\\Siemens\\SINEMAServer\\WinCC_OA\\3.11\\Bin\\WCCILpmon.exe\n\nLOAD_ORDER_GROUP  :\n\nTAG        : 0\n\nDISPLAY_NAME    : SINEMA_SERVER\n\nDEPENDENCIES    : Sinema_Server_Db\n\nSERVICE_START_NAME : LocalSystem\n\n\nThe end result of this insecure default installation allows any Authenticated User to swap out the binary\n\nat will. Furthermore, that new attacker-controlled binary executes under the context of Local System after\n\nthe next reboot.\n\n###### Case Study: Advantech WebAccess\n\nAdvantech WebAccess provides a cross-platform, cross-browser data access experience, and a UI\n\nbased on HTML5 technology.[18] The ZDI program received a bug report about a condition that allowed\n\nother passwords to be viewed when changing a password. The ICS-CERT report description of this bug\n\nstates, “A properly authenticated administrator can view passwords for other administrators.” It should\n\nbe noted that this does not mean the system administrator. Instead, this refers to the administrator of a\n\ngiven SCADA solution.\n\nWithin the solution, there exists the script upAdmin.asp that allows a SCADA administrator to update his\n\nusername, password, or description. This Active Server Pages (ASP) script can be abused by someone\n\nwith permission on the system.\n\n\n-----\n\nFigure 7: Advantech WebAccess User Configuration panel\n\nFor an attacker to take advantage of this bug, he must first log in to a known account and click\n\n“Project user property.” This takes him to the URL http://<ip>/broadWeb/user/upAdminPg.\n\nasp?uname=known&return=bwproj.\n\nIn this example, <ip> is the IP address of the system and known is the known user account. The attacker\n\nthen changes the name of the account in the URL to the targeted account as in http://<ip>/broadWeb/\n\nuser/upAdminPg.asp?uname=victim&return=bwproj.\n\nWhile the password for the victim account is initially obscured by asterisks, simply viewing the HTML\n\nsource on the page will display the password of the target user.\n\n\n<tr bgcolor=“#C9C9CB”>\n\n<td width=“30%” align=“right”><font class=e3>Password</font></td>\n\n<td width=“70%” align=“left” valign=“middle”>\n\n<input type=“password” name=“Password” maxlength=“8” size=“8” value=“secret”>\n\n</td>\n\n</tr>\n\n\nThis bug allows an authenticated user to get the password of any other user, including the overall\n\nadministrator of the SCADA solution.\n\n\n-----\n\n##### Code Injection Issues\n\nMuch like other online services, code injection vulnerabilities exist within the HMI realm. These issues\n\nrepresent 9% of the vulnerabilities identified. While common injection types—SQL, command, OS,\n\ncode—still occur, there are domain-specific injections that also pose a risk to SCADA solutions. One of\n\nthe domain-specific languages prone to injection is Gamma script, which is used by the Cogent DataHub\n\nsystem.\n\nCode injection 8.76%\n\n\n###### What is Gamma script?\n\nCogent DataHub products use a proprietary language called Gamma for its HMI\n\nsolutions. According to the manufacturer, Gamma is a dynamically typed interpreted\n\nprogramming language specifically designed to allow rapid development of control\n\nand UI applications. The language relies on a syntax similar to C and C++ but with a\n\nrange of built-in features that make it a far better language for developing sophisticated\n\nreal-time systems. Gamma also comes with a fully documented API and is available\n\nto anyone on the Internet.\n\n\n-----\n\n###### Case Study: Cogent DataHub\n\nAccording to the manufacturer, Cogent DataHub is a memory-resident, real-time database that acts as\n\na hub that provides fast and efficient concentration and distribution of data for OLE for Process Control\n\n(OPC) and other Windows applications. The ZDI program received a report on a bug that allows an\n\nattacker to turn on insecure processing mode in the web server. This provides a way for an attacker to\n\nsend arbitrary scripts to the server and execute arbitrary code.\n\nFigure 8: Cogent DataHub WebView\n\n(Source: http://www.softwaretoolbox.com/images/101210_webview_1.gif?crc=3945836907)\n\nAs seen above, Cogent DataHub provides a real-time middleware solution that adds visualizations to\n\ncomplex SCADA systems.\n\nIn this case, the attacker leverages a flaw in the EvalExpression method within Gamma to execute\n\nattacker-controlled code in the target system. This method is remotely accessible through the Ajax facility\n\nlistening on TCP port 80. Supplying the target a specifically formatted Gamma script allows the execution\n\nof arbitrary OS commands.\n\n\n-----\n\nSince Gamma is a domain-specific language, it contains many built-in features and functions specific\n\nto the SCADA industry. However, the script also contains the ability to access and execute system\n\ncommands. It is this ability that may be abused by the attacker, as seen in the vulnerable code below.\n\n\nMethod AJAXSupport.EvalExpression(!expression)\n\n{\n\nif (.allow_any_expression)\n\n{\n\neval (expression); << Bug here\n\n}\n\nelse\n\n{\n\nerror (“Arbitrary expressions evaluation is disabled”);\n\n}\n\n}\n\n\nThe highlighted bug takes an expression and checks one flag to determine if the system is allowed to\n\nexecute the expression. If this check returns true, the expression executes, regardless of what it contains.\n\nAn attacker still must trick the system into loading the necessary libraries and change the value to ensure\n\nthe system returns true to execute the expression. Fortunately for the attacker, the system allows for this\n\nas well.\n\nTo complete this exploit, an attacker must first send an HTTP request to any Gamma script that loads the\n\nnecessary libraries. As mentioned, while developers assume these systems will operate on an isolated\n\nnetwork, this is often not the case. The attacker uses the request to call AJAXSupport.AllowExpressions\n\nand set allow_any_expression to True. This allows the attacker to then call the AJAXSupport.EvalExpression\n\nmethod and pass in the script that he wants to execute. This attack method is very reliable and repeatable.\n\n\n-----\n\nReviewing the patch shows how Cogent decided to tackle the problem. The left-hand side of the image\n\nbelow shows the old code while that on the right-hand side shows the patched code. The changes are\n\nhighlighted.\n\nFigure 9: Code differences before and after patching\n\nThe first portion of the patch removed AllowExpressions completely. This prevents an attacker from\n\ntoggling that flag within the system. While the vendor did not remove EvalExpressions completely, it did\n\nadd a comment noting that the use of the method represents a security risk.\n\n\n/* This method is dangerous. It could allow somebody to execute arbitrary\n\ncode via an HTTP call. If you absolutely need it then create a script to\n\ndefine it, and then be sure the web server port is only accessible from a\n\ntrusted network */\n\n\nCogent also commented out the offending code to prevent it from being called in by default. To enable the\n\ncode, a developer must go in and manually uncomment the method. This method also makes it unlikely\n\nfor Cogent to regress the bug at a later time.\n\n\n-----\n\n## Disclosure Statistics\n\n##### Vulnerability Exposure Windows\n\nWhen researchers do find vulnerabilities in SCADA products, the amount of time needed to fix the bug\n\nvaries. This time is often referred to as the vulnerability exposure window. ZDI researchers reviewed all\n\nHMI vulnerabilities received through the program (more than 250) and measured how long they actually\n\ntook to get fixed. As seen in the data over the last four years, the mean time to fix is not trending down.\n\nSince 2013, the average time between when ZDI researchers disclose a bug to the vendor and the time\n\nwhen a patch is released is right about 140 days.\n\n200\n\n158 158\n\n\n143\n\n\n100\n\n0\n\n\n124\n\n2013 2014 2015 2016\n\n\nFigure 10: Mean time to patch vulnerabilities from the time they were disclosed by year\n\nPatch quality also plays a role in this time line. A problematic update applied to a system could result in a\n\nself-induced denial of service (DoS) on a critical piece of infrastructure. Due to these and other concerns,\n\nthere is a lag between the availability of a patch and the installation of that patch to a production system.\n\n\n-----\n\nNot all SCADA vendors work under the same time lines. Certain vendors respond much more quickly\n\nthan others. For example, ZDI has seen Cogent Real-Time Systems consistently respond quickly to bug\n\nreports. In one of the first disclosures to Cogent, the CEO actually emailed ZDI researchers to better\n\nunderstand the vulnerability and ensure it was quickly patched (six days). Larger vendors—ABB, GE,\n\nIndusoft, and PTC—take on average over 200 days to produce a patch.\n\nABB 221\n\nAdvantech 131\n\nCodesys 192\n\nCogent Real-Time Systems 58\n\nEcava 171\n\n\nGE\n\nHoneywell\n\nIndusoft\n\nMICROSYS\n\nPTC\n\nRockwell Automation\n\nSchneider Electric\n\nTibbo\n\nTrihedral Engineering\n\nUnitronics\n\nWellinTech\n\n\n214\n\n\n226\n\n226\n\n\n0 125 250\n\nFigure 11: Mean time to patch vulnerabilities from the time they were disclosed by vendor\n\n\n-----\n\n##### Industry-by-Industry Comparison\n\nComparing the response time of the SCADA industry to other industries reveals their response time\n\nis not unlike other industries. While the highly deployed software of large vendors such as Microsoft,\n\nApple, Oracle, Adobe, and others have an average response time of under 120 days, SCADA and security\n\nsoftware vendors’ average around 150 days. The security software industry is slightly faster but not\n\nsignificantly. The business software category includes enterprise offerings from companies such as HPE\n\nand IBM. These vendors take significantly longer to address bug disclosures.\n\n\n200\n\n100\n\n0\n\n\n146\n141\n\n116\n\nBusiness Highly SCADA Security\ndeployed\n\n\n189\n\n\nFigure 12: Mean time to patch vulnerabilities from the time they were disclosed by industry\n\n\n-----\n\n## Researcher Guidance\n\nFor researchers who are looking for vulnerabilities within HMI solutions, including vendors who are auditing\n\ntheir own solutions, there are steps you can take to help find bugs quickly and efficiently.\n\n##### Basic Fuzzing\n\nThe first step to finding vulnerabilities within HMI solutions involves fuzzing. Even simple bit-flipping\n\nfuzzing produces highly effective results against HMI vulnerabilities. Researchers should look for new file\n\nassociations during installation to aid in fuzzing, as many of the file formats are wide open. Also, make\n\nsure to enable page heap on the process that is being attacked to find heap corruption since then it\n\nbreaks at the corruption point instead of later on when it is being used.\n\n##### Attack Surface Analyzer\n\nThe Microsoft Attack Surface Analyzer (ASA)[19] assists developers in understanding changes in Windows\n\nsystems’ attack surface resulting from the installation of the applications the vendor develops. The tool\n\ncreates system snapshots before and after installation. ASA also highlights security misconfigurations\n\nand increases in attack surfaces. These include such things as Component Object Model (COM) objects,\n\nActiveX controls, file associations, and RPC endpoints.\n\n\n-----\n\nFor example, the output below shows the web root directory—a location where files are placed for\n\nexecution in the high-privileged web server context—is currently set as world-writable.\n\nFigure 13: Output showing the web root directory\n\nNote that ASA currently does not work in Windows 10 but is still available for previous Windows versions.\n\n##### Audit for Banned APIs\n\nSince the introduction of the Security Development Lifecycle (SDL)[20] in 2006, Microsoft banned the use\n\nof problematic C library functions. Many APIs within the C runtime are known security issues and should\n\nbe avoided. Our investigation found that these banned APIs and other functions are far too common in\n\nHMI code and have predictably negative effects. Use a disassembler such as IDA to trace the tainted\n\ndata back to the source of the unsafe copy APIs (sprintf, strcpy), especially if an exploit can get to these\n\nfunctions from attacker-supplied data.\n\n\n-----\n\n## Conclusion\n\nWithin the various SCADA solutions, the HMI represents the clearest and most present target for\n\nattackers. The HMI acts as a centralized hub for managing critical infrastructure. If an attacker succeeds\n\nin compromising the HMI, nearly anything can be done to the infrastructure itself, including causing\n\nphysical damage to SCADA equipment. Even if attackers decide not to disrupt operations, they can still\n\nexploit the HMI to gather information about a system or disable alarms and notifications meant to alert\n\noperators of danger to SCADA equipment.\n\nIn our research, we found that most HMI vulnerabilities fell into four categories—memory corruption,\n\ncredential management, lack of authentication/authorization and insecure defaults, and code injection—\n\nall of which are preventable through secure development practices. We also observed that the average\n\ntime between when ZDI researchers disclose a bug to a SCADA vendor and the time when a patch is\n\nreleased reaches up to 150 days, 30 more days than it would take vendors such as Microsoft or Adobe to\n\ndo so, but 43 days less than enterprise offerings from companies such as HPE and IBM. Considering the\n\nimpact of attacks against SCADA systems, where vulnerabilities are an effective entry point, our hope is\n\nthat HMI vendors, SCADA owners, and administrators take notice and respond accordingly.\n\nResearchers who are looking to find new vulnerabilities in HMIs should start with basic fuzzing techniques.\n\nEven simple bit-flipping fuzzing produces highly effective results against HMI vulnerabilities. Researchers\n\nshould also look for new file associations during installation to aid in fuzzing, as many of the file formats\n\nare wide open.\n\nDevelopers of HMI and SCADA solutions would be well advised to adopt the secure life cycle practices\n\nimplemented by OS and application developers over the last decade. By taking simple steps such as\n\nauditing for the use of banned APIs, vendors can make their products more resilient to attacks. SCADA\n\ndevelopers also need to expect their products to be used in manners that they did not intend. For example,\n\neven though it should be considered a poor security practice, developers must assume their products\n\nand solutions will be connected to a public network. By taking the mindset that assumes a worst-case\n\nscenario, developers can implement more defense-in-depth measures to add protection.\n\n\n-----\n\nMalware specifically targeting ICS exists[21] and actively target HMIs. The ZDI program encourages\n\nresearchers to find and report the bugs associated with HMI and other SCADA systems to our bounty\n\nprogram.[22] By working together, the researchers receive compensation for their work while the vendors\n\nreceive data on where their products can be improved. Bugs in SCADA systems will likely be with us for\n\nmany years to come. By working together, the security of these systems will continue to improve. While\n\na completely secure system will likely never be created, implementing strong research and development\n\ntactics will be our best chance to keep the lights on as long as needed.\n\n\n-----\n\n##### References\n\n1. Kim Zetter. (2014). _Amazon. “Countdown to Zero Day: Stuxnet and the Launch of the World’s First Digital Weapon.” Last_\n[accessed on 23 February 2017, https://www.amazon.com/Countdown-Zero-Day-Stuxnet-Digital/dp/077043617X.](https://www.amazon.com/Countdown-Zero-Day-Stuxnet-Digital/dp/077043617X)\n\n2. [Alex Gibney. (2016). IMDB. “Zero Days.” Last accessed on 23 February 2016, http://www.imdb.com/title/tt5446858/.](http://www.imdb.com/title/tt5446858/)\n\n3. Jeremy Kirk. (8 November 2012). _ComputerWorld. “Siemens Software Targeted by Stuxnet Still Full of Holes: Details from_\na Cancelled Defcon Presentation Were Revealed on Thursday in Seoul.” Last accessed on 23 February 2017, [http://www.](http://www.computerworld.com/article/2493358/security0/siemens-software-targeted-by-stuxnet-still-full-of-holes.html)\n[computerworld.com/article/2493358/security0/siemens-software-targeted-by-stuxnet-still-full-of-holes.html.](http://www.computerworld.com/article/2493358/security0/siemens-software-targeted-by-stuxnet-still-full-of-holes.html)\n\n4. Michael B. Kelley. (20 November 2013). _Business Insider. “The Stuxnet Attack on Iran’s Nuclear Plant Was ‘Far More_\n[Dangerous’ Than Previously Thought.” Last accessed on 23 February 2017, http://www.businessinsider.com/stuxnet-was-far-](http://www.businessinsider.com/stuxnet-was-far-more-dangerous-than-previous-thought-2013-11)\n[more-dangerous-than-previous-thought-2013-11.](http://www.businessinsider.com/stuxnet-was-far-more-dangerous-than-previous-thought-2013-11)\n\n5. US-CERT. (25 February 2016). _ICS-CERT. “Alert (IR-ALERT-H-16-056-01): Cyber Attack Against Ukrainian Critical_\n[Infrastructure.” Last accessed on 23 February 2017, https://ics-cert.us-cert.gov/alerts/IR-ALERT-H-16-056-01.](https://ics-cert.us-cert.gov/alerts/IR-ALERT-H-16-056-01)\n\n6. Kim Zetter. (3 March 2016). Wired. “Inside the Cunning, Unprecedented Hack of Ukraine’s Power Grid.” Last accessed on 23\n[February 2017, https://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/.](https://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/)\n\n7. US-CERT. (2017). ICS-CERT. “The Industrial Control Systems Cyber Emergency Response Team (ICS-CERT).” Last accessed\n[on 23 February 2017, https://ics-cert.us-cert.gov/.](https://ics-cert.us-cert.gov/)\n\n8. Homeland Security. (2015). “NCCIC/ICS-CERT Year in Review: National Cybersecurity and Communications Integration\n[Center/Industrial Control Systems Cyber Emergency Response Team, FY 2015.” Last accessed on 23 February 2017, https://](https://ics-cert.us-cert.gov/sites/default/files/Annual_Reports/Year_in_Review_FY2015_Final_S508C.pdf)\n[ics-cert.us-cert.gov/sites/default/files/Annual_Reports/Year_in_Review_FY2015_Final_S508C.pdf.](https://ics-cert.us-cert.gov/sites/default/files/Annual_Reports/Year_in_Review_FY2015_Final_S508C.pdf)\n\n9. TechTarget. (2000−2017). Search Security. “DEFINITION: Address Space Layout Randomization (ASLR).” Last accessed on 23\n[February 2017, http://searchsecurity.techtarget.com/definition/address-space-layout-randomization-ASLR.](http://searchsecurity.techtarget.com/definition/address-space-layout-randomization-ASLR)\n\n10. Microsoft. (2017). _Microsoft Developer Network. “/SAFESEH (Image Has Safe Exception Handlers).” Last accessed on 23_\n[February 2017, https://msdn.microsoft.com/en-us/library/9a89h429.aspx.](https://msdn.microsoft.com/en-us/library/9a89h429.aspx)\n\n[11. Microsoft. (2017). Microsoft Developer Network. “/GS (Buffer Security Check).” Last accessed on 23 February 2017, https://](https://msdn.microsoft.com/en-us/library/8dbf701c.aspx)\n[msdn.microsoft.com/en-us/library/8dbf701c.aspx.](https://msdn.microsoft.com/en-us/library/8dbf701c.aspx)\n\n[12. Advantech Co. Ltd. (1983−2017). Advantech. “WebAccess HMI/SCADA Software.” Last accessed on 23 February 2017, http://](http://www.advantech.com/products/webaccess-hmi-scada-software/sub_gf-1m94v)\n[www.advantech.com/products/webaccess-hmi-scada-software/sub_gf-1m94v.](http://www.advantech.com/products/webaccess-hmi-scada-software/sub_gf-1m94v)\n\n13. Brandon Bray. (February 2002). _Microsoft Developer Network. “Compiler Security Checks in Depth.” Last accessed on 23_\n[February 2017, https://msdn.microsoft.com/library/aa290051.aspx.](https://msdn.microsoft.com/library/aa290051.aspx)\n\n14. Michael Howard. (June 2011). Microsoft Developer Network. “Security Development Lifecycle (SDL) Banned Function Calls.”\n[Last accessed on 23 February 2017, https://msdn.microsoft.com/en-us/library/bb288454.aspx.](https://msdn.microsoft.com/en-us/library/bb288454.aspx)\n\n[15. Trend Micro Inc. (2017). TippingPoint Zero Day Initiative. “Disclosure Policy.” Last accessed on 23 February 2017, http://www.](http://www.zerodayinitiative.com/advisories/disclosure_policy/)\n[zerodayinitiative.com/advisories/disclosure_policy/.](http://www.zerodayinitiative.com/advisories/disclosure_policy/)\n\n16. _[HeidiSQL. (2017). “What’s This?” Last accessed on 23 February 2017, https://www.heidisql.com/.](https://www.heidisql.com/)_\n\n17. US-CERT. (13 October 2016). _ICS-CERT. “Advisory (ICSA-16-215-02A): Siemens SINEMA Server Privilege Escalation_\n[Vulnerability (Update A).” Last accessed on 23 February 2017, https://ics-cert.us-cert.gov/advisories/ICSA-16-215-02.](https://ics-cert.us-cert.gov/advisories/ICSA-16-215-02)\n\n18. Advantech Co. Ltd. (1983−2017). _Advantech. “Advantech WebAccess.” Last accessed on 23 February 2017,_ [http://www.](http://www.advantech.com/industrial-automation/webaccess)\n[advantech.com/industrial-automation/webaccess.](http://www.advantech.com/industrial-automation/webaccess)\n\n\n-----\n\n19. Tim Rains. (2 August 2012). Microsoft Secure Blog. “Microsoft’s Free Security Tools—Attack Surface Analyzer.” Last accessed\n[on 23 February 2017, https://blogs.microsoft.com/microsoftsecure/2012/08/02/microsofts-free-security-tools-attack-surface-](https://blogs.microsoft.com/microsoftsecure/2012/08/02/microsofts-free-security-tools-attack-surface-analyzer/)\n[analyzer/.](https://blogs.microsoft.com/microsoftsecure/2012/08/02/microsofts-free-security-tools-attack-surface-analyzer/)\n\n[20. Microsoft. (2017). Microsoft. “What Is the Security Development Lifecycle?” Last accessed on 23 February 2017, https://www.](https://www.microsoft.com/en-us/sdl/default.aspx)\n[microsoft.com/en-us/sdl/default.aspx.](https://www.microsoft.com/en-us/sdl/default.aspx)\n\n21. US-CERT. (1 July 2014). ICS-CERT. “Advisory (ICSA-14-178-01): ICS Focused Malware.” Last accessed on 23 February 2017,\n\n[https://ics-cert.us-cert.gov/advisories/ICSA-14-178-01.](https://ics-cert.us-cert.gov/advisories/ICSA-14-178-01)\n\n22. Trend Micro Incorporated. (2017). TippingPoint Zero Day Initiative. “Program Benefits.” Last accessed on 23 February 2017,\n\n[http://www.zerodayinitiative.com/about/benefits/.](http://www.zerodayinitiative.com/about/benefits/)\n\n\n-----\n\nCreated by:\n\nThe Global Technical Support and R&D Center of TREND MICRO\n\nTREND MICRO[TM]\n\nTrend Micro Incorporated, a global cloud security leader, creates a world safe for exchanging digital information with its Internet content security and\n\nthreat management solutions for businesses and consumers. A pioneer in server security with over 20 years experience, we deliver top-ranked client,\n\nserver, and cloud-based security that fits our customers’ and partners’ needs; stops new threats faster; and protects data in physical, virtualized, and\n\ncloud environments. Powered by the Trend Micro™ Smart Protection Network™ infrastructure, our industry-leading cloud-computing security technology,\n\nproducts and services stop threats where they emerge, on the Internet, and are supported by 1,000+ threat intelligence experts around the globe.\n\nFor additional information, visit www.trendmicro.com.\n\nwww.trendmicro.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/Hacker Machine Interface - State of SCADA HMI Vulnerabilities.pdf"
    ],
    "report_names": [
        "Hacker Machine Interface - State of SCADA HMI Vulnerabilities.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535638,
    "ts_updated_at": 1743041706,
    "ts_creation_date": 1495102534,
    "ts_modification_date": 1495102544,
    "files": {
        "pdf": "https://archive.orkl.eu/6007e41e68b2b081510bed3627f29b3b465c6863.pdf",
        "text": "https://archive.orkl.eu/6007e41e68b2b081510bed3627f29b3b465c6863.txt",
        "img": "https://archive.orkl.eu/6007e41e68b2b081510bed3627f29b3b465c6863.jpg"
    }
}