{
    "id": "1f7c3683-6142-43b8-9b58-951df39bb8a9",
    "created_at": "2023-01-12T15:10:57.270762Z",
    "updated_at": "2025-03-27T02:06:01.922517Z",
    "deleted_at": null,
    "sha1_hash": "833da1efb0cea21809daf84135da28b9425be0b1",
    "title": "2021-01-26 - Nefilim Ransomware Attack Uses “Ghost” Credentials",
    "authors": "",
    "file_creation_date": "2022-05-28T02:35:22Z",
    "file_modification_date": "2022-05-28T02:35:22Z",
    "file_size": 1337807,
    "plain_text": "# Nefilim Ransomware Attack Uses “Ghost” Credentials\n\n**[news.sophos.com/en-us/2021/01/26/nefilim-ransomware-attack-uses-ghost-credentials/](https://news.sophos.com/en-us/2021/01/26/nefilim-ransomware-attack-uses-ghost-credentials/)**\n\nMichael Heller January 26, 2021\n\nKeeping close tabs on the account credentials in your organization should always be a top\n[priority, as a Sophos Rapid Response customer recently learned. Sophos Rapid Response is](https://www.sophos.com/en-us/products/managed-threat-response/rapid-response.aspx)\na 24/7 service that helps organizations to quickly identify and neutralize active threats.\n\nThe company reached out to Rapid Response to get help with a Nefilim (also known as\n[Nemty) ransomware attack in which more than 100 systems were impacted. Sophos’](https://news.sophos.com/en-us/2020/02/06/living-off-another-land-ransomware-borrows-vulnerable-driver-to-remove-security-software/)\n[Intercept X endpoint protection has no problem detecting and stopping Nefilim.](https://www.sophos.com/en-us/products/endpoint-antivirus.aspx)\nUnfortunately, the customer did not have this protection in place. Nefilim ransomware, like\nvirtually all major ransomware, replaces the original files with encrypted versions, making\nrecovery impossible without either the decryption key or a recent backup.\n\nThe Rapid Response team sprang into action as soon as they were contracted by the\ncustomer, loading Sophos security onto all the systems it could access, ensuring all\nnecessary protections were turned on for systems that already had Sophos installed, and\ndigging for clues as to how and when the intrusion began and what might have been stolen.\n\nBy the time of Sophos’ standard “kick-off” call to describe the process of the Rapid Response\nteam and gather context around the evidence uncovered so far, the team had already\nsingled out user accounts that had been taken over and compiled a general timeline of the\nattack.\n\n\n-----\n\nThe team determined the attacker had compromised an admin account with high level\naccess about one month before\nlaunching Nefilim ransomware.\nOr more accurately, the attacker\ngained access to that admin\naccount, then spent one month\nquietly moving around to steal\ncredentials for a domain admin\naccount, finding the trove of data\nthey wanted, exfiltrating hundreds\nof GB of data, and then finally\nannouncing their presence with\nthe ransomware attack.\n\n“Ransomware is the final payload in a longer attack. It is the attacker telling you they already\nhave control of your network and have finished the bulk of the attack. It is the attacker\ndeclaring victory,” Peter Mackenzie, manager for Rapid Response, said. “Identifying you are\nunder a ransomware attack is easy, [identifying the attacker was on your network a week](https://news.sophos.com/en-us/2020/08/04/the-realities-of-ransomware-five-signs-youre-about-to-be-attacked/)\nearlier is what counts.”\n\nBased on Sophos intelligence, the Rapid Response team knew the threat actors behind\nNefilim ransomware commonly gain initial access either by exploiting vulnerable versions of\nCitrix or Remote Desktop Protocol. In this case, the adversary exploited vulnerable Citrix\nsoftware, gained access to the admin account, then stole the credentials for a domain admin\naccount using Mimikatz.\n\nDuring Sophos’ initial kick-off call, the Rapid Response team relayed which admin account\nhad been compromised in the initial intrusion, and asked the customer: Whose account was\nit? The answer: the account belonged to an individual who had sadly passed away around\nthree months before the attacker’s first move.\n\nApparently, the account was kept active because there were services that it was used for,\nmeaning the Rapid Response team had to discern which activities from that account were\nlegitimate and which were malicious.\n\n“The malicious activities were often in the middle of the night for the customer’s local time,”\nMackenzie said. “We were able to work out some of the movements in the account based on\nwhen they occurred and when the commands were being performed.”\n\nIf an organization really needs an account after someone has left the company, they should\nimplement a service account and deny interactive logins to prevent any unwanted activity.\nOr, if they don’t need the account for anything else, disable it and carry out regular audits of\nActive Directory. Active Directory [Audit Policies can be set to monitor for admin account](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/audit-policy-recommendations)\nactivity or if an account is added to the domain admin group.\n\n\n-----\n\nMackenzie noted far fewer\naccounts need to be a domain\nadmin than most people think.\n\n“People assume because a\nperson is an executive or is in\ncharge of the network that they\nneed to be using a domain admin\naccount. This isn’t true and it’s\ndangerous,” Mackenzie said. “No\naccount with privileges should be\nused by default for work that\ndoesn’t require that level of\naccess. Users should elevate to\nusing the required accounts when\nneeded and only for that task.”\n\nMackenzie added that alerts\nshould be set so that if the\ndomain admin account is used or\nif a new admin account is\ncreated, someone knows. A\nprevious case that Rapid\nResponse was called in on\nproved this point.\n\nIn this particular case, an attacker\ngained access to an\norganization’s network, created a\nnew user, and added that\naccount to the domain admin\ngroup in Active Directory. No\nalerts were set off, so that new\ndomain admin account went on to\ndelete about 150 virtual servers\nand used Microsoft BitLocker to\nencrypt the server backups.\n\nMackenzie told the customer they\nwere lucky the attack was so\nvisibly destructive and easily\nnoticed.\n\n\n-----\n\nIf they hadn t done that, how\nlong would they have had domain\nadmin access to the network\nwithout the customer knowing?”\n\n## Detection and IoCs\n\nNefilim ransomware is detected in Sophos Endpoint Protection under the definition\n**Troj/Ransom-GDN.**\n\n[Additional indicators of compromise have been published to the SophosLabs Github.](https://github.com/sophoslabs/IoCs/blob/master/Ransomware-Netfilim.csv)\n\n## Nefilim group Tactics, Techniques, and Procedures (TTPs)\n\nThe common Tactics, Techniques and Procedures (TTPs) of the group(s) that operate\nNefilim ransomware have often utilized Citrix vulnerabilities or Remote Desktop Protocol\n(RDP) to gain initial entry into victim environments by exploiting public facing applications\n[MITRE ATT&CK T1190.](https://attack.mitre.org/techniques/T1190/)\n\nIn this case, the Rapid Response team discovered vulnerable versions of Citrix software on\ncustomer systems. Although it is unclear what vulnerability was exploited, the installed Citrix\n[Storefront 7.15 CU3 was vulnerable at time of incident to 1 Critical (CVE-2019-11634) and 4](https://support.citrix.com/article/CTX251986)\n[High rated CVE vulnerabilities (CVE-2019-13608,](https://support.citrix.com/article/CTX251988) [CVE-2020-8269,](https://support.citrix.com/article/CTX285059) [CVE-2020-8270,](https://support.citrix.com/article/CTX285059) CVE2020-8283) which may have been exploited in order to gain initial access to the target\nnetwork.\n\nOnce in, the threat actor also used Remote Desktop Protocol (RDP) logins to maintain\naccess to the initial admin account used in the attack. On the network, the threat actor used\nMimikatz, which allows the threat actors to reveal the credentials stored on the system, to\ncompromise a domain admin account.\n\n\n-----\n\nThe Rapid Response investigation uncovered PowerShell commands as well as the use of\nRDP and Cobalt Strike to move laterally to multiple hosts, conduct reconnaissance, and\nenumerate the network.\n\nThe threat actor installed the file transfer and synchronization application MEGA in order to\nexfiltrate data.\n\nThe Nefilim ransomware binaries were deployed using Windows Management\nInstrumentation (WMI) via the compromised domain admin account.\n\n## Checklist for secure account access management\n\nOnly grant the access permissions needed for a specific task or role\nDisable accounts no longer needed\nIf you need to keep an account active after the original owner has left the organization,\nimplement a service account and deny interactive logins\n[Carry out regular audits of Active Directory: Active Directory Audit Policies can be set](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/audit-policy-recommendations)\nto monitor for admin account activity or if an unexpected account is added to the\ndomain admin group\nHave a robust security solution in place, ideally with anti-ransomware technologies\nsuch as that featured in [Intercept X](https://www.sophos.com/en-us/products/endpoint-antivirus.aspx)\n\n**If you are experiencing an active incident and need immediate response, contact**\n**[Sophos Rapid Response. For details of our 24/7](https://www.sophos.com/en-us/products/managed-threat-response/rapid-response.aspx)** **[Managed Threat Response (MTR)](https://www.sophos.com/en-us/products/managed-threat-response.aspx)**\n**service, visit our website or speak with your Sophos representative.**\n_Special thanks to David Anderson, Peter Mackenzie, Sergio Bestulic, and Bill Kearney for_\n_their efforts in detecting, investigating, and responding to these threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-26 - Nefilim Ransomware Attack Uses “Ghost” Credentials.pdf"
    ],
    "report_names": [
        "2021-01-26 - Nefilim Ransomware Attack Uses “Ghost” Credentials.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536257,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653705322,
    "ts_modification_date": 1653705322,
    "files": {
        "pdf": "https://archive.orkl.eu/833da1efb0cea21809daf84135da28b9425be0b1.pdf",
        "text": "https://archive.orkl.eu/833da1efb0cea21809daf84135da28b9425be0b1.txt",
        "img": "https://archive.orkl.eu/833da1efb0cea21809daf84135da28b9425be0b1.jpg"
    }
}