{
    "id": "1f7f248e-0442-4751-945a-982a9ec3ec45",
    "created_at": "2023-01-12T15:07:49.351998Z",
    "updated_at": "2025-03-27T02:05:37.573658Z",
    "deleted_at": null,
    "sha1_hash": "67a4217857bc15a8f5dc6da97806b83e7a395796",
    "title": "2018-01-22 - SamSam - The Evolution Continues Netting Over $325,000 in 4 Weeks",
    "authors": "",
    "file_creation_date": "2022-05-29T01:10:28Z",
    "file_modification_date": "2022-05-29T01:10:28Z",
    "file_size": 865530,
    "plain_text": "# SamSam - The Evolution Continues Netting Over $325,000 in 4 Weeks\n\n**[blog.talosintelligence.com/2018/01/samsam-evolution-continues-netting-over.html](http://blog.talosintelligence.com/2018/01/samsam-evolution-continues-netting-over.html)**\n\n[This post was written by Vitor Ventura](https://twitter.com/_vventura)\n\n## Introduction\n\n[Talos has been working in conjunction with Cisco IR Services on what we believe to be a](https://www.cisco.com/c/en/us/products/security/sas-incident-response.html)\nnew variant of the SamSam ransomware. This ransomware has been observed across\nmultiple industries including Government, Healthcare and ICS. These attacks do not appear\nto be highly targeted, and appear to be more opportunistic in nature.\n\nGiven SamSam's victimology, its impacts are not just felt within the business world, they are\nalso impacting people, especially if we consider the Healthcare sector. Non-urgent surgeries\ncan always be rescheduled but if we take as an example patients where the medical history\nand former medical treatment are crucial the impact may be more severe. Furthermore,\nmany critical life savings medical devices are now highly computerized. Ransomware can\nimpact the operation of these devices making it very difficult for medical personnel to\ndiagnose and treat patients leading to potentially life threatening situations. Equipment that\nmight be needed in time-sensitive operations may be made unavailable due to the computer\nused to operate the equipment being unavailable.\n\n\n-----\n\nThe initial infection vector for these ongoing attacks is currently unknown and Talos is\ninvestigating this in order to identify it. The history of SamSam indicates that attackers may\nfollow their previous modus operandi of exploiting a host and then laterally moving within\ntheir target environment to plant and later run the SamSam ransomware. Previously, we\nobserved the adversaries attacking vulnerable JBoss hosts during a previous wave of\n[SamSam attacks in 2016. Although the infection vector for the new variant is not yet](http://blog.talosintelligence.com/2016/03/samsam-ransomware.html))\nconfirmed, there is a possibility that compromised RDP/VNC servers have played a part in\nallowing the attackers to obtain an initial foothold.\n\nThere are no differences between the encryption mechanism used by this current SamSam\nvariant compared to older versions. However, this time the adversaries have added some\nstring obfuscation and improved the anti-analysis techniques used to make detection and\nanalysis marginally more difficult.\n\nThis new variant is deployed using a loader which decrypts and executes an encrypted\nransomware payload, this loader/payload model represents an improvement in the antiforensic methods used by the malware. Samples containing this loader mechanism have\nbeen found as far back as October 2017. The wallet used by SamSam for this wave is\nshared by multiple infected victims as observed by monitoring the wallet at\n**1MddNhqRCJe825ywjdbjbAQpstWBpKHmFR. We are also able to confirm the first**\npayment into this wallet was received on 25th December 2017 - a nice holiday gift for this\nadversary. This can be confirmed by observing the first wallet transaction found on the\n[Bitcoin blockchain here. There is a possibility that other Bitcoin wallets are also used but](https://blockchain.info/tx/6277cc9899d241f4d4b4eaca0285086d1ad028839ee0368800f45786e472230d)\ncurrently Talos is currently unaware of any others.\n\nSimilar to the previous variants, we believe the deployment of this SamSam variant to be\nhighly manual, meaning an adversary must take manual action in order to execute the\nmalware. The symmetric encryption keys are randomly generated for each file. The Tor onion\nservice and the Bitcoin wallet address are hardcoded into the payload whilst the public key is\nstored in an external file with the extension .keyxml.\n\nAdditionally, code analysis didn't find any kind of automated mechanism for contacting the\nTor Service address which means that the victim identification with the associated RSA\nprivate key must be done either manually or by another adversary tool.\n\n\n-----\n\nRansom note displayed by SamSam new variant\n\nIn most ransomware the attackers try to convince affected users that they have the ability to\ndecrypt the data after the payment is made. SamSam is no different here and even displays\na disclaimer as seen in the above screenshot, stating 'we don't want to damage our reliability'\nand 'we are honest'.\n\nTo this end SamSam adversaries offer free decryption of two files and an additional free key\nto decrypt one server. Once again SamSam actors show their ability to monitor and laterally\nmove through the network by pointing out they will only provide a key if they believe the\nserver is not an important piece of infrastructure. As with previous versions of SamSam they\nare advising that messaging the attackers can be performed via their site.\n\n## The \"Runner\"\n\nThe adversary has changed their deployment methodology and now they use a loader\nmechanism called \"runner\" to execute the payload. Upon execution, the loader will search for\nfiles with the extension .stubbin in its execution directory, this file contains the SamSam\nencrypted .NET Assembly payload. Upon reading the file, the loader decrypts the payload\nwith the password supplied as the first argument and executes it, passing the remaining\narguments.\n\nThe loader is a very simple .NET assembly with no obfuscation. Comparing both the\nInitialization Vector (IV) and the code structure it seems like it may have been derived from\n\n\n-----\n\n[an example posted on the Codeproject.com website.](https://www.codeproject.com/kb/security/dotnetcrypto.aspx?msg%3D1790665)\n\nAs you can seen in the images below, the IV used for the Rijndael encryption is the same in\nboth implementations (posted code in hexadecimal, reversed code in decimal due to\ndecompiler implementation).\n\nPosted code Reversed code\n\nAt the code level looking specifically at the function 'Decrypt', it is obvious that the code\nstructure in the Codeproject source and the latest SamSam runner sample is the same\n(comments from the posted code were removed).\n\nEncryption routine source code comparison\n\n## The Payload\n\n\n-----\n\nPrevious versions of SamSam put some effort into the obfuscation of the malware code by\nencrypting strings with AES. The new version also obfuscates functions, class names and\nstrings, including the list of targeted file extensions, the help file contents and environment\nvariables, this time using DES encryption with a fixed hard-coded key and the IV.\n\nOnce again, the adversary has put more effort into preventing the forensic recovery of the\nmalware sample itself rather than only relying on the obfuscation the running malware code,\nwhich allowed us to reverse engineer this sample.\n\nAs mentioned before, the password to decrypt the payload is passed as a parameter to the\nloader, which reduces the chances of obtaining the payload for analysis.\n\nPrevious versions of SamSam had an equivalent method for making payload access difficult\nby launching a thread that would wait 1 second before deleting itself from the hard disk.\n\nThe comparison of the main encryption routines between the old and the new samples\nindicates that this version of SamSam is similar enough to have high confidence that it\nbelongs to the same malware family.\n\nEncryption Routine Comparison\n\n\n-----\n\nWhile previous SamSam versions used the API call DriveInfo.GetDrives() to obtain the list of\navailable drives, this new version has the drive letters hardcoded. After checking that a drive\nis ready it starts a search for targeted files on the non-blocklisted folder paths.\n\nThe new variant keeps the same list of targeted file extensions as some of the previous\nones. It adds a few new entries to the list of paths not to encrypt, which includes user profiles\n\"All Users\", \"default\" and the boot directory.\n\nThis is in tune with most ransomware which attempt to preserve the operability of the victim's\nmachine. If the machine operation is so damaged that the system cannot be booted then the\nvictim will be unable to pay, whereas if they keep the machine able to function, with limited\naccess to files/folders, then they have a greater chance of a victim paying for recovering their\nimportant files and documents.\n\nJust like previous versions of SamSam the new version is especially careful to make sure\nthat there is enough space on the current drive to create the encrypted document, thus\navoiding any corruption that would lead to irrecoverable encryption.\n\nUnlike most ransomware, SamSam does not delete Volume Shadow Copies and creates an\nencrypted version of the original file which is then deleted using the regular Windows API.\nAlthough unlikely, due to block overwriting, recovery of the original files from the versions of\naffected folders saved by the operating system may be possible.\n\n\n-----\n\n## Profitability\n\nIn identifying the scope of this SamSam campaign, Talos analyzed the Bitcoin wallet\naddresses used by the attackers in each of these attacks. As of the time of this writing, the\nattackers have received approximately 30.4 BTC which equals $325,217.07. As previously\nmentioned, it is possible that the attackers are leveraging multiple bitcoin wallets, however\nTalos has not observed any other than the one listed here being used in these attacks.\n\n## Recommendations\n\nAs the specific initial threat vector is not known at this time, best practices should be\nimplemented to minimize risk to organizations. Talos has outlined several best practices that\n[should be considered in a previous blog related to defending against ransomware related](http://blog.talosintelligence.com/2017/08/worm-defense.html)\nthreats. In accordance with best practices protocols like SMB or RDP should never be\ninternet facing.\n\n## IOCs\n\nSHA256s\n\n0785bb93fdb219ea8cb1673de1166bea839da8ba6d7312284d2a08bd41e38cb9\n338fdf3626aa4a48a5972f291aacf3d6172dd920fe16ac4da4dd6c5b999d2f13\n3531bb1077c64840b9c95c45d382448abffa4f386ad88e125c96a38166832252\n4856f898cd27fd2fed1ea33b4d463a6ae89a9ccee49b134ea8b5492cb447fb75\n516fb821ee6c19cf2873e637c21be7603e7a39720c7d6d71a8c19d8d717a2495\n72832db9b951663b8f322778440b8720ea95cde0349a1d26477edd95b3915479\n754fab056e0319408227ad07670b77dde2414597ff5e154856ecae5e14415e1a\n88d24b497cfeb47ec6719752f2af00c802c38e7d4b5d526311d552c6d5f4ad34\n88e344977bf6451e15fe202d65471a5f75d22370050fe6ba4dfa2c2d0fae7828\n8eabfa74d88e439cfca9ccabd0ee34422892d8e58331a63bea94a7c4140cf7ab\n\n\n-----\n\n8f803b66f6c6bc4da9211a2c4c4c5b46a113201ecaf056d35cad325ec4054656\ndabc0f171b55f4aff88f32871374bf09da83668e1db2d2c18b0cd58ed04f0707\ne7bebd1b1419f42293732c70095f35c8310fa3afee55f1df68d4fe6bbee5397e\n\nBTC Wallet\n\n1MddNhqRCJe825ywjdbjbAQpstWBpKHmFR\n\nTor onion service\n\njcmi5n4c3mvgtyt5.onion\n\n## References:\n\nhttps://www.codeproject.com/kb/security/dotnetcrypto.aspx?msg=1790665\n\n## Detection\n\nSnort Rules: 45484-45486 AMP for Endpoints: Ensure the TETRA engine, ‘Command Line\nCapture’, “System Process Protection” are enabled, and client is v6.05+\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-22 - SamSam - The Evolution Continues Netting Over $325,000 in 4 Weeks.pdf"
    ],
    "report_names": [
        "2018-01-22 - SamSam - The Evolution Continues Netting Over $325,000 in 4 Weeks.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536069,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1653786628,
    "ts_modification_date": 1653786628,
    "files": {
        "pdf": "https://archive.orkl.eu/67a4217857bc15a8f5dc6da97806b83e7a395796.pdf",
        "text": "https://archive.orkl.eu/67a4217857bc15a8f5dc6da97806b83e7a395796.txt",
        "img": "https://archive.orkl.eu/67a4217857bc15a8f5dc6da97806b83e7a395796.jpg"
    }
}