{
    "id": "2031a657-f66c-49c5-8fd4-20352ba9ca9a",
    "created_at": "2023-01-12T15:06:35.275599Z",
    "updated_at": "2025-03-27T02:17:11.741169Z",
    "deleted_at": null,
    "sha1_hash": "436b2bac228f3fa510b55b69b496ffb5ac14a970",
    "title": "2018-08-26 - Remember Fancy Bear-",
    "authors": "",
    "file_creation_date": "2022-05-28T19:14:08Z",
    "file_modification_date": "2022-05-28T19:14:08Z",
    "file_size": 284543,
    "plain_text": "# Remember Fancy Bear?\n\n**secjuice.com/fancy-bear-review/**\n\nJmetinfosec August 26, 2018\n\n26 August 2018 / [CYBERSEC](https://www.secjuice.com/tag/cybersec/)\n[Fancy Bear, not to be confused with Cozy Bear, is a cyber-espionage group that has recently](https://en.wikipedia.org/wiki/Fancy_Bear)\nbecome a household name due to the highly publicized Democratic National Committee\n(DNC) hack in 2016. The group, however, has been meddling in the affairs of other groups,\nbusiness, and nations for more than a decade.\n\n## What’s in a Name?\n\nThe hacker group has several aliases including APT28, Tsar Team, Pawn Storm, Sofacy\nGroup, Sednit, IRON TWILIGHT, and STRONTIUM. The actual name Fancy Bear was given\nto the group by the private cybersecurity firm CrowdStrike and its co-founder Dmitri\nAlperovitch based on a coding system that he created to name hackers. The coding appoints\nan animal according to the hacker’s country of origin. Russian hackers are bears, Chinese\nhackers are pandas, and Iranians are kittens [1]. CrowdStrike investigated the 2016 DNC\nBreach at the DNC’s request and concluded that the hacks were perpetrated by hackers\nworking on behalf of the Russian Intelligence Service GRUs hence the designation “Bear”\n\n_[2]. The analyst who discovers the new hacker gives the first part of the nickname. That_\nanalyst, Iggy Azalea, who discovered the hacker group chose “Fancy” because it sounded\nlike the word “Sofacy” which is prominent in the hacker group’s first-state malware\n(SOURFACE implant) [1]. The names Pawn Storm and Sednit were derivatives from the\ngroup’s 2014 Operation Pawn Storm that used a SEDNIT/Sofacy malware that targeted\nMicrosoft Office products [3]. FireEye called the group APT28 or Advanced Persistent Threat\n28 and Microsoft uses the code-name STRONTIUM.\n\n## Tools of the Trade\n\nFancy Bear uses different methods that are consistent with the resources and abilities of a\nnation-state actor, including spear phishing, malware drop websites and zero-day\nvulnerabilities. From 2011 to 2012, Fancy Bear used its namesake first stage malware called\n“Sofacy” or SOURFACE before expanding to other backdoors and tools, including\nCORESHELL, SPLM (aka Xagent, AKA CHOPSTICK) JHUHGIT, AZZY (ADVSTORESHELL,\nNETUI, EVILTOSS), and OLDBAIT. Also other implants such as X-Agent, X-Tunnel, WinIDS,\nFoozer, and DownRange droppers. They have even dabbled in malware for Linux, and\nmobile devices [4].\n\n### Sofacy\n\n\n-----\n\nSofacy or SOURFACE is a Trojan horse in the form of a .dll file. It is usually attached to a\ndocument and once executed, attempts to find 4 remote locations:\n\n[http://]scanmalware.info/ch[REMOVED]\n\n[http://]malwarecheck.info/ch[REMOVED]\n\n[http://]adawareblock.com/ch[REMOVED]\n\n[http://]checkmalware.org/ch[REMOVED]\n\nIt also gathers information about the computer like its name, OS, and running processes.\nDepending on vulnerabilities in any of those processes combined with the operating system,\nit will also download exploits to continue the process of gathering more information or\nescalate privileges. Sofacy was used from around 2011 to 2012.\n\n### CORESHELL\n\nCORESHELL is an updated version of SOURFACE, since most endpoint protection services\ninclude Sofacy in their definitions. CORESHELL also uses the same attack method, it is a .dll\nfile that is attached to documents. It includes code that is not used in what analysts suspect\nas an attempt to bypass endpoint security because it mimics legitimate machine instructions.\nIt operates in much the same fashion, as Sofacy did, collecting machine information to send\nback to a C2 server and run it through an exploit database. It is capable of obfuscating its\nstrings using a stream cipher custom made with 6 or 8-byte keys and can use HTTP, SMTP,\nor POP3 to reach the C2 server. It also contains code to stay persistent by making autostart\nextensibility point entries in the run key. This updated version of Sofacy was first seen in\n2013\n\n### JHUHGIT\n\nJHUHGIT a variant of the updated CORESHELL malware which was modified to be\ndelivered through a zero-day exploit with Adobe Flash. It followed a series of exploit kits that\nwere crafted after a response to Microsoft and Oracle fixing vulnerabilities in Internet\nExplorer and Java, respectively in 2014-2015.\n\n### EVILTOSS\n\nThis is one of the exploit kits downloaded by the Sofacy trojan after it establishes a\nconnection. It is used to gain access to the system for reconnaissance. It logs keystrokes,\nand monitors machines for the purpose of escalating privileges and executing code. It utilizes\na public RSA key for encryption and communicates information via SMTP.\n\n### CHOPSTICK\n\nThis is another tool used by Sofacy that is complex and provides multiple uses. It is another\nvariant used by Fancy Bear that is more modular and flexible, it can be used for keylogging\nand collecting information like Microsoft files. It is designed to send messages back to its\n\n\n-----\n\nhandling server in HTTP format and is capable of using email servers to relay information as\nwell.\n\n### OLDBAIT\n\nIt is a credential harvester. Installs itself in\n%ALLUSERPROFILE%\\\\ApplicationData\\Microsoft\\MediaPlayer\\updatewindws.exe and is\nused to steal credentials saved in browser software like Mozilla firefox and internet explorer.\nIt can use HTTP or email to send messages back to its handling server with these stolen\nusernames and passwords.\n\n## A Sleuth of Hacks\n\nFancy Bear has a long resume of notable hacks including the Windows zero-day (2016),\nFrench television hack (2015), and the now infamous DNC hacks. They have targeted\nAerospace, Defense, Energy, Government, and Media sectors, and it favors a variety of\ntargets from security-related organizations and its members like NATO [4], corporations like\nBoeing, Lockheed Martin and Raytheon, journalist/bloggers, politicians/political activists, to\neven private citizens, like five United States military wives in 2015 [5]. The cybersecurity firm\nSecureworks found targets of the group from 116 different countries, however from March\n2015 and May 2016, they identified most of the targets were from the United States, Ukraine,\nRussia, Georgia, and Syria. The most common thread among the varied targets leads back\nto strategic Russian interests.\n\n## The Masked Unmasked?\n\nIn 2016, after CrowdStrike had announced that the DNC hack had been committed by the\nRussian Intelligence Agencies, an online persona called Guccifer 2.0 took credit for the\nbreach. Shortly, after Guccifer 2.0 developed an online social media presence (WordPress\nand Twitter accounts) and started to leak the stolen emails and documents. Many experts,\nincluding CrowdStrike had their doubts about Guccifer and its claimed identity because of\nforensic analysis of the leaked documents (including tampering and editing of information\ncontained in the documents) and communications made by Guccifer to members of the\nmedia.\n\nFrom October 2016 to January 2017, Guccifer’s social media posts started to show a better\ncommand of English, and according to sources from the Daily Beast, it was because the\nresponsibility of the accounts was given to a more senior GRU officer that had better\nproficiency with the English language. The hacktivist was further discredited when a Russia\nintelligence official maintaining the Guccifer 2.0 social media accounts made the fatal error of\nfailing to use a virtual private network to access the US-based social media platform. The IP\naddress left in the service logs was located at GRU HQ in Moscow [10].\n\n\n-----\n\nThis past year, Deputy Attorney General Rod Rosenstein announced twelve Russian\nIntelligence officers were indicted by Special Counsel Robert Mueller for “conspiracy to\ncommit an offense against the United States”, “aggravated Identity theft”, and “conspiracy to\nlaunder money” in order to influence and meddle in the 2016 Presidential campaign. The\nalleged hackers reportedly worked for Russia’s Intelligence GRU Units 26165 and Unit\n74455, the same Russian intelligence units theorized by the different cybersecurity firms. The\nindictment outlines how the GRU Units hacked the DNC and DCCC’s email accounts and\ncomputer networks and used spear phishing and malware to gather damaging information.\nThe information was then disseminated through fabricated online personas, including\nDCLeaks and Guccifer 2.0. Robert Mueller having access to classified intelligence reports\nmust have concluded that Guccifer 2.0 was at the very least an agent working for Russian\nintelligence as it was made part of the formal accusation.\n\n### Conclusion\n\nFancy bear is a cyber group that is highly sophisticated, organized and thorough. They use\ntools that are complex and custom made and have been used successfully to attack\ncountries. They should be respected and not taken lightly because they are a danger to their\nopposition. When faced with adversity they have proven the ability to adapt and overcome it.\nWith the success they have had one should assume they are out there right now, working to\nundermine their enemies. Just because we know who they are doesn't mean they will stop.\n\n### Works Cited\n\n**[1] V. Ward, \"The Russian Expat Leading the Fight to Protect America,\" Esquire, 24 10 2016.**\n\n[Online]. Available: https://www.esquire.com/news-politics/a49902/the-russian-emigreleading-the-fight-to-protect-america/. [Accessed 18 08 2018].\n\n**[2]** _The American Journal of International Law, vol. 111, no. 2, pp. 483-504, 2017._\n\n**[3] J. Gogolinkski, \"Operation Pawn Storm: The Red in SEDNIT,\" Trend Micro, vol. 22, p.**\nOctober, 2014.\n\n**[4] D. Alperovitch, \"CrowdStrike,\" 15 06 2016. [Online]. Available:**\nhttps://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/.\n\n[Accessed 24 08 2018].\n\n**[5] GReAT, \"SecureList,\" 04 12 2015. [Online]. Available: https://securelist.com/sofacy-apt-**\nhits-high-profile-targets-with-updated-toolset/72924/. [Accessed 24 08 2018].\n\n**[6] J. Brown, \"Report: Russian Hackers Posed as ISIS to Attack U.S. Military Wives,\" 08 05**\n2018. [Online]. Available: https://gizmodo.com/report-russian-hackers-posed-as-isis-toattack-u-s-mi-1825855349. [Accessed 24 08 2018].\n\n**[7] Secureworks Counter Threat Unit Threat Intelligence, \"Secureworks,\" 30 03 2017.**\n\n[Online]. Available: https://www.secureworks.com/research/iron-twilight-supports-activemeasures. [Accessed 24 08 2018].\n\n**[8] S. Gallagher, \"ARS Technica,\" 23 03 2018. [Online]. Available:**\nhttps://arstechnica.com/tech-policy/2018/03/dnc-lone-hacker-guccifer-2-0-pegged-as\n\n-----\n\nrussian-spy-after-opsec-fail/. [Accessed 24 08 2018].\n\n**[9] P. Muncaster, \"InfoSecurity Magazine,\" 21 04 2015. [Online]. Available:**\nhttps://www.infosecurity-magazine.com/news/apt28-back-russiandoll-attack/. [Accessed 24\n08 2018].\n\n**[10] M. Ostrowski and T. Pietrzyk, \"Security Case Study,\" 05 2015. [Online]. Available:**\nhttps://www.securitycasestudy.pl/wp-content/uploads/2015/05/SCS14–\nMOstrowski.TPietrzyk.pdf. [Accessed 24 08 2018].\n\n**[11] J. Vrijenhoek, \"Komplex Malware: The Return of Sofacy’s XAgent,\" 16 02 2017. [Online].**\nAvailable: https://www.intego.com/mac-security-blog/komplex-malware-the-return-of-sofacysxagent/. [Accessed 24 08 2018].\n\n**[12] UNITED STATESDISTRICT COURT FOR THE DISTRICT OF COLUMBIA, \"Case 1:18-**\ncr-00215-ABJ,\" U.S. Justice Department, https://www.justice.gov/file/1080281/download,\n2018.\n\n_The artwork used to head this article is called 'Low Poly Bear' and it was created by_\n_[Jeremiah Shaw.](https://dribbble.com/jermshaw)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-08-26 - Remember Fancy Bear-.pdf"
    ],
    "report_names": [
        "2018-08-26 - Remember Fancy Bear-.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535995,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653765248,
    "ts_modification_date": 1653765248,
    "files": {
        "pdf": "https://archive.orkl.eu/436b2bac228f3fa510b55b69b496ffb5ac14a970.pdf",
        "text": "https://archive.orkl.eu/436b2bac228f3fa510b55b69b496ffb5ac14a970.txt",
        "img": "https://archive.orkl.eu/436b2bac228f3fa510b55b69b496ffb5ac14a970.jpg"
    }
}