{
    "id": "2047d819-4c56-4c68-bf9c-3d564337fa9d",
    "created_at": "2023-01-12T15:04:42.903155Z",
    "updated_at": "2025-03-27T02:05:18.053214Z",
    "deleted_at": null,
    "sha1_hash": "db49fb5b4b7a4811fd866e89ae03b201df0da1da",
    "title": "2018-02-28 - Black Ruby- Combining Ransomware and Coin Miner Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T23:42:55Z",
    "file_modification_date": "2022-05-28T23:42:55Z",
    "file_size": 1832765,
    "plain_text": "# Black Ruby: Combining Ransomware and Coin Miner Malware\n\n**[acronis.com/en-us/blog/posts/black-ruby-combining-ransomware-and-coin-miner-malware](https://www.acronis.com/en-us/blog/posts/black-ruby-combining-ransomware-and-coin-miner-malware)**\n\n[Back](https://www.acronis.com/en-us/blog/)\nFebruary 28, 2018 — [Ravikant Tiwari](https://www.acronis.com/en-us/blog/authors/ravikant-tiwari/)\n\nCyber Protect Home Office\n\nformerly Acronis True Image\n\n[Learn more](https://www.acronis.com/en-us/products/true-image/)\nIn the midst of all the news and hype surrounding cryptocurrency, we’ve seen several coin miner malware programs popping into the wild,\ninfecting a number of computers on the internet. There’s been an upsurge in coin miner malware that victimizes individual PCs and\n[businesses using the same techniques and exploits that were previously attributed to distributed ransomware. With all this happening, the](https://www.acronis.com/en-us/ransomware-protection/)\ncybersecurity industry started speculating that there is a shift from ransomware to coin miners as the preferred choice of payload for\ncybercriminals.\n\nInterestingly, what we found was a new ransomware called Black Ruby that adds coin mining as a module on top of its ransomware\ncapabilities. Attackers are optimizing their attack methodology to maximize the profits they make from their victims. Rather than focus on one\ntype of attack, this indicates rise in both ransomware and coin miners.\n\nBlack Ruby logo\n\n## Technical Analysis\n\nBlack Ruby was discovered earlier this month. The first Virustotal submission was dated 2018-02-04 09:50:37, just the day after it was\ncompiled according to the timestamp in the PE header. A new variant of Black Ruby with some minor changes was also discovered a few\ndays later.\n\nFigure 1: Timestamp in PE header\n\n_Figure 1: Timestamp in PE header_\n\n\n-----\n\nThe ransomware identifies itself as Microsoft Windows Defender, using file names like _Windows Defender.exe or_ _WINDOWSUI.EXE . The_\nimage below shows the details from the file’s version info.\n\nFigure 2: File version details\n\n_Figure 2: File version details_\n\n[The malware binary (MD5: 81E9036AED5502446654C8E5A1770935) is a dotnet executable that is obscured using Babel Obfuscator.](http://www.babelfor.net/)\n\nIt encrypts user files using RSA and AES. The Monero miner module is contained in an encrypted form within the resource directory, which\nis then decrypted and deployed during execution.\n\n## GeoIP and Environment Checks\n\nIt starts by creating a mutual exclusion object (mutex) with name \"TheBlackRuby\" and exits if the name already exists to ensure that only\none instance of the application is running. The next check determines the machine’s country, which is done by connecting to “http://\n_freegeoip.net/json/”. If the response contains Iran’s country code, the malware stops and exits._\n\nFigure 3: Snippet to fetch country\n\ncodes\n_Figure 3: Snippet to fetch country codes_\n\n## Installation and Persistence\n\nBlack Ruby adds following registry to maintain persistence:\n\nHKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\BlackRuby ‘Install’ = ‘Max’\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run ‘Windows Defender’ =\n‘C:\\Windows\\system32\\BlackRuby\\WindowsUI.exe’\n\nIf Key 1 is already present on the machine, the malware just starts the coin miner executable (shown in following code snippet) that it would\nhave deployed earlier, when the install key was not present or during its first run. The CreatePersistence() function generates the above\nmentioned registry key. If Key 1 is not found, it returns as “false”, otherwise it returns as “true”.\n\n\n-----\n\nFigure 4: Part of void main()\n\nfunction\n_Figure 4: Part of void main() function_\n\n_DeployExecutables() creates a new directory named “BlackRuby” in the system directory (“C:\\Windows\\System32’), copying the main_\nexecutable with the name “WindowsUI.exe” and adding the coin miner executable (decrypted from resource directory) as “Svchost.exe”.\n\nFigure 5:\n\nCopying executables\n_Figure 5: Copying executables_\n\nAfter successfully deploying its malicious executables, Black Ruby executes the RansomwareMain() function, which is responsible for key\ngeneration, deleting shadow copy of the user’s files, clearing event logs, modifying boot status policies, and encrypting the user’s files.\n\n## Key Generation\n\nBlack Ruby uses an AES symmetric cipher to encrypt user files. Unlike other ransomware strains which use per file AES keys and session\nRSA keys for stronger encryption, Black Ruby uses the same AES key to encrypt all files on the system. The AES encryption uses following\nconfiguration:\n\nThe file encryption AES key is generated by combining a random password computed once on each machine, with some other artifacts like\nmachine name and count of logical drives, in following format.\n\n_<random_password>-<machine_name>:<logical_drive_count> (e.g.:_\n_>x6Ru@ufT4@lxsYkgj$X)OzuIVs&MjV&pUkf7rVJ7h8X>BMZuNVrbqurR-DESKTOP_XXXXXXX:2)_\n\nThis AES key is then encrypted with a master RSA public key that is hardcoded in the binary in its base64 form. The encrypted AES key is\nconverted to base64, which is then transformed into its hexadecimal representation and written to the ransomware “Help” file as HOW-TO_DECRYPT-FILES.txt along with other ransom notes. These help files are present in each directory containing the encrypted user files._\n\nFigure 6: Decoded Master RSA public key\n\n_Figure 6: Decoded Master RSA public key_\n\n\n-----\n\nFigure 7: AES key in its encrypted form\n\n_Figure 7: AES key in its encrypted form_\n\n## File Encryption\n\nThe Black Ruby ransomware enumerates all files on fixed, removable and network drives, and encrypts only those types that are included\non the list of extensions hardcoded in the binary and have a file size less than 512 MB. It also skips files with a name larger than 255 bytes.\nIf the file has an extension “bkf”, it is deleted.\n\nFigure 8: Drive\n\nenumeration routine\n_Figure 8: Drive enumeration routine_\n\nBlack Ruby reads the full file in the memory array and appends the original file name at the end, before passing it to AES encryption routine.\nAfter encryption, the original file content is overwritten with encrypted content and the file is moved into the same directory with a random file\nname in following format.\n\n_Encrypted_ <random_string> .BlackRuby (e.g. Encrypted_VdGcVZ7RUKFUYvYk6gZCVTNLkNsUin5SuvmfovndF.BlackRuby)_\n\nUnfortunately, if an exception occurs while modifying any file attributes or encryption process, the file gets deleted from the machine.\n\n\n-----\n\nFigure 9: File attribute\n\n\nmodification, Encryption and Move operation\n_Figure 9: File attribute modification, Encryption and Move operation_\n\nFigure 10: File structure after encryption.\n\n_Figure 10: File structure after encryption._\n\nBlack Ruby does not encrypt files present under these folders:\n\n_Table 1: Excluded folders_\n\n\n-----\n\nFigure 11: List of extensions\n\n_Figure 11: List of extensions_\n\n## Removing Shadow Copies and Covering Tracks\n\nBlack Ruby executes following commands in sequence to remove automatic backups created by the Windows volume shadow copy service,\nand to delete the event logs from the machine.\n\nFigure 12: List of executed commands\n\n_Figure 12: List of executed commands_\n\nIt also terminates any process that contains “sql” in its name. This full routine is executed before file encryption process.\n\n## Ransom Notes\n\nA ransom note HOW-TO-DECRYPT-FILES.txt is created in all the directories containing the encrypted user files.\n\n\n-----\n\nFigure 13: Ransom Note part 1\n_Figure 13: Ransom Note part 1_\n\n\n-----\n\nFigure 14: Ransom Note Part 2\n_Figure 14: Ransom Note Part 2_\n\n## Decryption\n\nThere is no free decryption tool available for this ransomware yet. The only way to get files back is to follow the instructions provided in the\nransom note and pay the attacker the equivalent of $650 in bitcoins. However, paying attackers is not encouraged.\n\nAttackers offer free decryption for two files less than 5 MB which you can send to their email address along with the Identification Key\nmentioned in the ransom note.\n\n\n-----\n\nFigure 15: Decryption instruction in ransom note\n_Figure 15: Decryption instruction in ransom note_\n\n## Coin Miner\n\nFinally Black Ruby calls ExecuteMiner() to launch the Monero miner (Svchost.exe) that it injected earlier. The Monero miner executable\n[turns out to be the XMRig CPU miner that is publicly available on GitHub.](https://github.com/xmrig/xmrig)\n\nFigure 16: Svchost.exe file version details\n\n_Figure 16: Svchost.exe file version details_\n\n\n-----\n\nFigure 17: Function to execute\n\nMonero miner\n_Figure 17: Function to execute Monero miner_\n\nWhere:\n\n**URL = \"de01.supportxmr.com\"**\n\n**port = \"3333\"**\n\n**UserName = \"43DmqxU4LzuTrmA8GLZ7S5J6w32bwCavX9bhvCiSEwwebfn4TCYRAxmPtWTZq9iQ1F6XYsktJEYBYDkhKu4KXw6rCCspxCJ\"**\n\nIt uses the Stratum mining protocol for pooled mining. The username is the wallet address of the attacker, the system’s user name is the\nworker or mining identifier, and the machine name is the password.\n\n\n-----\n\nFigure 18:\n\nMonero wallet info\n_Figure 18: Monero wallet info_\n\n## Conclusion\n\nBlack Ruby uses the de facto international standard for encryption and there is no way to recover files once they are encrypted unless user\nhas proper backups in place.\n\n[Acronis True Image 2018 and our other products with Acronis Active Protection enabled will prevent Black Ruby and other ransomware from](https://www.acronis.com/en-us/personal/computer-backup/)\nencrypting your valuable data, stop money from being mined for attackers, and ensure that you have the ability to restore encrypted files.\n\n\n-----\n\nBlack Ruby detected\n\n\nBlack Ruby blocked\n[CybersecurityCyber protection](https://www.acronis.com/en-us/blog/tags/cybersecurity/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-28 - Black Ruby- Combining Ransomware and Coin Miner Malware.pdf"
    ],
    "report_names": [
        "2018-02-28 - Black Ruby- Combining Ransomware and Coin Miner Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535882,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653781375,
    "ts_modification_date": 1653781375,
    "files": {
        "pdf": "https://archive.orkl.eu/db49fb5b4b7a4811fd866e89ae03b201df0da1da.pdf",
        "text": "https://archive.orkl.eu/db49fb5b4b7a4811fd866e89ae03b201df0da1da.txt",
        "img": "https://archive.orkl.eu/db49fb5b4b7a4811fd866e89ae03b201df0da1da.jpg"
    }
}