{
    "id": "20afb0fa-6361-4beb-99e1-e96d9ddeb658",
    "created_at": "2023-01-12T14:59:38.294375Z",
    "updated_at": "2025-03-27T02:05:41.582599Z",
    "deleted_at": null,
    "sha1_hash": "99362fa4da3bb6492f908a0136c03c54fd267a8f",
    "title": "2020-10-08 - Droppers, Downloaders and TrickBot- Detecting a Stealthy COVID-19-themed Campaign using Toolmarks",
    "authors": "",
    "file_creation_date": "2022-05-28T02:44:16Z",
    "file_modification_date": "2022-05-28T02:44:16Z",
    "file_size": 3597748,
    "plain_text": "# Recent Posts\n\n**[threatresearch.ext.hp.com/detecting-a-stealthy-trickbot-campaign/](https://threatresearch.ext.hp.com/detecting-a-stealthy-trickbot-campaign/)**\n\nOctober 8, 2020\n\n[HP Threat Research Blog • Droppers, Downloaders and TrickBot: Detecting a Stealthy COVID-19-](https://threatresearch.ext.hp.com/blog/)\nthemed Campaign using Toolmarks\n\n## Droppers, Downloaders and TrickBot: Detecting a Stealthy COVID-19- themed Campaign using Toolmarks\n\n### Introduction\n\nOne of the doctrines of forensic science is Locard’s exchange principle that every action taken by\nthe perpetrator of a crime leaves a trace.[1] Through the process of carefully collecting and\ninterpreting these traces, an investigator can characterise what happened and form hypotheses\nabout other aspects of the crime, such as the capabilities of the perpetrator. This idea holds for\ndigital forensic investigations just as much as it does in a physical crime scene. Cybercrimes\ninvolving malware require threat actors to use defence evasion techniques to circumvent security\ncontrols in the target’s network to achieve their objectives.[2] The good news for network\ndefenders is that these techniques often involve manipulating files, which leave traces or\n“toolmarks” that can be used as signs of malicious intent or to track specific threat actors.[3] In this\narticle, we describe how a stealthy TrickBot campaign in September 2020 masquerading as\nCOVID-19 alerts and invoices evaded detection by encrypting, modifying and embedding\npayloads in files.\n\n### Background\n\n\n-----\n\n**TrickBot Operators Toy with Droppers, July 2020**\n\nIn July 2020, we saw an unusual spam campaign delivering TrickBot banking malware. The\nconfiguration data used by every TrickBot binary contains an identifier called a gtag, which\nrepresents the campaign or distribution method used to deliver the malware.[4] In that campaign,\nTrickBot executables using the gtag “end4” were embedded in Microsoft Word document\nattachments.[5] This differed from the delivery mechanism usually favoured by TrickBot’s\noperators, where a downloader retrieves and executes the payload from a remote server. Over the\nlast two years, we’ve seen variations of this, commonly involving obfuscated Visual Basic for\nApplications (VBA) macros. TrickBot has also been delivered using Ostap, a JScript downloader,\nand through systems that have been infected with Emotet.[6]\n\nFirst seen in 2014, TrickBot is a modular banking Trojan thought to be operated from Russia.[7] It\nhas extensive capabilities for making fraudulent transactions through web injections and stealing\nbanking credentials. However, since June 2019 it has also been used as a platform to distribute\npost-exploitation tools and Ryuk ransomware, particularly against large enterprises.[8]\n\n**Why Attackers Choose Droppers**\n\nDroppers offer several benefits to attackers over downloaders, which may be factors why we are\nseeing an increase in their use.\n\n**_No need to host malware externally_**\n\nSince the payload is embedded in a file, there is no need to host it externally. This saves the time\nand cost associated with obtaining and managing web infrastructure for hosting the payloads.\nAttackers don’t need to purchase web servers from bulletproof hosting providers or compromise\nlegitimate web servers.\n\n**_Reduces detection exposure_**\n\nEmbedding the payload in a document also reduces the chance of the malware being detected by\nsecurity controls that inspect network traffic for malicious activity, such as web proxies and\nnetwork intrusion detection or prevention systems. This places extra reliance on email gateways\nto block malicious attachments. These controls tend to be less effective at blocking command and\ncontrol (C2) traffic, especially where C2 servers are rotated regularly, as is the case with TrickBot.\nWeb servers used for hosting malware tend to be active for longer periods of time, which means\nthey are more likely to be blocked.\n\n**_Immune to takedowns_**\n\nDroppers cannot be taken down by network defenders. With downloaders, the web servers used\nto host the payloads are vulnerable to takedown action through abuse reports to hosting providers\nand domain registrars. Takedowns are particularly effective at disrupting the operations of threat\nactors with small hosting infrastructures. Large hosting infrastructures tend to be more resilient to\ntakedowns. This becomes clear if we examine a malware distribution network using network\nanalysis, a way of analysing entities (in this case, web servers, downloaders and payloads) that\nshows the type of relationship that exists between them.[9]\n\n\n-----\n\nIf a threat actor only has a few web servers, the number of ties each hosting node will have to the\ndownloaders used in a campaign will be high. This would mean that each node used for hosting\nhas high degree centrality in the distribution network. These web servers represent “choke points”\nthat would severely limit the distribution of the malware if they were taken offline. Conversely, a\ndistribution network consisting of many web servers is more resilient to takedowns because each\nhosting node has fewer ties. Therefore, an attacker might decide to use droppers instead of\ndownloaders if they lack hosting capacity.\n\nFigure 1 – A TrickBot campaign from July-August 2019 that used Ostap as a downloader.\nRemoving the two yellow nodes with the most edges would significantly reduce the number of\ninfections.\n\n**_Denies defenders network artefacts_**\n\nDroppers also deny defenders network indicators of compromise (IOCs) associated with the initial\ndownload and execution of the malware. Web server configurations, DNS and WHOIS records\nand other network artefacts are a valuable source of information for tracking the activities of threat\ngroups over time and across campaigns.\n\n**Dropper Disadvantages**\n\n**_Worse targeting and operational security (OPSEC)_**\n\nOne area where downloaders are better than droppers is OPSEC. Downloaders allow threat\nactors to choose targets selectively based on their IP address (geofencing), user agent and other\nclient information exposed to the web server hosting the malware. They also enable attackers to\nswitch payloads in and out at will, reducing the window of opportunity for researchers and\ndefenders to download and analyse the malware. However, these OPSEC benefits are generally\nconsidered less important to operators of massively deployed malware families, such as TrickBot.\n\n\n-----\n\n### TrickBot Malspam Campaign, September 2020\n\n**COVID-19 and Invoice Lures**\n\nStarting on 16 September 2020, we detected a high-volume TrickBot spam campaign that used\nthe gtag “ono76”, where the Trojan was embedded in hundreds of encrypted DOCM attachments\nmasquerading as COVID-19 alerts and invoices.\n\nFigure 2 – Fake invoice lure used in the TrickBot campaign from September 2020.\n\n**Low Detection Rates**\n\n\n-----\n\nUnlike the documents used in the July campaign that had relatively high detection rates (30/61) on\nVirusTotal,[5] the files in this campaign were more effective at evading detection. 70% of the\nsamples were detected by four or fewer scanning engines, and several files received zero\ndetections (Figures 3 and 4).\n\nFigure 3 – A TrickBot sample that evaded detection, September 2020.\n\nFigure 4 – Low detection rates of TrickBot samples, September 2020.\n\n**TrickBot Dropper Toolmarks**\n\n**_Document encryption_**\n\nThese low detection rates were primarily caused by the documents being encrypted using\nMicrosoft Word’s “Encrypt with Password” feature. In this case, the documents’ content and\nextended metadata were encrypted using AES in CBC mode with a 256-bit key. The emails\ncontaining the malicious attachments referenced the password so that recipients would be able to\ndecrypt and open the documents. The most common passwords we found in this campaign were\nfive characters long (e.g. “DLW16”), matching the regular expression [A-Z]{3}\\d{2}. Without the\npassword, static and behavioural engines are unable to inspect the contents of the files. This\ntechnique also slows down investigations if the document password is not known.\n\n\n-----\n\nOne of the side effects of encrypting a DOCM file using Word s built-in encryption feature is that\ntools like file and exiftool will fail to parse the document’s metadata fully. For example, here’s the\noutput of the file command for one of the documents from this campaign:\n```\nCDF V2 Document, corrupt: Cannot read summary info\n\n```\nWhen combined with VirusTotal’s “magic” file search modifier, this output becomes a useful way of\nidentifying encrypted Office documents.[10] For example:\n```\nmagic:\"CDF V2 Document, corrupt: Cannot read summary info\"\n\n```\nSimilarly, exiftool normally parses extensive document metadata, such as its creation date, creator\nand information about the version and locale of Microsoft Office used. Since the droppers in this\ncampaign stored a long VBScript in the body of the documents (Figure 6), the very high word\ncount (>10,000) usually would be shown by exiftool. However, this metadata is inaccessible\nbecause of the encryption. Therefore, the limited output from exiftool can be used as a sign of\nencryption or that metadata has been removed, which may prompt an analyst to investigate\nfurther.\n\n**_Unusual byte modifications_**\n\nWe often see threat actors create a handful of malicious documents as templates and then\nprogrammatically modify them without changing the payload or download logic.[11][12] These\nslight modifications are typically done to evade hash-based detection since each document will\ngenerate a unique hash value as a result of the change. In this campaign, we found over 400\ndocuments that were identical except for two bytes that had been modified with the following\nvalues:\n\n**Original Value** **New Value**\n\n0xFFFF 0x9090\n\n0xFFFF 0x1010\n\n0xFFFF 0xE2E2\n\n0xFFFF 0x1717\n\nUsing these file artefacts, we were able to write a YARA rule to detect TrickBot dropper\ndocuments distributed in this campaign with high confidence, even though the contents of the files\nwere encrypted.\n\n\n-----\n\nFigure 5 – A toolmark left in a TrickBot dropper document from September 2020. Two bytes in the\nbottom document were modified with 0xE2E2.\n\n**Execution Chain**\n\nAll the documents contained an AutoOpen macro that copies a VBScript stored behind the lure\nimage, which is then written to a file in C:\\ProgramData with a .VBE (VBScript Encoded File) file\nextension.\n\n\n-----\n\nFigure 6 – VBScript containing an encoded TrickBot payload hidden behind the lure image,\nSeptember 2020.\n\n\n-----\n\nFigure 7 – VBE file dropped to C:\\ProgramData.\n\nWe identified two ways that the VBA macro executes the TrickBot DLL payload. In the first\nmethod, the macro creates and runs a scheduled task named “Windows Defender” with the start\ntime set to the system date and time returned by VBA’s Second, Minute, Hour, Day, Month and\nYear functions. The trigger event runs the VBE file using WScript.exe (Windows Script Host), the\ndefault VBE file handler. The other variant creates a WshShell object to run the VBE file, which\nalso opens it with WScript.exe.\n\n\n-----\n\nFigure 8 – Execution of the dropped VBE file using a scheduled task.\n\nFigure 9 – Execution of the dropped VBE file using a WshShell object.\n\nThe VBE file contains junk code and the TrickBot payload, stored either as hexadecimal values\n(Figure 10) or Base64 encoded. The script creates a directory in C: and then writes the payload\nthere with a .DLL extension.\n\nFigure 10 – TrickBot payload stored as hexadecimal values in the dropped VBE file.\n\nFinally, the script runs certutil to decode the payload and then executes using regsvr32.exe\n(Figure 11).\n\n\n-----\n\nFigure 11 – Behavioural trace in HP Sure Click Enterprise showing regsvr32.exe executing a\nTrickBot payload (APSLVDFB.dll).\n\n### Conclusion\n\nThreat actors are continually experimenting with ways to improve their chances of successfully\ncompromising systems. These include using droppers instead of downloaders, especially if they\npossess small hosting infrastructures that are vulnerable to takedowns; encryption to evade static\nand behavioural analysis; and modifying files to avoid hash lookups. However, these anti-analysis\nmeasures leave artefacts that network defenders can identify and use to build detection logic to\ntrack malware campaigns, even stealthy ones such as the TrickBot campaign we saw in\nSeptember 2020.\n\n### Indicators of Compromise\n\n**SHA-256 Hash** **Context**\n\n\n7FEE0F3ADB6BB5A3ED22AD960709A87893E2512D099F6C8C39946097D9A4122B\nFDFB6706E3F056404DA1928A1A8DC3BCE4AB4B8473F49E1C246B4AB2EDC69AD4\n\n052C9196DFE764F1FBD3850D706D10601235DC266D1151C93D34454A12206C28\n\n\nTrickBot\npayload\nDLL\nusing\ngtag\n“ono76”\n\n\n-----\n\n**YARA Rule**\n```\n rule trickbot_maldoc_embedded_dll_september_2020 {\n   meta:\n     author = \"HP-Bromium Threat Research\"\n     date = \"2020-10-03\"\n     sharing = \"TLP:WHITE\"\n   strings:\n     $magic = { D0 CF 11 E0 A1 B1 1A E1 }\n     $s1 = \"EncryptedPackage\" wide\n     $s2 = \"{FF9A3F03-56EF-4613-BDD5-5A41C1D07246}\" wide\n     $s3 = { FF FF FF FF FF FF FF FF FF FF ( 90 90 | 10 10 | E2 E2 | 17 17 ) FF FF FF\n FF FF FF FF FF FF FF }\n   condition:\n     $magic at 0 and\n     all of ($s*) and\n     (filesize > 500KB and filesize < 1000KB)\n }\n\n```\n**Filename Patterns**\n```\n\\d{4,6}170920\\d{4,6}\\.doc\n[A-Z0-9]{2,4}_Inv_[A-Z0-9]{2,4}\\.doc\n\\d{6}\\.doc\n[A-Z0-9]{8}\\.doc\n[a-z]{5,10}\\d{4,5}\\.doc\n\n```\n**Document Passwords**\n```\nINV15\nDLW16\n\n### References\n\n```\n[1] [https://en.wikipedia.org/wiki/Locard%27s_exchange_principle](https://en.wikipedia.org/wiki/Locard%27s_exchange_principle)\n\n[2] [https://attack.mitre.org/tactics/TA0005/](https://attack.mitre.org/tactics/TA0005/)\n\n[3] Harlan Carvey first applied the toolmark analogy to digital forensic investigations.\n[https://windowsir.blogspot.com/2020/09/toolmarks.html](https://windowsir.blogspot.com/2020/09/toolmarks.html)\n\n[4] https://unit42.paloaltonetworks.com/goodbye-mworm-hello-nworm-trickbot-updatespropagation-module/\n\n[5]\nhttps://www.virustotal.com/gui/file/a1795221f72ee3105070f65a31243da63fdc010431ff47c50d065\ne891851af9a/detection\n\n[6] [https://threatresearch.ext.hp.com/deobfuscating-ostap-trickbots-javascript-downloader/](https://threatresearch.ext.hp.com/deobfuscating-ostap-trickbots-javascript-downloader/)\n\n\n-----\n\n[7] ThaiCERT (2020) Threat Group Cards: A Threat Actor Encyclopedia. Available at:\n[https://www.thaicert.or.th/downloads/files/Threat_Group_Cards_v2.0.pdf (Accessed: 3 October](https://www.thaicert.or.th/downloads/files/Threat_Group_Cards_v2.0.pdf)\n2020). p. 428.\n\n[8] [https://www.cisecurity.org/white-papers/security-primer-trickbot/](https://www.cisecurity.org/white-papers/security-primer-trickbot/)\n\n[9] Clark, Robert M. (2020) Intelligence Analysis: A Target-Centric Approach (6 ed.). Thousandth\nOaks: CQ Press. pp. 354-355.\n\n[10] [https://support.virustotal.com/hc/en-us/articles/360001385897-File-search-modifiers](https://support.virustotal.com/hc/en-us/articles/360001385897-File-search-modifiers)\n\n[11] https://threatresearch.ext.hp.com/spot-the-difference-tracking-malware-campaigns-usingvisually-similar-images/\n\n[12] https://threatresearch.ext.hp.com/buran-ransomware-targets-german-organisations-throughmalicious-spam-campaign/\n\nTags\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-08 - Droppers, Downloaders and TrickBot- Detecting a Stealthy COVID-19-themed Campaign using Toolmarks.pdf"
    ],
    "report_names": [
        "2020-10-08 - Droppers, Downloaders and TrickBot- Detecting a Stealthy COVID-19-themed Campaign using Toolmarks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535578,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653705856,
    "ts_modification_date": 1653705856,
    "files": {
        "pdf": "https://archive.orkl.eu/99362fa4da3bb6492f908a0136c03c54fd267a8f.pdf",
        "text": "https://archive.orkl.eu/99362fa4da3bb6492f908a0136c03c54fd267a8f.txt",
        "img": "https://archive.orkl.eu/99362fa4da3bb6492f908a0136c03c54fd267a8f.jpg"
    }
}