{
    "id": "20bed1a9-adf9-4985-9819-2916dc0badc9",
    "created_at": "2023-04-05T02:08:30.701357Z",
    "updated_at": "2025-03-27T02:05:24.914033Z",
    "deleted_at": null,
    "sha1_hash": "d55c02598ad0a8d9a773c795177822a407ea1369",
    "title": "2023-03-19 - Vawtrak Analysis",
    "authors": "",
    "file_creation_date": "2023-04-03T08:31:41Z",
    "file_modification_date": "2023-04-03T08:31:41Z",
    "file_size": 208474,
    "plain_text": "# Researched by: Ilan Duhin\n\n**medium.com/@Ilandu/vawtrak-malware-824818c1837**\n\nIlan Duhin March 19, 2023\n\nIlan Duhin\n\nMar 19\n\n\n4 min read\n\n## “VawTrak” Malware\n\n Executive Summary:\n\n“Vawtrak” is a banking Trojan –malware that attempts to steal credentials from banks.\n\nThe Banker gains access to bank accounts via custom key logging, utilizing the access of a\nwide range of login credentials, such as passwords stored in browsers, FTP client private\nkeys, or information stored within remote desktop settings.\n\nTo communicate, the Banker utilizes SOCKS connection and exfiltrates information such as\nscreenshots and video captures.\n\n## Technical Analysis:\n\nUnpacking Process:\n\n\n-----\n\nFrom analyzing the malware in IDA, I see suspicious API such\n**CreateToolhelp32Snapshoot call that retrieves running processes, I guess that the**\nmalware will use it to get snapshot of them until it finds a legitimate process to inject his\nmalicious code.\n\nusing CreateToolhelp32Snapshot\nIn addition, I have checked on online sandboxes such as Any.run & Hybrid Analysis to see\nadditional info about the injection and I find that it tries to inject into the explorer.exe\n**process.**\n\nProcess Tree from Any.run\nAfter the conclusions, I choose to put my BP on WriteProcessMemory because the\nmalware try to inject her code into other process so this call is perfect to use.\n\nAfter placing a breakpoint on WriteProcessMemory, in order to catch the injection of the\nmalware, and checking the functionality of the API calls within the code in MSDN, the\nparameter to dump the MZ header is clearly shown.\n\nThe parameter required to dump the packed information is the third parameter, according to\nMSDN. The parameter is “lpBuffer” — A pointer to the buffer that contains data to be written\nin the address space of the specified process or in other words “holds our unpacking file\n**data”.**\n\nMemory Map permissions\nThe dumped memory file:\nAfter cleaning the junk code:\nthe malware immediately writes itself into the autoruns paths, in order to have a foothold on\nthe host upon startup or restart.\n\nAfter running, “Vawtrak” creates a child process with same name as the original running\nprocess. 30 seconds into the run, the original malware process terminates itself, and\nremoves itself from the original running path and copies itself into APPDATA\\LOCAL\\TEMP,\n**in order to elevate privileges (because of existence Writing privileges at this path).**\n\nAfter establishing itself, the malware, through the injected process drops additional PE files,\nwhich contain DLL and an executable.\n\nDrop the dll from pe-sieve after I dumped the implemented files into the folder to get more\ninformation. IDA also verify us that it is a dll file.\n\nthe DLL contains is creating a snapshot and list of all the currently running processes (as we\nmentioned earlier), this is usually done by reconnaissance malwares in order to target\nspecific artifacts within the host.\n\n\n-----\n\nWhen reconnaissance is complete, the malware extracts its C2 server from a seed that the\nmalware file contains — hard coded. It will perform certificate validation in order to check if\nthe server is still available, if not, the malware goes to sleep for a random amount of time.\n\nIn addition to certificate validation, the Banker checks if any reconnaissance information has\nbeen retrieved. If not, the malware does not initiate communication methods.\n\nEncrypted data start with the C2 server:\nDNS query to C2 server\nFollowing all these steps, “VawTrak” will attempt to spread through the network utilizing SMB\n— a legitimate Windows file-sharing protocol.\n\nAfter completing all activities within the host and attempting to preform lateral movement, the\nmalware wipes itself off the host and terminates its process.\n\nTries to do lateral movement to another computers via SMB protocol.\nlooking for RDP sessions:\nreg add HKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\n\\UseLogonCredential / — auth of http protocol, stored in plaintext user credentials.\n\n**· By default the key isn’t shows in registry.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-19 - Vawtrak Analysis.pdf"
    ],
    "report_names": [
        "2023-03-19 - Vawtrak Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660510,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1680510701,
    "ts_modification_date": 1680510701,
    "files": {
        "pdf": "https://archive.orkl.eu/d55c02598ad0a8d9a773c795177822a407ea1369.pdf",
        "text": "https://archive.orkl.eu/d55c02598ad0a8d9a773c795177822a407ea1369.txt",
        "img": "https://archive.orkl.eu/d55c02598ad0a8d9a773c795177822a407ea1369.jpg"
    }
}