{
    "id": "20db27b6-34fa-4665-91eb-d2a09ddc2367",
    "created_at": "2023-01-12T15:06:17.132769Z",
    "updated_at": "2025-03-27T02:14:39.307316Z",
    "deleted_at": null,
    "sha1_hash": "4262eaf9975929f609804c62b5349318883ac34e",
    "title": "2022-08-18 - Grandoreiro Banking Trojan with New TTPs Targeting Various Industry Verticals",
    "authors": "",
    "file_creation_date": "2022-09-01T10:12:36Z",
    "file_modification_date": "2022-09-01T10:12:36Z",
    "file_size": 2449977,
    "plain_text": "# Grandoreiro Banking Trojan with New TTPs Targeting Various Industry Verticals\n\n**[zscaler.com/blogs/security-research/grandoreiro-banking-trojan-new-ttps-targeting-various-industry-verticals](https://www.zscaler.com/blogs/security-research/grandoreiro-banking-trojan-new-ttps-targeting-various-industry-verticals)**\n\n**Introduction**\n\nRecently Zscaler ThreatLabz observed a Grandoreiro campaign targeting organizations in\nthe Spanish-speaking nations of Mexico and Spain that work across a variety of different\nindustry verticals such as Automotive, Chemicals Manufacturing and others. In this\ncampaign, the threat actors impersonate government officials from the Attorney General’s\nOffice of Mexico City and from the Public Ministry in the form of spear-phishing emails in\norder to lure victims to download and execute “Grandoreiro” a prolific banking trojan that\nhas been active since at least 2016, and that specifically targets users in Latin America.\nGrandoreiro is written in Delphi and utilizes techniques like binary padding to inflate\nbinaries, Captcha implementation for sandbox evasion, and command-and-control (CnC)\ncommunication using patterns that are identical to LatentBot.\n\n**Key Features of this Attack:**\n\nGrandoreiro targets organizations in the Spanish-speaking nations of Mexico and\nSpain across various industry verticals\nThe threat actors in this campaign impersonate Mexican Government Officials\nMultiple anti-analysis techniques are used by Grandoreiro Loader along with\nimplementation of Captcha for evading Sandboxes\nThe Grandoreiro Loader sends across a Check-In Request with all the required User,\nSystem and Campaign information\n\n\n-----\n\nThe Grandoreiro uses a binary padding technique to evade sandboxes, adding\nmultiple BMP images to the resource section of the binary and inflating the size to\n400+ MB\nThe CnC Communication pattern of 2022 Grandoreiro is now completely identical to\nthe LatentBot with “ACTION=HELLO” beacon and ID based communication\n\nIn-depth analysis of the Grandoreiro campaign and corresponding Infection chain has been\nexplained below.\n\n**Campaign Details:**\n\nThreatLabz has analyzed multiple infection chains for this Grandoreiro campaign, which\nbegan in June 2022 and is still ongoing. Based on our analysis, we can infer that the threat\nactors in this case are attempting to target organizations in the Spanish-speaking\n**countries of Mexico and Spain. Industries targeted in this campaign include:**\n\nChemicals Manufacturing\nAutomotive\nCivil and Industrial Construction\nMachinery\nLogistics - Fleet management services\n\n_Fig 1. Targeted Industry Verticals along with Geographical Locations_\n\n**Infection Chain:**\n\n\n-----\n\nThe infection chain employed by the threat actors in this campaign is quite similar to\nprevious Grandoreiro campaigns. It begins with a spear-phishing email written in Spanish,\ntargeting victims in Mexico and Spain. The email consists of an embedded link which when\nclicked redirects the victim to a website that further downloads a malicious ZIP archive on\nthe victim's machine. The ZIP archive is bundled with the Grandoreiro Loader module with a\nPDF Icon in order to lure the victim into execution; this is responsible for downloading,\nextracting and executing the final 400MB “Grandoreiro” payload from a Remote HFS server\nwhich further communicates with the CnC Server using traffic identical to LatentBot\n\n_Fig 2. Infection Chain_\n\nLet’s dive into the spear-phishing emails received by the victims. The phishing emails are\ndivided into two sets based on the lures used by the threat actors.\n\n**Set I -** **Impersonating Government Officials - Provisional Archiving Resolution:**\n\nThe first set of phishing emails observed during the campaign were those in which the\nthreat actors impersonated Government officials, instructing the victims to download and\nshare the Provisional Archiving Resolution. Below are the details of the phishing emails:\n\n1.)\n\nSubject (Spanish) : Fiscalia General del Gobierno (RESOLUCIÓN13062022)\n\nSubject (English) : Government Attorney General (RESOLUTION 13062022)\n\n\n-----\n\n_Fig 3. Phishing Email - Fiscalia General del Gobierno_\n\nAs can be seen in the above screenshot, the threat actors are posing as the current\nAttorney General of Mexico “Alejandro Gertz Manero” The email subject and the signature\nare of the Attorney General’s Office “Fiscalia General de Justicia'' making the email seem\nlegit. The content in this case notifies the victims about the Provisional Archiving Resolution\nand asks them to download and share the Resolution before a specified date, after which\nthe payment would not be refunded. If the victim clicks on the embedded link to download\nthe resolution, it redirects to a malicious domain: http[:]//barusgorlerat[.]me as shown in\nthe screenshot, and then downloads a ZIP file from the remote server consisting of the\nGrandoreiro Loader.\n\n2.)\n\nWe also came across a similar lure where the threat actors masquerade as “Alejandra\nSolano - from the Public Ministry - Early Decision and Litigation Section” and ask the Victim\nto download and share the Provisional Archiving Resolution. In this case, the embedded\nlink redirects to another domain: http[:]//damacenapirescontab[.]com as shown in the\nscreenshot below.\n\nSubject (Spanish) :RV [EXTERNAL] Notificación del Ministerio Público - MP08062022\n3:59:54 PM\n\nSubject (English) : RV [EXTERNAL] Notification of the Public Ministry - MP08062022\n3:59:54 PM\n\n\n-----\n\n_Fig 4. Phishing Email 2_\n\n**Set II - Cancellation of Mortgage Loan and Deposit Voucher Slip**\n\nIn this set, there are two types of phishing email lures. The first is regarding the cancellation\nof a mortgage loan, in which the threat actors ask the victim to download a mortgage\ncancellation form by opening the embedded link as shown in the below screenshot. Once\nthe link is opened it redirects to the malicious domain: http[:]//assesorattlas[.]me which\nthen further downloads a ZIP File consisting of the Grandoreiro Loader.\n\nSubject (Spanish) : Hola agonzaleza Baja del préstamo hipotecario 12:05:38 PM\n\nSubject (English) : Hi Agonz, Low Mortgage Loan 12:05:38 PM\n\n_Fig 5. Phishing Email - Cancellation of Mortgage Loan_\n\n\n-----\n\nThe second one consists of two similar emails targeted towards two different organizations\nin Mexico. Here, the victim is asked to download a deposit voucher/slip by clicking on the\nhyperlink. Once the link is opened, it downloads a ZIP File consisting of the Grandoreiro\nLoader from http[:]//assesorattlas[.]me and http[:]//perfomacepnneu[.]me as shown in\nthe below screenshot.\n\nSubject (Spanish) : Sr.(a) alfonso.vera Comprobante deposito 05-Jul-22 8:06:09 PM\n\nSubject (English) : Sr. (a) alfonso.vera Proof of deposit 05-Jul-22 8:06:09 PM\n\nSubject (Spanish) : RV Comprobante deposito 28-jun-22 5:11:45 PM\nSubject (English) : RV Deposit voucher 28-jun-22 5:11:45 PM\n\n_Fig 6. Phishing Email - Proof of Deposit_\n\nAfter analyzing all the phishing emails in our dataset, we were able to establish a common\npattern between the emails on the basis of similar content to lure the victims, and the\npattern of the embedded links (Pattern: **domain.tld/?timestamp), sometimes seen along**\nwith targeted countries (domain.tld/country/?timestamp) that were used to download the\nGrandoreiro Loader from the remote HFS server.\n\n\n-----\n\n_Fig 7. Phishing Email - Pattern Analysis_\n\nBy observing this pattern, we can state that the Grandoreiro campaign might be conducted\nby a single threat actor across various organizations in Mexico and Spain. The pattern can\nalso be beneficial to track other related campaigns as well.\n\nOnce the victim clicks on the embedded link, the user is redirected to download a ZIP File\nonto the machine from the following different URLs where all the downloaded files drop the\nGrandoreiro Loader. The file names correspond to the email lures being used:\n\n35[.]181[.]59[.]254/info99908hhzzb.zip\n35[.]180[.]117[.]32/$FISCALIGENERAL3489213839012\n35[.]181[.]59[.]254/$FISCALIGE54327065410839012?id_JIBBRS=DR-307494\n52[.]67[.]27[.]173/deposito(1110061313).zip\n54.232.38.61/notificacion(flfit48202).zip\n54.232.38.61/notificacion(egmux24178).zip\n\nNext, let’s examine the ZIP File named “informacion16280LIFSD.zip” which is\ndownloaded from the following remote server\n**35[.]180[.]117[.]32/$FISCALIGENERAL3489213839012 once the victim clicks on the**\nembedded link in the Spear phishing email.\n\nThe ZIP archive bundles two files:\n\nA31136.xml\ninfonpeuz52271VVCYX.exe\n\n\n-----\n\n_Fig 8. Downloaded ZIP Archive_\n\nIn this case, the first file A31136.xml is not a XML file but a portable executable with the\noriginal name “Extensions.dll” and signed with a valid “ASUSTEK COMPUTER\nINCORPORATION” certificate. It is benign in nature as shown in the screenshot below, and\nnever loaded by the Loader module.\n\n_Fig 9. Extensions.dll_\n\nThe second file bundled inside the ZIP archive “infonpeuz52271VVCYX.exe” is the\nGrandoreiro Loader module written in Delphi and masking itself with a PDF Icon compiled\non 14th June 2022 in order to lure the victims into execution, as shown in the screenshot\nbelow.\n\n\n-----\n\n_Fig 10. Grandoreiro Loader Module_\n\nWhen the loader module is executed by the victim, it initially creates a Mutex\n**[“[email protected]” by calling CreateMutexA()](https://www.zscaler.com/cdn-cgi/l/email-protection)**\n\n_Fig 11. Creates Mutex_\n\nThen it loads the “TForm1” Class Object from the resource section “RCData”, and the forms\nin Delphi are defined by the TForm class itself.\n\n_Fig 12. Loads the TForm1 Class Object_\n\nFurther, the loader module performs the following anti-analysis checks before executing the\ncritical functions.\n\n\n-----\n\ni) Detect Analysis Tools: The malware detects the below mentioned analysis tools by\ndecrypting the tool names using a XOR-based Decryption routine. It then takes a snapshot\nof currently executing processes in the system using CreateToolhelp32Snapshot() and\nwalks through the process list using Process32First() and Process32Next(). If any of the\nanalysis tools exist, the malware execution is terminated.\n\n_Fig 12. Detection of Analysis Tools_\n\nRegmon.exe Filemon.exe Procmon.exe Wireshark.exe Procexp64.exe\n\nProcexp.exe ProcessHacker.exe PCHunter64.exe PCHunter32.exe JoeTrace.exe\n\n_Fig 13. List of Detected Analysis Tools_\n\nThe second method that the malware uses to detect the analysis tools is to compare the\ntext of the window names with analysis tools (including TCPView and RegShot in this case)\nby using GetWindowTextW(), FindWindowW, and EnumWindows() APIs.\n\nii) Detect Execution Directory: In this case, the malware checks the directory in which it is\nbeing executed. If the below mentioned directory names are used, it terminates itself with a\ncomparison logic in place.\n\nC:\\insidetm\nC:\\analysis\n\n\n-----\n\n_Fig 14. Detection of Execution Directory_\n\niii) Anti-Debug Technique: In this case, the Grandoreiro executes the IsDebuggerPresent()\nto determine whether the current process is being executed in the context of a debugger. If\nthe result is non-zero, the malware terminates itself as shown below in the screenshot.\n\n_Fig 15. IsDebuggerPresent() Anti-Debug Technique_\n\niv) Vmware I/O Port Anti-VM Technique: In this case, the malware checks whether the\nexecution is occurring in a virtual environment (Vmware) by reading data from the I/O Port\n“0x5658h” (VX) used by Vmware. It achieves this by setting up the registers in the following\nformat as shown below in the screenshot.\n\n_Fig 16. Vmware I/O Port Anti-VM Technique_\n\nIf, after execution of “in” instruction (executed in order to pull data from the port “VX”) the\nEBX register consists of the magic Number “VMXh” the malware is executed in a virtualized\nenvironment and thus further terminates itself.\n\n\n-----\n\nAfter completing the anti-analysis checks, the malware decrypts a URL by passing an\nencrypted string to the string decryption routine. The string decryption routine performs\nXOR-based decryption with the following key as shown in the screenshot below.\n\n_Fig 17. Download Server URL decryption via XOR-based String decryption routine_\n\nThis string decryption routine has been used previously in the older variants of Grandoreiro\nfor decrypting strings and API calls in order to evade detection. The Grandoreiro string\n[decryptor can be found here, developed by the SpiderLabs Team at TrustWave.](https://github.com/SpiderLabs/Grandoreiro-decryptor/blob/main/grandoreiro_string_decryptor.py)\n\nThe Grandoreiro Loader then sends across a GET Request to the previously decrypted\nURL: “http[:]//15[.]188[.]63[.]127/$TIME” which provides in response the URL to download\nthe next stage as seen below.\n\n_Fig 18. Acquiring Final Payload Download URL_\n\nNext, the malware executes the URLDownloadToFile() API function with the szURL\nargument as the remote HFS server URL “http://15[.]188[.]63[.]127:36992/zxeTYhO.xml”\nin order to download the Final Payload of the Grandoreiro Banking Trojan as shown in the\nscreenshot below.\n\n\n-----\n\n_Fig 19. Download Final Payload of the Grandoreiro Banking Trojan_\n\nThe downloaded Grandoreiro Final Payload is a 9MB ZIP archive that is extracted\ndynamically, and the bundled executable (disguised as zxeTYhO.png) inside the archive is\nwritten in a folder whose name is generated at runtime in the “C:\\ProgramData'' directory.\nAlso the PE file masquerading as “zxeTYhO.png” is renamed to\n**ASUSTek[random_string].exe, generated with a random string generation logic, and**\nchanges on every execution.\n\n_Fig 20. Grandoreiro Final Payload renamed and written in ProgramData with random_\n_generated folder name_\n\n\n-----\n\nFurthermore, the Stage-1 Grandoreiro module collects the following System and User\ninformation where all the strings are decrypted at runtime via the similar String Decryption\nFunction.\n\ni) Username - Retrieves Username via GetUserNameW()\n\n_Fig 21. Fetches Username_\n\nii) ComputerName - Retrieves Computer name via GetComputerNameW\n\n_Fig 22. Fetches ComputerName_\n\niii) Operating System and Version - Retrieves the Operating System and its version from the\nWindows NT\\\\CurrentVersion and ProductName registry hive.\n\n_Fig 23. Fetches OS and its version_\n\niv) Antivirus - Retrieves the Antivirus Program installed on the machine via a WMI query\nshown below in the screenshot\n\n_Fig 24. Fetches Antivirus_\n\nv) Check Installed Programs - In this case the Grandoreiro module checks whether the\nfollowing programs are installed by accessing the Program Files folder (Path: C:\\Program\nFiles\\ and C:\\Program Files (x86)\\ ) or the AppData Folder (Path: C:\\Users\\\n\n\n-----\n\n<username>\\AppData\\Local)\n\nCrypto Wallets:\n\nBinance Electrum Coinomi BitBox OPOLODesk LedgerLive Bitcoin Core\n\nBanking, Anti-Malware Programs and Mail Clients:\n\n\nAppBrad\nBradesco\n\n\nSicoobnet Navegador\nC6 Bank\n\n\nAplicativo\nItau\n\n\nTopaz OFD\nWarsaw\n\n\nDiebold\nWarsaw\n\n\nOutlook\n\n\nIf any of the listed programs are installed on the machine, the malware stores the program\nnames to a list for further usage.\n\nOnce all of the above mentioned User and System information has been gathered by the\nmalware, it then decrypts the Check-In URL along with required parameters via the XORbased String decryption routine used previously and concatenates the parameters with the\ncorresponding gathered information as shown below in the screenshot.\n\n_Fig 25. Decryption and Arrangement of Check-In URL_\n\nAfter completion of the concatenation, the loader sends across a POST Check-In Request\nto the Host: “barusgorlerat[.]me with all the gathered User, System, and Campaign\ninformationarranged along with the different parameters as shown and explained in the\nscreenshot below\n\n\n-----\n\n_Fig 26. Check-In Request_\n\nOnce the Check-In request is sent to the remote server, the loader executes the\nGrandoreiro Final Payload which was downloaded, extracted, and renamed previously.\n\n**Grandoreiro - Final Payload:**\n\nThe Grandoreiro Final Payload written in Delphi was downloaded previously from the\nremote HFS server “http://15[.]188[.]63[.]127:36992/zxeTYhO.xml” as a 9.2 MB ZIP file\nwhich is then extracted and executed by the Grandoreiro Loader. The extracted file is a\n414MB Portable Executable file disguised with a “.png” extension which is later renamed to\n“.exe” dynamically by the loader and also the final payload is signed with an “ASUSTEK\n**DRIVER ASSISTANTE” digital certificate to appear legitimate and evade detection.**\n\n\n-----\n\n_Fig 27. Grandoreiro Final Payload Signed with ASUSTEK Certificate_\n\nAs seen in the older Grandoreiro samples, a similar “Binary Padding” technique is used\nhere in order to inflate the file size of the binary to around 400MB by adding two ~200MB\nBitmap images in the resource section as shown in the screenshot below. This technique\nworks as an anti-sandbox technique as it helps in evading sandboxes as most of them have\na file size limit for execution.\n\n\n-----\n\n_Fig 28. Binary Padding used by Grandoreiro_\n\nThe final payload maintains persistence on the Machine by leveraging the Run Registry key\n(HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run) which would allow the payload to\nbe executed on startup.\n\n_Fig 29. Maintain Persistence on the Machine via Run Registry Key_\n\nIn the following Grandoreiro variant, the Payload writes an .ini file (Name:\nASUSTekGvaxvh.ini) in the directory of execution which consists of all the following\ninformation as shown in the screenshot. The values in the Configuration file are encrypted\nusing a XOR-based Encryption routine with a key that changes in every sample.\n\n\n-----\n\n_Fig 30. INI Configuration File_\n\nThe Command & Control communications have been updated from the 2020 variant.\nPreviously there were some similarities between the Grandoreiro and LatentBot\n[communications (as exhibited here), but they were not identical. However, in the latest 2022](https://seguranca-informatica.pt/the-updated-grandoreiro-malware-equipped-with-latenbot-c2-features-in-q2-2020-now-extended-to-portuguese-banks)\nsample, the communication pattern has been upgraded by the threat actors and now it is\ncompletely identical to LatentBot where the name of the CnC Subdomain is generated via a\nDomain Generation Algorithm just as the older Grandoreiro variants. The identical\nLatentBot beacon command “ACTION=HELLO” and the ID-Based communication can be\nseen in the screenshot below.\n\n_Fig 31. Grandoreiro C2 Communication - 2022_\n\n\n-----\n\n_[Fig 32. LatentBot C2 Communication - 2017 (Pic Credit: link)](https://blog.malwarebytes.com/threat-analysis/2017/06/latentbot/)_\n\nIdentical to LatentBot, the Command & Control server provides the Cookie value as a\nresponse to the “ACTION=HELLO” beacon which is further used as an ID for\ncommunication in the latest Grandoreiro sample, as seen in the below screenshot.\n\n\n-----\n\n_Fig 33. Grandoreiro 2022 C2 Communication - ID based Communication_\n\n\n-----\n\n_[Fig 34. LatentBot 2017 C2 Communication - ID based Communication (Pic Credit: link)](https://blog.malwarebytes.com/threat-analysis/2017/06/latentbot/)_\n\nFurthermore, Grandoreiro includes the following backdoor capabilities for espionage\npurposes:\n\n**Keylogging**\n**Auto-Updation for newer versions and modules**\n**Web-Injects and restricting access to specific websites**\n**Command execution**\n**Manipulating windows**\n**Guiding the victim's browser to a certain URL**\n**C2 Domain Generation via DGA (Domain Generation Algorithm)**\n**Imitating mouse and keyboard movements**\n\n\n-----\n\nWhile finalizing our article, we came across another ongoing Grandoreiro campaign with an\nextra anti-sandbox technique used by the malware authors. This technique requires a\nCaptcha to be filled manually to execute the malware in the victim’s machine. The malware\nis not executed until or unless the Captcha is filled.\n\n_[Figure 35: Captcha used as Anti-sandbox technique (Pic credit: twitter)](https://twitter.com/ankit_anubhav/status/1555521068734902272)_\n\nWe have analyzed the following malware in our Lab and found that the network\ncommunication is similar to the one analyzed in the blog and it also follows\n“ACTION=HELLO” beacon and ID based communication as inherited from LatentBot.\n\n**Zscaler Sandbox Coverage:**\n\n_Figure 36: The Zscaler Cloud Sandbox successfully detected the malware loader._\n\n[Win32.Banker.Grandoreiro](https://threatlibrary.zscaler.com/threats/ca8ec703-81d0-4348-864c-ac7859767bcf)\n\n\n-----\n\n**Conclusion:**\n\nThe threat actors behind Grandoreiro Banking malware are continuously evolving their\ntactics and malware to successfully carry out attacks against their targets by incorporating\nnew anti-analysis tricks to evade security solutions; inheriting features from other Malware\nfamilies. The Zscaler ThreatLabz team will continue to monitor these attacks to help keep\nour customers safe\n\n**IOCs:**\n\n**Embedded Domains: (Same used for Check-In Request)**\n\nhttp[:]//barusgorlerat[.]me\n\nhttp[:]//damacenapirescontab[.]com\n\nhttp[:]//assesorattlas[.]me\n\nhttp[:]//perfomacepnneu[.]me\n\n**Grandoreiro Loader URLs:**\n\n35[.]181[.]59[.]254/info99908hhzzb.zip\n\n35[.]180[.]117[.]32/$FISCALIGENERAL3489213839012\n\n35[.]181[.]59[.]254/$FISCALIGE54327065410839012?id_JIBBRS=DR-307494\n\n52[.]67[.]27[.]173/deposito(1110061313).zip\n\n54[.]232[.]38[.]61/notificacion(flfit48202).zip\n\n54[.]232[.]38[.]61/notificacion(egmux24178).zip\n\n**Final Grandoreiro Payload URLs with Check-In URL:**\n\n15[.]188[.]63[.]127/$TIME\n\n167[.]114[.]137[.]244/$TIME\n\n15[.]188[.]63[.]127:36992/zxeTYhO.xml\n\n15[.]188[.]63[.]127:36992/vvOGniGH.xml\n\n15[.]188[.]63[.]127[:]36992/eszOscat.xml\n\n15[.]188[.]63[.]127:36992/YSRYIRIb.xml\n\n167[.]114[.]137[.]244:48514/eyGbtR.xml\n\nbarusgorlerat[.]me/MX/\n\nassesorattlas[.]me/MX/\n\nassesorattlas[.]me/AR/\n\natlasassessorcontabilidade[.]com/BRAZIL/\n\nvamosparaonde[.]com/segundona/\n\nmantersaols[.]com/MEX/MX/\n\npremiercombate[.]eastus.cloudapp.azure.com/PUMA/\n\n**Grandoreiro CnC:**\n\n\n-----\n\nPcbbcrjcgbcghjpbcgkccbjorkhhjcjj[.]fantasyleague[.]cc -> fantasyleague[.]cc\njmllmedvhgmhldjgmhvmmlljhvgdzvzz[.]dynns[.]com\n\nciscofreak[.]com\n\nchjjhjmomaoheoojjbynnyjiidfcncc.cable-modem.org -> cable-modem.org\n\nodbbdbmgmagdfggbbnynnyjiidfcncc.blogsyte.com -> blogsyte.com\n\nifnnfnmcmacfdccnnjynnyjiidfcncc.collegefan.org -> collegefan.org\n\n**MD5 Hashes:**\n\n**Grandoreiro Loader:**\n\n970f00d7383e44538cac7f6d38c23530\n\n724f26179624dbb9918609476ec0fce4\n\n2ec2d539acfe23107a19d731a330f61c\n\n6433f9af678fcd387983d7afafae2af2\n\n56416fa0e5137d71af7524cf4e7f878d\n\n7ea19ad38940ddb3e47c50e622de2aae\n\n**Grandoreiro Final Payload:**\n\ne02c77ecaf1ec058d23d2a9805931bf8\n\n6ab9b317178e4b2b20710de96e8b36a0\n\n5b7cbc023390547cd4e38a6ecff5d735\n\n531ac581ae74c0d2d59c22252aaac499\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-18 - Grandoreiro Banking Trojan with New TTPs Targeting Various Industry Verticals.pdf"
    ],
    "report_names": [
        "2022-08-18 - Grandoreiro Banking Trojan with New TTPs Targeting Various Industry Verticals.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535977,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1662027156,
    "ts_modification_date": 1662027156,
    "files": {
        "pdf": "https://archive.orkl.eu/4262eaf9975929f609804c62b5349318883ac34e.pdf",
        "text": "https://archive.orkl.eu/4262eaf9975929f609804c62b5349318883ac34e.txt",
        "img": "https://archive.orkl.eu/4262eaf9975929f609804c62b5349318883ac34e.jpg"
    }
}