{
    "id": "20db3c4c-e754-40b3-aa59-ba3fc8b03c38",
    "created_at": "2022-10-25T16:48:16.778725Z",
    "updated_at": "2025-03-27T02:16:11.496162Z",
    "deleted_at": null,
    "sha1_hash": "19a24110ffa0758f2a47a48d5bedb2d47851db29",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-04-28T16:10:31Z",
    "file_modification_date": "2016-04-28T16:10:31Z",
    "file_size": 844180,
    "plain_text": "April 26, 2016 6:53 pm\n\n## Cyber warfare: Iran opens a new front\n\nSam Jones\n\n\n### [ Share][ ]  Author alerts   Print  Clip [ Comments]\n\n\n### With its nuclear programme curbed, digital weaponry has become even more central to Tehran’s arsenal\n\n\nhe first neighbourhood they unplugged was Olaya, Riyadh’s wealthiest and gaudiest central\ndistrict. By the time they had finished their rampage through the computer systems behind the\n\n# T\n\npower grid, the infiltrators believed they had left millions without electricity, crippling hospitals and\nmilitary facilities.\n\nWhat the hackers, whose use of Farsi and bespoke malware gave away their Iranian origins, did not\nrealise was that the critical computer networks they had compromised were fake.\n\nThe network, complete with Arabic scripting and precise names of\nindividual substations and pylons, was the work of MalCrawler, a cyber security group specialising\nin protecting industrial computer systems. It was just one of a set of intricate digital honeytraps\ndesigned to gauge the intentions of the attackers who routinely tried to crack into the systems\n\n\n-----\n\nThe evidence from the models aligned. The Chinese hungrily scooped up anything that looked like\n[novel technical information. The Russians permeated deep into systems, mapping them and](http://www.ft.com/cms/s/0/d81e30de-00e4-11e6-99cb-83242733f755.html#axzz46pTn4F1F)\nimplanting hard-to-find backdoor access for potential future use. But neither dared do damage —\nunlike Iran.\n\nAmong the world’s big five cyber superpowers — the US, UK, Israel, Russia and China —\nMalCrawler concluded there was a digital equilibrium in military cyber offence based on\nassumptions over deterrence and reprisal.\n\n“But in the Middle East, that’s not the case at all,” says Dewan Chowdhury, MalCrawler’s chief\nexecutive. “The mindset just seemed completely different — it wasn’t espionage or some kind of\ntargeted operation necessarily, it was just to do as much damage as possible.”\n\nThe model MalCrawler designed to replicate the Israeli power grid was hit just as hard as the Saudi\none. The hackers, again displaying tell-tale signs of Iranian origin, fatally compromised the safety\nsystems of what they thought was one of Israel’s nuclear power stations.\n\nIran is rapidly emerging as the sixth member of the cyber superpower club. Denuded of its nuclear\n[ambitions by the landmark deal struck last year to limit uranium and plutonium enrichment, some](http://www.ft.com/cms/s/0/db6cbeda-dc69-11e5-a72f-1e7744c66818.html#axzz46pTn4F1F)\nfear Tehran will wield its cyber arsenal as an equally long-range weapon with which to menace its\nadversaries.\n\n“Before the [nuclear] deal, cyber was just one option they used for leverage, but now, post deal, it is\neven more central to their toolkit,” says one senior Middle Eastern intelligence official. “Iran is\npoised to do something in cyber that will change the way the world looks at it . . . the US knows this.\n\n[The US] saw what they [Iran] did during the agreement and they know what they are doing after\nit.”\n\n**Industrial sabotage**\n\n\n-----\n\n— destructive acts of cyber attack remain rare.\n\nIran is the only country that has both been on the receiving end of a major act of physical cyber[sabotage and the perpetrator of such an attack. In 2008, the Stuxnet computer worm, created by the](http://www.ft.com/cms/s/2/7d8ce4c2-34b5-11e0-9ebc-00144feabdc0.html)\nUS and Israel was unleashed on Iran’s nuclear programme.\n\nIn 2012, Iranian hackers struck Saudi Arabia’s national oil company, Saudi Aramco, nearly\n[obliterating its corporate IT infrastructure, and bringing the company close to collapse.](http://www.ft.com/cms/s/0/5f313ab6-42da-11e2-a4e4-00144feabdc0.html#axzz46pTn4F1F)\n\nAramco was a wake-up call for Iran’s adversaries. Nearly four years on, just how strong are Iran’s\ncyber capabilities and what, if anything, will Tehran seek to do with them?\n\n“Their abilities are growing fast and they are diversifying. They’re getting harder and harder to\ntrack,” says one senior intelligence official from within the five-eyes alliance — the digital\nintelligence-sharing group comprising Australia, Canada, New Zealand, the UK and US. “There is\ncertainly a big move towards having more destructive capability. They want to be able to do more\nAramcos. Right now they are researching, practising.” Tehran says it spends $1bn a year on cyber\nprogrammes. By contrast GCHQ, Britain’s electronic surveillance and cyber defence service,\nannually spends around $2bn.\n\nWhile its industrial oil production systems were unaffected, Aramco was nearly fatally compromised\nbecause so much of its corporate infrastructure was destroyed. Company officials had to use\ntypewriters and faxes to try and keep billions of dollars of oil trades from falling through.\nDomestically, the company gave oil away for several days following the attack because it could not\nprocess transactions.\n\nChristina Kubecka, a cyber security expert who worked for the oil company, told CNN last year that\ncompany officials flew to Southeast Asia to acquire as many computer hard drives as they could\nstraight off factory floors.\n\nBut the Aramco incident was also a relatively unsophisticated hack. One senior security consultant\nwho worked for the Saudi government in 2012 told the Financial Times that during the very early\nstages of the operation, the Iranian infiltrators — who dubbed themselves the Cutting Sword of\n\n\n-----\n\nIran’s other big cyber operation at that time was Operation Ababil, attributed to a hacking group\nknown as the Cyber Fighters of Izz ad-Din al-Qassam. It launched crude, but sustained attacks to try\nto overwhelm the websites of some of the US’s largest banks including JPMorgan and Bank of\nAmerica Merrill Lynch. The group claimed no allegiance, but two senior western intelligence\nofficials and other independent cyber security experts say it was an Iranian proxy.\n\n[In March this year, the US justice department brought charges against seven Iranians who it said](http://www.ft.com/cms/s/0/bbb714e2-f1d5-11e5-aff5-19b4e253664a.html#axzz44CNmWdZv)\nwere responsible for the attacks. All worked for Iranian companies — fronts, said prosecutors, for\nTehran’s Islamic Revolutionary Guards Corps.\n\nThe attacks were “the first shot across the bow”, says John Hultquist, director of cyber espionage\nanalysis at iSight. “Since Aramco [and Ababil], we have seen significant development from Iran in\nterms of their operations and capabilities. I wouldn’t call them top tier in sophistication yet, but if I\nwere to list off the most important threats globally — I would put them [in] there. The [importance]\nof what they are going after, and their sheer aggression, that’s the issue.”\n\n**Lethal kittens and cleavers**\n\nTwo hacking groups in particular highlight the development of Iran’s cyber capabilities. The first,\nknown as Rocket Kitten, has been closely tracked by many in the cyber security industry since 2014.\n\nFireEye, a US digital security company, first identified it as “Ajax security team”, noting its use of a\nspear-phishing campaign — the use of legitimate-looking emails to snare targeted victims into\nopening malicious attachments or following links — to target Iranian dissidents and Israeli\norganisations. By 2015, however, other cyber security groups realised that Rocket Kitten, as it was\nrechristened, was using its own customised malware, not just off-the-shelf code, and was\nbroadening its reach.\n\nLast November, lapses in the Rocket Kitten security procedures allowed the Check Point, an Israeli\n\n\n-----\n\nindividuals targeted by hackers. When they ran through the list, they came up with a comprehensive\nbreakdown of Rocket Kitten’s targets: 18 per cent were Saudi, 17 per cent from the US, 16 per cent\nIranian and 5 per cent Israeli. They ranged from defence officials and contractors, to dissidents,\njournalists and politicians.\n\nTwo intelligence officials, one from Europe and the other from the Middle East, separately told the\nFT that Rocket Kitten was linked to the IRGC, which, they both added, dominates Tehran’s cyber\nwarfare agenda.\n\nIt is a second IRGC-backed group, however, that is of even more interest to western defence and\nsecurity experts.\n\nIn December 2014, Cylance, a US cyber security firm, informed its clients of the activities of Iranian\nhackers engaged in a project it called Operation Cleaver. Based on a forensic analysis of the hackers’\nactivities, Cylance pointed to a group that dubbed itself “Tarh Andishan” — “the thinkers” in Farsi —\nas being behind the action. Thanks to domains, IP and residential addresses used by the hackers in\nTehran the research pointed to government-backed organisations as being ultimately responsible.\n\nCylance declared Iran “the new China” for its aggressive actions in cyber space. Its report detailed a\nsophisticated online campaign, tracked over two years, that was using custom-built malware to\ndeliberately infect and gain access to sensitive industrial control systems and critical infrastructure\nin companies across the globe.\n\nThe hackers behind Cleaver successfully infected the computers of hundreds of companies and\nsensitive organisations, from military systems, to oil and gas production controls, to airport and\nairline security databases. The countries hit hardest were not just the regional and traditional foes of\nIran. They included places such as South Korea and Canada.\n\n“What Cleaver really brought to the surface was that these guys were aggressive, compromising\ncritical infrastructure in missions that did not have any classic espionage outcome . . . the Iranians\naren’t getting into airports and oil and gas companies for intelligence collection . . . these are systems\nto compromise in order to do harm,” says Mr Hultquist. “What was really eye-opening is that they\nwere doing it globally.”\n\n**Complex picture**\n\nKnowing what Iran is technically capable of is only part of the picture. Since 2012, when Ayatollah\nAli Khamenei, the Islamic republic’s supreme leader, established the supreme cyber council, it has\nbeen hardliners that have dominated control of it.\n\n\n-----\n\n“[Cyber] is folded into the larger context of political and military relationships that the [Iranian]\nleadership has to sit down and calculate, ‘When do I want to do this?’,” says Jim Lewis, director of\ntechnology and public policy at the Washington-based Center for Strategic and International\nStudies.\n\nMuch of Iran’s capability in cyber space stems from its efforts to control dissent and monitor\némigrés in the wake of protests triggered by the flawed 2009 election and emergence of the Green\nmovement. The Basij militias — the paramilitary, pro-regime forces under the direction of the IRGC\n— that were crucial in suppressing those protests are now a critical part of Iran’s cyber force.\n\nA second, more sophisticated and highly trained group within the guards is responsible for activities\nsuch as those seen in operation Cleaver, says one senior British security official. They make up Iran’s\nequivalent of an elite cyber force, and are the most worrying threat for the west.\n\nIran’s proxy cyber forces form a third component with Tehran accused of being one of the world’s\nmost active cyber “proliferators”, providing damaging malware to groups such as Hizbollah, the\nLebanese Shia militants. Such arrangements do raise questions over control — and just what is\nbeing done in Iran’s name without explicit sanction from Tehran.\n\nA Basij Cyber Council mobilises “hacktivists” within the Basij — often drawing from Iran’s large pool\nof young, computer-literate students — to further the Islamic Republic’s message both internally\nand externally. It is these groups that are responsible for much of the cruder and more belligerent\nactivity in cyber space — defacing websites and attacking US, Saudi or Israeli companies with denial\nof service attacks, for example. While they are nurtured and encouraged by the IRGC, there is not\nnecessarily a rigid command structure behind their activities. That makes them unpredictable —\nand difficult to deter.\n\nIn the months since the nuclear deal, MalCrawler, whose digital honeytraps are still in use,\ncollecting data, has noticed a tail-off in Iranian activity. “We’re in a period of reorganisation in cyber\nspace,” says Mr Chowdhury.\n\nf h i h “ h h i ff h\n\n\n-----\n\nunderstand that they are developing capabilities for use years from now.”\n\n[Cyber, he says, is as core to Iran’s strategy as its ballistic missile programme.](http://www.ft.com/fastft/2016/03/08/iran-conducts-new-ballistic-missile-tests/)\n\n“Before cyber they were powerless,” says CSIS’s Mr Lewis. “They had to sit there and take it. We had\nsanctions, we had aircraft carriers off their coast. Now with cyber they can strike back.”\n\n**RELATED TOPICS** [United States of America, United Kingdom, China, Oil, Cyber Security](http://www.ft.com/topics/places/United_States_of_America)\n\n\n###  [Share][ ]  Author alerts   Print  Clip  [Comments]\n\n\nThe US in three numbers Money Spinners ­ Why didn’t\nPrince have a will?\n\n\nFirstFT – Fed global concerns\nease, SpaceX mission to Mars\n\n\n**[VIDEOS](http://video.ft.com/)**\n\n\n-----\n\n**Printed from: http://www.ft.com/cms/s/0/15e1acf0­0a47­11e6­b0f1­61f222853ff3.html**\n\n[Print a single copy of this article for personal use. Contact us if you wish to print more to distribute to others.](http://www.ft.com/servicestools/help/contactus)\n\n© THE FINANCIAL TIMES LTD 2016 FT and ‘Financial Times’ are trademarks of The Financial Times Ltd.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.04.26.Iran_Opens_a_New_Front/Cyber%20warfare_%20Iran%20opens%20a%20new%20front%20-%20FT.pdf"
    ],
    "report_names": [
        "Cyber warfare_ Iran opens a new front - FT"
    ],
    "threat_actors": [
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8e1bae2f-2a21-4ba8-a6f1-42155f96aec8",
            "created_at": "2022-10-25T16:07:23.645758Z",
            "updated_at": "2025-03-27T02:02:09.905135Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Ajax Security Team",
                "Flying Kitten",
                "Group 26",
                "Operation Saffron Rose"
            ],
            "source_name": "ETDA:Flying Kitten",
            "tools": [
                "Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bb08058c-a744-4129-aa80-10aa34ed8766",
            "created_at": "2022-10-25T16:07:24.474826Z",
            "updated_at": "2025-03-27T02:02:10.245391Z",
            "deleted_at": null,
            "main_name": "Cyber fighters of Izz Ad-Din Al Qassam",
            "aliases": [
                "Cyber fighters of Izz Ad-Din Al Qassam",
                "Fraternal Jackal",
                "QCF",
                "Qassam Cyber Fighters"
            ],
            "source_name": "ETDA:Cyber fighters of Izz Ad-Din Al Qassam",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4d7cba1-dbdd-42a9-88c5-4d0c81659ee0",
            "created_at": "2023-01-06T13:46:38.357581Z",
            "updated_at": "2025-03-27T02:00:02.813318Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Saffron Rose",
                "AjaxSecurityTeam",
                "Ajax Security Team",
                "Group 26",
                "Sayad",
                "SaffronRose"
            ],
            "source_name": "MISPGALAXY:Flying Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d63af7da-1b27-4f7e-a006-e7398c38f436",
            "created_at": "2023-01-06T13:46:38.702633Z",
            "updated_at": "2025-03-27T02:00:02.896029Z",
            "deleted_at": null,
            "main_name": "Cyber fighters of Izz Ad-Din Al Qassam",
            "aliases": [
                "Fraternal Jackal"
            ],
            "source_name": "MISPGALAXY:Cyber fighters of Izz Ad-Din Al Qassam",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "49f1ada0-181f-4e89-a449-e6bc13c8c6b1",
            "created_at": "2022-10-25T15:50:23.561511Z",
            "updated_at": "2025-03-27T02:00:55.499988Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Threat Group 2889",
                "TG-2889"
            ],
            "source_name": "MITRE:Cleaver",
            "tools": [
                "Net Crawler",
                "PsExec",
                "TinyZBot",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "217c588a-5896-4335-b9ec-a516ae2f9a7e",
            "created_at": "2022-10-25T16:07:23.513775Z",
            "updated_at": "2025-03-27T02:02:09.838687Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "Cutting Kitten",
                "Operation Cleaver",
                "TG-2889"
            ],
            "source_name": "ETDA:Cutting Kitten",
            "tools": [
                "CsExt",
                "DistTrack",
                "IvizTech",
                "Jasus",
                "KAgent",
                "Logger Module",
                "MANGOPUNCH",
                "MPK",
                "MPKBot",
                "Net Crawler",
                "NetC",
                "PVZ-In",
                "PVZ-Out",
                "Pupy",
                "PupyRAT",
                "PvzOut",
                "Shamoon",
                "SynFlooder",
                "SysKit",
                "TinyZBot",
                "WndTest",
                "pupy",
                "zhCat",
                "zhMimikatz"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1461859831,
    "ts_modification_date": 1461859831,
    "files": {
        "pdf": "https://archive.orkl.eu/19a24110ffa0758f2a47a48d5bedb2d47851db29.pdf",
        "text": "https://archive.orkl.eu/19a24110ffa0758f2a47a48d5bedb2d47851db29.txt",
        "img": "https://archive.orkl.eu/19a24110ffa0758f2a47a48d5bedb2d47851db29.jpg"
    }
}