{
    "id": "21179fdc-8178-41ed-8b13-e24844ed99ac",
    "created_at": "2023-01-12T15:06:58.135652Z",
    "updated_at": "2025-03-27T02:16:26.23197Z",
    "deleted_at": null,
    "sha1_hash": "f09928d89c01b0f11426d2f8ee006cd0f60115b3",
    "title": "2017-10-30 - Coin Miner Mobile Malware Returns, Hits Google Play",
    "authors": "",
    "file_creation_date": "2022-05-28T02:14:25Z",
    "file_modification_date": "2022-05-28T02:14:25Z",
    "file_size": 114598,
    "plain_text": "# Coin Miner Mobile Malware Returns, Hits Google Play\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/coin-miner-mobile-malware-returns-hits-google-play/](https://blog.trendmicro.com/trendlabs-security-intelligence/coin-miner-mobile-malware-returns-hits-google-play/)**\n\nMalware\n\n\nOctober 30, 2017\n\n\nWe found apps with malicious cryptocurrency mining capabilities on Google Play. These apps used dynamic JavaScript loading and native\ncode injection to avoid detection.\n\nBy: Trend Micro October 30, 2017 Read time: ( words)\n\nContent added to Folio\n\nThe efficacy of mobile devices to actually produce cryptocurrency in any meaningful amount is still doubtful. However, the effects on users of\naffected devices are clear: increased device wear and tear, reduced battery life, comparably slower performance.\n\nRecently, we found that apps with malicious cryptocurrency mining capabilities on Google Play. These apps used dynamic JavaScript loading\nand native code injection to avoid detection. We detect these apps as ANDROIDOS_JSMINER and ANDROIDOS_CPUMINER.\n\nThis is not the first time we’ve found these types of apps on app stores. Several years ago, we found malicious apps on the Google Play store\n[detected as ANDROIDOS_KAGECOIN, a malware family with hidden cryptocurrency mining capabilities.](http://blog.trendmicro.com/trendlabs-security-intelligence/mobile-malware-mines-dogecoins-and-litecoins-for-bitcoin-payout/)\n\n**[ANDROIDOS_JSMINER: Mining via CoinhiveWe’ve previously seen tech support scams and compromised websites used to deliver the](http://blog.trendmicro.com/trendlabs-security-intelligence/eitest-campaign-uses-tech-support-scams-deliver-coinhives-monero-miner/)**\nCoinhive JavaScript cryptocurrency miner to users. However, we’re now seeing apps used for this purpose, which we detect as\nANDROIDOS_JSMINER. We found two apps; one supposedly helps users pray the rosary, while the other provides discounts of various kinds.\n\n_Figures 1 and 2. JSMINER Malware on Google Play_\n\nBoth of these samples do the same thing once they are started: they will load the JavaScript library code from Coinhive and start mining with\nthe attacker’s own site key:\n\n_Figure 3. Code to start mining when the app starts_\n\nThis JavaScript code runs within the app’s webview, but this is not visible to the user because the webview is set to run in invisible mode by\ndefault.\n\n_Figure 4. Webview is set to invisible mode_\n\nWhen the malicious JavaScript code is running, the CPU usage will be exceptionally high.\n\n**ANDROIDOS_CPUMINER: Trojanized versions of legitimate apps**\n\n\n-----\n\not e a y o a c ous apps ta es eg t ate e s o s o apps a d adds g b a es, c a e t e epac aged a d d st buted e\ndetect these as ANDROIDOS_CPUMINER.\n\nOne version of this malware is in Google Play and disguised as a wallpaper application:\n\n_Figure 5. Mining malware on Google Play store_\n\n[The mining code appears to be a modified version of the legitimate cpuminer library. The legitimate version is only up to 2.5.0, whereas this](https://github.com/pooler/cpuminer)\nmalicious version uses 2.5.1. The code is added to normal applications, as seen below:\n\n_Figure 6. Code added to normal apps by CPUMINER_\n\nPlease note that the above code layout was taken from a sample that is not found on Google Play, but belongs to the same family.\n\n_Figure 7. Malware with modified code_\n\nThe mining code fetches a configuration file from the cybercriminal’s own server (which uses a dynamic DNS service) that provides information\n[on its mining pool via the Stratum mining protocol.](https://en.bitcoin.it/wiki/Stratum_mining_protocol)\n\n_Figure 8. Cryptocurrency mining profits_\n\nThe figure above shows that the attacker is mining various cryptocurrencies, with varying amounts of currencies mined. It also shows that the\nvalue of the coins mined over an unknown period amounts to just over 170 US dollars; total profits aren't known.\n\n[We have identified a total 25 samples of ANDROIDOS_CPUMINER. Trend Micro Mobile Security already detects these variants, as well as the](https://www.trendmicro.com/en_us/forHome/products/mobile-security.html)\nJSMINER variants mentioned earlier in this post.\n\nThese threats highlight how even mobile devices can be used for cryptocurrency mining activities, even if, in practice, the effort results in an\ninsignificant amount of profit. Users should take note of any performance degradation on their devices after installing an app.\n\nWe have reached out to Google, and the apps mentioned in this post are no longer on Google Play.\n\n**Indicators of CompromiseThe following malicious apps were found on Google Play and are connected to this threat:**\n\nSHA256 hash App name Package name Detection name\n\n\n22581e7e76a09d404d093ab755888743b4c908518c47af66225e2da991d112f0 Recitiamo\nSanto\nRosario\nFree\n\n440cc9913d623ed42563e90eec352da9438a9fdac331017af2ab9b87a5eee4af SafetyNet\nWireless\nApp\n\nd3c0bed627edab9ac1bbc2bcc6e8c3ff45b4708afa527790e42a4a6fe2c045f0 Car\nWallpaper\nHD:\nmercedes,\nferrari,\nbmw and\naudi\n\n\nprsolutions.rosariofacileads ANDROIDOS_JSMIN\n\ncom.freemo.safetynet ANDROIDOS_JSMIN\n\ncom.yrchkor.newwallpapers ANDROIDOS_CPUM\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-30 - Coin Miner Mobile Malware Returns, Hits Google Play.pdf"
    ],
    "report_names": [
        "2017-10-30 - Coin Miner Mobile Malware Returns, Hits Google Play.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536018,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653704065,
    "ts_modification_date": 1653704065,
    "files": {
        "pdf": "https://archive.orkl.eu/f09928d89c01b0f11426d2f8ee006cd0f60115b3.pdf",
        "text": "https://archive.orkl.eu/f09928d89c01b0f11426d2f8ee006cd0f60115b3.txt",
        "img": "https://archive.orkl.eu/f09928d89c01b0f11426d2f8ee006cd0f60115b3.jpg"
    }
}