{
    "id": "21216b57-43b8-4439-b277-dc0e5338aeb9",
    "created_at": "2023-01-12T15:08:55.283019Z",
    "updated_at": "2025-03-27T02:17:11.821493Z",
    "deleted_at": null,
    "sha1_hash": "d8e061529c8368207bdbc628024b2969b81b0355",
    "title": "2019-06-03 - Zebrocy’s Multilanguage Malware Salad",
    "authors": "",
    "file_creation_date": "2022-05-28T02:04:04Z",
    "file_modification_date": "2022-05-28T02:04:04Z",
    "file_size": 1734431,
    "plain_text": "# Zebrocy’s Multilanguage Malware Salad\n\n**[securelist.com/zebrocys-multilanguage-malware-salad/90680/](https://securelist.com/zebrocys-multilanguage-malware-salad/90680/)**\n\nAuthors\n\nGReAT\n\nZebrocy is Russian speaking APT that presents a strange set of stripes. To keep things\nsimple, there are three things to know about Zebrocy\n\nZebrocy is an active sub-group of victim profiling and access specialists\nZebrocy maintains a lineage back through 2013, sharing malware artefacts and\nsimilarities with BlackEnergy\n\n\n-----\n\nThe past five years of Zebrocy infrastructure, malware set, and targeting have\nsimilarities and overlaps with both the Sofacy and\n\nZebrocy shares data points and crosses lines with other clusters of activity in unique\nand unexpected ways. Zebrocy initially shared limited infrastructure, targets, and\ninterests with Sofacy. Zebrocy also shared malware code with past\nBlackEnergy/Sandworm; and targeting, and later very limited infrastructure with more\nrecent BlackEnergy/GreyEnergy. Oddly, Turla deployed spearphish macros almost\nidentical to previous, non-public Zebrocy code in 2018.\n\nIt’s fantastic to see some of these same points being repeated publicly by other\nresearch teams. A previous claim that Zebrocy distributed Sofacy’s XAgent as a\nsecond stage implant remains unsubstantiated but now is replaced with findings\nidentical to these following the SAS2019 presentation, so it seems we are all slowly\ngetting on the same page.\n\n## A first course with new additions\n\nWhen we originally documented a Zebrocy malware incident in late 2015, we noted an\nOct 2015 AutoIT downloader and a Delphi backdoor payload. Since then, we have\nnoted a virtual salad of Zebrocy code tossed together, built with a handful of languages,\noften ripped from various code sharing sites. Zebrocy activity initiates with\nspearphishing operations delivering various target profilers and downloaders without\nthe use of any 0day exploits. Browser credential theft, keylogging, and Windows\ncredential theft, along with some incidents of file and communications theft, are all on\nthe list of Zebrocy second stage implant specials.\n\nThis Zebrocy dish is served before the main course – gaining and maintaining access\nis not an easy job. And, because the group seems to maintain lineage in both the 0day\ncapable and destructive BlackEnergy/Sandworm APT and the prolific and 0day\ncapable Sofacy APT, this course is very interesting. Let’s take a more intelligent\n\n\n-----\n\nperspective on the Zebrocy malware set and activity and its lineage, based on reporting\nprovided to our\n\nSince the SAS2019 presentation, we have identified a new Zebrocy backdoor family,\ndeployed with a new downloader. So Zebrocy continues to expand its malware set.\nThere appears to be both a return to C coding for the group, and also an expansion\nwith the\n\nA set of Zebrocy related events best characterize years of the activity and help to carve\nout the group’s own profile, its lineage, malware set, infrastructure, and modus\noperandi.\n\nZebrocy lineage – early Sofacy infrastructure overlap (late 2015/early 2016) for\nthe Zebrocy Delphi backdoor\n\n\n-----\n\nZebrocy lineage – Delphocy Delphi deployment and abrupt conclusion (2013 –\nlate 2015), and start of Zebrocy Delphi timeline (late 2015)\nZebrocy lineage – shared, unique kernel code between BlackEnergy and\nDelphocy bootkit (2013 – 2015)\nZebrocy unique malware set – vintage Delphi programming coupled with unusual\nand agile development capabilities with new managed languages like Python, C#,\nand Go all perform screengrab anchor, volume serial number id, systeminfo and\nprocess list collection\n\n\n-----\n\nZebrocy ongoing targeting and infrastructure overlap – fairly recent\n\nThe full 2018 decline of SPLM/XAgent for the more traditional “Sofacy”\nactivity\nA coincidental new increase in Zebrocy activity\nShared build-id format with BlackEnergy modules\nAn expansion in Zebrocy spearphishing\nAn expansion in the managed languages the Zebrocy malware set is built\non\n\nThese predictions later turned into global events, as lighter targeting turned into a\nmassive global surge of Zebrocy activity, sometimes sharing targets between\nboth Sofacy and Zebrocy. Also later that year, the Zebrocy malware set expanded\nwith C#, Python, and Go. This wouldn’t be the first or last time we reported on this\ngroup’s innovative malware set\n\n\n-----\n\n## Zebrocy Delphi backdoor shared artefacts rooted in Delphocy and BlackEnergy\n\nThe limited set of 2013-2015 Delphocy intrusions in Ukraine and Poland deployed\na Delphi backdoor both with and without a bootkit loader. This bootkit loader\nincluded a routine that shares the same compiled code with only the BlackEnergy\nkernel loaders, helping to tie Zebrocy malware to the BlackEnergy malware set.\n\nThis unique encryption implementation was shared between BlackEnergy’s kernel\nloader, and Delphocy’s bootkit kernel loader code. The appearance of this code\noverlap coincides with several project events:\n\nEnd of Delphocy/BlackEnergy overlapped code use, while BlackEnergy\nmoved forward with other code\nEnd of Delphocy’s user-mode Delphi payload (October 2015)\nStart of Zebrocy’s Delphi payload (October 2015)\nA particular chunk of kernel mode code for a custom encryption routine was\nshared across the older Delphocy bookit and the BlackEnergy malware platform\nin 2013. While Delphocy replaced this bootkit with a simplified user-mode\npersistence technique, BlackEnergy malware continued using this code until late\n2015. Then, these APTs discontinued both the Delphi-based Delphocy project\nand the use of this mysterious chunk of code within BlackEnergy malware.\nAlmost immediately, Delphi-based Zebrocy backdoors began to be deployed.\nSeveral months later, a Zebrocy backdoor connected back to a domain that was\nregistered by a particular email address. This address had been used to register\nanother Sofacy domain hosted on a well-known Sofacy IP at the time\n(rammatica[.]com/raveston[.]com).\n\nNote that both Delphocy’s and BlackEnergy’s kernel mode code appropriated\nunique content in 2013 from the Carberp codebase – hashing, injection, bootkit\nfunctionality. Surprisingly, this same unique encryption cipher was seen pasted\nagain into 2018 VPNFilter code as well. Clearly it happens with other malware,\nbut Zebrocy’s consistent copy/paste tendency is something not frequently seen in\nother APT malware with a “best use” date spanning five years or more. Portions\nof its AutoIT code were copied from code sharing forums and pasted into their\n\n\n-----\n\nown code. This is different from Sofacy s disappeared and exhaustive\nSPLM/XAgent codebase. It was used for at least six years and was entirely\ncustom-built.\n\n## Zebrocy’s mix\n\nThe Zebrocy malware set is tossed together from a wide set of languages and\ntechnologies, including both legitimate and malicious code shared on online\nforums and sites like Github and Pastebin. This repeated “copy/paste” practice is\nnot frequently seen in Russian speaking APT malware sets, although\n\n### C# Zebrocy backdoor\n\nZebrocy pushed a C# backdoor that maintains much the same functionality as its\nother assortment of backdoor implementations.\n\n\n-----\n\nMost interesting in this implementation is its consistent collection of screengrab\nand system information, and a list of running processes. Again, with this first\nstage backdoor, it is profiling its targets and looking for unexpected sources of\ncredential collection to develop bespoke second stage credential harvesters\nagainst. Additionally, Zebrocy wheeled out a\n\n## A second stage\n\nThese findings were particularly interesting in the light of past claims about\nSPLM/XAgent being the second stage of choice for Zebrocy, for which there was\na lot of monitoring on our part, but never any data support. Some guesses were\nmade about why that was, perhaps Zebrocy downloaders were all mitigated prior\nto attempting to download further stages? But never any answers.\n\nInstead, we arrived at the answers ourselves. In order to account for unexpected\nsoftware installations at victim systems, no matter which language, each first\nstage backdoor implementation collects a “system information” listing,\nscreengrab, and enumerates running processes. This malware behavior was\nincluded in Zebrocy backdoors from the very first backdoor that we reported on,\nand continued into 2019 with the latest rounds of Go backdoors. After collected\ninformation is POSTed to the C2, a long delay ensues. Eventually, target systems\nmay receive a custom built second stage implant to retrieve credentials from\nthose unexpected software sources. More unusual software packages included\nlittle-known customized Chromium builds like CentBrowser and 7Star from Asian\nstudios. In some cases, malware password stealers are deployed to address\nmore common software.\n\n\n-----\n\nIn addition, Zebrocy file content stealers and keyloggers coded in C# were\ndetected at targets in 2017 and 2018. Some of this code and their build id value\nformat was reviewed in the SAS2018 “Masha and these Bears” presentation.\n\n## Served cold\n\nZebrocy version 2.2 called back to a domain sharing Whois and hosting\nresources with Sofacy in early 2016, and later versions used naming and URL\nconstructs very similar to BlackEnergy resources. And since then, just like\nBlackEnergy, mostly all of the Zebrocy C2 used no domain registrations.\nCommunications directly to the host over IPv4 with no domain resolution are\ncommon behavior for the group’s malware. However, every now and then,\nZebrocy malware calls back to servers located by hardcoded domain names.\n\nIts ongoing activity demonstrates a long game commitment to gaining access to\ntargeted networks. And as we predicted at SAS2018 and SAS2019, this latest\nnew Nim coding adds to the growing list of languages for this malware set. We\nwill see more from Zebrocy into 2019 on government and military related\norganizations.\n\nZebrocy’s Multilanguage Malware Salad\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-03 - Zebrocy’s Multilanguage Malware Salad.pdf"
    ],
    "report_names": [
        "2019-06-03 - Zebrocy’s Multilanguage Malware Salad.pdf"
    ],
    "threat_actors": [
        {
            "id": "4d9cdc7f-72d6-4e17-89d8-f6323bfcaebb",
            "created_at": "2023-01-06T13:46:38.82716Z",
            "updated_at": "2025-03-27T02:00:02.928984Z",
            "deleted_at": null,
            "main_name": "GreyEnergy",
            "aliases": [],
            "source_name": "MISPGALAXY:GreyEnergy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08c8f238-1df5-4e75-b4d8-276ebead502d",
            "created_at": "2023-01-06T13:46:39.344081Z",
            "updated_at": "2025-03-27T02:00:03.056208Z",
            "deleted_at": null,
            "main_name": "Copy-Paste",
            "aliases": [],
            "source_name": "MISPGALAXY:Copy-Paste",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536135,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653703444,
    "ts_modification_date": 1653703444,
    "files": {
        "pdf": "https://archive.orkl.eu/d8e061529c8368207bdbc628024b2969b81b0355.pdf",
        "text": "https://archive.orkl.eu/d8e061529c8368207bdbc628024b2969b81b0355.txt",
        "img": "https://archive.orkl.eu/d8e061529c8368207bdbc628024b2969b81b0355.jpg"
    }
}