{
    "id": "213d8e9f-1bbe-4d46-b714-85cf0efa101b",
    "created_at": "2022-10-25T16:48:23.547143Z",
    "updated_at": "2025-03-27T02:17:27.498273Z",
    "deleted_at": null,
    "sha1_hash": "ff756612875a76ff69cdf480637f35ba45d94313",
    "title": "The OilRig Campaign: Attacks on Saudi Arabian Organizations Deliver Helminth Backdoor - Palo Alto Networks BlogPalo Alto Networks Blog",
    "authors": "",
    "file_creation_date": "2016-05-27T23:47:38Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 864056,
    "plain_text": "## 7\n\n\n**LikeLike**\n\n\n**related to these attacks also suggest the targeting of the defense industry in Saudi Arabia, which**\n\n**appears to be related to an earlier wave of attacks carried out in the fall of 2015. We have**\n\n**grouped these two waves of attacks into a campaign we have named ‘OilRig’.**\n\n**In recent OilRig attacks, the threat actors purport to be legitimate service providers offering**\n\n**service and technical troubleshooting as a social engineering theme in their spear-phishing**\n\n**attacks. Earlier OilRig attacks appear to use fake job offers as a social engineering theme. The**\n\n**campaign appears highly targeted and delivers a backdoor we have called ‘Helminth’. Over the**\n\n**course of the attack campaign, we have observed two different variations of the Helminth**\n\n**backdoor, one written in VBScript and PowerShell that was delivered via a macro within Excel**\n\n**spreadsheets and the other a standalone Windows executable.**\n\n**In May 2016, Unit 42 began researching attacks that used spear-phishing emails with**\n\n**attachments, specifically malicious Excel spreadsheets sent to financial organizations within**\n\n**Saudi Arabia. We observed spear-phishing emails sent between May 4 and May 12 of this year**\n\n**that delivered these malicious Excel spreadsheets, which we are tracking as ‘Clayslide’.**\n\n**ClaySlide documents contain malicious macros that display decoy content within the**\n\n**spreadsheet and installs a variant of a Helminth backdoor. FireEye also reported on these**\n\n**[attacks in a May 22 blog post.](https://www.fireeye.com/blog/threat-research/2016/05/targeted_attacksaga.html)**\n\n**The macro within Clayslide samples installs the Helminth script, which is composed of a**\n\n**VBScript called ‘update.vbs’ and a PowersShell script called ‘dns.ps1’. The purpose of the**\n\n**VBScript is to send network beacons to its command and control server using HTTP requests**\n\n**and will either download a file or run a batch script provided within the HTTP response. The**\n\n**VBScript also uploads the output of the provided batch scripts to the command and control (C2)**\n\n**server, which provides threat actors a functional remote shell to the system.**\n\n**The PowerShell script has similar capabilities to the VBScript, but instead of using HTTP for**\n\n**communications it uses a series of DNS queries to send and receive data from the server. This**\n\n**communication channel relies on the C2 server responding to DNS queries with IP addresses**\n\n**that the PowerShell script will parse treat as data to construct a batch script to execute on the**\n\n**system. The script specifically looks for the IP address “33.33.x.x” to mark the beginning of the**\n\n**batch script transfer. The script will continue sending additional DNS requests and use the**\n\n**octets of the resolving IP addresses as characters to write to the batch script. The script**\n\n**continues to write data to the batch script until it receives the IP address “35.35.35.35”, which**\n\n**notifies the script to stop saving data to the file and to run the batch script.**\n\n**Please reference the Appendix for more detailed information on the Clayslide delivery**\n\n**documents and the Helminth script variant.**\n\n**Additional samples were discovered in WildFire exhibiting the same DNS-based C2 behavior as**\n\n**the script variant of Helminth; however, many of these samples were found to be Windows**\n\n**executable, instead of the previously observed VBScript and PowerShell combination. These**\n\n**samples were found to contain the same functionality as the previously mentioned Helminth**\n\n**samples. Figure 1 shows the code within the VBScript version of Helminth checking resolving IP**\n\n**addresses for the 35.35.35.35 IP address to stop appending data to a batch script before**\n\n**executing it, while Figure 2 shows the same functionality within the executable version of the**\n\n**Trojan.**\n\n|Col1|POSTED BY: Robert Falcone and Bryan Lee on May 26, 2016 2:05 PM|\n|---|---|\n|17||\n|LLiikkee|FILED IN: Financial Services, Malware, Threat Prevention, Unit 42 TAGGED: AutoFocus, Helminth, OilRig attacks, Powershell, Saudi Arabia, VBScript, WildFire, Windows In May 2016, Unit 42 observed targeted attacks primarily focused on financial institutions and technology organizations within Saudi Arabia. Artifacts identified within the malware samples related to these attacks also suggest the targeting of the defense industry in Saudi Arabia, which|\n|Tweet||\n|7||\n\n\n## How CVE-2015-7547 (GLIBC getaddrinfo) Can Bypass ASLR\n\n**[posted by Gal De Leon on May 27, 2016](http://researchcenter.paloaltonetworks.com/author/gal-de-leon/)**\n\n## The OilRig Campaign: Attacks on Saudi Arabian Organizations Deliver Helminth Backdoor\n\n**[posted by Robert Falcone on May 26, 2016](http://researchcenter.paloaltonetworks.com/author/robert-falcone/)**\n\n## Tech Docs: How Secure is Your Internet Gateway?\n\n**[posted by Charissa Fleischer on May 25, 2016](http://researchcenter.paloaltonetworks.com/author/charissa-fleischer/)**\n\n## New Wekby Attacks Use DNS Requests As Command and Control Mechanism\n\n**[posted by Josh Grunzweig on May 24, 2016](http://researchcenter.paloaltonetworks.com/author/josh-grunzweig/)**\n\n## Rick Howard Enters a Lion’s Den of Journalists\n\n**[posted by Rick Howard on May 24, 2016](http://researchcenter.paloaltonetworks.com/author/rick/)**\n\n**[MORE →](http://researchcenter.paloaltonetworks.com/archives/)**\n\n\n-----\n\n**_Figure 2 Helminth executable looking for the 35.35.35.35 IP address_**\n\n**This suggests that the threat actors developed the executable variant of Helminth as a**\n\n**standalone option whose installation does not rely on a macro within an Excel spreadsheet.**\n\n**This also suggests that the threat actors purposely used the same communication methods**\n\n**across both variants with the intention to use the same command and control server application.**\n\n**This variant of the Trojan is also where we obtained its name, as several of these payloads had**\n\n**the following debug symbol path that suggests the malware author called this project ‘Helminth’:**\n\n**_E:\\Projects\\hlm updated\\Helminth\\Release\\Helminth.pdb_**\n\n**Please reference the Appendix for additional details on the Helminth executable variant.**\n\n**Unit 42 does not have detailed targeting information associated with attacks delivering the**\n\n**executable variant of the Helminth Trojan, however, we found a Zip archive created in August**\n\n**2015 that may have been used by the threat actors to deliver the Helminth Trojan. This Zip file**\n\n**was hosted at the following location:**\n\n**_hxxp://minfosecu.doosan[.]com/data/joboffer.zip_**\n\n**The Zip archive is encrypted with an unknown password, but we know it contains two files**\n\n**named joboffer.chm and thumb.db. The thumb.db file in the archive has the same name and file**\n\n**size (368128 bytes) as a dropper Trojan we track as ‘HerHer’ (SHA256:**\n\n**fb424443ad3e27ef535574cf7e67fbf9054949c48ec19be0b9ddfbfc733f9b07) that installs a**\n\n**known Helminth executable sample. The joboffer.chm file is a compiled HTML file that we**\n\n**believe loads and executes the ‘thumb.db’ file as a payload, but we cannot be absolutely sure**\n\n**as we do not have the password required to extract the files from the archive.**\n\n**The decoy opened by the Helminth sample installed by ‘thumb.db’ (seen in Figure 3) is a dialog**\n\n**box associated with HTML help, which further strengthens our theory that the joboffer.chm ran**\n\n**the sample. This decoy suggests that the threat actors wanted to open the HTML help dialog**\n\n**after installing the Helminth Trojan, as the joboffer.chm file is effectively a standalone HTML file.**\n\n**We believe that the threat actors employed social engineering to underplay the situation and**\n\n**provide a different legitimate job offer if the victim responded with concerns of malicious activity.**\n\n\n-----\n\n**_Figure 3 A Helminth sample displays this dialog box if provided ‘w’ on the command line_**\n\n**The executable variant of Helminth is installed with a dropper Trojan that we are tracking as the**\n\n**HerHer Trojan. This Trojan has two objectives: installing embedded Trojans and displaying**\n\n**either a fake error prompt or a fake “trubleshooting” (the malware author misspelled this word in**\n\n**each sample) utility. Figures 4 and 5 display an example of the fake error prompt and the fake**\n\n**Websphere troubleshooting utility displayed by the HerHer Trojan. The fake troubleshooting**\n\n**utility fits the service provider social engineering theme as seen in the decoy contents displayed**\n\n**in the Clayslide Excel spreadsheets.**\n\n**_Figure 4 Fake Error Prompt Displayed by the HerHer Trojan_**\n\n**_Figure 5 Fake Troubleshooting Utility Displayed by the HerHer Trojan_**\n\n**The Helminth executable variant is very similar in functionality to its script-based counterpart, as**\n\n**it also communicates with its C2 server using both HTTP and DNS queries. The major**\n\n**difference in capabilities between the two variants is that the executable version comes with a**\n\n**module that Helminth uses to log keystrokes and the clipboard contents to exfiltrate to the C2**\n\n**server.**\n\n**Helminth executable samples send artifacts within network beacons to its C2 server that the**\n\n**Trojan refers to as a ‘Group’ and ‘Name’. We extracted the group and name values from the**\n\n**Helminth executable samples to determine their purpose. It appears that the group values**\n\n**hardcoded into the malware is associated with the targeted organization, as several are Saudi**\n\n**Arabian organizations within the telecommunications and defense industries. This suggests that**\n\n**the threat actors are not only focused on financial organizations, as their target set could include**\n\n**other industries as well.**\n\n**The name values hardcoded into the Helminth samples are also interesting, as a majority of the**\n\n**names are related to famous philosophers, such as ‘Plato’ (Greek philosopher), ‘Arasto’**\n\n**(Persian and Urdu for Greek philosopher Aristotle), and ‘ALAfghani’ (Jamal ad-Din al-Afghani,**\n\n**Islamic Philosopher). Other name values embedded in samples contain other Persian words,**\n\n**such as ‘Nafti’ (نفتی) that translates to ‘oily’, which led us to name this campaign OilRig).**\n\n**Examining the known infrastructure of the collected sample set of Helminth provides several**\n\n**interesting findings in regards to the adversary’s tactics. The variants leveraging malicious**\n\n\n-----\n\n**_mydomain1110[.]com_**\n\n**_kernel[.]ws_**\n\n**_mydomain1607[.]com_**\n\n**_mydomain1609[.]com_**\n\n**_Figure 6 Helminth C2 Infrastructure_**\n\n**Each sample of the weaponized Excel document variant used a unique command and control**\n\n**domain to retrieve a bot ID, using the following format:**\n\n**_00000000<base 36 of a random number smaller than 46655>30.go0gie[.]com_**\n\n**Each of these domains, however, resolved to the same IP address of 5.39.112.87. This IP is**\n\n**observed as the resolution for two domains in use by the portable executable variants,**\n\n**kernel[.]ws and mydomain1110[.]com. Judging by compile timestamps of the executables and**\n\n**last saved timestamps of the weaponized documents, it is likely the adversary is recycling a**\n\n**previously created C2 server at 5.39.112.87 for the newer macro based variant. The other C2**\n\n**domains and IPs observed in use by the previous portable executable samples did not have**\n\n**shared infrastructure with the newer macro variants, although there is tactical overlap via the**\n\n**naming scheme of the domains.**\n\n**Historical WHOIS data reveals additional findings, potentially alluding to an Iranian-based**\n\n**operator. From a timeline perspective, a new domain was registered almost in consecutive**\n\n**months, beginning in July 2015. Each of the domains’s WHOIS data contained registrant**\n\n**information that was either reused, or was closely related to previously used information. For**\n\n**example, the domains mydomain1607[.]com and mydomain1609[.]com used the exact same**\n\n**registrant information. The email address edmundj@chmail[.]ir and the geolocation of Tehran,**\n\n**Iran, being of note. Kernel[.]ws and checkgoogle[.]org used very similar email addresses,**\n\n**andre_serkisian@yahoo[.]com and andre.serkisian@chmail[.]ir, respectively. The registrant**\n\n**information for kernel[.]ws also provided a geolocation of Tehran, IR and the email provider for**\n\n**the address used in checkgoogle[.]org was the same used for mydomain1607[.]com and**\n\n**mydomain1609[.]com, chmail.ir. The mydomain1110[.]com domain did not appear to reuse any**\n\n**of the previously observed WHOIS data artifacts, but did still give a geolocation of Tehran in**\n\n**addition to the use of an email address linked to other domains thematically similar to the know**\n\n**command and control domains and are potentially related.**\n\n**Although there is heavy use of Iranian-based artifacts within the WHOIS registrant information, it**\n\n**is important to remember that this data is easily falsified. At face value, however, taking into**\n\n**account the registrant information and the use of Persian language in the samples are**\n\n**compelling indicators that the operators may indeed be based out of Iran.**\n\n\n-----\n\n**script and executable variant of the Trojan.**\n\n**The two variants of Helminth use almost identical command and control protocols, which allows**\n\n**the threat actors to maintain consistent infrastructure throughout the campaign to manage the**\n\n**compromised hosts, regardless of the Helminth variant used in the attack.**\n\n**The two variants of Helminth do require different delivery methods, with the script variant relying**\n\n**on an Excel spreadsheet for delivery, while the executable variant is more traditional in the fact**\n\n**that it can be installed without a delivery document. We speculate that the executable variant**\n\n**involves threat actors socially engineering the victim into running the payload, rather than**\n\n**installing the payload as the result of successful exploitation of a vulnerability. The multiple**\n\n**delivery methods suggest this threat group is capable of adapting their procedures to suit the**\n\n**current operation in the overarching campaign.**\n\n**Palo Alto Networks customers are protected from the Helminth Trojan and can gather additional**\n\n**information using the following tools:**\n\n**WildFire detection of all known samples as malicious**\n\n**All Helminth C2 domains have DNS signatures created and are identified as malicious in**\n\n**PAN-DB.**\n\n**[AutoFocus tags Clayslide, Helminth and HerHerDropper.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Clayslide)**\n\n**Clayslide Delivery Documents**\n\n**At first, Clayslide spreadsheets display a worksheet called “Incompatible” that contains**\n\n**instructions for the user to manually enable macros (as seen in Figure 7), as macros are**\n\n**disabled in Excel by default. This is an attempt to trick the user into running the embedded**\n\n**macro to install the Trojan, which does not require any vulnerability exploitation. Figure 7 shows**\n\n**the “Protected View” alert in Excel informing the user that there is an embedded macro that**\n\n**may cause harm to the system.**\n\n**_Figure 7 Clayslide spreadsheet showing the Incompatible worksheet with instructions to enable_**\n\n**_macros and Excel displaying its Protected View alert message_**\n\n**Before the user can enable the macros in accordance with the instructions displayed in the**\n\n**spreadsheet, the user must click the red bar displayed by Protected View and click the “Edit**\n\n**Anyway” button, as seen in 8.**\n\n**_Figure 8 Protected View further mentioning the potential danger with editing the spreadsheet in_**\n\n**_the ClaySlide sample_**\n\n**After clicking the “Edit Anyway” button, Excel displays another security warning bar alerting that**\n\n**the spreadsheet contains macros, as seen in Figure 9. The “Enable Content” button mentioned**\n\n**within the instructions displayed within the Clayslide spreadsheet is now presented to the user.**\n\n**_Figure 9 Excel security warning with the Enable Content button mentioned in Incompatible_**\n\n**_worksheet_**\n\n**If the user clicks the “Enable Content” button, the macro hides the “Incompatible” worksheet and**\n\n**makes hidden worksheets visible that displays decoy content to minimize the victim’s suspicions**\n\n**of malicious behavior taking place. Figure 10 below shows the decoy content displayed by**\n\n**macros within a Clayslide sample, specifically showing the status of internal network IP**\n\n**addresses that fit with the service provider social engineering theme used throughout the attack**\n\n\n-----\n\n**_Figure 10 Decoy content displayed after enabling macros within a Clayslide sample_**\n\n**After displaying the decoy content, the macro begins installing the script variant of the Helminth**\n\n**Trojan to the system. The process used by the macro to install this variant of Helminth begins**\n\n**with the creation of the following files and folders:**\n\n**_%PUBLIC%\\Libraries\\update.vbs_**\n\n**_%PUBLIC%\\Libraries\\dns.ps1_**\n\n**_%PUBLIC%\\Libraries\\up_**\n\n**_%PUBLIC%\\Libraries\\dn_**\n\n**_%PUBLIC%\\Libraries\\tp_**\n\n**The malicious macro finishes the installation process by creating a scheduled task that is**\n\n**responsible for running the two scripts at regular intervals, as the scripts themselves do not have**\n\n**the ability to continually run after the initial execution. The following code snippet within the**\n\n**macro creates a scheduled task named “GoogleUpdateTaskMachineUI” that will run the**\n\n**update.vbs script every three minutes:**\n\n**1** **wss.Run** **\"schtasks /create /F /sc minute /mo 3 /tn \" & Chr(34) & \"Goo**\n\n**Helminth Script Variant**\n\n**Th** **i** **i** **f h** **H l** **i** **h T** **j** **i** **f** **VBS** **i** **d P** **Sh ll** **i** **d**\n\n\n-----\n\n**following two URLs:**\n\n**_hxxp://go0gIe.com/sysupdate.aspx?req=<random number>%5Cdwn&m=d_**\n\n**_hxxp://go0gIe.com/sysupdate.aspx?req=<random number>%5Cbat&m=d_**\n\n**The C2 server will respond to the HTTP requests to the “bat&m=d” URL with a batch script that**\n\n**update.vbs will save to the “dn” folder and execute. The output of the downloaded batch script is**\n\n**saved to a text file in the “up” folder and uploaded to the C2 server via an HTTP POST request**\n\n**to the following URL:**\n\n**_hxxp://go0gIe.com/sysupdate.aspx?req=<random number>%5Cupl&m=u_**\n\n**Palo Alto Networks WildFire observed commands provided by the C2 server for the known**\n\n**Helminth samples. The commands, as seen below, show that the threat actors are attempting to**\n\n**do initial information gathering on the system, including available user accounts, username,**\n\n**computer name, running tasks, services, network services and if remote desktop is enabled.**\n\n**1** **whoami & hostname & ipconfig /all & net user /domain** **2>&1 & net grou**\n\n\n**The update.vbs concludes by running the dns.ps1 PowerShell script. The dns.ps1 script is also**\n\n**responsible for communicating with the C2 server, but it uses DNS queries to send data to the**\n\n**server. The DNS queries sent by this script are queries to subdomains on the same domain as**\n\n**the C2 server, which contains system information or the contents of files from the system. The**\n\n**subdomain of the DNS request that acts as the initial C2 beacon has the following structure:**\n\n**_00000000<base 36 of a random number smaller than 46655>30_**\n\n**The dns.ps1 script checks the response to this DNS query and uses the first octet of the**\n\n**resolving IP address as an identifier for the compromised system. The script then uses this**\n\n**identifier in a follow up DNS request to a subdomain with the following structure:**\n\n**_00<identifier>00000<base36 of a random number smaller than 46655>30_**\n\n**The C2 server will respond to these DNS queries with IP addresses that the script will parse**\n\n**and eventually treat as data to construct a batch script to execute on the system. The script**\n\n**specifically looks for the IP address “33.33.x.x” to mark the beginning of the batch script transfer.**\n\n**Upon receipt of this IP address, the script uses the last two octets of this IP address as a**\n\n**filename for the batch file that it saves to the “tp” folder that was initially created by the macro.**\n\n**Once the batch file name is obtained, the script will continue sending additional DNS requests**\n\n**and use the octets of the resolving IP addresses as characters to write to the batch script. The**\n\n**script continues writing characters to the batch script until it receives the IP address**\n\n**“35.35.35.35” that notifies the script to stop saving data to the file and to run the batch script.**\n\n**The output of the downloaded batch file is saved to “%PUBLIC%\\Libraries\\tp\\<batch**\n\n**filename>.txt”. The script will then upload the output of this batch file by including the data in a**\n\n**sequence of DNS queries. The exfiltrates the output of the batch script by splitting up the data**\n\n**within the text file into chunks up to 23 bytes and sends the data within a series of DNS queries**\n\n**that have the following structure:**\n\n**_00<identifier><filename of batch file without its extension><base36 of sequence number>_**\n\n**_<base36 of a random number smaller than 46655><up to 23 bytes of data from batch script_**\n\n**_output>_**\n\n**Both the update.vbs and dns.ps1 both provide a fully functional remote shell to the actors, which**\n\n**allow the actor to carry out any activities on the compromised system they wish.**\n\n**Helminth Executable Variant**\n\n**The executable variant of Helminth is installed with a Trojan that we are tracking as the HerHer**\n\n**Trojan. The HerHer Trojan saves several files to the file system upon execution to install the**\n\n**Helminth Trojan to the system.**\n\n**%APPDATA%\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\Certificate**\n\n**Managment.lnk**\n\n**%APPDATA%\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Certificate.ico**\n\n**%APPDATA%\\Roaming\\Microsoft Temperary\\adbmanager.exe**\n\n**%APPDATA%\\Roaming\\Microsoft Temperary\\adbtray.exe**\n\n**%APPDATA%\\Local\\Temp\\acro\\Users\\config.txt**\n\n**%PUBLIC%\\Libraries\\~Windows\\wintrust.hlm**\n\n**The “Certificate Managment.lnk” shortcut uses the “Certificate.ico” file for its icon, as seen in**\n\n**Figure 11.**\n\n\n-----\n\n**_Figure 11 Icon file used_**\n\n**Additionally, it has a comment of ‘herher’, which is basis of the dropper’s name. Helminth relies**\n\n**on the following shortcut for persistence, as it runs the Trojan each time the system starts using**\n\n**the following command line:**\n\n**_“C:\\Users\\Rick James\\AppData\\Roaming\\Microsoft Temperary\\adbmanager.exe” q 1_**\n\n**The ‘adbmanager.exe’ and ‘adbtray.exe’ files are the actual Helminth Trojan, both of which are**\n\n**the same executable. The reason for two different filenames is currently unknown. The Helminth**\n\n**Trojan requires arguments on the command-line to execute properly (‘q’ in the analyzed sample**\n\n**as seen in the ‘Certificate Managment.lnk’ shortcut), one of which will run the Trojan’s functional**\n\n**code and the other can open a dialog box as a decoy.**\n\n**The Helminth Trojan begins by creating a mutex named ‘[username]ver4.1’ and writes its**\n\n**embedded configuration as ciphertext to the following file:**\n\n**_%APPDATA%\\Local\\Temp\\acro\\Users\\config.txt_**\n\n**The Trojan will later decrypt the contents of this file using the RC4 algorithm, using the MD5**\n\n**hash of ‘f246b23d-c2d6-45f2-b268-dec30d9adaad’ as the key. We decrypted the configuration**\n\n**file dropped by Helminth and found the structure of the configuration file is ‘IsAlive,[sleep**\n\n**interval]\\r\\n[C2 domain]’. For example, one Helminth sample had the following data within the**\n\n**“config.txt” file:**\n\n**_IsAlive,30_**\n\n**_checkgoogle.org_**\n\n**The Helminth executable variant is able to run batch scripts provided by the C2 server, which is**\n\n**very similar to the script version of this Trojan. The executable variant has one additional**\n\n**capability that is not present in the script version, which involves the ability to log keystrokes via**\n\n**a supplemental keylogger module.**\n\n**Helminth loads its keylogger module of the Trojan by loading the wintrust.hlm file dropped by the**\n\n**HerHer Trojan as a DLL and calling its exported function named ‘Initialize’. The keylogger that**\n\n**creates a window named ‘kk’ to monitor both the clipboard and keystrokes and to save the data**\n\n**in cleartext to the file ‘%TEMP%/acro/Users/[GUID from CoCreateGuid]kk.tmp’. The keylogger**\n\n**saves the keystrokes and the name of the Window visible while the keys were typed to this file**\n\n**in the following structure:**\n\n**_####T####[Window Name]####ET####_**\n\n**_[logged keystrokes]_**\n\n**The wintrust.hlm keylogger logs the contents of the clipboard to the same file, but the clipboard**\n\n**contents do not follow a header that specifies the window name like the other logged**\n\n**keystrokes. The clipboard contents are logged to the file in the following format:**\n\n**_<<< Clipboard —> [contents of clipboard]>>>_**\n\n**Helminth Exe C2 Communications**\n\n**The Helminth executable is able to communicate with its C2 server via HTTP and via DNS**\n\n**queries in very similar ways to the Helminth script variant. In fact, the DNS beacons follow the**\n\n**same structure and sequence as the script variant of Helminth discussed in the previous**\n\n**section. The main difference between the beacons sent from the two variants of Helminth is the**\n\n**data included within the beacon, as the script variant does not send any system information**\n\n**within the beacons, whereas the executable version sends system and malware specific**\n\n**information within both the HTTP and DNS beacons.**\n\n**Helminth executables include the system and malware information within HTTP beacons in the**\n\n**“Cookie” field of the request. Helminth structures the beacon data as follows:**\n\n**_Function=F1; ID=[MD5 of Computer and Username]; Group=[Hardcoded in Malware]; Name=_**\n\n**_[Hardcoded in Malware]; Service=0;_**\n\n**The Trojan will encrypt this data using RC4 and the MD5 hash of “f246b23d-c2d6-45f2-b268-**\n\n**dec30d9adaad” as the key and encode the encrypted data using base64.**\n\n\n-----\n\n**_Figure 12 Helminth HTTP C2 beacon_**\n\n**Helminth sends data within DNS beacons differently than the HTTP beacons and includes**\n\n**additional information as well. The data within the DNS beacons follows the structure:**\n\n**_<path of folder containing keylogger module>_**\n\n**_<path of folder containing key logs and batch script output files>_**\n\n**_<group name hardcoded in malware>_**\n\n**_<name hardcoded in malware>_**\n\n**_<computer name>_**\n\n**_<user name>_**\n\n**_<sleep interval>_**\n\n**_<C2 domain>_**\n\n**The Trojan does not encrypt the data sent via DNS beacons, rather it converts the ASCII**\n\n**characters into their hexadecimal values and includes these values in cleartext. The DNS**\n\n**beacons sent from the Helminth executable have the following structure, which is very similar to**\n\n**the script version:**\n\n**_00<identifier>01<sequence number><up to 24 hexadecimal values of the ASCII data>_**\n\n**Figure 13 shows an example of the DNS beacons sent from a Helminth executable.**\n\n**_Figure 13 Helminth DNS C2 beacon_**\n\n**The encoded data within the DNS beacons displayed in Figure 13 decode to the following:**\n\n**_C:\\Users\\Public\\Libraries\\~Windows\\_**\n\n**_C:\\Users\\Administrator\\AppData\\Roaming\\Microsoft\\Internet Explorer\\Users\\_**\n\n**_[redacted company name]_**\n\n**_Plato_**\n\n**_[Computer Name redacted]_**\n\n**_Administrator_**\n\n**_30_**\n\n**_kernel.ws_**\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2016/2016.05.26.OilRig_Campaign/the-oilrig-campaign-attacks-on-saudi-arabian-organizations-deliver-helminth-backdoor.pdf"
    ],
    "report_names": [
        "the-oilrig-campaign-attacks-on-saudi-arabian-organizations-deliver-helminth-backdoor"
    ],
    "threat_actors": [
        {
            "id": "c8aefee7-fb57-409b-857e-23e986cb4a56",
            "created_at": "2023-01-06T13:46:38.285223Z",
            "updated_at": "2025-03-27T02:00:02.79333Z",
            "deleted_at": null,
            "main_name": "APT18",
            "aliases": [
                "TG-0416",
                "SCANDIUM",
                "PLA Navy",
                "Wekby",
                "G0026",
                "DYNAMITE PANDA"
            ],
            "source_name": "MISPGALAXY:APT18",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b92337-ca5f-48bb-926b-c93b5e5678a4",
            "created_at": "2022-10-25T16:07:23.333316Z",
            "updated_at": "2025-03-27T02:02:09.74201Z",
            "deleted_at": null,
            "main_name": "APT 18",
            "aliases": [
                "APT 18",
                "Dynamite Panda",
                "Scandium",
                "TG-0416",
                "Wekby"
            ],
            "source_name": "ETDA:APT 18",
            "tools": [
                "AngryRebel",
                "AtNow",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HttpBrowser RAT",
                "HttpDump",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Pisloader",
                "QUICKBALL",
                "Roseam",
                "StickyFingers",
                "Token Control",
                "TokenControl",
                "hcdLoader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1464392858,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/ff756612875a76ff69cdf480637f35ba45d94313.pdf",
        "text": "https://archive.orkl.eu/ff756612875a76ff69cdf480637f35ba45d94313.txt",
        "img": "https://archive.orkl.eu/ff756612875a76ff69cdf480637f35ba45d94313.jpg"
    }
}