{
    "id": "2177cc8f-7ebd-4f51-b693-35c57338998d",
    "created_at": "2023-01-12T15:06:30.649324Z",
    "updated_at": "2025-03-27T02:16:59.318761Z",
    "deleted_at": null,
    "sha1_hash": "28dd8d125c40f1c8b46bb23a09c536032e3849e1",
    "title": "2020-09-15 - Rudeminer, Blacksquid and Lucifer Walk Into A Bar",
    "authors": "",
    "file_creation_date": "2022-05-27T23:26:18Z",
    "file_modification_date": "2022-05-27T23:26:18Z",
    "file_size": 1018392,
    "plain_text": "# Rudeminer, Blacksquid and Lucifer Walk Into A Bar\n\n**research.checkpoint.com/2020/rudeminer-blacksquid-and-lucifer-walk-into-a-bar/**\n\nSeptember 15, 2020\nResearch by David Driker, Amir Landau\n\n**Background**\n\n\nSeptember 15, 2020\n\n\n[Lucifer is a Windows crypto miner and DDOS hybrid malware. Three months ago, researchers published a report detailing its](https://unit42.paloaltonetworks.com/lucifer-new-cryptojacking-and-ddos-hybrid-malware/)\nunique activities. More recently, we found evidence that the attackers behind this campaign started their operations in 2018.\n\nWhat started as a miner with self-spreading capabilities that targeted the Windows system, has now evolved into a multi-platform\nand multi-architecture malware targeting Linux, and IoT devices as well.\n\nData collected from ThreatCloud shows recent hits on over 25 organizations in the US, Ireland, the Netherlands Turkey and India.\nAttacks have come from a variety of domains including manufacturing, legal, insurance and also the banking industry.\n\nThe current main attack vector for IoT devices is through exploitation of the vulnerability known as CVE-2018-10561, which targets\nunpatched Dasan GPON router devices.\n\nThe malware has several capabilities: multiple types of DDOS attacks, full command-and-control operations able to download and\nexecute files, remote command execution, Monero mining using the Xmrig miner, and self-spreading in Windows systems through\nvarious exploitation techniques.\nFrom the details presented in this blog, we believe this campaign continues to grow and evolve over time as it upgrades its abilities\nand increases its monetization strategies.\n\n**Campaign overview**\n\nAttacks originate from servers that were compromised by the attacker. Figure 1 shows the infection chain is multi-platform, and\ntargets Windows, Linux and IoT devices. Infected Windows machines then continue to spread the malware both inside the network\nand to remote targets.\n\n\n-----\n\n**Figure 1: The updated infection chain.**\n\nThere is an interesting sequence of strings presented in malware:\n\n**Figure 2: Strings found in recent Windows,** **Linux,** **ARM and MIPS samples.**\n\n[Further investigation of those strings leads us to two campaigns, one that was discovered by TrendMicro which they called](https://blog.trendmicro.com/trendlabs-security-intelligence/blacksquid-slithers-into-servers-and-drives-with-8-notorious-exploits-to-drop-xmrig-miner/)\n[BlackSquid, and another that was discovered by Tencent and called Rudeminer/Spreadminer.](https://s.tencent.com/research/report/737.html)\n\nIt also possible to link those two campaigns to the Lucifer campaign by following the money trail, or in our case, the XMR wallets\nused.\n\n\n-----\n\n**Figure 3: Linking the three campaign through the XMR wallets used.**\n\n[When we explored the Blacksquid samples that use the first wallet in Figure 3, we found two almost identical samples (sample one](https://www.virustotal.com/gui/file/450ad50daaffcd8837c7b181b65a012f28158bbfcdd065a3d08c17890bda9589/detection)\n[and sample two).](https://www.virustotal.com/gui/file/a180d78183cf2c9a049afb2dbacc527977a33e7376d9ec4879b309838b76f3e4/detection)\n\nThe two samples share the same mutex pattern:\n```\nBlacksquidXMRstratum+tcp://[Miner pool address]:[port]\n\n```\nThe first sample uses wallet number one in figure 3, and the second sample uses wallet number two.\n[The second wallet was also used in various other Lucifer samples (sample three), thus enabling us to link the two malware.](https://www.virustotal.com/gui/file/dd2eca99b15dba8763f522aeab52362ae040a420dc9bcd09417e3a970479709e/detection)\n\n[Linking the Blacksquid campaign to Spreadminer was trickier, as the sample provided in the Tencent article (sample one) used a](https://www.virustotal.com/gui/file/55378440e83ea61048e52efcdfc81b297377d3b7a3b0ac8b61c28d3f2e4c6c8d/detection)\ncustom XMR mining pool without an XMR wallet.\n[However, we were able to find an almost identical sample (sample two), which uses wallet number one.](https://www.virustotal.com/gui/file/9511a538277102aa5d6cc949be7dd4dc89c3d1c4b40c91952e3a185ba571a20f/detection)\n\nThe XMR wallet used in the Blacksquid campaign leads to samples from the end of 2018, indicating that the attackers began their\noperations even earlier.\n\nFrom those findings, we created the following timeline:\n\n\n-----\n\n**Figure 4: Timeline of the appearance of variants in this campaign.**\n\nAnother interesting string can be found in the Linux variant of the malware:\n\n**Figure 5: String used in the Linux version of the malware.**\n\nWe believe this string is a response to Tencent publication which called the malware “Rude.”\n\nThese findings indicate that the attackers behind this campaign have been active for more than a year and a half, and that the\nmalware keeps evolving and upgrading its code base.\n\nFrom publicly available data, we estimate that the Lucifer campaign yielded the attacker 18.643456520496 XMR, which is\napproximately $1769.\nAs the old XMR wallet is now blocked, it’s not possible to know how much money was made in the Blacksquid and Spreadminer\ncampaigns. The addition of the DDOS capabilities indicates that the attackers are seeking to expand the malware’s money-making\nmethods.\n\nThe Windows self-spreading capabilities are based on outdated and publicly-available exploits, and the use of brute-force.\nThe Windows self-capabilities have undergone only minor changes over time, which may indicate that the attackers have been\nsuccessful with those methods.\nLike the old saying goes: “If it ain’t broke, don’t fix it.”\n\nThe first samples of the new campaign were uploaded to VirusTotal in February 2020, followed by later samples in the months\nsince. New samples are still being detected.\nThe first and only ARM sample to date was uploaded to VirusTotal on May 10.\n\n\n-----\n\n**Figure 6: ARM sample listing in VirusTotal.**\n\nThis sample was not determined to be malicious.\nThe ARM sample only has DDOS capabilities, and has different behavior from the Linux sample, possibly due to the restrictions\ncaused by IoT devices.\n\nThe C2 server has a publicly accessible HFS server that allows us to witness the campaign’s evolution:\n\n**Figure 7: Latest binary samples uploaded to the C2 HFS public server.**\n\nAs you can see, the campaign keeps evolving and releasing new versions. The `“office.exe”,` `”sb360..exe” executables that`\nwere uploaded are variants of the gh0st RAT, indicating that attackers want to expand the malware capabilities in infected\nmachines.\n\nThe Linux, ARM, MIPS versions were not stripped of debugging symbols. This allowed us to link the code base of the new versions\nfor all platforms to a Chinese DDoS program from 2009, called “Storm Attack Tool VIP 2009.” It is possible to find downloadable\nversions of this program through various open-source Chinese websites.\n\n\n-----\n\n**Figure 8: An image of the Storm attack tool panel.**\n\nAll of the DDoS attacks in the latest version of this campaign are taken from this software. The rest of the malware is heavily\nmodified for other functionality, such as full C&C operations, Monero mining, self-spreading in the Windows system, and the port for\nLinux and IoT devices.\n\nIn the rest of this article, we take an in-depth look at the Linux, ARM and MIPS samples.\n\n**Linux x86/x64**\nThe Linux version is different from the Windows one in that it does not have self-spreading capabilities. In addition, the Linux\nsamples were not stripped of the debugging information.\n\nAfter successful exploitation, the malware uses the daemon command to detach itself from the terminal and run in the background\nas a daemon.\nThe malware checks if it is able to set up a socket which is used to\nbind to a port. The port number depends on the version; the latest version uses port 20580.\nIf the malware is unable to set up a socket or bind to it, it exits.\nAfter the bind, there is no call to the listen function to actually start listening on the port.\nThe purpose of the socket is not to communicate but to\nenforce the behavior that there can only be one process of the malware running at a time, as there cannot be multiple sockets\nusing the same port.\n\nThe malware sets up three signal handler functions for the following signals:\n\n**SIGPIPE – When there is a write operation to a broken pipe. This is useful for when the socket dies.**\n**SIGTERM – Request to terminate the program.**\n**SIGINT** R t f th t h t d f ll\n\n\n-----\n\nThe malware executes this command:\n\n```\n/sbin/service crond start;chkconfig –level 35 crond on;\n\n```\n\nThe first part of the command starts the `crond service. The second part sets the` `crond service to run at the following run`\nlevels:\n\nMulti-User mode, console logins only.\nMulti-User mode, with display manager as well as console logins (X11).\n\nThe `chkconfig command fails because its missing another hyphen before` `-level 35 .`\nThese two commands only apply to CentOS/RHEL based distributions.\n\nThe next goal for the malware is to increase the file descriptor limit.\nOne of the defining features of UNIX is “everything is a file.” This is also true for sockets.\nWhen the malware initiates a DDoS attack, it needs to open as many sockets as possible, to drive as much traffic as possible to\nthe target.\nThis can be achieved by increasing the file descriptor limit in the OS settings.\nTo change the file descriptor limit, the malware first performs a check on the User ID.\nWhen a program is running as root, its User ID is zero.\nIf the malware is running with the User ID zero (root), it:\n\nExecutes the command: ulimit -HSn 65536\nAdds the line “fs.file-max to 6553560” to the file /etc/sysctl.conf\nAdds these lines to the file /etc/security/limits.conf:\n\n   - soft noproc 65535\n\n   - hard noproc 65535\n\n   - soft nofile 65535\n\n   - hard nofile 65535\n\nIf it is not running with the User ID zero, it issues two commands in the following order:\n\n1. ulimit -HSn 4096\n2. ulimit -HSn 10240\n\nThe malware runs these two commands first with a smaller limit and then a greater limit. If the increase fails, the smaller limit is the\nfallback option.\n\nPersistence of the malware only happens if the User ID is zero:\n\n1. If the file `/etc/rc.local exists, the malware either writes or appends this line in the file:`\n\nMALWARE_PATH start\n2.  The malware writes this line in the file/etc/crontab:\n\n*/1 * * * * MALWARE_PATH\n\nThe /etc/rc.local script is executed after all normal system services have started.\nThe line added in the crontab causes Linux to execute the malware every minute.\n\nAfter the malware configures its persistence, it decrypts these five strings:\n\nC&C address: qf2020[.]top\nParameter list for the Xmr miner: -o stratum+tcp://pool.supportxmr.com:3333 -u\n4AfAd5hsdMWbuNyGbFJVZjcMLeKHvrXnT155DWh8qGkYRPbVGKBT9q1Z5gcFXqmwUuh2Kh6t2sTnHXPysYrGf2m9KqBwz9e\n-p X\nParameter list for the Xmr miner: -o stratum+tcp://gulf.moneroocean.stream:10001 -u\n4AfAd5hsdMWbuNyGbFJVZjcMLeKHvrXnT155DWh8qGkYRPbVGKBT9q1Z5gcFXqmwUuh2Kh6t2sTnHXPysYrGf2m9KqBwz9e\n-p X -a cn/r\nLocation for the Xmr miner: /tmp/spreadtop\nURL of the Xmr miner: 122[.]112[.]179[.]189:50208/X64\n\nAfter the initialization, the malware begins the main logic by starting these five threads:\n\n\n-----\n\nMining thread\nIt first downloads the miner and saves it into /tmp/spread.\nThis enables it to make sure the miner is running, and if needed, stop or restart the mining process.\nProcess killer thread\n\nThe thread attempts to locate and kill processes whose name starts with the one of these strings:\n\nLinux25000\nLinux2.6\nLinux2.7\nLinuxTF\nMiner\nGet the network usage thread\nGet the CPU usage thread\n\nSend mining, CPU usage and network usage reports to the C&C server\n\n**Figure 9: Example of a report message**\n\nAfter the threads are set up, the malware starts an infinite loop and maintains a constant connection to the C&C.\nThe C&C command modes:\n\nMode 4 Start a DDOS attack on the target.\n\nMode 5 Stop the current DDOS attack or re-enable a future attack.\n\nMode 6 Download and execute a file.\n\nMode 7 Execute a command.\n\nMode 8 Disable usage reports.\n\nMode 9 Enable usage reports.\n\nMode 10 Switch to a different mining pool and kill the current mining process.\n\nMode 11 Disable mining.\n\nMode 12 Enable mining.\n\n**Linux ARM/MIPS**\n\nThe ARM/MIPS versions are simpler versions of the Linux one – they only contain DDoS capabilities.\nInitialization is almost the same as in the Linux version.\nThey use the daemon to detach and the socket bind method to ensure there is only one running process.\nThe malware only sets up a signal handler for the SIGPIPE.\nIf it is running as root, it increases the file descriptor limit to 20480 and writes its path to the /etc/rc.local file for persistence.\nIf it is not running as root, it increases the file descriptor limit to 4096.\nThen the malware decrypts the C&C address: tyz2020[.]top\n\nAfter the initialization, the malware starts the main logic by starting this one thread: Watchdog communication thread\nFirst it checks if any of these devices exist: /dev/watchdog or /dev/misc/watchdog.\nIf one of them exists, the Watchdog timeout is increased to 15 seconds using the ioctl WDIOC_SETTIMEOUT.\nThen the thread starts an infinite loop to send the ioctl WDIOC_KEEPALIVE to Watchdog every 10 seconds.\n\nThe Watchdog role is to ensure the system is stable.\nIn the case of a system issue, the user space Watchdog stops writing to the Watchdog device, and the kernel Watchdog restarts\nthe device.\n\n\n-----\n\nBy using this thread, the malware ensures the watch device always has data written into the Watchdog device. This prevents the\nreboot of the device.\n\nAs seen previously, after the thread is set up, the malware starts an infinite loop and maintains a constant connection to the C&C.\nThe C&C command modes:\n\nMode 4 Start a DDOS attack on the target.\n\nMode 5 Stop the current DDOS attack or re-enable a future attack.\n\n**Conclusion**\n\nAs we show in this article, this campaign is continually evolving to cross between platforms and adding new ways to gain profit and\nspread itself. Even though the attacker uses known attacks for infecting machines and self-spreading, not all the systems are\nalways updated. Brute forcing can be effective when the organization has a weak password policy.\n\nAs of this writing, these are the capacities used by the attacker on all architectures and platforms:\n\nOperating System DDoS capabilities C&C communication Self-spreading\n\nWindows Yes Full C&C communication Yes\n\nLinux Yes Full C&C communication No\n\nARM Yes DDoS commands only No\n\nMIPS Yes DDoS commands only No\n\nWe believe that this campaign will continue to evolve, including modifying the current self-spreading methods and capabilities in\nWindows and adding them to the Linux, ARM and MIPS versions.\n\n**Check Point protections**\n\nCheck Point’s [IoT Protect protects every IoT device across the entire network and protects the network from any IoT related attack.](https://www.checkpoint.com/solutions/iot-security/)\n\nIt is based on two security functions:\n\n1. Prevent unauthorized access and malicious intent from reaching the IoT devices.\n2. Identify infected devices and prevent them from compromising other network elements.\n\nCheck Point offers security solutions for both IoT networks and IoT and OT devices. These solutions are tailored for different\n[environments including Enterprise Smart Office, Smart Building, Industrial, and Healthcare.](https://www.youtube.com/watch?v=Gq9mFKmu8Jc)\n\nAnti-Bot Protections\n\nThe Anti-Bot blade includes network signatures for the behavior command-and-control operation, as well as C&C domains.\n\nIPS Protections\n\nRejetto HTTP File Server Remote Code Execution (CVE-2014-6287)\nJenkins Stapler Web Framework Remote Code Execution (CVE-2018-1000861)\nOracle WebLogic WLS Security Component Remote Code Execution (CVE-2017-10271)\nNoneCMS ThinkPHP Remote Code Execution (CVE-2018-20062)\nDrupal Core Remote Code Execution (CVE-2018-7600)\nApache Struts2 Struts1_Plugin Remote Code Execution\nMicrosoft Windows SMB Remote Code Execution (MS17-010: CVE-2017-0144)\nMicrosoft Windows SMB Remote Code Execution (MS17-010: CVE-2017-0145)\nMicrosoft LNK Remote Code Execution (CVE-2017-8464; CVE-2018-0978)\nDasan GPON Router Authentication Bypass (CVE-2018-10561)\n\nAnti-Virus Protections\n\nThe Anti-Virus blade includes hashes signatures for all variants.\n\n**IOCs**\n\n\n-----\n\n**C2**\n122[.]112[.]179[.]189\nguyeyuyu[.]com\n\nqianduoduo[.]pw\nqf2020[.]top\ntyz2020[.]top\n\n**Linux samples:**\n\n53c2a0f3c3775111cbf8c09cd685e44a434bdd2d4dc0b9af18266083fb4b41e8\n82934ed1f42986bdad8e78049e27fcb0b8e43a5b0b9332aa913b901c7344cbc6\nebcaed78aab7b691735bb33d5c33dd6dd447a0a538ff84d0d115c2b35831d43d\nd9f1878b029202195e0aeefb8406ea13d1ed57f8042636858dfd71f204ca0b05\n7caf6f673d224effa207c3b3f9a0ce65eabe60230fbc70e52091f0e2f3c1f09c\nbcdadf4930abab3773df1c184fd2b6fa34b5cb8543177d76daf2b9f7c1f36c4f\nECA3E0DE0A9FA7CAC75617C57839E7D62C53E4690483C08A849E624A2C79D8D9\n49A8F1F9A771283771E5733EF05C3D525806318EEC7C82A049EE2B05B4259204\n\n**ARM sample:**\n3ea56bcf897cb8909869e1bfc35f47e1c8a454dd891c5396942c1255aa09b0ce\n\n**Monero wallets:**\n\n44זygo7VfwEYdEbe1ruyZNLfrV19snk3REQpfb5LU9Yxf98z7Ws9EZPPbUgvozZyfYXCb3vsRJRT8wTGe3FipsLb93NaDULN\n45sep79Asuwcjz8dLTu7XtJBTX7yYf7uo6qT9ymFBQXv8gjZsDPyd46Hoh6DM8pAXkLnsw9U7veZWU1DqMjKRoryAn3zEq1\n43VqbHtuooiNC8rMEeoiB6LzUTyBfPaup3DxAUxRxmqo2fGRDGkyzx68ehdh43Zbn5LHwdFAcztskQW2bAoxMtm9NwJDi7R\n4AfAd5hsdMWbuNyGbFJVZjcMLeKHvrXnT155DWh8qGkYRPbVGKBT9q1Z5gcFXqmwUuh2Kh6t2sTnHXPysYrGf2m9KqBwz9e\n48S6vZmW26kCchf44dmbkQY87iVBZ9hkuVaRjyFniWVcS8gSUKjcgPUWFUp7z9WwVx7FkMP2iGUEFLpGQdTjip5U6NEBpA6\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-15 - Rudeminer, Blacksquid and Lucifer Walk Into A Bar.pdf"
    ],
    "report_names": [
        "2020-09-15 - Rudeminer, Blacksquid and Lucifer Walk Into A Bar.pdf"
    ],
    "threat_actors": [
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535990,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653693978,
    "ts_modification_date": 1653693978,
    "files": {
        "pdf": "https://archive.orkl.eu/28dd8d125c40f1c8b46bb23a09c536032e3849e1.pdf",
        "text": "https://archive.orkl.eu/28dd8d125c40f1c8b46bb23a09c536032e3849e1.txt",
        "img": "https://archive.orkl.eu/28dd8d125c40f1c8b46bb23a09c536032e3849e1.jpg"
    }
}