{
    "id": "2196e533-c0cd-4b27-b77e-963f783d5129",
    "created_at": "2023-01-12T15:02:55.300317Z",
    "updated_at": "2025-03-27T02:10:49.328819Z",
    "deleted_at": null,
    "sha1_hash": "652a2ea7da90c8259a4f7d5e4e3097714c4d6625",
    "title": "2019-06-04 - Magecart skimmers found on Amazon CloudFront CDN",
    "authors": "",
    "file_creation_date": "2022-05-28T19:21:26Z",
    "file_modification_date": "2022-05-28T19:21:26Z",
    "file_size": 854665,
    "plain_text": "# Magecart skimmers found on Amazon CloudFront CDN\n\n**[blog.malwarebytes.com/threat-analysis/2019/06/magecart-skimmers-found-on-amazon-cloudfront-cdn/](https://blog.malwarebytes.com/threat-analysis/2019/06/magecart-skimmers-found-on-amazon-cloudfront-cdn/)**\n\nJérôme Segura June 4, 2019\n\nUpdate (06-08-2019): The compromises of Amazon S3 buckets continue and some large\nsites are being affected. Our crawler spotted a malicious injection that loads a skimmer for\nthe Washington Wizards page on the official NBA.com website.\n\n\n-----\n\n[The skimmer was inserted in this JavaScript library:](https://web.archive.org/web/20190609044354/https://s3.amazonaws.com/wsaimages/js/wizards.js)\n```\nhxxps://s3[.]amazonaws[.]com/wsaimages/js/wizards[.]js\n\n```\n[Interestingly, this same library had already been altered (loading content from installw[.]com)](https://www.virustotal.com/gui/domain/installw.com/relations)\n[some time earlier in January of this year. We have reported this incident to Amazon. A](https://web.archive.org/web/20190122172555/https://s3.amazonaws.com/wsaimages/js/wizards.js)\n[complete archived scan of the page can be found here.](https://urlscan.io/result/a8e13fdc-d4e9-4218-8be8-67875a515f6c)\n\n—\n\n[Late last week, we observed a number of compromises on Amazon CloudFront – a Content](https://aws.amazon.com/cloudfront/)\nDelivery Network (CDN) – where hosted JavaScript libraries were tampered with and\ninjected with web skimmers.\n\nAlthough attacks that involve CDNs usually affect a large number of web properties at once\nvia their supply chain, this isn’t always the case. Some websites either use Amazon’s cloud\ninfrastructure to host their own libraries or link to code developed specifically for them and\nhosted on a custom [AWS S3 bucket.](https://aws.amazon.com/s3/)\n\n\n-----\n\nWithout properly validating content loaded externally, these sites are exposing their users to\nvarious threats, including some that pilfer credit card data. After analyzing these breaches,\nwe found that they are a continuation of a campaign from Magecart threat actors attempting\nto cast a wide net around many different CDNs.\n\n## The ideal place to conceal a skimmer\n\nCDNs are widely used because they provide great benefits to website owners, including\noptimizing load times and cost, as well as helping with all sorts of data analytics.\n\nThe sites we identified during a crawl had nothing in common other than the fact they were\nall using their own custom CDN to load various libraries. In effect, the only resulting victims of\na compromise on their CDN repository would be themselves.\n\nThis first example shows a JavaScript library that is hosted on its own dedicated AWS S3\nbucket. The skimmer can be seen appended to the original code and using obfuscation to\nconceal itself.\n\nSite loading a compromised JavaScript library from its own AWS S3 bucket\n\n\n-----\n\nThis second case shows the skimmer injected not just in one library, but several contained\nwithin the same directory, once again part of an S3 bucket that is only used by this one\nwebsite.\n\nFiddler traffic capture showing multiple JavaScript files on AWS injected with skimmer\nFinally, here’s another example where the skimmer was injected in various scripts loaded\nfrom a custom CloudFront URL.\n\n\n-----\n\nFiddler traffic capture showing skimmer injected in a custom CloudFront repository\n\n## Exfiltration gate\n\nThis skimmer uses two levels of encoding (hex followed by Base64) to hide some of its\npayload, including the exfiltration gate (cdn-imgcloud[.]com). The stolen form data is also\nencoded before being sent back to the criminal infrastructure.\n\n\n-----\n\nWhile we would have expected to see many Magento e-commerce shops, some of the\nvictims included a news portal, a lawyer’s office, a software company, and a small telecom\noperator, all running a variety of Content Management Systems (CMSes).\n\nSnippet of\n\nthe skimmer code showing functions used to exfiltrate data\nAs such, many did not even have a payment form within their site. Most simply had a sign up\nor login form instead. This makes us believe that Magecart threat actors may be conducting\n“spray and pray” attacks on the CDNs they are able to access. Perhaps they are hoping to\ncompromise libraries for sites with high traffic or tied to valuable infrastructure from which\nthey can steal input data.\n\n## Connection with existing campaign\n\nThe skimmer used in this attack looked eerily familiar. Indeed, by going back in time, we\nnoted it used to have the same exfiltration gate (font-assets[.]com) identified by Yonathan\n[Klijnsma in RiskIQ’s report on several recent supply-chain attacks.](https://www.riskiq.com/blog/labs/cloudcms-picreel-magecart/)\n\n[RiskIQ, in partnership with Abuse.ch and the](https://abuse.ch/) [Shadowserver Foundation, sinkholed both that](https://www.shadowserver.org/)\ndomain and another (ww1-filecloud[.]com) in an effort to disrupt the criminal’s infrastructure.\n\n\n-----\n\nComparison\n\nsnapshots: the exfiltration gate changing after original domain gets sinkholed\nA cursory look at this new cdn-imgcloud[.]com gate shows that it was registered just a couple\n[days after the RiskIQ blog post came out and uses Carbon2u (which has a certain history) as](https://krebsonsecurity.com/2015/05/security-firm-redefines-apt-african-phishing-threat/#more-30967)\nnameservers.\n```\nCreation Date: 2019-05-16T07:12:30Z\nRegistrar: Shinjiru Technology Sdn Bhd\nName Server: NS1.CARBON2U.COM\nName Server: NS2.CARBON2U.COM\n\n```\nThe domain resolves to the IP address 45.114.8[.]160 that belongs to ASN 55933 in Hong\nKong. By exploring the same subnet, we can find other exfiltration gates also registered\nrecently.\n\n\n-----\n\nVirusTotal graph showing new gates and revealing that old gates are back online\n\nWhat we can also see from the above VirusTotal graph, is that the two domains (fontassets[.]com and ww1-filecloud[.]com) that were previously sinkholed to 179.43.144[.]137\n(server in Switzerland) came back into the hands of the criminals.\n\n[Historical passive DNS records show that on 05-25-2019, font-assets[.]com started resolving](https://securitytrails.com/domain/font-assets.com/history/a)\nto 45.114.8[.]161. The same thing happened for ww1-filecloud[.]com, which ended up\nresolving to 45.114.8[.]159 after [a few swaps.](https://securitytrails.com/domain/ww1-filecloud.com/history/a)\n\n## Finding and exploiting weaknesses\n\nThis type of attack on private CDN repositories is not new, but reminds us that threat actors\nwill look to exploit anything that is vulnerable to gain entry into systems. Sometimes, coming\nin from the front door might not be a viable option, so they will look for other ways.\n\nWhile this example is not a third-party script supply-chain attack, it is served from third-party\ninfrastructure. Beyond applying the same level of access control to your own CDN-hosted\nrepositories as your actual website, other measures—such as validation of any externally\n[loaded content (via Subresource Integrity checks, for example)—can save the day.](https://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity)\n\nWe reached out to the victims we identified in this campaign and several have already\nremediated the breach. In other cases, we filed an abuse report directly with Amazon.\n[Malwarebytes users are protected against the skimmers mentioned in this blog and the new](https://www.malwarebytes.com/)\nones we discover each day.\n\n## Indicators of Compromise (IoCs)\n\n\n-----\n\nww1-filecloud[.]com,45.114.8[.]159\n\ncdn-imgcloud[.]com,45.114.8[.]160\n\nfont-assets[.]com,45.114.8[.]161\n\nwix-cloud[.]com,45.114.8[.]162\n\njs-cloudhost[.]com,45.114.8[.]163\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-04 - Magecart skimmers found on Amazon CloudFront CDN.pdf"
    ],
    "report_names": [
        "2019-06-04 - Magecart skimmers found on Amazon CloudFront CDN.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535775,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653765686,
    "ts_modification_date": 1653765686,
    "files": {
        "pdf": "https://archive.orkl.eu/652a2ea7da90c8259a4f7d5e4e3097714c4d6625.pdf",
        "text": "https://archive.orkl.eu/652a2ea7da90c8259a4f7d5e4e3097714c4d6625.txt",
        "img": "https://archive.orkl.eu/652a2ea7da90c8259a4f7d5e4e3097714c4d6625.jpg"
    }
}