{
    "id": "21e2368d-721a-43b1-8881-cc217ab4e851",
    "created_at": "2023-01-12T15:10:21.778113Z",
    "updated_at": "2025-03-27T02:05:18.379068Z",
    "deleted_at": null,
    "sha1_hash": "beed20b3ce593c3f097b0d65505f3f2098f33332",
    "title": "2018-05-09 - The King is dead. Long live the King!",
    "authors": "",
    "file_creation_date": "2022-05-28T05:09:22Z",
    "file_modification_date": "2022-05-28T05:09:22Z",
    "file_size": 981917,
    "plain_text": "# The King is dead. Long live the King!\n\n**[securelist.com/root-cause-analysis-of-cve-2018-8174/85486/](https://securelist.com/root-cause-analysis-of-cve-2018-8174/85486/)**\n\nAuthors\n\n[Vladislav Stolyarov](https://securelist.com/author/vladislavstolyarov/)\n\nBoris Larin\n\nAnton Ivanov\n\n## Root cause analysis of the latest Internet Explorer zero day – CVE- 2018-8174\n\n\n-----\n\nIn late April 2018, a new zero-day vulnerability for Internet Explorer (IE) was found using our\nsandbox; more than two years since the last in the wild example (CVE-2016-0189). This\nparticular vulnerability and subsequent exploit are interesting for many reasons. The\nfollowing article will examine the core reasons behind the latest vulnerability, CVE-20188174.\n\n### Searching for the zero day\n\nOur story begins on VirusTotal (VT), where someone uploaded an interesting exploit on April\n18, 2018. This exploit was detected by several AV vendors including Kaspersky, specifically\nby our generic heuristic logic for some older Microsoft Word exploits.\n\n[After the malicious sample was processed in our sandbox system, we noticed that a fully](https://www.kaspersky.com/enterprise-security/wiki-section/products/sandbox)\npatched version of Microsoft Word was successfully exploited. From this point we began a\ndeeper analysis of the exploit. Let’s take a look at the full infection chain:\n\nThe infection chain consists of the following steps:\n\nA victim receives a malicious Microsoft Word document.\n\n\n-----\n\nAfter opening the malicious document, a second stage of the exploit is downloaded; an\nHTML page containing VBScript code.\nThe VBScript code triggers a Use After Free (UAF) vulnerability and executes\nshellcode.\n\n### Initial analysis\n\nWe’ll start our analysis with the initial Rich Text Format (RTF) document, that was used to\ndeliver the actual exploit for IE. It only contains one object, and its contents are obfuscated\n[using a known obfuscation technique we call “nibble drop“.](https://securelist.com/disappearing-bytes/84017/)\n\nAfter deobfuscation and hex-decoding of the object data, we can see that this is an OLE\n[object that contains a URL Moniker CLSID. Because of this, the exploit initially resembles an](https://docs.microsoft.com/en-us/windows/win32/com/url-monikers)\n[older vulnerability leveraging the Microsoft HTA handler (CVE-2017-0199).](https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2017-0199)\n\nWith the CVE-2017-0199 vulnerability, Word tries to execute the file with the default file\nhandler based on its attributes; the Content-Type HTTP header in the server’s response\nbeing one of them. Because the default handler for the “application/hta” Content-Type is\nmshta.exe,it is chosen as the OLE server to run the script unrestricted. This allows an\nattacker to directly call ShellExecute and launch a payload of their choice.\n\nHowever, if we follow the embedded URL in the latest exploit, we can see that the content\ntype in the server’s response is not “application/hta”, which was a requirement for CVE-20170199 exploitation, but rather “text/html”. The default OLE server for “text/html” is mshtml.dll,\n\n\n-----\n\nwhich is a library that contains the engine, behind Internet Explorer.\n\nFurthermore, the page contains VBScript, which is loaded with a safemode flag set to its\ndefault value, ‘0xE’. Because this disallows an attacker from directly executing a payload, as\nwas the case with the HTA handler, an Internet Explorer exploit is needed to overcome that.\n\nUsing a URL moniker like that to load a remote web page is possible, because Microsoft’s\npatch for Moniker-related vulnerabilities (CVE-2017-0199, CVE-2017-8570 and CVE-20178759) introduced an activation filter, which allows applications to specify which COM objects\nare restricted from instantiating at runtime.\n\nAt the time of this analysis, the list of filtered CLSIDs consisted of 16 entries. TheMSHTML\nCLSID ({{25336920-03F9-11CF-8FD0-00AA00686F13}}) is not in the list, which is why the\nMSHTML COM server is successfully created in Word context.\n\n\n-----\n\nThis is where it becomes interesting. Despite a Word document being the initial attack vector,\nthe vulnerability is actually in VBScript, not in Microsoft Word. This is the first time we’ve\nseen a URL Moniker used to load an IE exploit, and we believe this technique will be used\nheavily by malware authors in the future. This technique allows one to load and render a web\npage using the IE engine, even if default browser on a victim’s machine is set to something\ndifferent.\n\nThe VBScript in the downloaded HTML page contains both function names and integer\nvalues that are obfuscated.\n\n### Vulnerability root cause analysis\n\nFor the root cause analysis we only need to look at the first function (‘TriggerVuln’) in the\ndeobfuscated version which is called right after ‘RandomizeValues’ and ‘CookieCheck’.\n\n\n-----\n\nTo achieve the desired heap layout and to guarantee that the freed class object memory will\nbe reused with the ‘ClassToReuse’ object, the exploit allocates some class objects. To trigger\nthe vulnerability this code could be minimized to the following proof-of-concept (PoC):\n\n\n-----\n\nWhen we then launch this PoC in Internet Explorer with page heap enabled we can observe\na crash at the OLEAUT32!VariantClear function.\n\nWith this PoC we were able to trigger a Use-after-free vulnerability; both ArrA(1) and ArrB(1)\nwere referencing the same ‘ClassVuln’ object in memory. This is possible because when\n“Erase ArrA” is called, the vbscript!VbsErase function determines that the type of the object\nto delete is a SafeArray, and then calls OLEAUT32!SafeArrayDestroy.\n\nIt checks that the pointer to a [tagSafeArray structure is not NULL and that its reference](https://docs.microsoft.com/en-us/windows/win32/api/oaidl/ns-oaidl-safearray)\ncount, stored in the cLocks field is zero, and then continues to call ReleaseResources.\n\n\n-----\n\nReleaseResources, in turn will check the fFeatures flags variable, and since we have an\narray of VARIANTs, it will subsequently call VariantClear; a function that iterates each\nmember of an array and performs the necessary deinitialization and calls the relevant class\ndestructor if necessary. In this case, VBScriptClass::Release is called to destroy the object\ncorrectly and handle destructors like Class_Terminate, since the VARTYPE of ArrA(1) is\nVT_DISPATCH.\n\n\n-----\n\nThis ends up being the root cause of the vulnerability. Inside the VBScriptClass::Release\nfunction, the reference count is checked only once, at the beginning of the function. Even\nthough it can be (and actually is, in the PoC) incremented in an overloaded TerminateClass\nfunction, no checks will be made before finally freeing the class object.\n\n[Class_Terminate is a deprecated method, now replaced by the ‘Finalize’ procedure. It is](https://docs.microsoft.com/en-us/dotnet/visual-basic/programming-guide/language-features/objects-and-classes/object-lifetime-how-objects-are-created-and-destroyed)\nused to free acquired resources during object destruction and is executed as soon as object\nis set to nothing and there are no more references to that object. In our case, the\nClass_Terminate method is overloaded, and when a call to VBScriptClass::TerminateClass is\nmade, it is dispatched to the overloaded method instead. Inside of that overloaded method,\nanother reference is created to the ArrA(1) member. At this point ArrB(1) references ArrA(1),\nwhich holds a soon to be freed ClassVuln object.\n\nAfter the Class_Terminate sub is finished, the object at ArrA(1) is freed, but ArrB(1) still\nmaintains a reference to that freed class object. When the execution continues, and ArrB is\nerased, the whole cycle repeats, except that this time, ArrB(1) is referencing a freed\nClassVuln object, and so we observe a crash when one of the virtual methods in the\nClassVuln vtable is called.\n\n### Conclusion\n\nIn this write up we analyzed the core reasons behind CVE-2018-8174, a particularly\ninteresting Use-After-Free vulnerability that was possible due to incorrect object lifetime\nhandling in the Class_Terminate VBScript method. The exploitation process is different from\n\n\n-----\n\nwhat we ve seen in exploits for older vulnerabilities (CVE-2016-0189 and CVE-2014-6332)\nas the Godmode technique is no longer used. The full exploitation chain is as interesting as\nthe vulnerability itself, but is out of scope of this article.\n\nWith CVE-2018-8174 being the first public exploit to use a URL moniker to load an IE exploit\nin Word, we believe that this technique, unless fixed, will be heavily abused by attackers in\nthe future, as It allows you force IE to load ignoring the default browser settings on a victim’s\nsystem.\n\nWe expect this vulnerability to become one of the most exploited in the near future, as it\nwon’t be long until exploit kit authors start abusing it in both drive-by (via browser) and spearphishing (via document) campaigns. To stay protected, we recommend applying latest\n[security updates, and using a security solution with behavior detection capabilities.](https://www.kaspersky.com/enterprise-security/wiki-section/products/behavior-based-protection)\n\nIn our opinion this is the same exploit which Qihoo360 Core Security Team called “Double\n[Kill” in their recent publication. While this exploit is not limited to browser exploitation, it was](https://weibo.com/ttarticle/p/show?id=2309404230886689265523)\nreported as an IE zero day, which caused certain confusion in the security community.\n\nAfter finding this exploit we immediately shared the relevant information with Microsoft and\nthey confirmed that it is in fact [CVE-2018-8174, and received an acknowledgement for the](https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2018-8174)\nreport.\n\n_This exploit was found in the wild and was used by an APT actor. More information about_\n_that APT actor and usage of the exploit is available to customers of Kaspersky Intelligence_\n_Reporting Service. Contact: intelreports@kaspersky.com_\n\n### Detection\n\nKaspersky Lab products successfully detect and block all stages of the exploitation chain\nand payload with the following verdicts:\n\nHEUR:Exploit.MSOffice.Generic – RTF document\nPDM:Exploit.Win32.Generic – IE exploit – detection with Automatic Exploit Prevention\ntechnology\nHEUR:Exploit.Script.Generic – IE exploit\nHEUR:Trojan.Win32.Generic – Payload\n\n### IOCs\n\n\n-----\n\nb48ddad351dd16e4b24f3909c53c8901 – RTF document\n15eafc24416cbf4cfe323e9c271e71e7 – Internet Explorer exploit (CVE-2018-8174)\n1ce4a38b6ea440a6734f7c049f5c47e2 – Payload\nautosoundcheckers[.]com\n\n[Microsoft Internet Explorer](https://securelist.com/tag/microsoft-internet-explorer/)\n[Vulnerabilities and exploits](https://securelist.com/tag/vulnerabilities-and-exploits/)\n[Zero-day vulnerabilities](https://securelist.com/tag/zero-day-vulnerabilities/)\n\nAuthors\n\n[Vladislav Stolyarov](https://securelist.com/author/vladislavstolyarov/)\n\nBoris Larin\n\nAnton Ivanov\n\nThe King is dead. Long live the King!\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-05-09 - The King is dead. Long live the King!.pdf"
    ],
    "report_names": [
        "2018-05-09 - The King is dead. Long live the King!.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536221,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653714562,
    "ts_modification_date": 1653714562,
    "files": {
        "pdf": "https://archive.orkl.eu/beed20b3ce593c3f097b0d65505f3f2098f33332.pdf",
        "text": "https://archive.orkl.eu/beed20b3ce593c3f097b0d65505f3f2098f33332.txt",
        "img": "https://archive.orkl.eu/beed20b3ce593c3f097b0d65505f3f2098f33332.jpg"
    }
}