{
    "id": "21e8b42d-6be5-4f61-8bfc-5bb3949c793c",
    "created_at": "2023-01-12T15:01:08.176803Z",
    "updated_at": "2025-03-27T02:05:32.882719Z",
    "deleted_at": null,
    "sha1_hash": "73bc91cb2e940eea34152f1a472905d55e3b16aa",
    "title": "2021-04-19 - Hunting phishing websites with favicon hashes",
    "authors": "",
    "file_creation_date": "2022-05-28T04:03:37Z",
    "file_modification_date": "2022-05-28T04:03:37Z",
    "file_size": 668123,
    "plain_text": "# SANS ISC: Hunting phishing websites with favicon hashes - SANS Internet Storm Center SANS Site Network Current Site SANS Internet Storm Center Other SANS Sites Help Graduate Degree Programs Security Training Security Certification Security Awareness Training Penetration Testing Industrial Control Systems Cyber Defense Foundations DFIR Software Security Government OnSite Training SANS ISC InfoSec Forums\n\n**[isc.sans.edu/forums/diary/Hunting+phishing+websites+with+favicon+hashes/27326/](https://isc.sans.edu/forums/diary/Hunting+phishing+websites+with+favicon+hashes/27326/)**\n\nHunting phishing websites with favicon hashes\n\n\nHTTP favicons are often used by bug bounty hunters and red teamers to\ndiscover vulnerable services in a target AS or IP range. It makes sense – since\ndifferent tools (and sometimes even different versions of the same tool) use\n[different favicons[1] and services such as Shodan calculate MurmurHash](https://github.com/sansatart/scrapts/blob/master/shodan-favicon-hashes.csv)\n[values[2] for all favicons they discover and let us search through them, it can be](https://en.wikipedia.org/wiki/MurmurHash)\nquite easy to find specific services and devices this way.\n\nBut while the use of favicon hashes is common in the “red” community,\nsignificant number of blue teamers don’t use them at all. Which is unfortunate,\ngiven that – among their other uses – they can provide us with a simple way of\nidentifying IPs hosting phishing kits. After all, this was the reason why searches\nusing HTTP favicon hashes have been introduced into Shodan in the first\n[place[3].](https://twitter.com/shodanhq/status/1280247570586099719)\n\nAs an example, we will show how to detect IPs hosting phishing pages by\nlooking for sites that try to pass themselves of as login portals for O365 and\nother Microsoft services, however the same principle would work for any other\nservice as well. One could therefore for example calculate hashes of unique\nfavicons used by systems specific to a company one is trying to protect (e.g.\nfavicon from a company website) and use periodical lookups of these on\nShodan and other services in order to implement a – admittedly fairly simple –\nphishing detection/brand protection mechanism...\n\nSo how would one look for fake Microsoft login portals? First, we need to\ncalculate a MurmurHash value of a favicon that we expect might be reused on a\nphishing website to make it look more trustworthy. Looking at official Microsoft\nwebsites, it seems that they use the favicon located at https://c.smicrosoft.com/favicon.ico.\n\n\nJan\n\n73\nPosts\n\nISC\nHandler\nApr\n19th\n2021\n\n\n-----\n\nIts hash can be easily calculated using Python code that may be found on\n[GitHub[4]:](https://gist.github.com/yehgdotnet/b9dfc618108d2f05845c4d8e28c5fc6a)\n```\nimport requests,mmh3,base64\nresponse = requests.get('https://c.s-microsoft.com/favicon.ico')\nfavicon = base64.encodebytes(response.content)\nhash = mmh3.hash(favicon)\nprint(hash)\n\n```\nIf we run this script, we will get the hash -2057558656.\n\nNow that we have a hash to look for, we can query Shodan to get the list of all\nIP addresses where it found a favicon with the same one. We may use the filter\nhttp.favicon.hash to do so.\n\nAs we can see, the number of results is quite high. This is hardly surprising\nthough, given that they conain all servers – malicious as well as legitimate –\nwhere the favicon is used. In order to discover only the suspicious ones, we\nwould need to further refine the search. One would do this differently for one’s\nown favicons, but in order to search for suspicious Microsoft login portals, we\ncould extend our search to look only for IPs with web pages looking like log in\nportals (http.html:\"Sign in\") and that are not hosted on Microsoft infrastructure (org:\"Microsoft Corporation\" -org:\"Microsoft Azure\") but are running an Apache\nweb server (product:\"Apache httpd\"). Taken together, our search might look like\nthis:\n```\nhttp.favicon.hash:-2057558656 -org:\"Microsoft Corporation\" -org:\"Microsoft\nAzure\" product:\"Apache httpd\" http.html:\"Sign in\"\n\n```\nIf we ran this updated search, the number of results would be significantly lower.\n\n\n-----\n\nNot all IPs identified in this way would necessarily turn out to host a phishing\nwebsite, but most of them almost certainly would (or would at least turn out to\nhave done so recently). In any case, all of them would unquestionably be worth\ninvestigating, and it probably wouldn’t take too long to discover something\ninteresting. In our search, for example, the following web site was hosted on the\nvery first IP that Shodan returned.\n\nAs we’ve mentioned, the same approach can be used to identify phishing web\nsites using any other favicon as well.\n\nGiven how easy it is to implement automatic periodic lookups (for example\nagainst Shodan API) for a list of specific hashes (e.g. the ones that are used on\nour company log in pages/in our products), favicons can provide a cheap and\nsimple way to detect phishing sites targeting either one’s company or its\n\n\n-----\n\ncustomers. Even if one decided not to automate them, favicon hash lookups can\nstill provide us with additional information useful, for example, for “long tail”\nthreat hunting or enrichment of other data.\n\nIn any case, if you are on the “blue” side and don’t use favicon hashes in any\nway, consider whether they might not provide you with at least some value.\n\n[1] [https://github.com/sansatart/scrapts/blob/master/shodan-favicon-hashes.csv](https://github.com/sansatart/scrapts/blob/master/shodan-favicon-hashes.csv)\n\n[2] [https://en.wikipedia.org/wiki/MurmurHash](https://en.wikipedia.org/wiki/MurmurHash)\n\n[3] [https://twitter.com/shodanhq/status/1280247570586099719](https://twitter.com/shodanhq/status/1280247570586099719)\n\n[4] [https://gist.github.com/yehgdotnet/b9dfc618108d2f05845c4d8e28c5fc6a](https://gist.github.com/yehgdotnet/b9dfc618108d2f05845c4d8e28c5fc6a)\n\n----------Jan Kopriva\n[@jk0pr](https://twitter.com/jk0pr)\n[Alef Nula](https://www.alef.com/en/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-19 - Hunting phishing websites with favicon hashes.pdf"
    ],
    "report_names": [
        "2021-04-19 - Hunting phishing websites with favicon hashes.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535668,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653710617,
    "ts_modification_date": 1653710617,
    "files": {
        "pdf": "https://archive.orkl.eu/73bc91cb2e940eea34152f1a472905d55e3b16aa.pdf",
        "text": "https://archive.orkl.eu/73bc91cb2e940eea34152f1a472905d55e3b16aa.txt",
        "img": "https://archive.orkl.eu/73bc91cb2e940eea34152f1a472905d55e3b16aa.jpg"
    }
}