{
    "id": "2210f864-47a2-4ad0-bf17-fe16ab5f9d89",
    "created_at": "2023-01-12T15:04:50.551137Z",
    "updated_at": "2025-03-27T02:05:23.327463Z",
    "deleted_at": null,
    "sha1_hash": "5985cb197327f89e002dd91f42770243ed366459",
    "title": "2020-07-01 - Alina Point of Sale Malware Still Lurking in DNS",
    "authors": "",
    "file_creation_date": "2022-05-28T04:58:10Z",
    "file_modification_date": "2022-05-28T04:58:10Z",
    "file_size": 308801,
    "plain_text": "# Alina Point of Sale Malware Still Lurking in DNS\n\n**[blog.centurylink.com/alina-point-of-sale-malware-still-lurking-in-dns/](https://blog.centurylink.com/alina-point-of-sale-malware-still-lurking-in-dns/)**\n\n[Black Lotus Labs Posted On July 1, 2020](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/alina-point-of-sale-malware-still-lurking-in-dns/#respond)\n\n0\n\nShares\n\n\nJuly 1, 2020\n\n\nAs we’ve previously written, adversaries continue to ramp up DNS-based attacks to support\na wide range of criminal activities. As part of our mission to leverage our network visibility to\nboth help protect customers and keep the internet clean, Black Lotus Labs monitors global\nDNS traffic for anomalous behavior that may be malicious. One of our machine learning\nmodels recently flagged unusual queries to the domain akamai-technologies[.]com1, and\n\n\n-----\n\nupon decoding the information contained in the subdomains of these queries, uncovered\nwhat was revealed to be credit card information being exfiltrated by the Alina Point of Sale\n(POS) malware.\n\nCredit card processing systems typically run in Windows environments, allowing them to be\ntargeted by the existing skills of the crimeware markets. Due to the strict security restrictions\napplied to credit card processing, HTTP and other common outbound traffic may be highly\nrestricted in these environments. However, DNS is often left available, and too commonly\ngoes unmonitored. This makes DNS an attractive choice for outbound communication in\nPOS malware, including the exfiltrating of stolen credit card information. Malware authors\nencode the stolen information and issue a DNS query to the actor-controlled domain name.\nThe encoded data is placed in a subdomain, which the malicious actors then extract when\nthey receive the DNS query.\n\nThe malicious actors then sell this information in underground criminal markets. The number\nof credit card numbers for sale in underground forums tripled in the second half of 2019\ncompared to the first six months of the year, making POS malware an opportunity to\nparticipate in an unfortunately thriving criminal market2.\n\n## Alina Malware Deep Dive\n\nAfter identifying the akamai-technologies[.]com domain, we found three other domains with\nsimilar DNS queries. Further research showed these domains as being used by the Alina\nPOS malware3.\n\nanalytics-akadns[.]com\n\nakamai-analytics[.]com\n\nakamai-information[.]com\n\nakamai-technologies[.]com\n\nThe POS devices that complete credit card transactions can vary greatly. They may be\nseparate hardware devices, but in smaller retail environments it may be a regular desktop\ncomputer running the POS software. During the credit card transaction, the data is typically\ndecrypted and is temporarily in the POS software’s memory in unencrypted form. The\nmalware searches the RAM of the POS device for this unencrypted credit card information\nand sends it back to a Command and Control (C2) server. To ensure that only real credit\ncard data is found when searching the RAM of the device, the malware verifies that the last\ndigit of the card number is the correct check digit4 using the Luhn checksum algorithm5.\n\n\n-----\n\nSince it was first discovered in 2012, the malware authors behind Alina have evolved their\nTactics, Techniques and Procedures (TTPs) to evade detection. While earlier samples of the\nmalware used HTTPS or a combination of HTTPS and DNS for the exfiltration of the stolen\ncredit card information, samples seen starting in late 2018 use DNS exclusively for\ncommunication3.\n\nBelow are the volume of queries Black Lotus Labs observed to each of the C2 domains since\nJanuary 2020. We can see that after a decrease in traffic in April, there has been an increase\nin traffic to all the domains, especially akamai-technologies[.]com, since the beginning of\nMay. This increase in traffic is due to queries originating from a single victim from the\nfinancial services industry.\n\nDNS queries to the C2 domains are all type A queries, meaning they are expecting an ipv4\nresponse. They all have random-looking subdomains, such as the following query:\n\nyeTLxcbvkOjr6eH_-pCYkPrDxM0.akamai-technologies[.]com\n\nBlack Lotus Labs was able to decode the encoded subdomains. First, characters that are not\nallowed in DNS queries according to the DNS protocol specification must be replaced by\ntheir original characters:\n\n“-” is replaced with “/”\n\n“_” is replaced with “+”\n\nThen the resulting subdomain can be base64 decoded, by adding trailing “=” characters if\nnecessary. Finally, this decoded data is XORed with the byte 0xAA. This XOR value was\nused in previous versions of the malware that utilized HTTP POST messages for\n\n\n-----\n\ncommunication6. Using this algorithm, we can see the exfiltrated data from the decoded\nsubdomains.\n\ncNaolE:BACKTT:2:Ping\n\nYaKNsY:BACKOFFICEz2::ddcdsrv1.exe::<Credit card digits removed>\n\nThe first six characters of the decoded queries appear to be an ID value consisting of upperand lower-case letters that is unique to each victim. Every communication from the victim\nstarts with this unique ID. This is similar to the random characters chosen by the malware as\na unique identifier in previous versions6.\n\nThe character “:” is used as a delimiter in the decoded data. Following the ID field is a\ndescriptor or location field, such as “BACKTT” or “BACKOFFICEz2” in the above data. We\nhave also observed values such as “TERMINAL1.” It is unclear what this represents, but\ngiven the names observed this may be the system name of the computers infected with the\nmalware.\n\nEach of the DNS queries uncovered are either checking in with the C2, such as the “Ping”\nquery above, or they contain credit card information. The queries that contain credit card\nnumbers contain an executable name in the field following the location or descriptor field.\nThis appears to be the process which the malware identified as containing the credit card\ninformation in memory. Earlier samples of the malware either contained a list of processes to\nexamine, or examined every process running except for those contained in a list of\nprocesses to ignore7.\n\nSome of the processes found in the decoded data, which are shown below, were seen in the\nlist of processes to examine in previous versions of the malware7.\n\nCreditCardService.exe\n\nDSIMercuryIP_Dial.exe\n\nEdcSvr.exe\n\nfpos.exe\n\nBelow are other processes we observed in the decoded data. Some of these, such as\n“ddcdsrv1.exe,” have been targeted by other POS malware .8\n\nBrain.exe\n\nFocus.exe\n\nappidt.exe\n\nddcdsrv1 exe\n\n\n-----\n\nfontdvrhost.exe\n\ntcopy.exe\n\nThe final field in the decoded data begins with the credit card number, followed by “=” and\nthe expiration date, in the following format. The final seven digits are unclear.\n\n<Credit card digits removed>=DDMMYYYY<Unknown seven digits>\n\nFor most of the queries, the response given in DNS by the actor’s authoritative name server\nis 127.0.0.1. Examining the IPs hosting the name servers for the C2 domains, we came\nacross another suspicious domain, sync-akamai[.]com. The name server for this domain was\nhosted on the same IP as ns1.akamai-analytics[.]com. While we have not seen any data\nexfiltration to this domain yet, it should be monitored as well.\n\nDNS is a popular choice for malware authors to bypass security controls and exfiltrate data\nfrom protected networks. Point of Sale malware continues to pose a serious security threat,\nand malicious actors regularly update their malware in efforts to evade detection. At Black\nLotus Labs, we use machine learning algorithms to identify data exfiltration and other\nanomalous DNS traffic. We have reached out to our customers impacted by the Alina\nmalware and the registrars of the malicious domains, and will continue to monitor the\nmalicious domains as we work to eliminate the exfiltration of data in the CenturyLink global\nDNS traffic. We recommend all organizations, including retailers using point of sale systems,\nto monitor DNS traffic for suspicious queries.\n\n## IoCs\n\nanalytics-akadns[.]com\n\nakamai-analytics[.]com\n\nakamai-information[.]com\n\nakamai-technologies[.]com\n\nsync-akamai[.]com\n\n140.82.60[.]233\n\n104.238.133[.]172\n\n144.202.59[.]50\n\n66.42.118[.]249\n\n198.54.117[.]197\n\n\n-----\n\n198.54.117[.]198\n\n198.54.117[.]199\n\n198.54.117[.]200\n\nfd0e0f20ba1408080d0ff055aaac416a4ac53e958c0d2ec53de076787c125272\n\nc01a7be3a05a1971acffea1e8399f18ed627277321236a497700bbf32c08ec3c\n\nfd0e0f20ba1408080d0ff055aaac416a4ac53e958c0d2ec53de076787c125272\n\nc01a7be3a05a1971acffea1e8399f18ed627277321236a497700bbf32c08ec3c\n\n23668f38b9a10859302070a606cabd313e1b84ed5be81bd26c2d9bda29ebffa9\n\nc55b2f3b67108a58c4cb81c3550115956cb07139e39a37ce9eb57ff4fb41d832\n\n804559ea57381bd6c2301d0c9393cf3768e54455ece74acdb99bb307f80494eb\n\n83e3df5ec961ce9b24588ba95025ce94e34c319a8afa30fab2b7cca10c0ef904\n\nc7d23247432db58196e46661d9abe440a36d478fe9142da1ed73c37978e905c0\n\nda4f5802f333e96e2263080e8b8cf50db25aaab98d883f85724df63ce7111e12\n\n30feb4ec6cab08452f5fa15e6c07df09777b90c4557f23e5be56eed433278800\n\n6c6166c356ee2f92b32ad597edcdb34309ba4e7b281801b85fab95a6543a97db\n\nc0b4ab7a897102ceea5ce82a36018cb5d20806dd47db61484c4ea8e331a423c7\n\n0ae4740e74f7350adb13b23e5a2094b2821aafb49ec122a789b1e98ee93458fd\n\nThis information is provided “as is” without any warranty or condition of any kind, either\nexpress or implied. Use of this information is at the end user’s own risk.\n\n1 The domains that experienced the suspicious DNS traffic were neither owned nor\nmanaged by Akamai. As of the date of this publication, Akamai was actively collaborating\nwith Black Lotus Labs to take down the imposter domains.\n\n2 [https://blog.cybersixgill.com/dark-web-financial-fraud-2019](https://blog.cybersixgill.com/dark-web-financial-fraud-2019)\n\n3 https://usa.visa.com/dam/VCOM/global/support-legal/documents/visa-security-alert-alinapos-malware.pdf\n\n4 [https://twitter.com/VK_Intel/status/1123463742958768128](https://twitter.com/VK_Intel/status/1123463742958768128)\n\n\n-----\n\n[5 https://en.wikipedia.org/wiki/Luhn_algorithm](https://en.wikipedia.org/wiki/Luhn_algorithm)\n\n6 https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/alina-pos-malwaresparks-off-a-new-variant/\n\n7 [https://www.pandasecurity.com/mediacenter/pandalabs/alina-pos-malware/](https://www.pandasecurity.com/mediacenter/pandalabs/alina-pos-malware/)\n\n8 https://www.proofpoint.com/us/threat-insight/post/ostap-bender-400-ways-makepopulation-part-with-their-money\n\n[Black Lotus LabsCybersecurityCybersecurity AttacksMalware](https://blog.lumen.com/tag/black-lotus-labs/)\n\nAuthor\n\n**Black Lotus Labs**\n\nThe mission of Black Lotus Labs is to leverage our network visibility to help protect\ncustomers and keep the internet clean.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-01 - Alina Point of Sale Malware Still Lurking in DNS.pdf"
    ],
    "report_names": [
        "2020-07-01 - Alina Point of Sale Malware Still Lurking in DNS.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535890,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653713890,
    "ts_modification_date": 1653713890,
    "files": {
        "pdf": "https://archive.orkl.eu/5985cb197327f89e002dd91f42770243ed366459.pdf",
        "text": "https://archive.orkl.eu/5985cb197327f89e002dd91f42770243ed366459.txt",
        "img": "https://archive.orkl.eu/5985cb197327f89e002dd91f42770243ed366459.jpg"
    }
}