{
    "id": "22a9141f-6492-4488-a136-4fdc13f8ec41",
    "created_at": "2023-01-12T15:07:37.020389Z",
    "updated_at": "2025-03-27T02:12:11.0699Z",
    "deleted_at": null,
    "sha1_hash": "b1f3f7700f1677f0f1e0c8e0ea161c7f8007306d",
    "title": "2020-12-18 - TeamTNT Now Deploying DDoS-Capable IRC Bot TNTbotinger",
    "authors": "",
    "file_creation_date": "2022-05-28T00:42:08Z",
    "file_modification_date": "2022-05-28T00:42:08Z",
    "file_size": 185717,
    "plain_text": "# TeamTNT Now Deploying DDoS-Capable IRC Bot TNTbotinger\n\n**[trendmicro.com/en_us/research/20/l/teamtnt-now-deploying-ddos-capable-irc-bot-tntbotinger.html](https://www.trendmicro.com/en_us/research/20/l/teamtnt-now-deploying-ddos-capable-irc-bot-tntbotinger.html)**\n\nDecember 18, 2020\n\n[Earlier this year, we saw how the cybercrime group TeamTNT attacked exposed Docker APIs using the XMRig cryptocurrency miner. Over](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\ntime, we observed how TeamTNT expanded the functionality of its attacks, which has come to include the stealing of Amazon Web Services\n(AWS) secure shell (SSH) credentials and a self-replicating behavior for propagation.\n\nHere we discuss TeamTNT’s latest attack, which involves the use of the group’s own IRC (Internet Relay Chat) bot. The IRC bot is called\nTNTbotinger and is capable of distributed denial of service (DDoS).\n\nIt’s important to note that the attackers must first be able to perform remote code execution (RCE) on the initial target machine in order to\nsuccessfully wage this attack on a system. Malicious actors can perform RCE by exploiting misconfiguration issues, abusing unpatched\n[vulnerabilities, and taking advantage of security flaws such as weak or reused passwords and keys, or leaked credentials.](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/vulnerability)\n\n## Technical analysis\n\nThe initial spread starts with a malicious shell script that’s run on a victim machine. The shell script checks for the presence of the\n_/dev/shm/.alsp file, which can also be an indicator of compromise. If the file is not found, the script starts doing its job._\n\nFigure 1.\n\nThe malicious script checks for the presence of the /dev/shm/.alsp file in a system\nThe script will then try to install curl, wget, bash, make, gcc, and pnscan packages.\n\nFigure 2. The malicious script attempts to install curl, wget, make, gcc, and pnscan packages\nBecause of the package managers used in the malicious script, specifically apt-get and yum, we assume that the authors implemented support\nfor both Debian and Red Hat-based distributions of Linux.\n\nThe script will then attempt to download and execute multiple binaries, including pnscan, a tool used for port scanning. This tool is also\ndownloaded manually in case it is not found in the expected directory.\n\nThe following are the executed binaries in this attack:\n\n\n-----\n\n/de /s /sb\n/usr/bin/tshd\n/usr/bin/kube\n/usr/bin/bioset\n\nAfterward, the script steals several pieces of confidential information from the infected system, such as:\n\nRSA (Rivest-Shamir-Adleman) keys used for SSH access (AWS path included)\nBash history\nAWS and Docker configuration files\n/etc group, /etc/passwd, /etc/shadow, /etc/gshadow\n\n[The malicious actors will then upload this stolen information using a TGZ (tar.gz) file via an HTTP POST request to an attacker-provided URL.](https://www.winzip.com/win/en/tgz-file.html#:~:text=A%20TGZ%20file%20is%20a,for%20easier%20distribution%20or%20backup.&text=TGZ%20file.)\nWe suspect that the collected information will serve as a knowledge base for the improvement of subsequent attacks.\n\nFigure 3. Stolen information from an infected machine is uploaded via a TGZ file to a malicious URL\nThe script also tries to find accessible devices, based on the output of the ip route command, which would show routes to accessible networks.\nThis information is then passed to the pnscan tool for a scan of the active SSH daemons on the network. The keys found on the system are\nused for authentication attempts on the newly discovered devices. If these attempts are successful, the same payload is deployed on the new\ndevices and the attack propagates.\n\nFigure 4. The malicious script performs a scan of active SSH daemons on an infected network and attempts to use stolen keys to access\nnetwork-connected devices\n\n\n-----\n\n## A closer look at relevant binaries\n\nThe binary target platform is CPUs based on the x86-64 instruction set. The first layer of all these binaries is packed by the well-known UPX\npacker.\n\n**/dev/shm/sbin**\n\nThe binary is compiled using the Go compiler and contains an ELF (Executable and Linkable Format) file that uses AES (Advanced Encryption\nStandard) encryption. We presume that the packer used is a Go version of LaufzeitCrypter.\n\nFigure 5. A Go-compiled binary that contains an\n\nAES-encrypted ELF file\nAfter decrypting the file, we found the binary’s final payload: an XMRig cryptocurrency miner.\n\n**/usr/bin/tshd**\n\nThis bind shell listens on TCP (Transmission Control Protocol) port 51982. The communication is encrypted with a hard-coded key.\n\nFigure 6. The bind shell that listens on TCP\n\nport 51982\n**/usr/bin/bioset**\n\n[This is a bind shell that listens on TCP port 1982. The communication is encrypted using the Blowfish encryption algorithm with a hard-coded](https://www.schneier.com/academic/blowfish/)\nkey. After analysis, we discovered that this implementation does not work correctly on some platforms. The binary also renames its process\nname to systemd.\n\n\n-----\n\nFigure 7. The bind shell that listens on TCP port 1982\n**/usr/bin/kube**\n\nThis binary is Go-compiled and contains an AES-encrypted ELF file. This is dynamically loaded during execution, and the same packer with\nthe Go version of LaufzeitCrypter is used. The AES key and initialization vector (IV) are hard-coded in the binary.\n\nThe final payload of this binary is an IRC bot, which the authors named TNTbotinger. This bot features the following DDoS\ncommands:\n\n**DDoS command** **Function**\n\nPAN <target> <port> <secs> An advanced SYN flooder that kills most network drivers\n\nUDP <target> <port> <secs> A UDP (User Datagram Protocol) flooder\n\nUNKNOWN <target> <secs> Nonspoof UDP flooder\n\nRANDOMFLOOD <target> <port> <secs> A SYN-ACK flooder\n\nNSACKFLOOD <target> <port> <secs> A new-generation ACK flooder\n\nNSSYNFLOOD <target> <port> <secs> A new-generation SYN flooder\n\nSYNFLOOD <target> <port> <secs> A classic SYN flooder\n\nACKFLOOD <target> <port> <secs> A classic ACK flooder\n\n\n-----\n\nGETSPOOFS A command that gets the current spoofing\n\nSPOOFS <subnet> A command that changes spoofing to a subnet\n\nKILLALL A command that kills all current packeting\n\nTNTbotinger also has the following IRC bot commands:\n\n**IRC bot command** **Function**\n\nNICK <nick> Changes the nickname of the client\n\nSERVER <server> Changes servers\n\nIRC <command> Sends a command to the server\n\nDISABLE Disables all packeting from the client\n\nENABLE Enables all packeting from the client\n\nKILL Kills the client\n\nVERSION Requests the version of the client\n\nHELP Displays the help file\n\nGET <http address> <save as> Downloads a file from the web and saves it to a disk\n\nUPDATE <http address> <src:bin> Updates the bot\n\nHACKPKG <http address> <bin name> Installs a binary with no dependencies\n\nThis bot also features the following Unix shell commands:\n\n**Unix shell command** **Function**\n\nSH <command> Executes a command\n\nISH <command> Enables the facilities of an operating system to be made available to interactive users\n\nSHD <command> Executes a daemonized command\n\nBASH <command> Executes a command using Bash (if applicable)\n\nSYSINFO Collects information and reports about system configuration, setup, and usage\n\nRSHELL <server> <port> Opens remote shell\n\n## Conclusion and security recommendations\n\nThe Linux threat landscape is constantly evolving. This latest attack from TeamTNT is a good example of how the whole network segment,\nincluding the cloud, could be compromised by malicious actors. We are seeing just how serious they are in ensuring the increased success\nrates and stability of their attacks, as evidenced here by TeamTNT’s use of the wget/curl binaries for payload deployment and use of bind shell\nredundancy.\n\n\n-----\n\na success u bot ge attac, attac e s be ab e to t ate a ected syste O ce s de, t ey be ab e to see u e ab e\ninstances on accessible network segments, and they can perform RCE on devices that are supposed to be shielded from the outside world.\n\nIt’s important for enterprises to adopt stringent security practices such as the following to keep their systems secure:\n\n[Implement policies that prioritize continuous monitoring and auditing of devices, especially those used to access the office network.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/automating-security-continuous-monitoring-and-auditing-in-devops)\n[Adhere to the principle of least privilege when granting permissions.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/securing-the-4-cs-of-cloud-native-systems-cloud-cluster-container-and-code)\n[Regularly patch and update systems to reduce exposure to vulnerabilities and other critical threats.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/vulnerabilities-and-exploits/virtual-patching-patch-those-vulnerabilities-before-they-can-be-exploited)\nEnsure that [passwords are strong.](https://blog.trendmicro.com/are-your-passwords-secure-enough/) [Change default passwords and adjust security settings based on the enterprise’s needs.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/internet-of-things/the-first-steps-in-effective-iot-device-security)\n\n## Trend Micro solutions\n\nThe [Trend Micro Network Defense solution preserves the integrity of networks, prevents breaches and targeted attacks, and ensures that](https://www.trendmicro.com/en_us/business/products/network.html)\ncritical data, communications, intellectual property, and other intangible assets are not exploited by malicious actors. It provides a nextgeneration intrusion prevention system (IPS), anomaly detection, custom sandbox analysis, and threat insight.\n\n[Cloud-specific security solutions such as Trend Micro Hybrid Cloud Security can help protect cloud-native systems and their various layers. It’s](https://www.trendmicro.com/en_us/business/products/hybrid-cloud.html)\n[powered by the Trend Micro Cloud One™ security services platform for cloud builders, which provides automated protection for the continuous](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-migration-security.html)\nintegration and continuous delivery (CI/CD) pipeline and applications. It also helps identify and resolve security issues sooner and improve\ndelivery time for DevOps teams. The Trend Micro Cloud One platform includes:\n\n[Workload Security: runtime protection for workloads](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-workload-security.html)\n[Container Security: automated container image and registry scanning](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-container-image-security.html)\n[File Storage Security: security for cloud file and object storage services](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-file-storage-security.html)\n[Network Security: cloud network layer IPS security](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-network-security.html)\n[Application Security: security for serverless functions, APIs, and applications](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-application-security.html)\n[Conformity: real-time security for cloud infrastructure — secure, optimize, comply](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-conformity.html)\n\n## Indicators of compromise\n\n\n**File**\n**name**\n\n\n**Functionality** **SHA-256** **Trend Micro detection**\n\n\nSSH Shell script\ndropper,\nuploader\n\n\nD9C46904D5BB808F2F0C28E819A31703F5155C4DF66C4C4669F5D9E81F25DC66 Trojan.SH.MALXMR.UWEKQ\n\n\nsbin XMRig E52646F7CB2886D8A5D4C1A2692A5AB80926E7CE48BDB2362F383C0C6C7223A2 Trojan.Linux.BTCWARE.A\n\n\ntshd Bind shell\n\n(TCP port\n51982)\n\n\n252BF8C685289759B90C1DE6F9DB345C2CFE62E6F8AAD9A7F44DFB3C8508487A Backdoor.Linux.REKOOBE.AA\n\n\nkube IRC bot B666CD08B065132235303727F2D77997A30355AE0E5B557CD08D41C9ADE7622D Trojan.Linux.MALXMR.UWEKY\n\n\nbioset Bind shell\n(TCP port\n1982)\n\nMalware\n\n\nE15550481E89DBD154B875CE50CC5AF4B49F9FF7B837D9AC5B5594E5D63966A3 Trojan.Linux.MALXMR.UWEKW\n\n\nWe discuss TeamTNT’s latest attack, which involves the use of the group’s own IRC (Internet Relay Chat) bot. The IRC bot is called\nTNTbotinger and is capable of distributed denial of service (DDoS).\n\nBy: David Fiser December 18, 2020 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-18 - TeamTNT Now Deploying DDoS-Capable IRC Bot TNTbotinger.pdf"
    ],
    "report_names": [
        "2020-12-18 - TeamTNT Now Deploying DDoS-Capable IRC Bot TNTbotinger.pdf"
    ],
    "threat_actors": [
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536057,
    "ts_updated_at": 1743041531,
    "ts_creation_date": 1653698528,
    "ts_modification_date": 1653698528,
    "files": {
        "pdf": "https://archive.orkl.eu/b1f3f7700f1677f0f1e0c8e0ea161c7f8007306d.pdf",
        "text": "https://archive.orkl.eu/b1f3f7700f1677f0f1e0c8e0ea161c7f8007306d.txt",
        "img": "https://archive.orkl.eu/b1f3f7700f1677f0f1e0c8e0ea161c7f8007306d.jpg"
    }
}