{
    "id": "231044bd-eebd-43db-a7c3-8ea81c5b276d",
    "created_at": "2022-10-25T16:48:10.868543Z",
    "updated_at": "2025-03-27T02:05:43.051847Z",
    "deleted_at": null,
    "sha1_hash": "bcbd65daf124728e6731e0decb7b4e01b64864dc",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-09-06T04:08:51Z",
    "file_modification_date": "2019-09-06T04:08:51Z",
    "file_size": 2410422,
    "plain_text": "[Trend Micro](https://www.trendmicro.com/)\n[About TrendLabs Security Intelligence Blog](https://blog.trendmicro.com/trendlabs-security-intelligence/about-us/)\n\n[Home  »  Bad Sites  »  ‘Heatstroke’ Campaign Uses Multistage Phishing Attack to Steal PayPal and Credit](https://blog.trendmicro.com/trendlabs-security-intelligence/)\nCard Information\n\n# ‘Heatstroke’ Campaign Uses Multistage Phishing Attack to Steal PayPal and Credit Card Information\n\n[Posted on:August 29, 2019 at 6:45 am](https://blog.trendmicro.com/trendlabs-security-intelligence/2019/08/)\n[Posted in:Bad Sites, Spam](https://blog.trendmicro.com/trendlabs-security-intelligence/category/bad-websites/)\nAuthor:\n[Trend Micro](https://blog.trendmicro.com/trendlabs-security-intelligence/author/trend-micro/)\n\n0\n\n**_By Jindrich Karasek (Threat Researcher)_**\n\nDespite having an apparent lull in the first half of 2019, phishing will remain a staple in a cybercriminal’s\narsenal, and they’re not going to stop using it. The latest example is a [phishing campaign dubbed Heatstroke,](https://www.trendmicro.com/vinfo/us/security/news/phishing)\nbased on a variable found in their phishing kit code. Heatstroke [demonstrates how far phishing techniques](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/the-rising-tide-of-credential-phishing)\nhave evolved — from merely mimicking legitimate websites and using [diversified social engineering tactics](https://www.trendmicro.com/vinfo/us/security/news/security-technology/new-phishing-campaign-uses-onenote-audio-to-lure-users-to-fake-microsoft-login-page)\n— with its use of more sophisticated techniques such as steganography.\n\nThe way Heatstroke’s operators do research on their potential victims is notable. They aim for their victim’s\nprivate email addresses, which they most likely collected from the victim’s own address list, which also\nincludes managers and employees in the technology industry. Private email addresses are more likely to be\nhosted on free email services with lax security and spam filtering. They’re also usually used as verification\nfor social media and e-commerce websites, as well as backups for Gmail and business accounts. Gmail\naccounts are particularly interesting; attackers that gain access to these accounts can also access the victim’s\nGoogle Drive, and, under certain circumstances, potentially compromise the Android device linked to the\naccount. These free email accounts could thus serve as better starting points for attackers to reconnoiter and\ngather intelligence on their targets compared to business emails, which are typically more secure.\n\n**Heatstroke’s attack chain**\n\nHeatstroke’s operators appear to have used these countermeasures to hide their trails:\n\n**_Multistage phishing attack. To avoid suspicion, the attackers do not hurry or spread their attack over_**\nmultiple screens/pages. Compared to a usual phishing attack that would employ a single landing page,\n\n\n-----\n\nvictim into thinking nothing is amiss.\n**_Obfuscated trails. The phishing kit’s content is forwarded from another location, but masked to appear_**\nas if it was on the landing page itself. The landing page also constantly changes to bypass content\nfilters. The phishing kit can also block certain IP ranges, crawling services, and even security tools\nsuch as vulnerability scanners. If a user tries to connect from a location, browser, IP address, or country\nthat the attackers blacklisted, the page will not show the content (serving an HTTP 404 error) or the\ncontent is forwarded from somewhere else. The first page of the phishing kit is generated by PHP script\nencoded in Base64 to avoid or bypass firewalls.\n**_Phishing as a service. We saw a different group purchase the kit for their own phishing attacks. The_**\nkit’s developer even assigned his own API key to this group. This suggests that these activities have\ncustomer, operator, and developer roles.\n**_Self-aware phishing kit. The whole phishing page’s content is generated dynamically based on_**\nuser/visitor properties. The site’s source code contains a fairytale story. This could be the developer\nshowing that he knows researchers look at his source code.\n**_Attempts to appear legitimate. A phishing attack will be sent from the domain based on the victim’s_**\ncountry of origin. In some of the cases that we analyzed, the domain used for the attack used to belong\nto a legitimate business that was later put up for sale.\n\nThe stolen credentials are sent to an email address using steganography (hiding or embedding data into an\nimage). Over the course of our research, we were able to capture two similar phishing kits — one for\nAmazon users and the second for stealing PayPal credentials. Our analysis in this post delves into the latter,\nas we were able to capture most of its components.\n\nThe two kits’ tactics and techniques were similar, from the website hosting the phishing kit and the type of\ninformation they stole to the masking techniques used. Both kits also seemingly end in the same user\nverification phase. These similarities could mean that they have the same origin. The similarity could also be\nbuoyed by the timing and scope of the attacks that used these kits, as they were delivered to the same victim.\n\nFigure 1. Infection chain of Heatstroke’s phishing attack; note that the infection chain could change\n\ndepending on user/behavior properties\n\n**Heatstroke’s infection chain**\n\nIn this phishing attack’s case, the infection chain is dynamic, which means certain routines change depending\non user/behavior properties. This is the overall attack chain we observed during our research:\n\n1. The attacker sends a phishing email asking the user to verify his account. The email is sent from a\n\nlegitimate domain to avoid being blocked by spam filters.\n2. The user is prodded to click the button/URL in the phishing email in order to verify his account on\n\nPayPal (and Amazon). As per the code in the phishing kit’s htaccess file, the phishers appear to plan to\n\n\n-----\n\nservices).\n3. The user is redirected to a first-stage website, which varies. The website is designed to redirect the\n\nvictim to the phishing kit’s website, enabling the attacker’s phishing attempt to slip through content\nfilters.\n4. The first-stage website redirects the user to a second-stage site, which is the actual phishing kit website.\n\nThis stage is for validation. It checks if the user is not a bot, a web crawler, or a security tool like\nNessus. It also checks if the user comes from certain sites, like the FBI’s domain, and if the user’s IP is\nnot in its range of blocked IP addresses.\n5. Once all the checks are done, the user is diverted to a third-stage website, which is the actual phishing\n\nsite. The phishing content is generated from a Base64-encoded PHP script to bypass firewalls. The\ncontent is also localized depending on the victim’s IP address.\n6. The user is asked to fill the information fields, which includes email credentials, credit card details and\n\nother personally identifiable information (PII). The information is coded into an image that is sent to\nthe phisher-owned email address. The attackers also collect information on the user’s system OS.\n7. Once the user fills all the information fields and clicks the last button, nothing will happen. If the user\n\ntries to visit the website with the phishing kit with the same IP and settings, the website will not load\nthe phishing kit.\n\n**Technical analysis of Heatstroke’s phishing kit**\n\nThe session starts from the script index.php in the main directory, which is base64-encoded, as seen in Figure\n2. The script checks the visitor’s IP address by using, ironically, an online anti-fraud service. If the service\nhas banned or blacklisted the visitor’s IP address, the phishing kit will prevent the visitor from seeing the\ncontent. It also shows how the session key is being composed from various variables. This session key\nvariable identifies each victim and used in the attack’s later stages.\n\nFigure 2. Base64-encoded (left) and decoded (right) code of the script that determines if the user would be\n\nserved phishing content\n\nThe phishing kit’s content is served once the visitor passes the validation checks. The link\nhxxps://www[.]posicionamientowebeconomico[.]es/wp-includes/css/signin[.]html (a second-stage site), for\nexample, will appear as if it’s redirecting the user to an account validation page, but is, in fact, diverting the\nuser to a malicious site that will phish for credentials.\n\nAs the content for the user is being loaded from the other source (as per the setting in the ./htaccess file which\nlists rulesets for the visitor’s restrictions), the user will be redirected to a phishing site,\n_hxxps://raisingtwo[.]com/INC/signin/-/PPL-ID/app/signin. The page asks the user to enter an email address_\nand the email address password. The information field has content validation mechanisms and allows only a\nlegitimate email address format to be keyed in.\n\n\n-----\n\nFigure 3. The phishing pages that ask the user to validate his account with an email address and password\n\nThe page dynamically generates phishing content via a PHP script. Its source code, when viewed on a\nbrowser (shown in Figure 4), actually contains folk stories, possibly as a joke to researchers trying to analyze\nit.\n\nFigure 4. Code snippets of the PHP script that generates the phishing page (top), and a screenshot of the\n\npage’s source when viewed on a browser (bottom)\n\nThe following files/components are also part of the phishing content served to the user:\n\n_antiX.php — X is a single digit varying from 1-8. This code contains some guidance on how to_\navoid/block web scanners, vulnerability and security research tools, crawlers and certain IP addresses,\nand preventing them from visiting the phishing site.\n_Index.php — Included in antiX.php, which helps collect user information (e.g., via getOs, getBrowser)._\n_langauges.php — A variable file that serves localized content to the phishing page._\n_Algo.php — Helps parse the browser and OS names to a standardized format._\n_Mine.php — Lists the settings that the phishing kit’s creator preset for his client, including the API key_\nand security API key.\n\nFigure 5. Code snippets of antiX.php (left and center), and the information fields set in the phishing site\n\n(right)\n\n**How Heatstroke steals payment information**\n\nO th h id d hi il d d th hi hi kit th t tifi th f\n\n\n-----\n\nuser also generated by the kit also shows the folk tale (Figure 7).\n\nFigure 6. Screenshot of the phishing page displaying a notice of unusual activity (left). The page redirects the\n\nuser to another page (right) that will steal the user’s credit card information\n\nFigure 7. The source code of the phishing content generated by the PHP script (top) asking for credit card\n\ninformation\n\nThe file process.php contains code for blocking unwanted users from visiting the phishing page. This is\npresent in every page generated from when the user is redirected to the first-stage phishing site, along with\nvalidation checks in each of the information fields in the form.\n\nAfter the user fills the form and clicks “Save,” nothing seemingly happens on the website. Behind the scenes,\nhowever, the phishing kit sends the data to the phishers. The phishing kit validates the credit card number by\nabusing a publicly accessible web service that looks up credit and debit card metadata. Once it validates the\ncredit card number, the last screen shown to the user will be a redirection to a shortened URL that leads to the\nlegitimate/actual Paypal login page.\n\n**Deeper dive into the phishing kit’s dynamics**\n\nWe were able to identify the phishing kit’s developer and customer from its text strings. Further research\nshowed that the Heatstroke’s admins could at least speak Czech, English, Spanish, and Indonesian. Figure 8\nshows the kit’s configuration settings, with information that the developer added for each setting.\n\nFigure 8. Screenshot showing the phishing kit’s configuration settings (left) and code snippet of the ./htaccess\n\nfile showing how it redirects unwanted visitors, such as those using the FBI’s domain, to another site (right)\n\nAs mentioned earlier, the phishing kit has measures to deter unwanted visitors through a blacklist. The\n_anti.php script, for example, is used to redirect blacklisted users to another website, hxxp://2m[.]ma/ar/, when_\nthe validation process fails. The blacklist includes whole blocks of IP addresses, referrers, strings like\n“Google,” and user agents.\n\n\n-----\n\nThe kit sends pilfered data to addresses on a possibly attacker-owned domain. It sends different data to\ndifferent emails using two methods for each step of the phishing attack. The first method involves the use of\nregular email to send the stolen data (via step6.php), as shown in Figure 9.\n\nFigure 9. Code snippets showing how the stolen data is sent to the phishers: via email (top) and\n\nsteganography (bottom)\n\nThe second method uses steganography (embedding data in an image) by encoding the stolen data into an\nimage, encrypting it, and then emailing it to the phisher. However, we found that the complete code for this\nfunction was missing, thus the code capture was incomplete. It’s also possible that the function is still in\ndevelopment, or the developer did not provide it. Also of note was a directory in the phishing kit, named\n“proof,” which contained two .img files, with MD5 hashes as filenames. The images, an example of which is\nin Figure 10, have similar visual motifs. Binary analysis of the phishing kit also showed that the ASCI strings\nwere actually dummies or placeholders, likely to demonstrate the kit’s capability to potential customers.\n\n\n-----\n\nFigure 10. A sample image embedded with stolen data via steganography (top), and screenshot of ASCI\n\nstrings (bottom)\n\n**Best practices and Trend Micro solutions**\n\nThe fact that Heatstroke’s developer is apparently adopting the phishing-as-a-service business model means\nother cybercriminals will bank on this phishing kit for their own attacks to steal PII and payment data. We\nalso expect this phishing campaign to incorporate more techniques that can evade detection and deter\nanalysis, such as steganography (albeit incomplete for now) and blacklisting. Users and businesses should\nimprove their cybersecurity [awareness, particularly against socially engineered](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/best-practices-identifying-and-mitigating-phishing-attacks) [email-borne threats.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\n\n[Trend Micro™](https://www.trendmicro.com/en_us/forHome/products.html) [Smart Security, Smart](https://www.trendmicro.com/en_us/forHome/products.html) [Smart Protection Suites and](https://www.trendmicro.com/us/business/complete-user-protection/index.html) [Worry-Free™](https://www.trendmicro.com/us/small-business/product-security/) [Business Security protect](https://www.trendmicro.com/us/small-business/product-security/)\nusers and businesses from Heatstroke’s phishing attacks by detecting malicious files and\nspammed messages and blocking related malicious URLs.\n\n**_Indicators of Compromise (IoCs):_**\n\n**Trend Micro**\n**File Name** **SHA-256**\n\n**Detection**\n\n\n587368b3f679083010690cbc15df64\nbin\n7a045f62f02ca86495d704d24fdb2eb5d6\n\n\nTrojan.PHP.PHIS\nHKIT.B\n\n\nRelated URLs:\n\n\n-----\n\nhxxps://posicionamientowebeconomico[.]es/wp includes/\nhxxp://raisingtwo[.]com/INC/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.08.29.Heatstroke_Campaign/Heatstroke%20Campaign%20Uses%20Multistage%20Phishing%20Attack%20to%20Steal%20PayPal%20and%20Credit%20Card%20Information.pdf"
    ],
    "report_names": [
        "Heatstroke Campaign Uses Multistage Phishing Attack to Steal PayPal and Credit Card Information"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1567742931,
    "ts_modification_date": 1567742931,
    "files": {
        "pdf": "https://archive.orkl.eu/bcbd65daf124728e6731e0decb7b4e01b64864dc.pdf",
        "text": "https://archive.orkl.eu/bcbd65daf124728e6731e0decb7b4e01b64864dc.txt",
        "img": "https://archive.orkl.eu/bcbd65daf124728e6731e0decb7b4e01b64864dc.jpg"
    }
}