{
    "id": "2340868d-914f-450e-8bd5-a0273aad5c15",
    "created_at": "2023-01-12T15:10:44.200417Z",
    "updated_at": "2025-03-27T02:08:41.071813Z",
    "deleted_at": null,
    "sha1_hash": "e6a86f79d39df6c4e7abb4ae32b52f24f319ed4d",
    "title": "2019-12-10 - [Updated] Alert Regarding Emotet Malware Infection",
    "authors": "",
    "file_creation_date": "2022-05-28T03:38:04Z",
    "file_modification_date": "2022-05-28T03:38:04Z",
    "file_size": 1321815,
    "plain_text": "# [Updated] Alert Regarding Emotet Malware Infection\n\n**jpcert.or.jp/english/at/2019/at190044.html**\n\nlast update: 2019-12-10\n\nJPCERT-AT-2019-0044\n\nJPCERT/CC\n\n2019-11-27(Initial)\n\n2019-12-10(Update)\n\n**I. Overview**\n\nSince the second half of October 2019, JPCERT/CC has been receiving reports regarding\nEmotet malware infection. Many of the reports were from victims who had received emails\nwith a malicious Word format file attachment, impersonating a legitimate organization or\nperson.\n\nFollowing this situation, in order to prevent further impact caused by Emotet malware,\nJPCERT/CC decided to publish this alert to share the primary infection vector of Emotet and\nits impact, as well as some tips on how to detect and defend against Emotet infection, and\nhow to respond once the infection is confirmed.\n\nUpdate: December 2, 2019 Update\n\n\n-----\n\nJPCERT/CC published a blog on JPCERT/CC Eyes that summerized the FAQ for Emotet\nmalware. Please also refer to this blog for more information.\n\nJPCERT/CC Eyes\nFAQ for Emotet malware handling\n[https://blogs.jpcert.or.jp/ja/2019/12/emotetfaq.html](https://blogs.jpcert.or.jp/ja/2019/12/emotetfaq.html)\n\n**II. Attack Vector**\n\nCases of Emotet infection that JPCERT/CC is aware of are mostly triggered by executing a\nmalicious Word format file and then\"enabling content\" of the document. Following is an\nexample image of emails which may lead to Emotet malware infection.\n\n\n-----\n\n[Image 1: Email Example]\n\nSome emails attached with a Word format file that lead to Emotet infection are created based\non information stolen by Emotet. There are other cases that the message body contains the\nemails exchanged in the past and appears to be a reply to existing email thread.Therefore, it\nis necessary to be careful of these emails as they may have been sent from the attacker side\nusing the information stolen by Emotet, although they appear to be sent from existing\nbusiness partner personnel.\n\nThe attached file contains information that prompts you to enable the content, and Emotet\nwill be downloaded once it is enabled.Depending on the Microsoft Word settings, Emotet\nmay be downloaded without the warning.\n\n\n-----\n\n[Image 2: Attachment File Example]\n\nUpdate: December 10, 2019 Update\n\nSince around December 6, 2019, JPCERT/CC has observed emails with URL link in the\nbody of the message, which lead to Emotet infection.Once a recipient clicks the URL link in\nthe email body, a Word format file is downloaded. Then Emotet is downloaded if the recipient\nenables the content after opening the file.\n\n\n-----\n\n[Image 4: Email Example] It is recommended to stay alerted for emails with URL link in the\nmessage body such as above, and not to click the URL link. Attack vectors of Emotet have\nbeen changed and may change in the future.Therefore, regardless of previous Emotet attack\nvectors, we would recommend not to execute an attachment file or click URL links on\nsuspicious emails. Also, it is important to keep the emergency point of contact and reporting\nstructure in your organization up-to-date.\n\n**III. Impact**\n\nWhen infected with Emotet, the following events may occur.\n\n- Authentication information such as passwords stored on the device or browser may be\nstolen\n\n- Emotet infection may spread within the network by leveraging SMB exploits by using the\nstolen passwords\n\n\n-----\n\n- Email account and its password may be stolen\n\n- Email text and address book information may be stolen\n\n- Stolen email account and body texts may be exploited to send malicious emails\n\nUpon Emotet infection, information is stolen from the infected device, and then emails that\nspread the infection to customers and business partners might be delivered from the\nattackers'infrastructure. In addition, if the infected device remains in the organization, it could\nbe exploited by attackers as a bot and send a large amount of suspicious emails to external\nnetwork.\n\n**IV. Countermeasures**\n\nPlease consider the following actions to prevent Emotet infection and minimize damage\ncaused by the infection.\n\n- Raise awareness in your organization through alert and advisory\n\n- Disable automatic execution of Word macro *\n\n- Detection of emails attached with malware by introducing email security products\n\n- Enable email audit log\n\n- Regularly apply OS patches (measures against spreading infection with SMB\nvulnerabilities)\n\n- Obtain periodic offline backup (measures against targeted ransomware attacks)\n\n- Select \"Disable all macros with notification\" in the Microsoft Office Trust Center Macro\nSettings.\n\n\n-----\n\n[image 3: Microsoft Office Trust Center Macro Settings]\n\n**V. Post infection**\n\nIn addition to the case where anti-virus software used in your organization detects and\ndiscovers the Emotet infection, if either of the following situations is confirmed, one or more\ndevices in the organization may be infected with Emotet.\n\n- You are informed by an external organization that they received an email that appears to be\ncoming from your organization's email address with an attached Word format file\n\n- You check your organization's mail server, etc. and confirm that a large number of emails\nwith Word format attachment or spoofed emails have been sent\n\nIf Emotet infection is confirmed in a device or system of your organization, it is recommended\nto take the following actions as an initial response in order to prevent further impact.\n\n- Isolate the infected device from the network\n\n- Change the password of the email account used in the infected device\n\n\n-----\n\nThen, the following investigations and actions should be considered after consulting with a\nsecurity vendor as necessary.\n\n- Scan all devices in the organization with anti-virus software\n\n- Change the password of accounts that are used in the infected device\n\n- Monitor network traffic logs\n\n- Initialize the infected device after investigation\n\n**VI. References**\n\nUS-CERT\n\nAlert (TA18-201A) Emotet Malware\n\n[https://www.us-cert.gov/ncas/alerts/TA18-201A](https://www.us-cert.gov/ncas/alerts/TA18-201A)\n\nAustralian Cyber Security Centre (ACSC)\n\nAdvisory 2019-131a: Emotet malware campaign\n\n[https://www.cyber.gov.au/threats/advisory-2019-131a-emotet-malware-campaign](https://www.cyber.gov.au/threats/advisory-2019-131a-emotet-malware-campaign)\n\nIf you have any information regarding this alert, please contact JPCERT/CC.\n\nUpdate: December 6, 2019 Update\n\nWe corrected the TEL number below as it was incorrect. We apologize for any inconvenience\ncaused.\n\nRevision History\n\n2019-11-27 First edition\n\n2019-12-02 Updated \"I. Overview\"\n\n2019-12-06 Updated TEL number at the bottom\n\n2019-12-10 Updated \"II. Attack Vector\" JPCERT Coordination Center (JPCERT/CC)\n\nMAIL: ew-info@jpcert.or.jp\n\nTEL: +81-3-6811-0610 FAX: +81-3-6271-8908\n\n[https://www.jpcert.or.jp/english/](https://www.jpcert.or.jp/english/)\n\nTop\n\nWas this helpful?\n\nAdd comment:\n\nPlease use this form to send us your feedback. For more information on the individual\nproducts, please contact the developers.\n\n\n-----\n\nTo provide feedback, please enable JavaScript. Thank you. To report an incident, please\nclick here.\n\n<< Previous Next >>\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-10 - [Updated] Alert Regarding Emotet Malware Infection.pdf"
    ],
    "report_names": [
        "2019-12-10 - [Updated] Alert Regarding Emotet Malware Infection.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536244,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653709084,
    "ts_modification_date": 1653709084,
    "files": {
        "pdf": "https://archive.orkl.eu/e6a86f79d39df6c4e7abb4ae32b52f24f319ed4d.pdf",
        "text": "https://archive.orkl.eu/e6a86f79d39df6c4e7abb4ae32b52f24f319ed4d.txt",
        "img": "https://archive.orkl.eu/e6a86f79d39df6c4e7abb4ae32b52f24f319ed4d.jpg"
    }
}