{
    "id": "235ce3b3-e05d-431d-a788-64256a27cac1",
    "created_at": "2022-10-25T16:48:17.985354Z",
    "updated_at": "2025-03-27T02:16:26.449956Z",
    "deleted_at": null,
    "sha1_hash": "96d826302a7efc3ed7d0d5aec99c9cfc1646e4fe",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-02-18T08:33:07Z",
    "file_modification_date": "2021-02-18T08:33:07Z",
    "file_size": 3252773,
    "plain_text": "# Lookout Discovers Novel Confucius APT Android Spyware Linked to India-Pakistan Conflict\n\n**[blog.lookout.com/lookout-discovers-novel-confucius-apt-android-spyware-linked-to-india-pakistan-conflict](https://blog.lookout.com/lookout-discovers-novel-confucius-apt-android-spyware-linked-to-india-pakistan-conflict)**\n\n[| Researchers February 10, 2021](https://blog.lookout.com/topics#/researchers)\n\nBy [Apurva Kumar,](https://blog.lookout.com/apurva-kumar) [Kristin Del Rosso](https://blog.lookout.com/kristin-del-rosso)\n\nThe Lookout [Threat Intelligence team has discovered two novel Android surveillanceware](https://www.lookout.com/products/threat-intelligence?utm_source=BL&utm_medium=BL&utm_campaign=WW-MU-MU-MU-MU-P_NON-HornbillSunBird)\n– Hornbill and SunBird. We believe with high confidence that these surveillance tools are\nused by the advanced persistent threat group (APT) Confucius, which first appeared in\n2013 as a state-sponsored, pro-India actor primarily pursuing Pakistani and other South\nAsian targets.1 2\n\n\nWhile primarily known for desktop malware, the Confucius group was previously\nreported to have started leveraging mobile malware in 2017, with the Android\nsurveillanceware ChatSpy. However, our discovery of SunBird and Hornbill shows that3\nConfucius may have been spying on mobile users up to a year before it started using\nChatSpy.\n\nTargets of these tools include personnel linked to Pakistan’s military, nuclear authorities,\nand Indian election officials in Kashmir. Hornbill and SunBird have sophisticated\ncapabilities to exfiltrate SMS, encrypted messaging app content, and geolocation, among\nother types of sensitive information.\n\n\n-----\n\n_SunBird has been disguised as applications that include:_\n\n_Security services, such as the fictional “Google Security Framework”_\n_Apps tied to specific locations (“Kashmir News”) or activities (“Falconry Connect”_\n_and “Mania Soccer”)_\n_Islam-related applications (“Quran Majeed”)._\n\n_The majority of applications appear to target Muslim individuals._\n\nLookout named Hornbill after the Indian Grey Hornbill, which is the state bird of\nChandigarh and where the developers of Hornbill are located. SunBird’s name was\nderived from the malicious services within the malware called “SunService” and the\nsunbird is also native to India.\n\n**Malicious Functionality and Impact of Both SunBird and Hornbill**\n\nHornbill and SunBird have both similarities and differences in the way they operate on an\ninfected device. While SunBird features remote access trojan (RAT) functionality – a\nmalware that can execute commands on an infected device as directed by an attacker –\nHornbill is a discreet surveillance tool used to extract a selected set of data of interest to\nits operator.\n\nBoth of the malware can exfiltrate a wide range of data, such as:\n\nCall logs\nContacts\nDevice metadata including phone number, IMEI/Android ID, Model and\nManufacturer and Android version\nGeolocation\nImages stored on external storage\nWhatsApp voice notes, if installed\n\nBoth malware are also able to perform the following actions on device:\n\nRequest device administrator privileges\nTake screenshots, capturing whatever a victim is currently viewing on their device\nTake photos with the device camera\nRecord environment and call audio\nScrape WhatsApp messages and contacts via accessibility services\nScrape WhatsApp notifications via accessibility services\n\n**SunBird-specific Functionality**\n\n\n-----\n\nSunBird has a more extensive set of malicious capabilities than Hornbill. It attempts to\nupload all data it has access to at regular intervals to its command and control (C2)\nservers. Locally on the infected device, the data is collected in SQLite databases which are\nthen compressed into ZIP files as they are uploaded to C2 infrastructure.\n\nSunBird can exfiltrate the following list of data, in addition to the list above:\n\nList of installed applications\nBrowser history\nCalendar information\nBlackBerry Messenger (BBM) audio files, documents and images\nWhatsApp Audio files, documents, databases, voice notes and images\nContent sent and received via IMO instant messaging application\n\nIn addition to the list of actions above, SunBird can also perform the following actions:\n\nDownload attacker specified content from FTP shares\nRun arbitrary commands as root, if possible\nScrape BBM messages and contacts via accessibility services\nScrape BBM notifications via accessibility services\n\n_Samples of SunBird have been found hosted on third-party app stores, indicating one_\n_possible distribution mechanism. Considering many of these malware samples are_\n_trojanized – as in they contain complete user functionality – social engineering may_\n_also play a part in convincing targets to install the malware. No use of exploits was_\n_observed directly by Lookout researchers._\n\n\n-----\n\n**Hornbill-specific Functionality**\n\nIn contrast, Hornbill is more of a passive reconnaissance tool than SunBird. Not only does\nit target a limited set of data, the malware only uploads data when it initially runs and not\nat regular intervals like SunBird. After that, it only uploads changes in data to keep mobile\ndata and battery usage low. The upload occurs when data monitored by Hornbill changes,\nsuch as when SMS, or WhatsApp notifications are received or calls are made from the\ndevice.\n\nHornbill is keenly interested in the state of an infected device and closely monitors the use\nof resources. For example, if the device is low on memory, it triggers the garbage collector.\nIn addition to the list of exfiltrated data mentioned earlier, Hornbill also collects\nhardware information. For example, the malware can check if a device’s screen is locked,\nthe amount of available internal and external storage and whether WiFi and GPS are\nenabled.\n\nHornbill only logs location information if it deems the changes to be significant enough\nfrom the previously recorded location – if the difference between the corresponding\nlatitudes and longitudes differ by more than 0.0006 which is roughly 70 metres.\n\nData collected by Hornbill is stored in hidden folders on external storage. Once call\nrecordings or audio recordings are uploaded to C2 infrastructure they are deleted from\nthe device to avoid suspicion.\n\n_List of hidden folders Hornbill creates and stores data to be exfiltrated to C2_\n_infrastructure._\n\nHornbill uses a unique set of server paths to communicate to C2 infrastructure. These are\nlisted below along with what action Hornbill takes when sending HTTP POST requests to\neach.\n\n\n-----\n\nThe operators behind Hornbill are extremely interested in a user’s WhatsApp\ncommunications. In addition to exfiltrating message content and sender information of\nmessages, Hornbill records WhatsApp calls by detecting an active call by abusing\nAndroid’s accessibility services. The exploitation of Android’s accessibility services in this\nmanner is a trend we are observing frequently in Android surveillanceware. This enables\nthe threat actor to avoid the need for privilege escalation on a device.\n\nLastly, Hornbill searches for and monitors activity on any documents stored on external\nstorage with the following suffixes: \".doc\", \".pdf\", \".ppt\", \".docx\", \".xlsx\", \".txt\". Whenever\na document is created, opened, closed, modified, moved or deleted, this action is logged\nby Hornbill. Functionality exists to modify this list of suffixes, but is incomplete in the\nsamples we have observed. The latest samples of Hornbill show that this malware threat\nmay still be under development.\n\n**Development Timelines**\n\nThe newest Hornbill sample was identified by Lookout’s app analysis engine as recently as\nDecember 2020, suggesting the malware may still be active today. Both ChatSpy and\nHornbill’s packaging dates appeared to have been tampered with, but we first observed\nthem in January 2018 and May 2018 respectively.\n\nLookout first observed SunBird in January 2017, but unlike the other two malware\nfamilies, the packaging dates appear legitimate, indicating the malware was likely in\ndevelopment between December 2016 and early 2019.\n\n\n-----\n\n_Hornbill, which Lookout first saw in May 2018, is actively deployed. We observed new_\n_samples as recently as December 2020. The first SunBird sample was seen as early as_\n_2017 and as late as December 2019._\n\n**Targeting**\n\nTo better understand who SunBird may have been deployed against, we analyzed over\n18GB of exfiltrated data that was publicly exposed from at least six insecurely configured\nC2 servers. All data uploaded to the C2 infrastructure included the locale of the infected\ndevices. This information, combined with the data content, gave us extensive insight into\nwho was being targeted by this malware family and the kind of information the attackers\nwere after.\n\nSome notable targets included an individual who applied for a position at the Pakistan\nAtomic Energy Commission, individuals with numerous contacts in the Pakistan Air\nForce (PAF), as well as officers responsible for electoral rolls (Booth Level Officers)\nlocated in the Pulwama district of Kashmir.\n\n\n-----\n\n_Based on the locale and country code information of infected devices and exfiltrated_\n_content, we think SunBird may have roots as a commercial Android surveillanceware._\n_The data included information on victims in Europe and the United States, some of_\n_which appear to be targets of spouseware or stalkerware. It also included data on_\n_Pakistani nationals in Pakistan, India and the United Arab Emirates that we believe_\n_may be targeted by Confucius APT campaigns between 2018 and 2019._\n\n**Malware Development and Commercial Surveillance Roots**\n\nBoth Hornbill and SunBird appear to be evolved versions of commercial Android\nsurveillance tooling. Hornbill seems to be derived from the same code base as a previously\nactive commercial surveillanceware product known as MobileSpy. It is unclear how the5\ndevelopers of Hornbill acquired the code, but the company behind MobileSpy, Retina-X\nStudios, shut down their surveillance software products in May 2018 after being hacked\ntwice. Links between the Hornbill developers indicate they all appear to have worked6\ntogether at a number of Android and iOS app development companies registered and\noperating in or near Chandigarh, Punjab, India. In 2017, one developer claimed to be\nworking at India’s Defence Research and Development Organisation (DRDO) on their\nLinkedIn profile.\n\n\nSunBird looks to have been created by Indian developers who also produced another\ncommercial spyware product, which we dubbed BuzzOut. The theory that SunBird’s7\nroots lay in stalkerware was also supported by the content found in the exfiltrated data we\nuncovered. The data included information on stalkerware victims, as well as Pakistani\nnationals living in Pakistan and traveling in the UAE and India. This data suggests that\nSunBird could have been sold to an actor that selectively deployed it to gather intelligence\n[on targeted individuals. Similar behavior was observed with Stealth Mango and Tangelo,](https://blog.lookout.com/stealth-mango?utm_source=BL&utm_medium=BL&utm_campaign=WW-MU-MU-MU-MU-P_NON-HornbillSunBird)\ntwo nation state mobile surveillanceware Lookout researchers discovered in 2018. 8\n\n**Exfiltrated Data**\n\n\n-----\n\nDuring this investigation, we were able to access exfiltrated data for SunBird whose C2\ninfrastructure had been insufficiently secured.\n\n_This is a breakdown of types of data SunBird exfiltrated. This data is from publicly-_\n_accessible exfiltrated content exposed on SunBird C2 servers for 5 campaigns between_\n_2018 and 2019. We found another 12 GB of data exfiltrated on another C2 server_\n_23.82.19[.]250. The default language of this server was set up as Chinese when_\n_discovered by Lookout researchers. This may be a false flag or may have been altered by_\n_a third party. This also makes it difficult to confirm if all of the data originated from_\n_infections of actual target devices._\n\nPersonal data such as SMS messages (sent and received), contacts, and call logs were\nexfiltrated as SQLite databases contained in ZIP files labelled with timestamps. We found\nthat whole databases are uploaded each time data is exfiltrated, usually at a regular\ncadence, which led to a large amount of duplicated data on C2 servers.\n\n\n-----\n\n_Frequency of infected devices’ locale and country code settings (translated to languages_\n_and countries) as packaged within publicly-accessible exfiltrated data. This data_\n_includes both the Confucius APT targets and spouseware victims of SunBird._\n\n**_Left:One particular SunBird C2 server was found to also be exposing a log file_**\n_containing IP addresses of those that logged into the administrator panel. The majority_\n_of these were distributed throughout India. Right: Geo-location data captured from a_\n_publicly-exposed database found on another Sunbird C2 IP 23.82.19[.]250. Almost all_\n_data stored on this server referenced phone numbers of various locations in northern_\n_India. The second most common region for phone numbers was Pakistan._\n\nWithin the exfiltrated data, one particular victim caught our interest. This individual was\nusing WhatsApp to correspond with someone applying for a position at the Pakistan\nNuclear Regulatory Authority in 2017. In 2018, messages were uncovered from someone\napplying for a position at the Pakistan Atomic Energy Commission.[9]\n\n\n-----\n\nAdditional exfiltrated data from late 2018 and early 2019 indicated that SunBird was\nbeing used to monitor Booth Level Officers responsible for field-level information10\nregarding electoral rolls in the Pulwama district of Kashmir. This time and location is\nsignificant as Pulwama suffered a suicide bombing attack in February 2019, which\nincreased tensions between India and Pakistan. The start date of active monitoring of this\ntarget on C2 servers coincided with the start of the Indian general elections held in April\n2019.\n\n_Continuous data exfiltration data that occurred every ten minutes stopped at the end of_\n_2018. Aside from one brief upload in January 2019, it suddenly picked up again on the_\n_11th of April 2019. While this may be coincidence, this is also the same day that the_\n_Indian general elections of 2019 began.12_\n\nA total of 156 victims were discovered in this new dataset and included phone numbers\nfrom India, Pakistan and Kazakhstan.\n\n**Confucius Connection**\n\n_Hornbill application icons impersonate various chat and system applications._\n\n\nSimilar to previous Confucius tactics seen with ChatSpy, Hornbill samples often\nimpersonate chat applications such as Fruit Chat, Cucu Chat and Kako Chat. The related\nC2 infrastructure communicates on port 8080, a pattern also seen on the desktop\ncampaigns carried out by Confucius.14\n\nThe Confucius group is well known for impersonating legitimate services to cover their\ntracks and confuse its victims. Naming malicious apps similar to legitimate ones may be\nan attempt to gain a target’s trust. For example, “kako chat” may have been named due to\nits similarity to KakaoTalk. However, Kako Chat’s C2 server15\n(chatk.goldenbirdcoin[.]com) references a defunct cryptocurrency by the same name.16\n\n\n-----\n\nCucu Chat may refer to a seemingly benign dating app of the same name that is available\non third-party app stores such as APKPure.17, 18 However, Cucu Chat communicates to the\nsite http://wangu[.]xyz (also on port 8080) and itself appears to be an impersonation of19\nWangu, an application which advertises itself as a chat app for Zimbabweans.20 The latest\nsample of Hornbill titled “Filos” trojanizes the Mesibo Android application for21\nlegitimate chat functionality.\n\nDuring our investigation, we noticed that Hornbill C2 infrastructure hosted HTML\nresources consistent with a commercial spyware page, but missing its image resources.\n\n_C2 servers for Hornbill were found to host HTML content from a commercial spyware._\n\nAdditionally, Hornbill carries out data exfiltration via the following unique set of server\npaths:\n\n\n-----\n\nWe found that the patterns noted above also existed on another domain samaatv[.]online.\nAlthough Lookout has not directly observed an APK communicating to this domain, we\nthink one likely exists. samaatv[.]online has resolved to the IP address 91.210.107[.]104\nsince May 2019, which encompasses the activity of this campaign.\n\nIn addition to this, we found the SunBird C2 domain pieupdate[.]online resolved to\n91.210.107.111 in between February 2019 and July 2019. This is also the timeframe in\nwhich we observed active campaigns by SunBird on that infrastructure.\n\nWith the help of public reporting and Lookout’s dataset, we are confident that the\nConfucius APT group is actively using the IPs between 91.210.107[.]103-91.210.107[.]112\nto host a large portion of their infrastructure, both presently and in the past.\n\nAdditional open-source intelligence (OSINT) searches confirmed the above connections.\nWe found a publicly-accessible 2018 Pakistani government advisory warning of a desktop\nmalware campaign targeting officers and government staff. The campaign described in it\nused phishing emails that impersonated various government agencies to deliver malicious\nMicrosoft Word exploits. The Indicators of Compromise (IOCs) for this campaign\nincluded domains that were known Confucius infrastructure, leading us to believe the\nentire campaign could be attributed to that group.\n\n_Official Report from Pakistan’s Federal Bureau of Revenue on Malicious Activity._\n\n\n-----\n\nA particular point of interest on the advisory IoC list, and crucial in confirming Confucius\nconnections, was pieupdate[.]online, a C2 server for malicious desktop activity as well as\nSunBird mobile malware.\n\n_Hornbill malware has unique file paths with which to communicate with C2 servers._\n_They also display a unique Spyware HTML page. Lookout researchers uncovered_\n_another domain, samaatv[.]online, which shares the same unique file paths and_\n_Spyware HTML page found on a Hornbill C2 server, cucuchat[.]com. It is tied to known_\n_Confucius infrastructure by resolving to 91.210.107[.]104, in the Confucius IP range._\n\nWe are confident SunBird and Hornbill are two tools used by the same actor, perhaps for\ndifferent surveillance purposes.\n\nTo the best of our knowledge the apps described in this article were never distributed\nthrough Google Play. Users of Lookout security apps are protected from these threats.\n\nLookout Threat Advisory Services customers have already been notified with additional\n[intelligence on this and other threats. Take a look at ourThreat Advisory Services page to](https://www.lookout.com/products/threat-intelligence?utm_source=BL&utm_medium=BL&utm_campaign=WW-MU-MU-MU-MU-P_NON-HornbillSunBird)\nlearn more.\n\n**Disclaimer**\n\nThe information provided in this report is based upon discovery tools and methods which\nare inherently imperfect and though it is our belief the information in this report is\naccurate at the time of its publishing the information is provided “as is” with all faults,\nand Lookout Inc., assumes no liability for its accuracy or completeness, or one's use or\nreliance upon the information contained therein.\n\n\n-----\n\n**Acknowledgements**\n\nWe would like to thank Michael Flossman for his contribution to the initial discovery and\ntracking of SunBird.\n\n1 https://unit42.paloaltonetworks.com/unit42-confucius-says-malware-families-getfurther-by-abusing-legitimate-websites/\n\n2 [https://apt.thaicert.or.th/cgi-bin/showcard.cgi?g=Confucius&n=1](https://apt.thaicert.or.th/cgi-bin/showcard.cgi?g=Confucius&n=1)\n\n3 https://www.trendmicro.com/en_us/research/18/b/deciphering-confuciuscyberespionage-operations.html\n\n4 https://cdn.s3waas.gov.in/s3eb6fdc36b281b7d5eabf33396c2683a2/uploads/2019/04/\n2019041885.pdf\n\n[5 https://www.mobile-spy.com/](https://www.mobile-spy.com/)\n\n6 https://www.vice.com/en/article/vvabv3/hackers-why-they-hit-stalkerware-flexispyretina-x\n\n[7 https://www.bol7.com/mobile-tracking-spy/](https://www.bol7.com/mobile-tracking-spy/)\n\n8 [https://info.lookout.com/rs/051-ESQ-475/images/lookout-stealth-mango-srr-us.pdf](https://info.lookout.com/rs/051-ESQ-475/images/lookout-stealth-mango-srr-us.pdf)\n\n9 [https://en.wikipedia.org/wiki/Pakistan_Atomic_Energy_Commission](https://en.wikipedia.org/wiki/Pakistan_Atomic_Energy_Commission)\n\n10 https://cdn.s3waas.gov.in/s3eb6fdc36b281b7d5eabf33396c2683a2/uploads/2019/04\n/2019041885.pdf\n\n11 [https://en.wikipedia.org/wiki/2019_Pulwama_attack](https://en.wikipedia.org/wiki/2019_Pulwama_attack)\n\n12 [https://en.wikipedia.org/wiki/2019_Indian_general_election](https://en.wikipedia.org/wiki/2019_Indian_general_election)\n\n13 https://www.trendmicro.com/en_us/research/18/b/deciphering-confuciuscyberespionage-operations.html\n\n14 https://www.virustotal.com/gui/file/8dccc3c76a474f106de639df9370b76e788cbff05b\n2345715454ab25309cd517/behavior\n\n[15 https://play.google.com/store/apps/details?id=com.kakao.talk&hl=en_US&gl=US](https://play.google.com/store/apps/details?id=com.kakao.talk&hl=en_US&gl=US)\n\n16 [https://chasing-coins.com/coin/XGB](https://chasing-coins.com/coin/XGB)\n\n17 [https://apkpure.com/cucu-free-chat-dating-app/crush.dating.app](https://apkpure.com/cucu-free-chat-dating-app/crush.dating.app)\n\n18 [https://apkpure.com/chat-xpress-pretty-people/cucuchat.android](https://apkpure.com/chat-xpress-pretty-people/cucuchat.android)\n\n19 [https://web.archive.org/web/20180813100604/http://wangu.xyz/](https://web.archive.org/web/20180813100604/http://wangu.xyz/)\n\n[20 https://play google com/store/apps/details?id=africa wangu app&hl=en US&gl=US](https://play.google.com/store/apps/details?id=africa.wangu.app&hl=en_US&gl=US)\n\n\n-----\n\n21 [https://play.google.com/store/apps/details?id=com.mesibo.mesiboapplication](https://play.google.com/store/apps/details?id=com.mesibo.mesiboapplication)\n\n22 https://unit42.paloaltonetworks.com/unit42-confucius-says-malware-families-getfurther-by-abusing-legitimate-websites/\n\n23 https://blog.trendmicro.com/trendlabs-security-intelligence/deciphering-confuciuscyberespionage-operations/\n\n**SHA-1 Hashes**\n\n**Hornbill**\n\nb6b239ccef57a261a254f5167357dc9096618939\n\n1f1bab3c5a60275384083ef9e2a5b9fe6c194a35\n\n704579a14a2ee80c89ad12019e19e50eb27dffea\n\n3372458b73d3d5c3957a75dfe6cff62c5cd3cd4f\n\n77867ddb68b68a340ccdb79bd9d46281d5956fa5\n\nc504cef5e0e04b15d21388e6f9cc2c320071d50b\n\n0cc49097778372fdf1ba2143e31a8f235342f9c9\n\n**SunBird**\n\n9b684cff07f98083bdb085cb846929ebca2c3df1\n\n2ecb5b88b12ba44cfce2f51df7f16fbd4754aea2\n\n665d23eda84cd008ccde013bde6a836976bcc4fc\n\na38931d68b26f04a94241f2155bcbf465b3fa99a\n\ndf5188225ab6de0a6e71635e997c4473c02d6527\n\ne01729e5ceb827318e5198a24a12ae6d6bbc4ab3\n\n8ae67888befb4f01f216d94f07051fc047150ceb\n\n41268c45dc2453469ea8a0a0c615bdb562d1d9de\n\na4161cfe2d6146566094ee979ea893cd2fe3ae72\n\n03d199cff2be8667932933d1bcb6bb58d364545a\n\nfc2929a021ca1e83f0d87ca9c9c85df0057373e5\n\na6128100cd9c505e12af16a163d4fea35c42808a\n\n\n-----\n\n6b75e6df7744a232a350658ad06e9574483a0b8b\n\nbe524a5a42b4b3f48f5571311f9be683024b6939\n\n**BuzzOut**\n\n2fd402c23f6827c049b92af19d4815c03cde407f\n\nb847ffa3d097c9eb1ddfc0dd3133582988fde885\n\n9b10e71f3d38e73d3637bf14d93404175bf4c276\n\nae1cd2a583082eeb540c567a051135d5147e97db\n\na0ed91b759a0015145ab301a3bba8f6cd868b394\n\nafdc1db55e84e868e8ecdb3489309e1e19453779\n\n27cabf2a24a87324f922becd5ae2dcf7bf4ae4bd\n\n6779ebdd14113ce304172b078d859684248ee114\n\n6bb91b2b97f08eb116982a5039d859ada94c37fd\n\ne3cd30bbc7e9e0b8c4275c4d2b8ac876a7fc9b9b\n\n07f1b2d8b34ce31296f6f5fe336ebae90293119e\n\n15e18ac163275bdcf8e391a90127db5206ab4fdd\n\na5224bf9444736970dc357da3b309ad089aa7912\n\n257bb82955818c1b3e2fc9581475c3d71df489e6\n\nfde11af0c9ede7ad1f2b4e8bd6d55c1ef90eff72\n\n01a91eb4cf0a8cfd048d98d3006e7b39a3d61f81\n\n**Command and Control Infrastructure**\n\n**Hornbill**\n\npieupdate[.]online\n\nchatk.goldenbirdcoin[.]com\n\ncucuchat[.]com\n\n184.154.203[.]90\n\n69.175.35[.]98\n\n\n-----\n\nsamaatv[.]online\n\ntea-time[.]link\n\n**SunBird**\n\ndata10.000webhostapp[.]com\n\nglobal134.000webhostapp[.]com\n\nwixten.000webhostapp[.]com\n\nsunshinereal.000webhostapp[.]com\n\n23.82.19[.]250\n\nFind out how you can secure your smartphones and tablets today\n\n[Request A Demo call_made](https://www.lookout.com/request-a-demo?utm_source=LKW&utm_medium=WB&utm_campaign=AMS-US-----Blog_ConversionRibbon)\n\n[Free Trial call_made](https://www.lookout.com/90-day-free-trial?utm_source=LKW&utm_medium=WB&utm_campaign=AMS-US-----Blog_ConversionRibbon)\n\n[Contact Sales call_made](https://www.lookout.com/info/enterprise-contact-us?utm_source=LKW&utm_medium=WB&utm_campaign=AMS-US-----Blog_ConversionRibbon)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2021.02.10.Confucius_India-Pakistan/blog.lookout.com-Lookout%20Discovers%20Novel%20Confucius%20APT%20Android%20Spyware%20Linked%20to%20India-Pakistan%20Conflict.pdf"
    ],
    "report_names": [
        "blog.lookout.com-Lookout Discovers Novel Confucius APT Android Spyware Linked to India-Pakistan Conflict"
    ],
    "threat_actors": [
        {
            "id": "caf95a6f-2705-4293-9ee1-6b7ed9d9eb4c",
            "created_at": "2022-10-25T15:50:23.472432Z",
            "updated_at": "2025-03-27T02:00:55.479021Z",
            "deleted_at": null,
            "main_name": "Confucius",
            "aliases": [
                "Confucius",
                "Confucius APT"
            ],
            "source_name": "MITRE:Confucius",
            "tools": [
                "WarzoneRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a8dbc5e-51a8-437a-8540-7dcb1cc110b8",
            "created_at": "2022-10-25T16:07:23.482856Z",
            "updated_at": "2025-03-27T02:02:09.827887Z",
            "deleted_at": null,
            "main_name": "Confucius",
            "aliases": [],
            "source_name": "ETDA:Confucius",
            "tools": [
                "ApacheStealer",
                "ByeByeShell",
                "ChatSpy",
                "Confucius",
                "MY24",
                "Sneepy",
                "remote-access-c3",
                "sctrls",
                "sip_telephone",
                "swissknife2"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "70e88fa9-d833-4d8c-be5b-cc39bcdb499a",
            "created_at": "2023-01-06T13:46:38.796488Z",
            "updated_at": "2025-03-27T02:00:02.921385Z",
            "deleted_at": null,
            "main_name": "Stealth Mango and Tangelo",
            "aliases": [],
            "source_name": "MISPGALAXY:Stealth Mango and Tangelo",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1613637187,
    "ts_modification_date": 1613637187,
    "files": {
        "pdf": "https://archive.orkl.eu/96d826302a7efc3ed7d0d5aec99c9cfc1646e4fe.pdf",
        "text": "https://archive.orkl.eu/96d826302a7efc3ed7d0d5aec99c9cfc1646e4fe.txt",
        "img": "https://archive.orkl.eu/96d826302a7efc3ed7d0d5aec99c9cfc1646e4fe.jpg"
    }
}