{
    "id": "23b60991-7707-41aa-b8bb-017c129a7523",
    "created_at": "2023-01-12T14:58:50.391648Z",
    "updated_at": "2025-03-27T02:05:29.215684Z",
    "deleted_at": null,
    "sha1_hash": "95b3f6e14ba8b6c094e86211e841ebc23c2fa7d7",
    "title": "2022-01-24 - Infected PowerPoint Files Using Cloud Services to Deliver Multiple Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T17:13:09Z",
    "file_modification_date": "2022-05-28T17:13:09Z",
    "file_size": 2145326,
    "plain_text": "# Infected PowerPoint Files Using Cloud Services to Deliver Multiple Malware\n\n**[netskope.com/blog/infected-powerpoint-files-using-cloud-services-to-deliver-multiple-malware](https://www.netskope.com/blog/infected-powerpoint-files-using-cloud-services-to-deliver-multiple-malware)**\n\nGustavo Palazolo January 24, 2022\n\n_[Co-authored by Gustavo Palazolo and Ghanashyam Satpathy](https://www.netskope.com/blog/author/gsatpathy)_\n\n## Summary\n\nIn 2021, malicious Office documents accounted for 37% of all malware downloads detected\nby Netskope, showing favoritism for this infection vector among attackers. This is likely due\nto the ubiquitous usage of Microsoft Office in enterprises across the globe. Throughout 2021\nwe have [analyzed many techniques used by attackers to deliver payloads through infected](https://www.netskope.com/blog/malicious-office-documents-multiple-ways-to-deliver-payloads)\n[documents, which included the return of Emotet, a campaign that primarily uses infected](https://www.netskope.com/blog/netskope-threat-coverage-the-return-of-emotet)\ndocuments to spread malware.\n\nSince December 2021, Netskope Threat Labs has observed an increase in the usage of one\nspecific file type from the Microsoft Office suite: PowerPoint. These relatively small files are\nbeing delivered through phishing emails, then downloading and executing malicious scripts\n[through LoLBins, a common technique often used to stay under the radar.](https://www.netskope.com/blog/bazarloader-using-lolbins-through-office-documents-to-deliver-payloads)\n\n[We spotted this campaign delivering multiple malware, such as AveMaria (a.k.a.](https://bazaar.abuse.ch/sample/17cd87bcd8cd457fc30877dfaf5dcfa395117cdc99f573c8572526d9edbf4b58/) [Warzone)](https://www.netskope.com/blog/dbatloader-abusing-discord-to-deliver-warzone-rat)\n[and AgentTesla. These files are using Bitly to shorten URLs and different cloud services like](https://bazaar.abuse.ch/sample/01237a328e0ba2a9be78b63b71a1594b1941a648951554f8feab62c47a13a08c/)\n[MediaFire,](https://www.mediafire.com/) [Blogger, and](https://www.blogger.com/about/) [GitHub to host the payloads. In this blog post, we will analyze a](https://github.com/)\n\n\n-----\n\nmalicious PowerPoint Add-In file detected by Netskope that delivers multiple malware,\nincluding AgentTesla.\n\n## Stage 01 – Infected PowerPoint File\n\nThe infection flow starts with a phishing email that carries the infected file as an attachment,\nalong with a message that lures the victim to download and open it.\n\nPhishing email with a malicious attachment.\nThe file is fairly small and it doesn’t contain anything but the malicious VBA macro.\n\nInfected PowerPoint file.\n\nThe macro is obfuscated and it uses an internal function to decrypt important strings at\nruntime.\n\n\n-----\n\nObfuscated VBA code within the infected PowerShell file.\nThe script deobfuscation is straightforward and leads to the following VBA code.\n\nCommand executed by the malicious PowerShell file.\nThis technique uses Outlook (COM Object) to execute PowerShell, which bypasses the child\nprocess created by PowerPoint.\n\nPowerShell spawned by Outlook’s process.\n\n[The script is executed with a combination of PowerShell and mshta, a similar technique](https://lolbas-project.github.io/lolbas/Binaries/Mshta/)\n[employed by BazarLoader.](https://www.netskope.com/blog/bazarloader-using-lolbins-through-office-documents-to-deliver-payloads)\n\n\n-----\n\nMalicious script being\n\nexecuted through LoLBins.\n\n## Stage 02 – VBS File\n\n[The URL contacted by the mshta binary is shortened through the Bitly domain “j.mp”, and the](https://bitly.com/)\n[payload is hosted on MediaFire, a cloud service for file storage and sharing.](https://www.mediafire.com/)\n\nThe next stage is a VBS script that is lightly obfuscated within an HTML page, which is\ndecoded and executed through a simple JavaScript function.\n\n\n-----\n\nSecond stage executed by the infected PowerPoint file.\nOnce deobfuscated, the VBS script performs multiple tasks to:\n\n1. Create a persistence mechanism through the Windows registry to execute two\n\nPowerShell scripts from external URLs. The first script delivers AgentTesla, and the\nsecond script is used to disable some OS defenses, such as Windows Defender.\n\n1. Create a scheduled task that executes a script from an external URL through mshta\n\napproximately every hour. This script delivers a cryptocurrency stealer developed in\nPowerShell, hidden within a fake web page hosted with Blogger.\n\n1. Create a persistence mechanism through the Windows registry to execute a script from\n\nan external URL using mshta. Unfortunately, we can’t tell what was being executed as\nthis URL was offline at the time of the analysis.\n\n\n-----\n\nMalicious VBS responsible for the next stages.\n\n## Stage 03 – AgentTesla\n\n[The first PowerShell script is responsible for executing AgentTesla, which is a .NET-based](https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla)\nRemote Access Trojan with many capabilities, such as stealing browser’s passwords,\ncapturing keystrokes, clipboard, etc.\n\nThe code is slightly obfuscated, protecting variables, function names, and strings. There are\ntwo large arrays that contain:\n\n1. Compressed bytes of AgentTesla;\n2. Compressed bytes of a .NET Injector used for process injection;\n\nNone of the executables are written to disk, which characterizes this attack as fileless.\n\nPowerShell script responsible for executing AgentTesla.\n\n\n-----\n\nOnce both files are decompressed, the script loads the injector and calls a function named\n“Execute”, responsible for injecting AgentTesla payload into an instance of\n“aspnet_compiler.exe”, which is a binary from the .NET framework.\n\nRemoving a minor obfuscation in the PowerShell script, showing how the payload gets\nexecuted.\nMost of the injector’s function names are obfuscated, but we can see the namespace, the\nclass, and the method that is being called to inject AgentTesla into a process. Furthermore,\n[an injector using “projFUD” as namespace was previously spotted in the wild, used by other](https://blog.morphisec.com/revealing-the-snip3-crypter-a-highly-evasive-rat-loader)\n[malware such as ASyncRAT and](https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat) [RevengeRAT.](https://malpedia.caad.fkie.fraunhofer.de/details/win.revenge_rat)\n\nInjector’s decompiled\n\ncode.\nAgentTesla is developed in .NET and this sample is using a protector known as “Obfuscar”,\nwhich creates a few mechanisms in the code to make analysis harder.\n\n\n-----\n\nAgentTesla sample delivered by the infected PowerPoint file.\nDespite the protector’s usage, it’s still possible to see clean code from the decompiler, like\nthis method that sends HTTP requests.\n\nFunction used by AgentTesla for network requests.\nAll the strings used by AgentTesla are encrypted within the binary, where all the characters\nare stored in a single array of bytes. Once it’s running, the code decrypts all the characters in\nthe list using a simple XOR operation with the encrypted byte, its position on the list, and the\ndecimal 170. Whenever AgentTesla needs to access a string, it calls a function that returns\nthe string by accessing its position in the list, and the respective length.\n\n\n-----\n\nAgentTesla string encryption scheme.\nUsing the same logic, we can use a combination of regex and a Python script to decrypt all\nthe strings in the binary. The complete list of decrypted strings can be found on our Github\npage.\n\nDecrypted strings from AgentTesla.\nFurthermore, AgentTesla sends an HTTP POST request to a malicious server with\ninformation about the infected machine, such as the computer name, username, IP address,\netc.\n\n\n-----\n\nAgentTesla HTTP request.\n\n## Stage 04 – PowerShell\n\nThe second PowerShell file executed by the VBS script in the second stage is mostly used to\ndisable Windows Defender.\n\nPowerShell downloading the payloads.\nOnce running, it downloads a file from GitHub named NSudo, which is used for privilege\n[escalation (TA0004). NSudo is executed as “TrustedInstaller” through the arguments “-U:T”.](https://attack.mitre.org/tactics/TA0004/)\n\nGUI from downloaded file\n\n“NSudo”.\nThe second download is a VBS script hosted on MediaFire, which uses NSudo and other\ncommands to disable Windows Defender and to add a few AV exclusions based on file\nextensions, paths, and executable names.\n\n\n-----\n\nVBS downloaded by PowerShell.\nThe VBS is executed through another Living-off-the-Land technique, by first creating an INF\nfile with the command to be executed.\n\nPowerShell creating INF file.\n[And then executing the INF file with the cmstp LoLBin.](https://lolbas-project.github.io/lolbas/Binaries/Cmstp/)\n\nExecuting the INF file.\n\n## Stage 05 – Cryptocurrency Stealer\n\n\n-----\n\n[The third URL downloaded by the second stage VBS is hosted with Blogger, which tries to](https://www.blogger.com/about/)\ncamouflage itself through a fake web page that says the content is sensitive.\n\nFake web page downloaded by the second stage.\nDespite the attempt to hide behind this web page, we can find two malicious VBS within the\nHTML, which are decoded and executed with a simple JavaScript.\n\nVBS code hidden in the HTML page.\nOne of the VBS executed in this stage leads to the same PowerShell that delivers\nAgentTesla, which is redundant. However, the other VBS code leads to a simple\ncryptocurrency stealer written in PowerShell.\n\nVBS loading and executing the cryptocurrency stealer.\nThe malware is fairly simple, it works by checking the clipboard data with a regex that\nmatches the cryptocurrency wallet pattern. If it is found, the data is replaced with the\nattacker’s wallet address.\n\n\n-----\n\nCryptocurrency stealer\n\nin PowerShell.\nThe code is able to replace the address for many coins, such as Bitcoin, Ethereum, XMR,\nDOGE, etc.\n\n\n-----\n\nCryptocurrency addresses used by the attacker.\n[The complete list of the addresses used by the attacker can be found on our GitHub page.](https://github.com/netskopeoss/NetskopeThreatLabsIOCs/tree/main/AgentTesla/IOCs)\n\n## Conclusion\n\nAttackers not only continue to abuse Microsoft Office to deliver malware, but are also\nincreasingly including cloud services in their attacks, as this adds a certain resilience to the\nentire process. Netskope Advanced Threat Protection includes a custom Microsoft Office file\nanalyzer and a sandbox to detect campaigns like the one we described in this analysis. We\nwill continue to provide updates on this threat as it evolves.\n\n## Protection\n\nNetskope Threat Labs is actively monitoring this campaign and has ensured coverage for all\nknown threat indicators and payloads.\n\n**Netskope Threat Protection**\n\nDocument-Office.Trojan.AgentTesla\nWin32.Trojan.AgentTesla\n\n\n-----\n\n**Netskope Advanced Threat Protection provides proactive coverage against this**\nthreat.\n\nGen.Malware.Detect.By.StHeur indicates a sample that was detected using static\nanalysis\nGen.Malware.Detect.By.Sandbox indicates a sample that was detected by our\ncloud sandbox\nGen.Malware.Detect.By.StHeur.MsOffice indicates a sample that was detected by\nNetskope’s static ML Microsoft Office analyzer engine.\n\nBelow we have an example of a sample detected by Netskope, which has a score of 9/63 on\nVirusTotal.\n\n## IOCs\n\n[A full list of IOCs and a Yara rule are all available in our GitHub repo.](https://github.com/netskopeoss/NetskopeThreatLabsIOCs/tree/main/AgentTesla)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-24 - Infected PowerPoint Files Using Cloud Services to Deliver Multiple Malware.pdf"
    ],
    "report_names": [
        "2022-01-24 - Infected PowerPoint Files Using Cloud Services to Deliver Multiple Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535530,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653757989,
    "ts_modification_date": 1653757989,
    "files": {
        "pdf": "https://archive.orkl.eu/95b3f6e14ba8b6c094e86211e841ebc23c2fa7d7.pdf",
        "text": "https://archive.orkl.eu/95b3f6e14ba8b6c094e86211e841ebc23c2fa7d7.txt",
        "img": "https://archive.orkl.eu/95b3f6e14ba8b6c094e86211e841ebc23c2fa7d7.jpg"
    }
}