{
    "id": "23b791b5-e270-4d07-b094-3c62a6baa77a",
    "created_at": "2022-10-25T16:48:20.100908Z",
    "updated_at": "2025-03-27T02:15:57.775921Z",
    "deleted_at": null,
    "sha1_hash": "449c50fa76fa2545a649262dfe8fff05b2fcedf3",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-12-24T13:08:59Z",
    "file_modification_date": "2020-12-24T13:09:02Z",
    "file_size": 1955900,
    "plain_text": "### December 2020\n\n\n-----\n\n##### Forward\n\nEarlier this year, Security Joes and Profero responded to an incident involving\nransomware and the encryption of several core servers. After an extensive\ninvestigation, our team was able to discover samples of malware linked to a\ncampaign reported on by TrendMicro[1], known as DRBControl, with links to both\nAPT groups: APT27 and Winnti. This particular campaign revolves around attacks\non major gaming companies, worldwide.\n\n**DRBControl was first reported on by TrendMicro and Talent-Jump Technologies**\nat the beginning of 2020 and covered an incident they responded to back in July\n2019. What was interesting about this backdoor was its utilization of Dropbox as a\nCommand and Control (C2) server. Our team discovered a very similar sample\nthat we were able to identify as a variant of Clambling, however the sample\nlacked any Dropbox capabilities. As a result, it could be considered an older\nvariant; or that the threat actors have different variants for different use cases.\n\nAlongside the discovered backdoor, we located the ASPXSpy webshell, a sample\nof PlugX, and Mimikatz. The initial infection vector was through a 3rd party service\nprovider, that had been previously infected through another 3rd party service\nprovider.\n\n\n-----\n\nWith regards to who is behind this specific infection chain, there are extremely\nstrong links to APT27/Emissary Panda, in terms of code similarities, and TTPs.\n**APT27 is believed to be a state-sponsored Chinese APT group, focused on**\ncyberespionage and theft of information and data. What stood out in this\nincident was the encryption of core servers using BitLocker, which is a drive\nencryption tool built into Windows. This was particularly interesting, as in many\ncases threat actors will drop ransomware to the machines, rather than use local\ntools. Previously, APT27 was not necessarily focused on financial gain, and so\nemploying ransomware actor tactics is highly unusual, however this incident\noccurred at a time where COVID-19 was rampant across China, with lockdowns\nbeing put into place, and therefore a switch to a financial focus would not be\nsurprising. Upon writing this report, a report was released by PTSecurity[2], which\ncovered an incident linked to APT27 where the Polar ransomware was dropped to\nsystems, validating our belief APT27 has become more financially focused.\n\n###### Chinese APT refocus efforts on financial gain\n\n\n-----\n\n##### INFECTION CHAIN\n\nAs mentioned previously, the threat actors gained a foothold onto the company\nsystems through a 3rd party compromise. An ASPXSpy webshell was also\ndeployed, to assist in lateral movement.\nThe PlugX and Clambling samples were both loaded into memory using a Google\nUpdater executable vulnerable to DLL Side-Loading. For each of the two samples,\nthere was a legitimate executable, a malicious DLL, and a binary file consisting\nof shellcode responsible for extracting the payload from itself and running it in\nmemory. Both samples used the signed Google Updater, and both DLLs were\nlabeled goopdate.dll, however the PlugX binary file was named license.rtf, and the\nClambling binary file was named English.rtf.\nWe also discovered a generic Mimikatz sample on the infected machine, that\nwas not modified by the attackers before distributing it onto the machines.\nAdditionally, we located a binary responsible for escalating privileges by\nexploiting CVE-2017-0213, for which the source code is publicly available. This lines\nup with the TrendMicro report, which mentions the discovery of the same exploit\nbeing used. APT27 has been known to use this exploit to escalate privileges in the\npast; with one incident resulting in a CryptoMiner being dropped to the system.\nThis shows us that this is not the first time APT27 has turned into financially\nmotivated attackers.\n\n###### Links between APT27 and Winnti\n\n\n-----\n\n##### TOOL ANALYSIS\n\nDue to the extensive nature of PlugX usage among Chinese threat actors, we\nchose to focus our efforts on analysing the Clambling implant, as it seems to\nbe somewhat unique to this campaign. Specifically, we discovered a different\nvariant of the Type 2 Backdoor, confirmed initially through the exposed RTTI\ninformation – the only difference is the lack of the CMuture class in the sample\nwe discovered.\n\nFigure 1 - VFTable\n\nUpon being loaded into memory through DLL Side-Loading, the flow of execution\nat first is determined by the number of arguments, rather than the content of\nthe arguments. Before the program even queries the number of arguments,\nit writes the encrypted on-board configuration to the registry. In the sample\nwe discovered, it writes it to [HKLM/HKCU]\\\\Software\\\\RCS\\\\Software\\\\\n**CPanels. After the configuration has been written to the registry, the sample will**\ndecrypt it in memory, for later use in the sample.\n\n\n-----\n\nFigure 2 - Code sample\n\nOnto the argument parsing, there are a total of 4 pathways. The first pathway\nto execute will setup persistence and execute the DLL Side-Loading vulnerable\nexecutable with the argument 16.\nThis triggers execution of the second pathway, which will result in the sample\nspawning msiexec.exe, with the argument 17, and injecting itself into it.\nAs a result, pathway 3 will execute inside the msiexec.exe process, and this will\ninitiate communications with the C2 server, and spawn svchost.exe with an\nargument based on the current process identifier, once again injecting itself into\nthe newly created process.\nThe 4th and final pathway will execute in svchost.exe. This pathway involves\nsetting up a pipe between the msiexec.exe and svchost.exe process, and\ninitializing the main backdoor features such as the keylogger, screen capture, file\nmanager, etc. This pipe allows the attacker to send commands to the svchost.exe\nprocess, to request log files, screen captures, etc.\n\n\n-----\n\nFigure 3 - Argument parsing\n\nPersistence is set up through the system services if the sample has the correct\nprivileges, otherwise it utilizes the Run key in the registry. Once persistence has\nbeen set up, the sample will spawn another instance of itself, with the argument\n**16, as mentioned previously.**\n\n\n-----\n\nFigure 4 - Persistence through a vulnerable executable, google update executable\n\nThe injection into msiexec.exe is fairly simple, with the sample simply allocating\nmemory in the remote suspended process, writing itself to memory, and patching\nthe entry point to call the entry point of its injected code, passing in the argument\n**0x120000. Once the overwrite has been completed, the main thread will be**\nresumed, executing the malicious injected payload.\n\nFigure 5 - Memory allocation for the process\n\n\n-----\n\nThe injection into svchost.exe operates similarly, overwriting the entry point with a\npush and a call to the entry point of the malicious code.\nInside the second msiexec.exe process, communication with the C2 server will\nbegin. The sample of Clambling we analysed contained 3 main communication\nprotocols: raw UDP, raw TCP and HTTP. During the investigation, we focused\nour analysis efforts on the TCP protocol primarily. This utilized WinSock API for\ncommunication, including WSASend and WSARecv.\n\nFigure 6 - Process injection\n\nThe communication-linked function will loop until a command is received to\nclean up any traces from the machine, at which point the implant will remove\nany linked files and terminate itself.\n\nFigure 7 - Cleaning up after execution\n\n\n-----\n\nThere are several commands available to an attacker inside the second\n**msiexec.exe process. These include gathering system information such as the**\ncurrent privileges (user privileges, administrator privileges, etc.) and the operating\nsystem version information, dropping/updating the current implant, and cleaning\nany traces of the malware from the infected machine. The clean-up functionality\nwill remove any dropped files to the machine, remove any added registry keys, as\nwell as services if it was running with administrator privileges.\n\nFigure 8 - Communication methods\n\n\n-----\n\n**0X108** Update a value in the configuration, encrypt it,\n\nand store it in the registry\n\nWhile it does not utilize Dropbox as a C2 server, it is still extremely modular\nand allows the attacker to drop additional samples of malware to an infected\nmachine or execute commands through a reverse shell – such as executing\nBitLocker to encrypt core servers. There are definitely some code overlaps\nbetween Clambling and PlugX, such as the usage of what seems to be a\ncampaign identifier in the packets sent to and from the C2 server: 0x20160101.\nThis same structure can be seen in PlugX samples, which could indicate\nthe developers used source code from the PlugX remote access tool while\ndeveloping Clambling. Additionally, it seems like the actors behind this particular\nstrain are constantly updating and reworking their tools, as it is a fairly new\ncampaign yet there are several different variants of a specific tool.\n\n\n-----\n\n##### LINKS TO THREAT ACTORS\n\nReading through the TrendMicro report, there were 2 possible groups linked to\nthe DRBControl campaign. APT27 and Winnti. APT27 was linked to the campaign\ndue to the usage of the HyperBro backdoor in one of the incidents. HyperBro is\ntypically considered to be unique to APT27, rather than a commonly shared tool\nsuch as PlugX. This could indicate that APT27 is responsible for the campaign, or\nthat they are beginning to share tools with other cybercrime groups.\n**Winnti had a much stronger link to the campaign, based on similar mutexes,**\nand the post exploitation commands run by the attackers. The post exploitation\ncommands included a bitsadmin call, which reached out to an IP address\nlinked to Winnti infrastructure. bitsadmin is another Windows tool that allows\nfor file transfers and can be used to download remote files. Additionally, Winnti\nare known to target computer gaming companies, so the switch from that to\ngambling companies is not too farfetched to believe - compared to APT27, who\ncommonly target government organisations, defence sectors, and more.\nIn our analysis, we found similarities between our Clambling sample, and older\nconfirmed APT27 implants; specifically, the method of using the number of\narguments to execute different functions, and the usage of DLL Side-Loading with\nthe main payload stored in a separate file. Unfortunately, this was not enough to\nconfirm the hypothesis that APT27 was behind this campaign, and as we did not\nhave any other samples such as HyperBro, we decided to focus on the possibility\nof a Winnti link.\n\n\n-----\n\nAfter searching for code overlap between Winnti samples and our Clambling\nsample, we discovered a report by Command54 on an incident that took place\nback in 2011, that targeted SK Communications, a South Korean tech company.\nThe incident involved the theft of personal information of up to 35 million records\nand occurred due to the hijacking of a third-party server belonging to ESTSoft[5].\nThe server in question provided automatic updates to ESTSoft’s archive software,\nand when hijacked by attackers, provided an update to SK Communications\nsystems that would enable an attacker to perform DLL Side-Loading through\nthe legitimate archive software. Interestingly, one of the Clambling implants\ndiscovered by TrendMicro involved a patched copy of HaoZip, a Chinese\nalternative to WinRAR and WinZIP.\n\n###### Relations between our findings and previous reports\n\n\n-----\n\nWe investigated further and came across an excerpt of the configuration block in\nthe main sample used to infiltrate SK Communications.\n\nFigure 9 – Configuration block from SK Communication incident\n\nWhile it is a weak link, we discovered similarities between this configuration\nblock and the configuration block in the Clambling backdoor. This link could\nindicate possible configuration structure reuse between the two samples. The\nmain similarities between the 2 configuration blocks lie in the storage of the\nport just before the IP address, as well as the use of a potential time stamp and\ntimer value. Above you can see an image of the configuration block from the SK\n_Communications hack, and below you can see an excerpt from the Clambling_\nconfiguration block.\n\nFigure 10 - Clambling configuration\n\n\n-----\n\nAfter discovering this link, we investigated the SK Communications incident\na bit further. Uploading the Clambling backdoor to Intezer[6] yielded strong\nlinks to the PlugX strain of malware, and interestingly, very weak links to the SK\n_Communications sample._\n\nFigure 11 - SK Configuration Structure Figure 12 - Configuration structure\n\nFrom there, we discovered a blog post by Kaspersky[7] which mentioned\n_ESTSoft had been penetrated by Winnti around the same time SK_\n_Communications were hacked. As Winnti are known for compromising_\ncertificates for signing malware, and the SK Communications incident\noccurred due to a signed malicious update, it is not farfetched to believe\n**Winnti were responsible for the breach of SK Communications, which in turn**\ncould hint towards Winnti being behind the Clambling backdoor. While there\ncertainly is not as much string encryption or API obfuscation occurring in this\nnew backdoor, it is odd that the configurations are very similar in terms of\nstructure, and therefore we decided to share this point regardless, in hopes it\ncan lead to further research.\n\n\n-----\n\nCombining all the links we discovered during our analysis of our incident,\nit is not out of the question that Winnti is behind the Clambling backdoor,\nor at least a sub-group operating under the Winnti umbrella. The target in\nquestion is not a common target for APT27, however Winnti is known to target\nmore niche companies such as video game development companies[8]. The\nconfiguration block itself has links to an incident back in 2011 that can be\nlinked to Winnti through TTPs and the fact they had infiltrated the company\nwhich had their software altered and dropped onto SK Communications\nsystems resulting in the compromise. Additionally, looking at the Winnti\ninfrastructure overlap TrendMicro were able to identify in their report, it is even\nclearer.\nHowever, attribution is not simple to do. Based on the small number of\nsamples we found in the incident, we are only able to speculate at this point.\nAside from a sample of PlugX, MimiKatz, Clambling, and two UAC bypass\nexploits used by the attackers, we did not have much more to go on in terms\nof Post Exploitation tools. We hope by sharing our research, we can help\ngenerate more research on this particular group, and any links they may have\nto other campaigns, both new and old.\n\n\n-----\n\n##### REFERENCES\n\n1. https://documents.trendmicro.com/assets/white_papers/wp-uncoveringDRBcontrol.pdf\n\n[2. https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/incident-response-polar-ransom)\n[incident-response-polar-ransomware-apt27/](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/incident-response-polar-ransom)\n\n[3. https://labs.k7computing.com/?p=20808](https://labs.k7computing.com/?p=20808 )\n\n4. https://media.kasperskycontenthub.com/wp-content/uploads/\nsites/43/2013/04/20082912/C5_APT_SKHack.pdf\n\n[5. http://www.estsoftinc.com/](http://www.estsoftinc.com/ )\n\n6. https://analyze.intezer.com/analyses/be4ba3bc-70a2-43ba-b4c91f0818fde8c9\n\n7. https://securelist.com/winnti-faq-more-than-just-a-game/57585/\n\n8. https://attack.mitre.org/groups/G0044/\n\n\n-----\n\n##### IOCs\n\n**Binaries**\n\n**TYPE** **FILE** **NAME**\n\n**LEGITIMATE SIGNED**\n**GOOGLEUPDATE** debug.exe\n\n**SIDELOADED MALICIOUS** goopdate.dll\n**GOOPDATE.DLL**\n\n**ENCRYPTED CLAMBLING** English.rtf\n**PAYLOAD**\n\n**ENCRYPTED PLUGX** license.rtf\n**PAYLOAD**\n\n**C2s**\n\n**http://www.kkxx888666[.]com**\n\n**http://www.betwln520[.]com**\n\n\n-----\n\n##### YARA Rules\n\nOur YARA rules are publicly available at:\n[https://github.com/Profero-SecurityJoes/yara](https://github.com/Profero-SecurityJoes/yara)\n```\nrule clambling_backdoor {\n  meta:\n    author = \"Daniel Bunce | SecurityJoes\"\n    description = \"Detect Clambling Backdoor through Strings and\nKeylogger Encryption Algorithm\"\n\n```\nstrings:\n$str0 = \"[%02d:%02d:%02d %04d-%02d-%02d ] |%s | %s | %s\" wide\n$str1 = \"%s | [%04d-%02d-%02d %02d:%02d:%02d] | %s | %s \" wide\n$str2 = \"%s\\\\*.log\" wide\n$str3 = \"GetRawInputData\"\n$str4 = \"RegisterRawInputDevices\"\n$str5 = \"WTSEnumerateSessionsW\"\n$str6 = \"CreateEnvironmentBlock\"\n$str7 = \"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ\"\n$str8 = \"Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\" wide\n\n$rtti1 = \"PortMap\" nocase\n$rtti2 = \"KeyLog\" nocase\n$rtti3 = \"Telnet\" nocase\n$rtti4 = \"Screen\" nocase\n$rtti5 = \"Shell\" nocase\n$rtti6 = \"FileManager\" nocase\n$rtti7 = \"Plugin\" nocase\n\n$re1 = /\\x80([\\xC0-\\xFF])(.)\\x80([\\xC0-\\xFF])(.)\\x80([\\xC0-\\xFF])\n(.)/\n```\n  condition:\n\n```\nuint16(0) == 0x5A4D and 3 of ($str*) and any of ($rtti*) and $re1\n```\n}\n\n```\n\n-----\n\n###### APT27 Turns to Ransomware |\n\n\n###### Global Threat Center, Intelligence Team\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://shared-public-reports.s3-eu-west-1.amazonaws.com/APT27+turns+to+ransomware.pdf",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.01.04.APT27_Ransomware/APT27%2Bturns%2Bto%2Bransomware.pdf"
    ],
    "report_names": [
        "APT27+turns+to+ransomware.pdf",
        "APT27+turns+to+ransomware"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041757,
    "ts_creation_date": 1608815339,
    "ts_modification_date": 1608815342,
    "files": {
        "pdf": "https://archive.orkl.eu/449c50fa76fa2545a649262dfe8fff05b2fcedf3.pdf",
        "text": "https://archive.orkl.eu/449c50fa76fa2545a649262dfe8fff05b2fcedf3.txt",
        "img": "https://archive.orkl.eu/449c50fa76fa2545a649262dfe8fff05b2fcedf3.jpg"
    }
}