{
    "id": "23d5a59b-596e-4822-8bcf-d239a71acf00",
    "created_at": "2023-01-12T15:04:47.708461Z",
    "updated_at": "2025-03-27T02:17:24.66416Z",
    "deleted_at": null,
    "sha1_hash": "656b03054e3f09f5f3ab01473591315390e17234",
    "title": "2020-05-07 - Naikon APT- Cyber Espionage Reloaded",
    "authors": "",
    "file_creation_date": "2022-05-28T18:08:41Z",
    "file_modification_date": "2022-05-28T18:08:41Z",
    "file_size": 3005262,
    "plain_text": "# Naikon APT: Cyber Espionage Reloaded\n\n**research.checkpoint.com/2020/naikon-apt-cyber-espionage-reloaded/**\n\nMay 7, 2020\n\n## Introduction\n\n\nMay 7, 2020\n\n\nRecently Check Point Research discovered new evidence of an ongoing cyber espionage operation against several national government\nentities in the Asia Pacific (APAC) region. This operation, which we were able to attribute to the Naikon APT group, used a new backdoor\nnamed Aria-body, in order to take control of the victims’ networks.\n\n[In 2015, an extensive report by ThreatConnect and Defense Group revealed the APT group’s infrastructure and even exposed one of the](https://threatconnect.com/blog/camerashy-intro/)\ngroup’s members. Since this report, no new evidence has come to light of further activity by the group, suggesting that they had either gone\nsilent, increased their emphasis on stealth, or drastically changed their methodology of operations. That is, until now.\n\nIn the following report, we will describe the tactics, techniques, procedures and infrastructure that have been used by the Naikon APT group\nover the 5 years since the last report, and offer some insight into how they were able to remain under the radar.\n\n## Targeting\n\nBy comparing with previously reported activity, we can conclude that the Naikon APT group has been persistently targeting the same region in\nthe last decade. In operations following the original 2015 report, we have observed the use of a backdoor named Aria-body against several\nnational governments, including Australia, Indonesia, the Philippines, Vietnam, Thailand, Myanmar and Brunei.\n\nThe targeted government entities include ministries of foreign affairs, science and technology ministries, as well as government-owned\ncompanies. Interestingly, the group has been observed expanding its footholds on the various governments within APAC by launching attacks\nfrom one government entity that has already been breached, to try and infect another. In one case, a foreign embassy unknowingly sent\nmalware-infected documents to the government of its host country, showing how the hackers are exploiting trusted, known contacts and using\nthose them to infiltrate new organizations and extend their espionage network.\n\nGiven the characteristics of the victims and capabilities presented by the group, it is evident that the group’s purpose is to gather intelligence\nand spy on the countries whose Governments it has targeted. This includes not only locating and collecting specific documents from infected\ncomputers and networks within government departments, but also extracting data from removable drives, taking screenshots and keylogging,\n\n\n-----\n\na d o cou se a est g t e sto e data o esp o age d t at as t e oug, to e ade detect o e access g e ote se e s t oug\nsensitive governmental networks, the group compromised and used servers within the infected ministries as command and control servers to\ncollect, relay and route the stolen data.\n\nTargeted countries\n\n## Infection Chains\n\nThroughout our research, we witnessed several different infection chains being used to deliver the Aria-body backdoor. Our investigation\nstarted when we observed a malicious email sent from a government embassy in APAC to an Australian state government, named `The`\n```\nIndians Way.doc . This RTF file, which was infected (weaponized) with the RoyalRoad exploit builder, drops a loader named intel.wll\n\n```\ninto the target PC’s Word startup folder. The loader in turn tries to download and execute the next stage payload from\n```\nspool.jtjewifyn[.]com .\n\n```\nThis is not the first time we have encountered this version of the RoyalRoad malware which drops a filename named `intel.wll – the`\n**[Vicious Panda APT group, whose activities we reviewed in March 2020, utilizes a very similar variant.](https://research.checkpoint.com/2020/vicious-panda-the-covid-campaign/)**\n\nOverall, during our investigation we observed several different infection methods:\n\nAn RTF file utilizing the RoyalRoad weaponizer.\nArchive files that contain a legitimate executable and a malicious DLL, to be used in a DLL hijacking technique, taking advantage of\nlegitimate executables such as Outlook and Avast proxy, to load a malicious DLL.\nDirectly via an executable file, which serves as a loader.\n\n**Infection chain examples**\n\n## Infrastructure\n\nIn recent operations, the attackers used the same hosting and DNS services for most of their C&C servers: GoDaddy as the registrar and\n**Alibaba for hosting the infrastructure. On several occasions, the attackers even reused the same IP address with more than one domain:**\n\n\n-----\n\nMaltego –\n\nlatest infrastructure overview\n[A full view of the entire infrastructure is available here.](https://research.checkpoint.com/wp-content/uploads/2020/05/maltego_naikon-scaled.jpg)\n\nIn order to get a clearer picture of how the attackers operated their infrastructure throughout the years, we have plotted the various malicious\ndomains, according to the ASN they were hosted on, based on periodic passive DNS information. The results are presented in the figure\nbelow:\n\nCorrelation\n\nbetween domains and ASNs over time\n**Observations:**\n\nSeveral domains were utilized for a very long time.\nMultiple domains jumped to the same new ASN within a short time frame.\nSince 2019, most of the infrastructure has been concentrated on ASN 45102 (Alibaba).\nIn some occasions, the attackers would change the IP address / server, on the same ASN (represented by two consecutive incidental\nASN’s on the graph).\n\nIn addition, one of the more interesting infrastructure properties we observed, is the possible use of hacked government infrastructures as C&C\nservers. In one of the samples we analyzed, `outllib.dll ( 63d64cd53f6da3fd6c5065b2902a0162 ), there is a backup C&C server which is`\nconfigured as `202.90.141[.]25 – an IP which belongs to the Philippines department of science and technology.`\n\n## Tool Analysis\n\nIn the following section, we will dive into the technical analysis of the Aria-body backdoor, utilized throughout the observed activity, as well as\nan analysis of the loader executable that comes before it.\n\nUtilizing the loader at an early stage of an infection allows the attackers to establish a persistent presence on the target’s network, as well as\nperform basic reconnaissance, before using their more advanced tools. While we observed Aria-body backdoor variants being compiled as\nearly as 2018, we have observed Aria-body’s loaders going back to 2017.\n\n\n-----\n\n### Loader Analysis\n\nThe functionality of the Aria-body **loader has not changed significantly since 2017, but the implementation varied from version to version.**\n**This loader appears to be specifically created for the Aria-body backdoor.**\n\nOverall, the loader is responsible for the following tasks:\n\n1. Establish persistence via the `Startup folder or the Run registry key (some variants).`\n2. Inject itself to another process such as `rundll32.exe and` `dllhost.exe (some variants).`\n3. Decrypt two blobs: Import Table and the loader configuration.\n4. Utilize a DGA algorithm if required.\n5. Contact the embedded / calculated C&C address in order to retrieve the next stage payload.\n6. Decrypt the received payload DLL (Aria-body backdoor).\n7. Load and execute an exported function of the DLL – calculated using `djb2 hashing algorithm.`\n\nMain logic of the loader – entering dga_method only if dga_seed ≠ 0\n\n**Loader: Configuration & DGA**\n\nThe loader configuration comes encrypted and contains the following information: C&C domain, port, user-agent and a seed for the Domain\nGeneration Algorithm (DGA). In case seed is not zero, the loader uses a DGA method to generate its C&C domain, based on the seed and the\ncalendar day of the communication. The configuration of the loader is decrypted using the following algorithm:\n```\ndef decrypt_buf(buf):\n  k = 8\n  j = 5\n  for i in range(len(buf)):\n    xor_byte = (k + j) % 0xff\n    buf[i] = buf[i] ^ xor_byte\n    j = k\n    k = xor_byte\n\n```\nConfiguration decryption algorithm\n\nThe DGA method is fully described in Appendix B.\n\n**Loader: C&C Communication**\n\nAfter getting the C&C domain, the loader contacts it to download the next and final stage of the infection chain. Although it sounds simple, the\nattackers operate the C&C server in a limited daily window, going online only for a few hours each day, making it harder to gain access to the\nadvanced parts of the infection chain.\n\n**Loader: Next stage payload**\n\nAt the next and final stage of the loader, the downloaded RAT is decrypted using a single byte XOR key, received from the C&C. Once the\nRAT’s DLL is downloaded and decrypted, the DLL is loaded into the memory. The loader will then check the exported function against a\nhardcoded `djb2 hash value, and will call it upon a match.`\n\n\n-----\n\n### Aria-body RAT analysis\n\nThe downloaded payload is a custom RAT dubbed Aria-body, based on the name given by the authors: `aria-body-dllX86.dll .`\n\nAlthough the below analysis is of the 32bit variant malware, we have observed a 64bit variant as well, with similar functionality.\n\nStrings found inside the “Aria-body” backdoor\n\nThe RAT includes rather common capabilities of a backdoor, including:\n\nCreate/Delete Files/Directories\nTake a screenshot\nSearch file\nLaunch files using `ShellExecute`\nEnumerate process loaded modules\nGather files’ metadata\nGather TCP and UDP table status listing\nClose a TCP session\nCollect OS information\nVerify location using `checkip.amazonaws.com`\n(Optional) Inter-process pipe based communication\n\nSome of Aria-body variations also included other modules such as:\n\nUSB data gathering module\nKeylogger module to collect raw input device-based keystrokes – added by February 2018\nReverse socks proxy module – added by February 2018\nLoading extensions module – added by December 2019\n\nAll the supported functionality of the backdoor is described in the table of Appendix A.\n\n**Unique Characteristics**\n\nIn the following section, we go over some of the techniques by which the backdoor was implemented, and highlight the characteristics that\nmight help other researchers recognize this backdoor and correlate it with other samples.\n\n**Initialization**\n\nAs previously mentioned, the backdoor contains an exported function, which the previous loader calls after loading the payload into the\nmemory. Upon executing the backdoor, it initializes a struct named `MyDerived and several structs used for HTTP and TCP connection.`\n\n**Information Gathering**\n\n**Aria-body starts with gathering data on the victim’s machine, including:**\n\nHost-name, computer-name, username, domain name, windows version, processor ~MHz, MachineGuid, 64bit or not, and public IP (using\n```\ncheckip.amazonaws.com ).\n\n```\nAria-body using checkip.amazonaws.com service to get victim’s IP\n\n\n-----\n\ns data s gat e ed to a o at o st uctu e c t e ps t a 8 bytes a do ge e ated pass o d, c s t e O ed t\none byte.\n\n**C&C Communication**\n\nThe communication to the C&C server is available by either HTTP or TCP protocols. The malware decides which protocol to use by a flag in\nthe configuration of the loader. The collected data is sent to the C&C domain along with the XORed password, and the XOR key in the\nfollowing format:\n\nC&C communication structure\n\nWhether the message is sent by TCP or HTTP, the payload format is the same. However, when HTTP is selected, the following GET request\nformat is used:\n```\nhttps://%s:%d/list.html?q=<random string>\n\n```\n\nAfter the initial request to the C&C server, the backdoor then keeps listening to additional commands from the server. When a command is\nreceived, it is matched against a list of commands, and executed accordingly. A full list of supported commands is available in Appendix A.\n\n### The Outlook DLL Variant\n\nDuring our research we have found another, quite a unique variant of Aria-body, uploaded to VirusTotal from the Philippines. This variant’s\nDLL was named `outllib.dll, and it was part of a RAR archive named` `Office.rar . It utilized a DLL side-loading technique, abusing an`\nold Outlook executable.\n\nWhat was unusual in this variant was the fact that there has no loader as part of the infection chain, unlike all the other versions of Aria-body.\nAs a result, it did not get any configuration from the loader, and included hardcoded configuration within it.\n\nThe payload has two different C&C domains:\n```\n   blog.toptogear[.]com – which it gets by XORing an encrypted string with the byte 0x15 .\n   202.90.141[.]25 – an IP associated with a Philippine government website, which is being used in case that the first C&C domain\n\n```\ncannot be resolved.\n\nUsage of Philippines govt’ C&C server as backup\n\nThis variant also has some extra features that the main variant of Aria-body does not include, such as a USB-monitor module. On the other\nhand, this variant is missing the keylogger component and the reverse-socks module, observed with the main Aria-body variants. This\nevidence suggests that this is an out of scope variant of the backdoor, tailored for a specific operation.\n\nMoreover, we have seen that Aria-body’s main variant has a version that was compiled sometime after `outlib.dll variant was, and some`\nstrings within this variant could suggest that it was a test variant of this special version:\n\n\n-----\n\n“TEST” string as part of the connection struct of “outllib.dll”\n\nFinally, this version of Aria-body includes the following string: `c:\\users\\bruce\\desktop\\20190813\\arn\\agents\\verinfo.h, with the “ar” in`\n“arn” possibly standing for “Aria”.\n\n## Attribution\n\nWe were able to attribute our campaign to the Naikon APT group using several similarities we observed to the previously disclosed information\n[about Naikon’s activity by Kaspersky in 2015: 1,](https://securelist.com/the-naikon-apt/69953/) [2. In this original operation, the Naikon APT group utilized a backdoor against different](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07205555/TheNaikonAPT-MsnMM1.pdf)\ngovernment institutions in APAC.\n\nGoing forward, we will refer to the backdoor analyzed by Kaspersky as XsFunction due to PDB path found in one of its samples:\n```\ng:\\MyProjects\\xsFunction\\Release\\DLL.pdb\n\n```\n\n**XsFunction is a full featured backdoor which supports 48 different commands. It allows the attacker to gain full control on the victim computer,**\nperform file and process operations, shell commands execution, as well as to upload and download data and additional plugins.\n\nWe were able to find several similarities to previous operations (besides the obvious overlap in targeting), as well as specific similarities to the\n**XsFunction backdoor.**\n\n**String Similarity**\n\n**Aria-body backdoor has several debug strings that describe the functionality of the malware.**\n\nSome of these exact debug strings, can also be found in the XsFunction backdoor:\n\nStrings found in Aria-body backdoor\n\nStrings found in XsFunction (d085ba82824c1e61e93e113a705b8e9a)\n\n**Hashing Function Similarity**\n\nBoth XsFunction and Aria-body loaders utilize the same hashing algorithm `djb2 to find which exported function should be run. In`\n**XsFunction the name of that function is** `XS02 and in Aria-body it is` `AzManager .`\n\n\n-----\n\nXsFunction loader (Image by Kaspersky)\n\nAria-body loader\n\n**Code Similarity**\n\nSome functions in the Aria-body backdoor are identical to functions used in the old XsFunction backdoor. One example is the function which\ngathers information about the installed software on the PC:\n\n### Infrastructure overlap\n\nFour of our C&C servers shared IPs with `mopo3[.]net domain, this domain resolves to the same IP as the domain mentioned in Kaspersky’s`\nreport: `myanmartech.vicp[.]net .`\n\n\n-----\n\nMaltego – graph of\n\ninfrastructure overlap\n\n## Conclusion\n\nIn this campaign, we uncovered the latest iteration of what seems to be a long-running Chinese-based operation against various government\nentities in APAC. This specific campaign leveraged both common toolsets like RoyalRoad RTF weaponizer, as well as a specially crafted\nbackdoor named Aria-body.\n\nWhile the Naikon APT group has kept under the radar for the past 5 years, it appears that they have not been idle. In fact, quite the opposite.\nBy utilizing new server infrastructure, ever-changing loader variants, in-memory fileless loading, as well as a new backdoor – the Naikon APT\ngroup was able to prevent analysts from tracing their activity back to them.\n\n**Check Point SandBlast Agent** **[protects against such APT attacks, and is capable of preventing them from the very first step.](https://www.checkpoint.com/products/advanced-endpoint-protection/)**\n\n### Appendix A: Aria-body – Supported Commands\n\n\n**Command ID (Sent from**\n**C&C)**\n\n\n**Sub Command ID (Sent**\n**from C&C)**\n\n\n**Description** **Command add date**\n\n\n**0x1** 0x0 Gather installed software’s information –\n\n**0x2** 0x0 Get Disks information –\n\n**0x2** 0x1 File Search by name –\n\n**0x2** 0x2 Find Directory –\n\n**0x2** 0x4 Create Directory –\n\n**0x2** 0x6 SHFileOperaion – Delete Directory –\n\n**0x2** 0x7 SHFileOperaion – rename file –\n\n**0x2** 0x9 Delete File in a given path –\n\n**0x2** 0xa ShellExecute ‘open’ command –\n\n**0x2** 0xb ShellExecute ‘open’ command –\n\n**0x2** 0xe Create new file and write its data –\n\n**0x3** 0x0 Get active processes information –\n\n**0x3** 0x2 Terminate Process –\n\n\n-----\n\n**0x3** 0x3 Get loaded modules information –\n\n\n**0x4** all Unique modules command: ARN – USB monitor\nmodule\n\n**0x4** all Unique modules command: aria-body – reverse socks\nproxy module\n\n\nonly in outllib.dll\nvariant\n\nFeb 2018 – not in\noutllib.dll\n\n\n**0x5** 0x0 Get MD5 of file –\n\n**0x6** 0x0 Get titles of running windows –\n\n**0x6** 0x1 Send WM_CLOSE message to given window name –\n\n**0x7** 0x0 Get TCP and UDP tables –\n\n**0x7** 0x1 Close given TCP connection –\n\n**0x8** 0x0 Start keylogger Feb 2018 – not in\noutllib.dll\n\n**0x8** 0x1 Stop keylogger Feb 2018 – not in\noutllib.dll\n\n**0X9** 0X0 Inject itself into rundll32.exe – spawn module July 2018 – not in\noutllib.dll\n\n**0X9** 0X1 Inject itself into rundll32.exe with UAC July 2018 – not in\noutllib.dll\n\n**0X9** 0X2 Inject itself to every process except explorer.exe July 2018 – not in\noutllib.dll\n\n**0xa** 0x1 Collect services data Dec 2018 – not in\noutllib.dll\n\n**0xaa** 0x1 Load extensions Dec 2018 – not in\noutllib.dll\n\n**0xaa** 0x2 ‘runas’ with given process –\n\n**0xaa** 0x3 Zip-Directory –\n\n**0xaa** 0x4 Create Process and inject itself into it. –\n\n**0xaa** 0x5 UAC method (duplicate token from ntprint.exe) –\n\n**0xaa** 0x6 Send screenshot –\n\n**0xaa** 0x7 Send command to given extension Dec 2018 – not in\noutllib.dll\n\n**0xaa** 0x9 Destruction method Dec 2018 – not in\noutllib.dll\n\n## Appendix B: DGA method\n```\ndef DGA_method(seed_value):\n  domain = \"\"\n  tld = [\".com\", \".org\", \".info\"]\n  ta = time.localtime(time.time())\n  temp1 = math_s(ta.tm_year)\n  temp2 = math_s(dword(temp1 + ta.tm_mon + 0x11FDA))\n  temp3 = math_s(dword(temp2 + ta.tm_mday))\n  temp4 = math_s(dword(seed_value + temp3))\n  temp5 = math_s(dword(temp4 + 9))\n  length = (temp5 % 0xe) + 8\n  if length > 0:\n    for i in range(length):\n      temp6 = math_s(i + temp5)\n      domain += chr ( ( temp6 % 0x1a) + 0x61)\n      temp5 = math_s(dword(temp6 + 0xcdcdef))\n  domain += tld[temp6 % 3]\n  print(domain)\n\n```\n\n-----\n\n## Appendix C: IOC list\n\n**Delivery:**\n\n**MD5** **SHA-1** **SHA-256**\n\nf9d71f32de83f9ecfdc77801a71da7bf 560423901a746055a4890c87dabe2c2a59ee917a d6841b2a82904efc52c6b0b9375ddd3aa70de360c\n\n08428c94f45fb8ff568a4a288778dfb7 00934d22fb37b2def8276bc22ace5dc950b66227 7df5442e5c334eb81a2f871623fcbed859148223ef\n\n5e37131cbd756e10a9392d2280907592 c0c39b4ffe6fa7ff627654fbdd53a3bf638da4cb 6a8f59ad46ad22f272d5617e8d8101af820772abd5\n\n**Aria-body loaders – 32bit**\n\ne9a23e084eb8cf95b70cde3afc94534b 96a918b4e54090c0294470c872c1b2075af1a822 1747fb340794c0c4e746b86c9a77fc568042be9d1\n\n8561fa029f2158dc9932deee61febdac 3cecff13388d6ab45797ca2455caf5fd04ca9dd9 fe845ac7525daa5050dc17ca90352afe0f53c04a26\n\n31a4400789ae43b255464481320baa9e 1e3f303bbb35e709ff9d962c28c071656070aa98 8c38a9f38fd472867479cbaab9c138df616e60e3bb\n\n32b1916abff8bf0e7c51a2584c472451 513d99d714985ab53d75894357e4e87c69374862 a9f0df941172cc4a9c8b242fd41094033e15fa9c5e3\n\nc2dc85559686575c268c8e97205b7578 b01d9454d84d04dd7a594dd2f899c77a40248618 fe02467d457e214e82a561de7cfa5e534efdb6beba\n\nb779742b94b9265338c9b21f0cc88ba4 3f7190d530a98e157d799bdbe4fef8e69f1c50de f31a5d3d586924ea2fe274cc644e3d9501efcc452c\n\nca3d5f02f453455f2b5522b8dceca658 0289a6db2fdda581b413768cd9318f33b5c005e7 ca2da542ffdbf551a1fa46d073c63162747df7ab45b\n\nbd1ef60ee835dd996ddcf4f22adaa142 1d7056e1bec6fadfba8b69d725e4a930bdb6fa40 510d91994c02e92e5354a9cdd51fd2be23583779e\n\n1dd0e12a886f3d1bded6e26f53592720 896e44af5a6f88c7be21d2f7225462f273f067f5 4dcac1b42a0d2308136ce87db28856f1c1888dea0\n\n07f724bdc662518ce6eac0ca723c929f 1eb758bcb0fc640835962aaa80199bdc867c79e7 45f2dbc7240023308e3193f29cc68320a176714e4\n\ndde75e82b665fc7d47cd870dae2db302 2f17d1f1766b2814d6347763c9ad94863e5bd35c 249ca984c1a508c4adbd58c3e3675bf22c8e36475\n\n20cdf05867967642742d6b947ba71284 31cf5cb37d1d6e62add2cd4e59c2821a1a3c54e5 a5a0f9117a49ad7246882c938017a6f603180b37e\n\n9b0cb194dd5e49ab6fbf490de42e6938 396c0c1dce196e9dc4e65aeb57d2bd1ec5e85ba9 1732639fe36c3ffbe860c09a3b8b92115f31e94e93\n\nb8292fe24db8f86b11e6bf303c5f3ac5 69ea467bdfe5b7739553da7f93096a3ac944270c bfdf1c7437189306998cf6b9f1197bd5c77d85ae55\n\n357a9f8268438d487303b267b26bde65 722b3dafbc14f8dce1048264451017d3f473f1ac 7b336c7828027d6080617e0a619a0eb048be3c97\n\n40c49ecbe1b7bd0dbb935138661b6ca4 fe84b53aa8bb4e8ac3d2d9f86d2397d4a3cf5c08 0db51c4a2bd94f2b56f821a013fa42e0e67e3a7b69\n\n85e5d261c810e13e781f24505bb265ce 6a5a96f5637c898c0792ca9e76fc1854cf960d59 d389780b530557e4076eecfd0b2f92c955c581b23\n\n77ea1eb5f6fd2605454764cd9b7ef62e 653aae2210a256a00ead6495e2c128d36d2ed531 3d0e3136ed28397eaf4414aaa072ab11a1787ae09\n\nab260f3dc1ead01dfc6b7139d1eb983c c2d3d9d7d7b64bbc6e522695105c31d5f1185800 d29692b12f865e5480ae97b507ccec96b32ab6784\n\n897994f378577ec1e09eaeb953cf603f 799ffe499b1a0d4b58ad9fa7b065b03432b96a09 7463d0f064a31b61ffedd0895ab242700d0d80fc2fa\n\n1f8f70afcd1a29920cb75e403bc590ff 441dfedf0583e799d2b37619316f8d924250d878 741597e84ddd01ada0183d1345fd9e1a611cc2848\n\n3d0320af4aeffa12660a3d4d8d6a5cf8 9dcf0be40d415c9cd86df39d608046a845b4a9e3 ee345b36a171cad3e0d3d010c0869901582de6a9\n\n**Aria-body loaders – 64bit**\n\nb65e38b86bdd048638e17487a9cce181 6fbd039cbdf2137a64390b80ba473949a3db5965 9033c75777e32c4014914272f78917e3d409c3191\n\n97f3d2710d7b05fda7e53bda3cdbb3c8 088a603d6d144abb40145b6426acdad4b5813942 481a7868effd2d356f85d9372d1ab5e35e9345e5c1\n\n**Aria-body payload**\n\n2ce4d68a120d76e703298f27073e1682 a84bde7bd58616e6f20ba106ca6ef138e8cb6904 4cab6bf0b63cea04c4a44af1cf25e214771c4220ed4\n\na8ee5b59d255a13172ec4704915a048b 48d4fe2ca8e4d71eaa8dead6bae629de47ef77a7 04416f97890a7bbee354e1382b40823dfd74a69a23\n\n\n-----\n\ne4f097ff8ce8877a6527170af955fc9b 4e76ad95cbfea448cb177c2de9c272141c11b8f4 2b67693cd1ba08b502d02e63550ad438b12b93b35\n\n537b21c71eb8381ed7d150576e3e8a48 be04013156a96ffb50646c5de1b9a1d7de99f0d1 9728197c938baddbd638279f4bd5168c8ace09c5e3\n\n43798a772bc4c841fc3f0b0aa157c1df 3223e64a1bfb25bc5ea95890ca438232adcc7c35 6e1591f794feca36f5aca5999f367525f58008c27220\n\nc4397694368a0bfcb27ee91457878ef1 608f101efc89fbaf3aa7737b248a91c3d7540d9d 7b4adfb5a6779bd0c89c470ed9aeea0e3a352e6d9e\n\n**Outlib.dll**\n\n63d64cd53f6da3fd6c5065b2902a0162 09690a61e5271619910a32efdc91e756d0a6dc1e f0e40b94e5e4ccbf94c94843dd1eb8db21e36f5ec5d7\n\n**C&C Servers**\n\nrealteks.gjdredj[.]com\n\nspool.jtjewifyn[.]com\n\nblog.toptogear[.]com\n\nmon-enews[.]com\n\nwdrfjkg129[.]com\n\nn91t78dxr3[.]com\n\nkyawtun119[.]com\n\nwww.ajtkgygth[.]com\n\nnews.nyhedmgtxck[.]com\n\ndathktdga[.]com\n\nwww.rrgwmmwgk[.]com\n\ndns.jmrmfitym[.]com\n\nwww.kyemtyjah[.]com\n\nrad.geewkmy[.]com\n\ncpc.mashresearchb[.]com\n\nwww.qisxnikm[.]com\n\ndns.seekvibega[.]com\n\nsugano.trictalmk[.]com\n\nbbs.forcejoyt[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-07 - Naikon APT- Cyber Espionage Reloaded.pdf"
    ],
    "report_names": [
        "2020-05-07 - Naikon APT- Cyber Espionage Reloaded.pdf"
    ],
    "threat_actors": [
        {
            "id": "30ed778d-15b3-484e-a90b-e1e05b36a42f",
            "created_at": "2023-01-06T13:46:38.290626Z",
            "updated_at": "2025-03-27T02:00:02.795711Z",
            "deleted_at": null,
            "main_name": "APT30",
            "aliases": [
                "G0013"
            ],
            "source_name": "MISPGALAXY:APT30",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f5c5d5d4-3969-4e34-9982-55144c3908eb",
            "created_at": "2022-10-25T16:07:24.37846Z",
            "updated_at": "2025-03-27T02:02:10.200339Z",
            "deleted_at": null,
            "main_name": "Vicious Panda",
            "aliases": [
                "Bronze Dudley"
            ],
            "source_name": "ETDA:Vicious Panda",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "BBSRAT",
                "Byeby",
                "Cmstar",
                "Enfal",
                "Lurid",
                "Pylot",
                "RoyalRoad",
                "Travle",
                "meciv"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ad154227-6fcf-43c5-a540-0c09534e040f",
            "created_at": "2024-05-01T02:03:07.952927Z",
            "updated_at": "2025-03-27T02:05:17.267077Z",
            "deleted_at": null,
            "main_name": "BRONZE GENEVA",
            "aliases": [
                "BRONZE STERLING ",
                "CTG-5326 ",
                "Naikon ",
                "Override Panda ",
                "APT30 "
            ],
            "source_name": "Secureworks:BRONZE GENEVA",
            "tools": [
                " ShadowPad",
                "Lecna"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2912fc0-c34e-4e4b-82e9-665416c8fe32",
            "created_at": "2023-04-20T02:01:50.979595Z",
            "updated_at": "2025-03-27T02:00:02.79494Z",
            "deleted_at": null,
            "main_name": "Naikon",
            "aliases": [
                "BRONZE GENEVA",
                "G0019",
                "Naikon",
                "BRONZE STERLING",
                "G0013",
                "PLA Unit 78020",
                "OVERRIDE PANDA",
                "Camerashy"
            ],
            "source_name": "MISPGALAXY:Naikon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f1ce7e3-77cd-4af0-bedb-1643f55c9baf",
            "created_at": "2022-10-25T15:50:23.31611Z",
            "updated_at": "2025-03-27T02:00:55.439974Z",
            "deleted_at": null,
            "main_name": "Naikon",
            "aliases": [
                "Naikon"
            ],
            "source_name": "MITRE:Naikon",
            "tools": [
                "ftp",
                "netsh",
                "WinMM",
                "Systeminfo",
                "RainyDay",
                "RARSTONE",
                "HDoor",
                "Sys10",
                "SslMM",
                "PsExec",
                "Tasklist",
                "Aria-body"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e79c98d-c678-4f28-b869-5723a78e71f4",
            "created_at": "2023-01-06T13:46:39.422441Z",
            "updated_at": "2025-03-27T02:00:03.08607Z",
            "deleted_at": null,
            "main_name": "Vicious Panda",
            "aliases": [
                "SixLittleMonkeys"
            ],
            "source_name": "MISPGALAXY:Vicious Panda",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b69484be-98d1-49e6-aed1-a28dbf65176a",
            "created_at": "2022-10-25T16:07:23.886782Z",
            "updated_at": "2025-03-27T02:02:10.014032Z",
            "deleted_at": null,
            "main_name": "Naikon",
            "aliases": [
                "Hellsing",
                "ITG06",
                "Lotus Panda",
                "Naikon",
                "Operation CameraShy"
            ],
            "source_name": "ETDA:Naikon",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "AR",
                "ARL",
                "Agent.dhwf",
                "Aria-body",
                "Aria-body loader",
                "Asset Reconnaissance Lighthouse",
                "BackBend",
                "Creamsicle",
                "Custom HDoor",
                "Destroy RAT",
                "DestroyRAT",
                "Flashflood",
                "FoundCore",
                "Gemcutter",
                "HDoor",
                "JadeRAT",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "LadonGo",
                "Lecna",
                "Living off the Land",
                "NBTscan",
                "Naikon",
                "NetEagle",
                "Neteagle_Scout",
                "NewCore RAT",
                "Orangeade",
                "PlugX",
                "Quarks PwDump",
                "RARSTONE",
                "RainyDay",
                "RedDelta",
                "RoyalRoad",
                "Sacto",
                "Sandboxie",
                "ScoutEagle",
                "Shipshape",
                "Sisfader",
                "Sisfader RAT",
                "Sogu",
                "SslMM",
                "Sys10",
                "TIGERPLUG",
                "TVT",
                "TeamViewer",
                "Thoper",
                "WinMM",
                "Xamtrav",
                "XsFunction",
                "ZRLnk",
                "nbtscan",
                "nokian",
                "norton",
                "xsControl",
                "xsPlus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535887,
    "ts_updated_at": 1743041844,
    "ts_creation_date": 1653761321,
    "ts_modification_date": 1653761321,
    "files": {
        "pdf": "https://archive.orkl.eu/656b03054e3f09f5f3ab01473591315390e17234.pdf",
        "text": "https://archive.orkl.eu/656b03054e3f09f5f3ab01473591315390e17234.txt",
        "img": "https://archive.orkl.eu/656b03054e3f09f5f3ab01473591315390e17234.jpg"
    }
}