{
    "id": "248e8736-433b-4421-8093-1eaff8067387",
    "created_at": "2023-01-12T15:04:30.797579Z",
    "updated_at": "2025-03-27T02:17:11.196448Z",
    "deleted_at": null,
    "sha1_hash": "acd755d829092233030bea3a1bc1858a00fb9b76",
    "title": "2016-09-28 - Belling the BEAR",
    "authors": "",
    "file_creation_date": "2022-05-28T21:52:58Z",
    "file_modification_date": "2022-05-28T21:52:58Z",
    "file_size": 3854604,
    "plain_text": "# Belling the BEAR\n\n**threatconnect.com/blog/russia-hacks-bellingcat-mh17-investigation/**\n\nSeptember 28, 2016\n\n## ThreatConnect reviews activity targeting Bellingcat, a key contributor in the MH17 investigation.\n\n_Read the full series of ThreatConnect posts following the DNC Breach: “Rebooting Watergate: Tapping into the_\n_[Democratic National Committee“, “Shiny Object? Guccifer 2.0 and the DNC Breach“, “What’s in a Name Server?“,](https://threatconnect.com/guccifer-2-0-dnc-breach/)_\n_[“Guccifer 2.0: the Man, the Myth, the Legend?“, “Guccifer 2.0: All Roads Lead to Russia“, “FANCY BEAR Has an (IT)](https://threatconnect.com/reassesing-guccifer-2-0-recent-claims/)_\n_[Itch that They Can’t Scratch“, “Does a BEAR Leak in the Woods?“, and “Russian Cyber Operations on Steroids“.](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)_\n\n### [UPDATE] October 7th 2016\n\nIntroduction\n\n[Since posting about the DNC hack, each time we published a blog post on a BEAR-based topic we thought it was going](https://threatconnect.com/blog/tapping-into-democratic-national-committee/)\nto be our last. But like the Death Star’s gravitational pull, the story keeps drawing us back in as new information comes\n[to light. Following our post on DCLeaks as a Russian influence operation,](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/) [Bellingcat founder Eliot Higgins reached out](https://www.bellingcat.com/)\nto us. Bellingcat, a group of citizen investigative journalists, has published articles critical of Russia and has been a key\n[contributor to the international investigation of the shootdown of Malaysian Airlines Flight 17 (MH17) over Ukraine in](https://en.wikipedia.org/wiki/Malaysia_Airlines_Flight_17)\n2014.\n\nHiggins shared data with ThreatConnect that indicates Bellingcat has come under sustained targeting by Russian threat\nactors, which allowed us to identify a 2015 spearphishing campaign that is consistent with FANCY BEAR’s tactics,\ntechniques, and procedures. We also analyzed a February 2016 attack by CyberBerkut — a group claiming to be proRussian Ukrainian hacktivists but also a suspected front for Moscow — against Russia-based Bellingcat contributor\n[Ruslan Leviev, where CyberBerkut defaced the Bellingcat website and leaked Leviev’s personal details. As evidenced](https://twitter.com/RuslanLeviev)\nby these efforts and [the attack on the World Anti-Doping Agency, organizations that negatively impact Russia’s image](https://threatconnect.com/blog/fancy-bear-anti-doping-agency-phishing/)\ncan expect Russian cyber operations intended to retaliate publicly or privately, influence, or otherwise maliciously affect\nthem. The [Diamond Model below summarizes the activity that Bellingcat experienced.](http://www.activeresponse.org/the-diamond-model/)\n\n\n-----\n\n### Bellingcat Background\n\n[Bellingcat is a group of citizen investigative journalists — named after a classic fable — that uses open source](https://en.wikipedia.org/wiki/Belling_the_cat)\ninformation, such as photos and videos posted on social media, maps, and publicly available satellite imagery.\nBellingcat articles have focused on a variety of current events in Africa, the Middle East, the U.S., and Europe with a\nspecific focus on notable conflicts related to Syria, Ukraine, and Russia.\n\nBellingcat published its first post on July 5, 2014, and for the next twelve days focused mainly on the ongoing Syrian\ncivil war, covering developments such as the use of chemical weapons, but also occasionally pointing out Russian\ninvolvement. On July 17, 2014, Malaysian Airlines Flight 17 crashed in pro-Russian rebel territory in eastern Ukraine\n[and Bellingcat released their first post on the topic. Over the next two years, Bellingcat would publish no fewer than 92](https://www.bellingcat.com/resources/case-studies/2014/07/17/geolocating-the-missile-launcher-linked-to-the-downing-of-mh17/)\nposts from at least 8 [contributors focused on Russian involvement in the downing of MH17, using open source](https://www.bellingcat.com/contributors/)\ninformation and imagery to prove the presence of the Russian military in eastern Ukraine and that a Russian-supplied\nBuk missile launcher shot down MH17 from pro-Russian rebel territory. The Kremlin vehemently denies this.\n\n[The Dutch took the lead in the criminal investigation through an international Joint Investigation Team (JIT) and officially](https://www.om.nl/onderwerpen/mh17-crash/)\nconsidered Bellingcat’s reporting in their investigation. Founder Eliot Higgins was included as an official witness. The\n[Dutch Safety Board ultimately found MH17 was shot down by a Russian-made surface-to-air missile but declined to](https://www.washingtonpost.com/news/worldviews/wp/2015/10/13/a-dutch-report-will-say-what-downed-mh17-it-wont-blame-the-russians/)\n[assign blame for who was responsible for the launch. On September 28, the JIT is due to release the results of their](http://www.nltimes.nl/2016/08/22/mh17-dutch-criminal-investigation-results-ready-sept-28/)\ncriminal investigation.\n\nCompromising Bellingcat contributors could provide Russian intelligence services with journalists’ contacts and sources,\npersonal information, insight into future reporting perceived as indemnifying Russia, as well as sensitive personal\ninformation. Such collection could facilitate influence operations and retaliation efforts against Bellingcat, or access that\ncould be leveraged for follow-on operations. Compromising Bellingcat contributors’ accounts could also provide access\nto communications with the JIT, offering a glimpse at how the investigation of the downing of MH17 was proceeding.\n\n### Activity Targeting Bellingcat\n\n\n-----\n\n_Timeline_\n\nThe timeline below summarizes the notable dates related to the MH17 crash and investigation, Bellingcat’s articles\nrelated to those events, and the malicious activity targeting Bellingcat and Leviev. It’s important to note we do not have\ncomplete insight into all of the malicious activity that may have targeted Bellingcat during this timeframe.\n\n_FANCY BEAR_\n\nFrom February 2015 to July 2016 three researchers at Bellingcat — Higgins, Aric Toler, and Veli-Peka Kivimaki — who\nhad contributed MH17 articles received numerous spearphishing emails, with Higgins alone receiving at least 16\nphishing emails targeting his personal email account. A majority of the campaign took place from February to\nSeptember 2015, with some activity resuming in May 2016. These spearphishing attempts consist of a variety of\nspoofed Gmail security notices alerting the target that suspicious activity was detected on their account. The target is\nprompted to click a URL resembling a legitimate Gmail security link to review the details of this suspicious activity. Below\nare screenshots of some of the spearphishing email targeting Bellingcat researchers.\n\n\n-----\n\n-----\n\n-----\n\nThe attackers used several methods to redirect the target to credential harvesting pages. In at least 21 of the emails, the\nURL redirects the victim to a shortened Bitly URL. These shortened Bitly links, in turn, direct the victim to another\n[Google-spoofing URL appended with the base64 encoded target email and name. One of the emails used a shortened](https://en.wikipedia.org/wiki/Base64)\nTINYCC URL to achieve the same effect. In four of the other emails, the security links direct the target to a Google Sites\npage that spoofs a Google login page. Once the target visits the Bitly, TINYCC, or Google Sites URLs, they are\nprompted to enter their Google credentials, which would then be captured by the threat actors.\n\nThe specifically crafted URLs with target-specific strings are consistent with a FANCY BEAR technique highlighted in\n[Dell Secureworks research and](https://www.secureworks.com/research/threat-group-4127-targets-hillary-clinton-presidential-campaign) [employed against a DNC staffer whose files were leaked on DCLeaks. Reviewing the](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\nclick information for the Bitly links, we identified that at least three of the Bitly URLs targeting the same Bellingcat\nindividual were accessed in the timeframe consistent with the spearphishing attack. This suggests the individual clicked\non the links in three of the spearphishing messages, but Bellingcat confirms that no credentials were supplied to these\npages.\n\n\n-----\n\nOther consistencies with Russia and FANCY BEAR activity were also identified. In early May and again in mid-June\n2016 the Bellingcat contributor Aric Toler’s personal email address was targeted by FANCY BEAR. Using\nThreatConnect’s Email Import function, we are able to identify that both messages abused Moscow-based Yandex email\nservices to send malicious emails to the researcher. In the May phishing example FANCY BEAR used the Yandex\naccount berg01berg01@yandex[.]com.\n\nIn the June 2016 example, Toler was targeted with a message that used hellomail1@yandex[.]com in a manner\nconsistent with how Billy Rinehart was targeted prior to content from his personal Gmail being posted to DCLeaks.\n\n\n-----\n\nBy analyzing the email headers provided by Bellingcat, we identified domains and corresponding IP addresses that the\nattackers leveraged as part of the spearphishing operation. The table below also shows the registrant for the domain,\nthe creation date for the WHOIS record, and the name server the domain used during the attack timeframe.\n\n\n**Name Server During**\n**Attack**\n\nCarbon2u.com\n\nCata501836.earth.orderboxdns.com\n\nCarbon2u.com\n\nCata501836.earth.orderboxdns.com\n\nCarbon2u.com\n\nCarbon2u.com\n\n\n**Spearphishing Domain** **Mailserver IP** **Domain Registrant**\n\n\nmxx.evrosatory[.]com\n\naccounts.servicegoogle[.]com\n\nmxx.us-westmailundeliversystem[.]com\n\nmx1.servicetransfermail[.]com\n\naccounts.google.com.rnil[.]am\n\nmx6.set132[.]com\n\n\n46.22.208.204\n\n155.254.36.155\n\n46.22.208.204\n\n95.153.32.53\n\n198.105.122.187\n\n198.105.122.187\n\n\nandre_roy@mail.com\n\ntheforeignnews@gmail.com\n\nandre_roy@mail.com\n\ntheforeignnews@gmail.com\n\nPrivate\n\nemmer.brown@mail.com\n\n\n**Domain**\n**Create**\n**Date**\n\n2/13/14\n\n5/22/15\n\n2/28/14\n\n6/3/15\n\n7/7/14\n\n9/30/14\n\n\nserver.mx4.set132[.]com 46.22.208.204 emmer.brown@mail.com 9/30/14 Carbon2u.com\n\n[The domains evrosatory[.]com,us-westmail-undeliversystem[.]com have been previously identified by Pricewaterhouse](http://pwc.blogs.com/files/tactical-intelligence-bulletin---sofacy-phishing-.pdf)\nCoopers as FANCY BEAR, and the domain servicetransfermail[.]com closely resembles the servicetransferemail[.]com\n[infrastructure that German Intelligence (BvF) established as FANCY BEAR within Cyber Brief Nr. 01/2016.](https://www.verfassungsschutz.de/download/broschuere-2016-03-bfv-cyber-brief-2016-01.pdf)\n\n[FANCY BEAR also previously used both the Cata501836 and Carbon2u name servers to host infrastructure and email](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\naddresses from 1&1’s mail.com to [register domains. We were able to identify further overlaps with other FANCY BEAR](https://threatconnect.com/blog/fancy-bear-it-itch-they-cant-scratch/)\ninfrastructure by pivoting off of these indicators, which we will describe in a later blog post. Based on these\n\n\n-----\n\nconsistencies, we assess FANCY BEAR almost certainly is behind the spearphishing and credential harvesting\ncampaign targeting Eliot Higgins and other Bellingcat researchers.\n\n_CyberBerkut Activity_\n\n[CyberBerkut describes itself as a group of pro-Russian Ukrainian hacktivists. They borrow the “Berkut” name from the](https://en.wikipedia.org/wiki/Berkut_(special_police_force))\n[now disbanded Ukrainian riot police who responded brutally to the 2014 EuroMaidan demonstrations in Kiev.](https://www.netflix.com/title/80031666)\n[CyberBerkut runs a digitally-fueled, aggressive, active measures campaign directed against a pro-western government](https://en.wikipedia.org/wiki/Active_measures)\nin Kiev and points of western influence — such as NATO — in eastern Europe.\n\nCyberBerkut has conducted attacks across a spectrum of technical sophistication including distributed denial of service\nattacks (DDOS), disrupting and degrading the networks of Ukraine’s [Central Election Commission during the 2014](https://ccdcoe.org/sites/default/files/multimedia/pdf/CyberWarinPerspective_full_book.pdf)\nelection, [hacking Ukrainian billboards and displaying pro-Russian messages, conducting computer network exploitation](https://www.youtube.com/watch?v=E8A2MIkiavE)\n[and strategic leaks of emails and documents, and leaking intercepted phone calls between high ranking Ukrainian](https://www.youtube.com/watch?v=Wkicw3EolCg)\nofficials. This range suggests highly capable actors are behind CyberBerkut and they employ a high degree of\noperational planning when considering the offensive use of information and their effects.\n\nCyberBerkut [defaced the Bellingcat webpage on February 10, 2016, claiming credit for the attack and singling out](https://twitter.com/bellingcat/status/697334674029412353)\nRuslan Leviev, a Russian opposition blogger and Bellingcat contributor.\n\n[Leviev published a compelling piece of citizen journalism on May 22, 2015 exploring the fate of Russian Spetsnaz](https://www.bellingcat.com/news/uk-and-europe/2015/05/22/three-graves/)\nsoldiers believed to have been killed in combat operations within Ukraine earlier that month. According to Bellingcat\nfounder Higgins, Leviev’s contributor account was compromised and used to post the CyberBerkut message. In an\nemail interview, Leviev makes the following statement regarding the events that led to the compromise of his credentials\nand the defacement.\n\n_In my case, my old email account, which was located on Yandex servers, was hacked. The email account had a long,_\n_difficult password, not a word, from various letters, numbers, and special symbols. Plus there was a telephone number_\n_bound to the account for second factor authentication._\n\n_Exactly how it was hacked — I don’t know._\n\n1. Either they as employees, or with their active assistance, intercepted the SMS authentication code.\n\n\n-----\n\n2. Or they, again, as an officer from the authorities or with their active assistance, gained direct access to the Yandex\n\n_Mail servers where they seized the email from my old inbox._\n3. Or they know about a vulnerability in Yandex email that nearly nobody else knows about.\n\n_Having seized the old email inbox, they used the password recovery mechanism for LiveJournal. My LiveJournal_\n_account (which I have not used for a long time) was connected to my old email address, but LiveJournal does not_\n_provide second factor authentication. Via password recovery of my LiveJournal from my stolen email, they took over my_\n_LiveJournal account and made a post._\n\n_In the same stolen email account, they found my username and password for my account at Bellingcat (I had once_\n_published an investigation directly on the Bellingcat website) and they published a post there in my name._\n\n_At the same time, my icloud account was not setup for second factor authentication, and was connected only to my old_\n_email address for password recovery, it was also taken over. They performed a password recovery via my stolen email_\n_address for icloud, logged in, but I received a notification on my iPhone about it, and I quickly cut off their access, but_\n_they were able to download some photos._\n\n_They also tried to hack my Facebook and Twitter. They were unable to crack Facebook, because I had second factor_\n_authentication and always need to enter the code generated by the Facebook app. They were able to login to Twitter_\n_and change the password but nothing was deleted and they didn’t tweet anything. I restored the password._\n\n_Based on all the data, I assume that, as in the case of Alburovym, Kozlovsky, Parkhomenko, this was the activity of_\n_security services who intercepted the SMS containing the access code. So they got access to my old email account and_\n_they also gained access to my Twitter account (which was also under two-factor, but code is sent via SMS rather than_\n_generated in an app)._\n\n_Of my social networks where two-factor codes are generated via an application, they were unable to crack. Of my social_\n_networks where the two-factor code was sent via SMS, they were able to crack._\n\nLeviev suggests the attackers had direct access to Yandex mail servers or were able to intercept the SMS message\nused for two factor authentication to compromise his old Yandex email account. Leviev goes on to describe that the\nactors then used emails from that old account to compromise his iCloud account and access pictures and other\ninformation saved from Leviev’s phone to iCloud. Some of this information was ultimately put in a February 24, 2016\npost on CyberBerkut’s website that contained sensitive details of Leviev’s personal life, such as his pictures, phone\nnumber, address, passport scan, girlfriend’s name, and dating and sexual preferences.\n\nThese attacks were an overt attempt to discredit Bellingcat research and Leviev, but also carried a message to others\nwho publicly voice positions critical of Moscow that this form of journalism does not go unnoticed. We also found it\ninteresting how much effort was expended and the degree of sources and methods exposed to achieve a simple\ndefacement. We do not know whether the attackers intercepted Leviev’s SMS-based two-factor authentication or had\ndirect access to Yandex mail servers, but either tactic is more suggestive of a state-backed actor as opposed to\nindependent hacktivists.\n\n### CyberBerkut and FANCY BEAR: Not the Same, But Showing Up to the Same Party\n\nThroughout our research, we have focused on FANCY BEAR, an advanced persistent threat (APT) group assessed to\nbe Russian government. CyberBerkut, on the other hand, was a referential data point when we looked at precedence for\n[pro-Russian proxies interfering with elections. CrowdStrike assessed in its 2015 Global Threat Report “there are](https://go.crowdstrike.com/rs/281-OBQ-266/images/15GlobalThreatReport.pdf)\nindications that CyberBerkut has ties to Russian state security,” but the degree of Russian government control over the\ngroup is disputed.\n\nThe timing of the FANCY BEAR spearphishing campaigns and the CyberBerkut attack against Leviev are interesting.\nThe concerted FANCY BEAR spearphishing efforts over a six month timeframe in 2015 shows Moscow’s clear intent to\ncompromise Bellingcat, most likely due to their posts on key current events involving Russia. This activity was followed\nby a hard stop and then additional targeted efforts by CyberBerkut in early 2016, which was in-turn followed by\nadditional FANCY BEAR spearphishing from May to July 2016. A key assumption underlying any assessment about\nhow these activities are related stems from how an analyst assesses the motives for targeting Leviev.\n\n\n-----\n\nWe came up with two scenarios:\n\n_Stronger/Closer Coordination Between FANCY BEAR and CyberBerkut. In this scenario, the activities against Bellingcat_\nare coordinated with these two entities handing off operations. The timing suggests that the state actors, looking to\ncompromise Bellingcat, pivoted to a more aggressive attack against Leviev when the initial spearphishing campaign\nfailed to yield the desired results. Leviev is targeted more aggressively as a means to get at Bellingcat and since he\nlives in Russia, state actors would have additional tools in their kit to intercept his SMS two-factor authentication\nmessages or gain direct access to Yandex’s mail servers. In this scenario, CyberBerkut functions as much as a strategic\nmessaging outlet as the actual attacker and is subject to a much greater degree of direction and control from Moscow\nthan previously assessed.\n\n_The Common Enemies Approach: Weaker/Less Coordination Between FANCY BEAR and CyberBerkut. In this_\nscenario, the spearphishing campaigns conducted by FANCY BEAR are distinct in purpose and perpetrator from the\nCyberBerkut attack against Leviev. The spearphishing campaigns are more focused on Bellingcat’s coverage of the\nMH17 shootdown and involvement in the JIT investigation. CyberBerkut targets Leviev separately after his coverage of\nRussian military involvement in eastern Ukraine with some assistance from supportive friends in Moscow to compromise\nhis Yandex account. Targeting Leviev is less about a broader compromise of Bellingcat and more about harassing one\njournalist. In this scenario, CyberBerkut is advancing Moscow’s interests and can call on the Russian intelligence\nservices, but is still a distinct group.\n\n### Leak Sites Leaking Over\n\nWe looked to see if we could identify other overlaps between FANCY BEAR and CyberBerkut that would help us assess\nwhich of these two scenarios was more likely. Through our research into the Bellingcat activity, we found some\nsurprising content overlaps with DCLeaks — another assessed Russian influence outlet — and a CyberBerkut pattern of\nregistering infrastructure that FANCY BEAR also uses. These developments move the needle slightly towards a more\ncoordinated relationship between the two groups, but not decisively.\n\n_Comparing DCLeaks and CyberBerkut_\n\nIn [our previous post, we identified a website called DCLeaks as a Russian-backed influence outlet. Information shared](https://threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\nwith ThreatConnect indicates that there is an association of some kind between the Guccifer 2.0 persona and the\nDCLeaks website. Shortly after publication, we became aware of a cache of documents leaked on the DCLeaks site.\nThe files were allegedly obtained via a compromise of an organization affiliated with George Soros. It is interesting to\nnote that earlier in 2016 CyberBerkut also published files purportedly associated with Soros.\n\n[Analysis conducted by Anton Cherepanov, a security researcher who works for ESET, suggests that the content of the](https://twitter.com/cherepanov74/status/764948917939212289)\n[two leaks are similar with at least three of the Soros documents being found on both sites. The acquisition and](https://foreignpolicy.com/2016/08/22/turns-out-you-cant-trust-russian-hackers-anymore/)\npublication of documents belonging to, or in some way associated with, the same individual is of interest as overlaps in\ntargeting and potential similarities in stolen content could be indicative of a connection between DCLeaks and\nCyberBerkut. Further, as we have identified that there is a connection from DCLeaks to Guccifer 2.0 and from Guccifer\n2.0 to FANCY BEAR, the overlap in leaked documents may suggest that both leak sites obtained their data from the\nsame collection source, FANCY BEAR.\n\nWhile this alone isn’t enough to verify a relationship between the sites, there are some other interesting similarities.\nDespite their statuses as a U.S.-focused whistleblower and hacktivist group respectively, the websites of both DCLeaks\nand CyberBerkut primarily host content that is critical of individuals and governments perceived to oppose Russian\nforeign and domestic policies. Both sites attempt to appeal to civilian masses in the U.S. and Ukraine respectively by\ncalling attention to purported in the political systems.\n\n_Aleksandr Panchenko_\n\nCyberBerkut’s main domain, cyber-berkut[.]org, was registered using privacy protection through the registrar Internet.bs\nand shortly thereafter hosted using CloudFlare infrastructure. Several other CyberBerkut-related domains redirect to this\nwebsite. Most of these domains were also registered using privacy protection, but one domain, cyber-berkut[.]net was\n\n\n-----\n\nregistered by Aleksandr Panchenko using the email address alex_panchenko@mail[.]com. The same day the domain\nwas registered through Reg.ru, it was later routed to CloudFlare infrastructure, suggesting that this domain was not\nopportunistically procured by a domain registrant in hopes they could sell it to the CyberBerkut actors.\n\nAdditional research into this name and email address identifies six other CyberBerkut-related domains, none of which\nare active currently, registered by this individual:\n\nCyber-berkut[.]su\nCyber-berkut[.]tk\nCyber-berkut[.]us\nCyber-berkut[.]me\nCyber-berkut[.]cz\nCyber-berkut[.]im\n\nWhile certainly not definitive, the use of a mail.com email address to register domains is consistent with recently\n[identified FANCY BEAR registration activity against the DCCC,](https://threatconnect.com/blog/fancy-bear-it-itch-they-cant-scratch/) [WADA, and CAS.](https://threatconnect.com/blog/fancy-bear-anti-doping-agency-phishing/)\n\n### Tracing out FB Infrastructure Based on Bellingcat Input\n\nThe activity that Bellingcat alerted us to provided a plethora of domains, IP addresses, email addresses, and other\nregistration and hosting information for us to pivot off of to identify other pertinent infrastructure. In an upcoming blog\npost, we’ll seek to identify as much FANCY BEAR infrastructure and aliases as possible using the ThreatConnect\nplatform and capabilities from some of our industry partners.\n\nReviewing the CATA501836 and Carbon2u name servers, we were able to identify dozens of active domains that fit the\nFANCY BEAR mold and likely spoof organizations that Moscow would seek to compromise.\n\nPivoting off of Bellingcat’s email headers we were able to identify hundreds of domains and IPs, and dozens of email\naddresses and aliases most likely used by FANCY BEAR, some of which were not previously identified. This review\nprimarily identified historical FANCY BEAR information, but the conclusions from it help verify FANCY BEAR TTP\nassessments, provide additional targeting context, and may be useful in retrospective reviews of malicious activity.\n\n**Conclusion**\n\n\n-----\n\nThe campaign against Bellingcat provides yet another example of sustained targeting against an organization that\nshines a light on Russian perfidy. The spearphishing campaign is classic FANCY BEAR activity while CyberBerkut’s role\nraises yet more questions about the group’s ties to Moscow. These end-to-end cyber operations begin with targeting\nand exploitation and end with strategic leaks and other active measures employed against those with whom they\ndisagree.\n\nThese efforts go above and beyond traditional intelligence requirements such as gaining insight into a sensitive project\nor sources. Vilifying the messenger and dumping their personal data is part of the game, intended to intimidate and\nembarrass those that speak ill of Moscow. If Russia is willing to go to these lengths to compromise a small journalist\norganization and its contributors, consider what they are willing to do to major news and media outlets that publish\nsimilar articles. While many organizations remain reticent to share information, this knowledge is the prerequisite to\nestablishing how widespread such efforts are and the adversary’s modus operandi.\n\nThe BEARs win if their active measures campaigns push, scare, or intimidate their targets into doing what they want. If\nyou encounter a BEAR, you’re doing something right. Don’t back down. And turn on two-factor authentication for\neverything.\n\n## Update\n\nOn October 5 2016, probable FANCY BEAR actors again sent a spearphishing message to a Bellingcat contributor. This\nspearphishing message spoofed Google security services, similar to those previously used to target Bellingcat.\n\n\n-----\n\nFANCY BEAR used a shortening service to mask the malicious link, similar to the previous messages, but it appears the\nactors attempted to obfuscate their activity by using two separate shortening services to hide the final malicious link.\nThe tiny.cc link that is in the spearphishing message actually points to a TinyURL shortened URL.\n\nThe TinyURL in turn points to the below URL:\n\n\n-----\n\nhxxp://myaccount.google.com changepassword securitypagesettingmyaccountgooglepagelogin.id833[.]ga\n\nThis URL is appended with a target-specific base64 encoded string as was seen in the previous spearphishing\nmessages targeting Bellingcat and others.\n\nThe id833[.]ga domain is hosted at the 89.40.181[.]119 IP (Bucharest, RO) which also hosts the domain id834[.]ga.\nThere is a subdomain for the id834[.]ga similar to the URL above that is also hosted at the same IP. This suggests that\nthe id834[.]ga domain has also been operationalized, though we have no information indicating who has been targeted\nwith it. The WHOIS records for these domains did not contain any additional information on the registrants or other\ndomains they may have registered.\n\nUsing ThreatConnect’s Email Import feature, we identified that the spearphishing message was sent through Yandex\nmail servers using the email address g.mail2017@yandex[.]com.\n\n\n-----\n\nThis was the first identified spearphish against Bellingcat since July 2016 and suggests that FANCY BEAR activity\nagainst them is ongoing. Other organizations involved in the MH17 investigation that would draw Moscow’s ire should\nbe on the lookout for similar activity.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-09-28 - Belling the BEAR.pdf"
    ],
    "report_names": [
        "2016-09-28 - Belling the BEAR.pdf"
    ],
    "threat_actors": [
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535870,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653774778,
    "ts_modification_date": 1653774778,
    "files": {
        "pdf": "https://archive.orkl.eu/acd755d829092233030bea3a1bc1858a00fb9b76.pdf",
        "text": "https://archive.orkl.eu/acd755d829092233030bea3a1bc1858a00fb9b76.txt",
        "img": "https://archive.orkl.eu/acd755d829092233030bea3a1bc1858a00fb9b76.jpg"
    }
}