{
    "id": "249970f2-4b0d-4e12-a945-c122b70314d0",
    "created_at": "2023-01-12T15:07:29.315369Z",
    "updated_at": "2025-03-27T02:05:45.135266Z",
    "deleted_at": null,
    "sha1_hash": "6721100d7d29dea9fcf6a659ed554619ae91c32a",
    "title": "2021-07-18 - Revealed- murdered journalist’s number selected by Mexican NSO client",
    "authors": "",
    "file_creation_date": "2022-05-28T05:04:16Z",
    "file_modification_date": "2022-05-28T05:04:16Z",
    "file_size": 4548234,
    "plain_text": "# Revealed: murdered journalist’s number selected by Mexican NSO client\n\n**theguardian.com/news/2021/jul/18/revealed-murdered-journalist-number-selected-mexico-nso-client-cecilio-pineda-**\nbirto\n\nNina Lakhani July 18, 2021\n\nThis article is more than 10 months old\nThis article is more than 10 months old\n\nPineda’s press credentials among belongings kept by his wife. After going freelance in 2012\nhe quickly gained a reputation for exclusive crime scene reports. Composite: Nina Lakhani\nPineda’s press credentials among belongings kept by his wife. After going freelance in 2012\nhe quickly gained a reputation for exclusive crime scene reports. Composite: Nina Lakhani\nOn 2 March 2017, Cecilio Pineda Birto made a broadcast about alleged corruption. Hours\nlater he was dead\n\nThe hitmen came for Cecilio Pineda Birto as he swung in a hammock at a carwash, waiting\nfor his pickup to be cleaned.\n\n\n-----\n\n[The 38-year-old freelance reporter was shot dead on 2 March 2017 in Ciudad Altamirano, a](https://www.theguardian.com/world/2017/mar/03/journalist-killed-cecilio-pineda-birto-mexico)\ntown in the southern Mexican region of Tierra Caliente – a battleground for rival organised\ncrime factions.\n\nA few hours earlier, Pineda had in a broadcast on Facebook Live accused state police and\nlocal politicians of colluding with a violent local capo known as El Tequilero.\n\nIn previous weeks, Pineda had received a string of anonymous death threats. At about the\nsame time, his mobile phone number was selected as a possible target for surveillance by a\nMexican client of the spyware company NSO Group.\n\nQuick Guide\n\n**What is in the Pegasus project data?**\n\nShow\n**What is in the data leak?**\n\nThe data leak is a list of more than 50,000 phone numbers that, since 2016, are believed to\nhave been selected as those of people of interest by government clients of NSO Group,\nwhich sells surveillance software. The data also contains the time and date that numbers\nwere selected, or entered on to a system. Forbidden Stories, a Paris-based nonprofit\njournalism organisation, and Amnesty International initially had access to the list and shared\naccess with 16 media organisations including the Guardian. More than 80 journalists have\nworked together over several months as part of the Pegasus project. Amnesty’s Security\nLab, a technical partner on the project, did the forensic analyses.\n\n**What does the leak indicate?**\n\nThe consortium believes the data indicates the potential targets NSO’s government clients\nidentified in advance of possible surveillance. While the data is an indication of intent, the\npresence of a number in the data does not reveal whether there was an attempt to infect the\nphone with spyware such as Pegasus, the company’s signature surveillance tool, or whether\nany attempt succeeded. The presence in the data of a very small number of landlines and\nUS numbers, which NSO says are “technically impossible” to access with its tools, reveals\nsome targets were selected by NSO clients even though they could not be infected with\nPegasus. However, forensic examinations of a small sample of mobile phones with numbers\non the list found tight correlations between the time and date of a number in the data and the\nstart of Pegasus activity – in some cases as little as a few seconds.\n\n**What did forensic analysis reveal?**\n\nAmnesty examined 67 smartphones where attacks were suspected. Of those, 23 were\nsuccessfully infected and 14 showed signs of attempted penetration. For the remaining 30,\nthe tests were inconclusive, in several cases because the handsets had been replaced.\n\n\n-----\n\nFifteen of the phones were Android devices, none of which showed evidence of successful\ninfection. However, unlike iPhones, phones that use Android do not log the kinds of\ninformation required for Amnesty’s detective work. Three Android phones showed signs of\ntargeting, such as Pegasus-linked SMS messages.\n\nAmnesty shared “backup copies” of four iPhones with Citizen Lab, a research group at the\nUniversity of Toronto that specialises in studying Pegasus, which confirmed that they showed\nsigns of Pegasus infection. Citizen Lab also conducted a peer review of Amnesty’s forensic\nmethods, and found them to be sound.\n\n**Which NSO clients were selecting numbers?**\n\nWhile the data is organised into clusters, indicative of individual NSO clients, it does not say\nwhich NSO client was responsible for selecting any given number. NSO claims to sell its\ntools to 60 clients in 40 countries, but refuses to identify them. By closely examining the\npattern of targeting by individual clients in the leaked data, media partners were able to\nidentify 10 governments believed to be responsible for selecting the targets: Azerbaijan,\nBahrain, Kazakhstan, Mexico, Morocco, Rwanda, Saudi Arabia, Hungary, India, and the\nUnited Arab Emirates. Citizen Lab has also found evidence of all 10 being clients of NSO.\n\n**What does NSO Group say?**\n\nYou can read NSO Group’s [full statement here. The company has always said it does not](https://www.theguardian.com/news/2021/jul/18/response-from-nso-and-governments)\nhave access to the data of its customers’ targets. Through its lawyers, NSO said the\nconsortium had made “incorrect assumptions” about which clients use the company’s\ntechnology. It said the 50,000 number was “exaggerated” and that the list could not be a list\nof numbers “targeted by governments using Pegasus”. The lawyers said NSO had reason to\nbelieve the list accessed by the consortium “is not a list of numbers targeted by governments\nusing Pegasus, but instead, may be part of a larger list of numbers that might have been\nused by NSO Group customers for other purposes”. They said it was a list of numbers that\nanyone could search on an open source system. After further questions, the lawyers said the\nconsortium was basing its findings “on misleading interpretation of leaked data from\naccessible and overt basic information, such as HLR Lookup services, which have no\nbearing on the list of the customers' targets of Pegasus or any other NSO products ... we still\ndo not see any correlation of these lists to anything related to use of NSO Group\ntechnologies”. Following publication, they explained that they considered a \"target\" to be a\nphone that was the subject of a successful or attempted (but failed) infection by Pegasus,\nand reiterated that the list of 50,000 phones was too large for it to represent \"targets\" of\nPegasus. They said that the fact that a number appeared on the list was in no way indicative\nof whether it had been selected for surveillance using Pegasus.\n\n**What is HLR lookup data?**\n\n\n-----\n\nThe term HLR, or home location register, refers to a database that is essential to operating\nmobile phone networks. Such registers keep records on the networks of phone users and\ntheir general locations, along with other identifying information that is used routinely in\nrouting calls and texts. Telecoms and surveillance experts say HLR data can sometimes be\nused in the early phase of a surveillance attempt, when identifying whether it is possible to\nconnect to a phone. The consortium understands NSO clients have the capability through an\ninterface on the Pegasus system to conduct HLR lookup inquiries. It is unclear whether\nPegasus operators are required to conduct HRL lookup inquiries via its interface to use\nits software; an NSO source stressed its clients may have different reasons – unrelated to\nPegasus – for conducting HLR lookups via an NSO system.\n\nA successful infection enables an NSO client to access everything on the device, including\ncontacts, chat messages – and precise location. Pineda’s phone disappeared from the scene\nof his murder, so a forensic examination to determine if it was targeted or infected with\nspyware was not possible.\n\nThe gunmen who murdered him could have learned of his location at a public carwash\nthrough means not related to NSO’s technologies, or its clients. But his attackers knew\nexactly where to find him, even though the hammock where he lay was not visible from the\nstreet.\n\n“People with power can do whatever they want to anyone,” said his widow, Marisol Toledo,\nwhen told Pineda had been selected for potential targeting. “If they succeeded [in infecting\nhis phone], they would have known where he was at all times.”\n\n[locator map grey version](https://interactive.guim.co.uk/uploader/embed/2021/07/pineda-map-zip/giv-825XE89gJCMA2Px/)\nOne of the alleged hitmen was found dead a few months later, but no one has been\nprosecuted over the murder.\n\nNSO says its products are only licensed for use by its clients to fight serious crime and\nterrorism. Yet at least 26 Mexican journalists’ phone numbers appear on the leaked data\nsuggesting persons of interest to NSO customers between 2016 and 2017.\n\nThose whose phone numbers appear on the list include freelance investigative reporters,\nsenior editors from the country’s major news organisations and the former New York Times\nbureau chief Azam Ahmed. The data, accessed by Forbidden Stories and Amnesty\nInternational, was shared with the Guardian and its 15 media partners.\n\n\n-----\n\nThe carwash where Pineda was shot dead on 2 March 2017.\nWhile the leak reveals phones that were selected as possible targets by NSO’s government\nclients, it is not possible to say whether phones were successfully infected with spyware\nwithout forensic analysis of a device.\n\nLawyers for NSO Group did not comment on whether Pineda’s phone had been targeted\nusing its software. However, they said “even if” that were correct, “that does not mean that\nthe NSO Group client or data collected by NSO Group software were in any way connected\nto the journalist’s murder the following month. Correlation does not equal causation, and the\ngunmen who murdered the journalist could have learned of his location at a public carwash\nthrough any number of means not related to NSO Group, its technologies, or its clients.”\n\nPegasus: the spyware technology that threatens democracy – video\n[Mexico is the world’s most dangerous country for reporters outside of warzones. Last month,](https://www.theguardian.com/world/2020/dec/06/murder-in-mexico-journalists-caught-in-the-crosshairs-regina-martinez-cartel-project)\n[two journalists were killed within a week, bringing the death toll to at least 86 since 2010,](https://www.theguardian.com/world/2021/jun/17/mexico-journalists-killed-reporters)\naccording to the Committee to Protect Journalists. Those most at risk are reporters who\n[investigate the webs of influence and interest woven by organised crime, the security forces](https://www.theguardian.com/world/2020/dec/06/murder-in-mexico-journalists-caught-in-the-crosshairs-regina-martinez-cartel-project)\nand corrupt officials.\n\nIt’s not the narcos who have absolute power – it’s the narco-politicians.\n\nIn Tierra Caliente, where Pineda lived and died, such pacts have long enabled cartels and\npoliticians to cement their power and control this strategically important corridor used to\ntransport drugs, arms and people.\n\n\n-----\n\nThis hot, dry region is [heavily militarised, with federal and state security forces and](https://www.theguardian.com/world/2012/nov/30/mexico-drug-war-tierra-caliente-calderon)\nintelligence agencies all operating in the region.\n\nLocal journalists must navigate opaque rules and direct threats dictating what must and\ncannot be covered. Reporters’ salaries are extremely low, and many – as Pineda did – rely\non so-called gratitude payments for covering events.\n\n“This is the precarious reality in which Cecilio had to support his family, and while there’s no\njustification for accepting payments or gifts, you have to understand the context in which\njournalists live, work and die in Guerrero,” said Vania Pigeonutt, a journalist specialising in\norganised crime. “It’s impossible to keep everyone happy. And it’s not the narcos who have\nabsolute power – it’s the narco-politicians.”\n\nPineda was afraid of blood, but when he went freelance in 2012 he quickly developed a\nreputation for exclusive reports from crime scenes. Toledo and former colleagues described\nhim as hard-working, outgoing and socially minded – but also as a womaniser who liked to\nshow off with fake designer clothes and cars bought on credit.\n\nHe did not smoke, drink alcohol or take drugs, but loved to eat tacos and watch movies with\nhis two daughters. The family lived in one room, a sweltering converted garage at his\nmother’s house.\n\n“My son told me not to be scared, that he’d be fine,” said his mother, Crizanta Birto Melecio,\n71, wiping away tears. “But he said: ‘If something happens to me, it will be the politicians.’”\n\nPineda frequently changed numbers because he feared his could be compromised,\naccording to his colleagues and family. At one point, the transcript of a conversation between\nPineda, a colleague and a source was published in a national newspaper.\n\n\n-----\n\nPineda with his friend Agustín Hernández, right.\nLike most local crime reporters, Pineda frequently received death threats. But while other\njournalists often tried to avoid trouble through self-censorship, Pineda played down the risks,\nsaid Agustín Hernández, a close friend and former colleague. “Cecilio would get into\nproblems because he was so direct. We would tell him to take it easy but he always said\neverything would be fine,” he said.\n\nStill, Pineda had panic attacks and insomnia, and in 2015 he contacted the federal protection\nmechanism for human rights workers and journalists, a quasi-independent agency within the\nhome affairs ministry.\n\nThe Guardian obtained a recording of Pineda’s final meeting with the mechanism in October\n2016, when he voiced fears about a threat from the town of San Miguel Totolapan. The\nofficials acknowledged the gravity of the situation but closed Pineda’s case because he\nrefused to relocate to another state.\n\nIn the recording, he says he is managing the risks: “The people who could do me harm could\nhire killers, but they wouldn’t know my whereabouts.”\n\nA few weeks later he was selected as a possible target for surveillance by an NSO client.\n\n\n-----\n\nA picture of Pineda is displayed on his coffin.\nSan Miguel Totolapan is a mountainous municipality about 30 miles (50km) south-east of\nCiudad Altamirano, and one of Guerrero’s main heroin poppy-growing areas.\n\nAt the time, the area was controlled by Los Tequileros, a local gang faction that split from the\n[Familia Michoacana cartel in about 2012 and launched a wave of mass kidnappings that left](https://www.theguardian.com/world/2009/jul/05/la-familia-mexico-drug-cartel)\ndozens dead.\n\n[According to multiple sources, the political godfather of Los Tequileros was Saúl Beltrán](https://www.milenio.com/estados/fiscal-acusa-diputado-guerrero-tequilero-numero)\nOrozco, a local politician from the then ruling Institutional Revolutionary party (PRI). He has\ndenied the allegations. Beltrán was also the local campaign coordinator for Héctor Astudillo,\nwho was elected as state governor after pledging to bring “order and peace”.\n\n\n-----\n\n[In December 2016, armed locals captured the mother and friends of Los Tequileros chief in](https://www.theguardian.com/world/2016/dec/13/mexico-drug-leader-mother-kidnapped-vigilantes-totolapan)\nretaliation for the latest kidnappings. This new faction presented itself as a group of ordinary\ncitizens fed up with crime, and Pineda sympathised with their cause, said Israel Flores, a\nlocal journalist. “He started naming the politicians who he believed to be responsible for what\nwas happening. This was a mistake.”\n\nBut the group was actually aligned with the Familia Michoacana cartel, which was trying to\nrecover lost territory. It is unclear if Pineda knew this, though he reported extensively on the\ncrisis, accusing the state governor and security forces of protecting Los Tequileros.\n\nAs the violence intensified, one of NSO’s Mexican clients again highlighted Pineda’s phone\nnumber. Around the same time, the phone numbers of Beltrán and Astudillo also appeared in\nthe data – as did the state’s chief prosecutor, Xavier Olea, who would later investigate the\njournalist’s death. Forensic analysis to determine whether the telephones of Beltrán,\nAstudillo or Olea were targeted was not possible.\n\nNeither Astudillo nor Beltrán responded to a request for comment.\n\nOlea, who was Guerrero’s attorney general between December 2015 and April 2018, had\nhimself been given a demonstration of Israeli spyware. In an interview, he described how in\nearly 2016 he was visited by two businessmen – an Israeli and a Mexican – who had been\nrecommended by the federal anti-kidnapping commission.\n\nThe men said their software was capable of listening to calls and downloading WhatsApp\nmessages. As part of their demonstration, they hacked the phone of Olea’s wife.\n\nOlea said he was impressed by the technology, but the budget for a deal was never\napproved. Two years later, the state governor agreed to buy the software, Olea said.\n\nOur investigation suggests Pineda was selected as a possible target by Mexico’s ministry of\ndefence, NSO’s first client. Several state security forces are also believed to have access to\nspyware and close links between organised crime and politicians has prompted concerns it\ncould end up in the wrong hands.\n\n[Bar graph grey version](https://interactive.guim.co.uk/uploader/embed/2021/07/customers_breakdown-zip/giv-825oIv2FDR5AfPE/)\n“The line between the good guys and bad guys isn’t clear,” said Jorge Rebolledo, a security\n[and intelligence consultant based in Mexico City.](https://www.theguardian.com/world/mexico)\n\n[NSO said it did not operate the systems that it sells to vetted government customers to fight](https://www.theguardian.com/news/2021/jul/18/response-from-nso-and-governments)\ncrime and terrorism, and did not have access to the data of its customers’ targets.\n\nBy February 2017, Pineda may have sensed that time was running out. He started reverseparking his car and repeatedly asked his wife to check if the doors were locked. “That last\nweek he seemed worried and scared,” said Toledo. “[But] he never told us any details – the\nless we know the better.”\n\n\n-----\n\nPineda broadcast his final report on 2 March, claiming that the state governor and elements\nof the state police knew exactly where Los Tequileros were hiding.\n\nWithin hours, he was dead.\n\n_Additional reporting by Paloma Dupont de Dinechin from Forbidden Stories_\n\nTopics\n[Reuse this content](https://syndication.theguardian.com/automation/?url=https%3A%2F%2Fwww.theguardian.com%2Fnews%2F2021%2Fjul%2F18%2Frevealed-murdered-journalist-number-selected-mexico-nso-client-cecilio-pineda-birto&type=article&internalpagecode=news/2021/jul/18/revealed-murdered-journalist-number-selected-mexico-nso-client-cecilio-pineda-birto)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-18 - Revealed- murdered journalist’s number selected by Mexican NSO client.pdf"
    ],
    "report_names": [
        "2021-07-18 - Revealed- murdered journalist’s number selected by Mexican NSO client.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536049,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653714256,
    "ts_modification_date": 1653714256,
    "files": {
        "pdf": "https://archive.orkl.eu/6721100d7d29dea9fcf6a659ed554619ae91c32a.pdf",
        "text": "https://archive.orkl.eu/6721100d7d29dea9fcf6a659ed554619ae91c32a.txt",
        "img": "https://archive.orkl.eu/6721100d7d29dea9fcf6a659ed554619ae91c32a.jpg"
    }
}