{
    "id": "249c5110-7e84-44f0-9ab9-0caee974f632",
    "created_at": "2023-01-12T15:10:09.162636Z",
    "updated_at": "2025-03-27T02:06:04.229797Z",
    "deleted_at": null,
    "sha1_hash": "5b0df44c352838c58cac6e70326da557ac53a433",
    "title": "2020-12-10 - Alert (AA20-345A)- Cyber Actors Target K-12 Distance Learning Education to Cause Disruptions and Steal Data",
    "authors": "",
    "file_creation_date": "2022-05-29T01:05:54Z",
    "file_modification_date": "2022-05-29T01:05:54Z",
    "file_size": 139183,
    "plain_text": "# Cyber Actors Target K-12 Distance Learning Education to Cause Disruptions and Steal Data\n\n**us-cert.cisa.gov/ncas/alerts/aa20-345a**\n\n## Summary\n\nThis Joint Cybersecurity Advisory was coauthored by the Federal Bureau of Investigation\n(FBI), the Cybersecurity and Infrastructure Security Agency (CISA), and the Multi-State\nInformation Sharing and Analysis Center (MS-ISAC).\n\nThe FBI, CISA, and MS-ISAC assess malicious cyber actors are targeting kindergarten\nthrough twelfth grade (K-12) educational institutions, leading to ransomware attacks, the theft\nof data, and the disruption of distance learning services. Cyber actors likely view schools as\ntargets of opportunity, and these types of attacks are expected to continue through the\n2020/2021 academic year. These issues will be particularly challenging for K-12 schools that\nface resource limitations; therefore, educational leadership, information technology\npersonnel, and security personnel will need to balance this risk when determining their\ncybersecurity investments.\n\n[Click here for a PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/publications/AA20-345A_Joint_Cybersecurity_Advisory_Distance_Learning_S508C.pdf)\n\n## Technical Details\n\nAs of December 2020, the FBI, CISA, and MS-ISAC continue to receive reports from K-12\neducational institutions about the disruption of distance learning efforts by cyber actors.\n\n**Ransomware**\n\nThe FBI, CISA, and MS-ISAC have received numerous reports of ransomware attacks\nagainst K-12 educational institutions. In these attacks, malicious cyber actors target school\ncomputer systems, slowing access, and—in some instances—rendering the systems\ninaccessible for basic functions, including distance learning. Adopting tactics previously\nleveraged against business and industry, ransomware actors have also stolen—and\nthreatened to leak—confidential student data to the public unless institutions pay a ransom.\n\nAccording to MS-ISAC data, the percentage of reported ransomware incidents against K-12\nschools increased at the beginning of the 2020 school year. In August and September, 57%\nof ransomware incidents reported to the MS-ISAC involved K-12 schools, compared to 28%\nof all reported ransomware incidents from January through July.\n\nThe five most common ransomware variants identified in incidents targeting K-12 schools\nbetween January and September 2020—based on open source information as well as victim\nand third-party incident reports made to MS-ISAC—are Ryuk, Maze, Nefilim, AKO, and\n\n\n-----\n\nSodinokibi/REvil.\n\n**Malware**\n\nFigure 1 identifies the top 10 malware strains that have affected state, local, tribal, and\nterritorial (SLTT) educational institutions over the past year (up to and including September\n2020). Note: These malware variants are purely opportunistic as they not only affect\neducational institutions but other organizations as well.\n\nZeuS and Shlayer are among the most prevalent malware affecting K-12 schools.\n\nZeuS is a Trojan with several variants that targets Microsoft Windows operating\nsystems. Cyber actors use ZeuS to infect target machines and send stolen information\nto command-and-control servers.\nShlayer is a Trojan downloader and dropper for MacOS malware. It is primarily\ndistributed through malicious websites, hijacked domains, and malicious advertising\nposing as a fake Adobe Flash updater. Note: Shlayer is the only malware of the top 10\nthat targets MacOS; the other 9 affect Microsoft Windows operating systems\n\n_Figure 1: Top 10 malware affecting SLTT educational institutions_\n\n**Distributed Denial-of-Service Attacks**\n\nCyber actors are causing disruptions to K-12 educational institutions—including third-party\nservices supporting distance learning—with distributed denial-of-service (DDoS) attacks,\nwhich temporarily limit or prevent users from conducting daily operations. The availability of\nDDoS-for-hire services provides opportunities for any motivated malicious cyber actor to\nconduct disruptive attacks regardless of experience level. Note: DDoS attacks overwhelm\nservers with a high level of internet traffic originating from many different sources, making it\nimpossible to mitigate at a single source.\n\n\n-----\n\n**Video Conference Disruptions**\n\nNumerous reports received by the FBI, CISA, and MS-ISAC since March 2020 indicate\nuninvited users have disrupted live video-conferenced classroom sessions. These\ndisruptions have included verbally harassing students and teachers, displaying pornography\nand/or violent images, and doxing meeting attendees (Note: doxing is the act of compiling or\npublishing personal information about an individual on the internet, typically with malicious\nintent). To enter classroom sessions, uninvited users have been observed:\n\nUsing student names to trick hosts into accepting them into class sessions, and\nAccessing meetings from either publicly available links or links shared with outside\nusers (e.g., students sharing links and/or passwords with friends).\n\nVideo conference sessions without proper control measures risk disruption or compromise of\nclassroom conversations and exposure of sensitive information.\n\n## Additional Risks and Vulnerabilities\n\nIn addition to the recent reporting of distance learning disruptions received by the FBI, CISA,\nand MS-ISAC, malicious cyber actors are expected to continue seeking opportunities to\nexploit the evolving remote learning environment.\n\n**Social Engineering**\n\nCyber actors could apply social engineering methods against students, parents, faculty, IT\npersonnel, or other individuals involved in distance learning. Tactics, such as phishing, trick\nvictims into revealing personal information (e.g., password or bank account information) or\nperforming a task (e.g., clicking on a link). In such scenarios, a victim could receive what\nappears to be legitimate email that:\n\nRequests personally identifiable information (PII) (e.g., full name, birthdate, student ID),\nDirects the user to confirm a password or personal identification number (PIN),\nInstructs the recipient to visit a website that is compromised by the cyber actor, or\nContains an attachment with malware.\n\nCyber actors also register web domains that are similar to legitimate websites in an attempt\nto capture individuals who mistype URLs or click on similar looking URLs. These types of\nattacks are referred to as domain spoofing or homograph attacks. For example, a user\nwanting to access `www.cottoncandyschool.edu could mistakenly click on`\n```\nwww.cottencandyschool.edu (changed “ o ” to an “ e ”) or\nwww.cottoncandyschoo1.edu (changed letter “ l ” to a number “1”) (Note: this is a\n\n```\nfictitious example to demonstrate how a user can mistakenly click and access a website\nwithout noticing subtle changes in website URLs). Victims believe they are on a legitimate\nwebsite when, in reality, they are visiting a site controlled by a cyber actor.\n\n\n-----\n\n**Technology Vulnerabilities and Student Data**\n\nWhether as collateral for ransomware attacks or to sell on the dark web, cyber actors may\nseek to exploit the data-rich environment of student information in schools and education\ntechnology (edtech) services. The need for schools to rapidly transition to distance learning\nlikely contributed to cybersecurity gaps, leaving schools vulnerable to attack. In addition,\neducational institutions that have outsourced their distance learning tools may have lost\nvisibility into data security measures. Cyber actors could view the increased reliance on—\nand sharp usership growth in—these distance learning services and student data as lucrative\ntargets.\n\n**Open/Exposed Ports**\n\nThe FBI, CISA, and MS-ISAC frequently see malicious cyber actors exploiting exposed\nRemote Desktop Protocol (RDP) services to gain initial access to a network and, often, to\nmanually deploy ransomware. For example, cyber actors will attack ports 445 (Server\nMessage Block [SMB]) and 3389 (RDP) to gain network access. They are then positioned to\nmove laterally throughout a network (often using SMB), escalate privileges, access and\nexfiltrate sensitive information, harvest credentials, or deploy a wide variety of malware. This\npopular attack vector allows cyber actors to maintain a low profile, as they are using a\nlegitimate network service that provides them with the same functionality as any other\nremote user.\n\n**End-of-Life Software**\n\nEnd-of-Life (EOL) software is regularly exploited by cyber actors—often to gain initial access,\ndeface websites, or further their reach in a network. Once a product reaches EOL, customers\nno longer receive security updates, technical support, or bug fixes. Unpatched and\nvulnerable servers are likely to be exploited by cyber actors, hindering an organization’s\noperational capacity.\n\n## Mitigations\n\n**Plans and Policies**\n\nThe FBI and CISA encourage educational providers to maintain business continuity plans—\nthe practice of executing essential functions through emergencies (e.g., cyberattacks)—to\nminimize service interruptions. Without planning, provision, and implementation of continuity\nprinciples, institutions may be unable to continue teaching and administrative operations.\nEvaluating continuity and capability will help identify potential operational gaps. Through\nidentifying and addressing these gaps, institutions can establish a viable continuity program\nthat will help keep them functioning during cyberattacks or other emergencies. The FBI and\nCISA suggest K-12 educational institutions review or establish patching plans, security\npolicies, user agreements, and business continuity plans to ensure they address current\nthreats posed by cyber actors.\n\n\n-----\n\n**Network Best Practices**\n\nPatch operating systems, software, and firmware as soon as manufacturers release\nupdates.\nCheck configurations for every operating system version for educational institutionowned assets to prevent issues from arising that local users are unable to fix due to\nhaving local administration disabled.\nRegularly change passwords to network systems and accounts and avoid reusing\npasswords for different accounts.\nUse multi-factor authentication where possible.\nDisable unused remote access/RDP ports and monitor remote access/RDP logs.\nImplement application and remote access allow listing to only allow systems to execute\nprograms known and permitted by the established security policy.\nAudit user accounts with administrative privileges and configure access controls with\nleast privilege in mind.\nAudit logs to ensure new accounts are legitimate.\nScan for open or listening ports and mediate those that are not needed.\nIdentify critical assets such as student database servers and distance learning\ninfrastructure; create backups of these systems and house the backups offline from the\nnetwork.\nImplement network segmentation. Sensitive data should not reside on the same server\nand network segment as the email environment.\nSet antivirus and anti-malware solutions to automatically update; conduct regular\nscans.\n\n**User Awareness Best Practices**\n\nFocus on awareness and training. Because end users are targeted, make employees\nand students aware of the threats—such as ransomware and phishing scams—and\nhow they are delivered. Additionally, provide users training on information security\nprinciples and techniques as well as overall emerging cybersecurity risks and\nvulnerabilities.\nEnsure employees know who to contact when they see suspicious activity or when they\nbelieve they have been a victim of a cyberattack. This will ensure that the proper\nestablished mitigation strategy can be employed quickly and efficiently.\nMonitor privacy settings and information available on social networking sites.\n\n**Ransomware Best Practices**\n\nThe FBI and CISA do not recommend paying ransoms. Payment does not guarantee files\nwill be recovered. It may also embolden adversaries to target additional organizations,\nencourage other criminal actors to engage in the distribution of ransomware, and/or fund\nillicit activities. However, regardless of whether your organization decided to pay the ransom,\n\n\n-----\n\nthe FBI urges you to report ransomware incidents to your local FBI field office. Doing so\nprovides the FBI with the critical information they need to prevent future attacks by identifying\nand tracking ransomware attackers and holding them accountable under U.S. law.\n\nIn addition to implementing the above network best practices, the FBI and CISA also\nrecommend the following:\n\nRegularly back up data, air gap, and password protect backup copies offline.\nImplement a recovery plan to maintain and retain multiple copies of sensitive or\nproprietary data and servers in a physically separate, secure location.\n\n**Denial-of-Service Best Practices**\n\nConsider enrolling in a denial-of-service mitigation service that detects abnormal traffic\nflows and redirects traffic away from your network.\nCreate a partnership with your local internet service provider (ISP) prior to an event\nand work with your ISP to control network traffic attacking your network during an\nevent.\nConfigure network firewalls to block unauthorized IP addresses and disable port\nforwarding.\n\n**Video-Conferencing Best Practices**\n\nEnsure participants use the most updated version of remote access/meeting\napplications.\nRequire passwords for session access.\nEncourage students to avoid sharing passwords or meeting codes.\nEstablish a vetting process to identify participants as they arrive, such as a waiting\nroom.\nEstablish policies to require participants to sign in using true names rather than aliases.\nEnsure only the host controls screensharing privileges.\nImplement a policy to prevent participants from entering rooms prior to host arrival and\nto prevent the host from exiting prior to the departure of all participants.\n\n**Edtech Implementation Considerations**\n\nWhen partnering with third-party and edtech services to support distance learning,\neducational institutions should consider the following:\nThe service provider’s cybersecurity policies and response plan in the event of a\nbreach and their remediation practices:\n\nHow did the service provider resolve past cyber incidents? How did their\ncybersecurity practices change after these incidents?\nThe provider’s data security practices for their products and services (e.g., data\nencryption in transit and at rest, security audits, security training of staff, audit logs);\n\n\n-----\n\nThe provider s data maintenance and storage practices (e.g., use of company servers,\ncloud storage, or third-party services);\nTypes of student data the provider collects and tracks (e.g., PII, academic, disciplinary,\nmedical, biometric, IP addresses);\nEntities to whom the provider will grant access to the student data (e.g., vendors);\nHow the provider will use student data (e.g., will they sell it to—or share it with—third\nparties for service enhancement, new product development, studies,\nmarketing/advertising?);\nThe provider’s de-identification practices for student data; and\nThe provider’s policies on data retention and deletion.\n\n**Malware Defense**\n\nTable 1 identifies CISA-created Snort signatures, which have been successfully used to\ndetect and defend against related attacks, for the malware variants listed below. Note: the\nlisting is not fully comprehensive and should not be used at the exclusion of other detection\nmethods.\n\n_Table 1: Malware signatures_\n\n**Malware** **Signature**\n\n**NanoCore** `alert tcp any any -> any $HTTP_PORTS (msg:\"NANOCORE:HTTP GET`\n```\n       URI contains 'FAD00979338'\"; sid:00000000; rev:1;\n       flow:established,to_server; content:\"GET\"; http_method;\n       content:\"getPluginName.php?PluginID=FAD00979338\"; fast_pattern;\n       http_uri; classtype:http-uri; metadata:service http;)\n\n```\n**Cerber** `alert tcp any any -> any $HTTP_PORTS (msg:\"HTTP Client Header`\n```\n       contains 'host|3a 20|polkiuj.top'\"; sid:00000000; rev:1;\n       flow:established,to_server; flowbits:isnotset,\n       <unique_ID>.tagged; content:\"host|3a 20|polkiuj.top|0d 0a|\";\n       http_header; fast_pattern:only; flowbits:set,\n       <unique_ID>.tagged; tag:session,10,packets; classtype:http       header; metadata:service http;)\n\n```\n\n-----\n\n**Malware** **Signature**\n\n**Kovter** `alert tcp any any -> any $HTTP_PORTS (msg:\"Kovter:HTTP URI`\n```\n       POST to CnC Server\"; sid:00000000; rev:1;\n       flow:established,to_server; flowbits:isnotset,\n       <unique_ID>.tagged; content:\"POST / HTTP/1.1\"; depth:15;\n       content:\"Content-Type|3a 20|application/x-www-form-urlencoded\";\n       http_header; depth:47; fast_pattern; content:\"User-Agent|3a\n       20|Mozilla/\"; http_header; content:!\"LOADCURRENCY\"; nocase;\n       content:!\"Accept\"; http_header; content:!\"Referer|3a|\";\n       http_header; content:!\"Cookie|3a|\"; nocase; http_header;\n       pcre:\"/^(?:[A-Za-z0-9+\\/]{4})*(?:[A-Za-z0-9+\\/]{2}==|[A-Za-z0       9+\\/]{3}=|[A-Za-z0-9+\\/]{4})$/P\"; pcre:\"/User       Agent\\x3a[^\\r\\n]+\\r\\nHost\\x3a\\x20(?:\\d{1,3}\\.)\n       {3}\\d{1,3}\\r\\nContent-Length\\x3a\\x20[1-5][0-9]\n       {2,3}\\r\\n(?:Cache-Control|Pragma)\\x3a[^\\r\\n]+\\r\\n(?:\\r\\n)?$/H\";\n       flowbits:set,<unique_ID>.tagged; tag:session,10,packets;\n       classtype:nonstd-tcp; metadata:service http;)\n\n```\n**Dridex** `alert tcp any any -> any $HTTP_PORTS (msg:\"HTTP URI GET`\n```\n       contains 'invoice_########.doc' (DRIDEX)\"; sid:00000000; rev:1;\n       flow:established,to_server; content:\"invoice_\"; http_uri;\n       fast_pattern:only; content:\".doc\"; nocase; distance:8;\n       within:4; content:\"GET\"; nocase; http_method; classtype:http       uri; metadata:service http;)\n       alert tcp any any -> any $HTTP_PORTS (msg:\"HTTP Client Header\n       contains 'Host|3a 20|tanevengledrep ru' (DRIDEX)\";\n       sid:00000000; rev:1; flow:established,to_server;\n       flowbits:isnotset,<unique_ID>.tagged; content:\"Host|3a\n       20|tanevengledrep|2e|ru|0d 0a|\"; http_header;\n       fast_pattern:only; flowbits:set,<unique_ID>.tagged;\n       tag:session,10,packets; classtype:http-header; metadata:service\n       http;)\n\n## Contact Information\n\n```\nTo report suspicious or criminal activity related to information found in this Joint\nCybersecurity Advisory, contact your local FBI field office at [www.fbi.gov/contact-us/field.](https://www.fbi.gov/contact-us/field-offices)\nWhen available, please include the following information regarding the incident: date, time,\nand location of the incident; type of activity; number of people affected; type of equipment\nused for the activity; the name of the submitting organization; and a designated point of\ncontact.\n\nTo request incident response resources or technical assistance related to these threats,\ncontact CISA at [Central@cisa.gov.](http://10.10.0.46/mailto:Central@cisa.gov)\n\n## Resources\n\nMS-ISAC membership is open to employees or representatives from all public K-12\neducation entities in the United States. The MS-ISAC provides multiple cybersecurity\nservices and benefits to help K-12 education entities increase their cybersecurity posture. To\n\n\n-----\n\n[join, visit https://learn.cisecurity.org/ms-isac-registration.](https://learn.cisecurity.org/ms-isac-registration)\n\n**[Note: contact your local FBI field office (www.fbi.gov/contact-us/field) for additional FBI](http://www.fbi.gov/contact-us/field)**\nproducts on ransomware, edtech, and cybersecurity for educational institutions.\n\n## Revisions\n\nInitial Version: December 10, 2020\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa20-345a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-10 - Alert (AA20-345A)- Cyber Actors Target K-12 Distance Learning Education to Cause Disruptions and Steal Data.pdf"
    ],
    "report_names": [
        "2020-12-10 - Alert (AA20-345A)- Cyber Actors Target K-12 Distance Learning Education to Cause Disruptions and Steal Data.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536209,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653786354,
    "ts_modification_date": 1653786354,
    "files": {
        "pdf": "https://archive.orkl.eu/5b0df44c352838c58cac6e70326da557ac53a433.pdf",
        "text": "https://archive.orkl.eu/5b0df44c352838c58cac6e70326da557ac53a433.txt",
        "img": "https://archive.orkl.eu/5b0df44c352838c58cac6e70326da557ac53a433.jpg"
    }
}