{
    "id": "24a12b2d-0128-4ec9-b6de-9075a2c78276",
    "created_at": "2023-01-12T15:02:24.617622Z",
    "updated_at": "2025-03-27T02:05:35.913595Z",
    "deleted_at": null,
    "sha1_hash": "b969bc75b03e9dced7cee63f9411d54348c1b5d8",
    "title": "2020-03-03 - Ransomware Attackers Use Your Cloud Backups Against You",
    "authors": "",
    "file_creation_date": "2022-05-27T01:59:52Z",
    "file_modification_date": "2022-05-27T01:59:52Z",
    "file_size": 893097,
    "plain_text": "# Ransomware Attackers Use Your Cloud Backups Against You\n\n**[bleepingcomputer.com/news/security/ransomware-attackers-use-your-cloud-backups-against-you/](https://www.bleepingcomputer.com/news/security/ransomware-attackers-use-your-cloud-backups-against-you/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nMarch 3, 2020\n04:36 PM\n1\n\nBackups are one the most, if not the most, important defense against ransomware, but if\nnot configured properly, attackers will use it against you.\n\n[Recently the DoppelPaymer Ransomware operators published on their leak site the Admin](https://www.bleepingcomputer.com/news/security/doppelpaymer-ransomware-launches-site-to-post-victims-data/)\nuser name and password for a non-paying victim's Veeam backup software.\n\n\n-----\n\n**Leaked Veeam Account**\n\nThis was not meant to expose the information to others for further attacks but was used as\na warning to the victim that the ransomware operators had full access to their network,\nincluding the backups.\n\nAfter seeing this information, I reached out to the operators of the DoppelPaymer and Maze\nRansomware families to learn how they target victim's backups and was surprised by what I\nlearned.\n\nIt should be noted that in this article we will be focusing on the Veeam backup software. Not\nbecause it is less secure than other software, but simply because it is one of the most\npopular enterprise backup products and was mentioned by the ransomware operators.\n\n## Attackers first use your cloud backups to steal your data\n\nDuring ransomware attacks, attackers will compromise an individual host through phishing,\nmalware, or exposed remote desktop services.\n\nOnce they gain access to a machine, they spread laterally throughout the network until they\ngain access to administrator credentials and the domain controller.\n\nUsing tools such as Mimikatz they proceed to dump credentials from the active directory.\n\nAccording to [Nero Consulting, an MSP and IT Consulting company based out of New York](https://www.nero-consulting.com/)\nCity who assisted me with this article, this could allow the attackers to gain access to\nbackup software as some administrators configure Veeam to use Windows authentication.\n\n\n-----\n\n**Log in to Veeam using**\n\n**Windows authentication**\nOnce they gain access, the Maze Ransomware operators told BleepingComputer that if\ncloud backups are configured, it is very useful when stealing data from their victims.\n\n**Configured cloud provider**\n\n\n-----\n\nWhen Maze finds backups stored in the cloud, they attempt to obtain the cloud storage\ncredentials and then use them to restore the victim's data to servers under the attacker's\ncontrol.\n\n\"Yes, we download them. It is very useful. No need to search for sensitive information, it is\ndefinitely contained in backups. If backups in the cloud it is even easier, you just login to\ncloud and download it from your server, full invisibility to \"data breach detection software\".\nClouds is about security, right?\"\n\nAs the attackers are restoring directly from the cloud to their servers, it won't raise any red\nflags for the victim as their servers appear to be operating normally with no logs being\ncreated in their backup software.\n\nThe Maze operators did not elaborate on how they gain access to the cloud credentials, but\nDoppelPaymer told us they use \"all possible methods\".\n\nThis could include keyloggers, phishing attacks, or by reading locally saved documentation\non the backup servers.\n\n## Deleting backups before ransomware attacks\n\nRegardless of whether the backups are used to steal data, before encrypting devices on the\nnetwork the attackers will first delete the backups so that they cannot be used to restore\nencrypted files.\n\nDoppelPaymer told BleepingComputer that even though cloud backups can be a good\noption to protect against ransomware, it is not 100% effective.\n\n\"Cloud backups are a very good option against ransom but do not 100% protect as cloud\nbackups are not always good configured, offline backups often outdated - the system of\nbackups is really nice but human factor leaves some options,\" DoppelPaymer told us via\nemail.\n\nUnless you subscribe to service add-ons such as immutable backups, as the actors have\nfull access to the local install of backup software, they can simply delete any backups that\nexist in the cloud.\n\n\n-----\n\n**Deleting a cloud backup in Veeam**\nWith a victim's data now stolen and their backups deleted, the attackers deploy their\nransomware throughout the compromised network using PSExec or PowerShell Empire\ntypically during off-hours.\n\nThis usually leads to a company opening the next day to an encrypted network.\n\n## Protecting your backups\n\nIn emails with Rick Vanover, Senior Director, Product Strategy at Veeam Software, we were\ntold that it does not matter what software you use, once an attacker gains privileged access\nto the network, everything is at risk.\n\n[\"We have advocated, even in a published 2017 whitepaper that I wrote I’ve recommended](https://www.veeam.com/wp-veeam-availability-suite-protection-against-ransomware-threats.html?wpty)\nseparate accounts for Veeam installations and components. Additionally, I recommend\nVeeam installations to use non-domain accounts for components as well to add more\naccount-based layers of resiliency. Additionally, Veeam has recommended that the Veeam\ndeployment not have Internet access or otherwise be on an isolated management network,\"\nVanover told BleepingComputer.\n\nTo prevent ransomware attackers from gaining complete leverage over a victim, Veeam\n[recommends that companies follow a 3-2-1 Rule when configuring backups.](https://www.veeam.com/blog/how-to-follow-the-3-2-1-backup-rule-with-veeam-backup-replication.html)\n\n\"Whether it is ultra-resilient backup data like S3-immutable backups in the cloud, encrypted\nbackups on tape or encrypted backups on removable offline storage; customers need to\nhave multiple copies of data. We have advocated for a long time the 3-2-1 Rule, which\nadvocates having 3 different copies of data on 2 different media with one of them being offsite. Couple in 1 copy being on an ultra-resilient technique such as an immutable backup,\noffline backup or otherwise air-gapped; data can be protected against nearly any failure\nscenario – including ransomware. Additionally, Veeam also has a technology called Secure\nRestore; which will perform a threat scan with almost any tool to ensure that a restored\nsystem or data does not re-introduce a threat,\" Vanover continued.\n\nLike Veeam, Nero Consulting also strongly recommends users should purchase the\nimmutable storage or redundant storage protection options if available when using cloud\nservices.\n\n\n-----\n\nUsing this option, even if the data is deleted from the cloud storage provider, the immutable\nstorage service will make the data recoverable for a certain amount of time.\n\nAs for protecting a network from data exfiltration, the best solution is to prevent the\nattackers from gaining access to your network in the first place and to monitor for\nsuspicious activity.\n\nThis would include utilizing network monitoring software, intrusion detection systems, and\ngeographic and IP access control for cloud storage providers if available.\n\n### Related Articles:\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[Quantum ransomware seen deployed in rapid network attacks](https://www.bleepingcomputer.com/news/security/quantum-ransomware-seen-deployed-in-rapid-network-attacks/)\n\n[Austin Peay State University resumes after ransomware cyber attack](https://www.bleepingcomputer.com/news/security/austin-peay-state-university-resumes-after-ransomware-cyber-attack/)\n\n[LockBit ransomware gang lurked in a U.S. gov network for months](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-gang-lurked-in-a-us-gov-network-for-months/)\n\n[Snap-on discloses data breach claimed by Conti ransomware gang](https://www.bleepingcomputer.com/news/security/snap-on-discloses-data-breach-claimed-by-conti-ransomware-gang/)\n\n[Backup](https://www.bleepingcomputer.com/tag/backup/)\n[Cloud](https://www.bleepingcomputer.com/tag/cloud/)\n[Cyber Attack](https://www.bleepingcomputer.com/tag/cyber-attack/)\n[Data Exfiltration](https://www.bleepingcomputer.com/tag/data-exfiltration/)\n[Hacker](https://www.bleepingcomputer.com/tag/hacker/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-march-2020-office-updates-with-fixes-improvements/)\n[Next Article](https://www.bleepingcomputer.com/news/security/lets-encrypt-to-revoke-3-million-tls-certificates-due-to-bug/)\n\n### Comments\n\n\n-----\n\n[wifinomad - 2 years ago](https://www.bleepingcomputer.com/forums/u/1157105/wifinomad/)\n\nIt's perhaps a little ironic that the header image of this article is a picture of destroyed\nLTO Ultrium tape. Ironic because tape is arguably one of the strongest forms of \"last\nline of defence protection\" against ransomware. A useful recommendation is to follow\nthe 3-2-1-1 rule: three copies of data on two different media types, one stored offsite\nand one stored offline. Ransomware can't infect data that is inaccessible behind an air\ngap. That's why LTO Ultrium tape is so effective!\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-03 - Ransomware Attackers Use Your Cloud Backups Against You.pdf"
    ],
    "report_names": [
        "2020-03-03 - Ransomware Attackers Use Your Cloud Backups Against You.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535744,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653616792,
    "ts_modification_date": 1653616792,
    "files": {
        "pdf": "https://archive.orkl.eu/b969bc75b03e9dced7cee63f9411d54348c1b5d8.pdf",
        "text": "https://archive.orkl.eu/b969bc75b03e9dced7cee63f9411d54348c1b5d8.txt",
        "img": "https://archive.orkl.eu/b969bc75b03e9dced7cee63f9411d54348c1b5d8.jpg"
    }
}