{
    "id": "252e175e-4532-4c58-98f3-bb8fe5fc22ac",
    "created_at": "2022-12-27T17:06:15.316692Z",
    "updated_at": "2025-03-18T19:58:09.554833Z",
    "deleted_at": null,
    "sha1_hash": "c932a36f31d02e6f7cc3eefe29f3a6f8cbd400bd",
    "title": "Announcing the Commercial National Security Algorithm Suite 2.0",
    "authors": "NSA",
    "file_creation_date": "2022-09-07T14:23:21Z",
    "file_modification_date": "2022-09-07T14:23:21Z",
    "file_size": 376129,
    "plain_text": "National Security Agency | Cybersecurity Advisory\n\nAnnouncing the Commercial National Security\nAlgorithm Suite 2.0\nExecutive summary\nThe need for protection against a future\ndeployment of a cryptanalytically\nrelevant quantum computer (CRQC) is\nwell documented. That story begins in\nthe mid-1990s when Peter Shor\ndiscovered a CRQC would break\npublic-key systems still used today. Continued progress in quantum computing research\nby academia, industry, and some governments suggests that the vision of quantum\ncomputing will ultimately be realized. Hence, now is the time to plan, prepare, and\nbudget for an effective transition to quantum-resistant (QR) algorithms, to assure\ncontinued protection of National Security Systems (NSS) and related assets.\nThis advisory notifies NSS owners, operators, and vendors of future requirements for\nQR algorithms for NSS. These algorithms (also referred to as post-quantum algorithms)\nare analyzed as being secure against both classical and quantum computers. They are\nan update to those in the Commercial National Security Algorithm Suite (referred to as\nCNSA 1.0, the algorithms currently listed in CNSSP 15, Annex B). NSA will reference\nthis update as CNSA Suite 2.0, and any future updates will modify the version number.\nNSA is providing this advisory in accordance with authorities detailed in NSD-42, NSM8, NSM-10, CNSSP 11, and CNSSP 15. Its direction applies to all NSS use of public\ncryptographic algorithms (as opposed to algorithms NSA developed), including those on\nall unclassified and classified NSS. Using any cryptographic algorithms the National\nManager did not approve is generally not allowed, and requires a waiver specific to the\nalgorithm, implementation, and use case. In accordance with CNSSP 11, software and\nhardware providing cryptographic services require National Information Assurance\nPartnership (NIAP) or NSA validation in addition to meeting the requirements of the\nappropriate version of CNSA.\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nIntroduction\nThis advisory includes the following sections:\n Algorithms for software- and firmware-signing. The National Institute of\nStandards and Technology (NIST) standardized these algorithms some time ago,\nbut using different algorithms for this special use case is new in CNSA 2.0.\n Symmetric-key algorithms. There is only a modest change from CNSA 1.0 in this\nsection that allows a bit more flexibility.\n General-use quantum-resistant public-key algorithms. These are the main public-\n\n\n\n\n\n\nkey algorithms that most applications will require. As they have not completed\nstandardization, this section is forward-looking.\nTiming. Discusses the timing of the transition to CNSA 2.0.\nEnforcement. Summarizes requirements related to enforcing NSS algorithm\nrequirements.\nAdditional guidance: RFCs. Provides links to helpful Internet Engineering Task\nForce Requests for Comment (IETF RFCs) used to implement CNSA 1.0.\nReference tables. Features two tables that list algorithms for CNSA 2.0 and for\nCNSA 1.0.\n\nAlgorithms for software- and firmware-signing\nThe reasons for choosing separate algorithms for software- and firmware-signing are\nthree-fold:\n\n\nNIST has standardized these algorithms already, while other post-quantum\nsignatures are not yet standardized,\n\n\n\nThis signature use-case is more urgent, and\n\n\n\nThis selection places algorithms with the most substantial history of cryptanalysis\nin a use case where their potential performance issues have minimal impact. In\nparticular, this usage coincides well with the requirement for keeping track of\nstate—that is, how many times a given public key was used in signing software\nor firmware when deploying these signatures.\n\nThe algorithms chosen for software- and firmware-signing are those specified in NIST\nSpecial Publication 800-208. NSA recommends Leighton-Micali with SHA-256/192, but\nall NIST SP 800-208 algorithms are approved for this use case. Note that to avoid\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n2\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nweakening the security of these signatures, you must meet all the requirements of SP\n800-208, including the need to manage state and implement signing in hardware.\nNSA encourages vendors to begin adopting NIST SP 800-208 signatures immediately.\nFor more information on requirement timelines, see the Timing section. The following\ntable lists CNSA 2.0 algorithms for software and firmware updates.\nTable I: CNSA 2.0 algorithms for software and firmware updates\n\nAlgorithm\nLeighton-Micali\nSignature (LMS)\n\nFunction\n\nSpecification\n\nAll parameters approved\n\nAsymmetric algorithm for\ndigitally signing firmware\n\nNIST SP 800-208\n\nand software\n\nXtended Merkle\nSignature Scheme\n\nAsymmetric algorithm for\ndigitally signing firmware\n\n(XMSS)\n\nand software\n\nParameters\nfor all classification\nlevels. SHA-256/192\nrecommended.\n\nNIST SP 800-208\n\nAll parameters approved\nfor all classification\nlevels.\n\nSymmetric-key algorithms\nThe following table shows the addition of SHA-512 to the list, the only change when\ncompared with CNSA 1.0.\nTable II: CNSA 2.0 symmetric-key algorithms\n\nAlgorithm\n\nFunction\n\nAdvanced Encryption\n\nSymmetric block cipher\nfor information\n\nStandard (AES)\n\nSecure Hash Algorithm\n(SHA)\n\nSpecification\nFIPS PUB 197\n\nprotection\nAlgorithm for\ncomputing a\ncondensed\nrepresentation of\ninformation\n\nParameters\nUse 256-bit keys for all\nclassification levels.\n\nUse SHA-384 or SHAFIPS PUB 180-4\n\n512 for all classification\nlevels.\n\nGeneral-use quantum-resistant public-key algorithms\nNIST recently announced its standardization selections for post-quantum cryptography.\nConsequently, there are neither final standards nor Federal Information Processing\nStandard (FIPS)-validated implementations available at this time. NSA is announcing\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n3\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nthis selection of public-key algorithms to provide future NSS requirements so vendors\nmay begin building toward these requirements, and so acquisition officials and NSS\nowners and operators will know what the requirements are.\nNote that this will effectively deprecate the use of RSA, Diffie-Hellman (DH), and elliptic\ncurve cryptography (ECDH and ECDSA) when mandated. NSA urges NSS owners and\noperators to pay special attention to these requirements. In the interim, CNSA 1.0\ncompliance continues to be required. The following section defines transition timelines\nand the following table lists CNSA 2.0 algorithms:\nTable III: CNSA 2.0 quantum-resistant public-key algorithms\n\nAlgorithm\nCRYSTALS-Kyber\n\nCRYSTALS-Dilithium\n\nFunction\nAsymmetric algorithm\nfor key establishment\nAsymmetric algorithm\nfor digital signatures\n\nSpecification\nTBD\n\nParameters\nUse Level V\nparameters for all\nclassification levels.\n\nTBD\n\nUse Level V\nparameters for all\nclassification levels.\n\nTiming\nThe timing of the transition depends on the proliferation of standards-based\nimplementations. Because different technologies will adopt QR algorithms at different\npaces, NSA is providing an overall transition end date and the process for determining\nspecific dates going forward.\nNSA expects the transition to QR algorithms for NSS to be complete by 2035 in line with\nNSM-10. NSA urges vendors and NSS owners and operators to make every effort to\nmeet this deadline. Where feasible, NSS owners and operators will be required to prefer\nCNSA 2.0 algorithms when configuring systems during the transition period. When\nappropriate, use of CNSA 2.0 algorithms will be mandatory in classes of commercial\nproducts within NSS, while reserving the option to allow other algorithms in specialized\nuse cases.\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n4\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nThe following is the general method for transitioning to CNSA 2.0 algorithm use:\n\n1\n2\n\nNIAP will release protection profiles specifying that products support CNSA\n2.0 algorithms in accordance with NIST and other standards from\nstandards development organizations and the development of standardscompliant cryptographic equipment.\n\nAll new equipment must meet the protection profile requirements; older\nequipment must meet the requirement at its next update to remain NIAP\ncompliant.\n\n3\n\nUsing CNSA 2.0 algorithms as the preferred configuration option will begin\nas soon as validated and tested solutions are available.\n\n4\n\nNIAP Protection Profile requirements and NSM-10 technology refresh\n\n5\n\nAt that point, legacy equipment and software not refreshed regularly will\nrequire a waiver and a plan to bring it into compliance.\n\nrequirements will determine the removal of legacy algorithm support.\n\nTiming for software signing and firmware signing\nFor software signing and firmware signing, NSA recommends:\n1. Software and firmware signing begin transitioning immediately.\n2. New software and firmware use CNSA 2.0 signing algorithms by 2025.\n3. Transitioning deployed software and firmware not CNSA 1.0 compliant to CNSA\n2.0-compliant algorithms by 2025.\n4. Transitioning all deployed software and firmware to CNSA 2.0-compliant\nsignatures by 2030.\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n5\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nOther requirements for NSS\nNSA anticipates the following timetable for implementing other CNSA 2.0 requirements\nfor NSS:\n\n\n\n\n\n\n\n\nSoftware and firmware signing: begin transitioning immediately, support and\nprefer CNSA 2.0 by 2025, and exclusively use CNSA 2.0 by 2030.\nWeb browsers/servers and cloud services: support and prefer CNSA 2.0 by\n2025, and exclusively1 use CNSA 2.0 by 2033.\nTraditional networking equipment (e.g., virtual private networks, routers):\nsupport and prefer CNSA 2.0 by 2026, and exclusively use CNSA 2.0 by 2030.\nOperating systems: support and prefer CNSA 2.0 by 2027, and exclusively use\nCNSA 2.0 by 2033.\nNiche equipment (e.g., constrained devices, large public-key infrastructure\nsystems): support and prefer CNSA 2.0 by 2030, and exclusively use CNSA 2.0\nby 2033.\nCustom applications and legacy equipment: update or replace by 2033.\n\nFigure 1: Transition timeline\n1 Even though hybrid solutions may be allowed or required due to protocol standards, product availability, or interoperability requirements, CNSA 2.0 algorithms\n\nwill become mandatory to select at the given date, and selecting CNSA 1.0 algorithms alone will no longer be approved.\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n6\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nEnforcement\nNSS owners and operators must report on their progress in updating to CNSA 1.0 and\nCNSA 2.0 as part of their responsibilities under NSM-8 and NSM-10. Approving Officials\n(AOs) should measure compliance as part of the Risk Management Framework (RMF)\nprocess when assessing Security Control 12 (SC-12). Furthermore, AOs will need to\nverify compliance with CNSA 2.0 for software- and firmware-signing on their systems.\nNSS should not be assessed against “FIPS-validated” in the RMF process; instead,\nsolutions must be NSA-approved. In applications where a commercial product is\naccepted, NSA generally approves products that comply with CNSSP 11 (i.e., are NIAPvalidated against an approved protection profile), as long as they are configured\ncorrectly in accordance with CNSSP 15 and other specific directions or guidance.\n\nAdditional guidance: RFCs\nThe following documents specify how to configure solutions to comply with CNSA\nrequirements. These include:\n\n\n\n\n\n\n\n\n\nRFC 8603 \"Commercial National Security Algorithm (CNSA) Suite Certificate and\nCertificate Revocation List (CRL) Profile\"\nhttps://datatracker.ietf.org/doc/html/rfc8603\nRFC 8755 \"Using Commercial National Security Algorithm Suite Algorithms in\nSecure/Multipurpose Internet Mail Extensions\"\nhttps://datatracker.ietf.org/doc/rfc8755/\nRFC 8756 \"Commercial National Security Algorithm (CNSA) Suite Profile of\nCertificate Management over CMS\" https://datatracker.ietf.org/doc/rfc8756/\nRFC 9151 \"Commercial National Security Algorithm (CNSA) Suite Profile for TLS\nand DTLS 1.2 and 1.3\" https://datatracker.ietf.org/doc/rfc9151/\nRFC 9206 \"Commercial National Security Algorithm (CNSA) Suite Cryptography\nfor Internet Protocol Security (IPsec)\" https://datatracker.ietf.org/doc/rfc9206/\nRFC 9212 \"Commercial National Security Algorithm (CNSA) Suite Cryptography\nfor Secure Shell (SSH)\" https://datatracker.ietf.org/doc/rfc9212/\n\nThese documents currently apply to CNSA 1.0. NSA will release updated guidance as\nthe standardization process progresses.\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n7\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nDisclaimer of endorsement\nThe information and opinions contained in this document are provided \"as is\" and without any warranties or\nguarantees. Reference herein to any specific commercial product, process, or service by trade name, trademark,\nmanufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by the United\nStates Government, and this guidance shall not be used for advertising or product endorsement purposes.\n\nPurpose\nThis document was developed to further NSA’s cybersecurity missions, including its responsibilities to identify and\ndisseminate threats and vulnerabilities to National Security Systems, Department of Defense, and Defense Industrial\nBase information systems, and to develop and issue cybersecurity specifications and mitigations. This information\nmay be shared broadly to reach all appropriate stakeholders.\n\nContact\nCybersecurity Report Inquiries and Feedback: CybersecurityReports@nsa.gov\nDefense Industrial Base Inquiries and Cybersecurity Services: DIB_Defense@cyber.nsa.gov\nMedia Inquiries / Press Desk: 443-634-0721, MediaRelations@nsa.gov\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\n8\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nAppendix: Reference tables\nThe following two tables list the algorithms for CNSA 2.0 and for CNSA 1.0,\nrespectively. CNSA 1.0 is the current standard while CNSA 2.0 is the future one. NSA\nrecommends adopting the CNSA 2.0 software- and firmware-signing algorithms now.\nTable IV: CNSA 2.0 algorithms\n\nAlgorithm\nAdvanced Encryption\nStandard (AES)\n\nCRYSTALS-Kyber\n\nCRYSTALS-Dilithium\n\nSecure Hash Algorithm\n(SHA)\n\nFunction\nSymmetric block cipher\nfor information\n\nSpecification\nFIPS PUB 197\n\nprotection\nAsymmetric algorithm\nfor key establishment\nAsymmetric algorithm\nfor digital signatures\n\nTBD\n\nUse 256-bit keys for all\nclassification levels.\nUse Level V\nparameters for all\nclassification levels.\n\nTBD\n\nUse Level V\nparameters for all\nclassification levels.\n\nAlgorithm for\ncomputing a\ncondensed\nrepresentation of\n\nParameters\n\nUse SHA-384 or SHAFIPS PUB 180-4\n\n512 for all classification\nlevels.\n\ninformation\n\nLeighton-Micali\nSignature (LMS)\n\nAll parameters\napproved for all\n\nAsymmetric algorithm\nfor digitally signing\n\nNIST SP 800-208\n\nclassification levels.\n\nfirmware and software\n\nSHA256/192\nrecommended.\n\nXtended Merkle\n\nAsymmetric algorithm\n\nAll parameters\n\nSignature Scheme\n(XMSS)\n\nfor digitally signing\nfirmware and software\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\nNIST SP 800-208\n\napproved for all\nclassification levels.\n\n9\n\nNSA | Commercial National Security Algorithm Suite 2.0\n\nTable V: CNSA 1.0 algorithms\n\nAlgorithm\n\nFunction\n\nAdvanced Encryption\n\nSymmetric block cipher\nfor information\n\nStandard (AES)\nElliptic Curve DiffieHellman (ECDH) Key\nExchange\nElliptic Curve Digital\nSignature Algorithm\n(ECDSA)\n\nSecure Hash Algorithm\n(SHA)\n\nAsymmetric algorithm\nfor key establishment\nAsymmetric algorithm\nfor digital signatures\n\nNIST SP 800-56A\n\nFIPS PUB 186-4\n\nAlgorithm for\ncomputing a\ncondensed\n\nFIPS PUB 180-4\n\nrepresentation of\ninformation\nAsymmetric algorithm\n\nKey Exchange\n\nfor key establishment\n\nRSA\n\nFIPS PUB 197\n\nprotection\n\nDiffie-Hellman (DH)\n\nRSA\n\nSpecification\n\nAsymmetric algorithm\nfor key establishment\nAsymmetric algorithm\nfor digital signatures\n\nU/OO/194427-22 | PP-22-1338 | SEP 2022 Ver. 1.0\n\nParameters\nUse 256-bit keys for all\nclassification levels.\nUse Curve P-384 for all\nclassification levels.\nUse Curve P-384 for all\nclassification levels.\n\nUse SHA-384 for all\nclassification levels.\n\nMinimum 3072-bit\nIETF RFC 3526\n\nmodulus for all\nclassification levels\nMinimum 3072-bit\n\nFIPS SP 800-56B\n\nmodulus for all\nclassification levels\nMinimum 3072-bit\n\nFIPS PUB 186-4\n\nmodulus for all\nclassification levels.\n\n10",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://media.defense.gov/2022/Sep/07/2003071834/-1/-1/0/CSA_CNSA_2.0_ALGORITHMS_.PDF"
    ],
    "report_names": [
        "CSA_CNSA_2.0_ALGORITHMS_.PDF"
    ],
    "threat_actors": [],
    "ts_created_at": 1672160775,
    "ts_updated_at": 1742327889,
    "ts_creation_date": 1662560601,
    "ts_modification_date": 1662560601,
    "files": {
        "pdf": "https://archive.orkl.eu/c932a36f31d02e6f7cc3eefe29f3a6f8cbd400bd.pdf",
        "text": "https://archive.orkl.eu/c932a36f31d02e6f7cc3eefe29f3a6f8cbd400bd.txt",
        "img": "https://archive.orkl.eu/c932a36f31d02e6f7cc3eefe29f3a6f8cbd400bd.jpg"
    }
}