{
    "id": "2535bbeb-c09c-4ac0-870c-5fd55d85dd34",
    "created_at": "2023-01-12T15:04:15.837946Z",
    "updated_at": "2025-03-27T02:17:27.639771Z",
    "deleted_at": null,
    "sha1_hash": "820cf1b2a8d83f1072c15490b12336b057fcfe37",
    "title": "2016-10-04 - OilRig Malware Campaign Updates Toolset and Expands Targets",
    "authors": "",
    "file_creation_date": "2017-02-03T05:03:02Z",
    "file_modification_date": "2017-02-03T07:00:18Z",
    "file_size": 10324599,
    "plain_text": "-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Table of Contents\n\n\n**EXECUTIVE SUMMARY AND MAJOR FINDINGS .............3**\n\n**INTRODUCTION ...............................................................8**\n\n**THE EXPANSION OF THE ATTACK SURFACE ................10**\n\n**ATTACKER BEHAVIOR ...................................................13**\n\n**The Reconnaissance Phase ..........................................13**\n\nWeb Attack Methods: “Short Tail” Threats Help\nAdversaries Lay the Groundwork for Campaigns ..........13\n\n**The Weaponization Phase ............................................15**\n\nWeb Attack Vectors: Flash Is Fading, but\nUsers Must Remain Vigilant ..........................................15\nApplication Security: Managing OAuth Connection\nRisk Amid an App Explosion .........................................16\n\n**The Delivery Phase .......................................................20**\n\nDisappearance of Major Exploit Kits Presents\nOpportunities for Smaller Players and New Entrants ......20\n\nMalvertising: Adversaries Use Brokers to Increase\nSpeed and Agility .........................................................22\n\nInvestigation Finds 75 Percent of Organizations\nAffected by Adware Infections......................................23\n\nGlobal Spam Is Increasing—and So Is the\nPercentage of Malicious Attachments ..........................25\n\n**The Installation Phase ...................................................30**\n\nWeb Attack Methods: “Long Tail” Snapshot\nReveals Threats That Users Can Easily Avoid ...............30\n\nVertical Risk of Malware Encounters: Attackers\nSee Value Across the Board .........................................31\n\nRegional Overview of Web Block Activity......................32\n\nTime to Detection: An Essential Metric for\nMeasuring Defenders’ Progress ...................................33\n\nTime to Evolve: For Some Threats,\nChange Is Constant .......................................................34\n\n**2**\n\n\n**DEFENDER BEHAVIOR ...................................................42**\n\nVulnerabilities on the Decline in 2016 ...........................42\n\nMiddleware: Adversaries See Opportunity in\nUnpatched Software .....................................................44\n\nTime to Patch: Closing the Recovery Time Frame ........45\n\n**CISCO 2017 SECURITY CAPABILITIES**\n**BENCHMARK STUDY .....................................................49**\n\nPerceptions: Security Professionals Confident\nin Tools, Less Sure They’re Using Them Effectively ......49\n\nConstraints: Time, Talent, and Money\nAffect the Ability to Respond to Threats .......................51\n\nImpact: More Organizations Experiencing Losses\nfrom Breaches ..............................................................55\n\nOutcomes: Increased Scrutiny Will Play a Role in\nSecurity Improvements .................................................58\n\nTrust Versus Cost: What Drives\nSecurity Purchases? .....................................................61\n\nSummary: What the Benchmark Study Reveals ............62\n\n**INDUSTRY .....................................................................64**\n\nValue Chain Security: Success in a Digital\nWorld Hinges on Mitigating Third-Party Risk .................64\n\nGeopolitical Update: Encryption, Trust, and a\nCall for Transparency ....................................................65\n\nHigh-Speed Encryption: A Scalable Solution\nto Protecting Data in Transit..........................................66\n\nNetwork Performance and Adoption Versus\nSecurity Maturity ...........................................................67\n\n**CONCLUSION ................................................................71**\n\nA Rapidly Expanding Attack Surface Requires an\nInterconnected and Integrated Approach to Security .......71\n\nThe Key Goal: Reducing Adversaries’\nOperational Space ........................................................73\n\n**ABOUT CISCO ...............................................................74**\n\nContributors to the Cisco 2017 Annual\nCybersecurity Report ....................................................75\n\n**APPENDIX .....................................................................78**\n\n**Table of Contents**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Executive Summary\n\n##### As the attack surface increases, defenders must focus on their most  important goal: reducing their adversaries’ operational space.\n\n\nAdversaries have more tools at their disposal than ever\nbefore. They also have a keen sense of when to use each\none for maximum effect. The explosive growth of mobile\nendpoints and online traffic works in their favor. They have\nmore space in which to operate and more choices of\ntargets and approaches.\n\nDefenders can use an array of strategies to meet the\nchallenges of an expanding threat landscape. They can\npurchase best-of-breed solutions that work separately to\nprovide information and protection. And they can compete\nfor personnel in a market where talent is in short supply and\nbudgets are tight.\n\nStopping all attacks may not be possible. But you can\nminimize both the risk and the impact of threats by\nconstraining your adversaries’ operational space and, thus,\ntheir ability to compromise assets. One measure you can\ntake is simplifying your collection of security tools into an\ninterconnected and integrated security architecture.\n\nIntegrated security tools working together in an\nautomated architecture can streamline the process of\ndetecting and mitigating threats. You will then have time\nto address more complex and persistent issues. Many\norganizations use at least a half dozen solutions from just\nas many vendors (page 53). In many cases, their security\nteams can investigate only half the security alerts they\nreceive on a given day.\n\nThe Cisco 2017 Annual Cybersecurity Report presents\nresearch, insights, and perspectives from Cisco Security\nResearch. We highlight the relentless push-and-pull\ndynamic between adversaries trying to gain more time\nto operate and defenders working to close the windows\n\n\nof opportunity that attackers try to exploit. We examine\ndata compiled by Cisco threat researchers and other\nexperts. Our research and insights are intended to help\norganizations respond effectively to today’s rapidly evolving\nand sophisticated threats.\n\n**This report is divided into the following sections:**\n\n**Attacker Behavior**\n\nIn this section, we examine how attackers reconnoiter\nvulnerable networks and deliver malware. We explain how\ntools such as email, third-party cloud applications, and\nadware are weaponized. And we describe the methods\nthat cybercriminals employ during the installation phase\nof an attack. This section also introduces our “time to\nevolve” (TTE) research, which shows how adversaries keep\ntheir tactics fresh and evade detection. We also give an\nupdate on our efforts to reduce our average median time to\ndetection (TTD). In addition, we present the latest research\nfrom Cisco on malware risk for various industries and\ngeographic regions.\n\n**Defender Behavior**\n\nWe offer updates on vulnerabilities in this section. One\nfocus is on the emerging weaknesses in middleware\nlibraries that present opportunities for adversaries to use\nthe same tools across many applications, reducing the\ntime and cost needed to compromise users. We also share\nCisco’s research on patching trends. We note the benefit\nof presenting users with a regular cadence of updates to\nencourage the adoption of safer versions of common web\nbrowsers and productivity solutions.\n\n\n**3** **Executive Summary and Major Findings**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\nThis section covers the results of our third Security\nCapabilities Benchmark study, which focuses on security\nprofessionals’ perceptions of the state of security in\ntheir organizations. This year, security professionals\nseem confident in the tools they have on hand, but\nthey are uncertain about whether these resources can\nhelp them reduce the operational space of adversaries.\nThe study also shows that public security breaches are\nhaving a measurable impact on opportunities, revenue,\nand customers. At the same time, breaches are driving\ntechnology and process improvements in organizations.\nFor more in-depth analysis around the state of security\nin organizations, go to page 49.\n\n\n**Industry**\n\nIn this section, we explain the importance of ensuring\nvalue chain security. We examine the potential harm of\ngovernments stockpiling information about zero-day\nexploits and vulnerabilities in vendors’ products. In addition,\nwe discuss the use of rapid encryption as a solution for\nprotecting data in high-speed environments. Finally, we\noutline the challenges of organizational security as global\nInternet traffic, and the potential attack surface, grow.\n\n**Conclusion**\n\nIn the conclusion, we suggest that defenders adapt their\nsecurity practices so they can better meet typical security\nchallenges along the attack chain and reduce adversaries’\noperational space. This section also offers specific\nguidance on establishing an integrated and simplified\napproach to security: one that will connect executive\nleadership, policy, protocols, and tools to prevent, detect,\nand mitigate threats.\n\n\n**4** **Executive Summary and Major Findings**\n\n\n**4**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Major Findings\n\n - hree leading exploit kits—Angler, Nuclear, and\n\nNeutrino—abruptly disappeared from the landscape\nin 2016, leaving room for smaller players and new\nentrants to make their mark.\n\n - ccording to the Cisco 2017 Security Capabilities\n\nBenchmark Study, most companies use more than five\nsecurity vendors and more than five security products\nin their environment. Fifty-five percent of the security\nprofessionals use at least six vendors; 45 percent use\nanywhere from one to five vendors; and 65 percent\nuse six or more products.\n\n - he top constraints to adopting advanced security\n\nproducts and solutions, according to the benchmark\nstudy, are budget (cited by 35 percent of the\nrespondents), product compatibility (28 percent),\ncertification (25 percent), and talent (25 percent).\n\n - he Cisco 2017 Security Capabilities Benchmark\n\nStudy found that, due to various constraints,\norganizations can investigate only 56 percent of\nthe security alerts they receive on a given day. Half\nof the investigated alerts (28 percent) are deemed\nlegitimate; less than half (46 percent) of legitimate\nalerts are remediated. In addition, 44 percent of\nsecurity operations managers see more than 5000\nsecurity alerts per day.\n\n - wenty-seven percent of connected third-party cloud\n\napplications introduced by employees into enterprise\nenvironments in 2016 posed a high security risk.\nOpen authentication (OAuth) connections touch the\ncorporate infrastructure and can communicate freely\nwith corporate cloud and software-as-a-service\n(SaaS) platforms after users grant access.\n\n\n\n- n investigation by Cisco that included 130\n\norganizations across verticals found that 75 percent\nof those companies are affected by adware infections.\nAdversaries can potentially use these infections to\nfacilitate other malware attacks.\n\n- ncreasingly, the operators behind malvertising\n\ncampaigns are using brokers (also referred to as\n“gates”). Brokers enable them to move with greater\nspeed, maintain their operational space, and evade\ndetection. These intermediary links allow adversaries\nto switch quickly from one malicious server to another\nwithout changing the initial redirection.\n\n- pam accounts for nearly two-thirds (65 percent)\n\nof total email volume, and our research suggests\nthat global spam volume is growing due to large and\nthriving spam-sending botnets. According to Cisco\nthreat researchers, about 8 percent to 10 percent of\nthe global spam observed in 2016 could be classified\nas malicious. In addition, the percentage of spam\nwith malicious email attachments is increasing, and\nadversaries appear to be experimenting with a wide\nrange of file types to help their campaigns succeed.\n\n- ccording to the Security Capabilities Benchmark\n\nStudy, organizations that have not yet suffered a\nsecurity breach may believe their networks are safe.\nThis confidence is probably misplaced, considering\nthat 49 percent of the security professionals surveyed\nsaid their organizations have had to manage public\nscrutiny following a security breach.\n\n\n**5** **Executive Summary and Major Findings**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n- he Cisco 2017 Security Capabilities Benchmark\n\nStudy also found that nearly a quarter of the\norganizations that have suffered an attack lost\nbusiness opportunities. Four in 10 said those\nlosses are substantial. One in five organizations lost\ncustomers due to an attack, and nearly 30 percent\nlost revenue.\n\n- hen breaches occur, operations and finance\n\nwere the functions most likely to be affected (36\npercent and 30 percent, respectively), followed\nby brand reputation and customer retention (both\nat 26 percent), according to respondents to the\nbenchmark study.\n\n- etwork outages that are caused by security breaches\n\ncan often have a long-lasting impact. According to\nthe benchmark study, 45 percent of the outages\nlasted from 1 to 8 hours; 15 percent lasted 9 to 16\nhours, and 11 percent lasted 17 to 24 hours. Fortyone percent (see page 55) of these outages affected\nbetween 11 percent and 30 percent of systems.\n\n\n\n- ulnerabilities in middleware—software that serves\n\nas a bridge or connector between platforms or\napplications—are becoming more apparent, raising\nconcerns that middleware is becoming a popular\nthreat vector. Many enterprises rely on middleware,\nso the threat could affect every industry. During the\ncourse of a Cisco® project, our threat researchers\ndiscovered that a majority of new vulnerabilities\nexamined were attributable to the use of middleware.\n\n- he cadence of software updates can affect user\n\nbehavior when it comes to installing patches and\nupgrades. According to our researchers, regular and\npredictable update schedules result in users upgrading\ntheir software sooner, reducing the time during which\nadversaries can take advantage of vulnerabilities.\n\n- he 2017 Security Capabilities Benchmark Study\n\nfound that most organizations rely on third-party\nvendors for at least 20 percent of their security, and\nthose who rely most heavily on these resources are\nmost likely to expand their use in the future.\n\n\n**6** **Executive Summary and Major Findings**\n\n\n**Executive Summary and Major Findings**\n\n\n-----\n\n# Introduction\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Introduction\n\nAdversaries have a vast and varied portfolio of techniques\nfor gaining access to organizational resources and for\nattaining unconstrained time to operate. Their strategies\ncover all the basics and include:\n\n - Taking advantage of lapses in patching and updating\n\n - Luring users into socially engineered traps\n\n - Injecting malware into supposedly legitimate online content\nsuch as advertising\n\nThey have many other capabilities, as well, from exploiting\nmiddleware vulnerabilities to dropping malicious spam. And\nonce they’ve achieved their goals, they can quickly and\nquietly shut down their operations.\n\nAdversaries work nonstop to evolve their threats, move with\neven more speed, and find ways to widen their operational\nspace. The explosive growth in Internet traffic—driven\nlargely by faster mobile speeds and the proliferation of\nonline devices—works in their favor by helping to expand the\nattack surface. As that happens, the stakes grow higher for\nenterprises. The Cisco 2017 Security Capabilities Benchmark\nStudy found that more than one-third of organizations that\nhave been subject to an attack lost 20 percent of revenue\nor more. Forty-nine percent of the respondents said their\nbusiness had faced public scrutiny due to a security breach.\n\nHow many enterprises can suffer such damage to their\nbottom line and remain healthy? Defenders must focus their\nresources on reducing their adversaries’ operational space.\nAttackers will then find it extremely difficult to gain access\n\n\nto valuable enterprise resources and to conduct their\nactivities without being detected.\n\nAutomation is essential to achieving this goal. It helps\nyou understand what normal activity is in the network\nenvironment, so you can focus scarce resources on\ninvestigating and resolving true threats. Simplifying\nsecurity operations also helps you become more effective\nat eliminating adversaries’ unconstrained operational\nspace. However, the benchmark study shows that most\norganizations are using more than five solutions from\nmore than five vendors (page 53).\n\nSuch a complex web of technology, and the overwhelming\nnumber of security alerts, is a recipe for less, not more,\nprotection. Adding more security talent can help, of\ncourse. With more experts on board, the logic goes, the\nbetter the organization’s ability to manage technology and\ndeliver better outcomes. However, scarce security talent\nand limited security budgets make hiring sprees unlikely.\nInstead, most organizations must make do with the talent\nthey have. They rely on outsourced talent to add muscle to\ntheir security teams while also conserving budget.\n\nThe real answer to meeting these challenges, as we\nexplain later in this report, is to operationalize people,\nprocesses, and technology in an integrated manner. To\noperationalize security is to truly understand what the\nenterprise needs to protect, as well as what measures\nshould be used to protect those vital assets.\n\n\n**8** **Introduction**\n\n\n-----\n\n# The Expansion of the  Attack Surface\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### The Expansion of the  Attack Surface\n\n\n_Mobile devices. Public cloud. Cloud infrastructure. User_\n_behavior. Security professionals who participated in Cisco’s_\nthird annual Security Capabilities Benchmark Study cited\nall those elements as top sources of concern when they\nthink about their organization’s risk of exposure to a cyber\nattack (Figure 1). This is understandable: The proliferation\nof mobile devices creates more endpoints to protect. The\ncloud is expanding the security perimeter. And users are,\nand always will be, a weak link in the security chain.\n\nAs businesses embrace digitization—and the Internet of\nEverything (IoE)¹ begins to take shape—defenders will have\neven more to worry about. The attack surface will only\nexpand, giving adversaries more space to operate.\n\n[For more than a decade, the Cisco® Visual Networking](http://www.cisco.com/c/en/us/solutions/service-provider/visual-networking-index-vni/index.html)\n[Index (VNI) has provided global IP traffic forecasts and](http://www.cisco.com/c/en/us/solutions/service-provider/visual-networking-index-vni/index.html)\n\n\nanalyzed the dynamic factors that facilitate network growth.\nConsider these statistics from the most recent report,\n_The Zettabyte Era—Trends and Analysis:²_\n\n - Annual global IP traffic will pass the zettabyte (ZB)\nthreshold by the end of 2016 and reach 2.3 ZB per year by\n\n2020. (A zettabyte is 1000 exabytes, or 1 billion terabytes.)\nThat represents a threefold increase in global IP traffic in\nthe next 5 years.\n\n - Traffic from wireless and mobile devices will account for\ntwo-thirds (66 percent) of total IP traffic by 2020. Wired\ndevices will account for only 34 percent.\n\n - From 2015 to 2020, average broadband speeds will\nnearly double.\n\n - By 2020, 82 percent of all consumer Internet traffic globally\nwill be IP video traffic, up from 70 percent in 2015.\n\n\n###### Figure 1  Security Professionals’ Biggest Sources of Concern Related to Cyber Attacks\n\n\nMobile Devices Data in Public Cloud\n\n\nCloud Infrastructure\n\n#### 57%\n\n\nUser Behavior\n(For Example, Clicking Malicious\n\nLinks in Email or Websites)\n\n#### 57%\n\n\n#### 58%\n\n\n#### 57%\n\n\n**Percentage of Security Professionals Who Find the Categories Very or Extremely Challenging**\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n[¹ “Internet of Everything FAQ,” Cisco: http://ioeassessment.cisco.com/learn/ioe-faq.](http://ioeassessment.cisco.com/learn/ioe-faq)\n² The Zettabyte Era—Trends and Analysis, Cisco VNI, 2016:\n\n[http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/vni-hyperconnectivity-wp.html.](http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/vni-hyperconnectivity-wp.html)\n\n\n**10**\n\n\n**The Expansion of the Attack Surface**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nIn addition, the Cisco VNI™ Forecast and Methodology,\n_2015–2020 white paper³ predicts that the volume of_\nglobal Internet traffic in 2020 will be 95 times as great as\nit was in 2005.\n\nOf course, opportunistic cybercriminals pay close\nattention to these trends, too. We are already seeing\noperators in the shadow economy taking steps to become\nmore agile in this changing environment. They are creating\nhighly targeted and varied attacks designed to succeed\nacross the expanding attack surface. Meanwhile, security\nteams are in a constant firefighting mode, overwhelmed\nby alerts. They’re having to rely on an array of security\nproducts in the network environment that only add more\ncomplexity and can even increase an organization’s\nsusceptibility to threats.\n\n\nOrganizations must:\n\n - Integrate their security technology\n\n - Simplify their security operations\n\n - Rely more on automation\n\nThis approach will help reduce operational expenses, ease\nthe burden on security personnel, and deliver better security\noutcomes. Most important, it will give defenders the ability\nto focus more of their time on eliminating the unconstrained\nspace in which adversaries currently operate.\n\n.\n\n**The Expansion of the Attack Surface**\n\n\n³ Cisco VNI Forecast and Methodology, 2015–2020, Cisco VNI, 2016:\n\n[http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/complete-white-paper-c11-481360.html](http://www.cisco.com/c/en/us/solutions/collateral/service-provider/visual-networking-index-vni/complete-white-paper-c11-481360.html)\n\n**11**\n\n\n-----\n\n# Attacker Behavior\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Attacker Behavior\n\n\n###### Web Attack Methods: “Short Tail” Threats Help Adversaries Lay the Groundwork  for Campaigns\n\nReconnaissance is, of course, a foundational step for\nlaunching a cyber attack. In this phase, adversaries look for\nvulnerable Internet infrastructure or network weaknesses\nthat will allow them to gain access to users’ computers and,\nultimately, to infiltrate organizations.\n\nSuspicious Windows binaries and potentially unwanted\napplications (PUAs) topped the list of web attack\nmethods for 2016 by a significant margin (see Figure 2).\nSuspicious Windows binaries deliver threats such as\nspyware and adware. Malicious browser extensions are\nan example of PUAs.\n\nFacebook scams, which include fake offers and media\ncontent along with survey scams, ranked third on our\nlist. The continued prominence of Facebook scams\non our annual and midyear lists of the most commonly\nobserved malware highlights the foundational role of social\nengineering in many cyber attacks. Facebook has nearly\n1.8 billion monthly active users worldwide.⁴ It is logical\nterritory for cybercriminals and other actors looking to dupe\nusers. One positive development is the company’s recent\nannouncement that it is taking steps to eliminate fake\nnews and hoaxes. Critics suggest such content may have\ninfluenced voters in the 2016 U.S. presidential election.⁵\n\n[⁴ Facebook stats, September 2016: http://newsroom.fb.com/company-info/.](http://newsroom.fb.com/company-info/)\n\n⁵ “Zuckerberg Vows to Weed Out Facebook ‘Fake News,’” by Jessica Guynn and\n\nKevin McCoy, USA Today, November 14, 2016:\n[http://www.usatoday.com/story/tech/2016/11/13/zuckerberg-vows-weed-](http://www.usatoday.com/story/tech/2016/11/13/zuckerberg-vows-weed-out-facebook-fake-news/93770512/)\n[out-facebook-fake-news/93770512/.](http://www.usatoday.com/story/tech/2016/11/13/zuckerberg-vows-weed-out-facebook-fake-news/93770512/)\n\n**13**\n\n\n###### Figure 2  Most Commonly Observed Malware\n\n**Sample**\n\n**Count**\n\n\n**Attacker Behavior**\n\n\n87,329\n\n50,081\n\n35,887\n\n27,627\n\n24,737\n\n18,505\n\n15,933\n\n14,020\n\n12,848\n\n11,600\n\n11,506\n\n7712\n\n5995\n\n5510\n\n5467\n\n4970\n\n4584\n\n4398\n\n3646\n\n3006\n\n\nPUA and Suspicious Binaries\n\nTrojan Droppers (VBS)\n\nFacebook Scam Links\n\nTrojan Downloaders (Scripts)\n\nBrowser Redirection (JS)\n\nBrowser Redirection-Downloads\n\nPhishing (Links)\n\nAndroid Trojans (Iop)\n\nBrowser Redirection\n\nFacebook Hijacking\n\nHeuristic Blocks (Scripts)\n\nPacked Binaries\n\nTrojan Downloaders (JS)\n\nTrojans, Heuristic (Win32)\n\nBrowser iFrame Attacks\n\nAndroid (Axent)\n\nAndroid Trojans (Loki)\n\nMalware (FakeAvCn)\n\nTrojans (HideLink)\n\nMalware (HappJS)\n\n\nSource: Cisco Security Research\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nBrowser redirection malware rounded out the top five most\ncommonly observed malware types for 2016. As discussed\nin the Cisco 2016 Midyear Cybersecurity Report,⁶ browser\ninfections can expose users to malicious advertising\n(malvertising), which adversaries use to set up ransomware\nand other malware campaigns. Cisco threat researchers warn\nthat malicious adware, which includes ad injectors, browsersettings hijackers, utilities, and downloaders, is a growing\nproblem. In fact, we have identified adware infections in 75\npercent of the companies we recently investigated as part\nof our research into the adware problem. (For more on this\ntopic, see “Investigation Finds 75 Percent of Organizations\nAffected by Adware Infections,” page 23.)\n\n\n10 most commonly seen types of malware in 2016. Loki\nmalware, which appears toward the very end of the short\ntail shown in Figure 2 (see previous page), is particularly\ntroublesome because it can replicate and infect other files\nand programs.\n\nFigure 3 helps to illustrate malware trends that Cisco\nthreat researchers have observed since late 2015. It\nshows that adversaries have made a definite shift in the\nreconnaissance phase of web-based attacks. More threats\nnow specifically seek vulnerable browsers and plugins. This\nshift corresponds with adversaries’ growing reliance on\nmalvertising, as it becomes more difficult to exploit large\nnumbers of users through traditional web attack vectors.\n(See the next section, “Web Attack Vectors: Flash Is\nFading, but Users Must Remain Vigilant,” page 15.)\n\n\nOther malware types listed in Figure 3, such as browser\nJavaScript abuse malware and browser iFrame abuse\nmalware, are also designed to facilitate browser\ninfections. Trojans (droppers and downloaders) also\nappear among the top five most commonly observed\nmalware types, which indicates that they remain popular\ntools for gaining initial access to users’ computers and\nto organizational networks.\n\nAnother trend to watch: consistently high use of malware\nthat targets users of the Android operating platform.\nAndroid Trojans have been moving steadily up the shorttail list over the past 2 years. They ranked among the top\n\n\nThe message for individual users, security professionals,\nand enterprises is clear: Making sure that browsers are\nsecure, and disabling or removing unnecessary browser\nplugins, can go a long way toward preventing malware\ninfections. These infections can lead to more significant,\ndisruptive, and costly attacks, such as ransomware\ncampaigns. These simple steps can greatly reduce your\nexposure to common web-based threats and prevent\nadversaries from finding the operational space to carry out\nthe next phase of the attack chain: weaponization.\n\n\n###### Figure 3  Most Commonly Observed Malware, Q4 2015–Q3 2016\n\n50K\n\n\n40K\n\n30K\n\n\n20K\n\n10K\n\n\n0K\n\nSource: Cisco Security Research\n\n\nQ4 2015 Q1 2016 Q2 2016 Q3 2016\n\n\n⁶ _[Cisco 2016 Midyear Cybersecurity Report: http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html.](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)_\n\n**14**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n##### Reconnaissance Weaponization Delivery\n\nAttackers pair remote access malware with exploits in deliverable payloads.\n\n###### Web Attack Vectors: Flash Is Fading, but Users Must Remain Vigilant\n\n\nAdobe Flash has long been an attractive web attack\nvector for adversaries who want to exploit and\ncompromise systems. However, as the amount of\nAdobe Flash content on the web continues to decline—\nand awareness about Flash vulnerabilities grows—it is\nbecoming more difficult for cybercriminals to exploit\nusers at the scale they once enjoyed.\n\nAdobe itself is moving away from full development and\nsupport of the software platform and has encouraged\ndevelopers to adopt newer standards such as HTML5.⁷\nProviders of popular web browsers are also taking a strong\nposition on Flash. For example, Google announced in 2016\nthat it will phase out full support for Adobe Flash on its\nChrome browser.⁸ Firefox is continuing to support legacy\nFlash content, but it is blocking “certain Flash content that\nis not essential to the user experience.”⁹\n\nFlash may be fading, but exploit kit developers are helping\nit endure as an attack vector. However, there are signs this\nmay be changing. After three leading exploit kits—Angler,\nNuclear, and Neutrino—abruptly disappeared from the\nthreat landscape in 2016, our threat researchers observed\na significant decline in Flash-related Internet traffic. (See\n“Disappearance of Major Exploit Kits Presents Opportunities\nfor Smaller Players and New Entrants,” page 20.) The\nactors behind the Angler exploit kit heavily targeted Flash\nvulnerabilities to compromise users. The Nuclear exploit kit\nhad a similar focus on Flash. And Neutrino relied on Flash\nfiles to deliver exploits.\n\n\nUsers must remain cautious and should uninstall Flash\nunless they need it for business reasons. If they must use it,\nthey must stay current with updates. Using web browsers\nthat feature automatic patching capabilities can help. As\nnoted in “Web Attack Methods: ‘Short Tail’ Threats Help\nAdversaries Lay the Groundwork for Campaigns” on\npage 13, using secure browsers—and disabling or removing\nunnecessary browser plugins—will significantly reduce your\nexposure to web-based threats.\n\n**Java, PDF, and Silverlight**\n\nBoth Java and PDF Internet traffic experienced notable\ndeclines in 2016. Silverlight traffic has already reached a\nlevel that is not worthwhile for threat researchers to\ntrack regularly.\n\nJava, once the dominant web attack vector, has seen\nits security posture improve significantly in recent years.\nOracle’s decision in early 2016 to eliminate its Java\nbrowser plugin has helped to make Java a less attractive\nweb attack vector. PDF attacks are also increasingly rare.\nFor that reason, they can be easier to detect, which is why\nmany adversaries now use this strategy less often.\n\nHowever, as with Flash, cybercriminals still use Java, PDF,\nand Silverlight to exploit users. Individual users, enterprises,\nand security professionals must be aware of these potential\nroads to compromise. To reduce their risk of exposure to\nthese threats, they must:\n\n - Download patches\n\n - Use up-to-date web technology\n\n - Avoid web content that might present risk\n\n\n⁷ [“Flash, HTML5 and Open Web Standards,” Adobe News, November 2015: https://blogs.adobe.com/conversations/2015/11/flash-html5-and-open-web-standards.html.](https://blogs.adobe.com/conversations/2015/11/flash-html5-and-open-web-standards.html)\n⁸ [“Flash and Chrome,” by Anthony LaForge, The Keyword blog, Google, August 9, 2016: https://blog.google/products/chrome/flash-and-chrome/.](https://blog.google/products/chrome/flash-and-chrome/)\n⁹ “Reducing Adobe Flash Usage in Firefox,” by Benjamin Smedberg, Future Release blog, Mozilla, July 20, 2016:\n\n[https://blog.mozilla.org/futurereleases/2016/07/20/reducing-adobe-flash-usage-in-firefox/.](https://blog.mozilla.org/futurereleases/2016/07/20/reducing-adobe-flash-usage-in-firefox/)\n\n\n**15**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Application Security: Managing OAuth Connection Risk Amid an App Explosion\n\n\nWhen enterprises shift to the cloud, their security perimeter\nextends into the virtual realm. However, that security perimeter\nquickly dissipates with each connected third-party cloud\napplication that employees introduce into the environment.\n\nWorkers want to improve their productivity and stay\nconnected while on the job. But these shadow IT\napplications create a risk for enterprises. They touch the\ncorporate infrastructure and can communicate freely with the\ncorporate cloud and software-as-a-service (SaaS) platforms\nas soon as users grant access through open authentication\n(OAuth). These apps can have extensive—and, at times,\nexcessive—access scopes. They must be managed carefully\nbecause they can view, delete, externalize, and store\ncorporate data, and even act on behalf of users.\n\nThe cloud security provider CloudLock, now part of Cisco,\nhas been tracking the growth of connected third-party cloud\napplications across a sample group of 900 organizations\nrepresenting a range of industries. As Figure 4 shows, there\nwere about 129,000 unique applications observed at the\nbeginning of 2016. By the end of October, that number had\ngrown to 222,000.\n\nThe number of applications has increased approximately\n11 times since 2014. (See Figure 5.)\n\n**Classifying the Riskiest Applications**\n\nTo help security teams understand which connected thirdparty cloud applications in their environment present the\nmost risk to network security, CloudLock developed the\nCloud Application Risk Index (CARI). The process involves\nseveral evaluations:\n\n - **Data-access requirements: Organizations answer the**\nfollowing questions, among others: What permissions\nare required to authorize the application? Does granting\ndata access mean that the application has programmatic\n(API) access to corporate SaaS platforms through OAuth\nconnections? Can the application (and by extension,\nthe vendor) act on behalf of users and take actions with\ncorporate data, such as viewing and deleting?\n\n**16**\n\n\n\n - **Community trust rating: Peer-driven and crowd-sourced**\nevaluations are used for this assessment.\n\n - **Application threat intelligence: This comprehensive**\nbackground check by cybersecurity experts is based on an\napplication’s various security attributes, such as security\ncertifications, breach history, and analyst reviews.\n\n###### Figure 4  Explosive Growth of Connected Third-Party\n**Cloud Applications, 2016**\n\n#### 222,000\n\nOctober\n\n###### 129,000\n\nJanuary\n\n**Number of Unique Applications**\n\nSource: Cisco CloudLock\n\n###### Figure 5  Growth of Third-Party Cloud Applications,\n**Year-Over-Year Comparison**\n\n#### 222,000\n\n###### 108,000\n\n20,400\n\nOct 2014 Oct 2015 Oct 2016\n\nSource: Cisco CloudLock\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n**Attacker Behavior**\n\n\n#### 222,000\n\nOctober\n\n###### 129,000\n\nJanuary\n\n\n#### 222,000\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n######   Risk Scores and Examples\n\non a scale of 1 (lowest risk) to 5 (highest risk).\n\na 100 percent community trust rating, and no breach history.\n\nAn app that would score 5 on the scale might be one with full account access (it can see all emails,\ndocuments, navigation history, calendar, and more), an 8 percent trust rating (meaning, only 8 percent of\nadministrators trust it), and no security certification.\n\nCloudLock used the CARI to categorize the 222,000\napplications it had identified across the 900 organizations\nin its sample. Of those total applications, 27 percent\nwere deemed to be high risk, while the majority fell into\nthe medium-risk category. (See Figure 6.) Half of those\norganizations had OAuth connections related to a\npopular gaming application that was released in the\nsummer of 2016.\n\n**17**\n\n\n###### Figure 6  Third-Party Applications Classified as \n**High Risk**\n\n###### 27%\nHigh Risk\n\n###### 15%\nLow Risk\n\n222,000\nThird-Party\nApplications\n\n###### 58%\nMedium Risk\n\nSource: Cisco CloudLock\n\n**S H A R E**\n\n**Attacker Behavior**\n\n\n###### 27%\nHigh Risk\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nThrough our analysis, we have found that all organizations,\nregardless of their size, industry, or region, have a\nrelatively even distribution of low-, medium-, and high-risk\napplications (Figures 7 and 8).\n\n###### Figure 7  Distribution of Low-, Medium-, and High-Risk Applications, by Region\n\n15 12 10\n\n###### 31 30 32\n\n**North**\n\n**LATAM** **EMEA**\n\n**America**\n\n54 58 58\n\nLow Risk Medium Risk High Risk\n\nSource: Cisco CloudLock\n\n###### Figure 8  Distribution of Low-, Medium-, and High-Risk Applications, by Industry\n\n\n###### Figure 7  Distribution of Low-, Medium-, and High-Risk Applications, by Region\n\n12 10\n\n###### 30 32\n\n**LATAM** **EMEA**\n\n\n10 11\n\n###### 30\n\n**EMEA** **APAC**\n\n\n**LATAM**\n\n\n###### 31\n\n**North**\n**America**\n\n\n###### 30\n\n**LATAM**\n\n\n###### 35\n\n\n###### 28\n\n\n###### 31\n\n\n###### 31\n\n\nHealthcare Providers\n\n14\n\n###### 30\n\n56\n\nTechnology\n\n\n10\n\n###### 32 30\n\n**EMEA**\n\n\n15\n\n**North**\n**America**\n\n\n###### 33\n\n\n###### 31\n\n\nHigher Education\n\n12\n\n###### 30\n\n58\n\nTravel, Hospitality,\nand Transportation\n\n\n15 12\n\n###### 30\n\n**North**\n\n**LATAM**\n\n**America**\n\n54 58\n\n\nK-12\n\nOthers\n\n\n**APAC**\n\n\nManufacturing\n\n**Attacker Behavior**\n\n\nFinancial Services\n\n16\n\n###### 28\n\n56\n\nMedia and\nEntertainment\n\nSource: Cisco CloudLock\n\n\nGovernment\n\n10\n\n58\n\nRetail\n\n\n###### 32\n\n\n###### 28\n\n\n###### 30\n\n\nLow Risk Medium Risk High Risk\n\n\n###### 32\n\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n\n###### 30\n\n\n**18**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**Cutting Through the Noise**\n\nTo identify suspicious user and entity behavior in\ncorporate SaaS platforms, including third-party cloud\napplications, security teams must sift through billions of\nuser activities to define normal patterns of user behavior\nin their organization's environment. They must look for\nanomalies that fall outside those expected patterns. Then\nthey need to correlate suspicious activities to determine\nwhat might be a true threat that requires investigation.\n\nAn example of suspicious activity is excessive login activity\nfrom several countries in a short period. Say that normal\nuser behavior in a certain organization is for employees to\nlog in to a specific application from no more than one or\ntwo countries per week. If one user starts logging in to that\napplication from 68 countries over the course of one week,\n\n\na security team will want to investigate that activity\nto confirm that it is legitimate.\n\nAccording to our analysis, only 1 in 5000 user activities—\n0.02 percent—that are associated with connected third-party\ncloud applications is suspicious. The challenge for security\nteams, of course, is pinpointing that one instance.\n\nOnly with automation can security teams cut through\nthe “noise” of security alerts and focus their resources\non investigating true threats. The multistage process\nof identifying normal and potentially suspicious user\nactivities that is described above—and illustrated in\nFigure 9—hinges on the use of automation, with\nalgorithms applied at every stage.\n\n\n###### Figure 9  Identifying User Behavior Patterns with Automation (Process)\n\n**All User Behavior**\n\n**Anomalies**\n\n**Suspicious Activities**\n0.02% of All Activities\n\n113X\nThan Average 58% Abnormal Behavior\nLogin Failures\n\n227X\n\n1 Billion User Activities Per Month Than Average 31% Login Activities\n\nFile Downloads\n\n141X\nThan Average 11% Admin Actions\nData Asset Deletion\n\nSource: Cisco CloudLock\n\n**S H A R E**\n\n**19**\n\n\n**Anomalies**\n\n**Suspicious Activities**\n0.02% of All Activities\n\n**True Threat**\n\n113X\nThan Average 58% Abnormal Behavior\nLogin Failures\n\n227X\n\n1 Billion User Activities Per Month Than Average 31% Login Activities\n\nFile Downloads\n\n141X\nThan Average 11% Admin Actions\nData Asset Deletion\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n##### Reconnaissance Weaponization\n\nThrough the malicious use of email, file attachments, websites, and other tools, attackers transmit\ntheir cyberweapons to targets.\n\n###### Disappearance of Major Exploit Kits Presents Opportunities for Smaller  Players and New Entrants\n\n\n###### Figure 10  Exploit Kit Landing Page Blocks,  January —November 2016\n\n7407\n\n\n2016 saw dramatic changes in the exploit kit environment.\nAt the start of the year, Angler, Nuclear, Neutrino, and RIG\nwere clear leaders among exploit kits. By November, RIG was\nthe only one from that group still active. As Figure 10 shows,\nexploit kit activity dropped off significantly around June.\n\nNuclear was the first to disappear, suddenly ceasing\noperation in May. Why its authors abandoned it is a\nmystery. The Neutrino exploit kit, which also left the scene\nin 2016, relied on Flash files to deliver vulnerabilities. (See\nFigure 11 on next page for a list of top vulnerabilities in\nknown exploit kits in 2016.)\n\nFlash remains an attractive web attack vector for\nadversaries, but it is likely to become less so over time.\nFewer sites and browsers are supporting Flash fully or\nat all, and there is generally greater awareness about\nFlash vulnerabilities. (For more on this topic, see “Web\nAttack Vectors: Flash Is Fading, but Users Must Remain\nVigilant,” on page 15.)\n\n\n1051\n\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n**Attacker Behavior**\n\n\n7K\n\n6K\n\n\n5K\n\n4K\n\n\n3K\n\n2K\n\n\n1K\n\n\n1051\n\n\n0\n\nSource: Cisco Security Research\n\n\n**20**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**A Giant Goes Silent**\n\nAngler—the most advanced and largest among known\nexploit kits—also targeted Flash vulnerabilities and was\nlinked to several high-profile malvertising and ransomware\ncampaigns. However, unlike Nuclear and Neutrino’s\ndisappearance, Angler’s departure in 2016 is not a mystery.\n\nIn late spring, about 50 hackers and cybercriminals\nwere arrested in Russia; the group was linked to the\nLurk malware, a banking Trojan that specifically targeted\nRussian banks.¹⁰ Cisco threat researchers identified clear\nconnections between Lurk and Angler, including the fact\nthat Lurk was being delivered largely through Angler\nto victims inside Russia. Following the arrests, Angler\nvanished from the exploit kit marketplace.¹¹\n\n###### Figure 11  Top Vulnerabilities in Exploit Kits\n\nAngler\n\nNeutrino (1,2)\n\nMagnitude\n\nRIG\n\nNuclear\n\nSundown\n\nHunter\n\n2015- 2015- 2015- 2016- 2016- 2016CVE\n\nNow that three of the most dominant exploit kits have\ncleared the field, smaller players and new entrants can\nexpand their market share. And they are becoming more\nsophisticated and agile. Exploit kits that appeared poised\nfor growth in late 2016 were Sundown, Sweet Orange,\nand Magnitude. These kits, as well as RIG, are known to\ntarget Flash, Silverlight, and Microsoft Internet Explorer\nvulnerabilities. (See Figure 11.) Uninstalling Flash, and\ndisabling or removing unnecessary browser plugins, will\nhelp users reduce the risk that they will be compromised\nby these threats.\n\n\nFlash Silverlight IE 9-11 IE 10-11\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n[¹⁰ “Russian Hacker Gang Arrested Over $25M Theft,” BBC News, June 2, 2016: http://www.bbc.com/news/technology-36434104.](http://www.bbc.com/news/technology-36434104)\n¹¹ For more on this topic, see the July 2016 Cisco Talos blog post, [Connecting the Dots Reveals Crimeware Shake-Up.](http://blog.talosintel.com/2016/07/lurk-crimeware-connections.html)\n\n**21**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n\n**22**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Investigation Finds 75 Percent of Organizations Affected by Adware Infections\n\n\nAdware, when used for legitimate purposes, is software\nthat downloads or displays advertising through redirections,\npop-ups, and ad injections and generates revenue for its\ncreators. However, cybercriminals are also using adware\nas a tool to help increase their revenue stream. They\nuse malicious adware not only to profit from injecting\nadvertising, but also as a first step to facilitate other\nmalware campaigns, such as DNSChanger malware.\nMalicious adware is delivered through software bundles;\npublishers create one installer with a legitimate application\nalong with dozens of malicious adware applications.\n\nBad actors use adware to:\n\n - Inject advertising, which may lead to further infections or\nexposure to exploit kits\n\n - Change browser and operating system settings to\nweaken security\n\n - Break antivirus or other security products\n\n - Gain full control of the host, so they can install other\nmalicious software\n\n - Track users by location, identity, services used, and sites\ncommonly visited\n\n - Exfiltrate information such as personal data, credentials,\nand infrastructure information (for example, a company’s\ninternal sales pages)\n\nTo assess the scope of the adware problem for enterprises,\nCisco threat researchers examined 80 different adware\nvariants. About 130 organizations across verticals were\nincluded in our investigation, which took place from\nNovember 2015 to November 2016.\n\n**23**\n\n\nWe categorized the adware into four groups, based on the\nprimary behavior of each component:\n\n - **Ad injectors: This adware usually resides in the browser and**\ncan affect all operating systems.\n\n - **Browser-settings hijackers: This adware component can**\nchange computer settings to make the browser less secure.\n\n - **Utilities: This is a large and growing category of adware.**\nUtilities are web applications that offer a useful service to\nusers, such as PC optimization. These applications can inject\nadvertising, but their primary purpose is to convince users\nto pay for the service. However, in many cases, utilities are\nnothing more than scams and provide no benefits to users.\n\n - **Downloaders: This adware can deliver other software,**\nsuch as a toolbar.\n\nWe determined that 75 percent of the organizations in our\nstudy were affected by adware infections.\n\n###### Figure 12  Percentage of Organizations with  Adware Infections\n\nOver the past 12 months\n\n## >75%\n\nof organizations investigated\n\nhave adware infections\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n**Attacker Behavior**\n\n\nOver the past 12 months\n\n## >75%\n\nof organizations investigated\n\nhave adware infections\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nFigure 13 shows the types of incidents we observed\nin the organizations included in our investigation. Ad\ninjectors were the primary source of infections. This\nfinding indicates that most of these unwanted applications\ntarget web browsers. We have also seen an increase\nin browser-based infections during the last few years,\nwhich suggests adversaries are finding success with this\nstrategy for compromising users.\n\n\nAll the adware components we identified during our\ninvestigation can place users and organizations at risk\nfor malicious activity. Security teams must recognize the\nthreat that adware infections pose and make sure that\nusers in the organization are fully aware of the risks.\n\nFor additional information on this topic, see the February\n[2016 Cisco Security blog post, DNSChanger Outbreak](http://blogs.cisco.com/security/dnschanger-outbreak-linked-to-adware-install-base)\n[Linked to Adware Install Base.](http://blogs.cisco.com/security/dnschanger-outbreak-linked-to-adware-install-base)\n\n\n###### Figure 13  Breakdown of Total Incidents by Adware Component\n\n2.0%\n\n1.5%\n\n\n1.0%\n\n0.5%\n\n\n0\n\n60%\n\n50%\n\n40%\n\n30%\n\n20%\n\n10%\n\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\nUtilities Browser-Settings Hijackers Downloaders Ad Injectors\n\n\nSource: Cisco Security Research\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n\n**24**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Global Spam Is Increasing—and So Is the Percentage of Malicious Attachments\n\n\nCisco threat researchers conducted two studies in 2016\nusing opt-in customer telemetry to estimate what percentage\nof total email volume is spam. We found that spam accounts\nfor nearly two-thirds (65 percent) of total email volume. Our\nresearch also suggests that global spam volume is growing,\ndue primarily to large and thriving spam-sending botnets like\nNecurs. In addition, we determined through our analysis that\n\n###### Figure 14  IP Blocks by Country, December 2015—November 2016\n\nGermany\n\n414K | 548K\n\nFrance\n\nUnited States 222K | 467K\n1351K | 2046K\n\nMexico\n\n214K | 495K\n\nBrazil\n\n252K | 587K\n\nDec 2015\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n\nabout 8 percent to 10 percent of global spam observed in\n2016 could be categorized as malicious.\n\nFrom August to October 2016, there was a significant\nincrease in the number of IP connection blocks (Figure 14).¹²\nThis trend can be attributed to an overall rise in spam volume,\nas well as reputation systems adapting to information about\nspam senders.\n\n\nas well as reputation systems adapting to information about\n\nNecurs. In addition, we determined through our analysis that\n\nspam senders.\n\n###### Figure 14  IP Blocks by Country, December 2015—November 2016\n\nGermany\n\n414K | 548K Russia\n\n343K | 352K\n\nFrance\n\nUnited States 222K | 467K\n1351K | 2046K Japan\n\nChina\n\n194K | 286K\n\n903K | 760K\n\nVietnam\n\nMexico 990K | 1684K\n\n214K | 495K\n\nBrazil India\n\n252K | 587K 254K | 1662K\n\nDec 2015 Oct 2016\n\n\n¹² IP connection blocks are spam messages that are blocked immediately by spam-detecting technology because the spam sender has a bad reputation score. Examples include\n\nmessages that have originated from known spam-sending botnets or compromised networks that are known to participate in spam attacks.\n\n\n**25**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nThe five-year graph from the Composite Blocking List\n(CBL), a DNS-based “blackhole list” of suspected spamsending computer infections,¹³ also shows a dramatic\nincrease in total spam volume during 2016 (Figure 15).\n\n\nA review of 10-year data from CBL (not shown) suggests\nthat 2016 spam volume is close to the record-high levels\nseen in 2010. New antispam technologies, and high-profile\ntakedowns of spam-related botnets, have helped to keep\nspam levels low in recent years. Our threat researchers\nattribute the recent increase in global spam volume to\nthe Necurs botnet. Necurs is a primary vector for Locky\nransomware. It also distributes threats such as the Dridex\nbanking Trojan.\n\nFigure 16 is an internal graph generated by Cisco’s\nSpamCop service that illustrates the change in spam\n\n\nvolume observed in 2016. This graph shows the overall\nsize of the SpamCop Block List (SCBL) from November\n2015 to November 2016. Each row in the SCBL\nrepresents a distinct IP address.\n\nBetween November 2105 and February 2016, SCBL size\nhovered below 200,000 IP addresses. In September and\nOctober, SCBL size exceeded 400,000 IP addresses before\ndropping off in October, which our threat researchers\nattribute to the operators of Necurs simply taking time off.\nAlso note the significant decline in June. At the end of May,\nthere were arrests in Russia related to the Lurk banking\nTrojan (see page 21). Subsequently, several high-profile\nthreats, including Necurs, went silent. However, 3 weeks\nlater, Necurs was back in action, adding more than 200,000\nIP addresses to the SCBL in less than 2 hours.\n\n\n###### Figure 15  Total Spam Volume\n\n3.5K\n\n\n3K\n\n\n2.5K\n\n2K\n\n\n1.5K\n\n1K\n\n\n0.5K\n\n0\n\n\n2012 2013 2014 2015 2016\n\nSource: CBL\n\n\n###### Figure 16  Overall Size of SCBL\n\n500k\n\n\n400k\n\n300k\n\n\n200k\n\n100k\n\n\n0\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov\n2015 2016\n\nSource: SpamCop\n\n\n**S H A R E**\n\n[¹³ For more information about CBL, visit http://www.abuseat.org/.](http://www.abuseat.org/)\n\n\n**26**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nMany of the host IPs sending Necurs spam have been\ninfected for more than 2 years. To help keep the full scope\nof the botnet hidden, Necurs will send spam only from a\nsubset of infected hosts. An infected host might be used\nfor 2 to 3 days, and then sometimes not again for 2 to\n3 weeks. This behavior complicates the job of security\npersonnel who respond to spam attacks. They may believe\nthey have found and successfully cleaned an infected host,\nbut the actors behind Necurs are just biding their time until\nthey launch another attack.\n\nSeventy-five percent of total spam observed in October\n2016 contained malicious attachments. Most of that spam\nwas sent by the Necurs botnet. (See Figure 17.) Necurs\nsends malicious .zip attachments that include embedded\nexecutable files such as JavaScript, .hta, .wsf, and VBScript\ndownloaders. In calculating the percentage of total spam\ncontaining malicious attachments, we count both the\n“container” file (.zip) and the “child” files within it (such as\na JavaScript file) as individual malicious attachments.\n\n\n###### Figure 17  Percentage of Total Spam Containing  Malicious Attachments\n\n80%\n\n\nPatterns with .wsf files during 2016 (see Figure 17) provide\nan example of how adversaries will evolve malicious\nspam tactics over time. This file type was rarely used as\na malicious attachment before February 2016. Then, the\nuse of this file type begins to grow as the Necurs botnet\nbecomes more active. By July, .wsf files accounted for\n22 percent of all malicious spam attachments. This was\nalso around the time that global spam activity increased\ndramatically (see previous section), an uptick that was due\nlargely to the Necurs botnet.\n\nThrough August, September, and October, we saw\nfluctuations in the percentages of .wsf files. This indicates\nthat adversaries were pulling back at times when the file\ntype was being detected more frequently.\n\n\n**Attackers Experiment with Attachment Types to Keep**\n**Malicious Spam Campaigns Fresh**\n\nOur threat researchers examined how adversaries use\ndifferent types of file attachments to help prevent malicious\nspam from being detected. What we found is that they are\ncontinually evolving their strategies, experimenting with a\nwide range of file types, and quickly switching tactics when\nthey don’t find success.\n\nFigure 17 shows how malicious spam operators\nexperimented with the use of .docm, JavaScript, .wsf, and\n.hta files during the period observed. As noted earlier, many\nof these file types are associated with spam sent by the\nNecurs botnet. (For research related to other file types we\nexamined, see the Appendix on page 78.)\n\n\nContaining Malicious Attachments\n\nContains Malicious .hta\n\n\n60%\n\n40%\n\n\nContains Malicious .js\n\nContains Malicious .zip\n\n\n20%\n\n\nContains Malicious .docm\n\nContains Malicious .wsf\n\n\nThe specific percentages for the different file types\nin a given month are derived using the percentage of\ntotal spam that contained malicious attachments seen\nin that month. So, for example, in July 2016, .docm\nfiles represented 8 percent of the total percentage of\nmalicious attachments observed.\n\n**27**\n\n\n0%\n\nSource: Cisco Security Research\n\n\n**Attacker Behavior**\n\n\n**S H A R E**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**Hailstorms and Snowshoes**\n\n\nTwo types of malicious spam attacks are especially\nproblematic for defenders: hailstorm attacks and snowshoe\nattacks. Both employ the elements of speed and targeting,\nand both are highly effective.\n\nHailstorm attacks target antispam systems. The operators\nbehind these attacks take advantage of the very small\nwindow of time between the moment they launch their\nspam campaign and when antispam systems see it and\npush coverage out to antispam scanners. Adversaries\ntypically have only seconds or minutes to operate before\ntheir campaigns are detected and blocked.\n\nThe spike in Figure 18 is a hailstorm attack. The activity\nis shown in the Cisco Investigate interface. Just before\nthe attack, no one was resolving the IP address. Then,\nsuddenly, the number of computers resolving the domain\nin DNS spiked to more than 78,000 before dropping back\ndown to zero.\n\n\nContrast the hailstorm attack to a snowshoe spam\ncampaign, also shown in Figure 18, where attackers\nattempt to fly under the radar of volume-based detection\nsolutions. The number of DNS lookups is steady, but there\nare only about 25 queries per hour. These low-volume\nattacks allow adversaries to quietly distribute spam from a\nlarge swath of IP addresses.\n\nEven though these spam attacks operate differently, they\ndo have things in common. Through either approach,\nadversaries can:\n\n\n\n- Use well-configured email systems rather than sloppy scripts\nor spam bots\n\n- Properly set up forward-confirmed reverse DNS and Send\nPolicy Framework (SPF) records\n\n\n\n- Evade a bad reputation by sending from clean IPs\nand domains\n\n- Emulate marketing mail with professional content and\nsubscription management\n\n\n###### Figure 18  Comparison of Hailstorm and Snowshoe Spam Attacks\n\n**Hailstorm Spam Attack**\n\n\n78,651 Queries\n\n\n75,000\n\n50,000\n\n\n25,000\n\n0\n\n\n16 18 20 22 24 26 28 30 2 4 6 8 10 12 14\nSep Oct\n\n**Snowshoe Spam Attack**\n\n\n40\n\n20\n\n0\n\n\n35 Queries\n\n16 18 20 22 24 26 28 30 2 4 6 8 10 12 14\nSep Oct\n\n\n**Date**\n\n\nSource: Cisco Investigate\n\n**S H A R E**\n\n\n**28**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nAdversaries can also impair content detection by mutating\ntext and cycling through file types. (For more details on\nhow cybercriminals evolve their threats to evade defenders,\nsee the “Time to Evolve” section on page 34.) For more\ninformation on how they experiment with malicious file\nattachments for spam, see the previous section.\n\n###### Figure 19  Top Threat Outbreak Alerts\n\n\nFigure 19 shows top threat outbreak alerts; this is an overview\nof the spam and phishing messages that we observed\nadversaries frequently updating in 2016 in order to bypass\nemail security checks and rules. It is important to know what\ntypes of email threats are the most prevalent so that you can\navoid being duped by these malicious messages.\n\n\n**Publication** **Publication** **Attachment** **Last Publication**\n**Version** **Identifier** **Name and URL** **Message Summary** **File Type** **Language** **Date**\n\n96 35656 RuleID4626 Invoice, Payment .zip German, English 04/25/16\n\n87 34577 RuleID10277 Purchase Order .zip German, English 06/02/16\n\n82 36916 RuleID4400KVR Purchase Order .zip English 02/01/16\n\nPurchase Order,\n74 38971 RuleID15448 .zip, .gz English 08/08/16\nPayment, Receipt\n\nOrder, Payment,\n72 41513 RuleID18688 .zip English 09/01/16\nSeminar\n\nPurchase Order,\n70 40056 RuleID6396 .rar English 06/07/16\nPayment, Receipt\n\n66 34796 RuleID5118 Product Order, Payment .zip German, English 09/29/16\n\nInvoice, Payment, English, German,\n64 39317 RuleID4626 (cont) .zip 01/28/16\nShipping Spanish\n\nConfirmation, Payment/\n64 36917 RuleID4961KVR .zip English 07/08/16\nTransfer, Order, Shipping\n\nDelivery Notice, Court\n63 37179 RuleID13288 .zip English, Spanish 07/21/16\nAppearance, Ticket Invoice\n\nShipping, Quote,\n61 38095 RuleID858KVR .zip English 08/01/16\nPayment\n\nQuote Request, English, German,\n58 39150 RuleID4961KVR .zip 01/25/16\nProduct Order Multiple Languages\n\nTransfer, Shipping, English, German,\n47 41886 RuleID4961 .zip 02/22/16\nInvoice Spanish\n\nSource: Cisco Security Research\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n**29** **Attacker Behavior**\n\n\n**29**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n##### Reconnaissance Weaponization\n\nOnce the threat is in position, it installs a back door on a target’s system, providing adversaries with\npersistent access.\n\n###### Web Attack Methods: “Long Tail”  Snapshot Reveals Threats That Users  Can Easily Avoid\n\nThe so-called long tail of the web attack methods spectrum\n(Figure 20) includes a collection of lower-volume malware\ntypes that are employed at a later stage in the attack\nchain: installation. In this phase, the threat that has been\ndelivered—a banking Trojan, a virus, a downloader, or some\nother exploit—installs a back door in the target system,\nproviding adversaries with persistent access and the\nopportunity to exfiltrate data, launch ransomware attacks,\nand engage in other mischief.\n\nThe threats listed in Figure 20 are samples of malware\nsignatures found outside the top 50 most commonly\nobserved malware types. The long tail of web attack\nmethods is, essentially, a snapshot of threats that are\nquietly at work on a machine or system after a successful\nattack. Many of these infections were first spawned by an\nencounter with malicious adware or exposure to a wellcrafted phishing scam. These are situations that users can\noften easily avoid or quickly remediate.\n\n**S H A R E**\n\n**30**\n\n\n**Attacker Behavior**\n\n\n###### Figure 20  Sample of Observed Lower-Volume Malware\n\n91 PUA and Suspicious Binaries\n\n36 Heuristic\n\n16 Worm (Allaple)\n\n14 Trojans Downloader (HTML)\n\n10 Trojans Downloader (JS)\n\n9 Trojans (Agent)\n\n7 Trojans Downloader (VBS)\n\n\n7\n\n5\n5\n3\n2\n2\n2\n2\n2\n2\n1\n1\n1\n1\n1\n1\n1\n1\n1\n1\n1\n1\n1\n1\n\n\nBackdoor (Java)\n\nTrojans (Locky)\nHeuristic (CVE-2013-0422)\nVirus (Replog)\nTrojans (Win32)\nVirus (Fas)\nTrojans Downloader Malware (Small)\nTrojans (Cryptodef)\nBackdoor (Farfli)\nBackdoor (Gbot)\nLinux (Veribak)\nBrowser Redirection Trojans (JSRedir)\nTrojans Downloader (Upatre)\nTrojans Downloader (Win32)\nBackdoor (NuPrader)\nTrojans (Shifu)\nTrojans (Zbot)\nTrojans (Yakes)\nTrojans (Scar)\nTrojans (Reconyc)\nTrojans (Crypt)\nTrojans (Crypmod)\nTrojans (Bitman)\nTrojans (Deshacop)\n\n\nSource: Cisco Security Research\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Vertical Risk of Malware Encounters: Attackers See Value Across the Board\n\n\n[In the Cisco 2016 Midyear Cybersecurity Report, a key](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)\nmessage about the risk of malware was that “no vertical is\nsafe.” Judging from our researchers’ periodic examination\nof attack traffic (“block rates”) and “normal” or expected\ntraffic by industry, this message held true in the latter half\nof the year.\n\n###### Figure 21  Percentage of Monthly Vertical Block Rates\n\n\nIn looking at verticals and their block rates over time\n(Figure 21), we see that, at some point over the course of\nseveral months, every industry has been subject to attack\ntraffic and at varying levels. It’s clear that as attacks rise\nand fall, they affect different verticals at different times—\nbut none are spared.\n\n\n40%\n\n20%\n\n0%\n\n\n40%\n\n20%\n\n0%\n\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n\n**Media and Publishing**\n\n**Retail and Wholesale**\n\n\n40%\n\n20%\n\n0%\n\n\n**Accounting** **Agriculture and Mining** **Automotive** **Aviation**\n\n\n**Banking and Finance**\n\n**Energy, Oil, and Gas**\n\n**Government**\n\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n\n**Engineering and Construction**\n\n40%\n\n20%\n\n0%\n\n**Healthcare**\n\n40%\n\n20%\n\n0%\n\n\n**Charities and NGOs**\n\n\n40%\n\n20%\n\n0%\n\n**Electronics**\n\n40%\n\n20%\n\n0%\n\n**Food and Beverage**\n\n40%\n\n20%\n\n0%\n\n**Industrial**\n\n40%\n\n20%\n\n0%\n\n**Manufacturing**\n\n40%\n\n20%\n\n0%\n\n**Real Estate and Land Mgmt.**\n\n40%\n\n20%\n\n0%\n\n**Utilities**\n\n**Attacker Behavior**\n\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n\n**Education**\n\n**Entertainment**\n\n**Heating, Plumbing, and A/C**\n\n\n**Insurance** **IT and Telecommunications** **Legal**\n\n\n40%\n\n20%\n\n0%\n\n40%\n\n20%\n\n0%\n\n\n40%\n\n20%\n\n0%\n\n**Pharmaceutical and Chemical**\n\n40%\n\n20%\n\n0%\n\n\n**Transportation and Shipping** **Travel and Leisure**\n\n\n**Professional Services**\n\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n**31**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**Regional Overview of Web Block Activity**\n\nAdversaries frequently shift their base of operation,\nsearching for weak infrastructure from which they can\nlaunch their campaigns. By examining overall Internet traffic\nvolume and block activity, Cisco threat researchers can offer\ninsight on where malware is originating.\n\nAs Figure 22 shows, traffic from the United States\n[edged up slightly from the block rates seen in the Cisco](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)\n_[2016 Midyear Cybersecurity Report. The United States](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)_\n\n###### Figure 22  Web Blocks by Country\n\n**Expected Ratio: 1.0**\n\nFrance 0.87\n\nCanada 2.11\n\nUnited States 1.20 Italy 1.22\n\nBelize 1.54\n\nPanama 1.46 1.15 Venezuela\n\nPeru 1.43\n\nChile 0.83\n\nRomania\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n**32**\n\n\nhouses the far greater share of blocks, but this should be\nconsidered a function of the country’s far greater share of\nonline traffic. In addition, the United States is one of the\nworld’s largest targets of malware attacks.\n\nThe takeaway for security professionals: Much like the\nvertical web block activity, the regional web block activity\nshows that malware traffic is a global problem.\n\n\n[edged up slightly from the block rates seen in the Cisco](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html) shows that malware traffic is a global problem.\n_[2016 Midyear Cybersecurity Report. The United States](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)_\n\n###### Figure 22  Web Blocks by Country\n\n**Expected Ratio: 1.0**\n\n3.88 Germany\n\n0.94 Russia\n\nFrance 0.87\n\nCanada 2.11\n\n1.47 Ukraine\n\nUnited States 1.20 Italy 1.22\n\n1.31 China\n\nBelize 1.54\n\n1.07 Vietnam\n\nPanama 1.46 1.15 Venezuela\n\n2.84 Indonesia\n\nPeru 1.43\n\n1.60 Australia\n\n1.00 Turkey\n\nChile 0.83\n\nMalaysia 3.52\n\nRomania 2.77\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Time to Detection: An Essential Metric for Measuring Defenders’ Progress\n\n\nCisco is continually refining our approach to measuring\nTTD so that we can ensure we are tracking and reporting\nthe most accurate estimate of our median TTD. Recent\nadjustments to our approach have increased our visibility into\nfiles that were categorized as “unknown” when first seen\nand then later identified as “known bad” after continuous\nanalysis and global observation. With a more holistic view\nof data, we are better able to pinpoint when a threat first\nemerged and exactly how long it took for security teams to\ndetermine that it was a threat.\n\nThis new insight helped us to determine that our median TTD\nwas 39 hours in November 2015. (See Figure 23.) By January\n2016, we had reduced the median TTD to 6.9 hours. After\ncollecting and analyzing data for October 2016, our threat\nresearchers determined that Cisco products had achieved a\nmedian TTD of 14 hours for the period from November 2015\nto October 2016. (Note: The median TTD figure for 2016 is\nthe average of the medians for the period observed.)\n\nThe median TTD fluctuated throughout 2016 but trended\ndownward overall. Increases in the median TTD indicate\ntimes when adversaries launched a wave of new threats.\nThe subsequent decreases reflect periods where\ndefenders gained the upper hand and could identify\nknown threats quickly.\n\n\nReviewing retrospective data is important not only for\ndetermining a more accurate measure of our median\nTTD, but also for studying how threats evolve over time.\nNumerous threats in the landscape are particularly evasive\nand can take a long time to identify even though they are\nknown to the security community.\n\nAdversaries will evolve certain malware families to avoid\ndetection and increase their time to operate. This tactic\nhinders defenders’ progress in gaining, and then maintaining,\nan edge in detecting many types of known threats. (For more\non this topic, see “Time to Evolve: For Some Threats, Change\nIs Constant,” page 34). However, the fact that cybercriminals\nare evolving their threats frequently and rapidly indicates that\nthey are facing intense and constant pressure to find ways to\nkeep their threats operating and profitable.\n\n\n15.19\n\n\n###### Figure 23  Median TTD by Month\n\n\n40\n\n30\n\n\n39.16\n\n\n18.22\n\n\nFigure 23 also shows that the median TTD was about 15\nhours by the end of April 2016, which is greater than the\n13-hour figure we reported in the Cisco 2016 Midyear\n_Cybersecurity Report.¹⁴ That 15-hour figure is based on data_\ncollected from November 2015 through April 2016. It was\nnot derived using our modified approach to analyzing more\ndetailed retrospective information about files. Using the new\nmidyear TTD figure, we can report that TTD declined to about\n9 hours for the period from May through October 2016.\n\n\n20\n\n10\n\n\n8.11\n\n\n8.58\n\n\n6.89\n\n\n8.48\n\n\n0\n\n\nSource: Cisco Security Research\n\n_Cisco defines “time to detection,” or TTD, as the window of time between a compromise and the detection of_\n_a threat. We determine this time window using opt-in security telemetry gathered from Cisco security products_\n_deployed around the globe. Using our global visibility and a continuous analytics model, we are able to measure_\n_from the moment malicious code runs on an endpoint to the time it is determined to be a threat for all malicious_\n_code that was unclassified at the time of encounter._\n\n[¹⁴ Cisco 2016 Midyear Cybersecurity Report: http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html.](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)\n\n\n6.48 6.05\n\n**Attacker Behavior**\n\n\n**33**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Time to Evolve: For Some Threats, Change Is Constant\n\n\nCybercriminals use various obfuscation techniques to\nkeep their malware strong and profitable. Two common\nmethods they employ are evolving their payload delivery\ntypes and quickly generating new files (defeating hash-only\ndetection methods). Our researchers closely examined\nhow adversaries have used these two strategies to help six\nwell-known malware families—Locky, Cerber, Nemucod,\nAdwind RAT, Kryptik, and Dridex—evade detection and\ncontinue compromising users and systems.\n\nThrough our analysis, we sought to measure the “time to\nevolve” (TTE): the time it takes adversaries to change the\nway specific malware is delivered and the length of time\nbetween each change in tactics. We analyzed web attack\ndata from different Cisco sources—specifically, web proxy\ndata, cloud and endpoint advanced malware products, and\ncomposite antimalware engines.\n\nOur researchers looked for changes in file extensions\ndelivering the malware and the file content (or MIME)\ntype as defined by a user’s system. We determined that\neach malware family has a unique pattern of evolution.\nFor each family, we examined the patterns in both web\nand email delivery methods. We also tracked the ages of\nunique hashes associated with each malware family to\ndetermine how quickly adversaries are creating new files\n(and thus, new hashes).\n\n\nThrough our research, we learned that:\n\n - Ransomware families appear to have a similar rotation of new\nbinaries. However, Locky uses more file extension and MIME\ncombinations to deliver its payload.\n\n - Some malware families employ only a handful of file delivery\nmethods. Others use 10 or more. Adversaries tend to use\neffective binaries over long periods. In other cases, files pop\nup and then drop off quickly, indicating that the malware\nauthors are under pressure to switch tactics.\n\n - The Adwind RAT and Kryptik malware families have a higher\n\nmedian TTD. (For more on TTD, see page 33.) We also see\na greater mix of file ages for these families. This suggests\n\nthat adversaries reuse effective binaries that they know are\ndifficult to detect.\n\n - Looking at the file ages for the Dridex malware family, it\nappears that the shadow economy may be abandoning use\nof this once-popular banking Trojan. In late 2016, detection\nvolume for Dridex declined, as did the development of new\nbinaries to deliver this malware. This trend suggests that\nthe malware’s authors no longer see value in evolving this\nthreat—or that they have found a new way to package the\nmalware that has made it harder to detect.\n\n**Attacker Behavior**\n\n\n**34**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n\n**TTE and TTD**\n\nThe six malware families we analyzed in our TTE study are\nlisted in Figure 24. The chart depicts the median TTD for\nthe top 20 malware families (by detection count) that our\nresearchers observed from November 2015 to November\n2016. Our average median TTD for that period was about 14\nhours. (For details on how we calculate TTD, see page 33.)\n\n\nOld and pervasive threats that adversaries don’t bother to\nevolve much, or at all, are also typically detected below the\nmedian TTD. Examples include malware families like Bayrob\n(botnet malware), Mydoom (a computer worm that affects\nMicrosoft Windows), and Dridex (the banking Trojan).\n\nIn the following sections, we present research highlights\non TTE and TTD for the Locky, Nemucod, Adwind RAT, and\nKryptik malware families. Detailed findings for Cerber and\nDridex are included in the Appendix on page 78.\n\n\nMany of the malware families that Cisco products are\ndetecting within the median TTD are industrialized threats\nthat spread quickly and are therefore more prevalent.\nCerber and Locky, which are both types of ransomware,\nare examples.\n\n\n###### Figure 24  TTD Medians of Top Malware Families (Top 20 Families by Detection Count)\n\n35\n\n\n30\n\n25\n\n\n20\n\n15\n\n\n10\n\n5\n\n\n0mydoom hancitorcerber adnel mamianune zbot adwind zusy razy upatre\n\n0 5 10 15 20 25 30 35 40 45 50\n\n|Col1|Col2|Col3|n|emucod|Col6|Col7|Col8|Col9|Col10|Col11|\n|---|---|---|---|---|---|---|---|---|---|---|\n||bayrob||||||||||\n||||||||||||\n||||||||||||\n||||||||||||\n||docdl locky drid|ex|||||||||\n|insi ydoom ce|ght don rber|off fareit mamianune|||mabezat a zbot|dwind zusy|razy|kryptik||upatre|\n|hancitor adnel 0 5 10|||15 20 25 30 35 40 45 5||||||||\n\n\nCisco Average TTD\n\n\n**Median TTD Hours**\n\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n\n**35**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**TTE Analysis: Locky**\n\n\nThrough our TTE research, we learned that Locky and\nCerber employ a limited number of file extension and MIME\ncombinations to deliver malware through the web or by\nemail. (See Figure 25.) We observed several combinations\nthat included file content types related to Microsoft Word\n(msdownload, ms-word). However, the associated file\nextensions (.exe and .cgi) did not point back to a Word\nfile. We also identified content types that pointed to\nmalicious .zip files.\n\nBoth Locky and Cerber also appear to use new binaries\nfrequently as an attempt to evade file-based detection. File\nages for the Locky malware family are shown in Figure 26.\n\n###### Figure 25  File Extension and MIME Combinations for the Family of Threats and Indicators That Lead to and Include the Locky Payload (Web and Email Vectors)\n\n\nThe top half of the chart depicts the ages of files that were\nobserved during a specific month. The bottom portion of\nthe chart shows monthly changes in the volume of Lockyrelated hashes, both new and previously observed files.\n\nIn Figure 26, also note the decline in volume in June as well\nas the distribution of file ages. The Necurs botnet, which\nwas known to deliver Locky, was taken down in June. This\nlikely sidelined the malware authors’ efforts to keep the\nmalware fresh during that month. However, it’s clear that\nthey recovered quickly. By July, the malware had returned\nto its more standard mix of file ages with the majority (74\npercent) being less than a day old when first detected.\n\n###### Figure 26  Hash Ages for the Locky Malware  Family and Percent of Total Hash Volume Observed Per Month\n\n\n**Unique Vectors**\n\ndoc & application/msword\n\nexe & application/msdownload\n\nno extension & text/plain\n\nexe & application/msdos-prog...\n\nxls & application/vnd.ms-excel\njs & text/plain\n\nzip & application/zip\n\ndoc & text/plain\n\n\n100%\n\n75%\n\n\n50%\n\n25%\n\n\nno extension & application/zip\n\naspx & application/zip\n\njsp & application/zip\n\nlib & text/plain\n\nno extension & application/dosexec\n\nrar & application/x-rar\n\njs & text/html\n\nphp & application/zip\n\nrtf & application/msword\n\ndocm & application/vnd.open...\n\nno extension & application/vnd...\n\nno extension & application/ms-wo...\n\ncgi & application/ms-word.doc...\n\nwsf & text/html\n\ndoc & application/vnd.open...\n\nwsf & application/xml\n\nno extension & application/vnd...\n\njs & text/javascript\n\nxls & application/vnd.openxml...\n\nvbs & text/plain\n\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\n10%\n\n5%\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\nEmail Web\n\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n\n**36**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nThe rapid cycling of binaries for this ransomware is not\nsurprising. Instances of Locky and Cerber are often\ndetected either on the same day they are introduced or\nwithin 1 to 2 days after, making it imperative for adversaries\nto evolve these threats continually if they want them to\nremain active and effective. (Figure 24, discussed earlier,\nshows that Cisco products detected both Locky and Cerber\nransomware within the median TTD in 2016.)\n\n\n120\n\n100\n\n80\n\n60\n\n40\n\n20\n\n\n###### Figure 27  TTD for the Locky Malware Family\n\n\n116.1\n\n\nFigure 27 shows the median TTD for Locky ransomware,\nwhich declined dramatically from about 116 hours in\nNovember 2015 to just under 5 hours in October 2016.\n\n**37**\n\n\n**Attacker Behavior**\n\n\n0\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**TTE Analysis: Nemucod**\n\n\nIn 2016, Nemucod was the most frequently detected\nmalware among the top 20 families shown in Figure 24.\nAdversaries use this downloader malware to distribute\nransomware and other threats, such as backdoor Trojans that\nfacilitate click fraud. Some variants of Nemucod also serve as\nengines for delivering the Nemucod malware payload.\n\n###### Figure 28  File Extension and MIME Combinations for Nemucod (Web and Email Vectors)\n\n\nOne reason Nemucod malware was so prevalent in 2016,\naccording to our threat researchers, is that its authors\nfrequently evolved this threat. Cisco identified more than 15\nfile extension and MIME combinations associated with the\nNemucod family that were used to deliver malware through\nthe web. Many more combinations were used to deliver the\nthreat to users through email (Figure 28).\n\nSeveral file extension and MIME combinations (web and\nemail) were designed to point users to malicious .zip files\nor archives. Adversaries also reused many combinations\nduring the months we observed.\n\n\n**Unique Vectors**\n\njs & application/javascript\n\nhtml & text/html\n\n\nzip & application/zip\n\nno extension & application/zip\n\n\nzip & application/x-zip-comp...\n\nhtml & application/zip\nphp & application/zip\n\nzip & text/plain\njs & text/plain\n\njs & text/x-pascal\n\njs & text/javascript\n\ndat & application/vnd.ms-tnef\nrar & application/x-rar\n\naspxx & application/zip\n\nxls & application/zip\n\naspx & application/zip\ncgi & application/zip\n\nwsf & text/html\n\nno extension & application/archive\n\nhtml & application/archive\ncgi & application/archive\n\njs & text/x-makefile\njs & text/x-c\n\njsp & application/zip\nno extension & text/html\n\njse & text/plain\n\nzip & application/archive\n\nlib & text/plain\n\nlib & text/x-makefile\nlib & text/x-c\n\nlib & text/x-pascal\n\ngif & application/zip\n\njpg & application/zip\n\npdf & application/zip\n\ndocx & application/zip\ntiff & application/zip\n\nzip & application/x-rar\nwrn & text/plain\nwrn & text/x-c\n\nwrn & text/x-pascal\nvbs & text/plain\njs & text/html\n\ntgz & application/x-gzip\nwsf & application/xml\n\ndocx & application/vnd.open...\ndoc & application/zip\nrar & application/zip\n\nphp & application/javascript\n\nzip & application/x-gzip\n\ncab & application/vnd.ms-cab...\nhta & text/html\n\nasp & application/zip\n\ncgi & audio/wav\nhta & application/zip\n\nSource: Cisco Security Research\n\n\nAs Figure 29 shows, many Nemucod hashes are less\nthan 2 days old when they are detected. In September\nand October 2016, almost every binary related to the\nNemucod family that was blocked was less than a day old.\n\n###### Figure 29  Hash Ages for the Nemucod Malware Family and Percent of Total Hash Volume Observed Per Month\n\n\n100%\n\n75%\n\n\n50%\n\n25%\n\n\n0%\n\n50%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\n25%\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n###### Figure 30  TTD for the Nemucod Malware Family\n\n85.0\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n46.3\n\n\n21.8\n13.9\n7.3\n\n\nEmail Web\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n**38**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**TTE Analysis: Adwind RAT**\n\n\nCisco threat researchers found that Adwind RAT (remote\naccess Trojan) malware is delivered through file extension\nand MIME combinations that include .zip or .jar files. This\nis true whether the malware is being delivered through the\nemail or web attack vector. (See Figure 31.)\n\nAdwind RAT used a wide range of hash ages throughout\nmost of the period observed in 2016, except during\nSeptember and October, when most files seen were\n1 to 2 days old (Figure 32).\n\n\n###### Figure 31  File Extension and MIME Combinations for Adwind RAT (Web and Email Vectors)\n\n**Unique Vectors**\n\n\nWe also found that the median TTD for Adwind RAT\nis consistently higher than the median TTD for other\nmalware families we analyzed (Figure 33). The malware’s\nauthors have apparently developed hard-to-detect\ndelivery mechanisms that keep Adwind RAT successful.\nTherefore, they don’t need to rotate through new hashes\nas frequently or as rapidly as the actors behind other\nmalware families do. The Adwind Trojan is also known by\nother names, such as JSocket and AlienSpy.\n\n###### Figure 32  Hash Ages for the Adwind RAT  Malware Family and Percent of Total Hash Volume  Observed Per Month\n\n\n100%\n\n75%\n\n\njar & application/java-archive\n\njar & application/zip\n\njar & application/archive\n\n\nzip & application/zip\n\nno extension & application/archive\n\nno extension & application/zip\n\nclass & application/x-java-applet\n\n\n50%\n\n25%\n\n\nEmail Web\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\nSource: Cisco Security Research\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n\n0%\n\n1.5%\n1%\n\n0.5%\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n###### Figure 33  TTD for the Adwind RAT Malware Family\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n70.7\n\n\n30.0\n25.3\n16.2\n\n\n13.0\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n**39**\n\n\n**Attacker Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**TTE Analysis: Kryptik**\n\n\nKryptik, like Adwind RAT malware, had a median TTD that\nwas consistently higher (about 20 hours) than other malware\nfamilies Cisco analyzed for the TTE study from November\n2015 through October 2016 (Figure 36). However, by\nOctober, Cisco products had reduced the median TTD\nwindow for Kryptik malware to less than 9 hours (Figure 36).\n\nThe Kryptik malware family also used a wider range of\nhash ages than the other malware families we analyzed,\nparticularly during the first half of 2016. The ability of\nKryptik’s authors to rely on older hashes for so long indicates\nthat defenders had trouble detecting this malware type.\n\nDuring the period that we observed, Kryptik’s authors\nemployed a wide range of payload delivery methods through\nthe web attack vector. The authors used JavaScript files\nand archive files such as .zip files in file extension and MIME\ncombinations for both web and email. (See Figure 34.)\nSome of the combinations date back to 2011.\n\n###### Figure 34  File Extension and MIME Combinations for Kryptik (Web and Email Vectors)\n\n\nIn our analysis of the six malware families, we find that\nadversaries must shift tactics frequently to take advantage\nof the small window of time during which their threats\ncan operate successfully. These adjustments indicate that\ndefenders are getting better at detecting known malware\nquickly, even after a threat has evolved. Attackers are under\npressure to find new ways to avoid detection and keep their\ncampaigns profitable.\n\nIn this complex landscape of rapid evolution, where all\nmalware families behave differently, human expertise and\npoint solutions are not enough to identify and respond\nquickly to threats. An integrated security architecture\nthat provides real-time insight into threats, along with\nautomated detection and defense, is essential for improving\nTTD and ensuring swift remediation when infections occur.\n\n###### Figure 35  Hash Ages for the Kryptik Malware Family and Percent of Total Hash Volume Observed Per Month\n\n\n50%\n\n25%\n\n\n100%\n\n75%\n\n\n**Unique Vectors**\n\n\n0%\n\n2%\n\n1%\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\njs & application/javascript\n\ngif & image/gif\n\njpg & image/jpeg\nhtml & text/html\n\njs & text/javascript\n\nno extension & text/html\nhtm & text/html\nphp & text/html\n\nico & text/html\npng & image/png\n\nzip & application/x-zip-comp...\n\nzip & application/zip\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\nexe & application/msdownload\n\ndoc & application/msword\nno extension & application/exe\n\nno extension & application/zip\n\njs & text/plain\nrar & application/x-rar\n\nscr & application/x-dosexec\n\nexe & application/x-dosexec\n\njar & application/zip\n\ngif & text/html\n\nno extension & application/archive\n\nvbs & text/plain\n\nasp & text/html\n\nno extension & application/java...\nphp & application/exe\n\ntbz2 & application/x-rar\n\nSource: Cisco Security Research\n\n\n###### Figure 36  TTD for Kryptik Malware Family\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n63.7\n\n\n22.4\n\n\n55.1\n\n\n34.4\n\n\n8.7\n\n\nEmail Web\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n**40**\n\n\n**Attacker Behavior**\n\n\n-----\n\n# Defender Behavior\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Defender Behavior\n\n\n###### Vulnerabilities on the Decline in 2016\n\nIn the second half of 2016, vendor-disclosed vulnerabilities\ndropped significantly from 2015, according to our research\n[(Figure 37). The National Vulnerability Database shows](https://nvd.nist.gov/)\na similar decline. The reasons for the drop in disclosed\nvulnerability advisories are not entirely clear.\n\n\nIt should be noted that 2015 was an unusually active year\nfor vulnerabilities, so the 2016 numbers may reflect a\nnormal pace of vulnerability advisories. From January to\nOctober 2015, total alerts reached 7602. During the same\ntime period in 2016, total alerts reached 6380; during this\nperiod in 2014, total alerts were 6272.\n\nThe high number of vulnerability reports in 2015 may\nindicate that vendors were looking more closely at existing\nproducts and code, more carefully implementing secure\ndevelopment lifecycle (SDL) practices, and identifying\nvulnerabilities and subsequently fixing them. The decline in\nreported vulnerabilities may indicate that these efforts are\n\n\npaying off. That is, vendors are now focusing on identifying\nvulnerabilities and correcting them before products reach\nthe market.\n\nIn 2016, Apple was the vendor showing the most dramatic\ndecline in vulnerabilities: The company reported 705\nvulnerabilities in 2015, and 324 vulnerabilities in 2016 (a 54\npercent decline). Similarly, Cisco reported 488 vulnerabilities\nin 2015, and 310 in 2016 (a 36 percent decline).\n\nA concern among security researchers is that “vulnerability\nfatigue” may be setting in among security professionals.\nIn recent months, there has not been a major vulnerability\nannouncement that sent shock waves through the industry,\nas Heartbleed did in 2014. In fact, the hype around\n“named” vulnerabilities such as Heartbleed and the\nincrease in 2015 likely contributed to the level of fatigue—\nor, at least, to less interest in reporting vulnerabilities.\n\n\n###### Figure 37  Cumulative Annual Alert Totals\n\n9K\n\n\n8K\n\n7K\n\n\n6K\n\n5K\n\n\n4K\n\n3K\n\n\n2K\n\n1K\n\n\n0\nJan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec\n\n2013 2014 2015 2016\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|Col12|Col13|Col14|Col15|Col16|Col17|Col18|Col19|Col20|Col21|Col22|Col23|Col24|Col25|Col26|Col27|Col28|Col29|Col30|Col31|Col32|Col33|Col34|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n|||||||||||||||||||||||||||||||||||\n|5976|||||||||||||||||||||||||||6380|||||||\n|4969|||||||||||||||||||||5483|||||||||||||\n|4407 3811||||||||||||||||||||||||||||||||||\n|2992||||||||||||||||||||||||||||||||||\n|2193||||||||||||||||||||||||||||||||||\n|1327||||||||||||||||||||||||||||||||||\n|634||||||||||||||||||||||||||||||||||\n\n\nSource: Cisco Security Research\n\n**42** **Defender Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 38  Critical Vulnerability Advisories by Vendor and Type\n\nMicrosoft Adobe Cisco TPS ICS VMware Apple Apache Oracle HP\n###### 174 162 28 25 10 8 5 3 3 3\n\nSource: National Vulnerability Database (NVD)\n\nCisco is now using severity/impact ratings (SIRs), in which the rating levels are “critical,” “high,” “medium,” and “low.” The ratings reflect a simplified\nprioritization of scores from the Common Vulnerability Scoring System (CVSS). In addition, Cisco has adopted CVSS v3.0, the successor to CVSS v2.0.\nBecause of this change, some vulnerabilities may have higher scores than before, so security professionals may see a small increase in vulnerabilities that\nare rated “critical” and “high,” instead of “medium” and “low.” For more information about this scoring change, read the Cisco Security blog post,\n[The Evolution of Scoring Security Vulnerabilities: The Sequel.](https://blogs.cisco.com/security/cvssv3-study)\n\n\nIn the Cisco 2017 Security Capabilities Benchmark Study\n(page 49), security professionals indicated a slight decrease\nin their agreement about security operationalization. This\ndecrease may be connected to “fatigue” about the need to\ncontinually implement upgrades and patches. For example,\nin 2016, 53 percent of security professionals said they\nstrongly agreed that they review and improve security\npractices regularly, formally, and strategically; in 2014 and\n2015, 56 percent strongly agreed.\n\nOf course, a decline in vulnerabilities should not lead to\noverconfidence about the threat landscape: No one should\nadopt the mindset that attention to threats can lapse, even\nin the absence of high-profile vulnerabilities.\n\nAs we’ve advised in past reports, security professionals\nshould make a concerted effort to prioritize patches. If a\nlack of staffing and other resources prevents the timely\ninstallation of all available patches, evaluate which ones are\nmost critical to network safety, and place those at the top\nof the to-do list.\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n\n###### Figure 39  Selected Critical Vulnerability Advisories\n\n**Advisory Title** **Date Issued**\n\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption code execution vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption remote code execution vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption vulnerability\n\nAdobe Acrobat and Acrobat Reader integer\noverflow vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption remote code execution vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption vulnerability\n\nAdobe Acrobat and Acrobat Reader memory\ncorruption vulnerability\n\nSource: Cisco Security Research\n\n\nJul 28, 2016\n\nJul 28, 2016\n\nJul 21, 2016\n\nMay 23, 2016\n\nFeb 08, 2016\n\nJul 28, 2016\n\nJul 18, 2016\n\nJun 23, 2016\n\nMay 24, 2016\n\nMay 23, 2016\n\n\nThe advisories listed above are selected 2016 critical-rated vulnerabilities\nthat were reported by multiple sources to have exploit code publicly\navailable or to be actively exploited in the wild.\n\n**43** **Defender Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**Server and Client Vulnerabilities**\n\n[As discussed in the Cisco 2016 Midyear Cybersecurity](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)\n_[Report, adversaries are finding space and time to](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)_\noperate within server-side solutions. By launching\nattacks within server software, they can potentially gain\ncontrol of more network resources, or move laterally\namong other critical solutions.\n\nCisco researchers have tracked client and server\nvulnerabilities by vendor (Figure 40).\n\n###### Figure 40  Client-Server Vulnerabilities Breakdown, 2015—2016\n\n\nServer\nVulnerabilities\n(From 2332 to 3142)\n\n\nClient\nVulnerabilities\n(From 2300 to 2106)\n\n\nNetwork\nVulnerabilities\n(From 501 to 396)\n\n\n###### 34%  8%  20%\n\nSource: National Vulnerability Database\n\n###### Figure 41  Vulnerabilities Found in Middleware Libraries\n\n\n###### Middleware: Adversaries See Opportunity  in Unpatched Software\n\n[In the Cisco 2016 Midyear Cybersecurity Report, we](http://www.cisco.com/c/m/en_us/offers/sc04/2016-midyear-cybersecurity-report/index.html)\nshared data about attacks against server-side systems.\nIn 2017, middleware, which connects platforms or\napplications, is poised to attract attackers seeking\nplaces to operate where defenders are slow to react\nor recognize a threat.\n\nCisco researchers, while looking for vulnerabilities in\nthird-party software, discovered an average of 14 new\nvulnerabilities in software per month. Most of those\nvulnerabilities (62) were attributable to the use of middleware.\nOf those 62 vulnerabilities, 20 were found within code that\nhandles PDFs; 12 were found in code that handles images;\n10 were found in code for common office productivity\nsolutions; nine were found in code for compression; and\n11 were found in other libraries (Figure 41).\n\nVulnerabilities in middleware pose a unique security threat\nbecause their libraries are not usually updated as rapidly\nas software that is more client-facing—that is, software that\nusers interact with directly on a day-to-day basis, such as\nproductivity solutions. Middleware libraries may be left out\nof software audits, so vulnerabilities remain in place.\n\n\nPDF\n\n###### 20\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n\nImage\n\n###### 12\n\n\nOffice\n\n###### 10\n\n\nCompression\n\n###### 9\n\n\nOther\n\n###### 11\n\n\n**44** **Defender Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nOrganizations may gamble on middleware being safe\nand may place greater attention on updating high-profile\nsolutions. But they can lose the bet that adversaries\nwon’t seek entry to networks through these low-profile\npathways. Middleware thus becomes a security blind spot\nfor defenders and an opportunity for attackers.\n\nThe challenge of updating middleware libraries closely relates\n[to the open-source software problem (discussed in the Cisco](http://www.cisco.com/web/offers/lp/2015-midyear-security-report/index.html)\n_[2015 Midyear Security Report), since many middleware](http://www.cisco.com/web/offers/lp/2015-midyear-security-report/index.html)_\nsolutions come from open-source developers. (However, the\nproblem at hand can affect both open-source and proprietary\nmiddleware developers.) Therefore, middleware libraries may\nrely on many developers to keep them updated. On the list of\ntasks that an overtaxed IT or security team needs to manage,\nmiddleware library updates may not be a top priority, but they\nshould be given greater attention.\n\nWhat is the potential impact of a middleware vulnerability\nthat is exploited by adversaries? Given the connections\nbetween middleware and other crucial systems, such as\nemail or messaging, an attacker could move laterally into\nthese systems and send phishing messages or spam. Or\nattackers could masquerade as authorized users and abuse\ntrust relationships between users to gain further access.\n\nTo avoid becoming the victim of an attack launched through\na middleware vulnerability, you should:\n\n - Actively maintain a list of known dependencies and libraries\nin the applications you use\n\n - Actively monitor the security of these applications, and\nmitigate risks as much as possible\n\n - Insert a service-level agreement in contracts with software\nvendors for providing patches in a timely manner\n\n - Routinely audit and review software dependencies and\nlibrary use\n\n - Ask software vendors for details on how they maintain and\ntest their products\n\nIn short: Delays in patching increase the operational space\nfor attackers and allow them more time to gain control of\ncritical systems. In the next section, we discuss this impact\nand trends in the patching of common productivity solutions\nsuch as web browsers.\n\n\n###### Time to Patch: Closing the Recovery  Time Frame\n\nMany users do not download and install patches in a\ntimely manner. Adversaries can use these unpatched\nvulnerabilities to gain entry to networks. In our latest\nresearch, we find that the key to encouraging users to\ndownload and install patches may rest in the cadence of\nsoftware updates from vendors.\n\nA security patch release is a clear indication to attackers\nthat there is a vulnerability worth exploiting. Although\nsophisticated attackers have likely been exploiting the\nvulnerabilities for some time, the notification of a patch tells\nmany others that it’s open season on the earlier versions.\n\nWhen software vendors release new versions on a regular\nschedule, users become conditioned to downloading\nand installing updates. Conversely, when vendor upgrade\nreleases are erratic, users are less likely to install them.\nThey will continue to operate outdated solutions that may\ncontain exploitable vulnerabilities.\n\nOther behaviors that affect the upgrade cycle include:\n\n - How disruptive the reminder experience is\n\n - How easy it is to opt out\n\n - How often the software is used\n\nThere are varying windows of time in which users are likely\nto install an upgrade when it is released by the vendor. Our\nresearchers looked at the installations of software on the\nendpoints used by our customers. Their software fell into\nthree categories:\n\n - **New versions: The endpoint ran the newest available version**\nof the software\n\n - **Recent versions: The endpoint ran one of the previous three**\nversions of the software, but not the newest\n\n - **Old versions: The endpoint ran software that was more than**\nthree versions behind the current release\n\nAs an example, if a software vendor released version 28\non January 1, 2017, version 28 would be new; version 26\nwould be recent; and version 23 would be old. (The figures\non the next page contain callouts of the weekly time periods\nwhere one or more versions of the software were released.)\n\n\n**45** **Defender Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nIn examining users of Adobe Flash (Figure 42), we found\nthat, within the first week of an update release, nearly\n80 percent of users install the software’s latest version.\nIn other words, it takes only about one week for the user\npopulation to get up to speed with the latest version. This\none-week “recovery” period represents hackers’ window\nof opportunity.\n\nIn looking at late Q4 2015 in the Adobe Flash graphic, we\nsee a sharp drop in the number of users on the newest\nversion of the solution. In the time period we examined,\nAdobe released five versions of Flash in quick succession,\nrepresenting a mix of functionality additions, bug fixes, and\nsecurity updates. Such a flurry of updates may confuse\nusers. They may question whether they need to download\nso many updates; they can become fatigued by the number\nof upgrade notifications; and they may think they’ve\nalready downloaded a crucial update and can ignore new\nnotifications. No matter what drives their lack of interest in\ninstalling an update, it’s bad news for defenders.\n\n\nIn examining upgrades for the Google Chrome web\nbrowser, we see a different pattern. It reflects a regular\ncadence of upgrades, as well as a strong opt-out policy that\nmakes it difficult for users to ignore update notifications. As\nseen in Figure 42, endpoints running the newest version\nstay relatively steady over the course of many weeks.\n\nThe Chrome data shows that users recover relatively\nquickly. In the case of regular updates, one week is roughly\nthe recovery timeline. In one span of 9 weeks running\nthrough Q2 and Q3 of 2016, however, there were seven\nupdates. During this time the population recovered, but\nupgrade fatigue began to set in. The percentage of users\nstaying with an older version steadily climbs despite the\nmajority of the population recovering.\n\nMozilla’s Firefox browser also offers updates on a regular\nschedule, but the recovery period after an update is released\nappears to take as long as a month. That is, users do not\ndownload and install updates as frequently as Chrome\nusers do. One reason may be that some users might not\nuse the browser regularly and therefore aren’t seeing and\ndownloading updates. (See Figure 43 on next page.)\n\n\n###### Figure 42  Time to Patch for Adobe Flash and Google Chrome\n\n**Adobe**\n**Flash**\n\n\nOutdated\nVersions:\n\nWeek:\n\n**Google**\n**Chrome**\n\nOutdated\nVersions:\n\nWeek:\n\n\n0 5 10 15 20 25 30 35 40 45 50 55\n\nMay 2015\n\nUpdate Released Low High\nAdoption of Latest Update\n\n\n63%\n\n\n69%\n\n\n83% 67% 99% 94% 88%\n\n67% 70% 68% 76% 77% 94% 88% 80% 88% 94% 94% 92% 82% 86%\n\n93%\n\n\n78%\n\n\n0 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75\nMay 2015\n\n\n8% 63% 48% 87% 54%\n\n\n94%\n\n\n97% 70% 95%\n\n98% 94% 97%\n\n54% 98% 97% 98%\n\n\n98%\n\n\nSource: Cisco Security Research\n\n**S H A R E**\n\n**46** **Defender Behavior**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nWe found that Firefox updated its versions about every other\nweek, with the frequency of updates increasing over the\ncourse of the observation period. This increase in frequency\nis reflected in the growth of old Firefox versions within the\npopulation. The recovery time is roughly 1.5 weeks, but the\ntimes overlap. The population that tries to stay current drops\nto as little as 30 percent of the user base. At some point,\ntwo-thirds of the users have resorted to simply running the\nbrowser more than four versions behind the most current\none. So, although Firefox is rapidly addressing issues and\nfixing bugs, the user base is not updating and restarting on\nthe same frequency.\n\nFor software, the level of use seems to also be an indicator\nof its vulnerability. When users do not access software\noften and therefore aren’t aware of the need to patch and\nupgrade it, the ignored software provides space and time\nfor attackers to operate.\n\nWe can see this in the research on Microsoft Silverlight,\nwhich shows a recovery period of as long as 2 months\n\n###### Figure 43  Time to Patch for Firefox, Silverlight, and Java\n\n**Firefox**\n\n\nfor users to install upgrades after a release. At one point,\nthere were two releases within 5 weeks, which affected the\nuser population for more than 3 months, as can be seen\nbetween Q4 of 2015 and Q1 of 2016.\n\nMicrosoft announced the end of life of Silverlight in 2012,\nalthough patches and bug fixes are still being released.\nHowever, it poses the same problem that Internet Explorer\ndoes: Outdated and unpatched software invites attackers\nto easily exploit it.\n\nThe recovery period for Java users shows that most are\nrunning versions of the software that are one to three\nversions behind the most recent release. The time to\nrecovery is about 3 weeks. An unusual pattern with Java\nis that the dominant populations are those that use recent\nversions. The Java update cycle is from 1 to 2 months.\n\nThe overall lesson from time-to-patch cycles is that\nupgrade release patterns are a contributing factor in user\nsecurity posture, which can place networks at risk.\n\n\nOutdated\nVersions:\n\n\n99% 93% 93% 95% 97% 94% 94% 87%\n\n98% 98% 99% 94% 92% 96% 94% 99% 96% 93% 97% 99% 99% 97%\n\n94% 92% 99% 88% 95% 85%\n\n\nWeek: 0 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75\n\nMay 2015\n\n**Silverlight**\n\n\nOutdated\nVersions:\n\nWeek:\n\n**Java**\n\nOutdated\nVersions:\n\n\n26% 88% 93% 91%\n\n0 5 10 15 20 25 30 35 40 45 50 55\n\nMay 2015\n\n84% 99% 93% 99% 96% 91% 98% 97% 99% 98%\n\n\nWeek: 0 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75\n\nMay 2015\n\nUpdate Released Low High\nAdoption of Latest Update\n\nSource: Cisco Security Research\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n**47** **Defender Behavior**\n\n\n-----\n\n# Cisco 2017  Security Capabilities Benchmark Study\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Cisco 2017 Security Capabilities Benchmark Study\n\n##### To gauge the perceptions of security professionals on the state of security in their organizations, Cisco asked chief security officers (CSOs) and security operations (SecOps) managers in several countries and at organizations of various sizes about their perceptions of their own security resources and procedures. The Cisco 2017 Security Capabilities Benchmark Study offers insights on the maturity level of security operations and security practices currently in use, and also compares these results with those of the 2016 and 2015 reports. The study was conducted across 13 countries with more than 2900 respondents.\n\n\nSecurity professionals want to make their organizations\nmore secure, but in a way that responds to the complex\nattacker landscape and their adversaries’ efforts to expand\ntheir operational space. Many organizations are relying\non many solutions from many vendors. This tactic adds to\nthe complexity and confusion of securing networks as the\nInternet continues to grow in terms of speed, connected\ndevices, and traffic. Organizations need to aim for simplicity\nand integration if they are to protect themselves.\n\n###### Perceptions: Security Professionals Confident in Tools, Less Sure They’re  Using Them Effectively\n\nMost security professionals believe that they have adequate\nsolutions on hand and that their security infrastructures are\nup to date. However, according to our study, this confidence\ncomes with some uncertainty. These professionals are not\nalways sure they can muster the budgets and brainpower to\ntruly take advantage of the technology they have.\n\nThreats to organizations are coming from every direction.\nAdversaries are nimble and creative, and they’re able to outfox\ndefenses. Even in this sobering environment, the majority\nof security professionals feel confident that their security\n\n**49**\n\n\ninfrastructure is up to date, although that confidence appears\nto be waning a bit from previous years. In 2016, 58 percent of\nthe respondents said their security infrastructure is very up to\ndate and is constantly upgraded with the latest technologies.\nThirty-seven percent said they replace or upgrade their\nsecurity technologies on a regular basis but aren’t equipped\nwith the latest-and-greatest tools (Figure 44).\n\n###### Figure 44  Percentages of Security Professionals Who Feel Their Security Infrastructure Is Up to Date\n\n\n2016 (n=2912)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\nDescribed as\nVery Up to Date\nBest Technologies Available\n\n#### 58%\n\n\nDescribed as\nReplaced/Upgraded\non Regular Cadence\n\nNot Equipped with\nLatest and Greatest Tools\n\n#### 37%\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nIn addition, more than two-thirds of security professionals\nperceive their security tools as very effective or extremely\neffective. For example, 74 percent believe their tools are\nvery or extremely effective in blocking known security\nthreats, while 71 percent believe their tools are effective\nat detecting network anomalies and dynamically defending\nagainst shifts in adaptive threats (Figure 45).\n\nThe problem: Confidence in tools does not necessarily\ntransfer to effective security. As the study indicates,\nsecurity departments are wrestling with complicated tools\nfrom many vendors, as well as a lack of in-house talent.\nThis boils down to an “intent versus reality” problem.\nSecurity professionals want simple, effective security tools,\nbut they don’t have the integrated approach they need to\nmake this vision happen.\n\nSecurity remains a high priority for the top levels of many\norganizations. And security professionals believe that\nexecutive teams keep security high on the list of key\norganizational goals. The challenge, of course, is to match\nexecutive support with the talent and technology that can\naffect security outcomes.\n\nThe number of security professionals strongly agreeing that\ntheir executive leadership considers security a high priority\nwas 59 percent in 2016, down slightly from 61 percent\nin 2015 and 63 percent in 2014 (Figure 46). In 2016, 55\npercent of security professionals agreed that security roles\nand responsibilities are clarified within their organization’s\nexecutive team; in 2015 and 2014, 58 percent agreed.\n\nIn summary, security professionals have confidence in the\ntools on hand, and they appear to have the ear of corporate\nleaders in addressing security issues. But that confidence is\nwaning slightly. Security professionals are becoming aware\nof attacker successes and the unwieldiness of managing\nthe growing attack surface.\n\n\n###### Figure 45  Percentages of Security Professionals Who Perceive Various Security Tools to Be Highly Effective\n\n\n#### 74%\n\nPerceive Their Tools to\nBe Very or Extremely Effective\nAgainst Known Security Threats\n\n\n#### 71%\n\nPerceive Their Tools to\nBe Very or Extremely Effective\nat Detecting Network Anomalies\n\nand Dynamically Defending\nAgainst Shifts in Adaptive Threats\n\n\n2016 (n=2912)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 46  Percentages of Security Professionals Who Believe Security Is a High Priority at the  Executive Level, 2014–2016\n\n\n**Strong Agreement That Executive**\n\n**Leadership at Organization**\n**Considers Security a High Priority**\n\n\n**Strong Agreement That Security**\n\n**Roles and Responsibilities**\n\n**Are Clarified Within**\n**Organization’s Executive Team**\n\n\n###### 63% 61% 59% 58% 58% 55%\n\n\n###### 63%\n\n\n###### 59%\n\n\n###### 58%\n\n\n2014\n\n\n###### 61%\n\n\n###### 55%\n\n\n2015 2016 2014 2015 2016\n\n2014 (n=1738), 2015 (n=2432), 2016 (n=2912)\n\n\n###### 58%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**S H A R E**\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n**50**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Constraints: Time, Talent, and Money Affect the Ability to Respond to Threats\n\n\nIf security professionals are relatively confident that they\nhave the tools needed to detect threats and mitigate\ndamage, they also recognize that certain structural\nconstraints stand in the way of their goals. A tight budget\nis a perennial challenge. But other constraints on effective\nsecurity speak to the problems of simplifying and\nautomating security.\n\nIn 2016, 35 percent of security professionals said that\nbudget was their biggest obstacle to adopting advanced\nsecurity processes and technology (a slight decrease from\n2015, when 39 percent said budget was the number one\nobstacle), as seen in Figure 47. As in 2015, compatibility\nissues with legacy systems was the second-most-common\nobstacle: 28 percent named compatibility in 2016, compared\nwith 32 percent in 2015.\n\n\nMoney is only part of the problem. For example, compatibility\nissues speak to the problem of disconnected systems that\ndon’t integrate. And concerns about the lack of trained\npersonnel highlight the problem of having the tools but\nnot the talent to truly understand what is happening in the\nsecurity environment.\n\nThe struggle to find talent is a concern, considering\nthe expertise and decision-making abilities needed to\nfight targeted attacks and shifting adversary tactics. A\nwell-resourced and expert IT security team, paired with\nthe right tools, can make technology and policies work\ntogether and achieve better security outcomes.\n\n\nThe median number of security professionals at the\nsurveyed organizations was 33, compared with 25 in\n2015. In 2016, 19 percent of organizations had between\n50 and 99 dedicated security professionals; 9 percent had\n100 to 199 security professionals; and 12 percent had\n200 or more (Figure 48).\n\n\n###### Figure 47  Biggest Obstacles to Security Figure 48  Number of Security Professionals Employed by Organizations\n\n\n2015 (n=2432) 2016 (n=2912)\n\n\n15\n\n\nBudget Constraints\n\nCompatibility Issues\n\n\n32%\n\n\n39%\n\n\n35%\n\n\n1-9\n\n10-19\n\n20-29\n\n30-39\n\n40-49\n\n50-99\n\n\n17\n\n\n13\n\n\n28%\n\n\nCertification Requirements\n\nLack of Trained Personnel\n\n\n22%\n\n\n8\n\n\n25%\n\n\n25%\n\n\n25%\n\n\n6\n\n\n19\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**S H A R E**\n\n\n100-199\n\n200+\n\n\n12\n\n0% 5% 10% 15% 20%\n\n\n9\n\n\n#### 30 25 33\n\n2014 2015 2016\n\n**Median Number of Professionals**\n\n**Dedicated to Security**\n\n\n**Percentage of**\n**Organizations 2016**\n\n\n**51**\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 49  Number of Security Professionals by Size of Organization\n\n\nMidmarket\n\n\nEnterprise\n\n\nLarge Enterprise (10,000+)\n\n\n1-9 10-19 20-29 30-39 40-49 50-99 100-199 200+\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**S H A R E**\n\nThe number of security professionals varies by organizational\nsize. As shown in Figure 49, 33 percent of large enterprises\nwith more than 10,000 employees had at least 200 **Outsourcing and the Cloud Help**\nsecurity employees. **Stretch Budgets**\n\nWhatever the constraints, security professionals need to Many security professionals participating in\nask hard questions about the barriers that limit their ability the benchmark study felt they were cashto face coming threats. strapped when making security purchases.\n\nThey stretched their budget by outsourcing\n\nFor example, when it comes to budget, how much is\n\nsome tasks or using cloud solutions. They\n\nreally enough? As survey respondents explained, security\n\nalso relied on automation.\n\nteams must compete against many other corporate\npriorities, even within the IT setting. If they can’t secure\nfunds for more tools, then the budget they do have must\nwork harder. For example, automation can be used to\noffset limited manpower.\n\nSimilar questions should be asked about the software and\nhardware compatibility problem. As compatibility issues\nmultiply, how many different versions of software and\nhardware—most of which may not be operating effectively—\nmust be managed? And how will security teams handle the\nmultiple certification requirements needed?\n\n\n**52**\n\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nAside from those limitations, security professionals\nare also placing slightly less emphasis on security\noperationalization. This trend may raise concerns\nthat security professionals are building a suboptimal\nsecurity infrastructure. Signs of a weakening focus on\noperationalization can indicate that organizations are not\nprepared to defend a widening attack landscape.\n\nFor example, in 2016, 53 percent of the respondents\nstrongly agreed that they review and improve security\npractices regularly, formally, and strategically; in 2014 and\n2015, 56 percent strongly agreed. Likewise, in 2016, 53\npercent said they strongly agreed that they routinely and\nsystematically investigate security incidents, compared with\n55 percent in 2014 and 56 percent in 2015 (Figure 50).\n\nIf security professionals are slipping in their goals to put\nsecurity into use, then it may not be a surprise that they\ncan’t effectively deploy the tools they have, much less add\nnew tools. If, as study respondents told us, they cannot use\nthe technology that they already have on hand, they need\nsimpler streamlined tools that automate security processes.\nAnd those tools need to provide a holistic picture of what is\ngoing on in the network environment.\n\nThe lack of integration in security can allow gaps of time\nand space, where bad actors can launch attacks. The\ntendency of security professionals to juggle solutions and\nplatforms from many vendors can complicate assembling\na seamless defense. As seen in Figure 51, a majority of\ncompanies use more than five security vendors and more\nthan five security products in their environment. Fifty-five\npercent of security professionals use at least six vendors;\n45 percent use anywhere from one to five vendors; and\n65 percent use six or more products.\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n**53**\n\n\n###### 56%\n\n\n###### 56%\n\n\n###### 53%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n###### Figure 50  Percentages of Respondents Who Strongly Agree with Security Operationalization Statements\n\n\n**We Review and Improve**\n\n**Our Security Practices**\n**Regularly, Formally, and**\n\n**Strategically Over Time**\n\n\n**We Routinely and**\n**Systematically Investigate**\n\n**Security Incidents**\n\n\n###### 56% 56% 53% 55% 56% 53%\n\n\n###### 56%\n\n\n###### 53%\n\n\n2014\n\n\n###### 55%\n\n\n2015 2016 2014 2015 2016\n\n2014 (n=1738), 2015 (n=2432), 2016 (n=2912)\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 51  Number of Security Vendors and Products Used by Organizations\n\n**Number of Security Vendors in Security Environment**\n2016 (n=2850), Graphic Rounded to Nearest Whole Number\n\n\n1–5\nVendors\n\n\n6–10\nVendors\n\n\n11–20\nVendors\n\n\n21–50\nVendors\n\n\n###### 45% 29% 18% 7%\n\n55% Use More Than 5 Vendors\n\n\nOver 50\nVendors\n\n###### 3%\n\n\n**Number of Security Products in Security Environment**\n2016 (n=2860), Graphic Rounded to Nearest Whole Number\n\n\n1–5\nProducts\n\n###### 35%\n\n\n###### 29% 21% 11% 6%\n\n65% Use More Than 5 Products\n\n\n6-10\nProducts\n\n\n11–25\nProducts\n\n\n26–50\nProducts\n\n\nOver 50\nProducts\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 52  Percentages of Security Alerts That Are Not Investigated or Remediated\n\n 7%\nExperienced No\n\nSecurity Alert\n\n###### 44% 56%\nOf Alerts NOT Of Alerts Are\nInvestigated Investigated\n\n###### 46%\nOf Legitimate Alerts\nAre Remediated\n\n###### 54%\nOf Legitimate Alerts\nAre NOT Remediated\n\n2016 (n=2796)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n###### 93%\nExperienced\nSecurity Alert\n\n###### 28%\nOf Investigated\nAlerts Are Legitimate\n\n\nIf operationalization goals are slipping, if tools are not used at\ntheir maximum effectiveness, and if manpower is not robust,\nthe result is faltering security. Security professionals are forced\nto skip the investigation of alerts simply because they do not\nhave the talent, tools, or automated solutions available to\ndetermine which ones are critical and why they are occurring.\n\nPerhaps due to several factors—such as the lack of an\nintegrated defense system or the lack of staff time—\norganizations are able to investigate a little more than half\nthe security alerts they receive in a given day. As shown\nin Figure 52, 56 percent of alerts are investigated, and\n44 percent are not investigated; of those alerts that are\ninvestigated, 28 percent are deemed legitimate alerts.\nForty-six percent of legitimate alerts are then remediated.\n\nTo put the problem into more concrete terms, if an\norganization records 5000 alerts per day, this means:\n\n - 2800 alerts (56 percent) are investigated, while 2200 (44\npercent) are not\n\n - Of those investigated, 784 alerts (28 percent) are legitimate,\nwhile 2016 (72 percent) are not\n\n - Of the legitimate alerts, 360 (46 percent) are remediated,\nwhile 424 (54 percent) are not remediated\n\n**54**\n\n\nThe fact that nearly half of alerts go uninvestigated should\nraise concern. What is in the group of alerts that is not\nbeing remediated: Are they low-level threats that might\nmerely spread spam, or could they result in a ransomware\nattack or cripple a network? To investigate and understand\na greater slice of the threat landscape, organizations\nneed to rely on automation as well as properly integrated\nsolutions. Automation can help stretch precious resources\nand remove the burden of detection and investigation from\nthe security team.\n\nThe inability to view so many alerts raises questions about\ntheir impact on an organization’s overall success. What\ncould these uninvestigated threats do to productivity,\ncustomer satisfaction, and confidence in the enterprise?\nAs respondents told us, even small network outages or\nsecurity breaches can have long-term effects on the\nbottom line. Even when losses were relatively minor and\nthe affected systems were fairly easy to identify and\nisolate, security leaders regard breaches as significant\nbecause of the stress they put on the organization.\n\n**S H A R E**\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nThe stresses can affect organizations in many ways. Security\nteams must devote time to managing network outages that\noccur after a security breach. Nearly half of these outages\nlasted as long as 8 hours. Forty-five percent of the outages\nlasted from 1 to 8 hours (Figure 53); 15 percent lasted 9 to\n16 hours, and 11 percent lasted 17 to 24 hours. Forty-one\npercent of these outages affected between 11 percent and\n30 percent of the organizations’ systems.\n\n###### Impact: More Organizations Experience Losses from Breaches\n\nThe effects of breaches aren’t limited to outages. Breaches\nalso mean the loss of money, time, and reputation. Security\nteams who believe they will dodge this bullet are ignoring\nthe reality of the data. As our study shows, almost half\nof organizations have had to cope with public scrutiny\nfollowing a security breach. Given the attackers’ range of\nability and tactics, the question isn’t if a security breach will\nhappen, but when.\n\nAs the benchmark study shows, security professionals are\njarred into reality when breaches occur. They often change\nsecurity strategies or bolster defenses. Organizations that\nhave not yet suffered a breach of their networks due to\nattackers may be relieved they’ve escaped. However, this\nconfidence is probably misplaced.\n\nForty-nine percent of the security professionals surveyed\nsaid their organization has had to manage public scrutiny of\na security breach. Of those organizations, forty-nine percent\ndisclosed the breach voluntarily, while 31 percent said the\ndisclosure was made by a third-party (Figure 54). In other\nwords, nearly one-third of the surveyed organizations were\nforced to deal with the involuntary disclosure of a breach.\nIt’s clear that the days of quietly dealing with breaches may\nbe long gone. There are too many regulators, media, and\nsocial media users who will expose the news.\n\n**S H A R E**\n\n**55**\n\n\n###### 49% Public Scrutiny\n\nof a Security Breach\n\n2016 (n=2824)\n\n**How the Most Recent Breach**\n\n**Became Known Externally**\n\n(n=1389)\n\n\n###### 31% 31% 50%\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n###### Figure 53  Length and Extent of Outages Caused by Security Breaches\n\n**Organizations’ Systems Down Time Due to Breach**\n\n2016 (n=2665)\n\nNo Less Than 1–8 9–16 17–24 Over 24\nOutage 1 Hour Hours Hours Hours Hours\n\n\n###### 7%\n\n\n###### 13% 45% 15% 11% 9%\n\n**Percentage of Systems Impacted Due to Breach**\n\n2016 (n=2463)\n\nNo 1–10% 11–30% 31–50% Over 50%\nImpact Impacted Impacted Impacted Impacted\n\n\n###### 1%\n\n\n###### 19% 41% 24% 15%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 54  Percentage of Organizations  Experiencing a Public Breach\n\n\nInvoluntarily\n\nDisclosed\n(Third-Party)\n\n\nRequired\nReporting\n(Regulatory/Legal)\n\n\nVoluntarily\n\nDisclosed\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 55  Functions Most Likely to Be Affected by a Public Breach\n\n\nCustomer\nRetention\n\n###### 26%\n\nRegulatory\n\nScrutiny\n\n\nIntellectual\n\nProperty\n\n###### 24%\n\nHave Not Had Any Security\n\nBreaches in the Past Year\n\n\nOperations\n\n\nFinances\n\n\n###### 36% 30%\n\n\nBusiness Partner\n\nRelationships\n\n\nSupplier\nRelationships\n\n\nBrand\nReputation\n\n###### 26%\n\nLegal\nEngagements\n\n\n###### 22% 20% 20% 19% 10%\n\n\nSource: Cisco Security Research\n\n**S H A R E**\n\nThe damage to organizations goes far beyond the time it takes\nto deal with a breach or outage. There are real and substantial\nimpacts that enterprises should try mightily to avoid.\n\nAs seen in Figure 55, 36 percent of security professionals\nsaid that operations was the function most likely to be\naffected. This means that core systems of productivity,\nwhich affect industries from transportation to healthcare to\nmanufacturing, can slow down or even grind to a halt.\n\n\nAfter operations, finance was the function most likely to be\naffected (cited by 30 percent of the respondents), followed\nby brand reputation and customer retention (both at\n26 percent).\n\nNo organization that plans to grow and achieve success\nwants to be in a position of having critical departments\naffected by security breaches. Security professionals\nshould view the survey results with an eye toward their\nown organizations, and ask themselves: If my organization\nsuffers this kind of loss from a breach, what happens to the\nbusiness down the road?\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n**56**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nThe opportunity losses for companies suffering online\nattacks are daunting. Twenty-three percent of the surveyed\nsecurity professionals said that in 2016, their organizations\nexperienced a loss of opportunity due to attacks (Figure 56).\nOf that group, 58 percent said that the total opportunity lost\nwas under 20 percent; 25 percent said the lost opportunity\nwas 20 to 40 percent, and 9 percent said the lost opportunity\namounted to 40 to 60 percent.\n\nMany organizations can quantify the revenue losses\nthey experience due to public breaches. As seen in\nFigure 57, 29 percent of security professionals said their\norganizations experienced a loss of revenue as a result of\nattacks. Of that group, 38 percent said that revenue loss\nwas 20 percent or higher.\n\nOnline attacks also result in fewer customers. As shown\nin Figure 58, 22 percent of organizations said they lost\ncustomers as a result of attacks. Of that group, 39 percent\nsaid they lost 20 percent of their customers or more.\n\n\n###### Figure 57  Percentage of Organizational Revenue Lost as the Result of an Attack\n\n 29% Experienced a Loss of Revenue\n\nIT Security Personnel\n(n=2912)\n\nLost Less Lost Lost Lost Lost\nThan 20% 20–40% 40–60% 60–80% 80–100%\n\n###### 62% 20% 10% 4% 4%\n\n 38%\n\nSaw Substantial Loss of Revenue\n\n(n=778)\n\n\n###### 29% of Revenue\n\nIT Security Personnel\n(n=2912)\n\nLost Less Lost Lost Lost Lost\nThan 20% 20–40% 40–60% 60–80% 80–100%\n\n###### 62% 20% 10% 4% 4%\n\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics) Source: Cisco 2017 Security Capabilities Benchmark Study\n\n\n###### Figure 56  Percentage of Business Opportunity Lost as the Result from an Attack\n\n 23% Experienced a Loss of Opportunity\n\nIT Security Personnel\n(n=2912)\n\nLost Less Lost Lost Lost Lost\nThan 20% 20–40% 40–60% 60–80% 80–100%\n\n###### 58% 25% 9% 5% 3%\n\n 42%\n\nSaw Substantial Loss of Opportunity\n\n(n=625)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**57**\n\n\n###### Figure 58  Percentage of Customers Lost by  Companies Due to Attacks\n\n 22% Experienced a Loss of Customers\n\nIT Security Personnel\n(n=2912)\n\nLost Less Lost Lost Lost Lost\nThan 20% 20–40% 40–60% 60–80% 80–100%\n\n###### 61% 21% 8% 6% 4%\n\n 39%\n\nSaw Substantial Loss of Customers\n\n(n=641)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n###### 23% of Opportunity\n\nIT Security Personnel\n(n=2912)\n\nLost Less Lost Lost Lost Lost\nThan 20% 20–40% 40–60% 60–80% 80–100%\n\n###### 58% 25% 9% 5% 3%\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Outcomes: Increased Scrutiny Will Play a Role in Security Improvements\n\nAs the survey results show, the impact of breaches\ncan be long-lasting and widespread. If one assumes\nan organization will be affected by a breach at some\npoint, the question is, what happens next? Where should\nmanagement shift their attention and resources so that\nbreaches are less likely to occur?\n\nThe aftermath of a breach is a learning opportunity,\nan experience that should not go to waste in terms of\ninvesting in better approaches.\n\nNinety percent of the security professionals said that a\nsecurity breach drove improvements in threat defense\ntechnologies and processes, as shown in Figure 59. Of\nthose organizations affected by breaches, 38 percent said\nthey responded by separating the security team from the\nIT department; 38 percent said they increased security\nawareness training among employees; and 37 percent said\nthey increased their focus on risk analysis and mitigation.\n\n**S H A R E**\n\n**58**\n\n\n###### 90% Defense Technologies,\n\nPolicies, or Procedures\n\nSecurity Professionals (n=1388)\n\n**Top 5 Improvements Made to Protect**\n**Company from Security Breaches**\n\n2016 (n=1375)\n\n###### 38% Separated Security Team from IT Department\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n###### Figure 59  How Security Breaches Drive Improvements\n\n\n###### 38%\n\n 37%\n\n 37%\n\n 37%\n\n\nIncreased Security Awareness\nTraining Among Employees\n\nIncreased Focus on Risk Analysis\nand Risk Mitigation\n\nIncreased Investment in\nSecurity Defense Technologies\nor Solutions\n\nIncreased Investment in\nTraining of Security Staff\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nOrganizations recognize that they have to exercise\ncreativity to move beyond the constraints of talent,\ntechnology compatibility, and budget. One strategy is to\nadopt outsourced services to strengthen the budget and\nalso tap into talent that may not be in-house.\n\nIn 2016, 51 percent of security professionals outsourced\nadvice and consulting, while 45 percent outsourced\nincident response (Figure 60). Fifty-two percent said they\noutsource services to save costs, while 48 percent said\nthey do so to obtain unbiased insights.\n\nAs they do with outsourcing, organizations also rely on\nthird-party vendors to augment their defense strategies.\nThe security ecosystem provides them with ways to share\nthe responsibility for security.\n\nSeventy-two percent of the security professionals said\nthat they rely on third-party vendors for 20 to 80 percent\nof their security, as seen in Figure 61. Those organizations\nthat rely heavily on outside help for security were most\nlikely to say that they will increase their use of third-party\nvendors in the future.\n\n**S H A R E**\n\n\n###### Figure 60  Organizations' Reliance on Outsourcing\n\n**Outsourced Security Services**\n\n2016 (n=2912)\n\n\nAdvice and Consulting\n\n###### 51%\n\n\nIncident Response\n\n###### 45%\n\n\n**Why Services Are Outsourced**\n\n2016 (n=2631)\n\n\nBe More Cost-Efficient\n\n###### 52%\n\n\nObtain Unbiased Insight\n\n###### 48%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n###### Figure 61  Percentage of Organizations' Reliance on Outsourcing\n\nIT Security Personnel (n=2595)\n\n\nRely More Than 80%\n\n\nRely Less Than 20%\n\n\n**Change in Reliance in the Next Year**\nIT Security Personnel Relying on Third-Party Vendors (n=2504)\n\nDecrease Significantly Decrease Somewhat Remain the Same Increase Somewhat Increase Significantly\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n**59**\n\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 62  Sources of Increased Scrutiny\n\n\nExecutive\nLeadership\n\n\nClients and\n\nCustomers\n\n\nEmployees\n\n###### 72%\n\nInsurance\nCompanies\n\n###### 67%\n\n2016 (n=2912)\n\n\nWatchdog and\nInterest Groups\n\n###### 70%\n\n\nBusiness\n\nPartners\n\n###### 72%\n\nPress\n\n###### 60%\n\n\n###### 74% 73%\n\n\nRegulators\n\n###### 70%\n\n\nInvestors\n\n###### 69%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\nAs organizations take steps to strengthen their security\nposture, they can expect that more attention will be paid\nto their efforts. This scrutiny will come from influential\naudiences and therefore can’t be ignored. How these\naudiences’ concerns are addressed can have a significant\nimpact on an organization’s ability to defend itself.\n\n**60**\n\n\nSeventy-four percent of the security professionals said\nscrutiny will come from the executive leadership;\n73 percent, from clients and customers; and 72 percent,\nfrom employees, as seen in Figure 62.\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 63  How Trust and Cost-Effectiveness Drive Security Decisions\n\n\n**Security Threat Defense Solution Purchasing**\nIT Security Personnel (n=2665)\n\nTypically Follow Enterprise\nArchitecture Approach\n\n39%\n\nTypically Follow ProjectBased Approach (For\nExample, Best-of-Breed\nPoint Products)\n\n39%\n\n4%\n\nDeploy Point 18%\nProducts as Needed\n\nOnly Deploy to Meet Compliance\nor Regulatory Requirements\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n**Reasons for Favoring a**\n**Best-of-Breed Approach**\nOrganization That Purchased\nBest-of-Breed Point Solutions\n\nTrust More Than Enterprise\nArchitecture Approach\n\n\n**Reasons for Favoring an Enterprise**\n**Architecture Approach**\nOrganizations That Typically Follow\nan Enterprise Architecture Approach\n\nTrust More Than Best-of-Breed\n\n\nBest-of-Breed Solutions\nAre More Cost-Effective\n\n\n65% 36%\n\nEnterprise Architecture Approach\nIs More Cost-Effective\n\n\n41% 59%\n\n\nBest-of-Breed Solutions\nAre Easier to Implement\n\n\nEnterprise Architecture\nApproach Is Easier to Implement\n\n\n24% 33%\n\n\nBest-of-Breed Solutions\nAre Faster to Implement\n\n\nEnterprise Architecture Approach\nIs Faster to Implement\n\n\n13% 10%\n\n\n###### Trust Versus Cost: What Drives Security Purchases?\n\n\nSecurity professionals want the very best solutions for\nprotecting their organizations, but their perceptions differ\non how to create the ideal secure environment. Do they\npurchase best-of-breed solutions from a variety of vendors\nbecause they trust these solutions will solve many different\nproblems? Or do they turn to an integrated architecture,\nbecause they believe this approach is more cost-effective?\nAlthough there are many drivers for security investments,\ngreater simplicity can benefit every organization.\n\nAs seen in Figure 63, the security professionals seem\nevenly split between trust and cost in choosing between\nbest-of-breed and architected solutions. Sixty-five percent\nsaid they favor best-of-breed solutions because they trust\nthem more than an enterprise architecture approach. On\nthe other hand, 59 percent said they favor an architected\napproach because they believe it is more cost-effective.\n\n**61**\n\n\nThis isn’t an either/or dilemma. Organizations need both\nbest-of-breed and integrated security solutions. Both\napproaches offer benefits and will simplify security while\nproviding automated response tools (Figure 63).\n\nBy combining best-of-breed solutions with an integrated\napproach, security teams can take steps toward less complex\nyet more effective security. The integrated approach helps\nsecurity professionals understand what’s happening at every\nstage of defense. Such an approach reduces attackers’\noperational space. It is simple, allowing teams to deploy\nsolutions at scale. It is open, allowing for best-of-breed\nsolutions as needed. And it’s automated for faster detection.\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Summary: What the Benchmark Study Reveals\n\nThere is a world of difference between amassing security\ntools and actually having the capability to use those tools to\nreduce risk and close the operational space for adversaries.\nRespondents to the benchmark study believe they have the\ntools that will thwart attackers. But they also acknowledge\nthat constraints such as a lack of manpower and poor\nproduct compatibility can render good tools much less\neffective than they’d hoped.\n\nThe sobering findings regarding the impact of breaches\nshould provide security professionals with ample evidence\nof the need to improve processes and protocols. Faced\nwith real and immediate effects like lost revenue and\n\n**62**\n\n\ncustomers, organizations can no longer simply wish away\ngaps in security protection, because the question is not if\na breach will happen, but when.\n\nOne takeaway from the benchmark study is that the\nconstraints limiting agile and effective security will always\nbe with us: There will never be as much budget and talent\nas security professionals believe they need. If we accept\nthese constraints, then the idea of simplifying security and\ndeploying automated solutions makes sense.\n\nSimplifying security also makes use of best-of-breed\nsolutions and an integrated architecture. Organizations\nneed the benefits of both approaches.\n\n**Cisco 2017 Security Capabilities Benchmark Study**\n\n\n-----\n\n# Industry\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Industry\n\n###### Value Chain Security: Success in a Digital World Hinges on Mitigating Third-Party Risk\n\n\nValue chain security is an essential element of success\nin a connected economy. Ensuring that the right security\nis in the right place at the right time throughout the value\nchain—the end-to-end lifecycle for hardware, software,\nand services—is an imperative.\n\nThe eight stages of the value chain are shown in Figure 64.\n\nInformation technology and operations technology are\nconverging in this digitized world. It is not enough for\norganizations to focus only on protecting their internal\nbusiness models, offerings, and infrastructure. Organizations\nmust look at their value chain holistically and consider whether\neach third-party that is involved in their business model or\ntouching their offerings poses a risk to their security.\n\nThe short answer is that they likely do: Research by the\nSANS Institute found that 80 percent of data breaches\noriginate from third parties.¹⁵ To reduce risk, organizations\nmust foster a value chain where trust is not implicit and\nsecurity is everyone’s responsibility. As a foundational step\ntoward achieving this goal, organizations should:\n\n - Identify the key players in their third-party ecosystem and\nunderstand what those third parties deliver\n\n###### Figure 64  The Stages of the Value Chain\n\n\n\n - Develop a flexible security architecture that can be shared\nwith and deployed across the variety of third parties in\nthat ecosystem\n\n - Assess whether those third parties are operating within the\ntolerance levels set by the organization’s security architecture\n\n - Be alert to new security risks that the ecosystem may\npresent as digitization increases\n\nOrganizations must also think about security before\nintroducing a new business model or an offering that\nrequires involvement by, or that otherwise affects, their\nthird-party ecosystem. Any potential value and productivity\ngains must be weighed against potential risks, particularly\naround data security and privacy.\n\nAwareness of the importance of the value chain is growing\nboth globally and in specific industry sectors. Recent U.S. IT\nprocurement legislation mandated a 1-year assessment by\nthe U.S. Department of Defense regarding open technology\nstandards in procurements for information technology and\ncybersecurity acquisitions.¹⁶ In the highly converged energy\nsector, the North American Electric Reliability Corporation\n(NERC) is actively developing new requirements addressing\nits cyber value chain.¹⁷\n\n\nDesign Plan Source Make Quality Deliver Sustain End of Life\n\nSource: Cisco\n\n**S H A R E**\n\n[¹⁵ Combatting Cyber Risks in the Supply Chain, SANS Institute, 2015: https://www.sans.org/reading-room/whitepapers/analyst/combatting-cyber-risks-supply-chain-36252.](https://www.sans.org/reading-room/whitepapers/analyst/combatting-cyber-risks-supply-chain-36252)\n¹⁶ Public Law 114-92 §\n¹⁷ NERC ordered to undertake this effort by United States Federal Energy Regulatory Commission 18 CFR Part 40 [Docket No. RM15-14-002; Order No. 829].\n\n\n**64**\n\n\n**Industry**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nOrganizations, together with their third parties, need to answer\nquestions such as, “How will data be generated and by\nwhom?” and, “Should the data be digitally mined?” Further\nclarity requires determining the answers to such questions as,\n“Who owns the digital assets we are collecting or creating?”\nand, “With whom must we share that information?” Another\ncritical question to answer: “Who owns what liability and\nobligation when a breach occurs?”\n\nThis value chain-centric approach helps ensure that\nsecurity considerations are built in at every stage of the\nsolutions lifecycle. The right architecture, combined with\nadherence to the appropriate security standards, will help\nto drive pervasive security—and build trust—throughout the\nentire value chain.\n\n###### Geopolitical Update: Encryption, Trust,  and a Call for Transparency\n\nIn previous cybersecurity reports, Cisco geopolitical experts\nexamined the uncertainty in the Internet governance\nlandscape, the rights of the individual versus the rights\nof the state, and the ways that governments and private\nbusinesses might navigate the data-protection dilemma.\nOne common topic across these discussions has been\nencryption. We believe that encryption will continue to\npermeate, perhaps even dominate, the cybersecurity\ndebate for the foreseeable future.\n\nThe proliferation of national and regional data privacy\nlaws has created unease among vendors and users\nattempting to navigate those laws. In this uncertain\nenvironment, issues such as data sovereignty and\ndata localization have come to the fore, helping to fuel\ngrowth in cloud computing and localized data storage as\nbusinesses seek a creative solution to meeting complex\nand evolving privacy regulations.¹⁸\n\nAt the same time, the escalating number of data breaches\nand advanced persistent threats, and the publicity around\nhacks sponsored by nation-states—including those\nconducted during high-profile events such as the U.S.\npresidential election—are making users even less confident\nthat their sensitive data and privacy will be protected.\n\n\nGovernments in the post-Snowden era have been\nincreasingly strident in their desire to regulate digital\ncommunications and to access data when needed.\nHowever, users have been just as ardent in their demand\nfor privacy. Events such as the recent head-butting\nbetween Apple and the FBI over an iPhone belonging to\na terrorist have done nothing to assuage users’ worries\nabout privacy. If anything, it taught a generation of digital\nusers, especially in the United States, about end-to-end\nencryption. Many users are now demanding end-to-end\nencryption from their technology providers, and they want\nto hold the encryption keys.\n\nThis marks a fundamental shift in the cybersecurity\nlandscape as we have known it. Organizations are going to\nneed to architect their environments so they can navigate\nand respond to competing agendas.\n\nWhile this shift is taking place, more governments are\ngiving themselves the legal right—often on a broad\nbasis—to bypass or break encryption or technical\nprotection measures, often without the knowledge of\nthe manufacturer, communication provider, or the user.\nThis is creating tension not only between authorities and\ntechnology firms but also between governments, who are\nnot necessarily keen to see their citizens’ data accessed\nby third-country authorities. Many governments collect\ninformation about zero-day exploits and vulnerabilities\nthat they discover in vendor software; however, they are\nnot always transparent with vendors about the information\nthey possess, or sharing it in a timely manner.\n\nHoarding such valuable information prevents vendors\nfrom improving security in their products and providing\nusers with better protection from threats. Even though\ngovernments may have good reason to hold some of\nthis intelligence close, there is also a need for greater\ntransparency and trust in the global cybersecurity\nlandscape. Governments therefore should conduct a frank\nassessment of their current policies regarding the hoarding\nof zero-day exploits. They should start from the default\nposition that sharing information with vendors can only\nlead to a far more secure digital environment for everyone.\n\n\n¹⁸ For more on this topic, see “Data Localization Takes Off as Regulation Uncertainty Continues,” by Stephen Dockery, June 6, 2016, The Wall Street Journal:\n\n[http://blogs.wsj.com/riskandcompliance/2016/06/06/data-localization-takes-off-as-regulation-uncertainty-continues/.](http://blogs.wsj.com/riskandcompliance/2016/06/06/data-localization-takes-off-as-regulation-uncertai)\n\n**65**\n\n\n**Industry**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n\n**66**\n\n\n**Industry**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Network Performance and Adoption Versus Security Maturity: Online Speeds, Traffic,  and Preparedness Are Not Growing at the Same Pace\n\n\nDefenders want to stay ahead of their adversaries. To be\nbehind them is to be in a potentially dangerous place.\nThe worry is that defenders can’t improve their security\nposture at the same pace that adversaries can gain space\nand time to operate. Given the pace of growth of fixed and\nmobile Internet traffic worldwide, defenders are obligated\nto match this growth with gains in the maturity of their\nsecurity infrastructure.\n\nThe Cisco VNI Forecast examines global IP traffic\nannually, including mobile and Wi-Fi traffic. The forecasts\nprovide 5-year projections for IP traffic, the number of\nInternet users, and the number of personal devices and\nmachine-to-machine (M2M) connections that will be\n[supported by IP networks. (Visit here for more details on](http://www.cisco.com/c/en/us/solutions/service-provider/visual-networking-index-vni/index.html)\nthe VNI Forecast.) For example, the forecast estimates\nthat by 2020, smartphones will generate 30 percent of\ntotal IP traffic.\n\n###### Figure 65  Security Maturity and Growth Rates\n\n\nCisco has matched the VNI Forecast to data about\ndefender maturity, taken from Cisco’s annual Security\nCapabilities Benchmark Study (see page 49). In examining\nmaturity growth rates in the 2015, 2016, and 2017\nbenchmark reports, as seen in Figure 65, security maturity\nis underwhelming compared with the growth of Internet\ntraffic. Some countries, such as China and Germany,\nactually show a slight decline in maturity over this time\nperiod. Broadband speeds, in particular, are improving\nand growing at a significantly greater rate than other\nnetworking variables shown in Figure 65. Faster speeds\nand more connected devices foster greater traffic growth,\nbut organizations are struggling to bolster their security\nmeasures and infrastructures at similar rates.\n\n\n300%\n\n250%\n\n\n200%\n\n150%\n\n\n100%\n\n50%\n\n\n0%\n\n\nAustralia Brazil Canada China France Germany India Italy Japan Mexico Russia United\nKingdom\n\n\nUnited\nStates\n\n\n**Overall**\n\n**Industry**\n\n\nSecurity Maturity Total Traffic Devices Fixed Internet Users Mobile Internet Traffic Mobile Speed\n\nSource: Cisco Security Research, Cisco VNI, and Cisco 2017 Security Capabilities Benchmark Study\n\n\n**S H A R E**\n\n**67**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nCertain industries also lag in terms of their security maturity\ncompared with other industries, as seen in Figure 66. In\nparticular, pharmaceuticals, healthcare, and transportation\nare behind other industries.\n\nIt’s important to note that the dramatic rise in mobile\nspeeds is an outcome of the broad adoption of 4G and\nLTE networks by telecommunications providers. When\nlarge-scale deployments of 5G networks become available\ntoward the end of this decade, mobile speeds are expected\nto become comparable to fixed network speeds. According\nto the current Mobile VNI Forecast, global mobile traffic\nwill likely gain a greater share of total IP traffic when 5G\n\n###### Figure 66  Security Maturity in Industry Verticals\n\n**Industry by Segment**\n\n\nis broadly adopted. Global mobile traffic was 5 percent of\ntotal IP traffic in 2015, according to the VNI Forecast; it is\nprojected to be 16 percent of total IP traffic by 2020.\n\nIt’s clear that security organizations must step up their\nmaturity efforts, and quickly, if they are to match the growth\nin Internet traffic, which portends growth in the potential\nattack surface. In addition, organizations must respond to the\ngrowth in the use of endpoints that are not fixed or wired to\ncorporate networks. They must also accommodate a more\nwidespread use of personal devices from which workers\naccess corporate data.\n\n\n###### 48\n\n\n###### 39\n\n\n###### 36\n\n\n###### 29\n\n\nEducation\n\n(n=44)\n\n9\n\n###### 30\n\n21\n\nPharmaceuticals\n\n(n=56)\n\n\n###### 39\n\n\nFinancial Services\n\n(n=501)\n\n5\n\n###### 32\n\n34\n\nRetail\n(n=286)\n\n\nGovernment\n\n(n=345)\n\n3\n\n###### 42 24\n\n28\n\nTelecommunications\n\n(n=303)\n\nGraphic Rounded to Nearest Whole Number\n\n\nHealthcare\n\n(n=211)\n\n5\n\n###### 30\n\n27\n\nTransportation\n\n(n=174)\n\n\nNon-Computer-Related\n\nManufacturing\n\n(n=355)\n\n5\n\n###### 38 33\n\n24\n\nUtilities/Energy\n\n(n=113)\n\n**Industry**\n\n\n###### 42\n\n\n###### 32\n\n\n###### 30\n\n\nLow Middle Upper-Mid High\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**68**\n\n\n###### 38\n\n24\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 67  Security Maturity by Country\n\n4 4 7\n\n25 25 34 28\n\n###### 41 41 31\n\n**USA** **Brazil** **Germany**\n\n29 30 28 31\n\n###### 31 5 31 13 3 17\n\n31 35\n\n**Australia** **China** 47 **India**\n\n35\n\n31\n\n34 21\n\n4 6 7\n\n###### 39 30 32 33\n\n35\n\n**Russia** **France** **Canada** 36\n\n27 26 23\n\n2016 (n=2852) Graphic Rounded to Nearest Whole Number\n\nLow Middle Upper-Mid High\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n###### 47 India\n\n\n###### 41\n\n**USA**\n\n\n###### 39\n\n**Russia**\n\n\n###### 34\n\n**Germany**\n\n\n###### 32\n\n**France**\n\n\n###### 31\n\n**China**\n\n\n###### 28\n\n**UK**\n\n\nFaster speeds are not the only factor driving growth\nof Internet traffic. The IoT is accelerating the number\nof devices that are attached to the Internet, not only\nadding to the growth of traffic but also adding potential\npathways for attackers.\n\n\n###### 47\n**Mexico**\n\n\n###### 35\n\n**Japan**\n\n\n###### 31\n\n**Australia**\n\n\nFor more information about the Cisco VNI Forecast, visit the\n[Cisco website or read the Cisco blog post on the annual](http://www.cisco.com/c/en/us/solutions/service-provider/visual-networking-index-vni/index.html)\n[VNI forecast for 2015 to 2020.](http://blogs.cisco.com/sp/updated-cisco-vni-complete-forecast-released-today-so-what?_ga=1.213955538.475831013.1478563405)\n\n**Industry**\n\n\n**69**\n\n\n###### 33\n\n**Canada**\n\n\n-----\n\n# Conclusion\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Conclusion\n\n###### A Rapidly Expanding Attack Surface Requires an Interconnected and  Integrated Approach to Security\n\n\nIn analyzing data from Cisco’s Security Capabilities\nBenchmark Study (see page 49), we are able to\nexamine patterns and decisions that help organizations\nminimize risk. We can therefore see where they should\nmake security investments that can lead to a significant\ndifference in risk exposure. We measured risk by looking at\nthe lengths of breaches as well as percentages of system\noutages (see Figure 53 on page 55 regarding the length of\nbreaches and the systems affected).\n\nTo understand how organizations create effective\nsafeguards against risk, we need to examine what drivers\naffect their ability to prevent, detect, and mitigate risk.\n(See Figure 68.) The drivers must include these elements:\n\n - **Executive leadership: The top leadership must prioritize**\n\nsecurity. This is critical for the mitigation of attacks, as well\nas their prevention. The executive team should also have\nclear and established metrics for assessing the effectiveness\nof a security program.\n\n###### Figure 68  Drivers and Safeguards for Minimizing Risk\n\n\n\n- **Policy: Policy has strong ties to mitigation. Controlling**\naccess rights to networks, systems, applications, functions,\nand data will affect the ability to mitigate damage from\nsecurity breaches. In addition, policies to ensure a regular\nreview of security practices will help prevent attacks.\n\n- **Protocols: The right protocols can help prevent and**\ndetect breaches, but they also have a strong relationship to\nmitigation. In particular, regular reviews of connection activity\non networks, to ensure that security measures are working,\nare key to both prevention and mitigation. It’s also beneficial\nto review and improve security practices regularly, formally,\nand strategically over time.\n\n- **Tools: The judicious and appropriate application of tools**\nhas the strongest relationship with mitigation. With tools in\nplace, users can review and provide feedback that is vital to\ndetection and prevention as well as mitigation.\n\n\n**Drivers**\nMeasure Influence of Policy, Executive\nLeadership, Protocols, Tools on Firm’s\nAbility to Prevent, Detect, and Mitigate\nEffects of a Breach\n\n###### Executive Leadership\n\n Policy\n\n Protocols\n\n Tools\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n**Safeguards**\nMeasure Influence of Firm’s Ability\nto Prevent, Detect, and Mitigate\nEffects of a Breach on Risk\n\n\n[Download the 2017 graphics at: www.cisco.com/go/acr2017graphics](http://www.cisco.com/go/acr2017graphics)\n\n\n**71**\n\n\n**Conclusion**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\nThe security safeguards that organizations use—prevention,\ndetection, and mitigation—can be viewed as measures of\ninfluence on an organization’s ability to minimize risk.\n(See Figure 68.)\n\nThese safeguards must include the following elements:\n\n - **Prevention: To minimize the impact of security breaches,**\n\nemployees must report security failures and problems. It’s\nalso crucial for security processes and procedures to be\nclear and well understood.\n\n - **Detection: The best detection methods for minimizing the**\n\nimpact of breaches are those that allow organizations to\nspot security weaknesses before they become full-blown\nincidents. To accomplish this, it’s vital to have a good system\nfor categorizing incident-related information.\n\n**72**\n\n\n\n - **Mitigation: Well-documented processes and procedures**\nfor incident response and tracking are key to effective breach\nmitigation. Organizations also need strong protocols to\nmanage their response to crises.\n\nAll of these drivers and safeguards are interconnected\nand interdependent. Security professionals can’t\nsimply cherry-pick a couple of drivers and one or two\nsafeguards, and believe they have solved the security\nproblem. They need every driver, and every safeguard.\nSecurity teams must analyze where their weaknesses\nare—for example, low levels of support from leaders, or\na lack of tools to mitigate breaches—and calculate where\ninvestments in security must be made.\n\n**Conclusion**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### The Key Goal: Reducing Adversaries’ Operational Space\n\n\nReducing—and ideally, eliminating—the unconstrained\noperational space of adversaries, and making attackers’\npresence known, must be top priorities for defenders.\nThe reality is that no one can stop all attacks, or protect\neverything that can and should be protected. But if you\nfocus on closing the operational space that cybercriminals\nmust have for their campaigns to be effective and\nprofitable, you can prevent them from reaching critical\nsystems and data without entirely evading detection.\n\nThis report categorized different approaches that\nadversaries use to compromise and attack users and\nsystems. We based our categories—reconnaissance,\nweaponization, delivery, and installation—on where the\nattacks are typically deployed in the attack chain. This\nexercise was meant to illustrate when, how, and where\nadversaries take advantage of vulnerabilities and other\nweaknesses to gain a foothold on a device or in a\nsystem, launch their campaign, and then reap the\nrewards they seek.\n\nWe suggest that defenders adapt their security approaches\nto stay ahead of attackers’ basic processes. For example,\nto undermine adversaries during the reconnaissance phase,\nsecurity teams should be:\n\n - Gathering information about the latest threats and vulnerabilities\n\n - Ensuring they are controlling access to their networks\n\n - Limiting the organization’s exposure in an expanding\nattack surface\n\n - Managing configurations\n\n - Developing consistent response practices and procedures\nthat are informed by this work\n\n**73**\n\n\nWhen weaponized threats are delivered, defenders must\napply every tool in their arsenal to prevent them from\nspreading and worsening. This is where an integrated\nsecurity architecture becomes critical. It will provide realtime insight into threats as well as automated detection and\ndefense, which are essential for improving threat detection.\n\nAt the installation phase, security teams must stay informed\nabout the state of the environment as they respond to and\ninvestigate the compromise. If that environment is simple,\nopen, and automated, and if defenders have taken the\nother proactive steps outlined above, they can then focus\ntheir resources on helping the business to answer critical\nquestions such as:\n\n - What did the attackers access?\n\n - Why were they able to get to it?\n\n - Where did they go?\n\n - Are they still operating in our network?\n\nThe answers to these questions will allow security teams\nnot only to take appropriate actions to prevent further\nattacks, but also to inform management and the board\nabout possible exposures and necessary disclosures.\nThen, the business can begin the process of ensuring that\nit has comprehensive controls and mitigations in place to\naddress any security gaps—the weaknesses that provided\nthe operational space adversaries needed to succeed—that\nwere identified during the compromise.\n\n\n**Conclusion**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### About Cisco\n\nCisco delivers intelligent cybersecurity for the real world,\nproviding one of the industry’s most comprehensive\nadvanced-threat protection portfolios of solutions across\nthe broadest set of attack vectors. Cisco’s threatcentric and operationalized approach to security reduces\ncomplexity and fragmentation while providing superior\nvisibility, consistent control, and advanced threat protection\nbefore, during, and after an attack.\n\nThreat researchers from the Cisco Collective Security\nIntelligence (CSI) ecosystem bring together, under a single\numbrella, the industry’s leading threat intelligence, using\ntelemetry obtained from the vast footprint of devices and\nsensors, public and private feeds, and the open-source\ncommunity. This amounts to a daily ingest of billions of\nweb requests and millions of emails, malware samples,\nand network intrusions.\n\n**74**\n\n\nOur sophisticated infrastructure and systems consume\nthis telemetry, helping machine-learning systems and\nresearchers to track threats across networks, data centers,\nendpoints, mobile devices, virtual systems, web, email,\nand from the cloud to identify root causes and scope\noutbreaks. The resulting intelligence is translated into realtime protections for our product and service offerings that\nare immediately delivered globally to Cisco customers.\n\nTo learn more about Cisco’s threat-centric approach to\n[security, visit www.cisco.com/go/security.](http://www.cisco.com/go/security)\n\n**About Cisco**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Contributors to the Cisco 2017 Annual Cybersecurity Report\n\n\n**CloudLock**\n\nCloudLock, a Cisco company, is a leading provider of\ncloud access security broker (CASB) solutions that help\norganizations securely use the cloud. CloudLock delivers\nvisibility and control for software-as-a-service (SaaS),\nplatform-as-a-service (PaaS), and infrastructure-asa-service (IaaS) environments across users, data, and\napplications. CloudLock delivers actionable cybersecurity\nintelligence through its data scientist-led CyberLab and\ncrowd-sourced security analytics. For more information,\n[visit https://www.cloudlock.com.](https://www.cloudlock.com)\n\n**Security and Trust Organization**\n\nCisco’s Security and Trust Organization underscores\nCisco’s commitment to address two of the most critical\nissues that are top of mind for boardrooms and world\nleaders alike. The organization’s core missions include\nprotecting Cisco’s public and private customers, enabling\nand ensuring Cisco Secure Development Lifecycle and\nTrustworthy Systems efforts across Cisco’s product and\nservice portfolio, and protecting the Cisco enterprise from\never-evolving threats. Cisco takes a holistic approach\nto pervasive security and trust, which includes people,\npolicies, processes, and technology. The Security and\nTrust Organization drives operational excellence, focusing\nacross InfoSec, Trustworthy Engineering, Data Protection\nand Privacy, Cloud Security, Transparency and Validation,\nand Advanced Security Research and Government. For\n[more information, visit http://trust.cisco.com.](http://trust.cisco.com)\n\n**75**\n\n\n**Global Government Affairs**\n\nCisco engages with governments at many different levels\nto help shape public policy and regulations that support\nthe technology sector and help governments meet their\ngoals. The Global Government Affairs team develops and\ninfluences pro-technology public policies and regulations.\nWorking collaboratively with industry stakeholders and\nassociation partners, the team builds relationships with\ngovernment leaders to influence policies that affect Cisco’s\nbusiness and overall ICT adoption, looking to help shape\npolicy decisions at a global, national, and local level.\nThe Government Affairs team is composed of former\nelected officials, parliamentarians, regulators, senior U.S.\ngovernment officials, and government affairs professionals\nwho help Cisco promote and protect the use of technology\naround the world.\n\n**Cognitive Threat Analytics**\n\nCisco’s Cognitive Threat Analytics is a cloud-based\nservice that discovers breaches, malware operating inside\nprotected networks, and other security threats by means of\nstatistical analysis of network traffic data. It addresses gaps\nin perimeter-based defenses by identifying the symptoms\nof a malware infection or data breach using behavioral\nanalysis and anomaly detection. Cognitive Threat Analytics\nrelies on advanced statistical modeling and machine\nlearning to independently identify new threats, learn from\nwhat it sees, and adapt over time.\n\n**About Cisco**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n**IntelliShield Team**\n\nThe IntelliShield team performs vulnerability and threat\nresearch, analysis, integration, and correlation of data\nand information from across Cisco Security Research and\nOperations and external sources to produce the IntelliShield\nSecurity Intelligence Service, which supports multiple Cisco\nproducts and services.\n\n**Talos Security Intelligence and Research Group**\n\nTalos is Cisco’s threat intelligence organization, an elite\ngroup of security experts devoted to providing superior\nprotection for Cisco customers, products, and services.\nTalos is composed of leading threat researchers supported\nby sophisticated systems to create threat intelligence for\nCisco products that detect, analyze, and protect against\nknown and emerging threats. Talos maintains the official\nrule sets of Snort.org, ClamAV, SenderBase.org, and\nSpamCop, and is the primary team that contributes threat\ninformation to the Cisco CSI ecosystem.\n\n\n**Security Research and Operations (SR&O)**\n\nSecurity Research and Operations (SR&O) is responsible\nfor threat and vulnerability management of all Cisco\nproducts and services, including the industry-leading\nProduct Security Incident Response Team (PSIRT). SR&O\nhelps customers understand the evolving threat landscape\nat events such as Cisco Live and Black Hat, as well as\nthrough collaboration with its peers across Cisco and the\nindustry. Additionally, SR&O delivers new services such as\nCisco’s Custom Threat Intelligence (CTI), which can identify\nindicators of compromise that have not been detected or\nmitigated by existing security infrastructures.\n\n**Cisco Visual Networking Index (VNI)**\n\nThe Cisco VNI Global IP Traffic Forecast for 2015 to 2020\nrelies on independent analyst forecasts and real-world\nnetwork usage data. Upon this foundation are layered\nCisco’s own estimates for global IP traffic and service\nadoption. A detailed methodology description is included\nin the complete report. Over its 11-year history, Cisco\nVNI research has become a highly regarded measure\nof the Internet’s growth. National governments, network\nregulators, academic researchers, telecommunications\ncompanies, technology experts, and industry and business\npress and analysts rely on the annual study to help plan\nfor the digital future.\n\n**About Cisco**\n\n\n**76**\n\n\n-----\n\n# Appendix\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n### Appendix\n\n###### Cisco 2017 Security Capabilities Benchmark Study\n\n Figure 69 Survey Capabilities Benchmark Study\n\n\n**Industries**\n\n﻿Education\n(Higher Education)\n\nFinancial Services:\nBanking, Insurance\n\nGovernment\n\nHealthcare\n\nManufacturing:\nNon-Computer Related\n\nPharmaceuticals\n\nRetail\n\nTelecommunications\n\nTransportation\n\nUtilities/Energy\n\nNon-Key Industry\n\n\n2%\n2%\n\n1%\n\n18%\n\n14%\n15%\n\n12%\n12%\n\n9%\n\n8%\n4%\n\n6%\n\n12%\n15%\n\n14%\n\n2%\n3%\n3%\n\n10%\n3%\n3%\n\n11%\n\n8%\n\n6%\n\n6%\n\n5%\n8%\n\n4%\n\n3%\n\n7%\n\n16%\n27%\n\n21%\n\n\n**Areas of Security Involvement**\n\n﻿Making Final Brand Recommendations Regarding Solutions\n\n74%\n\n76%\n\n81%\n\nSetting Overall Vision and Strategy\n\n73%\n\n75%\n\n83%\n\nResearching and Evaluating Solutions\n\n72%\n\n75%\n\n78%\n\nImplementing and Managing Solutions\n\n71%\n\n73%\n\n79%\n\nDefining Requirements\n\n67%\n\n71%\n\n76%\n\nApproving Budgets\n\n54%\n\n57%\n\n66%\n\n2016 (n=2912) 2015 (n=2432) 2014 (n=1738)\n\n\n**Organization Size** **CSO vs. Sec Op**\n\nLarge\nMidmarket Enterprise Enterprise CSO Sec Op\n\n\n2016\n\n2015\n\n2014\n\n\n50%\n\n49%\n\n\n38%\n\n38%\n\n\n12%\n\n13%\n\n46%\n\n\n45%\n\n\n2016\n\n2015\n\n2014\n\n\n49%\n\n\n54%\n\n\n54%\n\n\n51%\n\n55%\n\n46%\n\n**Appendix**\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**78**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 70 Number of Dedicated Security Professionals\n\n1-9\n\n10-19\n\n20-29\n\n30-39\n\n40-49\n\n50-99\n\n100-199\n\n200 or more\n\n\n15%\n\n\n2014 (n=1738) 2015 (n=2432) 2016 (n=2912)\n\n\n18%\n\n\n17%\n\n\n16%\n\n\n18%\n\n\n12%\n\n\n17%\n\n\n8%\n\n\n9%\n\n\n4%\n\n\n4%\n\n\n19%\n\n\n15%\n\n17%\n\n13%\n\n8%\n\n6%\n\n19%\n\n9%\n\n12%\n\n\n9%\n\n\n16%\n\n9%\n\n10%\n\n\n**Median Number of Professionals Dedicated to Security** **30** **25** **33**\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Perceptions\n\n Figure 71 Majority of Security Professionals Feel Security Infrastructure Is Up to Date\n\n**How Would You Describe Your Security Infrastructure?**\n\n\nVery Up to Date\nBest Technologies Available\n\n\nReplaced/Upgraded on Regular Basis\nNot Equipped with Latest-and-Greatest Tools\n\n\nReplaced/Upgraded Only When Necessary\nNo Longer Working, Obsolete, or New Needs\n\n\n2016\n(n=2912)\n\n2015\n(n=2432)\n\n2014\n(n=1738)\n\n\n58%\n\n\n37%\n\n\n5%\n\n\n59%\n\n\n37%\n\n\n5%\n\n\n64%\n\n\n33%\n\n\n3%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**79**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 72 Percentages of Security Professionals Who Perceive Various Security Tools to Be Highly Effective\n\n\n2016 (n=2912)\nGraphic Rounded to\nNearest Whole Number\n\n\nNot at All Not Very Somewhat Very\nEffective Effective Effective Effective\n\n\nExtremely\nEffective\n\n\n% Very + Extremely\nEffective\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 73 Percentages of Security Professionals Who Believe Security Is a High Priority at the Executive Level\n\n\nCyber-Risk Assessments Are Routinely\nIncorporated into Our Overall Risk\nAssessment Process\n\n\nExecutive Leadership at My Organization\nConsiders Security a High Priority\n\n\nSecurity Roles and Responsibilities\nAre Clarified Within My\nOrganization’s Executive Team\n\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n\n**53%**\n\n55%\n\n\n**55%**\n\n58%\n\n\n1%\n\n\n**96%**\n\n95%\n\n\n**96%**\n\n95%\n\n\n**1%** **4%**\n\n\n**1%** **4%**\n\n\n**59%**\n\n61%\n\n\n**96%**\n\n96%\n\n\n**1%** **4%**\n\n\n4%\n\n\n**43%**\n\n40%\n\n\n4%\n\n\n**41%**\n\n36%\n\n\n1%\n\n\n4%\n\n\n**37%**\n\n35%\n\n\n1%\n\n\n2% 4% 32% 63% 94% 2% 5% 35% 58% 94% 2% 4% 36% 57% 93%\n\nMy Organization’s Executive Team Has\nEstablished Clear Metrics for Assessing\nEffectiveness of Our Security Program\n\n\n1% **4%**\n\n\n**95%**\n\n94%\n\n93%\n\n\n**51%**\n\n53%\n\n53%\n\n\n1%\n\n2%\n\n\n5%\n\n6%\n\n\n**44%**\n\n41%\n\n40%\n\n\n2016 (n=2912)\n2015 (n=2432) Strongly Disagree Disagree Agree Strongly Agree % Agree + Strongly Agree\n2014 (n=1738)\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**80**\n\n\n51% **94%**\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 74 Percentages of Respondents Who Strongly Agree with Security Operationalization Statements\n\n\nWe Review and Improve Our Security\nPractices Regularly, Formally, and\nStrategically Over Time\n\n\nOur Threat Detection and Blocking\nCapabilities Are Kept Up to Date\n\n\nWe Regularly Review Connection\nActivity on Network to Ensure Security\nMeasures Are Working as Intended\n\n\n**53%**\n\n57%\n\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n\n**55%**\n\n56%\n\n\n1%\n\n\n**95%**\n\n96%\n\n\n**95%**\n\n96%\n\n\n**0%** **4%**\n\n\n**0%** **4%**\n\n\n**53%**\n\n56%\n\n\n**96%**\n\n96%\n\n\n**0%** **4%**\n\n\n3%\n\n\n**43%**\n\n39%\n\n\n3%\n\n\n**41%**\n\n40%\n\n\n1%\n\n\n4%\n\n\n**42%**\n\n40%\n\n\n1%\n\n\n1% 4% 38% 56% 95% 1% 5% 37% 57% 94% 2% 4% 36% 58% 94%\n\n\nWe Can Increase Security Controls\non High-Value Assets Should\nCircumstances Require\n\n\nSecurity Is Well-Integrated into\nOur Organization’s Goals and\nBusiness Capabilities\n\n\nOur Security Technologies\nAre Well-Integrated to Work\nEffectively Together\n\n\n**53%**\n\n52%\n\n\n**55%**\n\n56%\n\n\n1%\n\n\n**95%**\n\n95%\n\n\n**95%**\n\n96%\n\n\n**0%** **4%**\n\n\n**0%** **5%**\n\n\n**95%**\n\n96%\n\n94%\n\n\n**1%** **4%**\n\n\n**51%**\n\n56%\n\n54%\n\n\n4%\n\n\n**42%**\n\n43%\n\n\n4%\n\n\n**40%**\n\n40%\n\n\n1%\n\n1%\n\n\n3%\n\n5%\n\n\n**45%**\n\n41%\n\n40%\n\n\n1%\n\n\n2% 5% 36% 58% 94% 2% 5% 38% 56% 93%\n\n\nIt Is Easy to Determine the Scope\nof a Compromise, Contain It, and\nRemediate from Exploits\n\n\nWe Routinely and Systematically\nInvestigate Security Incidents\n\n**0%** **5%** **41%** **53%** **95%**\n\n\nWe Have Tools in Place That Enable Us to\nReview and Provide Feedback Regarding\nthe Capabilities of Our Security Practice\n\n\n**43%**\n\n45%\n\n\n**49%**\n\n52%\n\n\n1%\n\n\n**92%**\n\n91%\n\n\n**0%** **5%**\n\n\n**95%**\n\n95%\n\n\n**1%** **7%**\n\n\n8%\n\n\n**49%**\n\n46%\n\n\n4%\n\n\n**46%**\n\n44%\n\n\n1% 4%\n\n\n56%\n\n55%\n\n\n96%\n\n93%\n\n\n1%\n\n\n2%\n\n\n5%\n\n\n40%\n\n38%\n\n\n1% 5% 40% 53% 93% 2% 9% 43% 46% 89%\n\n\n2016 (n=2912)\n2015 (n=2432) Strongly Disagree Disagree Agree Strongly Agree % Agree + Strongly Agree\n2014 (n=1738)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**81**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Constraints\n\n Figure 75 Biggest Obstacles to Security\n\n2015 (n=2432) 2016 (n=2912)\n\n\n###### Figure 76 Number of Security Vendors and Products Used by Organizations\n\n\n2%\n\n\n﻿35%\n\n\nBudget Constraints\n\nCompatibility Issues\n\nCertification Requirements\n\nLack of Trained Personnel\n\nCompeting Priorities\n\nCurrent Workload Too Heavy\n\nLack of Knowledge\n\nReluctance to Purchase Until\nThey’re Proven\n\nOrganizational Culture/Attitude\n\nOrganization Is Not a High-Value\nTarget for Attacks\n\nSecurity Is Not an Executive\nLevel Priority\n\n\n39% 35%\n\n32% 28%\n\n\n﻿1-5 Products\n\n6-10 Products\n\n11-25 Products\n\n26-50 Products\n\n51-100 Products\n\nMore Than 100 Products\n\n\n29%\n\n\n25%\n\n\n21%\n\n\n22%\n\n\n11%\n\n\n24%\n\n24%\n\n\n23%\n\n22%\n\n22%\n\n22%\n\n18%\n\n\n25%\n\n25%\n\n24%\n\n\n4%\n\n\n2016 (n=2860)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 78 Number of Security Products Used by Size of Organization\n\n\n23%\n\n22%\n\n23%\n\nN/A\n\nN/A\n\n\n17%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 77 Number of Security Vendors Used by Size of Organization\n\n\n**How Many Different**\n**Security Products Are in**\n**Your Security Environment?**\n\n1-5\n\n\n**How Many Different**\n**Security Vendors (i.e., Brands,**\n**Manufacturers) Are in Your**\n**Security Environment?**\n\n1-5\n\n\nMidmarket\n250-1K\nEmployees\n\n46.9%\n\n\nMidmarket\n250-1K\nEmployees\n\n37.9%\n\n\nEnterprise\n1K–10K\nEmployees\n\n\n32.7% 25.1%\n\n\nLarge\nEnterprise\n10k+\nEmployees\n\n\nEnterprise\n1K–10K\nEmployees\n\n\n43.4% 39.9%\n\n\nLarge\nEnterprise\n10k+\nEmployees\n\n\n6-10 28.4% 30.9% 21.3%\n\n11-20 17.6% 15.8% 23.1%\n\n21-50 5.6% 7.1% 8.7%\n\nMore Than 50 1.4% 2.8% 6.9%\n\n**Total Organizations** **1435** **1082** **333**\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**82**\n\n\n6-10 29.0% 30.1% 22.5%\n\n11-25 19.8% 20.4% 23.7%\n\n26-50 9.6% 10.5% 15.6%\n\n51-100 3.0% 4.3% 7.8%\n\nMore Than 100 0.8% 1.9% 5.4%\n\n**Total Organizations** **1442** **1084** **334**\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 79 Year-over-Year Decrease of Security Budget Coming Within IT Budget\n\n**Is the Security Budget Part of the IT Budget? (IT Department Members)** 2014 (n=1673) 2015 (n=2374) 2016 (n=2828)\n\n\n58%\n\n33%\n\n9%\n\n\nAll Within IT\n\nPartially Within IT\n\nCompletely Separate\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n61%\n\n33%\n\n6%\n\n\n55%\n\n36%\n\n9%\n\n\n###### Figure 80 Year-over-Year Decrease of Security Spend as a Proportion of the IT Budget\n\n**IT Budget Spend on Security as a Function** 2014 (n=1673) 2015 (n=2374) 2016 (n=2828)\n\n\n0%\n\n1-5%\n\n6-10%\n\n11-15%\n\n16-25%\n\n26%-50%\n\n51% or More\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**83**\n\n\n**Appendix**\n\n\n10%\n\n\n7%\n\n4%\n\n12%\n\n23%\n\n29%\n\n\n9%\n\n\n3%\n\n\n4%\n\n16%\n\n27%\n\n26%\n\n15%\n\n\n21%\n\n\n5%\n\n\n11%\n\n23%\n\n31%\n\n19%\n\n4%\n\n\n2%\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Impacts\n\n Figure 81 Percentages of Organization's  Opportunities Lost as a Result of Attacks\n\n\n###### Figure 82 Percentages of Organization's Revenue Lost as a Result of Attacks\n\n\n1%\n\n\n20%\n\n10%\n\n4%\n\n3%\n\n1%\n\n\n﻿None (0%)\n\nSome, but Less Than 20%\n\n20% to Just Under 40%\n\n40% to Just Under 60%\n\n60% to Just Under 80%\n\n80% to Just Under 100%\n\nAll (100%)\n\n\n1%\n\n\n25%\n\n9%\n\n5%\n\n3%\n\n0%\n\n\n58%\n\n\n﻿None (0%)\n\nSome, but Less Than 20%\n\n20% to Just Under 40%\n\n40% to Just Under 60%\n\n60% to Just Under 80%\n\n80% to Just Under 100%\n\nAll (100%)\n\n\n62%\n\n\nRespondents From Organizations Who\nLost Opportunities in Past Year (n=625)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 83 Percentages of Organization's Customers Lost as a Result of Attacks\n\n\nRespondents From Organizations Who\nLost Revenue in Past Year (n=778)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Appendix**\n\n\n﻿None (0%)\n\nSome, but Less Than 20%\n\n20% to Just Under 40%\n\n40% to Just Under 60%\n\n60% to Just Under 80%\n\n80% to Just Under 100%\n\nAll (100%)\n\n\n1%\n\n\n21%\n\n8%\n\n6%\n\n4%\n\n1%\n\n\n60%\n\n\nRespondents From Organizations Who\nLost Customers in Past Year (n=641)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**84**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Outcomes\n\n Figure 84 Percentages of Organizations Relying on Outsourcing\n\n\n**Which Security**\n**Services Are**\n**Outsourced?**\n\nAdvice and\nConsulting\n\nAudit\n\nIncident Response\n\nMonitoring\n\nThreat Intelligence\n\nRemediation\n\nNone/All Internal\n\n\n2014 2015 2016 **Why Are These**\n(n=1738) (n=2432) (n=2912) **Services Outsourced?**\n\n\n2016\n(n=2631)\n\n52%\n\n48%\n\n46%\n\n\n33%\n\n**Appendix**\n\n\nMore Cost-Efficient\n\nDesire for Unbiased Insight\n\nMore Timely Response\nto Incidents\n\nLack of Internal Expertise\n\nLack of Internal Resources\n\n\n51%\n\n41%\n\n35%\n\n42%\n\nN/A\n\n34%\n\n21%\n\n\n52%\n\n47%\n\n42%\n\n44%\n\n39%\n\n36%\n\n12%\n\n\n51%\n\n46%\n\n45%\n\n45%\n\n41%\n\n\n2015\n(n=2129)\n\n53%\n\n49%\n\n46%\n\n31%\n\n31%\n\n\n33%\n\n\n35%\n\n10%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 85 Percentages of Organization's Security Reliant Upon Third-Party Vendors\n\n\n﻿None (0%)\n\nSome, but Less Than 20%\n\n20% to Just Under 40%\n\n40% to Just Under 60%\n\n60% to Just Under 80%\n\n80% to Just Under 100%\n\nAll (100%)\n\n\n1%\n\n\n4%\n\n\n18%\n\n\n41%\n\n\n21%\n\n\n10%\n\n\n4%\n\n\nIT Security Personnel\n(n=2595)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**85**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 86 Percentages of Security Services Outsourced by Size of Organization\n\n**Which Security Services Are Outsourced?** Midmarket (n=1459) Enterprise (n=1102) Large Enterprise (n=351)\n\n\n52%\n\n47%\n\n43%\n\n41%\n\n44%\n\n34%\n\n11%\n\n\nAdvice and Consulting\n\nAudit\n\nMonitoring\n\nThreat Intelligence\n\nIncident Response\n\nRemediation\n\nNone/All Internal\n\n\n50%\n\n44%\n\n46%\n\n41%\n\n48%\n\n35%\n\n\n51%\n\n\n50%\n\n44%\n\n40%\n\n39%\n\n\n8%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 87 Sources of Increased Scrutiny\n\n\n2016 (n=2912)\nGraphic Rounded to\nNearest Whole Number\n\n\nNot at All Not Very Somewhat Very\nScrutinizing Scrutinizing Scrutinizing Scrutinizing\n\n\nExtremely\nScrutinizing\n\n\n37%\n\n11%\n\n30%\n\n32%\n\n28%\n\n29%\n\n26%\n\n27%\n\n28%\n\n26%\n\n21%\n\n% Very + Extremely\nScrutinizing\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**86**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 88 Increase of Off-Premises Private Cloud and Third-Party Managed On-Premises Hosting\n\n**Where Networks Are Hosted** 2014 (n=1727) 2015 (n=2417) 2016 (n=2887)\n\n\n51%\n\n48%\n\n24%\n\n20%\n\n10%\n\n\nOn-Premises as Part of a Private Cloud\n\nOn-Premises\n\nOn-Premises but Managed by an External Third-Party\n\nOff-Premises Private Cloud\n\nOff-Premises Public Cloud\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n50%\n\n54%\n\n23%\n\n18%\n\n8%\n\n\n50%\n\n46%\n\n27%\n\n25%\n\n9%\n\n\n###### Operations, Policies, Procedures, and Capabilities\n\n Figure 89 Proportion of Companies with a Security Executive\n\n\n53%\n52%\n\n53%\n\n\n**Is There an Executive at Your Organization Who Has**\n**Direct Responsibility and Accountability for Security?**\nRespondents Who Reported Clarified Roles and Responsibilities\n\nNo Yes\n\n\n**Executive’s Title**\nRespondents Who Reported Executive with Security Responsibility\n\n﻿Chief Security Officer\n(CSO)\n\n\n2016\n(n=2754)\n\n2015\n(n=2288)\n\n2014\n(n=1603)\n\n\n8%\n\n\n92%\n\n\n14%\n\n15%\n\n16%\n\n10%\n\n11%\n10%\n\n8%\n\n11%\n7%\n\n8%\n\n8%\n\n9%\n\n4%\n\nN/A\nN/A\n\n3%\n2%\n\n4%\n\n1%\n1%\n1%\n\n\n8%\n\n\n92%\n\n\n9%\n\n\n91%\n\n\nChief Information Officer\n(CIO)\n\nChief Executive Officer\n(CEO) or equivalent\n\nSenior Vice President (SVP) or\nVice President (VP) of IT\n\nChief Technology Officer\n(CTO)\n\nChief Risk and Compliance Officer\n(CRO) or (CCO)\n\nChief Operating Officer\n(COO)\n\nAnother Title\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**87**\n\n\n2016 (n=2530) 2015 (n=2095) 2014 (n=1465)\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 90 Percentages of Companies That Have a Formal Organization-Wide Security Strategy and  Follow Standardized Security Policy Practices\n\n**Security Standards** **Standardized Security Policy Practice**\n\n\n﻿Have a Written Formal Organization-Wide\nSecurity Strategy That's Reviewed Regularly\n\nFollow a Standardized Information\nSecurity Policy Practice such as\nISO 27001\n\nFormally Define Critical Business\nAssets That Require Special Consideration\nfor Risk Management That Are Either\nBusiness-Critical or Regulated to Have\nIncreased Protection\n\n\n62%\n\n66%\n59%\n\n55%\n52%\n52%\n\n43%\n38%\n\n54%\n\n\nCurrently in\nProcess of\nBecoming\nCertified\n\n\nPreparing for\nCertification\nProcess\n\n\nFollow Health-Care Focused Standardized 2% 2016 (n=1596) 65%\nSecurity Policies such as NIST 800‒66, N/A\nISO27799, ISO80001 N/A\n\n\nAlready\nCertified\n\n\nNone of the Above\n\n\n1%\n1%\n1%\n\n\n2016 (n=2912) 2015 (n=2432) 2014 (n=1738)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 91 Percentages of Respondents Who Strongly Agree with Security Process Statements\n\n\nEmployees at My Organization Are\nEncouraged to Report Failures and\nProblems with Security\n\n\nSecurity Processes and Procedures\nat My Organization Are Clear and\nWell-Understood\n\n\nLine-of-Business Managers Are\nEncouraged to Contribute to Security\nPolicies and Procedures\n\n\n**52%**\n\n55%\n\n\n**55%**\n\n57%\n\n\n1%\n\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n\n**95%**\n\n94%\n\n\n**96%**\n\n95%\n\n\n**1%** **4%**\n\n\n**96%**\n\n\n**1%** **4%**\n\n\n**58%**\n\n62%\n\n\n95%\n\n\n**<1%** **4%**\n\n\n5%\n\n\n**43%**\n\n40%\n\n\n4%\n\n\n**40%**\n\n39%\n\n\n1%\n\n\n4%\n\n\n**38%**\n\n33%\n\n\n1%\n\n\n3% 5% 32% 61% 92% 3% 6% 36% 56% 91% 3% 5% 39% 53% 92%\n\n\nSecurity Processes at My Organization\nEnable Us to Anticipate and Mitigate\nPotential Security Issues Proactively\n\n\nSecurity Processes at My Organization\nAre Measured and Controlled Using\nQuantitative Data\n\n\nMy Organization Has Optimized Its\nSecurity Processes and Is Now\nFocused on Process Improvement\n\n\n**52%**\n\n53%\n\n\n**50%**\n\n53%\n\n\n1%\n\n\n**95%**\n\n95%\n\n\n**95%**\n\n95%\n\n\n**1%** **4%**\n\n\n**1%** **4%**\n\n\n95%\n\n\n**1%** **4%**\n\n\n**53%**\n\n53%\n\n\n**96%**\n\n\n4%\n\n\n**43%**\n\n42%\n\n\n4%\n\n\n**45%**\n\n42%\n\n\n1%\n\n\n4%\n\n\n**43%**\n\n43%\n\n\n1%\n\n\n3% 7% 38% 53% 91% 3% 6% 37% 54% 91% 3% 5% 39% 53% 92%\n\n\nMy Organization Is Able to Detect\nSecurity Weaknesses Before They\nBecome Full-Blown Incidents\n\n\nLine-of-Business Managers Get Security\nPolicy Group Involved Before Making a\nLine-of-Business Application Decision\n\n\n**1%** **4%**\n\n\n95%\n\n91%\n\n\n**1%** **5%** **45%** **49%** **94%** 51% **94%**\n\nN/A\n\nN/A\n\n\n**49%**\n\n51%\n\n49%\n\n\n**96%**\n\n\n1%\n\n3%\n\n\n4%\n\n6%\n\n\n**46%**\n\n45%\n\n41%\n\n\n2016 (n=2912)\n2015 (n=2432)\n2014 (n=1738)\n\n\nStrongly Disagree Disagree Agree Strongly Agree % Agree + Strongly Agree\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**88**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 92 Percentages of Respondents Who Strongly Agree with Security Process Statements\n\n\nAccess Rights to Networks, Systems,\nApplications, Functions and Data Are\nAppropriately Controlled\n\n\nTechnical Security Controls in Systems\nand Networks Are Well Managed\n\n\nComputer Facilities Within My\nOrganization Are Well Protected\n\n\n**55%**\n\n56%\n\n\n**56%**\n\n57%\n\n\n1%\n\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n\n**96%**\n\n96%\n\n\n**96%**\n\n96%\n\n\n**<1%** **3%**\n\n\n**<1%** **4%**\n\n\n**55%**\n\n59%\n\n\n**97%**\n\n97%\n\n\n**<1%** **4%**\n\n\n4%\n\n\n**41%**\n\n40%\n\n\n4%\n\n\n**40%**\n\n38%\n\n\n1%\n\n\n3%\n\n\n**41%**\n\n38%\n\n\n0%\n\n\n2% 4% 33% 61% 94% 2% 3% 35% 60% 95% 2% 4% 36% 57% 94%\n\n\nWe Regularly Review Our Security\nPractices and Tools to Ensure That They\nAre Up to Date and Effective\n\n\nWe Do a Good Job of Building Security\ninto Systems and Applications\n\n\nWe Do a Good Job of Building Security\ninto Our Procedures for Acquiring,\nDeveloping, and Maintaining Systems\n\n\n**52%**\n\n56%\n\n\n**53%**\n\n54%\n\n\n1%\n\n\n**96%**\n\n96%\n\n\n**96%**\n\n96%\n\n\n**<1%** **4%**\n\n\n**<1%** **4%**\n\n\n**96%**\n\n97%\n\n\n**<1%** **4%**\n\n\n**56%**\n\n60%\n\n\n3%\n\n\n**43%**\n\n41%\n\n\n4%\n\n\n**43%**\n\n42%\n\n\n1%\n\n\n3%\n\n\n**40%**\n\n37%\n\n\n1%\n\n\n2% 5% 35% 59% 93% 2% 5% 35% 58% 93% 2% 4% 38% 56% 94%\n\n\nInformation Assets Are Inventoried\nand Clearly Classified\n\n\nWe Do an Excellent Job of Managing\nHR Security\n\n\nWe Do a Good Job Building Security\ninto External, Customer-Facing\nMobile Apps\n\n\n**<1%** **4%**\n\n\n**95%**\n\n95%\n\n\n**1%** **5%** **45%** **49%** **94%** **1%** **6%** **43%** **51%** **94%**\n\n\n**51%**\n\n53%\n\n\n5%\n\n\n51%\n\n\n44%\n\n\n94%\n\n\n1%\n\n\n5%\n\n\n**44%**\n\n42%\n\n\n1%\n\n\nN/A\n\nN/A\n\n\n2% 6% 39% 54% 93% 2% 5% 40% 53% 93%\n\n\n2016 (n=2912)\n2015 (n=2432)\n2014 (n=1738)\n\n\nStrongly Disagree Disagree Agree Strongly Agree % Agree + Strongly Agree\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**89**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 93 Percentages of Respondents Who Strongly Agree with Security Controls Statements\n\n\nWe Have Well-Documented Processes\nand Procedures for Incident Response\nand Tracking\n\n\nWe Have Good Systems for Verifying\nThat Security Incidents Actually Occurred\n\n\nWe Do a Good Job of Notifying and\nCollaborating with Stakeholders About\nSecurity Incidents\n\n\n**52%**\n\n53%\n\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n\n**53%**\n\n54%\n\n\n1%\n\n\n**95%**\n\n95%\n\n\n**95%**\n\n95%\n\n\n**<1%** **4%**\n\n\n**1%** **5%**\n\n\n**53%**\n\n54%\n\n\n**95%**\n\n96%\n\n\n**<1%** **4%**\n\n\n4%\n\n\n**43%**\n\n42%\n\n\n5%\n\n\n**42%**\n\n41%\n\n\n1%\n\n\n4%\n\n\n**42%**\n\n42%\n\n\n1%\n\n\n2% 5% 37% 56% 94% 1% 6% 38% 54% 93% 2% 5% 43% 51% 94%\n\n\nWe Follow a Standardized Incident\nResponse Practice Such as RFC2350,\nISO/IEC 27035:2011 or US Cert\n\n**6%** **44%** **50%** **93%**\n\n6% 44% 49% 93%\n\n8% 41% 49% 90%\n\n51% **94%**\n\n\nWe Have a Good System for Categorizing\nIncident-Related Information\n\n**4%** **44%** **51%** **96%**\n\n4% 43% 53% 96%\n\n5% 40% 54% 93%\n\nWe Have a Good Crisis Management\nResponse Protocol\n\n\nWe Have Effective Processes for\nInterpreting and Prioritizing Incoming\nIncident Reports and Understanding Them\n\n\n**<1%** **5%** **44%** **51%** **95%**\n\nN/A\n\nN/A\n\n\n2016 (n=2912)\n2015 (n=2432) Strongly Disagree Disagree Agree Strongly Agree % Agree + Strongly Agree\n2014 (n=1738)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 94 Management and Efficacy of Security Technologies\n\n\n**What Are the Most Effective Security**\n**Technologies Used by the Organization?**\n2016 (n=2895)\n\n28%\n\n14%\n\n14%\n\n17%\n\n\nFirewall\n\nDDoS Defense\n\nData Loss Prevention\n\nEncryption/Privacy/Data Protection\n\nEndpoint Protection/Antivirus, Anti-Malware\n\nMobility Security\n\nSecure DNS\n\nEmail/Messaging Security\n\nAccess Control/Authorization\n\nIntrusion Prevention\n\n\n**What Are the Most Time-Consuming and Most**\n**Difficult Security Technologies for Staff to Manage?**\n(Mentions over 10%) 2016 (n=2895)\n\n20%\n\n16%\n\n16%\n\n15%\n\n\n12%\n\n12%\n\n12%\n\n11%\n\n11%\n\n11%\n\n\n15%\n\n10%\n\n13%\n\n12%\n\n14%\n\n10%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**90**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 95 Year-over-Year Use of Security Threat Defense\n\n\n**Security Threat**\n**Defenses Used**\n**by Organization**\n\n\n**Defenses**\n**Tthrough**\n**Cloud-Based**\n**Services***\n\n\n**Defenses**\n**Tthrough**\n**Cloud-Based**\n**Services***\n\n20%\n\n24%\n\n28%\n\n18%\n\n21%\n\n26%\n\nN/A\nN/A\nN/A\n\nN/A\nN/A\nN/A\n\n15%\n\n21%\n\n25%\n\nN/A\nN/A\nN/A\n\nN/A\nN/A\nN/A\n\n12%\n\n17%\n\n20%\n\nN/A\nN/A\nN/A\n\n\n58% 34%\n\n﻿Firewall** 65% 31% ﻿Mobility Security\n\nN/A N/A\n\n\nN/A\nN/A\nN/A\n\nN/A\nN/A\nN/A\n\n\n**Security Threat**\n**Defenses Used**\n**by Organization**\n\n35%\n\n44%\n\n51%\n\n32%\n\n40%\n\n48%\n\n32%\n31%\n\n42%\n\n32%\n\n38%\n\n43%\n\n32%\n\n41%\n\n48%\n\n30%\n\n32%\n\n39%\n\n29%\n\nN/A\nN/A\n\n27%\n\n34%\n\n38%\n\n26%\n26%\n\n31%\n\n\n1% 8%\n1% 11%\n1% 13%\n\n\nData Loss Prevention\n\nEncryption/Privacy/\n\nData Protection\n\nSecure DNS\n\nEmail/Messaging Security\n\nWeb Security\n\nEndpoint Protection/\n\nAnti-Malware\n\nAccess Control/\n\nAuthorization\n\nDDoS Defense\n\nSecured Wireless\n\nIdentity Administration/\n\nUser Provisioning\n\nIntrusion Prevention**\n\n\n42% 22%\n\nN/A N/A\nN/A N/A\n\n42% 27%\n\n52% 34%\n\n56% 37%\n\n41% 25%\n\n51% 31%\n\n59% 37%\n\n41% 24%\n\n49% 25%\n49% 25%\n\n40% N/A\n\n48% N/A\n\n53% N/A\n\n38% N/A\n37% N/A\n36% N/A\n\n37% 19%\n\n41% 19%\n\n50% 26%\n\n35% N/A\n\n45% N/A\n\n45% N/A\n\n35% 17%\n\n44% 20%\n\nN/A N/A\n\n\n45%\n\n56%\n55%\n\n44%\n\n53%\n53%\n\n\nVPN\n\nNetwork Forensics\n\nSecurity Information and\nEvent Management (SIEM)\n\nVulnerability Scanning\n\nPatching and\nConfiguration\n\nMulti-Factor\nAuthentication\n\nPenetration Testing\n\nEndpoint Forensics\n\nAuthentication\n\nNetwork Security,\n\nFirewalls and\nIntrusion Prevention**\n\nNone of the Above\n\n\nN/A N/A\n\n53% N/A\n52% N/A\n\nN/A N/A\nN/A N/A\n\n60% 35%\n\n\n2016 (n=2912)\n2015 (n=2432)\n2014 (n=1738)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**91**\n\n\n2016 (n=2725)\n2015 (n=2268)\n2014 (n=1646)\n\n\n\n- Security Respondents Who Use Security Threat Defenses\n** Firewall and Intrusion Prevention Were One Code in 2014:\n“Network Security, Firewalls and Intrusion Prevention”\n\n\n**Appendix**\n\n\n2016 2015 2014\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 96 Extent That Customer Protection Factors into Security Decision-Making\n\n\n2016 (n=2878)\nGraphic Rounded to\nNearest Whole Number\n\n\nNot at All Not Very Much Somewhat Very Much Extremely % Very Much +\nExtremely\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Risks and Vulnerabilities\n\n Figure 97 IT Security Personnel's Biggest Sources of Concern Related to Cyber Attacks\n\n\n2016 (n=2912)\nGraphic Rounded to\nNearest Whole Number\n\n\nNot a Risk Slight Risk Moderate Risk High Risk % Moderate + High Risk\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**92**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 98 Security Professionals' Biggest Sources of Concern Related to Cyber Attacks\n\n\n2016 (n=2912)\nGraphic Rounded to\nNearest Whole Number\n\n\nNot at All Not Very Somewhat Very\nChallenging Challenging Challenging Challenging\n\n\nExtremely\nChallenging\n\n\n% Very + Extremely\nChallenging\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 99 Distribution of Security Teams' Efforts\n\nIT Security Personnel (n=2854) Endpoints Customer Data Servers\n\nWhere Does the Security Team Spend the Majority of Its Efforts? 23% 29% 47%\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**93**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Incident Response\n\n Figure 100 Percentages of Security Alerts That Are Investigated or Remediated\n\n 7% Have Not Experienceda Security Alert\n\n 93% Have Experienceda Security Alert\n\n 56% Of Seen AlertsAre Investigated\n\n 28% Of Investigated AlertsAre Legitimate\n\n 46% Of Legitimate AlertsAre Remediated\n\n2016 (n=2796)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 101 Average Time to Detect Security Breaches\n\n2016 (n=2860)\n\n\n**Average Alerts Seen By**\n**Organization on a Daily Basis**\n\n\nLess Than 5K\n\n5K–10K\n\n10K–50K\n\n50K–100K\n\n100K–150K\n\nOver 150K\n\n\n###### 50%\n\n 15%\n\n 11%\n\n 8%\n\n 6%\n\n 4%\n\n**Appendix**\n\n\n8 Hours or Less\n\n9-24 Hours\n\n25-48 Hours\n\nMore Than 2 Days but Less Than 1 Week\n\n1-2 Weeks\n\n3 Weeks to a Month\n\n1 Month to 3 Months\n\nMore Than 3 Months, but Less Than 1 Year\n\n1 Year or More\n\n\n5%\n\n3%\n\n1%\n\n1%\n\n0%\n\n\n43%\n\n25%\n\n15%\n\n\n7%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**94**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 102 Groups Notified in the Event of an Incident\n\n\n﻿Office of the CEO\n\nor President\n\nOperations\n\nFinance Department\n\nTechnology Partners\n\nHuman Resources\n\n\n46% 30% 22%\n45% Legal 32% Marketing 26%\nN/A 36% 31%\n\n40% 29% 21%\n40% Engineering 33% Business Partners 21%\n\n46% 38% 32%\n\n37% 25% 15%\n\n40% All Employees 27% Insurance Companies 15%\n\nN/A 35% N/A\n\n\n36%\n34%\n\n31%\n\n33%\n\n36%\n\n\n25%\n\n28%\n\n33%\n\n23%\n\n24%\n\n28%\n\n\nExternal Authorities\n\n\n15%\n\n18%\n\n22%\n\n\n45%\n\n\nManufacturing\n\nPublic Relations\n\n\n2016 (n=2912) 2015 (n=2432) 2014 (n=1738)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 103 KPIs Used by Organizations to Assess  Security Performance\n\n2016 (n=2912)\n\n\nTime to Detect (e.g., Time Threat Entered\nEnvironment to Detection)\n\nTime to Patch (e.g., Time from Patch\nRelease to Implementation)\n\nTime to Contain (e.g., Time from Detection\nto Containment/Quarantine)\n\nTime to Remediate (e.g., Time from\nQuarantine to Operational)\n\nNone of the Above\n\n\n3%\n\n\n59%\n\n52%\n\n44%\n\n\n30%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**95**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 104 Year-over-Year Use of Process to Analyze Compromised Systems\n\n**Processes to Analyze Compromised Systems** 2014 (n=1738) 2015 (n=2432) 2016 (n=2912)\n\n\n57%\n\n53%\n\n49%\n\n48%\n\n47%\n\n38%\n\n35%\n\n36%\n\n37%\n\n34%\n\n33%\n\n1%\n\n\nFirewall Log\n\nSystem Log Analysis\n\nNetwork Flow Analysis\n\nMalware or File Regression Analysis\n\nRegistry Analysis\n\nFull Packet Capture Analysis\n\nIOC Detection\n\nDisk Forensics\n\nCorrelated Event/Log Analysis\n\nMemory Forensics\n\nExternal Incident Response/Analysis Teams\n\nNone of the Above\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n61%\n\n59%\n\n53%\n\n55%\n\n50%\n\n47%\n\n38%\n\n40%\n\n42%\n\n41%\n\n37%\n\n2%\n\n\n56%\n\n50%\n\n49%\n\n47%\n\n43%\n\n40%\n\n38%\n\n36%\n\n35%\n\n34%\n\n34%\n\n1%\n\n\n###### Figure 105 Year-over-Year Use of Process to Eliminate the Cause of Security Incidents\n\n**Processes to Eliminate Cause of Security Incidents** 2014 (n=1738) 2015 (n=2432) 2016 (n=2912)\n\n\n55%\n\n55%\n\n53%\n\n48%\n\n47%\n\n47%\n\n40%\n\n41%\n\n1%\n\n\nQuarantine or Remove Malicious Application\n\nRoot Cause Analysis\n\nStop Communication of Malicious Software\n\nAdditional Monitoring\n\nPolicy Updates\n\nStop Communication of Compromised Application\n\nLong-Term Fix Development\n\nRe-image System to Previous State\n\nNone of the Above\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**96**\n\n\n58%\n\n55%\n\n53%\n\n52%\n\n51%\n\n48%\n\n47%\n\n45%\n\n2%\n\n\n**Appendix**\n\n\n52%\n\n51%\n\n48%\n\n48%\n\n45%\n\n43%\n\n41%\n\n39%\n\n1%\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 106 Year-over-Year Use of Process to Restore Affected Systems\n\n**Processes to Restore Affected Systems** 2014 (n=1738) 2015 (n=2432) 2016 (n=2912)\n\n\nImplementing Additional or New Detections and Controls Based on\nIdentified Weaknesses Post Incident\n\nRestoring from a Pre-Incident Backup\n\nPatching and Updating Applications Deemed Vulnerable\n\nDifferential Restoration (Removing Changes Caused by an Incident)\n\nGold Image Restoration\n\nNone of the Above\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n60%\n\n57%\n\n60%\n\n56%\n\n35%\n\n2%\n\n\n56%\n\n59%\n\n55%\n\n51%\n\n35%\n\n1%\n\n\n56%\n\n55%\n\n53%\n\n50%\n\n34%\n\n1%\n\n\n###### Figure 107 Attack Simulations: Frequency and Extent of Driving Security Defense Improvements\n\n\n**How Often Does Your Organization Run Attack Simulations?**\n\n2016 (n=2868)\n\n\n**To What Extent Do the Results of Attack Simulations Drive**\n**Improvements in Your Security Defense Policies, Procedures,**\n**or Security Technologies?**\n\n\n2016 (n=2736)\n﻿Never 4%\n\nWeekly ﻿28%\n\n\n###### 47% 44%\n\n\nMonthly\n\nQuarterly\n\nSemi-Annually\n\nAnnually\n\nRegularly, but Less\n\nThan Once a Year\n\n\n###### 1%\n\n3% ﻿0%\n\n1 2 3 4 5\n\nNot at All A Great Extent\n\n\n﻿28%\n\n33%\n\n21%\n\n8%\n\n4% 8%\n\n###### 1%\n\n3% ﻿0%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 108 Importance of Attributing Origin of a Security Breach\n\n\nIT Security Personnel (n=2901)\nGraphic Rounded to\nNearest Whole Number\n\n\nNot at All Not Very Somewhat Very\nImportant Important Important Important\n\n\nExtremely\nImportant\n\n\n% Very + Extremely\nImportant\n\n**Appendix**\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**97**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Breaches and Their Impacts\n\n Figure 109 Percentage of Organizations Experience a Public Breach\n\n 53% 48% 49%\n\n\n###### Figure 110 How Much Did the Breach Drive  Improvements in Your Security Threat Defense  Policies, Procedures, or Technologies?\n\n 52% 38%\n\n\n###### ﻿0%\n\n\n###### 9% 1%\n\n\n2014\n(n=1701)\n\n\n2015\n(n=2347)\n\n\n2016\n(n=2824)\n\n\nNot at All A Great Extent\n\nRespondents Affected By a Security Breach (n=1388)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n1 2 3\n\n\n4 5\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n###### Figure 111 Length and Extent of Outages Caused by Security Breaches\n\n\n**Length of System Outages Due to Breach**\n\n2016 (n=2665)\n\n\n**Percentage of Systems Impacted Due to Breach**\n\n2016 (n=2463)\n\n\n﻿0 Hours, No Outage ﻿7% ﻿0% ﻿1%\n\n\n19%\n\n\nLess Than 1 Hour\n\n1‒4 Hours\n\n5‒8 Hours\n\n9‒16 Hours\n\n17‒24 Hours\n\nMore Than 24 Hours\n\n\n13%\n\n\n25%\n\n\n1‒10%\n\n11‒20%\n\n21‒30%\n\n31‒40%\n\n41‒50%\n\n51‒60%\n\n61% or More\n\n\n22%\n\n\n20%\n\n\n20%\n\n\n15%\n\n\n15%\n\n\n11%\n\n\n10%\n\n\n9%\n\n\n6%\n\n\n9%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**98**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 112 Improvements Made to Protect Your Company from Security Breaches\n\n﻿37% 38% 43% 38% 38% 37% 42% 37% 40% 37%\n\n\nSeparated Security\n\nTeam from\nIT Department\n\n\nIncreased Security\nAwareness Training\n\nAmong Employees\n\n\nIncreased Focus\non Risk Analysis\nand Risk Mitigation\n\n\nIncreased Investment\n\nin Security Defense\nTechnologies or Solutions\n\n\nIncreased Investment\n\nin Training of\n\nSecurity Staff\n\n**Appendix**\n\n\n2015 (n=1109) 2016 (n=1375)\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**99**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Vendor Choice and Expectations\n\n Figure 113 Importance of Data Protection and Privacy for Vendors\n\n\n**What Data Protection and Privacy Processes and Policies**\n**Are Most Important for a Vendor to Have?**\n\n2016 (n=2912)\n\n\n**What Data Protection, Privacy Standards and Certifications**\n**Are Required for a Vendor to Work with Your Organization?**\n\n2016 (n=2870)\n\n\n﻿Organization-Wide Policies\n\n35% ﻿ISO 27001\n\non Data Access Controls\n\n\n39%\n\n\nData Incident\nResponse Program\n\nOrganization-Wide Policies\n\non Breach Notifications\n\nOrganization-Wide Policies on\nAccess to Data Held by Vendor\n\nMandatory and Continuous\n\nEmployee Training\n\nOrganization-Level\n\nPrivacy of Design\n\nAssess Data Risk and\nOrganizational Maturity\n\nPolicies on Sharing Data\nResidency and Data Sovereignty\n\nActive Dialogue With Board of\nDirectors Regarding Data Risk\n\nData Retention Policies\n\nProactive Measurement and\nMonitoring/Audit Compliance\n\n\n17%\n\n\n33%\n\n\nISO 27018\n\nNIST Cybersecurity\nFramework/Standards\n\nPrivacy Shield\n\nService Organizational\nControls (SOC) Compliance\n\nTRUSTe Compliance\n\nGAPP (Generally\nAccepted Privacy Principles)\n\nHIPAA Compliance\n\n﻿EU Model Clauses\n\nPCI-DSS Compliance\n\nBinding Corporate Rules\n\nAPEC Cross Border\n\nPrivacy Rules\n\nFedRAMP\n\nFISMA\n\n\n34%\n\n\n31%\n\n\n28%\n\n\n27%\n\n\n28%\n\n\n27%\n\n\n28%\n\n\n26%\n\n\n26%\n\n\n25%\n\n\n26%\n\n\n24%\n\n\n25%\n\n\n22%\n\n\n25%\n\n\n13%\n\n\n23%\n\n\n9%\n\n\n23%\n\n\n18%\n\n\n18%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**100**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Security Capability Maturity Model\n\n Figure 114 Security Maturity by Country\n\nUSA Brazil Germany Italy\n\n\n**25%** **29%** **41%**\n\n22% 27% 45%\n\n16% 27% 44%\n\nUnited Kingdom\n\n**38%** **29%** **28%**\n\n32% 22% 32%\n\n18% 25% 41%\n\nJapan\n\n**32%** **26%** **35%**\n\n34% 16% 32%\n\n\n**4%**\n\n9%\n\n5%\n\n**5%**\n\n5%\n\n16%\n\n**4%**\n\n14%\n\n\n**21%** **26%** **47%**\n\n20% 16% 50%\n\n\n**25%** **30%** **41%**\n\n24% 26% 40%\n\n35% 24% 34%\n\n\n**7%**\n\n12%\n\n4%\n\n\n**31%** **28%** **34%**\n\n24% 24% 39%\n\n25% 27% 43%\n\n\n**5%**\n\n7%\n\n23%\n\n\n**36%** **31%** **28%**\n\n36% 23% 34%\n\n25%13% 38%\n\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n2015\n\n2014\n\n**2016**\n\n\n**4%**\n\n4%\n\n10%\n\n**5%**\n\n14%\n\n16%\n\n**7%**\n\n16%\n\n\nAustralia China India\n\n\n**5%**\n\n4%\n\n10%\n\n\n**31%** **34%** **31%**\n\n\n**35%** **21%** **31%**\n\n37% 25% 32%\n\n29% 32% 36%\n\n\n**17%** **31%** **47%**\n\n21% 34% 40%\n\n16% 20% 54%\n\n\n29% 36%\n\n\n29%\n\n\n**13%**\n\n6%\n\n3%\n\n\n35% 19% 30%\n\n\nMexico Russia France\n\n\n**4%**\n\n14%\n\n\n**30%** **27%** **39%**\n\n27% 26% 32%\n\n\n**6%**\n\n15%\n\n\n**35%** **26%** **32%**\n\n35% 20% 29%\n\n\n22% 40% 14% 24% N/A N/A N/A\n\nCanada\n\n\n**7%**\n\n\n**36%** **23%** **33%**\n\n\nLow Lower-Middle Upper-Mid High\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n###### Figure 115 Maturity Model Ranks Organizations Based on Security Process\n\n5-Segment Based\n\nOn Q9 Series\n\n\n###### Figure 116 Segment Sizing for Maturity Model\n\n\n36%\n\n36%\n\n\n39%\n\n\nUpper–\n\nMiddle\n\n\nMiddle\n\n\nUpper–\n\nMiddle\n\n\nMiddle\n\n\nLower–\n\nMiddle\n\n\n1%\n\nLow 2%\n\n4%\n\n2016 (n=2852) 2015 (n=2401) 2014 (n=1637)\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**Appendix**\n\n\nHigh\n\n\n**Level 5**\n\n**Level 4**\n\n**Level 3**\n\n**Level 2**\n\n**Level 1**\n\n\n###### Optimizing\nFocus Is on Process Improvement\n\n###### Quantitatively Managed\nProcesses Quantitatively Measured\nand Controlled\n\n###### Defined\nProcesses Characterized for the Organization;\nOften Proactive\n\n###### Repeatable\nProcesses Characterized for Projects;\nOften Reactive\n\n###### Initial\nProcesses Are Ad Hoc; Unpredictable\n\n\n28%\n\n\n25%\n\n\nHigh\n\n\n23%\n\n\n30%\n\n\n28%\n\n\n26%\n\n\n6%\n\n\n9%\n\n\n8%\n\n\nLow\n\n\nLow\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**101**\n\n\nLower–\n\nMiddle\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Industry-Specific\n\n Figure 117 Percentage of Healthcare Businesses That Have Implemented Standardized Security Policies\n\n**Implemented Standardized Security Policies**\nHealthcare Business Follows Healthcare-Specific Information\nSecurity Policy Practice, 2016 (n=65)\n\n\n**Which Resources Are Used to**\n**Measure Companies Against HIPAA**\n**Privacy Rules and Security?**\n\nHIT Security Guidance\n\nCurrent HIPAA Document\n(Currently Omnibus)\n\nHHS.OCR Audit Frameworks\n\nHITRUST or Other Private Framework\n\nThird-Party Assessments\n\n\n###### Figure 118 Resources Healthcare Companies Use to Measure Themselves Against HIPAA Privacy Rules\n\n\n24%\n\n\nHealthcare Businesses\n2016 (n=219)\n\n\nISO80001 (Medical Device)\n\nISO27799\n\nNIST 800-66\n\n\n74%\n\n60%\n\n45%\n\n\n40%\n\n\n52%\n\n\n52%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n\n37%\n\n\nNone of the Above 6%\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 119 Most Common Security Measures Among the Healthcare Businesses with Medical Device Networks\n\n\n**Does Your Organization Have a Medical Device Network That Is**\n**Converged with a Main Hospital Network?**\n\nNo, There Is Not a\nMedical Device\nNetwork in Our\nOrganization\n\nNo, the Medical 6%\nDevice Network(s)\nIs/Are Isolated 15%\nand Managed\nInternally\n\nHealthcare\nBusinesses\n\n16% (n=219)\n\nNo, the 63%\nYes\nMedical Device\nNetwork(s) Is/Are\nStandalone and\nManaged by\na Vendor\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**102**\n\n\n**Which of These Security Measures, if Any, Has Your Company**\n**Implemented to Protect and Secure Your Medical Device Network?**\nCompanies with a Medical Device Network in Their Organization (n=207)\n\n\n**Appendix**\n\n\nNetwork Access Control\n\nAdvanced Malware Protection/Detection\n\nMulti-Factor Device Authentication\n\nIPS/IDS, Deep Packet Inspection\n\nAutomated Threat Defense/Response\n\nTraffic Analysis/\nAnomaly Detection\n\nPosture Assessments and/or Device Profiling\n\nSegmentation/\nMicro Segmentation\n\n\n59%\n\n56%\n\n49%\n\n48%\n\n48%\n\n45%\n\n40%\n\n32%\n\n\nNone of the Above 1%\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 120 Sample Profile for Telecommunications\n\n**Which Telecommunications Subsector Is**\n**Your Organization Primarily Involved In?**\nTelecommunications Businesses (n=307)\n\n\n**Which of These Services Does Your**\n**Company Offer to Your Customers?**\nTelecommunications Businesses (n=308)\n\n\nCommunications Equipment\n\nService Provider (Traditional)\n\nCable/Satellite Operator\n\nMedia/Broadcasting\n\nOver-the-Top Provider (Netflix, Hulu, Etc.)\n\n\nManaged Security Services\n47%\nProvided to End Customers\n\n\n2%\n\n\n71%\n\n60%\n\n59%\n\n57%\n\n\n33%\n\n11%\n\n\nCore Production Networks, such as\nIP (Including Television), Mobile, etc.\n\nEnterprise Environment\n\nDatacenters\n\n\n7%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 121 Security Strategies Factors for Telecommunications\n\n**Relative Priority to Security Strategies and Protocols**\nTelecommunications Businesses (n=308)\n\n\nAverage Percentage\n\nof Availability\n\n\nAverage Percentage\n\nAverage Percentage\nof Confidentiality\n\nof Integrity\n\n\n#### 34% 36% 31%\n\n\n**Availability: Assuring**\nReliable Access to Data\n\n\n**Confidentiality: Assuring That Data**\nIs Only Accessed by Appropriate Parties\n\n\n**Integrity: Assuring That Data**\n\nIs Precise and Accurate\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 122 Security Priorities for Telecommunications\n\n**Rank in Terms of Priority to Security in Organization** Telecommunications Businesses (n=308)\n\n\nSecuring the Data Centers\n\nIn the Core Production Network That Delivers Highly\nAvailable IP and/or Mobile Services\n\nProviding Managed Security Services\n\nThe Enterprise Network and Internal Data\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**103**\n\n\n34% 21% 24% 22%\n\n26% 21% 29% 24%\n\n21% 30% 19% 30%\n\n20% 28% 29% 24%\n\nRanked 1st Ranked 2nd Ranked 3rd Ranked 4th\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 123 Sample Profile for Transportation\n\n**Does Your Company Utilize a** **Does Your Company Participate In Security**\n**Security Operations Center (SOC)?** **Standards Bodies or Industry Organizations?**\n\n\nNo, But There Are Plans\nto Implement a Security\nOperations Center in the\nNext Year\n\n###### 14%\n\nNo, and\nThere Are No 11%\nImmediate\nPlans to\nImplement a\nSecurity\nOperations\nCenter\n\n**Which Transportation Subsector Is Your**\n**Organization Primarily Involved In?**\nTransportation Businesses (n=180)\n\nFreight and Logistics\n\nMass Transit\n\nRail\n\nRoadways\n\nAviation\n\nMaritime\n\nVehicles\n\n\n5%\n\n5%\n\n\nYes\n\n\nNo\n\n###### 12%\n\nTransportation\n\nBusinesses\n\n(n=179)\n\n**Which of the Following Security Areas**\n**Do You Have Responsibility In?**\nTransportation Businesses (n=180)\n\n\nYes\n\n\n54% Operational Technology Security\n\n\n84%\n\n71%\n\n43%\n\n\n11%\n\n9%\n\n9%\n\n\nCritical Infrastructure Security\n\nVehicle Security\n\n\n7%\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**104**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 124 Sample Profile for Utilities/Energy\n\n\n**When These Drills or Exercises Are**\n**Performed, Which Parties Are Involved?**\n\nSecurity Partners\n\n\n**Which Utilities/Energy Subsector Is**\n**Your Organization Primarily Involved In?**\n\nOil and Gas\n\n###### 42%\n\nUtilities/Energy\n\nBusinesses\n\n(n=116) 58%\n\nElectric Utilities\n\n\n**How Often Does Your Organization Conduct**\n**a Drill or Exercise to Test Your Company’s**\n**Response Plan to a Cybersecurity Incident?**\n\n\n84%\n\n\nOnce Every 6 Months\n\nOnce a Year\n\nOnce Every 2 Years\n\nRarely\n\nNever\n\n\n6%\n\n2%\n\n0%\n\n\n31%\n\n\n55%\n\n\n1%\n\n\n37%\n\n\n69%\n\n\n64%\n\n\n33%\n\n\nUtilities/Energy Businesses (n=116)\n\n\nInternal Non-Security\nPersonnel\n\nBusiness Partners\n\nFirst Responders\n\nLocal or State Agencies\n\nFederal Agencies\n\nOther Utility Providers\n\nNone of the Above\n\n\n26%\n\n\n20%\n\n\nUtilities/Energy Businesses (n=116)\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n###### Figure 125 Sample Profile for Financial Services\n\n**Which Financial Services Subsector Is** **How Much Do You Think Security Is Being**\n**Your Organization Primarily Involved In?** **Influenced by the Following Trends?**\n\n\nFinancial Services Businesses (n=509)\nGraphic Rounded to\nNearest Whole Number\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**105**\n\n\n**Appendix**\n\n\nNot at All A Great Extent % Top 2\nChoices\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 126 Data Security for Retail\n\n**To What Extent Do You Agree or Disagree**\n**With Each of These Statements?**\n\n\nRetail Businesses (n=290)\nGraphic Rounded to\nNearest Whole Number\n\n\nStrongly Somewhat Somewhat\nDisagree Disagree Agree\n\n\nStrongly\nAgree\n\n\n% Somewhat +\nStrongly Agree\n\n\nSource: Cisco 2017 Security Capabilities Benchmark Study\n\n**106**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Malware Families\n\n\n###### Figure 127 File Extension and MIME Combinations for Dridex (Web and Email Vectors)\n\n**Unique Vectors**\n\n\n###### Figure 128 Hash Ages for the Dridex Malware Family and Percent of Total Hash Volume Observed Per Month\n\n100%\n\n\n﻿exe & application/msdos-program\n\ndocm & application/vnd.ms-word...\ndocm & application/vnd.openxml...\nxls & application/vnd.ms-excel\ndoc & application/msword\n\nexe & application/msdownload\ndoc & text/plain\n\npxls & application/vnd.ms-excel\npdf & application/msword\nzip & application/zip\nzip & application/zip\ndoc & appl/text\n\ndoc & application/vnd.msword\ndoc & application/winword\ndoc & application/word\n\ndoc & application/x-msw6\ndoc & application/doc\n\ndoc & application/vnd.ms-word\ndoc & application/x-msword\n\nno extension & application/msword\nno extension & text/plain\njs & text/plain\n\nrtf & application/vnd.openxml...\nno extension & application/rtf\n\nno extension & application/vnd...\nexe & application/executable\n\ndoc & application/vnd.openxml...\ndoc & application/xml\nrtf & application/xml\nrtf & text/plain\n\nrtf & application/msword\n\npdf & application/vnd.openxml...\ndot & application/vnd.openxml...\n\nSource: Cisco Security Research\n\n\n80%\n\n60%\n\n\n40%\n\n20%\n\n\n0%\n\n1%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n<24 Hours 1–2 Days 3–10 Days\n\n11–30 Days 31–90 Days 90+ Days\n\n\n0.5%\n\n0%\n\n\nEmail Web\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n###### Figure 129 TTD for the Dridex Malware Family\n\n20.4\n\n\n20\n\n15\n\n10\n\n5\n\n0\n\n\n16.9\n\n\n10.2\n\n\n7.2\n5.5\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\n**107**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 130 File Extension and MIME Combinations for the Family of Threats and Indicators That Lead to and Include the Cerber Payload (Web and Email Vectors)\n\n\n###### Figure 132 Hash Ages for the Cerber Malware  Family and Percent of Total Hash Volume Observed Per Month\n\n100%\n\n\n**Unique Vectors**\n\nzip & application/zip\n\n\n﻿doc & application/msword\n\n﻿vbs & text/plain\n\n﻿rtf & application/vnd.openxml...\n\ndotm & application/vnd.open...\n\n﻿exe & application/msdownload\n\n﻿js & text/plain\n\n﻿ no extension & application/zip\n\nhtml & application/zip\n\njpg & image/jpeg\n﻿rtf & application/msword\n\nSource: Cisco Security Research\n\n\n80%\n\n60%\n\n\n40%\n\n20%\n\n\nEmail Web\n\n\n###### Figure 131  TTD for the Cerber Malware Family\n\n160\n\n120\n\n\n0%\n\n0.2%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n<24 Hours 1–2 Days 3–10 Days\n\n11–30 Days 31–90 Days 90+ Days\n\n\n80\n\n40\n\n0\n\n\n116.1\n26.2\n\n\n0.1%\n\n0%\n\n\n5.1 5.9\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\nSource: Cisco Security Research\n\n\nJan Feb Mar Apr May Jun Jul Aug Sep Oct\n2016\n\nSource: Cisco Security Research\n\n\n###### Figure 133 Hash Ages for the Locky Malware Family Per Month\n\n100%\n\n\n###### Figure 134 Hash Ages for the Nemucod Malware  Family Per Month\n\n100%\n\n\n80%\n\n60%\n\n\n80%\n\n60%\n\n\n40%\n\n20%\n\n\n40%\n\n20%\n\n\n0%\n\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\n<24 Hours 1–2 Days 3–10 Days\n\n11–30 Days 31–90 Days 90+ Days\n\nSource: Cisco Security Research\n\n\n<24 Hours 1–2 Days 3–10 Days\n\n11–30 Days 31–90 Days 90+ Days\n\nSource: Cisco Security Research\n\n\n**108**\n\n\n**Appendix**\n\n\n-----\n\n**Cisco 2017 Annual Cybersecurity Report**\n\n###### Figure 135 Hash Ages for the Adwind RAT  Figure 136 Hash Ages for the Kryptik Malware  Malware Family Per Month Family Per Month\n\n\n100%\n\n80%\n\n\n100%\n\n80%\n\n\n60%\n\n40%\n\n\n60%\n\n40%\n\n\n20%\n\n0%\n\n\n20%\n\n0%\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\nNov Dec Jan Feb Mar Apr May Jun Jul Aug Sep Oct\n2015 2016\n\n\n<24 Hours 1–2 Days 3–10 Days\n\n11–30 Days 31–90 Days 90+ Days\n\nSource: Cisco Security Research\n\n\n<24 Hours 1–2 Days 3–10 Days\n\n11–30 Days 31–90 Days 90+ Days\n\nSource: Cisco Security Research\n\n\n**109**\n\n\n**Appendix**\n\n\n-----\n\n**Americas Headquarters**\nCisco Systems, Inc.\nSan Jose, CA\n\n\n**Asia Pacific Headquarters**\nCisco Systems (USA) Pte. Ltd.\nSingapore\n\n\n**Europe Headquarters**\nCisco Systems International BV Amsterdam,\nThe Netherlands\n\n\n[Cisco has more than 200 offices worldwide. Addresses, phone numbers, and fax numbers are listed on the Cisco Website at www.cisco.com/go/offices.](http://www.cisco.com/cisco/web/siteassets/contacts/index.html)\n\nPublished January 2017\n\n© 2017 Cisco and/or its affiliates. All rights reserved.\n\nCisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. To view a list of Cisco trademarks,\ngo to this URL: [www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does](http://www.cisco.com/go/trademarks)\nnot imply a partnership relationship between Cisco and any other company. (1110R)\n\nAdobe, Acrobat, and Flash are either registered trademarks or trademarks of Adobe Systems Incorporated in the United States and/or other countries.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Cisco - Annual Cybersecurity Report - 2017.pdf"
    ],
    "report_names": [
        "Cisco - Annual Cybersecurity Report - 2017.pdf"
    ],
    "threat_actors": [
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535855,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1486098182,
    "ts_modification_date": 1486105218,
    "files": {
        "pdf": "https://archive.orkl.eu/820cf1b2a8d83f1072c15490b12336b057fcfe37.pdf",
        "text": "https://archive.orkl.eu/820cf1b2a8d83f1072c15490b12336b057fcfe37.txt",
        "img": "https://archive.orkl.eu/820cf1b2a8d83f1072c15490b12336b057fcfe37.jpg"
    }
}