{
    "id": "25758dcb-8770-462a-ac24-d509c988b4ba",
    "created_at": "2023-01-12T15:08:19.971054Z",
    "updated_at": "2025-03-27T02:05:29.12328Z",
    "deleted_at": null,
    "sha1_hash": "d4f7178e75e06b03d08a58f71583c595e8f743cc",
    "title": "2021-11-29 - Campaign Abusing Legitimate Remote Administrator Tools Uses Fake Cryptocurrency Websites",
    "authors": "",
    "file_creation_date": "2022-05-28T02:43:17Z",
    "file_modification_date": "2022-05-28T02:43:17Z",
    "file_size": 1594599,
    "plain_text": "# Campaign Abusing Legitimate Remote Administrator Tools Uses Fake Cryptocurrency Websites\n\n**[trendmicro.com/en_us/research/21/k/campaign-abusing-rats-uses-fake-websites.html](https://www.trendmicro.com/en_us/research/21/k/campaign-abusing-rats-uses-fake-websites.html)**\n\nNovember 29, 2021\n\nMalware\n\nWe have been tracking a campaign involving the SpyAgent malware that abuses well-known\nremote access tools (RATs) for some time now. While previous versions of the malware have\nbeen covered by other researchers, our blog entry focuses on the malicious actor’s latest\nattacks.\n\nBy: Jaromir Horejsi November 29, 2021 Read time: ( words)\n\n## Introduction\n\nWe have been tracking a campaign involving the SpyAgent malware that abuses well-known\nremote access tools (RATs) — namely TeamViewer — for some time now. While previous\n[versions of the malware have been covered by other researchers, our blog entry focuses on the](https://bbs.inhe365.com/thread-18649-1-1.html)\nmalicious actor’s latest attacks.\n\nWe’ve observed a new cryptocurrency related campaign that abuses a legitimate Russian RAT\nknown as [Safib Assistant via a newer version of the malware called SpyAgent. This involves the](https://www.safib.ru/assistant)\nexploit of a DLL sideloading vulnerability, which causes a malicious DLL to load. This DLL hooks\nand patches various API functions called by the RAT. This results in the RAT windows being\nhidden from a user.\n\nThe malicious DLL then begins reporting the RAT’s ID, which the malware operator needs to\nconnect to and control the infected machine. The malware sets the access password to a fixed\none, so that merely knowing the RAT’s ID is enough for the attacker to successfully connect to\nthe infected machine.\n\n## Infection vector\n\nThe malware dropper of SpyAgent is distributed via fake cryptocurrency-related websites that\nare usually in the Russian language. The dropper poses as a fake cryptocurrency wallet, miner,\nor surfing plug-in. Figures 1 to 4 are some examples of these fake websites.\n\n\n-----\n\n-----\n\nFigure 1. Fake cryptocurrency wallets in Russian\n\n\n-----\n\nFigure 2. Fake cryptocurrency miners in Russian\n\nFigure 3: Fake surfing plug-in to earn dogecoin\n\n\n-----\n\nFigure 4. Fake surfing plug-ins to earn bitcoin\nWhen a user visits one of these websites, a file-downloading dialog box (offering to download a\nSpyAgent dropper) usually appears immediately, after which the victim is prompted to save and\nrun the executable file.\n\nHow a victim winds up on these fake websites varies. One kind of social engineering technique\nthat we observed involves advertisements published on “earn cryptocurrency for browsing”\nwebsites, such as the ad in Figure 5. It should be noted that not all websites offering\ncryptocurrency in exchange for views are necessarily malicious. In the following screenshot,\nhowever, the screenshot shows a malicious website that promotes a fake cryptocurrency-related\nwebsite.\n\nFigure 5. Malicious advertisement leading to the malicious website\nAfter opening the link, the victim is immediately redirected to one of the fake cryptocurrency\nwebsites where a dialog box for saving the fake application immediately appears.\n\n\n-----\n\nFigure 6. Website with a fake bitcoin bot\nSocial media is also used as an infection vector, as shown in the tweet in Figure 7. Interestingly,\nthe Twitter account behind it seems to be legitimate, although possibly compromised.\n\nFigure 7. User\n\nspreading a link to a fake website via Twitter\nDue to search engine optimization (SEO), simply searching for the right keywords might result in\nthe inclusion of these websites in search results.\n\nFigure 8. Search engine returning the link to a fake “Doge Miner” website\n\n## Dropper analysis\n\n\n-----\n\nThe dropper is usually created using the Nullsoft Scriptable Install System (NSIS) installer\n(although in the past we have seen variants created with Inno Setup), a powerful tool for creating\n[scriptable program installers. The dropper (NSIS installer) file contains just one randomly named](https://nsis.sourceforge.io/Simple_tutorials)\nencrypted binary file.\n\nFigure 9. Installer with one randomly named\n\nbinary file\nThe NSIS installer script then calls Microsoft CryptoAPIs to decrypt the binary file, which then\nbecomes a 7-Zip archive that will extract the files. Figure 10 shows a string (tno7wul0zusmglmdl)\nused for deriving the decryption key on line 578.\n\nFigure 10. Code showing a password to derive\n\nthe RC4 decryption key used to decrypt random binary files\n[This string is then hashed with MD5 algorithm (see constant 0x00008003).](https://docs.microsoft.com/en-us/windows/win32/seccrypto/alg-id)\n\nFigure 11.\n\nMD5 hashing of the password\n\nFigure 12. Deriving RC4 key\nThe [dwFlags parameter (see value 0x280011) tells us the length of the key modulus in bits,](https://docs.microsoft.com/en-us/windows/win32/api/wincrypt/nf-wincrypt-cryptderivekey)\nwhich is set with the upper 16 bits (0x28 / 8 = 40 / 8 = 5 bytes ). Lower 16 bits are flags\nCRYPT_EXPORTABLE and CRYPT_NO_SALT.\n\nTherefore, the first five bytes of the MD5 of the string for key derivation is the RC4 key used to\ndecrypt the 7-Zip archive.\n\nFigure 13. Documentation explaining the computation of the length of the key\nThe extracted 7-Zip archive contains several files, most of which are legitimate non-malicious\nfiles belonging to the RAT. In Figure 14, only those files in red indicate the additions by malware\ndevelopers.\n\nThe batch file (.bat) is a starter of the main executable (Assistant, ast.exe) file, while the Config\nfile (.cfg) contains encrypted configuration. The bitmap file (.bmp) is used for deriving the key to\ndecrypt the config file Finally the quartz dll is the malicious DLL containing the malware that is\n\n\n-----\n\nsideloaded by ast.exe. Although the real length of the quartz DLL is several dozens of kilobytes,\nits length is artificially inflated by appending a huge overlay of zeroes. This is likely to prevent or\ndiscourage some security solutions from uploading these large files for further analysis.\n\nFigure 14. Contents of the 7-Zip archive with the RAT. The\n\nfiles in red are the ones added by the malware developer.\n\n## Analysis of the sideloaded DLL\n\nThe DLL is responsible for decrypting the config file. Initially, the first byte of the config file is\nchecked. If its value is 0x01, it means that the malware runs for the first time and the config file is\nencrypted with a key derived from the bitmap file.\n\nOtherwise, if the value of the first byte in the config file is 0x00, it means that the config file is\nencrypted with a key derived from the SOFTWARE\\Microsoft\\Cryptography\\MachineGuid value.\n\nThe key derivation has four steps:\n\n1) The CRC32 checksum of the input (.bmp file) is computed.\n\n2) The checksum is converted to a hexadecimal string (eight characters), and all characters are\nconverted to uppercase.\n\n3) The MD5 hash is computed.\n\n4) The hexadecimal string representation of the hash (32 characters) is used as the RC4\npassword to decrypt the config file.\n\n\n-----\n\nAfter decryption, the configuration file contains the URL address of the command-and-control\n(C&C) server. From this URL address, the domain part is used as a key for another decryption —\nthis time the decryption of part of the DLL’s executable code, since a part of the DLL is a selfmodifying code.\n\nFigure 15. Function call to the encrypted code before decryption (top) and after decryption\n(bottom)\nThe first decrypted function is responsible for resolving the API function addresses, while the\nsecond decrypted function is responsible for hooking various functions and altering the default\nbehavior of the RAT.\n\nThe following table shows the important hooked functions and their effects on the RAT:\n\nFunction Details\n\nRegCreateKeyEx Changes the registry using the RAT configuration from \\ast\\SS to\n**\\ast\\SS1**\n\nRegSetValueKeyEx Extracts the RAT’s ID when it is saved to the registry. It then starts two\nthreads, a C&C communication thread and an idleness monitoring\nthread.\n\nFindWindow Ensures that the RAT’s window is not shown\n\nRegisterClass Ensures that the RAT’s window is not shown\n\nShowWindow Disables showing the RAT’s windows\n\nCreateFile Disables the log file that the RAT creates by default\n\n\n-----\n\nGetCommandLine Sets command-line parameters to start the RAT as a hidden process in\nthe background, sets the connection password stored in registry to a\nknown fixed password, and starts a thread responsible for killing task\nmanager and process explorer\n\nTable 1. The important hook functions of the decrypted function\n\nWhen the RAT is run normally and is not hijacked by malware, a window like the screenshot\nshown in Figure 17 will appear. It is important to note the nine-digit number (captured by the\nhook of RegSetValueKeyEx) and the four-digit number (overridden by the registry setting set by\nthe hook of GetCommandLine). This window is not shown at all as an effect of hooking\nFindWindow, RegisterClass, and ShowWindow.\n\nFigure 16. The RAT’s\n\nwindow when it is run normally. The nine-digit number is the ID and the four-digit number is the\npassword.\nFinally, we will analyze the two threads. The C&C communication thread regularly makes a GET\nrequest to <C&C domain>/<C&C path>?id=<9digit number>&stat=<environment hash>. The\nenvironment hash is computed as an MD5 hash of string created by concatenating the following\n\n\n-----\n\nfive values:\n\nValue 1 =\nto_uppercase(crc32(HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography\\MachineGuid))\nValue 2 = to_uppercase(crc32(HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\n_NT\\CurrentVersion\\ProductName))_\nValue 3 = to_uppercase(crc32(user name))\nValue 4 = to_uppercase(crc32(computer name))\nValue 5 = concatenate Value1 Value2 Value3 Value4\n\nIt might receive a response in the following format:\n\n!lexec;<url to download>\nrestart\ndelproc\n\nThe idleness monitoring thread monitors pressed keys and selecting or dragging movements. If\nthe user is idle for more than one minute, it sends a sidl(start idle) request with the time when the\nuser became idle:\n\n<C&C domain>/<C&C path>?id=<9digit number>&stat=<environment hash>&sidl=<time>\n\nThe length of idleness is then regularly submitted in a cidl (count of idle) parameter:\n\n<C&C domain>/<C&C path>?id=<9digit number>&stat=<environment hash>&cidl=<number\nof seconds>\n\nWhen the user becomes active again, the malware sends an eidl (end of idle) request:\n\n<C&C domain>/<C&C path>?id=<9digit number>&stat=<environment hash>&eidl=\n<time>&cidl=<number of seconds>\n\nThe idleness monitoring thread allows the malware operator to choose the proper time when the\nvictim is not present in order to stay unnoticed.\n\n## Associated malware\n\nSpyAgent usually downloads other malware to perform additional tasks such as stealing\nimportant data.\n\nWe noticed using SpyAgent downloading the following commodity stealers:\n\nRedLine Stealer\nDucky stealer\nAZOrult\nCypress Stealer\nClipper (a clipboard replacer that replaces various cryptocurrency addresses with those\ncontrolled by the malicious actor)\n\n\n-----\n\nWe also noticed other RATS being used in the campaign, such as:\n\nRemcos RAT\nNanoCore\nnjRAT\nAsyncRAT\n\n## Conclusion\n\nThe threat actor behind this malware seems to have a straightforward financial motivation and\ntypically aims to steal credentials and cryptocurrency wallets while also replacing cryptocurrency\naddresses shared via clipboard.\n\nFortunately, defending oneself against these attacks is also straightforward. Given the malicious\nactor’s use of [traditional social engineering techniques such as fake websites, malicious](https://www.trendmicro.com/vinfo/us/security/definition/social-engineering)\nadvertisements, and spurious social media posts, users should practice due diligence and avoid\nselecting any suspicious links or visiting dubious websites. We also encourage users to perform\nsecurity best practices such as bookmarking trusted sites and practicing caution when visiting\nnew websites, especially those that are prone to being abused for social engineering attacks.\n\n## Indicators of Compromise (IOCs)\n\n[The IOCs used in this analysis can be found here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/21/k/campaign-abusing-legitimate-remote-administrator-tools-uses-fake-cryptocurrency-websites/ioc-campaign-abusing-legitimate-remote-administrator-tools-uses-fake%20-cyptocurrency-websites.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-29 - Campaign Abusing Legitimate Remote Administrator Tools Uses Fake Cryptocurrency Websites.pdf"
    ],
    "report_names": [
        "2021-11-29 - Campaign Abusing Legitimate Remote Administrator Tools Uses Fake Cryptocurrency Websites.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536099,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653705797,
    "ts_modification_date": 1653705797,
    "files": {
        "pdf": "https://archive.orkl.eu/d4f7178e75e06b03d08a58f71583c595e8f743cc.pdf",
        "text": "https://archive.orkl.eu/d4f7178e75e06b03d08a58f71583c595e8f743cc.txt",
        "img": "https://archive.orkl.eu/d4f7178e75e06b03d08a58f71583c595e8f743cc.jpg"
    }
}