{
    "id": "257dd890-8b27-46bc-aaa4-d3fac030b22d",
    "created_at": "2023-01-12T15:02:20.080854Z",
    "updated_at": "2025-03-27T02:06:15.035065Z",
    "deleted_at": null,
    "sha1_hash": "baa0a972bd46bbc8e3d5c8bf616210c858ba2f32",
    "title": "2020-06-21 - Investigating Threats in HP Sure Controller 4.2- TVRAT",
    "authors": "",
    "file_creation_date": "2022-05-28T02:44:09Z",
    "file_modification_date": "2022-05-28T02:44:09Z",
    "file_size": 3883215,
    "plain_text": "# Recent Posts\n\n**threatresearch.ext.hp.com/investigating-threats-in-hp-sure-controller-4-2/**\n\n[HP Threat Research Blog • Investigating Threats in HP Sure Controller 4.2: TVRAT](https://threatresearch.ext.hp.com/blog/)\n\n## Investigating Threats in HP Sure Controller 4.2: TVRAT\n\n\nJune 21, 2020\n\n\n[HP Sure Click Enterprise captures a wealth of information about threats at the time of execution. HP Sure Controller is a management](https://www8.hp.com/us/en/solutions/sure-click-enterprise.html)\ninterface that is designed to help security analysts to quickly understand the nature of threats isolated by HP Sure Click Enterprise. In this\nblog post, we describe a typical investigation workflow, highlighting some of the useful features and views built into HP Sure Controller that\nenable security teams to investigate threats efficiently.\n\n**Background**\n\nThe attack was an attempted intrusion against a financial organisation in January 2020 that was stopped by HP Sure Click Enterprise. The\ndelivery method of the downloader, a malicious Microsoft Word document, was notable because the attacker disguised it as a resume and\nthen uploaded it to a legitimate job portal website. It was subsequently downloaded and opened by a member of the target organisation’s\n[human resources department, bypassing email gateway and web proxy security controls. Ultimately, the downloader delivered TVRAT (also](https://www.cyber.nj.gov/threat-center/threat-profiles/trojan-variants/spy-agent)\nknown as Spy-Agent), a remote access Trojan that is capable of remotely controlling an infected PC, transferring files and accessing the\nvictim’s microphone and webcam.\n\n**Threat Table**\n\nThe threat table view lists alerts generated by HP Sure Click Enterprise. To prioritise which activity to investigate, you can apply filters to the\ntable by clicking on the ‘Add Filter’ button. You can also create and apply labels to alerts to organise them. Figure 1 shows a filter applied for\nalerts containing high severity events that HP Sure Click Enterprise has classified as malicious (true positive) or unknown. Two alerts for\nmalicious Microsoft Word documents match this filter criteria.\n\n\n-----\n\nFigure 1 – The threat table view of alerts in HP Sure Controller.\n\n**Threat View – Summary Tab**\n\nClicking on one of the alerts opens the threat view ‘Summary’ tab, which gives an overview of information about the alert to enable an\ninvestigator to understand the threat quickly. The information about the alert shown on the ‘Summary’ tab includes:\n\nthe hostname of the endpoint\nthe user of the endpoint at the time of the activity\nthe names and hash values of resources that triggered the alert, e.g. filenames and URLs\nthe classification given by HP Sure Click Enterprise, i.e. True Positive, False Positive, Unknown\nthe time and duration of the activity, including if the alert was uploaded to Threat Cloud for additional analysis\n[MITRE ATT&CK techniques observed during the lifetime of the trace](https://attack.mitre.org/)\nfiles written to the filesystem during the lifetime of the micro-VM\nDNS events\na process interaction graph showing parent-child relationships between processes\ngeolocation and a summary of network activity\na log of recent activity that allows HP Sure Controller users to comment on the threat\n\nThe Summary tab also allows users to download the files that triggered the alert (.VMM file) and the micro-VM trace (.XEVTS and .DEVTS\nfiles) at the time of the activity, in case there is a need to analyse the threat using other tools.\n\n\n-----\n\nFigure 2 – The threat view of an alert in HP Sure Controller.\n\nThe severity of this alert is ‘High’ which indicates that suspicious behaviour commonly associated with malware occurred during the lifetime of\nthe micro-VM.\n\nIn the ‘Resources’ section (Figure 2) a URL and a file called ResumeGabriellaGrey.doc are listed. The URL indicates that the user visited the\nwebsite then downloaded and opened the file. To the left of the filename is a grey-coloured cloud icon which indicates that the file’s hash\nvalue is not currently recognised by Threat Cloud. However, a file called wpvnetwks.exe listed in the ‘Blacklistable Files’ section (Figure 2) is\nknown by Threat Cloud. It was marked as clean, as indicated by the green cloud icon. An unknown dynamic link library (DLL) was also\nwritten to the filesystem three times during the trace:\n\nmsi.dll\nKBuGDorsqg.dll\nX6IPAYFwa2HOpeVE3gLRKCMb[1].dll\n\n[Looking up the hash value of wpvnetwks.exe in a malware repository such as VirusTotal reveals that the file is a legitimate digitally-signed](https://www.virustotal.com/gui/home/upload)\nexecutable used by TeamViewer, a remote access tool. In the ‘DNS Events’ section (Figure 3) you can see that seven suspicious DNS\nqueries were made, including to domains associated with TeamViewer infrastructure.\n\n\n-----\n\nFigure 3 – Continued threat view of an alert in HP Sure Controller.\n\nThe process interaction graph shows the parent-child relationships between processes created in the micro-VM and is designed to enable\ninvestigators to identify suspicious process relationships visually. You can see that a Microsoft Word process, winword.exe, created two child\nprocesses, wpvnetwks.exe and regsvr32.exe. Given our suspicion that wpvnetwks.exe is a file related to TeamViewer, it is unlikely that\nMicrosoft Word would run this program legitimately. The other process created by Microsoft Word is also highly suspicious because\n[regsvr32.exe is a tool that can be used to run malicious DLLs (T1117). At this stage, it seems a reasonable hypothesis that regsvr32.exe was](https://attack.mitre.org/techniques/T1117/)\nused to run the DLL listed in the ‘Blacklistable Files’ section.\n\nDespite TeamViewer being a legitimate tool, the summary of the activity in this alert suggests that it was likely used for a malicious purpose.\nWe can inspect the micro-VM’s activity in granular detail using the other tab views to confirm this assessment.\n\n**Threat View – Graph Tab**\n\nThe Graph tab displays a timeline view of the events that occurred in the micro-VM, which enables investigators to trace through activity\nevent by event to understand it in more detail. Clicking on an event in the left-hand column highlights it on the timeline. High severity events\nare indicated by their pink-coloured background. The Graph view is often useful to understand the context of events, for example, by\n\n\n-----\n\nexamining the activity that occurred immediately before and after a high severity event.\n\nFigure 4 – Graph view of an alert in HP Sure Controller.\n\nIn Figure 4, you can see that a high-severity event was generated when winword.exe executed wpvnetwks.exe from\nC:\\Users\\bruser1729\\AppData\\Roaming\\Windows Media Player\\. Looking at the previous events reveals that winword.exe also launched\nregsvr32.exe, which in turn ran one of the copies of the unknown DLL, KBuGDorsqg.dll. One of the libraries that wpvnetwks.exe loads at\nruntime is msi.dll, a legitimate Microsoft DLL located in the System32 directory. However, the events after wpvnetwks.exe was executed\n[shows evidence of DLL side-loading (T1073). Another copy of the unknown DLL, msi.dll, was loaded into the process of wpvnetwks.exe](https://attack.mitre.org/techniques/T1073/)\ninstead of the legitimate msi.dll.\n\n**Threat View – Behavioural Tab**\n\nThe Behavioural tab displays micro-VM events in a chronological table and allows investigators to filter on events based on properties such\nas type, action, severity and name. For example, Figure 5 shows the Behavioural view that has been filtered to only show process execution\nand network events. You can see that approximately seven seconds before the high severity event, HP Sure Click Enterprise saw an HTTPS\nconnection to morteson[.]com (194.67.90[.]67). Afterwards, KBuGDorsqg.dll was written to the filesystem in two locations, which suggests\nthat the file was downloaded from morteson[.]com. The downloaded file was then run using regsvr32.exe and was shortly followed by a DNS\nquery to creatorz123[.]top (176.121.14[.]139), indicative of command and control (C2) check-in activity. Tracing through the events also\nshows network activity relating to teamviewer[.]com, which corroborates the hypothesis that wpvnetwks.exe is a TeamViewer binary.\n\n\n-----\n\nFigure 5 – Behavioural view in HP Sure Controller.\n\n**Threat View – Network Tab**\n\nThe Network view is a table that lists all network communications that the micro-VM made during its lifetime. Figure 6 shows that\napproximately 26 seconds after the triggering high severity event an HTTPS session was established to 123faster[.]top (176.121.14[.]139)\nover TCP port 443. The network activity shows that roughly every minute a CONNECT method request occurred to that domain, indicating\nthat this session is likely the C2 connection used by the threat actor.\n\n\n-----\n\nFigure 6 – Network view in HP Sure Controller.\n\n**Threat View – Metadata Tab**\n\nThe Metadata view gives information about the host that triggered the alert, such as its HP Sure Click Enterprise configuration policy and the\nversions of software running on the host. This information may be relevant to identify whether an exploit affects only certain versions of\nsoftware installed within micro-VMs.\n\nFigure 7 – Metadata view in HP Sure Controller.\n\n**Threat View – Files Tab**\n\n\n-----\n\nThe Files view is a table that lists all files that were created or modified during the lifetime of the micro VM. If Threat Cloud is enabled, the\nreputation of the files based on their hash values is checked against a database of known-good and known-bad files. Figure 8 shows that\nseveral known-good files related to TeamViewer were written to the user’s AppData directory in a subfolder named ‘Windows Media Player’.\n\nYou can optionally blacklist a file for a device, device group or all for devices by clicking on the grey-coloured flag icon to the right of the hash\nvalue.\n\nFigure 8 – Files view in HP Sure Controller.\n\n**Closing Thoughts**\n\nThe different views in HP Sure Controller make it possible to characterise each stage of the attempted infection and obtain indicators of\ncompromise (IOCs) such as the domains and IP addresses of the malware’s C2 channel. Based on the information captured by HP Sure\nClick Enterprise we can identify the malware as a variant of TVRAT. As you have seen from this example, the information presented in HP\nSure Controller enables security teams to efficiently investigate threats without having to re-run samples in sandboxes or resort to manual\nanalysis, saving time and effort.\n\n**Indicators of Compromise**\n\n**Indicator** **SHA-256 Hash** **Purpose**\n\nResumeGabriellaGrey.doc c6441cfa433596098ff1d3dc6995b90d5a63d32ae07ec9599c6a6f887b21170c Downloader\n\n\nC:\\Users\\\n\n[USER]\\AppData\\Roaming\\Windows Media\nPlayer\\wpvnetwks.exe\n\nC:\\Users\\\n\n[USER]\\AppData\\Roaming\\Windows Media\nPlayer\\msi.dll\n\nC:\\Users\\\n\n[USER]\\AppData\\Roaming\\KBuGDorsqg.dll\n\n\ncc82d628fde6549aab4f2d3d3ae3613367af945b20cc0944f937a5cacc4fecc2 Legitimate\nTeamViewer\nexecutable\n\nf5b7c4b30839021587e5bdb788c9ca3407a05005d0da5c1dfaa88a93939436bb TVRAT DLL\nside-loaded\ninto\nwpvnetwks.exe\n\nf5b7c4b30839021587e5bdb788c9ca3407a05005d0da5c1dfaa88a93939436bb TVRAT DLL\nrun using\nregsvr32.exe\n\n\nmorteson[.]com (194.67.90[.]67:443) Web server\nhosting TVRAT\nDLL\n\ncreatorz123[.]top (176.121.14[.]139:443) TVRAT C2\nserver\n\n123faster[.]top (176.121.14[.]139:443) TVRAT C2\nserver\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-21 - Investigating Threats in HP Sure Controller 4.2- TVRAT.pdf"
    ],
    "report_names": [
        "2020-06-21 - Investigating Threats in HP Sure Controller 4.2- TVRAT.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535740,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653705849,
    "ts_modification_date": 1653705849,
    "files": {
        "pdf": "https://archive.orkl.eu/baa0a972bd46bbc8e3d5c8bf616210c858ba2f32.pdf",
        "text": "https://archive.orkl.eu/baa0a972bd46bbc8e3d5c8bf616210c858ba2f32.txt",
        "img": "https://archive.orkl.eu/baa0a972bd46bbc8e3d5c8bf616210c858ba2f32.jpg"
    }
}