{
    "id": "26a89d22-1d2d-4b82-85cd-451e019b386a",
    "created_at": "2024-06-28T02:03:43.347708Z",
    "updated_at": "2025-03-27T02:17:14.576232Z",
    "deleted_at": null,
    "sha1_hash": "b4d343eb91e0322bbc47a70802803e89bfaf7379",
    "title": "Earth Lusca Uses Geopolitical Lure to Target Taiwan Before Elections | Trend Micro (US)",
    "authors": "",
    "file_creation_date": "2024-06-27T13:23:33Z",
    "file_modification_date": "2024-06-27T13:23:33Z",
    "file_size": 931499,
    "plain_text": "APT & Targeted Attacks\n\n# Earth Lusca Uses Geopolitical Lure to Target Taiwan Before Elections\n\nDuring our monitoring of Earth Lusca, we noticed a new campaign that used ChineseTaiwanese relations as a social engineering lure to infect selected targets.\n\nBy: Cedric Pernet, Jaromir Horejsi\n\nFebruary 26, 2024\n\nRead time: 7 min (1993 words)\n\n###  [] [Subscribe]\n\n##### Introduction\n\n Trend Micro previously published a number of entries discussing the\n\n operations of a China-linked threat actor we track as Earth Lusca. The\n\n group, which has been active since at least 2020 and has regularly changed\n\n its modus operandi, has been known to launch several different campaigns\n\n at the same time.\n\n During our monitoring of this threat actor, we noticed a new campaign that\n\n used Chinese-Taiwanese relations as a social engineering lure to infect\n\n selected targets. We attribute this campaign to Earth Lusca with high\n\n confidence based on the tools, techniques, and procedures (TTPs) we\n\n observed in previous research.\n\n\n-----\n\n##### document discussing Chinese-Taiwanese geopolitical issues. This file was\n\n created just two days before the Taiwanese national elections and the\n\n document seems to be a legitimate document stolen from a geopolitical\n\n expert from Taiwan.\n\n Note that a recent leak of private documents provides a new attribution\n\n path to a Chinese company called I-Soon. We discuss these connections in\n\n a separate section in this entry. There is significant overlap between the\n\n victims, malware used, and probable location of Earth Lusca and I-Soon.\n\n This suggests, at the very least, a significant connection between these\n\n groups. Our research is continuing at this time.\n\n Earth Lusca attack chain\n\nFigure 1. The infection chain used in the campaign `download`\n\n##### Initial access via spear phishing\n\n\n-----\n\n##### an archive (.7z) named China_s gray zone warfare against Taiwan.7z. Based\n\n on the threat actor’s previous activities, we suspect this file was sent to the\n\n targets via email, either embedded as an attachment or as a link.\n\n The archive consists of a folder named “China’s gray zone warfare against\n\n Taiwan” that contains two different Windows shortcut files (.LNK) and a\n\n subfolder named “__MACOS”.\n\nFigure 2. The content of the 7-Zip archive `download`\n\n##### The __MACOS subfolder name resembles the legitimate __MACOSX folder\n\n name created by macOS, which is hidden by default and is used to store\n\n each folder’s various settings. In the case we analyzed, the __MACOS folder\n\n does not contain any metadata but instead hides another stage of the\n\n malicious payload.\n\n The __MACOS subfolder contains two files named “_params.cat.js” and\n\n “_params2.cat.js”.\n\n All the files show metadata indicating that the files were last modified on\n\n Jan. 11, 2024.\n\n First stage: Shortcut (LNK) file with hidden target attribute\n\n The LNK files, once selected, executes the JavaScript code stored in the\n\n __MACOS folder.\n\n\n-----\n\n##### followed by space characters, as can be seen in Figures 3 and 4.\n\n```\ndownload\n\n```\n\nFigure 3. Beginning (top) and end (bottom) of the “target” property field (space characters are `download`\n\nin blue)\n\n##### The threat actor inserted 255 space characters in the “arguments” attribute\n\n before including the actual path to the malicious script to ensure that users\n\n don’t notice anything is amiss.\n\n Tools such as LNK parser reveal the entire content of the “arguments” field:\n\nFigure 4. 255 space characters were used before the actual argument value. `download`\n\n##### Second stage: Obfuscated JavaScript file\n\n The second stage is obfuscated with Dean Edward’s JavaScript Packer, a tool\n\n designed to obfuscate JavaScript code to hinder analysis and detections.\n\n\n-----\n\n##### Third stage: Deobfuscated JavaScript file and dropper\n\n The third stage drops a text file containing hexadecimal data to the\n\n %APPDATA%\\Roaming directory.\n\nFigure 6. The text string with “4d534346 = MSCF” marker is written to a temporary file. `download`\n\n##### This text file contains a magic signature, 4d534346, which is the Microsoft\n\n Cabinet File (MSCF) signature of a cabinet archive. The JavaScript then uses\n\n a living-off-the-land technique and calls a few LOLBins to decode a\n\n hexadecimal string to the binary file (certutil.exe) and unpack the cabinet\n\n archive (expand.exe).\n\nFigure 7. Content of cabinet archive `download`\n\n##### The extracted cabinet archive contains a decoy file, a signed legitimate\n\n executable file, and a malicious DLL library.\n\n In the cases we observed, we found the decoy files to be either Microsoft\n\n Word documents, Microsoft PowerPoint documents, or PDF documents.\n\n Although these were written by professionals involved in political relations\n\n between China and Taiwan, we could not find any of these documents\n\n\n-----\n\n##### these individuals and organizations and warned themabout the possible\n\n compromise of their systems.\n\n The signed legitimate executable file, 360se.exe from Qihoo 360, was\n\n renamed to pfexec.exe by Earth Lusca in a case of DLL hijacking. Once\n\n executed, it launches the DLL contained in the same folder (chrome_elf.dll).\n\n Fourth stage: Cobalt Strike stageless client (malicious obfuscated DLL library)\n\n The last stage of the infection chain is a stageless Cobalt Strike payload. The\n\n noteworthy parameters extracted from the embedded configuration are\n\n listed here:\n\n```\nC2Server             upserver.updateservice.store,/common.html\nHttpPostUri           - /r-arrow\nWatermark            - 100000000\n\n```\n\n##### Similar attacks\n\n During the monitoring of this campaign, we received more archives using\n\n similar structures and employing comparable tricks but having different file\n\n names, decoy names, and command-and-control (C&C) servers, among\n\n others.\n\n One such noteworthy file, another 7z archive file named “ppt-cih1w4.7z”,\n\n contained a folder named “Sino-Africa_relations” as seen in Figure 8:\n\n\n-----\n\n##### Business search\n\n\n##### The folder also contained an LNK file and a __MACOS folder with payload,\n\n this time timestamped Dec. 22, 2023.\n\n Similar to the previously analyzed archive, several stages lead to this last\n\n stage (namely Cobalt Strike), only with different configurations. The C&C\n\n server name abuses the name of the cybersecurity company Cybereason.\n\n The malleable profile is also different this time and uses different URLs,\n\n although the watermark remains the same.\n\n```\nC2Server             www.cybereason.xyz,/mobile-android\nHttpPostUri           - /RELEASE_NOTES\nWatermark            - 100000000\n\n```\n\n##### Attack started shortly before 2024\n\n As mentioned in the introduction, the campaign exposed in this report was\n\n likely active between December 2023 and January 2024, with the lure\n\n document created just two days before the Taiwanese national elections.\n\n The C&C domain used by Earth Lusca (updateservice[.]store) was registered\n\n anonymously on Dec. 12, 2023 and a subdomain was used for C&C\n\n communications (upserver.updateservice[.]store).\n\n Meanwhile, the other C&C domain used in this attack campaign\n\n (Cybereason[.]xyz) was registered anonymously on Oct. 27, 2023.\n\n\n-----\n\n##### We also found evidence that Earth Lusca targeted a Taiwan-based private\n\n academic think tank dedicated to the study of international political and\n\n economic situations.\n\n While we could not find other campaign targets at the time of writing, we\n\n suspect Earth Lusca might be planning to attack more politically related\n\n entities.\n\n The I-Soon lead\n\n A recent leak on GitHub exposed sizeable data on a Chinese company\n\n called I-Soon that has seemingly been active since 2016. The company\n\n describes itself on its website as an “APT Defense and Research Laboratory”\n\n and provides descriptions of its services: offensive and defensive security,\n\n antifraud solutions, blockchain forensics solutions, security products, and\n\n more. The group also notes several law enforcement and government\n\n entities with which it collaborates. As an interesting aside, I-Soon had been\n\n the recipient of a few rounds of fundings since 2017. One of its investors\n\n was the antivirus company Qihoo from China — which, as stated earlier,\n\n had an executable file abused for DLL hijacking.\n\n We found a few indicators in the I-Soon leak that made us believe that some\n\n of the Earth Lusca activities are similar to the contents of the leak:\n\n1. There is some victim overlap between Earth Lusca and I-Soon: Some of the names on\n\nthe victim lists of the I-Soon leak were also victims of Earth Lusca’s attacks.\n\n2. The malware and tools arsenal used by I-Soon and Earth Lusca has a few strong\n\n[overlaps. Malware such as ShadowPad, Winnti and a few other tools have been used](https://www.trendmicro.com/en_us/research/23/g/supply-chain-attack-targeting-pakistani-government-delivers-shad.html)\nextensively by Earth Lusca and are used by i-Soon as well.\n\n\n-----\n\n##### Conclusion\n\n Earth Lusca remains an active threat actor that counts cyberespionage\n\n among its primary motivations. Organizations must remain vigilant against\n\n APT groups employing sophisticated TTPs. In particular, government\n\n organizations face potential harm that could affect not only national and\n\n economic security but also international relations if malicious actors were to\n\n succeed in stealing classified information. Meanwhile, businesses that fall\n\n prey to cyberespionage attacks might face a decline in customer trust and\n\n operational disruptions that in turn lead to financial repercussions.\n\n Given Earth Lusca's penchant for using email, resorting to social\n\n engineering as one of its main avenues of infection, and capitalizing on\n\n relevant social and political issues as seen in this campaign, we advise\n\n individuals and organizations to adhere to security best practices, such as\n\n avoiding clicking on suspicious email and website links and updating\n\n software in a timely manner to minimize the chances of falling victim to an\n\n Earth Lusca attack\n\n MITRE ATT&CK techniques\n\n Below listed techniques are subset of MITRE ATT&CK list..\n\n|Tactic|Technique|ID|Description|\n|---|---|---|---|\n|Initial Access|Phishing: Spear-phishing Link|T1566.002|Used to send spear- phishing emails with a malicious attachment in an attempt to gain|\n\n\n-----\n\n|B|usiness|Col3|access to victim systems search|\n|---|---|---|---|\n|Execution|Command and Scripting Interpreter: Windows Command Shell|T1059.003|Used to leverage cmd to execute various commands and payloads.|\n|Execution|Command and Scripting Interpreter: JavaScript|T1059.007|Used to execute various commands and payloads.|\n|Execution|User Execution: Malicious Link|T1204.001|An adversary may rely upon a user clicking a malicious link in order to gain execution.|\n|Execution|User Execution: Malicious File|T1204.002|An adversary may rely upon a user opening a malicious file in order to gain execution.|\n|Defense Evasion|Deobfuscate/Decode Files or Information|T1140|Used Obfuscated Files or Information to hide artifacts of an intrusion from analysis|\n|Defense Evasion|Hide Artifacts: Hidden Files and Directories|T1564.001|Set files and directories to be hidden to evade detection mechanisms.|\n|Defense Evasion|Hijack Execution Flow: DLL Search Order Hijacking|T1574.001|Adversaries may execute their own malicious payloads by hijacking the search order used to load DLLs.|\n|Defense Evasion|Indirect Command Execution|T1202|Used to abuse utilities that allow for command execution to bypass security restrictions that limit the use of|\n\n\n-----\n\n|B|usiness|Col3|command-line interpreters. search|\n|---|---|---|---|\n|Defense Evasion|Masquerading: Double File Extension|T1036.007|Used to abuse a double extension in the filename as a means of masquerading the true file type.|\n|Defense Evasion|Obfuscated Files or Information: Software Packing|T1027.002|Adversaries may perform software packing or virtual machine software protection to conceal their code.|\n|Defense Evasion|Obfuscated Files or Information: Embedded Payloads|T1027.009|Adversaries may embed payloads within other files to conceal malicious content from defenses.|\n|Defense Evasion|Obfuscated Files or Information: LNK Icon Smuggling|T1027.012|Adversaries may smuggle commands to download malicious payloads past content filters by hiding them within otherwise seemingly benign windows shortcut files.|\n|Discovery|File and Directory Discovery|T1083|Adversaries may enumerate files and directories.|\n|Command and Control|Data Encoding|T1132|Adversaries may encode data to make the content of command and control traffic more difficult to detect.|\n|Command and Control|Data Obfuscation|T1001|Adversaries may obfuscate command and control traffic to|\n\n\n-----\n\n|B|usiness|Col3|make it more difficult to detect. search|\n|---|---|---|---|\n|Command and Control|Encrypted Channel|T1573|Adversaries may employ a known encryption algorithm to conceal command and control traffic.|\n|Exfiltration|Exfiltration Over C2 Channel|T1041|Adversaries may steal data by exfiltrating it over an existing command and control channel.|\n\n\n##### The final payload, Cobalt Stike, might use additional techniques listed on the\n\n MITRE website.\n\n Indicators of Compromise (IOCs)\n\n The indicators of compromise for this entry can be found here.\n\n We’d like to thank Trend's Ian Kenefick and Cyris Tseng for additional\n\n intelligence.\n\nTags\n\n[APT & Targeted Attacks](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/apt-and-targeted-attacks) | [Malware](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/malware) | [Endpoints](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:environments/endpoints) | [Research](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:article-type/research) | [Articles, News, Reports](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:medium/article)\n\n\n-----\n\nCedric Pernet\nSr. Threat Researcher\n\nJaromir Horejsi\nThreat Researcher\n\nRelated Articles\n\n\n[CONTACT US](mailto:tm_research@trendmicro.com)\n\n\nSUBSCRIBE\n\n\n[ICO Scams Leverage 2024 Olympics to Lure Victims, Use AI for Fake Sites](https://www.trendmicro.com/en_us/research/24/f/ico-scams-leverage-2024-olympics-to-lure-victims-use-ai-for-fake.html)\n\n[Attackers in Profile: menuPass and ALPHV/BlackCat](https://www.trendmicro.com/en_us/research/24/f/menupass-alphv-blackcat-threats.html)\n\n[Omdia Report: Trend Disclosed 60% of Vulnerabilities](https://www.trendmicro.com/en_us/research/24/f/omdia-vulnerabilities-report.html)\n\n[See all articles ](https://www.trendmicro.com/en_us/research.html)\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2024/2024.02.26.Earth_Lusca_Uses_Geopolitical_Lure_to_Target_Taiwan_Before_Elections/earth-lusca-uses-geopolitical-lure-to-target-taiwan.pdf"
    ],
    "report_names": [
        "earth-lusca-uses-geopolitical-lure-to-target-taiwan"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1719540223,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1719494613,
    "ts_modification_date": 1719494613,
    "files": {
        "pdf": "https://archive.orkl.eu/b4d343eb91e0322bbc47a70802803e89bfaf7379.pdf",
        "text": "https://archive.orkl.eu/b4d343eb91e0322bbc47a70802803e89bfaf7379.txt",
        "img": "https://archive.orkl.eu/b4d343eb91e0322bbc47a70802803e89bfaf7379.jpg"
    }
}