{
    "id": "26bc73d2-4d1f-40b8-8ece-96e6af4ebe3c",
    "created_at": "2023-01-12T15:08:17.696295Z",
    "updated_at": "2025-03-27T02:06:01.854111Z",
    "deleted_at": null,
    "sha1_hash": "11a0c359a69eed04c198078076330577039b6342",
    "title": "2021-04-25 - Ransomware and Data Leak Site Publication Time Analysis",
    "authors": "",
    "file_creation_date": "2022-05-27T22:09:50Z",
    "file_modification_date": "2022-05-27T22:09:50Z",
    "file_size": 280517,
    "plain_text": "# Ransomware and Data Leak Site Publication Time Analysis\n\n**[vulnerability.ch/2021/04/ransomware-and-date-leak-site-publication-time-analysis/](https://vulnerability.ch/2021/04/ransomware-and-date-leak-site-publication-time-analysis/)**\n\nCorsin Camichel April 25, 2021\n\n\n-----\n\nRansomware – the threat that breaches a victim network, steals data, encrypts local systems\nand published the stolen data\n\n– (image by mohamed_hassan)\n**Ransomware**\n\nWhat was once a threat to every internet user due to the wide-spread nature of campaigns –\ninfect as many devices as possible, extort for a small ransom – has turned into a multi-million\ndollar payment game. Ransomware operators are now playing in the big league. Ransom\ndemands in the $50M range have now been seen several times, payments in the tens of\nmillions are not unheard of.\n\nFor the past year I have been monitoring ransomware and data leak sites. What initially\nstarted as a website refresh several times a day has turned into a fully automated system\nthat tracks 20+ leak sites, browses all listing pages, extracts victim name, publication date\nand some other details, parses the output, compares it to the last run and notifies\nsubscribers of the newly listed victim.\n\nAn interesting output of this project is the fact that the sites are monitored 24 hours a day, 7\ndays a week. This allows me gain to interesting insight when ransomware operators are\nworking by publishing victim data. Yes, I believe some data leak systems are automated and\nno human is pushing a button, but for some leak sites you can identify patterns of working\nhours.\nFor the below analysis I reviewed the data between December 2020 and April 2021 from\nleak sites with more than 35 new victims listed. the following nine ransomware and leak sites\nmade it into the analysis:\n\n\n-----\n\n**NameName** **Victim CountVictim Count**\n\nAvaddon 107\n\nBABUK 51\n\nCL0P 42\n\nConti 192\n\nDarkSide 126\n\nDoppelPaymer 71\n\nNefilim 36\n\nPYSA 135\n\nREvil 107\n\nTotal 867\n\nTable: Ransomware and data leak site victims (December 2020 to April, 2021)\nThe first interesting observation that stands out, is that PYSA has four slots, in which they\npublish their victims. The vast number of victims are listed in the hour starting at 00:00 UTC\nand 11:00 UTC. Only a handful of victims are added after 06:00 UTC and after 15:00 UTC. I\ncan say with high confidence that this is likely the result of automation on their end. This is\nalso supported by the observation that PYSA leaks many victims at the same time, in one\ngo.\n\nAlmost the opposite can be seen by looking at the publication times of Conti. The operators\nbehind this leak site spread publication across the full day, with increased publications in the\nhours of 08:00 UTC, 09:00 UTC and 22:00 UTC.\n\nFor some other leak sites you can see some down-time, off-work hours. In my opinion, CL0P\nis a great example of this behaviour. No new victims were listed between 01:00 and 10:00\nUTC, the night time in Europe and neighbouring countries.\n\nEnough pre-text, here is the output table:\n\n\n-----\n\nTable showing publication hours of data leak sites (initial victim posting hour only)\nThe list above contains publications on any given day of a week. If you want to look at the\ndata only for working days, see the screenshot below:\n\nTable showing publication hours of data leak sites (Monday – Friday)\nAnd for publications only on a weekend, this is it. You can see that three groups (CL0P,\n**DoppelPaymer and PYSA) do not publish victims on a weekend, as they are missing in the**\ntable.\n\nTable showing publication hours of data leak sites (Saturday and Sunday)\nWhat are your take-aways? Agreeing or disagreeing with my assessment? Do see a different\npattern that you want to discuss? Let me know, I am very interested in seeing your views on\nthis.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-25 - Ransomware and Data Leak Site Publication Time Analysis.pdf"
    ],
    "report_names": [
        "2021-04-25 - Ransomware and Data Leak Site Publication Time Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536097,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653689390,
    "ts_modification_date": 1653689390,
    "files": {
        "pdf": "https://archive.orkl.eu/11a0c359a69eed04c198078076330577039b6342.pdf",
        "text": "https://archive.orkl.eu/11a0c359a69eed04c198078076330577039b6342.txt",
        "img": "https://archive.orkl.eu/11a0c359a69eed04c198078076330577039b6342.jpg"
    }
}