{
    "id": "26bc7d7d-5d50-4d5c-8e4c-c69a38665178",
    "created_at": "2023-01-12T14:59:30.036123Z",
    "updated_at": "2025-03-27T02:15:06.245316Z",
    "deleted_at": null,
    "sha1_hash": "7844749f87526ace6725892693ff6bfcbe4b8dfd",
    "title": "2021-07-21 - StrongPity APT Group Deploys Android Malware for the First Time",
    "authors": "",
    "file_creation_date": "2022-05-27T23:23:59Z",
    "file_modification_date": "2022-05-27T23:23:59Z",
    "file_size": 2399333,
    "plain_text": "# StrongPity APT Group Deploys Android Malware for the First Time\n\n**[trendmicro.com/en_us/research/21/g/strongpity-apt-group-deploys-android-malware-for-the-first-time.html](https://www.trendmicro.com/en_us/research/21/g/strongpity-apt-group-deploys-android-malware-for-the-first-time.html)**\n\nJuly 21, 2021\n\nWe recently conducted an investigation into a malicious Android malware sample, which we believe can be attributed to the StrongPity APT\ngroup, that was posted on the Syrian e-Gov website. To the best of our knowledge, this is the first time that the group has been publicly\nobserved using malicious Android applications as part of its attacks.\n\n[We first learned about the sample from a thread shared on the MalwareHunterTeam Twitter. Based on the discussion thread, we learned that](https://twitter.com/malwrhunterteam/status/1397122900520472577)\nthe shared sample is a trojanized version of the Syrian e-gov Android application that would steal contact lists and collect files with specific file\nextensions from its victim's device.\n\n[One response from the thread pointed out that the malicious APK was likely distributed using a \"watering-hole\"-like technique: the attacker](https://twitter.com/IsraelWernik/status/1397513144034017286)\nallegedly had compromised the official Syrian E-Gov website and replaced the official Android application file with a trojanized version of the\noriginal app. Due to the suspicious nature of this activity, we decided to investigate further.\n\nThis blog entry will discuss the group’s attack tactics, techniques, and procedures (TTPs) in relation to the Android malware and why these\nactivities can be attributed to this threat actor. Furthermore, we will also dive into the threat actor’s development progress and identify several\nother malicious Android malware samples produced by StrongPity. Finally, we will briefly discuss related malware variants, including the\nsecond version of the Android trojan, which appears to be a work in progress and includes several testing features.\n\n## Initial investigation\n\nThe first thing we did was check the URL where the malicious APK file was hosted (https://egov[.]sy/mobile/egov[.]apk). The version of the\napplication that is downloadable from the site at the time of writing is a clean version of the Syrian e-gov Android application that is different\nfrom the malicious application previously discussed on Twitter. This means that, at one point, the malicious version of the application was\ndeleted from the site.\n\nAt least six other samples with the same application name (\"ﺑﻮاﺑﺘﻲ\") and matching package names (com.egov.app.*) can be identified on\nVirusTotal. We verified all of these samples and concluded that all of them are benign. These benign versions of the application were created\nduring the period from February 2020 until March 2021. We believe all of them are official apps from the Syrian E-Gov website.\n\nThe malicious sample, mentioned in the Twitter thread, is available on VirusTotal and as of the time of writing, has several positive detections.\nAlthough some antivirus vendors detect the identified malicious sample as Bahamut, we doubted the accuracy of this attribution to the\n[Bahamut APT group. Further investigation revealed several artifacts that could possibly link the malicious sample to the StrongPity APT group.](https://www.trendmicro.com/en_us/research/18/h/the-urpage-connection-to-bahamut-confucius-and-patchwork.html)\n\n## Analysis of the malicious sample\n\nThe malicious version of the application (fd1aac87399ad22234c503d8adb2ae9f0d950b6edf4456b1515a30100b5656a7) was created on May\n2021(The timestamps within the file point to 2021-05-03 as the creation date, while the file was uploaded to VirusTotal on May 24, 2021). This\napplication is signed with a different certificate and was produced by repackaging the original app from the Syrian government. All of the\noriginal applications, on the other hand, are signed with another certificate.\n\n\n-----\n\nFigure 1. Comparison of the certificates used to sign the original (top) and the malicious applications(bottom)\nThe malicious application has the AndroidManifest.xml modified to include references to additional classes and request additional permissions\non the device (seen in Figure 3).\n\n\n-----\n\nFigure 2. The modified AndroidManifest.xml of the malicious app\n\n## Overview of the inserted code\n\nThe threat actor added the following classes to this application; some of these classes (com.egov.app.NetworkStatusService,\ncom.egov.app.Receiver) are referenced in the modified AndroidManifest.xml.\n\n\n-----\n\nFigure 3. The classes added to the malicious app are shown in the right part of the image. The original classes are shown in the left.\nFigure 3 shows that many of the other classes have randomly generated class and method names. This naming pattern was likely produced by\na software obfuscation tool.\n\nMalicious code initialization\n\nTwo major additional components were added to the malicious version of the application: a service and a receiver. The receiver starts the\nmalicious service. The malicious service is declared as an Android Service, which is an application component that can perform long-running\ntasks in the background.\n\nThis malicious service is declared with the class name \"com.egov.app.NetworkStatusService\", and is started by the Receiver class.\n\nOur analysis of the Receiver configuration and code found multiple methods for starting the malicious NetworkStatusService service.\n\nThe service is started when the device connectivity is changed. The djdeeu class registers a broadcast receiver for\nCONNECTIVITY_CHANGE.\nThe service can be started from launcher activity or other registered receivers.\nThe service can be started using the \"Alarm\" mechanism.\n\nOnce the malicious NetworkStatusService service is started, it executes its malicious functionality via a set of message handlers, which are\nresponsible for handling specific messages.\n\nArchitecture of the backdoor\n\nThe sample uses the \"Handler\" mechanism to dispatch messages that trigger malicious behavior. A custom enum structure is used to define\nthe message types.\n\n\n-----\n\nt de es se e essage types, s o gu e\n\nFigure 4. Code\n\nshowing the seven defined messages.\nEach of the messages trigger a different behavior through the handler. The following is a quick summary of the purpose and behavior of each\nspecific message:\n\n### MSG_TRIG_ALARM_HEARTBEAT\n\nWhen this message is received, a periodic task for heartbeat message is set.\n\n### MSG_TRIG_ALARM_SYNC\n\nWhen this message is received, a periodic task for sync message is set.\n\n### MSG_HEARTBEAT\n\nThis message triggers the heartbeat function, which sends a request to the command-and-control (C&C) server and receives a response with\nan encrypted payload.\n\nThe encrypted payload is first saved into the directory <DIR>/.android/water.zip, after which the file water.zip is decrypted and the decrypted\npayload written to <DIR>/.android/e.zip.\n\nNext, the file e.zip is decompressed into <DIR>/.android and the file with the name \"config.properties\" is accessed.\n\nFinally, this file is read and parsed. These properties are extracted and written as configuration settings to local shared preference, allowing the\nmalware to change its behavior according to the configuration.\n\n### MSG_SYNC\n\nSync is a repeated behavior. It uploads files, which were collected on infected devices, with a periodicity of 3000 seconds.\n\nThe handler for MSG_SYNC executes the following functionality:\n\nFirst, it enumerates all files under <DIR>/.android/.lib2. It then creates a zip file with the name <uniqueId>.zip (note that the unique ID is not a\nreal device ID, the malware just calculates a custom unique ID based on the device ID value), and writes the files into the compressed file.\n\nFinally, it upload the zip file to the C&C server and deletes all files under <DIR>/.android/.lib2, as well as the compressed file <uniqueId>.zip.\n\n### MSG_COLLECT\n\nThe handler for this message collects data from the victim’s device. First, it collects contact information, followed by information regarding\navailable Wi-Fi networks.\n\nIt then searches through the device files and harvests all files that match pre-defined file extensions:\n\n.asc\n.dgs\n.doc\n.docx\n\nedf\n\n\n-----\n\ngpg\n.jpeg\n.jpg\n.key\n.m2r\n.meo\n.pdf\n.pgp\n.pir\n.pkr\n.pub\n.rjv\n.rms\n.sem\n.sit\n.skr\n.sys\n.xls\n.xlsx\n\nFigure 5. A snippet of the file harvesting code\n\n### MSG_TRIG_ALARM_COLLECT\n\nWhen this message is received, a periodic task for the “collect message” handler is set.\n\n### MSG_CONNECTIVITY\n\nThis message sends all the mentioned messages one by one.\n\n## Modular Functionality of the backdoor\n\nThis sample uses highly modular components to create a flexible architecture for component loading and unloading. The functions onCreate\nand onDestroy show a common approach to loading and unloading a component.\n\n\n-----\n\nFigure 6. Code snippet showing the\n\nonCreate and onDestroy functions\nThe following are the components were used in the sample:\n\npekmek(Crypto Manager): Uses AES to decrypt and encrypt files and strings.\nltymcr(Helper Class): Contains many utility functions, such as a function to calculate unique id, parse config file, write/read shared\npreference, and define encryption keys.\n\nFigure 7 Code snippet showing the ltymcr(Helper Class) component\n\n\n-----\n\nsad oo co po e t used as o e a e oc\nphkyxc: A component used as WifiWakeLock.\ntfsdne: This is a wrapper used for C&C communication such as heartbeat and sync.\nitxdrx(Net Manager): A component responsible for handling HTTP protocol communication.\n\nnhnhpi: The component responsible for managing the C&C server.\n\n\nFigure 8. Code from the itxdrx component\n\n\nThis component includes definition of an initial C&C server. The initial value can be overridden. The StrongPity backdoor has the ability to\nupdate (including deleting and adding) its C&C server address via configuration updates from the \"heartbeat\" command.\n\nFigure 9. The code that\n\nhandles the addition and deletion of C&C servers\n\n## Investigation and attribution\n\nWhen we learned how the threat actor repackages benign applications into trojanized variants, we decided to search for similar samples on\nVirusTotal. We searched for other applications that were repackaged in a similar method and included similar malicious components.\n\n## Similar malicious samples\n\nWe found several other samples that were produced by the same threat actor. We determined these samples to be similar because all of them\n(except for the last sample) were also repackaged from normal applications and had similar malicious code inserted.\n\n\n**Date of**\n**submission**\n\n\n**SHA256** **Identified C&C servers** **Additional Details**\n\n\n-----\n\nAugust 2,\n2019\n\nJune 8,\n2020\n\nJune 8,\n2020\n\nJune 13,\n2021\n\nJanuary 1,\n2021\n\n\n374d92f553c28e9dad1aa7f5d334a07dede1e5ad19c3766efde74290d0c49afb upeg-system-app[.]com Likely repacked fro\n\nbe9214a5804632004f7fd5b90fbac3e23f44bb7f0a252b8277dd7e9d8b8a52f3 networktopologymaps[.]com Likely repacked fro\n596257ef017b02b\n\na9378a5469319faffc48f3aa70f5b352d5acb7d361c5177a9aac90d9c58bb628 networktopologymaps[.]com Likely repacked fro\nfrom the Yemeni w\n\n596257ef017b02ba6961869d78a2317500a45f00c76682a22bbdbd3391857b5d upeg-system-app[.]com Likely repacked fro\n\n75dc2829abb951ff970debfba9f66d4d7c6b7c48a823a911dd5874f74ac63d7b upn-sec3-msd[.]com This is likely a test\nsample also conta\nsamples. This sho\nAPK versions of th\n\n\nTable 1. Similar malicious samples found on VirusTotal\n\nThe sample 75dc2829abb951ff970debfba9f66d4d7c6b7c48a823a911dd5874f74ac63d7b serves as the key attribution factor and is the main\nlink to the StrongPity threat actor, because it communicates with a C&C server that was previously identified by several research teams as\ninfrastructure used by the group.\n\n## Tools, tactics, and procedures on Windows\n\nThere are no known public reports of StrongPity using malicious Android applications in their attacks at the time of writing. In order to\nstrengthen our confidence in the accuracy of our attribution to StrongPity, we decided to further examine some of their samples that were used\nto target Microsoft Windows platforms and see if we could identify similar tools, tactics, and procedures (TTPs) in their actions.\n\nJust as we have seen with the Android apps, the StrongPity group favors repacking benign installers to produce trojanized versions of these\napplications. Likewise, the main function of these backdoors is to search, harvest, and exfiltrate files from the victim’s computers.\n\nTake, for example, the following sample: 48f67be806b4e823280f03ee5512ffd58deb6f37ecc80842265d4e8d2ca30055. The sample first drops\na file called \"TrustedInstaller.exe\" to <DIR>/AppData/Local/Temp and then executes it. This dropped file is a clean WinRAR installer.\n\nFigure 10. Code used in the file “TrustedInstaller.exe”\nIt then creates <DIR>/AppData/Local/Temp/lang_be29c9f3-83we to drop malicious files and execute them.\n\n\n-----\n\nFigure 11. Code showing the creation of the directory\nIf we examine another StrongPity sample (12818a96211b7c47863b109be63e951075cf6a41652464a584dd2f26010f7535), the logic is similar\n— it drops a normal installer into the Temp directory and creates a directory for dropped malicious files.\n\nHere are three notable similarities between the Windows sample and the Android sample:\n\n1.  They all disguised as normal apps by utilizing the original clean applications — the Android sample repacks the original one into a\ntrojanized version, while the Windows sample uses a trojanized installer packed with the original program.\n\n2.  Both collect and exfiltrate files from the infected device.\n\n3.  Both are highly modular. The Windows sample has a standalone Exfiltration and File Search module, a feature that could also be seen in\nthe latest test Android sample.\n\n## Possible connections to StrongPity\n\nWe found several clues that link the malicious Android samples with the StrongPity threat actor.\n\nThe sample 74582c3d920332117541a9bbc6b8995fbe7e1aff communicates with the URL https://www.upn-sec3[msd[.]com/ProxyServer/service/. The domain name “upn-sec3-msd[.]com” was mentioned in another StrongPity report.](https://cybersecurity.att.com/blogs/labs-research/newly-identified-strongpity-operations)\n\nThe domain naming pattern and domain acquisition techniques are quite similar. For example, the [domain names used by StrongPity in 2020](https://blog.talosintelligence.com/2020/06/promethium-extends-with-strongpity3.html)\nhave a domain naming pattern similar to the domains used by the identified Android samples.\n\nOne of the domain names, networktopologymaps[.]com, was likely bought when registration at Gandi expired. The domain was acquired via\nthe Porkbun network registrar.\n\nThis is similar to the domain hostoperationsystems[.]com, which was previously mentioned in the Talos report. This domain was also acquired\nvia Porkbun and features a comparable domain naming pattern.\n\nAnother notable point of correlation to StrongPity is the list of file extensions, which we have seen in Android samples. A similar list of the file\nextensions for the files is presented in variants of the trojan for Windows systems. For example, one of the samples that we had examined\nearlier, gathers files with the following extensions:\n\n.7z\n.asc\n.dgs\n.doc\n.docx\n.gpg\n.pdf\n.pgp\n.ppt\n.pptx\n.rar\n.rjv\n\nrms\n\n\n-----\n\nt\n.sft\n.tc\n.txt\n.xls\n.xlsx\n\nAs we previously mentioned, there are no public reports of the StrongPity threat actor using malicious Android applications in the attack.\nHowever, we examined the trojan code-embedding techniques as well as the trojan functionality of the malicious code written by the same\nthreat actor for Windows platforms, and we have identified some similar patterns. This leads us to believe that these could belong to the same\nthreat actor.\n\n## StrongPity actively develops new malicious android apps\n\nWe believe that the StrongPity Threat actor is actively developing backdoors for Android. Based on the test sample that we have identified, we\ncan see that the threat actor attempts several techniques to lure potential victims: repackaged applications, compromised websites, and fake\nvariants of popular applications.\n\nBased on the additional functionalities that we identified in the fake Samsung security service application\n(75dc2829abb951ff970debfba9f66d4d7c6b7c48a823a911dd5874f74ac63d7b), we think that among the APK files that we had identified, the\nrepackaged applications are bundled with the first version of the Android trojan, while the fake application could be a work in progress for the\nnext version of the tool.\n\nIn the second version, we observed the threat actor developed and included some additional components and as well as added support for\nmore message types.\n\nThe following table shows the types that the threat actor has defined.\n\nMessage type Details\n\nMSG_ADD_MODULE Add a new module\n\nMSG_GET_MODULE Get the module instance\n\nMSG_DEL_MODULE Delete module file under <DIR>/.android/.li/<module name>\n\nMSG_DEL_APK Delete the APK file under the download directory\n\nMSG_START_MODULES\n\nTable 2. Message types defined by the threat actor\n\nIn this version, MSG_COLLECT is no longer present — we think they replaced it with MSG_START_MODULES, a message used to read all\nmodule names from the shared preference, and start/initialize them one by one.\n\nWe were not able to get access to these modules, but based on some of the code functionality that we observed, we believe that these\nmodules are designed to collect data from the victim’s devices and write the collected data into a local SQLite db data file. However, we were\nnot able to find any of these modules in the wild.\n\nThere are also several other key differences between version 1 and version 2 of the trojan:\n\nThe message Handler for heartbeat message in version 2 is now split into two messages: heartbeat and taken_config. Either of these\nmessages can receive a response from the C&C server and decrypt the response to update the local configuration, similarly to the\nversion 1.\nVersion 2 uses different AES encryption keys: key(\"aaaanothingimpossiblebbb\"), and AES IV(\"aaaanothingimpos\")\nScreenReceiver class is added to the second version of the trojan. The purpose of this Receiver is to start the malicious service via\nScreen_On and Screen_Off events.\nVersion 2 has an ability to execute “su” command, if the device is rooted. The main usage of the root privilege here is that it could grant\npermissions silently. Such permissions include accessibility, notification and other. However, we did not find any evidence that the sample\nwould attempt to root the device.\nTwo components were added in version 2 for accessibility and notification.\nVersion 2 uses SQLite to store collected data. Furthermore, it no longer uses ZIP.\nIn Version 2, the extra modules used in “MSG_START_MODULES” are downloaded from the C&C server via either the heartbeat or\ntaken_config message. It’s possible that these modules are decompressed as part of the response into <DIR>/.android/.li and\n\nti ll t d\n\n\n-----\n\n## Conclusion\n\nThis investigation has provided evidence to attribute the Android malware sample, which was posted on the Syrian e-Gov website, to the\nStrongPity threat group. We were also able to identify additional Android trojan files and correlate these malicious Android applications with\nexisting public reports based on their similarities to the threat actor’s TTPs and network infrastructure they used.\n\nAlthough there are no previously known malicious Android applications attributed to the StrongPity group, we strongly believe that the threat\nactor is in the process of actively developing new malicious components that can be used to target Android platforms.\n\nWe believe that the threat actor is exploring multiple ways of delivering the applications to potential victims, such as using fake apps and using\ncompromised websites as watering holes to trick users into installing malicious applications. Typically, these websites would require its users to\ndownload the applications directly onto their devices. In order to do so, these users would be required to enable installation of the applications\nfrom “unknown sources” on their devices. This bypasses the “trust-chain” of the Android ecosystem and makes it easier for an attacker to\ndeliver additional malicious components.\n\n## Indicators of Compromise (IOCs)\n\n Files\n\n**SHA256** **Description** **Detection**\n\n\nfd1aac87399ad22234c503d8adb2ae9f0d950b6edf4456b1515a30100b5656a7 The trojanized version of the\nSyria eGov Application\n\n374d92f553c28e9dad1aa7f5d334a07dede1e5ad19c3766efde74290d0c49afb Sample repackaged from\nKingoroot\n\na9378a5469319faffc48f3aa70f5b352d5acb7d361c5177a9aac90d9c58bb628 Sample repackaged from\nnet.cybertik.wifi\n\n\nAndroidOS_StrongPity.HRX\n\nAndroidOS_StrongPity.HRX\n\nAndroidOS_StrongPity.HRX\n\n\nbe9214a5804632004f7fd5b90fbac3e23f44bb7f0a252b8277dd7e9d8b8a52f3 Repackaged from Snaptube AndroidOS_StrongPity.HRX\n\n596257ef017b02ba6961869d78a2317500a45f00c76682a22bbdbd3391857b5d Repackaged from Snaptube AndroidOS_StrongPity.HRX\n\n\n75dc2829abb951ff970debfba9f66d4d7c6b7c48a823a911dd5874f74ac63d7b Fake Samsung Security\nService sample\n\n## Network C&C Infrastructure\n\n\nAndroidOS_StrongPity.HRX\n\n\n**SHA256** **Domain** **Detection**\n\nfd1aac87399ad22234c503d8adb2ae9f0d950b6edf4456b1515a30100b5656a7 Internetwideband[.]com AndroidOS_StrongPity.HRX\n\n374d92f553c28e9dad1aa7f5d334a07dede1e5ad19c3766efde74290d0c49afb upeg-system-app[.]com AndroidOS_StrongPity.HRX\n\na9378a5469319faffc48f3aa70f5b352d5acb7d361c5177a9aac90d9c58bb628 networktopologymaps[.]com AndroidOS_StrongPity.HRX\n\nbe9214a5804632004f7fd5b90fbac3e23f44bb7f0a252b8277dd7e9d8b8a52f3 networktopologymaps[.]com AndroidOS_StrongPity.HRX\n\n596257ef017b02ba6961869d78a2317500a45f00c76682a22bbdbd3391857b5d upeg-system-app[.]com AndroidOS_StrongPity.HRX\n\n75dc2829abb951ff970debfba9f66d4d7c6b7c48a823a911dd5874f74ac63d7b upn-sec3-msd[.]com AndroidOS_StrongPity.HRX\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-21 - StrongPity APT Group Deploys Android Malware for the First Time.pdf"
    ],
    "report_names": [
        "2021-07-21 - StrongPity APT Group Deploys Android Malware for the First Time.pdf"
    ],
    "threat_actors": [
        {
            "id": "caf95a6f-2705-4293-9ee1-6b7ed9d9eb4c",
            "created_at": "2022-10-25T15:50:23.472432Z",
            "updated_at": "2025-03-27T02:00:55.479021Z",
            "deleted_at": null,
            "main_name": "Confucius",
            "aliases": [
                "Confucius",
                "Confucius APT"
            ],
            "source_name": "MITRE:Confucius",
            "tools": [
                "WarzoneRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "732bfd4b-8c15-42a5-ac4b-14a9a4b902e9",
            "created_at": "2022-10-25T16:07:23.38079Z",
            "updated_at": "2025-03-27T02:02:09.771357Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "ETDA:Bahamut",
            "tools": [
                "Bahamut",
                "DownPaper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67fbc7d7-ba8e-4258-b53c-9a5d755e1960",
            "created_at": "2022-10-25T16:07:24.077859Z",
            "updated_at": "2025-03-27T02:02:10.101173Z",
            "deleted_at": null,
            "main_name": "Promethium",
            "aliases": [
                "APT-C-41",
                "Promethium",
                "StrongPity"
            ],
            "source_name": "ETDA:Promethium",
            "tools": [
                "StrongPity",
                "StrongPity2",
                "StrongPity3",
                "Truvasys"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "37714790-40c0-4b6b-8e49-1c8f45a0463f",
            "created_at": "2022-10-25T16:07:24.37091Z",
            "updated_at": "2025-03-27T02:02:10.196909Z",
            "deleted_at": null,
            "main_name": "Urpage",
            "aliases": [],
            "source_name": "ETDA:Urpage",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f99641e0-2688-47b0-97bc-7410659d49a0",
            "created_at": "2023-01-06T13:46:38.802141Z",
            "updated_at": "2025-03-27T02:00:02.922907Z",
            "deleted_at": null,
            "main_name": "Bahamut",
            "aliases": [],
            "source_name": "MISPGALAXY:Bahamut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cbede712-4cc3-47c6-bf78-92fd9f1beac6",
            "created_at": "2022-10-25T15:50:23.777222Z",
            "updated_at": "2025-03-27T02:00:55.544919Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "PROMETHIUM",
                "StrongPity"
            ],
            "source_name": "MITRE:PROMETHIUM",
            "tools": [
                "Truvasys",
                "StrongPity"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ada9e5d3-1cb2-4b70-a3c8-96808c304ac8",
            "created_at": "2022-10-25T15:50:23.6515Z",
            "updated_at": "2025-03-27T02:00:55.513513Z",
            "deleted_at": null,
            "main_name": "Windshift",
            "aliases": [
                "Windshift",
                "Bahamut"
            ],
            "source_name": "MITRE:Windshift",
            "tools": [
                "WindTail"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a8dbc5e-51a8-437a-8540-7dcb1cc110b8",
            "created_at": "2022-10-25T16:07:23.482856Z",
            "updated_at": "2025-03-27T02:02:09.827887Z",
            "deleted_at": null,
            "main_name": "Confucius",
            "aliases": [],
            "source_name": "ETDA:Confucius",
            "tools": [
                "ApacheStealer",
                "ByeByeShell",
                "ChatSpy",
                "Confucius",
                "MY24",
                "Sneepy",
                "remote-access-c3",
                "sctrls",
                "sip_telephone",
                "swissknife2"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8fddd571-37dc-4bb2-84b4-e41ac6fd11f5",
            "created_at": "2024-02-08T02:00:04.32487Z",
            "updated_at": "2025-03-27T02:00:03.329395Z",
            "deleted_at": null,
            "main_name": "Urpage",
            "aliases": [],
            "source_name": "MISPGALAXY:Urpage",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7ea1e0de-53b9-4059-802f-485884180701",
            "created_at": "2022-10-25T16:07:24.04846Z",
            "updated_at": "2025-03-27T02:02:10.090459Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "APT-C-09",
                "ATK 11",
                "Capricorn Organisation",
                "Chinastrats",
                "Dropping Elephant",
                "Maha Grass",
                "Quilted Tiger",
                "TG-4410",
                "Thirsty Gemini",
                "Zinc Emerson"
            ],
            "source_name": "ETDA:Patchwork",
            "tools": [
                "AndroRAT",
                "Artra Downloader",
                "ArtraDownloader",
                "AutoIt backdoor",
                "BADNEWS",
                "BIRDDOG",
                "Bahamut",
                "Bozok",
                "Bozok RAT",
                "Brute Ratel",
                "Brute Ratel C4",
                "CinaRAT",
                "Crypta",
                "ForeIT",
                "JakyllHyde",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "NDiskMonitor",
                "Nadrac",
                "PGoShell",
                "PowerSploit",
                "PubFantacy",
                "Quasar RAT",
                "QuasarRAT",
                "Ragnatela",
                "Ragnatela RAT",
                "SocksBot",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL",
                "Yggdrasil"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4660477f-333f-4a18-b49b-0b4d7c66d482",
            "created_at": "2023-01-06T13:46:38.511962Z",
            "updated_at": "2025-03-27T02:00:02.852307Z",
            "deleted_at": null,
            "main_name": "PROMETHIUM",
            "aliases": [
                "StrongPity",
                "G0056"
            ],
            "source_name": "MISPGALAXY:PROMETHIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535570,
    "ts_updated_at": 1743041706,
    "ts_creation_date": 1653693839,
    "ts_modification_date": 1653693839,
    "files": {
        "pdf": "https://archive.orkl.eu/7844749f87526ace6725892693ff6bfcbe4b8dfd.pdf",
        "text": "https://archive.orkl.eu/7844749f87526ace6725892693ff6bfcbe4b8dfd.txt",
        "img": "https://archive.orkl.eu/7844749f87526ace6725892693ff6bfcbe4b8dfd.jpg"
    }
}