{
    "id": "26e0716b-d0fe-4f58-9f64-4b68a4f98f59",
    "created_at": "2023-01-12T15:09:32.268587Z",
    "updated_at": "2025-03-27T02:16:26.347185Z",
    "deleted_at": null,
    "sha1_hash": "ac27667cce88229f8c31bc2de93cd72426ffeba7",
    "title": "2021-05-08 - Cyber attack shuts down top U.S. fuel pipeline network",
    "authors": "",
    "file_creation_date": "2022-05-27T21:35:50Z",
    "file_modification_date": "2022-05-27T21:35:50Z",
    "file_size": 248987,
    "plain_text": "# Cyber attack shuts down U.S. fuel pipeline ‘jugular,’ Biden briefed\n\n**[reuters.com/technology/colonial-pipeline-halts-all-pipeline-operations-after-cybersecurity-attack-2021-05-08/](https://www.reuters.com/technology/colonial-pipeline-halts-all-pipeline-operations-after-cybersecurity-attack-2021-05-08/)**\n\nChristopher Bing, Stephanie Kelly\n\nRegister now for FREE unlimited access to Reuters.com\n\nNEW YORK, May 8 (Reuters) - Top U.S. fuel pipeline operator Colonial Pipeline shut its\nentire network, the source of nearly half of the U.S. East Coast’s fuel supply, after a cyber\nattack on Friday that involved ransomware.\n\nThe [incident is one of the most disruptive digital ransom operations ever reported and has](https://www.reuters.com/business/energy/view-cyberattack-pipeline-spotlights-holes-us-energy-security-2021-05-08/)\ndrawn attention to how vulnerable U.S. energy infrastructure is to hackers. A prolonged\n[shutdown of the line would cause prices to spike at gasoline pumps ahead of peak summer](https://www.reuters.com/business/energy/will-colonial-pipeline-shutdown-spike-us-pump-prices-2021-05-08/)\ndriving season, a potential blow to U.S. consumers and the economy.\n\n\"This is as close as you can get to the jugular of infrastructure in the United States,\" said\nAmy Myers Jaffe, research professor and managing director of the Climate Policy Lab. \"It's\nnot a major pipeline. It's the pipeline.\"\n\nRegister now for FREE unlimited access to Reuters.com\n\nColonial transports 2.5 million barrels per day of gasoline, and other fuels through 5,500\nmiles (8,850 km) of pipelines linking refiners on the Gulf Coast to the eastern and southern\nUnited States. It also serves some of the country's largest airports, including Atlanta's\nHartsfield Jackson Airport, the world's busiest by passenger traffic.\n\n\n-----\n\nThe company said it shut down its operations after learning of a cyberattack on Friday using\nransomware.\n\n\"Colonial Pipeline is taking steps to understand and resolve this issue. At this time, our\nprimary focus is the safe and efficient restoration of our service and our efforts to return to\nnormal operation,\" it said.\n\nWhile the U.S. government investigation is in early stages, one former official and two\nindustry sources said the hackers are likely a professional cybercriminal group.\n\nThe former official said investigators are looking at a group dubbed \"DarkSide,\" known for\ndeploying ransomware and extorting victims while avoiding targets in post-Soviet states.\nRansomware is a type of malware designed to lock down systems by encrypting data and\ndemanding payment to regain access.\n\nColonial said it had engaged a cybersecurity firm to help the investigation and contacted law\nenforcement and federal agencies.\n\n[The cybersecurity industry sources said cybersecurity firm FireEye (FEYE.O) was brought in](https://www.reuters.com/companies/FEYE.O)\nto respond to the attack. FireEye declined to comment.\n\nU.S. government bodies, including the FBI, said they were aware of the situation but did not\nyet have details of who was behind the attack.\n\nPresident Joe Biden was briefed on the incident on Saturday morning, a White House\nspokesperson said, adding that the government is working to try to help the company restore\noperations and prevent supply disruptions.\n\nThe Department of Energy said it was monitoring potential impacts to the nation's energy\nsupply, while both the U.S. Cybersecurity and Infrastructure Security Agency and the\nTransportation Security Administration told Reuters they were working on the situation.\n\n\"We are engaged with the company and our interagency partners regarding the situation.\nThis underscores the threat that ransomware poses to organizations regardless of size or\nsector,\" said Eric Goldstein, executive assistant director of the cybersecurity division at CISA.\n\nColonial did not give further details or say how long its pipelines would be shut.\n\nThe privately held, Georgia-based company is owned by CDPQ Colonial Partners L.P., IFM\n(US) Colonial Pipeline 2 LLC, KKR-Keats Pipeline Investors L.P., Koch Capital Investments\nCompany LLC and Shell Midstream Operating LLC.\n\nA hooded man holds a laptop computer as cyber code is projected on him in this illustration\npicture taken on May 13, 2017. Top U.S. fuel pipeline operator Colonial Pipeline has shut its\nentire network after a cyber attack, the company said on Friday. REUTERS/Kacper\nPempel/Illustration\n\n\n-----\n\nCybersecurity vulnerabilities have become a systemic issue, said Algirde Pipikaite, cyber\nstrategy lead at the World Economic Forum's Centre for Cybersecurity.\n\n\"Unless cybersecurity measures are embedded in a technology's development phase, we\nare likely to see more frequent attacks on industrial systems like oil and gas pipelines or\nwater treatment plants,\" Pipikaite added.\n\nPUMP PRICE WORRIES\n\nThe American Automobile Association said a prolonged outage of the line could trigger\nincreases in gas prices at the pumps, a worry for consumers ahead of summer driving\nseason.\n\nA shutdown lasting four or five days, for example, could lead to sporadic outages at fuel\nterminals along the U.S. East Coast that depend on the pipeline for deliveries, said Andrew\nLipow, president of consultancy Lipow Oil Associates.\n\nAfter the shutdown was first reported on Friday, gasoline futures on the New York Mercantile\nExchange gained 0.6% while diesel futures rose 1.1%, both outpacing gains in crude oil. Gulf\nCoast cash prices for gasoline and diesel edged lower on prospects that supplies could\naccumulate in the region.\n\n\"As every day goes by, it becomes a greater and greater impact on Gulf Coast oil refining,\"\nsaid Lipow. \"Refiners would have to react by reducing crude processing because they've lost\npart of the distribution system.\"\n\nOil refining companies contacted by Reuters on Saturday said their operations had not yet\nbeen impacted.\n\n[Kinder Morgan Inc (KMI.N), meanwhile, said its Products (SE) Pipe Line Corporation (PPL)](https://www.reuters.com/companies/KMI.N)\nserving many of the same regions remains in full service.\n\nPPL is currently working with customers to accommodate additional barrels during Colonial's\ndowntime, it said. PPL can deliver about 720,000 bpd of fuel through its pipeline network\nfrom Louisiana to the Washington, D.C., area.\n\n**Colonial Pipeline system map**\n\n\n-----\n\nThe American Petroleum Institute, a top oil industry trade group, said it was monitoring the\nsituation.\n\nBen Sasse, a Republican senator from Nebraska and a member of the Senate Select\nCommittee on Intelligence, said the cyberattack was a wakeup call for U.S. lawmakers.\n\n\"This is a play that will be run again, and we're not adequately prepared,\" he said, adding\nCongress should pass an infrastructure plan that hardens sectors against these attacks.\n\nColonial previously shut down its gasoline and distillate lines during Hurricane Harvey, which\nhit the Gulf Coast in 2017. That contributed to tight supplies and gasoline price rises in the\nUnited States after the hurricane forced many Gulf refineries to shut down.\n\nRegister now for FREE unlimited access to Reuters.com\n\nReporting by Stephanie Kelly Editing by Shri Navaratnam\n\nOur Standards: [The Thomson Reuters Trust Principles.](https://www.thomsonreuters.com/en/about-us/trust-principles.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-08 - Cyber attack shuts down top U.S. fuel pipeline network.pdf"
    ],
    "report_names": [
        "2021-05-08 - Cyber attack shuts down top U.S. fuel pipeline network.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536172,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653687350,
    "ts_modification_date": 1653687350,
    "files": {
        "pdf": "https://archive.orkl.eu/ac27667cce88229f8c31bc2de93cd72426ffeba7.pdf",
        "text": "https://archive.orkl.eu/ac27667cce88229f8c31bc2de93cd72426ffeba7.txt",
        "img": "https://archive.orkl.eu/ac27667cce88229f8c31bc2de93cd72426ffeba7.jpg"
    }
}