{
    "id": "26edfedc-288d-470a-a3df-b48209b0c688",
    "created_at": "2023-01-12T15:06:25.70359Z",
    "updated_at": "2025-03-27T02:10:31.558581Z",
    "deleted_at": null,
    "sha1_hash": "78edc2128be0b585ea78c2db232ff78ad4f4c50b",
    "title": "2018-06-07 - InvisiMole- Surprisingly equipped spyware, undercover since 2013",
    "authors": "",
    "file_creation_date": "2022-05-28T02:45:50Z",
    "file_modification_date": "2022-05-28T02:45:50Z",
    "file_size": 933014,
    "plain_text": "# InvisiMole: Surprisingly equipped spyware, undercover since 2013\n\n**[welivesecurity.com/2018/06/07/invisimole-equipped-spyware-undercover/](https://www.welivesecurity.com/2018/06/07/invisimole-equipped-spyware-undercover/)**\n\nJune 7, 2018\n\nHunting for secrets from high-profile targets while staying in the shadows\n\n[Zuzana Hromcová](https://www.welivesecurity.com/author/zhromcova/)\n7 Jun 2018 - 03:00PM\n\nHunting for secrets from high-profile targets while staying in the shadows\n\n\n-----\n\nThis is the modus operandi of the two malicious components of InvisiMole. They turn the\naffected computer into a video camera, letting the attackers see and hear what’s going on in\nthe victim’s office or wherever their device may be. Uninvited, InvisiMole’s operators access\nthe system, closely monitoring the victim’s activities and stealing the victim’s secrets.\n\nOur telemetry indicates that the malicious actors behind this malware have been active at\n[least since 2013, yet the cyber-espionage tool was never analyzed nor detected until](https://www.welivesecurity.com/category/espionage/)\ndiscovered by ESET products on compromised computers in Ukraine and Russia.\n\nThe campaign is highly targeted – no wonder the malware has a low infection ratio, with\nonly a few dozen computers being affected.\n\nInvisiMole has a modular architecture, starting its journey with a wrapper DLL, and\nperforming its activities using two other modules that are embedded in its resources. Both\nof the modules are feature-rich backdoors, which together give it the ability to gather as\nmuch information about the target as possible.\n\nExtra measures are taken to avoid attracting the attention of the compromised user,\n[enabling the malware to reside on the system for a longer period of time. How the spyware](https://www.welivesecurity.com/category/spyware/)\nwas spread to the infected machines is yet to be determined by further investigation. All\ninfection vectors are possible, including installation facilitated by physical access to the\nmachine.\n\n## Installation and persistence\n\nThe first part of the malware we are looking at is a wrapper DLL, compiled with the Free\nPascal Compiler. From our telemetry, we have observed that this DLL is placed in the\nWindows folder, masquerading as a legitimate mpr.dll library file with a forged version info\nresource.\n\n\n-----\n\nFigure 1 – The wrapper DLL poses as a legitimate mpr.dll library, both by its name and version info\n\nWe have not seen a wrapper DLL named differently; however, there are hints in the DLL\ncode that it might be also named fxsst.dll or winmm.dll.\n\nThe first way in which the malware can be launched is by hijacking a DLL. Being placed in\nthe same folder as explorer.exe, the wrapper DLL is loaded during the Windows startup into\nthe Windows Explorer process instead of the legitimate library located in the\n%windir%\\system32 folder.\n\nWe have found both 32-bit and 64-bit versions of the malware, which makes this\npersistence technique functional on both architectures.\n\nAs an alternative to DLL hijacking, other loading and persistence methods are possible. The\nwrapper DLL exports a function called GetDataLength. When this function is called, the DLL\nchecks whether it was loaded by the rundll32.exe process with either explorer.exe or\nsvchost.exe as its parent process, and only then does it launch the payload. This suggests\nother possible persistence methods – by scheduling a task (i.e. having svchost.exe as a\nparent process) or by installation in a startup registry key (explorer.exe being the parent\nprocess).\n\nRegardless of the persistence method, the behavior of the malware and of the actual\npayload is the same in all cases. The wrapper DLL loads both the modules stored in its\nresources, named RC2FM and RC2CL, and (if DLL hijacking was used) finally loads the\nlegitimate library into the explorer.exe process, in order not to disrupt the normal operation\nof the application, and thereby remain hidden.\n\n\n-----\n\nFigure 2 – Exported functions of the wrapper DLL\n\n## Technical analysis\n\nThe exact date when the malware was compiled is unknown – the recent wrapper DLL\nsamples were tampered with by the malware authors, with the PE timestamps manually set\nto zero values. However, during our research, we found an earlier version of the malware\nwith a PE timestamp reading Oct 13, 2013, so the compilation date of the later version is\nalmost surely more recent.\n\nFigure 3 – The compilation timestamp is set to zero in all the latest samples\n\n## Encryption and decryption\n\nTo increase its level of stealth, the malware protects itself from the eyes of administrators\nand analysts by encrypting its strings, internal files, configuration data and network\ncommunication. While the RC2FM module uses a handful of custom ciphers, the wrapper\nDLL and the RC2CL module share one particular routine for all purposes, especially for\ndecrypting other malware modules embedded in the wrapper DLL.\n\n\n-----\n\nA script that is able to extract the embedded modules RC2FM and RC2CL from the wrapper\n[DLL, using this routine, is available on ESET’s malware-research GitHub repository.](https://github.com/eset/malware-research/tree/master/invisimole)\n\nFigure 4 – Encryption routine used across the samples (decompiled and disassembled)\n\n## Module RC2FM\n\nThe first, smaller module RC2FM contains a backdoor with fifteen supported commands.\nThese are executed on the affected computer when so instructed by the attackers. The\nmodule is designed to make various changes to the system but it also offers a bunch of\nspying commands.\n\nA logging option is implemented throughout the file but the name of the log file is not\nconfigured in the analyzed sample. This suggests that it was only used during the\ndevelopment of the malware.\n\n## Network communication\n\n\n-----\n\nThis module communicates with C&C servers that are either hardcoded in the sample, or\nupdated later by the attackers.\n\nMoreover, the module is able to reach out to the C&C servers even if there is a proxy\nconfigured on the infected computer. If a direct connection is unsuccessful, the module\nattempts to connect to any of its C&C servers using locally-configured proxies or proxies\nconfigured for various browsers (Firefox, Pale Moon, and Opera).\n\nRC2FM can go as far as inspecting the recently executed applications list and look\nspecifically for portable browser executables:\n\nFirefoxPortable.exe\nOperaPortable.exe\nRun waterfox.exe\nOperaAC.exe\nPalemoon-Portable.exe\n\nShould the victim use one of these portable browsers with a proxy server configured, the\nmalware can find that in the user’s preferences and use that proxy to communicate with its\nC&C servers.\n\nC&C communication consists of a series of HTTP GET and POST requests, as shown in\nFigure 5. The encrypted request includes a PC identifier and timestamp, and optionally\nsome other data. It is worth noting that the RC2FM module uses a number of encryption\nmethods (variations of a simple XOR encryption routine), unlike the other InvisiMole parts.\n\n\n-----\n\nFigure 5 – Example of a request sent to the C&C server by the RC2FM module\n\nAfter successfully registering the victim with the C&C server, additional data are\ndownloaded, which are to be interpreted on the local computer as backdoor commands.\n\n## Capabilities\n\nRC2FM supports commands for listing basic system information and performing simple\nchanges on the system, but also includes a few spyware features. When required by the\nattacker, it is capable of remotely activating the microphone on the compromised computer\nand capturing sounds. The audio recordings are encoded to MP3 format using a legitimate\nlame.dll library, which is downloaded and misused by the malware.\n\nAnother way in which the malware can interfere with the victim’s privacy is by taking\nscreenshots, which is another of the backdoor commands.\n\nThe malware also monitors all fixed and removable drives mapped on the local system.\nWhenever a new drive is inserted, it creates a list of all the files on the drive and stores it\nencrypted in a file.\n\nAll of the collected data can ultimately be sent to the attackers, when the appropriate\ncommand is issued.\n\n## Backdoor commands\n\nFifteen commands are supported, as listed below. The backdoor interpreter function is\nvisualized in Figure 6.\n\n**Command**\n**ID** **Command description**\n\n0 List information about mapped drives, list files in a folder, list network shares\n\n2 Create, move, rename, execute or delete a file, delete a directory using the\nspecified path\n\n4 Open a file, set the file pointer to the file beginning\n\n5 Close a previously opened file\n\n6 Write data into a previously opened file\n\n7 Modify file times / delete a file\n\n8 Open a file, set the file pointer to the end of the file\n\n10 Modify file times / delete a file\n\n\n-----\n\n**Command**\n**ID** **Command description**\n\n12 Search files by supplied file mask in a specified directory\n\n13 Take a screenshot\n\n14 Upload or modify files with internal data\n\n15 Record sound using input audio devices, list available devices, send\nrecordings, change configuration\n\n16 Check whether this module currently has any files open\n\n17 Update list of C&C servers\n\n19 Create, set, copy, enumerate or delete the specified registry keys or values\n\nFigure 6 – Backdoor interpreter function (original and after our analysis, changed using Group\n\nNodes functionality of IDA Pro for better readability)\n\n## Module RC2CL\n\nThe RC2CL module is also a backdoor with extensive spying capabilities. It is started by the\nwrapper DLL, launched at the same time as the RC2FM module. This one is more complex\nand offers features for collecting as much data about the infected computer as possible,\nrather than for making system changes.\n\nInterestingly, there is an option in the RC2CL module to turn off its backdoor functionality\nand act as a proxy. In this case, the malware turns off the Windows firewall and creates a\nserver that relays communication between a client and C&C server, or between two clients.\n\n\n-----\n\n## Network communication\n\nThe malware communicates with its C&C servers through a TCP socket. Messages sent\nfrom a client mimic the HTTP protocol, but note the invalid “HIDE” HTTP verb in the\nexample in Figure 7.\n\nThese requests comprise an identifier of the compromised PC, the request type, and\nencrypted data that are to be sent to the attackers, i.e. the results of the backdoor\ncommands or appeals for further instructions.\n\nFigure 7 – Example of a request sent to the C&C server by the RC2CL module\n\n## Capabilities\n\nDepending on the commands received, the backdoor can perform various actions on the\ninfected computer. Common backdoors often support commands such as file system\noperations, file execution, registry key manipulation or remote shell activation. This spyware\nsupports all of these instructions and a whole lot more – its 84 commands provide the\nattackers with all they need to look at their victims more closely.\n\nThe malware can inspect the infected computer and provide various data, from system\ninformation such as lists of active processes, running services, loaded drivers or available\ndrives, to networking information, including the IP forward table and the speed of the\ninternet connection.\n\nInvisiMole is capable of scanning enabled wireless networks on the compromised system. It\nrecords information such as the SSID and MAC address of the visible Wi-Fi access points.\nThese data can then be compared to public databases, letting the attackers track the\ngeolocation of the victim.\n\n\n-----\n\nOther commands can provide information about the users of the compromised machine,\ntheir accounts and previous sessions.\n\nThe software installed on the compromised computer is of particular interest. Which\nprograms are installed on the system? Which of them are executed automatically at each\nsystem start or user logon? Which programs are used by a particular user? If the attackers\nare interested, they are only one command away from these valuable data.\n\nThe malware can be instructed to search for recently-used documents or other interesting\nfiles. It can monitor specific directories and removable devices, report any changes and\nexfiltrate files of the attackers’ choice.\n\nThe malware may enable or disable the User Account Control (UAC), or even bypass the\nUAC and work with the files in secure locations without having administrator privileges (see\nmore at [https://wikileaks.org/ciav7p1/cms/page_3375231.html). If the malware is running](https://wikileaks.org/ciav7p1/cms/page_3375231.html)\nunder the explorer.exe process, which is auto-elevated, it can create an elevated COM\nobject and use it to delete or move files in locations that require admin rights.\n\nWhat is even more disturbing is that it can remotely activate the victim’s webcam and\nmicrophone and spy on the victim by taking pictures and recording sound. Screen activity\ncan be monitored by capturing screenshots. What is particularly interesting about InvisiMole\nis that not only are the usual “whole display” screenshots taken – it can separately capture\neach window, which helps the attackers gain more information even when the windows are\noverlapped.\n\nFurther, one of the backdoor commands is used to replace the contents of drivers with the\nfollowing names:\n\nblbdrive.sys\ncompbatt.sys\nsecdrv.sys\n\nWe have not observed the attackers actually using this command but we can speculate that\nit does so to achieve additional persistence on 32-bit systems.\n\nThough the backdoor is capable of interfering with the system (e.g. to log off a user,\nterminate a process or shut down the system), it mostly provides passive operations.\nWhenever possible, it tries to hide its activities.\n\nFor instance, the malware sniffs around interesting places on the system, reads recent\ndocuments or even modifies some files. This leaves traces on the system and could raise\nthe victim’s suspicions as the time of the last access or modification of the files is changed\nwith each such activity. To prevent this, the malware always restores the original file access\nor modification times, so that the user is unaware of its operation.\n\n\n-----\n\nAnother example of how the malware authors attempt to act covertly is the way they treat\ntraces left on the disk. The malware collects loads of sensitive data, which are then\ntemporarily stored in files and deleted after they have been successfully uploaded to the\nC&C servers. Even the deleted files can, however, be recovered by an experienced system\nadministrator, which could help further investigation of the attack – after the victim becomes\naware of it. This is possible due to the fact that some data still reside on a disk even after a\nfile is deleted. To prevent this, the malware has the ability to safe-delete all the files, which\nmeans it first overwrites the data in a file with zeroes or random bytes, and only then is the\nfile deleted.\n\n## Internal storage\n\nThe backdoor configuration and the data collected are stored in one of two places – a\nworking directory and working registry keys. A substantial portion of the backdoor command\nset is dedicated to manipulating these storage locations and their contents.\n\nThe location of the working directory is determined by the instructions from the remote\nserver. The directory is used as temporary storage for files containing collected data about\nthe compromised computer. Such files share a common naming convention, encryption\nalgorithm and structure. They are encrypted by a simple variation of the XOR cipher which\nis used across the malware components. The type of the file can be derived from the 4-byte\ncontrol sequences placed at the beginning of the file.\n\nBesides being a storehouse for the gathered data, the working directory is also home to a\ncopy of the legitimate WinRAR.exe application. This is copied by the malware and abused\nby the attackers for compressing the data that are to be exfiltrated.\n\nThe working registry keys store configuration data, as well as a list of files in the working\ndirectory. The data are packed using a Zlib routine implemented in the malware binary and\nencrypted with the same cipher as the internal files.\n\n\n**Subdirectory name** **File name**\n\n\n**Control**\n**sequences** **File content**\n\n\n\\ ~mrc_%random%.tmp 932101DA Audio\nrecordings\n\n\\ ~src_%random%.tmp 958901DA Audio\nrecordings\n\n\\ ~wbc_%random%.tmp 938901DA Webcam photos\n\nsc\\ ~sc%random%.tmp DFE43A08 Screenshots\n\n~zlp\\ zdf_%random%.data B1CBF218 Zlib-compressed\npackages\n\n\n-----\n\n**Subdirectory name** **File name**\n\n\n**Control**\n**sequences** **File content**\n\n\n~lcf\\ tfl_%random% C0AFF208 Internal data\n\nfl_%timestamp%\\strcn%num%\\ fdata.dat A1CAF108 Data from\nremovable\ndrives\n\nfl_%timestamp%\\strcn%num%\\ index.dat BAAB0019 Data from\nremovable\ndrives\n\nWinrar\\ WinRAR.exe - Copy of a\nlegitimate\napplication\n\nWinrar\\ comment.txt - \nWinrar\\ descript.ion - \nWinrar\\ Default.SFX - \nWinrar\\ main.ico - \n## Backdoor commands\n\nThe backdoor provides more than eighty commands that utilize the working directory and\nregistry keys to store their intermediate results and configuration data. The graph of the\nbackdoor interpreter is shown in Figure 8.\n\nApproximately a third of the commands are dedicated to reading and updating the\nconfiguration data stored in the registry. The rest of the commands are listed in the table\nbelow.\n\n**Command**\n**ID(s)** **Command description**\n\n4 List information about files in a directory\n\n6 Upload a file\n\n20 List information about active processes\n\n22 Terminate a process by ID\n\n24 Execute a file\n\n26 Delete a file\n\n\n-----\n\n**Command**\n**ID(s)** **Command description**\n\n28 Get the IP forward table\n\n30 Write data to a file\n\n31 Sleep\n\n38 List account information\n\n40 List information about services on the system\n\n42 List information about loaded drivers\n\n43 Collect basic system information (computer name, OS version, memory\nstatus, local time, drive information, configured proxy information, system\nand process DEP policy…)\n\n44 List installed software\n\n46 List local users and session information\n\n48 List applications accessed by users\n\n52 Create a directory structure\n\n78 Create a remote shell\n\n81 Execute a command via a remote shell\n\n91 Enable/disable UAC\n\n93 Log off the user/shutdown/restart the system\n\n101 Monitor and record changes in the specified directories\n\n103 Delete directories\n\n109 Turn the monitor on/off/onto standby\n\n120 Capture screenshots of the display/active windows\n\n126 Capture screenshots of the display/active windows & update configuration\ndata\n\n130 List information about resources on unmapped drives\n\n132 Rename/move a file, modify create/access/write times of the file to the given\nvalues\n\n134 List information about recently opened files\n\n\n-----\n\n**Command**\n**ID(s)** **Command description**\n\n152 Disconnect (previously connected) remote drives\n\n155 Create/delete a registry key, set/delete a registry key value, or enumerate\nregistry values/keys/data\n\n159, 161 Disable routing/firewall, create a proxy server on a specified port\n\n172 Repeatedly display a dialog requesting the user to reboot the computer\n\n175 Bypass UAC to manipulate a file\n\n177 Create and write a file, set the create/access/modify times\n\n181 Remove all system restore points\n\n183 Drop (legitimate) WinRAR components\n\n185 Add files to a password-protected archive (password = \"12KsNh92Dwd\")\n\n187 Decrypt, unpack and load a DLL, load executables from its resources\nRC2CL, RC2FM\n\n189 Create a system restore point\n\n191 Extract a password-protected archive (12KsNh92Dwd)\n\n193 Modify an encrypted file\n\n195 Restart itself after the primary process finishes\n\n197 Send 198 bytes of data hardcoded in the sample\n\n199 Rename/move a file\n\n206 Decrypt, unpack and load a DLL, load executables from its resources\nRC2CL, RC2FM\n\n211 Upload collected information (captured screenshots, audio recordings, etc.)\n\n213 List information about active windows\n\n218 API for recording input audio devices\n\n220 API for capturing webcam photos\n\n224 List files executed with each system start\n\n226 List information about enabled wireless networks (MAC address, SSID,\nbeacon interval)\n\n\n-----\n\n**Command**\n**ID(s)** **Command description**\n\n228 Drop a Zlib-compressed package\n\nFigure 8 – Backdoor interpreter function (original and after our analysis, changed using Group\n\nNodes functionality of IDA Pro for better readability)\n\n## Conclusion\n\nInvisiMole is fully-equipped spyware whose rich capabilities can surely compete with other\nespionage tools seen in the wild.\n\nWe can only wonder why the authors decided to use two modules with overlapping\ncapabilities. One might think the smaller module, RC2FM, is used as an initial\nreconnaissance tool, while the bigger RC2CL module is only run on interesting targets. This\nis, however, not the case – both of the modules are launched simultaneously. Another\npossible explanation is that the modules might have been crafted by various authors and\nthen bundled together to provide the malware operators a more complex range of\nfunctionalities.\n\n\n-----\n\nThe malware uses only a few techniques to avoid detection and analysis, yet, deployed\nagainst a very small number of high-value targets, it was able to stay under the radar for at\nleast five years.\n\n## Indicators of Compromise (IoCs)\n\nA full and comprehensive list of IoCs, C&C servers, along with registry keys and values can\nbe [found on GitHub.](https://github.com/eset/malware-ioc/tree/master/invisimole)\n\n7 Jun 2018 - 03:00PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-06-07 - InvisiMole- Surprisingly equipped spyware, undercover since 2013.pdf"
    ],
    "report_names": [
        "2018-06-07 - InvisiMole- Surprisingly equipped spyware, undercover since 2013.pdf"
    ],
    "threat_actors": [
        {
            "id": "11f52079-26d3-4e06-8665-6a0b3efdc41c",
            "created_at": "2022-10-25T16:07:23.736987Z",
            "updated_at": "2025-03-27T02:02:09.954078Z",
            "deleted_at": null,
            "main_name": "InvisiMole",
            "aliases": [
                "UAC-0035"
            ],
            "source_name": "ETDA:InvisiMole",
            "tools": [
                "InvisiMole"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12b5d602-4017-4a6f-a2a3-387a6e07a27b",
            "created_at": "2023-01-06T13:46:39.095233Z",
            "updated_at": "2025-03-27T02:00:02.995336Z",
            "deleted_at": null,
            "main_name": "InvisiMole",
            "aliases": [],
            "source_name": "MISPGALAXY:InvisiMole",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535985,
    "ts_updated_at": 1743041431,
    "ts_creation_date": 1653705950,
    "ts_modification_date": 1653705950,
    "files": {
        "pdf": "https://archive.orkl.eu/78edc2128be0b585ea78c2db232ff78ad4f4c50b.pdf",
        "text": "https://archive.orkl.eu/78edc2128be0b585ea78c2db232ff78ad4f4c50b.txt",
        "img": "https://archive.orkl.eu/78edc2128be0b585ea78c2db232ff78ad4f4c50b.jpg"
    }
}