{
    "id": "2767e3ea-a53c-4f9d-8c0c-dc60005dd479",
    "created_at": "2023-01-12T14:59:58.176738Z",
    "updated_at": "2025-03-27T02:11:24.530924Z",
    "deleted_at": null,
    "sha1_hash": "8ef075e5f45c0a75a5e3850bb2684b38db82bfbf",
    "title": "2020-03-24 - WildPressure targets industrial-related entities in the Middle East",
    "authors": "",
    "file_creation_date": "2022-05-28T15:09:18Z",
    "file_modification_date": "2022-05-28T15:09:18Z",
    "file_size": 774105,
    "plain_text": "# WildPressure targets industrial-related entities in the Middle East\n\n**[securelist.com/wildpressure-targets-industrial-in-the-middle-east/96360/](https://securelist.com/wildpressure-targets-industrial-in-the-middle-east/96360/)**\n\nAuthors\n\n[Denis Legezo](https://securelist.com/author/denislegezo/)\n\nIn August 2019, Kaspersky discovered a malicious campaign distributing a fully fledged C++\nTrojan that we call Milum. All the victims we registered were organizations from the Middle\nEast. At least some of them are related to industrial sector. Our Kaspersky Threat Attribution\nEngine (KTAE) doesn’t show any code similarities with known campaigns. Nor have we seen\nany target intersections. In fact, we found just three almost unique samples, all in one\ncountry. So we consider the attacks to be targeted and have currently named this operation\nWildPressure.\n\nThe compilation timestamps for all these files is the same – March 2019. This is consistent\nwith the fact that we registered no infections before May 31, 2019, so the compilation dates\ndon’t seem to be spoofed. For their campaign infrastructure, the operators used rented OVH\nand Netzbetrieb virtual private servers (VPS) and a domain registered with the Domains by\nProxy anonymization service.\n\n\n-----\n\nThe malware uses the JSON format for configuration data and as a C2 communication\nprotocol over HTTP as well. Inside the encrypted communications within the HTTP POST\nrequests, we found several interesting fields. One of them shows the malware version –\n1.0.1. A version number like this indicates an early stage of development. Other fields\nsuggest the existence of, at the very least, plans for non-C++ versions.\n\nThe only encryption implemented is the RC4 algorithm with different 64-byte keys for\ndifferent victims. Also, the developers were kind enough to leave RTTI data inside the files.\nKaspersky products detect this malware as Backdoor.Win32.Agent. For more information,\nplease contact: [intelreports@kaspersky.com](http://10.10.0.46/mailto:intelreports@kaspersky.com)\n\n## Why we call it Milum and why it’s of interest\n\nAll the aforementioned C++ Trojans are compiled as standalone PE files, originally named\nMilum46_Win32.exe. The word ‘milum’ is used in the C++ class names inside the malware,\nso we named the Trojan after it.\n\nAnother distinctive characteristic is that the malware exports lots of zlib compression\nfunctions, such as zlibVersion(), inflate() or deflate(). This compression is needed for C2\ncommunication, but in reality there is no need to export them in the case of a standalone\napplication.\n\nThe JSON configuration fields are not limited to just the version and programming language;\nthe campaign operators also use target IDs that are found in the samples. Among them, we\nfound HatLandM30 and HatLandid3 – neither of which we are familiar with. The following\n\n\n-----\n\ntable provides Milum samples that have similar PE header compilation timestamps but\ndifferent target IDs:\n\n**Milum46_Win32.exe sample MD5 hash** **Timestamp (GMT)** **clientid**\n\n0C5B15D89FDA9BAF446B286C6F97F535 2019.03.09 06:17:19 839ttttttt\n\n17B1A05FC367E52AADA7BDE07714666B 2019.03.09 06:17:19 HatLandid3\n\nA76991F15D6B4F43FBA419ECA1A8E741 2019.03.09 06:17:19 HatLandM30\n\nRather than describing all the configuration fields one by one, we have gathered them\ntogether in the following table, with all the main characteristics for this malware family:\n\n\nProgramming\nlanguage\n\nConfiguration\ndata\n\nNetwork\nprotocol\n\n\nC++ with STL functions used mostly to parse JSON data and exception\nhandling.\n\nBase64-encoded JSON data in PE resources. Includes timeouts, C2 URLs\nand keys for communication, including RC4 64-byte key.\n\nTrojan transmits compressed JSON data in HTTP POST requests with\ngzip, base64-encoded and RC4 encrypted.\n\n\nBeacon data Encrypted JSON contains the malware version “1.0.1”, Epoch timestamp\nand client id. It also has specific fields such as “vt” and “ext” that\ncorrespond to programming language “c++” and file extension “exe”. If our\nhypothesis is correct, this suggests that non-C++ Trojan versions may be\nplanned, if not already implemented.\n\nPersistence HKCU autorun system registry keys Run and RunOnce.\n\nEncryption The communication encryption used is RC4 with the 64-byte key stored in\nthe configuration data.\n\nCompression For compression the Trojan uses an embedded gzip code. For some\nreason gzip functions are exported from PE, although the samples are\nstandalone executables, not DLLs.\n\n## Let’s dig a little deeper inside\n\nThe most popular sample in our telemetry was:\n\n**MD5** 0c5b15d89fda9baf446b286c6f97f535\n\n**Compiled** 2019.03.09 06:17:19 (GMT)\n\n**Size** 520704\n\n**Internal name** Milum46_Win32.exe\n\n\n-----\n\nThis application exists as an invisible toolbar window. The main malicious functions are\nimplemented in a separate thread. Milum decodes its configuration data and, besides\ntimeouts, it gets the parameters “clientid” and “encrypt_key” to use in RC4 encryption.\n\n**_Example of the decoded and beautified configuration data. The “clientid” field differs_**\n**_in every sample observed_**\n\nThe following table describes the different configuration parameters:\n\n**Config parameter** **Parameter features**\n\nshortwait Pause in milliseconds between C2 communication working cycles\n\nclientid Unique ASCII target name\n\nencrypt_key RC4 encryption key for JSON-based C2 communications\n\nrelays – url Full URL to send HTTP POST beacon and GET commands\n\nrelays – key Unique ASCII key for each C2 to communicate with it\n\nThe operators can run the Trojan using the key (“b” or “B”) as the first argument and the file\nname as the second. In this case, Milum will delete the file sent as a parameter. Then the\nTrojan will create the C:\\ProgramData\\Micapp\\Windows\\ directory and parse its configuration\ndata to form the beacon to send to its C2.\n\n\n-----\n\nTo send the beacon, Milum uses the HTTP POST request with three parameters as\nenumerated in the table below.\n\n\n**Beacon**\n**parameter**\n\n\n**Parameter values**\n\n\nmd Clientid from config, with prefix 01011 and random five-character\nASCII suffix\n\nnk Key from config to communicate with C2, differs for each server\n\nval Compressed, encrypted and encoded command JSON data\n\nThe first two parameters are taken from the configuration data. The third one is encrypted\nand after decryption, decompression, decoding and beautifying, it looks like this:\n\n**_Decoded and beautified JSON beacon to C2. In this case, the connection to the first_**\n**_server was unsuccessful_**\n\nThere are several fields worth mentioning here. We referred above to different programming\nlanguages besides C++: “vt” seems to reference a programming language and “ext” a file\nextension. The only reason that we could think of for keeping these is if the attackers have\nseveral Trojans, written in different languages, to work with the same control server.\n\nRegarding the “command” field, the control servers were inaccessible at the time of the\nanalysis, so we don’t have commands from them. However, we analyzed the command\nhandlers in Milum’s code as described below:\n\n**Code** **Meaning** **Features**\n\n\n-----\n\n1 Execution Silently execute received interpreter command and return result\nthrough pipe\n\n\n2 Server to\nclient\n\n3 Client to\nserver\n\n\nDecode received content in “data” JSON field and drop to file\nmentioned in “path” field\n\nEncode file mentioned in received command “path” field to send it\n\n\n4 File info Get file attributes: hidden, read only, archive, system or executable\n\n5 Cleanup Generate and run batch script to delete itself\n\n\n6 Command\nresult\n\n7 System\ninformation\n\n8 Directory\nlist\n\n\nGet command execution status\n\nValidate target with Windows version, architecture (32- or 64-bit),\nhost and user name, installed security products (with WQL request\n“Select From AntiVirusProduct WHERE displayName <>’Windows\nDefender'”)\n\nGet info about files in directory: hidden, read only, archive, system or\nexecutable\n\n\n9 Update Get the new version and remove the old one\n\n## Who was attacked?\n\nAccording to our telemetry, the Milum Trojan was exclusively used to attack targets in the\nMiddle East from at least the end of May 2019.\n\n\n-----\n\n**_Number of detections for one of the samples from September 2019_**\n\nWe were able to sinkhole one of the WildPressure C2 domains (upiserversys1212[.]com) in\nSeptember 2019. The vast majority of visitor IPs were also from the Middle East, and we\nbelieve the rest were network scanners, TOR exit nodes or VPN connections.\n\n**_C2 domain sinkholing also shows active infections mostly from the Middle East_**\n\n## And who’s behind it?\n\n\n-----\n\nTo date we haven’t observed any strong code- or victim-based similarities with any known\nactor or set of activity. Their C++ code is quite common, regarding configuration data and\ncommunication protocol malware uses base64-encoded JSON-formatted configuration data\nstored in the binary’s resource section and parses it with Standard Template Library (STL)\nfunctions. However, these commonalities are not conclusive enough for attribution and our\nhypothesis is that they are merely coincidence. We will continue to monitor this activity\n\n## To sum up\n\nTo date, we don’t have any data regarding Milum’s spreading mechanism. A campaign that\nis, apparently, exclusively targeting entities in the Middle East (at least some of them are\nindustrial-related) is something that automatically attracts the attention of any analyst. Any\nsimilarities should be considered weak in terms of attribution, and may simply be techniques\ncopied from previous well-known cases. Indeed, this “learning from more experienced\nattackers” cycle has been adopted by some interesting new actors in recent years.\n\nWe should also be cautious regarding the true targeting of this new set of activities, as it is\nprobably too soon to jump to conclusions. The targeted nature seems to be clear, but the\ntargeting itself might be limited by our own visibility. The malware is not exclusively designed\nagainst any kind of victim in particular and might be reused in other operations.\n\n## Indicators of compromise\n\n**Files MD5**\n\n0C5B15D89FDA9BAF446B286C6F97F535\n\n17B1A05FC367E52AADA7BDE07714666B\n\nA76991F15D6B4F43FBA419ECA1A8E741\n\nOriginal file names are Milum46_Win32.exe; on the target side they exist as system32.exe\n\n**URLs**\n\nupiserversys1212[.]com/rl.php\n\n37.59.87[.]172/page/view.php\n\n80.255.3[.]86/page/view.php\n\n[Encryption](https://securelist.com/tag/encryption/)\n[Industrial threats](https://securelist.com/tag/industrial-threats/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Sinkholing](https://securelist.com/tag/sinkholing/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\n\n-----\n\n[Denis Legezo](https://securelist.com/author/denislegezo/)\n\nWildPressure targets industrial-related entities in the Middle East\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-24 - WildPressure targets industrial-related entities in the Middle East.pdf"
    ],
    "report_names": [
        "2020-03-24 - WildPressure targets industrial-related entities in the Middle East.pdf"
    ],
    "threat_actors": [
        {
            "id": "3c652e4b-2f17-4e18-bd05-af12c27e76fb",
            "created_at": "2023-11-30T02:00:07.302263Z",
            "updated_at": "2025-03-27T02:00:03.258682Z",
            "deleted_at": null,
            "main_name": "WildPressure",
            "aliases": [],
            "source_name": "MISPGALAXY:WildPressure",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ef437d-e8fa-4250-9a99-89a403035ad2",
            "created_at": "2022-10-25T16:07:24.406019Z",
            "updated_at": "2025-03-27T02:02:10.210953Z",
            "deleted_at": null,
            "main_name": "WildPressure",
            "aliases": [
                "WilePressure"
            ],
            "source_name": "ETDA:WildPressure",
            "tools": [
                "Milum"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535598,
    "ts_updated_at": 1743041484,
    "ts_creation_date": 1653750558,
    "ts_modification_date": 1653750558,
    "files": {
        "pdf": "https://archive.orkl.eu/8ef075e5f45c0a75a5e3850bb2684b38db82bfbf.pdf",
        "text": "https://archive.orkl.eu/8ef075e5f45c0a75a5e3850bb2684b38db82bfbf.txt",
        "img": "https://archive.orkl.eu/8ef075e5f45c0a75a5e3850bb2684b38db82bfbf.jpg"
    }
}