{
    "id": "278197ed-eb2d-4ed0-8611-c4d12562cae2",
    "created_at": "2024-10-25T02:05:47.417589Z",
    "updated_at": "2025-03-27T02:13:11.967132Z",
    "deleted_at": null,
    "sha1_hash": "488d087104033e9f7df7db43c33d300a079dc036",
    "title": "North Korean Fake Employees Are Everywhere: How to Protect Your Organization",
    "authors": "",
    "file_creation_date": "2024-09-18T09:11:07Z",
    "file_modification_date": "2024-09-18T09:11:12Z",
    "file_size": 2775528,
    "plain_text": "# Employees Are Everywhere!\n## How to Protect Your Organization\n\n##### by Roger A. Grimes\n\n###### Data-Driven Defense Evangelist\n\n\n-----\n\n### North Korean Fake Employees Are Everywhere! How To Protect Your Organization\n\n###### Table of Contents\n\n**Introduction** 2\n\nLegal Consequences of Knowingly Hiring a North Korean Employee 3\n\nKnowBe4’s North Korean Fake Employee Hire 3\n\n**Background on North Korean Fake Employees** 6\n\nEvolution 7\n\nGrowing Warnings and Other Sources 8\n\nGeneral Infrastructure 10\n\n_Laptop Farms_ 11\n\nInbound/Outbound Strategies 13\n\nOther Fake Employers and Fake Employees 13\n\nIntentions 15\n\n**Signs of a North Korean Fake Employee** 15\n\n**How To Protect Your Organization** 17\n\n**Summary** 19\n\n\n-----\n\n#### It is likely that thousands of organizations around the world are accidentally hiring North Korean fake employees.\n\n\n#### It is likely that thousands of organizations around the world\n\n\n##### INTRODUCTION\n\n\nOn July 23, 2024, KnowBe4 publicly released information about how a North Korean “fake\n[employee” was accidentally hired and detected (https://blog.knowbe4.com/how-a-north-korean-](https://blog.knowbe4.com/how-a-north-korean-fake-it-worker-tried-to-infiltrate-us)\n[fake-it-worker-tried-to-infiltrate-us).](https://blog.knowbe4.com/how-a-north-korean-fake-it-worker-tried-to-infiltrate-us)\n\nIn some ways, we were lucky, but we worked extremely hard to be prepared for our “luck.”\nWe detected the fake employee very quickly after they started to access the laptop we had sent\nthem in unusual ways. We shut down their corporate access within 25 minutes of our first security\nalert. At no time did they have access to customer data.\n\n\nAfter we published our account,\nseveral other organizations and law\nenforcement agencies thanked us\nfor publicly posting about the “North\nKorean fake employee” problem. It\nturns out that many other companies\nhad done the same thing but kept their\nexperiences private for various reasons\nand fears. Our public revelation\nappears to have opened up a cascade\nof public information sharing.\n\n\n###### “Within a few weeks, we heard from over a dozen other companies who either hired North Korean employees or had been besieged by a multitude of fake resumes and applications...”\n\n\nWithin a few weeks, we heard from over a dozen other companies who either hired North Korean\nemployees or had been besieged by a multitude of fake resumes and applications submitted by\nNorth Koreans hoping to get a job with their organization. Many organizations contacting us (or in\nsome cases, we contacted them) asked that we keep their information and experiences private or\nanonymized, while a few others publicly posted about their own experiences.\n\nIt turns out that the North Korean fake employee problem is a complex, industrial, scaled nationstate operation, and it is likely that thousands of organizations around the world have or are now\ninvolved in accidentally hiring North Korean fake employees.\n\n\n-----\n\nHundreds of U.S. companies have done so. We know of Fortune 500 companies that accidentally\nhired North Korean fake employees and many much smaller companies (12 employees, 20\nemployees, etc.) that did the same. It is a serious risk for any company with remote-only employees.\n\nThis whitepaper will share what the North Korean fake employee industry is like, share many of\nthe signs of dealing with North Korean fake employees, and discuss many ways organizations can\nupdate their hiring policies to prevent hiring such employees.\n\n_Note: North Korea is officially known as the Democratic People’s Republic of Korea (DPRK)._\n\n###### Legal Consequences of Knowingly Hiring a North Korean Employee\n\nIt is illegal for a United States-based or U.S.-located organization (and other United Nations\nmembers) to knowingly hire a North Korean due to U.S. law and United Nations (UN) sanctions.\n[In 2017, UN Security Council resolution 2375 (https://main.un.org/securitycouncil/en/s/res/2375-](https://main.un.org/securitycouncil/en/s/res/2375-%282017%29)\n[%282017%29) prohibited UN member states and territories from allowing North Koreans to do](https://main.un.org/securitycouncil/en/s/res/2375-%282017%29)\nwork for them unless approved in advance by the UN Security Council’s 1718 Committee. The\nU.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) has the authority to\nsanction or fine individuals or organizations knowingly working with North Korean organizations\nor citizens, through Economic Sanctions Enforcement Guidelines, 31 C.F.R. part 501 and North\nKorea Sanctions Regulations, 31 C.F.R. part 510. In short, anyone knowingly hiring or working with\na North Korean person or organization can face very stiff penalties, including jail time and the\ninability to work with U.S.-based companies and banks.\n\n_Note: The U.S. even offers rewards of up to $5M for information on illicit North Korean activities:_\n_[https://rewardsforjustice.net/index/?north-korea=north-korea.](https://rewardsforjustice.net/index/?north-korea=north-korea)_\n\n###### KnowBe4’s North Korean Fake Employee Hire\n\nKnowBe4 needed a principal software engineer for our growing internal IT Artificial Intelligence\n[team. We posted the job on KnowBe4’s job website, https://www.knowbe4.com/careers and](https://www.knowbe4.com/careers)\nreceived, as we always do, a ton of resumes. We reviewed the resumes and conducted multiple\ninterviews. Our finalist job candidate went through four remote Zoom-based interviews with\nvarious internal employees, gave references, and sent us a copy of what we thought was an\nofficial government identification card. We performed our normal background checks, which\nat the time were more focused on looking for any past criminal acts or other traditional hiring\nred flags. We checked references, which were very positive, and after a clear background check,\nwe hired them.\n\nThis is who we thought we hired. He called himself Kyle.\n\n\n-----\n\nWhoever was behind the fake employee persona posed as a U.S.-born citizen of Asian ancestry,\nwho was educated in Hong Kong and previously worked at multiple large U.S.-based companies.\nWe soon learned that the name and various identifying information was taken from another real\nU.S. citizen without their permission. But that real U.S. person’s identity passed the previous\nversion of our background checks.\n\n_Note: We are not sharing the last name because we want to protect the privacy of the real U.S. citizen._\n\nThe picture above was submitted as part of the onboarding process into our corporate and\nHR systems. The picture is an AI-enhanced version of the person who we interviewed during\nthe hiring process, where the applicant’s face was added over a completely different unrelated\nperson’s “stock photography” picture so they looked more professional with glasses and\nwearing formal work attire.\n\nAfter they accepted the job, we sent them a Mac workstation, which, unknown to\nthe receiver (or simply ignored), contained a lot of good security and monitoring\nsoftware. We also sent them a multifactor FIDO-enabled YubiKey so they\ncould log into our network. The new employee came up with a plausible\nexcuse so that we would ship the laptop to another location that was\nnot indicated on their resume or other submitted information. As you\nwill soon learn, this is one of the common signs of a North Korean\nemployee.\n\nEvery KnowBe4 employee and contractor can only access the\napplications and data they need to see to perform their roles and\ntasks. In nearly all instances, this is a very limited set of resources,\nbut more so for new hires. Newly hired employees must take a week\nor more of training before being released to their team for even more\ntraining and oversight as they begin to perform their expected duties.\n\nNew employees undergoing training basically have access to\ncorporate email, Zoom, and internal messaging (i.e., Slack), along with\na very restricted training system with no access to real customer data.\nThey do not have access to any shared, mapped drives. No confidential\ndata is stored locally on laptops.\n\nOn July 15, 2024, at 9:55 PM EST, the day and time the employee received\nand powered on the laptop, they tried (and failed multiple times) to install\npassword-stealing malware and manipulate session history logs. At first, they\ntried to download the malware from a USB device, and when that failed, they tried\nto do the same using a server located on their local network.\n\nThe Mac’s endpoint, detection, and response (EDR) software immediately created an alert\ngenerated by the attempted malware install. Our InfoSec security operations center (SOC) noted\nthe alert and, within minutes, contacted the new employee using Slack. At this time, our SOC\nemployee did not know we had a North Korean employee situation. They were just reaching\nout to offer well-meaning help and to see if there could be a legitimate reason why unexpected\nmalware upload and log file change alert messages had been generated.\n\nThe person answering the Slack message came back with a strange excuse that did not match\nthe alerts. The remote employee offered up that the alerts were generated while they were\ntroubleshooting a speed issue with their local Internet router. The remote employee’s excuses\nwere not making sense, so the SOC employee asked them to get on an audio chat (i.e., Slack\nhuddle) so both sides could more easily discuss what was going on.\n\n\n-----\n\nThe remote employee made an excuse about why they could not get on audio. They eventually\nstopped communicating on Slack altogether. This immediately triggered a heightened sense\nof caution in the SOC agent. Within a few minutes, in consultation with other senior InfoSec\nemployees, it was decided to fully isolate the system from our network while logs and additional\nsurveillance information were collected. The laptop was locked down around 10:20 PM EST, 25\nminutes from the first alert.\n\nAdditional KnowBe4 InfoSec employees were brought in, and they shared the collected data with\nothers at Mandiant, a leading global cybersecurity expert, and the FBI, to corroborate our initial\nfindings. In a short period of time, it was definitively determined that this case had all the signs\nof a North Korean fake employee scam. We collected as much information as we could remotely\nfrom the laptop. We learned a lot about what had been attempted on the laptop as well as useful\nnetwork information.\n\nWe learned that a device\nrunning the Raspberry Pi OS\nwas setup to remotely access our\nlaptop as a KVM (Keyboard, Video,\nMouse) device, so that the remote\nNorth Korean employee and\ntheir helpers could access the\nlaptop without alerting our\nSOC to the presence of a strange,\nunexpected TCP/IP port traffic\nthat a normal remote access\napplication (e.g., Microsoft\nRemote Desktop Protocol, Virtual\nNetwork Computing, SSH, etc.) would create. No customer or\nconfidential data was viewed, compromised, or exfiltrated from\nany KnowBe4 service or system.\n\nWe eventually came into contact with other security consultants\nwho were well aware of the North Korean fake employee\nschemes. Out of an abundance of caution, we decided to\ninvolve the FBI. The FBI thanked us for our call and cooperation.\nThey said they were aware of many more cases involving North\nKorean fake employees, but most victim organizations do not\nreport it or cooperate.\n\nWe told our new “employee” that they were being fired for\nviolations of company policy (e.g., not wanting to get on camera,\nunauthorized software installs, etc.) and asked them to send\nback our laptop. To our surprise, they sent the laptop back, and we turned it over to the FBI.\nLater on, we learned that other companies who requested their equipment back also got their\nequipment back. We can only guess the involved perpetrator(s) does not want an additional\nfelony for a stolen equipment charge added to their list of illegalities.\n\nStu Sjouwerman, CEO of KnowBe4, was made aware of the situation. Once the relevant facts\nwere known and confirmed, Stu (as he is known to everyone), decided to let all employees know\nwhat happened. A few days later, at our daily employee meeting, Stu shared what had happened.\nAnother few days later, on July 23, 2024, KnowBe4 publicly released information about how a\n[North Korean “fake employee” was accidentally hired and detected (https://blog.knowbe4.com/](https://blog.knowbe4.com/how-a-north-korean-fake-it-worker-tried-to-infiltrate-us)\n[how-a-north-korean-fake-it-worker-tried-to-infiltrate-us).](https://blog.knowbe4.com/how-a-north-korean-fake-it-worker-tried-to-infiltrate-us)\n\n\nfrom the laptop. We learned a lot about what had been attempted on the laptop as well as useful\n\nNetwork Computing, SSH, etc.) would create. No customer or\nconfidential data was viewed, compromised, or exfiltrated from\n\nWe eventually came into contact with other security consultants\nwho were well aware of the North Korean fake employee\n\n\n-----\n\nNote: Stu is an unusually transparent CEO. He frequently publicly shares things that most other\nCEOs would not, like when he had failed a simulated phishing test or that time when he clicked\non a real phish (and quickly reported it). People who know Stu or KnowBe4 were not surprised\nwhen we shared our latest experience, even though it meant sharing with the world that we had a\nprevious gap in our hiring processes.\n\nAlthough we did get some early negative feedback from a few critics, the vast majority of\nresponses were overwhelmingly positive. Many people thanked us for being among the first\ncompanies to share our North Korean fake employee experience. We got an enormous response\nto our blog article and dozens of media sources wrote to share our story. Some of the media\nsources got some of the facts wrong and we subsequently wrote a few more clarifying articles,\nincluding these:\n\n[https://blog.knowbe4.com/north-korean-fake-it-worker-faq](https://blog.knowbe4.com/north-korean-fake-it-worker-faq )\n\n[https://blog.knowbe4.com/how-the-whole-world-now-knows-about-fake-north-korean-it-workers](https://blog.knowbe4.com/how-the-whole-world-now-knows-about-fake-north-korean-it-workers )\n\nThere is a common long-time complaint in the cybersecurity industry that organizations often\ndo not publicly share when they have been exploited unless required by law, and even then,\nthey often do not include enough useful details to allow other organizations to better protect\nthemselves. This is often because victim companies, rightfully, worry about potential legal\nconsequences of admitting they had a security gap and because they worry about resulting\nnegative publicity or customer responses.\n\nAfter hearing from many other organizations who had also hired (or almost hired) North Korean\nfake employees, but had not publicly shared the information, we decided we needed to tell other\norganizations how to recognize the signs of North Korean fake employees and give suggestions\nfor updating hiring processes. To that end, we created this free whitepaper, created two public\nwebinars, and released more related articles.\n\nIf our experience helps other organizations to avoid hiring North Korean fake employees, then we\nhave accomplished our objectives.\n\n\n##### BACKGROUND ON NORTH KOREAN FAKE EMPLOYEES\n\n\nOne of the most important points to understand about the North Korean fake employees’\nscheme is that it is known about, developed, approved, and directed at the highest levels of the\nDPRK regime, including by DPRK leader Kim Jong Un. The North Korean fake employees’ program,\noften known as the ‘DPRK IT workers’ in other industry literature, provides a large egress of\nrevenue to North Korea, and in particular to its sanctioned weapons development program, which\nincludes nuclear weapons and other weapons of mass destruction.\n\nNorth Korea understands the importance that IT and online cyber activities and services play in\ntoday’s world and in the future success of North Korea. To that end, North Korea has established\nmany schools and universities dedicated to IT skills and cybersecurity. Many of the most\npromising IT graduates, especially developers with good English-speaking skills, are siphoned off\ninto the North Korean fake employee program.\n\nThere are likely thousands of North Koreans involved in the program, both within North Korea and\nelsewhere. North Korean fake employees are often located outside of North Korea for a bunch of\nreasons, including the fact that North Korea’s Internet IP address space is very limited and known.\nIf North Korea was using Internet access from within North Korea to perform the fake worker\n\n\n-----\n\nprogram, it would require more hiding and re-routing or it would be more easily spotted and\nblocked. On top of that, North Korea has spotty Internet access, frequent power interruptions, and\nother infrastructure issues that would make such a program harder to accomplish.\n\nBecause of these internal infrastructure challenges, North Koreans involved in the fake employee\nscheme are often located in foreign countries and continents, such as China, Malaysia, Russia,\nAfrica, and other countries in Southeast Asia. China seems to be the most common origination\nlocation, likely due to the strong Internet and energy infrastructure, cheaper operating costs,\nand somewhat similar diets and cultures. Most of the money earned by the North Korean fake\nemployee program is sent back to the North Korean government.\n\n###### Evolution\n\nIt appears that the North Korean fake employee program first evolved from one where they\nmostly concentrated on gaining “freelancing” work projects on general freelance work websites,\nsuch as Fiverr, and from successfully competing for temporary remote work (i.e., contract\nworkers) for companies around the world. This occurred during a time when there was an\nexplosion in the need for more IT workers and developers around the world.\n\nNorth Korean fake employee work is mostly centered around software and application\ndevelopment work and, to a lesser extent, graphic design. North Korean fake employees\noften have strong development skills, especially in much sought-after “backend” work, such as\ninterfaces and APIs (application programming interfaces), and in new technologies such as cloud\ndevelopment, cryptocurrencies, and artificial intelligence (AI).\n\nDevelopers of all kinds, legitimate and\notherwise, began to “advertise” their _North Korea took advantage of the new_\nskills and previous work on social media\nand developer sites, such as LinkedIn _WFH jobs being offered throughout the_\nand GitHub. It is very common for _world, moving from mostly freelance_\ntoday’s developers to send these links\n\n###### work to more full-time positions.\n\nto potential employers along with their\nresumes, who can look at those sites\nto see what type of work the employee\ncandidate has done in the past. North Korean fake employees learned how to create simple,\nbut realistic-looking (and fraudulent) resumes and website presences. These fake resumes and\nwebsites use fake or stolen identities.\n\n\nThe COVID-19 epidemic (2019 – 2022) accelerated work-from-home (WFH) scenarios where an\nincreasing percentage of employees could work completely remote, often never being required\nto show up at a physical work location. Today, it is very normal for employers to hire employees\nwithout ever having met them or expecting them to meet physically, in person, with anyone in\nthe organization. This is especially true for developer positions. Employers who require that their\ndevelopers work in the office or in a “hybrid” situation of some in-office days will be cut out of a\nsignificant portion of potential employees.\n\nNorth Korea took advantage of the new WFH jobs being offered throughout the world, moving\nfrom mostly freelance work to more full-time positions. North Korean fake employees try to\nremain employed as long as possible, even though a significant portion are terminated quite\nquickly due to their discovery of being fake employees or simply poor work performance.\nDepending on the country and company where the fake employee was working, it can take weeks\nto months to fire them once someone suspects they are fake. And during this time, they are\ncollecting revenue for North Korea.\n\n\n-----\n\n###### Growing Warnings and Other Sources\n\nEven before our personal experience, we were already generally aware of the North Korean fake\n[employee schemes. We even wrote about it here (https://blog.knowbe4.com/fbi-warns-of-north-](https://blog.knowbe4.com/fbi-warns-of-north-korean-social-engineering)\n[korean-social-engineering) on October 25, 2023. At the time, we didn’t realize the scope, scale,](https://blog.knowbe4.com/fbi-warns-of-north-korean-social-engineering)\nand sophistication of the North Korean fake employee scheme. Most companies did not.\n\nUntil fairly recently, the North Koreans mainly pursued positions in cryptocurrency firms,\nmega-corporations, and freelance work. We also knew our background checks would catch any\nsynthetic (i.e., fake) identities, which were usually created and used in these schemes. North\nKorean fake employees were notorious for not wanting to be on camera during interviews. We\ndid not count on them using a stolen real U.S. identity, gladly submitting to multiple on-camera\ninterviews, creating AI-enabled pictures, and using fake IDs when needed at physical locations.\n\nHow North Korean fake employees operate has changed over time, working to bypass previous\nsuccessful verification checks, expanding operations, targeting organizations of every type and\nsize, and in their boldness. This is documented over time by government reports and media\narticles detailing their increasing sophistication and spread.\n\nOn May 16, 2022, the U.S. Department of State, the U.S. Department of the Treasury, and the\nFederal Bureau of Investigation (FBI) released a 16-page detailed report entitled, GUIDANCE\nON THE DEMOCRATIC PEOPLE’S REPUBLIC OF KOREA INFORMATION TECHNOLOGY WORKERS\n[(https://ofac.treasury.gov/media/923126/download). This report contained tons of details and](https://ofac.treasury.gov/media/923126/download)\nshould be read by anyone interested in this topic. But at the time, because of what North Korean\nfake employees were mostly doing, the report warned U.S. employers to be aware not to hire fake\n“freelancers.” There was not a huge focus on warning U.S. employers against hiring fake, full-time\nemployees.\n\n\nAs great as the May 2022 report was, it\ndid not receive a lot of media attention _How North Korean fake employees_\nat the time. It got lost in all the other\n\n###### operate has changed over time, working\n\nreports and articles regarding all kinds\nof fake employers and fake employees _to bypass previous successful verification_\n(covered below), popping up during the\n\n###### checks, expanding operations, targeting\n\nsame period of time.\n\n###### organizations of every type and size,\n\nNearly another year and a half went\nby before Mandiant briefly mentioned _and in their boldness._\nsome signs of North Korean fake\nemployees in a long blog article about\n[all sorts of sophisticated North Korean threats on October 10, 2023 (https://cloud.google.com/](https://cloud.google.com/blog/topics/threat-intelligence/north-korea-cyber-structure-alignment-2023/)\n[blog/topics/threat-intelligence/north-korea-cyber-structure-alignment-2023/). In the article,](https://cloud.google.com/blog/topics/threat-intelligence/north-korea-cyber-structure-alignment-2023/)\nMandiant wrote, “…several of the documents focused on resumes, CVs and references, which may\nbe leveraged to apply to various job openings…”\n\n\n[A week later, on October 18, 2023, the FBI updated (https://www.ic3.gov/Media/Y2023/](https://www.ic3.gov/Media/Y2023/PSA231018)\n[PSA231018) their previous report from May 2022, this time indicating that North Korean fake](https://www.ic3.gov/Media/Y2023/PSA231018)\nemployee “tradecraft” had evolved to fake full-time employees. This announcement did catch\nthe media’s attention, including the KnowBe4 post mentioned above on October 25th. We wrote\n[about the North Korean threat again on December 13, 2023 (https://blog.knowbe4.com/north-](https://blog.knowbe4.com/north-korean-operatives-infiltrate-job-platforms)\n[korean-operatives-infiltrate-job-platforms) based on a new report from Nisos (https://www.nisos.](https://blog.knowbe4.com/north-korean-operatives-infiltrate-job-platforms)\n[com/research/dprk-it-worker-scam/).](https://www.nisos.com/research/dprk-it-worker-scam/)\n\n\n-----\n\nMandiant started to be involved in more and more cases of North Korean fake employees.\n[Mandiant Principal Analyst, Michael Barnhart, joined The Defender’s Advantage podcast (https://](https://open.spotify.com/episode/0xeaavXjlX2XLm3oibOv6g)\n[open.spotify.com/episode/0xeaavXjlX2XLm3oibOv6g) on February 21st, 2024, to talk about the](https://open.spotify.com/episode/0xeaavXjlX2XLm3oibOv6g)\nproblem.\n\nBy May 2024, the problem was becoming more well-known outside of cybersecurity circles.\n[The Wall Street Journal revealed (https://www.wsj.com/politics/national-security/american-it-](https://www.wsj.com/politics/national-security/american-it-scammer-helped-north-korea-fund-nuclear-weapons-program-u-s-says-65430aa7)\n[scammer-helped-north-korea-fund-nuclear-weapons-program-u-s-says-65430aa7) that over 300](https://www.wsj.com/politics/national-security/american-it-scammer-helped-north-korea-fund-nuclear-weapons-program-u-s-says-65430aa7)\nU.S. companies had hired North Korean fake employees and revealed that Americans and other\nforeign nationals were assisting them. On June 7, 2024, the Wall Street Journal published another\nrelated article entitled, “Deepfakes, Fraudsters and Hackers Are Coming for Cybersecurity Jobs”\n[(https://www.wsj.com/articles/deepfakes-fraudsters-and-hackers-are-coming-for-cybersecurity-](https://www.wsj.com/articles/deepfakes-fraudsters-and-hackers-are-coming-for-cybersecurity-jobs-e2a76d06)\n[jobs-e2a76d06).](https://www.wsj.com/articles/deepfakes-fraudsters-and-hackers-are-coming-for-cybersecurity-jobs-e2a76d06)\n\nWhat was often missing in the media reports was an abundance of details of what the fake\nemployee candidate did during the interview process to fool unsuspecting firms. While different\ntypes of organizations were sometimes mentioned (e.g., a major television network, an aerospace\nand defense company, a car manufacturer, etc.), the focus again was often on mega-corporations\nhiring freelancers and did not mention that smaller companies…sometimes very small\ncompanies…were also being targeted. They did not mention people getting on camera. It is more\ndifficult to defend when the relevant details and recommended defenses are not being readily\nshared. And until recently, none of the news stories went “viral” and really gained worldwide\ntraction. Most organizations were unaware of the scale and sophistication of the North Korean\nfake employee problem.\n\nThat changed with our July 23, 2024 blog post. We publicly shared details, pictures, security gaps,\nand suggested defenses. And it worked. There were dozens of news articles the next day, and\nnow more companies feel comfortable publicly sharing their own North Korean fake employee\nexperiences.\n\nYou can use background services that will confirm whether or not the employee you are thinking\nof hiring is or is not a North Korean fake employee. There is a smattering of free tools anyone\ncan use to do some Open Source Intelligence (OSInt) investigations on their own, including\n[https://github.com/shortdoom/gh-fake-analyzer/tree/main#malicious-github-accounts.](https://github.com/shortdoom/gh-fake-analyzer/tree/main#malicious-github-accounts)\n[Individuals are even sharing (https://github.com/shortdoom/gh-fake-analyzer/blob/main/profiles/](https://github.com/shortdoom/gh-fake-analyzer/blob/main/profiles/INVESTIGATIONS/ZachXBT_15.08.2024/Attackers.jpeg)\n[INVESTIGATIONS/ZachXBT_15.08.2024/Attackers.jpeg) names, email addresses, and IDs of proven](https://github.com/shortdoom/gh-fake-analyzer/blob/main/profiles/INVESTIGATIONS/ZachXBT_15.08.2024/Attackers.jpeg)\nNorth Korean fake employees. North Korean fake employees often have many jobs at different\norganizations using the same fake or stolen ID, so knowing the names of the confirmed fake\nemployees can help organizations avoid being duped.\n\nNote: It would be extremely helpful if a government’s website had a “global list” of all confirmed\nNorth Korean fake employee names and ID information where they all could be easily shared or\nqueried by anyone.\n\nThe U.S. Department of Justice has announced several separate charges and arrests of U.S.\ncitizens and other foreign nationals who are helping the North Koreans with their fake employee\n[schemes, including an Arizona woman and Ukrainian man here (https://www.justice.gov/usao-dc/](https://www.justice.gov/usao-dc/pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-north)\n[pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-](https://www.justice.gov/usao-dc/pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-north)\n[north) and a Tennessee man here (https://cyberscoop.com/wp-content/uploads/sites/3/2024/08/](https://www.justice.gov/usao-dc/pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-north)\n[FILED-INDICTMENT-Knoot.pdf).](https://cyberscoop.com/wp-content/uploads/sites/3/2024/08/FILED-INDICTMENT-Knoot.pdf)\n\nIt is our hope that more and more organizations will share their experiences with North Korean\nfake employees, and really, any exploitation, so that we can all learn together and better protect\nourselves.\n\n\n-----\n\n###### General Infrastructure\n\nThere are four general parts to the North Korean fake employee scheme:\n\n###### • North Korean-based program leaders\n • North Korean employees and managers based in other countries\n • Non-Korean scheme assisters (usually based in the country where the job is located)\n • Infrastructure to assist with accepting payments, generating fake identities or stealing real\nidentities, creating fake employee websites and projects, giving references, money laundering,\ndocument forgery services, etc.\n\nThe North Korean fake employees are often skilled IT workers and developers trained at North\nKorean universities. They are usually located in foreign countries, such as China, in shared\napartments (living spaces) and workspaces. The daily work is usually performed in a room that\nlooks like a busy call center. In fact, many of the potential employers noted the noisy background\nany time they interviewed the employee candidate.\n\nMost of the money earned by the North Korean fake employees is sent back to the North\nKorean government. The local manager (or minder) takes a small portion of the proceeds first\nfor themselves and operations before remitting the rest back to North Korea. The North Korean\nemployee gets very little of the earned revenue. It is believed that their close family members are\nalways kept back in North Korea to be used as personal leverage to force the employee to toil long\nhours for very little wages. Several sources have concluded that North Korean fake employees are\nconsidered to be “human-trafficked”.\n\nThere is a large criminal ecosystem of support services that assist the North Koreans with their\nfake employee schemes. The North Korean fake employees will use fake, stolen, or purchased\nidentities. Stolen or purchased identities will often be from the country being targeted.\n\n\n-----\n\nNorth Korean fake employees often create or obtain fake “official” documents when requested by\n[the employer. According to the FBI (https://ofac.treasury.gov/media/923126/download), previously](https://ofac.treasury.gov/media/923126/download)\nsubmitted forged documents have included:\n\n###### • Driver’s licenses\n • Social Security cards\n • Passports\n • National identification cards\n • Resident foreigner cards\n • High school and university diplomas\n • Work visas\n • Credit card, bank, and utility statements\n\nStolen or purchased identities are preferred because they more easily meet the job requirements\nand pass background and other checks. In some cases, the owners of the real identity have been\npaid to assist in the scheme, participating in interviews, picking up equipment, and taking drug\ntests. Other times, it is other unrelated individuals pretending to be the other identity, often using\nfraudulently created, official-looking IDs.\n\n[As documented in several judicial proceedings (including here: https://www.justice.gov/usao-dc/](https://www.justice.gov/usao-dc/pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-north)\n[pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-](https://www.justice.gov/usao-dc/pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-north)\n[north), there are many services and websites worldwide which, knowingly or unknowingly provide](https://www.justice.gov/usao-dc/pr/charges-and-seizures-brought-fraud-scheme-aimed-denying-revenue-workers-associated-north)\nstolen identities to the North Koreans. Some reports have described services and websites (and\nDiscord servers), which offer U.S. citizens a chance to earn money by being part of the scheme.\nIt appears that sometimes the involved citizens think they are helping foreigners get jobs they\nwould otherwise be “discriminated against” obtaining. And in other cases, they do know they are\ninvolved in helping North Koreans bypass sanctions.\n\n###### Laptop Farms\n\nThere are usually citizens in the same country as the job position to accept equipment mailed by\nthe employer. They often set up the equipment in their homes and other locations so that the\nremote North Koreans (or their hired contractors) can access the equipment. One “laptop farm”\nwas found with over 90 different laptops from various employers. Several employers receiving\nthe equipment back after firing the fake employee have reported that the laptop lid contained a\nyellow “sticky note” with the name of their organization inked on it. It is obvious that the laptop\nfarm employee was labeling the equipment to keep track of which laptop belonged to which\norganization.\n\nNorth Koreans, after learning they have been accepted for a new position, almost always tell the\nemployer to ship the laptop and other equipment to another location not previously disclosed\non their resume or other systems. This is a very common sign of a North Korean fake employee.\nThey come up with various fake excuses, such as new permanent living locations, helping out a\nsick relative, and traveling with a girlfriend. Regardless of the excuse, the new location to which\nthey ask for the equipment to be mailed is usually unknown and a surprise to the employer.\n\nThis is likely because the North Korean employee is involved in dozens to hundreds of ongoing\nfake employment schemes, and when accepted for new employment, now has to direct the\nemployer’s equipment to a valid local country equipment farm. These laptop farm managers do\nquit and get arrested, so the North Koreans are using a forever-changing list of laptop farmers.\n\n\n-----\n\n_Note: It is likely that in the future, because this tactic has been publicly revealed, the mailing location_\n_the laptop is shipped to will be used early and consistently in the job application process. This and other_\n_current signs of a North Korean fake employee may change as the North Koreans respond to publicly_\n_revealed tactics and successful defender mitigations._\n\nThe equipment handlers often have fake IDs in the name of the fake hired employee, but with\ntheir picture inserted for the visual review. Employers shipping equipment to remote employees\nshould ensure that the person picking up the equipment visually and informationally matches the\nperson who participated in the previous hiring processes. The North Koreans rely on the fact that\nmost of the legitimate services involved in checking IDs are not comparing the IDs they receive\nwith each other, for if they did, they would see distinct differences in most cases (except where a\nsingle fake employee is participating in all aspects of the scheme).\n\nThere are North Korean fake employee schemes where a country’s citizen is thoroughly involved\nin the employment scam, from using a real resume, participating in the interviews, taking drug\ntests, picking up the equipment, etc., and then turning over the resulting work and the rest of the\ninterfacing to the remote North Korean worker (or the contractor they hired).\n\nNorth Korean fake employees will often turn over the resulting work to other foreign and\ndomestic contractors. They will either let the contractor take over part or all aspects of the fake\nemployee scheme and earn a percentage of the paid salary. Some employers have noted that the\nperson they thought they hired was not the person doing the work, either in physical looks, voice/\naccent, or the related knowledge and/or quality of work delivered. Other times, the North Korean\nfake employee does all the work except pick up the corporate equipment.\n\nThere is often an entire ecosystem of supporting criminal services and people involved. The\nservices include fraudulent identity services, fake banks, money laundering, cryptocurrency\nservices, cryptocurrency exchanges and “mixers”, “mules”, laptop farmers, subcontractors,\nresume writers, social media and GitHub account creators, developers, job finders, fake ID\ncreators, VPN services, VOIP services, etc. Those involved often know that what is being done is\nillegal or unethical, but may or may not know that North Korea is involved.\n\nIt can be assumed that North Korean employees within the same managed group, and possibly\nat larger levels, share what tactics do and do not work. They likely share what caused failures,\nhow to possibly bypass them, and what ecosystem services made their jobs easier and more\nsuccessful.\n\n\nThey likely use different techniques for different scenarios,\ndepending on what types of defenses they have to\novercome.\n\nThe North Koreans largely depend on employers\nnot being aware of the threat and not implementing\ndefenses that can detect and prevent them. The\nrevenue earned by North Korean fake employees\nresults in hundreds of millions to billions of dollars\nreaching the North Korean government, much of\nwhich is used to fund their sanctioned weapons\nprograms.\n\n\n-----\n\n###### Inbound/Outbound Strategies\n\nMany organizations report “inbound” contact with North Korean fake employees, where the\nNorth Korean employee reached out to the employer about a possible job. That contact was\ninitiated from a job offered on the employer’s website or from a legitimate job’s website. In a few\ncases, the North Korean fake employee reached out to a developer manager on social media (e.g.,\nLinkedIn, etc.) and inquired if any jobs were available.\n\nIn many other cases, the employer reached out (i.e., outbound) to the North Korean fake\nemployee, not knowing they were North Koreans or fake profiles. In most of these cases, the\nNorth Koreans hosted basic, but credible profiles on social media, GitHub, or other seeking jobs\nwebsites. In some cases, the employer actively looked for potential employees on LinkedIn and\ncame across fake profiles.\n\nRecruiters often played a big role in both inbound and outbound contacts with North Korean fake\nemployees. Many employers were brought the North Korean fake employee by a trusted recruiter\nwho had previously, unknowingly, been duped. Every recently interviewed recruiter reported a\nvery large, serious problem in the recruitment industry from North Korean fake employees.\n\nMany employers reported both multiple inbound and outbound contacts with North Korean\nfake employees over the last year, but only now, knowing the signs to look for, realized they were\nNorth Korean fake employees.\n\nFake remote employees and contractors are now something every organization needs to worry\nabout. Every organization should be updating its hiring policies and training to reflect this new\nreality. While the news is all about fake North Korean employees, really it\ncould be from any country and really any person wishing to pretend to be\nsomeone else.\n\nAt the very least, every organization should have processes in place to\nconfirm the identity of the person they intend to hire really is that\nperson, whether that is meeting them in person along with their\ngovernment-issued ID or using trusted agents, such as background\nsearching firms, which include relevant checks. You even need to\nensure the remote person you hired is still the one working for you, as\nmany remote employee scams have involved bait‑and-switch schemes.\n\n###### Other Fake Employers and Fake Employees\n\nReaders should understand that fake employers and fake\nemployees abound and are not just a problem created and\nsolely operated by North Korea. For over a decade, the\ncybersecurity industry has noted a raff of fake employers\nand fake employees (including from North Korea), and\nKnowBe4 has written about it many times, including here:\n\n[https://blog.knowbe4.com/fbi-scammers-exploit-job-](https://blog.knowbe4.com/fbi-scammers-exploit-job-posting-sites-with-fake-jobs-to-steal-money-and-personal-information)\n[posting-sites-with-fake-jobs-to-steal-money-and-](https://blog.knowbe4.com/fbi-scammers-exploit-job-posting-sites-with-fake-jobs-to-steal-money-and-personal-information)\n[personal-information](https://blog.knowbe4.com/fbi-scammers-exploit-job-posting-sites-with-fake-jobs-to-steal-money-and-personal-information)\n\n[https://www.securityinfowatch.com/security-](https://www.securityinfowatch.com/security-executives/article/53079753/the-dilemma-of-fake-job-scams-is-hard-to-stop-at-scale)\n[executives/article/53079753/the-dilemma-of-fake-job-](https://www.securityinfowatch.com/security-executives/article/53079753/the-dilemma-of-fake-job-scams-is-hard-to-stop-at-scale)\n[scams-is-hard-to-stop-at-scale](https://www.securityinfowatch.com/security-executives/article/53079753/the-dilemma-of-fake-job-scams-is-hard-to-stop-at-scale)\n\n\n-----\n\n[https://www.linkedin.com/pulse/how-stop-job-scams-roger-grimes](https://www.linkedin.com/pulse/how-stop-job-scams-roger-grimes)\n\n[https://blog.knowbe4.com/job-seekers-and-employers-beware](https://blog.knowbe4.com/job-seekers-and-employers-beware)\n\n[https://blog.knowbe4.com/north-korean-threat-actors-target-software-developers](https://blog.knowbe4.com/north-korean-threat-actors-target-software-developers)\n\n[https://blog.knowbe4.com/heads-up-north-korean-cybercriminals-use-fake-recruitment-emails-](https://blog.knowbe4.com/heads-up-north-korean-cybercriminals-use-fake-recruitment-emails-in-phishing-scam)\n[in-phishing-scam](https://blog.knowbe4.com/heads-up-north-korean-cybercriminals-use-fake-recruitment-emails-in-phishing-scam)\n\n[https://blog.knowbe4.com/how-nks-cyber-criminals-stole-3-billion-in-crypto-to-fund-their-nukes](https://blog.knowbe4.com/how-nks-cyber-criminals-stole-3-billion-in-crypto-to-fund-their-nukes)\n\nThe FBI has warned about fake employers looking to harm individuals many times in the past,\nincluding here:\n\n[https://www.ic3.gov/Media/Y2024/PSA240604](https://www.ic3.gov/Media/Y2024/PSA240604 )\n\n[https://www.fbi.gov/contact-us/field-offices/elpaso/news/press-releases/fbi-warns-cyber-](https://www.fbi.gov/contact-us/field-offices/elpaso/news/press-releases/fbi-warns-cyber-criminals-are-using-fake-job-listings-to-target-applicants-personally-identifiable-information)\n[criminals-are-using-fake-job-listings-to-target-applicants-personally-identifiable-information](https://www.fbi.gov/contact-us/field-offices/elpaso/news/press-releases/fbi-warns-cyber-criminals-are-using-fake-job-listings-to-target-applicants-personally-identifiable-information)\n\n[https://www.fbi.gov/contact-us/field-offices/newhaven/news/press-releases/fbi-new-haven-](https://www.fbi.gov/contact-us/field-offices/newhaven/news/press-releases/fbi-new-haven-warning-college-students-of-employment-scams)\n[warning-college-students-of-employment-scams](https://www.fbi.gov/contact-us/field-offices/newhaven/news/press-releases/fbi-new-haven-warning-college-students-of-employment-scams)\n\nIt should be noted that many fake jobs are advertised\non legitimate job websites. The North Koreans and\nothers fool legitimate job sites into posting fake\njob ads, which often add an air of legitimacy\nto the posted job. Certainly, anyone not\nsuspecting that a potential advertised job\nis fake is at far greater risk of falling for the\nemployment scheme. The legitimate job\nwebsites often look for and weed out fake\nemployment ads, but it is often a losing\ngame of cat-and-mouse.\n\nMany countries, including Iran, south Asian\ncountries, and Russia, seem to have many\nsophisticated groups dedicated to pretending to\nbe fake employers and employees. Fake employers\nare also very problematic. These fake employers\noften target already working employees, hoping to steal\nsomething of monetary value from the victim (by making them pay fake pre-employment fees\nor purchase and ship expensive equipment to get the job) or to target their existing employer.\nEmployees have been compromised, so the attacker could gain access to the employer to spread\nmalware, ransomware, steal money, or obtain confidential information.\n\nOne of the most infamous cases is where a fake LinkedIn job ad enticed an existing employee of a\ncryptocurrency firm to apply for the fake job and ended up resulting in his current employer being\n[robbed of $500M in cryptocurrency: https://www.techtimes.com/articles/277721/20220706/](https://www.techtimes.com/articles/277721/20220706/axie-infinity-hacked-500m-lost-via-fake-linkedin-job-listing.htm)\n[axie-infinity-hacked-500m-lost-via-fake-linkedin-job-listing.htm. The culprit in this case was the](https://www.techtimes.com/articles/277721/20220706/axie-infinity-hacked-500m-lost-via-fake-linkedin-job-listing.htm)\nLazurus group, a well-known North Korean nation-state hacking group.\n\nYour hiring process should include mitigations to prevent all sorts of fake employees.\nAll employees in the hiring process should be educated about fake employees. All employees\nshould be educated about fake employer scams too, as they can result in personal harm and\nharm to the organization.\n\n\n-----\n\n###### Intentions\n\nThe U.S. government has repeatedly stated that the main intention of the North Korean fake\nemployee program is to provide illegal revenue to North Korea through the receiving of work\npayments, such as salaries and other contractual payments. The vast majority of reviewed\ninformation from involved activity logs and interactions shows that most of the time, the fake\nemployee simply performed the type of work they were hired to do and thus earned continued\ncompensation. In other instances, they did not perform the required work (or performed it poorly\nor rarely), but did not perform other malicious or espionage activities. The main intent of the\nNorth Korean fake employee program seems to be to collect continued revenue over extended\nperiods of time, often then used for the sanctioned North Korean weapons programs.\n\nAt the same time, there are many confirmed instances in which the infiltration of North Korean\nfake employees also led to monetary theft by other means, such as stolen cryptocurrency or\nmalicious corporate bank transfers. There have been many cases involving the exfiltration of\nconfidential information, intellectual property, and project secrets. There have also been cases\nof malicious code intentionally inserted in the software projects in which the North Korean fake\nemployees were involved.\n\nIt is believed that many of these instances are cases where the involved handlers recognized the\nsignificance of the compromise in regard to the larger interests of North Korea and in some cases,\nspecific organizations and industries were likely intentionally targeted with specific espionage\ngoals in mind.\n\nIn the absence of information to the contrary, any exfiltrated company should assume that goals\nbeyond revenue may be involved. With that being said, the vast majority of investigated cases\nhad the main intent of earning revenue through work efforts. Potential victims should install and\nmanage strong monitoring systems on involved endpoints to be able to collect data to prove\nintent and detect all worker actions, if needed, during a potential compromise.\n\nThe rest of this whitepaper is the real meat, covering the signs of a North Korean fake employee\nand how employers should update their hiring processes to protect their organization.\n\n\n##### SIGNS OF A NORTH KOREAN FAKE EMPLOYEE\n\n\nHere are some of the common signs of a North Korean fake employee:\n\n**During the Hiring Process**\n\n###### • Presents themselves as Asian (e.g., South Korean, Chinese, Malaysian, Japanese, etc.),\nEuropean, or U.S.-based\n\n###### • Will often claim to have always lived in the U.S., to have only gone to U.S.-based universities,\nand worked for well-known U.S.-based companies, even though their English is limited\n\n###### • Will often claim to be a U.S.-based citizen with an American/English-sounding name, but will\nhave a very heavy accent\n\n###### • If you are familiar with Asian accents, the accent will often not be from the claimed country or\nregion (will often be a North Korean accent)\n\n###### • Will often use a fake identity that will fail if checked\n • Will often submit a fake ID credential that will fail if checked\n • Will often claim a fake work history that will fail if checked\n\n\n-----\n\n###### • Supplied personal websites, profiles, or GitHub sites seem overly basic, often saying\nsomething and nothing at the same time or you can find very similar sites and profiles\n\n###### • Often claimed prior work product can be tied to other names\n • Sites and profiles are relatively new or match the date when various “former” work products\nwere created/posted\n\n###### • Claimed identity has zero Internet presence or history outside of supplied sites and profiles\n • Conflicting inconsistent information provided between resumes, social media sites, profiles, in\ninterviews, and how they answer questions or what they select or input on HR hiring systems\n(such as marital status, address, etc.)\n\n###### • All connections are made using VPNs\n • Candidate will participate in interviews from a noisy (call center-like) background\n • All phone numbers submitted (candidate and reference) will be virtual voice-over-IP (VoIP)\nnumbers (which can be checked online)\n\n###### • Candidate and reference email addresses will always be email addresses from commonly used\npublic email domains (e.g., Gmail.com, Hotmail.com, Outlook.com, etc.)\n\n###### • Reference phone numbers and email addresses will never be to legitimate business phone\nnumbers or email domains of the claimed business\n\n###### • May be hesitant coming on camera for one or more interviews, may make excuses for why\ncamera is not working\n\n**After Hiring**\n\n###### • Wants you to mail organization devices to an additional location not indicated on the\nemployment application or in previous communications\n\n###### • You detect unnecessary remote login on the organization’s device\n • IP address where the organizational device is logging in from does not match the\nclaimed location\n\n###### • You detect malware on the organizational device\n • You detect unusual behavior on the organizational device\n • Changes to log files or other cover-up attempts on the organizational device\n • Work hours do not seem consistent with the country or region being claimed, emails and work\nproduct seem always to be delivered during very late night hours\n\n###### • Minor misspellings on things they should not be misspelling (like their name, address, etc.)\n • Frequently changing email addresses (because they have been detected and shutdown on the\nold email address)\n\n###### • Inconsistent project delivery quality, definitely does not seem to meet the quality of person\ninterviewed\n\n###### • Inability to get them on camera or inability to get timely responses from online channels,\nespecially during hours that would be sleeping time for them\n\n###### • Unusual/strange payment scheme requests, especially using virtual currency\n • If they request that work payment be sent to a bank, banking details provided for payment are\nto a strange-looking bank or do not match public records\n\n###### • They request that payments be made to virtual currency, cryptocurrency, or other popular\nmoney exchange sites (e.g., PayPal, Venmo, etc.)\n\n###### • Employee changes OS or application to Korean language support even though the claim to be\n\n\n-----\n\nAn employee candidate does not need to match all these common signs to be a fake employee.\nBut it is good to create checks for each of these and if any candidate being considered as a finalist\nmeets even some of these signs, they should be further scrutinized and reviewed for accuracy\nbefore continuing. Most employers who eventually detected a North Korean fake employee or\nresume, when checking past submissions, found additional likely North Korean fake employee\ncandidates (who had not made it through the normal hiring process to become a finalist).\n\n\n##### HOW TO PROTECT YOUR ORGANIZATION\n\n\nFake employees, North Korean and otherwise, are a serious threat to every employer, especially\nthose with remote-only positions. Every at-risk organization should educate all employees\nwho could be involved in the hiring process about the risk and consider following the various\nmitigations listed below:\n\n**During Hiring Process**\n\n###### • Share the risk with senior management, if they are not already aware, and obtain senior\nmanagement support\n\n###### • Threat model your hiring process\n • Update your hiring process to mitigate the risk of hiring fake employees\n • Share the signs of potentially fake employees with those in the hiring process\n • Run existing remote-only employees through a process to ensure that you do not have an\nexisting fake employee\n\n###### • If possible, always require that remote employees physically meet with an employee, team\nleader, or selected agent of the organization in person, with an official ID, to confirm they are\nwho they say they are\n\n###### • If not already existing, create a rule that all employee candidates and employees must always\nbe on camera during remote sessions (e.g., Zoom, Microsoft Teams, Slack, etc.)\n\n###### • Keep a record of all interactions and videos of the interview process\n • If possible and reasonable, and if the employee candidate has a non-domestic accent, have a\ntrusted person who is familiar with accents from the same region participate in a meeting to\nassess the validity of the claimed accent\n\n###### • Check for VoIP phone number use from employee candidates and references\n • Check references\n • Require that all professional/work references be made to legitimate and publicly confirmable\nbusiness phone numbers and email addresses (do not allow generic public email\naddresses only)\n\n###### • Use a background check that looks for fake employees\n • Require that candidate use the same ID when presented to anyone in the hiring process\nand make sure additional identity verifiers in the process get a copy of the first submitted\nidentification\n\n###### • Ask the candidate to submit fingerprints for identity verification purposes\n\n\n-----\n\nOptional: This last suggestion is not really that conclusive, but several people in the hiring\nprocess who ended up detecting a North Korean fake employee used this type of questioning\nto determine if the employee candidate was really who they said they were when they were\nbecoming suspicious. If skeptical, ask a question that the candidate should easily know if being\nhonest, but it is not super easy to quickly look up the answer. For example:\n\n###### • If the employee candidate said they went to Virginia Tech, ask them, “What is a Hokie” or\n“What’s that song that the football team always enters the stadium to?”\n\n###### • If the employee candidate states they worked for a particular employer one of the reviewers\nalso worked for, ask a question that anyone who worked for that employer should readily\nknow. For example, “You worked for Microsoft; what color badge did you have?” Any real\nMicrosoft employee would easily tell you the right color for the employee type.\n\n###### • “What was the name of that mascot for the baseball team?”\n • “What score did you score on your SATs?”\n • “What was the name of that huge student information center located on campus?”\n • “What was the name of that bar located next to campus that everyone went to?”\n • “What was the name of that main road running right in front of the campus?”\n • “What food is considered the primary food eaten at baseball games?”\n • “Do you have an HOA where you live?”\n • “Did you have to register for Selective Service?”\n • “At what age did they allow you to get a driver’s permit (in that state)?”\n • “Oh, I see you worked at Autodesk. What type of internal instant messaging system did they\nuse, again?”\n\nRealistically, if you are becoming that skeptical during the interview process, perhaps they should\nnot be considered as a finalist for that position.\n\n**After Hiring**\n\n###### • Lock down any supplied device to the bare minimum access needed, especially during the\ninitial hiring period\n\n###### • Monitor device for unusual activity, malware, unexpected language changes, or log\nmodifications\n\n###### • Look for signs of unexpected remote logins\n • Consider asking them the same technical questions you asked during the hiring process to see\nif their answers match what they gave during the interview\n\n###### • Monitor activity against purported normal work hours\n • Require employee to be on camera during training or any time when communicating with\nanother employee\n\n###### • Randomly ask the employee to come on camera a few times, at least during the initial\nemployment period\n\n_Note: The FBI encourages U.S. companies to report fake employees to their local FBI field office._\n\n\n-----\n\n##### SUMMARY\n\n\nFake remote employees and contractors are now something everyone needs to worry about.\nEvery organization should be updating its hiring policies, processes, and education to reflect this\nnew reality.\n\nWhile the recent news is all about fake North Korean employees, really it could be from any\ncountry and really any person wishing to pretend to be someone else. At the very least, every\norganization should have processes in place to confirm the identity of the person they intend to\nhire is really that person, whether that is meeting them in person along with their governmentissued ID or using trusted agents, such as background searching firms which include relevant\nchecks. You even need to ensure the person you hired is still the one who is working for you, as\nmany employee scams have involved bait-and-switch schemes.\n\nWe used to live in a world where we did not have to worry about fake employees or employers.\nBut times have changed and hiring processes and employees seeking new jobs need to act\naccordingly.\n\n\n-----\n\n###### Additional Resources\n\n**Free Phishing Security Test**\nFind out what percentage of your employees are Phish-prone with your free Phishing Security Test\n\n**Free Automated Security Awareness Program**\nCreate a customized Security Awareness Program for your organization\n\n**Free Phish Alert Button**\nYour employees now have a safe way to report phishing attacks with one click\n\n**Free Email Exposure Check**\nFind out which of your users emails are exposed before the bad guys do\n\n**Free Domain Spoof Test**\nFind out if hackers can spoof an email address of your own domain\n\n###### About KnowBe4\n\nKnowBe4, the provider of the world’s largest security\nawareness training and simulated phishing platform,\nis used by more than 70,000 organizations around the\nglobe. Founded by IT and data security specialist Stu\nSjouwerman, KnowBe4 helps organizations address the\nhuman element of security by raising awareness about\nransomware, CEO fraud and other social engineering\ntactics through a new-school approach to awareness\ntraining on security.\n\nThe late Kevin Mitnick, who was an internationally\nrecognized cybersecurity specialist and KnowBe4’s Chief\nHacking Officer, helped design the KnowBe4 training\nbased on his well-documented social engineering tactics.\nTens of thousands of organizations rely on KnowBe4 to\nmobilize their end users as their last line of defense and\ntrust the KnowBe4 platform to strengthen their security\nculture and reduce human risk.\n\n**For more information, please visit www.KnowBe4.com**\n\nKnowBe4, Inc. | 33 N Garden Ave, Suite 1200, Clearwater, FL 33755\nTel: 855-KNOWBE4 (566-9234) | www.KnowBe4.com | Email: Sales@KnowBe4.com\n\n© 2024 K B 4 I All i ht d Oth d t d ti d h i b\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://www.knowbe4.com/hubfs/North-Korean-Fake-Employees-Are-Everywhere-WP_EN-us.pdf"
    ],
    "report_names": [
        "North-Korean-Fake-Employees-Are-Everywhere-WP_EN-us.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "22af92cd-863b-443f-aa2a-9e999a262e8a",
            "created_at": "2024-10-04T02:03:11.354693Z",
            "updated_at": "2025-03-27T02:05:17.418831Z",
            "deleted_at": null,
            "main_name": "NICKEL TAPESTRY",
            "aliases": [
                "Famous Chollima ",
                "UNC5267 ",
                "Wagemole ",
                "DPRK IT Workers"
            ],
            "source_name": "Secureworks:NICKEL TAPESTRY",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1729821947,
    "ts_updated_at": 1743041591,
    "ts_creation_date": 1726650667,
    "ts_modification_date": 1726650672,
    "files": {
        "pdf": "https://archive.orkl.eu/488d087104033e9f7df7db43c33d300a079dc036.pdf",
        "text": "https://archive.orkl.eu/488d087104033e9f7df7db43c33d300a079dc036.txt",
        "img": "https://archive.orkl.eu/488d087104033e9f7df7db43c33d300a079dc036.jpg"
    }
}