{
    "id": "27b40337-f7cc-411c-85ab-4dc8f975c547",
    "created_at": "2023-01-12T14:59:34.96126Z",
    "updated_at": "2025-03-27T02:16:26.061912Z",
    "deleted_at": null,
    "sha1_hash": "f588189087fc8705bb89ac64f3837c65a95fcccd",
    "title": "2020-01-28 - Stopping the Press- New York Times Journalist Targeted by Saudi-linked Pegasus Spyware Operator",
    "authors": "",
    "file_creation_date": "2022-05-28T15:40:11Z",
    "file_modification_date": "2022-05-28T15:40:11Z",
    "file_size": 2248352,
    "plain_text": "# Stopping the Press New York Times Journalist Targeted by Saudi-linked Pegasus Spyware Operator\n\n**citizenlab.ca/2020/01/stopping-the-press-new-york-times-journalist-targeted-by-saudi-linked-pegasus-spyware-**\noperator/\n\nJanuary 28, 2020\n\n[Research](https://citizenlab.ca/category/research/)\n\n\n-----\n\n[Targeted Threats](https://citizenlab.ca/category/research/targeted-threats/)\nBy [Bill Marczak,](https://citizenlab.ca/author/bmarczak/) [Siena Anstis,](https://citizenlab.ca/author/siena-anstis/) [Masashi Crete-Nishihata,](https://citizenlab.ca/author/masashi/) [John Scott-Railton, and](https://citizenlab.ca/author/jsrailton/) [Ron Deibert](https://citizenlab.ca/author/profd/)\nJanuary 28, 2020\n[Download this report](https://tspace.library.utoronto.ca/bitstream/1807/102557/1/Report%23124--stoppingthepress.pdf)\n\n## Key Findings\n\n_New York Times journalist Ben Hubbard was targeted with NSO Group’s Pegasus_\nspyware via a June 2018 SMS message promising details about “Ben Hubbard and the\nstory of the Saudi Royal Family.”\nThe SMS contained a hyperlink to a website used by a Pegasus operator that we call\nKINGDOM. We have linked KINGDOM to Saudi Arabia. In 2018, KINGDOM also\ntargeted Saudi dissidents including Omar Abdulaziz, Ghanem al-Masarir,1 and Yahya\nAssiri, as well as a staff member at Amnesty International.\nHubbard is among a growing group of journalists targeted with Pegasus spyware. As\npart of our continued investigation into threats against journalists, Citizen Lab also\nidentified evidence suggesting a Pegasus operator may have been infecting targets\nwhile impersonating the _Washington Post in the weeks leading up to and after_\nKhashoggi’s killing in 2018. There is no overlap between this activity and reported\nevents surrounding the mobile phone of Jeff Bezos.\n\n## 1. Background\n\n\nPegasus is the name of a mobile phone spyware product made by NSO Group, an Israelibased company that develops and sells surveillance technology. 2 Since 2016, researchers\nhave documented the abuse of Pegasus against journalists, human rights defenders, and\nmembers of civil society. In one case, Pegasus was used to target the wife of a slain\njournalist in Mexico.\n\n\n-----\n\nSeveral reports by Citizen Lab and Amnesty International in 2018 showed that a Saudi-linked\nPegasus operator that we call KINGDOM was targeting dissidents and regime critics. On\nJuly 31, 2018, [Amnesty International and Citizen Lab reported that an Amnesty International](https://citizenlab.ca/2018/07/nso-spyware-targeting-amnesty-international/)\nstaffer, as well as a “Saudi activist based abroad” (later identified as London-based dissident\n[Yahya Assiri) was targeted with Pegasus. On October 1, 2018, Citizen Lab reported that](https://citizenlab.ca/2018/10/the-kingdom-came-to-canada-how-saudi-linked-digital-espionage-reached-canadian-soil/)\nCanadian permanent resident and Saudi dissident Omar Abdulaziz was targeted with\nPegasus. During the period when his phone was monitored, Abdulaziz was apparently in\nclose contact with murdered Washington Post columnist Jamal Khashogghi.\n\nFigure 1: Graphic showing locations of likely Pegasus infections linked to the KINGDOM\noperator in 2018.\n[On November 11, 2018, Forbes reported that Saudi dissident, Ghanem al-Masarir, was](https://www.forbes.com/sites/thomasbrewster/2018/11/21/exclusive-saudi-dissidents-hit-with-stealth-iphone-spyware-before-khashoggis-murder/)\ntargeted with Pegasus. If the targets had clicked on the links in the text messages they\nreceived, the KINGDOM operator would have been able to closely monitor these individuals’\n[communications and plans. Abdulaziz filed a lawsuit against NSO Group in Israel, and al-](https://www.documentcloud.org/documents/5395971-scan0042.html)\n[Masarir filed a lawsuit against Saudi Arabia in the UK.](https://www.leighday.co.uk/News/2019/November-2019/Human-rights-activist-issues-case-against-the-King)\n\n## 2. New York Times Reporter Targeted\n\n[Ben](https://www.nytimes.com/by/ben-hubbard) [Hubbard is the Beirut Bureau Chief of the](https://www.nytimes.com/by/ben-hubbard) _New York Times. Prior to his promotion to that_\nrole, Hubbard reported on Saudi Arabia, including on Crown Prince Mohamed Bin Salman\n(MbS). In an [announcement of his promotion, the](https://www.nytco.com/press/ben-hubbard-named-beirut-bureau-chief/) _New York Times noted that Hubbard had_\n_“turned out deeply revealing reports from a closed society that is changing rapidly under a_\n_headstrong crown prince,” and had “…peeled back the curtain from the prince’s relentless_\n_consolidation of power.”_\n\n\n-----\n\n## 2.1. Pegasus Infection Attempt\n\nOn June 21, 2018, Hubbard received an SMS on his phone stating in Arabic: “Ben Hubbard\nand the story of the Saudi Royal Family.” Hubbard provided this message to the Citizen Lab\nin October 2018 for analysis. With Hubbard’s consent, we are now able to report on this\ncase.\n\nFigure 2: Pegasus infection attempt received by New York Times journalist Ben Hubbard on\nJune 21, 2018 (screenshots courtesy of Ben Hubbard).\nThe link sent to Hubbard led to the site arabnews365[.]com, and was sent from a sender that\ncalled themselves “Arabnews.” The full link is:\n\n```\nhttps://arabnews365[.]com/wqbgGdwlk\n\n```\n\nHubbard recalls that he did not click on the link and we are not able to determine whether his\nphone was successfully infected.\n\n## 2.2. Connection with Pegasus Infrastructure\n\nAt the time the SMS was sent to Hubbard, the arabnews365[.]com domain was active and\nbelonged to the portion of NSO Group’s Pegasus infrastructure used by the KINGDOM\n[operator. The domain was also <independently identified by Amnesty International as](https://www.amnesty.org/en/latest/research/2018/08/amnesty-international-among-targets-of-nso-powered-campaign/)\nbelonging to NSO Group’s infrastructure. In a previous report, we provided a comprehensive\ntechnical description of how we identify and scan for Pegasus infrastructure. In this section,\nwe briefly summarize this process.\n\n\n-----\n\n[In 2016, Citizen Lab published the Million Dollar Dissident report, the first public research to](https://citizenlab.ca/2016/08/million-dollar-dissident-iphone-zero-day-nso-group-uae/)\nidentify NSO Group’s Pegasus spyware. In Million Dollar Dissident, we reported on an\nattempted intrusion of United Arab Emirates (UAE) activist Ahmed Mansoor’s phone using a\ntext message with a malicious link promising “New secrets about torture of Emiratis in state\nprisons.”\n\nOur investigation included scanning the Internet to find Command & Control (C&C) servers\nthat behaved similarly to the ones communicating with the spyware sent to Mansoor. While\nthe Pegasus servers we found were pulled offline even before we published Million Dollar\n_Dissident, we continued to monitor them in case some of them might come back online. In_\nthe weeks after our report, we noticed a small number of Pegasus servers that came back\nonline, but the servers no longer matched our fingerprint. We built a new fingerprint based on\nthis behaviour, and began conducting regular Internet scans to find servers matching this\nnew fingerprint.\n\nIn September 2018, Citizen Lab published Hide and Seek: Tracking NSO Group’s Pegasus\n_Spyware to Operations in 45 Countries, which described the results of this follow-up_\nscanning, conducted between August 2016 and August 2018. In these scans, we detected\n1,091 IP addresses and 1,041 domain names matching our new fingerprint. We further\ngrouped these IPs and domains into 36 distinct Pegasus operators using a technique we\ndeveloped and named Athena. We also devised a new way to conduct DNS Cache Probing,\nand used this method to find likely infections, by identifying Internet Service Providers (ISPs)\nwhere one or more user was repeatedly looking up domain names associated with Pegasus\nC&C servers.\n\n\n-----\n\nFigure 3: Locations of ISPs where we identified likely infections with Pegasus spyware\n(source: [Hide and Seek report).](https://citizenlab.ca/2018/09/hide-and-seek-tracking-nso-groups-pegasus-spyware-to-operations-in-45-countries/)\n\n## 3. Commercial Spyware Harms Democracy, Press Freedom\n\n[As anti-democratic, authoritarian forces are on the rise in many countries, journalists are](https://freedomhouse.org/report/freedom-world/freedom-world-2019)\n[increasingly targets for surveillance and physical harm. Products like NSO Group’s Pegasus](https://cpj.org/reports/2019/10/getting-away-with-murder-killed-justice.php)\nspyware provide government clients with a powerful tool to surreptitiously monitor journalists,\ntheir sources, and the stories on which they are reporting. Many of NSO Group’s clients\nappear to lack rigorous oversight over their security services, and have a track record of\nhuman rights abuses, including threats against journalists.\n\n## 3.1. A Growing List of Journalists Targeted with Pegasus\n\nSince 2016, investigations conducted by Citizen Lab and other researchers have now\nidentified at least 13 journalists and civic media actors targeted with Pegasus spyware\n(Figure 4). In Mexico alone, we have documented at least nine journalists targeted with\nPegasus. Azam Ahmed of The New York Times believes he may have received an infection\nattempt while working in Mexico, but the message was deleted before Citizen Lab was able\nto analyze it.\n\nFigure 4: Some of the journalists and civic media members targeted with Pegasus spyware\n\n\n-----\n\nTroublingly, in both Mexico and Saudi Arabia, spyware infection attempts have been linked to\n[or associated with targeted killings. For example, our report into Saudi surveillance of Omar](https://citizenlab.ca/2018/10/the-kingdom-came-to-canada-how-saudi-linked-digital-espionage-reached-canadian-soil/)\nAbdulaziz was published October 1, 2018. The following day, Jamal Khashoggi—Abdulaziz’s\nconfidant with whom he had been communicating with for months—was executed. Similarly,\n[two days after Mexican investigative journalist Javier Valdez Cárdenas was gunned down in](https://citizenlab.ca/2018/11/mexican-journalists-investigating-cartels-targeted-nso-spyware-following-assassination-colleague/)\na cartel-linked murder, his wife and colleagues received SMS messages designed to install\nPegasus on their phones. These links between murders and attempts of targeted\nsurveillance are echoed by recent investigative reporting in the _Financial Times detailing_\n[targeting against the Rwandan diaspora, including opposition activists and other exiles](https://www.ft.com/content/d9127eae-f99d-11e9-98fd-4d6c20050229)\nthreatened by Rwandan death squads.\n\n## 3.2. An NSO Operator May Have Masqueraded as the Washington Post\n\nCitizen Lab has also identified evidence suggesting that a Pegasus operator may have been\nmasquerading as the _Washington Post to infect targets in the weeks before and after the_\nOctober 2018 killing of Jamal Khashoggi. While the timing overlaps with the killing, the two\nare not necessarily related. We have very recently shared some technical details with the\n_Post’s information security team, and there are no indications that this targeting affected_\nanyone at the Washington Post. We also note that there is no overlap between the timeline\nof this activity and [recently](https://www.theguardian.com/technology/2020/jan/21/amazon-boss-jeff-bezoss-phone-hacked-by-saudi-crown-prince) [reported events surrounding the mobile phone of Jeff Bezos.](https://www.theguardian.com/technology/2020/jan/21/amazon-boss-jeff-bezoss-phone-hacked-by-saudi-crown-prince)\n\n## 3.3. Commercial Spyware Used to Hack Journalists\n\nNSO Group’s Pegasus spyware is not the only commercial surveillance technology on the\nmarket, nor is commercial spyware the only means by which abusive surveillance of\njournalists can be carried out.\n\n[Prior Citizen Lab research has identified targeted espionage against Ethiopian journalists](https://citizenlab.ca/2014/02/hacking-team-targeting-ethiopian-journalists/)\nlinked to the Ethiopian government, and using spyware sold by Hacking Team (now known\n[as Memento Labs) and Cyberbit (an Israeli-based spyware vendor). Our Stealth Falcon](https://citizenlab.ca/2017/12/champing-cyberbit-ethiopian-dissidents-targeted-commercial-spyware/)\nreport detailed a targeted digital espionage campaign against UK-based journalist Rori\n[Donaghy using bespoke spyware linked in media reports to UAE-based cybersecurity firm](https://theintercept.com/2016/10/24/darkmatter-united-arab-emirates-spies-for-hire/)\nDark Matter. Likewise, our research has documented numerous cases of targeted digital\n[espionage against journalists and news organizations covering Russia,](https://citizenlab.ca/2017/05/tainted-leaks-disinformation-phish/) [Tibet, and](https://citizenlab.ca/2016/03/shifting-tactics/) [China,](https://citizenlab.ca/2017/07/insider-information-an-intrusion-campaign-targeting-chinese-language-news-sites/)\ndating back to 2009.\n\nAcademic [research on journalist security show that journalists do not share the same digital](https://journals.sagepub.com/doi/full/10.1177/1464884919849418)\nsecurity practices and perceptions across the profession. For example, a study found that a\n[common mindset for journalists is to only prioritise digital security if they perceive the stories](https://isojjournal.wordpress.com/2016/04/14/security-by-obscurity-journalists-mental-models-of-information-security/)\nthey are working on as sensitive enough to attract the attention of government authorities.\n\n\n-----\n\nEchoing these findings, ongoing research by the Citizen Lab finds that investigative reporters\ntend to take digital security more seriously than their peers who work on non-investigative\nbeats, and have higher familiarity with digital security tools and practices.\n\nAs an investigative reporter covering a sensitive topic, Ben Hubbard was wary of suspicious\nmessages and chose to share the one he received with us for analysis. Yet, not all targeted\njournalists are working on a topic where the risk of surveillance may be so obvious.\n\nSome studies show that differences in education and training, alongside other variables such\nas financial incentives and institutional culture, may play a key role in closing or\ncompounding gaps in digital security practices. For example, a peer-reviewed study that\n[interviewed journalists in the US and France found journalists, editors, and technical staff](http://www.degruyter.com/view/j/popets.2016.2016.issue-4/popets-2016-0048/popets-2016-0048.xml?format=INT&rskey=Z2FbJZ)\nmay conceptualise and prioritise security issues differently, to the effect that reporters may\nresist and resent top down efforts to change security practices, or may see security as\nimportant, but struggle to get institutional support towards its implementation. Another such\n[study involving US-based journalists found a general lack of security culture in journalism](https://www.tandfonline.com/doi/full/10.1080/21670811.2019.1653207)\nand conflict between journalists and IT professionals within news organisations as among\nthe key barriers to journalists adopting secure tools and practices.\n\n[The Citizen Lab recently conducted a survey of 124 journalism schools across the US and](https://www.cjr.org/innovations/journalism-schools-behind-cybersecurity.php)\nCanada to probe what digital security courses they offered. Only half of the schools surveyed\noffered some form of digital security training, and only a quarter required it. Among programs\nthat offered training, the majority devoted less than two hours to the subject.\n\nTaken together, this body of research shows that more action is needed to prepare\njournalists for the digital threats they face. We believe that reports—such as this one—that\ncontinue to expose real cases of digital threats faced by journalists may help motivate those\nagitating for more methodical attention to digital security in journalism schools and news\norganizations.\n\n## 4. Conclusion\n\nThe targeting of yet another journalist—in this case at the _New York Times—makes it clear_\nthat the current regulatory regime for the spyware industry is not working. Absent strong\nregulation and control, the industry will continue to bolster authoritarianism by helping\npowerful elites invisibly thwart the work of journalists seeking to hold them to account.\n\nIn 2019, the UN Special Rapporteur on the promotion and protection of the right to freedom\n[of opinion and expression concluded that existing legal frameworks are insufficient, and](https://www.ohchr.org/EN/Issues/FreedomOpinion/Pages/SR2019ReporttoHRC.aspx)\ncalled for a moratorium on the export, sale, transfer, use, or servicing of privately developed\nsurveillance tools until a human rights-compliant safeguards regime is in place.\n\n\n-----\n\nUnfortunately, states have not acted—leading victims to take accountability into their own\nhands. In 2019 alone, several lawsuits were filed against spyware companies and their\n[government clients, with plaintiffs including spyware targets,](https://www.washingtonpost.com/opinions/saudi-arabia-has-been-spying-on-me-for-years-so-im-suing/2020/01/25/0fa55462-3f00-11ea-8872-5df698785a4e_story.html) [a human rights organization,](https://www.amnesty.org/en/latest/news/2019/05/israel-amnesty-legal-action-stop-nso-group-web-of-surveillance/)\n[and a major tech company. While these lawsuits may be the best option in the short-term,](https://www.ft.com/content/67a5b442-f971-11e9-a354-36acbbb0d9b6)\nthis piecemeal approach cannot provide the same benefits as comprehensive regulation of\nthe industry. Until there is action on this front, the media and other institutions that protect us\nall are vulnerable like never before.\n\n## Acknowledgements\n\nWe thank Ben Hubbard for sharing his suspicious message with us, along with the many\nother journalists who have participated in our previous investigations. Special thanks to\nSharly Chan, Miles Kenyon, and Adam Senft for copy editing and additional assistance.\n\n## Research Ethics\n\nAll research involving human subjects conducted at the Citizen Lab is governed under\nresearch ethics protocols reviewed and approved by the University of Toronto’s Research\nEthics Board. The Citizen Lab does not take general or unsolicited inquiries related to\n_individual concerns regarding information security and cannot provide individual assistance_\n_with security concerns._\n\n1. Also sometimes referred to in media reporting as Ghanem al-Dossari.1.\n2. NSO Group also sometimes goes by the name Q Cyber Technologies, and Pegasus2.\n\n\nalso appears to be sold under various names such as “Q Suite.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-28 - Stopping the Press- New York Times Journalist Targeted by Saudi-linked Pegasus Spyware Operator.pdf"
    ],
    "report_names": [
        "2020-01-28 - Stopping the Press- New York Times Journalist Targeted by Saudi-linked Pegasus Spyware Operator.pdf"
    ],
    "threat_actors": [
        {
            "id": "0f47a6f3-a181-4e15-9261-50eef5f03a3a",
            "created_at": "2022-10-25T16:07:24.228663Z",
            "updated_at": "2025-03-27T02:02:10.145238Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "Project Raven",
                "Stealth Falcon"
            ],
            "source_name": "ETDA:Stealth Falcon",
            "tools": [
                "Deadglyph",
                "StealthFalcon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77aedfa3-e52b-4168-8269-55ccec0946f7",
            "created_at": "2023-01-06T13:46:38.453791Z",
            "updated_at": "2025-03-27T02:00:02.837384Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "G0038"
            ],
            "source_name": "MISPGALAXY:Stealth Falcon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bd084d2f-4233-49b1-b0e6-c7011178dae0",
            "created_at": "2022-10-25T15:50:23.544316Z",
            "updated_at": "2025-03-27T02:00:55.496265Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "Stealth Falcon"
            ],
            "source_name": "MITRE:Stealth Falcon",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b938e2e3-3d1b-4b35-a031-ddf25b912557",
            "created_at": "2022-10-25T16:07:23.35582Z",
            "updated_at": "2025-03-27T02:02:09.750954Z",
            "deleted_at": null,
            "main_name": "APT 33",
            "aliases": [
                "APT 33",
                "ATK 35",
                "Cobalt Trinity",
                "Curious Serpens",
                "Elfin",
                "Holmium",
                "Magnallium",
                "Peach Sandstorm",
                "Refined Kitten",
                "TA451",
                "Yellow Orc"
            ],
            "source_name": "ETDA:APT 33",
            "tools": [
                "Atros2.CKPN",
                "AutoIt backdoor",
                "Breut",
                "CinaRAT",
                "DROPSHOT",
                "DarkComet",
                "DarkKomet",
                "DistTrack",
                "EmPyre",
                "EmpireProject",
                "FYNLOS",
                "FalseFont",
                "Filerase",
                "Fynloski",
                "JuicyPotato",
                "Krademok",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Mimikatz",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Notestuk",
                "POWERTON",
                "PoshC2",
                "PowerBand",
                "PowerShell Empire",
                "PowerSploit",
                "PsList",
                "Pupy",
                "PupyRAT",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "SHAPESHIFT",
                "Shamoon",
                "Socmer",
                "StoneDrill",
                "TURNEDUP",
                "Tickler",
                "Yggdrasil",
                "Zurten",
                "klovbot",
                "pupy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535574,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653752411,
    "ts_modification_date": 1653752411,
    "files": {
        "pdf": "https://archive.orkl.eu/f588189087fc8705bb89ac64f3837c65a95fcccd.pdf",
        "text": "https://archive.orkl.eu/f588189087fc8705bb89ac64f3837c65a95fcccd.txt",
        "img": "https://archive.orkl.eu/f588189087fc8705bb89ac64f3837c65a95fcccd.jpg"
    }
}