{
    "id": "27b8de1b-799c-4082-97ef-e5092c9e1399",
    "created_at": "2023-01-12T15:01:41.0277Z",
    "updated_at": "2025-03-27T02:15:26.168659Z",
    "deleted_at": null,
    "sha1_hash": "0c0a1f4c43b313d72089a843817aa30af9db5fd3",
    "title": "2022-02-23 - Ransomware Profile- ALPHV",
    "authors": "",
    "file_creation_date": "2022-05-27T22:57:35Z",
    "file_modification_date": "2022-05-27T22:57:35Z",
    "file_size": 170224,
    "plain_text": "# Ransomware Profile: ALPHV\n\n**blog.emsisoft.com/en/40931/ransomware-profile-alphv/**\n\n[Malware Lab](https://blog.emsisoft.com/en/category/malware-lab/)\n[Ransomware](https://blog.emsisoft.com/en/category/malware-lab/ransomware/)\n\n[Senan Conrad](https://blog.emsisoft.com/en/author/senan/)\nFebruary 23, 2022\n8 min read\n\n\nFebruary 23, 2022\n\n\n-----\n\nALPHV is a ransomware variant that encrypts data on infected systems and threatens to leak\nstolen data if the ransom payment is not made. It is highly customizable, which enables\nthreat actors to easily tailor an attack to the target environment. ALPHV was first observed in\nNovember 20201 and is believed to be the first active ransomware coded in the Rust\nprogramming language.\n\n## What is ALPHV?\n\nALPHV is a strain of ransomware that encrypts files using AES encryption (although the\nprocess can be overridden to use ChaCha20) and demands a large ransom for their\ndecryption. It is the only active ransomware developed using Rust, a programming language\nrenowned for its performance and safety. ALPHV has used Rust’s cross-platform capabilities\nto develop both Linux and Windows variants of the ransomware.\n\nALPHV is categorized as ransomware-as-a-service (RaaS), a business model whereby the\ndevelopers of the ransomware lease it to affiliates, who earn a portion of ransom payments\nin exchange for executing a successful attack. ALPHV offers affiliates a larger revenue share\nthan many other RaaS operations, with affiliates earning 80% of payments up to $1.5 million,\n85% of payments up to $3 million and 90% of payments over $3 million. The developers of\nALPHV typically recruit affiliates on Russian-speaking hacking forums.\n\nTo amplify the impact of an attack, ALPHV uses data exfiltration to put further pressure on\nvictims and increase their chances of a payout. During an attack, threat actors extract large\namounts of data from the compromised system and threaten to publish it on the ALPHV leak\nsite unless the victim pays the ransom.\n\n\n-----\n\nALPHV is one of a handful of ransomware groups that also threatens to DDoS victims that\nfail to pay the ransom. ALPHV allegedly uses its own botnet to manually perform the DDoS\nattacks. The group frames DDoS as an exclusive feature of sorts, available only to affiliates\nwho have generated more than $1.5 million in ransom payments.\n\n## The history of ALPHV\n\nALPHV was first detected in November 2021 and quickly claimed dozens of victims in the\nfirst few months of operation.\n\nIt is likely that ALPHV is a rebrand of a ransomware group known as BlackMatter, which was\nitself a rebrand of a group known as Darkside. It’s believed that these rebranding efforts may\nbe an attempt by threat actors to distance themselves from a costly development blunder\nthat [allowed Emsisoft to create a free Blackmatter decryption tool.](https://blog.emsisoft.com/en/39181/on-the-matter-of-blackmatter/)\n\nCybersecurity researchers originally named the ransomware ‘BlackCat’ after the image of an\ninky feline that was depicted on every victim’s Tor payment site. However, in February 2021,\na representative of the group confirmed that its only official name is ALPHV.\n\nSince ALPHV was first discovered, there have been 194 submissions to ID Ransomware, an\nonline tool that helps the victims of ransomware identify which ransomware has encrypted\ntheir files. We estimate that only 25 percent of victims make a submission to ID\nRansomware, which means there may have been a total of 776 ALPHV incidents since the\nransomware’s inception. During this time, the group also published on its leak site the stolen\ndata of at least 40 organizations.\n\n## ALPHV ransom note \n\nAfter the ransomware has been deployed and the encryption process is complete, ALPHV\ndrops a ransom note on the infected system. The ransom note is named after the apparently\nrandom file extension that ALPHV appends to all encrypted files, and uses the following\nnaming format: ‘RECOVER-[RANDOM EXTENSION]-FILES.txt’.\n\nThe ransom note informs the target that their files have been encrypted and includes a link to\na .onion site where the victim can make payment. The note also includes examples of the\ntype of data that was stolen during the attack, along with threats that the data will be\n\n\n-----\n\npublished if the victim refuses to cooperate.\n\nBelow is a sample ALPHV ransom note:\n\n>> Introduction\n\nImportant files on your system was ENCRYPTED and now they have “[REDACTED]”\nextension.\n\nIn order to recover your files you need to follow instructions below.\n\n>> Sensitive Data\n\nSensitive data on your system was DOWNLOADED and it will be PUBLISHED if you\nrefuse to cooperate.\n\nData includes:\n\n[REDACTED]\n\n– And more…\n\nPrivate preview is published here: [REDACTED]\n\n>> CAUTION\n\nDO NOT MODIFY FILES YOURSELF.\n\nDO NOT USE THIRD PARTY SOFTWARE TO RESTORE YOUR DATA.\n\nYOU MAY DAMAGE YOUR FILES, IT WILL RESULT IN PERMANENT DATA LOSS.\n\nYOUR DATA IS STRONGLY ENCRYPTED, YOU CAN NOT DECRYPT IT WITHOUT\nCIPHER KEY.\n\n>> Recovery procedure\n\nFollow these simple steps to get in touch and recover your data:\n\n1) Download and install Tor Browser from: https://torproject.org/\n\n2) Navigate to: [REDACTED]\n\n## Who does ALPHV target?\n\nALPHV tends to target large organizations with the resources and motivation to pay large\nransom demands. It is capable of infecting both Windows and Linux systems.\n\n\n-----\n\nALPHV prohibits attacks on nations belonging to the Commonwealth of Independent States\n(CIS), which includes Azerbaijan, Armenia, Belarus, Kazakhstan, Kyrgyzstan, Moldova,\nRussia, Tajikistan, Turkmenistan, Uzbekistan and Ukraine.\n\nThe group also prohibits attacks on government, healthcare and educational institutions. If\nan entity belonging to one of these sectors is attacked, ALPHV claims that it will provide free\ndecryption and ban the offending affiliate.\n\nAs always, any claims made by cybercrime groups should be taken with a grain of salt.\nALPHV has already published stolen data from at least one victim in the healthcare sector\n(the group has stated that its rules around avoiding the healthcare sector do not apply to\npharmaceutical companies and private clinics). Additionally, even if the group does provide\nfree decryption to an impacted entity, the recovery process may still take days, weeks or\nmonths to complete. This level of disruption can have a significant impact on patient health.\n\n## How does ALPHV spread?\n\nALPHV attacks begin by breaching the target network. Affiliates can use a variety of methods\nto infect the target system, including compromised RDP, phishing attacks, stolen credentials\nand exploiting known vulnerabilities.\n\nOnce the system has been compromised, attackers may use a variety of tools to prepare the\nenvironment for encryption and maximize the impact of the attack. Tools such as Mimikatz,\nLaZagne and WebBrowserPassView are used to access saved passwords, which enable\nthreat actors to escalate privileges and spread laterally across the network. MEGAsync is\noften used to exfiltrate data, while anti-forensics tools like File Shredder are sometimes used\nto securely delete files and thwart analysis. PowerShell is often used to modify Windows\nDefender security settings and shadow volume copies are deleted prior to encryption to\nprevent organisations from restoring encrypted files.\n\nALPHV requires a specific access token for the ransomware to execute properly. The access\ntoken acts as a unique key, which is used to verify the identification of the victim and must be\nprovided when accessing the ALPHV .onion payment site. The access token prevents thirdparties (such as ransomware researchers) gatecrashing what is supposed to be a private\nnegotiation between victim and attacker.\n\nAs ALPHV operates as a RaaS and can be distributed by many different affiliates, the exact\nanatomy of an attack can vary from incident to incident.\n\n## Major ALPHV attacks\n\n\n-----\n\n**Oiltanking: In late November 2021, German petrol distributor Oiltanking GmbH was**\nthe victim of an ALPHV attack. The incident affected 13 fuel terminals, including the\nautomated systems responsible for loading and unloading fuel tanks, and forced the\ncompany to resort to manual processes. More than 200 petrol stations, mostly located\nin northern Germany, were impacted during the attack.\n**Swissport: In February 2022, Swissport, the world’s leading provider of ground**\nservices and cargo handling for the aviation industry, was allegedly hit by ALPHV. The\ngroup posted on its data leak site a small sample of files that were apparently stolen\nduring the attack, including passports, internal business notes and the personal\ninformation of job candidates. The group also offered to sell the entire 1.6 TB set of\nstolen data.\n\n## How to protect the network from ALPHV and other ransomware \n\nThe following practices may help organizations reduce the risk of an ALPHV incident.\n\n**Cybersecurity awareness training: Because the majority of ransomware spreads**\nthrough user-initiated actions, organizations should implement training initiatives that\nfocus on teaching end users the fundamentals of cybersecurity. Ransomware and\npropagation methods are constantly evolving, so training must be an ongoing process\nto ensure end-users are across current threats.\n**Credential hygiene: Practicing** [good credential hygiene can help prevent brute force](https://blog.emsisoft.com/en/29524/how-to-create-manage-store-passwords/)\nattacks, mitigate the effects of credential theft and reduce the risk of unauthorized\nnetwork access.\n**Multi-factor authentication: MFA provides an extra layer of security that can help**\nprevent unauthorized access to accounts, tools, systems and data repositories.\nOrganizations should consider enabling MFA wherever possible.\n**Security patches: Organizations of all sizes should have a robust patch management**\nstrategy that ensures security updates on all endpoints, servers, and appliances are\napplied as soon as possible to minimize the window of opportunity for an attack.\n**Backups: Backups are one of the most effective ways of mitigating the effects of a**\nransomware incident. Many strains of ransomware can spread laterally across the\nnetwork and encrypt locally stored backups, so organizations should use a mixture of\nmedia storage, and store backup copies both on- and off-site. See this guide for more\n[information on creating ransomware-proof backups.](https://blog.emsisoft.com/en/34083/how-to-protect-your-companys-backups-from-ransomware/)\n**System hardening: Hardening networks, servers, operating systems and applications**\nis crucial for reducing attack surface and managing potential security vulnerabilities.\nDisabling unneeded and potentially exploitable services such as PowerShell, RDP,\nWindows Script Host, Microsoft Office macros, etc. reduces the risk of initial infection,\nwhile implementing the principle of least privilege can help prevent lateral movement.\n\n\n-----\n\n**Block macros: Many ransomware families are delivered via macro-embedded**\nMicrosoft Office or PDF documents. Organizations should review their use of macros,\nconsider blocking all macros from the Internet, and only allow vetted and approved\nmacros to execute from trusted locations.\n**Email authentication: Organizations can use a variety of email authentication**\ntechniques such as Sender Policy Framework, DomainKeys Identified Mail, and\nDomain-Based Message Authentication, Reporting and Conformance to detect email\nspoofing and identify suspicious messages.\n**Network segregation: Effective network segregation helps contain incidents, prevents**\nthe spread of malware and reduces disruption to the wider business.\n**Network monitoring: Organizations of all sizes must have systems in place to monitor**\npossible data exfiltration channels and respond immediately to suspicious activity.\n**Penetration testing: Penetration testing can be useful for revealing vulnerabilities in IT**\ninfrastructure and employees’ susceptibility to ransomware. Results of the test can be\nused to allocate IT resources and inform future cybersecurity decisions.\n**Incident response plan: Organizations should have a comprehensive incident**\nresponse plan in place that details exactly what to do in the event of infection. A swift\nresponse can help prevent malware from spreading, minimize disruption and ensure\nthe incident is remediated as efficiently as possible.\n\n## How to remove ALPHV and other ransomware  \n\nALPHV uses encryption methods that currently make it impossible to decrypt data without\npaying for an attacker-supplied decryption tool.\n\n### Download now: Emsisoft Anti-Malware free trial.\n\nAntivirus software from the world’s leading ransomware experts. Get your free trial today. Try\nIt Now\nVictims of ALPHV should be prepared to restore their systems from backups, using\nprocesses that should be defined in the organization’s incident response plan. The following\nactions are recommended:\n\nTake action to contain the threat.\nDetermine the extent of the infection.\nIdentify the source of the infection.\nCollect evidence.\nRestore the system from backups.\nEnsure all devices on the network are clean.\nPerform a comprehensive forensic analysis to determine the attack vector, the scope of\nthe incident and the extent of data exfiltration.\nIdentify and strengthen vulnerabilities to reduce the risk of a repeat incident.\n\n\n-----\n\n### Senan Conrad\n\nAs a cybersecurity enthusiast, Senan specializes in giving readers insight into the everchanging world of malware, and the ransomware scene in particular. When he's not tapping\naway at his keyboard, you can catch Senan drinking a good coffee or tinkering in his\nworkshop.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-23 - Ransomware Profile- ALPHV.pdf"
    ],
    "report_names": [
        "2022-02-23 - Ransomware Profile- ALPHV.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535701,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653692255,
    "ts_modification_date": 1653692255,
    "files": {
        "pdf": "https://archive.orkl.eu/0c0a1f4c43b313d72089a843817aa30af9db5fd3.pdf",
        "text": "https://archive.orkl.eu/0c0a1f4c43b313d72089a843817aa30af9db5fd3.txt",
        "img": "https://archive.orkl.eu/0c0a1f4c43b313d72089a843817aa30af9db5fd3.jpg"
    }
}