{
    "id": "27f73ab2-3957-4092-b114-06568b599248",
    "created_at": "2022-10-25T16:48:17.123921Z",
    "updated_at": "2025-03-27T02:15:38.03093Z",
    "deleted_at": null,
    "sha1_hash": "baaa9f04b3e164257e671420179ff939cdf23bed",
    "title": "Exploring Emotet’s Activities",
    "authors": "",
    "file_creation_date": "2019-01-28T11:11:42Z",
    "file_modification_date": "2019-01-28T11:11:54Z",
    "file_size": 2466974,
    "plain_text": "# Exploring Emotet’s Activities\n\n\n-----\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general informa\ntion and educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted\n\nupon without the benefit of legal advice based on the\n\nparticular facts and circumstances presented and nothing\n\nherein should be construed otherwise. Trend Micro re\nserves the right to modify the contents of this document at\n\nany time without prior notice.\n\nTranslations of any material into other languages are in\ntended solely as a convenience. Translation accuracy is\n\nnot guaranteed nor implied. If any questions arise related\n\nto the accuracy of a translation, please refer to the original\n\nlanguage official version of the document. Any discrepan\ncies or differences created in the translation are not bind\ning and have no legal effect for compliance or enforcement\n\npurposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as to\n\nits accuracy, currency, or completeness. You agree that\n\naccess to and use of and reliance on this document and\n\nthe content thereof is at your own risk. Trend Micro dis\nclaims all warranties of any kind, express or implied. Nei\nther Trend Micro nor any party involved in creating, pro\nducing, or delivering this document shall be liable for any\n\nconsequence, loss, or damage, including direct, indirect,\n\nspecial, consequential, loss of business profits, or special\n\ndamages, whatsoever arising out of access to, use of, or\n\ninability to use, or in connection with the use of this doc\nument, or any errors or omissions in the content thereof.\n\nUse of this information constitutes acceptance for use in\n\nan “as is” condition.\n\nPublished by:\nTrend Micro Research\n\nStock images used under license from\n\nShutterstock.com\n\n\n## Contents\n\n 03\n\n###### Abstract\n\n## 04\n\n###### Introduction\n\n## 06\n\n###### Infection Chain\n\n## 11\n\n###### Binary Analysis\n\n## 16\n\n###### Emotet’s Ties to Russian-Speaking Actors\n\n## 18\n\n###### Two Infrastructures Running in Parallel\n\n## 24\n\n###### Emotet’s Artifacts: Multi-group and Multilayer Operation\n\n## 28\n\n###### The Malware Author’s Likely Location\n\n## 30\n\n###### Prevention and Solutions\n\n## 32\n\n###### Conclusion\n\n\n-----\n\n##### Abstract\n\nEmotet started as a banking trojan that has since evolved into a\n\nmalware dropper that criminal actors frequently use to deliver other\n\nmalicious components. The United States Computer Emergency\n\nReadiness Team (US-CERT), a government agency dedicated to\n\nanalyzing cyberthreats, has raised an alert for Emotet, calling it\n\none of “the most costly and destructive malware affecting state,\n\nlocal, tribal, and territorial (SLTT) governments, and the private\n\nand public sectors.”[1] Our research presents an in-depth analysis\n\nof Emotet’s activities, including its operational models and several\n\ntechnical details on its infection chains and binaries. Moreover, we\n\nprovide some potential threat actor attribution to help open new\n\ndoors to those researching and tracking the actors behind Emotet.\n\n\n-----\n\n### Introduction\n\nEmotet, a modular trojan that Trend Micro discovered in June 2014,[2]‎ has recently evolved into a global\n\nthreat distributor by carrying and distributing other several infamous banking trojans. This development\n\nhas massively affected victims.[3, 4] According to the US-CERT, Emotet costs up to $1 million per incident\n\nto remediate.[5] To fight against the infamous cybercrime group, we provide a comprehensive research on\n\nEmotet’s artifacts collected from June 1, 2018, to September 15, 2018, comprising 8,528 unique URLs,\n\n5,849 document droppers, and 573 executable samples.\n\nThe data we used includes data collected by Trend Micro and public malware research repositories without\n\nany hack-back activities. We applied some heuristic signatures on email gateway solutions to source\n\npossible Emotet artifacts and then utilized a self-built system to track the infection chains and analyze\n\nEmotet’s executables. We also employed YARA signatures on public malware research repositories to\n\nsource potential objects. We cannot guarantee the extensiveness of the coverage of Emotet’s artifacts,\n\nbut we have done our best to ensure that the research is sound.\n\nThis research presents an in-depth analysis of Emotet’s infection chains, binaries, and configurations in\n\nexecutable files. We provide detailed documentation on the obfuscation techniques used on Emotet’s\n\nexecutables as well as an investigation of all of the malware’s related artifacts. The data gathered from\n\nour analysis revealed the infrastructures behind Emotet as well as possible attribution. Here is a summary\n\nof our findings:\n\n1. Emotet’s business is tied to Russian-speaking actors, according to open-source intelligence records.\n\n2. Its operators use at least two independent infrastructures running parallel to one another to support\n\nthe Emotet botnet. By grouping the C&C servers and the RSA keys, we were able to get two distinct\n\ninfrastructure groups. We also saw that those behind the Emotet malware switched its RSA keys\n\non a monthly basis. The next-stage payloads pushed by the two groups did not show any major\n\ndifferences in terms of purpose or targets, which means the differing infrastructure of the two groups\n\nmay have been designed to make it more difficult to track Emotet and minimize the possibility of\n\nfailure.\n\n3. Multilayer operating mechanisms might have been adopted in the creation of Emotet’s artifacts.\n\nThe inconsistency between the activity patterns shows that the infrastructure used to create and\n\nspread document droppers is different from the infrastructure used to pack and deploy Emotet\n\n\n-----\n\nexecutables. The creation of document droppers stops during the non-working hours between 1:00\n\nto 6:00 (UTC). Meanwhile, there might be three sets of machines that are used to pack and deploy\n\nEmotet’s executable payloads, two of which are probably set to the UTC +0 and UTC +7 time zones,\n\nrespectively.\n\n4. The author of the Emotet malware likely resides somewhere in the UTC +10 time zone or further east.\n\nAfter we grouped the executable samples by their unpacked payloads’ compilation timestamps, we\n\nfound two sample groups that showed an inconsistency between the compilation timestamps and\n\nthe corresponding first-seen records in the wild. This leads to the possibility that the compilation\n\ntimestamps point to the local time on the malware author’s machine. If the local time is accurate, it’s\n\npossible that the malware author is located somewhere in the UTC +10 time zone or further east.\n\n\n-----\n\n### Infection Chain\n\nEmotet is known for using social engineering tricks to launch its attacks. The infection chain starts with a\n\nspam email — one that could have been sent from legitimate email addresses that have been compromised,\n\nsince Emotet’s spamming module allows it to log into remote email service providers and spam emails\n\nfrom infected accounts. After a user clicks on the malicious URL or downloads the attachment, a dropper,\n\nusually a document file with a malicious macro, will be downloaded. Once the dropper successfully runs,\n\nit downloads an Emotet executable. In a recent Emotet campaign we’ve observed, the malware’s payload\n\nis a loader that will install next-stage payloads or execute commands received from C&C servers.\n\n\nSpam email with\nmalicious URL\n\n\nURL leads to\nmalicious macro\n\n\nMacro downloads\nEmotet’s loader\npayload\n\n\nLoader downloads\nnext-stage payloads,\nexecutes C&C commands\n\n\nFigure 1. An overview of Emotet’s infection chain\n\n#### Social Engineering\n\nThe majority of Emotet’s spam emails adopt business-related topics to lure victims into clicking the URLs\n\nor downloading attachments. These spam emails have been reported to be written in English, German,\n\nand French. For example, aside from a fake invoice, we also found an Emotet spam campaign disguised\n\nas an Independence Day e-Card sent on July 4.\n\n\n-----\n\nFigure 2. Emotet spam sample under the guise of a fake invoice in MS word format\n\nFigure 3. Emotet spam sample disguised as a fake invoice in PDF format\n\nFigure 4. Emotet spam sample with an embedded malicious URL\n\n\n-----\n\n#### Malicious URL Analysis\n\nWe collected 8,528 unique URLs that led to our collection of Emotet’s document droppers — 922 of\n\nwhich lead to Emotet’s executables. A manual check revealed that most of the URLs we found seemed to\n\nbe compromised sites. During our analysis, we discovered that one of the URLs was visited 4,627 times.\n\nWe recorded roughly 400 of Emotet’s URLs on the same day, and were able to estimate the new visit\n\nnumber of Emotet’s URLs — 1,680,000 visitors — if we assume all of the URLs had the same click volume.\n\nNote that the actual number should be lower since a part of the URL visits might be from security vendors\n\nor their products, various automated internet crawlers, and security or threat researchers.\n\n#### Document Dropper Analysis\n\nWe gathered 2,258 document droppers from which we extracted executable files. After studying these\n\ndroppers, we realized that the code page identifiers and the metadata versions could provide us with\n\nsome useful information about the malware. The code page identifier was used to interpret the way in\n\nwhich the text were encoded,[6] and the metadata version indicated the current version Microsoft Word\n\nautomatically saved. We extracted the code page identifiers and the versions from the samples and\n\nfound that these can be grouped into two. The first group has version = 917504 and code page = 1251\n\n(Windows Cyrillic-Slavic, mostly used by Russians, Bulgarians, Serbians and Macedonians), while the\n\nsecond group has version = 1048576 and code page = 1252 (Windows Latin 1 ANSI, mostly used in\n\nWestern Europe including France, but also for any Windows system using the English language). We\n\nperformed a retro-hunt on these signatures and found 3,591 extra samples, expanding our collection to\n\na total of 5,849 document droppers.\n\nFigure 5. An example of Emotet’s malicious document dropper\n\n\n-----\n\nThe macro in the document is obfuscated, and uses AutoOpen() to trigger the payload. The goal of the\n\nembedded Visual Basic code is to get Emotet’s executable hosted on the remote server by running\n\nWindows PowerShell.[7, 8]\n\nFigure 6. An example of an obfuscated PowerShell command run by an\nEmotet document dropper in a sandbox environment[9]\n\nEach document dropper is embedded with about five URLs that host Emotet executable payloads. The\n\nformat of the URLs hosting the executables is different from the format of the URLs that drop documents.\n\nThe following are some examples:\n\nURLs used to host Emotet executables:\n\n– hxxp: //websitedesigngarden[.]com/e6vTCit\n\n– hxxp: //emicontrol[.]com/85a\n\n– hxxp: //grupoembatec[.]com/zHVN\n\n– hxxp: //stevebrown[.]nl/3YA1kb/\n\nURLs used to host Emotet documents:\n\n– hxxp: //167[.]99[.]81[.]74/433650Z/PAYROLL/Smallbusiness\n\n– hxxp: //3music[.]net/DOC/US_us/New-order\n\n– hxxp: //acb-blog[.]com/7gwg7ySK/de_DE/Firmenkunden/\n\n– hxxp: //aesbusiness[.]ru/02385XSGEBFE/PAY/Commercial\n\nAdditionally, the obfuscation method used on Emotet’s macro attachments was found to be the same as\n\nthe one used in some Ursnif campaigns. However, the format of the URLs that hosted the executables\n\nwas different. For instance:\n\n\n-----\n\nURLs used to host Emotet executables:\n\n– hxxp: //websitedesigngarden[.]com/e6vTCit\n\n– hxxp: //emicontrol[.]com/85a\n\n– hxxp: //grupoembatec[.]com/zHVN\n\n– hxxp: //stevebrown[.]nl/3YA1kb/\n\nURLs used to host Ursnif executables:\n\n– hxxp: //d792jssk19usnskdxnsw[.]com/MXE/lodpos[.]php?l=yows2[.]xt2\n\nWe have only seen this obfuscation method being used by the cybercriminal groups that push these two\n\nmalware families. We found that one of the groups that pushed Ursnif used some tools written in the\n\nRussian language.\n\n\n-----\n\n### Binary Analysis\n\nThe following sections provide a detailed technical analysis of the Emotet samples we collected, including\n\nthe obfuscation methods used, the packing techniques employed, as well as its behaviors.\n\n#### Obfuscation\n\nEmotet’s executables adopt a unique anti-analysis method. The executables’ obfuscation method moves\n\nthe first few instructions from a specific location inside the payload to another specific memory region\n\n(which we named “jump table”) allocated by the loader. The missing instructions are frequently found\n\nat the beginning of each function. The jump table is located outside of the module; therefore, simply\n\ndumping the module will lead to a broken executable. The following figures illustrate the obfuscation\n\ntechnique.\n\nCall Func_A Func_A\n\nControl flow without obfuscation\n\nFew instructions\nCall Func_A JMP Func_A\nare missing\n\nMemory region allocated by loader\n\nJunk Func_A missing\nJMP\ncode instructions\n\nFigure 7. An overview of Emotet’s obfuscation technique\n\nThe following is a concrete example: The binary calls a function located at 0x1DA1030. The function\n\nprologue and a few instructions of that function disappear, and the first instruction is replaced by a JMP\n\nin the memory region located at 0x52001D. The memory region is not in the same module as Emotet’s\n\npayload itself. After all of the missing instructions in the jump table are executed, the binary jumps back\n\nto its original function.\n\n|Call Func_A|Col2|\n|---|---|\n|||\n\n|Call Func_A|Col2|\n|---|---|\n|||\n\n|JMP|Few instructions are missing|Func_A|\n|---|---|---|\n|Memory region allocated by loader Junk Func_A missing JMP code instructions|||\n\n|Junk code|Func_A missing instructions|JMP|\n|---|---|---|\n\n\n-----\n\nFigure 8. Emotet’s obfuscated control flow explanation\n\n#### Packing Technique\n\nEmotet’s samples were packed using customized packers. These packers first decrypt the loaders, and\n\nthe loaders then decrypt and load Emotet’s main payloads. The obfuscation jump tables will be installed\n\nbefore the main payloads run.\n\nThe obfuscation installation process is in the loader’s procedures. We document the structure used by the\n\nloaders to install the obfuscation jump tables as:\n\n\n{\n\nPBYTE instructions; pointer to the missing instructions\n\nDWORD offset; offset (RVA) in payload where should be patched\n\nDWORD size; size of missing instructions\n\n}\n\n\nFigure 9. A table of jump table entries\n\n\n-----\n\nThe current ImageBase of the payload is at 0x4E0000, while the ImageBase of the loader is at 0x4A0000.\n\nAs the above figure shows, the first entry on the table is instruction = 0x4A418D, offset = 0x101F, size =\n\n0x6.\n\nFor the first entry, the 6-byte instructions at 0x4A418D is:\n\nFigure 10. The first entry’s instruction\n\nImageBase + offset = 0x4E101F. The memory content is:\n\nFigure 11. The memory content before the obfuscation technique is installed\n\nAfter the loader finishes installing the obfuscation technique, the loader writes a jump to the jump table.\n\nFigure 12. The memory content after the obfuscation technique is installed,\nwhich leads to a jump on the jump table\n\nOn the jump table (0x4C004), the missing instructions are executed and jump back to execute its original\n\nfunction at 0x4E1025.\n\nFigure 13. Jumps back to execute missing instructions\n\n\n-----\n\n#### Configuration\n\nThe Emotet samples embed C&C servers in the IP and Port formats. The RSA key for encrypting network\n\ntraffic can also be found in the configuration part of each Emotet executable.\n\nThe structure for the C&C server is as follows:\n\n\n#pragma pack(4)\n\n{\n\nDWORD IP;\n\nUSHORT PORT;\n\n}\n\n\nFor instance, the first C&C server in the configuration is 173.11.129.38:80.\n\nFigure 14. C&Cs in the configuration\n\nThe encoded RSA public key blob is also embedded in the configuration. It will be later decoded by\n\nCryptDecodeObjectEx() to a PublicKeyBlob object in Figure 15.[10]\n\nFigure 15. The decoded PublicKeyBlob object\n\n#### Network Communication Protocol\n\nThe binaries of Emotet collect information related to operating systems, processes, and sometimes mail\n\nclient information, which it sends back to its C&C servers. The protocol is based on Google ProtoBuf,[11 ]\n\nand all of the messages are encrypted by AES. If the packet does not exceed a certain length, it places\n\ninformation in a cookie and sends the GET requests. Otherwise, it uses POST to deliver data.\n\n\n-----\n\nPaweł Srokosz has done amazing research on Emotet’s network protocol, which is worth reading.[12]\n\n#### Modules\n\nEmotet has been found carrying the following legitimate tools or modules that are being abused by\n\nEmotet actors:[13]\n\n– Mail PassView[14]\n\n– WebBrowserPassView[15]\n\n– Spam Module\n\nEmotet is capable of sending out spam emails via its spam module. The module can abuse the\n\ncompromised email accounts powered by Emotet’s C&C servers, which makes blocking Emotet’s spam\n\nemails harder.\n\n#### Next-Stage Payload\n\nRecent campaigns used Emotet as a loader, carrying other malware as next-stage payloads. Qakbot,\n\nIcedID, Zeus Panda, TrickBot and Dridex were all recorded to have been dropped by Emotet.\n\n\n-----\n\n### Emotet’s Ties to Russian-Speaking Actors\n\nFeodo (AKA Bugat or Cridex) is a banking trojan that emerged in 2010. At the time, Atif Mushtaq (then a\n\nFireEye researcher) wrote that the malware was not a toolkit and that a single cybercriminal group was\n\npushing it.[16] Two succeeding branches soon appeared, the first of which is the infamous banking trojan\n\nDridex that was found around September 2011. Nikita Slepogin, a Kaspersky researcher, has documented\n\nthe evolution of this malware in detail.[17] The other branch is Geodo (AKA Emotet). While Geodo/Emotet\n\ninherits the design of Feodo’s network infrastructure, its code is completely different from that of the\n\noriginal Feodo.[18] Geodo/Emotet was also found using the stolen SMTP credentials from compromised\n\ncomputers in the Feodo botnet.[19] The successor of Geodo, which some researchers named Heodo or\n\nEmotet v4, followed years after, appearing in March 2017. In summary, Emotet is the successor of Feodo,\n\nwhich can be traced back to 2011.\n\nIt has recently delivered several payloads, including the Zeus Panda banker, TrickBot, IcedID, and AZORult.\n\nFor this section, we referred to @malware_traffic’s data on Malware Traffic Analysis and analyzed the\n\nconfiguration of TrickBot and Zeus Panda banker dropped by Emotet.[20]\n\nTrickBot, the successor of Dyreza (or Dyre),[21] is a modularized banking trojan that uses a group tag (gtag)\n\nto keep track of its affiliates. So far, several gtags “arz1,” “del77,” “jim316,” “lib316,” “tot285,” and “del34”\n\nhave already been recorded. According to @malware_traffic, Emotet loaded TrickBot on the following\n\noccasions: June 14 and 15, July 6, 16, and 31, Aug. 8, Sep. 4, 14, 20, 21, and 26. He noticed that he got\n\ndifferent TrickBot samples from the same Emotet malware whenever UK or US IPs were used to connect\n\nto the C&C servers.\n\nOn September 21, @malware_traffic got TrickBot samples with gtags “arz1,” “del77,” “jim317,” and\n\n“lib316.”[22] We successfully got the web injection configurations of these samples from the C&C servers.\n\nThe targets were banks, cryptocurrency exchanges and financial institutions located in the US, Germany,\n\nUK, Canada, Austria, Spain, Ireland, Netherlands, Japan, Greek, South Africa, and Bulgaria. The target\n\nlists and the fake sites used for redirection are shared among different gtags, which might indicate that\n\nTrickBot serves as a cybercrime service that looks for business affiliations.\n\n\n-----\n\nZeus Panda is a banking trojan and a variant of Zeus. The malware will not infect victims who have\n\nRussian (0x419), Ukraine (0x422), Belarus (0x423) and Kazakhstan (0x43f) keyboard codes installed.\n\nThere are 17 samples of Zeus Panda recorded to have been dropped by Emotet during our research\n\nperiod. The RSA public key for traffic encryption is embedded in the configuration. We discovered that\n\nthere is only one RSA public key among these samples, and it indicates that only one actor might have\n\nused those Zeus Panda samples during that period. Unfortunately, we failed to get the web injection from\n\nthe C&C servers, so we cannot provide who the actor was targeting. However, we were able to find some\n\nopen source intelligence recording that the majority of the targets were located in the U.S., Canada, and\n\nGermany.\n\nIcedID is a banking trojan that IBM discovered in September 2017 and has collaborated with TrickBot,\n\naccording to FlashPoint researchers.[23, 24] Emotet has been recorded dropping IcedID since June 2017. Its\n\ntargets at that time were mostly located in the U.S.[25]\n\nThese malware families are associated with Russian-speaking actors. TrickBot is the successor of Dyre,\n\nwhich was frequently loaded by Upatre from a few years ago. Upatre also dropped GameOver Zeus\n\n(P2P Zeus) in the past. GameOver Zeus has been attributed to an experienced criminal organization led\n\nby Russian actors.[26] Besides, Trickbot has been used by a cybercriminal group associated with Dridex,\n\nNecurs, Locky, and CryptoLocker.[27] AZORult is a loader and an information stealer that was sold on\n\nseveral Russian-speaking underground forums by an actor who used the pseudonym “CrydBrox.” With\n\nthis intelligence, it is safe to assume that the actor behind Emotet has some business relationships with\n\nRussian-speaking actors.\n\n#### Shares the same weapon(s) with other infamous Russian-speaking gangs\n\nAside from Emotet’s apparent Russian-speaking business affiliations, technical evidence also shows that\n\nit might have the same weapon providers as other notorious cybercriminal gangs, including the actors\n\nbehind Ursnif, Dridex and BitPaymer. A blog entry we recently published detailed how the executable\n\nloaders that these four groups used share identical payload decryption procedures and internal data\n\nstructures.[28] This indicates that these four gangs use the same tool, which could support the inference\n\nthat they share the same weapon providers or have some relationships with one another that allow them\n\nto exchange resources. While Ursnif’s ancestor, GOZI-ISFB, was created by a Russian, Dridex’s was once\n\nadministrated by an arrested Russian-speaking background actor.[29] Meanwhile, BitPaymer shares similar\n\ncode with Dridex, which could also point to attribution links.[30] This reveals that these Russian-speaking\n\ncybergangs may have fostered working relationships with one another.\n\n\n-----\n\n### Two Infrastructures Running in Parallel\n\nWe’ve collected and analyzed 573 Emotet executable samples. The configuration inside an executable\n\nincludes a list of C&C servers and an RSA key for encrypting the connection.\n\n#### RSA Keys\n\nWe extracted six unique RSA public keys from the Emotet executables. Each RSA key has a 768-bit\n\nmodulus and exponent 65537. We calculated the CRC32 of each RSA key blob and gave each key a\n\nname to represent the specific keys in the article.\n\nKey Name CRC32 Infra\n\nA fcb2fb3b 1\n\nB 86e9acef 1\n\nC ceff5362 1\n\nD fc8e8aaa 2\n\nE 8f1eb5e 2\n\nF aef0def8 2\n\nTable 1. The RSA keys extracted from Emotet executables\n\n#### C&C Servers\n\nEach Emotet sample contains multiple hardcoded C&C servers. We extracted 721 unique C&C servers in\n\ntotal. On average, one Emotet sample contains 39 C&C servers, with a maximum of 44 and a minimum of\n\n14. Based on our observation, only a few C&C servers embedded in a single Emotet sample are actually\n\nactive.\n\nMost of the C&C servers are located in the U.S., Mexico, and Canada. The Top 3 ASN connected to\n\nEmotet’s C&C servers are ASN7922, ASN8151, and ASN22773.\n\n|Key Name|CRC32|Infra|\n|---|---|---|\n|A B C D E F|fcb2fb3b 86e9acef ceff5362 fc8e8aaa 8f1eb5e aef0def8|1 1 1 2 2 2|\n\n\n-----\n\nUnited States\n\nMexico\n\nCanada\n\nUnited Kingdom\n\nGermany\n\nFrance\n\nIndia\n\nEcuador\n\nUnited Arab Emirates\n\nSouth Africa\n\nAustralia\n\nColombia\n\nOther\n\nFigure 16. Countries where Emotet C&C servers are distributed\n\n80\n\n8080\n\n443\n\n7080\n\n50000\n\n8443\n\n8090\n\n4143\n\n990\n\nOthers\n\nFigure 17. Distribution of Emotet C&C servers’ ports\n\n\n45%\n\n8%\n\n7%\n\n4%\n\n4%\n\n3%\n\n2%\n\n2%\n\n2%\n\n2%\n\n2%\n\n1%\n\n17%\n\n38%\n\n20%\n\n18%\n\n5%\n\n4%\n\n3%\n\n3%\n\n2%\n\n2%\n\n5%\n\n\nWe visualized the relationship between each RSA key and its set of C&C servers and discovered two RSA\n\ngroups. Keys A, B, and C were in one group (Group 1), and keys D, E, and F were in another (Group 2).\n\n\n-----\n\nFigure 18. The relationship between RSA keys and C&C servers. Each blue dot represents a unique\nC&C server, while the red ones indicate RSA public keys\n\nFigure 18 shows that the two groups did not share C&C servers. Our analysis did show a link between the\n\ndates the RSA keys were received and the two groups’ activities: each RSA key was observed to have\n\nbeen used for one month before threat actors switched to another key on the first working day of the new\n\nmonth (Jul. 2, 2018 and Sep. 3, 2018, both fall on a Monday).\n\nJune July August September\n\nKeys used by Group 1 fcb2fb3b (A) 86e9acef (B) ceff5362 (C)\n\nKeys used by Group 2 fc8e8aaa (D) 8f1eb5e (E) – aef0def8 (F)\n\nTable 2. Two groups of RSA keys and their corresponding active months\n\n|Col1|June|July|August|September|\n|---|---|---|---|---|\n|Keys used by Group 1 Keys used by Group 2|fcb2fb3b (A) fc8e8aaa (D)|86e9acef (B) 8f1eb5e (E) –||ceff5362 (C) aef0def8 (F)|\n\n\n-----\n\nFigure 19. The time the RSA keys were received. Each dot represents the time when\nthe RSA key was found in the configuration of a new sample. The group 1 keys are in green,\nand orange is for group 2\n\nWe also observed that Group 1 had more artifacts than Group 2. Based on our data, we received 469\n\nunpacked Emotet samples for Group 1 and 102 for Group 2. We also did not find any activity for Group\n\n2 in August, as shown in Figure 4.\n\n#### Two Different Emotet Groups, Two Different Agendas?\n\nOur initial assumption was that the two Emotet groups were either created for different purposes or\n\nutilized by different operators. To prove this assumption, we referred to @malware_traffic and categorized\n\nthe IoCs respectively. However, we did not find any major difference between the IoCs under these two\n\ngroups. For instance, TrickBot with gtag arz1 was found to have been sent by Group 1 on September 20\n\nand by Group 2 the next day. Without any strong evidence, we can only tell that the two might be different\n\ninfrastructures designed to make tracking Emotet more difficult and help minimize the possibility of failure.\n\n|Date|Emotet Group|RSA Key|Next-stage Payload|\n|---|---|---|---|\n|2018-07-03|2|E|Panda Banker|\n|2018-07-09|1|B|Panda Banker|\n|2018-07-16|2|E|Panda Banker|\n|2018-07-19|2|E|Panda Banker|\n|2018-07-30|1|B|Panda Banker|\n|2018-07-31|1|B|Panda Banker|\n|2018-08-08|1|B|TrickBot|\n\n\n-----\n\n|Date|Emotet Group|RSA Key|Next-stage Payload|\n|---|---|---|---|\n|2018-08-10|1|B|Panda Banker|\n|2018-08-13|1|B|Panda Banker|\n|2018-08-14|1|B|Panda Banker|\n|2018-08-15|1|B|Panda Banker|\n|2018-08-16|1|B|Panda Banker|\n|2018-08-22|1|B|Panda Banker|\n|2018-08-24|1|B|Panda Banker|\n|2018-08-26|1|B|Panda Banker|\n|2018-09-04|2|F|IcedID, TrickBot|\n|2018-09-05|2|F|IcedID, AZORult|\n|2018-09-06|1|C|IcedID, AZORult|\n|2018-09-14|1|C|TrickBot gtag: del72|\n|2018-09-20|1|C|TrickBot gtag: arz1|\n|2018-09-21|2|F|TrickBot gtag: arz1, del77, jim316, lib316|\n|2018-09-25|2|F|TrickBot gtat: arz1, IcedID, AZORult|\n\n\nTable 3. The next-stage payload delivered by Emotet’s two infrastructures between\nJuly and September 2018\n\n#### Compiling Emotet’s Source Code for Each Infrastructure\n\nCustomized packers and obfuscators protect Emotet payloads. We studied the compilation timestamps\n\nagainst each sample before and after packing and saw that some of the timestamps in packed samples\n\nwere forged, while some seemed legitimate. The samples with legitimate timestamps showed a difference\n\nof a few minutes between the time they were compiled and the time they were found in the wild. For\n\nexample, sample SHA256: 648dce03ac4c32217ce5c0b279bc3775faf030cafb313c74009fe60ffde3c924\n\n(Detected by Trend Micro as TSPY_EMOTET.NSFOGAH) was compiled at 2018-06-06 05:40:17 and was\n\nfound in the wild four minutes later. However, sample SHA256: 07deb1b8a86d2a4c7a3015899383dcc4c\n\n15dfadcfafc3f2b8d1e3aa89a6c7ac4 (Detected by Trend Micro as TSPY_EMOTET.TTIBBJD) was compiled\n\non 2035-07-30 21:36:11, which is obviously a fake timestamp. Since it is difficult to distinguish legitimate\n\ntimestamps from forged ones, research on the packed files’ timestamps may prove to be fruitless.\n\n\n-----\n\nEven though the compilation timestamp might be bogus, we decided to analyze the unpacked Emotet\n\nsamples and saw that their timestamps seemed legitimate. Out of 571 unpacked Emotet samples, only\n\n11 distinct compilation timestamps were found. If the timestamp is forged during every compilation, the\n\nsamples compiled with the same pieces of code should contain identical code sections but with different\n\ncompilation timestamps. However, we found that the unpacked samples with the same timestamp shared\n\nthe identical code section, while differences can be found among those with different timestamps. The\n\nchanges between the different timestamps also seem to be new-version updates.\n\nThe data in Table 4 show that the actor might have used automatic tools or scripts to compile Emotet’s\n\nsource code for each infrastructure, since a number of unique samples shared the same compilation\n\ntimestamp. The data also shows that the actors prepared the payload for Groups 1 and 2 sequentially. For\n\nexample, on June 3, 2018, 46 Emotet samples were generated at 20:08 (UTC) using Group 1’s RSA public\n\nkey and C&C servers. Two minutes later, the 37 other Emotet samples were generated.\n\nWe noticed that the attackers tended to update Emotet samples on Monday or Wednesday (UTC). We\n\nalso observed that the code section is the same among the samples with the same compilation timestamp.\n\nThe only difference is in the C&C servers embedded in the data section. It is possible that each time a\n\nsource code is compiled, several C&C servers on the attacker’s control list were chosen to generate a\n\nnew sample.\n\nEmotet RSA Compilation Payloads’ Compilation Unique\nGroup Key Timestamp in Epoch Timestamp in UTC Sample Count\n\n1 A 1528056487 2018-06-03 20:08:07 46\n\n2 D 1528056680 2018-06-03 20:11:20 37\n\n1 B 1530547690 2018-07-02 16:08:10 28\n\n2 E 1530547815 2018-07-02 16:10:15 24\n\n1 B 1531161666 2018-07-09 18:41:06 31\n\n2 E 1531161732 2018-07-09 18:42:12 17\n\n2 E 1531899206 2018-07-18 07:33:26 55\n\n2 E 1531906587 2018-07-18 09:36:27 4\n\n1 B 1532502303 2018-07-25 07:05:03 270\n\n1 C 1536011873 2018-09-03 21:57:53 18\n\n2 F 1536011945 2018-09-03 21:59:05 11\n\nTable 4. Unique samples collected in the wild with our corresponding compilation timestamps\n\n|Emotet Group|RSA Key|Compilation Timestamp in Epoch|Payloads’ Compilation Timestamp in UTC|Unique Sample Count|\n|---|---|---|---|---|\n|1 2 1 2 1 2 2 2 1 1 2|A D B E B E E E B C F|1528056487 1528056680 1530547690 1530547815 1531161666 1531161732 1531899206 1531906587 1532502303 1536011873 1536011945|2018-06-03 20:08:07 2018-06-03 20:11:20 2018-07-02 16:08:10 2018-07-02 16:10:15 2018-07-09 18:41:06 2018-07-09 18:42:12 2018-07-18 07:33:26 2018-07-18 09:36:27 2018-07-25 07:05:03 2018-09-03 21:57:53 2018-09-03 21:59:05|46 37 28 24 31 17 55 4 270 18 11|\n\n\n-----\n\n### Emotet’s Artifacts: Multi-group and Multilayer Operation\n\nTo gain an in-depth understanding of Emotet’s operations, we studied two attributes: the creation time in\n\nthe document droppers’ metadata and the compilation time of the packed Emotet executable samples. We\n\ndiscovered that Emotet might have adopted different operating mechanisms for a) creating and spreading\n\ndocument droppers and b) packing and deploying PE payloads, as both mechanisms demonstrated their\n\nown notable characteristics. The former reveals that it stops creating and spreading document droppers\n\nduring the non-working hours between 1:00 to 6:00 (UTC) roughly on a weekly basis. Meanwhile, the latter\n\nshows that at least three sets of machines are used to pack and deploy Emotet’s executable payloads —\n\ntwo of which are possibly set to the time zones of UTC +0 and UTC +7, respectively.\n\n#### Document Droppers: Weekly-Based Activity Patterns with Non-Working Hours from 1:00 to 6:00 (UTC)\n\nWe started our observation at the document droppers’ creation time. Emotet’s operators frequently use\n\ndocuments — of which there is a significant volume and easily collected — as executable droppers. We\n\nfirst found several documents of the campaigns that share the same timestamp, which indicates that\n\nthose were generated automatically in batches using a tool. Next, we plotted the activity time pattern by\n\nthe day and hour the tools were used to generate the documents (i.e., the unique timestamps, not on the\n\nactual volume of samples), shown in Figure 20 and Figure 21. Figure 20 reveals a weekly pattern of one\n\nor two days of inactivity, while Figure 21 shows inactivity between the non-working hours of 1:00 to 6:00\n\n(UTC). Based on our data, we also observed that the actors behind Emotet used the tools more frequently,\n\nfrom a few times a day to more than twenty times a day, in September.\n\n\n-----\n\n25\n\n20\n\n15\n\n10\n\n5\n\n0\n\n\nJun Jun Jun Jul Jul Jul Aug Aug Aug Sep Sep\n\n1 12 23 4 15 26 6 16 27 6 14\n\n\n40\n\n35\n\n30\n\n25\n\n20\n\n15\n\n10\n\n5\n\n0\n\n\nFigure 20. Daily activity pattern of Emotet’s document droppers\n\n0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23\n\n\nFigure 21. Hourly activity pattern of Emotet’s document droppers\n\n#### Executable Samples: At Least Three Sets of Operating Machines Working\n\nOther artifacts that interest us are Emotet’s executable samples, which are packed by a homebrew\n\npacker. Contemporary malware packers usually wipe or forge the compilation timestamps in the\n\npacked samples, which is the same case in some of the Emotet’s samples. However, not all of these\n\ntimestamps are bogus: there are still several possibly legitimate timestamps that can be found in these\n\nartifacts and should not be ignored. For example, the compilation timestamps of samples with SHA-256\n\n30049dadda36afb0667765155aa8b3e9066511f47e017561bee7e456d4c0236d and 2f93c8c97f99c77880\n\n027b149d257268f45bce1255aeaefdc4f21f5bd744573f indicate that they appeared in the wild just a few\n\nminutes after they were compiled.\n\n\n-----\n\nWe used the following expression to calculate the time gap between a sample’s first record of having\n\nappeared in the wild and its compilation timestamp:\n\n\ndelta = Math.Floor(record of first appearance - compilation timestamp)\n\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\n\nSince plotting delta between -24 to +24 hours seems legitimate, we selected 371 samples from 571\n\nsamples (65%) with potentially legitimate timestamps. We further plotted delta by shorter intervals (by the\n\nminute) and surprisingly got two groups as shown in Figure 22. If the timestamps were randomly forged,\n\nwe should have seen a uniform delta distribution.\n\n-420 410 -400 -390 -380 -370 -360 -350 -340 -330 -320 -310 -300 -290 -280 -270 -260 -250 -240 -230 -220 -210 -200 -190 -180 -170 -160 -150 -140 -130 -120 -110 -100 -90 80 -70 -60 -50 -40 -30 -20 -10 0 10 20 30 40 50 60 70 80 90 100 110 120\n\nFigure 22. Delta distribution (packed compilation time)\n\n101 samples were packed seven hours before they were found in the wild, while another 267 samples\n\nhad a delta below 60 minutes. This indicates that the machines used to pack the first sample group might\n\nhave been set to the UTC +7 time zone, while the machines used to pack the second group might have\n\nbeen set to the UTC +0 time zone. The machines used to pack samples in the third group smashed the\n\ncompilation timestamps to fake ones, leaving us with insufficient information on them.\n\nWe observed that the two sets of machines (set to UTC +0 and UTC +7 time zones) seem to be used\n\nconsecutively. Figure 23 shows the order in which the executable samples of these two sets of machines\n\nwere first found in the wild. It demonstrates that the samples belonging to the two sets took turns\n\nappearing in the wild, lasting around 1 to 5 days each time. This might indicate that the two sets of\n\noperating machines were used in succession to produce and deploy packed executable samples.[32, 33]\n\n\n-----\n\n20\n\n15\n\n10\n\n5\n\n0\n\n\n+7\n\n+6\n\n+5\n\n+4\n\n+3\n\n+2\n\n+1\n\n+0\n\nJun Jun Jun Jul Jul Jul Jul Jul Aug Aug Aug Aug Sep Sep Sep Sep\n10 17 24 1 8 15 22 29 5 12 19 26 2 9 16 23\n\nFigure 23. The first-seen dates of the executable samples found to have been set to the UTC+0 and\nUTC+7 time zones. The size of each circle represents the number of samples found that day\n\n#### Multilayer Operating Mechanisms for Creating Document Droppers and Packed Executable Samples\n\nAfter portraying the activity patterns of the document droppers and packed executable samples\n\nrespectively (in Figure 24), we discovered the obvious inconsistencies between their rest days. There\n\nwere some days that new documents emerged but no executables appeared, or vice versa. This could\n\nmean that there are multilayer operating mechanisms for creating document droppers and producing\n\npacked executable samples. Some researches‎‎ have already illustrated the compartmentalized economy\n\nin the current Eastern Europe cybercriminal underground society.\n\nDoc\n\nPacked PE\n\nJun Jun Jun Jun Jun Jun Jul Jul Jul Jul Jul Aug Aug Aug Aug Aug Sep\n1 6 12 18 24 30 6 12 18 24 30 5 11 17 23 30 5\n\nFigure 24. The activity patterns of the document droppers (red) and\nthe packed executable samples (blue)\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|Doc|Col13|Col14|Col15|Col16|Col17|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n||||||||||||Packed PE||||||\n||||||||||||||||||\n||||||||||||||||||\n\n\n-----\n\n### The Malware Author’s Likely Location\n\nNext, we study the compilation timestamps against the first time the malware sample appeared in the\n\nwild. We converted all of the compilation timestamps from Epoch timestamps to UTC time, shown in Table\n\n5. We noticed that there are two groups of samples that were seen in the wild before its corresponding\n\ncompilation timestamps, which means the compilation timestamps might have been generated using\n\nthe machine’s local time. If we assume that the time on the malware authors’ machine is accurate, this\n\nindicates that the malware author compiled the source code in the UTC +9 time zone or in a time zone\n\nfurther east. Furthermore, the first sample with the Epoch compilation timestamp of 1536011873 was\n\ncreated at 21:57:53 and first appeared in the wild at 12:59. Based on the previous delta compilation time\n\nand the time it was first seen, we assume that two minutes is not long enough for compiled samples\n\nto appear in the wild, so we added another hour to the delta time. Based on this, we conclude that the\n\nmalware authors might be located in the UTC +10 time zone or further east.\n\n|Infra|RSA Key|Compilation Timestamp in Epoch|Payloads’ Compilation Timestamp (UTC)|Time First Seen in the Wild (UTC)|SHA-256|\n|---|---|---|---|---|---|\n|1|A|1528056487|2018-06-03 20:08:07|2018-06-05 03:35|8579ba1eb5cbfd09247e59 312449a85fcef42205c075e0 dac0d6ac490d0b972d|\n|2|D|1528056680|2018-06-03 20:11:20|2018-06-06 09:10|5aebbb2aa8f76f49970deca3 4c5e9f8fd6adc5ee0fec1ec0 9a398e9832893bb5|\n|1|B|1530547690|2018-07-02 16:08:10|2018-07-02 20:27|83f9194627c275b8b850899 0fb3e77063a93c3387462c8 7dc1a1bfccd6e268cf|\n|2|E|1530547815|2018-07-02 16:10:15|2018-07-02 20:34|fa26cce9318c4b1885a6f1e2 3d9756580a5994178b89ad 8beaa889d9c81714aa|\n|1|B|1531161666|2018-07-09 18:41:06|2018-07-09 21:15|537139ce2f4b572eb290d63 5842aa6335bc7906b350189 1cf9852e817f0e6eb9|\n|2|E|1531161732|2018-07-09 18:42:12|2018-07-09 22:09|a8c1e30c59b68348e96b597 bb770a2bce88988d0f0c41d 2398a8b475e13d41c2|\n\n\n-----\n\n|Infra|RSA Key|Compilation Timestamp in Epoch|Payloads’ Compilation Timestamp (UTC)|Time First Seen in the Wild (UTC)|SHA-256|\n|---|---|---|---|---|---|\n|2|E|1531899206|2018-07-18 07:33:26|2018-07-18 11:03|0396d6a58613b1e08237b2 acfc92df4e1c6f41ce7eb47c 0fc2b8bd8aa6c2f8f5|\n|2|E|1531906587|2018-07-18 09:36:27|2018-07-19 09:31|8a2fe06612deef4aa0a6db1 45f69f5f3af6b9ea7e2f6e2e 63d740ee0afb052b3|\n|1|B|1532502303|2018-07-25 07:05:03|2018-07-25 08:10|d103ec149f8ff4a4828c26bc 6c61716aa8b239e4e48a01c 8ee324741b5f1f9cf|\n|1|C|1536011873|2018-09-03 21:57:53|2018-09-03 12:59|719103e82e66a3b93daa96a 4c8d9f1fd2e59978e1309762 fbff098d8d781cc0c|\n|2|F|1536011945|2018-09-03 21:59:05|2018-09-03 14:13|01658cd99bcc431e2b5d911 6fb90f878bc1907077f0d16d 91f7e8d7cc29605a4|\n\n\nTable 5. The compilation timestamp of the unpacked executable samples compared\nwith the time the samples first appeared in the wild\n\nThe major cities and countries in the UTC +10 time zone or further east includes Vladivostok in Russia,\n\nGuam in the U.S., Melbourne, Brisbane, Sydney, and Canberra in Australia, and Auckland in New Zealand.\n\n\n-----\n\n### Prevention and Solutions\n\nEmotet is mainly delivered via email, adopting social engineering tricks and possibly sent using legitimate\n\nemail addresses. To avoid unknowingly downloading this malware, we advise users to avoid opening\n\nunknown or suspicious emails. It is also important to keep their operating systems updated since Emotet\n\ndrops SMB exploits as a propagation method. Regularly changing passwords is also useful in combating\n\nEmotet. The malware has been observed to drop browser and email password grabber modules to steal\n\nusers’ credentials and has also used hacking tools, i.e., Mimikatz, to recover stored passwords.\n\nWe have provided the signatures that identify Emotet-related threats for the benefit of security experts\n\nand blue teamers.\n\nEmotet authors often use financial-related subjects, content, and attachment file names in the emails they\n\nsend to victims. For instance, the frequently used words Emotet actors use are “invoice,” “payment,” and\n\n“receipts” (in English, German. and other languages). If the email makes use of embedded URLs to deliver\n\nmalicious document droppers, the URLs sometimes contain country information (e.g., US, DE) and some\n\nkeywords such as “commercial,” “small business,” “payroll,” invoice,” “payment,” and “personal,” among\n\nothers. The following are some URL examples:\n\n - hxxp: //arad-net.ir/files/En_us/Invoice-for-sent/Deposit/\n\n - hxxp: //arendaufa02.ru/files/En_us/Aug2018/Invoice-067831\n\n - hxxp: //cestenelles.jakobson.fr/521EHMUI/BIZ/Personal\n\n - hxxp: //checkout.spyversity.com/9iifVzAhH4pD3D/BIZ/Firmenkunden\n\n - hxxp: //challengerballtournament.com/9773605LDMSIR/identity/Smallbusiness\n\nHowever, Emotet cannot be easily identified based on the contents of an email. Emotet utilizes social\n\nengineering tricks and sends emails from compromised accounts, but several other malware families are\n\nalso capable of doing this.\n\nThe appearance of Emotet’s document droppers, however, is almost similar to the screen shown in Figure\n\n5. If there are obfuscated macros in the document, it is possible that the malware belongs to either the\n\nEmotet or Ursnif malware families. The metadata of a dropped document to is a good indicator to help\n\ndetermine if it belongs to the Emotet or Ursnif family. Emotet has metadata version 1048576 and a code\n\npage of 1252. In order to get the correct metadata from the dropped documents, analysts can submit\n\nthe documents to public malware scanning engines (e.g., VirusTotal) or use olemeta to obtain the needed\n\ninformation.[33] Checking the embedded URLs is another way to determine if a document belongs to\n\nthe Emotet malware family. Generally speaking, a document embeds around four URLs in the following\n\nformat:\n\n\n-----\n\nURLs that host Emotet’s executables:\n\n– hxxp: //websitedesigngarden[.]com/e6vTCit\n\n– hxxp: //emicontrol[.]com/85a\n\n– hxxp: //grupoembatec[.]com/zHVN\n\n– hxxp: //stevebrown[.]nl/3YA1kb/\n\nURL that hosts Ursnif’s executables:\n\n– hxxp: //d792jssk19usnskdxnsw[.]com/MXE/lodpos[.]php?l=yows2[.]xt2\n\nSince the macros are heavily obfuscated, analysts can use automatic sandboxing to log the URLs\n\nconnected to the macros.\n\nEmotet’s executables are packed by custom packers, making it difficult to detect Emotet using static\n\nsignatures. However, runtime information can provide some valuable data. Emotet’s executable often\n\nhas an obvious signature behavior — a series of network connections to hxxp: //[ip]:[port] as disclosed\n\nin sandbox reports (in Figure 26). Emotet uses IPs instead of domains for its C&Cs. To get a report of\n\nEmotet’s network information, analysts could make use of public sandbox services or scanning engines\n\nthat provide sandbox reports.\n\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\nhttp:\n\n\n//183.82.101.78\n\n//63.142.32.242:8080\n\n//70.164.197.196:8080\n\n//76.175.26.109\n\n//199.119.78.23:443\n\n//77.146.69.15\n\n//70.105.162.74:443\n\n//222.214.218.192:4143\n\n//148.74.40.144:50000\n\n//95.141.175.240:443\n\n//207.47.71.46:7080\n\n//31.49.122.115:50000\n\n\nFigure 26. Sample connection record of an Emotet executable as seen on VirusTotal\n\nWe have documented Emotet’s packing and obfuscation methods in the previous section. The configuration\n\ninside an executable sample includes a set of C&C servers and an RSA key, which can help track the\n\nsample’s corresponding infrastructure. We have listed the RSA keys and the C&C servers collected in\n\nour research with the infrastructure information in Appendix A.[34] The compilation timestamps against the\n\nunpacked payloads are also good indicators for distinguishing the version of Emotet executables.\n\n\n-----\n\n### Conclusion\n\nIn this research, we present a comprehensive study on Emotet. We uncover the malware’s technical\n\ndetails and infrastructures, as well as provide context on possible attribution. The purpose of the research\n\nis to help communities and law enforcement better understand the crime group with only factual data.\n\nAccording to previous research, the Emotet botnet tended to keep a low profile to avoid law enforcement’s\n\nradar before 2016.[35, 36] However, it changed when Emotet started to carry several banking trojan families\n\nin 2017, turning it into one of the most infamous threats. While it gave communities a better look at\n\nEmotet’s activities, several critical questions remain answered.\n\nFor starters, the Emotet botnet is so huge that it needs to be operated by several individuals. While we\n\nhave no evidence of any kind supporting it, we suspect a large group of individuals runs Emotet.\n\nThen, we found two clusters of Emotet exploitation based on RSA keys and C2 servers. Based on our\n\nlong-term experience with botnets and familiarity with the way they work, we suspect that Emotet benefits\n\nonly a few individuals. While several famous botnets can be rented out as a service by a great number of\n\ncustomers, this does not seem to be the case with Emotet. We believe that Emotet is either completely\n\nrun and used by the same people or sold as a service to a limited number of individuals or groups. If\n\nEmotet is indeed sold or rented as a service, we expect those who buy or rent it to be highly skilled and\n\ntrusted by Emotet’s authors.\n\n\n-----\n\n#### References\n\n1. [(20 July 2018). US-CERT. “Alert (TA18-201A) Emotet Malware.” Last accessed on 20 November 2018 at https://www.us-cert.](https://www.us-cert.gov/ncas/alerts/TA18-201A)\n\n[gov/ncas/alerts/TA18-201A.](https://www.us-cert.gov/ncas/alerts/TA18-201A)\n\n2. Joie Salvio. (24 June 2014). Trend Micro Security Intelligence Blog. “New Banking Malware Uses Network Sniffing for Data\n\nTheft.” Last accessed on 15 January 2019 at [https://blog.trendmicro.com/trendlabs-security-intelligence/new-banking-](https://blog.trendmicro.com/trendlabs-security-intelligence/new-banking-malware-uses-network-sniffing-for-data-theft/)\n\n[malware-uses-network-sniffing-for-data-theft/.](https://blog.trendmicro.com/trendlabs-security-intelligence/new-banking-malware-uses-network-sniffing-for-data-theft/)\n\n3. Brad Duncan. (18 July 2018). Unit 42. “Malware Team Up: Malspam Pushing Emotet + Trickbot.” Last accessed on 16 January\n\n[2019 at https://researchcenter.paloaltonetworks.com/2018/07/unit42-malware-team-malspam-pushing-emotet-trickbot/.](https://researchcenter.paloaltonetworks.com/2018/07/unit42-malware-team-malspam-pushing-emotet-trickbot/)\n\n4. (18 July 2018). Symantec Threat Intelligence Blog. “The Evolution of Emotet: From Banking Trojan to Threat Distributor.” Last\n\n[accessed on 16 January 2019 at https://www.symantec.com/blogs/threat-intelligence/evolution-emotet-trojan-distributor.](https://www.symantec.com/blogs/threat-intelligence/evolution-emotet-trojan-distributor)\n\n5. [(20 July 2018). US-CERT. “Alert (TA18-201A) Emotet Malware.” Last accessed on 15 January 2019 at https://www.us-cert.gov/](https://www.us-cert.gov/ncas/alerts/TA18-201A)\n\n[ncas/alerts/TA18-201A.](https://www.us-cert.gov/ncas/alerts/TA18-201A)\n\n6. [Windows code page. (n.d.) Wikipedia. Last accessed on 15 January 2019 at https://en.wikipedia.org/wiki/Windows_code_page.](https://en.wikipedia.org/wiki/Windows_code_page)\n\n7. Vishal Thakur. (31 May 2018). Malwarebytes Labs. “Malware analysis: decoding Emotet, part 1.” Last accessed on 16 January\n\n[2019 at https://blog.malwarebytes.com/threat-analysis/2018/05/malware-analysis-decoding-emotet-part-1/.](https://blog.malwarebytes.com/threat-analysis/2018/05/malware-analysis-decoding-emotet-part-1/)\n\n8. Vishal Thakur. (8 June 2018). Malwarebytes Labs. “Malware analysis: decoding Emotet, part 2.” Last accessed on 16 January\n\n[2019 at https://blog.malwarebytes.com/threat-analysis/2018/06/malware-analysis-decoding-emotet-part-2/.](https://blog.malwarebytes.com/threat-analysis/2018/06/malware-analysis-decoding-emotet-part-2/)\n\n9. Analysis of File-D3079439.doc. (22 September 2018). Any run. Last accessed on 15 January 2019 at [https://app.any.run/](https://app.any.run/tasks/f5a7c56a-e326-418f-a159-d62b4eb5446a)\n\n[tasks/f5a7c56a-e326-418f-a159-d62b4eb5446a.](https://app.any.run/tasks/f5a7c56a-e326-418f-a159-d62b4eb5446a)\n\n[10. Microsoft Documents. (30 March 2017). Microsoft. “Public KeyBlob Structure.”Last accessed on 15 January 2019 at https://](https://docs.microsoft.com/en-us/dotnet/framework/unmanaged-api/strong-naming/publickeyblob-structure)\n\n[docs.microsoft.com/en-us/dotnet/framework/unmanaged-api/strong-naming/publickeyblob-structure.](https://docs.microsoft.com/en-us/dotnet/framework/unmanaged-api/strong-naming/publickeyblob-structure)\n\n[11. Protocol Buffers’ Home Page. (n.d.) Google Developers. Last accessed on 15 January 2019 at https://developers.google.com/](https://developers.google.com/protocol-buffers/)\n\n[protocol-buffers/.](https://developers.google.com/protocol-buffers/)\n\n[12. Pawel Srokosz. (24 May 2017). CERT Polska. “Analysis of Emotet v4.” Last accessed on 16 January 2019 at https://www.cert.](https://www.cert.pl/en/news/single/analysis-of-emotet-v4/)\n\n[pl/en/news/single/analysis-of-emotet-v4/.](https://www.cert.pl/en/news/single/analysis-of-emotet-v4/)\n\n13. (24 July 2018). Check Point Research. “Emotet: The Tricky Trojan that ‘Git Clones’.” Last accessed on 16 January 16 2019 at\n\n[https://research.checkpoint.com/emotet-tricky-trojan-git-clones/.](https://research.checkpoint.com/emotet-tricky-trojan-git-clones/)\n\n[14. Nir Sofer. (n.d.) NirSoft. “Mail PassView v1.86 - Extract lost email passwords.” Last accessed on 15 January 2019 at https://](https://www.nirsoft.net/utils/mailpv.html)\n\n[www.nirsoft.net/utils/mailpv.html.](https://www.nirsoft.net/utils/mailpv.html)\n\n15. Nir Sofer. (n.d.) NirSoft. “WebBrowserPassView v1.86.” Last accessed on 15 January 2019 at [http://www.nirsoft.net/utils/](http://www.nirsoft.net/utils/web_browser_password.html)\n\n[web_browser_password.html.](http://www.nirsoft.net/utils/web_browser_password.html)\n\n16. Atif Mushtaq. (21 October 2010). FireEye Blogs. “Feodo - A new botnet on the rise.” Last accessed on 15 January 2019 at\n\n[https://www.fireeye.com/blog/threat-research/2010/10/feodosoff-a-new-botnet-on-the-rise.html.](https://www.fireeye.com/blog/threat-research/2010/10/feodosoff-a-new-botnet-on-the-rise.html)\n\n17. Nikita Slepogin. (25 May 2017). Kaspersky Lab SecureList. “Dridex: A History of Evolution.” Last accessed on 15 January 2019\n\n[at https://securelist.com/dridex-a-history-of-evolution/78531/.](https://securelist.com/dridex-a-history-of-evolution/78531/)\n\n[18.  Feodo Tracker’s homepage. (n.d.) Feodo Tracker. Last accessed on 15 January 2019 at https://feodotracker.abuse.ch/.](https://feodotracker.abuse.ch/)\n\n19. Michael Mimoso. (1 July 2014). Threat Post. “Cridex Variant Geodo Part Trojan, Part Email Worm.” Last accessed on 15\n\n[January 2019 at https://threatpost.com/cridex-variant-geodo-part-trojan-part-email-worm/106943/.](https://threatpost.com/cridex-variant-geodo-part-trojan-part-email-worm/106943/)\n\n\n-----\n\n[20. Traffic Analysis’ homepage. (n.d.) Traffic Analysis. Last accessed on 15 January 2019 at http://www.malware-traffic-analysis.](http://www.malware-traffic-analysis.net/)\n\n[net/.](http://www.malware-traffic-analysis.net/)\n\n21. (24 October 2016). MalwareBytes Lab. “Introducing TrickBot, Dyreza’s successor.” Last accessed on 15 January 2019 at\n\n[https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/.](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\n\n22. (21 September 2018). Malware Traffic Analysis. “EMOTET INFECTIONS WITH TRICKBOT (UK AND US).” Last accessed on 15\n\n[January 2019 at http://www.malware-traffic-analysis.net/2018/09/21/index.html.](http://www.malware-traffic-analysis.net/2018/09/21/index.html)\n\n[23. (n.d.) IBM X-Force Exchange. “Panda Banker.” Last accessed on 15 January 2019 at https://exchange.xforce.ibmcloud.com/](https://exchange.xforce.ibmcloud.com/collection/Panda-Banker-7d63501790ab200d8a6852508d6f6863)\n\n[collection/Panda-Banker-7d63501790ab200d8a6852508d6f6863.](https://exchange.xforce.ibmcloud.com/collection/Panda-Banker-7d63501790ab200d8a6852508d6f6863)\n\n24. (30 May 2018). Flashpoint Intel. “Trickbot and IcedID Botnet Operators Collaborate to Increase Impact.” Last accessed on 15\n\n[January 2019 at https://www.flashpoint-intel.com/blog/trickbot-icedid-collaborate-increase-impact/.](https://www.flashpoint-intel.com/blog/trickbot-icedid-collaborate-increase-impact/)\n\n25. (17 November 2017). Fidelis Cybersecurity ThreatGeek Blog. “Tracking Emotet payload: IcedID.” Last accessed on 15 January\n\n[2019 at https://www.fidelissecurity.com/threatgeek/threat-intelligence/emotet-payload-icedid.](https://www.fidelissecurity.com/threatgeek/threat-intelligence/emotet-payload-icedid)\n\n26. Michael Sandee, Tillman Werner, Elliott Peterson. (5 August 2015). Blackhat. “Gameover Zeus – Bad Guys and Backends.” Last\n\n[accessed on 15 January 2019 at https://www.blackhat.com/docs/us-15/materials/us-15-Peterson-GameOver-Zeus-Badguys-](https://www.blackhat.com/docs/us-15/materials/us-15-Peterson-GameOver-Zeus-Badguys-And-Backends.pdf)\n\n[And-Backends.pdf.](https://www.blackhat.com/docs/us-15/materials/us-15-Peterson-GameOver-Zeus-Badguys-And-Backends.pdf)\n\n27. (27 September 2017). Proofpoint. “Threat Actor Profile: TA505, From Dridex to GlobeImposter.” Last accessed on 15 January\n\n[2019 at https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta505-dridex-globeimposter.](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta505-dridex-globeimposter)\n\n28. Trend Micro. (18 December 2018). Trend Micro Security Intelligence Blog. “URSNIF, EMOTET, DRIDEX and BitPaymer Gangs\n\n[Linked by a Similar Loader.” Last accessed on 17 January 2019 at https://blog.trendmicro.com/trendlabs-security-intelligence/](https://blog.trendmicro.com/trendlabs-security-intelligence/ursnif-emotet-dridex-and-bitpaymer-gangs-linked-by-a-similar-loader/)\n\n[ursnif-emotet-dridex-and-bitpaymer-gangs-linked-by-a-similar-loader/.](https://blog.trendmicro.com/trendlabs-security-intelligence/ursnif-emotet-dridex-and-bitpaymer-gangs-linked-by-a-similar-loader/)\n\n29. (13 October 2015). FBI. “Bugat Botnet Administrator Arrested and Malware Disabled.” Last accessed on 17 January 2019\n\n[at  https://www.fbi.gov/contact-us/field-offices/pittsburgh/news/press-releases/bugat-botnet-administrator-arrested-and-](https://www.fbi.gov/contact-us/field-offices/pittsburgh/news/press-releases/bugat-botnet-administrator-arrested-and-malware-disabled)\n\n[malware-disabled.](https://www.fbi.gov/contact-us/field-offices/pittsburgh/news/press-releases/bugat-botnet-administrator-arrested-and-malware-disabled)\n\n30. Michal Poslušný. (26 January 2018). We Live Security. “FriedEx: BitPaymer ransomware the work of Dridex authors.” Last\n\naccessed on 17 January 2019 at [https://www.welivesecurity.com/2018/01/26/friedex-bitpaymer-ransomware-work-dridex-](https://www.welivesecurity.com/2018/01/26/friedex-bitpaymer-ransomware-work-dridex-authors/)\n\n[authors/.](https://www.welivesecurity.com/2018/01/26/friedex-bitpaymer-ransomware-work-dridex-authors/)\n\n31. Jonathan Lusthaus. (23 October 2018). Harvard University Press. Industry of Anonymity: Inside the Business of Cybercrime.\n\n32. Winnona DeSombre and Dan Byrnes. (10 October 2018). Recorded Future. “Thieves and Geeks: Russian and Chinese Hacking\n\n[Communities.”Last accessed on 15 January 2019 at https://www.recordedfuture.com/russian-chinese-hacking-communities/.](https://www.recordedfuture.com/russian-chinese-hacking-communities/)\n\n33. (19 February 2018). Github. “Olemeta.” Last accessed on 15 January 2019 at [https://github.com/decalage2/oletools/wiki/](https://github.com/decalage2/oletools/wiki/olemeta)\n\n[olemeta.](https://github.com/decalage2/oletools/wiki/olemeta)\n\n[34. Exploring Emotet’s Activities - Appendix A. https://documents.trendmicro.com/assets/ExploringEmotet’sActivities_AppendixA_](https://documents.trendmicro.com/assets/ExploringEmotet™sActivities_AppendixA_Final.pdf)\n\n[Final.pdf.](https://documents.trendmicro.com/assets/ExploringEmotet™sActivities_AppendixA_Final.pdf)\n\n35. Alexey Shulmin. (9 April 2015). Kaspersky Lab SecureList. “The Banking Trojan Emotet: Detailed Analysis.” Last accessed on\n\n[15 January 2019 at https://securelist.com/the-banking-trojan-emotet-detailed-analysis/69560/.](https://securelist.com/the-banking-trojan-emotet-detailed-analysis/69560/)\n\n36. (n.d.) Center for Internet Security. “Emotet Changes TTPs and Arrives in United States.” Last accessed on 15 January 2019 at\n\n[https://www.cisecurity.org/blog/emotet-changes-ttp-and-arrives-in-united-states/.](https://www.cisecurity.org/blog/emotet-changes-ttp-and-arrives-in-united-states/)\n\n\n-----\n\nTREND MICRO[TM] RESEARCH\n\nTrend Micro, a global leader in cybersecurity, helps to make the world safe for exchanging digital information.\n\nTrend Micro Research is powered by experts who are passionate about discovering new threats, sharing key insights, and supporting\nefforts to stop cybercriminals. Our global team helps identify millions of threats daily, leads the industry in vulnerability disclosures, and\npublishes innovative research on new threats techniques. We continually work to anticipate new threats and deliver thought-provoking\nresearch.\n\nwww.trendmicro.com\n\n\n©2019 by Trend Micro Incorporated All rights reserved Trend Micro\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/white_papers/ExploringEmotetsActivities_Final.pdf"
    ],
    "report_names": [
        "ExploringEmotetsActivities_Final.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1548673902,
    "ts_modification_date": 1548673914,
    "files": {
        "pdf": "https://archive.orkl.eu/baaa9f04b3e164257e671420179ff939cdf23bed.pdf",
        "text": "https://archive.orkl.eu/baaa9f04b3e164257e671420179ff939cdf23bed.txt",
        "img": "https://archive.orkl.eu/baaa9f04b3e164257e671420179ff939cdf23bed.jpg"
    }
}