{
    "id": "28047399-4a1f-408f-917b-b618ce55ed26",
    "created_at": "2023-01-12T15:06:50.291149Z",
    "updated_at": "2025-03-27T02:16:03.321516Z",
    "deleted_at": null,
    "sha1_hash": "afe81831957d3de208c6d35ad3a2c139f1a9f704",
    "title": "2017-10-27 - Tracking Subaat- Targeted Phishing Attack Leads to Threat Actor’s Repository",
    "authors": "",
    "file_creation_date": "2022-05-29T00:59:41Z",
    "file_modification_date": "2022-05-29T00:59:41Z",
    "file_size": 1150550,
    "plain_text": "# Tracking Subaat: Targeted Phishing Attack Leads to Threat Actor's Repository\n\n**[unit42.paloaltonetworks.com/unit42-tracking-subaat-targeted-phishing-attacks-point-leader-threat-actors-repository/](https://unit42.paloaltonetworks.com/unit42-tracking-subaat-targeted-phishing-attacks-point-leader-threat-actors-repository/)**\n\nUnit 42 October 27, 2017\n\nBy [Unit 42](https://unit42.paloaltonetworks.com/author/unit42/)\n\nOctober 27, 2017 at 5:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [CVE-2012-0158,](https://unit42.paloaltonetworks.com/tag/cve-2012-0158/) [Downloader,](https://unit42.paloaltonetworks.com/tag/downloader/) [QuasarRAT,](https://unit42.paloaltonetworks.com/tag/quasarrat/) [Subaat](https://unit42.paloaltonetworks.com/tag/subaat/)\n\nIn mid-July, Palo Alto Networks Unit 42 identified a small targeted phishing campaign aimed\nat a government organization. While tracking the activities of this campaign, we identified a\nrepository of additional malware, including a web server that was used to host the payloads\nused for both this attack as well as others. We’ll discuss how we discovered it, as well as\npossible attribution towards the individual behind these attacks.\n\nThe Initial Attack\n\nBeginning on July 16, 2017, Unit 42 observed a small wave of phishing emails targeting a\nUS-based government organization. We observed a total of 43 emails with the following\nsubject lines:\n\nInvention\nInvention Event\n\n\n-----\n\nWithin the 43 emails we observed, we found that three unique files were delivered, which\nconsisted of two RTFs and a Microsoft Excel file. Both RTFs exploited CVE-2012-0158 and\n[acted as downloaders to ultimately deliver the QuasarRAT malware family. The downloaders](https://blog.paloaltonetworks.com/tag/QuasarRAT/)\nmade use of the same shellcode, with minor variances witnessed between them.\nAdditionally, the RTFs made use of heavy obfuscation within the documents themselves,\nmaking it more difficult to extract the embedded shellcode.\n\nThe Microsoft Excel file contained malicious macros that resulted in dropping and\nsubsequently executing Crimson Downloader. The Excel document contained a UserForm\nthat in turn contained three text boxes. The embedded payload was hex-encoded and split\nbetween these three text boxes. The malicious macro extracted this information from the text\nboxes, dropped it to a specific location, and eventually executed the Crimson Downloader\npayload.\n\nDetailed information about these malware samples may be found in the appendix of this\nblog.\n\nA curious aspect of this campaign is the use of Crimson Downloader in this email campaign.\nTo date, we have not widely seen Crimson Downloader being used: in fact, we have only\nseen 123 unique instances of this malware family being used to date. Readers may recall a\n[previous blog post from March 2016 that discussed Crimson Downloader. That blog post](https://blog.paloaltonetworks.com/2016/03/unit42-projectm-link-found-between-pakistani-actor-and-operation-transparent-tribe/)\n[discussed relationships with both Operation Transparent Tribe and](https://www.proofpoint.com/us/threat-insight/post/Operation-Transparent-Tribe) [Operation C-Major, which](http://blog.trendmicro.com/trendlabs-security-intelligence/indian-military-personnel-targeted-by-information-theft-campaign/)\nwere both targeted campaigns that made use of Crimson Downloader aimed at diplomatic\nand political targets. The connections we observed in this research leads us to believe there\nmight be a connection between this most recent activity we observed and those campaigns.\nHowever, there is not enough evidence to say so decisively.\n\nExpanding the Scope from the Original Attacks\n\nWhen looking at the various malware samples encountered as we analyzed this campaign,\nwe identified a total of three hosts/IP addresses, as shown in the following chart:\n\n5.189.157[.]215 Crimson Downloader connects to this IP\naddress.\n\n115.186.136[.]237 QuasarRAT connects to this IP address.\n\n\nsubaat[.]com (Resolves to\n23.92.211[.]186)\n\n\nRTFs download QuasarRAT from this host.\n\n\nStarting with the first IP address that was used by Crimson Downloader, we can see that this\naddress appears to be located in Germany and is almost exclusively associated with this\nmalware family. Based on our telemetry, this IP address has exclusively been used to\n\n\n-----\n\ncommunicate with Crimson Downloader. We observed a total of 16 unique Crimson\nDownloader samples starting in May of this year.\n\nMoving onto the second IP address of 115.186.136[.]237, we see that this IP address\nbelongs to a Pakistan-based Internet Service Provider (ISP), based in Islamabad, that\nservices both residential and commercial customers.\n\nThe subaat[.]com domain has historic WHOIS information from early 2016 that references a\nPakistani location, as seen in the image below. Additionally, it uses pkwebhost[.]net for its\nDNS, which is a Pakistan-based hosting provider.\n\n_Figure 1 Historical WHOIS information for subaat[.]com from early 2016_\n\nThe references to Pakistan in conjunction with the use of Crimson Downloader, which has\nhistorically been associated with Pakistan actors, is certainly interesting.\n\nThe RTFs we observed in the original email campaign downloaded QuasarRAT from\nhttp://subaat[.]com/files/sp.exe. Checking this host led us to discover that directory listings\nwere enabled. We were able to discover a large repository of malware on this open server.\n\n\n-----\n\n_Figure 2 Open directory listing of subaat[.]com_\n\nSince beginning this research, this domain has been suspended by the hosting provider.\nHowever, it returned in mid-August, hosting both a malicious APK and a known instance of\nQuasarRAT.\n\n\n-----\n\n_Figure 3 Subaat returns after suspension_\n\nIn total, we found 84 unique malware payloads hosted on this server, in addition to a number\nof miscellaneous scripts. The chart below shows the malware families we identified:\n\n_Figure 4 Malware families identified in web server repository_\n\nAs we can see from the above chart, a wealth of different malware families were stored on\nthis web server. Many of these malware families are considered to be commodity malware,\nor widely used by criminals. Palo Alto Networks has reported on many of these families in\n[the past, including LuminosityLink,](https://blog.paloaltonetworks.com/2016/07/unit42-investigating-the-luminositylink-remote-access-trojan-configuration/) [QuasarRAT, and](https://blog.paloaltonetworks.com/2017/01/unit42-downeks-and-quasar-rat-used-in-recent-targeted-attacks-against-governments/) [DarkComet to name a few. The large](https://blog.paloaltonetworks.com/2015/02/examining-cybercrime-underground-part-1-crypters/)\nnumber of commodity malware families paints a very different picture from the original attack\nthat made use of Crimson Downloader which is not a widely used malware\n\n\n-----\n\nA full list of SHA256 hashes associated with these samples may be found in the appendix.\n\nOne thing that caught our eye was the large number of LuminosityLink malware samples\nstored on this server. Looking at the embedded configuration settings for these samples, we\nsee that they are all similar. The following example shows one of these configurations. A\nscript written in a previous blog post was used to generate the output below, it can be\n[downloaded here.](https://github.com/pan-unit42/public_tools/tree/master/luminositylink)\n\n_Figure 5 Embedded configuration within LuminosityLink sample_\n\nThe email address shown above is used to register a customer’s copy of LuminosityLink. All\nsamples using this registered builder contain this email address. We found all 20 of the\nidentified LuminosityLink samples contained this same email address. The primary domain\nshown above is registered to 115.186.136[.]237, which is the IP address used by QuasarRAT\nfor Command and Control (C2) communications. Looking at other samples found within the\nweb server repository, we identified a number of malware families communicating with this IP\naddress, including the following:\n\nQuasarRAT\nLuminosityLink\nMeterpreter\nNJRAT\nRevengeRAT\nRemcosRAT\n\n\n-----\n\nWe also discovered that the email address discussed above was being used by an account\non the popular HackingForum web forum service. The account in question that claims to own\nthis email address is none other than ‘Subaat’.\n\n_Figure 6 Subaat user mentioning the hotmail email address on HackForums_\n\nLooking at this user’s profile below, we can see their posting history: a total of 14 posts in the\npast two years. We also see a date of birth of 2/24/1990, stating that the individual is 27\nyears old.\n\n\n-----\n\n_Figure 7 Subaat profile information_\n\nA quick look at the posting history indicates that this person was inactive starting around\nDecember 2016, but returned to posting in early July of this year. This is in line with the\ncampaign witnessed against a US-based government organization that took place on July\n16 . The posts look to be related to various Office exploit builders and crypters. This again isth\nin line with both the campaign we witnessed as well as the various malware we identified on\nsubaat[.]com.\n\n_Figure 8 Subaat posting history_\n\nA Look Behind the Scenes\n\n\nLooking at logs for the subaat webserver between July 1 and July 20th shows the IPst\naddress of 115.186.136[.]237 uploading and interacting with a number of malicious files. We\nfound interactions with a total of 64 unique files during this period. Below is a chart showing\nthe attacker at this IP address interacting with some of the more popular malware families\nthat have been identified.\n\n\n-----\n\n_Figure 9 Interaction between attacker and web server_\n\nAs we can see from the chart above, a spike of activity took place in the July 11 to July 16th th\ntimeframe. This again is consistent with the email campaign that took place in the midst of\nthis period. A number of malware families have been used by this specific attacker, and\nmany of them are configured to communicate with 115.186.136[.]237 as the C2.\n\n\nConclusion\n\nWhat started out as a simple look into what appeared to be a targeted phishing campaign\nturned into much more. By the end of this research endeavor, we have identified a server\nhosting a large number of malware samples that has been primarily used by one specific IP\naddress. This IP address not only interacted with this web server, but also acted as a C2\nserver for many of these malware families. While looking at malware associated with this\nactor, we discovered an email address that is tied to a user account on HackForums that has\na name consistent with the domain used to host the actor’s malware.\n\nWe saw similarities this campaign and both the Operation Transparent Tribe and Operation\nC-Major campaigns. Additionally, there is marginal evidence that suggests that the attacker\nmay be based in Pakistan, which is again in line Operation Transparent Tribe. However, the\noverall evidence is not conclusive, and there is insufficient proof to say decisively that this is\nthe same threat actor.\n\nPalo Alto Networks customers are protected by this threat in a number of ways:\n\n\n-----\n\nAll identified samples are flagged as malicious within the Palo Alto Networks platform\nAll domains identified within this research have been appropriately marked as\nmalicious\nTraps correctly identified and blocks the exploits using CVE-2012-0158 and CVE-20170199\n\nAppendix\n\n**Analysis of Malicious RTF Documents**\n\nThe two identified samples that were used in a campaign against a US-based government\norganization has the following SHA256 hashes:\n\n0ade053b355eca7ae1fccea01fe14ff8d56a9d1703d01b3c00f7a09419357301\n9a57f96a3fd92b049494807b6f99ffcd6bb9eb81f4f5b352d4b525ad32fac42d\n\nThese samples varied in size greatly, however, the underlying shellcode was consistent. One\nnotable difference observed in one of the samples (0ade05…) was the inclusion of injecting\nthe shellcode into a newly spawned instance of svchost.exe.\n\nWhen the shellcode begins, it will start by loading a number of functions that are used to\ninject code into svchost.exe. The following Python code demonstrates how this hashing\nfunction operates:\n\n_Figure 10 Python code demonstrating API hashing technique #1_\n\nThe shellcode continues to decrypt a blob of data using a 4-byte XOR key of 0x8F51F053.\nThis blob contains a series of important strings, such as the URL and filename, as well as\nfunctions that will be used to download the payload.\n\n\n-----\n\nAfter this blob is decrypted, flow control proceeds to this blob s code, where the shellcode\nwill load multiple libraries and functions using a specific hashing algorithm.\n\nThe shellcode continues download a file to the %TEMP% directory from the following URL:\n\nhttp://subaat[.]com/files/sp.exe\n\nThe shellcode proceeds to execute this newly downloaded file prior to exiting.\n\n**Analysis of Malicious Excel Documents**\n\nThe identified sample that was used in a campaign against a US-based government\norganization has the following SHA256 hash:\n\ne3243674aa3661319903a8c0e1edde211f1ffdeed53b305359d3390808007621\n\nWhen this sample is initially executed, it will attempt to run a malicious macro that is\nembedded within the file. This macro begins by determining where a dropped file will reside.\nIt will attempt to find the following folders residing within a user’s profile path:\n\n/Documents\n/Downloads\n/AppData\n\n\n-----\n\n_Figure 11 Macro determining file path_\n\nThe payload itself is stored within text boxes in a user form within the Excel document. This\ndata is extracted and hex-decoded. The three blobs of data are concatenated to form a\nproper PE32 executable.\n\n\n-----\n\n_Figure 12 Macro loading data from text boxes_\n\nA quick look at the included user form gives us a better view as to how this data is stored.\n\n\n-----\n\n_Figure 13 Embedded user form with three text boxes_\n\nThe following example Python code demonstrates the hex-decoded data shown in the\nhighlighted text box above.\n\n_Figure 14 Python code hex-decoding the stored data_\n\n\n-----\n\nAfter this data is properly handled, the macro will drop this file with an extension of .scr to the\ndesignated file path. It is then executed in a new process. This newly spawned process is an\ninstance of the Crimson Downloader malware family.\n\n**SHA256 Hashes**\n\nc4c478c5486a09ac06e657ace2c1edb00cc690a2ff3558598e07687aa149df71\n\n6b6ff0bef244732e90e7a8c200bcd1d8db6f58fe4da68889eb847eb1b6458742\n\n07cb90288ae53643a4da291863df6c9be92bfd56b953073e30b7c28c777274fc\n\n66ef8f3660902cba0ca9bebd701d322aff1d5a13de0cf63cf3f1b8841e08efc6\n\n20c949ca25fed25918e524dde67ffe44efb1c974a5ed68d519b77354303c4916\n\n007e4b308a69d6c3dba5a01f754a63231b996f1a68ff43ec9b5906f583f0fc6b\n\nf7d2f547d5ab07abf59f97fb069288d682a20bc9614642777d11c7db76b36f39\n\n20e368b0d0288b968fed7193c965a7c7ecf3e731eb93a4cbd4420242fad7ce8c\n\n9ddc4ba7a8025598b6a8344c5537af3e2ae6e6db8356dcbfc9ad86b84dee87af\n\n95c00b3de53c0b5742c182f9221a3086bf046ad8da57c915e8c0b6dc5180fd7f\n\n0804202f46dc94768820cb0915b8d2b36602575ac78e526ea7f518e584069242\n\n914b6f21297ebb81621b6da00edcda59b4c1fdd06329ed7a587c9a9b09915583\n\n2a73231d0480f7481737256a8dca6b2549db982cc10f1761c2a267eb85dcaca4\n\n67d4ab365f1630e750aee300f14fbfc940ea235647014030bd56c4127933834b\n\n41efb2f1cb81160539058d8fc2ca8c037692803dcb8b332c660233bffe5bf874\n\ne51b8bf7cc72b47c8ee59056fabd2af1795152d8df33967949d2d2a0996cc51b\n\n4c6f7aafc2e4d8b0b7e7f21cbb102e02dc314eeb2f8e754f59ea471f58cabda0\n\n3a664210955a82d961480adcc914456931325268ccf26c09d0275ca1d2ff35f1\n\n5cc14c2bc185121391a7c43e3e65ced4697274e93fe42f28f20c067dde7e9f1d\n\nf19480d36453da029247fbd066c7f0c1b28912bbefafd052b1d4ee9a64eb9e31\n\n6bbb87f05d9d987a3df3bb585de3f2fad5d5cd3f11a0e3c4587255c55a9fe2a5\n\n75da69e466183b0d004719d32f779cd5b7849a6dac0b6303e11db543c0ddec32\n\n\n-----\n\na0a2edcd19a581aeba3de5bbca21065425fbf34fd1a798269ff99bd8af8bf847\n\n2c34565535a0f90b469f0e100d9027190d3cd812bd824aa6af73b4884690a395\n\n50c4f3d3335daf84d507ed2663a411d2ce39e9def172ddbaf7ade0f2ce0f2736\n\na8445387cb7e4bc79da34d371eedf50f265e145ce8f48c64aeff2690ed7f8b10\n\n7218bc4e9b8817eff678422a9125a852c3f66ecf275aa691433dd8cd4910f66d\n\n106938bff25de67513acc809c4c77b2aa9e9974ec8bf4d20bad154015abc77be\n\n85116c4f9695bf15fe3fdcb20cff8634971e39c2b97b1a159446fa6cdf05e913\n\n253bb91003a8c295a70240206605542147d7b9fdc2d26ac999772b3b78db3a80\n\n2d5abd4cc322d5802617d6a1cd3fc22403052e2711bf6bd76976ab7d1cea45cf\n\ne0d6e8584f2d3d6d807ad2fe9d2fccc792635e8e3ab0132f3b5dedc0394019c9\n\n625f30d4abd89b94c1f732463202c51cd9424a1bcbf2e72a9779773c0f82f93c\n\n6807c25ead1c377c975c84a214da8a68482623658369a02ce56b531d6f38a5b6\n\ndfb984ea975ca992e1a0f9a6d30a41057edd36b170704b7831f609f44f80ad8d\n\ned9fb1d8c36fb60c808006ae63908980a259cb73ed44adf19856ea6c239d1eab\n\n1f286fff72a562cd327985a1b57316364710f2cbfeedc46d12dc8d21b4611ecb\n\n4da2fd94b4f21a346ebfa5d8793dd60a1d4200dfe6b91517a70aed4c0b59a4d4\n\n983bc61d569839558e2a2ef2a53174efe45be4e65da991268ce1926beb4e3505\n\n7b1ab4513788ef4b6628911ba6ed6362eb357b66d18f6988fb4ceffb20ee1d91\n\n8c93d054d4ef93f695da9693f6de538e269b39320c934428f27cc22ef6b2d89e\n\ncd873eaded83861c4f59bfb5c902b43bfd7f5ecb13eccc385498ad9564085e97\n\ne63f0ab5413b0013d79c57f8132c21c0c9397c88caa01edbb4fbe6c2db4932a0\n\n24bc5f9aa78d91d6c8641b90cac6d3c3e7ddf4b30a992a9129d73c5edb04f80f\n\n89ac4eeaecd38fcb2eb8e0bacd156b6133a6093f44622f7d82e22493a69cafb7\n\n07abc1eb421baffe4f894406c1435b3daf8d1dcfba53d8e4e8f584cf72d08110\n\n2941360679ea485798e324e3538c358cf6cba65959ebf28df9fd4a5492bf2888\n\n\n-----\n\ndbac3abbaaea59c8287d3ed47cac07aeca952a3620eda4559c2bf0f3f611d52e\n\nefca910066b59ca833c7291d07f18922cf5e3e2301c5fd95b7acd50f195fc580\n\na331276b9810ebc131daf883887a0ba8ab0fb5e6ea4671b12249c1be1755fce8\n\n31d94441009e7ea50d880e1dcc9e09890f1139bce9edc847b05f2c5ac355695e\n\nc3eeb0677dcbfe4edb6cca9c5bac34ae80a5906b76676548ef0e5110f3ddd4c3\n\ne68ea3c3c9bb0d5b0d4f940b0cbbfb6913a47bb6f345b54f487241fc4eec4b31\n\n83810647cd0c398ad05dec63c41756bf5fbfd1b0658379753c157e7b1f45aed3\n\ndfb4f62c609be0295ef1c4fcd59c5897fbd0ad40a82d00a93e7f3bdadcc1d320\n\n23180df75c5b9293f3743ea27c09ce471f1f5541cd668ac22c16e41f1ff7b4da\n\nef09065b95d0ea2e02384828e5616fc6f9ededadb2b4719078904c50d2ed4307\n\n923818d36ff1fd94829424847ac20ab7d77432b133cdb5cb1a1be87ec0e1b617\n\n4cbc47fe5d82145265e8dbc9e81ab6afa9a0a4f3c6dd8c15ce2af09584278517\n\n670e45f3e2fbb635df00790d90a5cf8bc950440a935b38c2bb71f0c463c24b3b\n\n2551d883d3e66a3e7bcabc052be2e503808df570c03d816ddfb83bf6e686a5f6\n\n712a8fa4308de2ba1a83545e96539092215c75bfa8b63b33ee1a739cc6522873\n\n7e09b6d96d7034f1ac5947355dba360cc49f53d4c0c89aab05c1ef6cc2d0a213\n\n801bb690dd2ecd3877b014030dfca40f3b7d964fdb8e1ab1252352212e24f777\n\nfae9b4a92277e227f6122794ef366dba49c045add9569e9a0d8fc66196c5c787\n\n2bfbd56ee421b8aab3dd3d1f9e9a2d512556a4e0440c8f04e94d6ad5b584e43c\n\n35bc123df7bfc8f9239af3fa14350091c513e7b1d42b93a8dca39e131c48c052\n\n87d122b7b99735689713ff51650b6a331d9c4d7f7617fc15b7e07b0225b60c2a\n\n0b2a6225d209783672900d1b8e0b19957cb924f0111d0be347dead9520ad745a\n\n5f3845a1e3d2f3d09c3ffff4a71e04f61d995aae54311d4c9ab88ff65803d131\n\n5c361d57ac83936d08c4a93208142b7397d6074bbf6e24cb6cee0e3e3e5351b3\n\nea35cf979b358c1661b4b1b9465a700925bdf4ba227989b47127270e32345f29\n\n\n-----\n\n44963748c947e0f5d21d353e6e5ceb3b6a64fd0b4ad28540ab47bdf2422e9523\n\n1d4f20832e641a1cedd598e187614b78ba3d5930c6dcd71e367b254664cb9b2e\n\n050123edd0d9ea5acf32314aa500467211d8f204f57627abc42937fe11f04382\n\n4c806d18ba1cac5d83be7c05f43697d5124b910d2de8264cdff1d8f186a0a7dd\n\naec031e3747b00be2b0cc3a1d910ae18ada65452f3e70425cae86fe24d2996d4\n\n5ac984bb11b989ef745c35dd2418eb5bd26a6bba291cf2ba7235bf46d3400260\n\n0ade053b355eca7ae1fccea01fe14ff8d56a9d1703d01b3c00f7a09419357301\n\ne3243674aa3661319903a8c0e1edde211f1ffdeed53b305359d3390808007621\n\n9a57f96a3fd92b049494807b6f99ffcd6bb9eb81f4f5b352d4b525ad32fac42d\n\n7bad7cbc32e83b8dfc4f6c95824ea45dcee2330de44d84c9bc551f99e6ca6faa\n\n341403284158723f1f94897d257521a73fcfc8049b786f5004f60a063fb074f2\n\nf68a169670bb3dc3bd0a2dc83120d34f59d7f4dacfdc98dbbd86931cdd4f7392\n\n579c669bd8ec8dd393a836c6c27c86e40e8048fa5efbcfc03e027e69298f0e6a\n\n19df2d2460be2f22f73ea7992470c5369599fba290c0f3dbc613ad35dc3ba18a\n\n692997349c017c627c8779816bc41840dd7867b0c4d3bec99638bfba159675bc\n\nc0658b5aa4e9bc2433557e65ad20ded6f91b3441dac72cb8c2ea7e1f2e43e05e\n\n**IP Addresses**\n\n5.189.157[.]215\n\n115.186.136[.]237\n\n**Domains**\n\nsubaat[.]com\n\nhassanusauae786.hopto[.]org\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n\n-----\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-27 - Tracking Subaat- Targeted Phishing Attack Leads to Threat Actor’s Repository.pdf"
    ],
    "report_names": [
        "2017-10-27 - Tracking Subaat- Targeted Phishing Attack Leads to Threat Actor’s Repository.pdf"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6c4e4b91-1f98-49e2-90e6-435cea8d3d53",
            "created_at": "2022-10-25T16:07:23.693797Z",
            "updated_at": "2025-03-27T02:02:09.924056Z",
            "deleted_at": null,
            "main_name": "Gorgon Group",
            "aliases": [
                "ATK 92",
                "Pasty Draco",
                "Subaat",
                "TAG-CR5"
            ],
            "source_name": "ETDA:Gorgon Group",
            "tools": [
                "AgenTesla",
                "Agent Tesla",
                "AgentTesla",
                "Atros2.CKPN",
                "Bladabindi",
                "CinaRAT",
                "Crimson RAT",
                "ForeIT",
                "Jorik",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Loki",
                "Loki.Rat",
                "LokiBot",
                "LokiPWS",
                "MSIL",
                "MSIL/Crimson",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Negasteal",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Origin Logger",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "SEEDOOR",
                "Scarimson",
                "Socmer",
                "Yggdrasil",
                "ZPAQ",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "18278778-fa63-4a9a-8988-4d266b8c5c1a",
            "created_at": "2023-01-06T13:46:38.769816Z",
            "updated_at": "2025-03-27T02:00:02.914024Z",
            "deleted_at": null,
            "main_name": "The Gorgon Group",
            "aliases": [
                "ATK92",
                "G0078",
                "Pasty Gemini",
                "Gorgon Group",
                "Subaat"
            ],
            "source_name": "MISPGALAXY:The Gorgon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536010,
    "ts_updated_at": 1743041763,
    "ts_creation_date": 1653785981,
    "ts_modification_date": 1653785981,
    "files": {
        "pdf": "https://archive.orkl.eu/afe81831957d3de208c6d35ad3a2c139f1a9f704.pdf",
        "text": "https://archive.orkl.eu/afe81831957d3de208c6d35ad3a2c139f1a9f704.txt",
        "img": "https://archive.orkl.eu/afe81831957d3de208c6d35ad3a2c139f1a9f704.jpg"
    }
}