{
    "id": "281bd25f-4313-44d2-834d-5164bb3e7256",
    "created_at": "2023-01-12T15:10:27.528911Z",
    "updated_at": "2025-03-27T02:09:18.088912Z",
    "deleted_at": null,
    "sha1_hash": "f69723b05d2e650862f86cece8c5ab9aa653ed92",
    "title": "2021-11-16 - How IronNet's Behavioral Analytics Detect REvil and Conti Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:14:06Z",
    "file_modification_date": "2022-05-28T18:14:06Z",
    "file_size": 6777326,
    "plain_text": "# How IronNet's Behavioral Analytics Detect REvil and Conti Ransomware\n\n**ironnet.com/blog/ransomware-graphic-blog**\n\n[Back to IronNet Blog](https://www.ironnet.com/blog)\n[Threat Research](https://www.ironnet.com/blog/tag/threat-research)\nBy IronNet Threat Analysis and Research Teams, including lead contributors Morgan\nDemboski, Joey Fitzpatrick, and Peter Rydzynski\n\n\n-----\n\nNov 16, 2021\n\n## Table of Contents\n\nREvil intrusion\nConti intrusion\n\nEarlier this year, the [DFIR Report published two separate articles outlining ransomware](https://thedfirreport.com/category/ransomware/)\n[attacks by Conti and REvil, both of which leveraged the IcedID trojan in their intrusions.](https://blogs.vmware.com/security/2021/07/icedid-analysis-and-detection.html#:~:text=IcedID%20is%20a%20three%20stages,foothold%20for%20further%20lateral%20propagation.)\nUsing the PCAP (Packet Capture) from these reports, IronNet replayed the intrusions in our\nproprietary testing environment to test how IronDefense and our behavioral analytics detect\nmalicious activity by these groups.\n\n## REvil\n\nTo start, we'll dive in to [REvil ransomware, how it traversed the network in this intrusion, and](https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/)\nhow our analytics detected this activity.\n\nFirst observed in April 2019, REvil (aka Sodinokibi) is an infamous Russia-based cybercrime\nsyndicate responsible for several notable attack campaigns, including the ransomware\n[attacks against Kaseya and](https://www.ironnet.com/blog/russias-ransomware-and-revil-shutdown) [JBS Foods. Operating under a ransomware-as-a-service (RaaS)](https://www.bleepingcomputer.com/news/security/fbi-revil-cybergang-behind-the-jbs-ransomware-attack/)\n[model, REvil was ranked first among the most common ransomware variants in the first half](https://www.coveware.com/blog/ransomware-attack-vectors-shift-as-new-software-vulnerability-exploits-abound)\n[of 2021 with 14.2% of the total market share. In October 2021, REvil reportedly shut down its](https://www.bleepingcomputer.com/news/security/revil-ransomware-shuts-down-again-after-tor-sites-were-hijacked/)\noperations following the arrest of several of its members and the hijacking of its infrastructure\nby law enforcement.\n\n\n-----\n\n_Figure 1: REvil malicious traffic and IronNet behavioral analytics_\n\nThe threat actors begin with a malspam campaign to deliver a malicious XLSM file. Upon\nopening the macro, it initiates a WMIC (Windows Management Interface Command)\ncommand that executes IcedID from a remote executable posing as a GIF. The initial\ncompromised host (172.31.5.31) downloads the malicious file hosting IcedID, which is\nflagged by our knowledge-based rules.\n\nIronNet’s knowledge-based detection uses Suricata rules to analyze netflow and detect\ncommon malicious behavior. Knowledge-based detection is an integral part of defense-indepth and allows us to flag known indicators. However, it’s important to note that signaturebased detection should not be used alone when defending against ransomware, because\ncybercriminals take incredible care to avoid reusing IOCs (e.g. domains, IPs, file hashes,\netc.) in an effort to evade signature detection.\n\nAs IcedID is downloaded to the host and executed using rundll32.exe, our Consistent\nBeaconing TLS analytic fires on the nomovee[.]website domain. Our Domain Analysis\nanalytic is also alerted on the nomovee[.]website domain.\n\n\n-----\n\nThe Consistent Beaconing analytic analyzes beacon activity to detect ongoing patterns of\nboth periodic and randomized beaconing, identifying when there is activity consistent with\nrepetitive attempts by malware to establish communications with a C2 server.\n\n_Figure 2: Consistent Beaconing TLS analytic firing on nomovee[.]website_\n\nIt is from here that IcedID pulls down Cobalt Strike Beacons from two different commandand-control (C2) servers: cloudmetric[.]online (45.86.163.78) and smalleststores[.]com\n(195.189.99.74). On both of these, our TLS Invalid Certificate Chain analytic fires detecting\nsuspicious TLS certificate usage.\n\nA wide variety of malware may exhibit invalid TLS certificate chain behavior as part of C2 or\neven data exfiltration activities. IronNet’s TLS Invalid Certificate Chain analytic assesses the\nTLS certificate to identify self-signed or falsified TLS certificates, validating all available\nserver certificate chains in a flow and generating events for chains that fail the validation\nprocess – such as it did in this case.\n\n\n-----\n\n_Figure 3: TLS Invalid Cert Chain analytic firing on smalleststores[.]com_\n\nAdditionally, we have a Domain Analysis alert to support the finding for cloudmetric[.]online.\n\nIronNet’s Domain Analysis analytic evaluates outgoing communications from an internal host\nto a new or unusual domain, which could be the result of malware calling back to a domain\nfor instructions. Given the nature of modern networks and their reliance on domains for\ncommunication, our Domain Analysis analytics provides value through the entire attack\nchain.\n\n_Figure 4: Domain Analysis HTTP analytic firing on cloudmetric[.]online_\n\n\n-----\n\nAfter establishing C2, the host begins to beacon consistently to the malicious domains. C2\ncommunications are an integral part of a ransomware attack, especially given recent trends\nwhere ransomware operators look to fully enumerate networks, ultimately trying to achieve\nfull domain compromise. Our beaconing analytics were designed to catch these types\ncommunications, which they did for cloudmetric[.]online and smalleststores[.]com.\n\n_Figure 5: Consistent Beaconing TLS analytic firing on cloudmetric[.]online_\n\n_Figure 6: Consistent Beaconing TLS analytic firing on smalleststores[.]com_\n\n\n-----\n\nUsing Cobalt Strike, lateral movement begins first to an Exchange server. After\ncompromising the Exchange server, the threat actors move to domain controllers (DCs) and\nother servers within the environment using Server Message Block (SMB) and Cobalt Strike\nBeacons that are executed via a remote service. From the DCs, the attackers carry out\nadditional discovery by using ADFind and the Ping utility to examine connections between\nthe DCs and other domain-joined systems.\n\nIt was here that our knowledge-based rules detected the primary DC (10.1.10.5) and the\ninternal Windows host (10.1.10.200) communicating with the Cobalt Strike C2\n(45.86.163.78).\n\n_Figure 7: Knowledge-based detection of C2 communications between 10.1.10.200 &_\n_45.86.163.78_\n\n\n-----\n\n_Figure 8: Event summary of knowledge-based detection of C2 communications between_\n_10.1.10.5 & 45.86.163.78_\n\nFollowing this, the attackers used a Cobalt Strike beacon to dump credentials on the server\nand DC. The threat actors began to establish RDP (remote desktop protocol) connections\nbetween various systems. From here, the attackers used Rclone to exfiltrate files they will\nleverage in a double-extortion demand. As this occurs, our Extreme Rates analytic fired on\n45.86.163.78 and cloudmetric[.]online.\n\nIronNet’s Extreme Rates analytic monitors traffic characteristics – such as the number of\nbytes, packets, and flows in network peer groups – to detect when a larger-than-normal\namount of data is being extracted from the network. This presents an opportunity for\ndetection before encryption can kick off. Some damage may still occur if an attacker is able\nto reach this point, but detecting and eradicating a threat at this stage is still immeasurably\nbetter than after encryption occurs.\n\n\n-----\n\n_Figure 9: Extreme Rates TLS analytic firing on cloudmetric[.]online_\n\nThe attackers then start to move onto final objectives, staging the executable on a DC and\nthen using BITSAdmin to distribute it to each system in the domain. The ransomware is\nexecuted over an RDP connection, leading all domain-joined systems to be encrypted.\n\n\n-----\n\n## Conti\n\nLet's now dive in to [Conti, how it traversed the network in this intrusion, and how our](https://thedfirreport.com/2021/05/12/conti-ransomware/)\nanalytics detect this activity.\n\nConti is a prolific ransomware family that first emerged in May of 2020. The group garnered\nparticular attention in 2021 for several cyberattacks on healthcare institutions, including the\n[Ireland Health Service Executive (HSE). Overall, Conti has been connected by the FBI to](https://www.computerweekly.com/news/252500905/Conti-ransomware-syndicate-behind-attack-on-Irish-health-service)\n\n\n-----\n\nmore than 400 cyberattacks worldwide – 75% of which targeted organizations in the U.S.\n\n_Figure 10: Conti malicious traffic and IronNet behavioral analytics_\n\nThe attackers begin with a phishing campaign delivering a Zip file that contains a malicious\nJavascript file. Our Phishing HTTPS analytic catches this interaction with the phishing link\nand fires on expertulthima[.]club.\n\nIronNet’s Phishing HTTPS analytic analyzes all SSL/TLS encrypted communications from\ninternal devices to external domains, the SNI (Server Name Indication), and the certificate of\nthe destination to identify communications with phishing domains employing targeted brand\nimitation via HTTPS. Our analytics are not isolated to just email-based phishing, but also\nidentify any time a user appears to be interacting with a phishing link or submitting sensitive\ninformation to a suspicious external entity.\n\n\n-----\n\n_Figure 11: Phishing HTTPs analytic firing on expertulthima[.]club_\n\nThe file eventually downloads and executes the IcedID trojan via rundll32.exe. In the initial\nIcedID execution, our Domain Analysis analytic fires on vaclicinni[.]xyz, dictorecovery[.]cyou,\noxythuler[.]cyou, Thulleultinn[.]club, and Expertulthima[.]club.\n\nIronNet’s Domain Analysis analytic monitors outgoing communications, and it provides\nunique value as it does not rely on the existence of any additional behaviors, just the usage\nof a suspicious domain.\n\n_Figure 12: Domain Analysis HTTP analytic firing on vaclicinni[.]xyz_\n\n\n-----\n\nIn addition to Domain Analysis, our Consistent Beaconing analytic fired for oxythuler[.]cyou,\nThulleultinn[.]club, and Expertulthima[.]club, and our TLS Invalid Certificate Chain analytic\nfired for oxythuler[.]cyou and thulleultinn[.]club.\n\n_Figure 13: Consistent Beaconing TLS analytic firing on oxythuler[.]cyou_\n\n_Figure 14: Consistent Beaconing TLS analytic firing on thulleultinn[.]club_\n\n\n-----\n\n_Figure 15: Consistent Beaconing TLS analytic firing on expertulthima[.]club_\n\nThe TLS Invalid GCertificate Chain analytic validates all available server certificate chains in\na flow and generates events for chains that fail the validation process. The events include\nthe reason why validation failed, the root certificate issuer, and the number of internal\ndevices that are communicating with the device issuing the root certificate.\n\n_Figure 16: TLS Invalid Cert Chain analytic firing on oxythuler[.]cyou_\n\nOnce the attackers successfully infect the system with IcedID, they drop and execute a\nCobalt Strike beacon. At this point, our knowledge-based rules fire to detect Cobalt Strike C2\n(192.99.178.145).\n\n\n-----\n\n_Figure 17: Knowledge-based detection of Cobalt Strike C2 (192.99.178.145)_\n\n_Figure 18: Knowledge-based detection of Cobalt Strike C2 (192.99.178.145)_\n\nThe attackers then perform domain enumeration using native Windows tools such as\nnltest.exe, whoami.exe, and net.exe. They escalate to SYSTEM privileges via Cobalt Strike’s\nbuilt-in “named pipe impersonation” functionality.\n\nMoving laterally to the DCs, the threat actors utilize SMB to transfer and execute a Cobalt\nStrike Beacon. During this, one of the DCs conducts port scanning activity to identify open\nports. Afterward, the threat actors transfer a Cobalt Strike DLL (Dynamic Link Library) to\n\n\n-----\n\nAdmin shares and distribute it throughout the environment using PsExec. Our Consistent\nBeaconing and Domain Analysis analytics fire for the Cobalt Strike C2 domain\ndimentos[.]com.\n\n_Figure 19: Consistent Beaconing HTTP analytic firing on dimentos[.]com_\n\nLater on, the attackers establish RDP connections to the DC and other systems throughout\nthe environment. To do this, they use a redirector (38.135.122.194) to proxy the RDP traffic\npassing through the IcedID process. This activity was caught by our Extreme Rates analytic.\n\n_Figure 20: Extreme Rates analytic firing on 38.135.122.194_\n\n\n-----\n\nFor defense evasion, the threat actors modified the Group Policy to disable Windows\nDefender and force updated it to all clients using Cobalt Strike. Around two and a half hours\nafter initial intrusion, the Cobalt Strike Beacon processes inject the Conti DLL into memory,\nand all active systems are encrypted.\n\n\n-----\n\n**So what?**\n\nIn this article, we explained how IronNet advanced analytics detect ransomware attacks by\ntwo of the most prolific ransomware groups: REvil and Conti. Despite the evasive strategies\nemployed by both of these two threat groups, it is clearly apparent that through behavioral\nanalytics, their behaviors are detectable across all stages of the kill chain and before a\nransomware payload is ever executed.\n\nAbout Ironnet\n\nFounded in 2014 by GEN (Ret.) Keith Alexander, IronNet, Inc. (NYSE: IRNT) is a global\ncybersecurity leader that is transforming how organizations secure their networks by\ndelivering the first-ever Collective Defense platform operating at scale. Employing a number\nof former NSA cybersecurity operators with offensive and defensive cyber experience,\nIronNet integrates deep tradecraft knowledge into its industry-leading products to solve the\nmost challenging cyber problems facing the world today.\n\n[Back to IronNet Blog](https://www.ironnet.com/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-16 - How IronNet's Behavioral Analytics Detect REvil and Conti Ransomware.pdf"
    ],
    "report_names": [
        "2021-11-16 - How IronNet's Behavioral Analytics Detect REvil and Conti Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536227,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653761646,
    "ts_modification_date": 1653761646,
    "files": {
        "pdf": "https://archive.orkl.eu/f69723b05d2e650862f86cece8c5ab9aa653ed92.pdf",
        "text": "https://archive.orkl.eu/f69723b05d2e650862f86cece8c5ab9aa653ed92.txt",
        "img": "https://archive.orkl.eu/f69723b05d2e650862f86cece8c5ab9aa653ed92.jpg"
    }
}