{
    "id": "28350c83-7d89-4f70-ace8-d0770a2f6c7e",
    "created_at": "2023-02-20T02:06:39.460939Z",
    "updated_at": "2025-03-27T02:17:05.695209Z",
    "deleted_at": null,
    "sha1_hash": "fe62a9a4ccf358a9f22b0af836d4d2d968191896",
    "title": "2022-07-14 - Industroyer2 and INCONTROLLER In-depth Technical Analysis of the Most Recent ICS-specific Malware ",
    "authors": "",
    "file_creation_date": "2022-07-13T16:12:21Z",
    "file_modification_date": "2022-07-13T16:12:21Z",
    "file_size": 1588266,
    "plain_text": "# Industroyer2 and INCONTROLLER\n\n#### In-depth Technical Analysis of the Most Recent ICS-specific Malware\n\n\n-----\n\n### Contents\n\n1. Executive Summary.................................................................................................................................... 3\n\n2. Technical Analysis ...................................................................................................................................... 4\n\n2.1. Industroyer2 ................................................................................................................................................ 4\n\n2.1.1. Configuration ...................................................................................................................................... 4\n\n2.1.2. Logic of Operation .............................................................................................................................. 7\n\n2.1.3. IEC-104 Protocol Implementation ...................................................................................................... 9\n\n2.1.4. Dynamic Behavior ............................................................................................................................ 11\n\n2.1.5. Other Considerations........................................................................................................................ 11\n\n2.2. CISA AA22-103A: APT Cyber Tools Targeting ICS/SCADA Devices (aka INCONTROLLER, aka\nPIPEDREAM) ........................................................................................................................................................ 12\n\n2.2.1. Lazycargo Analysis........................................................................................................................... 13\n\n2.2.2. Codecall/Evilscholar ......................................................................................................................... 23\n\n2.2.3. Omshell/Badomen ............................................................................................................................ 25\n\n2.2.4. Tagrun/Mousehole............................................................................................................................ 27\n\n3. IoCs .......................................................................................................................................................... 27\n\n4. Mitigation Recommendations ................................................................................................................... 29\n\n5. References ............................................................................................................................................... 29\n\n\n**Acknowledgment**\n\nWe would like to thank Dr. Emmanuele Zambon at the Eindhoven University of Technology for his analysis\nof Industroyer2, included in Section 2.1 of this report, and his technical review of this document.\n\n\n-----\n\n## 1. Executive Summary\n\n[Industroyer2 and INCONTROLLER, also known as PIPEDREAM, are the newest examples of ICS-specific](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nmalware and were disclosed to the public almost simultaneously on April 12 and 13, 2022, respectively.\n\nIndustroyer2 leverages OS-specific wipers and a dedicated module to communicate over the IEC-104\nindustrial protocol. INCONTROLLER is a full toolkit containing modules to send instructions to or retrieve data\nfrom ICS devices using industrial network protocols, such as OPC UA, Modbus, CODESYS, Machine Expert\nDiscovery and Omron FINS. Additionally, Industroyer2 has a highly targeted configuration, while\nINCONTROLLER is much more reusable across different targets.\n\nICS-specific malware is still very rare when compared to commodity malware, such as ransomware or banking\n[trojans. Industroyer2 and INCONTROLLER follow previous-known examples, such as Stuxnet, Havex,](https://malpedia.caad.fkie.fraunhofer.de/details/win.stuxnet)\n[BlackEnergy2, Industroyer and TRITON, shown in the timeline figure below.](https://malpedia.caad.fkie.fraunhofer.de/details/win.blackenergy)\n\nBoth Industroyer2 and INCONTROLLER were caught before causing physical disruption. Industroyer2 is\n[believed to have been developed and deployed by the Sandworm APT, linked to the Russian GRU, which was](https://malpedia.caad.fkie.fraunhofer.de/actor/sandworm)\nbehind the original attacks on the Ukrainian power grid in 2015 and 2016. The Industroyer2 incident follows\n[recent activity against the APT in 2022, such as the disruption of the Cyclops Blink botnet. There is still no](https://www.darkreading.com/vulnerabilities-threats/russian-gru-botnet-disrupted-in-fbi-led-operation)\nconclusive evidence about the actors behind INCONTROLLER, their motives or objectives.\n\nBoth new malwares show that abusing often insecure-by-design native capabilities of OT equipment continues\nto be the preferred modus operandi of real-world attackers. Vedere Labs recently disclosed a set of 56\n[insecure-by-design vulnerabilities in OT equipment called OT:ICEFALL, which included Omron controllers that](https://www.forescout.com/research-labs/ot-icefall/)\nwere targeted by INCONTROLLER. The emergence of new vulnerabilities and new malware exploiting the\ninsecure-by-design nature of OT supports the need for robust OT-aware network monitoring and deep packet\ninspection capabilities.\n\n**This briefing presents the most detailed (to date) public technical analysis of Industroyer2 and**\n**INCONTROLLER (Section 2), a list of IoCs extracted from those samples and other shared intelligence**\n(Section 3) and recommended mitigations (Section 4).\n\nAlthough there have been previous reports about both malware families analyzed in this research, we present\nthe following new contributions:\n\n - A functionality in Industroyer2 to discover the target’s Common Address of ASDU. Despite not being used\ngiven the hardcoded configuration of our sample, it might have been a tool used in previous\nreconnaissance stages to gather information about the target (Section 2.1.2)\n\n - An analysis of the similarity of the IEC-104 implementation in Industroyer that reveals it is very probably a\nmodified version of a publicly available implementation (Section 2.1.3)\n\n - The most detailed public description so far of Lazycargo, a part of INCONTROLLER, which became\npublicly available (Section 2.2.1)\n\n\n-----\n\n## 2. Technical Analysis\n\n#### 2.1. Industroyer2\n\nESET researchers responded to a cyber incident affecting an energy provider in Ukraine. This response\n[resulted in the discovery of a new variant of the Industroyer malware, which ESET together with CERT-UA](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nnamed Industroyer2. Industroyer is an infamous piece of malware that was used in 2016 by the Sandworm\nAPT group to cut the power in Ukraine.\n\nSeveral researchers pointed out that the new sample bears a lot of similarities with the original Industroyer.\nHowever, while the original version supported several industrial network protocols, the version used in the new\n[incident supports only the IEC-104 protocol. The sample tests connectivity to a list of hardcoded control](https://www.ipcomm.de/protocol/IEC104/en/sheet.html)\nstations and sends sets of hardcoded commands over the IEC-104 protocol, setting specific Information Object\nAddresses (IOA) for specific Application Service Data Unit (ASDU) addresses to either the “ON” or “OFF”\nstate. As ESET researchers pointed out, this may lead to power cuts within the targeted ICS systems.\n\nWe have analyzed the IEC-104 sample with SHA-1 fdeb96bc3d4ab32ef826e7e53f4fe1c72e580379 and\npresumed filename 40_115.exe. Our static analysis revealed details of the hardcoded configuration and logic\nworkflow of the sample.\n\n**2.1.1. Configuration**\n\nThe configuration is built as an array of strings. Every array item specifies the configuration for a single IEC104 target server and is specified as a space-separated list of tokens. Tokens can be logically grouped in a\nheader, followed by an optional list of Information Object (IO)-specific parameters. The format of the header is\nreported in the table below.\n\n|Name|Optional|Description|\n|---|---|---|\n|Target IP|No|IP address of the target IEC-104 server.|\n|Target Port|No|TCP port of the target IEC-104 server.|\n|Common Address|No|Common Address of ASDU associated with the target IEC-104 server.|\n|Operational Mode|No|If set to 0, the sample will derive which IOs to interact with from the optional list of IO parameters that follows the header. If set to 1, the sample will derive which IOs to interact with from the optional IOA range information that follows this token.|\n|IOA Range Start|Yes|Information Object Address range start. This token is only specified if Operational Mode is 1.|\n|IOA Range End|Yes|Information Object Address range end. This token is only specified if Operational Mode is 1.|\n|Extended Config|No|If set to 1, the configuration header is extended with 9 extra tokens.|\n\n\n-----\n\n|Boolean Flag|Yes|Unused. This token is only specified if Extended Config is 1.|\n|---|---|---|\n|Target Executable|Yes|Executable name of the process to kill before attempting connection with the target IEC-104 server. This token is only specified if Extended Config is 1.|\n|Rename Executable|Yes|If set to 1, the executable previously specified will also be renamed to prevent watchdog restarts. This token is only specified if Extended Config is 1.|\n|Target Executable Folder|Yes|Path to the folder where the target executable is stored. This token is only specified if Extended Config is 1.|\n|Interaction Delay|Yes|Delay (in minutes) before a connection is attempted to the target IEC-104 server after killing the target executable. This token is only specified if Extended Config is 1.|\n|Default Sleep Time|Yes|Delay (in seconds) applied after sending commands with a certain priority level. This token is only specified if Extended Config is 1.|\n|Special Priority|Yes|Priority level for configuring a different sleep time. This token is only specified if Extended Config is 1.|\n|Special Sleep Time|Yes|Delay (in seconds) applied after sending commands with priority level specified above. This token is only specified if Extended Config is 1.|\n|Boolean Flag|Yes|Unused. This token is only specified if Extended Config is 1.|\n|Default IO State|No|If set to 1, the state of single and double IOs will be set to On, otherwise the state will be set to Off.|\n|Additional Inverted IO State|No|If set to 1, the sample will send additional commands for each configured IO inverting the default state.|\n|IO Count|No|Number of IO-specific parameter groups following the header.|\n\n\nThe format of each IO-specific parameter group is reported in the table below.\n\n|Name|Optional|Description|\n|---|---|---|\n|IOA|No|Address of the Information Object.|\n|Type ID|No|Type of IEC-104 command used for setting the IO value. Possible values are 0 for double command IOs (C_DC_NA_1) and 1 for single command IOs (C_SC_NA_1).|\n|SBO|No|If set to 1, the sample will use the Select Before Operate paradigm to set the IO value.|\n|Invert Default State|No|If set to 0, the state of the IO will be set to the default value specified in the header. If set to 1, the state of the IO will be set to the inverse of the default value.|\n|Priority|No|Priority of commands for this IO. The sample will send commands to the target IEC-104 server processing IOs with lower to higher priority.|\n|Index|No|Defines the order by which commands for this IO will be processed as compared to the ones with the same priority.|\n\n\n-----\n\nUsing this knowledge, it is possible to examine the configuration hardcoded in this sample. The configuration\nheader is displayed in the table below.\n\n**Field** **Target 1** **Target 2** **Target 3**\n\nTarget IP 10.82.40.105 192.168.122.2 192.168.121.2\n\nTarget Port 2404 2404 2404\n\nCommon Address 3 2 1\n\nOperational Mode 0 0 0\n\nIOA Range Start N/A N/A N/A\n\nIOA Range End N/A N/A N/A\n\nExtended Config 1 1 1\n\nBoolean Flag 1 1 1\n\nTarget Executable PService_PPD.exe PService_PPD.exe PService_PPD.exe\n\nRename Executable 1 1 1\n\nTarget Executable D:\\OIK\\DevCounter D:\\OIK\\DevCounter D:\\OIK\\DevCounter\nFolder\n\nInteraction Delay 0 0 0\n\nDefault Sleep Time 1 1 1\n\nSpecial Priority 0 0 0\n\nSpecial Sleep Time 0 0 0\n\nBoolean Flag 1 1 1\n\nDefault IO State 0 0 0\n\nInvert IO Value 0 0 0\n\nIO Count 44 8 16\n\nThe first IO-specific group of parameters for each configuration item is reported in the table below as an\nexample.\n\n|Field|Target 1|Target 2|Target 3|\n|---|---|---|---|\n|Target IP|10.82.40.105|192.168.122.2|192.168.121.2|\n|Target Port|2404|2404|2404|\n|Common Address|3|2|1|\n|Operational Mode|0|0|0|\n|IOA Range Start|N/A|N/A|N/A|\n|IOA Range End|N/A|N/A|N/A|\n|Extended Config|1|1|1|\n|Boolean Flag|1|1|1|\n|Target Executable|PService_PPD.exe|PService_PPD.exe|PService_PPD.exe|\n|Rename Executable|1|1|1|\n|Target Executable Folder|D:\\OIK\\DevCounter|D:\\OIK\\DevCounter|D:\\OIK\\DevCounter|\n|Interaction Delay|0|0|0|\n|Default Sleep Time|1|1|1|\n|Special Priority|0|0|0|\n|Special Sleep Time|0|0|0|\n|Boolean Flag|1|1|1|\n|Default IO State|0|0|0|\n|Invert IO Value|0|0|0|\n|IO Count|44|8|16|\n\n|Field|Target 1|Target 2|Target 3|\n|---|---|---|---|\n|IOA|130202|1104|1258|\n|Type ID|1 (C_SC_NA_1)|0 (C_DC_NA_1)|0 (C_DC_NA_1)|\n|SBO|0 (Direct Operate)|0 (Direct Operate)|0 (Direct Operate)|\n|Invert Default State|1|0|0|\n|Priority|1|1|1|\n|Index|1|1|1|\n\n\n-----\n\n**2.1.2. Logic of Operation**\n\nThe Industroyer2 sample is meant to be executed in the machine acting as IEC-104 controlling station for its\ntargets. The workflow below displays a high-level representation of the sample’s logic.\n\nFor each configuration item, the sample parses the configuration string and creates a data structure that holds\nconfiguration parameters, as well as runtime parameters.\n\n_Killing running services and renaming executable_\n\nIt then kills the process with executable name “PServiceControl.exe”, as well as the process with executable\nname “PService_PDD.exe”, which is also renamed as “PService_PDD.exe.MZ”. Killing the\n“PService_PDD.exe” service causes the interruption of any existing communication with target IEC-104\nservers, which usually supports at most one active connection at a time. Having interrupted existing\nconnections, Industroyer2 is free to connect to the targets. Renaming the service is a possible measure to\n[prevent automatic service restarts. This behavior suggests some ties to the BlackEnergy malware, which also](https://malpedia.caad.fkie.fraunhofer.de/details/win.blackenergy)\nkilled a service called “PService_PDD.exe” before execution.\n\nAfter this initial phase, the sample spawns a thread responsible for interaction with the target. At first, the\nthread is set to sleep for a time specified by the Interaction Delay parameter. This delay could be needed to\nensure the target realizes the existing connection with the master is interrupted and becomes ready to accept\nnew connections.\n\nThe thread then loops over the priority levels configured for all IOs, from lower to higher priority levels.\n_Target connection_\n\n\n-----\n\nThe sample connects to the target using the IP and port specified in the configuration. Upon success, it first\nsends a TESTFR act IEC-104 message, followed by a STARTDT act message, which starts the data transfer\nbetween the controlling station and the controlled station.\n\nOnce the target is connected and data transfer is enabled, the sample verifies if the Common Address of\nASDU (CA) for the target is known in the configuration.\n\n_Discovery of the target’s Common Address of ASDU_\n\nIf the target’s CA unknown (i.e., set to -1 in the configuration), the sample sends a general interrogation\ncommand activation message (C_IC_NA_1 act) with CA set to 65535, which is a special address defined in\nthe standard as “global” for broadcast purposes. The target IEC-104 server will respond with a general\ninterrogation command activation confirmation message containing its true CA. In this way, the sample can\nlearn the CA of the target server. After learning the CA of the target, the sample sends a STOPDT act\nmessage to stop IEC-104 data transfer and disconnects from the target.\n\nTo the best of our knowledge, this discovery functionality was not documented in previous technical reports\nand, despite not being used given the hardcoded configuration of our sample, it might have been a tool used in\nprevious reconnaissance stages to gather information about the target(s).\n\n_Changing the position of configured IOs_\n\nIf the target’s CA is known, the sample sends a general interrogation command activation message\n(C_IC_NA_1 act).\n\nIn case the configuration for all IOs with a certain priority level excludes the use of the Select Before Operate\n(SBO) paradigm, the sample first generates for all IOs with that priority either single command\n(C_SC_NA_1 act) or double command (C_DC_NA_1 act) activation messages (depending on the\nconfiguration) with the Select/Execute bit set to Execute, and then sends messages in batches of data of 128\nbytes max. We notice that the thread executing these operations is put to sleep for a fixed amount of time (one\nsecond) after generating the command corresponding to a certain IO, regardless of whether commands are\nbeing sent to the target or just buffered locally. We could not find a meaningful explanation for this behavior.\n\nIn case at least one of the IOs with the current priority level is configured to use the SBO paradigm, the sample\ndoes not buffer commands. Instead, it iterates over all configured IOs and directly sends either single\ncommand (C_SC_NA_1 act) or double command (C_DC_NA_1 act) activation messages (depending on the\nconfiguration). In case the configuration specifies to use SBO, the sample first sends a single or double\ncommand with the Select/Execute bit set to Select. In both cases, the sample always sends the single or\ndouble command with the Select/Execute bit set to Execute.\n\nThe parameters of single or double commands that the sample sends to the target are set as follows:\n\n - Cause of Transmission: hardcoded to 6 (activation)\n\n - Originator Address: hardcoded to 0\n\n - Common Address of ASDU: as specified in the “Common Address” configuration parameter\n\n - Information Object Address: as specified in the “IOA” configuration parameter\n\n - Qualifier: hardcoded to 2 (short pulse)\n\n - Select/Execute bit: according to the logic described above\n\n - Single/Double Command: initially set according to the “Default IO State” configuration parameter and\npossibly inverted according to IO’s “Invert Default State” configuration parameter\n\n\n-----\n\nIn case the IO’s configuration parameter “Invert Default State” is set to true, the sample sends the\nsingle/double commands once more by temporarily inverting the value of the “Default IO State” configuration\nparameter. This causes flipping the position of the targeted single or double Information Objects (from On to\nOff or vice versa).\n\nBefore repeating all these operations for IOs with the next priority level, the sample sets threat to sleep for an\namount of time specified in either the “Default Sleep Time” or the “Special Sleep Time” configuration\nparameters (depending on whether the current priority level is the special priority level configured in the\n“Special Priority” parameter), and then sends a STOPDT act message to stop IEC-104 data transfer and\ndisconnects from the target.\n\n**2.1.3. IEC-104 Protocol Implementation**\n\nOur analysis revealed that the code used in the sample to craft IEC-104 messages shows extensive\n[similarities with code in a public github repository. The repository contains a lightweight “C++ realization of](https://github.com/ogvalt/iec104)\nIEC-60870-5-104 for LPC1768+FreeRTOS+lwIP” and is maintained by Oleksandr Popovych, a Ukrainian\ndeveloper who describes himself as “AI Dealer”, “Machine Learning Evangelist” and “Deep Learning\nPractitioner”.\n\nBy static analysis of the sample, we were able to identify 18 of the 23 functions defined in the repository for the\nthree C++ classes corresponding to IEC-104 layers (APCI, ASDU and APDU). Of these functions, 15 have the\nexact same function signature as defined in the repository, three have function signatures with only marginal\ndifferences (e.g., addition of a function argument) and 15 also have the exact same function body. The major\ndifference we identified is in the implementation of the APCI class, which in the sample was simplified by only\nsupporting management of one single Information Object per APCI PDU. Based on these observations, it is\nreasonable to conclude the creators of Industroyer2 adapted the code shared by Popovych to fit their needs.\n\nThe table below reports a list of the functions defined in Popovych’s code, annotated with our findings on the\nsample binary in terms of function presence, similarity of the function signature and similarity of the function\nbody.\n\n|Class|Function|Found in Sample|Signature Similarity|Body Similarity|\n|---|---|---|---|---|\n|APCI|APCI()|Yes|Complete|Complete|\n|APCI|~APCI()|Yes|Complete|Complete|\n|APCI|clear()|Yes|Complete|Complete|\n|APCI|get()|Yes|Complete|Complete|\n|APCI|set()|Yes|Minor (one unused argument added)|Complete|\n|APCI|valid()|Yes|Complete|Complete|\n|ASDU|ASDU()|Yes|Complete|Complete|\n|ASDU|~ASDU()|Yes|Complete|Complete|\n\n\n-----\n\n|ASDU|clear()|Yes|Complete|Major (member variables are different)|\n|---|---|---|---|---|\n|ASDU|get()|Yes|Complete|Major (member variables are different)|\n|ASDU|set()|Yes|Minor (argument data_length added)|Major (member variables are different)|\n|ASDU|addIO()|No|N/A|N/A|\n|ASDU|valid()|Yes|Complete|Complete|\n|APDU|APDU()|Yes|Complete|Complete|\n|APDU|~APDU()|Yes|Complete|Complete|\n|APDU|clear()|Yes|Complete|Complete|\n|APDU|get()|Yes|Complete|Complete|\n|APDU|set()|Yes|Minor (one unused argument added)|Complete|\n|APDU|valid()|Yes|Complete|Complete|\n|APDU|addIO(int)|No|N/A|N/A|\n|APDU|addIO(InformationObject)|No|N/A|N/A|\n|APDU|setDUI()|No|N/A|N/A|\n|APDU|setAPCI()|No|N/A|N/A|\n\n\nThe two snippets of code below show an example of the same function as defined in Popovych’s code (left)\nand as decompiled from the sample (right). It is clear the code is identical once one factors out the artefacts\nintroduced by the C++ compiler.\n\nBesides the code for serializing/deserializing IEC-104 messages, the sample includes functions for sending\nand receiving the necessary IEC-104 messages. We could identify code supporting the following\nfunctionalities:\n\n - Send a TESTFR_act message (test connection activation) and process incoming messages\n\n - Send a TESTFR_con message (test connection confirmation)\n\n - Send a STARTDT_act message (start data transfer activation) and process incoming messages\n\n\n-----\n\n  - Send a C_IC_NA_1_act message (interrogation command activation) and process incoming messages\n\n  - Send a C_IC_NA_1_act message (interrogation command activation) with CA set to the global address,\nreceive incoming messages and learn the CA reported in the received C_IC_NA_1_con message\n(interrogation command confirmation)\n\n  - Send a C_SC_NA_1 act message (single command activation) or C_DC_NA_1_act message (double\ncommand activation) and process incoming messages\n\n  - Send an S_FRAME to acknowledge the receipt of incoming I_FRAMEs\n\n  - Process incoming messages and:\n\n`o` respond to TESTFR_act messages with TESTFR_con messages\n`o` update the Receiver Sequence Number in case an I_FRAME is received\n`o` acknowledge received I_FRAMEs by sending an S_FRAME with the updated receiver sequence\nnumber\n\nAs can be inferred from the list above, the implemented subset of the IEC-104 protocol client-side functionality\nis extremely limited and is directed at covering only the subset that is strictly necessary for the attack.\nHowever, this choice led to an implementation that does not conform to the state machine and timeout\nmechanisms defined in the IEC-104 standard. While this may not necessarily be a problem for interoperability\nwith permissive IEC-104 server implementations, such as those implemented by most of IEC-104 server\nsimulators freely downloadable from the internet, for servers with a stricter implementation this might result in\nthe malware failing to deliver the intended commands to the target.\n\n[This same implementation issue was previously observed in the original Industroyer/CrashOverride malware.](https://www.youtube.com/watch?v=KTczBtb2ReU)\n\n**2.1.4. Dynamic Behavior**\n\nWe confirm our findings about the operation logic of the sample by running the sample against an IEC-104\nserver simulator and capturing the traffic generated by the sample. The figure below shows the commands\nsent by the sample to the target with IP address 192.168.122.2. After the general station interrogation\ncommand, we can observe the eight double commands sent by the sample with position OFF, cause of\ntransmission 6 (activation), S/E bit set to Execute and qualifier set to 1 (short pulse), corresponding the eight\nInformation Objects defined in the configuration for this target.\n\n**2.1.5. Other Considerations**\n\nDuring the incident, additional malware samples were deployed: CaddyWiper, OrcShred, SoloShred, and\nAwfulShred. These are wiper malwares designed for Windows, Linux and Solaris operating systems and used\nto cause damage to the infected machines by wiping all the data, and to clean up the host-based indicators of\ncompromise.\n\n[It is still unknown how the attackers obtained initial access to the IT assets of the victim. According to CERT-](https://cert.gov.ua/article/39518)\n[UA, CaddyWiper was distributed over the victim’s network using the Windows group policy mechanism (GPO)](https://cert.gov.ua/article/39518)\n\n\n-----\n\nset through the POWERGAP powershell script. This script has also been used to schedule the execution of\nCaddyWiper, which relied on ArguePatch[1] loader to decrypt itself. (TailJump shellcode was used as well.) The\nlateral movement between network segments of the victim was performed via SSH tunnels.\n\nMultiple researchers agree that the attackers were deeply familiar with the victim’s network and the attack was\ntailor-made rather than opportunistic. For example, Industroyer2 relies on a built-in hard-coded configuration\nthat lists the IP addresses of controlled stations, their TCP ports, ASDU addresses and specific commands to\nbe sent over the IEC-104 protocol. The fact that the IP addresses of these stations are located within entirely\ndifferent subnets (as found in several public Industroyer2 samples) suggests that the victim environment could\nhave improper network segmentation controls in place.\n\nThe Industroyer2 sample lacks any detection evasion mechanisms, such as control flow obfuscation or config\nencryption, or privilege escalation capabilities. This serves as additional evidence of the “bespoke” nature of\nthe attack: The attackers could have had total control of the target environment and be aware of the exact\n[malware protection mechanisms deployed (or lack thereof). According to the timeline of the incident published](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\n[by the ESET researchers, CaddyWiper was scheduled to launch on the same compromised machine after the](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nIndustroyer2 executable has had finished its task. Had the attack been successful, the researchers might not\nhave obtained the sample in the first place. All this evidence explains (at least in part) the lack of analysis\nprotection mechanisms within the Industroyer2 binary.\n\n#### 2.2. CISA AA22-103A: APT Cyber Tools Targeting ICS/SCADA Devices (aka INCONTROLLER, aka PIPEDREAM)\n\n[On April 13, the Department of Energy, CISA, NSA and the FBI released a cybersecurity advisory about new](https://www.cisa.gov/uscert/ncas/alerts/aa22-103a)\ncapabilities developed by APTs targeting industrial control systems. The toolkit described in the advisory\nincludes three tools that enable attackers to send instructions to or retrieve data from ICS devices using\nindustrial network protocols, such as OPC UA, Modbus (and its proprietary Schneider Modicon extension),\nCodesys and Omron FINS.\n\nThe tools within the toolkit are named differently by different researchers but have the following functionality:\n\n - **_[Lazycargo: One of the tools exploits CVE-2020-15368, a vulnerability in the AsrDrv103.sys driver of the](https://github.com/stong/CVE-2020-15368)_**\nRGB controller for AsRock PC motherboards. This tool installs and exploits the vulnerable driver on a\ntarget system to achieve persistence and perform lateral movement after the initial compromise of\nWindows-based engineering workstation and/or human-machine Interface (HMI) machines.\n\n - **_Icecore/Dusttunnel: A tool that provides reconnaissance and command and control functionality._**\n\n - **_Codecall/Evilscholar: This tool is a framework that communicates over the Modbus protocol; it also_**\nleverages Codesys automation software. The framework contains modules to scan, interact with and\nattack at least three Schneider Electric programmable logic controllers (PLCs): M251, M258 and M221\nNano. The capabilities targeting these PLCs could possibly be extended against other Codesys-based\nPLCs manufactured by other vendors.\n\n - **_Omshell/Badomen: A framework that has capabilities for scanning and interacting with Omron Sysmac_**\nNEX PLCs via HTTP, Telnet and Omron Fins protocols. It has capabilities for interacting with OMRON\nservo drives used for precision motion control operations.\n\n[1 A legitimate component of IDA Pro used for remote debugging.](https://hex-rays.com/ida-pro/)\n\n\n-----\n\n  - **_Tagrun/Mousehole: This tool is used for identifying Open Platform Communication Unified Architecture_**\n(OPC UA) servers, as well as enumerating, reading and writing OPC structures and tags. It can be also\nused for brute-forcing credentials.\n\nCurrently, only a sample of Lazycargo is available for public analysis. We found the sample\n**_[69296ca3575d9bc04ce0250d734d1a83c1348f5b6da756944933af0578bd41d2 on vx-underground and](https://www.vx-underground.org/)_**\nanalyzed it in depth.\n\n**2.2.1.** **Lazycargo Analysis**\nThe sample is a binary executable that requires administrative privileges to run and expects one argument, as\nshown in the figure below:\n\nAt first glance, the binary contains a lot of interesting information: We clearly see that there are some debug\nsymbols leftovers that suggest the binary may be an “exploit for the AsRock Driver”, that the file is likely to\nhave some embedded executable code in its .data section and that it uses a number of potentially malicious\nWin32 API calls, as shown in the figure below.\n\n\n-----\n\n-----\n\nFrom the command line message above, it is obvious that the binary expects a path to an unsigned device\ndriver (a .sys file). The following disassembly fragment shows the beginning of the main routine of the sample\nand confirms this.\n\nTherefore, to examine the behavior of the binary further, we must provide a command line argument as\nfollows. In fact, this should be an unsigned driver, but we can get by with this argument.\n\n[When the path to a .sys file is provided, the sample will get the file handle using the OpenFile() function, read](https://docs.microsoft.com/en-us/windows/win32/api/winbase/nf-winbase-openfile)\n[its size of disk using GetFileSize() and read its contents into the memory using ReadFile().](https://docs.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-getfilesize)\n\n\n-----\n\nNext, the sample creates an empty file “C:\\AsRockDrv.sys” and writes into it some binary content located in its\n_.data section:_\n\n[This binary content is a vulnerable AsRock driver, for which a publicly available exploit has been available for](https://github.com/stong/CVE-2020-15368)\n[quite some time (CVE-2020-15368). We encourage the reader to look at the original write-up to have a better](https://github.com/stong/CVE-2020-15368)\n[understanding of the various moving parts of the binary in question. However, this driver exploitation technique](https://git.back.engineering/_xeroxz/vdm)\n[is not new. Notice that the .data section also contains three other shellcode fragments. (More on that later.)](https://git.back.engineering/_xeroxz/vdm)\n\nAfter the contents of the AsRock driver are written to the disk, the binary loads it as a service, initiates the\ndriver’s device and opens a file handle to it.\n\n\n-----\n\nNext, the binary copies a shellcode fragment located in its .data section into memory – we call it\n“second_stage_shellcode” – and copies the contents of the .sys file provided as an argument into an\nadjacent memory location.\n\n\n-----\n\nThen, the sample calls the “find_patch_address()” function that performs many things under the hood. In\nparticular, it exploits CVE-2020-15368 to read physical memory and to find an address of a function located\n[within the loaded AsRock driver: This function has a specific ioctl handler tied to it, and it can be invoked from](https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/creating-ioctl-requests-in-drivers)\n[user-mode programs with DeviceIoControl() or NtDeviceIoControlFile() functions.](https://docs.microsoft.com/en-us/windows/win32/api/ioapiset/nf-ioapiset-deviceiocontrol)\n\nThe two code snippets below provide an intuition on CVE-2020-15368 and how it has been leveraged in the\nbinary in question. In particular, the second snippet shows the approximate logic within the vulnerable AsRock\ndriver: It provides unrestricted physical memory read and write capabilities (including kernel space) to any\nuser-mode program. The AsRock driver developers have restricted access to these operations by accepting\nonly encrypted ioctl data. However, the AES key used for encryption/decryption is hardcoded, therefore\nmalware writers can easily circumvent that.\n\n\n-----\n\n[The “find_patch_address()” function obtains information about the physical memory by reading the](https://www.remkoweijnen.nl/blog/2009/03/20/reading-physical-memory-size-from-the-registry/)\n“HKLM\\Hardware\\ResourceMap\\System Resources\\Physical Memory” system registry key. Next, it\nexploits the AsRock driver to read the physical memory pages and search for 160 bytes of assembly code\nlocated in that memory (“original_asrock_function_fragment”). This assembly code fragment is the\nbeginning of one of the functions located within the AsRock driver itself – it is one of the unencrypted ioctl\nhandlers that can be reached with the I/O control code 0x22E858 (here, we call this function\n“ioctl_22E858_handler()”):\n\n\n-----\n\nBelow, we show the assembly snippet that illustrates the logic that searches for the physical memory address:\n\nAfter the physical memory address of the AsRock ioctl handle of interest has been found, the binary outputs\nthe following message and passes this address further down its logic:\n\nAnother shellcode fragment located in the .data section of the binary (we call it “first_stage_shellcode”) is\nused to overwrite the contents of the ioctl handler within the AsRock driver (the one discussed above). We will\nexplain the details of this fragment later. However, before the ioctl handler within the AsRock driver is\npatched, the “first_stage_payload_shellcode” gets some adjustments:\n\nSpecifically, the total length of the .sys file (the argument to the binary) and the second stage shellcode gets\ninserted into two places, and the virtual memory address of the second shellcode fragment gets inserted as\nwell. Once the first stage shellcode is adjusted, the binary exploits the AsRock driver again to write the\n\n\n-----\n\nshellcode into the physical memory at the location where the “ioctl_22E858_handler()” function of the\n**AsRock driver is loaded. Then it invokes the modified handler, executing the first stage shellcode within the**\n[privileged process of the AsRock driver (calling the handler via the NtDeviceIoControlFile() function).](https://docs.microsoft.com/en-us/windows/win32/api/winternl/nf-winternl-ntdeviceiocontrolfile)\nImmediately after, the “ioctl_22E858_handler()” contents are reverted back to the original code\n(“original_asrock_function_fragment”) to ensure the stability of the system in case the ioctl handler is called\nby other drivers/services.\n\nThe adjusted first stage shellcode is shown on the snippet below. When the patched\n“ioctl_22E858_handler()” function is triggered, it allocates a memory pool of the size\n**“sizeof(second_stage_shellcode) + sizeof(argument .sys file)” using the function**\n_[ExAllocatePoolWithTag(); then, it copies the contents of the buffer that holds the second stage shellcode and](https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/wdm/nf-wdm-exallocatepoolwithtag)_\nthe .sys file from the process of the malware sample into that memory pool. Finally, it executes the second\nstage shellcode with kernel privileges. It looks like this assembly fragment was written by hand.\n\n\n-----\n\nThe second stage shellcode consists of a common kernel shellcode pattern for resolving NT kernel API\n[addresses by hash (see here, for example) and functionality to load and invoke the argument-supplied](https://gist.github.com/rootbsd/3198b82ca587c293d4dd7f1652a8b9ef)\nunsigned driver. While this unsigned driver is missing, it seems highly likely this is a kernel-level rootkit\n[component and possibly works in conjunction with the implant referred to as ICECORE by Mandiant and](https://www.mandiant.com/resources/incontroller-state-sponsored-ics-tool)\n[DUSTTUNNEL by Dragos. The diagram below illustrates the simplified execution flow of the sample:](https://hub.dragos.com/hubfs/116-Whitepapers/Dragos_ChernoviteWP_v2b.pdf?hsLang=en)\n\n\n-----\n\n[It is peculiar to see that while the malicious actors behind this tool were clearly inspired by the original proof-of-](https://github.com/stong/CVE-2020-15368)\n[concept exploit for CVE-2020-15368, there are some crucial differences between the original and the present](https://github.com/stong/CVE-2020-15368)\nimplementation. That the malicious actors managed to easily weaponize someone’s work is worrisome and\nserves as another argument in favor of formal vulnerability disclosure and response practices.\n\n**2.2.2.** **Codecall/Evilscholar**\nAccording to the available reports, the PLCs possibly targeted by the Codecall toolset mostly fall within the\nSchneider Electric Machine Expert product family, formerly called SoMachine. Machine Expert PLCs are\nrelatively low-cost PLCs used in machine automation for motion control, mechatronics, and motor and drive\nmanagement purposes.\n\nThe table below lists the reportedly targeted controllers and protocols in addition to vulnerabilities that have\nbeen identified.\n\n|Controller|Targeted Protocols|Identified Vulnerabilities|\n|---|---|---|\n|M221|Machine Expert Discovery (27126/UDP, 27127/UDP) Modbus TCP (502/TCP)|https://www.ndss-symposium.org/wp- content/uploads/bar2019_74_Kalle_paper.pdf https://www.osti.gov/servlets/purl/1808195 https://www.sciencedirect.com/science/article/pii/S2666281722000051 http://www.people.vcu.edu/~iahmed3/publications/ifip_sec_2019_attack.pdf https://www.cisa.gov/uscert/ics/advisories/ICSA-17-089-02 https://www.se.com/ww/en/download/document/SEVD-2018-233-01/ https://www.se.com/ww/en/download/document/SEVD-2018-235-01/ https://www.se.com/ww/en/download/document/SEVD-2018-270-01/ https://www.se.com/ww/en/download/document/SEVD-2019-045-01/ https://www.se.com/ww/en/download/document/SEVD-2020-315-05/|\n|M241 M251|Machine Expert Discovery (27126/UDP, 27127/UDP) Machine Expert CODESYS (1740- 1743/UDP, 1105/TCP) Modbus TCP (502/TCP)|https://www.cisa.gov/uscert/ics/advisories/ICSA-17-089-02 https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2021- 130-05 https://www.se.com/ww/en/download/document/SEVD-2020-105-02/ https://www.se.com/ww/en/download/document/SEVD-2019-134-02/|\n|M238|Modbus TCP (via TwidoPort gateway|-|\n\n\n-----\n\n|Col1|module) (502/TCP)|Col3|\n|---|---|---|\n|M258|Machine Expert Discovery (27126/UDP, 27127/UDP) Machine Expert CODESYS (1740- 1743/UDP, 1105/TCP) Modbus TCP (502/TCP)|https://www.se.com/ww/en/download/document/SEVD-2020-105-02/ https://www.se.com/ww/en/download/document/SEVD-2019-134-02/|\n|LMC058 LMC078|Machine Expert Discovery (27126/UDP, 27127/UDP) Machine Expert CODESYS (1740- 1743/UDP, 1105/TCP) Modbus TCP (502/TCP)|https://www.se.com/ww/en/download/document/SEVD-2019-134-02/|\n\n\nAs shown in the table above, most likely because of its comparative affordability, the Machine Expert product\nfamily has seen quite a bit of public security research, in particular the M221. This has resulted in a sizeable\nbody of information on the internals, proprietary protocols and uncovered vulnerabilities in these products that\nan attacker could weaponize. According to prior reports, Codecall possesses at least the following capabilities\n(and possibly more):\n\n  - Discover and identify Machine Expert PLCs over the network using the Discovery protocol\n\n  - Brute-force PLC passwords using CODESYS\n\n  - Using CODESYS functionality to enumerate, download, upload and delete files\n\n  - Sever legitimate connections to the PLC, possibly to facilitate credential capture\n\n  - Manipulating IP routing information\n\n  - Trigger a DoS on the PLC requiring a power cycle and configuration recovery\n\n  - Send Modbus commands to read/write registers, request IDs, etc.\n\n**_Machine Expert Discovery_**\n\n\n-----\n\nThe Machine Expert Discovery protocol is a proprietary Schneider Electric protocol for discovery, identification\nand network configuration of Machine Expert PLCs. While the protocol is ostensibly encrypted, this is done\nwith a hardcoded key and a weak algorithm (as covered by CVE-2019-6820) allowing rogue clients to abuse\nthis protocol for discovery and configuration manipulation purposes.\n\n**_CODESYS_**\n\nCODESYS is one of the most popular IEC 61131-3 logic runtime environments and is used by dozens of\nvendors across the world. Both its V2 and V3 incarnations and the myriad security issues have been well\n[documented](https://ics-cert.kaspersky.com/publications/reports/2019/09/18/security-research-codesys-runtime-a-plc-control-framework-part-1/) [by](https://www.youtube.com/watch?v=qFPqBG2VkxI) [public](https://www.cisa.gov/uscert/ics/advisories/ICSA-13-011-01) [security](https://ioactive.com/3s-softwares-codesys-insecure-by-design/) [research. As such, attackers with capabilities for the CODESYS environment](https://arxiv.org/pdf/1812.03478.pdf)\nand protocol could potentially target products by multiple vendors, meaning defenders will need to be aware of\nany CODESYS-based assets in their inventories rather than simply focus on Machine Expert products.\n\n**_Modbus_**\n\nThe Modbus protocol is one of the most ubiquitous and famously insecure-by-design OT protocols in\n[existence. Off-the-shelf capabilities to interact with Modbus can be found all over the internet and, as such, are](https://pymodbus.readthedocs.io/en/3.0.0/)\nnothing special in and of themselves. The harder part of carrying out OT-oriented attacks leveraging Modbus\n[lies in understanding a given PLC’s internal Modbus map, which maps Modbus addresses to internal variables](https://dl.acm.org/doi/abs/10.1145/3140241.3140254)\n[and I/Os. Without this understanding, an attacker is forced to either guess, brute-force or infer this mapping](https://dl.acm.org/doi/abs/10.1145/3140241.3140254)\nfrom long-term network traffic and operations surveillance. However, retrieving the PLC’s configuration through\nCODESYS, as described above, will provide the attacker with these mappings.\n\nAnother item of interest is that the Machine Expert Basic series (which includes the M221), contrary to the\nwider Machine Expert family, does not use the CODESYS protocol but instead uses a Machine Expert Basic\ndialect of the proprietary Schneider Electric UMAS Modbus extension (function code 0x5A). While UMAS has\n[been the subject of quite some public](https://www.youtube-nocookie.com/embed/A_B69Rifu1g?rel=0) [security](https://conference.hitb.org/hitbsecconf2021sin/materials/D1T2%20-%20Going%20Deeper%20into%20Schneider%20Modicon%20PAC%20Security%20-%20Gao%20Jian.pdf) [research and the Machine Expert Basic extension has not, there](https://medium.com/tenable-techblog/examining-crypto-and-bypassing-authentication-in-schneider-electric-plcs-m340-m580-f37cf9f3ff34)\nstill is some common functionality. As such, it seems interesting that no capabilities for this protocol appear to\nhave been integrated into Codecall. This could either be a result of the target set’s demands (focusing on\nMachine Expert with the basic series being of lesser interest) or could point to capability modules that have not\nyet been recovered.\n\n**2.2.3.** **Omshell/Badomen**\n\nAccording to the available reports, the devices possibly targeted by the Omshell toolset are related to machine\nautomation, including machine controllers from the NJ and NX series, servo drives, fieldbus couplers and\npower supplies.\n\nThe table below lists the reportedly targeted devices and protocols, in addition to vulnerabilities that have been\nidentified.\n\n|Controller|Targeted Protocols|Identified Vulnerabilities|\n|---|---|---|\n|NJ501-1300|Omron FINS (9600/TCP, 9600/UDP) HTTP (80/TCP) Telnet|https://www.cisa.gov/uscert/ics/advisories/icsa-19- 346-03|\n\n\n-----\n\n|NX1P2|Omron FINS (9600/TCP, 9600/UDP) HTTP (80/TCP) Telnet|-|\n|---|---|---|\n|NX-SL3300|-|-|\n|NX-ECC203|-|-|\n|R88D-1SN10F- ECT|-|-|\n|S8VK|-|-|\n\n\nAs shown in the table above, compared to the Schneider Electric Machine Expert or older Omron Cx family of\nPLC, the NJ and NX series have not seen much public security research, indicating the attacker likely had to\ninvest significant efforts into developing capabilities for these platforms. According to prior reports, Omshell\npossesses at least the following capabilities and possibly more:\n\n  - Scan for Omron PLCs using the FINS protocol\n\n  - Interact with Omron PLC web services using HTTP\n\n  - Enumerate and communicate with devices (e.g., servo drives or power supplies) nested behind PLCs\n\n  - Backup and restore Omron PLC configurations\n\n  - Wipe and reset Omron PLCs\n\n  - Activate telnet service on Omron PLCs and use it to upload and execute binaries\n\n  - Deploy an additional Omron PLC-native implant for additional fine-grained capabilities\n\n**_Omron FINS_**\n\n[The Omron Factory Interface Network Service (FINS) is a proprietary but publicly](https://www.kepware.com/getattachment/7551f988-97df-426b-a00d-e8731a5b7607/omron-fins-ethernet-manual.pdf) [well-documented protocol for](https://github.com/wireshark/wireshark/blob/master/epan/dissectors/packet-omron-fins.c)\nPLC communication and engineering operations among the popular Omron Cx and NJ/NX series. While this\nprotocol has some security features, these are typically not enabled and have historically suffered from bypass\nflaws. The FINS protocol can be used for a wide array of potentially dangerous operations ranging from PLC\nenumeration and discovery to starting and stopping the PLC, reading and writing logic and memory,\nmanipulating and deleting files, and wiping and resetting the PLC.\n\n**_Device Nesting_**\n\nThe reported ability of Omshell to enumerate and interact with devices nested behind PLCs is of particularly\nnovel interest. Typically, PLCs control instruments or clusters of secondary PLCs via serial or industrial\nEthernet-based fieldbus networks nested behind them. These devices are typically not directly addressable by\nattackers residing in IP-based OT networks if no pass-through protocol features are available. At most, they\ncan be controlled in a limited fashion through whatever variables are mapped and exposed by the master\nPLCs.\n\nAn attacker seeking to achieve more complicated effects, including disabling safety systems, could possibly\nneed the ability to control these nested devices more directly, which would require them to take over the\nmaster PLC acting as a bridge. The Omshell ability to achieve code execution on the PLC and deploy an\nimplant could hint at the desire to develop such fine-grained capabilities. Such implants would have to be\n\n\n-----\n\ntailored to the particular PLC platform (in case of many NJ and NX series PLCs this seems to be a\ncombination of x86, QNX and/or Windows) and could persist for an indefinite amount of time due to the\ncomplete lack of endpoint security measures, introspection or forensics capabilities on PLCs.\n\n**2.2.4.** **Tagrun/Mousehole**\nThe third OT-oriented component of INCONTROLLER is an OPC UA toolkit referred to as Tagrun. This toolkit\nis capable of identifying OPC UA servers, connecting to them using either default or attacker-supplied\ncredentials and enumerating OPC UA structures which include configurations, tags and control points. This\n[serves a potential dual purpose of discovery, reconnaissance and process comprehension on the one hand](https://dl.acm.org/doi/abs/10.1145/3140241.3140254)\nand the ability to manipulate tag values to affect operations on the other.\n\n|3. IoCs|Col2|Col3|\n|---|---|---|\n|IoC|Type|Description|\n|7062403bccacc7c0b84d27987b204777f6078319c3f4caa361581825c 1a94e87|File hash|SHA256 hash of the Industroyer2 sample from the original incident (CERT-UA)|\n|ea16cb89129ab062843c84f6c6661750f18592b051549b265aaf834e1 00cd6fc|File hash|SHA256 hash of one of the Industroyer2 samples (public sources)|\n|fc0e6f2effbfa287217b8930ab55b7a77bb86dbd923c0e81505 51627138c9caa|File hash|SHA256 hash of the CaddyWiper sample from the original incident (CERT-UA)|\n|43d07f28b7b699f43abd4f695596c15a90d772bfbd6029c8ee7 bc5859c2b0861|File hash|SHA256 hash of the OrcShred sample from the original incident (CERT-UA)|\n|bcdf0bd8142a4828c61e775686c9892d89893ed0f5093bdc70b de3e48d04ab99|File hash|SHA256 hash of the AwfulShred sample from the original incident (CERT-UA)|\n|1724a0a3c9c73f4d8891f988b5035effce8d897ed42336a92e2 c9bc7d9ee7f5a|File hash|SHA256 hash of the TailJump sample from the original incident (CERT-UA)|\n\n\n-----\n\n|cda9310715b7a12f47b7c134260d5ff9200c147fc1d05f030e5 07e57e3582327|File hash|SHA256 hash of the ArguePatch sample from the original incident (CERT-UA)|\n|---|---|---|\n|69296ca3575d9bc04ce0250d734d1a83c1348f5b6da75694493 3af0578bd41d2|File hash|SHA256 hash of a Lazycargo sample from vx- underground|\n|C:\\Users\\User1\\Desktop\\dev_projects\\SignSploit1\\x64 \\Release\\AsrDrv_exploit.pdb|String|Path to the debug symbols found in a Lazycargo sample|\n|HKLM\\Hardware\\ResourceMap\\System Resources\\Physical Memory|Windows registry key|A Windows registry key accessed by a Lazycargo sample|\n|“PService_PPD.exe”|String|Name of the service/executable to be stopped and renamed in the infected machine|\n|“D:\\OIK\\DevCounter”|String|Path where the service/executable to be stopped and renamed is located|\n|91.245.255[.]243|IP address|Potentially, an IP address related to the initial access (according to CERT-UA)|\n|195.230.23[.]19|IP address|Potentially, an IP address related to the initial access (according to CERT-UA)|\n|C:\\Users\\peremoga.exe JRIBDFIMCQAKVBBP C:\\Users\\pa1.pay reg save HKLM\\SYSTEM C:\\Users\\Public\\sys.reg /y reg save HKLM\\SECURITY C:\\Users\\Public\\sec.reg /y reg save HKLM\\SAM C:\\Users\\Public\\sam.reg /y \\\\%DOMAIN%\\sysvol\\%DOMAIN%\\Policies\\%GPO ID%\\Machine\\zrada.exe \\\\%DOMAIN%\\sysvol\\%DOMAIN%\\Policies\\%GPO ID%\\Machine\\pa.pay C:\\Windows\\System32\\rundll32.exe C:\\windows\\System32\\comsvcs.dll MiniDump %PID% C:\\Users\\Public\\mem.dmp full|Host-based indicators of compromise|Host-based indicators of compromise from the original incident (CERT-UA)|\n\n\n-----\n\n|C:\\Windows\\Temp\\link.ps1 C:\\Users\\peremoga.exe C:\\Users\\pa1.pay C:\\Dell\\vatt.exe C:\\Dell\\pa.pay C:\\Dell\\108_100.exe C:\\tmp\\cdel.exe|Col2|Col3|\n|---|---|---|\n\n\n## 4. Mitigation Recommendations\n\nCISA recommends to:\n\n - Isolate ICS/SCADA systems and networks from corporate networks and the internet. Limit network\nconnections to only specifically allowed management and engineering workstations.\n\n - Enforce multifactor authentication for remote access to ICS networks and devices whenever possible.\nChange passwords to ICS/SCADA devices on a consistent schedule. Only use admin accounts when\nrequired for specific tasks.\n\n - Leverage an OT monitoring solution to alert on malicious indicators and behaviors, watching internal\nsystems and communications for known hostile actions.\n\n - Investigate symptoms of denial of service or delays in communications processing as signs of potential\nmalicious activity.\n\n - Monitor systems for loading of unusual drivers, particularly for ASRock driver if no ASRock driver is\nnormally used on the system.\n\n - Maintain backups for faster recovery after disruptive attacks.\n\n[More detailed recommendations are available on CISA alerts AA22-110A, AA22-103A and AA22-083A.](https://www.cisa.gov/uscert/ncas/alerts/aa22-110a)\n[Windows driver developers should also follow standard security guidelines to prevent exploitation.](https://docs.microsoft.com/en-us/windows-hardware/drivers/driversecurity/driver-security-checklist)\n\n## 5. References\n\n - [https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\n\n - [https://pylos.co/2022/04/23/industroyer2-in-perspective/](https://pylos.co/2022/04/23/industroyer2-in-perspective/)\n\n - [https://www.securonix.com/blog/industroyer2-caddywiper-targeting-ukrainian-power-grid/](https://www.securonix.com/blog/industroyer2-caddywiper-targeting-ukrainian-power-grid/)\n\n - [https://www.emanueledelucia.net/industroyer2-the-ics-capable-malware-re-emerges-in-order-to-cause-](https://www.emanueledelucia.net/industroyer2-the-ics-capable-malware-re-emerges-in-order-to-cause-critical-services-disruption/)\n[critical-services-disruption/](https://www.emanueledelucia.net/industroyer2-the-ics-capable-malware-re-emerges-in-order-to-cause-critical-services-disruption/)\n\n - [https://www.mandiant.com/resources/industroyer-v2-old-malware-new-tricks](https://www.mandiant.com/resources/industroyer-v2-old-malware-new-tricks)\n\n - [https://www.netresec.com/?page=Blog&month=2022-04&post=Industroyer2-IEC-104-Analysis](https://www.netresec.com/?page=Blog&month=2022-04&post=Industroyer2-IEC-104-Analysis)\n\n - [https://www.nozominetworks.com/blog/industroyer2-nozomi-networks-labs-analyzes-the-iec-104-payload/](https://www.nozominetworks.com/blog/industroyer2-nozomi-networks-labs-analyzes-the-iec-104-payload/)\n\n - [https://www.cisa.gov/uscert/ncas/alerts/aa22-103a](https://www.cisa.gov/uscert/ncas/alerts/aa22-103a)\n\n - [https://www.mandiant.com/resources/incontroller-state-sponsored-ics-tool](https://www.mandiant.com/resources/incontroller-state-sponsored-ics-tool)\n\n - [https://www.dragos.com/blog/industry-news/chernovite-pipedream-malware-targeting-industrial-](https://www.dragos.com/blog/industry-news/chernovite-pipedream-malware-targeting-industrial-control-systems/)\n[control-systems/](https://www.dragos.com/blog/industry-news/chernovite-pipedream-malware-targeting-industrial-control-systems/)\n\n - [https://download.schneider-electric.com/files?p_Doc_Ref=SESB-2022-01](https://download.schneider-electric.com/files?p_Doc_Ref=SESB-2022-01)\n\n - [https://customers.codesys.com/index.php?eID=dumpFile&t=f&f=17113&token=0c173ece4a2f48bd3](https://customers.codesys.com/index.php?eID=dumpFile&t=f&f=17113&token=0c173ece4a2f48bd30d6a67fa2f495119d5caefc&download)\n[0d6a67fa2f495119d5caefc&download](https://customers.codesys.com/index.php?eID=dumpFile&t=f&f=17113&token=0c173ece4a2f48bd30d6a67fa2f495119d5caefc&download)\n\n\n-----\n\n© 2022 Forescout Technologies, Inc. All rights reserved. Forescout Technologies, Inc. is a Delaware\ncorporation. A list of our trademarks and patents is available at www.forescout.com/company/legal/intellectualproperty-patents-trademarks. Other brands, products or service names may be trademarks or service marks of\ntheir respective owners.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Industroyer/2022-07-14 - Industroyer2 and INCONTROLLER In-depth Technical Analysis of the Most Recent ICS-specific Malware .pdf"
    ],
    "report_names": [
        "2022-07-14 - Industroyer2 and INCONTROLLER In-depth Technical Analysis of the Most Recent ICS-specific Malware .pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "091dc6fb-2650-4646-894a-41de0d463f94",
            "created_at": "2023-11-17T02:00:07.594612Z",
            "updated_at": "2025-03-27T02:00:03.230461Z",
            "deleted_at": null,
            "main_name": "Chernovite",
            "aliases": [],
            "source_name": "MISPGALAXY:Chernovite",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1676858799,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1657728741,
    "ts_modification_date": 1657728741,
    "files": {
        "pdf": "https://archive.orkl.eu/fe62a9a4ccf358a9f22b0af836d4d2d968191896.pdf",
        "text": "https://archive.orkl.eu/fe62a9a4ccf358a9f22b0af836d4d2d968191896.txt",
        "img": "https://archive.orkl.eu/fe62a9a4ccf358a9f22b0af836d4d2d968191896.jpg"
    }
}