{
    "id": "28363c03-f12e-4343-8e56-1c6a46cc365e",
    "created_at": "2023-01-12T15:02:05.060566Z",
    "updated_at": "2025-03-27T02:17:23.70655Z",
    "deleted_at": null,
    "sha1_hash": "d62ec68e20516cc98d7624a92b7a418ed81d7f68",
    "title": "2017-04-07 - The Blockbuster Sequel",
    "authors": "",
    "file_creation_date": "2022-05-28T03:46:02Z",
    "file_modification_date": "2022-05-28T03:46:02Z",
    "file_size": 1830363,
    "plain_text": "# The Blockbuster Sequel\n\n**researchcenter.paloaltonetworks.com/2017/04/unit42-the-blockbuster-sequel/**\n\nAnthony Kasza, Micah Yates April 7, 2017\n\nBy [Anthony Kasza and](https://unit42.paloaltonetworks.com/author/anthony-kasza/) [Micah Yates](https://unit42.paloaltonetworks.com/author/micah-yates/)\n\nApril 7, 2017 at 5:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [AutoFocus,](https://unit42.paloaltonetworks.com/tag/autofocus/) [Blockbuster,](https://unit42.paloaltonetworks.com/tag/blockbuster/) [Korea,](https://unit42.paloaltonetworks.com/tag/korea/) [Lazarus Group,](https://unit42.paloaltonetworks.com/tag/lazarus-group/) [spearphishing](https://unit42.paloaltonetworks.com/tag/spearphishing/)\n\nUnit 42 has identified malware with recent compilation and distribution timestamps that has code, infrastructure, and themes overlapping with\n[threats described previously in the Operation Blockbuster report, written by researchers at Novetta. This report details the activities from a](http://www.novetta.com/2016/02/operation-blockbuster-unraveling-the-long-thread-of-the-sony-attack/)\ngroup they named Lazarus, their tools, and the techniques they use to infiltrate computer networks. The Lazarus group is tied to the 2014\nattack on [Sony Pictures Entertainment and the](http://fortune.com/sony-hack-part-1/) [2013 DarkSeoul attacks.](https://www.scmagazine.com/south-korean-corporations-hit-by-widespread-attack-that-wiped-data-and-shut-down-systems/article/543718/)\n\nThis recently identified activity is targeting Korean speaking individuals, while the threat actors behind the attack likely speak both Korean and\nEnglish. This blog will detail the recently discovered samples, their functionality, and their ties to the threat group behind Operation\nBlockbuster.\n\n## Initial Discovery and Delivery\n\nThis investigation began when we identified two malicious Word document files in AutoFocus threat intelligence tool. While we cannot be\ncertain how the documents were sent to the targets, phishing emails are highly likely. One of the malicious files was submitted to VirusTotal on\n6 March 2017 with the file name \"한싹시스템.doc\". Once opened, both files display the same Korean language decoy document which\nappears to be the benign file located online at \"www.kuipernet.co.kr/sub/kuipernet-setup.docx\".\n\n\n-----\n\n_Figure 1 Dropped decoy document_\n\nThis file (Figure 1) appears to be a request form used by the organization. Decoy documents are used by attackers who want to trick victims\ninto thinking a received file is legitimate. At the moment, the malware infects the computer, it opens a non-malicious file that contains content\nthe target expected to receive (Figure 2.) This serves to fool the victim into thinking nothing suspicious has occurred.\n\n\n-----\n\n_Figure 2 Spear Phishing Attack uses a decoy a file to trick the target_\n\nWhen these malicious files are opened by a victim, malicious Visual Basic for Applications (VBA) macros within them write an executable to\ndisk and run it. If macros are disabled in Microsoft Word, the user must click the “Enable Content” button for malicious VBA script to execute.\nBoth documents make use of logic and variable names within their macros, which are very similar to each other. Specifically, they both contain\nstrings of hex that when reassembled and XOR-decoded reveal a PE file. The PE file is written to disk with a filename that is encoded in the\nmacro using character substitution. Figure 3 shows part of the logic within the macros which is identical in both files.\n\n\n-----\n\n_Figure 3 Malicious document malicious macro source code_\n\n## The Embedded Payload\n\n[The executable which is dropped by both malicious documents is packed with UPX. Once unpacked, the payload](https://upx.github.io/)\n(032ccd6ae0a6e49ac93b7bd10c7d249f853fff3f5771a1fe3797f733f09db5a0) can be statically examined. The compile timestamp of the sample\nis March 2nd, 2017, just a few days before one of the documents carrying the implant was submitted to VirusTotal.\n\nThe payload ensures a copy of itself is located on disk within the %TEMP% directory and creates the following registry entry to maintain\npersistence if the system is shutdown\n\n\n1\n2\n\n\nHKLM\\SOFTWARE\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Run\\JavaUpdate,\nValue:%TEMP%\\java.exe /c /s\n\n\nIt then executes itself with the following command line:\n\n1 %TEMP%\\java.exe /c %TEMP%\\java.exe\n\nThe implant beacons to its command and control (C2) servers directly via the servers' IPv4 addresses, which are hard coded in the binary, no\ndomain name is used to locate the servers. The communications between the implant and the server highly resemble the \"fake TLS\" protocol\nassociated with malware tools used by the Lazarus group and described in the Operation Blockbuster report. However, the possible values of\nthe [Server Name Indication (SNI) record within the CLIENT HELLO of the TLS handshake used by the implant differ from those described in](https://en.wikipedia.org/wiki/Server_Name_Indication)\nthe report. The names embedded in the new sample and chosen for communications include:\n\ntwitter.com\nwww.amazon.com\nwww.apple.com\nwww.bing.com\nwww.facebook.com\nwww.microsoft.com\n\n\n-----\n\nwww.yahoo.com\nwww.join.me\n\nThe C2 servers contacted by the implant mimic the expected TLS server responses from the requested SNI field domain name, including\ncertificate fields such as the issuer and subject. However, the certificates' validity, serial number, and fingerprint are different. Figure 4 shows a\nfake TLS session which includes the SNI record \"www.join.me\" destined for an IPv4 address which does not belong to Join.Me.\n\n_Figure 4 The use of \"www.join.me\" as an SNI record of a TLS handshake to an IPv4 address which does not host that domain name_\n\n## Expanding the Analysis\n\nBecause the attackers reused similar logic and variable names in their macros, we were able to locate additional malicious document samples.\nDue to the heavy reuse of code in the macros we also speculate the documents are created using an automated process or script. Our\nanalysis of the additional malicious documents showed some common traits across the documents used by the attackers:\n\n1. Many, but not all, of the documents have the same author\n2. Malicious documents support the ability to drop a payload as well as an optional decoy document\n3. XOR keys used to encode embedded files within the macros seem to be configurable\n4. All of the dropped payloads were compressed with a packer (the packer used varied)\n\nMultiple testing documents which dropped and executed the Korean version of the Microsoft calc.exe executable, but contained no malicious\ncode, were also identified. This mirrors a common practice in demonstrating exploits of vulnerabilities. Interestingly enough, all of the test\ndocuments identified were submitted to VirusTotal with English file names from submitters located in the United States (although not during US\n\"working hours\"). Despite the documents having Korean code pages, when executed they open decoy documents with the English text:\n\"testteststeawetwetwqetqwetqwetqw\". These facts lead us to believe at least some of the developers or testers of the document weaponizing\ntool may be English speakers.\n\nWhile some of the documents identified carry benign payloads, most of the payloads were found to be malicious. A cluster of three malicious\ndocuments were identified that drop payloads which are related via C2 domains. The payloads can be seen highlighted in Figure 5.\n\n\n-----\n\n_Figure 5 Related executables, their C2 domain names, their dropper documents, and the shared batch file_\n\nThe two malicious payloads circled in Figure 5 write a batch script to disk that is used for deleting the sample and itself, which is a common\npractice. The batch script dropped by the two payloads share a file name, file path, and hash value with a script sample\n[(77a32726af6205d27999b9a564dd7b020dc0a8f697a81a8f597b971140e28976). This sample is described in a 2016 research report by Blue](https://www.bluecoat.com/security-blog/2016-02-24/seoul-sony)\nCoat discussing connections between the DarkSeoul group and the Sony breach of 2014.\n\nThe script's (Figure 6) hash value will vary depending on the name of the file it is to delete. It also includes an uncommon label inside it of\n\"L21024\". The file the script deletes is the payload which writes the script to disk. In the case of Figure 6, the payload was named \"thing.exe\".\n\n_Figure 6 The contents of the shared batch script_\n\n## Ties to Previous Attacks\n\nIn addition to the commonalities already identified in the communication protocols and the shared cleanup batch script use by implants, the\npayloads also share code similarities with samples detailed in Operation Blockbuster. This is demonstrated by analyzing the following three\nsamples, which behave in similar ways:\n\n032ccd6ae0a6e49ac93b7bd10c7d249f853fff3f5771a1fe3797f733f09db5a0\n\n79fe6576d0a26bd41f1f3a3a7bfeff6b5b7c867d624b004b21fadfdd49e6cb18\n520778a12e34808bd5cf7b3bdf7ce491781654b240d315a3a4d7eff50341fb18\n\n\n-----\n\nWe used these three samples to reach the conclusion that the samples investigated are tied to the Lazarus group.\n\nFirst, these three samples all use a unique method of executing a shell command on the system. An assembly function is passed four strings.\nSome of the strings contain placeholders. The function interpolates the strings and creates a system command to be executed. The following\nfour parameters are passed to the function:\n\n\"PM\",\n\"xe /\"\n\"md\"\n\"c%s.e%sc \\ \"%s > %s 2>&1\\\"\n\nThese are used not only in the implant we investigated, but also in the two samples above. Additionally, many samples discussed in the\nOperation Blockbuster report also made use of this technique. Figure 7 shows the assembly from the unpacked implant\n(032ccd6ae0a6e49ac93b7bd10c7d249f853fff3f5771a1fe3797f733f09db5a0) delivered by our malicious document and shows the string\ninterpolation function being used.\n\n_Figure 7 The string interpolation function assembly with library names from_\n_032ccd6ae0a6e49ac93b7bd10c7d249f853fff3f5771a1fe3797f733f09db5a0_\n\nFigure 8 shows the same string interpolation logic but within a different sample\n(79fe6576d0a26bd41f1f3a3a7bfeff6b5b7c867d624b004b21fadfdd49e6cb18.) The instructions are the same except where the system calls are\nreplaced with DWORDs which brings us to a second similarity.\n\n\n-----\n\n_Figure 8 The string interpolation function assembly without library names from_\n_79fe6576d0a26bd41f1f3a3a7bfeff6b5b7c867d624b004b21fadfdd49e6cb18_\n\nThe second similarity ties this sample to a known Lazarus group sample\n(520778a12e34808bd5cf7b3bdf7ce491781654b240d315a3a4d7eff50341fb18.) Upon execution, both samples set aside memory to be used\nas function pointers. These pointers are assigned values by a dedicated function in the binary. Other functions in the binary call the function\npointers instead of the system libraries directly. The motivation for the use of this indirection is unclear, however, it provides an identifying\ndetection mechanism.\n\nThese two samples resolve system library functions in a similar yet slightly different manner. The sample known to belong to the Lazarus\ngroup uses this indirect library calling in addition to a function that further obfuscates the function's names using a lookup table within a\ncharacter substitution function. This character substitution aspect was removed in the newer samples. The purpose for removing this\nfunctionality between the original Operation Blockbuster report samples and these newer ones is unclear. Figure 9 displays how this character\nsubstitution function was called within the Lazarus group sample.\n\n\n-----\n\n_Figure 9 The character substitution function from 520778a12e34808bd5cf7b3bdf7ce491781654b240d315a3a4d7eff50341fb18 being called_\n\n\n**SHA256 Hash** **String**\n**Interpolation**\n**Function**\n\n\n**System**\n**Library**\n**Obfuscation**\n\n\n**Fake TLS**\n**Communications**\n\n\n**Label**\n\n\n032ccd6ae0a6e49ac93b7bd10c7d249f853fff3f5771a1fe3797f733f09db5a0 Yes No Yes Initially\nidentified\npayload\n\n79fe6576d0a26bd41f1f3a3a7bfeff6b5b7c867d624b004b21fadfdd49e6cb18 Yes Yes Yes Sample\nidentified to\nbe related\nto initial\npayload\nand\nOperation\nBlockbuster\nsample\n\n520778a12e34808bd5cf7b3bdf7ce491781654b240d315a3a4d7eff50341fb18 Yes Yes Yes Known\nOperation\nBlockbuster\nsample\n\n_Figure 10: A comparison of features between samples_\n\n## Final Thought\n\nOverlaps in network protocols, library name obfuscation, process creation string interpolation, and dropped batch file contents demonstrate a\nclear connection between the recent activity Unit 42 has identified and previously reported threat campaigns. Demonstrated by the malicious\ndocument contents, the targets of this new activity are likely Korean speakers, while the attackers are likely English and Korean speakers.\n\nIt is unlikely these threat actors will stop attacking their targets. Given the slight changes that have occurred within samples between reports, it\nis likely this group will continue to develop their tools and skillsets.\n\nCustomers using WildFire are protected from these threats and customers using AutoFocus can find samples from this campaign tagged as\n[Blockbuster Sequel.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.BlockBuster_Sequel)\n\n## Indicators of Compromise\n\n\n-----\n\n**Initial Malicious Documents**\n\ncec26d8629c5f223a120677a5c7fbd8d477f9a1b963f19d3f1195a7f94bc194b\nff58189452668d8c2829a0e9ba8a98a34482c4f2c5c363dc0671700ba58b7bee\n\n**Initial Payload**\n\n1322b5642e19586383e663613188b0cead91f30a0ab1004bf06f10d8b15daf65\n032ccd6ae0a6e49ac93b7bd10c7d249f853fff3f5771a1fe3797f733f09db5a0 (unpacked)\n\n**Testing Malicious Documents**\n\n90e74b5d762fa00fff851d2f3fad8dc3266bfca81d307eeb749cce66a7dcf3e1\n\n09fc4219169ce7aac5e408c7f5c7bfde10df6e48868d7b470dc7ce41ee360723\n\nd1e4d51024b0e25cfac56b1268e1de2f98f86225bbad913345806ff089508080\n\n040d20357cbb9e950a3dd0b0e5c3260b96b7d3a9dfe15ad3331c98835caa8c63\n\ndfc420190ef535cbabf63436e905954d6d3a9ddb65e57665ae8e99fa3e767316\n\nf21290968b51b11516e7a86e301148e3b4af7bc2a8b3afe36bc5021086d1fab2\n\n1491896d42eb975400958b2c575522d2d73ffa3eb8bdd3eb5af1c666a66aeb08\n\n31e8a920822ee2a273eb91ec59f5e93ac024d3d7ee794fa6e0e68137734e0443\n\n49ecead98ebc750cf0e1c48fccf5c4b07fadef653be034cdcdcd7ba654f713af\n\n5c10b34e99b0f0681f79eaba39e3fe60e1a03ec43faf14b28850be80830722cb\n\n600ddacdf16559135f6e581d41b30d0867aae313fbaf66eb4d18345b2136cdd7\n\n6ccb8a10e253cddd8d4c4b85d19bbb288b56b8174a3f1f2fe1f9151732e1a7da\n\n8b2c44c4b4dc3d7cf1b71bd6fcc37898dcd9573fcf3cb8159add6cb9cfc9651b\n\n9e71d0fdb9874049f310a6ab118ba2559fc1c491ed93c3fd6f250c780e61b6ff\n\n**Additional Related Samples**\n\n02d74124957b6de4b087a7d12efa01c43558bf6bdaccef9926a022bcffcdcfea\n\n0c5cdbf6f043780dc5fff4b7a977a1874457cc125b4d1da70808bfa720022477\n\n18579d1cc9810ca0b5230e8671a16f9e65b9c9cdd268db6c3535940c30b12f9e\n\n19b23f169606bd390581afe1b27c2c8659d736cbfa4c3e58ed83a287049522f6\n\n1efffd64f2215e2b574b9f8892bbb3ab6e0f98cf0684e479f1a67f0f521ec0fe\n\n440dd79e8e5906f0a73b80bf0dc58f186cb289b4edb9e5bc4922d4e197bce10c\n\n446ce29f6df3ac2692773e0a9b2a973d0013e059543c858554ac8200ba1d09cf\n\n557c63737bf6752eba32bd688eb046c174e53140950e0d91ea609e7f42c80062\n\n5c10b34e99b0f0681f79eaba39e3fe60e1a03ec43faf14b28850be80830722cb\n\n644c01322628adf8574d69afe25c4eb2cdc0bfa400e689645c2ab80becbacc33\n\n6a34f4ce012e52f5f94c1a163111df8b1c5b96c8dc0836ba600c2da84059c6ad\n\n77a32726af6205d27999b9a564dd7b020dc0a8f697a81a8f597b971140e28976\n\n79fe6576d0a26bd41f1f3a3a7bfeff6b5b7c867d624b004b21fadfdd49e6cb18\n\n8085dae410e54bc0e9f962edc92fa8245a8a65d27b0d06292739458ce59c6ba1\n\n8b21e36aa81ace60c797ac8299c8a80f366cb0f3c703465a2b9a6dbf3e65861e\n\n9c6a23e6662659b3dee96234e51f711dd493aaba93ce132111c56164ad02cf5e\n\n\n-----\n\nd843f31a1fb62ee49939940bf5a998472a9f92b23336affa7bccfa836fe299f5\n\ndcea917093643bc536191ff70013cb27a0519c07952fbf626b4cc5f3feee2212\n\ndd8c3824c8ffdbf1e16da8cee43da01d43f91ee3cc90a38f50a6cc8d6a778b57\n\nefa2a0bbb69e60337b783db326b62c820b81325d39fb4761c9b575668411e12c\n\nf365a042fbf57ed2fe3fd75b588c46ae358c14441905df1446e67d348bd902bf\n\nf618245e69695f6e985168f5e307fd6dc7e848832bf01c529818cbcfa4089e4a\n\nfa45603334dae86cc72e356df9aa5e21151bb09ffabf86b8dbf5bf42bd2bbadf\n\nfc19a42c423aefb5fdb19b50db52f84e1cbd20af6530e7c7b39435c4c7248cc7\n\nff4581d0c73bd526efdd6384bc1fb44b856120bc6bbf0098a1fa0de3efff900d\n\n**C2 Domains**\n\ndaedong.or[.]kr\nkcnp.or[.]kr\nkosic.or[.]kr\nwstore[.]lt\nxkclub[.]hk\n\n**C2 IPv4 Addresses**\n\n103.224.82[.]154\n\n180.67.205[.]101\n\n182.70.113[.]138\n\n193.189.144[.]145\n\n199.26.11[.]17\n\n209.105.242[.]64\n\n211.233.13[.]11\n\n211.233.13[.]62\n\n211.236.42[.]52\n\n211.49.171[.]243\n\n218.103.37[.]22\n\n221.138.17[.]152\n\n221.161.82[.]208\n\n23.115.75[.]188\n\n61.100.180[.]9\n\n61.78.63[.]95\n\n80.153.49[.]82\n\n\n-----\n\n**Ignite ’17 Security Conference: Vancouver, BC June 12–15, 2017**\n\nIgnite ’17 Security Conference is a live, four-day conference designed for today’s security professionals. Hear from innovators and experts,\ngain real-world skills through hands-on sessions and interactive workshops, and find out how breach prevention is changing the security\nindustry. Visit the [Ignite website for more information on tracks, workshops and marquee sessions.](http://www.paloaltonetworksignite.com/)\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-07 - The Blockbuster Sequel.pdf"
    ],
    "report_names": [
        "2017-04-07 - The Blockbuster Sequel.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "68cc6e37-f16d-4995-a75b-5e8e2a6cbb3d",
            "created_at": "2024-05-01T02:03:07.943593Z",
            "updated_at": "2025-03-27T02:05:17.259709Z",
            "deleted_at": null,
            "main_name": "BRONZE EDISON",
            "aliases": [
                "DarkSeoul",
                "Maverick Panda ",
                "Sykipot ",
                "TG-0623 ",
                "getkys",
                "APT4 "
            ],
            "source_name": "Secureworks:BRONZE EDISON",
            "tools": [
                " Wkysol",
                " ZxPortMap",
                "Gh0st RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535725,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653709562,
    "ts_modification_date": 1653709562,
    "files": {
        "pdf": "https://archive.orkl.eu/d62ec68e20516cc98d7624a92b7a418ed81d7f68.pdf",
        "text": "https://archive.orkl.eu/d62ec68e20516cc98d7624a92b7a418ed81d7f68.txt",
        "img": "https://archive.orkl.eu/d62ec68e20516cc98d7624a92b7a418ed81d7f68.jpg"
    }
}