{
    "id": "284c283e-e914-489d-83be-a7fe03a7d980",
    "created_at": "2023-01-12T15:07:45.603404Z",
    "updated_at": "2025-03-27T02:16:08.514765Z",
    "deleted_at": null,
    "sha1_hash": "692687f07e909acd85a0c7bed7cdac0ddc65bccf",
    "title": "2019-11-14 - TA2101 plays government imposter to distribute malware to German, Italian, and US organizations",
    "authors": "",
    "file_creation_date": "2022-05-27T22:12:15Z",
    "file_modification_date": "2022-05-27T22:12:15Z",
    "file_size": 3001445,
    "plain_text": "# TA2101 plays government imposter to distribute malware to German, Italian, and US organizations\n\n**[proofpoint.com/us/threat-insight/post/ta2101-plays-government-imposter-distribute-malware-german-italian-and-us](https://www.proofpoint.com/us/threat-insight/post/ta2101-plays-government-imposter-distribute-malware-german-italian-and-us)**\n\nNovember 14, 2019\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nTA2101 plays government imposter to distribute malware to German, Italian, and US organizations\n\n\n-----\n\nNovember 14, 2019 Bryan Campbell and the Proofpoint Threat Insight Team\n\n## Overview\n\nProofpoint researchers recently detected campaigns from a relatively new actor, tracked internally as\nTA2101, targeting German companies and organizations to deliver and install backdoor malware.\n\nThe actor initiated their campaigns impersonating the Bundeszentralamt fur Steuern, the German Federal\nMinistry of Finance, with lookalike domains, verbiage, and stolen branding in the emails.\n\nFor their campaigns in Germany, the actor chose Cobalt Strike, a commercially licensed software tool\nthat is generally used for penetration testing and emulates the type of backdoor framework used by\nMetasploit, a similar penetration testing tool.\n\nThe product describes itself as “adversary simulation software designed to execute targeted attacks and\nemulate the post-exploitation actions of advanced threat actors,” and is intended for use by organizations\nto secure their environments. However, despite its extensive legitimate use as a simulation tool, various\nactors have deployed and executed campaigns using it as actual malware, including Cobalt Group,\nAPT32, and APT19.\n\nProofpoint researchers have also observed this actor distributing Maze ransomware, employing similar\nsocial engineering techniques to those it uses for Cobalt Strike, while also targeting organizations in Italy\nand impersonating the Agenzia Delle Entrate, the [Italian Revenue Agency. We have also recently](https://www.agenziaentrate.gov.it/portale/)\nobserved the actor targeting organizations in the United States using the IcedID banking Trojan while\nimpersonating the United States Postal Service (USPS)\n\n## Campaigns\n\nBetween October 16 and November 12, 2019, Proofpoint researchers observed the actor sending\nmalicious email messages to organizations in Germany, Italy, and the United States, targeting no\nparticular vertical but with recipients that were heavily weighted towards business and IT services,\nmanufacturing, and healthcare.\n\n## October 16 and 23, 2019\n\n\n-----\n\nOn October 16 and 23, Proofpoint researchers observed hundreds of emails attempting to deliver\nmalicious Microsoft Word attachments with German lures impersonating the Bundeszentralamt fur\n_Steuern, the German Federal Ministry of Finance. Of particular note is the use of stolen branding as well_\nas the use of lookalike .icu domains used for the sender email address in order to craft effective lures.\n\nThe lure states that a 2019 tax refund is due (“Benachrichtigung über die Steuerrückerstattung”) based\non prior returns in the amount of several hundred euros (€694.00 in the observed sample) and that the\nrecipient should submit a refund request (using an attached Microsoft Word document form) within three\ndays for processing. The emails, as part of a low-volume campaign, were targeted primarily at IT services\ncompanies.\n\n\n-----\n\n_Figure 1: Email lure sent on October 23, purporting to be from the German Federal Ministry of Finance,_\n_notifying the recipient of a tax refund, with a malicious Microsoft Word attachment._\n\nThe Microsoft Word attachment, when opened, executes a Microsoft Office macro that, in turn, executes\na PowerShell script, which downloads and installs the Maze ransomware payload onto the victim’s\nsystem.\n\n_Figure 2: A German-language malicious Microsoft Word Attachment that — if the user enables macros —_\n_executes a Microsoft Office macro that in turn runs a PowerShell script that downloads Cobalt Strike._\n\n## October 29, 2019\n\nOn October 29, Proofpoint researchers observed dozens of emails attempting to deliver malicious\nMicrosoft Word attachments with Italian lures impersonating the Agenzia Entrate, the Italian Ministry of\nTaxation. As with the initially observed German campaign, the actor has used stolen branding as well as\nlookalike.icu domains used for the sender email address in order to craft effective lures.\n\nThe lure appears to be a notification of law enforcement activities (“aggiornamento: attivita di contrasto\n_all'evasione”) and states that the recipient should open and read the enclosed document in order to avoid_\nfurther tax assessment and penalties.\n\nThe emails, as part of a low-volume campaign across multiple verticals, were targeted primarily at\nmanufacturing companies and used an infection chain of Microsoft Office macros into a PowerShell\nscript, which ultimately downloads and installs Maze ransomware.\n\n\n-----\n\n_Figure 3: The email lure sent to Italian organizations is a notification of law enforcement activities, urging_\n_the recipient to open and read the enclosed document in order to avoid further tax assessment and_\n_penalties._\n\nThe malicious document purports to be an RSA SecurID key used by the Italian Ministry of Taxation.\n\n\n-----\n\n_Figure 4: A Microsoft Word attachment in the Italian language, when opened and the user enables_\n_macros, executes a Microsoft Office macro that runs a PowerShell script, which in turn downloads and_\n_installs the Maze ransomware payload onto the victim’s system._\n\n## November 6, 2019\n\nOn November 6, 2019, Proofpoint researchers observed hundreds of emails attempting to deliver\nmalicious Microsoft Word attachments with German lures, again impersonating the German Federal\nMinistry of Finance. As with the previous two campaigns, the actor used stolen branding as well as the\nuse of lookalike .icu domains used for the sender email address in order to craft effective lures. The\nmalicious document purports to be an RSA SecurID key used by the German Ministry of Finance.\n\nThe emails, as part of a low-volume campaign, were targeted primarily at business and IT services\ncompanies and used the same infection chain outlined for previous campaigns.\n\n\n-----\n\n_Figure 5: A German-language Microsoft Word attachment which, when opened and the user enables_\n_macros, executes a Microsoft Office macro that runs a PowerShell script, which in turn downloads and_\n_installs the Maze ransomware payload onto the victim’s system._\n\nOpening the Microsoft Word Document and enabling macros installs Maze ransomware on the user’s\nsystem, encrypting all of their files, and saves a ransom note resembling the following in TXT format in\nevery directory.\n\n\n-----\n\n_Figure 6: Example ransom notice stored on a victim’s system after their files have been encrypted by_\n_Maze ransomware._\n\n## November 7, 2019\n\nOn November 7, 2019, Proofpoint researchers observed hundreds of emails attempting to deliver\nmalicious Microsoft Word attachments with German lures, this time impersonating a German internet\nservice provider, 1&1 Internet AG.\n\nAs with the November 6 campaigns, the actor employed the use of lookalike .icu domains used for the\nsender email address in order to craft effective lures. The campaign was accompanied by a malicious\nMicrosoft Word attachment with a purported RSA SecurID key, similarly-formatted to the one used in the\nNovember 6 campaign.\n\n\n-----\n\n_Figure 7: A German-language Microsoft Word attachment which, when opened and the user enables_\n_macros, executes a Microsoft Office macro that launches a PowerShell script, in turn, which downloads_\n_and installs the Maze ransomware payload onto the victim’s system_\n\n\n-----\n\nThe emails, as part of a low-volume campaign, were targeted primarily at business and IT services\ncompanies, using the same infection chain.\n\n## November 12, 2019\n\nOn November 12, 2019, Proofpoint researchers observed thousands of emails attempting to deliver\nmalicious Microsoft Word attachments with English lures, this time impersonating the United States\nPostal Service (USPS) and distributing the IcedID banking Trojan.\n\nThe campaign differed from previous European campaigns in that the actor chose a .com lookalike,\n**uspsdelivery-service.com instead of a .icu domain. The campaign was accompanied by a malicious**\nMicrosoft Word attachment with a purported RSA SecurID key, similarly-formatted to the one used in the\nprevious campaigns.\n\n_Figure 8: An English-language Microsoft Word attachment which, when opened and the user enables_\n_macros, executes a Microsoft Office macro that launches a PowerShell script, which in turn downloads_\n_and installs the IcedID payload onto the victim’s system._\n\nThe emails, as part of a medium-volume campaign, were targeted heavily at the Healthcare vertical,\nusing the same infection chain.\n\n## Domain and URL Analysis\n\n\n-----\n\nProofpoint researchers have observed a consistent set of TTPs (Tactics, Techniques, and Procedures)\nthat allows attribution of these campaigns to a single actor with high confidence. These include the use\nof .icu domains, as well as identical email addresses for the Start of Authority (SOA) resource records\nstored for the DNS entries for the domains used in these campaigns.\n\nAdditionally, Proofpoint researchers have observed that the canonical URLs used by this actor are\nformatted in a repeatable fashion with word_/.tmp in the string with slight variations made over time\n(included in the IOC section below.) Proofpoint researchers suspect that the word_/.tmp usage might be\n[linked to previous campaigns that were spotted earlier by the infosec community in 2019.](https://urlhaus.abuse.ch/browse.php?search=.tmp)\n\nThe connection between gladkoff1991@yandex.ru extends beyond the more recent Cobalt Strike\ncampaigns, with references to SOA records from September 2019 “eFax” themed Buran Ransomware\n[campaigns.](https://www.bromium.com/buran-ransomware-targets-german-organisations-through-malicious-spam-campaign/)\n\n### German Cobalt Strike/German Tax Office spoof (October 23)\n\nLure email address: antwortensienicht@bzst-informieren.icu\n\nSOA: gladkoff1991@yandex.ru\n\n### Italian Maze Campaign/Italian Ministry of Taxation spoof (October 29)\n\nLure email address: info@agenziaentrate.icu\n\nSOA: gladkoff1991@yandex.ru\n\nProofpoint researchers have also determined that the IP address 91.218.114[.]37 is present in all Maze\nRansomware downloads initiated by this actor.\n\n### German Maze Campaign/German Tax Office spoof (November 6)\n\nThis campaign uses an identical lure that was observed on October 23, including the same \"RSA Key\"\nmalicious Microsoft Word attachment. It is also where we observed the second use of word_/.tmp\nvariation on the URL.\n\n### German Maze Campaign/German ISP spoof (November 7)\n\nThis campaign, distributing Maze ransomware, impersonates a German internet service provider (1&1\nInternet AG) and uses a nearly identical malicious Word Document with an \"RSA Key\" lure that was\nobserved in the November 6 German Tax Office campaign and the October 23 German campaign using\nCobalt Strike.\n\nLure email address: antwortensienicht@bzstinform.icu\n\nSOA: gladkoff1991@yandex.ru, which matches the October 23 Cobalt Strike campaign.\n\n### US IcedID Campaign / USPS Spoof (November 12)\n\nOn November 12, Proofpoint researchers observed a campaign utilizing a USPS themed lure delivering\nthe IcedID Trojan. While a .icu domain was not used in this campaign, instead choosing a different lookalike domain, uspsdelivery-service[.]com, these malicious documents used similar “RSA” style lures\n\n\n-----\n\nobserved in the previous Cobalt Strike and Maze Ransomware campaigns, and added further evidence\nto support the theory that the same actor/group is behind the distribution of those malware families.\n\nThe SOA for uspsdelivery-service[.]com is gladkoff1991@yandex.ru which matches previous\ncampaigns.\n\n## Conclusion\n\nAs detailed in Proofpoint’s April 2019 Threat Insight post, Tax-themed Email Campaigns Target 2019\nFilers, finance-related lures have been used seasonally with upticks in tax-related malware and phishing\ncampaigns leading up to the annual tax filing deadlines in different geographies. In 2017, these\n[campaigns focused on phishing and increasingly sophisticated social engineering, as well as banking](https://www.proofpoint.com/us/threat-insight/post/tax-season-phishing-lures-malware)\nTrojans and ransomware. In 2018, Proofpoint researchers continued to observe sophisticated email\ncampaigns that featured urgent tax-themed lures and convincing spoofs of IRS branding in the United\nStates.\n\nWith these new campaigns launched in Germany and Italy utilizing similar urgent tax-assessment and\nrefund lures, Proofpoint researchers have now observed similar spoofs in Europe distributing backdoor\n[Trojans such as Cobalt Strike as well as Maze ransomware. These email spoofs are notable for using](https://www.proofpoint.com/us/corporate-blog/post/how-does-email-spoofing-work-and-why-it-so-easy)\nconvincing stolen branding and lookalike domains of European taxation agencies and other public-facing\nentities such as Internet service providers. Most recently, the actor has attacked US organizations\nspoofing the United States Postal Service. The increasing sophistication of these lures mirrors improved\nsocial engineering and a focus on effectiveness over quantity appearing in many campaigns globally\nacross the email threat landscape.\n\n## References\n\n[1] https://www.bromium.com/buran-ransomware-targets-german-organisations-through-malicious-spamcampaign/\n\n## Indicators of Compromise (IOCs)\n\n\n**IOC** **IOC**\n**Type**\n\n\n**Description**\n\n\n44991186a56b0d86581f2b9cc915e3af426a322d5c4f43a984e6ea38b81b7bed SHA256 Document\n\ncfd8e3a47036c4eeeb318117c0c23e126aea95d1774dae37d5b6c3de02bdfc2a SHA256 Document\n\n9f2139cc7c3fad7f133c26015ed3310981de26d7f1481355806f430f9c97e639 SHA256 Document\n\n5f1e512d9ab9b915b1fc925f546ed559cbfa49df53229e2f954a1416cf6f5ee4 SHA256 Document\n\n97043f23defd510607ff43201bb03b9916a23bd71b5bdf97db357e5026732506 SHA256 Document\n\n\n-----\n\nd617fd4b2d0824e1a7eb9693c6ec6e71447d501d24653a8e99face12136491a8 SHA256 Document\n\n7e3ab96d2628e0a9970802b47d0356dc9b99994d7f98492d4e70a5384891695a SHA256 Document\n\nantowortensienicht@bzst-infomieren[.]icu Domain Spoofed\nsending\ndomain\n\ninfo@agenziaentrate[.]icu Domain Spoofed\nsending\ndomain\n\nantwortensienicht@bzstinform[.]icu Domain Spoofed\nsending\ndomain\n\nuspsdelivery-service[.[com Domain Spoofed\nsending\ndomain\n\nhxxp://198.50.168.67/wordpack.tmp Payload Cobalt Strike\n\nhxxp://conbase.top/sys.bat Payload Cobalt Strike\n\nhxxp://104.168.198.208/wordupd.tmp Payload Maze\nRansomware\n\nhxxp://104.168.215.54/wordupd.tmp Payload Maze\nRansomware\n\nhxxp://104.168.174.32/wordupd_3.0.1.tmp Payload Maze\nRansomware\n\nhxxp://192.119.68.225/wordupd1.tmp Payload Buran\nRansomware\n\nhxxp://108.174.199.10/wordupd3.tmp Payload Buran\nRansomware\n\nhxxp://54.39.233.175/wupd19823.tmp Payload Buran\nRansomware\n\nhxxp://54.39.233.131/word1.tmp Payload Buran\nRansomware\n\n\n-----\n\nhxxp://104.168.198.230/wordupd.tmp Payload IcedID\n\n## ET and ETPRO Suricata/Snort Signatures\n\nETPRO TROJAN W32.HTTP.Stager Checkin M1\n\nET TROJAN Possible Maze Ransomware Activity\n\nET TROJAN Observed Buran Ransomware UA (BURAN)\n\nET TROJAN Buran Ransomware Activity M2\n\nET TROJAN Buran Ransomware Activity M1\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-14 - TA2101 plays government imposter to distribute malware to German, Italian, and US organizations.pdf"
    ],
    "report_names": [
        "2019-11-14 - TA2101 plays government imposter to distribute malware to German, Italian, and US organizations.pdf"
    ],
    "threat_actors": [
        {
            "id": "1f3cf3d1-4764-4158-a216-dd6352e671bb",
            "created_at": "2022-10-25T15:50:23.837615Z",
            "updated_at": "2025-03-27T02:00:55.556414Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "APT19",
                "Codoso",
                "C0d0so0",
                "Codoso Team",
                "Sunshop Group"
            ],
            "source_name": "MITRE:APT19",
            "tools": [
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e9f85280-337c-4321-b872-0919f8ef64a6",
            "created_at": "2022-10-25T16:07:24.261761Z",
            "updated_at": "2025-03-27T02:02:10.153781Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Gold Village",
                "Maze Team",
                "TA2101",
                "Twisted Spider"
            ],
            "source_name": "ETDA:TA2101",
            "tools": [
                "7-Zip",
                "Agentemis",
                "BokBot",
                "Buran",
                "ChaCha",
                "Cobalt Strike",
                "CobaltStrike",
                "Egregor",
                "IceID",
                "IcedID",
                "Mimikatz",
                "PsExec",
                "SharpHound",
                "VegaLocker",
                "WinSCP",
                "cobeacon",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536065,
    "ts_updated_at": 1743041768,
    "ts_creation_date": 1653689535,
    "ts_modification_date": 1653689535,
    "files": {
        "pdf": "https://archive.orkl.eu/692687f07e909acd85a0c7bed7cdac0ddc65bccf.pdf",
        "text": "https://archive.orkl.eu/692687f07e909acd85a0c7bed7cdac0ddc65bccf.txt",
        "img": "https://archive.orkl.eu/692687f07e909acd85a0c7bed7cdac0ddc65bccf.jpg"
    }
}