{
    "id": "286616a2-9160-4765-aef7-f3508a338915",
    "created_at": "2023-01-12T14:59:55.972952Z",
    "updated_at": "2025-03-27T02:12:03.85715Z",
    "deleted_at": null,
    "sha1_hash": "6ee03deabd60537139a588a3570ef7176cf7638b",
    "title": "2021-06-22 - Crypto-mining on a DNS server",
    "authors": "",
    "file_creation_date": "2022-05-27T23:00:04Z",
    "file_modification_date": "2022-05-27T23:00:04Z",
    "file_size": 201796,
    "plain_text": "# Crypto-mining on a DNS server\n\n**darktrace.com/en/blog/crypto-mining-on-a-dns-server/**\n\nOakley Cox, Principal ICS Analyst | Tuesday June 22, 2021\n\nThe rise of crypto-currencies has fuelled cyber-crime in various ways. Bitcoin has facilitated\na range of criminal activities from money laundering to ransomware payments since its\n[release in 2009, leading to a spike in ransomware attacks which has been growing ever](http://10.10.0.46/blog/double-extortion-ransomware)\nsince.\n\nMore directly, cyber-criminals often hack into company servers and exploit their processing\npower to mine cryptocurrency, without the organization’s knowledge. This blog will explore a\nreal-life attack where an Internet-facing server was compromised and started mining Monero\ncoins.\n\n## Mining cryptocurrency on an Internet-facing server\n\nAt a small private company in the APAC region, an Internet-facing DNS server began to\nreceive multiple incoming RDP connections. They all came from rare destinations which had\nnever been seen on the network. Many were sent from external sources with the RDP\ncookie, ‘hello’, indicating a brute-force attack.\n\nFigure 1: Timeline of the attack\n\n\n-----\n\nHours later, the device was seen connecting out to a known endpoint associated with cryptomining.\n\nAs both RDP and SMB ports on the device were open to the Internet, anomalous SMB\nconnections were seen as well shortly following the crypto-mining connections.\n\n## Open ports, open sesame\n\n[Internet-facing servers are subject to many external threats, especially if sensitive ports are](http://10.10.0.46/blog/old-but-still-dangerous-dharma-ransomware-via-rdp-intrusion)\nexposed. In this case, the attacker was able to gain a foothold through the DNS server\nbecause both the RDP and SMB ports could receive connections. It is important therefore to\nclose communication to all external points which do not strictly need to be open.\n\nCrypto-jacking continues to be a viable way for attackers to expend company resources in\norder to speed up their mining operations. Especially with the popularity of cryptocurrencies\nat the moment, we have observed a significant uptick in these types of threat.\n\nThe connections to the mining pool were identified by Darktrace’s AI without relying on any\n[known IoCs. Instead, Cyber AI recognized the anomalous nature of the external endpoints,](http://10.10.0.46/cyber-ai)\nwhich were statistically rare for the server’s ‘pattern of life’.\n\nIf the threat had not been detected, the attacker would have continued to abuse the server\nresources, resulting in latency issues for important processes. The server could also have\nbeen subject to further malicious activity such as DDoS or ransomware.\n\nFigure 2: A similar incident showing an increase in model breaches around the time of\ncompromise on June 8\n\n## Protecting a company’s gems\n\nCrypto-mining is notoriously difficult to detect and can go on for months unnoticed. And it can\nform just one phase of an attacker’s full plan to infiltrate a network — alongside moving\nlaterally and compromising additional devices. Open ports and siloed defenses pave the way\nfor an attacker to break into a system with little resistance.\n\nOrganizations need a mechanism for detecting unusual and sinister behavior once the threat\nis inside. To this end, Darktrace’s evolving understanding of ‘normal’ across users, devices,\nand peer groups enables it to detect the subtle signs of latent threats. And with Autonomous\nResponse, it responds at machine speed, neutralizing the threat before it has had the\nchance to spread.\n\nIn this case, with [Darktrace’s SOC team, the client was immediately made aware of the](http://10.10.0.46/blog/how-a-soc-team-neutralized-the-qak-bot-banking-trojan)\nactivity and promptly took the device offline. A Proactive Threat Notification was sent as soon\nas the attacker had commenced mining. Darktrace analysts then worked through the issue\nwith the customer until the crisis had been resolved\n\n\n-----\n\nDarktrace s AI detects and responds to threats no matter where they come from – RDP\n[account compromise, misconfigured Internet-facing server, or sophisticated Hafnium-style](http://10.10.0.46/blog/hafnium-cyber-attack-neutralized-by-ai-in-december-2020)\nzero day. Furthermore, it provides much-needed visibility over the enterprise, identifying and\nhighlighting Internet-facing devices and any issues they may pose.\n\nThanks to Darktrace analyst Taylor Breland for his insights on the above threat find.\n\n[Learn more about illegal crypto-mining](http://10.10.0.46/resources/ds-crypto-jacking.pdf)\n\n**IoCs:**\n\nIoC Comment\n\n\n185.202.1[.]123\n\n80.82.77[.]85\n\n95.217.62[.]100\n\n213.152.161[.]234\n\n71.66.5[.]150\n\n210.86.230[.]202\n\n188.113.154[.]189\n\n201.22.59[.]203\n\n180.232.127[.]166\n\n139.99.125[.]38\n\nPool-hk.supportxmr.com\n\n\nAnomalous RDP connections from externally rare endpoints\n\nAnomalous SMB connections from external rare endpoints\n\nMonero mining endpoints\n\n\n**Darktrace model detections:**\n\nDevice / Anomalous RDP Followed By Multiple Model Breaches\nCompromise / Monero Mining\nCompromise / High Priority Crypto Currency Mining (Enhanced Model Breach/PTN)\nDevice / Anomalous SMB Followed By Multiple Model Breaches\nCompliance / Crypto Currency Mining Activity\nAnomalous Server Activity / Anomalous External Activity from Critical Network Device\nCompliance / Incoming Remote Desktop\nCompliance / Internet Facing RDP Server\n\n## MITRE ATT&CK techniques observed:\n\nInitial Access T1133 – External Remote Services\n\nT1078 – Valid Accounts\n\nPersistence T1133 – External Remote Services\n\nImpact T1496 – Resource Hijacking\n\n\n-----\n\n## Oakley Cox\n\nOakley Cox is Analyst Technical Director for the Asia-Pacific region, and oversees the\ndefense of critical infrastructure and industrial control systems, helping to ensure that\nDarktrace’s AI stays one step ahead of attackers. Oakley is GIAC certified in Response and\nIndustrial Defense (GRID), and helps customers integrate Darktrace with both existing and\nnew SOC and Incident Response teams. He also has a Doctorate (PhD) from the University\nof Oxford.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-22 - Crypto-mining on a DNS server.pdf"
    ],
    "report_names": [
        "2021-06-22 - Crypto-mining on a DNS server.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535595,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653692404,
    "ts_modification_date": 1653692404,
    "files": {
        "pdf": "https://archive.orkl.eu/6ee03deabd60537139a588a3570ef7176cf7638b.pdf",
        "text": "https://archive.orkl.eu/6ee03deabd60537139a588a3570ef7176cf7638b.txt",
        "img": "https://archive.orkl.eu/6ee03deabd60537139a588a3570ef7176cf7638b.jpg"
    }
}