{
    "id": "28918bc8-687a-4b9c-b87e-52d6eed71bd3",
    "created_at": "2023-01-12T15:04:05.663525Z",
    "updated_at": "2025-03-27T02:05:28.383627Z",
    "deleted_at": null,
    "sha1_hash": "6608f1b81bb3a9717596f483b075202307965298",
    "title": "2016-07-26 - Attack Delivers ‘9002’ Trojan Through Google Drive",
    "authors": "",
    "file_creation_date": "2013-06-17T14:00:15Z",
    "file_modification_date": "2015-06-19T12:29:25Z",
    "file_size": 1892617,
    "plain_text": "-----\n\n# What's Inside\n\nWelcome\n\nIntroduction 2\n\nAccomplishments 3\n\nIndustrial Control Systems Cyber Emergency Response Team (JCS-CERT) 4\n\nNational Cybersecurity and Communications Integration Center (NCCIC) _S_\n\nIndustrial Control Systems Consequence Effects and Analysis (ICS-CEA) _S_\n\nJCS-CERT key accomplishments for include: 6\n\nCybersecurity Assessments 7\n\nCybersecurity Training and Vendor Assessments 8\n\nRoadmaps and Standards Development 9\n\nIndustrial Control Systems Joint Working Group 10\n\nPath Forward 11\n\nAssistance from CSSP 12\n\n\n-----\n\n-----\n\n-----\n\n### Accomplishments\n\nIn FY 2011, CSSP continued to move forward and grow     - Cyber Security Evaluation Tool (CSET) Version 4.0 was\nas a program. By providing increased support to the released in August 2011 with\nvendors, owners, and operators of critical infrastructure, the over I , 1 S0 CSETs being distributed in FY 2 0 I I .\nprogram continued to work toward a safer and more secure\n\n                                                      - The CSET tool is now downloadable from the\n\ntomorrow by accomplishing several key tasks:\n\nCSSP website.\n\n        - ICS-CERT fly-away teams were deployed to seven\n\n                                                      - In FY 2 0 1 I , over 7 S CSET onsite assessments\n\norganizations over the fiscal year (FY).\n\nwere completed.\n\n      - Approximately 600 participants attended the Fall 2010\n\n                                    - Over 40 training courses have been conducted domesti­\n\nand Spring 2011 ICSJWG Conferences with over 200\n\ncally and internationally for public and private partners\n\nscheduled to attend the Fall 2011 ICSJWG.\n\nwith over 1 ,300 attendees.\n\n     - The ICSJWG Cross-Sector Roadmap Document\n\n                                      - CSSP provided more than a I 00 situational awareness\n\nwas finalized.\n\nbriefings and presentations at stakeholder meetings\nand conferences.\n\n\n-----\n\n## Industrial Control Systems Cyber Emergency Response Team (ICS-CERT)\n\nThe ICS-CERT provides cyber incident response, analysis, and\ninformation sharing to address the cybersecurity threats and\nvulnerabilities unique to industrial control systems (ICS). For\nexample, this capability provides onsite and remote incident\nresponse services for a variety of cyber threats ranging from\ngeneral malicious code infections to advanced persistent\nthreat (APT) intrusions.\n\nThe response team also produces alerts and advisories to\nwarn of vulnerabilities and to recommend mitigations and\nbest practices for securing ICS and the workplace. ICS-CERT\ndoes this in partnership with private sector organizations and\nInformation Sharing and Analysis Centers in order to coor­\ndinate and leverage cybersecurity efforts across all 18 critical\ninfrastructure sectors.\n\nA technical analysis and malware lab enables the ICS-CERT\nto provide analysis of vulnerabilities and malware threats\nto control system environments.The team is able to verify\n\n\nvulnerabilities for researchers and vendors, perform impact\nanalysis, and provide patch validation and testing prior to\ndeployment to the asset-owner community.\n\nAnother service the program offers asset owners is no-cost\nonsite assistance and offsite analysis to support discovery,\nforensics analysis, and recovery efforts associated with a\ncybersecurity event (incident) focused on control environ­\nments within critical infrastructure. Onsite assistance consists\nof a fly-away team being made available to deploy onsite to\nreview affected entities’ network architectures, collect appli­\ncable forensic data, assist with immediate mitigation efforts\nwhen appropriate, and work with the stakeholder to identify\nfuture defense strategies. Offsite services include providing\nanalytical findings, including determination of origin and\nbreadth and depth of compromise from data captured during\nthe onsite deployment to the customer.\n\n\n-----\n\n-----\n\n## y p FY 2011 include:\n\nICS-CERT deployed onsite incident response fly-away teams\nto seven critical infrastructure organizations to assist with\nanalysis and recovery efforts of a cyber incident.\n\nAs part of the information sharing mission, ICS-CERT\npublished over 100 security alerts and advisories to the ICS\ncommunity warning of various threats and vulnerabilities\nimpacting control systems.\n\nVulnerability analysis and coordination rose a staggering\n600% in FY 2011, with researchers utilizing ICS-CERT as a\nconduit to vendors in the ICS space.\n\nReported cyber incidents were also up over 200% from\nFY 2010 with more asset owners and operators contacting\nICS-CERT for support during a cyber event.\n\n\n-----\n\n## y y\n\nCSSP offers the CSET, a DHS product that assists organiza­\ntions in protecting their key national cyber assets.This tool\nprovides users with a systematic and repeatable approach\nfor assessing the security posture of their cyber systems\nand networks against recognized industry and government\nstandards, guidelines, and practices. It includes both highlevel and detailed questions related to all industrial control\nand IT systems, regardless of sector. CSET generates both\ninteractive (on-screen) and printed reports that provide a\nsummary of security level gaps or areas that do not meet the\nrecommendations of the selected standards.These reports\ncan be used to help an organization plan and prioritize\nmitigation strategies. Organizations who wish to conduct a\nself assessment can download CSET from the CSSP website.\nOver 1,150 copies of the tool were distributed in FY 2011.\n\n\nIn addition to the CSET, CSSP also offers onsite training\nand guidance to asset owners in using CSET during onsite\nassessments.These assessments are conducted at no cost\nto the asset owners.This “over-the-shoulder” training and\nguidance is provided to assist asset owners in using the tool\nto better understand their control systems cybersecurity\nposture.\n\nIn FY 2011, CSSP conducted over 75 assessments across\nthe sectors. For information on the CSET or to download\nthe tool, visit the website at:\n\n_[http://www.us-cert.gov/control_systems/satool.html](http://www.us-cert.gov/control_systems/satool.html)_\n\n\n-----\n\n## Cybersecurity Training\n\nCSSP offers several training programs including Introductory,\nIntermediate, and Advanced Control Systems Security classes.\nThese classes are offered at no cost to ICS professionals\nand managers across all sectors of CIKR. In FY 2011, over\n40 training sessions were provided consisting of over 20\nIntroductory, 8 Intermediate, and 10 Advanced ICS classes.\n\nIn April of 2011, CSSP released a new Management Level\nTraining Course that provides managers with a high-level\noverview of control systems security.\n\n\n## Vendor Assessments\n\nThe Vendor Assessments effort focuses on vulnerabilities in\nspecific vendor equipment/software where CSSP analyzes the\npotential impacts of emerging exploits in various ICS environ­\nments. CSSP completed assessments of several systems in FY\n2011 and provided findings and recommendations to system\nvendors for consideration and action.The ICS-CERT leveraged\nthese discoveries to issue alerts and guiding principles to the\nICS stakeholder community to identify, mitigate, and reduce\nthe security risks.\n\n\n-----\n\n-----\n\n-----\n\n## Path Forward\n\nThe evolution of industrial control systems, as well as\nthreats to those systems, requires CSSP and ICS-CERT to\ncontinue evolving to meet the needs of owners, vendors,\nand operators. It is our goal to assist in providing the\nstakeholder community with the tools and services required\nto securely operate those systems that the nation’s critical\ninfrastructures rely apon daily.\n\nGoals in the upcoming year include strengthening the\nincident response capability and providing continued\nonsite incident response teams to assist CIKR owners and\noperators with investigation and remediation of damages\nfollowing a cyber incident on industrial control systems.\nSupporting this, improvements will also be made to\nmalware analysis capabilities.\n\n\nIn addition to providing onsite assessments, CSSP will\ncontinue to focus on support for standards development\norganizations and release upgrades to the CSET tool.This\ntool is for use across the control systems community,\nincluding public and private sector partners, to increase\nsituational awareness for cybersecurity status and improve\nthe health of CIKR stakeholders’ control systems.\n\nCSSP plans to revise the Strategy to Secure Control Systems.\nThe program will promote and maintain the CSSP website\nas a central repository for control systems cybersecurity\ninformation, vulnerability reporting, and cross-sector\ninformation sharing for public and private sector partners.\nCSSP also will continue industrial systems security support\nto the NCCIC and is dedicated to maintaining our position\nas a world class leader in control systems security.\n\n\n-----\n\n-----\n\n## Assistance from CSSP  is only a phone call away\n\nThe CSSP and the ICS-CERT encourage you to report suspi­\ncious cyber activity and vulnerabilities affecting critical\ninfrastructure control systems.\n\nTo report control systems cyber incidents and vulnerabilities\ncontact the ICS-CERT:\n\n_[ics-cert@dhs.gov](mailto:ics-cert@dhs.gov)_\n877-776-7585\n\n_www.us-cert.gov/control_systems/ics-cert_\n\nFor more information on the Control Systems Secuirty\nProgram visit:\n\n_[http://www.us-cert.gov/control_systems/](http://www.us-cert.gov/control_systems)_\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/ICS-CERT - Year in Review - 2011.pdf"
    ],
    "report_names": [
        "ICS-CERT - Year in Review - 2011.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535845,
    "ts_updated_at": 1743041128,
    "ts_creation_date": 1371477615,
    "ts_modification_date": 1434716965,
    "files": {
        "pdf": "https://archive.orkl.eu/6608f1b81bb3a9717596f483b075202307965298.pdf",
        "text": "https://archive.orkl.eu/6608f1b81bb3a9717596f483b075202307965298.txt",
        "img": "https://archive.orkl.eu/6608f1b81bb3a9717596f483b075202307965298.jpg"
    }
}