{
    "id": "28e0b9e3-af37-4e74-9d28-e89a8a8a89c8",
    "created_at": "2023-01-12T15:08:12.494577Z",
    "updated_at": "2025-03-27T02:13:34.694389Z",
    "deleted_at": null,
    "sha1_hash": "2fb137e1402cc7d71dcba2463a59077a5b85fa66",
    "title": "2020-06-14 - CTI is Better Served with Context- Getting better value from IOCs",
    "authors": "",
    "file_creation_date": "2022-05-28T17:36:48Z",
    "file_modification_date": "2022-05-28T17:36:48Z",
    "file_size": 357417,
    "plain_text": "# CTI is Better Served with Context: Getting better value from IOCs\n\n**[klrgrz.medium.com/cti-is-better-served-with-context-getting-better-value-from-iocs-496343741f80](https://klrgrz.medium.com/cti-is-better-served-with-context-getting-better-value-from-iocs-496343741f80)**\n\nAndy Piazza December 3, 2020\n\n[Andy Piazza](https://klrgrz.medium.com/?source=post_page-----496343741f80--------------------------------)\n\nJun 14, 2020\n\n\n9 min read\n\nHere’s my GIANT head, drawn by this amazing artist:\n\n\n-----\n\nWhether you are disseminating threat indicators internally to other teams or participating in\ninformation sharing programs within the community, context is a critical component of\nactionable intelligence. When analysts say, “Indicators aren’t Intelligence”, they are often\nreferring to the contextless sharing of Observables that is too common within the Cyber\nThreat Intelligence (CTI) community. I believe that indicators can provide serious intelligence\nvalue, but it is up to the source analysts to provide that worth in the form of context.\n\nAdministrative note: In this article, I will capitalize key words to indicate field names and to\nstress the difference in terminology. Sorry tech-writer friends, you can blame the Army for\ngiving me the Bad Habit.\n\n## Observable or Indicator of Compromise?\n\nBefore we go too far in the discussion of information sharing standards, I need to identify\nterminology because a lot of these words are used interchangeably in everyday discussions,\nwhich can lead to confusion. So let’s talk about the difference between Observables and\nIndicators of Compromise (IOC). In my view of the CTI world, Observables are the Atomic\n[and Computed indicator types discussed in Lockheed Martin’s Cyber Kill Chain Paper.](https://www.lockheedmartin.com/content/dam/lockheed-martin/rms/documents/cyber/LM-White-Paper-Intel-Driven-Defense.pdf)\nThese are values found in system logs, network traffic, or computational outputs. Without\nincluding human-assessed context, these are just Observables. Examples include hashes,\nIP/Domain/URL, Registry Keys, etc. This also includes the metadata around these\nObservables, including timestamps, ports, protocols, etc.\n\nHere are Lockheed’s definitions, which are found in section 3.1 of their research paper\nIntelligence-Driven Computer Network Defense Informed by Analysis of Adversary\nCampaigns and Intrusion Kill Chain:\n\n“ — Atomic indicators are those which cannot be broken down into smaller parts and\nretain their meaning in the context of an intrusion. Typical examples here are IP\naddresses, email addresses, and vulnerability identifiers.\n— Computed indicators are those which are derived from data involved in an incident.\nCommon computed indicators include hash values and regular expressions.\n— Behavioral indicators are collections of computed and atomic indicators, often\nsubject to qualification by quantity and possibly combinatorial logic. An example would\nbe a statement such as ”the intruder would initially used a backdoor which generated\nnetwork traffic matching [regular expression] at the rate of [some frequency] to [some\nIP address], and then replace it with one matching the MD5 hash [value] once access\nwas established.””\n\nMy opinion is that the community is better served by referring to Atomic and Computed\nindicators as Observables. To me, the Behavioral indicators are what I consider Indicators of\nCompromise (IOC), which are Observables with context.\n\n\n-----\n\nLet s look at a traditional crime scene as an example. Fingerprints. For the sake of argument,\nfingerprints are a Computed indicator since you’ll need to use some dusting powder and tape\nto get a good print. My fingerprints in your house are just an Observable. A police officer isn’t\ngoing to lift my prints from your house and send them out to every other police station\nwithout including a note about them. That is because my prints do not indicate a compromise\nby themselves. What is the context behind how my fingerprints ended up in your house? Did\nyou invite me inside and my fingerprints were found on a cold beverage can? Or were my\nfingerprints found on a rock that appears to have gone through your recently broken\nwindow? See how critical this context is to make an Observable into an Indicator of\nCompromise?\n\nWell, the same concept applies to computer Observables. I get a feed of suspicious IPs into\nmy TIP and I push them into my SIEM to generate notable alerts to go look at. When I see\nthat an IP from a threat feed matches an IP in a proxy event, I look at the IP in the threat\nfeed and find it doesn’t have any context about how it was observed and reported in previous\nmalicious/suspicious events. I don’t have an indicator. I have an Observable. That is the\nequivalent of the police forwarding copies of evidence from cases to all other police stations,\nbut not including the notes behind the evidence. It is extremely frustrating that we accept this\n— and we do it ourselves — within the CTI community.\n\nSo say it with me:\n\n## IOC = Observable + Context.\n\nWithin information sharing standards, this context is traditionally found in the Description field\nof an IOC. Hopefully, the context is enough to provide a basic understanding of what type of\nactivity the IOC is related to and why it was shared. And no, I don’t mean that “C2 IP” is good\nenough context. Threat Vendors, I’m looking at you! I shouldn’t have to pivot to a threat\nreport or blog to get context around an IOC. I also shouldn’t have to copy/paste IOCs out of a\nPDF or manually type them from an image… but that’s a separate rant.\n\n**PRO-TIP: if your Threat Intelligence Platform (TIP) doesn’t have a Description attribute**\nfor IOCs, you don’t have a TIP. You have an Observable Aggregator.\n\nSource:\nWhen considering what to put in the Description field, there is an obvious balance between\nefficiency of processing and the effectiveness of context that is provided. I recommend a little\nGolden Rule of CTI: provide as much context as you wish other sharing partners would\nprovide to you. Seriously, picture another analyst receiving your IOC through an information\nsharing program, they run those IOCs through their SIEM and get a match to an event and\nthey have the Description you wrote. Did you give them enough information to determine if\nthis is a False-Positive? Did you give them enough information to pivot into other event types\nto search for related IOCs? Or did you share another frustratingly contextless Observable?\n\n\n-----\n\n**Golden Rule of CTI: provide as much context as you wish other sharing partners**\n**would provide to you.**\n\n## A Word Please…\n\nBefore I go too far into laying out the minimum standards for IOC context. Let me take a\npause to clarify three key points:\n\n**1 | When I’m talking about IOC context and the Description field, I specifically mean what**\ngets included with an IOC in an indicator package, whether that is a CSV that accompanies a\nthreat report or a threat feed. These IOCs likely have a lot of other great and relevant context\nin the source evidence (e.g. incident ticket or threat report). Source reports should maintain\ntheir standards of context, including screenshots of malware analysis, phishing email\nexamples, etc. This is something that the community is doing well currently. Where I see it\nlacking though, is often times you get an amazing write-up and a table of IOCs without any\ndirect link to where the IOCs fit in the kill chain. If you mention multiple files in a malware\ncampaign, then list 20 different hashes, how is anyone supposed to know which part of the\nmalware’s execution those IOCs belong to? This is the perfect context for the Description\nfield. Example: “This hash is the deobfuscated DLL of a Sneaky.Trojan campaign observed\nin June 2020.” That is 100% better than a hash with the word “dropper” next to it in a table.\n\n**2 | IOCs need their own Description separate from the context of the source evidence**\nbecause they are often carved out and sent to systems without any context at all. Adding\ncontext to the Description field in your sharing product enables other analysts to push those\nDescriptions with the IOCs into their SIEM. When traffic matches an IOC from the TIP, an\nanalyst can see the appropriate context along with the alert. It drives me insane when I have\nan alert in a SIEM and I have to backtrack to the TIP first to find out that the source report’s\ncontext isn’t in the TIP and I have to go find a source report on the internet to find out why\nthis IOC was in my TIP in the first place. That is craziness and it completely removes any\nvalue in having a TIP, threat feeds, and integration. This will occur for about a month before\nanalysts stop doing the backtracking research and just begin marking all events as FalsePositives.\n\n**3 | Getting everyone on board with the context levels I outline below is a pipedream. I get**\nthat nobody wants to do this kind of work. I know, I wrote Descriptions like this for four years\nto support an information-sharing product line. But I truly believe that this is the only way to\nget value out of information-sharing feeds. We are wasting time and money having analysts\nchase context in the middle of triaging potentially malicious events. We can do the work up\nfront and save millions of wasted hours across the community.\n\nWell… if you’re still onboard with this article, let me show you what I would like to see in the\nDescription field of more threat feeds. I’ll start with the ideal state in the “Awesome Context”\nsection and work down to the “Minimal Context”.\n\n\n-----\n\n## Awesome Context\n\n_On 6/10/2020 “spoofed email[@]spoofedomain[.]com” sent “Invoice” themed emails_\n_that included the malicious URL “hxxp://totallynotlegit[.]com/probablymalware[.]exe”_\n\n_[MD5: 32 characters] (T1566.002), which is detected as Trojan.SuperMalware. When_\n_executed, “probablymalware[.]exe” [MD5: 32 characters] creates a Scheduled Task_\n_named “DoingBadStuff” (T1053.005) and begins C2 over port 443 to_\n_“hxxp://malwareC2[.]net” (T1071.001)._\n\n**PRO-TIP: Putting your IOCs in “quotes” helps a lot with readability, especially when**\nyou include a full email subject or other multiple-word strings.\n\nTo me, this is an awesome level of context to provide for each IOC. If you’re short on time,\nyou can write this Description once, and copy/paste it into the Description field for the related\nIOCs. Let’s be honest, if you’re a CTI analyst, you are already a copy/paste pro. If you some\nextra time, you can include additional context for specific IOCs in the Description field for\nthose IOCs. For example, in the Description for the Malware Hash IOC, you may add what\nRegistry Keys are manipulated, or information about reverse engineering the payload. This\nisn’t necessary to provide for the Email IOC, but is valuable context to add at the file level.\nSerious bonus points to all of the threat analysts that are adding MITRE ATT&CK technique\nreferences in their information sharing products. This is a great step towards a new highwater mark for CTI maturity. I see you and I appreciate you!\n\n## Great Context\n\n_On 6/10/2020 “spoofed email[@]spoofedomain[.]com” sent “Invoice” themed emails_\n_that included the malicious URL “hxxp://totallynotlegit[.]com/probablymalware[.]exe”_\n\n_[MD5: 32 characters], which is detected as Trojan.SuperMalware. When executed,_\n_“probablymalware[.]exe” [MD5: 32 characters] creates a Scheduled Task named_\n_“DoingBadStuff” and begins C2 over port 443 to “hxxp://malwareC2[.]net”._\n\nOkay, this is really awesome context too. It is just missing the MITRE ATT&CK technique\nmapping. Two years ago, I would have said that this is the standard for awesome context.\nBut after spending the last year or two mapping reports and IOCs to ATT&CK manually, I am\nloving that more and more CTI reports are including technique numbers. So this is great\ncontext instead of awesome context.\n\n## Minimal Context\n\n_“The IOC “hxxp://malwareC2[.]net” was associated with a Trojan.SuperMalware_\n_campaign in June 2020.”_\n\n\n-----\n\nThis Description is arguably light on details. However, it is still a significant improvement over\nthe context you get from most commercial threat feeds. Seriously, who decided that and\nObservable with a tag like “Malware” or “C2” was good enough? Do you know what happens\nif a TIP doesn’t have a Tag field? The association to the malware family is lost. We can do\nbetter than that for each other.\n\nI get it. Sometimes you get a big list of IOCs to share and you don’t have the time (or don’t\nwant to take the time…) to write a unique description for each IOC. In those cases, I\nrecommend dumping the IOCs into a spreadsheet and using a simple formula to write a\nbasic description automatically. Once you provide a basic template for the sentence structure\nand formula, you drag both the sentence structure and the formula down the spreadsheet to\nauto-populate a Description sentence. Here’s what that looks like:\n\nColumn A: Observable (hxxp://malwareC2[.]net)\nColumn B: Malware or Campaign Name (Trojan.SuperMalware)\nColumn C: first part of a sentence (The IOC “)\nColumn D: second part of a sentence. (“ was associated with a )\nColumn E: Last part of a sentence. ( campaign in June 2020.)\nColumn F: =C2&A2&D2&B2&E2. (The IOC “hxxp://malwareC2[.]net” was associated\nwith a Trojan.SuperMalware campaign in June 2020.)\n\nExcel formula in cell F2.\n\n## Final Thoughts\n\nI encourage CTI analysts to consider this type of context when evaluating their information\nsharing standards, as well as during reviews of their collection sets. Hopefully, you have a\nCollection Management Framework and you’ve considered assessing your collection\nsources for value. I previously wrote about Threat Feed Assessments and that’s linked\nbelow. I recommend adding an assessment process that includes evaluating sources for\ncontextual value. A source that provides a thorough Description saves you time and money\nduring detection and response efforts. A source that provides a big noisy list of Observables\nwithout meaningful context is costing your organization money — even if the feed is free.\n\n\n-----\n\nIf this article was helpful or you completely disagree, either way please reach out on Twitter\nor LinkedIn to discuss. I love feedback and discussing concepts that lead to the maturity of\nthe CTI community. Until then, happy hunting.\n\n## References:\n\n Considerations for Leveraging Cyber Threat Feeds Effectively\n\n### My lessons learned and recommendations from multiple threat feed and Threat Intelligence Platform (TIP) assessments.\n\nmedium.com\n\nhttps://www.lockheedmartin.com/content/dam/lockheed-martin/rms/documents/cyber/LMWhite-Paper-Intel-Driven-Defense.pdf\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-14 - CTI is Better Served with Context- Getting better value from IOCs.pdf"
    ],
    "report_names": [
        "2020-06-14 - CTI is Better Served with Context- Getting better value from IOCs.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08c8f238-1df5-4e75-b4d8-276ebead502d",
            "created_at": "2023-01-06T13:46:39.344081Z",
            "updated_at": "2025-03-27T02:00:03.056208Z",
            "deleted_at": null,
            "main_name": "Copy-Paste",
            "aliases": [],
            "source_name": "MISPGALAXY:Copy-Paste",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536092,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653759408,
    "ts_modification_date": 1653759408,
    "files": {
        "pdf": "https://archive.orkl.eu/2fb137e1402cc7d71dcba2463a59077a5b85fa66.pdf",
        "text": "https://archive.orkl.eu/2fb137e1402cc7d71dcba2463a59077a5b85fa66.txt",
        "img": "https://archive.orkl.eu/2fb137e1402cc7d71dcba2463a59077a5b85fa66.jpg"
    }
}