{
    "id": "28e2b8bc-e0cc-418d-abf8-1b6d65d13139",
    "created_at": "2025-03-04T02:03:36.661323Z",
    "updated_at": "2025-03-27T02:17:23.641577Z",
    "deleted_at": null,
    "sha1_hash": "2a02f9e9e4b065166a08c111990f10f362621939",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-04-20T07:33:35Z",
    "file_modification_date": "2023-04-20T07:36:19Z",
    "file_size": 6276667,
    "plain_text": "**M** **A** **N** **D** **I** **A** **N** **T** **S** **P** **E** **C** **I** **A** **L** **R** **E** **P** **O** **R** **T**\n\n\n-----\n\n###### Table of Contents\n\n**Introduction** **3**\n\n**By the Numbers** **5**\nData from Mandiant Investigations 6\n\n**The Invasion of Ukraine: Cyber Operations During Wartime** **53**\nStrategic Cyber Espionage and Pre-Positioning Prior to Invasion 56\nInitial Destructive Cyber Operations and Military Invasion 57\nSustained Targeting and Attacks 60\nMaintaining Footholds for Strategic Advantage 61\nRenewed Tempo of Disruptive Attacks 62\nInformation Operations Surrounding Russia’s Invasion of Ukraine 63\nTakeaways 64\n\n**North Korea’s Financial Operations Continue to Evolve** **65**\nNFTs, Bridges, Ransomware and More: North Korean Cybercrime in 2022 67\nNot Just Money: Continued Intelligence Collection Operations in Context 69\n\n**Shifting Focus and Uncommon Techniques Brought Threat Actors Success in 2022** **71**\nInitial Intrustions 73\nGetting Around and Getting Out 74\nMaking Things Personal 76\nLessons Learned 77\n\n**Red Team Case Study: Cloud-focused Operations** **78**\nInitial Compromise 79\nLateral Movement to Azure 80\nAttacking a Password Manager Solution 81\nGaining Visibility within Azure 82\nPrivilege Escalation to Global Administrator Solution 83\nAttacking the Software Development Life Cycle (SDLC) 84\nOutcomes 85\nTargeted Attack Lifecycle Mapping 85\n\n**2022 Campaigns and Global Events** **86**\nCampaigns—Threat Actors 87\nGlobal Events—Notable Vulnerabilities 95\n\n**Notable and Recently Graduated Threat Groups** **101**\nHow a Threat Cluster Becomes an APT or FIN Group 102\nAPT42 Conducts Highly Targeted Surveillance Operations 103\n\n**Conclusion** **105**\n\n**Bibliography** **107**\n\n\n-----\n\n# Introduction\n\n\n-----\n\nThe lines separating the real world and the cyber realm have never been hazier. We’re seeing\nRussia engage in information operations in an attempt to influence the narrative surrounding\ntheir invasion of Ukraine, and attempt to disrupt critical infrastructure through both physical and\ncyber attacks. We’re seeing the invasion have an influence on the broader cybercrime ecosystem,\nnotably in Europe, where actors are choosing sides or shutting down operations altogether. And\nwe’re seeing actors engage in cybercrime to fund espionage to support the North Korean regime,\ntargeting information on topics ranging from nuclear to COVID-19.\n\nEvery day Mandiant responders are investigating and analyzing the latest attacks and threats,\nand understanding how best to respond to and mitigate them. We pass these learnings on to\nour customers through our various services, helping them to stay ahead of a constantly evolving\nthreat landscape.\n\nIn releasing our annual M-Trends report, we aim to provide some of that same critical intelligence\nto the greater security community. M-Trends 2023 continues our tradition of offering details\non the evolving cyber landscape, mitigation recommendations, and a wide variety of security\nincident-related metrics.\n\nLet’s start with answering one of the biggest questions from our “By the Numbers” section.\nThe answer is yes, attacks are being detected faster than ever before. From January 1, 2022,\nto December 31, 2022, the global median dwell time is now 16 days, down from 21 days in our\nM-Trends 2022 report. This may demonstrate an improved ability to detect attacks, but we\nalso credit ransomware attacks to be a driving factor in reducing dwell time. Intrusions\ninvolving ransomware had a median dwell time of 9 days in 2022, compared to 5 days reported\nin M-Trends 2022.\n\nThe topics of M-Trends 2023 include:\n\n**By the Numbers:** Organizations were notified of breaches by external entities in 63% of incidents\ncompared to 47% in M-Trends 2022, which brings the global detection rates closer to what\ndefenders experienced in 2014. We have many more signature metrics on targeted industries,\nattack types, threat groups, and malware use, along with new breakdowns based on trends\nand observations.\n\n**The Invasion of Ukraine:** Russia’s invasion of Ukraine has consumed almost every aspect of\nRussia's international relationships, and has evolved as nearly the sole driver of cyber threat\nactivity from Russia in 2022. We cover operations dating back to before the physical invasion in\nFebruary, including use of destructive and disruptive attacks, and information operations.\n\n**North Korean Financial Operations:** For years, North Korea has reportedly conducted various illicit\nfinancial activities to fund the regime. The explosive growth of cryptocurrency is converging with\naggressive and flexible North Korean cyber capabilities, making it natural that at least some North\nKorean threat groups would expand operations into this sector.\n\n**Shifting Focus and Uncommon Techniques: In 2022, Mandiant investigated a series of high-profile**\nintrusions that were successful and impactful to the targeted organizations despite significant\ndeviations from common threat actor behaviors, underscoring the threat posed to organizations\nby persistent adversaries willing to eschew the unspoken rules of engagement.\n\nM-Trends 2023 additionally contains a red team case study, tales of threat actors and vulnerabilities\nfrom our Campaign and Global Events team, and details from our APT42 graduation.\n\nM-Trends builds on our dedication to continue providing critical knowledge to those tasked with\ndefending organizations. The information in this report has been sanitized to protect the identities\nof victims and their data.\n\n\n-----\n\n# By the Numbers\n\n\n-----\n\n###### Data from Mandiant Investigations\n\nThe metrics reported in M-Trends 2023 are based on Mandiant Consulting\ninvestigations of targeted attack activity conducted between January 1, 2022\nand December 31, 2022. Note that this edition of M-Trends returns to a 12-month\nperiod compared to the 15-month period reported in M-Trends 2022.\n\n\n**Internal detection is when an**\norganization independently\ndiscovers it has been compromised.\n\n**External detection is when an outside**\nentity informs an organization it has\nbeen compromised.\n\n\n###### Detection by Source\n\nIn 2022, Mandiant observed a general increase in the number of organizations that\nwere alerted by an external entity of historic or ongoing compromise. Organizations\nwere notified of breaches by external entities in 63% of incidents. This continues\nthe trend observed in 2021 and brings the global detection rates closer to what\ndefenders experienced in 2014. The increase in external notification observed in\n2022 is likely impacted by Mandiant’s investigative support of cyber threat activity\nwhich targeted Ukraine and an increase in proactive notification efforts. Proactive\nnotifications from security partners enable organizations to launch response efforts\nmore effectively. Analysis of Mandiant’s efforts in Ukraine are highlighted in The\nInvasion of Ukraine: Cyber Operations During Wartime.\n\n\n###### Detection by Source, 2011-2022\n\n\n37% 33% 31% 47% 53% 62% 59% 47% 59% 53% 37%\n\n\n100\n\n90\n\n80\n\n70\n\n\n6%\n\n\n60\n\n50\n\n40\n\n30\n\n20\n\n10\n\n\n0\n2011\n\n\n94%\n\n67% 69%\n\n63%\n\n53% 53%\n\n47%\n\n41% 41%\n\n38%\n\n\n2012\n\nExternal\n\n\n2013 2014 2015 2016 2017 2018 2019 2020 2021 2022\n\nInternal\n\n\n-----\n\n###### Detection by Source by Region, 2022\n\n**AMERICAS**\n\n\n**APAC**\n\n\n**EMEA**\n\n\n80\n\n60\n\n\n80\n\n60\n\n\n80\n\n60\n\n\n40\n\n20\n\n\n40\n\n20\n\n\n40\n\n20\n\n\n0\n\n\nExternal\n\n\nInternal\n\n\n0\n\n0\n\nExternal Internal\n\nExternal Internal\n\nHistorically, Mandiant has observed relatively stable detection rates for\norganizations headquartered in the Americas. However, in 2022, organizations\nwere notified by an external entity in 55% of incidents, compared to 40% of\nincidents last year. This is the highest percentage of external notifications the\nAmericas has seen over the past six years. While organizations in the Americas\ncontinue to improve detection capabilities, external notifications from trusted\nsecurity partners remain the primary way organizations are made aware of incidents.\n\n\nIn 2022, 33% of the incidents Mandiant experts responded to in the Asia Pacific\n(APAC) region were originally identified by internal entities. However, over the past\nsix years, Mandiant has observed a trend towards greater external notifications\nin the APAC region. This year’s 9-percentage point increase in internal detections\nwhen compared to 2021 demonstrates the strong variability Mandiant has observed\nin detection source in the APAC region.\n\nOrganizations in Europe, the Middle East and Africa (EMEA) were alerted of an\nintrusion by an external entity in 74% of investigations in 2022 compared to 62%\nin 2021. This marked increase in external notifications could be explained by\nMandiant’s investigative support to Ukraine and is likely an outlier from the general\ntrend. Mandiant continues to see a shift to more external notifications in the EMEA\nregion over the past six years, however because of extenuating circumstances in\n2022, this trend may stabilize in the future.\n\n\n-----\n\n###### Detection by Source by Region, 2017–2022\n\n**AMERICAS**\n\n\n100\n\n80\n\n\n0\n\n20\n\n\n60\n\n40\n\n\n40\n\n60\n\n\n20\n\n\n80\n\n100\n\n\n0\n\n100\n\n\n2017 2018 2019 2020 2021 2022\n\nAmericas Linear\n\n\n80\n\n60\n\n\n0\n\n20\n\n\n40\n\n20\n\n\n40\n\n60\n\n\n0\n\n100\n\n\n**APAC**\n\n2017 2018 2019 2020 2021 2022\n\n\n80\n\n100\n\n\nAPAC Linear\n\n\n80\n\n60\n\n\n0\n\n20\n\n\n40\n\n20\n\n\n40\n\n60\n\n\n0\n\n\n**EMEA**\n\n2017 2018 2019 2020 2021 2022\n\n\n80\n\n100\n\n\nEMEA Linear\n\n\n-----\n\nA ransomware related intrusion\nprovides access for, or is associated\nwith, a malicious actor that has the\nprimary goal of encrypting data with\nthe intention of extracting payment\nfrom the target in order to avoid\nfurther or undo the malicious action.\n\n\nIn 2022, external notifications were more prevalent as a notification source\nregardless of the investigation type. In intrusions related to ransomware,\norganizations were notified by an external entity in 70% of investigations.\nOrganizations were predominantly notified by adversaries due to a fully\nexecuted ransomware event with 67% of investigations (8% of all investigations)\ndetected due to a ransom note. Notifications from external partners comprise\nthe remaining 33% of ransomware related investigations (4% of all investigations).\n\nSimilarly, organizations were notified by external entities of non-ransomware\nrelated intrusions more often than the organization was able to identify similar\nintrusions internally. However, Mandiant observed organizations in 2022 identify\nnon-ransomware intrusions internally more often than ransomware intrusions.\nThis may be due to increased visibility allowing organizations to detect intrusions\nearlier in the Targeted Attack Life Cycle. While non-ransomware operations often\nprioritize avoiding detection mechanisms, the longer operations cycles provides\nmore detection opportunities when compared to the relatively short cycle\nemployed by ransomware operators.\n\n\nMandiant continues to see positive collaboration between organizations and\nexternal partners that perform compromise notifications. These external parties\nprovide effective information that aids an organization’s ability to identify intrusions\nmore quickly, regardless of the investigation type.\n\n###### Detection by Source, Ransomware Investigations— by Investigation Type, 2022 External Notification Source\n\n\n80\n\n60\n\n\nAll investigations\n\n\n70%\n\n\nAdversary Notification\n\n\n61%\n\n\nExternal Partner\n\nAll investigations\n\n\n40\n\n20\n\n\n39%\n\n\n30%\n\n\n0\n\n\nExternal Internal\n\nRansomware\n\n\nNon Ransomware\n\n\n-----\n\n###### Dwell Time\n\n**Dwell time is calculated as the**\nnumber of days an attacker is present\nin a victim environment before they\nare detected. The median represents\na value at the midpoint of a data set\nsorted by magnitude.\n\n**Change in Median Dwell Time**\n## 21 16\n\nDays in 2021 Days in 2022\n\n\n###### Global Dwell Time\n\nGlobal median dwell time continued to improve year over year, with organizations\ndetecting incidents in just over two weeks in 2022. This is the shortest global\nmedian dwell time from all M-Trends reporting periods.\n\nNotable improvement in global median dwell time where an external entity was the\nnotification source may indicate that organizations respond to external notifications\nmore quickly. This reflects a growing recognition of the critical role partnerships\nand information exchange play in building a resilient cybersecurity ecosystem. As\nsecurity partners are improving the critical information contained within external\nnotifications, the improvement of information sharing will enable organizations\nto act more effectively than if left to identify similar intrusions on their own.\n\nDefenders continue to detect events faster than external entities notify. The\nglobal median dwell time for internally detected incidents in 2022 returned to\nsimilar timeframes defenders saw in 2020. In 2022, the global median dwell time for\nintrusions detected internally was 13 days. The global median dwell time was 18 days\nin 2021 and 12 days in 2020.\n\nSimilarly, Mandiant experts observed another significant decrease in the global\nmedian dwell time for investigations with an external notification source in 2022,\ndown 32% compared to 2021. External notifications allowed for organizations to\ninitiate response to intrusions within a median of 19 days of the initial compromise.\n\nImprovements in global median dwell time in 2022, regardless of detection source,\nenabled organizations to respond to incidents faster than ever before.\n\n\n###### Global Median Dwell Time, 2011-2022\n\n|Col1|2011|2012|2013|2014|2015|2016|2017|2018|2019|2020|2021|2022|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|\n|All|416|243|229|205|146|99|101|78|56|24|21|16|\n|External|—|—|—|—|320|107|186|184|141|73|28|19|\n|Internal|—|—|—|—|56|80|57.5|50.5|30|12|18|13|\n\n\n-----\n\n###### Global Dwell Time Distribution\n\n\nGlobal dwell time distribution continues to improve. 42% of intrusions were detected\nwithin a week or less, compared to 37% of intrusions in the last reporting period.\nCompared to previous years, Mandiant saw more evenly dispersed dwell times\nacross investigations in 2022. Continuing trends from the last M-Trends reporting\nperiod, this could indicate that detection is becoming more streamlined and\ndetection abilities have improved to highlight actions in the environment during\nthe initial infection or the reconnaissance phases of the Targeted Attack Lifecycle.\n\nHowever, as Mandiant continues to see a wider distribution for non-ransomware\nrelated investigations, organizations are still facing intrusions that go undetected for\nextensive periods of time. Variance in the detection capabilities of impacted\norganizations and the types of intrusions they face are likely contributors to this\ndistribution spread.\n\n###### Global Dwell Time Distribution, 2018-2022\n\n\n50\n\n40\n\n\n30\n\n20\n\n\n10\n\n0\n\n\nDwell Time (Days)\n\n2018 2019 2020 2021 2022\n\n\n-----\n\n**Change in Global Investigations**\n**Involving Ransomware**\n## 23% 18%\n\nin 2021 in 2022\n\n**Change in Global Median**\n**Dwell Time – Ransomware**\n\n\n###### Investigations Involving Ransomware\n\nMandiant experts note a decrease in the percentage of global intrusions involving\nransomware between 2021 and 2022. In 2022, 18% of intrusions involved ransomware\ncompared to 23% in 2021. Ransomware attacks continue to be a driving factor in\na reduced dwell time. Intrusions involving ransomware had a median dwell time\nof 9 days in 2022, compared to 5 days in 2021. Mandiant observed that in instances\nwhere external entities are making the notification, the global median dwell time\nfor intrusions involving ransomware was 7 days compared to 12 days when an\norganization detected the intrusion internally. Mandiant observed that adversaries\nleveraging ransomware remained undetected for longer periods of time in 2022\ncompared to 2021.\n\n\n## 5 9\n\nDays in 2021 Days in 2022\n\n**Change in Global Median**\n**Dwell Time—Non-Ransomware**\n## 36 17\n\nDays in 2021 Days in 2022\n\n\n###### Global Dwell Time by Investigation Type, 2022\n\n0\n\n\n10\n\n\n20\n\n30\n\n\n###### Global Median Dwell  Time by Detection Source\n\n30\n\n\n40\n\n50\n\n\n27\n\n\n60\n\n70\n\n\n25\n\n20\n\n\n15\n\n10\n\n\n7 Days 7 Days\n\nMedian Median Median\n\n14\n###### 16 14 7 Days 17\n\nDays Days[9] Days\n\n14\n\n30\n\n30\n\n30\n\n90\n\n90\n\n150\n\n150 200\n\n200\n\n400\n\n400\n\n700\n700 90\n\n150\n\nAll Investigations Ransomware Non-Ransomware\nInvestigations Investigations\n\n\n13\n12\n\n\n80\n\n\n7\n\n\n90\n\n100\n\n\n5\n\n0\n\n\nExternal Internal\n\nRansomware\n\n\nNon-Ransomware\n\n\n-----\n\n###### Americas\n\n**Change in Americas**\n**Median Dwell Time**\n## 17 10\n\nDays in 2021 Days in 2022\n\n\n###### Americas Median Dwell Time\n\nThe median dwell time for intrusions investigated in the Americas decreased\nby a full week in 2022 to 10 days compared to 17 days in 2021 and 2020. Mandiant\nobserved consistent median dwell times for all detection types in the Americas,\nwith internal detections decreasing to 9 days and external detections at its lowest\nwith 12 days. Organizations in the Americas demonstrated another year of\nimprovement for detecting adversaries faster than previous years, quicker\nthan the previously smallest timeframe of 17 days observed in 2021.\n\n\n###### Americas Median Dwell Time, 2016-2022\n\n**AMERICAS**\n\n\n160\n\n140\n\n120\n\n100\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n137.5\n\n\n104\n\n\n99\n\n\n104\n\n\n75.5\n\n\n124.5\n\n42.5\n\n\n71\n\n\n60\n\n\n46\n\n\n49\n\n\n35\n\n\n32\n\n\n17\n\n\n9 17 15 18 10 12 9\n\n\n2016 2017 2018 2019 2020 2021 2022\n\nAll External Internal\n\n\n-----\n\n###### Americas Dwell Time Distribution\n\n\nIn the Americas, 64% of intrusions were detected in 30 days or less and 70% of these\nintrusions (45% of total intrusions in the Americas) were detected in less than one\nweek. In 2022, more than half of the intrusions in the Americas were detected in less\nthan two weeks. However, Mandiant observed a small uptick in intrusions that go\nundetected for longer periods of time, with 7% of total intrusions in the Americas\nremaining undetected for more than a year. This is an increase from 4% observed\nin the reporting period of M-Trends 2022. This shows that while organizations in\nthe Americas were able to detect most intrusions within two weeks, due to detection\nimprovements, they identified intrusions by adversaries that would have otherwise\nremained undetected for longer.\n\n###### Americas Dwell Time Distribution, 2021-2022\n\n\n50\n\n40\n\n\n30\n\n20\n\n\n10\n\n0\n\n\nDwell Time (Days)\n\n\n2021 2022\n\n\n-----\n\n**Change in Americas Investigations**\n**Involving Ransomware**\n## 22% 22%\n\nin 2021 in 2022\n\n**Change in Americas Median**\n**Dwell Time – Ransomware**\n## 5 5\n\nDays in 2021 Days in 2022\n\n\nAlthough the percentage of intrusions involving ransomware has decreased\nglobally, Mandiant observed a consistent percentage of investigations in the\nAmericas involving ransomware compared to last year. Similarly, ransomware\ndwell time continues to remain the same in the Americas region. Mandiant noted\nthat these investigations have similar median dwell times regardless of internal or\nexternal detection source, with five days median dwell time for internally notified\ninvestigations, and six days when external entities make the notification. Mandiant\ncontinues to observe improvements in external notifications for non-ransomware\nrelated intrusions. In 2022 organizations in the Americas detected intrusions that\ndid not relate to ransomware in 12 days, compared to 17 days in 2021.\n\n###### Americas Dwell Time Investigation by Type, 2022\n\n\n**Change in Americas Median**\n**Dwell Time – Non-Ransomware**\n## 17 12\n\nDays in 2021 Days in 2022\n\n###### Americas Median Dwell  Time by Detection Source\n\n\n0\n\n10\n\n\n20\n\n30\n\n\n40\n\n50\n\n\n7 Days\n\n\n30\n\n25\n\n\n60\n\n70\n\n\n20\n\n15\n\n\n80\n\n\n10\n\n5\n\n\n21\n\n6\n5\n\n\n9\n\n\n90\n\n100\n\n\n0\n\n\nExternal Internal\n\nRansomware\n\n\nAll Investigations Ransomware Non-Ransomware\nInvestigations Investigations\n\n\nNon-Ransomware\n\n\n-----\n\n###### APAC\n\n**Change in APAC**\n**Median Dwell Time**\n## 21 33\n\nDays in 2021 Days in 2022\n\n\n###### APAC Median Dwell Time\n\nOverall, median dwell time in APAC increased compared to the last M-Trends\nreporting period. However, organizations in APAC are still detecting intrusions\nmore quickly than in previous years, with a median dwell time of 19 days for intrusions\nidentified internally compared to 22 days in 2021. Organizations in APAC have\nconsistently improved internal detection capabilities over the past three years.\n\nNotifications from external entities resulted in a median dwell time of 58 days in 2022\ncompared to 16 days in 2021. While this represents an increase in median dwell time,\nit is still a 58% decrease compared to external notification median dwell time in 2020\nwhich was 137 days. The increase to 58 days is likely a result of the median dwell time\nnumbers normalizing from an abnormally short period of time observed in 2021.\n\n\n###### APAC Median Dwell Time, 2016-2022\n\n1200\n\n\n**APAC**\n\n\n1088\n\n\n1000\n\n800\n\n\n600\n\n400\n\n\n320.5\n\n\n498\n\n\n262\n\n\n131 137\n\n54 76\n18\n\n\n200\n\n0\n\n\n172\n\n\n204\n158\n\n\n33 21 16 22 33 58 19\n\n\n2016 2017 2018 2019 2020 2021 2022\n\nAll External Internal\n\n\n-----\n\n###### APAC Dwell Time Distribution\n\nAPAC dwell time distribution continues to show variability. Dwell time distribution\nshows 48% of APAC investigations had dwell times of 30 days or less with 76% of\nthese intrusions (37% of all APAC intrusions) detected in one week or less. On the\nother side of the dwell time distribution, APAC organizations had a wider distribution\nof intrusions go undetected for longer periods of time, with 30% of investigations\nremaining undetected for a year or longer compared to 20% of investigations in 2021.\n\n\nCyber security continues to mature in APAC with ongoing detection capability\nimprovements. This allows organizations to identify intrusions that would have\notherwise gone long undetected, resulting in a wider distribution of intrusions.\n\n###### APAC Dwell Time Distribution, 2021-2022\n\n\n40\n\n35\n\n\n30\n\n25\n\n\n20\n\n15\n\n\n10\n\n5\n\n\n0\n\n\nDwell Time (Days)\n\n\n2021 2022\n\n\n-----\n\n**Change in APAC Investigations**\n**Involving Ransomware**\n## 38% 32%\n\nin 2021 in 2022\n\n**Change in APAC Median Dwell**\n**Time – Ransomware**\n## 9 18\n\nDays in 2021 Days in 2022\n\n\nSimilar to the observed decrease in global investigations involving ransomware,\nAPAC saw a 6-percentage point decrease in ransomware investigations, with 32%\nin 2022 compared to 38% in 2021. This number is still almost double the percentage\nof investigations from 2020 (12.5%) and 2019 (18%).\n\nThe median dwell time for ransomware investigations in APAC was 18 days compared\nto 60 days for non-ransomware investigations. Organizations in APAC are quicker to\ndetect incidents internally than externally, regardless of the type of investigation.\nHowever, the timeframe observed with relation to ransomware median dwell time\ndoes significantly impact dwell time as a whole.\n\n\n###### APAC Dwell Time by Investigation Type, 2022\n\n0\n\n\n**Change in APAC Median Dwell**\n**Time – Non-Ransomware**\n## 38 60\n\nDays in 2021 Days in 2022\n\n###### APAC Median Dwell  Time by Detection Source\n\n\n10\n\n\n20\n\n30\n\n\n14 Days\n\n\n40\n\n50\n\n\n60\n\n70\n\n\n90\n\n75\n\n\n90\n\n\n60\n\n45\n\n\n54\n\n\n80\n\n\n30\n\n15\n\n\n23\n\n\n90\n\n100\n\n\n5\n\n\nAll Investigations Ransomware Non-Ransomware\nInvestigations Investigations\n\n\n0\n\n\nExternal Internal\n\nRansomware\n\n\nNon-Ransomware\n\n\n-----\n\n###### EMEA\n\n**Change in EMEA**\n**Median Dwell Time**\n## 48 20\n\nDays in 2021 Days in 2022\n\n\n###### EMEA Median Dwell Time\n\nOrganizations in EMEA detected incidents 58% faster in 2022 compared to 2021, with\nthe overall median dwell time now less than three weeks. Looking closer at detection\nsources, median dwell time for intrusions that were detected by an internal source\nincreased from 13 days seen in 2021 to 33 days in 2022. External notification sources\ndecreased from 60 days seen in 2021 to 18 days in 2022. This large change may be\ninfluenced by Mandiant’s work in Ukraine, which makes up a notable portion EMEA\ninvestigations in 2022. However, even outside of this work, the general trend shows\nthat median dwell time continues to decrease year over year.\n\n\n###### EMEA Median Dwell Time, 2016-2022\n\n500\n\n450\n\n400\n\n350\n\n300\n\n250\n\n200\n\n150\n\n100\n\n\n83\n\n\n**EMEA**\n\n\n474\n\n\n305\n\n\n225\n\n\n301\n\n61 54\n23\n\n\n175\n\n\n177\n\n\n128\n106\n\n\n66\n\n\n60\n48\n29 13 20 18 33\n\n\n50\n\n0\n\n\n24.5\n\n\n2016 2017 2018 2019 2020 2021 2022\n\nAll External Internal\n\n\n-----\n\n###### EMEA Dwell Time Distribution\n\n\nDwell time distribution in EMEA showed that 54% of intrusions investigated by\nMandiant were identified within 30 days, with 76% of those intrusions (42% of\ntotal EMEA investigations) identified within a week. Organizations in EMEA showed\nimprovement detecting a majority of incidents more quickly. However, the general\ndistribution of intrusions remains consistent with 2021 with 23% of intrusions being\nidentified after a year of initial intrusion.\n\n###### EMEA Dwell Time Distribution, 2021-2022\n\n\n50\n\n40\n\n\n30\n\n20\n\n\n10\n\n0\n\n\nDwell Time (Days)\n\n\n2021 2022\n\n\n-----\n\n**Change in EMEA Investigations**\n**Involving Ransomware**\n## 17% 7%\n\nin 2021 in 2022\n\n**Change in EMEA Median Dwell**\n**Time – Ransomware**\n## 4 33\n\nDays in 2021 Days in 2022\n\n\nIn 2022, Mandiant saw a 10-percentage point decline in EMEA investigations related\nto ransomware. Additionally, Mandiant noted an increase in the median dwell time\nfor ransomware specific investigations in EMEA to 33 days in 2022, up from just four\ndays in 2021. This means that, in 2022, adversaries leveraging ransomware against\norganizations in EMEA spent 89% longer in compromised environments before being\ndetected. However, the median dwell time for ransomware related investigations\nin EMEA in 2021 was exceptionally short, making it unsurprising that this metric\nreverted in 2022. Organizations were notified by an external entity of a ransomware\nevent faster than they were able to detect the event internally in 2022. Organizations\nin EMEA were notified by an external entity within 30 days of ransomware related\nintrusions however, when similar intrusions were identified internally, adversaries\nremained undetected for 51 days.\n\nMandiant did see a significant improvement in non-ransomware dwell time.\nOrganizations in EMEA detected non-ransomware intrusions nearly two thirds\nquicker, with the median dwell time at 19 days in 2022 compared to 60 days in 2021.\n\n\n**Change in EMEA Median Dwell**\n**Time – Non-Ransomware**\n## 60 19\n\nDays in 2021 Days in 2022\n\n###### EMEA Median Dwell  Time by Detection Source\n\n\n###### EMEA Dwell Time Investigation by Type, 2022\n\n0\n\n\n10\n\n\n20\n\n30\n\n\n60\n\n50\n\n\n40\n\n50\n\n\n40\n\n30\n\n\n30\n\n\n51\n\n19 19\n\n\n60\n\n70\n\n\n20\n\n10\n\n\n80\n\n\n7 Days\n7 Days\n\nMedian Median Median\n\n14\n###### 20 33 19 14\n\nDays 30 Days Days 30\n\n90\n\n90\n\n150\n\n150\n\n200\n\n200\n\n400\n\n400\n\n90\n\n700\n\n700\n\n200\n\nAll Investigations Ransomware Non-Ransomware\n\n\n0\n\n\nExternal Internal\n\nRansomware\n\n\n90\n\n100\n\n\nNon-Ransomware\n\n\n-----\n\n###### Industry Targeting\n\nOf the intrusions investigated by Mandiant in 2022, response efforts for government\nrelated organizations captured a quarter of all investigations. Compared to 9%\nin 2021, this primarily reflects the extensive work Mandiant has done in support\nof Ukraine. The next four most targeted industries from 2022 are consistent with\nwhat Mandiant experts observed in 2021. Mandiant observed business/professional\nservices, financial, high tech and healthcare industries to be favored by adversaries.\nThese industries remain attractive targets for both financially and espionage\nmotivated actors.\n\n###### Global Industries Targeted, 2022\n\n**INDUSTRY** Percent of Investigations\n\n\nGovernment\n\nBusiness and Professional\n\nFinancial\n\nHigh Tech\n\nHealthcare\n\nRetail and Hospitality\n\nEntertainment and Media\n\nConstruction and Engineers\n\nTelecommunications\n\nTransportation and Logistics\n\nEducation\n\nUtilities\n\nNonprofit\n\nEnergy\n\n\n**25%**\n\n**14%**\n\n**12%**\n\n**9%**\n\n**9%**\n\n**6%**\n\n**5%**\n\n**5%**\n\n**4%**\n\n**3%**\n\n**2%**\n\n**2%**\n\n**1%**\n\n**1%**\n\n0 5 10 15 20 25\n\n\n-----\n\n###### Targeted Attacks\n\n Initial Infection Vector\n\nExploits continued to be the most leveraged initial infection vector used by\nadversaries in Mandiant investigations conducted in 2022. In intrusions where\nthe initial infection vector was identified, 32% of intrusions began with an exploit.\nWhile this was a decrease from the 37% of intrusions identified in the reporting\nperiod of M-Trends 2022, exploits remained a critical tool for adversaries to use\nagainst their targets.\n\nIn 2022, phishing returned to the second most utilized vector for initial infection\nobserved in intrusions, representing 22% of intrusions where the initial infection\nvector was identified. This was an increase from 12% of intrusions seen in 2021.\nPhishing continues to be a lucrative and mainstay vector for adversaries year\nover year.\n\nAdversaries leveraged stolen credentials more often in 2022 than 2021 in\ninvestigations where the initial infection vector was identified, at 14% and 9%\nrespectively. Mandiant investigations uncovered an increased prevalence in both\nthe use of widespread information stealer malware and credential purchasing in\n2022 when compared to previous years. In many cases, investigations identified\nthat credentials were likely stolen outside of the organization’s environment and\nthen used against the organization, potentially due to reused passwords or use\nof personal accounts on corporate devices.\n\n###### Initial Infection Vector (when identified)\n\n2%\n\n2%\n2%\n\n4%\n\n4% Exploit\n\n32% Phishing\n\n7%\n\nStolen Credentials\n\nPrior Compromise\n\nWebsite Compromise\n\nBrute Force\n\n12%\n\nThird Party Compromise\n\nInternet Facing Servers\n\nBYOD\n\n\n14%\n\n\nOther\n\n\n22%\n\n\n-----\n\n###### Most Prevalent Initial Intrusion Vector by Region\n\n**EMEA**\nPhishing\n40%\n\n**Americas**\nExploit\n38%\n\n**APAC**\nPrior Compromise\n33%\n\nRegionally, adversaries made use of various vectors to gain access to targeted\norganizations and complete their missions. In the Americas, in intrusions where\ninitial infection vectors were identified, the use of exploits remained the most\nleveraged vector at 38% of investigations. Adversaries targeting organizations in\nAPAC used access from a prior compromise to perform their intrusions more often\nthan other vectors by more than 10-percentage points. In EMEA, phishing was\nleveraged by adversaries in 40% of investigations where an intrusion vector was\nidentified. This variety of vectors used across regions likely indicates that\nadversaries are not leveraging the same attack paths to accomplish their missions.\nAdversaries continue to leverage the intrusion vector that is the most effective\nto gain access to their targets that reside in each region.\n\n\n-----\n\n###### Adversary Operations\n\n Ransomware\n\n\n###### Financial Gain\n\n\n###### Financial Gain\n\n## 30% 26%\n\nin 2021 in 2022\n\n\nMandiant investigations where an adversary was identified\nseeking financial gain decreased in 2022. However,\nfinancially motivated intrusions still comprised over\na quarter of intrusions investigated by Mandiant. Of Mandiant\ninvestigations in 2022, 26% of intrusions surfaced adversaries\nseeking monetary gain through extortion, ransomware, sold\naccess, illicit transfers, or payment card theft.\n\nCompared to the reporting period of M-Trends 2022,\nransomware related investigations conducted by Mandiant\ndecreased by 5-percentage points. In 2022, 18% of all\nMandiant investigations were related to ransomware.\nThis represents the smallest percentage of Mandiant\ninvestigations related to ransomware since prior to 2020.\n\n\n###### Financial Gain, 2020-2022\n\n100\n\n\n80\n\n60\n\n\n40\n\n20\n\n\n0\n2020 2021 2022\n\nFinancial Gain No Financial Gain\n\n\n-----\n\n###### Extortion\n\n Data Theft\n\n\n###### Data Theft\n\n## 29% 40%\n\nin 2021 in 2022\n\n\nMandiant experts identified that in 40% of intrusions in 2022,\nadversaries prioritized data theft. Mandiant defenders have\nobserved threat actors attempting to steal, or successfully\ncompleting data theft operations, more often in 2022\ncompared to previous years. In 19% of those intrusions (8%\nof all intrusions) the data stolen was used by the threat actor\nduring negotiations for payment. Mandiant continues to\nobserve threat actors performing data theft operations\nfor numerous goals. However, adversaries were observed\nprioritizing data theft that likely indicates intellectual property\ntheft or espionage related end goals in 22% of investigations.\nThe continued increase of observed data theft likely indicates\nthat organizations are improving their ability to detect data\ntheft operations, allowing investigators to conduct more\ncomplete investigations.\n\n###### Data Theft Observed, 2020-2022\n\n\n50\n\n40\n\n\n30\n\n20\n\n\n10\n\n0\n\n\n2020 2021 2022\n\nData Theft Linear (Data Theft)\n\n\n-----\n\n**Compromised Architecture**\n## 4% 6%\n\nin 2021 in 2022\n\n\n###### Modus Operandi\n\nMandiant experts continue to see a small uptick in the occurrence of opportunistic\ncompromise being leveraged as a source of targeted attack activity. Campaigns\nof broad scale non-targeted activity have, in some cases, translated into targeted\nattack activity as access to compromised environments is sold to targeted threat\nactors or critical information gathered during the attack is leveraged to accomplish\nthe goals of targeted attackers.\n\nIn 2022, Mandiant experts identified this activity in 6% of intrusions compared to 4%\nin 2021 and 3% in 2020. As the use of exploits continues to rise, it is no surprise that\nuse of compromised architecture is also increasing. As proof of concept (POC) code\nis made available for newly identified exploits, the ability to automate compromise\nincreases. This shorter cycle from POC to widespread attack allows actors to gain\nquick wins which in turn provide necessary infrastructure for additional nontargeted attacks.\n\nOf the Mandiant investigations where compromised architecture was observed,\nroughly 60% of the intrusions resulted in some type of crypto-mining activity. In the\nremaining nearly 40% of these intrusions, the architecture was leveraged for\nactions, including ongoing spam and/or phishing operations, as well as to further the\ndistribution of botnets. Similar to previous years, intrusions related to insider threats\nmade up 1% of Mandiant investigations in 2022.\n\n\n-----\n\n###### Exploit Activity in 2022\n\nAdversaries are still making use of exploits to conduct their operations. Mandiant\nobserved evidence of successful exploit activity of at least one exploit against a\nvulnerability in 36% of investigations in 2022 compared to 30% of investigations\nfrom 2021. Mandiant continues to observe adversaries leveraging exploits to initiate\nand continue intrusions. Perimeter devices that are accessible via the internet including firewalls, virtualization solutions and virtual private network devices remain a highly sought after target for attackers.\n\n\nAcross all investigations where a vulnerability was targeted, abuse of the Log4j[1]\nvulnerability represented 16% of investigations. The second and third most notable\nvulnerabilities identified were related to F5 Big-IP[2] and VMware Workspace ONE\nAccess and Identity Manager[3].\n\n###### Exploit Activity When Identified\n\n\n100\n\n80\n\n\n60\n\n40\n\n\nOther\n\nCVE-2022-22954\n\n\n20\n\n0\n2021 2022\n\n\nCVE-2022-1388\n\nCVE-2021-44228\n\n\nInvolved Exploits Did Not Involve Exploits\n\n\n-----\n\n**Multiple Threat Groups Identified**\n**(per environment)**\n## 25% 27%\n\nin 2021 in 2022\n\n\n###### Environment\n\nIn more than a quarter of investigations, Mandiant experts identified multiple\nthreat groups within the same environment. During these investigations, Mandiant\nobserved threat groups working together to accomplish a central goal as well\nas instances where the target environment was enticing to multiple threat actors\nindependently. The percentage of investigations where multiple threat actors were\nidentified in 2022 increased to a similar percentage that was observed in 2020. This\ntrend remains volatile, however Mandiant has observed a general rise in multiple\nthreat groups identified in the same environment over the past four years.\n\n\n###### Multiple Threat Groups Identified\n\n35\n\n\n30\n\n25\n\n\n20\n\n15\n\n\n10\n\n5\n\n\n0\n\n\n2019 2020 2021 2022\n\nMultiple Threat Groups Linear (Multiple Threat Groups)\n\n\n-----\n\n###### Threat Groups\n\n913\n\n265\n\n343\n\nNewly Tracked Threat Groups\n\nNewly Tracked and Observed Threat Groups\n\nObserved Threat Groups\n\n###### Threat Groups 2022\n\n\nMandiant tracks more than 3500 threat groups, including 900+\nnewly tracked threat groups in this M-Trends reporting period.\nOf the newly tracked groups, 265 threat groups were first\nidentified during Mandiant investigations in 2022. Mandiant\nidentified a total of 343 unique threat groups across all intrusions\nin 2022. Organizations faced intrusions by four named Advanced\nPersistent Threat (APT) groups. This includes government\nsponsored groups from China and Russia, five named financially\nmotivated threat (FIN) groups, and 335 uncategorized threat (UNC)\ngroups. Overall, organizations are still facing and responding to\nwell-established threat groups while also contending with newly\nattributed groups.\n\nActive FIN Groups\nFrom These Geolocations\n\n- Eastern Europe\n\n###### 4\n\nActive APT\nGroups From\nThese\nNation-States\n\n                                - China\n\n###### 4 • Russia\nActive APT\nGroups\n\n**FIN** **41[*]**\n\nAPT Groups\n(1 Graduated)\n\n###### 3500+\nTotal Groups *Mandiant tracks Advanced Persistent Threat (APT)\n\ngroups 0-42. Over the years, APT 11 and APT 13 were\nmerged into other groups and subsequently deprecated\nresulting in 41 APT groups actively tracked by Mandiant.\n\n\n-----\n\n###### Observed Threat Groups by Goal, 2022\n\n50\n\n\n**Destructive Operations - The threat**\ngroup's assessed goal is to destroy or\ndamage a target’s infrastructure, such\nas DDoS or a destructive ICS attack.\n\n**Hacktivism - The threat group's**\nassessed goal is defamation, to obtain\npress, and/or to influence policy.\n\n\n20\n\n10\n\n\n40\n\n30\n\n\n**Nuisance - The threat group's assessed**\ngoal is to obtain access and propagate\nthrough the victim environment such\nas botnets and spam.\n\n\n0\nFinancial Gain Unknown Espionage Other\n\nThese threat groups are clusters of cyber activity that include artifacts such as\nadversary infrastructure, tools, and tradecraft. When a threat grouping is first\ncreated, Mandiant assesses a primary goal for the group. As our knowledge of\na threat grouping becomes sufficiently mature, in-depth research aids in assigning\na formal designation based on established Mandiant naming conventions.\n\nOf all threat groups observed in 2022, Mandiant assessed that 48% of these\nthreat groups to have financially motivated operations, 18% with espionage related\nmotivations and 9% with other motivations like, destructive operations, hacktivism,\nand being a nuisance. In the remaining 27% of threat groups, the motivation was not\nable to be assessed. This is often because the adversary was detected before they\nwere able to complete their mission or direct evidence was not uncovered to\nestablish a credible goal.\n\n\n-----\n\nOf the active groups in 2022, 335 of the threat groups, which Mandiant tracks as\nuncategorized (UNC) groups, were observed in intrusions. Mandiant assesses that\n44% of these threat groups were motivated by financial gain and 12% were motivated\nby espionage related actions. Notably, these UNC groups can have more than one\nmotivation. In order to continuously refine our understanding of these threat groups\nand their activity, Mandiant continuously analyzes adversary actions from frontline\ninvestigations in order to generate and integrate actionable intelligence across all\nMandiant products and services. Through this work, as well as analysis of public\nreporting, information sharing and other research, Mandiant continues to expand\nits threat actor knowledge base through continuous clustering and merging.\n\n###### Observed Threat Groups by Goal, 2022\n\n\n50\n\n40\n\n\n30\n\n20\n\n\n10\n\n7%\n\n0\nFinancial Gain Unknown Espionage Other\n\n\nIn 2022, Mandiant graduated one group to a named\nthreat group, APT42, and merged 202 threat groups\ninto other threat groups based on extensive research\ninto activity overlaps. For details on how Mandiant defines\nand references UNC groups and merges, please see\n“How Mandiant Tracks Uncategorized Threat Actors.[4\"]\n\n\n-----\n\n###### Malware\n\nA malware family is a program or set\nof associated programs with sufficient\n“code overlap” among the members\nthat Mandiant considers them to be the\nsame thing, a “family”. The term family\nbroadens the scope of a single piece\nof malware as it can be altered over\ntime, which in turn creates new, but\nfundamentally overlapping pieces of\nmalware.\n\n\nIn 2022, Mandiant began tracking 588 new malware families to increase its\nknowledge base of malware. Compared to the 700+ newly tracked malware reported\nin the reporting period for M-Trends 2022 which covers 15 months, Mandiant’s\nnewly tracked malware equates to roughly 49 new malware families identified each\nmonth in 2022, compared to 45 new families a month in 2021. This may indicate that\nadversaries are continuing to expand their toolsets at a similar rate compared\nto previous years.\n\nOf these new malware families, 157 families were observed in intrusions investigated\nby Mandiant. This represents a little less than half of the total number of malware\nfamilies, 321, seen in Mandiant investigations. This indicates that while adversaries\ncontinue to deploy new tools, previously observed malware families still make up\na significant portion of their arsenal.\n\n588\n\n157\n\n321\n\nNewly Tracked Malware Families\n\nNewly Tracked and Observed Malware Families\n\nObserved Malware Families\n\n\n-----\n\nA malware category describes a\nmalware family’s primary purpose.\nEach malware family is assigned only\none category that best describes\nits primary purpose, regardless\nof functionality for more than\none category.\n\n\n###### New Malware Families by Category\n\nOf the 588 newly tracked malware families, the top five categories consisted of\nbackdoors (34%), downloaders (14%), droppers (11%), ransomware (7%) and launchers\n(5%). These categories of malware remain consistent over the years and backdoors\ncontinue to represent slightly over one third of the newly tracked malware families.\nNewly tracked credential stealers fell out of the top five categories tracked by\nMandiant in 2022. Considering that stolen credentials appeared for the first time in\nthe most frequently seen intrusion vectors, this seems to suggest that threat actors\nare leveraging previously created credential stealers to obtain stolen credentials.\n\n\n**Malware Category** **Primary Purpose**\n\n**Backdoor** A program whose primary purpose is to allow a threat actor\nto interactively issue commands to the system on which\nit is installed.\n\n**Credential Stealer** A utility whose primary purpose is to access, copy or steal\nauthentication credentials.\n\n**Downloader** A program whose sole purpose is to download (and perhaps\nlaunch) a file from a specified address, and which does not\nprovide any additional functionality or support any other\ninteractive commands.\n\n**Dropper** A program whose primary purpose is to extract, install and\npotentially launch or execute one or more files.\n\n**Launcher** A program whose primary purpose is to launch one or more\nfiles. Differs from a dropper or an installer in that it does not\ncontain or configure the file, but merely executes or loads it.\n\n**Ransomware** A program whose primary purpose is to perform some\nmalicious action (such as encrypting data), with the goal\nof extracting payment from the victim in order to avoid\nor undo the malicious action.\n\n**Tunneler** A program that proxies or tunnels network traffic.\n\n**Other** Includes all other malware categories such as utilities,\nkeyloggers, point-of-sale (POS), tunnelers and data miners.\n\n\n-----\n\nAn observed malware family is a\nmalware family identified during an\ninvestigation by Mandiant experts\n\n\n###### Newly Tracked Malware Families by Category, 2022\n\n29%\n\n34% Backdoor\n\nDownloader\n\nDropper\n\nRansomware\n\nLauncher\n\n5% Other\n\n7%\n\n14%\n11%\n\n###### Observed Malware Families by Category\n\nMandiant experts observed 321 unique malware families in intrusions over the\ncourse of 2022. Backdoors remain a mainstay for threat groups, with threat\nactors using malware with backdoor capabilities in 33% of Mandiant investigations.\nComparatively to 2021, this is a 7-percentage point decrease, however malware\nfamilies with backdoor capabilities are still observed in vastly more investigations\nthan the next most seen capability type. The next categories show a small variance\nin order compared to 2021, with downloaders (10%), ransomware (10%), droppers (9%)\nand launchers (5%) to round out the top five.\n\n###### Observed Malware Families by Category, 2022\n\n28%\n\n33% Backdoor\n\nDownloader\n\nDropper\n\nRansomware\n\nLauncher\n\n5%\n\nOther\n\n\n-----\n\n###### Backdoors\n### 40% 33%\n\nin 2021 in 2022\n\n###### Ransomware\n### 10% 10%\n\nin 2021 in 2022\n\n\n###### Launcher\n### 4% 5%\n\nin 2021 in 2022\n\n###### Other\n### 22% 28%\n\nin 2021 in 2022\n\n\nUsage of unique ransomware families in investigations between 2021 and 2022\nremained relatively stable. While the percentage of ransomware intrusions has\ndecreased, adversaries are still leveraging similar percentages of distinct\nransomware malware families to carry out their missions for financial gain.\n\nThe use of unique downloaders increased 3-percentage points in 2022 from the 7%\nof investigations observed in 2021. Meanwhile, the use of unique droppers decreased\nby the same amount, from 12% observed in 2021 to 9% observed in 2022. The use of\nunique malware that provide tunneling capabilities which increased from 4% could\nlikely also be a contributing factor to the decrease in unique droppers and backdoors\nacross missions.\n\nNotably, credential stealers fall off the top five observed malware families by\ncategory list in 2022, despite the use of stolen credentials appearing in the initial\ninfection vector top five. However, Mandiant observed an explosion of credential\nand information stealer type malware, such as REDLINESTEALER, VIDAR and\nRECORDSTEALER to name a few delivered through abuse of search engine\noptimization (SEO) and malicious advertisements. Mandiant also observed\nthat the usage of other types of malware may indicate that adversaries are\nbecoming more flexible with tooling to accomplish missions.\n\n\n**RECORDSTEALER, aka Raccoon Stealer V2 (Sekoia), Record Stealer**\n(AhnLab), and RecordBreaker (Proofpoint), is a credential stealer written\nin C with the capability to obtain sensitive data from common web\nbrowsers, crypto wallets and be configured as a downloader.\n\n**REDLINESTEALER, aka RedLine (Minerva Labs and Proofpoint), and**\nRedlinestealer (Fortinet), is a credential stealer malware that is capable\nof stealing credentials from web browsers, files, FTP applications\nand cryptocurrency wallets. It also collects extensive system survey\ninformation such as the basic hardware specifications, desktop\nscreenshot, username, OS, language, geographic location, installed\nsoftware, process listing and Global IP address. The malware can download\nand launch additional payloads or launch a hidden command shell for the\nattacker. Redline Stealer has been advertised for sale on hacking forums.\n\n**VIDAR, aka Mosaicloader (Bitdefender), is a data miner written in C++**\nthat targets data from multiple web browsers, cryptocurrency wallets,\nchat software, the Authy two-factor authentication utility, and various\nother applications. Collected data is compressed and uploaded to a\nremote server using HTTP. VIDAR appears to be based on a similar data\nminer named ARKEI.\n\n\n###### Downloaders\n### 7% 10%\n\nin 2021 in 2022\n\n###### Dropper\n### 12% 9%\n\nin 2021 in 2022\n\n\n###### Tunneler\n### 4% 5%\n\nin 2021 in 2022\n\n\n-----\n\nA publicly available tool or code\n**family is readily obtainable without**\nrestriction. This includes tools that\nare freely available on the Internet,\nas well as tools that are sold or\npurchased, as long as they can\nbe purchased by any buyer.\n\nA non-public tool or code family\nis, to the best of our knowledge,\nnot publicly available (either for free\nor for sale). They may include tools\nthat are privately developed, held or\nused, as well as tools that are shared\namong or sold to a restricted set\nof customers.\n\n\n###### Malware by Availability\n\nAvailability of both newly tracked and observed malware families remains consistent\nyear over year. In both categories, malware families were more often privately\ndeveloped or had restricted availability. Mandiant noted that 29% of malware\nfamilies used during an intrusion were publicly available, which is a 1-percentage\npoint increase from 28% in 2021. While adversaries continue to make use of a wide\nvariety of non-publicly available malware and develop malware to achieve their\ngoals per target environment, many adversaries continue to use the same publicly\navailable malware families (e.g. BEACON).\n\n###### Newly Tracked Malware Families by Availability, 2022\n\n16%\n\nPublic\n\nNon-Public\n\n84%\n\n###### Observed Malware Families by Availability, 2022\n\n29%\n\nPublic\n\nNon-Public\n\n\n-----\n\n###### Most Frequently Seen Malware Families, 2022\n\n16 15%\n\n14\n\n12\n\n10\n\n\n8\n\n6\n\n\n4\n\n2\n\n0\n\n\nBEACON SYSTEMBC METASPLOIT HIVELOCKER QAKBOT ALPHV LOCKBIT BASTA\n\nConsistent with previous years, the most common malware family identified\nby Mandiant in investigations was BEACON. BEACON was identified at 15%\nof all intrusions investigated by Mandiant and remains by far the most seen in\ninvestigations across regions. It has been used by a wide variety of threat groups\ntracked by Mandiant including state backed threat groups attributed to China,\nRussia and Iran, as well as financially motivated threat groups including FIN6,\nFIN7, FIN9, FIN11 and FIN12, and over 700 hundred UNC groups. This ubiquity is\nlikely due to the common availability of BEACON combined with the malware’s high\ncustomizability and ease of use.\n\nWhile the overall usage of BEACON in 2022 is still the most notable, it is more than\na 10-percentage point decrease in usage compared to 2021, which makes it the\nsmallest percentage of observed BEACON activity in recent years. Use of BEACON\nacross intrusions was captured in 28% of all of intrusions in 2021 and 24% in 2020.\n\n\nThe second and third most common malware families observed were SYSTEMBC\nand METASPLOIT. These malware families provide adversaries similar capabilities\nto BEACON, however with various limited capabilities. The use of malware that acts\nas a tunneler increased in 2022. This likely reflects the increased usage of malware\nlike SYSTEMBC which is used heavily by actors who deploy ransomware. In 2022,\nMandiant observed four distinct ransomware families emerge as a formidable threat\nto organizations. Mandiant observed that ransomware families such as HIVELOCKER,\nALPHAV, LOCKBIT and BASTA, make up a majority of ransomware related intrusions.\n\n\n-----\n\nWhile intrusions related to ransomware decreased, Mandiant also observed a general\ndecrease in the volume of organizations added to data leak sharing sites related to\nransomware families tracked in 2022 compared to that of 2021. Of the most prevalent\nand destructive ransomware families, Mandiant observed a nearly 10% decrease in\norganizations added to ransomware data leak sites related to ransomware families\nsuch as LOCKBIT, ALPHV, BASTA, CONTI and HIVELOCKER.\n\nIn 2022, Mandiant observed the LOCKBIT data leak sharing sites captured the most\nchange compared to posts in 2021. Mandiant also assesses that with the CONTI group\ndisruption in early 2022, former affiliates began using other ransomware families\nsuch as BASTA, ROYALLOCKER and HIVELOCKER to carry out their operations. This\nlikely explains the wider assortment of ransomware families in use in 2022 compared\nto 2021.\n\n###### Regional Breakdown\n\n\nWhile BEACON was the most frequently seen malware family across all regions,\nthe next most popular malware families varied regionally. In the Americas,\nSYSTEMBC and the cross-platform HIVELOCKER ransomware were seen most\nfrequently after BEACON. In APAC, SODINOKIBI ransomware and the reconnaissance\ntool DRAGONJUICE were most common. In EMEA, METASPLOIT and the PowerShell\nutility TANKTRAP rounded out the top three. Over the years, Mandiant has observed\nincreasing regional variation in common malware families as adversaries\nprogressively specialize in their missions.\n\n\n**AMERICAS**\n\n\n**EMEA**\n\n\n20\n\n15\n\n\n20\n\n15\n\n\n16%\n\n\n20\n\n15\n\n\n12%\n\n\n10\n\n5\n\n\n4%\n\n\n6%\n\n\n5% 5%\n\n\n10\n\n5\n\n\n10\n\n5\n\n\n**APAC**\n\n17%\n\n8%\n7%\n\nBEACON SODINOKIBI DRAGONJUICE\n\n\n0\n\n\n0\n\n\n0\n\n\nBEACON SYSTEMBC HIVELOCKER\n\n\nBEACON METASPLOIT TANKTRAP\n\n\n-----\n\n###### Malware Definitions\n\n\n**BEACON is a backdoor that is commercially available as part of the Cobalt**\nStrike software platform and commonly used for penetration testing\nnetwork environments. The malware supports several capabilities, such\nas injecting and executing arbitrary code, uploading and downloading files\nand executing shell commands. Mandiant has seen BEACON used by a wide\nrange of named threat groups including APT19, APT32, APT40, APT41, FIN6,\nFIN7, FIN9, FIN11, FIN12 and FIN13, as well as more than 750 UNC groups.\n\n**SYSTEMBC is a tunneler written in C that retrieves proxy-related**\ncommands from a C2 server using a custom binary protocol over TCP.\nA C2 server directs SYSTEMBC to act as a proxy between the C2 server\nand a remote system. SYSTEMBC is also capable of retrieving additional\npayloads via HTTP. Some variants may use the Tor network for this\npurpose. Downloaded payloads may be written to disk or mapped directly\ninto memory prior to execution. SYSTEMBC is often used to hide network\ntraffic associated with other malware families. Observed families include\nDANABOT, SMOKELOADER, and URSNIF. Mandiant has seen SYSTEMBC\nused by FIN12 and as more than 20 UNC groups with goals related to\nfinancial gain.\n\n**METASPLOIT is a penetration testing platform that enables users to find,**\nexploit, and validate vulnerabilities. Mandiant has seen METASPLOIT used\nby APT28, APT35, APT40, APT41, FIN6, FIN7, FIN11, FIN12, FIN13 and 152\nUNC groups with end goals ranging from espionage and financial gain\nto penetration testing.\n\n**HIVELOCKER is a ransomware family that has impacted Windows and**\nLinux operating systems. It was originally written in GoLang, however\nwas rewritten in Rust in early 2022. It can encrypt both logical drives\nand remote network shares. On execution, the ransomware will parse\ncommand-line arguments that specify its behavior, such as processes\nto terminate and services to stop prior to encryption. HIVELOCKER can\nskip files based on file size, filename, or file extension specified in a\ncommand line argument during the encryption process. Mandiant tracks\nmore than 15 UNC groups associate with the distribution or usage of\nHIVELOCKER ransomware.\n\n**QAKBOT is a backdoor written in C/C++ that implements a plug-in**\nframework to extend its capabilities via embedded and downloaded\nplugins that provide capabilities such as keylogging, file transfer, and\nfile execution. QAKBOT also targets credentials by intercepting browser\nactivity, injecting malicious code into browser sessions, and extracting\ncredentials stored by browsers, email clients, and FTP clients. QAKBOT is\ncapable of propagating to other systems on a network via SMB and setting\nup port forwarding on a connected router via the UPnP protocol. Mandiant\nhas seen QAKBOT used by more than 20 UNC groups including distribution\nclusters that have provided access for the usage of BASTA ransomware.\n\n\n-----\n\nThe operating system effectiveness\nof a malware family is the operating\nsystem(s) that the malware can be\nused against.\n\n\n###### Operating System Effectiveness\n\nIn line with previous M-Trends reports, malware effective on Windows was by far\nthe most common newly tracked and observed malware, with 92% of the newly\nidentified malware families and 93% of observed malware able to run on Windows.\nCompared to 2021, Mandiant observed relatively stable usage of newly tracked\nmalware effective on the Linux platform in 2022 with a slight decrease in observed\nmalware, 15% of observed malware was effective on Linux, compared to 18% in 2021.\n\n\nSimilarly, compared to previous years, Mandiant has observed adversaries making\nuse of malware families that are effective on one or more operating systems more\noften than leveraging malware that is designed to focus on one operating system.\nIn instances where malware is effective on only one operating system, it will likely\ntarget the Windows OS.\n\n\nThis year marks the first time Mandiant highlights malware effective on the\nVMWare created operating system, VMkernel. While the general volume of malware\neffective on this operating system is not significant, this is notable for defenders\ndue to the prevalence of VMWare architecture, specifically ESXi hosts. These types\nof operating systems do not have significant capability for Endpoint Detection and\nResponse (EDR) tool monitoring. As a result, monitoring and investigations into the\nplatform can be challenging for defenders.\n\n###### Operating System Effectiveness of  Operating System Effectiveness of  Newly Tracked Malware Families, 2022 Observed Malware Families, 2022\n\n\n100\n\n90\n\n\n100\n\n90\n\n\n80\n\n70\n\n\n80\n\n70\n\n\n60\n\n50\n\n\n60\n\n50\n\n\n40\n\n30\n\n\n40\n\n30\n\n\n20\n\n10\n\n\n20\n\n10\n\n\n0\nWindows Linux macOS Unix Android BSD VMkernel iOS\n\nEffectiveness on specific operating system only\n\n\n0\nWindows Linux macOS Unix BSD VMkernel\n\nEffectiveness on specific operating system only\n\n\nEffective on multiple operating systems\n\n\nEffective on multiple operating systems\n\n\n-----\n\n###### Threat Techniques\n\n\n**MITRE ATT&CK® is a globally-**\naccessible knowledge base of\nadversary tactics and techniques\nbased on real-world observations.\nThe ATT&CK knowledge base is\nused as a foundation for the\ndevelopment of specific threat\nmodels and methodologies in\nthe private sector, government\nand the cyber security product\nand service community.\n\n\nMandiant continues to support the community by mapping its findings to the MITRE\nATT&CK framework. Organizations should prioritize which security measures to\nimplement based on the likelihood of a specific technique being used during an\nintrusion. Mandiant has mapped an additional 150 Mandiant techniques to the\nupdated MITRE ATT&CK framework, bringing the total to 2300+ Mandiant techniques\nand subsequent findings associated with the ATT&CK framework. In 2022, the MITRE\nATT&CK Framework was updated to version 12 resulting in ATT&CK for Enterprise\nnow containing 193 techniques and 401 sub-techniques.\n\nMandiant provides metrics around most observed techniques used by observed\nadversaries as a resource to organizations as they make decisions on how to further\nimprove their detection capabilities. Prioritizing the detection of the most leveraged\ntechniques can help organizations build a solid foundation on the way to creating\na stronger security ecosystem.\n\nMandiant observed 73% of MITRE ATT&CK techniques in investigations in 2022\ncompared to 70% of techniques during the last M-Trends reporting period. In\n2022, 71% of the techniques observed (17% of all techniques) were seen in more\nthan 5% of intrusions, compared to 43% of techniques observed (30% of all\ntechniques) in 2021. This convergence in the techniques commonly used by\nadversaries underscores the defensive value from prioritizing implementation\nof security measures to protect against the most commonly used techniques.\nOnly a small number of techniques had high prevalence, with just 4.3% of observed\ntechniques (1% of all techniques) seen in over 30% of intrusions. Notably, the highest\nfrequency techniques remain consistent with what Mandiant observed in 2021,\nindicating enduring defender value from efforts to detect and mitigate their use.\n\n###### MITRE ATT&CK Techniques Used Most Frequently, 2022\n\n17%\n\nObserved in\nMandiant Investigations\n\nSeen in More Than\n5% of Intrusions\n\n\n-----\n\nIn half of the investigations conducted by Mandiant in 2022, adversaries leveraged\na command or scripting interpreter to further intrusions (T1059) with 65% of\nthose cases (one third of all intrusions) involving the use of PowerShell (T1059.001).\nMandiant also continues to observe frequent use of web protocols (T1071.001)\nand Remote Desktop (T1021.001) across intrusions, indicating that adversaries\ncontinue to depend heavily on the organization’s existing technologies in their\noperations. These sub-techniques have been in the top five for the past three\nyears. However, this could indicate that detection for these techniques has\ncontinued to improve and other evidence sources have been prioritized to\ncapture evidence of additional techniques.\n\n###### Top 10 Most Frequently Seen Techniques\n\n 1. T1059: Command and Scripting Interpreter 50.9%\n\n 2. T1027: Obfuscated Files or Information 43.5%\n\n 3. T1071: Application Layer Protocol 33.1%\n\n 4. T1082: System Information Discovery 31.6%\n\n 5. T1070: Indicator Removal 31.5%\n\n 6. T1083: File and Directory Discovery 29.5%\n\n 7. T1140: Deobfuscate/Decode Files or Information 27.3%\n\n 8. T1021: Remote Services 26.4%\n\n 9. T1105: Ingress Tool Transfer 24.9%\n\n 10. T1543: Create or Modify System Process 24.7%\n\n**Top 5 Most Frequently Seen Sub-Techniques**\n\n\n###### 1. T1059.001: PowerShell 33.2%\n\n 2. T1070.004: File Deletion 25.2%\n\n 3. T1071.001: Web Protocols 24.3%\n\n 4. T1569.002: Service Execution 21.8%\n\n 5. T1021.001: Remote Desktop Protocol 20.3%\n\n\n-----\n\n###### MITRE ATT&CK Techniques Related to Mandiant Targeted Attack Lifecycle, 2022\n\n Initial Reconnaissance\n\n**Reconnaissance**\n\n**Mandiant’s Targeted Attack**\n**Lifecycle is the predictable** T1595: Active scanning **1.3%** T1595.002: Vulnerability Scanning\nsequence of events cyber\nattackers use to carry out their T1595.001: Scanning IP Blocks\nattacks. For more information: T1595.003: Wordlist Scanning\n[https://www.mandiant.com/](https://www.mandiant.com/resources/targeted-attack-lifecycle)\n[resources/targeted-attack-](https://www.mandiant.com/resources/targeted-attack-lifecycle) **Resource Development**\n[lifecycle](https://www.mandiant.com/resources/targeted-attack-lifecycle)\n\nT1608: Stage Capabilities **8.8%** T1608.003: Install Digital Certificate\n\nT1608.005: Link Target\n\nT1608.002: Upload Tool\n\nT1608.004: Drive-by Target\n\nT1608.001: Upload Malware\n\nT1583: Acquire Infrastructure **7.5%** T1583.003: Virtual Private Server\n\nT1584: Compromise Infrastructure **3.5%**\n\nT1587: Develop Capabilities **2.6%** T1587.003: Digital Certificates\n\nT1587.002: Code Signing Certificates\n\nT1588: Obtain Capabilities **2.2%** T1588.003: Code Signing Certificates\n\nT1588.004: Digital Certificates\n\nT1585: Establish Accounts **0.2%** T1585.002: Email Accounts\n\n###### Initial Compromise\n\n**Initial Access**\n\n\nT1200: Hardware Additions **0.4%**\n\nT1195: Supply Chain Compromise **0.2%** T1195.002: Compromise Software Supply Chain **0.2%**\n\n\n-----\n\n###### Establish Foothold\n\n**Persistence**\n\n\nT1542: Pre-OS Boot **0.2%** T1542.002: Component Firmware **0.2%**\n\nT1176: Browser Extensions **0.2%**\n\nT1137: Office Application Startup **0 2%** T1137 006: Add ins **0 2%**\n\n\n-----\n\n###### Escalate Privileges\n\n**Privilege Escalation**\n\n\nT1086: Exploitation for Privilege **0.2%**\nEscalation\n\n\n-----\n\n###### Internal Reconnaissance\n\n**Discovery**\n\n\n-----\n\n###### Lateral Movement\n\n**Lateral Movement**\n\n\n-----\n\n###### Maintain Presence\n\n**Persistence**\n\n\nT1542: Pre-OS Boot **0.2%** T1542.002: Component Firmware **0.2%**\n\nT1176: Browser Extensions **0.2%**\n\nT1137: Office Application Startup **0.2%** T1137.006: Add-ins **0.2%**\n\n\n-----\n\n###### Mission Completion\n\n**Collection**\n\n\n-----\n\n**Impact**\n\n\n-----\n\n###### Additional Malware Definitions\n\n\n**ALPHV, aka BlackCat (internet) and Noberus (Symantec), is ransomware**\nwritten in Rust. The ransomware may contain a plaintext JSON\nconfiguration that specifies the ransomware functionality. ALPHV may\nbe able to escalate its privileges and bypass UAC, likely contains AES and\nChaCha20 (or Salsa) encryption functionality, may use the Restart Manager\nas part of its operations, deletes volume shadow copies, may enumerate\ndisk volumes and network shares, and may kill processes and services.\n\n**BASTA, aka Basta Ransomware, is a ransomware written in C++ that**\nencrypts local files. The malware uses .basta as the extension for\nencrypted files.\n\n**DRAGONJUICE is a comprehensive, modular, cross-platform, customizable**\nscanning tool based on the \"Ladon\" project.\n\n**LOCKBIT** is a ransomware written in C that encrypts files stored locally\nand on network shares. LOCKBIT can also identify additional systems on\na network and propagate via SMB. Prior to encrypting files, LOCKBIT clears\nevent logs, deletes volume shadow copies, and terminates processes and\nservices that may impact its ability to encrypt files. LOCKBIT has been\nobserved using the file extension \".lockbit\" for encrypted files.\n\n**ROYALLOCKER** is a privately managed windows-based ransomware\ncapable of encrypting local files, disabling running processes and\ndeleting shadow copies. The ransomware is also capable of encrypting\nVMDK disk formats.\n\n**SODINOKIBI, aka Revil (Internet), Sodin (Internet), and Trickgate (Check**\nPoint) is ransomware written in C that encrypts files stored locally and on\nnetwork shares. It can delete files from specified directories, backup files,\nand volume shadow copies. SODINOKIBI may be configured to send basic\nsystem information to a remote server via HTTP. System information\nincludes the current username, hostname, domain name, and locale.\n\n**TANKTRAP** is a utility written in PowerShell that utilizes Windows group\npolicy to spread and launch a wiper. TANKTRAP has been observed being\nused with NEARMISS, SDELETE, PARTYTICKET, and CADDYWIPER.\n\n\n-----\n\n# The Invasion of Ukraine: Cyber Operations During Wartime\n\n\n-----\n\nRussia began amassing troops along its border with Ukraine in the fall of\n2021, prompting warnings from U.S. and European officials of the threat of\na Russian invasion. Mandiant identified extensive cyber espionage, disruptive\nand destructive cyber attacks, and information operations leading up to and\nsince Russia's invasion of Ukraine on February 24, 2022.\n\nThe Kremlin's escalating attempts to bring Ukraine into the Russian sphere\nof influence culminated with Russia's invasion and created unprecedented\ncircumstances for cyber threat activity. The invasion of Ukraine represents\none of the first instances in which a major cyber power has conducted disruptive\nattacks, espionage, and information operations concurrently with widespread,\nkinetic military operations. Mandiant has never observed threat actor activity that\nmatches the volume of attacks, variety of threat actors, and coordination of effort\nas was seen during the first months following the invasion by Russia. The invasion\nhas also caused temporary disruption to the Russian-speaking cybercrime\necosystem, in some cases splitting criminal groups along political lines, and it\nhas seemingly triggered the biggest revival in international hacktivism since 2015.\n\nThe evolution of Russian cyber operations during the conflict can be loosely\nmapped to five main phases:\n\n- Strategic Cyber Espionage and Pre-Positioning (prior to February 2022)\n\n- Initial Destructive Cyber Operations and Military Invasion (February 2022\n**– April 2022)**\n\n- Sustained Targeting and Attacks (May 2022 – July 2022)\n\n- Maintaining Footholds for Strategic Advantage (August 2022\n**– September 2022)**\n\n- Renewed Campaign of Disruptive Attacks (October 2022 – December 2022)\n\nMandiant also observed Chinese, Belarusian, and Iranian threat groups targeting\nUkraine in each of these phases. We believe that the intrusions by Chinese and\nIranian groups were aimed at gathering intelligence for their governments, while\nthe Belarusian group both collected intelligence and used the intrusions to enable\ninformation operations.\n\nAcross all phases of the invasion, Mandiant has supported dozens of organizations\nin Ukraine with incident response, remediation, intelligence, managed services,\ncyber defense, and general advisory, and we continue to respond to incidents\nacross Ukraine in 2023. While Mandiant conducted engagements across nearly\nevery sector of Ukrainian industry, our investigations overwhelmingly supported\nUkrainian National Government organizations.\n\nMandiant also identified related information operations conducted throughout\neach of these phases, including those leveraging traditional cyber threat activity.\n\n\n-----\n\n**FIVE PHASES OF RUSSIAN CYBER OPERATIONS DURING THE 2022 WAR IN UKRAINE**\n\nJanuary - September 2022\n\n\nPHASE 1\nStrategic Cyber\nEspionage and\nPre-positioning\n\nPHASE 2\nInitial Destructive\nCyber Operations and\nMilitary Invasion\n\n\nPHASE 3\nSustained Targeting\nand Attacks\n\n\nPHASE 4\nRenewed Espionage\nTargeting\n\nPHASE 5\nRenewed Campapign\nof Disruptive Attacks\n\n\n*As reported by ESET\n\n\nTarget Industries\n\nGovernment Telecom\n\n\nFinancial\n\n\nMedia\n\n\nEnergy\n\n\n**Figure 1. Phases of Russian Cyber Operations in Ukraine observed in 2022.**\n\n\n-----\n\n###### Strategic Cyber Espionage and  Pre-Positioning Prior to Invasion\n\n Intrusion Activity\n\nMandiant observed multiple threat groups conducting intrusion campaigns in the\ntimeframe leading up to the invasion. Most notably, we observed activity by UNC2589\nand APT28 prior to the invasion of Ukraine.\n\n###### UNC2589\n\n[UNC2589, which Mandiant suspects operates on behalf of Russian government](https://advantage.mandiant.com/auth/login?returnTo=%2Freports%2F22-00027896)\ninterests, conducted extensive espionage collection in Ukraine, particularly in\nlate 2021 and early 2022 preceding the Russian invasion. Notably, we assess\nUNC2589 conducted the January 14, 2022, disruptive attacks on Ukrainian\nentities with PAYWIPE (aka WHISPERGATE). This may have been a preliminary\nbut premature strike that Russian military doctrine characterizes as \"preparing\nthe information sphere\" for armed conflict in an attempt to shake Ukrainians’ trust\nin their government and fracture support for a strong defense against Russian\naggression. Additional UNC2589 operations in January and February 2022 targeted\nUkrainian critical infrastructure supporting that aim as well, however, distributed\ndenial-of-service (DDoS) attacks were also conducted against financial institutions.\n\n###### APT28 and Other GRU Clusters\n\nMandiant identified multiple instances where Main Directorate of the General Staff\nof the Armed Forces of the Russian Federation (GRU)-related clusters relied on\nopportunistic access from historical compromises for current, persistent accesses\nonce the war began. In late February 2022, APT28, a threat group sponsored by\nthe GRU, reactivated a dormant 2019 EMPIRE infection to move laterally within the\nenvironment and use the SDELETE utility to delete files and directories from the\ninfected systems. In another case, APT28 targeted VPNs to gain access and deploy\nthe FREETOW dropper to multiple victims in April 2021. In at least one case, upon\ngaining a foothold, the attacker laid dormant until conducting a series of wiper\nattacks in February and March 2022 during Phase II of the war. APT28 has been\nthe most active Russian cluster of activity in Ukraine since the war began and\nhas prioritized disruptive cyber attacks over espionage operations in Ukraine.\n\n\n-----\n\n###### Initial Destructive Cyber Operations  and Military Invasion\n\n (February 2022–April 2022)\n\nMandiant observed more destructive cyber attacks in Ukraine during the first\nfour months of 2022 than in the previous eight years. Ukrainian organizations\nwere impacted by threat actors using six unique wipers during the first few phases\nof the war. These destructive cyber attacks were timed to coincide with, and likely\nsupport, Russia’s invasion of Ukraine on February 24, 2022, and did not target\norganizations directly related to or supporting the war effort. While the destructive\ncyber attacks did initially achieve significant widespread disruption in some\nUkrainian networks, they were likely not as impactful as previous Russian cyber\nattacks targeting Ukraine. In comparison, Russia had launched successful cyber\nattacks targeting power grid disruptions in 2015 and 2016 that interrupted power\nfor hundreds of thousands of Ukrainians for hours, and the 2017 NOTPETYA attacks\ndisrupted operations throughout Ukraine and beyond.\n\n###### APT28 Wiper Attacks and GRU Living on the Edge\n\nMandiant observed APT28 targeting multiple Ukrainian entities with disruptive\nand espionage operations similar to the efforts undertaken at the outset of war.\nAPT28’s wartime operations have deviated from historical APT28 activity. The\ngroup has demonstrated a preference toward compromising edge infrastructure\nto conduct a variety of operations, a technique we call “Living on the Edge.” APT28\nhas also used a variety of disruptive and espionage malware over a short period of\ntime, and leveraged several recently published exploits during wartime, including\nFollina, the PROXYSHELL exploitation chain, and several Exchange vulnerabilities.\n\n“Living on the Edge” has become a key part of GRU operations during wartime. Since\nthe outset of the war in Ukraine, the GRU has attempted to conduct successive and\nalmost constant campaigns of cyber espionage and disruption aimed against key\nservices and organizations within Ukraine. This balance of access to and action\nagainst targeted organizations relies on the compromise of edge infrastructure\nsuch as routers and other internet connected devices. Where destructive actions\nnecessitate the loss of direct access to endpoints, compromised edge devices\nallow for continued re-entry to the network. Compromise of these routers can\nalso be harder for defenders to detect as most EDR technologies do not cover\nthese types of devices.\n\n\n-----\n\n###### Renewed Russian Interest in Industrial Control  Systems Capabilities\n\nBetween February and April 2022, the software company ESET reported on\na suspected Russian threat actor targeting a Ukrainian electric utility in an\noperation that resulted in the deployment of multiple wiper malware families.\nThe attack also involved a variant of the Industrial Control Systems (ICS)-oriented\ndisruption framework INDUSTROYER.V2, of which a previous version had been\nleveraged during a similar attack in December 2016 to cause power outages in\nUkraine. While it is unclear if this operation was effective in its impact to the utility’s\nelectric transmission and distribution operations, the event reinforced the notion\nthat Russia has a reusable capability to affect electric energy systems.\n\n###### Reemergence of Hacktivist Personas and Cyber-Enabled Information Operations\n\nMandiant observed a significant increase in hacktivism after the invasion of Ukraine,\nincluding activity emanating from Russian-backed groups. The Russian intelligence\nservices have an extensive history of using false hacktivist personas to support\ninformation operations, along with disruptive and destructive cyber activity. In\nparticular, Mandiant has focused on analyzing a set of self-proclaimed hacktivist\ngroups—XakNet Team, Infoccentr, and CyberArmyofRussia_Reborn—all of which\nlikely at least coordinate their operations with GRU-sponsored APT28. Mandiant\nhas directly observed the deployment of wipers used by APT28 on the networks of\nmultiple Ukrainian organizations, and the subsequent leaks of data on Telegram by\nthreat actors claiming to be hacktivists, likely originating from those entities within\n24 hours. We identified at least 16 data leaks from these groups, four of which\ncoincided with wiping attacks by APT28.\n\nOn the Telegram channels, the threat actors claimed to have targeted victims\nwith traditional hacktivist activity such as DDoS attacks, website defacements,\nand hack-and-leak operations. Such activity serves two possible influence\nobjectives that benefit Russia in the invasion of Ukraine. The groups promote\nRussian interests abroad through their threat activity, and they promote the idea\nof average Russians supporting the government to domestic audiences through\ntheir claims to be patriotic volunteers. Both efforts have been amplified by the\nRussian media, on social media platforms, and elsewhere online.\n\nDuring this phase Mandiant also observed an increase in hacktivist activity by\nthe KillNet collective. KillNet claimed activity against Poland, Lithuania, and\nother NATO countries, which seemed to align with priorities of the Russian\ngovernment. However, Mandiant has not yet uncovered direct evidence linking\nKillNet to Russian Intelligence.\n\n\n-----\n\n###### Use of Physical Access to Enable Cyber Operations\n\nDuring an investigation into activity targeting a Ukrainian government organization’s\nnetwork, Mandiant uncovered evidence the compromise occurred after Russian\nmilitary units physically accessed the network in early 2022. The actor, which\nMandiant tracks as UNC3762, used this physical access to conduct network\nreconnaissance, harvest credentials, and move laterally using remote desktop\nand web shells. UNC3762 also exploited the PROXYSHELL vulnerability chain\n(CVE-2021-34473, CVE-2021-34523, CVE-2021-31207), deployed THRESHGO\nmalware, and stole data from the environment.\n\n\n-----\n\n###### Sustained Targeting and Attacks\n\n (May 2022–July 2022)\n\nAfter the initial waves of destructive attacks, the pace and variety of cyber\noperations targeting Ukraine shifted. Mandiant observed continued attempts\nto deploy wiper malware, but these attacks appeared less coordinated than the\ninitial wave in February 2022. These attacks often occurred more quickly after the\nattacker gained or re-gained access, often via compromised edge infrastructure. In\nmany instances, Ukrainian defenders were able to identify and mitigate attempted\nattacks before any disruption occurred. Mandiant also saw attempts at access and\ncollection operations between waves of disruptive activity, demonstrating Russia’s\nrequirement for continued access to previously wiped entities.\n\n###### Continued Intrusions and Operational Tempo\n\nThroughout this phase of the war, Russian cyber actors continued to attempt\nto either re-gain access to multiple victim environments via compromised edge\ninfrastructure or to maintain persistence on networks despite ongoing mitigation,\noften via GRE tunnels. This pattern was demonstrative of cyclical collection and\ndisruptive operations undertaken by Russia-aligned threat actors. GRU clusters\nmaintained their high operational tempo by adopting newly published exploits\nwhile also working to standardize their destructive operations. Between waves\nof disruptive activity, one phishing campaign leveraging a compromised legitimate\nmail server attempted to exploit the Follina vulnerability to enable APT28 access and\ncollection operations using the EARLYBLOOM and DARKCRYSTALRAT backdoors.\nThe GRU also shifted away from using multiple different wipers to relying heavily\non CADDYWIPER and variants thereof to wipe organizations in quick-turnaround\noperations. This high operational tempo led to operators making several mistakes.\nIn one instance a threat actor attempted to deploy the PARTYTICKET payload using\nthe arguments for NEARMISS. They were able to adjust and successfully deploy\nNEARMISS, but the error caused a delay and potentially impaired their effectiveness.\n\nGRU intrusion operations maintained several themes between their operations at\nthe outset of the war, and those that have occurred during this sustained targeting\nphase. Overall, GRU continued to target and leverage edge infrastructure to gain\naccess to strategic targets. Once within an environment, GRU clusters leveraged\nIMPACKET and publicly available backdoors to maintain a foothold. Mandiant also\nobserved another GRU cluster, UNC3810, demonstrate proficiency at targeting\nand operating on Linux systems. UNC3810 has largely leveraged proxying tooling\nsuch as GoGetter and Chisel to maintain access and move laterally within\ntarget environments.\n\n\n-----\n\n###### Maintaining Footholds for Strategic Advantage\n\n (August 2022–September 2022)\n\nThrough the end of the previous phase, we had not observed any direct evidence\nof activity associated with suspected FSB-cyber threat actors Turla or Temp.Isotope.\nHowever, between August and September, GRU clusters stepped away from\ndisruptive activity targeting Ukraine and clusters associated with the FSB—Russia’s\nFederal Security Service—began to emerge. While one GRU-associated cluster,\nUNC3810, remained active in an espionage capacity, Mandiant observed activity\nfrom the Russia nexus threat group TEMP.Armageddon targeting four distinct\ngovernment entities in Ukraine. Though we primarily observed GRU clusters at\nthe helm of cyber operations against Ukraine since the inception of the war, TEMP.\nArmageddon—a Russia-nexus threat actor that collects information on Ukrainian\nnational security and law enforcement entities in support of Russia's national\ninterest, focusing exclusively on Ukrainian targets—has targeted Ukrainian and\nother European organizations throughout with evolving tooling and techniques.\nThe breadth of operations observed from TEMP.Armageddon is consistent with\nthe prolific campaigns the group undertook in years past.\n\nIn addition to TEMP.Armageddon targeting of Ukrainian government entities,\nMandiant identified suspected Turla activity in August and September. Turla is\na Russia-based cyber espionage actor active since 2006 that is known to target\ndiplomatic, government, and defense entities. Mandiant identified a compromise\ndating back to a late 2021 compromise at a Ukrainian government agency that\naligns with Turla’s tactics, techniques and procedures.\n\n\n-----\n\n###### Renewed Tempo of Disruptive Attacks\n\n (October 2022–December 2022)\n\nThe most recent phase of operations was characterized by a resurgence in\ndisruptive cyber attacks in Ukraine. Though some of the attacks appeared similar\nto disruptive attacks seen in previous phases, this new wave of disruptive attacks\nappeared to deviate from the historical norm. Earlier attempts relied on quickturnaround operations using CADDYWIPER variants, but the attacks undertaken\nin October to December saw GRU clusters deploying ransomware variants on\ntargeted networks. This shift is consistent with Microsoft’s reporting on the\nPrestige (PRESSTEA) ransomware deployment by IRIDIUM in Poland. Though the\ncycle of access and action appears to have continued during this phase, GRU’s\nshift to using ransomware may be a sign they are undergoing tooling shifts and\ndon’t have the resources to rely on writing or modifying custom malware.\n\nDuring this phase, Mandiant also observed GRU disruptive operations against the\nUkrainian energy sector that coincided with the broader Russian kinetic campaign\ntargeting Ukrainian energy infrastructure. While it is possible that cyber operations\nare supporting the kinetic campaign, we do not have sufficient insight to confirm it.\n\n\n-----\n\n###### Information Operations Surrounding  Russia’s Invasion of Ukraine\n\nRussia’s war against Ukraine has generated a disproportionate amount of\ndisinformation on the topic. Mandiant observed disinformation campaigns\nranging from cyber-enabled information operations to campaigns leveraging\ncoordinated and inauthentic networks of accounts to promote fabricated content\nacross online media. Mandiant has identified multiple Russia-aligned information\noperations linked to known actors promoting a narrative related to the conflict,\nincluding the Belarus-linked Ghostwriter campaign, the Secondary Infektion\ncampaign, and activity reportedly linked to individuals affiliated with Russia’s\nInternet Research Agency.\n\nRussia’s disinformation campaigns appear to serve the dual purposes of tactically\nresponding to or shaping events on the ground, and strategically influencing the\nshifting geopolitical landscape. The narratives being promoted seek to demoralize\nUkrainians and foment internal unrest, isolate Ukraine from its allies, and bolster\npositive perceptions of Russia. While much of the disinformation activity has\ntargeted audiences in Ukraine and Europe, Mandiant has identified information\noperations promoting messaging aimed at Russian domestic audiences, further\nunderscoring Russia’s need to sell the war to its own people.\n\nMandiant anticipates that such operations, including those involving cyber threat\nactivity and potentially other disruptive and destructive attacks, will continue as\nthe conflict progresses. Meanwhile, Mandiant has also observed pro-PRC and\npro-Iran campaigns leveraging the Russian invasion opportunistically to further\nprogress long-held strategic objectives. Though some of these operations have\npromoted narratives that appear to be aligned with Russian interests, they also\ndemonstrate how events of global significance have the power to attract third-party\nactors. Mandiant expects this dynamic to continue and is actively monitoring for\nexpansions in their scope of information operations activity surrounding the conflict.\n\n\n-----\n\n###### Takeaways\n\n\nRussia’s invasion of Ukraine has demonstrated the potential overlap of cyber\noperations and kinetic warfare as a new de facto standard. The war has consumed\nalmost every aspect of Russia's international relationships and has evolved as\nnearly the sole driver of cyber threat activity from Russia in 2022. While Russian\nthreat actors are responsible for the vast majority of the espionage campaigns\nand all of the disruptive or destructive operations that Mandiant has investigated,\nChinese and Iranian state sponsored groups have also been active in the region,\nhighlighting how states will use cyber to gain information on intelligence priorities.\n\nThe tactical and strategic choices by Russian actors demonstrate both the\nversatility of cyber operations and the tradeoffs. Russia’s use of a pre-existing\ncompromise to conduct a wiper operation shows how an intrusion that was\nstarted for espionage purposes can be used for an attack if the geopolitical\nsituation changes, and demonstrates the imperative for defenders to identify\nand fully remediate intrusions. The tactical choice by Russian actors to focus on\nedge devices also allowed flexibility and enabled the actors to potentially continue\nto collect information following a disruptive event. These devices are difficult for\ndefenders to monitor, but they should be promptly patched, and any suspicious\ntraffic originating with them should be thoroughly investigated.\n\nAny armed conflict brings with it the possibility of disruptive actions aimed at\nthe populations and governments. Governments and private sector organizations\nboth play an important role in the functioning of a country. Preparations to defend\nagainst and recover from these types of attacks should be standard as even\ncountries not directly impacted by hostilities may be targeted if they are\nperceived to be supporting one of the sides.\n\n\n-----\n\n# North Korea’s Financial Operations Continue to Evolve\n\n\n-----\n\nAlongside their traditional intelligence collection missions, in 2022 DPRK operators\nshowed more interest in stealing—and using—crypto, with their activity expanding to\nnew parts of the digital asset ecosystem as the regime looks to mitigate the economic\nimpact of sanctions.\n\nSince at least 2016, threat actors associated with the Democratic People’s Republic of\nKorea (DPRK) have expanded cyber operations beyond traditional espionage collection\nand disruptive attacks to leverage their capability for financially motivated campaigns\nand intrusions. Historically, North Korean threat actors have targeted financial entities,\ninvestment services, eCommerce, cryptocurrency users and exchanges, and\ntransaction processing organizations throughout the globe. These activities have\nincluded compromises into traditional financial entities—most famously targeting\nthe central bank of Bangladesh—and the burgeoning cryptocurrency and digital asset\nsector. In 2022, Mandiant observed North Korean threat actors continuing to evolve\ntheir targeting as part of an effort to identify alternative revenue streams and mitigate\nthe impact of sanctions.\n\nWhile these groups appear to continue to take advantage of various financial targets,\nMandiant has observed an increasing and evolving focus on the cryptocurrency\necosystem in 2022. Threat actors leveraged creative means through which the\nNorth Korean regime and their own operations could be funded. Notably, over the past\nyear Mandiant also observed a shift away from targeting fewer, larger organizations\ntoward targeting a larger number of smaller entities for modest financial gains. Media\nreports have highlighted how North Korean operators stole approximately $1.7 billion\nin cryptocurrency in 2022, eclipsing the $428 million stolen in 2021. Additionally,\nthe regime allegedly has $170 million in unlaundered cryptocurrency holdings, which\nare potentially being stored as reserves. The United nations (UN) suggests these illicit\nfunds are being used to finance the country's missile programs.\n\n\n-----\n\n###### NFTs, Bridges, Ransomware and More:  North Korean Cybercrime in 2022\n\nEarly Mandiant analysis of North Korean crypto-focused operations highlighted\ntheir centering around targeting cryptocurrency exchanges, and was predominantly\ndriven by TEMP.Hermit and clusters suspected of being linked to APT38. Since then,\nthe number of suspected DPRK groups involved in thefts of cryptocurrency, and the\nnature of their targets, has continued to expand. North Korean threat actors have\ntargeted interdisciplinary aspects of cryptocurrencies, including Non-Fungible\nTokens (NFTs), cross-blockchain connection mechanisms, and even online games.\n\nIn one broad, months-long cryptocurrency phishing campaign by suspected North\nKorea-nexus UNC4469, thousands of smart contracts were used to deliver malicious\nNFTs to over a million unsuspecting users. UNC4469 leveraged malicious, mass NFT\nairdrops to user wallets, phishing pages, and social media platforms with themes\ndesigned to socially engineer the victim into connecting their wallets. Once the\nwallets were connected, UNC4469 was able to collect and transfer assets, including\nNFTs, to UNC4469-controlled wallets. Assets stolen from phishing victims were\nquickly sold, and the funds moved through various blockchains to launder the funds\nand obscure their trail. The automation, duration, and volume of activity spanning\nmultiple blockchains indicates an ongoing sophisticated and mature operation.\n\nAlongside NFTs, “bridges” are another part of the cryptocurrency ecosystem that\nhas grown in usage in recent years. Bridges facilitate movement of assets between\ndifferent blockchains without the need to use a cryptocurrency exchange. Bridges\ncan accumulate value as they become more widely used, making them attractive\ntargets. This was demonstrated in 2022 with the $100 million compromise of\nHarmony’s Horizon Bridge by actors, which the FBI attributed to North Korea[5].\n\nOnline games with cryptocurrency and blockchains as a central feature have gained\npopularity with the rise of cryptocurrency, and thus have also gained the interest\nof North Korean groups. In April 2022 the U.S. Department of the Treasury alleged\nthat North Korea-based threat actors were responsible for a $600 million theft\nfrom a digital ledger used by players of the online game Axie Infinity. The U.S.\nGovernment managed to seize $30 million in cryptocurrency related to the heist,\nwhich it attributed to the \"Lazarus\" cybercrime gang. The North Korean actor TEMP.\nHermit has demonstrated a history of targeting cryptocurrency services, and many\nof these incidents are publicly attributed to Lazarus.\n\n\n-----\n\n**NOTABLE NORTH KOREAN THREAT ACTIVITY TARGETING CRYPTOCURRENCIES IN 2022**\n\n\nSUSPECTED GROUP\n\n\nMALWARE FAMILY USED\n\n\nUNC1130\n\nUNC1130\n\n\nCOINTOSS\n\n\nTEMP.HERMIT\n\n\nN/A\n\nN/A\n\nN/A\n\nN/A\n\nN/A\n\n\nN/A\n\nN/A\n\nN/A\n\n\nUNC1069 LONEJOGGER\n\n\nUNC1130 LOGCABIN\n\nUNC1758 AppleJeus\n\nSeparately, Mandiant investigated open source reports of multiple suspected DPRK\nefforts to gain employment at cryptocurrency-focused organizations in April and May\n2022. The accounts seem consistent with a May 2022 U.S. government advisory on\nNorth Korean IT workers posing as non-North Korean nationals to gain employment in\nareas where they would have an opportunity to generate revenue for DPRK programs.\n\n\nWhile the scale and nature of these operations suggests they exist primarily to\nfacilitate funding for the North Korean regime’s nuclear program ambitions, some\nactivity observed by Mandiant suggests they may also function to support further\ncyber operations for the actors themselves. For example, Mandiant has observed\nUNC1130, an activity cluster that aligns with the publicly reported Kimsuky activity\nset, uses targeted financial data and stolen cryptocurrency to procure infrastructure\nand equipment. UNC1130 operators employed various online personas to purchase\ninfrastructure, hardware, and code signing certificates from multiple vendors.\nIn at least some of the identified purchases, the threat actors used U.S.-based\naddresses. The purchases were funded via PayPal, American Express credit\ncards, and cryptocurrencies that may have been derived from previous operations.\nMandiant previously observed payments from DPRK-controlled wallets to\ncryptocurrency payment processors.\n\nFinally, in late 2022, sensitive and open source reporting suggests that some\nclusters related to the threat group publicly tracked as Andariel are involved in\nutilizing ransomware in campaigns impacting global organizations. Analysis of\nthese activities, including those of UNC4131 and UNC4369, indicate their goals\nseem financially motivated with the self-funding of further operations at least\na partial goal. In comparison to other money-making schemes, the activities\nundertaken by UNC4131 and UNC4369 are limited in volume.\n\n\n-----\n\n###### Not Just Money: Continued Intelligence  Collection Operations in Context\n\nNorth Korean-associated threat clusters operate with a dual mandate today. Even\nwith their growing focus on financially motivated activity, Mandiant has continued\nto witness DPRK campaigns and operations of a traditional espionage nature. In\n2022, Mandiant observed compromises impacting government, aerospace and\ndefense, education, legal, media, pharmaceutical, and technology sectors, as\nwell as other organizations in South Korea, Japan, and the United States. These\noperations demonstrate continued reconnaissance and social engineering efforts\nto tailor spear phishing campaigns to access strategic information.\n\nIn early 2022, North Korean espionage groups conducted credential theft operations\ntargeting academics, journalists, political figures, bloggers, and other private sector\nindividuals, primarily in South Korea. Mandiant observed targets were consistent\nwith similar activity ongoing since mid-2021, though they reflect an increase in\nprivate sector victims and decrease in targeting against religious organizations\ncompared to prior months. Analysis of malware distribution data, lure document\nlanguage, and lure content suggests entities in South Korea and Japan were\ntargeted by a campaign of phishing emails themed around software development.\nOne of the documents mentioned a Japanese tech company that sells security\nequipment, including security cameras.\n\nAnalysis of the email contents, spoofed entities, and targets indicate UNC1130 is\ncontinuing to carry out strategic intelligence collection and credential harvesting\ncampaigns. These are most likely intended to inform North Korean leadership on\ngeopolitical events and issues ranging from interest in DPRK weapons testing by\nvarious countries to potential responses to perceived DPRK activities.\n\nMandiant observed another North Korean threat actor, UNC2970, sending\nmessages to targets in the media industry via LinkedIn messages. Once contact was\nestablished, the medium was changed to a text messaging service. A weaponized job\ndescription lure document was then sent to the victims, enabling initial access. Upon\ngaining access to the target environments, UNC2970 leveraged various malware\nfamilies to perform traditional espionage operations.\n\nWhile traditional cyber espionage remains a priority for North Korea, the need for\nfunding manifested more heavily in 2022 with a concerted determination to make\nfinancial gain a priority. North Korea’s targeting of Western interests will likely\ncontinue commensurate with national priorities such as the regime’s nuclear\nambitions, and regionally focused geopolitical events.\n\n\n-----\n\n###### Conclusion\n\n\nFor years, North Korea has reportedly conducted various illicit financial activities\nto fund the regime. The explosive growth of cryptocurrency is converging with\naggressive and flexible North Korean cyber capabilities, making it natural that at\nleast some North Korean threat groups would expand operations into this sector.\nDPRK actors such as APT38, TEMP.Hermit and UNC1130 have demonstrated a\ncontinued willingness to explore new ways to exploit the growing crypto ecosystem,\nand Mandiant’s analysis of DPRK activity trends in 2022 reinforces that. With the\nlucrative success DPRK operations have had in providing funding for cyber activity\nand supporting the regime, these focused efforts will likely continue unabated\nthroughout 2023. Many of the DPRK threat groups Mandiant tracks have moved\ninto cryptocurrency targeting or usage in some form. This expansion of potential\ntargets provides opportunities for network defenders in other sectors to gain\nvaluable insight into North Korean tactics, techniques, and procedures.\n\nEfforts of North Korean personnel to gain employment without revealing their\ntrue nationality fulfills strategic needs for the regime while introducing immense\nrisk to targeted organizations. In addition to funding the regime, these personnel\ncan exfiltrate sensitive and proprietary information, introduce vulnerabilities,\nor facilitate cyber intrusions. Attempts at employment can also telegraph DPRK\ninterests to network defenders, providing a window of preparation.\n\nMandiant graduated UNC1130 to APT43 in March 2023. The full APT43 report is\n[available at https://www.mandiant.com/resources/blog/apt43-north-korea-](https://www.mandiant.com/resources/blog/apt43-north-korea-cybercrime-espionage)\n[cybercrime-espionage](https://www.mandiant.com/resources/blog/apt43-north-korea-cybercrime-espionage)\n\n\n-----\n\n# Shifting Focus and Uncommon Techniques Brought Threat  Actors Success in 2022\n\n\n-----\n\nIn 2022, Mandiant investigated a series of high-profile intrusions that were\nsuccessful and impactful to the targeted organizations despite significant\ndeviations from common threat actor behaviors. While the threat actors\ndemonstrated relatively less technical sophistication than the government\nsponsored and criminal threat actors Mandiant regularly investigates, the impacts\nto the targeted organizations were disproportionate. These incidents underscored\nthe threat posed to organizations by persistent adversaries willing to eschew the\nunspoken rules of engagement. Mandiant observed threat actors leverage data\navailable in underground cybercrime markets, clever social engineering schemes,\nand even bribes to carry out intrusions and account takeovers. Furthermore, these\nadversaries demonstrated a willingness to get personal with their targets, bullying\nand threatening many of them.\n\nIn early 2022, a group of cyber criminals made headlines when they began to target\nmajor international corporations in highly publicized, and often sensationalized,\nintrusions. The group, which Mandiant tracks as UNC3661 and is publicly referred\nto as “Lapsus,” conducted a wide range of malicious activity inside targeted\norganizations. UNC3661 initially targeted organizations in South America, but\nshortly expanded scope to include global organizations. Intrusions undertaken\nby UNC3661 resulted in stolen source code, intellectual property, and, in multiple\ninstances, significant reputational damage.\n\nDespite the damage and scope of the intrusions, UNC3661’s motives were not limited\nto financial gain. In fact, their actions during intrusions spoke broadly to a desire for\nnotoriety, rather than being optimized to increase profits. UNC3661 often demanded\ncorporations release intellectual property as open source and, rather than choosing\ntargets for their financial potential, would often conduct polls in Telegram chats to\ndetermine which organization to target next.\n\nMore recently, Mandiant encountered another group, tracked as UNC3944,\nthat demonstrated characteristics similar to UNC3661. UNC3944 is a financially\nmotivated threat cluster, active since at least May 2022, that commonly gains initial\nnetwork access using stolen credentials obtained from SMS phishing operations.\nOn rare occasions actors affiliated with UNC3944 have engaged in interactive social\nengineering operations, actively threatened individuals, and attempted to bribe\nindividuals to obtain system access.\n\nA common theme for both threat clusters is the oversized impact of their\nintrusions without relying on zero-days, custom malware, or new tools. It is\nimportant organizations understand the potential ramifications of this new,\nmore outspoken threat, and adjust both protections and expectations accordingly.\n\n\n-----\n\n###### Initial Intrusions\n\n\nBoth UNC3661 and UNC3944 relied on a combination of stolen credentials and clever\nsocial engineering to gain initial access to targeted environments. While Mandiant\nhas not confirmed additional initial attack vectors, UNC3661 has solicited VPN\ncredentials from insiders, and open source reporting has suggested they obtain\nthese credentials through phishing email campaigns. UNC3661 also used stolen\ncookies to gain access to the network of a targeted organization. In an interview\nwith a reporter, the threat actor stated they had purchased these stolen cookies\nfrom the underground marketplace Genesis Market.\n\nMandiant observed UNC3661 authenticate to an organization’s VPN infrastructure\nusing stolen or illicit credentials, as well as manage social engineering campaigns\nto enroll new devices in multi-factor authentication (MFA) platforms. UNC3944\nleveraged valid credentials for authentication as well; however, when presented\nwith MFA restrictions, they would socially engineer helpdesk operators to enable\nSubscriber Identity Module (SIM) swapping attacks and enroll new phones. SIM\nswapping allows for the transfer of an existing phone’s service to a new phone.\nThreat groups can intercept MFA verification messages by using SIM card\nswapping to hijack SMS messages.\n\n\n-----\n\n###### Getting Around and Getting Out\n\nOnce implanted inside an organization’s network, both UNC3661 and UNC3944\npreferred to use tools available on the various endpoints on which they had\ngained access. This operating model, sometimes referred to as ‘Living off the Land’,\nremoves the chance an attacker will be detected while transporting tools or malware\ninto the environment. Similarly, detection opportunities are further obfuscated as\nthe actions a threat actor takes during reconnaissance or lateral movement blend\nin with activity already common to the environment. In some cases, however, simple\ntools already present in the environment were insufficient and Mandiant observed\nboth UN3944 and UNC3661 leverage more complex tooling.\n\nUNC3944 would often rely on virtual machines (VM) to drive toward their mission\nobjectives post-compromise. In one instance, the threat group installed VMware\non a Citrix desktop after exploiting MFA gaps, and subsequently used the VM to\nperform broad-scale internal reconnaissance activity within the compromised\nnetwork. Mandiant also identified evidence that UNC3944 gained access to an\norganization’s Azure portal and created VMs configured to accept Remote Desktop\nProtocol (RDP) connections from external attacker-controlled IP addresses. By\nremotely connecting to the Azure VMs, the attacker abused access control policies,\nwhich allowed for ingress into the customer network from the Azure tenant.\nUNC3944’s use of VMs also provided partial anti-forensic capabilities. In cases\nwhere UNC3944 deleted the VM, they created evidence that had to be gathered\nfrom secondary observations from within the network.\n\nUNC3944 also took great care to ensure that, even when they were removed from\nthe networks, they were able to regain access through a variety of techniques. While\nthey commonly avoided the use of persistent backdoors, the efforts undertaken to\nregain access were nonetheless effective. For instance, UNC3944 was able to abuse\nvarious password reset services such as ServiceNow and ManageEngine to reset\npasswords to accounts that had been remediated. Instead of risking detection in a\nnew attack, leveraging the assumption that an account had been successfully reset\nand secured during remediation paid dividends for UNC3944’s continued access to\ntargeted environments.\n\nIn comparison, UNC3661 would leverage common malware such as Mimikatz or\nImpacket to aid in harvesting credentials if needed. Mandiant identified evidence\ndemonstrating the use of both tools by UNC3661 to access an organization’s ntds.dit\nfile, as well as perform DCSync operations. Mandiant also observed UNC3661 exploit\nCVE-2022-21919 using a public utility Mandiant tracks as DOUBLEJUMP to escalate\nprivileges within an environment. CVE-2022-21919 is a vulnerability in the Windows\nUser Profile Service that, when exploited, allows for the execution of a malicious\nDLL under the NT AUTHORITY\\SYSTEM user context.\n\n\n-----\n\nWhile UNC3661 was, at times, able to leverage operating system weaknesses\nand vulnerabilities to escalate privileges, the use of stolen credentials that already\nhad elevated rights was a favored technique for the group. The majority of lateral\nmovement observed by Mandiant with respect to UNC3661 occurred over RDP\nusing valid credentials, and the threat group has demonstrated an ability to zero\nin on stores of credential data otherwise thought secure by the environments’\nowners. Mandiant observed UNC3661 access internal data, messaging platforms,\nand management systems, which they subjected to a rigorous search for plaintext\ncredentials and access tokens.\n\nA common theme between both groups was the targeting of endpoint detection\nand response (EDR) capabilities in the environments they compromised. Both\nUNC3661 and UNC3944 took active steps to remove EDR tooling where possible\nto limit visibility into their activities. Mandiant observed UNC3661 use ProcessHacker\nto gain the privileges necessary to disable EDR services on endpoints, though they\nwould also resort to simply uninstalling the services when needed. UNC3944 was\nobserved leveraging unsophisticated yet effective custom malware to disable EDR\nservices on endpoints in order to deter detection and inhibit remediation activities.\n\n\n-----\n\n###### Making Things Personal\n\nOver the years there has been a surprising trend towards an implicit professionalism\nin cybercrime. Ransomware operators learned early on that poor customer service\naffected their bottom line when it came to negotiating extortion demands and\ncoordinating decryption. Threat groups that operate in the realm of cyber espionage\nrarely, if ever, interact with the employees of the organizations they target beyond\nsocial engineering or spear phishing efforts. UNC3661 and UNC3944, on the other\nhand, went to extreme lengths to harass and, in some cases, intimidate members\nof the organizations they compromised. Often, these outbursts coincided with\nremediation activities that saw the attackers progress rolled back, but just as\noften this tactic was deployed in service of extortion demands. In one case, UNC3944\ntargeted individual employees of an organization by changing their titles in the Global\nAddress List and, in another, spammed obscene messages to employees using\na variety of internal tools. UNC3661 went as far as joining the teleconference calls\nheld by the employees of the compromised organizations to push for capitulation\nto extortion demands. UNC3661 would also brazenly inform members of the security\nand operations team of destructive actions taken within the environment using the\nsame communications platforms.\n\nWhile the evolution of cybercrime from ransomware to multifaceted extortion\noperations has seen an increase in direct interaction with the members of targeted\norganizations, the interactions undertaken by groups such as UNC3661 and UNC3944\nbear a different flavor altogether. The activities put on display by these groups speak\nmore to a confluence of financial motivation and a desire for notoriety.\n\n\n-----\n\n###### Lessons Learned\n\nThe common thread between Lapsus and UNC3944 is simple; both groups realized\nthe value in targeting credentials and accounts rather than endpoints. Despite the\nlack of maturity and sophistication on display, both groups were able to gain access\nto large entities with mature security organizations. Both groups ignored the idea\nof establishing a foothold on network, instead focusing on targeting the accesses\nand accounts of legitimate individual users.\n\nBeyond the targeting of credentials rather than endpoints, there is another, more\nsinister thread that binds these actors together. UNC3944 and UNC3661 have both\npurposefully targeted executives and privileged administrators during intrusions\nwith personal intent to threaten, coerce, or otherwise motivate these high priority\nemployees to pay a ransom or submit to the actors’ demands. This intentional\nwillingness to target individual people with threats and other malicious activity\nconstitutes an evolution of the attack surface; individual people and their families\nare now considered fair game for malicious actors in their efforts to monetize their\nintrusions. In response to this evolutionary leap, defenders should expand their\ndefinition of “attack surface,” and consider that providing protection for their\nemployees may become a necessary part of protecting your organization from\nmalicious actors.\n\nIn the near term, organizations will have to contend with threat actors that find\nnew ways to steal identities from users through a combination of social engineering\nand commodity information stealers alongside information gathering operations\ntargeting their internal data stores. As MFA grew more commonplace, attackers\nsought novel means to bypass MFA without relying on malware. The same is to be\nexpected of Identity and Access Management (IAM) systems in the near term as\nattackers and researchers alike explore the capabilities supplied by such platforms.\n\nNotably, actions taken by government and law enforcement to disrupt and deter\nransomware operations may result in additional actors shifting their focus to\ndata theft and extortion operations. Recent steps taken to recover ransomware\npayments, issue indictments and make arrests, as well as the dramatic downturn\nin crypto markets, may remove some incentive in cybercrime’s use of ransomware.\nWhile other groups may be more sophisticated than UNC3661 and UNC3944, their\nnotoriety and effectiveness is likely to inspire follow-on attacks that leverage many\nof the same tactics. As organizations prepare and work to position their security\nteams and infrastructure, keeping an eye toward protecting against unsophisticated\nyet persistent attackers should be part of their design goals.\n\n\n-----\n\n# Red Team Case Study\n\n\n-----\n\nMandiant red team engagements help organizations evaluate their security\nprogram's capabilities against real-world attack scenarios, and improve their\nsecurity postures. Mandiant works with a wide range of clients, from financial\ninstitutions to manufacturers to global healthcare companies.\n\nThe scenario outlined in this article reflects a large utility company concerned\nabout compromise of site-offices, enabling attackers to gain access to critical\ncloud and operational technology (OT) environment resources. They requested\nMandiant to help them evaluate this risk by attempting to obtain Global Administrator\naccess in Azure, and testing the effectiveness of its controls around the Software\nDevelopment Life Cycle (SDLC).\n\n###### Initial Compromise\n\nMandiant has observed threat actors leverage non-traditional social engineering\nchannels, including targeting users through platforms such as WhatsApp and\nLinkedIn, as well as using SMS and voice phishing (vishing). Based on the customer’s\nthreat model, the red team targeted branch offices with a vishing campaign. Using\na cloud-based service, they created a customized call center with a telephone\nnumber similar to the customer’s own IT helpdesk number. This meant that the\nCaller ID of incoming calls from this number would look familiar, and any branch\noffices returning calls were less likely to think the number looked suspicious.\n\nThe red team called the reception desk at several branch offices to arrange\nan appointment for a “technician” to visit the site and install some new software.\nIn reality, the “technician” would be a Mandiant employee, and the “software” was\ncustom malware Mandiant created to allow remote access to the network while\nevading detection by defensive controls. Through the custom call center setup,\nincoming calls were routed to a pool of red team members. Subsequent calls\nappeared to be answered by different call agents, creating a convincing\npresentation to targets who called back to confirm or ask further questions.\n\nOnce a branch office confirmed the appointment, the red team tasked a consultant\nin that region to visit the office the same week. The consultant arrived at the site\nwearing a badge that had been fabricated based on images of employee badges\nthe red team had gathered during open-source intelligence gathering (OSINT).\nClient staff at the regional office provided the red team operator unsupervised\naccess to each workstation. The operator used this access to install Mandiant’s\ncustom command and control (C2) malware on each machine, ensuring the\nmalware would restart if the device rebooted by performing a “COM Hijacking”\nattack. This persistence technique involves modifying the Windows registry\nto direct applications that leverage Microsoft’s Component Object Model (COM)\nto load malicious code instead of legitimate binaries.\n\n\n-----\n\n###### Lateral Movement to Azure\n\nThe red team had gained access to the client’s internal network, but had not yet\nobtained credentials for any internal users that could allow them to move through\nthe internal network. Mandiant queried the client’s internal Domain Controller's\nKerberos service and obtained a list of several thousand valid usernames. The list\nof usernames was then used in the password-spraying attack targeting the client’s\nAzure cloud infrastructure. Password-spraying attacks differ from traditional\nbrute-force password guessing attacks, in which an attacker tries thousands of\npasswords for each user account hoping to find valid credentials. In a passwordspraying attack, an attacker instead attempts to log in using one common password\nacross many user accounts. Mandiant performed the attack using an internal\ntool that uses the AWS API Gateway to make authentication attempts from\nnon-attributable IP addresses that are rotated after every 25 attempts.\n\nPassword-spraying attacks are more difficult to detect than a brute force password\nattack. It is common to find environments that apply a policy to lock an account\nafter a set number of failed attempts, but password-spraying attacks don’t trigger\nthe same lockouts. Since individual accounts are only tried once, one of the most\ncommon ways to identify password-spraying attacks is through statistical analysis\nof the number of failed authentications from a singular IP address. To avoid this\nmeans of detection, Mandiant configured a rolling pool of IP addresses from which\nrequests would originate and changed source addresses after a set number of\nrequests. Using this technique, Mandiant was able to identify multiple accounts\nthat were using common passwords, including several hundred accounts that\nall used the same password. Historically, Mandiant has observed this phenomenon\nin organizations where a default password is configured for new accounts\nor after a password reset. Mandiant then uses the collected set of credentials\nto target common services, which may provide further insight or even access\ninto the organization.\n\nServices such as SharePoint and Outlook are often hosted in Azure and can be\nveritable treasure troves of sensitive data. While Mandiant did possess multiple\nsets of valid credentials, the client had configured multi-factor authentication\n(MFA) as a requirement to access the most used services. However, the Microsoft\nGraph API had not been configured with the same requirements. Using the\nMicrosoft Graph API, Mandiant enumerated significantly more information\nregarding the organizational structure of the targeted environment, as well\nas the Conditional Access policies for the tenant. Mandiant’s analysis of the\nConditional Access policies revealed the existence of a set of accounts that\nwere exempt from MFA. By targeting those accounts with further password-spraying\nattacks, Mandiant was able to collect additional sets of credentials, which allowed\nthem to access a wider range of services without the need to attempt\nbypassing MFA.\n\n\n-----\n\n###### Attacking a Password Manager Solution\n\nMandiant now had access to almost a dozen endpoints at the branch office site,\nas well as access to Azure. On one of these endpoints, Mandiant identified an\nencrypted database file used by the popular password manager software KeePass.\nWhile the database was encrypted with a strong password, access to the KeePass\nconfiguration file was not secured. By modifying the configuration file, Mandiant\nleveraged a vulnerability in KeePass that allowed for the creation of malicious\ntriggers in the KeePass client. Every time the KeePass password database was\ndecrypted, the unencrypted passwords would be written to file. Once a user\nunlocked the database and the unencrypted passwords were written to file,\nMandiant extracted the file, removed the triggers from KeePass, and deleted\nthe file. Among the unencrypted passwords, Mandiant identified administrative\ncredentials for several key systems within the client environment, including jump\nboxes used to access sensitive OT networks and internal servers. Mandiant used\nthese credentials to move laterally and install malware on the associated machines.\nIn one instance, a Domain Administrator was logged into one of these servers and\nMandiant leveraged NanoDump to extract their credentials from memory without\nbeing detected. NanoDump is a sophisticated tool that implements functionality\nsimilar to the well-known Mimikatz utility, but includes advanced options and\nfeatures that can help evade detection by antivirus (AV) and endpoint detection\nand response (EDR) solutions.\n\n\n-----\n\n###### Gaining Visibility within Azure\n\nWhile Mandiant possessed valid Domain Administrator credentials, conditional\naccess policies that restricted administrative account access proved to be\nan obstacle. However, extensive internal domain reconnaissance revealed the\npresence of several built-in Microsoft On-Line (MSOL) accounts that were being\nused to synchronize the on-premises Active Directory with Azure Active Directory.\nIf an attacker with sufficient privileges can gain access to a system performing\nsynchronization it is possible to retrieve the MSOL account credentials in clear\ntext. MSOL account permissions vary between deployment options, but often\ninclude the Global Reader role within Azure. With the Global Reader role, an account\nhas visibility into all resources and properties within a tenant. Moreover, because\nMSOL is a service account, it is typically excluded from MFA enforcement with\nconditional access policies.\n\nMandiant used Domain Administrator credentials to obtain a session on a\ndomain controller performing the synchronization. Using open source tooling\nwhich operated solely in-memory, Mandiant harvested the cleartext MSOL\naccount password.\n\n\n-----\n\n###### Privilege Escalation to Global Administrator Solution\n\nThe MSOL account to which Mandiant had access was the perfect position\nfor privilege escalation within Azure due to its visibility into all resources within\nthe cloud. Mandiant proxied browser traffic through a C2 implant to access the Azure\nPortal directly using the MSOL account credentials to gather valuable information\nregarding the tenant’s application, user, and group hierarchies. Mandiant was able\nto confirm that, while the customer had implemented strong conditional access\npolicies for all privileged accounts, the MSOL account was not restricted.\n\nMandiant identified that the Microsoft Office 365 application had the Global\nAdministrator role within Azure. If Mandiant could identify an on-premises service\naccount with the permission to add owners to the Microsoft Office 365 application,\nit could provide a path towards the Global Administrator role. A key condition to\nexploit this was the vulnerable user being an on-premises account rather than one\nthat exists only in Azure AD. Mandiant’s access to Domain Admin credentials allowed\nfor the creation of what is commonly called a Silver Ticket for any synchronized\non-premises account. A Silver Ticket allows an attacker to forge a Ticket Granting\nService (TGS) ticket for a service that can be used in a pass-the-ticket attack. The\nmachine hash of the system responsible for synchronization of AD and Azure AD\nis used to sign tickets for authentication to the Azure web portal. In this instance,\nMandiant forged a ticket for an on-premise service account with permissions to\nadd owners to the Microsoft Office 365 application. Once the Silver Ticket was\nloaded within a browser session with access to the Azure Portal, Mandiant add edits\naccount as an owner of the Microsoft Office 365 application. With full ownership over\na Service Principal (SP), a user within Azure can assume the identity of the service by\ncreating certificates or credentials for the SP. Mandiant was able to impersonate the\nMicrosoft Office 365 SP and obtain all privileges associated with the Global\nAdministrator role.\n\n\n-----\n\n###### Attacking the Software Development Life Cycle (SDLC)\n\nAfter gaining full Global Administrator access to the client’s environment, Mandiant\nwas ready to approach the ultimate objective of the engagement, which was to\npoison the SDLC of the client by injecting malicious code into an application.\nMany of the business processes within the client environment ran through custom\napplications. Mandiant targeted a JavaScript-based internal web application that\nwould often be included in internal applications to produce a chat prompt with\ntechnical support personnel. The code for the chat prompt was hosted within Azure\nBlob storage, which allows for the storage of unstructured data such as text, images,\naudio visual components, and even binary large objects (BLOBs). This architecture\nprovided the necessary means through which Mandiant could poison the Blob\nStorage container, which stored the JavaScript source code of the chat prompt.\n\nMandiant worked with the client to design a backdoor that would provide a realistic\nproof-of-concept demonstration without disruption to the applications on which\nthe chat prompt was used. Malicious code injected into the JavaScript source would\npropagate to multiple internal applications, initiating a state change that met the\nparameters laid out by the client. A user visiting any of the dozens of impacted web\napplications within the client network would load the poisoned JavaScript code\ninto their browser session. Extensive internal monitoring and change control\nsystems allowed for early detection of the implanted code, and within 15 minutes\nthe customer’s security team had reverted the change and activated their incident\nresponse process.\n\n\n-----\n\n###### Outcomes\n\nThe constantly evolving cybersecurity landscape continuously produces new\nchallenges for defenders and attackers alike. Threat actors constantly innovate\non their approach to social engineering, which, in turn, pushes security personnel\nto develop better protections and training for users. Hybrid on-premise networks\nconnected to the cloud create unique challenges in security that require extensive\nplanning and operational changes to address, while attackers operate without\nsimilar limitations and are guided only by their objectives. Similarly, multiple layers\nof identity management and application deployment create a new verticality to client\nenvironments that must be secured. It is not uncommon for misconfigurations to\narise as the implementation and design phases of cloud service migrations meet\nthe hard reality of business operations. Organizations should consider testing\ntheir cloud architecture deployments to promote resilience against motivated,\nagile adversaries.\n\n###### Targeted Attack Lifecycle Mapping\n\nESCALATE PRIVILEGES\n\n                                   - KeePass password extraction\n\n                              - ADConnectDump\n\n                                  - Azure ACL Abuse\n\nINITIAL COMPROMISE ESTABLISH FOOTHOLD INTERNAL RECON COMPLETE MISSION\n\n\n\n- Vishing\n\n- Fake call center\n\n- Impersonation of staff\nfor physical access\n\n\n\n- Install fake software update\n\n- Maintain presence\n\n- COM Hijack\n\n\n\n- Domain Admin privileges\n\n- Azure Global Administrator privileges\n\n- Trojanize production application\n\n\n\n- DCOM\n\n- Azure password spraying\n\n- Silver ticket\n\n\n-----\n\n# 2022 Campaigns and Global Events\n\n\n-----\n\nMandiant gains knowledge of threat actors during frontline investigations, analysis\nof public reporting, information sharing, and other research. In 2022, Mandiant\nIntelligence established the Campaign and Global Events (CGE) team to illuminate\nhigh-impact, multi-targeted intrusion activity and provide actionable threat\nintelligence to defenders. Each Campaign or Global Event profile includes indicators\nof compromise, notable adversary host commands, and in-depth analysis and\ncontext surrounding the tactics, techniques, and procedures (TTPs) used by\nthe threat actors, complete with mappings to the MITRE ATT&CK framework.\nBy providing this information overlaid with context and analysis, defenders are\nempowered to respond to these threats more effectively.\n\n###### Campaigns­—Threat Actors\n\nMandiant defenders responded to extremely impactful campaigns in 2022,\nranging from state-sponsored espionage to financially motivated extortion.\nMandiant defenders went head-to-head with multiple campaigns involving\ncompromised USBs and other external devices that spread malware far and wide\nacross targeted environments. The identification of these campaigns provided\nMandiant services with actionable data to create new real-time detections, develop\nand expand existing threat hunting missions, and establish high-fidelity automatic\ncontainment guidelines to isolate affected systems at the outset of emerging threat\nactivity. In 2022, among the notable campaigns tracked by the CGE team, APT29,\nBASTA ransomware operators, and threat groups leveraging USB-based malware\nprovided illustrative examples of complex threat actor activity being distilled into\nactionable intelligence by this initiative.\n\n\n-----\n\n###### APT29\n\n\nAPT29 is a cyber espionage threat group that has leveraged innovative TTPs against\nhumanitarian groups, think tanks, defense, and diplomatic institutions in Europe\nand North America. Following the continued tensions between Russia and Ukraine\nin the beginning of 2022, Mandiant established the Ukraine Crisis Resource Center\nto monitor and prepare the wider community for a potential increase in Russian\nCyber Activity. This Center provides customers and the community with valuable\nresources to proactively harden their environments against destructive attacks,\nhighlights Russian information operations, and provides an overview of Russian\ncyber capabilities. Given historical campaigns against Ukrainian and western\ntargets by Russia, Mandiant notified the community of suspected increases in\nretaliations from various Russian cyber threat groups. This notification included\nan outlook on various impacts to industries of high value for disruption such as\nthe Energy, Financial and Transportation sectors, along with notable threat groups\nand each group’s noteworthy techniques.\n\nIn 2022, Mandiant continued to track APT29 targeting organizations through\nnon-traditional vectors in an attempt to remain undetected and achieve their\nmission objectives. In January 2022, approximately a month prior to Russia’s\ninvasion of Ukraine, APT29 initiated a phishing campaign targeting diplomatic\nentities primarily located in Europe. Over the ensuing months, APT29 continued\nto target multiple organizations within private industries with unique tactics,\nfocusing heavily on obtaining email addresses. Mandiant launched two campaigns\ntracking specific APT29 activity.\n\n###### Highlighted Activity\n\n APT29 Conducts Phishing Campaign Targeting Multiple National Government Agencies\n\nAPT29 sent phishing emails designed to appear as administrative notices related\nto embassies that were relevant to the targeted organizations. The phishing emails\nutilized legitimate but co-opted email addresses to send emails containing malicious\nattachments. These attachments ultimately led to backdoors that used legitimate\nservices for command and control (C2). Historically, APT29 made extensive use\nof a dropper that retrieved BEACON from a third-party cloud service. Mandiant\nobserved an operational shift in February 2022 when APT29 began to deploy a\nsimpler dropper that relied on co-opted infrastructure.\n\n\n-----\n\n###### APT29 Targeting Organizations with QUIETEXIT Tunneler\n\nA secondary campaign by APT29 targeted multiple organizations, where the\ngroup proxied their traffic through compromised video conferencing cameras\n(largely LifeSize TelePresence devices). APT29 deployed the QUIETEXIT tunneler\nto route traffic through compromised environments. QUIETEXIT is a modified\nversion of the publicly available Dropbear software, which can provide an SSH\nreverse shell. APT29 meticulously targeted a specific subset of mailboxes, zeroing\nin on the executive teams and key employees involved in corporate development,\nmergers and acquisitions, large-scale business transactions, and IT security. The\ngroup utilized compromised usernames and passwords of privileged Exchange\naccounts to gain access and employed the use of \"GetFolder\" and \"FindFolder\"\nrequests to enumerate mailboxes of interest. By using a \"FindItem\" query filter\nagainst targeted folders, APT29 was able to harvest all mailbox items created\nsince their last data extraction.\n\n###### Outlook\n\nAPT29 is a highly active and sophisticated threat group that has conducted\nnumerous high-profile incidents globally. Most notably, the SolarWinds supply\nchain compromise that affected governments and corporations worldwide has\nbeen attributed to APT29 by Mandiant. Throughout 2022, alongside the ongoing\nRussian invasion of Ukraine, APT29 operations have concentrated on European\ndiplomatic entities, almost certainly to meet ongoing Russian intelligence priorities\nconcerning Western responses to the war and financial and military assistance\nprovided to Ukraine. As the war moves into its second year and Western governments\ndeepen their commitment to supporting Ukraine, Russia is likely to intensify these\ncyber espionage efforts to gather intelligence and shape Russia's posture in Ukraine\nand globally.\n\nAPT29 has continually refined and monitored their operations to maximize\neffectiveness and evade detection by minimizing C2 payload availability, using\nadvanced endpoint detection mitigation techniques and, in some campaigns,\nusing one-time encryption of payloads. APT29’s evasion techniques will likely\ncontinue as they seek to avoid detection and accomplish their mission.\n\n\n-----\n\n###### BASTA Ransomware\n\nIn mid-2022, Mandiant observed a significant shift in financially motivated activity\nfrom threat actors suspected to be based in Eastern Europe. In conjunction with\nincreased public coverage and scrutiny of CONTI-affiliated actors, BASTA (aka\nBlackBasta) ransomware emerged onto the scene. CONTI operators developed\na prolific crime syndicate that aggressively leveraged ransomware to extort\nvictims. At the time, Mandiant suspected BASTA to be a rebrand by CONTI\nransomware operators and affiliates, as a logical next step to avoid the increased\nscrutiny. Mandiant identified evidence to suggest at least one threat actor had\nincorporated BASTA ransomware into their operations as a direct replacement\nfor CONTI ransomware. CONTI operations were officially shut down in late May\n2022, shortly after the emergence of BASTA operations in April 2022. Mandiant\ncreated two campaigns to track active BASTA ransomware deployment efforts.\n\n\n80\n\n70\n\n\n60\n\n50\n\n\n40\n\n30\n\n\n20\n\n10\n\n\n0\n\n\nJanuary February March April May June\n\n\nBASTA CONTI\n\n**Figure 2. Victims added to CONTI and BASTA DLS sites (2022)**\n\n\n-----\n\n###### Highlighted Activity\n\n Financially Motivated Actor Gains Access to Organizations through Third Party to Deploy BASTA Ransomware  and Extort Victims\n\nIn June, Mandiant was made aware of a supply chain enabled compromise impacting\ncredit unions in western Canada via infrastructure managed by a shared service\nprovider. While gaining access via a third party is not novel, it is relatively rare for\nextortion operations. In some of these cases the actors responsible, which Mandiant\ntracks as UNC3973, used the SYSTEMBC tunneler for post-exploitation operations\nand attempted to deploy BASTA ransomware. Capitalizing on centralized access,\nUNC3973 utilized an unauthorized service account with domain administrator\nprivileges shared between a compromised MSSP and targeted organizations to\ngain access to each environment. The attackers then employed a batch script\nthat attempted to disable antivirus software and created a scheduled task to deploy\nSYSTEMBC, a tool used to proxy traffic through infected endpoints. However, the\nSYSTEMBC binary was detected and quarantined by the system's antivirus software.\nIn a further attempt to ransom the network, the attackers created a Windows service\nto launch the BASTA ransomware. Fortunately, the system's endpoint antivirus\nsoftware was able to detect and quarantine the malware regardless of attempted\ninterference from UNC3973.\n\n###### Suspected Financially Motivated Actor Obtains Access  via QAKBOT to Deploy BASTA Ransomware\n\nIn October 2022, Mandiant responded to multiple intrusions where attackers\ndeployed BASTA ransomware following a widespread QAKBOT phishing campaign.\nMandiant observed the distribution threat cluster UNC2633 leverage QAKBOT\nto gain initial access to target environments. The QAKBOT compromises were then\nleveraged to provide a second threat cluster, UNC4393, with access to environments\nof interest. UNC4393 then proceeded to deploy various tools, including BEACON\nand the SYSTEMBC tunneler, before using Rclone to steal data from the environment\nand deploying BASTA ransomware. In some cases, UNC4393 has monetized their\npresence in an environment within just a few days of gaining access. This rapid\npace is consistent with other threat clusters associated with CONTI. Historically,\nUNC2633 has also been a frequent collaborator with clusters Mandiant tracks within\nthe CONTI ecosystem.\n\n###### Outlook\n\nMandiant continues to cluster and track ransomware activity based on unique\nTTPs in order to evaluate the evolution of the criminal underground. While these\ntwo campaigns represent the use of BASTA ransomware, the components of the\nincidents shed light on how different actors complete missions using the same\nransomware variants. As law enforcement efforts continue to stymie the criminal\necosystem, ransomware operators reinvent ways to maintain operational speed and\nconsistency as they cycle through ransomware variants to carry out their missions.\n\n\n-----\n\n###### USB-based Compromises leading to Financially Motivated and Espionage Related Threat Actor Activity\n\nThroughout 2022, Mandiant observed several campaigns involving the use\nof infected USB drives and other external drives to spread malicious payloads.\nResponsible actors include a financially motivated group thought to be associated\nwith the larger Evil Corp ecosystem, and espionage groups acting in accordance with\nChinese nation-state interests. In response, Mandiant initiated multiple campaigns\nto track activity and threat clusters associated with the USB-based compromise.\n\n###### Highlighted Activity\n\n Actor of Unknown Motivation Distributes BIRDBAIT via Infected USB Drives\n\nThis campaign involves the execution of a worm propagated from USB-based\nstorage media by a threat cluster Mandiant tracks as UNC3840. The worm creates\nand launches a shortcut file containing an embedded command that executes the\nWindows Standard Installer binary, Msiexec.exe, to download and execute a remotely\nhosted payload. Mandiant observed a malware chain that included the BIRDBAIT LNK\ndownloader, DENSEDROP, and DENSELAUNCH. DENSEDROP, a highly obfuscated PE\n32-bit in-memory dropper, ultimately launches DENSELAUNCH, a C++ Win32 DLL\nloader that writes arbitrary code into designated process memory space. Notably, in\nincidents where UNC3840 utilized the BIRDBAIT LNK downloader, C2 infrastructure\ngenerally resolved to IP addresses that appear to be compromised network attached\nstorage (NAS) devices.\n\nEarly in the campaign there was little evidence of significant follow-on activity\nafter the deployment of DENSELAUNCH and DENSEDROP but the tracking of\nactivity throughout 2022 led to the identification of additional malware families\nsuch as FRUITBIRD. It is likely that FRUITBIRD, which is launched by DENSEDROP\nafter satisfying multiple environment checks, is being used to distribute additional\npayloads including malware, adware, and HOLA VPN installers. This activity suggests\nthe threat actors behind UNC3840 may be utilizing their malware as a pay-per-install\n(PPI) service which could provide an intrusion vector for other threat actors.\n\n\n-----\n\nWhile Mandiant’s insight into UNC3840 operations is limited, it is highly plausible\nthat UNC3840 distributes payloads or provides services like pay-per-install access\nto multiple third parties. Mandiant’s analysis of malware used by UNC3840 and\nother financially motivated threat actors has revealed potential overlaps with other\ntracked clusters. These overlaps include a packer that was leveraged in campaigns\ndistributing URSNIF, and use of the LONGFALL crypter (also referred to as CryptOne),\nwhich has been used by various malware families including some associated with\nEvil Corp. Mandiant has observed a small number of cases where the FAKEUPDATES\nmalware was deployed following UNC3840 infections. Threat actors that often use\naccess provided by FAKEUPDATES also contain overlaps with Evil Corp.\n\nThe identification of Msiexec.exe processes launched with command line arguments\nwhich contained a URI proved to be an effective means of detecting the download of\npotentially malicious payloads. Mandiant identified activity which was later clustered\nunder UNC3840 having occurred as early as September 2021.\n\n###### Suspected Espionage Actor with China Nexus Spreading Malware via Infected USB Devices\n\nMandiant identified malicious activity tracked as UNC4191 targeting a range of\npublic and private sector entities based primarily in Southeast Asia, but also in\nthe U.S., Europe, and Oceania. The activity began in April 2022 and continued\nthroughout the year, and leveraged infected USB devices as the initial intrusion\nvector for the campaign. In successful infections, malware deployment included\nthe launchers MISTCLOAK and BLUEHAZE, the latter of which executes a copy of\nthe ncat network utility to create a reverse shell to a hardcoded domain. Mandiant\nalso identified evidence of the DARKDEW dropper, which is capable of collecting\nfiles from air-gapped systems and further propagating by infecting attached\nremovable drives. Mandiant suspects this activity is indicative of Chinese operations\nintended to gain and maintain access to public and private entities in order to collect\nintelligence in support of China’s strategic political and commercial interests.\nBased on malware similarities with the TWOPIPE dropper, there is some indication\nthat UNC4191 activity is related to China-nexus operations associated with the actor\ntracked as UNC53. UNC53, also referred to as TEMP.Hex, is a prolific threat actor\nthat targets public and private sector organizations on a global scale, and is\nsuspected to be associated with China’s Ministry of State Security.\n\nFollowing the initial discovery of the UNC4191 campaign, Mandiant identified\nevidence of compromise leveraging MISTCLOAK, DARKDEW, and BLUEHAZE\nacross multiple organizations. As analysts worked through the process of triaging\nimpacted systems and notifying customers, Mandiant identified a pattern of\ntargeting where the affected systems were physically located in the Philippines.\nThis provided more context on regional targeting that Mandiant has observed\nto be consistent with various Chinese cyber espionage activities.\n\n\n-----\n\n###### Suspected Espionage Group with a China Nexus Conducts  USB Operations\n\nThroughout 2022, Mandiant observed the suspected China-nexus actor UNC53\ntarget a variety of industries across the globe. In some cases, UNC53 gained initial\naccess to targeted environments through infected USB drives, leveraging legitimate\nbinaries to side-load malicious DLLs and encrypted payloads that drop a SOGU\nvariant. This activity is likely part of a long-term effort to gain access to and\ncollect strategic data from multiple sectors around the globe, with activity involving\nthis SOGU variant reaching as far back as 2020. Previously observed operations\nsuspected to be linked to UNC53 also leveraged SOGU variants against multiple\nsectors in the Southeast Asia region in 2021.\n\nMandiant developed real-time detection signatures specific to these malware\nfamilies as well as additional detections content focused on identifying malware\nreplication through removable media. These efforts led to additional discoveries\nof USB-based compromise by UNC53 across multiple organizations along with\ndeployment of SOGU, KORPLUG, and FLOOPYSTAMP. Mandiant’s detection\ncapability not only resulted in increased detection of UNC53 compromises,\nbut also led to discovery of unrelated worm infections.\n\n###### Outlook\n\nCompromised removable devices are an effective technique for gaining access\nto a targeted environment and have resulted in impactful breaches. This initial\nintrusion vector and propagation mechanism has been leveraged by financially\nmotivated threat actors and by threat actors tasked with intelligence collection\nfor espionage purposes. Threat actors benefit from compromising systems that\nare a degree or two of separation from their intended target, such as hotel business\noffices and personal computers, that exist outside of an organization’s technical\ncontrols and monitoring. Without strict technical controls on removable drive\nusage, this proximity provides threat actors with continual opportunities to gain\naccess to an environment.\n\n\n-----\n\n###### Global Events—Notable Vulnerabilities\n\nVulnerability disclosure has always been a vital pillar of the security community.\nAs technology develops, spreads, and becomes embedded in the lives of people\naround the world, the identification and responsible disclosure of vulnerabilities\nwithin those technologies has served to protect people and their data. Public\ndisclosure of vulnerabilities became more commonplace and led to the necessary\nconversations about maintenance and patching as a practice not only in the\ntechnology space, but within the general public. The need to assess potential\nimpact, protect operations, and ultimately safeguard user data and experiences\nhas over the years become more and more valuable. Unsurprisingly, threat actors\nof every type have learned similar lessons.\n\nAs new vulnerabilities are discovered, questions commonly arise around whether\nattackers are already using the vulnerability to further their goals. If data doesn't\nexist to support the idea that organizations are being successfully targeted using\nthe vulnerability, it’s often not for lack of trying on the attacker’s part. Since the\nprocess of addressing newly released vulnerabilities is an exercise in cost-benefit\nanalysis, a vulnerability that represents risk to the user is likely an unequal\nopportunity for threat actors. While operations teams must meet Service Level\nAgreements with respect to availability, threat actors are under no such limitation.\nWhere Systems Administrators need time to test and validate patches, threat\nactors need only the barest coverage in proof-of-concept (PoC) code to start\ntargeting those organizations.\n\nThis interplay of the need to react and the opportunity to attack gave rise to a\nprocess within Mandiant that we refer to as a \"Global Event.\" Mandiant initiates\na Global Event when the disclosed vulnerability represents a great enough threat,\nand malicious actors are observed attempting to exploit it in the wild. Of the over\n20,000 vulnerabilities disclosed and published as CVEs in 2022, Mandiant initiated\nnine Global Events based on a variety of assessment criteria. Throughout 2022,\nMandiant worked to track exploitation of and provide detections for several\nsignificant vulnerabilities, including Log4Shell, Follina, and a series of\nvulnerabilities impacting VMWare.\n\n\n-----\n\n###### Log4Shell\n\n\nOn December 09, 2021, a vulnerability in the Java logging framework Log4j was\npublicized by the Lunasec team and dubbed Log4Shell. The vulnerability allowed\nfor arbitrary Java code execution through malicious user input when processed\nvia the Java Naming and Directory Interface (JNDI) features in Log4j. Apache, which\nowns the Log4j project, gave the vulnerability a 10, the highest possible rating, in the\nCommon Vulnerability Scoring System (CVSS), and the vulnerability was published as\nCVE-2021-44228. Due to the vulnerability existing in Log4j since 2013 and the broad\nusage of Log4j as a logging framework, estimates of the potential impact appeared\nto be widespread and necessitated the immediate review of existing codebases in\nproducts and platforms around the world. Mandiant rated the risk associated with\nLog4Shell as Critical based on the public availability of PoC code as well as the trivial\nnature of the exploit, and anticipated exploitation of the vulnerability to begin and\nramp up quickly in intensity and scope. Mandiant initiated a Global Event in response\nto Log4Shell on December 10, 2021, and, due to the extensive nature of compromises\nidentified, continued the workflows well into 2022.\n\nPredictions that the risk presented by Log4Shell would be global in nature\nwere quickly proven to be accurate. Mandiant observed widespread scanning\nand exploitation attempts across a variety of customers by numerous distinct\nthreat actors resulting in the deployment of a diverse set of malware. Few industry\nverticals, if any, were spared in the near constant scanning and subsequent\nexploitation attempts following the publication of PoC code. By the close of the\nGlobal Event workflows, over 1,000 IP addresses associated with attempted and\nsuccessful exploitation of Log4Shell had been published to Mandiant’s collection\nof indicators.\n\nThe ubiquitous presence of Log4j as a supporting library in larger applications\nfurther complicated efforts to secure environments. While vendors prioritized\nthe identification and patching of vulnerable products, legacy products presented\na substantial risk to both the continuity of business operations and the security\nof the environments in which they existed. Patches for legacy applications that use\nLog4j were often delayed or, in some cases, never provided. In the event that a legacy\nproduct could not be patched, organizations were reliant on significant mitigation\nefforts that required regular maintenance and review. Mandiant recommended\nmitigations in the form of isolation and monitoring for any instance of a vulnerable\nversion of Log4j. As organizations performed initial scoping for the Log4Shell\nvulnerability, business critical products that could not be brought offline could,\ninstead, have network ingress and egress restricted to limit risk while solutions\nor replacements were pursued. Restricting access to the application interfaces\nof impacted products aids in reducing the potential attack surface while limiting\negress traffic prevents the Java service from accessing malicious class files used\nduring exploitation. When paired with monitoring and filtering of both outbound DNS\nrequests from and inbound HTTP requests to impacted products, organizations\nthat could not patch in the near term would have what amounts to an early warning\nsystem for potential impact as exploitation attempts of Log4Shell began to intensify.\n\n\n-----\n\nExploitation of Log4Shell followed a pattern commonly seen with high criticality\nvulnerabilities in products with large scale deployments. Opportunistic attackers\nquickly targeted organizations through the vulnerability to earn easy wins and install\ncryptominers in wide scale attacks. However, in short order, actors leveraged the\nvulnerability in ransomware campaigns as a means of gaining an initial foothold into\nmore rewarding targets. While Log4Shell impacted a large swath of Java-based\nplatforms from Minecraft to Apple iCloud, services such as the mobile device\nmanagement platform MobileIron stood out from the pack in terms of targeting.\nMandiant observed groups such as UNC961 leveraging the Log4Shell vulnerability\nwithin HTTP header Cookie values within days of the publication of the vulnerability.\nUNC961, a financially motivated threat actor, is notable for its ability to capitalize\non vulnerabilities that represent a broad opportunity for target selection, and favors\nweb-based exploitation as a means of initial access. UNC961 crafted malicious\nrequests to the MobileIron instances that would provide reverse-shell capabilities\nto the threat actor once the request was processed through Log4j. UNC961 took\nsteps to hinder forensic analysis once successful exploitation had been achieved\nbefore seeking to establish persistence within the environment. UNC961 would also\nmove from a simple reverse shell to a variant of the HOLEPUNCH tunneler capable\nof multiplexing connections back to command and control nodes.\n\nFinally, cyber espionage groups wasted no time in exploiting critical services, which\nincluded using Log4j as a means to gain an initial foothold and progress toward their\nobjectives. Mandiant observed APT41, a Chinese state-sponsored espionage group,\ntarget vulnerable MobileIron deployments in a similar fashion as UNC961. APT41\nwas observed targeting government entities, telecom companies, and financial\norganizations. Similarly, APT41’s post-exploitation activity included anti-forensics\ntechniques and pivoting from a simple reverse shell to a more feature-rich backdoor.\nWhile the methodologies of groups such as UNC961 and APT41 bear a resemblance\nin these instances, such distinction is driven primarily by the limitations of the\nenvironment and the quick turnaround time on Log4Shell PoC code.\n\nIn total, Mandiant published 1,632 indicators related to threat actor activity\nwith Log4Shell during the Global Event.\n\n\n-----\n\n###### Follina\n\n\nIn late March of 2022, Mandiant observed multiple suspected Chinese espionage\nclusters exploiting a zero-day vulnerability in the Microsoft Diagnostic Tool (MSDT)\nthat allowed for the execution of arbitrary code. The vulnerability, published by\nMicrosoft on May 30, 2022, was given the CVE identifier CVE-2022-30190 and\ncame to be known as “Follina.” While the vulnerability was given a 7.8 CVSS score,\nit requires the attacker to craft a special URL to call to MSDT, and for the user to open\nit on a vulnerable system, which influenced Mandiant's \"Medium Risk\" assessment.\nFollowing publication by Microsoft, Mandiant observed increased exploitation of\nFollina from government backed threat groups and financially motivated attackers.\n\nThe documents leveraged to deliver the Follina exploits during these operations\nwere all likely delivered via spear phishing and, based on the document creation dates\nand sample submissions, operations exploiting the vulnerability began in\nlate March or early April 2022. Despite a lack of widespread exploitation, Mandiant\nobserved UNC3347, UNC3784, and UNC3819 leverage the Follina vulnerability to\ntarget organizations in India, Nepal, Belarus, Russia, and the Philippines. While\nthese threat clusters are distinct, all three are associated with suspected Chinese\ncyber espionage activity. The distribution of a zero-day exploit to multiple Chinese\nthreat groups, covering a broad geographic region, is consistent with the theory of a\ncentralized digital quartermaster supporting Chinese cyber espionage. Similarly, the\ndistribution of malware across multiple clusters presents a challenge to attribution,\nmaking it more difficult to differentiate specific Chinese threat group activity.\n\nBoth UNC3784 and APT28, Russian and suspected Chinese espionage groups,\nleveraged Follina in their attempts to target government organizations. In early June\nof 2022, APT28 compromised a government organization in EMEA using a password\nspraying attack, and used the compromised email account to send spear phishing\nemails to organizations in Ukraine. UNC3784 deployed backdoors and downloaders\nagainst government organizations in Southeast Asia.\n\nWhile the elevated difficulty of exploitation may have restricted use of Follina to\nthreat actors that selectively target organizations, Mandiant did observe instances\nwhere Follina was used for potential financial gain as well. A distribution threat\ncluster which Mandiant tracks as UNC2633 began to exploit Follina in early June of\n2022 to deliver variants of the backdoor QAKBOT. UNC2633 has historically targeted\nbroad selections of industries and is often observed as a precursor to ransomware\noperations. Mandiant also observed threat actors operating in underground forums\nadvertising private exploits that would enable other threat actors to exploit Follina.\nThe availability of exploit code implies additional actors may attempt to exploit\nFollina in future campaigns.\n\nMandiant published 84 indicators related to threat actor activity with Follina.\n\n\n-----\n\n###### VMware Vulnerability Chaining\n\nOn May 18, 2022, the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nissued an Emergency Directive[4] regarding threat actors chaining vulnerabilities\nin VMware products to gain privileged access to target systems. The vulnerabilities\nin question, CVE-2022-22954, CVE-2022-22960, CVE-2022-22972, and CVE-202222973, impact multiple VMware products and, when used together, may result in\nprivilege escalation or remote code execution. In specific, CVE-2022-22954, which\nhad been published on April 6, 2022, detailed a vulnerability that allows an attacker\nto perform server-side template injection on vulnerable instances of VMware’s\nWorkspace ONE Access product. Mandiant’s analysis of CVE-2022-22954 provided\na risk rating of High given the public availability of exploit code and confirmed\nexploitation of the vulnerability in the wild.\n\nCISA’s directive required federal agencies to mitigate the associated risks after\nreports of widespread exploitation, and led to speculation on potential impacts\nfor both government entities and private organizations. Given the ubiquity of\nVMware, high concerns regarding the vulnerabilities and a need to triage potential\nexploitation attempts led to Mandiant’s initiation of a Global Event on May 23, 2022.\nMandiant observed evidence to indicate successful exploitation of CVE-2022-22954\nas early as April 8, 2022, two days after the vulnerability was disclosed by VMware.\nInitial exploitation attempts appeared to successfully dump credentials from\nvulnerable VMware applications by accessing the /etc/shadow and /etc/passwd files.\n\nMandiant observed financially motivated attackers and suspected Russian\nnexus attackers exploit CVE-2022-22954. The vulnerability was also exploited by\nUNC3905, a ransomware-as-a-service affiliate that has carried out data exfiltration\nagainst U.S.-based organizations. UNC961, which has provided access to targeted\norganizations on at least two occasions, targeted vulnerable VMware appliances\nand used the scripting language Perl to download second stage malware from\nattacker-controlled infrastructure on April 16, 2022. On the other end of the\nspectrum, threat clusters UNC3711 and suspected Russian threat actor UNC3810\nexploited CVE-2022-22954 for what appears to be international operations.\nBoth UNC3711 and UNC3810 were observed exploiting the vulnerability to deliver\ndestructive malware to organizations in Ukraine as early as April 19, 2022.\n\nDuring the Global Event, Mandiant published 67 IP addresses, seven URLs, and two\nfile hashes associated with observed attacker activity to aid organizations in their\nattempts to triage potential exploitation attempts.\n\n\n-----\n\n###### Conclusion\n\n\nEvery security organization understands there are simply too many threat actors\nand vulnerabilities to track, mitigate, or otherwise address while maintaining\nbusiness operations. It is imperative that organizations use a data-driven approach\nto prioritize security efforts based on relative risk and on-the-ground intelligence.\nMandiant’s Campaigns and Global Events initiative seeks to centralize actionable\nindicators of threat actor activity to assist organizations in the identification of\nactivity likely to impact multiple organizations. While Campaigns tracking threat\nactor efforts and Global Events tracking potential compromise of vulnerabilities\ndiffer slightly, the intention behind both is to enable the efficient identification\nof compromises impacting organizations.\n\nMandiant assembles cross-functional teams from threat intelligence, forensics,\nincident response services, and beyond to consolidate as much information as is\navailable from the onset of an impactful set of intrusions that fall within the bounds\nof a Campaign or Global Event. Contributors to the Campaigns and Global Events\nare tasked with assessing the potential impact to organizations, collecting and\nassessing new intelligence, and developing and deploying new detections. The\nrapid provisioning of intelligence analysis to potential victims allows them to make\nbetter-informed decisions about how and when to implement security measures.\nMandiant’s Managed Defense service both contributes to and pulls threat intelligence\nfrom the aggregated Global Event data to safeguard customer networks directly,\nand in many cases, provides analysis before customers are impacted by a threat.\n\n\n-----\n\n# Notable and Recently Graduated Threat Groups\n\n\n-----\n\n###### How a Threat Cluster Becomes  an APT or FIN Group\n\nMandiant analysts review threat activity data from a variety of sources such\nas Mandiant incident response engagements, Managed Defense investigations,\nand security product telemetry to identify noteworthy clusters. When there is\nenough activity, but insufficient evidence to immediately attribute it to an existing\nthreat actor or group, Mandiant creates an uncategorized (UNC) threat cluster to\ntrack the newly identified activity.\n\nAn UNC (previously referred to as TEMP) is a cluster of cyber activity that includes\nobservable artifacts such as adversary infrastructure, tools, and tradecraft. UNCs\nare based on a defining, anchoring characteristic often discovered during a single\nincident. For example, a common anchor would be a malware sample that connects\nto an actor-controlled domain.\n\nAs our knowledge of a threat cluster matures, we may graduate it to an Advanced\nPersistent Threat (APT) group or financially motivated (FIN) group. APT groups are\ngenerally characterized by a focus on espionage operations, whereas FIN groups\nare characterized by criminal operations with a focus on monetization activities via\nmethods such as ransomware deployment, payment card data theft, or business\nemail compromise.\n\nIn 2022, Mandiant promoted one tracked threat cluster from “TEMP” designation\nto “APT” designation. In this report, we review APT42, an Iran-nexus espionage\nthreat group.\n\n\n-----\n\n###### APT42 Conducts Highly Targeted Surveillance Operations\n\nIn August 2022, Mandiant graduated UNC788 to APT42. Active since at least 2015,\nAPT42 is a sophisticated cyber threat group that conducts espionage operations\nusing highly targeted spear phishing and social engineering techniques. APT42\nlikely operates on behalf of the Islamic Revolutionary Guard Corps (IRGC) Intelligence\nOrganization (IRGC-IO) based on targeting patterns that align with the organization's\noperational mandates and priorities, including defending the regime against internal\nand external threats, pursuing perceived domestic enemies, and confronting\n\"revolutionary\" ideas emanating from the West.\n\n###### Global Targeting of Iranian Regime Opponents\n\nAPT42 operations largely focus on the Middle East region and primarily target\norganizations and individuals deemed opponents of the Iranian regime. APT42\nhas consistently targeted Western think tanks, researchers, journalists, current\nWestern government officials, former Iranian government officials, and the Iranian\ndiaspora abroad.\n\nSome APT42-linked activity indicates the group alters its operational focus as Iran’s\npriorities evolve. With the onset of the COVID-19 pandemic in March 2020, Mandiant\nobserved a shift to include operations targeting the pharmaceutical sector. APT42\nsimilarly shifted targeting to domestic and foreign-based opposition groups prior\nto the Iranian presidential election.\n\n###### Building Trust and Rapport\n\nAPT42 often attempts to build rapport with their target by impersonating journalists\nor researchers and engaging the target in benign conversation for multiple days\nor weeks before sending a malicious link. In some cases, the group has infiltrated\nemail accounts and then targeted colleagues, acquaintances, and relatives of initial\nvictims. APT42 operations have also included credential harvesting to collect\nmulti-factor authentication (MFA) codes to bypass authentication methods.\n\nBetween March and June of 2021, APT42 used a compromised email account\nbelonging to a U.S.-based think tank employee to target Middle East researchers\nat other think tanks and academic organizations, U.S. government officials involved\nin Middle East and Iran policy, a former Iranian government official, and high-ranking\nmembers of an Iranian opposition group. APT42 posed as a well-known journalist\nrequesting an interview and engaged the initial target for 37 days to gain their trust\nbefore finally directing them to a credential harvesting page.\n\nIn other instances, APT42 provided a Dropbox link to a PDF with an embedded\nURL-shortening link that led to a credential harvesting page. After sending an email\nfrom the compromised inbox, they attempted to cover their tracks by deleting the\nmessage from the victim's Sent folder. They also made careful attempts to access\ntheir targets’ personal email accounts. APT42 bypassed multi-factor authentication\nby capturing SMS-based one-time passwords and setting up two-factor verification.\n\n\n-----\n\n###### Surveillance Operations \n\nAPT42 also leverages mobile malware to conduct surveillance against individuals\nof interest. Targets include those connected to the Green Movement in Iran and\nother political targets.\n\nAPT42 has also targeted individuals who claimed to be able to provide tools to\nbypass government restrictions. During surveillance operations, APT42 has\ndeployed VINETHORN and PINEFLOWER Android mobile malware to track victim\nlocations, record phone conversations, access videos and images, and extract\nentire SMS inboxes.\n\n###### Use of Custom Tools \n\nAPT42 operations are heavily focused on credential harvesting, but they also use\nseveral custom backdoors and tools. In September 2021, APT42 used a compromised\nEuropean government email account to send a phishing email to nearly 150 email\naddresses associated with individuals or entities employed by or affiliated with\ncivil society, government, or intergovernmental organizations around the world.\nThe email purported to be related to the organizational chart of an embassy in\nTehran and contained a link to a malicious macro document, which led to TAMECAT\nmalware, a PowerShell toehold backdoor.\n\nFrom January to March 22, APT42 leveraged various tactics, including hosting\nmalicious Office documents on file-sharing platforms to deliver spear-phishing\nemails, and hosting malicious PowerShell code designed to retrieve payloads,\nincluding custom reconnaissance tools to collect system information and local\naccount names.\n\n###### Outlook\n\nAPT42 activity poses a threat to foreign policy officials, commentators, and\njournalists working on Iran-related projects particularly those in the United\nStates, the United Kingdom, and Israel. Additionally, the group’s surveillance\nactivity highlights the real-world risk to individual targets, including Iranian\ndual-nationals, former government officials, and dissidents both inside Iran\nand those who previously left the country.\n\nGiven the long history of activity and imperviousness to infrastructure takedowns\nand media reports, we do not anticipate significant changes to APT42’s operational\ntactics and mandate. Nevertheless, the group has displayed an ability to rapidly alter\nits operational focus as Iran’s priorities change over time with evolving domestic and\ngeopolitical conditions.\n\n\n-----\n\n# Conclusion\n\n\n-----\n\nIn M-Trends 2023, we have highlighted positive trends such as improved detection\ntimes, and more challenging ones such as the situation in Ukraine and the merging\nof the real and cyber worlds. But these are not the only observations and takeaways.\n\nOverall, attackers are not giving up. In fact, we’re seeing attackers cause bigger\nimpacts with less skills. They’re also more brazen, and willing to get much more\naggressive and personal to achieve their goals. They will bully and threaten, and\nignore the traditional cyber rules of engagement. It’s not enough to just protect\nsystems these days, employees need to be protected as well.\n\nTo ensure our customers are protected against the latest and most relevant tactics,\ntechniques and procedures, we have adopted these same brazen tactics in our red\nteam engagements. As shared in our case study, part of how we gained initial access\nwas by showing up in person pretending to be a technician—a bold tactic. We’re\nseeing increased focus on cyber hygiene, which is great, but organizations must\ncontinue to be vigilant in all forms of security.\n\nPreparation is vital, but performing red team engagements isn’t the only way to\nbe ready. Organizations should consider tabletop exercises, training exercises,\nand other techniques. Sound fundamentals, such as vulnerability and exposure\nmanagement, least privilege, and hardening also play a role in building strong\ndefenses. Cloud considerations are also important. Our red team case study\ndemonstrates just how challenging security can be in hybrid networks connected\nto the cloud.\n\nOur mission at Mandiant is to ensure every organization is secure from cyber threats\nand confident in their readiness. Our Campaigns and Global Events article highlights\nhow Mandiant shares valuable intelligence and indicators to help our clients and the\ncommunity protect themselves from significant campaigns and vulnerabilities.\n\nThe annual M-Trends report, featuring data and learnings from our engagements,\nalso plays a big part in advancing our mission.\n\nAt the heart of any cyber defense capability is the intelligence that drives it, and\nthe best threat intelligence is gleaned directly from the frontlines. Mandiant will\ncontinue to share its frontline knowledge in M-Trends to improve our collective\nsecurity awareness, understanding, and capabilities—and to ensure that\norganizations can stay relentless in their cyber security efforts.\n\n\n-----\n\n###### Bibliography\n\n\n**1. \"Apache Log4j Vulnerability Guidance\". Cybersecurity and Infrastructure**\nSecurity Agency, https://www.cisa.gov/news-events/news/apache-log4jvulnerability-guidance\n\n**2. \"Threat Actors Exploiting F5 BIG-IP CVE-2022-1388\". Cybersecurity and**\nInfrastructure Security Agency, https://www.cisa.gov/news-events/\ncybersecurity-advisories/aa22-138a\n\n**3. \"Threat Actors Chaining Unpatched VMware Vulnerabilities for Full System**\nControl\". Cybersecurity and Infrastructure Security Agency, https://www.cisa.\ngov/news-events/cybersecurity-advisories/aa22-138b\n\n**4. Vanderlee, Kelli. \"DebUNCing Attribution: How Mandiant Tracks Uncategorized**\n[Threat Actors\". Mandiant, https://www.mandiant.com/resources/blog/how-](https://www.mandiant.com/resources/blog/how-mandiant-tracks-uncategorized-threat-actors)\n[mandiant-tracks-uncategorized-threat-actors](https://www.mandiant.com/resources/blog/how-mandiant-tracks-uncategorized-threat-actors)\n\n**5. Franceschi-Bicchierai, Lorenzo. \"FBI accuses North Korean government**\nhackers of stealing $100M in Harmony bridge theft\". TechCrunch, https://\ntechcrunch.com/2023/01/24/north-korea-fbi-harmony-horizon-crypto/\n\n\n-----\n\nLearn more at [www.mandiant.com](http://www.mandiant.com)\n\n###### Mandiant About Mandiant\n\n\n11951 Freedom Dr, 6th Fl, Reston, VA 20190\n(703) 935-1700\n833.3MANDIANT (362.6342)\ninfo@mandiant.com\n\n\nMandiant is a recognized leader in dynamic cyber defense, threat\nintelligence and incident response services. By scaling decades of\nfrontline experience, Mandiant helps organizations to be confident\nin their readiness to defend against and respond to cyber threats.\nMandiant is now part of Google Cloud.\n\n\n©2023 Mandiant, Inc. All rights reserved. Mandiant and M-Trends are registered trademarks of\nMandiant, Inc. All other brands, products, or service names are or may be trademarks or service marks\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/m_trends_2023_report.pdf"
    ],
    "report_names": [
        "m_trends_2023_report.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a2dd0e8-beea-415c-b90d-4df9da8358ae",
            "created_at": "2024-09-20T02:00:04.575485Z",
            "updated_at": "2025-03-27T02:00:03.414386Z",
            "deleted_at": null,
            "main_name": "UNC2970",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2970",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1f3cf3d1-4764-4158-a216-dd6352e671bb",
            "created_at": "2022-10-25T15:50:23.837615Z",
            "updated_at": "2025-03-27T02:00:55.556414Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "APT19",
                "Codoso",
                "C0d0so0",
                "Codoso Team",
                "Sunshop Group"
            ],
            "source_name": "MITRE:APT19",
            "tools": [
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "575d8adf-f451-4110-b1c0-89fb463e99c0",
            "created_at": "2022-10-25T16:07:23.637493Z",
            "updated_at": "2025-03-27T02:02:09.900204Z",
            "deleted_at": null,
            "main_name": "FIN13",
            "aliases": [],
            "source_name": "ETDA:FIN13",
            "tools": [
                "BLUEAGAVE",
                "BUSTEDPIPE",
                "CLOSEWATCH",
                "GetUserSPNS.vbs",
                "GoBot2",
                "HOTLANE",
                "JSPRAT",
                "MAILSLOT",
                "PowerSploit",
                "ProcDump",
                "SHELLSWEEP",
                "SIXPACK",
                "SPINOFF",
                "SWEARJAR",
                "Tiny SHell",
                "nmap",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a2d3f35f-3b29-4509-bff5-af2638140d39",
            "created_at": "2022-10-25T16:07:23.633982Z",
            "updated_at": "2025-03-27T02:02:09.898653Z",
            "deleted_at": null,
            "main_name": "FIN12",
            "aliases": [],
            "source_name": "ETDA:FIN12",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "0bce7575-ba34-4742-afb7-a4d3ade12dbe",
            "created_at": "2023-11-14T02:00:07.091122Z",
            "updated_at": "2025-03-27T02:00:03.221412Z",
            "deleted_at": null,
            "main_name": "XakNet",
            "aliases": [
                "UAC-0100",
                "UAC-0106"
            ],
            "source_name": "MISPGALAXY:XakNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b0f6e3c5-5424-463a-ada3-532ca52e5940",
            "created_at": "2023-11-17T02:00:07.60381Z",
            "updated_at": "2025-03-27T02:00:03.233568Z",
            "deleted_at": null,
            "main_name": "UNC4191",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC4191",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7aa1288a-61ec-4793-b543-9fedc26b9b03",
            "created_at": "2023-11-01T02:01:06.805323Z",
            "updated_at": "2025-03-27T02:00:55.555589Z",
            "deleted_at": null,
            "main_name": "FIN13",
            "aliases": [
                "FIN13",
                "Elephant Beetle"
            ],
            "source_name": "MITRE:FIN13",
            "tools": [
                "Impacket",
                "Mimikatz",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c1eadfd8-6e9c-4024-902d-555c9530fcea",
            "created_at": "2023-01-06T13:46:38.645834Z",
            "updated_at": "2025-03-27T02:00:02.881844Z",
            "deleted_at": null,
            "main_name": "TEMP.Hermit",
            "aliases": [],
            "source_name": "MISPGALAXY:TEMP.Hermit",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c306e698-3b48-46d7-b571-3dfa0c828379",
            "created_at": "2023-05-16T02:02:09.957677Z",
            "updated_at": "2025-03-27T02:00:03.129777Z",
            "deleted_at": null,
            "main_name": "APT43",
            "aliases": [],
            "source_name": "MISPGALAXY:APT43",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d61cd7ed-6d16-491f-90a1-6323aae8f67f",
            "created_at": "2022-12-27T17:02:23.610663Z",
            "updated_at": "2025-03-27T02:02:10.194354Z",
            "deleted_at": null,
            "main_name": "UNC4191",
            "aliases": [],
            "source_name": "ETDA:UNC4191",
            "tools": [
                "BLUEHAZE",
                "DARKDEW",
                "HIUPAN",
                "MISTCLOAK",
                "NCAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0e8337e-16a7-48f2-90cf-8fd09a7198d1",
            "created_at": "2023-03-04T02:01:54.091301Z",
            "updated_at": "2025-03-27T02:00:03.119447Z",
            "deleted_at": null,
            "main_name": "APT42",
            "aliases": [
                "UNC788",
                "CALANQUE"
            ],
            "source_name": "MISPGALAXY:APT42",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3b908de-3dd1-4e5d-ba24-5af8217371f0",
            "created_at": "2023-10-03T02:00:08.510742Z",
            "updated_at": "2025-03-27T02:00:03.139677Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "Scatter Swine",
                "Storm-0971",
                "UNC3944",
                "Scattered Swine",
                "Octo Tempest",
                "0ktapus",
                "DEV-0971",
                "Starfraud",
                "Muddled Libra",
                "Oktapus"
            ],
            "source_name": "MISPGALAXY:Scattered Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "16f2436b-5f84-44e3-a306-f1f9e92f7bea",
            "created_at": "2023-01-06T13:46:38.745572Z",
            "updated_at": "2025-03-27T02:00:02.907444Z",
            "deleted_at": null,
            "main_name": "APT40",
            "aliases": [
                "ISLANDDREAMS",
                "TEMP.Jumper",
                "BRONZE MOHAWK",
                "GADOLINIUM",
                "KRYPTONITE PANDA",
                "TA423",
                "MUDCARP",
                "Gingham Typhoon",
                "TEMP.Periscope",
                "G0065",
                "ATK29",
                "Red Ladon",
                "ITG09"
            ],
            "source_name": "MISPGALAXY:APT40",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "59be3740-c8c7-47aa-84c8-e80d0cb7ea3a",
            "created_at": "2022-10-25T15:50:23.481057Z",
            "updated_at": "2025-03-27T02:00:55.480695Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "MUDCARP",
                "Kryptonite Panda",
                "Gadolinium",
                "BRONZE MOHAWK",
                "TEMP.Jumper",
                "APT40",
                "TEMP.Periscope",
                "Gingham Typhoon"
            ],
            "source_name": "MITRE:Leviathan",
            "tools": [
                "Windows Credential Editor",
                "BITSAdmin",
                "HOMEFRY",
                "Derusbi",
                "at",
                "BLACKCOFFEE",
                "BADFLICK",
                "gh0st RAT",
                "PowerSploit",
                "MURKYTOP",
                "NanHaiShu",
                "Orz",
                "Cobalt Strike",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "47fa514e-15a8-4adb-a782-e2ffb12944d8",
            "created_at": "2024-04-24T02:00:49.644637Z",
            "updated_at": "2025-03-27T02:00:55.560836Z",
            "deleted_at": null,
            "main_name": "UNC788",
            "aliases": [
                "UNC788"
            ],
            "source_name": "MITRE:UNC788",
            "tools": [
                "HilalRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1691c25f-1aa4-4168-8ce2-7aa8f23246e7",
            "created_at": "2024-06-04T02:03:07.724221Z",
            "updated_at": "2025-03-27T02:05:17.284601Z",
            "deleted_at": null,
            "main_name": "BRONZE PRESIDENT",
            "aliases": [
                "Mustang Panda ",
                "Red Lich ",
                "Temp.Hex ",
                "HoneyMyte "
            ],
            "source_name": "Secureworks:BRONZE PRESIDENT",
            "tools": [
                " Cobalt Strike",
                " ORat",
                " PlugX",
                " RCSession",
                "China Chopper"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e424a2db-0f5a-4ee5-96d2-5ab16f1f3824",
            "created_at": "2024-06-19T02:03:08.062614Z",
            "updated_at": "2025-03-27T02:05:17.373121Z",
            "deleted_at": null,
            "main_name": "GOLD HARVEST",
            "aliases": [
                "Scatter Swine ",
                "Scattered Spider ",
                "UNC3944 ",
                "Roasted 0ktapus "
            ],
            "source_name": "Secureworks:GOLD HARVEST",
            "tools": [
                " ConnectWise Control",
                " LogMeIn",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "908cf62e-45cd-492b-bf12-d0902e12fece",
            "created_at": "2024-08-20T02:00:04.543947Z",
            "updated_at": "2025-03-27T02:00:03.40876Z",
            "deleted_at": null,
            "main_name": "UNC4393",
            "aliases": [
                "CURLY SPIDER",
                "STAC5777",
                "Storm-1811"
            ],
            "source_name": "MISPGALAXY:UNC4393",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f57e32ac-9f90-471d-93ba-7f6d8b05e6c1",
            "created_at": "2023-01-06T13:46:39.29882Z",
            "updated_at": "2025-03-27T02:00:03.044264Z",
            "deleted_at": null,
            "main_name": "FIN13",
            "aliases": [
                "TG2003",
                "Elephant Beetle"
            ],
            "source_name": "MISPGALAXY:FIN13",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d093e8d9-b093-47b8-a988-2a5cbf3ccec9",
            "created_at": "2023-10-14T02:03:13.99057Z",
            "updated_at": "2025-03-27T02:02:09.728121Z",
            "deleted_at": null,
            "main_name": "Scattered Spider",
            "aliases": [
                "0ktapus",
                "LUCR-3",
                "Muddled Libra",
                "Octo Tempest",
                "Scatter Swine",
                "Scattered Spider",
                "Star Fraud",
                "Storm-0875",
                "UNC3944"
            ],
            "source_name": "ETDA:Scattered Spider",
            "tools": [
                "ADRecon",
                "AnyDesk",
                "ConnectWise",
                "DCSync",
                "FiveTran",
                "FleetDeck",
                "Govmomi",
                "Hekatomb",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Lumma Stealer",
                "LummaC2",
                "Mimikatz",
                "Ngrok",
                "PingCastle",
                "ProcDump",
                "PsExec",
                "Pulseway",
                "Pure Storage FlashArray",
                "Pure Storage FlashArray PowerShell SDK",
                "RedLine Stealer",
                "Rsocx",
                "RustDesk",
                "ScreenConnect",
                "SharpHound",
                "Socat",
                "Spidey Bot",
                "Splashtop",
                "Stealc",
                "TacticalRMM",
                "Tailscale",
                "TightVNC",
                "VIDAR",
                "Vidar Stealer",
                "WinRAR",
                "WsTunnel",
                "gosecretsdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "83025f5e-302e-46b0-baf6-650a4d313dfc",
            "created_at": "2024-05-01T02:03:07.971863Z",
            "updated_at": "2025-03-27T02:05:17.278721Z",
            "deleted_at": null,
            "main_name": "BRONZE MOHAWK",
            "aliases": [
                "Flaccid Rose ",
                "GADOLINIUM ",
                "Kryptonite Panda ",
                "Leviathan ",
                "Nanhaishu ",
                "Pickleworm ",
                "Temp.Jumper ",
                "Temp.Periscope ",
                "APT40 "
            ],
            "source_name": "Secureworks:BRONZE MOHAWK",
            "tools": [
                " BlackCoffee",
                " China Chopper",
                " Cobalt Strike",
                " Derusbi",
                " Derusbi Trojan",
                " FUSIONBLAZE",
                " GreenCrash",
                " HOMEFRY",
                " MURKYTOP",
                " Metasploit",
                " Metasploit / Meterpreter",
                " Nanhaishu",
                " Orz",
                " ScanBox",
                " SeDll",
                "AIRBREAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "50fd5da4-c2f3-4a35-aebe-14f86fd567cb",
            "created_at": "2025-03-04T02:00:02.997969Z",
            "updated_at": "2025-03-27T02:00:03.482877Z",
            "deleted_at": null,
            "main_name": "UNC3973",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC3973",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1741053816,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1681976015,
    "ts_modification_date": 1681976179,
    "files": {
        "pdf": "https://archive.orkl.eu/2a02f9e9e4b065166a08c111990f10f362621939.pdf",
        "text": "https://archive.orkl.eu/2a02f9e9e4b065166a08c111990f10f362621939.txt",
        "img": "https://archive.orkl.eu/2a02f9e9e4b065166a08c111990f10f362621939.jpg"
    }
}