{
    "id": "28ee9a73-6c39-4981-9228-84797df77db0",
    "created_at": "2023-01-12T15:09:46.108596Z",
    "updated_at": "2025-03-27T02:16:59.307252Z",
    "deleted_at": null,
    "sha1_hash": "f65f30fd5896bf9b958187c2a4797f379878ecd7",
    "title": "2017-08-18 - KOVTER- An Evolving Malware Gone Fileless",
    "authors": "",
    "file_creation_date": "2022-05-28T19:03:30Z",
    "file_modification_date": "2022-05-28T19:03:30Z",
    "file_size": 889919,
    "plain_text": "# KOVTER: An Evolving Malware Gone Fileless\n\n**[trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/kovter-an-evolving-malware-gone-fileless](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/kovter-an-evolving-malware-gone-fileless)**\n\n**_by John Sanchez (Trend Micro Threat_**\n\n**_Researcher)_**\n\nWhile a large number of malware come and go, rarely seen after their initial campaigns,\nsome have remained strong through the years. A common feature of the most persistent\nmalware is their ability to evolve: their initial infection methods, behaviors and payloads\nrarely stay unchanged.\n\n[KOVTER (detected by Trend Micro as KOVTER family) is one example of a constantly](https://esupport.trendmicro.com/en-us/home/index.aspx)\n[evolving malware. Initially starting out as a police ransomware, it eventually evolved into a](http://blog.trendmicro.com/trendlabs-security-intelligence/key-figure-in-police-ransomware-activity-nabbed-2/)\nmuch more effective and evasive fileless malware. Here is a closer look at KOVTER, as well\nas tips on how organizations can lessen its impact in case of infection.\n\n**[[Read more: How are fileless threats abusing PowerShell?]](https://www.trendmicro.com/vinfo/us/security/news/security-technology/security-101-the-rise-of-fileless-threats-that-abuse-powershell)**\n\n**How has KOVTER evolved over the years?**\n\nThe malware known as KOVTER has gone through various changes during its lifespan.\n\nThe [earliest reports of the malware pegged it as a police ransomware, where it remained in a](https://www.v3.co.uk/v3-uk/news/2360128/kovter-police-ransomware-infecting-44-000-devices-per-day)\ntarget system waiting for the right opportunity—usually when the user downloaded illegal\nfiles. Once triggered, it notifies the user of illegal activity along with a “fine”, which equates to\nits ransom demand. However, this early version was not too effective, as it required the\ncorrect set of conditions and could easily be detected and removed.\n\nThe second, and perhaps most visible variant of KOVTER was that of a click fraud malware.\nThis variant used code injection to infect its target, after which it stole information that it then\nsent to its Command & Control (C&C) servers.\n\n\n-----\n\nIn 2015, KOVTER evolved again into a fileless malware, which it did via the installation of\nautorun registry entries. It evolved further in 2016, adding file components and registry\nentries that made use of a shell spawning technique to read the malicious registry entry.\n\n**How does the current KOVTER variant work?**\n\n_Figure 1: KOVTER infection flow_\n\nOne of the most common infection methods for KOVTER is via attachments coming from\nmacro-based malicious spam. Once the malicious attachment—usually compromised\nMicrosoft Office files—are clicked, the malware installs a shortcut file, batch file, and a\nrandom file with a random file extension in a randomly named folder usually located in\n%Application Data% or %AppDataLocal%. Registry entries based on the random file\nextension are also installed in Classes Root to direct the execution of the random file into\nreading a registry entry. These components are used to perform the malware's shellspawning technique.\n\nFor the next part, the registry entry for the random file is created, containing malicious scripts\nthat perform KOVTER’s processes. This means that the moment the infected machine\nrestarts or either the shortcut or batch files are triggered, the malicious script in the registry\nentry is loaded into memory. The malicious script contains a shell code that the malware\ninjects into the PowerShell process. The shell code will then decrypt a registry entry located\nin the same registry key. This registry entry is a binary file that is injected into a spawned\nprocess (usually regsvr32.exe). The spawned regsvr32.exe would then try to connect various\nURLs as a part of its click fraud activity.\n\n\n-----\n\nUpon installation of all these file components and registry entries, the malware spawns a\nwatchdog process that continuously monitors the existence of these components.\n\n**How can organizations mitigate the impact of KOVTER?**\n\nGiven its almost fileless technique, KOVTER has become much more difficult to detect and\nmitigate. However, there are some things organizations can do to mitigate the malware’s\nimpact. Here are some examples of effective mitigation techniques:\n\nDue to its arrival via spam mail, the organization should look into implementing policies\n[that protect against email threats.This includes setting up anti-spam filters that can](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\nblock malicious emails before they can even reach the endpoint user.\n\nOne of the simplest and most effective ways to stop fileless malware is to apply\nsecurity updates as soon as they are available. Organizations should ensure that their\nsystems have the latest updates to prevent being infected by fileless malware—\nespecially those that exploit vulnerabilities.\n\n[PowerShell is frequently abused by fileless malware, thus organizations should take](https://www.trendmicro.com/vinfo/us/security/news/security-technology/security-101-the-rise-of-fileless-threats-that-abuse-powershell)\n[necessary precautions to secure this component. This includes implementing steps on](https://technet.microsoft.com/en-us/gg261722.aspx)\n[properly utilizing PowerShell in operational or cloud environments. Organizations can](https://blogs.msdn.microsoft.com/powershell/2013/12/16/powershell-security-best-practices/)\nalso list triggers for detection, which can be based on commands known to be used by\nmalicious PowerShell scripts. Threat actors, for instance, often use the “^” symbol to\nobfuscate their command prompt parameters when invoking PowerShell. Organizations\ncan also consider disabling PowerShell itself if necessary.\n\nWhile fileless malware is more difficult to detect, organizations should still put in the\neffort to monitor and secure all their endpoints. Using firewalls and solutions that can\nmonitor inbound and outbound network traffic can go a long way towards preventing\nfileless malware from infecting an organization.\n\nFinally, organizations should implement multilayered security solutions such as Trend\nMicro™ [Deep Discovery™, which provides detection, in-depth analysis, and proactive](https://www.trendmicro.com/us/enterprise/security-risk-management/deep-discovery/)\nresponse to today’s stealthy malware and targeted attacks in real-time. It provides a\ncomprehensive defense tailored to protect organizations against targeted attacks and\n[advanced threats through specialized engines, custom sandboxing, and seamless](http://blog.trendmicro.com/trendlabs-security-intelligence/deploying-a-smart-sandbox-for-unknown-threats-and-zero-day-attacks/)\ncorrelation across the entire attack lifecycle. In addition, Trend Micro™ Deep\n[Security™ and Vulnerability Protection provide](https://www.trendmicro.com/us/enterprise/product-security/vulnerability-protection/) [virtual patching that protects endpoints](https://www.trendmicro.com/us/enterprise/product-security/vulnerability-protection/)\n[from threats that abuses vulnerabilities. OfficeScan’s Vulnerability Protection shield](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint/officescan.html)\nendpoints from identified and unknown vulnerability exploits even before patches are\ndeployed.\n\nHIDE\n\n\n-----\n\n**Like it? Add this infographic to your site:**\n1. Click on the box below.  2. Press Ctrl+A to select all.  3. Press Ctrl+C to copy.  4. Paste\nthe code into your page (Ctrl+V).\n\nImage will appear the same size as you see above.\n\n[Posted in Cybercrime & Digital Threats,](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats) [Malware](https://www.trendmicro.com/vinfo/us/security/news/malware)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-08-18 - KOVTER- An Evolving Malware Gone Fileless.pdf"
    ],
    "report_names": [
        "2017-08-18 - KOVTER- An Evolving Malware Gone Fileless.pdf"
    ],
    "threat_actors": [
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536186,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653764610,
    "ts_modification_date": 1653764610,
    "files": {
        "pdf": "https://archive.orkl.eu/f65f30fd5896bf9b958187c2a4797f379878ecd7.pdf",
        "text": "https://archive.orkl.eu/f65f30fd5896bf9b958187c2a4797f379878ecd7.txt",
        "img": "https://archive.orkl.eu/f65f30fd5896bf9b958187c2a4797f379878ecd7.jpg"
    }
}