{
    "id": "29287a9c-7b3b-47b5-b487-d5915f381637",
    "created_at": "2023-01-12T15:09:07.541023Z",
    "updated_at": "2025-03-27T02:15:35.607166Z",
    "deleted_at": null,
    "sha1_hash": "c78d4d958e93ca99567db948f05d8380e46d7abd",
    "title": "2022-02-07 - Trellix Global Defenders- Invasion of the Information Snatchers - Protecting against RedLine Infostealer",
    "authors": "",
    "file_creation_date": "2022-05-28T16:16:26Z",
    "file_modification_date": "2022-05-28T16:16:26Z",
    "file_size": 1212372,
    "plain_text": "# Trellix Global Defenders: Invasion of the Information Snatchers - Protecting against RedLine Infostealer\n\n**[trellix.com/en-us/about/newsroom/stories/threat-labs/trellix-global-defenders-invaders-of-the-information-snatchers.html](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/trellix-global-defenders-invaders-of-the-information-snatchers.html)**\n\n## Stories\n\nThe latest cybersecurity trends, best practices,\n\nsecurity vulnerabilities, and more\n\nBy [Taylor Mullins · February 7, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/taylor-mullins.html)\n\nWhat information are you storing in your Browsers?\n\n\n-----\n\nStoring credentials and other important information in web browsers is a helpful method to\nnot have to remember or reenter login or payment information for regularly visited sites, but\nthreat actors also see this as an opportunity to steal credentials to either sell on the dark\nweb or use for further cyberattacks. Tools like Redline, Agent Tesla, and Raccoon Stealer\ntarget popular web browsers such as Chrome, Edge, Firefox, Safari, and Opera,\ndemonstrating why storing important information in browsers is a critical security risk.\n\n**Figure 1. Description and Related Campaigns for MITRE Technique T1555.003.**\n**Source: MVISION Insights**\nStealing the web browser credentials is a technique observed in many campaigns and\nutilized by numerous threat actors and APT groups, after acquiring the credentials from web\nbrowsers, adversaries may attempt to recycle the credentials across different systems and\naccounts to expand access.\n\n\n-----\n\n**Figure 2. Global Prevalence and Observed Countries/Sectors of RedLine Infostealer.**\n**Source: MVISION Insights**\nWhile there are multiple variants of malware that can lift browser credentials, for this article\nwe are going to highlight the activity of RedLine Infostealer due to its global reach and\nprevalence in recent attacks.\n\n\n-----\n\n**Figure 3. Features of the RedLine Stealer. Source: ASEC/Bleeping Computer**\nRedline Infostealer is available either as a standalone application or on a subscription basis\non underground forums. As noted in the above table, RedLine gathers and exfiltrates a\nrange of data including system information and credentials, autocomplete data, and credit\ncard information from browsers, and FTP and IM clients. The malicious software also steals\ncryptocurrency and can download additional files onto the infected device.\n\nUnfortunately, if you are a victim of RedLine malware, it's not enough to just change the\npasswords associated with that email account. Since RedLine targets all available data, you\nmust change the password for all accounts used on the infected machine, including\ncorporate VPN and email accounts, and other personal accounts.\n\nRedLine Infostealer is commonly delivered by phishing emails, as well as social media\nmessaging. The phishing email can often lure the recipient by something topical, ongoing\ncurrent events, an often-used example being COVID-19 information.\n\nEven if the users decline to store their credentials on the browser, the password\nmanagement system will still add an entry to indicate that the website is \"blacklisted.\" While\nthe adversaries may not possess the actual passwords for the \"blacklisted\" accounts, it\ndoes tell them of the account existence, thus allowing them to perform credential stuffing or\nsocial engineering/phishing attacks.\n\n## Recommended Steps to Prevent Theft of Web Browser Credentials\n\n\n-----\n\nSeveral mitigations can be put into place to prevent users from utilizing browser password\nmanagers or preventing the theft of browser credentials. Web browsers typically store the\ncredentials in an encrypted format within a credential store; however, methods exist to\nextract plaintext credentials from these credential stores.\n\nUtilizing two-factor authentication can help reduce the risk of theft.\nIncorporating third-party password managers that can provide additional security\ncontrols.\nDisabling the ability for users to utilize Browser Password Managers via the local\nsettings or Group Policy Object.\n\n[Dashlane Support: Disabling Chrome, Edge, Firefox, IE password managers via GPO](https://support.dashlane.com/hc/en-us/articles/360012461279-Disabling-Chrome-Edge-Firefox-IE-password-managers-via-GPO)\n\n## Trellix Protections and Global Detections\n\nTrellix Global Threat Intelligence is currently detecting all known analyzed indicators and\nbehavior associated with infostealer malware variants such as RedLine.\n\n**Figure 4. Trellix Products**\n\n**detecting this threat globally. Source: MVISION Insights**\n\n## RedLine Payloads and Associated Activity Detections\n\nTrellix Endpoint Security (ENS), Web Gateway (MWG), and Network Security Manager\n(NSP) are detecting RedLine Infostealer IOCs from the standpoint of signature detections\nand malware behavior.\n\nRedLine Infostealer Detection Names:\n\nredline_stealer\nredline-fufi\nTrojan:MSIL/RedLine.RPS!MTB\nTrojan:Win32/RedLineStealer.DF!MTB\nPWS:MSIL/RedLine.GG!MTB\n\n\n-----\n\nX97M/Redline\nAvira: TR/AD.RedLineSteal.nphvp\nRedline\nredline stealer\nTrojan:Win32/RedlineStealer!MSR\nTrojanSpy:MSIL/Redline.STA\nTrojan:MSIL/RedLine!MTB\nRedlinestealer\nTrojan-Redline.a\nTrojan:MSIL/RedLineStealer.MK!MTB\nMALWARE: Redline Stealer Activity Detected\nMALWARE: Redline Stealer Activity Detected – Trellix Network Security Platform/IPS\n\n## RedLine Payloads and Associated Activity Detections\n\nMVISION Insights will provide the current threat intelligence and known indicators for\nRedline Infostealer. MVISION Insights will also alert to detections and process traces that\nhave been observed in your environment and systems that require additional attention to\nprevent widespread infection. MVISION Insights will also include Hunting Rules for threat\nhunting and further intelligence gathering of the threat activity and adversaries known to\nutilize Redline.\n\n**Campaign Name -Threat Profile: RedLine Infostealer**\n\n**Figure 5. Analyzed and Other Associated Indicators for RedLine Infostealer**\n\n**Figure 6. Redline Infostealer Description and Campaigns Observed using this tool**\n\n\n-----\n\n**Figure 7. Yara Hunting Rules for RedLine in MVISION Insights**\n\n## Detecting Malicious Activity with MVISION EDR\n\nMVISION EDR is currently alerting to all known threat behavior and MITRE techniques\nassociated with RedLine Infostealer. The below examples are filtered to show where the\nRedline malware accessed the encrypted login data within the Chromium based browsers\nand was able to recover and decrypt the data using the Native APIs built into Windows.\n\n**Figure 8. Recovery and decryption of browser credentials shown in MVISION EDR**\n\n\n-----\n\n**Figure 9. Accessing the CryptUnprotectData API to decrypt the browser login data**\n\n**Figure 10. EDR Guided Investigation detailing observed malicious network activities**\n\n## Monitoring of Cloud Account Activity Post Infection\n\nIf an infostealer infection has been detected and possible credential theft is suspected to\nhave taken place, it is recommended to monitor for abnormal behavior within your cloud\naccounts even after changing passwords. MVISION Cloud/Unified Cloud Edge provide\nUEBA capabilities that can alert to abnormalities across your cloud environment looking at\nnumerous Anomaly Categories to detect possible abnormal and malicious behavior.\nAdditionally, adding impacted users to watchlists can help alert to suspicious activity from\nmonitored users that might have their credentials compromised.\n\n\n-----\n\n**Figure 11. Watchlists can help alert to suspicious activity from monitored users**\n\n**Figure 12. User Activity and Anomalies across Cloud Services**\n\n\n-----\n\n**Figure 13. Cloud Access Policies to set rules and reactions for accessing your cloud**\n**environment.**\nAlong with tracking user anomalies, an additional protection that can be utilized is setting\nCloud Access Policies to block access to your cloud applications by Unmanaged Devices or\nconnections from Restricted Countries. Setting cloud access policies can help stop the\nsuccessful reuse of stolen cloud application credentials being utilized on unmanaged\ncompany devices.\n\n**Figure 14. DLP Policy automatically applied to Unmanaged Devices accessing Cloud**\n**Services**\nThe cloud access policy protections can also apply specific data protection policies on\nunmanaged devices to limit the types and sensitivity of data that is allowed to be accessed\nand to prevent the downloading of data based on specific cloud applications.\n\nTrellix offers Threat Intelligence Briefings along with Cloud Security, Data Protection, and\nSecurity Operation workshops to provide customers with best practice recommendations on\nhow to utilize their existing security controls to protect against adversarial and insider\nthreats, please reach out if you would like to schedule a workshop with your organization.\n\n\n-----\n\nSign-off,\n\nTaylor Mullins\n\n### Featured Content\n\nPERSPECTIVES\n\n### Our CEO On Living Security\n\nBy [Bryan Palma · January 19, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/bryan-palma.html)\n\nTrellix CEO, Bryan Palma, explains the critical need for security that’s always learning.\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/perspectives/our-ceo-on-living-security.html)\n\nXDR\n\n### Time to Drive Change by Challenging the Challengers\n\nBy [Michelle Salvado · January 19, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/michelle-salvado.html)\n\nDynamic threats call for dynamic security – the path to resiliency lies in XDR.\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/xdr/time-to-drive-change-by-challenging-the-challengers.html)\n\nTHREAT LABS\n\n### 2022 Threat Predictions\n\nBy Trellix · January 19, 2022\n\nWhat cyber security threats should enterprises look out for in 2022?\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/2022-threat-predictions.html)\n\n## Get the latest\n\nWe’re no strangers to cybersecurity. But we are a new company.\n\nStay up to date as we evolve.\n\n\n-----\n\nPlease enter a valid email address.\n\nZero spam. Unsubscribe at any time.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-07 - Trellix Global Defenders- Invasion of the Information Snatchers - Protecting against RedLine Infostealer.pdf"
    ],
    "report_names": [
        "2022-02-07 - Trellix Global Defenders- Invasion of the Information Snatchers - Protecting against RedLine Infostealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536147,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653754586,
    "ts_modification_date": 1653754586,
    "files": {
        "pdf": "https://archive.orkl.eu/c78d4d958e93ca99567db948f05d8380e46d7abd.pdf",
        "text": "https://archive.orkl.eu/c78d4d958e93ca99567db948f05d8380e46d7abd.txt",
        "img": "https://archive.orkl.eu/c78d4d958e93ca99567db948f05d8380e46d7abd.jpg"
    }
}