{
    "id": "2942f7f5-e23e-44b8-9f6b-0456c007f235",
    "created_at": "2023-01-12T15:10:58.370822Z",
    "updated_at": "2025-03-27T02:16:39.717644Z",
    "deleted_at": null,
    "sha1_hash": "39e8088c11f27121beb8114abdaeb48eb93ac8d5",
    "title": "2021-10-19 - LightBasin- A Roaming Threat to Telecommunications Companies",
    "authors": "",
    "file_creation_date": "2022-05-28T02:29:31Z",
    "file_modification_date": "2022-05-28T02:29:31Z",
    "file_size": 999693,
    "plain_text": "# A Roaming Threat to Telecommunications Companies\n\n**crowdstrike.com/blog/an-analysis-of-lightbasin-telecommunications-attacks/**\n\nJamie Harries and Dan Mayer October 19, 2021\n\nLightBasin (aka UNC1945) is an activity cluster that has been consistently targeting the telecommunications sector at a global scale\nsince at least 2016, leveraging custom tools and an in-depth knowledge of telecommunications network architectures.\nRecent findings highlight this cluster’s extensive knowledge of telecommunications protocols, including the emulation of these protocols\nto facilitate command and control (C2) and utilizing scanning/packet-capture tools to retrieve highly specific information from mobile\ncommunication infrastructure, such as subscriber information and call metadata.\nThe nature of the data targeted by the actor aligns with information likely to be of significant interest to signals intelligence organizations.\nCrowdStrike Intelligence assesses that LightBasin is a targeted intrusion actor that will continue to target the telecommunications sector.\nThis assessment is made with high confidence and is based on tactics, techniques and procedures (TTPs), target scope, and objectives\nexhibited by this activity cluster. There is currently not enough available evidence to link the cluster’s activity to a specific country-nexus.\n\n## Background\n\nCrowdStrike Services, CrowdStrike Intelligence and Falcon OverWatch™ have investigated multiple intrusions within the telecommunications\nsector from a sophisticated actor tracked as the LightBasin activity cluster, also publicly known as UNC1945. Active since at least 2016,\nLightBasin employs significant operational security (OPSEC) measures, primarily establishing implants across Linux and Solaris servers, with\na particular focus on specific telecommunications systems, and only interacting with Windows systems as needed. LightBasin’s focus on1\nLinux and Solaris systems is likely due to the combination of critical telecommunications infrastructure running on those operating systems, in\naddition to the comparatively lax security measures and monitoring solutions on Linux/Solaris systems that are typically in place on Windows\noperating systems within an organization.\n\nLightBasin managed to initially compromise one of the telecommunication companies in a recent CrowdStrike Services investigation by\nleveraging external DNS (eDNS) servers — which are part of the General Packet Radio Service (GPRS) network and play a role in roaming\nbetween different mobile operators — to connect directly to and from other compromised telecommunication companies’ GPRS networks via\nSSH and through previously established implants. CrowdStrike identified evidence of at least 13 telecommunication companies across the\nworld compromised by LightBasin dating back to at least 2019.\n\n## GPRS eDNS Servers\n\n\n-----\n\ng t as t a y accessed t e st e S se e a SS o o e o t e ot e co p o sed te eco u cat o s co pa es, t e de ce\nuncovered indicative of password-spraying attempts using both extremely weak and third-party-focused passwords (e.g., `huawei ), potentially`\nhelping to facilitate the initial compromise. Subsequently, LightBasin deployed their SLAPSTICK PAM backdoor on the system to siphon\ncredentials to an obfuscated text file. As part of early lateral movement operations to further their access across the network, LightBasin then\npivoted to additional systems to set up more SLAPSTICK backdoors.\n\nLater, LightBasin returned to access several eDNS servers from one of the compromised telecommunications companies while deploying an\nICMP traffic signalling implant tracked by CrowdStrike as PingPong under the filename `/usr/bin/pingg, with persistence established`\nthrough the modified SysVinit script `/etc/rc.d/init.d/sshd through the following additional line:`\n```\ncd /usr/bin && nohup ./pingg >/dev/null 2>&1 &\n\n```\nThis implant waits for a magic ICMP echo request, which, when sent to the system, established a TCP reverse shell to an IP address and port\nspecified within the magic packet. The `/bin/bash process spawned by PingPong masquerades under the process name` `httpd .`\n\neDNS servers are usually protected from general external internet access by firewalls; the magic packet that PingPong listens for would most\nlikely have to be sent from other compromised GPRS network infrastructure. CrowdStrike Services observed reverse shells that had been\nspawned from this implant, which communicated with a server owned by a different compromised telecommunications company in another\npart of the world — typically connecting to the remote system on TCP port 53, which is the port primarily used for DNS. These efforts further\nindicate the actor’s continued attempts to disguise their activity as legitimate traffic.\n\nAlongside the deployment of the PingPong implant, LightBasin added `iptables rules to the eDNS server that ensured SSH access to the`\nserver from five of the compromised telecommunications companies. The actor also replaced the legitimate `iptables binary with a`\ntrojanized version (SHA256: `97d4c9b5750d614face73d11ba8532e53594332af53f4c07c1543195225b76eb ) that would filter out output from`\n```\niptables that included the first two octets of the IP addresses belonging to the compromised telecommunications companies. These actions\n\n```\nmake it more difficult for administrators and analysts to identify the firewall rules through review of iptables output alone. Indicators relating\nto this utility are highlighted in Table 1.\n\n**File Path** **Description**\n\n```\n/usr/sbin/iptablesDir/iptables\n/usr/sbin/iptablesDir/iptablesapply\n/usr/sbin/iptablesDir/iptablesbatch\n/usr/sbin/iptablesDir/iptablesmulti\n/usr/sbin/iptablesDir/iptablesrestore\n/usr/sbin/iptablesDir/iptablessave\n\n```\n\nLegitimate `iptables binaries in a non-standard directory that are invoked by the trojanized`\nversion\n\n\nTable 1. Trojanized and legitimate iptables file details\n\n## Serving GPRS Support Node (SGSN) Emulation\n\nLightBasin uses a novel technique involving the use of SGSN emulation software to support C2 activities in concert with TinyShell. SGSNs are\nessentially GPRS network access points, and the emulation software allows the adversary to tunnel traffic via this telecommunications\nnetwork.\n\nTinyShell is an open-source Unix backdoor used by multiple adversaries; however, LightBasin uniquely combined this implant with the publicly\navailable SGSN emulator `sgsnemu through a bash script. This script constantly ran on the system, but only executed certain steps between2`\n2:15 and 2:45 UTC each day. This window was specified via command-line arguments. During this window, the script performed the following\nsteps in a loop:\n\n1. Execute TinyShell to communicate with an actor-controlled C2 IP address hosted by the virtual private server (VPS) provider Vultr.\n2. Add a route to the TinyShell C2 on the interface `tun0 .`\n3. Check for connectivity to the TinyShell C2 via `ping .`\n\n\n-----\n\nco ect ty to t e add ess a s, t e sc pt e ecutes t e SGS e u ato a oop, atte pt g to co ect to a set o e pa s o\nInternational Mobile Subscriber Identity (IMSI) and Mobile Subscriber Integrated Services Digital Network (MSISDN) numbers that are\nused as arguments to the SGSN emulator. These numbers are required to generate Packet Data Protocol (PDP) context requests for\nconnection to a Gateway GPRS Support Node (GGSN), which will then forward traffic to the C2 IP address. Once a connection is\nestablished, the SGSN emulator creates a connection to the GGSN via the GPRS Tunnelling Protocol (GTP), and utilizes the interface\n```\n   tun0 for the connection. The TinyShell implant then uses tun0, as mentioned above.3\n\n```\n5. If a successful connection has not been made by the end of the 30-minute window, the script kills both the SGSN emulator and the\n\nTinyShell implant.\n\nIn short, the SGSN emulator is used to tunnel TinyShell C2 traffic between the C2 server and the infected host via GTP through a GGSN. The4\nscript is used as a persistence mechanism; it runs continually, but attempts to establish a tunnel to each of the specified mobile stations, which,\nin turn, act as tunnels to the TinyShell C2 server. The script runs for only 30 minutes each day, culminating in a similar effect to a scheduled\njob.\n\nCrowdStrike Intelligence assesses that this sophisticated form of C2 is likely an OPSEC measure. This assessment carries moderate\nconfidence, as GTP-encapsulated TinyShell C2 traffic is less anomalous within the environment of a global mobile communications network\ndue to its use of a protocol native to the telecommunications infrastructure that is compromised. Additionally, GTP-encapsulated traffic is\npotentially subject to less inspection and restrictions by network security solutions.\n\n## Additional Malware and Utilities\n\n**CordScan: This executable is a network scanning and packet capture utility that contains built-in logic relating to the application layer of**\ntelecommunications systems, which allows for fingerprinting and the retrieval of additional data when dealing with common telecommunication\nprotocols from infrastructure such as SGSNs. SGSNs could be targets for further collection by the adversary, as they are responsible for\npacket data delivery to and from mobile stations and also hold location information for registered GPRS users. CrowdStrike identified multiple\nversions of this utility, including a cross-compiled version for systems running on ARM architecture, such as Huawei’s commercial CentOSbased operating system EulerOS.\n\nLightBasin’s ability to fingerprint various brands of telecommunications products and compile tools for various architectures likely indicates\nrobust research and development capabilities to target vendor-specific infrastructure commonly seen in telecommunications environments.\nThis range of capability would also be consistent with a signals intelligence organization with a need to respond to collection requirements\nagainst a diverse set of target environments.\n\n**SIGTRANslator: This executable provides LightBasin with the ability to transmit data via telecommunication-specific protocols, while**\nmonitoring the data being transmitted. SIGTRANslator is a Linux ELF binary capable of sending and receiving data via various SIGTRAN\nprotocols, which are used to carry public switched telephone network (PSTN) signaling over IP networks. This signaling data includes valuable\nmetadata such as telephone numbers called by a specific mobile station. Data transmitted to and from SIGTRANslator via these protocols is\nalso sent to a remote C2 host that connects to a port opened by the binary. This allows the remote C2 server to siphon data flowing through\nthe binary and send data to SIGTRANslator from the C2 to be re-sent via a SIGTRAN protocol.\n\nNotably, data that is sent to and from the remote C2 is encrypted with the hard-coded XOR key `wuxianpinggu507 . This Pinyin translates to`\n“unlimited evaluation 507” or “wireless evaluation 507.” “Wireless evaluation” is likely the correct translation, as the malware is targeting\ntelecommunications systems. The identification of a Pinyin artifact indicates the developer of this tool has some knowledge of the Chinese\nlanguage; however, CrowdStrike Intelligence does not assert a nexus between LightBasin and China.\n\n**Fast Reverse Proxy: This open-source utility is a reverse proxy used by LightBasin to permit general access to the eDNS server via an actor-**\ncontrolled C2 IP address hosted by the VPS provider Vultr.\n\n**Microsocks Proxy: This open-source utility is a lightweight SOCKS5 proxy server, typically used by LightBasin to pivot to systems internally.**\n\n**ProxyChains: This open-source utility is capable of chaining proxies together and forcing network traffic through said chain of proxies, even if**\nthe program generating the traffic does not have proxy support. It utilizes a configuration file to specify proxies in use. The recovered\nconfiguration file contained a mixture of local IP addresses, IP addresses belonging to Vultr, and IP addresses belonging to eight different\ntelecommunication organizations from around the world.\n\nSome of the tools and TTPs observed by CrowdStrike Services during investigations deviate from the more sophisticated, OPSEC-aware\nbehavior of LightBasin observed in the past, such as by not encrypting binaries using LightBasin’s binary packer publicly known as\nSTEELCORGI. The tools and TTPs cataloged in this blog post were observed in congruence with the the usage of SLAPSTICK on select\neDNS servers at the start of the intrusion, as well as during periods of strong time correlation, when SSH access from multiple compromised\ntelecommunications company and artifacts indicative of LightBasin tool usage overlapped.\n\n## Recommendations\n\nIt is not surprising that servers would need to communicate with one another as part of roaming agreements between telecommunications\ncompanies; however, LightBasin’s ability to pivot between multiple telecommunications companies stems from permitting all traffic between\nthese organizations without identifying the protocols that are actually required. As such, the key recommendation here is for any\n\n\n-----\n\nte eco u cat o s co pa y to e su e t at e a s espo s b e o t e G S et o a e u es p ace to est ct et o t a c to o y\nthose protocols that are expected, such as DNS or GTP.\n\nIf already the victim of a LightBasin intrusion, simply restricting network traffic will not solve the problem as LightBasin has displayed the ability\nto utilize common telecommunications protocols such as GTP for command and control. In this event, CrowdStrike recommends an incident\nresponse investigation that includes the review of all partner systems alongside all systems managed by the organization itself. Similarly, if an\norganization wishes to determine whether they’ve fallen victim to LightBasin, any compromise assessment must also include a review of all of\nthe aforementioned systems.\n\nFurther, as it is a common situation where parts of the network may in fact be managed by a third-party managed service provider as opposed\nto the telecommunications company itself, an evaluation of security controls in place with the partner should be undertaken to ensure that the\nsystems are sufficiently protected. CrowdStrike Services investigations commonly reveal a lack of any monitoring or security tooling on\ntelecommunications core network systems. While the deployment of security tooling to real-time operating systems is generally limited, other\nUnix-based operating systems that support the core telecommunications network services are typically targeted by LightBasin and should have\n[some basic security controls and logging in place (e.g., SSH logging forwarded to a SIEM, endpoint detection and response (EDR) for process](https://www.crowdstrike.com/cybersecurity-101/endpoint-security/endpoint-detection-and-response-edr/)\nexecution, file integrity monitoring (FIM) for recording file changes of key configuration files). It is also important to ensure that appropriate\nincident response plans are in place that take into account situations involving partner-managed systems within the network in the event that\n[such an incident is identified. This incident response plan should contain the roles and responsibilities of third-party managed service providers](https://www.crowdstrike.com/cybersecurity-101/incident-response)\nto ensure acquisition of forensic artifacts from third-party equipment not directly under the management of the telecommunication operator\nthemselves.\n\nFinally, given that companies within the telecommunications vertical are extensively targeted by highly advanced state-sponsored adversaries\non a constant basis, these organizations need to have access to up-to-date and comprehensive threat intelligence resources so they can\nunderstand the threats facing the industry. This intelligence should also provide insights into the TTPs of adversaries that telecommunications\ncompanies are likely to encounter, across both the corporate network and critical telecommunications infrastructure, so that these insights can\nthen be used to further augment detection mechanisms and inform on decisions regarding existing security controls.\n\n## Conclusion\n\nSecuring a telecommunications organization is by no means a simple task, especially with the partner-heavy nature of such networks and the\nfocus on high-availability systems; however, with the clear evidence of a highly sophisticated adversary abusing these systems and the trust\nbetween different organizations, focusing on improving the security of these networks is of the utmost importance. Given the significant\nintelligence value to any state-sponsored adversary that’s likely contained within telecommunications companies, CrowdStrike expects these\norganizations to continue to be targeted by sophisticated actors, further underscoring the criticality of securing all aspects of\ntelecommunications infrastructure beyond simply focusing on the corporate network alone.\n\n## Indicators of Compromise\n\n**Indicator** **SHA256 Hashes** **Descripti**\n\n`/usr/bin/pingg` `e9c0f00c34dcd28fc3cc53c9496bff863b81b06723145e106ab7016c66581f72` PingPong\n```\n                           4668561d60daeb7a4a50a9c3e210a4343f92cadbf2d52caab5684440da6bf562\n\n```\n`/usr/lib/om_proc` `3a259ad7e5c19a782f7736b5ac50aac4ba4d03b921ffc6a3ff6a48d720f02012` Microsock\n```\n                           65143ccb5a955a22d6004033d073ecb49eba9227237a46929495246e36eff8e1\n\n```\n`/usr/lib/frpc` `05537c1c4e29db76a24320fb7cb80b189860389cdb16a9dbeb0c8d30d9b37006` Fast Reve\n```\n                           16294086be1cc853f75e864a405f31e2da621cb9d6a59f2a71a2fca4e268b6c2\n\n```\n`/usr/lib/frpc.ini` N/A Fast Reve\nConfigura\n\n```\n/usr/bin/libcord.so\n\n```\n```\n9973edfef797db84cd17300b53a7a35d1207d166af9752b3f35c72b4df9a98bc\n4480b58979cc913c27673b2f681335deb1627e9ba95073a941f4cd6d6bcd6181\nad9fef1b86b57a504cfa1cfbda2e2ac509750035bff54e1ca06f7ff311d94689\n\n```\n\nCordScan\nTelecomm\nScanning\n\n\n`/home/REDACTED/cordscan_raw_arm` `cdf230a7e05c725a98ce95ad8f3e2155082d5a6b1e839c2b2653c3754f06c2e7` CordScan\nTelecomm\nScanning\n(ARM Arc\n\n`/usr/lib/javacee` `917495c2fd919d4d4baa2f8a3791bcfd58d605ee457a81feb52bc65eb706fd62` SIGTRAN\n\n\n-----\n\n```\n/usr/lib/sgsnemu\n/usr/bin/sgsnemu\n\n```\n\nSGSN Em\n\n```\n/usr/lib/sgsnemu_bak\n\n```\n```\nbf5806cebc5d1a042f87abadf686fb623613ed33591df1a944b5e7879fb189c8\n78c579319734a81c0e6d08f1b9ac59366229f1256a0b0d5661763f6931c3b63c\nb06f52e2179ec9334f8a3fe915d263180e538f7a2a5cb6ad8d60f045789123b6\n\n```\n\n`/usr/lib/tshd` `a388e2ac588be6ab73d7e7bbb61d83a5e3a1f80bf6a326f42b6b5095a2f35df3` TinyShell\n\n`/home/REDACTED/win7_exp/proxychains.conf` N/A ProxyCha\n`/usr/lib/win7_exp/proxychains.conf` Configura\n\n`/var/tmp/.font-unix` N/A SLAPSTIC\nCredentia\nFile\n\n`/usr/local/sbin/iptables` `97d4c9b5750d614face73d11ba8532e53594332af53f4c07c1543195225b76eb` Trojanized\n\n`/usr/sbin/iptablesDir/` N/A Threat Ac\n`/sbin/iptablesDir/` created di\n\ncontaining\nlegitimate\niptables u\nfollowing i\nof trojaniz\n\n`45.76.215.0/24` N/A Vultr IP ra\nby LightBa\n\n`167.179.91.0/24` N/A Vultr IP ra\nby LightBa\n\n`45.32.116.0/24` N/A Vultr IP ra\nby LightBa\n\n`207.148.24.0/24` N/A Vultr IP ra\nby LightBa\n\n`172.104.79.0/24` N/A Linode IP\nused by L\n\n`45.33.77.0/24` N/A Linode IP\nused by L\n\n`139.162.156.0/24` N/A Linode IP\nused by L\n\n`172.104.236.0/24` N/A Linode IP\nused by L\n\n`172.104.129.0/24` N/A Linode IP\nused by L\n\nTable 2. LightBasin indicators of compromise\n\n## Endnotes\n\n1. Key examples of telecommunications-specific systems targeted include systems involved in the GPRS network such as External DNS\n\n(eDNS) servers, Service Delivery Platform (SDP) systems, and SIM/IMEI provisioning, as well as Operations Support Systems (OSS),\nand Operation and Maintenance Units (OMU).\n2. https[:]//osmocom[.]org/projects/openggsn/wiki/Sgsnemu\n3. Correction at 3 p.m. EST 10/20/2021: Clarified the methodology through which an SGSN emulator creates a GTP-encapsulated\n\nconnection to an IP address.\n4. Ibid.\n\n**Additional Resources**\n\n_Read_ _[How CrowdStrike Falcon Stops REvil Ransomware Used in the Kaseya Attack in the CrowdStrike blog.](https://www.crowdstrike.com/blog/how-crowdstrike-stops-revil-ransomware-from-kaseya-attack/)_\n_[Download the CrowdStrike 2021 Global Threat Report for more information about adversaries tracked by CrowdStrike Intelligence in](https://www.crowdstrike.com/resources/reports/global-threat-report/)_\n_2020._\n_[See how the powerful, cloud-native CrowdStrike Falcon® platform protects customers from DarkSide ransomware in this blog: DarkSide](https://www.crowdstrike.com/endpoint-security-products/)_\n_Goes Dark: How CrowdStrike Falcon Customers Were Protected._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-gen AV performs against today’s most](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-19 - LightBasin- A Roaming Threat to Telecommunications Companies.pdf"
    ],
    "report_names": [
        "2021-10-19 - LightBasin- A Roaming Threat to Telecommunications Companies.pdf"
    ],
    "threat_actors": [
        {
            "id": "ece64b74-f887-4d58-9004-2d1406d37337",
            "created_at": "2022-10-25T16:07:23.794442Z",
            "updated_at": "2025-03-27T02:02:09.981874Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "DecisiveArchitect",
                "Luminal Panda",
                "TH-239",
                "UNC1945"
            ],
            "source_name": "ETDA:LightBasin",
            "tools": [
                "CordScan",
                "EVILSUN",
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LEMONSTICK",
                "LOGBLEACH",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "OKSOLO",
                "OPENSHACKLE",
                "ProxyChains",
                "Pupy",
                "PupyRAT",
                "SIGTRANslator",
                "SLAPSTICK",
                "SMBExec",
                "STEELCORGI",
                "Tiny SHell",
                "pupy",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "31c0d0e1-f793-4374-90aa-138ea1daea50",
            "created_at": "2023-11-30T02:00:07.29462Z",
            "updated_at": "2025-03-27T02:00:03.256081Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "UNC1945",
                "CL-CRI-0025"
            ],
            "source_name": "MISPGALAXY:LightBasin",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536258,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1653704971,
    "ts_modification_date": 1653704971,
    "files": {
        "pdf": "https://archive.orkl.eu/39e8088c11f27121beb8114abdaeb48eb93ac8d5.pdf",
        "text": "https://archive.orkl.eu/39e8088c11f27121beb8114abdaeb48eb93ac8d5.txt",
        "img": "https://archive.orkl.eu/39e8088c11f27121beb8114abdaeb48eb93ac8d5.jpg"
    }
}