{
    "id": "295a26fb-e313-441b-915f-466de824ca60",
    "created_at": "2022-10-25T16:48:10.394884Z",
    "updated_at": "2025-03-27T02:16:26.191025Z",
    "deleted_at": null,
    "sha1_hash": "7883a4d9567d654c7db1b7d3c94e15d1ad7eb09b",
    "title": "Word Template",
    "authors": "",
    "file_creation_date": "2017-07-06T16:58:52Z",
    "file_modification_date": "2017-07-06T17:01:34Z",
    "file_size": 613642,
    "plain_text": "# CopyCat\n\n### AN IN-DEPTH ANALYSIS OF THE COPYCAT\n ANDROID MALWARE CAMPAIGN\n\n## Introduction\n\nThe Check Point research team identified a new mobile malware targeting millions of Android users. The\nmalware, dubbed \"CopyCat\" by researchers, uses a novel technique to generate and steal ad revenues.\nThis extensive campaign infected over 14 million devices, rooting 8 million of them with an unprecedented\nsuccess rate. The malware reached a global spread, infecting mostly users from south-east Asia, but also\nover 280,000 users in the US. We estimate that through the malware's malicious activities, the\nperpetrators behind it gained over $1.5 million over the course of two months. CopyCat is a fully\ndeveloped malware with vast capabilities, including elevating privileges to root, establishing persistency,\nand to top it all - injecting code into Zygote. Zygote is a daemon whose goal is to launch apps on Android,\nand injecting code into it allows the malware to intervene in any activity on the device.\n\n## Architecture\n\nThe malware has a modular structure, in which each module plays a different role. This allows the\nmalware developers to choose and change their strategy and the malware’s behavior on the device to\naccommodate their current target. This emphasizes the danger in this kind of malware, which is multipurpose, and capable of changing the campaign’s aim at any given time. The malware’s developers use\ndifferent implementations of the modules, depending on their purpose and functional requirements.\nSome modules are implemented as regular Android apps developed in Java, which is necessary when\nthere is a need to use external ad libraries. Other modules, are implemented as native binaries, which\nallow implementing low-level functionalities, such as shared library injection, and making the malware\nmore evasive.\n\nDue to the modular nature of the malware, in most cases not all modules are present on an infected\ndevice, and the malware loads them on demand. There is no consistency regarding the location in which\nthe malware installs the various modules. In some cases, the malicious modules are embedded into an\nAPK as assets or resources, while in other cases the malware dynamically downloads them from the C&C\n(Command and Control) server.\n\nWe conducted a full analysis of the malware’s main modules, and created an outline of the malware’s\nstructure, showing the relationships between the different parts.\n\n\n-----\n\nImage 1: The CopyCat malware architecture\n\nThe infection flow begins once the initiation module, disguised as a legitimate app, is installed as a usual\nuser-mode Android app. This app unpacks or downloads a native binary called Rser, which runs the\nexploits consecutively, attempting to escalate privileges to root. After a successful exploitation, the\nmalware obtains persistency by copying the modules Aser and ads to system partitions. The Aser\nmodule injects a shared library into the Zygote and system_server processes. The injected module\noperates together with the layout_hook and ads modules, and executes different strategies of ad fraud\nto generate revenue for the perpetrators.\n\n## Rser module\n\nThe Rser module is responsible for establishing persistency and copying other modules to /system/bin\ndirectory. As input it receives a configuration file with the following format:\n\nAvc-manv3\n\n[number of exploits]\n6\n\n[exploit names]\nMso N\nSpl N\nPut N\nTwl N\nPin N\nFut N\n\n[number of files]\n2\n\n[file names]\n\n\n-----\n\naser\nBatterySaver.apk\n\n[malicious package name]\ncom.applicationalplayview\n\n[malicious app name]\nWhatsAppBaseSystem\n\n[malicious receiver]\ncom.applicationalplayview.SysReceiver\nend\n\nRser’s workflow is simple: first, it obtains root permissions by running the exploits provided in the input\nconsecutively. The gained root permissions allow Rser to remount the system directory. The system\npartition is normally restricted to read only, and to write into it, the malware needs to remount it. After\nthe necessary permissions are acquired, Rser executes a script, which copies the specified files to the\n/system/bin and /system/app directories, which triggers an automatic installation of the copied apps.\n\n## Exploits module\n\nThe exploit module escalate privileges of the current user to 0 (root), by using several well-known\nAndroid vulnerabilities. All of the exploits are adapted to work in the malware’s infrastructure, including\nimplementing additional functionalities and logs mechanism. They implement the same command line\ninterface: required user’s id (0), path to shell script and unique id of device. After the execution, a string\n“uid: 0” is returned in case of success, or “Terminated” in case of failure. The malware uses the following\nexploits:\n\nFile CVE Number Exploit Name Source Description\n\nmso Uses /dev/msocket_dump to rewrite\ninstruction in setuid() and setgid()\n\npin [CVE-2015-3636](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-3636) PingPong [link](https://github.com/fi01/CVE-2015-3636/) The ping_unhash does not initialize a\ncertain list data structure during an\nunhash operation\n\nput [CVE-2013-6282](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2013-6282) PutUser [link](https://github.com/fi01/libput_user_exploit/tree/d43783871e38a3d26fa8c4ecd50c9453f8fa5a78) The get_user and put_user API\nfunctions do not validate certain\naddresses\n\nspl [CVE-2014-4321 and](https://www.codeaurora.org/projects/security-advisories/memory-corruption-multiple-camera-drivers-cve-2014-4321-cve-2014-4324) [link](https://github.com/android-rooting-tools/libmsm_vfe_read_exploit) Memory corruption in multiple camera\n[CVE-2014-4324](https://www.codeaurora.org/projects/security-advisories/memory-corruption-multiple-camera-drivers-cve-2014-4321-cve-2014-4324) [link](https://github.com/hagurekamome/GetRoot/blob/master/jni/getroot.c) drivers\n\ntwl, fut [CVE-2014-3153](https://cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2014-3153) Towelroot [link](https://gist.github.com/fi01/a838dea63323c7c003cd) The futex_requeue function does not\nensure that calls have two different\nfutex addresses\n\nTable 1: Exploits used by the CopyCat malware\n\n|File|CVE Number|Exploit Name|Source|Description|\n|---|---|---|---|---|\n|mso||||Uses /dev/msocket_dump to rewrite instruction in setuid() and setgid()|\n|pin|CVE-2015-3636|PingPong|link|The ping_unhash does not initialize a certain list data structure during an unhash operation|\n|put|CVE-2013-6282|PutUser|link|The get_user and put_user API functions do not validate certain addresses|\n|spl|CVE-2014-4321 and CVE-2014-4324||link link|Memory corruption in multiple camera drivers|\n|twl, fut|CVE-2014-3153|Towelroot|link|The futex_requeue function does not ensure that calls have two different futex addresses|\n\n\n-----\n\n## Aser module\n\nThe module Aser injects a shared library into the Zygote and system_server processes. To inject the\nshared library it uses a utility called ptrace (process trace), which is a system call, provided by Linux\nkernel to observe and control the execution of another process. The access to this system call is\nrestricted to apps with root privileges, and hence the module Aser will be executed only after a\nsuccessful exploitation of a local privilege elevation vulnerability.\n\nZygote is a daemon whose goal is to launch apps on Android. Zygote unifies the components shared by all\napps to shorten their start-up time. To achieve speedier app launch, Zygote starts by preloading all Java\nclasses and resources that an app may potentially need at runtime. Zygote listens for requests to launch\nnew apps on its socket /dev/socket/zygote. When it receives a request to launch an app, it forks itself and\nlaunches the new app, and changes the uid and the gid to the required parameters. After the forking, the\nnew apps already have all system classes and resources preloaded. This works because the Linux Kernel\nimplements copy-on-write (COW) policy for forks.\n\nBecause of the way Zygote operates, every app in Android inherits memory from the Zygote process. For\nthis reason, the library which was injected into Zygote, will appear in every app launched after the\ninjection. This method has a little drawback: processes launched before the injection to Zygote will not\ncontain the injected library. To overcome this drawback, the malware explicitly injects the library into the\nsystem_server process, and restarts the com.android.vending (Google Play) process after the injection\noccurred. The system_server process is spawned from the Zygote process and contains all Android\nservices, such as Phone Manager, Package manager, etc.\n\n## Malicious Adware Activity\n\nThe injected module (shared library) hooks the methods of the activity manager and user-mode apps and\nreplace their calls with its own procedures.The injected module operates together with the layout_hook\nand ads modules, and executes different strategies of ad fraud to generate revenue for the perpetrators.\n\nStealing credit for app installations\n[The malware injects code into the method ActivityStack.startActivityLockedof the system_server.](http://androidxref.com/4.4_r1/xref/frameworks/base/services/java/com/android/server/am/ActivityStack.java#1664)\nAndroid’s activity manager service uses this method every time it starts any activity on the system. The\ncode injected by the malware monitors launched activities to detect if a Google Play activity is launched:\n\nImage 2: Code monitoring launched activities\n\n\n-----\n\nIf a Google Play activity is initiated, it contains a parameter of the app being installed. The malware\nextracts this parameter and sends it to the malware’s Ads module.\n\nImage 3: The malware’s code for extracting Google Play parameters\n\nAnother injection point in the Google Play app is the method\ncom/google/android/finsky/download/DownloadImp.getUrl() com.android.vending (Google Play). When\nthis method it called, the hook parses it and extracts the package name of the app which is being\ninstalled, and sends it to the malware’s ads module.\n\nImage 4: Hook to the DownloadImp.getUrl method, extracting package name\n\nCopyCat tries to find a referrer id for this package locally in shared preferences. If such an id isn't found,\n[CopyCat sends a request to the server http://api.tracksummer.com/api/v1/get](http://api.tracksummer.com/api/v1/get) and uses the answer as a\nreferrer id, which is a value used in tracking ad campaigns and attributing them to the publisher who\npromoted the app and will receive the money for the installation. With the fraudulent referrer id, CopyCat\ncreates an INSTALL_REFERRER intent, and sets the extra field \"flags\" to value \"20\", to avoid being\nblocked by its own injected module.\n\n\n-----\n\n### if(Prefs.isDebug()) {\n```\n     Log.showTost(\"send intent for new install, pkg: \" + this.pkg + \",\n  reffer: \" + this.reffer, 0);\n  }\n  Intent v0 = new Intent(\"com.android.vending.INSTALL_REFERRER\");\n  v0.putExtra(\"referrer\", this.reffer);\n  v0.putExtra(\"flags\", \"20\");\n  if(Build$VERSION.SDK_INT >= 12) {\n     v0.addFlags(v8);\n  }\n  v0.setPackage(this.pkg);\n  b.context.sendBroadcast(v0);\n\n```\nImage 5: changing “flags” field value\n\nCopyCat intercepts the method com.mobileapptracker.Tracker.onReceive in every application running on\n[the device. This is a receiver of the Tune](https://www.tune.com/) analytics platform and it reacts when an INSTALL_REFERRER\nintent arrives. The malware's hook blocks any intent which doesn’t contain an extra field called \"flag\",\neffectively blocking any intent which wasn't sent by CopyCat itself.\n\nImage 6: Hook blocking intents not sent by CopyCat\n\nDisplaying fraudulent ads\n\nThe second activity implemented in the shared library is displaying ads from large advertising networks,\nsuch as Facebook ads, UC ads, and Google admob, inside of other apps.\n\nThe injected library hooks the method com.android.internal.policy.impl.PhoneWindow.generateLayout of\nevery running application.\n\n\n-----\n\nImage 7: Hooks to the method com.android.internal.policy.impl.PhoneWindow.generateLayout\n\nWhen the layout is loaded, it loads a dex file which was previously created by the malware and calls the\nmethod com.service.actbanner.hookLayoutClass.hookGenerateLayout from it.\n\nImage 8: Code which loads dex and executes method hookGenerateLayout from it\n\nThis code generates a Facebook or UC banner with the size of 320x50 pixels and displays it on the hooked\nlayout.\n\nImage 9: Code which displays ads from Facebook in hooked view\n\n\n-----\n\nSilent Installation\nCopyCat also has a separate module which conducts fraudulent installations using the root permissions,\nwithout injecting additional code into the Zygote process. This module operates on a very low level of the\nAndroid operating system, by taking advantage of Android's package manager. The package manager\nmonitors specific directories: /system/app and /data/app. When an APK file appears in one of these\ndirectories, the package manager installs it. The malware makes use of this process, and copies the APK\nfiles of the fraudulent apps it wants to install to the /data/app directory, from which the package manager\nwill install it. The malware verifies whether the app was installed, and reports the result to the Command\nand Control server.\n\nImage 10: copying file to /data/app/packagename.apk and checking for installation\n\n## Evasion techniques\n\nThis malware family isn’t very obfuscated and almost does nothing to hinder reverse engineering.\nHowever, it does make a large effort to stay undetected on the device.\n\nAV evasion\nThe malware uses several Anti Virus evasion tactics. First, it uses small modules written in c, making it\ninvisible for most of mobile AVs, which analyze java-based Android apps. As seen in the images below, no\nAV identified the malware:\n\n\n-----\n\nImage 11: Virus Total detections of Rser module\n\nImage 12: Virus Total detections of Aser module\n\nThe strings inside c++ based modules are encoded to avoid signature detection. As most malware,\nCopyCat uses a simple xor-based substitution algorithm and wraps the result into base64 string. This is\nprimitive, but is still a good working approach against most of the AV’s static signatures detection.\nWhen the malware copies its own components to system, it sets the creation date of the new files to be\nthe same as /system/lib/libc.so, making it difficult to distinguish them from legitimate system binaries. In\naddition, the malware uses system-like names for the modules (libdaemon-rilv2, librmt_systemv3 and so\non).\n\nAnti-Fraud evasion\nBefore displaying ads, the malware checks a number of conditions, to avoid raising suspicion of antifraud systems:\n\n1. Check time zone and language to avoid infecting Chinese users.\n\nif(!v2.contains(\"zh\")) {\nTimeZone v3 = TimeZone.getDefault();\nif((((long)v3.getRawOffset())) == 28800000 && (v2.contains(\"en\"))) {\n\n2. Check “mpackName” parameter in list to avoid displaying ads over prominent apps and raising\nsuspicion. These are the checked package names:\n\n\"com.UCMobile.intl\", \"com.UCMobile\", \"com.uc.browser.hd\", \"com.uc.browser.en\",\n\"com.moblie.webview.nineapp\", \"com.facebook.katana\", \"com.facebook.orca\",\n\"com.facebook.lite\", \"com.android.chrome\", \"com.cleanmaster.mguard\",\n\"com.cleanmaster.mguard_x86\", \"com.whatsapp\", \"com.dotc.ime.latin.flash\",\n\"com.imo.android.imoim\", \"com.truecaller\", \"in.amazon.mShop.android.shopping\",\n\"com.flipkart.android\", \"com.instagram.android\", \"com.viber.voip\", \"com.ubercab\",\n\"com.myntra.android\", \"com.skype.raider\", \"com.google.android.play.games\",\n\"com.bbm\", \"jp.naver.line.android\", \"com.opera.mini.native\",\n\"com.google.android.youtube\", \"com.twitter.android\", \"com.vkontakte.android\",\n\n\n-----\n\n\"com.alibaba.aliexpresshd\",\n\"com.yahoo.mobile.client.android.mail\",\"com.snapchat.android\", \"com.adobe.reader\",\n\"com.google.android.apps.photos\", \"com.linkedin.android\",\n\"com.amazon.mShop.android.shopping\"\n\n3. Check advertisement interval to avoid raising suspicion:\n\nImage 13: Code checking the interval between ads displays\n\n## Attribution\n\nAfter conducting an analysis of the C&C communication and of the network infrastructure used by the\nmalware, we found several connections to MobiSummer, a Chinese ad network company. It is important\nto note that while these connections exist, it does not necessarily mean the malware was created by the\ncompany, and it is possible the perpetrators behind it used MobiSummer's code and infrastructure\nwithout the firm's knowledge. These are the main connections between CopyCat and MobiSummer:\n\n1. The malware downloads modules, such as Aser and Rser from an s3 bucket, which also contains\nitems (logs and code) which belong to MobiSummer.\n\n2. The malware receives offers and tracking ids from the domain: api.tracksummer.com (subdomain of\ntracksummer.com). Click.tracksummer.com which is another subdomain of tracksummer.com is\nhosted on the same IP as click.mobisummer.com (subdomain of mobisummer.com). Logs with\ninformation about the access to both sites were found on the same bucket with malware modules.\n\n3. The malware sends logs to the domain statevent.hummercenter.com (subdomain of\nhummercenter.com). Mosespubls.hummercenter.com (another subdomain of hummercenter.com),\nis mentioned in the code and is attributed to MobiSummer.\n\n\n-----\n\nImage 14: Relations between CopyCat entities\n\n\n-----\n\n## Appendices\n\nDomains used by the CopyCat malware\n\n*.mostatus.net\n*.mobisummer.com\n*.clickmsummer.com\n*.hummercenter.com\n*.tracksummer.com\n\nSHA 256 hashes\n\nRser Module\n1dd18a00b67211d3c307cf84f2836b972c60a8b37f7ce2c363621e56ad1ce431\n4cc9ede9d914663f0f7e5af06b35058cb2000969df6ff1f4976e62e38f0dfc24\n\nAser module\n7be9924b7ddbff6444984b4558cca6f586bd98dbd0796be4f4d3c0963b4973e0\n254583141a0a1ff2704464c5f420f908b5dc46c3139033f3e0cf84c80cee7723\n\nInjected libs\n100d7925973ff4d3418bb975cd81a20212de4e3b7e48d31c5506d9e50cc7b88c\n31ff9b8eef6593182cb43f9ab4ed357df1c18e0c25f944cd463d71e22c7f116a\n\nExploits module\n6acc29bfc5f8f772fa7aaf4a705f91cb68dc88cb22f4ef5101281dc42109a104\n\n\n-----\n\nExamples of application hashes\n\n4cbcb8f8eafb3d475362bdb7eddc4cb255c89926e03813ff0efa7652bb696e97\n3e9274183426e5b6986d0534f3331e3761daa800da1e68acdbbd50cdffed5b77\n2f83e80ad23c0aa5d0962c8846cf199842179d806ebec6d4d5ba10e797576101\n1dcce039352f4dcabc693fdc66121b61849767498fb68bb3b4e4b8f00757a359\n23520f0f96669fd4c57f2ce08bb35e2d3be62df2454743d997bc519e66d894b8\nca44d2f261c3404a303f46afd6819ed2c077f724032bd0f550cff9b450270706\nd77d9242bbf4594277b96ed9af5f2fa721b82c578d0e0c640f42928ec8002257\ne5091cf03936db47dea112c4588a8818a483de06c15a8c717eda5886209f2d4b\n1ba7ad1ad23f58e8004ac874a4317e289870e192d2d518c75e0587df1c592719\nda58b4519e52660f26c81d6fc2b8c0c6ba11262265597360d4de62023f5e5d90\n51dc097980b46d053085ff079b153f107d866a27dc19670b79928ec55ab336d7\n824119e6dc4fe6f236f9f248abffb77723b0da4632047c7f4edc336208b27b54\na0cf53bf42cd59016a6ec86747f066db62a7a9461fd903d38fd692e8c23bb5a8\nb0475da7c2934b24cc5830e0a03dec195f997af0132c8493635240f90d5bc15a\n0db037e7a2d1357228e9e03cee5d65b22266a017d55b72570e615f07fc22cc2d\nf3f71bbed9e9db95ada278aacb3d5fd53f481d785048a6fe8dbb2babc601baa3\n5a7a908733b71f71bd8f103d9ad2f8c229282d42a50bea2d080b942541b8c93d\n25942d57f2188c2a0181d15af7a5628e75376f1d1ce1dcf70930f80a781b418d\n1fe8af825d232bf55bd1d535ebdb0ebb88ba39e21914e40d33274b29d32680f7\ncea1a2984bd529d5451e1108e8f83cfe485350b43b51f754ccbe467ebcc1a429\n934d2ce9e35ab01b2362c2dbbb6b08b77de5b16145e4debee41bb6780cf8848f\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://www.checkpoint.com/downloads/resources/copycat-research-report.pdf"
    ],
    "report_names": [
        "copycat-research-report.pdf"
    ],
    "threat_actors": [
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1499360332,
    "ts_modification_date": 1499360494,
    "files": {
        "pdf": "https://archive.orkl.eu/7883a4d9567d654c7db1b7d3c94e15d1ad7eb09b.pdf",
        "text": "https://archive.orkl.eu/7883a4d9567d654c7db1b7d3c94e15d1ad7eb09b.txt",
        "img": "https://archive.orkl.eu/7883a4d9567d654c7db1b7d3c94e15d1ad7eb09b.jpg"
    }
}