{
    "id": "2965519a-4771-43fa-914e-80110fa881dc",
    "created_at": "2024-01-05T02:07:11.685451Z",
    "updated_at": "2025-03-27T02:17:27.693238Z",
    "deleted_at": null,
    "sha1_hash": "05b243bd81b310656d3348ee6d508de2f12a50d4",
    "title": "Current Iran-Associated Cyber Threats",
    "authors": "Symantec",
    "file_creation_date": "2020-01-24T09:44:15Z",
    "file_modification_date": "2020-01-24T09:47:10Z",
    "file_size": 648416,
    "plain_text": "# Symantec Critical Attack Discovery and Intelligence\n## Current Iran-Associated Cyber Threats\n\n### White Paper\n\nBroadcom SED-IAP-WP100\nJ 24 2020\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n##### Broadcom, the pulse logo, Connecting everything, and Symantec are among the trademarks of Broadcom.\n\n Copyright © 2020 Broadcom. All Rights Reserved.\n\n The term “Broadcom” refers to Broadcom Inc. and/or its subsidiaries. For more information, please visit www.broadcom.com.\n\n Broadcom reserves the right to make changes without further notice to any products or data herein to improve reliability, function, or design. Information furnished by Broadcom is believed to be accurate and reliable. However, Broadcom does not assume any liability arising out of the application or use of this information, nor the application or use of any product or circuit described herein, neither does it convey any license under its patent rights nor the rights of others.\n\nBroadcom SED-IAP-WP100\n2\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n## Table of Contents\n\n#### Chapter 1: About This Document ...................................................................................................... 4\n\n Chapter 2: Executive Summary ......................................................................................................... 5\n\n##### 2.1 Iranian Cyber Ecosystem .........................................................................................................................................5\n\n 2.2 Key Observations......................................................................................................................................................6\n\n 2.3 Outlook.......................................................................................................................................................................6\n\n#### Chapter 3: Details of Groups ............................................................................................................. 7\n\n##### 3.1 Shamoon....................................................................................................................................................................7\n\n 3.2 Dustman/ZeroCleare .................................................................................................................................................8\n\n 3.3 Elfin ............................................................................................................................................................................8\n\n 3.3.1 Case Study 1 ....................................................................................................................................................9\n\n 3.3.2 Case Study 2 ..................................................................................................................................................10\n\n 3.4 Seedworm ................................................................................................................................................................10\n\n 3.4.1 Case Study 1 ..................................................................................................................................................10\n\n 3.4.2 Case Study 2 ..................................................................................................................................................11\n\n 3.5 Tortoiseshell............................................................................................................................................................12\n\n 3.6 Chafer.......................................................................................................................................................................12\n\n 3.7 Crambus...................................................................................................................................................................13\n\n 3.7.1 Case Study .....................................................................................................................................................13\n\n 3.8 Other Iran-linked Groups........................................................................................................................................14\n\n#### Chapter 4: Conclusion ..................................................................................................................... 15\n\n Appendix A: Indicators of Compromise (IOCs) ............................................................................. 16\n\n Appendix B: Mitre Attack Techniques............................................................................................ 19\n\n Revision History ............................................................................................................................... 24\n\n##### SED-IAP-WP100; January 21, 2020.............................................................................................................................. 24\n\nBroadcom SED-IAP-WP100\n3\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Chapter 1: About This Document\n\n##### This report is classified TLP: Amber.\n\n The Traffic Light Protocol (TLP) was created in order to facilitate greater sharing of information. TLP is a set of designations used to ensure that sensitive information is shared with the appropriate audience.\n\n TLP:Red: Recipients may not share TLP:RED information with any parties outside of the specific exchange, meeting, or\n##### conversation in which it was originally disclosed.\n\n TLP:Amber: Recipients may only share TLP:AMBER information with members of their own organization, and with\n##### clients or customers who need to know the information to protect themselves or prevent further harm.\n\n TLP:Green: Recipients may share TLP:GREEN information with peers and partner organizations within their sector or\n##### community, but not via publicly accessible channels.\n\n TLP:White: Subject to standard copyright rules, TLP:WHITE information may be distributed without restriction.\n\n##### For additional information on the TLP, see http://www.us-cert.gov/tlp.\n\n For a briefing on this white paper, contact us at Threat.Intelligence@broadcom.com to connect with a Symantec security specialist.\n\nBroadcom SED-IAP-WP100\n4\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Chapter 2: Executive Summary\n\n##### Increased tensions between the U.S. and Iran have led to fears of an upsurge in Iranian cyber attacks against organizations associated with the U.S. and its allies. Iran has an extensive track record in this sphere, with government-sponsored cyber threat groups conducting numerous offensive cyber operations in recent years.\n\n Symantec, a Broadcom company, assesses that these groups will continue to conduct operations at a high pace. Furthermore, Symantec believes that any escalation in the number of operations or changes in industry or regional targeting focus will take time to materialize. Organizations in previously compromised industries and regions face a higher threat of being targeted by Iranian cyber operations and should re-examine their detection and mitigation strategies to deter Iranian government-sponsored threat groups' known tactics, techniques, and procedures (TTPs).\n\n However, an internal need to mount some kind of public response may mean the nature of Iranian activity may differ with the change in circumstances, causing them to target different organizations, in particular highly visible organizations associated with the U.S. and its allies.\n\n This document summarizes the various targeted attack activity groups, their recent action, and some indicators of compromise (IOCs) with the intention of providing the reader with an understanding of capabilities and techniques used by groups known to be operating from Iran. The attribution underlying the data in this paper is based on publicly available information and is not solely based on our own analysis directly.\n\n## 2.1 Iranian Cyber Ecosystem\n\n##### The Iranian cyber ecosystem is decentralized and fluid, with individual threat actors moving between cyber espionage groups and even undertaking cyber crime activity. Attacks are not infrequently outsourced to individual external contractors working within small corporate consultancies. This structure makes it difficult for researchers to definitively group threat actors and can offer the Iranian government plausible deniability for destructive attacks. In several cases, Symantec has seen threat actor groups share tools, infrastructure, targets, and tactics.\n\n The tactics of Iranian threat actors have evolved from quick and relatively simple destructive attacks, such as distributed denial of service (DDoS) attacks or website defacements, to an increased focus on network compromises where the actors maintain a persistent foothold and obfuscate their presence to make attribution difficult. Iranian groups have increasingly targeted critical infrastructure including energy and telecommunications companies.\n\n Iranian threat groups have also been tied to multiple destructive wiper attacks. Identifying potential targets for destructive attacks is particularly problematic because a change from espionage to destruction comes with limited warning if a threat group is already present on a network, as seen with Timberworm and Greenbug espionage operations facilitating the Shamoon destructive attacks beginning in late 2016.\n\nBroadcom SED-IAP-WP100\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n## 2.2 Key Observations\n\n##### Considering the multitude of disparate groups operating and conducting cyber attacks against organizations around the globe, there is not a single trait that defines them. The following are some key observations from tracking these groups:\n\n During recent years, actor groups operating out of Iran have honed their skills at an unprecedented scale, being able to\n##### victimize Fortune 500 organizations along with their public sector counterparts.\n\n The groups appear to be unconcerned with attacks being publicly attributed to them.\n\n Aside from Greenbug and Shamoon having worked together, most of the different groups seldom work in tandem; they\n##### seem to mostly be independent of each other, working under organizational mandates which do not often intersect.\n\n In the early years, the groups appeared motivated to conduct DDoS attacks against financial institutions, with the aim of\n##### attempting heists, but those attacks have not been seen for several years.\n\n Groups such as Elfin, Crambus, Seedworm, Chafer, Tortoiseshell, and others are motivated to conduct espionage by\n##### attacking: – Private sector: Telecommunication providers, transportation (air and marine) entities, defense contractors, oil and natural gas companies, and those in their supply chain. – Public sector: Military intelligence, diplomatic missions, think tanks, and defense ministries.\n\n Some of the groups have no reservations in conducting destructive attacks, rendering computing equipment unusable.\n\n Several groups make extensive use of dynamic DNS services while conducting attack campaigns.\n\n At least two of the groups have shown a proclivity towards using DNS as a communication channel between victimized\n##### computers and the malware's control infrastructure, that is DNS tunneling. This functionality has been observed across both IPv4 and IPv6.\n\n The two most widely used methods of infiltrating a target's network remain:\n##### – Spear phishing using topical themes with embedded scripts that invoke PowerShell to download additional components. – Publicly documented vulnerabilities such as those in VPN and web servers.\n\n All groups rely on public or open-source tools (Mimikatz, LaZagne, and so on) to conduct their campaigns; the only\n##### differing factor amongst the groups is the degree of reliance.\n\n There appear to be several hacktivists that conduct uncoordinated attacks, like site defacements, as a sign of\n##### patriotism. These are unpredictable and opportunistic, so details have been left out of this document.\n\n## 2.3 Outlook\n\n##### Given the history of attacks originating from Iran, it is evident the groups consider destruction of equipment as an acceptable form of damage to targets. However, to date these incidents have only targeted Middle Eastern entities. Iranian actors have not shown an appetite for conducting similar attacks against Western organizations. Considering the tense geopolitical climate in 2020 and based on previous Iranian activity, we believe cyber attacks originating from Iran or Iranian proxies would be (in order of descending probability):\n\n Wipers being used for destructive attacks against critical infrastructure\n\n Infrastructure for telecommunication providers being attacked to disrupt services\n\n Hacktivist defacements of popular websites\n\n DDoS attacks against financial entities\n\n##### To date, most Iran originating actor groups, other than Greenbug and Shamoon, operated with only a small degree of collaboration. We suspect a coordinated attack campaign is more likely in 2020 but organizing such an attack is likely to take time.\n\nBroadcom SED-IAP-WP100\n6\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Chapter 3: Details of Groups\n\n##### Over the past several months, several Iran-linked threat groups named Shamoon, Elfin, Seedworm, and Crambus have been especially prolific against a wide range of industry verticals.\n\n## 3.1 Shamoon\n\n**Name** Shamoon\n\n**Aliases** Cutting Sword of Justice\n\n**First Seen** 2012\n\n**Malware Used** [W32.Disttrack, W32.Disttrack.B, Trojan.Filerase](https://www.symantec.com/security_response/writeup.jsp?docid=2012-081608-0202-99)\n\n**Targeted Sectors** Energy, Aviation, Government\n\n**Infection Vectors** Secondary infections\n\n##### Shamoon has received a lot of public attention since it first appeared in August 2012 and used the malware family W32.Disttrack in its attacks against two Middle Eastern oil and natural gas organizations. The attacks were destructive in nature, wiping out critical data from computers and rendering them unusable.\n\n The malware used by this group leveraged a legitimate driver to wipe machines, and subsequently reported wiping statistics to a command and control (C&C) server.\n\n In both attacks from 2012, and those subsequently seen towards the end of 2016, hard-coded network credentials were configured into the malware, which assisted its spreading across the network. These credentials were acquired and likely shared by Greenbug, allowing Shamoon the ability to execute its attack.\n\n Table 1 shows the timeline of activity on a single computer used as patient zero during a Shamoon attack at the end of 2016.\n\n**Table 1: Activity Timeline on Computer During 2016 Shamoon Attack**\n\n**Time** **File Name** **Description**\n\n08/12/2016 06:24 MSMPENG.EXE Mimikatz\n\n18/01/2017 16:33 in-cloud4.exe PSExec\n\n18/01/2017 16:33 cloudapp4.exe PAADmin\n\n18/01/2017 16:35 PNRP4.exe Hacktools\n\n18/01/2017 18:48 gc.exe Hacktools\n\n18/01/2017 18:48 gc.exe Hacktools\n\n18/01/2017 18:49 ff.exe Hacktools\n\n18/01/2017 18:49 ie.exe Hacktools\n\n18/01/2017 18:49 ff.exe Hacktools\n\n18/01/2017 18:49 ie.exe Hacktools\n\n18/01/2017 18:50 em.exe Hacktools\n\n18/01/2017 18:50 em.exe Hacktools\n\n18/01/2017 18:52 ol.exe Hacktools\n\n22/01/2017 18:19 pnrp4.exe Hacktools\n\n22/01/2017 18:19 cloudapp4.exe Hacktools\n\n23/01/2017 03:05 ntertmgr32.exe W32.Disttrack.B\n\nBroadcom SED-IAP-WP100\n\n|Time|File Name|Description|\n|---|---|---|\n|08/12/2016 06:24|MSMPENG.EXE|Mimikatz|\n|18/01/2017 16:33|in-cloud4.exe|PSExec|\n|18/01/2017 16:33|cloudapp4.exe|PAADmin|\n|18/01/2017 16:35|PNRP4.exe|Hacktools|\n|18/01/2017 18:48|gc.exe|Hacktools|\n|18/01/2017 18:48|gc.exe|Hacktools|\n|18/01/2017 18:49|ff.exe|Hacktools|\n|18/01/2017 18:49|ie.exe|Hacktools|\n|18/01/2017 18:49|ff.exe|Hacktools|\n|18/01/2017 18:49|ie.exe|Hacktools|\n|18/01/2017 18:50|em.exe|Hacktools|\n|18/01/2017 18:50|em.exe|Hacktools|\n|18/01/2017 18:52|ol.exe|Hacktools|\n|22/01/2017 18:19|pnrp4.exe|Hacktools|\n|22/01/2017 18:19|cloudapp4.exe|Hacktools|\n|23/01/2017 03:05|ntertmgr32.exe|W32.Disttrack.B|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n##### Credentials were likely stolen a month prior to the attackers' return to use common legitimate tools to dump additional information from the victim network before deploying Disttrack.\n\n Shamoon reappeared for a third time in December 2018 when it was once again used against targets in the Middle East. These attacks were doubly destructive, since they involved a new wiper (Trojan.Filerase) that deletes files from infected computers before the Shamoon malware wipes the master boot record (MBR).\n\n## 3.2 Dustman/ZeroCleare\n\n**Name** Dustman\n\n**Aliases** ZeroCleare\n\n**First Seen** 2019\n\n**Malware Used** Dustman, ZeroCleare\n\n**Targeted Sectors** Energy\n\n**Infection Vectors** Unknown\n\n##### In December 2019, IBM X-Force publicly wrote about a wiper malware it came across and named ZeroCleare based on PDB strings within the malware. This malware is an evolution of Disttrack, used in the Shamoon incidents. The authors updated the malware logic but retained the underlying logic of utilizing the Eldos driver to overwrite the MBR and partitions. The attackers used a vulnerable VirtualBox driver to bypass security controls and eventually use the Eldos driver to gain direct access to the raw hard disk and conduct their wiping operation.\n\n Symantec automatically detected and blocked this piece of malware in July 2019, which appears closer to the date of compilation of the malware in June 2019.\n\n In January 2020, the National Cybersecurity Authority of Saudi Arabia released a report about a wiper malware they called Dustman based on the file name used during an attack campaign. Dustman is a further evolution of ZeroCleare, where the authors optimized functionality into a single file instead of the methods used in the June/July campaigns.\n\n## 3.3 Elfin\n\n**Name** Elfin\n\n**Aliases** APT33, Stonedrill, Holmium, Refined Kitten, Magnallium, Alibaba\n\n**First Seen** 2015\n\n**Malware Used** [Hacktool.Mimikatz, Backdoor.Notestuk, Trojan.Nancrat, Trojan.Netweird.B, Trojan.Stonedrill,](https://www.symantec.com/security-center/writeup/2012-042615-3731-99)\n[Backdoor.Patpoopy, Trojan.Quasar, RULER, Backdoor.Powerton](https://www.symantec.com/security-center/writeup/2017-022715-3830-99)\n\n**Targeted Sectors** Aerospace, Defense, Energy, Chemical Engineering, Financial, Food, Government, Logistics, Professional\nServices, Shipping, Technology\n\n**Infection Vectors** Email\n\n##### Elfin relies on custom and commodity malware to gather data for likely cyber espionage operations targeted at entities primarily in Saudi Arabia and the United States.\n\n Elfin makes extensive use of dynamic DNS infrastructure during targeting, along with purchased hosts at globally located VPS providers serving as proxies for C&C.\n\nBroadcom SED-IAP-WP100\n8\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n### 3.3.1 Case Study 1\n\n##### In June 2019, Elfin sent out a phishing email to hundreds of recipients across multiple countries in what could be deemed an opportunistic trawling attack. The link within the document led recipients to dynamic DNS infrastructure controlled by the attackers. Figure 1 is a screenshot of the email sent.\n\n**Figure 1: Screenshot of Email Sent by Elfin**\n\n##### As Symantec observed email activity across numerous sectors and regions, it appeared likely that Elfin was conducting a widespread email campaign with enticing lures to hook high-value targets at multiple organizations, rather than targeting specific industries.\n\nBroadcom SED-IAP-WP100\n9\n\n\n##### As Symantec observed email activity across numerous sectors and regions, it appeared likely that Elfin was conducting a\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n### 3.3.2 Case Study 2\n\n##### Subsequently, in late August 2019, Elfin operators compromised a victim in Saudi Arabia with a malicious HTA file. Following the initial compromise, Elfin continued to rely on the group's known TTPs to further its foothold in the host. During the incident, the legitimate utility mshta.exe executed a malicious HTA file with a job application theme (Figure 2).\n\n**Figure 2: Malicious HTA file with a Job Application Theme**\n\n##### Based on the file path of the malicious HTA file in the command shown in Figure 2, the file was downloaded after a victim used Microsoft Edge to visit a malicious website. Elfin actors have previously leveraged emails containing links to malicious websites that, when visited, automatically download their first-stage malware to victim machines.\n\n A PowerShell command then downloaded a JPG file from a dynamic DNS host spoofing a U.S. defense contractor.\n\n**Figure 3: PowerShell Command Used to Download JPG File**\n\n## 3.4 Seedworm\n\n**Name** Seedworm\n\n**Aliases** MuddyWater, Temp Zagros, Static Kitten\n\n**First Seen** 2017\n\n**Malware Used** [Backdoor.Powemuddy, (aka Powermud, POWERSTATS), SHARPSTATS, DELPHSTATS, Backdoor.Mori](https://www.symantec.com/security-center/writeup/2018-120306-2744-99)\n\n**Targeted Sectors** Government, Energy, Telecommunications, Technology, Research\n\n**Infection Vectors** Email\n\n##### Seedworm has been engaging in espionage operations predominately in Turkey, Pakistan, Russia, and a number of Middle Eastern countries.\n\n### 3.4.1 Case Study 1\n\n##### Between April and June 2019, Seedworm used the Powermud v2 backdoor to attack four victims in the telecommunications and education industries in Turkey, New Zealand, Ukraine, and the United Kingdom.\n\n Seedworm gained access to the victims' networks through phishing emails with attached Microsoft Word documents, which the actors likely used as lure files. These documents contained a malicious macro that runs when the user clicks Enable Editing and Enable Content. Examples of these documents are shown in Figure 4.\n\nBroadcom SED-IAP-WP100\n10\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Figure 4: Examples of Word Documents Used by Seedworm**\n\n##### On a computer within an IT services management company in Turkey, the group uploaded PowerShell Empire, a post- exploitation framework that allows users to run PowerShell commands without using powershell.exe, which includes modules to aid in credential stealing and data collection.\n\n After compromising a target system by installing Powermud, Seedworm first runs a tool that steals passwords saved in users' web browsers and email, demonstrating that access to the victim's email, social media, and chat accounts is one of the group's likely goals. Seedworm then uses open-source tools such as LaZagne and Crackmapexec to obtain Windows authorization credentials. Seedworm uses off-the-shelf, unmodified versions of these tools as well as custom-compiled variants, which we have determined are only used by this group.\n\n In order to perform lateral movement on the victim's network, Seedworm uses a vulnerability scanner to search for Microsoft Server Message Block (SMB) remote code execution vulnerabilities on other computers in the compromised subnet (see security update MS17-010).\n\n### 3.4.2 Case Study 2\n\n##### The most recent Seedworm espionage activity was seen between October 2019 and January 2020, against international public organizations, think tanks, and telcos across the U.S., Nigeria, Afghanistan, Iraq, Saudi Arabia, and Pakistan. The malware used by Seedworm in this attack is called Backdoor.Mori, which:\n\n Creates and stores data within the registry under HKLM\\Software\\NFC\n\n Executes commands from the operator on-demand, utilizing pipes and cmd.exe /c\n\n Uses DNS tunneling to communicate with its C&C server\n\n##### Examined samples contain the following domains to be used for DNS tunneling C&C communication, one of which is picked randomly and used:\n\n**Table 2: Domains Used for DNS Tunneling C&C Communication**\n\ndevice-update [ . ]tk googlecloud [ . ]cf googlecloud [ . ]gq\n\nmicrosoftsecurity [ . ]gq msdn-social [ . ]ml msdn-social [ . ]tk\n\nofficex64 [ . ]ml outlook-accounts [ . ]ml outlook-accounts [ . ]tk\n\nspacex [ . ]cf spacex [ . ]gq windowscortana [ . ]tk\n\nwindows-patch [ . ]ml windows-patch [ . ]tk —\n\n##### Some variants of Backdoor.Mori communicate via HTTP with a unique identifier for the sample being used, possibly customized for the victim network\n\nBroadcom SED-IAP-WP100\n11\n\n|device-update [ . ]tk|googlecloud [ . ]cf|googlecloud [ . ]gq|\n|---|---|---|\n|microsoftsecurity [ . ]gq|msdn-social [ . ]ml|msdn-social [ . ]tk|\n|officex64 [ . ]ml|outlook-accounts [ . ]ml|outlook-accounts [ . ]tk|\n|spacex [ . ]cf|spacex [ . ]gq|windowscortana [ . ]tk|\n|windows-patch [ . ]ml|windows-patch [ . ]tk|—|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n##### Seedworm appears to have used Word and Excel documents as the infection vector during this attack campaign. These documents used a combination of JavaScript downloaders and PowerShell to install the Mori backdoor on victim computers. As an example, on one targeted computer Excel was observed being used to download additional components, as shown in Figure 5.\n\n**Figure 5: Excel Used to Download Additional Components**\n\n## 3.5 Tortoiseshell\n\n**Name** Tortoiseshell\n\n**Aliases** None\n\n**First Seen** 2018\n\n**Malware Used** Backdoor.Syskit\n\n**Targeted Sectors** IT services\n\n**Infection Vectors** Compromised web servers\n\n##### Tortoiseshell has tentative links to the Elfin group. The group has to date focused itself on performing classic supply chain attacks against Saudi Arabian organizations. The target organizations are primarily IT providers operating widely in the region. Tortoiseshell is believed to be compromising IT providers in order to gain access to their clients.\n\n As part of the infection routine on one target, the attackers initially compromised a web server, installed a web shell, and then used it to deploy malware onto the network. Once on a victim computer, Tortoiseshell deploys several information gathering tools, retrieving a range of information about the computer, including IP configuration, running applications, system information, network connectivity, and so on.\n\n## 3.6 Chafer\n\n**Name** Chafer\n\n**Aliases** APT39\n\n**First Seen** 2014\n\n**Malware Used** [Backdoor.Remexi, Backdoor.Remexi.B, Backdoor.Agenty, Backdoor.Tcpy, and Backdoor.Httpy](https://www.symantec.com/security_response/writeup.jsp?docid=2015-110911-3433-99)\n\n**Targeted Sectors** Airlines, Telecommunications, Software Development\n\n**Infection Vectors** Email, SQL Injections\n\n##### Chafer is one of the most active Iran-linked groups in operation. Chafer has compromised a large number of organizations based in the Middle East and Europe.\n\n Chafer appears to be primarily involved in intelligence gathering and several of its attacks, such as those against telco operators or airlines, were likely carried out to facilitate surveillance of end-user customers.\n\nBroadcom SED-IAP-WP100\n12\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n##### One of the organizations compromised by Chafer in 2017 was a telco services provider in the Middle East, which sells its solutions to multiple telco operators in the region. By moving two steps up the supply chain the attackers could potentially have carried out surveillance on a vast pool of end users. Chafer is also known to have attempted to compromise a large international travel reservations firm, indicating its mission to track movements or communication related to certain entities.\n\n Chafer has been observed compromising victims by attacking web servers, likely through SQL injection attacks. It has also used malicious documents likely circulated using spear-phishing emails sent to individuals working in targeted organizations.\n\n## 3.7 Crambus\n\n**Name** Crambus\n\n**Aliases** Oilrig, Twisted Kitten, APT34, ITG13\n\n**First Seen** 2015\n\n**Malware Used** [Trojan.Herherminth, Trojan.Ismagent, Poison Frog, Sakabota, QUADAGENT, Glimpse, Highshell](https://www.symantec.com/security-center/writeup/2016-052715-5415-99)\n\n**Targeted Sectors** Government, Financial, Technology\n\n**Infection Vectors** Email, Watering Holes\n\n##### Crambus has mounted operations against targets in Saudi Arabia, Israel, the United Arab Emirates, Lebanon, Kuwait, Qatar, the United States, and Turkey.\n\n The group usually infects its victims with malware via spear-phishing attacks, targeting individuals within organizations of interest using malicious Office documents with embedded macros to install its backdoor. Crambus has also been known to send emails containing links to websites registered by the attackers and employ social-engineering tactics to trick victims into downloading and installing its malware.\n\n### 3.7.1 Case Study\n\n##### Between July 2018 and June 2019, Crambus engaged in network intrusion operations against organizations in the Middle East, with a particular focus on Saudi Arabia and Kuwait. Targets included public administration and defense organizations, a technology organization, and an airline.\n\n After gaining access to the targeted computers, Crambus executed two backdoors: Sakabota and Poison Frog. Sakabota can be used for reconnaissance, privilege escalation, lateral movement, and to maintain persistence. It contains additional functionality shown in Table 3.\n\n**Table 3: Additional Sakabota Functionality**\n\nDownloading files from a URL Uploading files over FTP\n\nTaking screenshots Brute force logins to network shares\n\nRemote port forwarding Scanning ports\n\nConducting ping scans —\n\n##### Poison Frog is capable of using DNS tunneling for C&C, uploading and downloading files to a C&C server, and executing remote commands.\n\n Crambus also deployed the webshells shown in Table 4 on infected computers to maintain persistence.\n\nBroadcom SED-IAP-WP100\n13\n\n|Table 3: Additional Sakabota Functionality|Col2|\n|---|---|\n|Downloading files from a URL|Uploading files over FTP|\n|Taking screenshots|Brute force logins to network shares|\n|Remote port forwarding|Scanning ports|\n|Conducting ping scans|—|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 4: Webshells used by Crambus to maintain persistence**\n\n**File Name** **SHA256**\n\nOwa.aspx 24307b1fa0e6e513355b3143a3c61c5ddf7adf43a70856dd1ab6449cf8cb2408\n\nError.aspx.txt 97df67112a953a91bd86a9df3e039493eba95b544a8e3acec2fe5b274c01240a\n\n##### To collect credentials and escalate privileges, Crambus used a number of publicly available tools including:\n\n Invoke-WCMDump - A PowerShell tool that can dump credentials from the Windows Credential Manager.\n\n Mimikatz - An open-source, post-compromise credential theft tool.\n\n LaZagne - An open-source password recovery tool.\n\n##### Alongside the lateral movement capabilities of Sakabota, the group used several command-line utilities to perform lateral movement, including the native Windows utility Netsh and Plink, the command-line tool from the PuTTY suite.\n\n## 3.8 Other Iran-linked Groups\n\n**Table 5: Other Iran-linked Groups**\n\n**Name** **Aliases** **Description** **Tools**\n\nCadelle — Active since at least 2012. Known for compromising a large number of [Backdoor.Cadelspy](https://www.symantec.com/security-center/writeup/2015-090808-1754-99)\nindividuals in Iran, as well as organizations outside Iran. The organizations\noutside Iran include airlines, telecommunication companies, and at least one\nMiddle Eastern Ministry of Foreign Affairs. Likely linked with the Chafer group.\nBoth groups have attacked the same organizations, even infecting several of the\nsame computers. In one case, the same computer was compromised within\nminutes by both groups. It is possible that Cadelle and Chafer are one in the\nsame, however, there is insufficient evidence to definitely state this.\n\nGreenbug Volatile Kitten, Active since at least June 2016. Involved in targeted attacks in the Middle East [Trojan.Ismdoor](https://www.symantec.com/security-center/writeup/2016-112401-0727-99)\nCutting Kitten against organizations in the government, aviation, energy, investment and, [Hacktool.Seasharpee](https://www.symantec.com/security-center/writeup/2017-051714-3547-99)\neducation sectors. Possible link to Shamoon, since a number of organizations\n\n[Backdoor.Vodiboti](https://www.symantec.com/security-center/writeup/2017-083115-3819-99)\n\ncompromised by Greenbug were subsequently attacked by Shamoon.\n\nTimberworm Magic Hound, Active since at least 2016. Known to attack organizations in the government, [Backdoor.Mhretriev](https://www.symantec.com/security-center/writeup/2017-022712-2204-99)\nNews Beef energy, chemical/pharmaceutical and transportation sectors. Focused on Saudi [Backdoor.Mapkill](https://www.symantec.com/security-center/writeup/2017-013018-4839-99)\nArabia, but victims have also been discovered in Iraq, the UAE, Qatar, and the\nU.S. Possibly linked to Shamoon, since a number of organizations compromised\nby Timberworm were subsequently attacked by Shamoon.\n\nCricket Rocket Kitten, Active since at least January 2010, Cricket initially made its name through [Trojan.Rapidstealer](https://www.symantec.com/security-center/writeup/2014-051413-2445-99)\nFlying Kitten website defacements but has since expanded into espionage, targeting [Infostealer.Mysayad](https://www.symantec.com/security-center/writeup/2014-071413-1624-99)\ndissidents in Iran for surveillance and defense targets in the U.S. Does not\nappear to be very sophisticated and relies heavily on social engineering. It may\nhave purchased or developed custom malware to use in these attacks.\n\nLeafminer — Active since at least March 2017, Leafminer is known to have compromised a [Backdoor.Sorgu](https://www.symantec.com/security-center/writeup/2018-052111-1102-99)\nnumber of high profile websites in the Middle East in order to steal SMB [Trojan.Imecab](https://www.symantec.com/security-center/writeup/2018-052111-1609-99)\ncredentials from victim machines. It has targeted organizations in the\nconstruction, education, engineering, government, IT, legal, and transport\nsectors. The group is known to steal email data, SQL databases, and credentials.\n\nFruitworm Copy Kitten Active since at least March 2015, Fruitworm is known to target Israeli individuals [Trojan.Jectin](https://www.symantec.com/security-center/writeup/2015-040923-3643-99)\nin government organizations and academic institutions. Its primary method of\nattack is topic-tailored spear-phishing emails, which are used to deliver malware\nto the target.\n\nBroadcom SED-IAP-WP100\n14\n\n|Table 4: Webshells used by|Crambus to maintain persistence|\n|---|---|\n|File Name|SHA256|\n|Owa.aspx|24307b1fa0e6e513355b3143a3c61c5ddf7adf43a70856dd1ab6449cf8cb2408|\n|Error.aspx.txt|97df67112a953a91bd86a9df3e039493eba95b544a8e3acec2fe5b274c01240a|\n\n|Name|Aliases|Description|Tools|\n|---|---|---|---|\n|Cadelle|—|Active since at least 2012. Known for compromising a large number of individuals in Iran, as well as organizations outside Iran. The organizations outside Iran include airlines, telecommunication companies, and at least one Middle Eastern Ministry of Foreign Affairs. Likely linked with the Chafer group. Both groups have attacked the same organizations, even infecting several of the same computers. In one case, the same computer was compromised within minutes by both groups. It is possible that Cadelle and Chafer are one in the same, however, there is insufficient evidence to definitely state this.|Backdoor.Cadelspy|\n|Greenbug|Volatile Kitten, Cutting Kitten|Active since at least June 2016. Involved in targeted attacks in the Middle East against organizations in the government, aviation, energy, investment and, education sectors. Possible link to Shamoon, since a number of organizations compromised by Greenbug were subsequently attacked by Shamoon.|Trojan.Ismdoor Hacktool.Seasharpee Backdoor.Vodiboti|\n|Timberworm|Magic Hound, News Beef|Active since at least 2016. Known to attack organizations in the government, energy, chemical/pharmaceutical and transportation sectors. Focused on Saudi Arabia, but victims have also been discovered in Iraq, the UAE, Qatar, and the U.S. Possibly linked to Shamoon, since a number of organizations compromised by Timberworm were subsequently attacked by Shamoon.|Backdoor.Mhretriev Backdoor.Mapkill|\n|Cricket|Rocket Kitten, Flying Kitten|Active since at least January 2010, Cricket initially made its name through website defacements but has since expanded into espionage, targeting dissidents in Iran for surveillance and defense targets in the U.S. Does not appear to be very sophisticated and relies heavily on social engineering. It may have purchased or developed custom malware to use in these attacks.|Trojan.Rapidstealer Infostealer.Mysayad|\n|Leafminer|—|Active since at least March 2017, Leafminer is known to have compromised a number of high profile websites in the Middle East in order to steal SMB credentials from victim machines. It has targeted organizations in the construction, education, engineering, government, IT, legal, and transport sectors. The group is known to steal email data, SQL databases, and credentials.|Backdoor.Sorgu Trojan.Imecab|\n|Fruitworm|Copy Kitten|Active since at least March 2015, Fruitworm is known to target Israeli individuals in government organizations and academic institutions. Its primary method of attack is topic-tailored spear-phishing emails, which are used to deliver malware to the target.|Trojan.Jectin|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Chapter 4: Conclusion\n\n##### The recent upsurge in tensions between Iran and the U.S. could lead to an increase in both the frequency and aggressiveness of Iranian attacks. While Symantec has yet to see any evidence of a notable uptick in activity, this should not be misinterpreted, since planned operations could take some time to prepare and execute.\n\n Organizations associated with the U.S. and its allies are an obvious target. While Iranian actors have, to date, heavily focused on organizations in the Middle East, attacks against the U.S. should not be ruled out, particularly considering the heightened state of tensions at present.\n\n However, organizations based in the Middle East are probably those most at risk, given that Iranian groups know this region best and may already have ongoing compromises. Destructive attacks, such as those involving disk wipers, usually require some prior compromise of the organization's network. This may mean that any potential destructive attacks could be focused on the Middle East, particularly if the attackers are under time pressure to retaliate.\n\n Most destructive attacks originating from Iran have involved Shamoon disk-wiping malware. Since Shamoon leverages the legitimate Eldos driver to wipe machines, organizations concerned about a potential Shamoon attack could mitigate the risk of exposure by hunting for and disabling the Eldos driver on their network.\n\n In addition to this, any organization that has found evidence of an intrusion by any Iran-linked group in the past should remain on high alert, since attacks frequently rely on credentials stolen in earlier intrusions.\n\n Nevertheless, any potential target (organizations publicly associated with or strategically important to the U.S. or its allies) should exercise extreme vigilance and review its security posture.\n\n For a briefing on this white paper, contact us at Threat.Intelligence@broadcom.com to connect with a Symantec security specialist.\n\nBroadcom SED-IAP-WP100\n1\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Appendix A: Indicators of Compromise (IOCs)\n\n**Table 6: Indicators of Compromise (IOCs)**\n\n**Group** **IOC** **Description**\n\nShamoon SHA256: Disttrack.B Wiper malware\n89850b5f6e06db3965d0fdf8681bc6e55d3b572c97351190c247b9c8b1419850\n\nShamoon SHA256: Targeted malware\nbac9503a28ef97ee5d77fc3caedbf4f61e975679212f5da7945e6063c1d8a88f\n\nShamoon SHA256: Disttrack.B Wiper malware\nbd2097055380b96c62f39e1160d260122551fa50d1eccdc70390958af56ac003\n\nDustman/ZeroCleare MD5: 1a69a02b0cd10b1764521fec4b7376c9 Wiper malware (x64)\n\nDustman/ZeroCleare MD5: 33f98b613b331b49e272512274669844 Wiper malware (x86)\n\nDustman/ZeroCleare MD5: 69b0cec55e4df899e649fa00c2979661 ElDos driver (x86)\n\nDustman/ZeroCleare MD5: 993e9cb95301126debdea7dd66b9e121 ElDos driver (x64)\n\nSeedworm SHA256: Xsxeon\n7b4da8f9ffa435c689923b7245133ee032f99fcd841516f2e2275fb4b76d28f9\n\nSeedworm SHA256: Powermud.v2\n36fc0a750d29ecf1d31ae3c7e834e548fe8eed25db62dfbdbf9148d896c13f59\n\nSeedworm SHA256: Powermud.v2\n5f2eac7251a9fc74309985b3dc1d9730f86c8cd95b22d16b04c0ad0521f10598\n\nSeedworm SHA256: Powermud.v2\n7b93b928bb9e41a7b890bc2ad559044fa39351d7f42a0bcb0ee1d2bb5def8e60\n\nSeedworm SHA256: Lazagne\nf0c726c75a79e83ab24c6d6e04022974bd79d35ff4c3e0118e7707eedd7edea2\n\nSeedworm SHA256: Downloader\n905e3f74e5dcca58cf6bb3afaec888a3d6cb7529b6e4974e417b2c8392929148\n\nSeedworm SHA256: Downloader\n148839e013fee10ee5007f80de2e169778739e84d1bbb093f69b56060ceef73f\n\nSeedworm SHA256: Downloader\n18cfd4c853b4fb497f681ea393292aec798b65d53874d8018604068c30db5f41\n\nSeedworm SHA256: Downloader\n1d768c6a5165cadf39ac68e4cc294399f09b48dfefd7bfd6d78e75ad882cd3f1\n\nSeedworm SHA256: Downloader\n20ec56029ec2dc6a0f86d172f12914d078fc679a8d01257394864413d01d7eda\n\nSeedworm SHA256: Downloader\n2f69f7df7a2ab7b1803bb50b23ac17f7047b4651513bdff98dae5adee492c98f\n\nSeedworm SHA256: Downloader\n32c5d06a518a17daf825374449a5096e1109a1eb99c010bb2524b9b0ed6e3114\n\nSeedworm SHA256: Downloader\n4a2db2c017b44834bfab8bd7ba107750d77cd1e62db0b4892ab3c053b2d64fae\n\nSeedworm SHA256: Downloader\n64001be2fc9ccec320d48c75d2de8ad7cd74092065cb44fe35b38624d4493df0\n\nSeedworm SHA256: Downloader\n7f31ab924bddc2f20697157f7cfa6ff25adfbbb50403052cccd05dc0e9faabc4\n\nSeedworm SHA256: Downloader\n905e3f74e5dcca58cf6bb3afaec888a3d6cb7529b6e4974e417b2c8392929148\n\nBroadcom SED-IAP-WP100\n16\n\n|Table 6: Indicators of|Compromise (IOCs)|Col3|\n|---|---|---|\n|Group|IOC|Description|\n|Shamoon|SHA256: 89850b5f6e06db3965d0fdf8681bc6e55d3b572c97351190c247b9c8b1419850|Disttrack.B Wiper malware|\n|Shamoon|SHA256: bac9503a28ef97ee5d77fc3caedbf4f61e975679212f5da7945e6063c1d8a88f|Targeted malware|\n|Shamoon|SHA256: bd2097055380b96c62f39e1160d260122551fa50d1eccdc70390958af56ac003|Disttrack.B Wiper malware|\n|Dustman/ZeroCleare|MD5: 1a69a02b0cd10b1764521fec4b7376c9|Wiper malware (x64)|\n|Dustman/ZeroCleare|MD5: 33f98b613b331b49e272512274669844|Wiper malware (x86)|\n|Dustman/ZeroCleare|MD5: 69b0cec55e4df899e649fa00c2979661|ElDos driver (x86)|\n|Dustman/ZeroCleare|MD5: 993e9cb95301126debdea7dd66b9e121|ElDos driver (x64)|\n|Seedworm|SHA256: 7b4da8f9ffa435c689923b7245133ee032f99fcd841516f2e2275fb4b76d28f9|Xsxeon|\n|Seedworm|SHA256: 36fc0a750d29ecf1d31ae3c7e834e548fe8eed25db62dfbdbf9148d896c13f59|Powermud.v2|\n|Seedworm|SHA256: 5f2eac7251a9fc74309985b3dc1d9730f86c8cd95b22d16b04c0ad0521f10598|Powermud.v2|\n|Seedworm|SHA256: 7b93b928bb9e41a7b890bc2ad559044fa39351d7f42a0bcb0ee1d2bb5def8e60|Powermud.v2|\n|Seedworm|SHA256: f0c726c75a79e83ab24c6d6e04022974bd79d35ff4c3e0118e7707eedd7edea2|Lazagne|\n|Seedworm|SHA256: 905e3f74e5dcca58cf6bb3afaec888a3d6cb7529b6e4974e417b2c8392929148|Downloader|\n|Seedworm|SHA256: 148839e013fee10ee5007f80de2e169778739e84d1bbb093f69b56060ceef73f|Downloader|\n|Seedworm|SHA256: 18cfd4c853b4fb497f681ea393292aec798b65d53874d8018604068c30db5f41|Downloader|\n|Seedworm|SHA256: 1d768c6a5165cadf39ac68e4cc294399f09b48dfefd7bfd6d78e75ad882cd3f1|Downloader|\n|Seedworm|SHA256: 20ec56029ec2dc6a0f86d172f12914d078fc679a8d01257394864413d01d7eda|Downloader|\n|Seedworm|SHA256: 2f69f7df7a2ab7b1803bb50b23ac17f7047b4651513bdff98dae5adee492c98f|Downloader|\n|Seedworm|SHA256: 32c5d06a518a17daf825374449a5096e1109a1eb99c010bb2524b9b0ed6e3114|Downloader|\n|Seedworm|SHA256: 4a2db2c017b44834bfab8bd7ba107750d77cd1e62db0b4892ab3c053b2d64fae|Downloader|\n|Seedworm|SHA256: 64001be2fc9ccec320d48c75d2de8ad7cd74092065cb44fe35b38624d4493df0|Downloader|\n|Seedworm|SHA256: 7f31ab924bddc2f20697157f7cfa6ff25adfbbb50403052cccd05dc0e9faabc4|Downloader|\n|Seedworm|SHA256: 905e3f74e5dcca58cf6bb3afaec888a3d6cb7529b6e4974e417b2c8392929148|Downloader|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 6: Indicators of Compromise (IOCs) (Continued)**\n\n**Group** **IOC** **Description**\n\nTortoiseshell SHA256: Custom Backdoor\n02a3296238a3d127a2e517f4949d31914c15d96726fb4902322c065153b364b2\n\nTortoiseshell SHA256: Custom Backdoor\n07d123364d8d04e3fe0bfa4e0e23ddc7050ef039602ecd72baed70e6553c3ae4\n\nTortoiseshell SHA256: Poisonfrog\n07e791d18ea8f2f7ede2962522626b43f28cb242873a7bd55fff4feb91299741\n\nTortoiseshell SHA256: Alias:Infostealer\n08cb4383288d2e5829b0fc186df36deb6b8078137b6b3a338a0597a665204852\n\nTortoiseshell SHA256: Custom Backdoor\n0e5d06e08a1a665b1112043e99718392fe1aeb700793fd49be7f60d7f3b63e4d\n\nTortoiseshell SHA256: Alias: TCPStager\n18e5753be209eafb6292f712d481cf264273d5e592cca81fc2a990440f49a545\n\nTortoiseshell SHA256: CVE-2018-8440\n1c79900c35fcb0e717ccb6939e4a5801ad7c3b7c806a74e48ce9c8a77c135bb5\n\nTortoiseshell SHA256: Custom Backdoor\n225e06c4ad0d00387f814de69be3e5dfa655d96e34b94fb0777b6aa045f127d1\n\nTortoiseshell SHA256: Alias:ListNetstat\n248cbfa25130e37916d4593fc192a2dc666bc67755cdebdc0f1cdf91bd4a518b\n\nTortoiseshell SHA256: Custom Backdoor\n34588fb9b32d09d83de2f911beed013c87074ad572c97bc0197d30e9777a4154\n\nTortoiseshell SHA256: Poisonfrog\n3a7b95c93f2e525f7dfa1816652d8cebb682fc9daa26c66e193f0c5190d0ed17\n\nTortoiseshell SHA256: Powershell\n444c4e9b4e0217c7b5a00aab3348913a2ea8aad005cdcd6fc033ef34642d5bf8\n\nTortoiseshell SHA256: Downloader\n4e0ca724fd8a18a94d9dbc990aa506981db700c76e5611a02e189a430d5f4764\n\nTortoiseshell 5 SHA256: Alias:ListNetstat\n26799f0791ad26cbd781d89bf4363e6827b3b5f59746405a847dec45f040796\n\nTortoiseshell SHA256: Alias:Infostealer\n55adf532a7b7fb2b291b88b072fda5c0d642bf9bd4af316ae8c40c70feb391a4\n\nTortoiseshell SHA256: Alias:ListNetstat\n5dbd3018d2e6c2b207506d511aa18cbde292c4bf2a127073150cd276fc6e925e\n\nTortoiseshell SHA256: Custom Backdoor\n694e7361f2698e6995bab4b3d1cda4e98f8d83d1ba8c39367be6158bc17ad30e\n\nTortoiseshell SHA256: Custom Backdoor\n707cbcf75a08445479388ade04229c7e08f48cf2f9efc47fc27de564406c56e2\n\nTortoiseshell SHA256: Alias:Screenshot\n77a85a06a9c00cc58f4b701ef574389b13b6edd04b93fbabcf0a4de03b68ab76\n\nTortoiseshell SHA256: CVE-2018-8440\n869ae66ec2d7e46cbfb2c3d15b34b77a12a372ed0c5e92587afcce892c1f6b17\n\nTortoiseshell SHA256: Custom Backdoor\n882d51c2f258fc4bc189837b6de12760a51764bc0f621a692173273ff59af117\n\nTortoiseshell SHA256: Custom Backdoor\n8f149e7e454053505dcc3252dd72de132298d3c0085640eb959de490347046c1\n\nTortoiseshell SHA256: Downloader\n9b980581131b070c7b790ca536ac606da913990d888352c99f480f1c0597c3a8\n\nTortoiseshell SHA256: Downloader\nb1223d63a8aea619e006c76a6a8d8ac16808fa65a90b98cfd2bebf470bf6c58e\n\nBroadcom SED-IAP-WP100\n1\n\n|Table 6: Indicators of|Compromise (IOCs) (Continued)|Col3|\n|---|---|---|\n|Group|IOC|Description|\n|Tortoiseshell|SHA256: 02a3296238a3d127a2e517f4949d31914c15d96726fb4902322c065153b364b2|Custom Backdoor|\n|Tortoiseshell|SHA256: 07d123364d8d04e3fe0bfa4e0e23ddc7050ef039602ecd72baed70e6553c3ae4|Custom Backdoor|\n|Tortoiseshell|SHA256: 07e791d18ea8f2f7ede2962522626b43f28cb242873a7bd55fff4feb91299741|Poisonfrog|\n|Tortoiseshell|SHA256: 08cb4383288d2e5829b0fc186df36deb6b8078137b6b3a338a0597a665204852|Alias:Infostealer|\n|Tortoiseshell|SHA256: 0e5d06e08a1a665b1112043e99718392fe1aeb700793fd49be7f60d7f3b63e4d|Custom Backdoor|\n|Tortoiseshell|SHA256: 18e5753be209eafb6292f712d481cf264273d5e592cca81fc2a990440f49a545|Alias: TCPStager|\n|Tortoiseshell|SHA256: 1c79900c35fcb0e717ccb6939e4a5801ad7c3b7c806a74e48ce9c8a77c135bb5|CVE-2018-8440|\n|Tortoiseshell|SHA256: 225e06c4ad0d00387f814de69be3e5dfa655d96e34b94fb0777b6aa045f127d1|Custom Backdoor|\n|Tortoiseshell|SHA256: 248cbfa25130e37916d4593fc192a2dc666bc67755cdebdc0f1cdf91bd4a518b|Alias:ListNetstat|\n|Tortoiseshell|SHA256: 34588fb9b32d09d83de2f911beed013c87074ad572c97bc0197d30e9777a4154|Custom Backdoor|\n|Tortoiseshell|SHA256: 3a7b95c93f2e525f7dfa1816652d8cebb682fc9daa26c66e193f0c5190d0ed17|Poisonfrog|\n|Tortoiseshell|SHA256: 444c4e9b4e0217c7b5a00aab3348913a2ea8aad005cdcd6fc033ef34642d5bf8|Powershell|\n|Tortoiseshell|SHA256: 4e0ca724fd8a18a94d9dbc990aa506981db700c76e5611a02e189a430d5f4764|Downloader|\n|Tortoiseshell|5 SHA256: 26799f0791ad26cbd781d89bf4363e6827b3b5f59746405a847dec45f040796|Alias:ListNetstat|\n|Tortoiseshell|SHA256: 55adf532a7b7fb2b291b88b072fda5c0d642bf9bd4af316ae8c40c70feb391a4|Alias:Infostealer|\n|Tortoiseshell|SHA256: 5dbd3018d2e6c2b207506d511aa18cbde292c4bf2a127073150cd276fc6e925e|Alias:ListNetstat|\n|Tortoiseshell|SHA256: 694e7361f2698e6995bab4b3d1cda4e98f8d83d1ba8c39367be6158bc17ad30e|Custom Backdoor|\n|Tortoiseshell|SHA256: 707cbcf75a08445479388ade04229c7e08f48cf2f9efc47fc27de564406c56e2|Custom Backdoor|\n|Tortoiseshell|SHA256: 77a85a06a9c00cc58f4b701ef574389b13b6edd04b93fbabcf0a4de03b68ab76|Alias:Screenshot|\n|Tortoiseshell|SHA256: 869ae66ec2d7e46cbfb2c3d15b34b77a12a372ed0c5e92587afcce892c1f6b17|CVE-2018-8440|\n|Tortoiseshell|SHA256: 882d51c2f258fc4bc189837b6de12760a51764bc0f621a692173273ff59af117|Custom Backdoor|\n|Tortoiseshell|SHA256: 8f149e7e454053505dcc3252dd72de132298d3c0085640eb959de490347046c1|Custom Backdoor|\n|Tortoiseshell|SHA256: 9b980581131b070c7b790ca536ac606da913990d888352c99f480f1c0597c3a8|Downloader|\n|Tortoiseshell|SHA256: b1223d63a8aea619e006c76a6a8d8ac16808fa65a90b98cfd2bebf470bf6c58e|Downloader|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 6: Indicators of Compromise (IOCs) (Continued)**\n\n**Group** **IOC** **Description**\n\nTortoiseshell SHA256: Custom Backdoor\nbc06dd43d1f3eda6beae85ce31e5798b0888a60c6426b33df5a40e6287b06848\n\nTortoiseshell SHA256: Custom Backdoor\nda060f48b3c681639d8ec285846285ed8fda300fa9ee69a69d4fa8c0420c8070\n\nTortoiseshell SHA256: Custom Backdoor\nea875796304235077556bfbf23274d25819a42a7ba4ebeabb445274568ab43ac\n\nTortoiseshell SHA256: Custom Backdoor\nf71732f997c53fa45eef5c988697eb4aa62c8655d8f0be3268636fc23addd193\n\nChafer SHA256: Exemyr\n1e94a1ca83123688215b64369a37162448a0f3927e3f0f4f412ee352db6abf5c\n\nChafer SHA256: Trojan\nfc74c58705f4d2f6241118b729d86e4610045418690d833de6b123d08d1f8a37\n\nChafer SHA256: Alias: Dntxdoor\nd4dcbfbab036132eb6c40c56a44c0d3b4b681b19841b81fc4f8e1d62ea5b211d\n\nChafer SHA256: Remexi\ncaa841e4809efdfb3be1de588d74ccf32a96a8c1bc4108d07ade509551ce77e4\n\nChafer SHA256: Remexi\n3ebc9890fa04b1035565d7d273f80032e811ac5e42d3aa1dafe6e33b6572f8cb\n\nChafer SHA256: Mini_rsocks\n2802ad7e910e4ef647b93f11b3f4a5ec465a0abf16c542884442c70555ca8352\n\nCrambus SHA256: Alias: Hisoka\n3996efe9a3cf471a1f816287368fa0f99d2cdb95786530b0b61c7b9024ff717b\n\nCrambus SHA256: Alias: Sakabota\ndb1f460f624a4c13c3004899c5d0a4c3668ba99bb1e6be7f594e965c637b6917\n\nCrambus SHA256: Alias: Yakenzi\n4c68068c16e320e2dd346adfa64686a3bcd5aef98fdc0f69d5f0e82d254eacf4\n\nBroadcom SED-IAP-WP100\n18\n\n|Table 6: Indicators of|Compromise (IOCs) (Continued)|Col3|\n|---|---|---|\n|Group|IOC|Description|\n|Tortoiseshell|SHA256: bc06dd43d1f3eda6beae85ce31e5798b0888a60c6426b33df5a40e6287b06848|Custom Backdoor|\n|Tortoiseshell|SHA256: da060f48b3c681639d8ec285846285ed8fda300fa9ee69a69d4fa8c0420c8070|Custom Backdoor|\n|Tortoiseshell|SHA256: ea875796304235077556bfbf23274d25819a42a7ba4ebeabb445274568ab43ac|Custom Backdoor|\n|Tortoiseshell|SHA256: f71732f997c53fa45eef5c988697eb4aa62c8655d8f0be3268636fc23addd193|Custom Backdoor|\n|Chafer|SHA256: 1e94a1ca83123688215b64369a37162448a0f3927e3f0f4f412ee352db6abf5c|Exemyr|\n|Chafer|SHA256: fc74c58705f4d2f6241118b729d86e4610045418690d833de6b123d08d1f8a37|Trojan|\n|Chafer|SHA256: d4dcbfbab036132eb6c40c56a44c0d3b4b681b19841b81fc4f8e1d62ea5b211d|Alias: Dntxdoor|\n|Chafer|SHA256: caa841e4809efdfb3be1de588d74ccf32a96a8c1bc4108d07ade509551ce77e4|Remexi|\n|Chafer|SHA256: 3ebc9890fa04b1035565d7d273f80032e811ac5e42d3aa1dafe6e33b6572f8cb|Remexi|\n|Chafer|SHA256: 2802ad7e910e4ef647b93f11b3f4a5ec465a0abf16c542884442c70555ca8352|Mini_rsocks|\n|Crambus|SHA256: 3996efe9a3cf471a1f816287368fa0f99d2cdb95786530b0b61c7b9024ff717b|Alias: Hisoka|\n|Crambus|SHA256: db1f460f624a4c13c3004899c5d0a4c3668ba99bb1e6be7f594e965c637b6917|Alias: Sakabota|\n|Crambus|SHA256: 4c68068c16e320e2dd346adfa64686a3bcd5aef98fdc0f69d5f0e82d254eacf4|Alias: Yakenzi|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Appendix B: Mitre Attack Techniques\n\n**Table 7: Mitre Attack Techniques**\n\n**Group** **Technique ID** **Technique Name** **Technique Use**\n\nElfin T1110 Brute Force [Elfin has used password spraying to gain access to target systems.](https://attack.mitre.org/groups/G0064)\n\nElfin T1043 Commonly Used Port [Elfin has used port 443 for command and control.](https://attack.mitre.org/groups/G0064)\n\nElfin T1003 Credential Dumping [Elfin has used a variety of publicly available tools like LaZagne,](https://attack.mitre.org/groups/G0064)\nMimikatz, Gpppassword, SniffPass, and ProcDump to dump\ncredentials.\n\nElfin T1002 Data Compressed [Elfin has used WinRAR to compress data prior to exfiltration.](https://attack.mitre.org/groups/G0064)\n\nElfin T1132 Data Encoding [Elfin has used base64 to encode command and control traffic.](https://attack.mitre.org/groups/G0064)\n\nElfin T1480 Execution Guardrails [Elfin has used kill dates in their malware to guardrail execution.](https://attack.mitre.org/groups/G0064)\n\nElfin T1048 Exfiltration Over Alternative [Elfin has used FTP to exfiltrate files (separately from the C2 channel).](https://attack.mitre.org/groups/G0064)\nProtocol\n\nElfin T1203 Exploitation for Client Execution [Elfin has attempted to exploit a known vulnerability in WinRAR (CVE-](https://attack.mitre.org/groups/G0064)\n2018-20250).\n\nElfin T1068 Exploitation for Privilege [Elfin has used a publicly available exploit for CVE-2017-0213 to](https://attack.mitre.org/groups/G0064)\nEscalation escalate privileges on a local system.\n\nElfin T1040 Network Sniffing [Elfin has used SniffPass to collect credentials by sniffing network](https://attack.mitre.org/groups/G0064)\ntraffic.\n\nElfin T1027 Obfuscated Files or Information [Elfin has used base64 to encode payloads.](https://attack.mitre.org/groups/G0064)\n\nElfin T1086 PowerShell [Elfin has utilized PowerShell to download files from the C2 server and](https://attack.mitre.org/groups/G0064)\nrun various scripts.\n\nElfin T1060 [Registry Run Keys/Startup Folder Elfin has deployed a tool known as DarkComet to the Startup folder of](https://attack.mitre.org/groups/G0064)\na victim.\n\nElfin T1105 Remote File Copy [Elfin has downloaded additional files and programs from its C2 server.](https://attack.mitre.org/groups/G0064)\n\nElfin T1053 Scheduled Task [Elfin has created a scheduled task to execute a .vbe file multiple times](https://attack.mitre.org/groups/G0064)\na day.\n\nElfin T1192 Spear Phishing Link [Elfin has sent spear phishing emails containing links to .hta files.](https://attack.mitre.org/groups/G0064)\n\nElfin T1071 Standard Application Layer [Elfin has used HTTP for command and control.](https://attack.mitre.org/groups/G0064)\nProtocol\n\nElfin T1032 [Standard Cryptographic Protocol Elfin has used AES for encryption of command and control traffic.](https://attack.mitre.org/groups/G0064)\n\nElfin T1065 Uncommonly Used Port [Elfin has used ports 808 and 880 for command and control.](https://attack.mitre.org/groups/G0064)\n\nElfin T1204 User Execution [Elfin has lured users to click links to malicious HTML applications](https://attack.mitre.org/groups/G0064)\ndelivered via spear phishing emails.[1][3]\n\nElfin T1078 Valid Accounts [Elfin has used valid accounts for initial access and privilege escalation.](https://attack.mitre.org/groups/G0064)\n\nSeedworm T1088 Bypass User Account Control [Seedworm uses various techniques to bypass UAC.](https://attack.mitre.org/groups/G0069)\n\nSeedworm T1191 CMSTP [Seedworm has used CMSTP.exe and a malicious INF to execute its](https://attack.mitre.org/groups/G0069)\nPOWERSTATS payload.\n\nSeedworm T1059 Command-Line Interface [Seedworm has used a custom tool for creating reverse shells.](https://attack.mitre.org/groups/G0069)\n\nSeedworm T1500 Compile After Delivery [Seedworm has used the .NET csc.exe tool to compile executables](https://attack.mitre.org/groups/G0069)\nfrom downloaded C# code.\n\nSeedworm T1175 Component Object Model and [Seedworm has used malware that has the capability to execute](https://attack.mitre.org/groups/G0069)\nDistributed COM malware via COM and Outlook.\n\nSeedworm T1090 Connection Proxy [Seedworm has controlled POWERSTATS from behind a proxy network](https://attack.mitre.org/groups/G0069)\nto obfuscate the C2 location.\n\nBroadcom SED-IAP-WP100\n19\n\n|Group|Technique ID|Technique Name|Technique Use|\n|---|---|---|---|\n|Elfin|T1110|Brute Force|Elfin has used password spraying to gain access to target systems.|\n|Elfin|T1043|Commonly Used Port|Elfin has used port 443 for command and control.|\n|Elfin|T1003|Credential Dumping|Elfin has used a variety of publicly available tools like LaZagne, Mimikatz, Gpppassword, SniffPass, and ProcDump to dump credentials.|\n|Elfin|T1002|Data Compressed|Elfin has used WinRAR to compress data prior to exfiltration.|\n|Elfin|T1132|Data Encoding|Elfin has used base64 to encode command and control traffic.|\n|Elfin|T1480|Execution Guardrails|Elfin has used kill dates in their malware to guardrail execution.|\n|Elfin|T1048|Exfiltration Over Alternative Protocol|Elfin has used FTP to exfiltrate files (separately from the C2 channel).|\n|Elfin|T1203|Exploitation for Client Execution|Elfin has attempted to exploit a known vulnerability in WinRAR (CVE- 2018-20250).|\n|Elfin|T1068|Exploitation for Privilege Escalation|Elfin has used a publicly available exploit for CVE-2017-0213 to escalate privileges on a local system.|\n|Elfin|T1040|Network Sniffing|Elfin has used SniffPass to collect credentials by sniffing network traffic.|\n|Elfin|T1027|Obfuscated Files or Information|Elfin has used base64 to encode payloads.|\n|Elfin|T1086|PowerShell|Elfin has utilized PowerShell to download files from the C2 server and run various scripts.|\n|Elfin|T1060|Registry Run Keys/Startup Folder|Elfin has deployed a tool known as DarkComet to the Startup folder of a victim.|\n|Elfin|T1105|Remote File Copy|Elfin has downloaded additional files and programs from its C2 server.|\n|Elfin|T1053|Scheduled Task|Elfin has created a scheduled task to execute a .vbe file multiple times a day.|\n|Elfin|T1192|Spear Phishing Link|Elfin has sent spear phishing emails containing links to .hta files.|\n|Elfin|T1071|Standard Application Layer Protocol|Elfin has used HTTP for command and control.|\n|Elfin|T1032|Standard Cryptographic Protocol|Elfin has used AES for encryption of command and control traffic.|\n|Elfin|T1065|Uncommonly Used Port|Elfin has used ports 808 and 880 for command and control.|\n|Elfin|T1204|User Execution|Elfin has lured users to click links to malicious HTML applications delivered via spear phishing emails.[1][3]|\n|Elfin|T1078|Valid Accounts|Elfin has used valid accounts for initial access and privilege escalation.|\n|Seedworm|T1088|Bypass User Account Control|Seedworm uses various techniques to bypass UAC.|\n|Seedworm|T1191|CMSTP|Seedworm has used CMSTP.exe and a malicious INF to execute its POWERSTATS payload.|\n|Seedworm|T1059|Command-Line Interface|Seedworm has used a custom tool for creating reverse shells.|\n|Seedworm|T1500|Compile After Delivery|Seedworm has used the .NET csc.exe tool to compile executables from downloaded C# code.|\n|Seedworm|T1175|Component Object Model and Distributed COM|Seedworm has used malware that has the capability to execute malware via COM and Outlook.|\n|Seedworm|T1090|Connection Proxy|Seedworm has controlled POWERSTATS from behind a proxy network to obfuscate the C2 location.|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 7: Mitre Attack Techniques (Continued)**\n\n**Group** **Technique ID** **Technique Name** **Technique Use**\n\nSeedworm T1003 Credential Dumping [Seedworm has performed credential dumping with Mimikatz,](https://attack.mitre.org/groups/G0069)\nLaZagne, and other tools, including by dumping passwords saved in\nvictim web browsers and email.\n\nSeedworm T1503 Credentials from Web Browsers [Seedworm has run a tool that steals passwords saved in victim web](https://attack.mitre.org/groups/G0069)\nbrowsers.\n\nSeedworm T1081 Credentials in Files [Seedworm has run a tool that steals passwords saved in victim email.](https://attack.mitre.org/groups/G0069)\n\nSeedworm T1002 Data Compressed [Seedworm has used the native Windows cabinet creation tool,](https://attack.mitre.org/groups/G0069)\nmakecab.exe, likely to compress stolen data to be uploaded.\n\nSeedworm T1140 Deobfuscate/Decode Files or [Seedworm decoded base64-encoded PowerShell commands using a](https://attack.mitre.org/groups/G0069)\nInformation VBS file.\n\nSeedworm T1173 Dynamic Data Exchange [Seedworm has used malware that can execute PowerShell scripts via](https://attack.mitre.org/groups/G0069)\nDDE.\n\nSeedworm T1083 File and Directory Discovery [Seedworm has used malware that checked if the ProgramData folder](https://attack.mitre.org/groups/G0069)\nhad folders or files with the keywords \"Kasper,\" \"Panda,\" or \"ESET.\"\n\nSeedworm T1036 Masquerading [Seedworm has used filenames and Registry key names associated](https://attack.mitre.org/groups/G0069)\nwith Windows Defender. The group has also stored obfuscated\nJavaScript code in an image file named temp.jpg.\n\nSeedworm T1170 Mshta [Seedworm has used mshta.exe to execute its POWERSTATS payload](https://attack.mitre.org/groups/G0069)\nand to pass a PowerShell one-liner for execution.\n\nSeedworm T1104 Multi-Stage Channels [Seedworm has used one C2 to obtain enumeration scripts and monitor](https://attack.mitre.org/groups/G0069)\nweb logs, but a different C2 to send data back.\n\nSeedworm T1027 Obfuscated Files or Information [Seedworm has used Daniel Bohannon's Invoke-Obfuscation](https://attack.mitre.org/groups/G0069)\nframework. The group has also used other obfuscation methods,\nincluding Base64 obfuscation of VBScripts and PowerShell\ncommands.\n\nSeedworm T1086 PowerShell [Seedworm has used PowerShell for execution.](https://attack.mitre.org/groups/G0069)\n\nSeedworm T1057 Process Discovery [Seedworm has used malware to obtain a list of running processes on](https://attack.mitre.org/groups/G0069)\nthe system.\n\nSeedworm T1060 [Registry Run Keys/Startup Folder Seedworm has added Registry Run key](https://attack.mitre.org/groups/G0069)\nKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\SystemTextEn\ncoding to establish persistence.\n\nSeedworm T1105 Remote File Copy [Seedworm has used malware that can upload additional files to the](https://attack.mitre.org/groups/G0069)\nvictim's machine.\n\nSeedworm T1085 Rundll32 [Seedworm has used malware that leveraged rundll32.exe in a Registry](https://attack.mitre.org/groups/G0069)\nRun key to execute a .dll.\n\nSeedworm T1113 Screen Capture [Seedworm has used malware that can capture screenshots of the](https://attack.mitre.org/groups/G0069)\nvictim's machine.\n\nSeedworm T1064 Scripting [Seedworm has used VBScript and JavaScript files to execute its](https://attack.mitre.org/groups/G0069)\nPOWERSTATS payload. Seedworm has also used Microsoft scriptlets,\nmacros, and PowerShell scripts.\n\nSeedworm T1063 Security Software Discovery [Seedworm has used malware to check running processes against a](https://attack.mitre.org/groups/G0069)\nhard-coded list of security tools often used by malware researchers.\n\nSeedworm T1193 Spear Phishing Attachment [Seedworm has compromised third parties and used compromised](https://attack.mitre.org/groups/G0069)\naccounts to send spear phishing emails with targeted attachments to\nrecipients.\n\nSeedworm T1082 System Information Discovery [Seedworm has used malware that can collect the victim's OS version](https://attack.mitre.org/groups/G0069)\nand machine name.\n\nSeedworm T1016 System Network Configuration [Seedworm has used malware to collect the victim's IP address and](https://attack.mitre.org/groups/G0069)\nDiscovery domain name.\n\nBroadcom SED-IAP-WP100\n20\n\n|Group|Technique ID|Technique Name|Technique Use|\n|---|---|---|---|\n|Seedworm|T1003|Credential Dumping|Seedworm has performed credential dumping with Mimikatz, LaZagne, and other tools, including by dumping passwords saved in victim web browsers and email.|\n|Seedworm|T1503|Credentials from Web Browsers|Seedworm has run a tool that steals passwords saved in victim web browsers.|\n|Seedworm|T1081|Credentials in Files|Seedworm has run a tool that steals passwords saved in victim email.|\n|Seedworm|T1002|Data Compressed|Seedworm has used the native Windows cabinet creation tool, makecab.exe, likely to compress stolen data to be uploaded.|\n|Seedworm|T1140|Deobfuscate/Decode Files or Information|Seedworm decoded base64-encoded PowerShell commands using a VBS file.|\n|Seedworm|T1173|Dynamic Data Exchange|Seedworm has used malware that can execute PowerShell scripts via DDE.|\n|Seedworm|T1083|File and Directory Discovery|Seedworm has used malware that checked if the ProgramData folder had folders or files with the keywords \"Kasper,\" \"Panda,\" or \"ESET.\"|\n|Seedworm|T1036|Masquerading|Seedworm has used filenames and Registry key names associated with Windows Defender. The group has also stored obfuscated JavaScript code in an image file named temp.jpg.|\n|Seedworm|T1170|Mshta|Seedworm has used mshta.exe to execute its POWERSTATS payload and to pass a PowerShell one-liner for execution.|\n|Seedworm|T1104|Multi-Stage Channels|Seedworm has used one C2 to obtain enumeration scripts and monitor web logs, but a different C2 to send data back.|\n|Seedworm|T1027|Obfuscated Files or Information|Seedworm has used Daniel Bohannon's Invoke-Obfuscation framework. The group has also used other obfuscation methods, including Base64 obfuscation of VBScripts and PowerShell commands.|\n|Seedworm|T1086|PowerShell|Seedworm has used PowerShell for execution.|\n|Seedworm|T1057|Process Discovery|Seedworm has used malware to obtain a list of running processes on the system.|\n|Seedworm|T1060|Registry Run Keys/Startup Folder|Seedworm has added Registry Run key KCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\SystemTextEn coding to establish persistence.|\n|Seedworm|T1105|Remote File Copy|Seedworm has used malware that can upload additional files to the victim's machine.|\n|Seedworm|T1085|Rundll32|Seedworm has used malware that leveraged rundll32.exe in a Registry Run key to execute a .dll.|\n|Seedworm|T1113|Screen Capture|Seedworm has used malware that can capture screenshots of the victim's machine.|\n|Seedworm|T1064|Scripting|Seedworm has used VBScript and JavaScript files to execute its POWERSTATS payload. Seedworm has also used Microsoft scriptlets, macros, and PowerShell scripts.|\n|Seedworm|T1063|Security Software Discovery|Seedworm has used malware to check running processes against a hard-coded list of security tools often used by malware researchers.|\n|Seedworm|T1193|Spear Phishing Attachment|Seedworm has compromised third parties and used compromised accounts to send spear phishing emails with targeted attachments to recipients.|\n|Seedworm|T1082|System Information Discovery|Seedworm has used malware that can collect the victim's OS version and machine name.|\n|Seedworm|T1016|System Network Configuration Discovery|Seedworm has used malware to collect the victim's IP address and domain name.|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 7: Mitre Attack Techniques (Continued)**\n\n**Group** **Technique ID** **Technique Name** **Technique Use**\n\nSeedworm T1033 System Owner/User Discovery [Seedworm has used malware that can collect the victim's username.](https://attack.mitre.org/groups/G0069)\n\nSeedworm T1204 User Execution [Seedworm has attempted to get users to enable macros and launch](https://attack.mitre.org/groups/G0069)\nmalicious Microsoft Word documents delivered via spear phishing\nemails.\n\nSeedworm T1047 Windows Management [Seedworm has used malware that leveraged WMI for execution and](https://attack.mitre.org/groups/G0069)\nInstrumentation querying host information.\n\nChafer T1090 Connection Proxy [Chafer used custom tools to create SOCK5 proxies between infected](https://attack.mitre.org/groups/G0087)\nhosts.\n\nChafer T1003 Credential Dumping [Chafer has used Mimikatz, Ncrack, Windows Credential Editor and](https://attack.mitre.org/groups/G0087)\nProcDump to dump credentials.\n\nChafer T1002 Data Compressed [Chafer has used WinRAR and 7-Zip to compress and archive stolen](https://attack.mitre.org/groups/G0087)\ndata.\n\nChafer T1046 Network Service Scanning [Chafer used a custom port scanner known as BLUETORCH](https://attack.mitre.org/groups/G0087)\n\nChafer T1060 [Registry Run Keys/Startup Folder Chafer has maintained persistence using the startup folder.](https://attack.mitre.org/groups/G0087)\n\nChafer T1076 Remote Desktop Protocol [Chafer has been seen using RDP for lateral movement and](https://attack.mitre.org/groups/G0087)\npersistence.\n\nChafer T1021 Remote Services [Chafer used secure shell (SSH) to move laterally among their targets.](https://attack.mitre.org/groups/G0087)\n\nChafer T1053 Scheduled Task [Chafer has created scheduled tasks.](https://attack.mitre.org/groups/G0087)\n\nChafer T1064 Scripting [Chafer utilized custom scripts to perform internal reconnaissance.](https://attack.mitre.org/groups/G0087)\n\nChafer T1023 Shortcut Modification [Chafer has modified LNK shortcuts.](https://attack.mitre.org/groups/G0087)\n\nChafer T1045 Software Packing [Chafer has repacked a modified version of Mimikatz to thwart anti-virus](https://attack.mitre.org/groups/G0087)\ndetection.\n\nChafer T1193 Spear Phishing Attachment [Chafer leveraged spear phishing emails with malicious attachments to](https://attack.mitre.org/groups/G0087)\ninitially compromise victims.\n\nChafer T1192 Spear Phishing Link [Chafer leveraged spear phishing emails with malicious links to initially](https://attack.mitre.org/groups/G0087)\ncompromise victims.\n\nChafer T1016 System Network Configuration [Chafer has used NBTScan to discover vulnerable systems.](https://attack.mitre.org/groups/G0087)\nDiscovery\n\nChafer T1033 System Owner/User Discovery [Chafer used Remexi to collect usernames from the system.](https://attack.mitre.org/groups/G0087)\n\nChafer T1204 User Execution [Chafer has sent spear phishing emails in an attempt to lure users to](https://attack.mitre.org/groups/G0087)\nclick on a malicious attachment or link.\n\nChafer T1078 Valid Accounts [Chafer has used stolen credentials to compromise Outlook Web](https://attack.mitre.org/groups/G0087)\nAccess (OWA).\n\nChafer T1100 Web Shell [Chafer has installed ANTAK and ASPXSPY web shells.](https://attack.mitre.org/groups/G0087)\n\nCrambus T1087 Account Discovery [Crambus has run net user, net user /domain, net group \"domain](https://attack.mitre.org/groups/G0049)\nadmins\" /domain, and net group \"Exchange Trusted Subsystem\" /\ndomain to get account listings on a victim.\n\nCrambus T1119 Automated Collection [Crambus has used automated collection.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1110 Brute Force [Crambus has used brute force techniques to obtain credentials.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1059 Command-Line Interface [Crambus has used the command-line interface for execution.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1043 Commonly Used Port [Crambus has used port 80 to call back to the C2 server.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1223 Compiled HTML File [Crambus has used a CHM payload to load and execute another](https://attack.mitre.org/groups/G0049)\nmalicious file once delivered to a victim.\n\nCrambus T1003 Credential Dumping [Crambus has used credential dumping tools such as Mimikatz and](https://attack.mitre.org/groups/G0049)\nLaZagne to steal credentials to accounts logged into the compromised\nsystem and to Outlook Web Access.\n\nBroadcom SED-IAP-WP100\n21\n\n|Group|Technique ID|Technique Name|Technique Use|\n|---|---|---|---|\n|Seedworm|T1033|System Owner/User Discovery|Seedworm has used malware that can collect the victim's username.|\n|Seedworm|T1204|User Execution|Seedworm has attempted to get users to enable macros and launch malicious Microsoft Word documents delivered via spear phishing emails.|\n|Seedworm|T1047|Windows Management Instrumentation|Seedworm has used malware that leveraged WMI for execution and querying host information.|\n|Chafer|T1090|Connection Proxy|Chafer used custom tools to create SOCK5 proxies between infected hosts.|\n|Chafer|T1003|Credential Dumping|Chafer has used Mimikatz, Ncrack, Windows Credential Editor and ProcDump to dump credentials.|\n|Chafer|T1002|Data Compressed|Chafer has used WinRAR and 7-Zip to compress and archive stolen data.|\n|Chafer|T1046|Network Service Scanning|Chafer used a custom port scanner known as BLUETORCH|\n|Chafer|T1060|Registry Run Keys/Startup Folder|Chafer has maintained persistence using the startup folder.|\n|Chafer|T1076|Remote Desktop Protocol|Chafer has been seen using RDP for lateral movement and persistence.|\n|Chafer|T1021|Remote Services|Chafer used secure shell (SSH) to move laterally among their targets.|\n|Chafer|T1053|Scheduled Task|Chafer has created scheduled tasks.|\n|Chafer|T1064|Scripting|Chafer utilized custom scripts to perform internal reconnaissance.|\n|Chafer|T1023|Shortcut Modification|Chafer has modified LNK shortcuts.|\n|Chafer|T1045|Software Packing|Chafer has repacked a modified version of Mimikatz to thwart anti-virus detection.|\n|Chafer|T1193|Spear Phishing Attachment|Chafer leveraged spear phishing emails with malicious attachments to initially compromise victims.|\n|Chafer|T1192|Spear Phishing Link|Chafer leveraged spear phishing emails with malicious links to initially compromise victims.|\n|Chafer|T1016|System Network Configuration Discovery|Chafer has used NBTScan to discover vulnerable systems.|\n|Chafer|T1033|System Owner/User Discovery|Chafer used Remexi to collect usernames from the system.|\n|Chafer|T1204|User Execution|Chafer has sent spear phishing emails in an attempt to lure users to click on a malicious attachment or link.|\n|Chafer|T1078|Valid Accounts|Chafer has used stolen credentials to compromise Outlook Web Access (OWA).|\n|Chafer|T1100|Web Shell|Chafer has installed ANTAK and ASPXSPY web shells.|\n|Crambus|T1087|Account Discovery|Crambus has run net user, net user /domain, net group \"domain admins\" /domain, and net group \"Exchange Trusted Subsystem\" / domain to get account listings on a victim.|\n|Crambus|T1119|Automated Collection|Crambus has used automated collection.|\n|Crambus|T1110|Brute Force|Crambus has used brute force techniques to obtain credentials.|\n|Crambus|T1059|Command-Line Interface|Crambus has used the command-line interface for execution.|\n|Crambus|T1043|Commonly Used Port|Crambus has used port 80 to call back to the C2 server.|\n|Crambus|T1223|Compiled HTML File|Crambus has used a CHM payload to load and execute another malicious file once delivered to a victim.|\n|Crambus|T1003|Credential Dumping|Crambus has used credential dumping tools such as Mimikatz and LaZagne to steal credentials to accounts logged into the compromised system and to Outlook Web Access.|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 7: Mitre Attack Techniques (Continued)**\n\n**Group** **Technique ID** **Technique Name** **Technique Use**\n\nCrambus T1081 Credentials in Files [Crambus has used tools named VALUEVAULT and PICKPOCKET to](https://attack.mitre.org/groups/G0049)\ndump passwords from web browsers.\n\nCrambus T1094 Custom Command and Control [Crambus has used custom DNS Tunneling protocols for C2.](https://attack.mitre.org/groups/G0049)\nProtocol\n\nCrambus T1140 Deobfuscate/Decode Files or [A Crambus macro has run a PowerShell command to decode file](https://attack.mitre.org/groups/G0049)\nInformation contents. Crambus has also used certutil to decode base64-encoded\nfiles on victims.\n\nCrambus T1048 Exfiltration Over Alternative [Crambus has exfiltrated data over FTP separately from its primary C2](https://attack.mitre.org/groups/G0049)\nProtocol channel over DNS.\n\nCrambus T1133 External Remote Services [Crambus uses remote services such as VPN, Citrix, or OWA to persist](https://attack.mitre.org/groups/G0049)\nin an environment.\n\nCrambus T1008 Fallback Channels [Crambus malware ISMAgent falls back to its DNS tunneling](https://attack.mitre.org/groups/G0049)\nmechanism if it is unable to reach the C2 server over HTTP.\n\nCrambus T1107 File Deletion [Crambus has deleted files associated with their payload after](https://attack.mitre.org/groups/G0049)\nexecution.\n\nCrambus T1066 Indicator Removal from Tools [Crambus has tested malware samples to determine AV detection and](https://attack.mitre.org/groups/G0049)\nsubsequently modified the samples to ensure AV evasion.\n\nCrambus T1056 Input Capture [Crambus has used keylogging tools called KEYPUNCH and](https://attack.mitre.org/groups/G0049)\nLONGWATCH.\n\nCrambus T1046 Network Service Scanning [Crambus has used the publicly available tool SoftPerfect Network](https://attack.mitre.org/groups/G0049)\nScanner as well as a custom tool called GOLDIRONY to conduct\nnetwork scanning.\n\nCrambus T1027 Obfuscated Files or Information [Crambus has encrypted and encoded data in its malware, including by](https://attack.mitre.org/groups/G0049)\nusing base64.\n\nCrambus T1201 Password Policy Discovery [Crambus has used net.exe in a script with net accounts /domain to find](https://attack.mitre.org/groups/G0049)\nthe password policy of a domain.\n\nCrambus T1069 Permission Groups Discovery [Crambus has used net group /domain, net localgroup administrators,](https://attack.mitre.org/groups/G0049)\nnet group \"domain admins\" /domain, and net group \"Exchange Trusted\nSubsystem\" /domain to find group permission settings on a victim.\n\nCrambus T1086 PowerShell [Crambus has used PowerShell scripts for execution, including use of](https://attack.mitre.org/groups/G0049)\na macro to run a PowerShell command to decode file contents.\n\nCrambus T1057 Process Discovery [Crambus has run tasklist on a victim's machine.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1012 Query Registry [Crambus has used reg query](https://attack.mitre.org/groups/G0049)\n\"HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server\nClient\\Default\" on a victim to query the Registry.\n\nCrambus T1108 Redundant Access [Crambus has used RGDoor via Web shell to establish redundant](https://attack.mitre.org/groups/G0049)\naccess. The group has also used harvested credentials to gain access\nto Internet-accessible resources such as Outlook Web Access, which\ncould be used for redundant access.\n\nCrambus T1076 Remote Desktop Protocol [Crambus has used Remote Desktop Protocol for lateral movement.](https://attack.mitre.org/groups/G0049)\nThe group has also used tunneling tools to tunnel RDP into the\nenvironment.\n\nCrambus T1105 Remote File Copy [Crambus can download remote files onto victims.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1021 Remote Services [Crambus has used Putty to access compromised systems.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1053 Scheduled Task [Crambus has created scheduled tasks that run a VBScript to execute](https://attack.mitre.org/groups/G0049)\na payload on victim machines.\n\nCrambus T1113 Screen Capture [Crambus has a tool called CANDYKING to capture a screenshot of](https://attack.mitre.org/groups/G0049)\nuser's desktop.\n\nBroadcom SED-IAP-WP100\n22\n\n|Group|Technique ID|Technique Name|Technique Use|\n|---|---|---|---|\n|Crambus|T1081|Credentials in Files|Crambus has used tools named VALUEVAULT and PICKPOCKET to dump passwords from web browsers.|\n|Crambus|T1094|Custom Command and Control Protocol|Crambus has used custom DNS Tunneling protocols for C2.|\n|Crambus|T1140|Deobfuscate/Decode Files or Information|A Crambus macro has run a PowerShell command to decode file contents. Crambus has also used certutil to decode base64-encoded files on victims.|\n|Crambus|T1048|Exfiltration Over Alternative Protocol|Crambus has exfiltrated data over FTP separately from its primary C2 channel over DNS.|\n|Crambus|T1133|External Remote Services|Crambus uses remote services such as VPN, Citrix, or OWA to persist in an environment.|\n|Crambus|T1008|Fallback Channels|Crambus malware ISMAgent falls back to its DNS tunneling mechanism if it is unable to reach the C2 server over HTTP.|\n|Crambus|T1107|File Deletion|Crambus has deleted files associated with their payload after execution.|\n|Crambus|T1066|Indicator Removal from Tools|Crambus has tested malware samples to determine AV detection and subsequently modified the samples to ensure AV evasion.|\n|Crambus|T1056|Input Capture|Crambus has used keylogging tools called KEYPUNCH and LONGWATCH.|\n|Crambus|T1046|Network Service Scanning|Crambus has used the publicly available tool SoftPerfect Network Scanner as well as a custom tool called GOLDIRONY to conduct network scanning.|\n|Crambus|T1027|Obfuscated Files or Information|Crambus has encrypted and encoded data in its malware, including by using base64.|\n|Crambus|T1201|Password Policy Discovery|Crambus has used net.exe in a script with net accounts /domain to find the password policy of a domain.|\n|Crambus|T1069|Permission Groups Discovery|Crambus has used net group /domain, net localgroup administrators, net group \"domain admins\" /domain, and net group \"Exchange Trusted Subsystem\" /domain to find group permission settings on a victim.|\n|Crambus|T1086|PowerShell|Crambus has used PowerShell scripts for execution, including use of a macro to run a PowerShell command to decode file contents.|\n|Crambus|T1057|Process Discovery|Crambus has run tasklist on a victim's machine.|\n|Crambus|T1012|Query Registry|Crambus has used reg query \"HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Default\" on a victim to query the Registry.|\n|Crambus|T1108|Redundant Access|Crambus has used RGDoor via Web shell to establish redundant access. The group has also used harvested credentials to gain access to Internet-accessible resources such as Outlook Web Access, which could be used for redundant access.|\n|Crambus|T1076|Remote Desktop Protocol|Crambus has used Remote Desktop Protocol for lateral movement. The group has also used tunneling tools to tunnel RDP into the environment.|\n|Crambus|T1105|Remote File Copy|Crambus can download remote files onto victims.|\n|Crambus|T1021|Remote Services|Crambus has used Putty to access compromised systems.|\n|Crambus|T1053|Scheduled Task|Crambus has created scheduled tasks that run a VBScript to execute a payload on victim machines.|\n|Crambus|T1113|Screen Capture|Crambus has a tool called CANDYKING to capture a screenshot of user's desktop.|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n**Table 7: Mitre Attack Techniques (Continued)**\n\n**Group** **Technique ID** **Technique Name** **Technique Use**\n\nCrambus T1064 Scripting [Crambus has used various types of scripting for execution, including](https://attack.mitre.org/groups/G0049)\n.bat and .vbs scripts. The group has also used macros to deliver\nmalware such as QUADAGENT and OopsIE.\n\nCrambus T1193 Spear Phishing Attachment [Crambus has sent spear phishing emails with malicious attachments](https://attack.mitre.org/groups/G0049)\nto potential victims using compromised and/or spoofed email\naccounts.\n\nCrambus T1192 Spear Phishing Link [Crambus has sent spear phishing emails with malicious links to](https://attack.mitre.org/groups/G0049)\npotential victims.\n\nCrambus T1194 Spear Phishing via Service [Crambus has used LinkedIn to send spear phishing links.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1071 Standard Application Layer [Crambus has used HTTP and DNS for C2. The group has also used](https://attack.mitre.org/groups/G0049)\nProtocol the Plink utility and other tools to create tunnels to C2 servers.\n\nCrambus T1032 [Standard Cryptographic Protocol Crambus used the Plink utility and other tools to create tunnels to C2](https://attack.mitre.org/groups/G0049)\nservers.\n\nCrambus T1082 System Information Discovery [Crambus has run hostname and systeminfo on a victim.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1016 System Network Configuration [Crambus has run ipconfig /all on a victim.](https://attack.mitre.org/groups/G0049)\nDiscovery\n\nCrambus T1049 System Network Connections [Crambus has used netstat -an on a victim to get a listing of network](https://attack.mitre.org/groups/G0049)\nDiscovery connections.\n\nCrambus T1033 System Owner/User Discovery [Crambus has run whoami on a victim.](https://attack.mitre.org/groups/G0049)\n\nCrambus T1007 System Service Discovery [Crambus has used sc query on a victim to gather information about](https://attack.mitre.org/groups/G0049)\nservices.\n\nCrambus T1204 User Execution [Crambus has delivered malicious links and macro-enabled documents](https://attack.mitre.org/groups/G0049)\nthat required targets to click the \"enable content\" button to execute the\npayload on the system.\n\nCrambus T1078 Valid Accounts [Crambus has used compromised credentials to access other systems](https://attack.mitre.org/groups/G0049)\non a victim network.\n\nCrambus T1100 Web Shell [Crambus has used Web shells, often to maintain access to a victim](https://attack.mitre.org/groups/G0049)\nnetwork.\n\nCrambus T1047 Windows Management [Crambus has used WMI for execution.](https://attack.mitre.org/groups/G0049)\nInstrumentation\n\nBroadcom SED-IAP-WP100\n23\n\n|Group|Technique ID|Technique Name|Technique Use|\n|---|---|---|---|\n|Crambus|T1064|Scripting|Crambus has used various types of scripting for execution, including .bat and .vbs scripts. The group has also used macros to deliver malware such as QUADAGENT and OopsIE.|\n|Crambus|T1193|Spear Phishing Attachment|Crambus has sent spear phishing emails with malicious attachments to potential victims using compromised and/or spoofed email accounts.|\n|Crambus|T1192|Spear Phishing Link|Crambus has sent spear phishing emails with malicious links to potential victims.|\n|Crambus|T1194|Spear Phishing via Service|Crambus has used LinkedIn to send spear phishing links.|\n|Crambus|T1071|Standard Application Layer Protocol|Crambus has used HTTP and DNS for C2. The group has also used the Plink utility and other tools to create tunnels to C2 servers.|\n|Crambus|T1032|Standard Cryptographic Protocol|Crambus used the Plink utility and other tools to create tunnels to C2 servers.|\n|Crambus|T1082|System Information Discovery|Crambus has run hostname and systeminfo on a victim.|\n|Crambus|T1016|System Network Configuration Discovery|Crambus has run ipconfig /all on a victim.|\n|Crambus|T1049|System Network Connections Discovery|Crambus has used netstat -an on a victim to get a listing of network connections.|\n|Crambus|T1033|System Owner/User Discovery|Crambus has run whoami on a victim.|\n|Crambus|T1007|System Service Discovery|Crambus has used sc query on a victim to gather information about services.|\n|Crambus|T1204|User Execution|Crambus has delivered malicious links and macro-enabled documents that required targets to click the \"enable content\" button to execute the payload on the system.|\n|Crambus|T1078|Valid Accounts|Crambus has used compromised credentials to access other systems on a victim network.|\n|Crambus|T1100|Web Shell|Crambus has used Web shells, often to maintain access to a victim network.|\n|Crambus|T1047|Windows Management Instrumentation|Crambus has used WMI for execution.|\n\n\n-----\n\n**Symantec Critical Attack Discovery and Intelligence White Paper** Current Iran-Associated Cyber Threats\n\n# Revision History\n\n### SED-IAP-WP100; January 24, 2020\n\n##### Initial release.\n\nBroadcom SED-IAP-WP100\n24\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/syruqqq3lz9h3jv1io3cvyvl3zlcfdhb"
    ],
    "report_names": [
        "Symantec_SED_GEN_Report_IAP-WP100(01-24-2020)"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "81d49904-579d-45b3-ace2-1fdf0a713bc4",
            "created_at": "2022-10-25T15:50:23.331457Z",
            "updated_at": "2025-03-27T02:00:55.444159Z",
            "deleted_at": null,
            "main_name": "Leafminer",
            "aliases": [
                "Leafminer",
                "Raspite"
            ],
            "source_name": "MITRE:Leafminer",
            "tools": [
                "LaZagne",
                "Mimikatz",
                "MailSniper",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5d57e839-da14-44ab-b0dc-3a090f45ac4c",
            "created_at": "2022-10-25T16:07:23.42967Z",
            "updated_at": "2025-03-27T02:02:09.796235Z",
            "deleted_at": null,
            "main_name": "Cadelle",
            "aliases": [],
            "source_name": "ETDA:Cadelle",
            "tools": [
                "Antak",
                "Cadelle",
                "Cadelspy",
                "WinSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8e1bae2f-2a21-4ba8-a6f1-42155f96aec8",
            "created_at": "2022-10-25T16:07:23.645758Z",
            "updated_at": "2025-03-27T02:02:09.905135Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Ajax Security Team",
                "Flying Kitten",
                "Group 26",
                "Operation Saffron Rose"
            ],
            "source_name": "ETDA:Flying Kitten",
            "tools": [
                "Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "32c8c1a1-ae5c-4a05-a95d-2e970a46cd1e",
            "created_at": "2022-10-25T16:07:23.777999Z",
            "updated_at": "2025-03-27T02:02:09.976101Z",
            "deleted_at": null,
            "main_name": "Leafminer",
            "aliases": [
                "Flash Kitten",
                "Leafminer",
                "Raspite"
            ],
            "source_name": "ETDA:Leafminer",
            "tools": [
                "Imecab",
                "LaZagne",
                "Mimikatz",
                "PhpSpy",
                "Sorgu"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e58deb93-aff1-4be5-8deb-37fe8af0b7ed",
            "created_at": "2022-10-25T16:07:23.918534Z",
            "updated_at": "2025-03-27T02:02:10.02879Z",
            "deleted_at": null,
            "main_name": "Greenbug",
            "aliases": [
                "Greenbug",
                "Volatile Kitten"
            ],
            "source_name": "ETDA:Greenbug",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9663cdbf-646e-4579-881a-a8ebc3aabf63",
            "created_at": "2023-01-06T13:46:38.360862Z",
            "updated_at": "2025-03-27T02:00:02.814167Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "ITsecTeam"
            ],
            "source_name": "MISPGALAXY:Cutting Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4d7cba1-dbdd-42a9-88c5-4d0c81659ee0",
            "created_at": "2023-01-06T13:46:38.357581Z",
            "updated_at": "2025-03-27T02:00:02.813318Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Saffron Rose",
                "AjaxSecurityTeam",
                "Ajax Security Team",
                "Group 26",
                "Sayad",
                "SaffronRose"
            ],
            "source_name": "MISPGALAXY:Flying Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "552eeef7-4a19-44de-9147-db8893c115ef",
            "created_at": "2023-01-06T13:46:38.598788Z",
            "updated_at": "2025-03-27T02:00:02.869953Z",
            "deleted_at": null,
            "main_name": "RASPITE",
            "aliases": [
                "Raspite",
                "LeafMiner"
            ],
            "source_name": "MISPGALAXY:RASPITE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2ed8d590-defa-4873-b2de-b75c9b30931e",
            "created_at": "2023-01-06T13:46:38.730137Z",
            "updated_at": "2025-03-27T02:00:02.903261Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "Boggy Serpens",
                "Mango Sandstorm",
                "TEMP.Zagros",
                "Static Kitten",
                "G0069",
                "TA450",
                "Earth Vetala",
                "Seedworm",
                "COBALT ULSTER",
                "ATK51"
            ],
            "source_name": "MISPGALAXY:MuddyWater",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bee22874-f90e-410b-93f3-a2f9b1c2e695",
            "created_at": "2022-10-25T16:07:23.45097Z",
            "updated_at": "2025-03-27T02:02:09.808919Z",
            "deleted_at": null,
            "main_name": "Chafer",
            "aliases": [
                "APT 39",
                "Cobalt Hickman",
                "ITG07",
                "Radio Serpens",
                "Remix Kitten",
                "TA454"
            ],
            "source_name": "ETDA:Chafer",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Antak",
                "CACHEMONEY",
                "EternalBlue",
                "HTTPTunnel",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MechaFlounder",
                "Metasploit",
                "Mimikatz",
                "NBTscan",
                "NSSM",
                "Non-sucking Service Manager",
                "POWBAT",
                "Plink",
                "PuTTY Link",
                "Rana",
                "Remcom",
                "Remexi",
                "RemoteCommandExecution",
                "SafetyKatz",
                "UltraVNC",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "nbtscan",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3ce91297-e4c0-4957-8dd7-9047a3e23dc7",
            "created_at": "2023-01-06T13:46:39.054248Z",
            "updated_at": "2025-03-27T02:00:02.985963Z",
            "deleted_at": null,
            "main_name": "Tortoiseshell",
            "aliases": [
                "IMPERIAL KITTEN",
                "Yellow Liderc",
                "Imperial Kitten",
                "TA456",
                "DUSTYCAVE",
                "Crimson Sandstorm"
            ],
            "source_name": "MISPGALAXY:Tortoiseshell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6bba8e81-73af-4010-86dc-d43c408ca342",
            "created_at": "2023-01-06T13:46:38.553459Z",
            "updated_at": "2025-03-27T02:00:02.860364Z",
            "deleted_at": null,
            "main_name": "Greenbug",
            "aliases": [],
            "source_name": "MISPGALAXY:Greenbug",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "217c588a-5896-4335-b9ec-a516ae2f9a7e",
            "created_at": "2022-10-25T16:07:23.513775Z",
            "updated_at": "2025-03-27T02:02:09.838687Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "Cutting Kitten",
                "Operation Cleaver",
                "TG-2889"
            ],
            "source_name": "ETDA:Cutting Kitten",
            "tools": [
                "CsExt",
                "DistTrack",
                "IvizTech",
                "Jasus",
                "KAgent",
                "Logger Module",
                "MANGOPUNCH",
                "MPK",
                "MPKBot",
                "Net Crawler",
                "NetC",
                "PVZ-In",
                "PVZ-Out",
                "Pupy",
                "PupyRAT",
                "PvzOut",
                "Shamoon",
                "SynFlooder",
                "SysKit",
                "TinyZBot",
                "WndTest",
                "pupy",
                "zhCat",
                "zhMimikatz"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "31e69945-6c1e-40c3-ba8e-a77e81dd142a",
            "created_at": "2024-05-01T02:03:08.047377Z",
            "updated_at": "2025-03-27T02:05:17.326452Z",
            "deleted_at": null,
            "main_name": "COBALT ULSTER",
            "aliases": [
                "ENT-11 ",
                "ITG17 ",
                "MERCURY ",
                "Mango Sandstorm ",
                "MuddyWater ",
                "STAC 1171 ",
                "Seedworm ",
                "Static Kitten ",
                "TEMP.Zagros ",
                "UNC3313 ",
                "Yellow Nix ",
                "Earth Vetala "
            ],
            "source_name": "Secureworks:COBALT ULSTER",
            "tools": [
                " Canopy",
                " CrackMapExec",
                " CredNinja",
                " Empire",
                " FORELORD",
                " Koadic",
                " LaZagne",
                " Ligolo",
                " MKL64",
                " Metasploit",
                " Mimikatz",
                " MiniDump",
                " Mori",
                " MuddyC2Go",
                " MuddyC3",
                " PhonyC2",
                " Plink",
                " PowGoop",
                " PowerStats",
                " RemoteUtilities",
                " Revsocks",
                " ScreenConnect",
                " SimpleHelp",
                " Small Sieve",
                " Syncro",
                " Venom Proxy",
                " WMIExec",
                "AnyDesk"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "583cdac5-eb9d-46e9-a0f9-7594c4b18281",
            "created_at": "2024-05-01T02:03:08.017491Z",
            "updated_at": "2025-03-27T02:05:17.30797Z",
            "deleted_at": null,
            "main_name": "COBALT FIRESIDE",
            "aliases": [
                "CURIUM ",
                "DEV-0228 ",
                "HIVE0095 ",
                "Imperial Kitten ",
                "TA456 ",
                "Tortoiseshell ",
                "UNC3890 ",
                "Yellow Liderc ",
                "Crimson Sandstorm "
            ],
            "source_name": "Secureworks:COBALT FIRESIDE",
            "tools": [
                " LEMPO",
                " LiderBird",
                "FireBAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1b3a247f-6186-4482-8b92-c3fb2d767c7d",
            "created_at": "2023-01-06T13:46:38.883911Z",
            "updated_at": "2025-03-27T02:00:02.942724Z",
            "deleted_at": null,
            "main_name": "APT39",
            "aliases": [
                "COBALT HICKMAN",
                "G0087",
                "Radio Serpens",
                "TA454",
                "REMIX KITTEN"
            ],
            "source_name": "MISPGALAXY:APT39",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a761f2a6-26ba-47fd-89c3-6a74f847a3b2",
            "created_at": "2024-05-01T02:03:08.025289Z",
            "updated_at": "2025-03-27T02:05:17.312292Z",
            "deleted_at": null,
            "main_name": "COBALT HICKMAN",
            "aliases": [
                "Chafer ",
                "ITG07 ",
                "APT39 "
            ],
            "source_name": "Secureworks:COBALT HICKMAN",
            "tools": [
                " Mimikatz",
                " Remexi",
                " TREKX",
                "MechaFlounder"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1ba5f718-ad64-492c-8a95-e21a46516d22",
            "created_at": "2023-01-06T13:46:38.524357Z",
            "updated_at": "2025-03-27T02:00:02.854652Z",
            "deleted_at": null,
            "main_name": "Cadelle",
            "aliases": [],
            "source_name": "MISPGALAXY:Cadelle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "25896473-161f-411f-b76a-f11bb26c96bd",
            "created_at": "2023-01-06T13:46:38.75749Z",
            "updated_at": "2025-03-27T02:00:02.910627Z",
            "deleted_at": null,
            "main_name": "CHRYSENE",
            "aliases": [
                "Greenbug"
            ],
            "source_name": "MISPGALAXY:CHRYSENE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e1c2df-8abd-49b1-91d1-61bc733cf96b",
            "created_at": "2022-10-25T15:50:23.308924Z",
            "updated_at": "2025-03-27T02:00:55.437268Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "MuddyWater",
                "Earth Vetala",
                "Static Kitten",
                "Seedworm",
                "TEMP.Zagros",
                "Mango Sandstorm",
                "TA450"
            ],
            "source_name": "MITRE:MuddyWater",
            "tools": [
                "STARWHALE",
                "POWERSTATS",
                "Out1",
                "PowerSploit",
                "Small Sieve",
                "Mori",
                "Mimikatz",
                "LaZagne",
                "PowGoop",
                "CrackMapExec",
                "ConnectWise",
                "SHARPSTATS",
                "RemoteUtilities",
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b5b24083-7ba6-44cc-9d11-a6274e2eee00",
            "created_at": "2022-10-25T16:07:24.337332Z",
            "updated_at": "2025-03-27T02:02:10.177597Z",
            "deleted_at": null,
            "main_name": "Tortoiseshell",
            "aliases": [
                "Crimson Sandstorm",
                "Curium",
                "Houseblend",
                "Imperial Kitten",
                "Marcella Flores",
                "Operation Fata Morgana",
                "TA456",
                "Yellow Liderc"
            ],
            "source_name": "ETDA:Tortoiseshell",
            "tools": [
                "IMAPLoader",
                "Infostealer",
                "IvizTech",
                "LEMPO",
                "MANGOPUNCH",
                "SysKit",
                "get-logon-history.ps1",
                "liderc",
                "stereoversioncontrol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b6155e4-94ec-4909-b908-550afe758ad6",
            "created_at": "2022-10-25T15:50:23.365074Z",
            "updated_at": "2025-03-27T02:00:55.455014Z",
            "deleted_at": null,
            "main_name": "APT39",
            "aliases": [
                "APT39",
                "ITG07",
                "Remix Kitten"
            ],
            "source_name": "MITRE:APT39",
            "tools": [
                "NBTscan",
                "MechaFlounder",
                "Remexi",
                "CrackMapExec",
                "pwdump",
                "Mimikatz",
                "Windows Credential Editor",
                "Cadelspy",
                "PsExec",
                "ASPXSpy",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3c430d71-ab2b-4588-820a-42dd6cfc39fb",
            "created_at": "2022-10-25T16:07:23.880522Z",
            "updated_at": "2025-03-27T02:02:10.010443Z",
            "deleted_at": null,
            "main_name": "MuddyWater",
            "aliases": [
                "ATK 51",
                "Boggy Serpens",
                "Cobalt Ulster",
                "ITG17",
                "Mango Sandstorm",
                "MuddyWater",
                "Operation BlackWater",
                "Operation Earth Vetala",
                "Operation Quicksand",
                "Seedworm",
                "Static Kitten",
                "T-APT-14",
                "TA450",
                "TEMP.Zagros",
                "Yellow Nix"
            ],
            "source_name": "ETDA:MuddyWater",
            "tools": [
                "Agentemis",
                "BugSleep",
                "CLOUDSTATS",
                "ChromeCookiesView",
                "Cobalt Strike",
                "CobaltStrike",
                "CrackMapExec",
                "DELPHSTATS",
                "EmPyre",
                "EmpireProject",
                "FruityC2",
                "Koadic",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "MZCookiesView",
                "Meterpreter",
                "Mimikatz",
                "MuddyC2Go",
                "MuddyRot",
                "Mudwater",
                "POWERSTATS",
                "PRB-Backdoor",
                "PhonyC2",
                "PowGoop",
                "PowerShell Empire",
                "PowerSploit",
                "Powermud",
                "QUADAGENT",
                "SHARPSTATS",
                "SSF",
                "Secure Socket Funneling",
                "Shootback",
                "Smbmap",
                "Valyria",
                "chrome-passwords",
                "cobeacon",
                "prb_backdoor"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b938e2e3-3d1b-4b35-a031-ddf25b912557",
            "created_at": "2022-10-25T16:07:23.35582Z",
            "updated_at": "2025-03-27T02:02:09.750954Z",
            "deleted_at": null,
            "main_name": "APT 33",
            "aliases": [
                "APT 33",
                "ATK 35",
                "Cobalt Trinity",
                "Curious Serpens",
                "Elfin",
                "Holmium",
                "Magnallium",
                "Peach Sandstorm",
                "Refined Kitten",
                "TA451",
                "Yellow Orc"
            ],
            "source_name": "ETDA:APT 33",
            "tools": [
                "Atros2.CKPN",
                "AutoIt backdoor",
                "Breut",
                "CinaRAT",
                "DROPSHOT",
                "DarkComet",
                "DarkKomet",
                "DistTrack",
                "EmPyre",
                "EmpireProject",
                "FYNLOS",
                "FalseFont",
                "Filerase",
                "Fynloski",
                "JuicyPotato",
                "Krademok",
                "LOLBAS",
                "LOLBins",
                "LaZagne",
                "Living off the Land",
                "Mimikatz",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "NetWeird",
                "NetWire",
                "NetWire RAT",
                "NetWire RC",
                "NetWired RC",
                "Notestuk",
                "POWERTON",
                "PoshC2",
                "PowerBand",
                "PowerShell Empire",
                "PowerSploit",
                "PsList",
                "Pupy",
                "PupyRAT",
                "Quasar RAT",
                "QuasarRAT",
                "Recam",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "SHAPESHIFT",
                "Shamoon",
                "Socmer",
                "StoneDrill",
                "TURNEDUP",
                "Tickler",
                "Yggdrasil",
                "Zurten",
                "klovbot",
                "pupy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1704420431,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1579859055,
    "ts_modification_date": 1579859230,
    "files": {
        "pdf": "https://archive.orkl.eu/05b243bd81b310656d3348ee6d508de2f12a50d4.pdf",
        "text": "https://archive.orkl.eu/05b243bd81b310656d3348ee6d508de2f12a50d4.txt",
        "img": "https://archive.orkl.eu/05b243bd81b310656d3348ee6d508de2f12a50d4.jpg"
    }
}