{
    "id": "29804f6f-61e2-4f9d-b5db-a5f2cae763c9",
    "created_at": "2023-01-12T15:10:18.534064Z",
    "updated_at": "2025-03-27T02:05:52.038395Z",
    "deleted_at": null,
    "sha1_hash": "f0adc28690cbffdc0166f48ab51b7cebb874dbf4",
    "title": "2021-04-29 - Udało nam się zrealizować wywiad z grupą ransomware (Babuk), która zaszyfrowała policję metropolitarną w Waszyngtonie",
    "authors": "",
    "file_creation_date": "2022-05-28T19:23:33Z",
    "file_modification_date": "2022-05-28T19:23:33Z",
    "file_size": 592318,
    "plain_text": "# Udało nam się zrealizować wywiad z grupą ransomware (Babuk), która zaszyfrowała policję metropolitarną w Waszyngtonie\n\n**sekurak.pl/udalo-nam-sie-zrealizowac-wywiad-z-grupa-ransomware-babuk-ktora-zaszyfrowala-policje-metropolitarna-**\nw-waszyngtonie/\n\nApril 29, 2021\n\n[Policja metropolitalna w Waszyngtonie padła ofiarą ataku ransomware’owego. Operatorzy](https://sekurak.pl/policja-metropolitalna-w-waszyngtonie-ofiara-ataku-ransomwareowego/)\nBabuka uzyskali dostęp do jej infrastruktury, wykradli poufne i bardzo wrażliwe dane, a w\nzamian za powstrzymanie się od publikacji całości wykradzionych informacji żądają zapłaty.\n\nWczoraj (28 kwietnia) wcześnie rano na stronie wyciekowej Babuka pojawiła się następująca\nwiadomość, skierowana do waszyngtońskiej policji:\n\n_We advise the police station to get in touch as soon as possible, you do not need this leak,_\n_because of it people may suffer, we also have software that allows you to view reports in the_\n_i2-analysts-notebook_\n\n—Operatorzy ransomware Babuk\n\nJeśli chcesz przejść do treści wywiadu – przeskroluj nieco niżej.\nWspomniane oprogramowanie i2-analysts-notebook jest powszechnie wykorzystywane\nprzez analityków kryminalnych w oddziałach policji na całym świecie, w tym również w\nPolsce. Pozwala tworzyć teczki, w których umieszczane są szczegółowe informacje o\nanalizowanych sprawach, w tym na przykład dane o osobach, przepływach pieniężnych i\nkomunikacji oraz o relacjach pomiędzy poszczególnymi osobami w grupach przestępczych.\nWczorajszy dowód pozyskania takich plików i ich odczytania przez osoby nieuprawnione, a\nnastępnie sama tylko groźba opublikowania tych danych na stronie wyciekowej lub sprzedaż\ntych informacji grupom przestępczym, z całą pewnością uwiarygodniły operatorów\nransomware’a Babuk.\n\nW godzinach popołudniowych na stronie wyciekowej Babuka pojawiła się pierwsza paczka z\n[danymi z wycieku.](https://twitter.com/thiswentdown/status/1387412625772978178)\n\n\n-----\n\nW ujawnionych plikach opublikowano objęte klauzulą poufności raporty, które (choć bardzo\ninteresujące) nigdy nie powinny zostać ujawniane osobom postronnym. Zawierały dane\nosobowe, w tym dotyczące wykształcenia, doświadczenia zawodowego, miejsca\nzamieszkania i sytuacji finansowej funkcjonariuszy policji waszyngtońskiej. Amerykańska\nstacja NBC potwierdziła autentyczność tych danych z jedną z osób, której dane ujawniono.\n\nNależy więc przyjąć za pewne, że operatorzy ransomware Babuk:\n\n1. uzyskali dostęp do infrastruktury policji metropolitalnej w Waszyngtonie,\n2. pozyskali policyjne dane, oraz\n3. w razie odmowy zawarcia stosownego porozumienia, opublikują wszystko, co pobrali\n\n(ok. 250 GB danych, w tym kartoteki policyjne, akta spraw, dane konkretnych\nfunkcjonariuszy).\n\nPo opublikowaniu powyższych pięciu raportów, ze strony wyciekowej Babuka usunięte\nzostały wszystkie artykuły dotyczące policji metropolitalnej w Waszyngtonie. Użytkownicy\n[Twittera zastanawiają się, czy to znaczy że policja metropolitalna zapłaciła okup.](https://twitter.com/_IntelligenceX/status/1387461470024253452)\n\n\n-----\n\n## Sekurak, zamiast spekulować, po prostu sprawdził.\n\nOperatorzy ransomware’a Babuk udzielili nam unikalnego wywiadu, bowiem na razie nikomu\ninnemu się to nie udało. Jak to zrobiliśmy? Oficjalnym kanałem. Zadawaliśmy pytania i\ndostawaliśmy odpowiedzi. Wywiad jest autoryzowany.\n\nFragment rozmowy wygląda tak, a tłumaczenie z angielskiego na polski jest nasze:\n\n\n-----\n\n**Babuk: Jesteście pierwszymi i ostatnimi dziennikarzami, którym udzielamy wywiadu. Nie**\njesteśmy tacy, jak inne grupy. Nie udzielamy wywiadów. Nie potrzebujemy sławy.\n\n**sekurak: Mówicie o sobie, że jesteście cyberpunkami. W mediach, w ciągu ostatnich**\nkilkudziesięciu godzin z cyberpunków staliście się rosyjskimi hakerami. Kim tak naprawdę\njesteście?\n\n**Babuk: To prawda, jesteśmy cyberpunkami. Na marginesie – policja metropolitalna w**\nWaszyngtonie jest ostatnią instytucją rządową, którą zaatakowaliśmy. Nie chcemy być\nkojarzeni z polityką, czy rosyjskimi „państwowymi” hakerami. Nie jesteśmy nimi i uważamy\nich działania za niedorzeczne. Nie potrzebujemy też sławy.\n\n**sekurak: Policja waszyngtońska jest ostatnią zaatakowaną instytucją – to znaczy, że już**\nwięcej nie będziecie audytować sieci instytucji rządowych czy że zaatakowaliście też inne\npodmioty, a policja jest ostatnią z nich?\n\n**Babuk: Policja waszyngtońska jest ostatnią rządową instytucją, którą audytowaliśmy. Nie**\nbędziemy więcej atakować podmiotów z sektora rządowego, ponieważ nie chcemy wywołać\nkonfliktu między Federacją Rosyjską a Stanami Zjednoczonymi.\n\n**sekurak: Czy to oznacza, że zapoznaliście się z najnowszą wspólną publikacją CISA, DHS i**\nFBI o aktywności rosyjskich hakerów w Stanach Zjednoczonych?\n\n**Babuk: Tak, zapoznaliśmy się. Nie jesteśmy sponsorowani przez żadne konkretne państwo,**\ndziałamy samodzielnie. Nie atakujemy ofiar w niektórych państwach, takich jak Rosja,\nPolska, czy inne kraje postsowieckie. Z prostego powodu – one zwyczajnie nie mają\npieniędzy, żeby zapłacić za nasze usługi.\n\n**sekurak: To kogo atakujecie?**\n\n\n-----\n\n**Babuk: Na początku lata tego roku przeprowadzimy zmasowany atak na największe firmy**\ninformatyczne. Powiedzmy więc, że giganci IT powinni poszukać naszych kotwic w swoich\nsystemach i być może to udaremni przeprowadzenie naszego ataku.\n\n**sekurak: A co w przypadku takiego scenariusza, kiedy audytujecie sieć korporacyjną,**\nznajdujecie podatności, wykradacie i szyfrujecie dane, ale ofiara nie ma środków na zapłatę\noczekiwanego przez was wynagrodzenia?\n\n**Babuk: Zdarza się tak, że ofiara twierdzi, że nie ma środków na zapłatę naszego**\nwynagrodzenia. Weryfikujemy wtedy sytuację finansową ofiary i podejmujemy decyzję o\nwysokości naszego honorarium. Ostatnio zdarzyła się taka sytuacja, że zaatakowaliśmy\nafrykańską firmę, która handlowała paliwem, jednak w związku z pandemią, utraciła\npłynność finansową i faktycznie nie miała środków, aby nam zapłacić. Zrezygnowaliśmy z\nwynagrodzenia i nieodpłatnie przekazaliśmy narzędzie deszyfrujące.\n\n**sekurak: Czyli pomagacie ofiarom, nie zawsze oczekując za to wynagrodzenia?**\n\n**Babuk: Tak. Opisujemy to na naszej stronie internetowej. Ostatnio pomogliśmy domowi**\nopieki. Znaleźliśmy podatności w ich sieci i spatchowaliśmy je, totalnie pro bono. Szanujemy\nosoby starsze i tych, którzy im pomagają. To nie jest kwestia kultury czy wyznania – po\nprostu każda osoba powinna odnosić się z szacunkiem do osób starszych,\nniepełnosprawnych oraz tych osób i instytucji, które im pomagają.\n\n**sekurak: Czy ofiary wam płacą?**\n\n**Babuk: Tak. Co najmniej 7 firm nam zapłaciło, w tym jedna $2.000.000.**\n\n**sekurak: Czy policja metropolitalna w Waszyngtonie również wam zapłaciła?**\n\n**Babuk: W każdym przypadku są dwa scenariusze. Pierwszy, kiedy ofiara płaci – wtedy**\nusuwamy artykuły z naszej strony internetowej. Drugi, kiedy ofiara nie płaci – wtedy\npublikujemy wyciek.\n\n**sekurak: Skoro artykuły o policji zniknęły, oznacza to, że policja wam zapłaciła?**\n\n**Babuk: Trwają negocjacje. Obiecaliśmy, że nie opublikujemy nic więcej, dopóki negocjacje**\ntrwają. W tej chwili nie możemy powiedzieć więcej.\n\n**sekurak: Jak dostaliście się do infrastruktury policji w Waszyngtonie?**\n\n**Babuk: 0-day w VPN. Nie możemy powiedzieć nic więcej, w końcu to 0-day.**\n\n**sekurak: Kiedy policja waszyngtońska zorientowała się, że Babuk uzyskał dostęp do sieci?**\n\n**Babuk: Zorientowali się zbyt późno, już po tym jak wykradliśmy dane.**\n\n**sekurak: Wykradliście dane z policji waszyngtońskiej czy również zaszyfrowaliście?**\n\n\n-----\n\n**Babuk: Nie zaszyfrowaliśmy wszystkich 6,000 hostów, ponieważ nie chcieliśmy, żeby policja**\nnie mogła pracować. Żądamy zapłaty za niepublikowanie danych. Jeśli chcielibyśmy\nzaszyfrować dane policji metropolitalnej, po prostu byśmy je zaszyfrowali.\n\n**sekurak: Co najczęściej wykorzystujecie? RDP wystawione na świat? Socjotechnikę? 0-**\nday’e?\n\n**Babuk: RDP naprawdę nie jest taki zły, jednak te RDP, które są dostępne z zewnątrz, są**\nwykorzystywane przez małe firmy, a one nie są dla nas interesujące. VPN jest już używany\nprzez większe firmy, które nas interesują. Wykorzystywaliśmy również lukę ProxyLogon (0day w serwerach MS Exchange).\n\n**sekurak: Co na koniec chcielibyście przekazać osobom, które czytają ten wywiad?**\n\n**Babuk: Nie chcemy nikogo straszyć. Po prostu, zabezpieczcie brzeg waszej sieci i nie**\nbędzie więcej problemów. Chcemy również podziękować wszystkim badaczom za pomoc w\nznalezieniu podatności w naszym produkcie. Szczególne podziękowania należą się dla\nChuong Donga, dzięki któremu poprawiliśmy nasze szyfrowanie, oraz dla firmy Emsisoft za\npomoc w poprawieniu naszego dekryptora.\n\n–unk\n\n\n-----",
    "language": "PL",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-29 - Udało nam się zrealizować wywiad z grupą ransomware (Babuk), która zaszyfrowała policję metropolitarną w Waszyngtonie.pdf"
    ],
    "report_names": [
        "2021-04-29 - Udało nam się zrealizować wywiad z grupą ransomware (Babuk), która zaszyfrowała policję metropolitarną w Waszyngtonie.pdf"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536218,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653765813,
    "ts_modification_date": 1653765813,
    "files": {
        "pdf": "https://archive.orkl.eu/f0adc28690cbffdc0166f48ab51b7cebb874dbf4.pdf",
        "text": "https://archive.orkl.eu/f0adc28690cbffdc0166f48ab51b7cebb874dbf4.txt",
        "img": "https://archive.orkl.eu/f0adc28690cbffdc0166f48ab51b7cebb874dbf4.jpg"
    }
}