{
    "id": "29a60cab-598c-405a-aba1-bedef85ea476",
    "created_at": "2024-05-03T02:05:27.570718Z",
    "updated_at": "2025-03-27T02:16:17.288764Z",
    "deleted_at": null,
    "sha1_hash": "1e00f6c791fe7676d14aa8bac249107b3717f766",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-11-23T15:31:07Z",
    "file_modification_date": "2021-11-23T15:31:13Z",
    "file_size": 2670257,
    "plain_text": "# 2021\n## Analysis Report on  Lorec53 Group\n\n\n-----\n\n### Table of Contents\n\n#### Background .......................................................................................................................................................... 2 Hacker Group Analysis................................................................................................................................... 2\n\n##### Goals & Objectives .............................................................................................................................................. 2 Group Characteristics ......................................................................................................................................... 2 Group Location.................................................................................................................................................... 3\n#### Attack Activity Analysis ................................................................................................................................. 3\n\n##### March .................................................................................................................................................................. 4\n “ISTC agreement\" Phishing Campaign ....................................................................................................... 4 April ..................................................................................................................................................................... 6\n \"I give you bitcoin\" Phishing Attack ........................................................................................................... 6 \"Veterans Grant\" Phishing Attack .............................................................................................................. 7 \"COVID-21\" Phishing Attack ....................................................................................................................... 9 May .................................................................................................................................................................... 10\n \"Documents of the Ukrainian Ministry of Internal Affairs\" Phishing Attack......................................... 10 June.................................................................................................................................................................... 10\n Many pdf-cpl Phishing Attacks ................................................................................................................. 10 July ..................................................................................................................................................................... 10\n \"828\" & \"IDP\" Phishing Attacks ................................................................................................................ 10 \"Update Adobe Acrobat Reader DC\" Watering Hole & Phishing Attack Campaign ............................. 12 \"22-7-2021 Certificate\" Phishing Attack .................................................................................................. 13 Other Attack Activities .................................................................................................................................... 14\n \"ir.pardakht\" Android APP Phishing Attack ............................................................................................. 14\n\n\n-----\n\n### Background\n\nRecently, NSFOCUS Security Labs confirmed a number of cyber attacks against Eastern European countries such as Ukraine and Georgia.\n\nThrough tracking and analysis, we found that these attacks belonged to a new APT group that was very active in the first half of 2021. The\n\ngroup has strong penetration capabilities and is good at borrowing the attack methods and network facilities of other active hacker\n\norganizations to launch unique downloaders and spy Trojan programs through spear phishing and watering hole sites. More information on\n\nthe behavior trajectory indicates that the group may currently be employed by a higher-level spy group to help them gather information.\n\nNSFOCUS Security Labs named the group Lorec53 based on the characteristic information in its attack components.\n\nThis article is the first of a series of reports about the Lorec53. In this report, NSFOCUS Security Labs will introduce Lorec53’s activities and\n\ncharacteristics, and disclose the group’s attack activities in chronological order.\n\n### Hacker Group Analysis\n\n###### Goals & Objectives\n\nThe Lorec53 group has always played the role of information gathering in cyber attacks. The organization's espionage attacks mainly targeted\n\ngovernment workers in Georgia and Ukraine, trying to steal various types of document data on their devices, or leave backdoor programs on\n\nthe devices for subsequent attacks.\n\nAt present, the victims of the Lorec53 group include the users of the National Bank of Iran, the Georgian Epidemic Prevention and Health\n\nDepartment, the Ukrainian Ministry of National Defense, the Presidential Office, the Ministry of Interior, and the Border Defense Agency.\n\n###### Group Characteristics\n\nAssociated attack events show that the Lorec53 group exhibited distinguished organizational characteristics at multiple stages of the attack\n\nprocess. Some of these characteristics are similar to other known attack groups, and the other part shows independence and at the same\n\ntime demonstrates the possibility of cooperating with known APT groups.\n\nWe summarized the following behavioral characteristics of Lorec53:\n\n1. Participate in hacking activities as a mercenary;\n\nAt present, the Lorec53 group activities that have been discovered not only target cyber espionage attacks in specific countries, but also\n\ninclude order-based phishing commonly used by some spear phishing operators, extensive vulnerability scanning and weak password blasting,\n\nand the theft of users' financial assets. These attacks that lack direct motives indicate that Lorec53 may be a hacker or a group of hackers with\n\nstrong penetration capabilities who have participated in the attacks of other hacker organizations or even higher-level cyber espionage\n\norganizations in a cooperative or hired manner.\n\n2. Good at using social engineering techniques from other APT groups;\n\nThe Lorec53 group used different social engineering techniques in its attack process, including watering hole sites, lnk script execution, rtf\n\nexploits, PDF malicious links, multiple decoys, and document garbled strings. On the one hand, these technologies demonstrate the ability of\n\nthe Lorec53 group in penetration; on the other hand, these methods similar to the penetration methods of known APT groups also show that\n\nthe Lorec53 group is still in the learning and development stage in the field of cyber espionage.\n\n3. Use temporary domain names of .site, .space, .xyz and other domains;\n\nThe discovered network equipment shows that the Lorec53 group seems to be fond of the three top-level domains of .site, .space, and .xyz,\n\nunder which a large number of pure digital or English-digit mixed domain names are registered and used for cyberattacks. The above\nmentioned top-level domains are relatively loosely managed, which facilitates anonymous registration and mass registration, and facilitates\n\nthe programmatic management of the Lorec53 group. The short-term domain names based on the above domains are easily reminiscent of\n\nthe APT group Gamaredon, and the Lorec53 group is likely to learn from the domain name management model of these old APT groups.\n\n\n-----\n\n4. Use some unique Trojan horses;\n\nIn its cyber espionage activities, the Lorec53 group produced and deployed various Trojan horse programs such as LorecCPL and\n\nLorecDocStealer. Similar programs have not yet appeared in other espionage activities.\n\n5. Borrow network facilities of other hacker groups;\n\nSome network facilities controlled by the Lorec53 group were found to be used to operate other botnets including Predator and Formbook\n\nbefore 2021 or after some cyber espionage attacks. At present, these botnet operations do not have much overlap with the attack intentions\n\nand common methods of Lorec53, and it is impossible to find a direct connection between the threat actors. We infer that the Lorec53 group\n\nmay have borrowed the servers of some other hacker groups to transfer or distribute its Trojan horse programs. We are unable to determine\n\nthe reason behind this behavior, but in terms of results, it has increased the difficulty of sorting out the trajectory of the Lorec53 group to a\n\ncertain extent.\n\n###### Group Location\n\nAt present, no key evidence that can clearly locate the geographic location of Lorec53 has been found. However, related attacks indicate that\n\nLorec53 prefers to use attack resources from Russia, including servers belonging to Russian service providers and registrants, and Trojan horse\n\nprograms from Russian hacker forums or black markets.\n\nInquiring about the network facilities that appeared in all related attacks of the Lorec53 group, we found that the attribution of these facilities\n\nis very concentrated. In the Georgian phishing incident, the registrant of the relevant domain name was fed****kar@rambler.ru, and the\n\naccount registered multiple domain names of the same type; the relevant IPs were all located in Russia. Similarly, the registrants of 2315.site\n\nand 1833.site of the domain names appearing in the associated event are fed****kar@rambler.ru with the same account, and the registrant\n\nof 100020.xyz is hro****1995@rambler.ru. The vast majority of IP is located in Russia.\n\nThe Lorec53 group uses a variety of Trojan horse programs developed by Russian hackers, all of which come from Russian dark web forums.\n\nThe Taurus Trojan horse program used by the Lorec53 group was developed by a Russian developer named Alexuiop1337 and was sold on\n\nmany Russian dark web forums and Telegram channels;\n\nThe Saint Bot Trojan horse program used by the Lorec53 group contains a code logic commonly used by Russian malware developers. By\n\nobtaining the LCID of the operating environment, it can avoid operating itself in Russian, Ukrainian, Belarusian, Armenian, Kazakh, and\n\nMoldova environment. This type of code is usually used to reduce the exposure of the program itself in non-target areas.\n\n### Attack Activity Analysis\n\n\n-----\n\nThe cyber espionage organized by Lorec53 was first exposed in March 2021. The attack timeline shows that the Lorec53 group alternately\n\ncarried out attacks against Georgia and Ukraine, and as time progressed, its attack activity increased significantly, and the quality of each\n\ncomponent in the attack process became higher and higher.\n\n###### March \n\n**_“ISTC agreement\" Phishing Campaign_**\n\nThe attack was suspected to be aimed at Georgian state organizations related to disease prevention and control.\n\nIn this attack, the attackers of the Lorec53 group delivered a compressed file named Confirmation.zip, which contained the following three\n\nfiles:\n\n\n-----\n\nThe document named Letter Confirm.doc is a CVE-2017-11882 vulnerability document, and the following content is displayed after opening:\n\nThe Trojan horse program is encapsulation of the smokeloader Trojan horse program.\n\nThe file named More info.lnk is a malicious shortcut file commonly used by Lorec53. This file contains obfuscated powershell commands,\n\nwhich are used to download and run the file in the hard-coded URL address http[:]//001000100.xyz/soft/upd03212.exe.\n\n\n-----\n\nSubsequent attack payloads include:\n\nConverted into a bat file in the form of a self-extracting program by the bat2exe tool, used to close Windows Defender;\n\nThe obscured C# dropper program finally releases the smokeloader Trojan program.\n\nIt is worth noting that the download address http[:]//shcangjia.com/ is shown as the official website of Shanghai Cangjia Mechanical and\n\nElectrical Equipment Co., Ltd., which is suspected to be compromised and used by the Lorec53 group.\n\n###### April \n\n**_\"I give you bitcoin\" Phishing Attack_**\n\nOn April 9, Lorec53 launched a phishing email attack using Bitcoin information as a bait, and related emails were captured by ahnlab[i].\n\n\n-----\n\nThe PDF file contains a malicious download link https[:]//cutt.ly/McXG1ft, which eventually jumps to http[:]//1924.site/doc/bitcoin.zip.\n\nThe bitcoin.zip compressed package contains the following contents:\n\n**_\"Veterans Grant\" Phishing Attack_**\n\nIn another attack, Lorec53 delivered a phishing email titled FW: Виплати ветеранам АТО (a forwarded email for payment to ATO veterans).\n\n\n-----\n\nAfter the Word file is opened, a picture containing the tank model is displayed. The original picture may come from the model website meng\nmodel.com [ii].\n\n\n-----\n\n**_\"COVID-21\" Phishing Attack_**\n\nIn order to carry out phishing attacks, the Lorec53 group also fabricated the so-called \"COVID-21\" topic.\n\nIn a \"COVID-21\" themed phishing attack, Lorec53 put the following files in a compressed package named \"newCOVID-21.zip\", which contains\n\nmultiple malicious files:\n\n\"!!! COVID-21.doc\" is the same as \"New Folder.lnk\". Both are malicious lnk files commonly used by Lorec53 to download the saint bot preload\n\nor raccoon spy Trojan.\n\n\n-----\n\n###### May \n\n**_\"Documents of the Ukrainian Ministry of Internal Affairs\" Phishing Attack_**\n\nIn May 2021, the Lorec53 group continued to run attacks based on vulnerability documents and lnk files. In addition, they began to\n\nincorporate a self-made cpl downloader file into the new attack process.\n\nThe initial carrier of the attack process is a malicious PDF file. The malicious links hidden in these PDF files are made into Google’s URL query\n\nform, which is redirected to the URL address containing the malicious cpl file through Google.\n\nThe CPL files found in this period include the following names:\n\nOriginal Name Translation\n\n2 - МВС УКРАЇНИ - signed - (6kh).cpl 2 - The Ministry of Internal Affairs of\n\nUkraine - Signed - (6kh) .cpl\n\nУД-Заява-Костенко (19263hm) .cpl UD-Statement- Kostenko\n\n(19263hm) .cpl\n\nЗаява №4872875 (0co).cpl Statement №4872875 (0co).cpl\n\nЗаява#4872824 (2g9).cpl Statement #4872824 (2g9).cpl\n\nЗаява №4872823-(11).cpl Statement №4872823-(11).cpl\n\nЗаява №4872823-(20).cpl Statement №4872823-(20).cpl\n\nThe above names indicate that the attacks related to these files still target the Ukrainian government.\n\nThese CPL files are actually the small ASM downloader program LorecCPL produced by the lorec53 group, which is used to download and\n\nexecute the LorecDocStealer program\n\n###### June \n\n**_Many pdf-cpl Phishing Attacks_**\n\nIn June, the Lorec53 group continued to use malicious PDF documents containing the pdf-cpl attack chain to launch attacks against multiple\n\ntypes of targets.\n\nThe malicious document \"Georgia_Private_Sector_Poster_Inputs_06_2021.pdf\" targets the Georgian government and is used to download\n\nthe LorecCPL Trojan named \"georgia_private_sector_poster_inputs_06_2021.cpl\".\n\nThe malicious document \"Alibaba.com order# 03284983240830433498422239328759576898-390325025958245048474\n7494045958540499.pdf\" disguised as an order from Alibaba Group, download the Trojan named \"Alibaba.com order#\n\n03284983240830433498422239328759576898-390325025958245048474-7494045958540499.pdf.cpl\".\n\nThese LorecCPL Trojans are also used to download the LorecDocStealer program.\n\n###### July \n\n**_\"828\" & \"IDP\" Phishing Attacks_**\n\nIn early July, the Lorec53 group launched a phishing attack on the Georgian government's epidemic prevention and livelihood department.\n\nPhishing attacks in the document appear are named 828-ში ცვლილება. Doc and დევნილთა 2021-2022 წლების სტრატეგიის სამოქმედო\n\nგეგმა. doc.\n\n|Original Name|Translation|\n|---|---|\n|2 - МВС УКРАЇНИ - signed - (6kh).cpl|2 - The Ministry of Internal Affairs of Ukraine - Signed - (6kh) .cpl|\n|УД-Заява-Костенко (19263hm) .cpl|UD-Statement- Kostenko (19263hm) .cpl|\n|Заява №4872875 (0co).cpl|Statement №4872875 (0co).cpl|\n|Заява#4872824 (2g9).cpl|Statement #4872824 (2g9).cpl|\n|Заява №4872823-(11).cpl|Statement №4872823-(11).cpl|\n|Заява №4872823-(20).cpl|Statement №4872823-(20).cpl|\n\n\n-----\n\n828-ში ცვლილება means \"change of 828\", where 828 should refer to the resolution 828 of the Georgian government in 2020. According to\n\nthe record on the FAO website[iii], the main content of Resolution 828 is Georgia's national health care plan in 2021. The plan includes\n\nvaccination, epidemiological testing, public health, maternal and child health, and COVID-19 management.\n\nWhen the 828-ში ცვლილება.doc is opened, the Georgian content with garbled characters and the visible ASCII code content are displayed.\n\nThe visible content contains words that match the document name such as N828, COVID-19, COVAX, and so on, as shown in the figure below.\n\n“დევნილთა 2021-2022 წლების სტრატეგიის სამოქმედო გეგმა” means IDP Strategic Action Plan for 2021-2022. IDP stands for Internally\n\nDisplaced Persons, which is a proprietary vocabulary produced in the Georgian People’s Livelihood Project. According to the relevant website[iv],\n\nIDP stands for internally displaced persons, that is, people who have been forced to flee their homes but remain in their own borders.\n\nExcept the title, all other content is unreadable when დევნილთა 2021-2022 წლების სტრატეგიის სამოქმედო გეგმა.doc is opened. See\n\nthe picture below.\n\n\n-----\n\nThe invisible parts of the two documents have no practical meaning, and are only used to lure recipients to enable the office's editing content\n\nfunction. Once this feature is enabled, malicious macros in the document will be executed.\n\nThe malicious macro carried by the two documents is the same. The function is to create a bat file in the specified directory\n\n\"C:\\Users\\Public\\Documents\\\", and use the file to download malicious executable file.  http[:]//1221.site/15858415841/0407.exe. The\n\nmalicious program is saved to \"C:\\Users\\Public\\Documents\\\" and executed.\n\nThe malicious program downloaded by the above document is the LorecDocStealer Trojan.\n\n_\"Vacancies in the Presidential Palace of Ukraine\" Watering Hole & Phishing Attack_\n\nOn July 13, UACERT disclosed an attack that forged the website of the President of Ukraine. Related information shows that the leader of the\n\nincident is also the Lorec53 organization.\n\nIn this attack, Lorec53 created a watering hole site with the address\n\nhttp[:]//president.gov.ua.administration.vakansiyi.administration.president.gov-ua.info/, and at the same time sent a vacancy-themed site\n\nPhishing emails lure victims to visit and download malicious programs on the site.\n\nThe content of the above link is saying \"Complete list of high-paying positions\".\n\nThe malicious program pointed to by the link is actually a downloader Trojan horse commonly used by Lorec53, which is used to download\n\nand execute the LorecDocStealer program located at http[:]//1833.Site/0707a.exe.\n\n**_\"Update Adobe Acrobat Reader DC\" Watering Hole & Phishing Attack Campaign_**\n\nThe decoy document \"Billing payment (Trip on 18 JULY 21-PNR ref WY115S).pdf\" used by Lorec53 in early July, with a built-in malicious link\n\npointing to a download page disguised as an Adobe Acrobat DC reader, and delivering the name \" Adobe_Acrobat_Reader_DC_update.msi\"\n\ninstaller.\n\n\n-----\n\nThe installer also releases the LorecDocStealer Trojan.\n\n_\"CV_RUSLANA\" Resume Phishing Attack_\n\nIn late July, Lorec53 sent out a phishing document named \"CV_RUSLANA.doc\".\n\nThese phishing documents were disguised as a resume, and a large number of strings were modified into garbled characters:\n\nThe visible words in the document are in Ukrainian, and the contents of the links are all Ukrainian political news. It can be speculated that the\n\ntarget of the phishing attack is Ukrainian news organizations.\n\nThe attacker uses these garbled content to trick the victim into enabling the editing function of the document, thereby executing the\n\nmalicious macro code in the document, and downloading the subsequent attack payload located at http[:]//1833.site/.\n\nIt is one of domain names commonly used by the Lorec53 group.\n\n**_\"22-7-2021 Certificate\" Phishing Attack_**\n\nIn another phishing attack similar to \"CV_RUSLANA\" resume phishing, Lorec53 organized a phishing document named \"Довiдка (22-7\n2021).doc\".\n\nThe document also contains some garbled Cyrillic content:\n\n\n-----\n\nThe built-in malicious macro in the document will download the subsequent attack payload pointed to by http[:]//1833.site/gp00973.exe.\n\n###### Other Attack Activities\n\n**_\"ir.pardakht\" Android APP Phishing Attack_**\n\nIn the first quarter of 2021, the Lorec53 group was suspected to be involved in a phishing campaign targeting Iran's Android APP.\n\nThe attack mainly used watering hole sites and an Android Trojan called Pardakht to steal SMS messages from Iranian mobile phone users,\n\nand the ultimate goal was to obtain direct economic benefits.\n\nThe scale of the attack was relatively large. NSFOCUS Security Labs found that the earliest samples of the Pardakht Trojan appeared in early\n\nJanuary 2021. According to the information of Twitter users @TavaanaTech and @BitBaanLab[v], as of July 2021, more than 800 independent\n\nPardakht Android Trojans have been downloaded.\n\nThe series of attacks were carried out through the watering hole site. In the early days, attackers would create fake pages similar to the web\n\npages of Iranian banks to trick Iranian bank users into downloading malicious Android programs provided by the watering hole site. Later, the\n\nbait themes of these phishing activities expanded to gifts, judicial content, pornographic information, low-cost or free welfare links, etc.\n\nThe Android programs distributed by these watering hole sites are Pardakht Trojan horses, which are used to steal SMS messages from users'\n\nmobile phones.\n\nThe Lorec53 group used a similar method to implement a number of secret thefts from the first quarter to the beginning of the second\n\nquarter of 2021. The Pardakht Trojans that appeared in these activities have the following icons:\n\n\n-----\n\nThe names of these apps include keywords such as \"deposit\", \"shares\", and \"query\", and the visual content displayed is mostly redirected web\n\npage information.\n\nThe information collected shows that the Lorec53 group used its assets to help the Android Trojan spread, and similar Trojan horses also\n\nappeared in a number of other network locations unrelated to the Lorec53 group.\n\nThere may be two reasons for this situation:\n\n1. The Lorec53 group is a participant in the Android APP phishing campaign, using its own network facilities and penetration capabilities to\n\nhelp expand the scale of the attack;\n\n2. The Android Trojan was provided as a commodity. The Lorec53 group purchased the Trojan and carried out an independent attack.\n\nCurrently, there is no evidence to indicate that the Lorec53 group is the developer of the Pardakht Trojan.\n\ni  https://asec.ahnlab.com/en/22481/\nii http://www.meng-model.com/en/contents/65/227.html\niii http://www.fao.org/faolex/results/details/en/c/LEX-FAOC202251\niv https://georgia.idp.arizona.edu/\nv https://twitter.com/TavaanaTech/status/1410327342627667972\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://nsfocusglobal.com/wp-content/uploads/2021/11/Analysis-Report-on-Lorec53-Group.pdf"
    ],
    "report_names": [
        "Analysis-Report-on-Lorec53-Group.pdf"
    ],
    "threat_actors": [
        {
            "id": "d18fe42c-8407-4f96-aee0-a04e6dce219a",
            "created_at": "2023-01-06T13:46:38.275292Z",
            "updated_at": "2025-03-27T02:00:02.79092Z",
            "deleted_at": null,
            "main_name": "APT12",
            "aliases": [
                "Calc Team",
                "IXESHE",
                "BRONZE GLOBE",
                "BeeBus",
                "DynCalc",
                "DNSCalc",
                "Crimson Iron",
                "NUMBERED PANDA",
                "TG-2754",
                "Group 22"
            ],
            "source_name": "MISPGALAXY:APT12",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c5f79f58-db78-4cd7-88cf-c029a2199360",
            "created_at": "2022-10-25T16:07:23.325227Z",
            "updated_at": "2025-03-27T02:02:09.738383Z",
            "deleted_at": null,
            "main_name": "APT 12",
            "aliases": [
                "APT 12",
                "BeeBus",
                "Bronze Globe",
                "CTG-8223",
                "Calc Team",
                "Crimson Iron",
                "DNSCalc",
                "DynCALC",
                "Group 22",
                "Numbered Panda"
            ],
            "source_name": "ETDA:APT 12",
            "tools": [
                "AUMLIB",
                "ETUMBOT",
                "Exploz",
                "Graftor",
                "HIGHTIDE",
                "IHEATE",
                "IXESHE",
                "RIPTIDE",
                "RapidStealer",
                "Specfix",
                "THREEBYTE",
                "bbsinfo",
                "mswab",
                "yayih"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "03a6f362-cbab-4ce9-925d-306b8c937bf1",
            "created_at": "2024-11-01T02:00:52.635907Z",
            "updated_at": "2025-03-27T02:00:55.474243Z",
            "deleted_at": null,
            "main_name": "Saint Bear",
            "aliases": [
                "Saint Bear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "Lorec53"
            ],
            "source_name": "MITRE:Saint Bear",
            "tools": [
                "OutSteel",
                "Saint Bot"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1714701927,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1637681467,
    "ts_modification_date": 1637681473,
    "files": {
        "pdf": "https://archive.orkl.eu/1e00f6c791fe7676d14aa8bac249107b3717f766.pdf",
        "text": "https://archive.orkl.eu/1e00f6c791fe7676d14aa8bac249107b3717f766.txt",
        "img": "https://archive.orkl.eu/1e00f6c791fe7676d14aa8bac249107b3717f766.jpg"
    }
}