{
    "id": "29ada6b2-1f28-4938-89e4-a6d78c5205f9",
    "created_at": "2023-01-12T15:08:20.586952Z",
    "updated_at": "2025-03-27T02:17:14.707281Z",
    "deleted_at": null,
    "sha1_hash": "b1d22e5326ab1925733bc640125f1d6be9759f97",
    "title": "2022-06-01 - CVE-2022-30190- Microsoft Support Diagnostic Tool (MSDT) RCE Vulnerability “Follina”",
    "authors": "",
    "file_creation_date": "2022-06-09T10:27:50Z",
    "file_modification_date": "2022-06-09T10:27:50Z",
    "file_size": 332268,
    "plain_text": "# CVE-2022-30190: Microsoft Support Diagnostic Tool (MSDT) RCE Vulnerability “Follina”\n\n**[fortinet.com/blog/threat-research/analysis-of-follina-zero-day](https://www.fortinet.com/blog/threat-research/analysis-of-follina-zero-day)**\n\nJune 1, 2022\n\nAt the end of last week, @nao_sec, an independent cyber security research team, tweeted\nabout a malicious Microsoft Word document submitted from Belarus that leverages remote\ntemplates to execute a PowerShell payload using the \"ms-msdt\" MSProtocol URI scheme.\nAdditional developments over the weekend identified the issue as a new unpatched\nvulnerability in Windows. A successful attack results in a remote, unauthenticated attacker\ntaking control of an affected system. A publicly available Proof-of-Concept soon followed.\n\nThis issue is referred to as “Follina’ and has a CVE assignment of CVE-2022-30190.\n\nThe name of the vulnerability is credited to security researcher Kevin Beaumont. \"Follina\"\nwas derived from his analysis of the 0-day that contained code referencing \"0438\", which is\nthe area code of Follina, Italy. Most of the time, it’s a bad sign when a vulnerability is\n\n\n-----\n\ncrowned with a unique name (having a mind-shaking logo is usually the last dagger – such\nas Heartbleed, Shellshock, and EternalBlue, but thankfully, this issue is not in the same\nleague as those.\n\nAs FortiGuard Labs is on high watch for updates and developments for CVE-2022-30190,\nthis blog intends to raise awareness of this critical vulnerability and to urge administrators\nand various organizations to take quick corrective action until Microsoft releases a patch.\n\n**Affected platforms: Microsoft Windows**\n**Impacted parties: Microsoft Windows Users**\n**Impact: Full Control of Affected Machine**\n**Severity level: Critical**\n\n## Impact Assessment\n\nThe first question you probably would ask is how bad this vulnerability is. CVE-2022-30190 is\nrated as CVSS 7.8 (Critical), and there are a number of reasons for it.\n\nThis vulnerability is in the Microsoft Support Diagnostic Tool (MSDT), a tool from Microsoft\nthat collects and sends system information back to Microsoft Support for problem\ndiagnostics, such as issues with device drivers, hardware, etc. This tool is in all versions of\nWindows, including Windows Server OS. Because of the lack of an available patch from\nMicrosoft (as of June 1 2022), machines that are not protected by endpoint software or ast,\nmitigation strategy are vulnerable to Follina.\n\nAs proof-of-concept code is publicly available, this code can be freely used by security\nresearchers, administrators, and threat actors alike. As such, attacks that leverage CVE2022-30190 are expected to increase over the next few days and weeks.\n\n[Protected View, a feature in Microsoft Office that opens Office documents in read-only mode](https://support.microsoft.com/en-us/topic/what-is-protected-view-d6f09ac7-e6b9-4495-8e43-2bbcdbcb6653)\nwith macros and other content disabled, can prevent this attack. However, reports from\nresearchers have revealed that if a document is converted to Rich Text Format (RTF) format,\nsimply previewing the document in Windows Explorer can trigger the exploit, bypassing\nProtected View. At the time of writing, Microsoft’s latest advisory has not confirmed this nor\nwhether this is another exploitation vector.\n\nOn a side note, despite using “remote” in the vulnerability name, the attack happens locally,\nand user interaction is required for the attack to work. Microsoft’s advisory calls out this point:\n“The word Remote in the title refers to the location of the attacker. This type of exploit is\nsometimes referred to as Arbitrary Code Execution (ACE). The attack itself is carried out\nlocally.”\n\nAdditionally, the vulnerability has already experienced in-the-wild attacks. As shown in the\ntimeline at the end of this blog (see Timeline), a series of initial attacks were reportedly\nobserved in March 2022 targeting the Philippines Nepal and India Additional files were\n\n\n-----\n\nsubmitted to VirusTotal from Russia and Belarus. Those attacks were most likely targeted\nattacks as the domains involved reveal little activity in our telemetry.\n\nDue to the severity of the vulnerability, the United States Cybersecurity & Infrastructure\n[Security Agency (CISA) issued an advisory on May 31 urging users and administrators tost,](https://www.cisa.gov/uscert/ncas/current-activity/2022/05/31/microsoft-releases-workaround-guidance-msdt-follina-vulnerability)\napply necessary workarounds as soon as possible.\n\n## Exploit\n\nThe vulnerability that exists within msdt.exe is the Microsoft Support Diagnostic Tool.\nNormally, this tool is used to diagnose faults with the operating system and then report and\nprovide system details back to Microsoft Support.\n\nFigure 1. The Microsoft Support Diagnostic Tool as is meant to be seen.\n\nThe vulnerability allows a malicious actor to effectively execute arbitrary code with the same\nprivileges as the application calling it. As has been the case with the original reporting of this\nfrom @nao_sec and subsequent experimentation in the wider security community, the calling\napplication is quite often a tool in Microsoft Office (Word, Excel, Outlook, etc.).\n\n[The original document and subsequent HTML file can be found here and](https://www.virustotal.com/gui/file/4a24048f81afbe9fb62e7a6a49adbd1faf41f266b5f9feecdceb567aec096784/detection) [here.](https://www.virustotal.com/gui/file/8e986c906d0c6213f80d0224833913fa14bc4c15c047766a62f6329bfc0639bd)\n\nFigure 2. Original OLE object showing the download location of the subsequent HTML file.\n\nAs shown in Figure 2, the document found by @nao_sec used an embedded OLE Object\ninside a Word document that was modified to call an external website to download an HTML\ndocument. This document then invoked msdt.exe, followed by several PowerShell\ncommands.\n\nFigure 3. HTML file invoking MSDT.\n\nFigure 3 shows the original HTML payload, which required several lines with the letter 'A'\n(61) to be commented out of the script in order to execute. MSDT was then invoked using\ncharacter and Base64 encoding to obfuscate the actual command.\n\nFigure 4. Decoded command.\n\nMany further examples have been uploaded to VirusTotal that invoke Calc and other benign\nWindows tools as a method to test the vulnerability without causing damage.\n\n## Active Exploitation\n\nThe TA413 APT group, a hacking outfit linked to Chinese state interests, has adopted this\nvulnerability in attacks against the international Tibetan community. As observed on May 30\nby security researchers, threat actors are now using CVE-2022-30190 exploits to execute\n\n\n-----\n\nmalicious code via the MSDT protocol when targets open or preview Word documents\ndelivered in ZIP archives. Campaigns have impersonated the 'Women Empowerments Desk'\nof the Central Tibetan Administration and use the domain tibet-gov.web[.]app.\n\nThe security researchers also spotted DOCX documents with Chinese filenames being used\nto install malicious payloads detected as password-stealing Trojans via \"hxxp://coolrat[.]xyz\".\n\nAt the time of writing, researchers have discovered limited exploitation of the vulnerability in\nthe wild. One instance of active exploitation of 'Follina' was conducted by Chinese APT actor\n'TA413'.\n\n## Attack Vector\n\nAt the time of this writing, all known attacks used Microsoft Word document files that were\nmost likely delivered via email. Theoretically, any applications that allow an OLE object to be\nembedded would be a viable execution mechanism.\n\n## In the Wild Attack\n\nOne of the real-world attacks that leverage CVE-2022-30190 is a Microsoft Word file\nsubmitted to VirusTotal from Saudi Arabia on June 1 (SHA2:st\n248296cf75065c7db51a793816d388ad589127c40fddef276e622a160727ca29), which\nMalwareHunterTeam posted in a tweet:\n\nFigure 5. Malicious Word file that was used in an attack leveraging CVE-2022-30190.\n\nThe doc file retrieves an HTML file from 212[.]138[.]130[.]8/analysis.html, which abuses\nMSDT to fetch the next stage payload “svchost.exe” from a remote location and then execute\nit.\n\nFigure 6. Contents of retrieved analysis.html\n\n## Payload Analysis\n\nThe Saudi Arabian DOCX document eventually leads to the download and execution of an\nexecutable. This executable (SHA256:\n4DDA59B51D51F18C9071EB07A730AC4548E36E0D14DBF00E886FC155E705EEEF) is a\nvariant of Turian, which was analyzed by ESET\n(https://www.welivesecurity.com/2021/06/10/backdoordiplomacy-upgrading-quarian-turian/)\nalmost a year ago. This current variant uses the same one-byte XOR key (0xA9) as the\npreviously analyzed Turian sample.\n\nFigure 7. XOR key 0xA9 used for decryption\n\n\n-----\n\nThis sample also has the functionality to try and determine what role the infected computer\nplays in the domain.\n\nFigure 8. Functionality to determine domain role\n\nSimilar to the old Turian sample, this variant uses the same headers to connect to the C2\nserver.\n\nFigure 9. Connection headers\n\nThis sample creates “tmp.bat”, which is used to set RUN keys in the registry for persistence\npurposes.\n\nFigure 10. Content of the”tmp.bat” file\n\nNote the mixed usage of upper and lowercase letters, which is the same as the old Turian\nsample.\n\nThis latest variant uses www[.]osendata[.] com as its C2 server.\n\nAnother Turian sample similar to this latest variant has a SHA256 hash of\n34DC42F3F486EC282C5E3A16D81A377C2F642D87994AE103742DF5ED5804D0F7 and a\nC2 server of www[.]tripinindian[.]com.\n\n## Mitigation\n\n[Microsoft has provided the following mitigation steps in a blog posted on May 30, 2022.th](https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/)\n\nCISA also [urged admins and users to disable the MSDT protocol on their Windows devices](https://www.cisa.gov/uscert/ncas/current-activity/2022/05/31/microsoft-releases-workaround-guidance-msdt-follina-vulnerability)\nafter Microsoft reported active exploitation of this vulnerability in the wild.\n\n### Disabling the MSDT URL Protocol:\n\nDisabling the MSDT URL protocol prevents troubleshooters from being launched as links,\nincluding links throughout the operating system. Troubleshooters can still be accessed using\nthe Get Help application and in System Settings as other or additional troubleshooters.\nFollow these steps to disable:\n\n1. Run Command Prompt as Administrator.\n2. To back up the registry key, execute the command “reg export\n\nHKEY_CLASSES_ROOT\\ms-msdt filename“\n3. Execute the command “reg delete HKEY_CLASSES_ROOT\\ms-msdt /f”.\n\nFigure 11. ms-msdt in Registry Editor\n\nHow to undo the workaround\n\n\n-----\n\n1. Run Command Prompt as Administrator.\n2. To restore the registry key, execute the command “reg import filename”\n\n## Timeline\n\nTimeline of CVE-2022-30190 based on information gathered by FortiGuard Labs: (updated\n_June 2)_\n\n**Year** **Month/Date** **Event**\n\n2022 April 12th crazyman_army with an APT hunting\nteam “Shadow Chaser\nGroup,” [reported the vulnerability to](https://twitter.com/CrazymanArmy/status/1531120929321152512)\nMicrosoft. The report was based on a\nWord document file that appears to\nhave been used in a real attack\ntargeting Russia.\n\n\nApril\n21st\n\nMay\n27th\n\nMay\n30th\n\n\nMicrosoft determined that it was not a\nsecurity-related issue.\n\n[nao_sec, an independent cyber security](https://nao-sec.org/)\n[research team, tweeted about a malicious](https://twitter.com/nao_sec/status/1530196847679401984)\nMicrosoft Word document file submitted\nfrom Belarus that leverages remote\ntemplates to execute the PowerShell\npayload using the \"ms-msdt\" MSProtocol\nURI scheme.\n\nKevin Beaumont, a security\nresearcher known as GossiTheDog,\n[posted a blog citing that this is an](https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e)\nunpatched vulnerability.\nCVE-2022-30190 was assigned to\nthe vulnerability.\n\n\n## Conclusion\n\nCVE-2022-30190 has the potential to have significant impact due to its ease of exploitation\nand ability to bypass Protected View, along with the availability of new PoC code and the\nlack of a security fix. Administrators and users should monitor updates from Microsoft and\napply the patch as soon as it becomes available. Until then, mitigation should be applied as\nsoon as possible.\n\n\n-----\n\n## Fortinet Protection\n\nThe FortiGuard Antivirus service detects and blocks files associated with CVE-2022-30190\nwith the following signatures:\n\nHTML/CVE_2022_30190.A!tr\n\nMSWord/Agent.2E52!tr.dldr\n\nMSWord/CVE20170199.A!exploit\n\nRiskware/RemoteShell.\n\nRegarding IPS coverage, the following signature will detect the retrieval of remote HTML files\nthat contain the MSDT command:\n\nMS.Office.MSHTML.Remote.Code.Execution.\n\nThe FortiGuard Content Disarm and Reconstruction (CDR) service can detect the attack in\nreal-time and prevent it by disarming the \"oleobject\" data from Microsoft Office files.\n\nAll relevant URLs have been rated as \"Malicious Websites\" by the FortiGuard Web Filtering\nservice.\n\nFor a comprehensive list of Fortinet technologies that prevent exploitation of CVE-2022[30190, please refer to our Outbreak Alert Service page, “MSDT Follina.”](https://www.fortiguard.com/outbreak-alert/msdt-follina)\n\nAs these attacks require user interaction, it is also suggested that organizations regularly\nschedule user awareness and training simulations on how to spot a social engineering\nattack. Fortinet has multiple solutions designed to train users on how to understand and\ndetect phishing threats:\n\nFortiEDR detects post-exploitation behavior associated with the CVE-2022-30190\nvulnerability. A KB article detailing how FortiEDR can mitigate this issue can be found [here.](https://community.fortinet.com/t5/FortiEDR/Technical-Tip-How-FortiEDR-protects-against-CVE-2022-30190/ta-p/213530)\n\n[We suggest that organizations have their end users go through our FREE NSE training:](https://training.fortinet.com/?utm_source=blog&utm_campaign=nse-institute) NSE\n1 – Information Security Awareness. It includes a module on Internet threats to train endusers on how to identify and protect themselves from phishing attacks.\n\nIn addition, the [FortiPhish Phishing Simulation Service uses real-world simulations to help](https://www.fortinet.com/products/phishing-simulation)\norganizations test user awareness and vigilance to phishing threats and train and reinforce\nproper practices when users encounter targeted phishing attacks.\n\n## IOCs\n\n### Files:\n\n\n-----\n\n710370f6142d945e142890eb427a368bfc6c5fe13a963f952fb884c38ef06bfa\n\nfe300467c2714f4962d814a34f8ee631a51e8255b9c07106d44c6a1f1eda7a45\n\n3db60df73a92b8b15d7885bdcc1cbcf9c740ce29c654375a5c1ce8c2b31488a1\n\n4a24048f81afbe9fb62e7a6a49adbd1faf41f266b5f9feecdceb567aec096784\n\nd118f2c99400e773b8cfd3e08a5bcf6ecaa6a644cb58ef8fd5b8aa6c29af4cf1\n\n764a57c926711e448e68917e7db5caba988d3cdbc656b00cd3a6e88922c63837\n\n8e986c906d0c6213f80d0224833913fa14bc4c15c047766a62f6329bfc0639bd\n\ne8f0a2f79a91587f1d961d6668792e74985624d652c7b47cc87367cb1b451adf\n\n4369f3c729d9bacffab6ec9a8f0e582b4e12b32ed020b5fe0f4c8c0c620931dc\n\n1f245b9d3247d686937f26f7c0ae36d3c853bda97abd8b95dc0dfd4568ee470b\n\nbf10a54348c2d448afa5d0ba5add70aaccd99506dfcf9d6cf185c0b77c14ace5\n\nc0c5bf6fe1d3b23fc89e0f8b352bd687789b5083ca6d8ec9acce9a9e2942be1f\n\n248296cf75065c7db51a793816d388ad589127c40fddef276e622a160727ca29\n\nd61d70a4d4c417560652542e54486beb37edce014e34a94b8fd0020796ff1ef7\n\n4f11f567634b81171a871c804b35c672646a0839485eca0785db71647a1807df\n\n### URL(s):\n\nsputnikradio[.]net\n\nxmlformats[.]com\n\nexchange[.]oufca[.]com[.]au\n\n141[.]98[.]215[.]99\n\ntibet-gov[.]web[.]app\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-01 - CVE-2022-30190- Microsoft Support Diagnostic Tool (MSDT) RCE Vulnerability “Follina”.pdf"
    ],
    "report_names": [
        "2022-06-01 - CVE-2022-30190- Microsoft Support Diagnostic Tool (MSDT) RCE Vulnerability “Follina”.pdf"
    ],
    "threat_actors": [
        {
            "id": "709ceea7-db99-405e-b5a7-a159e6c307e0",
            "created_at": "2022-10-25T16:07:23.373699Z",
            "updated_at": "2025-03-27T02:02:09.768341Z",
            "deleted_at": null,
            "main_name": "BackdoorDiplomacy",
            "aliases": [],
            "source_name": "ETDA:BackdoorDiplomacy",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3b56d733-88da-4394-b150-d87680ce67e4",
            "created_at": "2023-01-06T13:46:39.287189Z",
            "updated_at": "2025-03-27T02:00:03.040775Z",
            "deleted_at": null,
            "main_name": "BackdoorDiplomacy",
            "aliases": [
                "BackDip",
                "CloudComputating",
                "Quarian"
            ],
            "source_name": "MISPGALAXY:BackdoorDiplomacy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9792e41f-4165-474b-99fa-e74ec332bd87",
            "created_at": "2023-01-06T13:46:38.986789Z",
            "updated_at": "2025-03-27T02:00:02.970288Z",
            "deleted_at": null,
            "main_name": "Lucky Cat",
            "aliases": [
                "White Dev 9",
                "TA413"
            ],
            "source_name": "MISPGALAXY:Lucky Cat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3b1367ff-99dc-41f0-986f-4a1dcb41bbbf",
            "created_at": "2022-10-25T16:07:24.273478Z",
            "updated_at": "2025-03-27T02:02:10.157226Z",
            "deleted_at": null,
            "main_name": "TA413",
            "aliases": [
                "White Dev 9"
            ],
            "source_name": "ETDA:TA413",
            "tools": [
                "Exile RAT",
                "ExileRAT",
                "Sepulcher"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "17b1b76b-16da-4c4f-8b32-f6fede3eda8c",
            "created_at": "2022-10-25T16:07:23.750796Z",
            "updated_at": "2025-03-27T02:02:09.961401Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "APT 15",
                "BackdoorDiplomacy",
                "Bronze Davenport",
                "Bronze Idlewood",
                "Bronze Palace",
                "CTG-9246",
                "GREF",
                "Ke3chang",
                "Metushy",
                "Nylon Typhoon",
                "Operation Ke3chang",
                "Operation MirageFox",
                "Playful Dragon",
                "Playful Taurus",
                "Red Vulture",
                "Royal APT",
                "Social Network Team",
                "Vixen Panda"
            ],
            "source_name": "ETDA:Ke3chang",
            "tools": [
                "Agentemis",
                "Anserin",
                "BS2005",
                "BleDoor",
                "CarbonSteal",
                "Cobalt Strike",
                "CobaltStrike",
                "DarthPusher",
                "DoubleAgent",
                "EternalBlue",
                "GoldenEagle",
                "Graphican",
                "HenBox",
                "HighNoon",
                "IRAFAU",
                "Ketrican",
                "Ketrum",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MS Exchange Tool",
                "Mebroot",
                "Mimikatz",
                "MirageFox",
                "NBTscan",
                "Okrum",
                "PluginPhantom",
                "PortQry",
                "ProcDump",
                "PsList",
                "Quarian",
                "RbDoor",
                "RibDoor",
                "Royal DNS",
                "RoyalCli",
                "RoyalDNS",
                "SAMRID",
                "SMBTouch",
                "SilkBean",
                "Sinowal",
                "SpyWaller",
                "Theola",
                "TidePool",
                "Torpig",
                "Turian",
                "Winnti",
                "XSLCmd",
                "cobeacon",
                "nbtscan",
                "netcat",
                "spwebmember"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "401a2035-ed5a-4795-8e37-8b7465484751",
            "created_at": "2022-10-25T15:50:23.616232Z",
            "updated_at": "2025-03-27T02:00:55.506403Z",
            "deleted_at": null,
            "main_name": "BackdoorDiplomacy",
            "aliases": [
                "BackdoorDiplomacy"
            ],
            "source_name": "MITRE:BackdoorDiplomacy",
            "tools": [
                "Turian",
                "China Chopper",
                "Mimikatz",
                "NBTscan",
                "QuasarRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536100,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1654770470,
    "ts_modification_date": 1654770470,
    "files": {
        "pdf": "https://archive.orkl.eu/b1d22e5326ab1925733bc640125f1d6be9759f97.pdf",
        "text": "https://archive.orkl.eu/b1d22e5326ab1925733bc640125f1d6be9759f97.txt",
        "img": "https://archive.orkl.eu/b1d22e5326ab1925733bc640125f1d6be9759f97.jpg"
    }
}