{
    "id": "29adc94a-0ed0-480c-90a5-37272bba9166",
    "created_at": "2023-01-12T15:03:58.742371Z",
    "updated_at": "2025-03-27T02:13:47.787346Z",
    "deleted_at": null,
    "sha1_hash": "798281d4a0716e29d71f447aaf819f6b222ae8ea",
    "title": "2021-09-17 - Falcon OverWatch Hunts Down Adversaries Where They Hide",
    "authors": "",
    "file_creation_date": "2022-05-28T23:16:01Z",
    "file_modification_date": "2022-05-28T23:16:01Z",
    "file_size": 1458933,
    "plain_text": "# 4 Popular Defensive Evasion Techniques in 2021\n\n**[crowdstrike.com/blog/four-popular-defensive-evasion-techniques-in-2021/](https://www.crowdstrike.com/blog/four-popular-defensive-evasion-techniques-in-2021/)**\n\nFalcon OverWatch Team September 17, 2021\n\nThere is an endless struggle between hunters and adversaries. As soon as hunters shine a\nlight on the latest malicious activities, adversaries pivot and find a new way to hide in the\nshadows. Indeed, of all the MITRE ATT&CK® tactic groups, defense evasion stands out as\nhaving by far the most extensive array of techniques and subtechniques. Whether these\ntechniques are used to enable a “low and slow” strategic intrusion or to evade technologybased detections in a “smash and grab” attack, defense evasion is a critical step in\nadversaries’ kill-chain.\n\n[This blog explores four popular defense evasion techniques that the Falcon OverWatch™](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)\nteam has seen in use by adversaries in 2021. It shares real-world examples of how\nOverWatch has observed these techniques and sub-techniques used by adversaries to\nsubvert security controls and operate in a covert manner, and it provides guidance on how\ndefenders can begin to look for the activity themselves.\n\n## 1. Signed Binary Proxy Execution: Rundll32\n\n### Technique Overview\n\n\n-----\n\nSigned binary proxy execution leverages legitimate built-in utilities to execute malicious\ncommands. Adversaries take advantage of trusted and commonly used utilities that are\nsigned with digital certificates to proxy the execution of malicious binaries. This example\nlooks at the use of [Rundll32.](https://attack.mitre.org/techniques/T1218/011/)\n\n### OverWatch Perspective\n\nThe anomalous use of `rundll32.exe, coupled with irregular process activity and a burst of`\nsuspicious command line invocations, alerted OverWatch to potentially malicious activity.\nDeeper analysis confirmed the malicious activity and linked it to the prolific eCrime adversary\nWIZARD SPIDER. The adversary gained initial remote access after a phishing document\nwas opened, resulting in arbitrary code execution under a productivity application, and\nproviding the adversary with interactive access to a valid user account. Additionally, the code\nexecution led to `rundll32.exe being used to write a Cobalt Strike DLL to disk, allowing`\nWIZARD SPIDER further capabilities to compromise the host.\n\nOnce WIZARD SPIDER established interactive access, they wrote a further malicious DLL\nfile to disk. They then used the below command to proxy the execution of the DLL through a\nsecond `rundll32.exe process.`\n\n```\nC:\\Windows\\System32\\rundll32.exe test.dll, test\n\n```\n\nThe malicious DLL spawned a child process of `rundll32.exe that was used to interact`\nwith `explorer.exe . WIZARD SPIDER performed host reconnaissance activity under the`\ntrusted `explorer.exe process. OverWatch notified the victim organization in the early`\nstages of this intrusion and armed them with the information needed to disrupt the adversary\nbefore they could move deeper into the network or execute any ransomware payloads.\n\nFigure 1. Execution of a malicious DLL via rundll32.exe, leading to injected threads into Explorer.exe and\n\ncovert reconnaissance operations\n\n\n-----\n\nA consistent theme of this intrusion activity is WIZARD SPIDER’s efforts to conceal their\noperations by operating under legitimate signed processes. While the victim organization\nwas containing the host in response to the OverWatch notification, threat hunters observed\nthe adversary continuing to conduct host and network enumeration activities consistent with\nearly stage ransomware preparation operations. Ultimately, the rapid identification of the\nactivity by OverWatch threat hunters led to the timely delivery of an actionable notification to\nthe victim organization. This enabled them to quickly act to both contain and subsequently\neradicate WIZARD SPIDER from the network before they could achieve their mission\nobjectives.\n\n### Defensive Recommendations\n\n**Maintain a baseline of “known good” command line arguments, especially those**\nassociated with signed binaries such as `installutil.exe,` `msbuild.exe,`\n```\n   mshta.exe and rundll32.exe .\n\n```\n**Remain alert to instances of productivity applications interacting suspiciously**\n**with system processes, as adversaries may inject a phishing payload into**\n```\n   rundll32.exe . Inspecting file changes made by these utilities is also a great way to\n\n```\ncheck for possible malicious use of signed binaries.\n**Familiarize yourself with the command line operators that adversaries can**\n**invoke in a malicious** `rundll32.exe function call. Additional operators can enable`\nadversaries to modify or acquire files, or even execute arbitrary code such as\nJavascript.\n**Monitor file paths associated with DLLs being executed by** `rundll32.exe . For`\nexample, observing a DLL loaded from a suspicious path such as `%Temp% would be`\nhighly unusual for most environments.\n\n## 2. Hijack Execution Flow: DLL Search Order Hijacking\n\n### Technique Overview\n\n[DLL Search Order Hijacking takes advantage of how Windows handles DLLs and the search](https://attack.mitre.org/techniques/T1574/001/)\norder it uses to locate DLLs for loading into a program. Adversaries can hijack this search\norder mechanic to load a malicious DLL into a program in an attempt to bypass security\ncontrols.\n\n### OverWatch Perspective\n\nOverWatch exposed the use of this technique by a likely China-nexus adversary. The\nadversary was discovered operating under a valid user account, having gained access by\nsetting scheduled tasks via an RDP session. The adversary used Certutil commands to\ndecode and execute binaries via a batch script. They also attempted to install a PlugX\nimplant using DLL search order hijacking in conjunction with a legitimate third-party antivirus\n\n\n-----\n\nexecutable and a weaponized DLL. The attacker had modified this DLL to perform\nreconnaissance and connectivity testing under the legitimate Windows Service Host process,\n```\nsvchost.exe .\n\n```\n```\ncertutil -f -decode C:\\Programdata\\1.txt C:\\ProgramData\\<REDACTED>.exe\n\n```\n```\ncertutil -f -decode C:\\Programdata\\2.txt C:\\ProgramData\\<REDACTED>.dll\n\n```\n\nOverWatch quickly uncovered this malicious activity by surfacing unusual execution of\n```\ncertutil commands, along with attempts to set remote scheduled tasks and a range of\n\n```\nsystem discovery activity.\n\nFigure 2. PlugX installation following DLL search order hijacking using a legitimate antivirus software\n\nbinary and a malicious DLL file\n\n### Defensive Recommendations\n\n**Look for any unusual process spawn events — context is key here, and it is**\n**important for defenders to not view events in isolation. Know which system events**\nspawn following a known-good execution and search for any changes in this behavior.\nNote that adversaries may download programs to perform this attack if there is not a\nsuitable option on the host.\n**Analyze exported functions to understand the DLL’s capabilities and which**\n**subsequent system calls you can expect from a given application. It is also**\nimportant to look for any DLLs that have the same file name but abnormal file paths.\n\n\n-----\n\n**Investigate changes to manifest files, such as anomalous modification or**\n**creation times. Legitimate manifest files sometimes also include the hash of the**\nlegitimate DLL file, and therefore adversaries may target these files to alter or remove\nthis protection in preparation for DLL search order hijacking.\n\nBe aware that adversaries will often use legitimate software such as Process Monitor to\nidentify applications vulnerable to DLL search order hijacking by looking for DLLs being\nloaded without a full path being specified. It is therefore important to search for any DLL\nchanges or suspicious process activity that occurs in parallel with a burst of reconnaissance\nor unknown network connections.\n\n## 3. Process Injection: DLL Injection\n\n### Technique Overview\n\n[The DLL injection technique enables adversaries to inject code from a malicious DLL and](https://attack.mitre.org/techniques/T1055/001/)\nexecute it under the context of a target process. With this technique, adversaries are able to\nharness the process’s resources to perform malicious operations, all while being associated\nwith a legitimate process. Process injection is a valuable technique for an attacker as it\nallows for the execution of code within the memory space of legitimate processes. This\nmakes detection challenging as malicious use of native Windows API behavior is generally\nquite difficult to distinguish from legitimate API functions.\n\n### OverWatch Perspective\n\nDLL injection was deployed in the early stages of an attempted ransomware operation, which\naligns with activity previously attributed to WIZARD SPIDER. This intrusion took place in the\nwake of a successful [phishing attack. Various malicious files were written to disk, including](http://crowdstrike.com/cybersecurity-101/phishing/)\nmultiple executables and a DLL file, each masquerading as legitimate browser files. Analysis\nshowed that the DLL file was intended to provide a means of performing process injection,\nand the executables allowed for subsequent reconnaissance and command and control in\npreparation for ransomware deployment.\n\nAs seen below, once the malicious DLL file was executed, the entry point “Mars” was\nlocated, and the associated code was launched, allowing injection and reconnaissance to be\nperformed. From there, OverWatch identified communication with multiple processes,\nincluding terminal services that the adversary likely intended to use for further hands-on\ncommand execution.\n\n```\nC:\\WINDOWS\\system32\\cmd.exe /C rundll32 <REDACTED>.dll, Mars\n\n```\n\nOverWatch recognized suspicious remote threads being created alongside irregular process\ntree activity and suspicious reconnaissance activity. Any one of these on their own may have\nbeen dismissed, but analyzed together they paint a clear picture of a hands-on intrusion.\n\n\n-----\n\nOverWatch was able to leverage this aggregate view to rapidly identify and escalate the\nintrusion to the victim organization, which in turn enabled the victim to contain the adversary\nbefore they could complete their mission.\n\nFigure 3. DLL injection leading to injected threads into various processes for reconnaissance and C2\n\noperations\n\n### Defensive Recommendations\n\n**Investigate inconsistencies with typical execution, such as processes**\n**performing unknown network connections or reading/writing files to disk. It can**\nalso help to look for instances where processes load unknown or abnormal DLLs\nduring runtime. Furthermore, concomitant network connections or communication\nbetween additional internal endpoints may be an indication of post-compromise\ncommand and control traffic.\n**Review API calls associated with suspicious processes. VirtualAllocEx and**\nWriteProcessMemory are examples of APIs that are often leveraged by adversaries to\ntamper with process memory and perform DLL Injection. Preventing this activity is\ndifficult because limiting access to APIs may prevent legitimate software from\nfunctioning. It is therefore important to leverage human analysts to dig into this activity.\n\n## 4. BITS Jobs\n\n\n-----\n\n### Technique Overview\n\nWindows Background Intelligent Transfer Service (BITS) is a file transfer mechanism used\n[by some applications to transfer files using only idle bandwidth. BITS jobs are used to](https://attack.mitre.org/techniques/T1197/)\nschedule these file transfers and can be used by adversaries to download and execute files.\nBITS jobs are appealing to adversaries trying to covertly upload or download files because\nthey are ubiquitous within many environments and commonly used in a legitimate\nadministrative context.\n\n### OverWatch Perspective\n\nThe next example also examines WIZARD SPIDER activity, which reflects just how prolific\nthis group has been in the past year, and the variety of techniques they have used. In this\nintrusion, OverWatch observed WIZARD SPIDER using BITS jobs during an attempted Ryuk\nransomware deployment.\n\nThe following command line highlights one such attempt to use BITS jobs to push the Ryuk\nransomware binary. WIZARD SPIDER scheduled the operation using BITSadmin, the tool\nused to create BITS transfer jobs. In this case, it is likely that WIZARD SPIDER intended to\ninfect the domain controllers to improve their chances of extracting payment.\n```\ncmd.exe /c bitsadmin /transfer <REDACTED> \\\\10.<REDACTED>\\share$\\<REDACTED>.exe\nC:\\Users\\<REDACTED>\\AppData\\Roaming\\<REDACTED>.exe\n\n```\nDuring this intrusion, WIZARD SPIDER appeared to focus on a distinct set of objectives and\nset scheduled tasks to attempt this BITSadmin transfer of Ryuk routinely using Windows\nManagement Instrumentation (WMI). WMI is often seen during hunting operations as a way\nfor adversaries to perform local and remote command execution. This is also another\nexample of a native tool used in normal operations by administrators, a further indication of\ntheir comfort in using native tools to carry out their intrusion.\n\nOverWatch identified this activity due to observing globally rare BITS transfer commands\nalongside anomalous administrative tool usage, one of which was WMIC. When it comes to\nisolating potentially malicious tool usage under valid accounts, human hunters are best\nplaced to investigate the surrounding context that helps distinguish between what could be\nlegitimate or illegitimate.\n\n### Defensive Recommendations\n\n**Routinely investigate BITS activity and instances of command line transfers.**\nSystem logs and the BITS job database are rich hunting grounds — it is crucial to\nvalidate which tasks are scheduled and if there are any unknown jobs. BITS jobs can\nalso be invoked using PowerShell, so logs such as the ScriptBlockText log can be a\nuseful place for identifying BITS requests.\n\n\n-----\n\n**Be mindful that BITS jobs will almost never be blocked as they are required for**\n**Windows updates. Monitoring network connections associated with BITS jobs to gain**\ninsights into potential abuse of BITS jobs and bitsadmin.exe.\n**Hunt regularly, as BITS jobs can be scheduled for up to 90 days, and adversaries**\n**have been known to prepare transfer tasks to run at a later date. It is also**\nimportant to ensure appropriate logging is available to enable detailed analysis of BITS\njobs.\n**Analyze the file paths involved in BITS activity and check for signs of the**\n**adversary manipulating the query strings to evade detection or potentially using**\n**encoding to obfuscate their requests.**\n**Look for instances of unapproved software usage and analyze any existing**\n**programs that could be leveraged to transfer code internally. Adversaries actively**\nlook for built-in utilities that can be used to configure malicious commands. Some\nfrequently used utilities in addition to BITS include scheduled tasks on Windows\nsystems and cron and nohup on Linux systems. Third-party tooling can also be used to\nconfigure tasks and transfer jobs.\n\n## Conclusion\n\nSo far this year, OverWatch has identified more than 60 defense evasion techniques and\nsubtechniques being used by adversaries in the wild during interactive intrusions. These\ntechniques are explicitly designed to evade technology-based defenses, and as seen in the\nexamples explored here, they leverage native utilities in an attempt to blend in with expected\nactivity.\n\nThe [OverWatch SEARCH methodology draws together human expertise, systematic](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)\nprocesses and world-class technology to continuously refine hunting activity and stay a step\nahead of the threat. In combination, these elements enable OverWatch to quickly effectively\nidentify covert activity and notify victims in near real time.\n\nA crucial step in the SEARCH methodology is “Hone” — the stage at which new hunting\nfindings are operationalized as hunting leads or fed back into the platform as detections to\ndrive continuous improvement. Each new find paints a clearer picture of adversary activity\nand enables threat hunters to redouble their efforts hunting for evasive techniques that\ncannot be found by technology alone. OverWatch recommends that defenders employ a\nsystemic approach — such as the SEARCH methodology — to derive maximum value from\nhunting efforts.\n\nWith such a wide variety of defense evasion techniques at adversaries’ disposal, it is critical\nfor defenders to remain informed of the techniques that adversaries are currently using to try\nto hide in victim environments.\n\n**Additional Resources**\n\n\n-----\n\n_Read about the latest trends in threat hunting and more in the 2021 Threat Hunting_\n_Report._\n_[Learn more about Falcon OverWatch proactive managed threat hunting.](https://www.crowdstrike.com/endpoint-security-products/falcon-overwatch-threat-hunting/)_\n_[Watch this video to see how Falcon OverWatch proactively hunts for threats in your](https://www.crowdstrike.com/resources/videos/falcon-overwatch-proactively-hunts-threats-environment/)_\n_environment._\n_[Read more about how hunting part-time is simply not enough in this CrowdStrike blog.](https://www.crowdstrike.com/blog/the-myth-of-part-time-threat-hunting-part-1/)_\n_[Learn more about the CrowdStrike Falcon® platform by visiting the product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_\n_[Test CrowdStrike next-gen AV for yourself. Start your free trial of Falcon Prevent™](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_today._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-17 - Falcon OverWatch Hunts Down Adversaries Where They Hide.pdf"
    ],
    "report_names": [
        "2021-09-17 - Falcon OverWatch Hunts Down Adversaries Where They Hide.pdf"
    ],
    "threat_actors": [
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535838,
    "ts_updated_at": 1743041627,
    "ts_creation_date": 1653779761,
    "ts_modification_date": 1653779761,
    "files": {
        "pdf": "https://archive.orkl.eu/798281d4a0716e29d71f447aaf819f6b222ae8ea.pdf",
        "text": "https://archive.orkl.eu/798281d4a0716e29d71f447aaf819f6b222ae8ea.txt",
        "img": "https://archive.orkl.eu/798281d4a0716e29d71f447aaf819f6b222ae8ea.jpg"
    }
}