{
    "id": "29cfcf95-bdbd-49cd-86e4-6a1d22b2660b",
    "created_at": "2023-01-12T15:07:09.421489Z",
    "updated_at": "2025-03-27T02:15:41.76074Z",
    "deleted_at": null,
    "sha1_hash": "9f6dbe07b6403546e8d04ee3696d5b4bebb8aadf",
    "title": "2018-05-25 - Analysis of CVE-2018-8174 VBScript 0day and APT actor related to Office targeted attack",
    "authors": "",
    "file_creation_date": "2022-05-28T21:56:54Z",
    "file_modification_date": "2022-05-28T21:56:54Z",
    "file_size": 3043401,
    "plain_text": "# Analysis of CVE-2018-8174 VBScript 0day and APT actor related to Office targeted attack\n\n**[blog.360totalsecurity.com/en/analysis-cve-2018-8174-vbscript-0day-apt-actor-related-office-targeted-attack/](https://blog.360totalsecurity.com/en/analysis-cve-2018-8174-vbscript-0day-apt-actor-related-office-targeted-attack/)**\n\nMay 25, 2018\n\nMay 25, 2018360TS\n\n[Tweet](https://twitter.com/share)\n\n[Learn more about 360 Total Security](https://www.360totalsecurity.com/en/)\n\n## I Overview\n\nRecently, the Advanced Threat Response Team of 360 Core Security Division detected an APT\nattack exploiting a 0-day vulnerability and captured the world’s first malicious sample that uses\na browser 0-day vulnerability. We code named the vulnerability as “double kill” exploit. This\nvulnerability affects the latest version of Internet Explorer and applications that use the IE\nkernel. When users browse the web or open Office documents, they are likely to be potential\ntargets. Eventually the hackers will implant backdoor Trojan to completely control the computer.\nIn response, we shared with Microsoft the relevant details of the 0day vulnerability in a timely\nmanner. This APT attack was analyzed and attributed upon the detection and we now\nconfirmed its association with the APT-C-06 Group.\n\nOn April 18, 2018, as soon as 360 Core Security detected the malicious activity, we contacted\nMicrosoft without any delay and submitted relevant details to Microsoft. Microsoft confirmed\nthis vulnerability on the morning of April 20th and released an official security patch on May\n8th. Microsoft has fixed the vulnerability and named it CVE-2018-8174. After the vulnerability\nwas properly resolved, we published this report on May 9th, along with further technical\ndisclosure of the attack and the 0day.\n\n## II Affection in China\n\nAccording to the sample data analysis, the attack affected regions in China are mainly\ndistributed in provinces that actively involved in foreign trade activities.Victims include trade\nagencies and related organizations.\n\n## III Attack Procedure Analysis\n\nThe lure documents captured in this attack are in Yiddish[1] The attackers exploit office with\nOLE autolink objects (CVE-2017-0199) to embed the documents onto malicious websites. All\nthe exploits and malicious payload were uploaded through remote servers.\n\n_[1]The language is automatically identified by Google Translate_\n\n\n-----\n\n_Notification in the pop-up window:_\n\n_Links to this document may reference other files. Do you want to update this document with the_\n_data in the linked file?_\n\nOnce victims opened the lure document, Word will firstly visit a remote website of IE vbscript\n0day (CVE-2018-8174) to trigger the exploit. Afterwards, Shellcode will be running to send\nseveral requests to get payload from remote servers. The payload will then be decrypted for\nfurther attack.\n\nWhile the payload is running, Word will release three DLL backdoors locally. The backdoors will\nbe installed and executed through PowerShell and rundll32. UAC bypass was used in this\nprocess, as well as file steganography and memory reflection uploading, in order to bypass\ntraffic detection and to complete loading without any files.\n\n\n-----\n\nThe main process of the attack is shown in the following figure:\n\n\n-----\n\n## IV IE VBScript 0day (CVE-2018-8174)\n\n### 1. Timeline\n\n\n-----\n\nOn April 18, 2018, Advanced Threat Response Team of 360 Core Security Division detected a\nhigh-risk 0day vulnerabilities. The vulnerability affects the latest version of Internet Explorer\nand applications that use the IE kernel and has been found to be used for targeted APT\nattacks. On the same day, 360 immediately communicated with Microsoft and submitted details\nof the vulnerability to Microsoft. Microsoft confirmed this vulnerability on the morning of April\n20th and released an official security patch on May 8th. The 0day vulnerability was fixed and it\nwas named CVE-2018-8174.\n\nCVE-2018-8174 is a remote code execution vulnerability of Windows VBScript engine.\nAttackers can embed malicious VBScript to Office document or website and then obtain the\ncredential of the current user, whenever the user clicks, to execute arbitrary code.\n\n### 2. Vulnerability Principles\n\nThrough the statistical analysis of the vulnerability samples, we found out that obfuscation was\nused massively. Therefore, we filtered out all the duplicated obfuscation and renamed all the\nidentifiers.\n\nSeeing from the POC created by using the exploit samples we captured, the principles of the\nexploit is obvious. The POC samples are as below:\n\n\n-----\n\nDetailed procedures:\n\n1) First create a cla1 instance assigned to b, and then assign value 0 to b, because at this point\nb’s referenced count is 1, causing cla1’s Class_Terminate function to be called.\n2) In the Class_Terminate function, again assign b to c and assign 0 to b to balance the\nreference count.\n3) After the Class_Terminate return, the memory pointed to by the b object will be released, so\nthat a pointer to the memory data of the released object b is obtained.\n4) If you use another object to occupy the freed memory, it will lead to the typical UAF or Type\nConfusion problem\n\n\n-----\n\n### 3. Exploitation\n\nThe 0-day exploit exploits UAF multiple times to accomplish type confusion. It fakes and\noverrides the array object to perform arbitrary address reading and writing. In the end, it\nreleases code to execute after constructing an object. Code execution does not use the\ntraditional ROP or GodMod, but through the script layout Shellcode to stabilize the use.\n\n**Fake array to perform arbitrary address reading and writing**\n\nMem members of 2 classes created by UAF are offset by 0x0c bytes, and an array of 0x7fffffff\nsize is forged by reading and writing operation to the two mem members.\n\ntypedef struct tagSAFEARRAY {\n\nUSHORT cDims; // cDims = 0001\n\nUSHORT fFeatures; fFeatures =0x0880\n\nULONG cbElements; // the byte occupied by one element (1 byte)\n\nULONG cLocks;\n\nPVOID pvData; // Buffer of data starts from 0x0\n\nSAFEARRAYBOUND rgsabound[1];\n\n} SAFEARRAY, *LPSAFEARRAY;\n\ntypedef struct tagSAFEARRAYBOUND {\n\nULONG cElements; // the number of elements (0x7fffffff, user space)\n\nLONG lLbound; // the initial value of the index (starting from 0)\n\n} SAFEARRAYBOUND, *LPSAFEARRAYBOUND;\n\nA forged array composes of a one-dimensional array, the number of elements is 7fffffff, each\nelement occupies 1 byte, and the element memory address is 0. So the accessible memory\nspace for the array is from 0x00000000 to 0x7ffffffff*1. Therefore, the array can be read and\nwritten at any address. But the storage type of lIlIIl is string, so only by modifying the data type\nto 0x200C, i.e. VT_VARIANT|VT_ARRAY( array type), attackers can achieve their purpose.\n\n**Read the storage data of the specified parameter**\n\nIn the malicious code, the above function is mainly used to read the data of the memory\naddress specified by the parameter. The idea is to obtain the specified memory read capability\nvia the characteristics of the first 4 bytes of the string address (namely, the content of the bstr,\n\n\n-----\n\ntype, size field) returned by the lenb (bstr xx) in the vb (the data type in the VBS is bstr).\n\nThis is shown in the above code. If the input argument is addr(0x11223344), first add 4 to the\nvalue to get 0x11223348, and then set the variant type to 8 (string type). Next, call len function:\nif found to be BSTR type, vbscript will assume that the forward 4 bytes (0x11223344) is the\naddress memory to store the length. So the len function will be executed and the value of the\nspecified memory address will be returned.\n\n**Obtain Key DLL Base Address**\n\n1.The attacker leaks the virtual function table address of the CScriptEntryPoint object in the\nfollowing way, which belongs to Vbscript.dll.\n\n2.Obtain the vbscript.dll base address in the following way\n\n3.Because vbscript.dll imported msvcrt.dll, the msvcrt.dll base address was obtained by\ntraversing the vbscript.dll import table, msvcrt.dll introduces kernelbase.dll, ntdll.dll, and finally\nthe NtContinue, VirtualProtect function address was obtained.\n\n**Bypass DEP to execute shellcode**\n\n1.Use arbitrary reading and writing technique to modify the VAR type type to 0x4d, and then\nassign it with a value of 0 to make the virtual machine perform VAR:: Clear function.\n\n\n-----\n\n2.Control with caution and let the code Execute function ntdll!ZwContinue. The first parameter\nCONTEXT structure was also constructed by the attacker.\n\n3.Control the code with caution to execute ntdll! ZwContinue function. The first parameter\nCONTEXT structure is also carefully constructed by the attacker.\n\n\n-----\n\n4.The first parameter of ZwContinue is a pointer to the CONTEXT structure. The CONTEXT\nstructure is shown in the following figure, and the offset of EIP and ESP in CONTEXT can be\ncalculated\n\n5.The values  of the Eip and Esp in the actual runtime CONTEXT and the attacker’s intention\nare shown in the figure below.\n\n\n-----\n\n## V Powershell Payload\n\nAfter the bait DOC file is executed, it will start to execute the Powershell command to the next\nstep payload.\n\nFirst of all, Powershell will fuzzy match incoming parameter names, and it is case-insensitive.\n\n\n-----\n\nSecond step, decrypt the obfuscated command.\n\nNext, the script uses a special User-Agent access URL page to request the next load and\nexecute.\n\n\n-----\n\nThe size of the requested payload file is approximately 199K. The code fragment is as follows.\n\n\n-----\n\n-----\n\nWe found that this code was modified from invoke-ReflectivePEInjection.ps1[2]. buffer_x86 and\nbuffer_x64 in the code are same function but from different versions of dll files. File export\nmodule name: ReverseMet.dll.\n\n_[2]_\n_https://github.com/EmpireProject/Empire/blob/master/data/module_source/code_execution/Invoke-_\n_ReflectivePEInjection.ps1_\n\nDLL file decrypts ip address, port and sleep time from the configuration. After the decryption\nalgorithm xor 0xA4, and subtracted 0x34, the code is as follows.\n\n\n-----\n\n-----\n\nDecryption configuration file from the ip address 185.183.97.28 port 1021 to obtain the next\nload and execute. After it connects to the tcp port, it will get 4 bytes to apply for a memory.\nSubsequent acquired writes into the new thread, and execute the acquired shellcode payload.\n\nSince the port of the sample CC server is closed, we cannot get the next load for analysis.\n\n## VI UAC Bypass Payload\n\nIn addition to use PowerShell to load the payload, the bait DOC file also runs rundll32.exe to\nexecute another backdoor locally. There are several notable features of the backdoor program\nit uses: the program uses COM port to copy files, realize UAC bypass and two system DLL\nhijacks; it also uses the default DLLs of cliconfg.exe and SearchProtocolHost.exe to take\nadvantage of whitelist; finally in the process of component delivery, use file steganography and\nmemory reflection loading method to avoid traffic monitoring and achieve no file landing load.\n\n\n-----\n\n### 1. Retro backdoor execution\n\nThe backdoor program used in this attack is actually the Retro series backdoor known to be\nused by the APT-C-06 organization. The following is a detailed analysis of the implementation\nprocess of the backdoor program.\n\nFirst execute the DLL disguised as a zlib library function with rundll32 and execute the\nbackdoor installation functions uncompress2 and uncompress3.\n\nIt uses a COM port for UAC bypass, copying its own DLL to the System32 path for DLL\nhijacking, and the hijacked targets are cliconfg.exe and SearchProtocolHost.exe.\n\nCopy the DLL file in the AppData directory to the System32 directory through the COM\ninterface and name it msfte.dll and NTWDBLIB.dll.\n\n\n-----\n\nThen copy the file NTWDBLIB.dll to the System directory and execute the system’s own\ncliconfig to achieve DLL hijacking and load NTWDBLIB.dll.\n\n\n-----\n\nThe role of NTWDBLIB.dll is to restart the system service WSearch, and then start msfte.dll.\n\nThe script will then generate and execute the MO4TH2H0.bat file in the TEMP directory, which\nwill delete the NTWDBLIB.DLL and its own BAT from the system directory.\n\n\n-----\n\nMsfte.dll is the final backdoor program whose export is disguised as zlib. The core export\nfunctions are AccessDebugTracer and AccessRetailTracer. Its main function is to communicate\nwith CC and further download and execute subsequent DLL programs.\n\nSimilar to the previously analyzed sample, it is also using image steganography and memory\nreflection loading. The decrypted CC communication information is as follows:\n\n\n-----\n\nThe format of the request is:\n\n_Hxxp://CC_Address /s7/config.php ?p=M&inst=7917&name=_\n\nAmong them, the parameter p is the current process authority, there are two types of M and H,\ninst parameter is the current installation id, name is the CC_name obtained by decryption, this\ntime is pphp.\n\nAfter decryption after downloading, the process is exactly the same as the format of the\nprevious image steganography transmission. The decryption process this time is shown in the\nfigure below:\n\n\n-----\n\nThe previously decrypted test sample decryption process is shown below:\n\nFor the CC URL corresponding to the test request, because we did not obtain the\ncorresponding image during the analysis, the CC is suspected to have failed.\n\nIn the implementation process, Retro disguised fake SSH and fake zlib, intended to obfuscate\nand interfere with users and analysts. Retro’s attack method has been used since 2016.\n\n### 2. Retro backdoor evolvement\n\nThe back door program used in the APT-C-06 organization’s early APT operation was Lucker.\nIt is a set of self-developed and customized modular Trojans. The set of Trojans is powerful,\nwith keyboard recording, voice recording, screen capture, file capture and U disk operation\nfunctions, etc. The Lucker ‘s name comes from the PDB path of this type of Trojan, because\nmost of the backdoor’s function use the LK abbreviation.\n\n\n-----\n\nIn the middle to late period we have discovered its evolution and two different types of\nbackdoor programs. We have named them Retro and Collector by the PDB path extracted from\nthe program. The Retro backdoor is an evolution of the Lucker backdoor and it actives in a\nseries of attacks from 2016 till now. The name comes from the pdb path of this type of Trojan\nwith the label Retro, and also has the word Retro in the initial installer.\n\nC:\\workspace\\Retro\\DLL-injected-explorer\\zlib1.pdb\nC:\\workspace\\Retro\\RetroDLL\\zlib1.pdb\n\nThe evolution of the reflective DLL injection technique can be found from the relevant PDB\npaths, and there are a lot of variants of this series of backdoors.\n\n\n-----\n\n## VII Attribution\n\n### 1. Decryption Algorithm\n\nDuring the analysis, we found the decryption algorithm that malware used is identical to APT-C06’s decryption algorithm.\n\nThe decryption algorithm of this attack is as follow:\n\nThe decryption algorithm APT-C-06 used is as follow:\n\n\n-----\n\nIn the further analysis, we found the same decryption algorithm was used in the 64-bit version\nof the relevant malware.\n\n### 2. PDB Path\n\nThe PDB path of the malware used in this attack has a string of “Retro”. It is one specific\nfeature of Retro Trojan family.\n\n### 3. Victims\n\nIn the process of tracing victims, we found one special compromised machine. It has a large\namount of malware related to APT-C-06. By looking at these samples in chronological order,\nthe evolution of the malicious program can be clearly seen. The victim has been under\nconstant attack acted by APT-C-06 since 2015. The early samples on the compromised\nmachine could be associated with DarkHotel. Then it was attacked by Lurker Trojan. Recently it\nwas under the attack exploiting 0-day vulnerabilities CVE-2018-8174.\n\n## VIII Conclusion\n\n\n-----\n\nAPT-C-06 is an overseas APT organization which has been active for a long time. Its main\ntargets are China and some other countries. Its main purpose is to steal sensitive data and\nconduct cyber-espionage. DarkHotel can be regarded as one of its series of attack activities.\nThe attacks against China specifically targeted government, scientific research institutions and\nsome particular field. The attacks can be dated back to 2007 and are still very active. Based on\nthe evidence we have, the organization may be a hacker group or intelligence agency\nsupported by a foreign government.\nThe attacks against China have never stopped over the past 10 years. The Techniques the\ngroup uses keep evolving through time. Based on the data we captured in 2017, targets in\nChina are trade related institutions and concentrated in provinces that have frequent trading\nactivities. The group has been conducting long-term monitoring on the targets to stole\nconfidential data.\nDuring the decades of cyber attacks, APT-C-06 exploits several 0-day vulnerabilities and used\ncomplicated malware. It has dozens of function modules and over 200 malicious codes.\nIn April, 2018, the Advanced Threat Response Team of 360 Core Security Division takes the\nlead in capturing the group’s new APT attack using 0-day vulnerabilities (CVE-2018-8174) in\nthe wild, and then discovers the new type attack – Office related attack exploiting 0-day\nVBScript vulnerabilities.\nAfter the capture of the new activity, we contacted Microsoft immediately and shared detailed\ninformation with them. Microsoft’s official security patch was released on 8th May. Now, we\npublished this detailed report to disclose and analyze the attack.\n\n## Appendix IOC\n\n\n-----\n\n## References\n\n[https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2018-8174](https://portal.msrc.microsoft.com/en-us/security-guidance/advisory/CVE-2018-8174)\n\n## About\n\n360 Helios Team is the APT(Advanced Persistent Attack) research and analysis team in Qihoo\n360. The team is dedicated in APT attack investigation, threat incident response and\nunderground economy industrial chain studies. Since the establishment in December, 2014,\nthe team has successflly integrated 360’s big data base and built up a quick reversing and\n\n\n-----\n\ncorellation procudure. So far, more than 30 APT and underground economy groups have been\ndiscovered and revealed.\n360 Helios also provides threat intelligence assessment and response solutions for enterprises.\n\nContact Window: [360zhuiri@360.cn](http://10.10.0.46/mailto:360zhuiri@360.cn)\n[Learn more about 360 Total Security](https://www.360totalsecurity.com/en/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-05-25 - Analysis of CVE-2018-8174 VBScript 0day and APT actor related to Office targeted attack.pdf"
    ],
    "report_names": [
        "2018-05-25 - Analysis of CVE-2018-8174 VBScript 0day and APT actor related to Office targeted attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b13c19d6-247d-47ba-86ba-15a94accc179",
            "created_at": "2024-05-01T02:03:08.149923Z",
            "updated_at": "2025-03-27T02:05:17.422065Z",
            "deleted_at": null,
            "main_name": "TUNGSTEN BRIDGE",
            "aliases": [
                "DUBNIUM ",
                "DarkHotel ",
                "CTG-1948 "
            ],
            "source_name": "Secureworks:TUNGSTEN BRIDGE",
            "tools": [
                "Nemim"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536029,
    "ts_updated_at": 1743041741,
    "ts_creation_date": 1653775014,
    "ts_modification_date": 1653775014,
    "files": {
        "pdf": "https://archive.orkl.eu/9f6dbe07b6403546e8d04ee3696d5b4bebb8aadf.pdf",
        "text": "https://archive.orkl.eu/9f6dbe07b6403546e8d04ee3696d5b4bebb8aadf.txt",
        "img": "https://archive.orkl.eu/9f6dbe07b6403546e8d04ee3696d5b4bebb8aadf.jpg"
    }
}