{
    "id": "29faef34-dabb-4b42-a99b-faf070bdf0a6",
    "created_at": "2023-01-12T15:05:54.264579Z",
    "updated_at": "2025-03-27T02:16:09.306113Z",
    "deleted_at": null,
    "sha1_hash": "03bc7507f355b09c52a886ea2870316695525e22",
    "title": "2021-09-13 - APT-C-36 Updates Its Spam Campaign Against South American Entities With Commodity RATs",
    "authors": "",
    "file_creation_date": "2022-05-28T02:43:14Z",
    "file_modification_date": "2022-05-28T02:43:14Z",
    "file_size": 220606,
    "plain_text": "# APT-C-36 Updates Its Spam Campaign Against South American Entities With Commodity RATs\n\n**[trendmicro.com/en_us/research/21/i/apt-c-36-updates-its-long-term-spam-campaign-against-south-ameri.html](https://www.trendmicro.com/en_us/research/21/i/apt-c-36-updates-its-long-term-spam-campaign-against-south-ameri.html)**\n\nSeptember 13, 2021\n\nAPT & Targeted Attacks\n\nWe have continued tracking APT-C-36, also known as Blind Eagle, since our research on\nthis threat actor in 2019. We share new findings of APT-C-36’s ongoing spam campaign\ntargeting South American entities.\n\nBy: Jaromir Horejsi, Daniel Lunghi September 13, 2021 Read time: ( words)\n\nIn 2019, we wrote a [blog entry about a threat actor, likely based in Colombia, targeting](https://blog.trendmicro.com/trendlabs-security-intelligence/spam-campaign-targets-colombian-entities-with-custom-proyecto-rat-email-service-yopmail-for-cc/)\nentities in Colombia and other South American countries with spam emails. This threat actor\nis sometimes referred to as APT-C-36 or Blind Eagle. Since then, we have continued\ntracking this threat actor. In this blog entry, we share our new findings about APT-C-36’s\nongoing spam campaign during that monitoring phase.\n\nAPT-C-36 has been known to send phishing emails to various entities in South America\nusing publicly available remote access tools (RATs). Over time, the threat actor switches\nfrom one RAT to another. In the past, we have observed that APT-C-36 makes use of RATs\nsuch as:\n\n[njRAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat)\n[Imminent Monitor](https://malpedia.caad.fkie.fraunhofer.de/details/win.imminent_monitor_rat)\nA custom modified [ProyectoRAT](https://blog.trendmicro.com/trendlabs-security-intelligence/spam-campaign-targets-colombian-entities-with-custom-proyecto-rat-email-service-yopmail-for-cc/)\n[Warzone RAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.ave_maria)\n[Async RAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat)\n[Lime RAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.limerat)\n[Remcos RAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.remcos)\n[BitRAT](https://malpedia.caad.fkie.fraunhofer.de/details/win.bit_rat)\n\n## The delivery emails\n\nAPT-C-36 utilizes different ruses for their targets: Many of the fraudulent emails impersonate\nColombia’s national directorate of taxes and customs, Dirección de Impuestos y Aduanas\n_Nacionales (DIAN), a lure that the threat actor has used before. Such emails claim that a_\n\n\n-----\n\nseizure order to bank account has been issued, further details are contained in the email\nattachment, and that the information is protected with password “dian” (Figure 1). In English,\nthe attachment means “seizure order.pdf” and the email body translates to the following:\n\n_“Subject: we have sent a seizure order to the bank accounts matching your name_\n\n_Dear taxpayer,_\n\n_For your information, our intelligent IT system detected that your income statement at_\n_the Direccion de Impuestos y Aduanas DIAN has 180 days of arrears. For that reason, we_\n_will proceed as stated in the law, article 823 until 843-2._\n\n_We attach the information and your debt with the password : dian\"_\n\nFigure 1. A delivery email impersonating Colombia’s national directorate of taxes and\ncustoms\nOther fake emails in this campaign claim to contain a photo that would prove that the\nrecipient’s partner is having an affair. In a similar fashion, the recipient is asked to open the\nemail attachment named “attached picture.jpg” and use the password “foto” to view its\ncontents (Figure 2). These emails lack proper punctuation and are badly written, which is a\ncommon feature in phishing attempts. In English, the email translates to the following:\n\n_“Hi how are you, I hope you're fine. I write this email to you as I don't dare telling you_\n_directly. Everyone knows except you, open your eyes, you are being cheated on and I don't_\n_like how others are laughing about you. I experienced a similar situation, that's why I don't_\n_like someone doing it to another person. You know me well, I prefer not to make trouble. I_\n_attached a picture where they are kissing, I know it's hard to look at, but it is better than to_\n_live a relationship where you believe it is all fine._\n\n_The picture was too big so I compressed it, you need Winzip or Winrar installed. I will_\n_write another email in the following says, I have more things to tell you._\n\n_I uploaded the picture with a password to avoid other people to look at it. The password_\n_is: foto\".”_\n\n\n-----\n\nFigure 2. A delivery email pretending to share personal photos\nThe sender’s email address is either a spoofed address impersonating DIAN, or a\nHotmail.com address impersonating a fake female profile. The originating IP addresses\nalways belong to a VPN provider.\n\n## The delivery documents\n\nThe delivery documents in these phishing emails are either a PDF file or DOCX file\ncontaining a link. We have found samples of these documents impersonating DIAN (Figure\n3), and others impersonating Google Photos (Figure 4).\n\nFigure 3. An email attachment with a link to a URL shortener\n\n\n-----\n\nFigure 4. The URL leads to a different destination\nHovering over the link will show that the link was generated from a URL shortener. As\ndiscussed in our last blog entry on this threat actor, APT-C-36 uses URL shorteners such as\ncort.as, acortaurl.com and gtly.to. These URL shorteners are capable of geographical\ntargeting, so if a user from a country not targeted by the threat actors clicks on the link, they\nwill be redirected to a legitimate website. The URL shorteners also have the ability to detect\nthe major VPN services, in which case, the shortened link leads the users to a legitimate\nwebsite instead of redirecting them to the malicious link, as illustrated in Figures 5 and 6.\n\nFigure 5. Geographical targeting detects a non\nColombian IP or VPN, so the user is led to the real DIAN website\n\n\n-----\n\nFigure 6. Geographical targeting detects a non\nColombian IP or VPN, so the user is led to the real Google Photos website\nHowever, if the location criteria are met, then the user is redirected to a file hosting server\nand a file is automatically downloaded (Figure 7).\n\nFigure 7. File storage containing a password-protected archive\nThe downloaded file is a password-protected archive, the password for which is mentioned in\nthe email, the email attachment, or both. These passwords are usually simple, such as\n“dian,” “foto,” or “1234.”\n\n## Payload\n\n\n-----\n\nAfter deobfuscating the executable file within the password-protected archive, we are\npresented with a RAT called BitRAT. This RAT is not new, it has been previously analyzed\nby [security](https://krabsonsecurity.com/2020/08/22/bitrat-the-latest-in-copy-pasted-malware-by-incompetent-developers/) [researchers.](https://krabsonsecurity.com/2020/09/04/bitrat-pt-2-hidden-browser-socks5-proxy-and-unknownproducts-unmasked/)\n\nUpon analyzing the RAT, the most interesting part of this RAT is its configuration settings\nseen as an encrypted block of data (Figure 8). There are two hexadecimal strings within the\nmain executable file in BitRAT: the longer string is the encrypted configuration, the shorter\none is the first part of the key.\n\nFigure\n\n8. BitRAT's encrypted configuration\nUnlike most other malware, BitRAT uses the [Camellia cipher with an initialization vector (IV)](https://en.wikipedia.org/wiki/Camellia_(cipher))\nof 0000000000000000.\n\nSeveral computational steps are needed to obtain the final key. First, a magic value is\ncomputed from bytes found on fixed addresses, as shown in Figures 9 and 10.\n\nFigure 9. The algorithm to\n\ncompute for the magic value of BitRAT’s final key\n\nFigure 10. The\n\ninput data to compute for the magic value of BitRAT’s final key\nEach byte is transformed using a simple computation formula, as shown below:\n\n**((((value-0x 08)*0x25) %0x7f)+ 0x7f)% 0x7f**\n\nThis formula can be used to compute for the magic value through the following process:\n\n1. For example, using the data from Figures 9 and 10 will result in the string “78hf326f87”.\n2. This string is appended to the hardcoded string “38325a784d6f5630”, forming the\n\nstring “38325a784d6f563078hf326f87”.\n3. Afterward, a crc32 checksum is computed from “38325a784d6f563078hf326f87”,\n\nresulting in “d8e71d19”.\n4. A value of 0x08 is added to the checksum, which then becomes “d8e71d21”.\n\n\n-----\n\n5. The MD5 hash is computed from the checksum d8e71d21, forming\n\n“b50d97fb1e3d5fc9cc302384f5718714”.\n6. The first half of this MD5 hash, “b50d97fb1e3d5fc9”, is the key for the Camellia cipher.\n\nThe configuration is decrypted to the following string, as shown in Figure 11, including a\ncommand-and-control (C&C) server and a port.\n\nFigure 11. Decrypted configuration of BitRAT\n\n## Affected regions and industries\n\nThe majority of the targets we discovered were located in Colombia, although some were\nfrom other South American countries such as Ecuador, Spain, and Panama. This is\nconsistent with the use of Spanish in spear-phishing emails.\n\nAlthough APT-C-36’s objective remains unclear, we posit that the threat actor carried out this\ncampaign for financial gain. The campaign has affected multiple industries, primarily\ngovernment, financial, and healthcare entities. We have also seen the campaign affect the\nfinance, telecommunications, and energy, oil and gas industries.\n\n## Conclusion\n\nOver the course of this investigation, we have found various new tactics, techniques, and\nprocedures (TTPs) used by APT-C-36. Our research shows that they modify their methods\nfrequently, as evidenced by their use of different link shorteners and RATs. While spearphishing emails are the initial infection vector for this ongoing campaign, the threat actor is\nconstantly changing their payloads and improving their techniques to avoid detection, such\nas their use of geolocation filtering.\n\nAPT-C-36 selects their targets based on location and most likely the financial standing of the\nemail recipient. These, and the prevalence of the emails, lead us to conclude that the threat\nactor’s ultimate goal is financial gain rather than espionage.\n\n## Security Recommendations\n\nThreat actors like APT-C-36 are constantly seeking new ways to deploy their malware and\nstay one step ahead of their victims’ defenses. To secure their data from spear-phishing\nattempts, companies can benefit from tools such as the Trend Micro™ Smart Protection\nSuites and [Worry-Free™ Business Security solutions, which protect end-users and](https://www.trendmicro.com/en_us/small-business.html)\nbusinesses from these kinds of threats by detecting and blocking malicious files, spam\nmessages, and malicious URLs. They can also turn to tools like Trend Micro™ Email\nSecurity, a no-maintenance cloud solution that delivers continuously updated protection to\n\n\n-----\n\nstop spam, malware, spear phishing, ransomware, and advanced targeted attacks before\nthey reach the network. It protects Microsoft Exchange, Microsoft Office 365, Google Apps,\nand other hosted and on-premises email solutions.\n\n## Indicators of Compromise\n\n[You can access the link here for the full list of IOCs.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/21/i/apt-c-36-updates-its-long-term-spam-campaign-against-south-american-entities-with-commodity-rats/BlindEagleIOCList.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-13 - APT-C-36 Updates Its Spam Campaign Against South American Entities With Commodity RATs.pdf"
    ],
    "report_names": [
        "2021-09-13 - APT-C-36 Updates Its Spam Campaign Against South American Entities With Commodity RATs.pdf"
    ],
    "threat_actors": [
        {
            "id": "98b22fd7-bf1b-41a6-b51c-0e33a0ffd813",
            "created_at": "2022-10-25T15:50:23.688973Z",
            "updated_at": "2025-03-27T02:00:55.524322Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "APT-C-36",
                "Blind Eagle"
            ],
            "source_name": "MITRE:APT-C-36",
            "tools": [
                "Imminent Monitor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bd43391b-b835-4cb3-839a-d830aa1a3410",
            "created_at": "2023-01-06T13:46:38.925525Z",
            "updated_at": "2025-03-27T02:00:02.95302Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "Blind Eagle"
            ],
            "source_name": "MISPGALAXY:APT-C-36",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "be597b07-0cde-47bc-80c3-790a8df34af4",
            "created_at": "2022-10-25T16:07:23.407484Z",
            "updated_at": "2025-03-27T02:02:09.784411Z",
            "deleted_at": null,
            "main_name": "Blind Eagle",
            "aliases": [
                "APT-C-36",
                "APT-Q-98",
                "AguilaCiega"
            ],
            "source_name": "ETDA:Blind Eagle",
            "tools": [
                "AsyncRAT",
                "BitRAT",
                "Bladabindi",
                "BlotchyQuasar",
                "Imminent Monitor",
                "Imminent Monitor RAT",
                "Jorik",
                "LimeRAT",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "Warzone",
                "Warzone RAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535954,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1653705794,
    "ts_modification_date": 1653705794,
    "files": {
        "pdf": "https://archive.orkl.eu/03bc7507f355b09c52a886ea2870316695525e22.pdf",
        "text": "https://archive.orkl.eu/03bc7507f355b09c52a886ea2870316695525e22.txt",
        "img": "https://archive.orkl.eu/03bc7507f355b09c52a886ea2870316695525e22.jpg"
    }
}