{
    "id": "2a278d9d-51b7-4c83-96f9-a40a46bb0549",
    "created_at": "2022-10-25T16:48:22.928357Z",
    "updated_at": "2025-03-27T02:14:34.827451Z",
    "deleted_at": null,
    "sha1_hash": "9a7bd4348f8ad97d5440d287b81382d47f71d954",
    "title": "Scarlet Mimic",
    "authors": "Palo Alto",
    "file_creation_date": "2016-02-08T23:29:27Z",
    "file_modification_date": "2016-02-08T23:29:27Z",
    "file_size": 1720544,
    "plain_text": "# Scarlet Mimic: Years­Long Espionage Campaign Targets Minority Activists ­ Palo Alto Networks Blog\n\nposted by: [Robert Falcone and Jen Miller­Osborn on January 24, 2016 5:00 PM](http://researchcenter.paloaltonetworks.com/author/robert-falcone/)\n\n## Executive Summary\n\nOver the past seven months, Unit 42 has been investigating a series of attacks we attribute to a\n\ngroup we have code named “Scarlet Mimic.” The attacks began over four years ago and their\n\ntargeting pattern suggests that this adversary’s primary mission is to gather information about\n\nminority rights activists. We do not have evidence directly linking these attacks to a government\n\nsource, but the information derived from these activities supports an assessment that a group or\n\ngroups with motivations similar to the stated position of the Chinese government in relation to these\n\ntargets is involved.\n\nThe goal of this report is to expose the tools, tactics and infrastructure deployed by Scarlet Mimic in\n\norder to increase awareness of this threat and decrease its operational success through deployment\n\nof prevention and detection countermeasures. From our vantage point, we are not able to identify\n\nwhich attacks have been successful against which organizations. But the fact that the tools Scarlet\n\nMimic deploys have been under development for years suggests an active adversary that has been\n\nsuccessful in some percentage of its operations. Based on our analysis, we are also seeing Scarlet\n\nMimic start to expand its espionage efforts from PCs to mobile devices, marking an evolution\n\nin its tactics.\n\nIndividuals and groups of all different types may become the target of cyber espionage campaigns.\n\nThe most well known victims of cyber espionage are typically government organizations or high­tech\n\ncompanies, but it’s important to recognize that espionage­focused adversaries are tasked to collect\n\ninformation from many sources.\n\nThe attacks we attribute to Scarlet Mimic have primarily targeted Uyghur and Tibetan activists as well\n\nas those who are interested in their causes. Both the Tibetan community and the Uyghurs, a Turkic\n\nMuslim minority residing primarily in northwest China, have been targets of multiple sophisticated\n\nattacks in the past decade. Both also have history of strained relationships with the government of\n\nthe People’s Republic of China (PRC), though we do not have evidence that links Scarlet Mimic\n\nattacks to the PRC.\n\nScarlet Mimic attacks have also been identified against government organizations in Russia and\n\nIndia, who are responsible for tracking activist and terrorist activities. While we do not know the\n\nprecise target of each of the Scarlet Mimic attacks, many of them align to the patterns described\n\nabove.\n\n\n-----\n\nand control traffic mimicked Windows Messenger and Yahoo! Messenger network traffic to evade\n\ndetection. We have identified two subsequent variants of the FakeM family, which has undergone\n\nsignificant changes since it was exposed in 2013. We have also identified nine distinct “loader”\n\nmalware families, which Scarlet Mimic appears to use to avoid detection when infecting a system.\n\nIn addition to the FakeM variants, Scarlet Mimic has deployed Trojans that target the Mac OS X and\n\nAndroid operating systems. We have linked these attacks to Scarlet Mimic through analysis of their\n\ncommand and control (C2) infrastructure.\n\nTo infect individuals with access to the data the actors desire, Scarlet Mimic deploys both spear­\n\nphishing and watering hole (strategic web compromise) attacks. Using these tactics they can directly\n\ntarget previously identified individuals (spear phishing) as well as unidentified individuals who are\n\ninterested in a specific subject (watering hole). In their spear phishing attacks, Scarlet Mimic has\n\nexploited five separate vulnerabilities. However, in many cases they chose to forgo exploiting a\n\nsoftware vulnerability and used self­extracting (SFX) RAR archives that use the Right­to­Left Override\n\ncharacter to mask the true file extension, tricking victims into opening executable files.\n\nAs with many other attackers who use spear­phishing to infect victims, Scarlet Mimic makes heavy\n\nuse of “decoy” files. These are legitimate documents that contain content relevant to the subject of\n\nthe spear phishing e­mail. After the system is infected, the malware displays the decoy document to\n\ntrick the user into believing nothing harmful has occurred. These decoy documents allow us to\n\nidentify the theme of the spear phishing e­mail and in some cases the target of the attack.\n\nThe most recent Scarlet Mimic attacks we have identified were conducted in 2015 and suggest the\n\ngroup has a significant interest in both Muslim activists and those interested in critiques of the\n\nRussian government and Russian President Vladimir Putin. Based on their previous targets we\n\nsuspect these individuals may be targeted based on the information they posses on activist groups.\n\n[The primary source of data used in this analysis is Palo Alto Networks WildFire, which analyzes](https://www.paloaltonetworks.com/products/technologies/wildfire.html)\n\nmalware used in attacks across the world. The system also analyzes malware samples collected\n\nthrough a sharing partnership with other security vendors, including our partners in the Cyber Threat\n\nAlliance. To connect attacks to each other based on malware behavior and command and control\n\n[infrastructure, we relied on AutoFocus threat intelligence. AutoFocus users can view all of the files](https://www.paloaltonetworks.com/products/platforms/subscriptions/autofocus.html)\n\nrelated to Scarlet Mimic and the malware associated with the group using the following links:\n\n## Introduction\n\nThe better we can understand the threats to our networks and systems, the more effective we will be\n\nat preventing those threats. The goal of this report is to help network defenders better understand\n\nattacks from a group we have named Scarlet Mimic. This group has been conducting attacks for at\n\nleast four years using a backdoor Trojan that has been under active development. The group\n\nprimarily deploys spear­phishing e­mails to infect its targets, but was also responsible for a watering\n\n\n-----\n\nincidents. Based on analysis of the data and malware samples we have collected, Unit 42 believes\n\nthe attacks described herein are the work of a group or set of cooperating groups who have a single\n\nmission, collecting information on minority groups who reside in and around northwestern China. In\n\nthe past, Scarlet Mimic has primarily targeted individuals who belong to these minority groups as well\n\nas their supporters, but we’ve recently found evidence to indicate the group also targets individuals\n\nworking inside government anti­terrorist organizations. We suspect these targets are selected based\n\non their access to information about the targeted minority groups.\n\nIn the following sections we will describe selected attacks we have identified and who their likely\n\ntargets are. We will also provide detailed analysis of the latest variants of the malware they deploy\n\n(known as FakeM) as well as other associated tools that allow Scarlet Mimic to target Android and\n\nOS X devices.\n\nAttacks launched by this group were publicly exposed on 2013 in a Trend Micro report about the\n\nFakeM Trojan. Since that reports release, Scarlet Mimic has deployed two additional versions of the\n\nmalware. They have also deployed nine separate “loader” Trojans they use to infect systems with\n\ntheir backdoor.\n\n## Attack Details\n\nThe majority of attacks we associate with Scarlet Mimic follow the pattern shown in Figure 1.\n\nFigure 1: “Spear Phishing with Decoy” Attack Pattern Deployed by Scarlet Mimic\n\nThe attacker sends a spear­phishing e­mail with a subject and body content that appeal to the\n\ntargeted user. This e­mail carries an attachment, which is typically a document that exploits a\n\nMicrosoft Office vulnerability. The attachment uses a file name that is related to the e­mail content to\n\ntrick the user into opening it. If the user opens the file and the exploitation is successful, a backdoor\n\nTrojan is installed on the system that gives the attacker access and a decoy document is displayed to\n\n\n-----\n\nsee when opening the attachment.\n\nMany of the targets and spoofed or compromised sending e­mail addresses have contact information\n\non the Internet. The apparent sender email usually appears to be someone associated with the\n\naccompanying text, when appropriate, while the target emails are usually also available online tied to\n\ntarget organizations. A small subset of the decoys could not be found online and may be from\n\nprevious compromises by Scarlet Mimic.\n\nMany attackers deploy this particular pattern, as it is often successful at infecting a user without\n\nalerting the user of the infection. This is the exact same pattern, for example, deployed by the\n\n[attackers in Operation Lotus Blossom.](http://researchcenter.paloaltonetworks.com/2015/06/operation-lotus-blossom/)\n\nWe have identified spear phishing documents from Scarlet Mimic exploiting the following\n\nvulnerabilities.\n\nCVE­2012­0158\n\nCVE­2010­3333\n\nCVE­2010­2883\n\nCVE­2010­2572\n\nCVE­2009­3129\n\nWe also know Scarlet Mimic uses a number of toolkits to create documents that contain exploit code\n\nto install the FakeM payload on a compromised system. Unit 42 tracks the toolkits delivering FakeM\n\n[under the names MNKit, WingD and Tran Duy Linh. These kits appear to be used by many attack](http://researchcenter.paloaltonetworks.com/2015/05/cmstar-downloader-lurid-and-enfals-new-cousin/)\n\ngroups, and they alone are not a good indication of Scarlet Mimic activity.\n\nAdditionally, in many cases these threat actors did not use an exploit document at all, rather they sent\n\nself­extracting (SFX) RAR archives that use the Right­to­Left Override character to mask the true file\n\nextension. For example, the following two filenames of SFX archives used to deliver FakeM contain\n\nthe RLO character (bolded):\n\n_Update about the status of Tenzin Delek Rinpoche’ashes%E2%80%AEcod.scr_\n\n_tepsiliy mezmun.\\xe2\\x80\\xaetxt.scr_\n\nEven when no software vulnerability is exploited, the attacks still typically include a decoy document.\n\nThe content of most of the decoy documents appear to be available on the open Internet, and the\n\nattackers typically made small modifications to them.\n\nMany of the targets and spoofed or compromised sending accounts have contact information on the\n\nInternet. The apparent sender email usually appears to be someone associated with the\n\naccompanying text, when appropriate, while the target emails are usually also available online tied to\n\ntarget organizations. A small subset of the decoys could not be found online and may be from\n\nprevious compromises by Scarlet Mimic. The overarching decoy themes were Uyghur­related, anti­\n\n\n-----\n\n[In one instance, the threat actors used content from a New York Times article (Figure 2) on the same](http://www.nytimes.com/2015/07/22/world/asia/chinese-police-are-said-to-seize-ashes-of-tibetan-monk-tenzin-delek-rinpoche.html?_r=0)\n\nday it was published.\n\nFigure 2: Decoy Text Extracted from the New York Times article\n\nFigure 3 shows one of the more common themes used to target Uyghurs and those interested in\n\ntheir cause. Multiple attacks used press releases or other content related to the World Uyghur\n\nCongress.\n\nFigure 3: Decoy using World Uyghur Congress Press Release\n\nIn July of 2015, we identified a full e­mail uploaded to an antivirus scanning service that carried a\n\nScarlet Mimic exploit document. In this case (Figure 4) the recipient of the e­mail was an individual\n\nworking for the Russian Federal Security Service (fsb.ru). The e­mail body requests help dealing with\n\nthreatening phone calls from an international gang.\n\n\n-----\n\nFigure 4: Phishing E­mail send to FSB E­mail Address\n\nAnother attack, sent to an unknown target carried a decoy image (Figure 5) that compared Russian\n\nPresident Vladimir Putin to Adolf Hitler.\n\nFigure 5: Anti­Putin image used as a decoy document\n\nIn yet another case, the threat actors used a conference notification from one organization (Figure\n\n6a) and modified it to appear as thought it was for an “Islamic Country Muslim Religion Conference”\n\n\n-----\n\nmultiple hints to indicate the document was fraudulent (Figure 6c).\n\nFigure 6a: Original document used as a Psylo decoy\n\nFigure 6b: Modified header and contact email in the decoy\n\nFigure 6c: Bottom of the decoy document with replaced email and non­altered date — a quick search\n\nonline shows this to be fraudulent\n\nIn total we have collected over 40 individual decoy documents used in these attacks, far more than\n\nwe can detail here.\n\nWe are aware of one case where Scarlet Mimic broke from the spear­phishing pattern described\n\nabove. In 2013, the group deployed a watering hole attack, also known as a strategic web\n\ncompromise to infect victims with their backdoor. The watering hole is an attack vector that involves\n\ncompromising a website that targeted victims are likely to visit in order to infect and gain access to\n\n[their systems. According to a blog by Websense, threat actors compromised the Tibetan Alliance of](http://community.websense.com/blogs/securitylabs/archive/2013/08/16/tibetan-compromise.aspx)\n\nChicago’s website to host malicious code that exploited a vulnerability in Internet Explorer (CVE­\n\n2012­4969.) Microsoft patched this vulnerability in September 2012, suggesting that this watering\n\nhole attack used an older vulnerability, which aligns with the threat groups continued use of older\n\n\n-----\n\n[First discussed in January 2013 in a Trend Micro whitepaper, FakeM is a Trojan that uses separate](http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-fakem-rat.pdf)\n\nmodules to perform its functionality. FakeM’s functional code is shellcode­based and requires another\n\nTrojan to load it into memory and execute it. There are a variety of different Trojans used to load\n\nFakeM, some of which are more interesting than others. In this section, we will explore the loader\n\nTrojans followed by an analysis of the evolution of FakeM itself. We end this section with a discussion\n\non tools related to FakeM and used by Scarlet Mimic.\n\n**Loader Trojans**\n\nFakeM is shellcode­based and therefore requires another Trojan to load FakeM into memory and\n\nexecute its functional code. Threat actors have developed many different loading Trojans to load\n\nFakeM, some of which are fairly straightforward while others use very clever techniques to avoid\n\ndetection. Unit 42 tracks the following list of loader Trojans that Scarlet Mimic has used to execute\n\nFakeM:\n\nCrypticConvo\n\nSkiBoot\n\nRaidBase\n\nFakeHighFive\n\nPiggyBack\n\nFullThrottle\n\nFakeFish\n\nBrutishCommand\n\nSubtractThis\n\nIt appears that the threat actors include the loader Trojans in some sort of builder application that\n\nallows actors to quickly create, configure and deploy payloads to execute FakeM. We believe this\n\nbecause many samples that execute FakeM have the same exact compilation time but different C2\n\nservers, as seen in the example in Table 1. This suggests the actors compile a single sample and use\n\na builder tool to configure individual samples on demand.\n\nWe used the loader Trojans to provide a general timeline for the development of FakeM samples, as\n\nFakeM is shellcode­based and does not contain any usable timestamps. The timestamps in the\n\nloader Trojans does not necessarily correspond to the usage of FakeM, but plotting the compile\n\ntimes of the loaders on a timeline shows an interesting trend. The scatter plot timeline in Figure 7\n\nshows the known compilation times of the loader Trojans and the FakeM variant that it executed.\n\n\n**Loader**\n**SHA256** **Compiled**\n\n**Trojan**\n\n\n**C2 Domains**\n\n\n5182dc8667432d76a\n\n2013­09­\n276dc4f864cdfcef3e4 opero spdns[ ]org\n\n\n-----\n\n7080b798f4a 08:02:58\n\n\n5dade00db195087aa\n\n336ce190b5fd1c2299\n\n2c49556c623b42a9f7\n\n42d73241a7f\n\n\n2013­09­\n\n13\n\n08:02:58\n\n\nintersecurity.firewall­\nCrypticConvo\n\ngateway[.]com\n\n\nTable 1: Two samples sharing a compile time yet contain different C2 domains in their configurations\n\nFigure 7: Timeline of compilation of loader Trojans associated with FakeM\n\nBased on the timeline, it appears that the actors were actively developing several of the loaders at\n\nthe same time from 2009 until the early months of 2014. After the first quarter of 2014, it appears that\n\nthe actors abandoned development of the older loaders in favor of FakeFish, BrutishCommand and\n\nSubtractThis. This does not mean that actors will not continue to use the older loaders, but it does\n\nsuggest that the actors will continue including the newer or freshly developed loaders in updated\n\nbuilder applications.\n\nThe timeline also presents the possibility that the FakeM developers reacted to the release of Trend\n\n[Micro’s FakeM blog and whitepaper. Trend Micro published their analysis of the FakeM Trojan on](http://blog.trendmicro.com/trendlabs-security-intelligence/hiding-in-plain-sight-the-fakem-remote-access-trojan/)\n\nJanuary 17, 2013 (marked in Figure 7 by a red line) that discussed the original variant of FakeM.\n\nShortly after, the original variant of FakeM drops off the timeline in favor of the SSL and Custom SSL\n\nvariants. It is possible that the FakeM developers saw their tool was exposed and adapted it to avoid\n\ndetection for continued use as a payload in attacks. We cannot be certain if the developers reacted\n\n\n-----\n\ndetection rate of their tool that resulted from the exposure of the tool. Regardless of the specific\n\nstimulus, the reaction shows that the FakeM threat actors evolved to avoid detection/attribution and\n\nto continue their attack campaigns.\n\nThe timeline does have one noticeable outlier, specifically the FakeHighFive sample compiled in\n\nSeptember 2009 that loaded a FakeM SSL sample. We believe this compile time is incorrect, as the\n\nC2 domain for this sample, specifically press.ufoneconference[.]com, was registered by the threat\n\nactor in February 2013. The registration of the C2 domain in February 2013 aligns with other\n\ncompilation times of FakeM SSL, which leads us to the conclusion that the September 2009\n\ncompilation timestamp was modified and/or inaccurate.\n\nMost of the related loader Trojans, such as CrypticConvo, PiggyBack, FullThrottle, FakeHighFive,\n\nFakeFish and RaidBase do little more than load encrypted FakeM shellcode (either from a PE\n\nresource or embedded data), decrypt it, and execute the resulting shellcode. Other related loading\n\nTrojans, such as SubtractThis, BrutishCommand and SkiBoot employ clever techniques worth\n\ndiscussing.\n\n**SubtractThis**\n\nThe SubtractThis loader displays a technique that is quite clever. This loader received its name\n\nbased on a technique it uses to delay before carrying out its main functionality, specifically by\n\nrequiring the user to hit the minus (“­“) key. SubtractThis carries out this technique through the\n\nfollowing steps:\n\n1. Calls LoadAcceleratorsA function to load the virtual key for the minus character “­“. Example:\n\nLoadAcceleratorsA(hInstance, VK_SUBTRACT);\n\n2. Calls SetTimer function to set up a callback function that will be called in the event that the\n\nLB_FINDSTRING Windows message. Example: SetTimer(0, LB_FINDSTRING_, 10000u,\n\nTimerFunc);\n\n3. Creates a continuous loop that starts by calling GetMessageA to obtain Windows messages\n\n4. Calls TranslateAcceleratorA to check Windows message received is VK_SUBTRACT “­“.\n\n5. Calls the callback function set up in the SetTimer function if the user enters the minus “­“ key.\n\nThis technique requires user interaction, which makes analysis in sandboxes more difficult.\n\n**BrutishCommand**\n\nThe BrutishCommand loader uses a very interesting method to decrypt the FakeM functional code.\n\nThe main function in this loader checks the command line arguments passed to it, and if there are\n\nnone present it will obtain a random number between 0­9 and create a new process using the same\n\nexecutable with this random number as a command line argument.\n\nIf the executable has a command line argument, the Trojan subjects the value to a hashing algorithm\n\nand compares the hash to 0x20E3EEBA. If the value matches the static hash, the executable will\n\n\n-----\n\nwill use as the decryption key to decrypt the embedded FakeM shellcode. It essentially brute forces\n\nits own decryption key by rerunning itself over and over until it runs with the correct value is provided\n\non the command line. Unit 42 had not seen this technique used by other malware families and it\n\nintroduces a challenging hurdle when attempting to analyze or debug the loader Trojan.\n\n**SkiBoot Loader**\n\nSkiBoot reads the master boot record (MBR) of the system to determine the XOR key that it will use\n\nto decrypt the FakeM shellcode. It carries out this functionality by calling the ReadFile function to\n\nread 512­bytes from “\\\\.\\PHYSICALDRIVE0” and specifically uses the last byte of the MBR as the\n\nencryption key. The last byte of the MBR is “\\xAA”, or the second byte of “\\x55\\xAA”, which is the boot\n\nsignature portion of the MBR.\n\nInstead of using ReadFile, one variant of this loader reads the MBR using DeviceIOControl using the\n\nID_CMD control code, and accesses a specific offset to obtain the value that it will rotate each byte in\n\nthe ciphertext within the decryption algorithm. The significance of using DeviceIOControl is that the\n\nVMware hypervisor responds to this API call with a blank buffer instead of the MBR, whereas the\n\nVirtualbox hypervisor returns the MBR correctly. It appears that this loader is specifically using the\n\nDeviceIOControl API function as a VMware detection technique, suggesting that the developers are\n\nwell versed in the nuances of the VMware hypervisor and virtual machine evasion.\n\n### Evolving FakeM: Variants\n\nSince being originally exposed in 2013, authors of FakeM have continuously made changes to the\n\nFakeM codebase, resulting in multiple variants. Before elaborating on the different variants of FakeM,\n\nthere are many similarities that remain throughout the various iterations. The architecture has not\n\nchanged during the evolution of FakeM, as a modular framework exists in each variant, as seen in\n\nFigure 8. The FakeM main module is responsible for launching embedded modules, such as a\n\nkeylogger or for gathering sensitive files. The main module is also responsible for communicating\n\nwith its C2 servers and handling commands issued by the C2 server.\n\nFigure 8: FakeM Architecture\n\n\n-----\n\nseen in Table 2. The limited command set suggests that FakeM’s functionality is obtained by\n\nadditional assembly code provided by the C2 server with the 0x211 command. According to Trend\n\nMicro’s initial analysis on FakeM, threat actors delivered and ran additional code that provided further\n\ncapabilities to the Trojan, such as the ability to run shell commands, steal passwords, capture the\n\nscreen and upload files.\n\n**CommandDescription0x212Idle. Attempts to receive another command immediately instead of**\n\nsleeping for 30 seconds.0x213Sets a flag to end the session with the C2. This will force the Trojan to\n\nreestablish a session with the C2.0x214Exit process.\n\nTable 2: Command handler within all variants of FakeM\n\nNow that we have covered the commonalities between FakeM variants, the following sections will\n\ndive into the specific variants of FakeM. Unit 42 categorizes the different variations of FakeM based\n\non the method used to communicate with the C2 server, which has changed dramatically over the\n\nyears.\n\n**Original FakeM**\n\nThe original variant of FakeM generates network beacons to its C2 server that begin with a 32­byte\n\nheader that in most cases is meant to blend into network traffic generated by legitimate applications.\n\nFollowing this 32­byte header, the original variant of FakeM includes data encrypted using a custom\n\nencryption cipher that uses an XOR key of “YHCRA” and bit rotation between each XOR operation.\n\nThe original variant includes the FakeM discovered and published by Trend Micro in 2013, in which\n\nthe authors of FakeM first attempted to evade detection of its C2 communications by pretending to\n\nbe generated by legitimate messenger applications, such as MSN and Yahoo! messengers. Figures 9\n\nand 10 show FakeM attempting to resemble MSN or Yahoo! Messenger traffic, as the first 32­bytes\n\ncontain data that resemble legitimate traffic generated by these chat programs.\n\nFigure 9: FakeM using fake MSN messenger traffic for C2 communication\n\n\n-----\n\nIn addition to emulating chat programs, FakeM has also included HTML code within the 32­byte\n\nheader. As you can see in Figure 11, the overall structure of the beacon did not change, rather the\n\nonly differences is the data in the header contains HTML tags. The HTML data in the header led Unit\n\n[42 to a whitepaper published by Malware.lu that suggested the MSN, Yahoo, and HTML versions of](https://malware.lu/assets/files/articles/RAP002_APT1_Technical_backstage.1.0.pdf)\n\nthe original variant of FakeM all share a common server application that the threat actors use to build\n\nsamples and control infected systems.\n\nFigure 11: FakeM HTML tags in C2 header\n\n[In October 2013, FireEye published a blog about a sample of FakeM that did not use fake](http://www.fireeye.com/blog/threat-research/2013/10/evasive-tactics-terminator-rat.html)\n\nmessenger or HTML data in the first 32 bytes of the C2 traffic, but instead used four repeating bytes\n\nto fill this portion of the packet, as seen in Figure 12. Unit 42 tracks this under the original variant, as\n\nit uses the same algorithm to encrypt the data and otherwise shares a common structure to the MSN,\n\nYahoo, and HTML versions with the exception of the modification to the first 32 bytes.\n\nFigure 12: FakeM C2 beacon with four repeating bytes\n\n**FakeM SSL**\n\nWhile performing infrastructure analysis on FakeM original variants, we came across shared\n\ninfrastructure with domains that hosted C2 servers for malware samples that did not match the\n\nknown FakeM communication protocols. Palo Alto Networks WildFire had analyzed many samples\n\nassociated with these related C2 domains, all of which communicated with the C2 server using\n\nsecure sockets layer (SSL). To determine the malware family that was generating this traffic, Unit 42\n\nanalyzed these samples and found that the functional code was the same as the original FakeM\n\nvariant.\n\nThis discovery indicates the authors of FakeM introduced new code to the Trojan in order to use SSL\n\nto communicate with its C2 server. The drastic change in C2 channel warranted a new variant name,\n\nd d bb d it “F k M SSL” D i th l i f th l did t fi d ti l\n\n\n-----\n\nSSL samples will tell the server it supports 36 different cipher suites even though the samples appear\n\nto only support one. Unit 42 believes the cipher suite within the FakeM SSL variants uses Diffie­\n\nHellman for key exchange and the RC4 cipher to encrypt the C2 communications.\n\n**FakeM Custom SSL**\n\nIn July 2015, Scarlet Mimic delivered a spear­phishing email to a branch of the Russian government\n\nwith intentions of installing a payload that was undetected by any antivirus vendors on VirusTotal. The\n\nhigh profile target and the lack of antivirus detection prompted Unit 42 to perform an in­depth\n\nanalysis and found that it is yet another new variant of the FakeM Trojan. We also named this variant\n\nafter it’s communication protocol (FakeM Custom SSL.)\n\nThis new variant of FakeM shared the same functional code as its predecessors, but again the\n\ncommunications with the C2 dramatically differed from the other variants. Communications between\n\nthis variant and the C2 server leverage what Unit 42 believes is modified SSL code, as the code is\n\nvery similar to the FakeM SSL variant. The code appears to use Diffie­Hellman for key exchange and\n\nthe RC4 algorithm like FakeM SSL; however, the initial packet sent to the C2 server did not contain a\n\n“client hello” message, which is required to initiate an SSL handshake. Instead, the initial packet sent\n\ndata as seen in Figure 13.\n\nFigure 13: Hexdump of FakeM custom SSL variant\n\nThis variant of FakeM skips the traditional SSL handshake, which involves an agreement on a cipher\n\nsuite to use to encrypt communications. The FakeM code only supports one cipher suite, which\n\nmakes the cipher suite agreement portion of the SSL handshake irrelevant. Instead, FakeM creates a\n\nsession with its C2 server by exchanging keys. The lack of a valid handshake makes detection of this\n\nC2 stream difficult, as the packets sent between the Trojan and the C2 to establish this session\n\ncontain random binary data. Network devices will also be unable to perform any SSL decryption due\n\nto the lack of detection and the inability to determine the cipher suite used to encrypt the data. Figure\n\n14 below provides a visual depiction of the handshake procedure and the subsequent beacon and\n\ncommand messages.\n\n\n-----\n\nFigure 14: Communications between system and C2 server, including the key exchange\n\nThe handshake starts with a key exchange, which the Trojan initiates by creating a 2048­byte buffer\n\nthat it will store its key (128­bytes, followed by null values as seen in Figure 13) and sending its key to\n\nthe C2 server. The C2 will respond with its own key (also 128­bytes, followed by null values) that the\n\nTrojan will store and use to encrypt future communications.\n\nOnce this key exchange is complete, the Trojan acknowledges the receipt of the server’s key by\n\nsending another 2048­byte packet to the server. To build the acknowledgement packet, the Trojan\n\ncreates a 2048­byte buffer filled with null values and copies the string “ws32.dll” to offset 8 and\n\nencrypts the buffer with the server’s key.\n\nAfter sending the acknowledgement packet, the Trojan will gather local system information and\n\ninclude it in a beacon to the C2 server. Like the packets sent in the key exchange, the beacon sent\n\nby the Trojan to the C2 server is 2048­bytes in length; however, the system information gathered by\n\nthe Trojan is only 296 bytes followed by 1752 are null values to fill the 2048 byte buffer. The system\n\ninformation follows the 296­byte structure seen below:\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n\n-----\n\nCHAR username[128];\n\nCHAR computername[128];\n\nDWORD static_value_70000h;\n\nDWORD os_codepage;\n\nDWORD campaign_code_1;\n\nDWORD campaign_code_2;\n\n};\n\nThe Trojan will encrypt this data using the key provided by the C2 and send it to the server. The\n\nTrojan will then wait for the C2 to respond, which it will decrypt and parse for FakeM commands. Unit\n\n42 has been unable extract any plug­ins from C2 network traffic; however, several FakeM custom\n\nSSL samples contain embedded plug­ins that run without interaction with the C2 server. Also, Unit 42\n\nwas able to extract several modules from the original FakeM server application, as seen in Table 3.\n\nAll of these modules are shellcode­based plug­ins that would work with the custom SSL variant of\n\nFakeM with little to no modification.\n\n\n**Size**\n**MD5**\n\n**(bytes)**\n\n\n**Description**\n\n\nProcess\n7a1410b2eceb99ec268b50e9371e74c1 3724\n\nPlug­ins\n\nShell Plug­\n092085e76512f071cab12f76ed09b348 2412\n\nins\n\n\n8f4cbb78356cb672bf2566e44315eb96 1768 File Plug­ins\n\nScreen Plug­\n16ab40f84fc47bab2c7874bb3164c5b4 2268\n\nins\n\n\nRegedit\n30337e99631a174d822dd3ea00a5f6cf 2204\n\nPlug­ins\n\nService\n1f3fbb789bcbe9186a50c4f4db269736 1996\n\nPlug­ins\n\n\nHostInfo\n4313d9d5fc6a090e2abc41633cb2c1fd 3196\n\nPlug­ins\n\nKeyBoard\nfe75dff8b86dd8989d2ca00df19d51be 2220\n\nPlug­ins\n\n\nShell Plug­\n3e184a7af74905f3d3acbec913252f72 1884\n\nins\n\n\nOE Pwd\n\n\n-----\n\nU­Files Plug­\n83ec457cba27e470404c942eb9242eeb 2156\n\nins\n\nTable 3: Modules extracted from the original FakeM variant’s server application\n\n**Related to FakeM Original: CallMe**\n\nCallMe is a Trojan designed to run on the Apple OSX operating system. This Trojan was delivered in\n\ntargeted attacks on Uyghur activists in 2013 and used infrastructure associated with FakeM.\n\n[In February 2013, AlienVault performed analysis on the CallMe Trojan and found that it is based on a](https://www.alienvault.com/open-threat-exchange/blog/cyber-espionage-campaign-against-the-uyghur-community-targeting-macosx-syst)\n\ntool called Tiny SHell, an OSX shell tool whose source code is available on the Internet. The Trojan\n\nuses AES to encrypt the communication channel its C2 server, which will provide one of three\n\ncommands to carry out activities on the compromised system, as seen in Table 4.\n\nCommandDescription2Put a file on the system from the C2 server. File is saved to a specified\n\nfilename in <HOME directory>/downloads/.3Create a reverse shell to interact with the compromised\n\nsystem.\n\nTable 4: Commands Available in the CallMe OSX Malware\n\nThe infrastructure overlap between FakeM and CallMe involves the fully qualified domain name\n\n(FDQN) of “googmail.org”, which was used by both FakeM and CallMe samples. This suggests that\n\nnot only do these threat actors have the ability to compromise victims running the Microsoft Windows\n\noperating system, but they can also target individuals running Apple’s OSX as well.\n\n**Related to FakeM Custom SSL: Psylo**\n\nDuring infrastructure analysis of FakeM Custom SSL variants, Unit 42 found infrastructure overlaps\n\nbetween FakeM and another new, previously unreported Trojan that we named “Psylo”. Psylo is a\n\ntool that allows threat actors to upload and download files to and from a compromised system, as\n\nwell as execute commands and applications on the system. The name Psylo is an anagram from the\n\nmutex created when initially running this payload, which is ‘hnxlopsyxt’.\n\nPsylo is similar to FakeM in that they are both shellcode­based, and they have similar configurations\n\nand C2 communication channels. As you can see from the following two configuration structures,\n\nPsylo and FakeM have similar configurations with only the array length of the C2 locations being\n\ndifferent.\n\nstruct psylo_c2_config {char[60] c2_host_1;char[60] c2_host_2;char[60] c2_host_3;DWORD\n\nc2_port_1;DWORD c2_port_2;DWORD c2_port_3;};struct fakem_customssl_c2_config {char[64]\n\nc2_host_1;char[64] c2_host_2;char[64] c2_host_3;DWORD c2_port_1;DWORD c2_port_2;DWORD\n\nc2_port_3;};\n\nFi 15 C i b t P l d F k M t SSL fi ti\n\n\n-----\n\nout the Diffie Hellman key exchange. We compared the Diffie Hellman code from Psylo with FakeM\n\ncustom SSL variant and found that they were very similar, but the FakeM samples had some of the\n\nfunctionality within sub­functions, which rendered binary diffing between the two Trojans impossible.\n\nAnother slight difference involves how Psylo and FakeM generate random numbers for SSL. FakeM\n\nuses QueryPerformanceCounter to create a random number, whereas Psylo uses CryptGenRandom,\n\nboth of which generate random numbers 68 bytes long. Interesting enough is that CryptGenRandom\n\ncalls RtlGenRandom, which uses QueryPerformanceCounter along with other system attributes to\n\ngenerate a random number.\n\nWhen communicating with its C2 server, Psylo will use HTTPS with a unique user­agent of (notice the\n\nlack of a space between “5.0” and “(Windows”):\n\n_Mozilla/5.0(Windows NT 6.1; WOW64; rv:24.0) Gecko/20100101 Firefox/24.0_\n\nUnit 42 does not consider Psylo another variant of FakeM because Psylo has a command handler\n\nthat differs dramatically from FakeM. Table 5 shows the Psylo command handler, which suggests it is\n\nless modular and supports more embedded functionality when compared to FakeM. It is possible that\n\nthe threat actors created this Trojan as a standalone alternative to FakeM.\n\n**Command** **Description**\n\n0 Idles for 10 seconds.\n\n2 Enumerate all storage devices.\n\n3 Find all files that starts with a particular string (%s*.*).\n\n\n5\n\n\nCreates a file to write to, deleting it if it already exists.\n\nCombined with ‘E’ command to download a file to the\n\nsystem.\n\n\nE\n\n\nWrites data from C2 to a file opened using the ‘5’\n\ncommand. Combined with ‘5’ command to download a\n\nfile to the system.\n\n\nReads a file, which effectively uploads the file to the\n6\n\nC2.\n\n7 Delete a specified file.\n\n\nExecute a command using WinExec. Responds to C2\n8\n\nwith ‘s’ if successful or ‘r’ if unsuccessful.\n\nTimestomps. Sets a specified file’s timestamps to\n9\n\nmatch that of a system file in the System32 directory.\n\n\n-----\n\n### MobileOrder: Mobile Devices the Next Frontier\n\nAnother discovery we made while researching this blog is an overlap between Psylo infrastructure\n\nand a Trojan focused on compromising Android mobile devices. Unit 42 tracks this mobile Trojan as\n\nMobileOrder, as the authors specifically refer to commands within the app as orders. The connection\n\nbetween FakeM, Psylo, and MobileOrder suggest that Scarlet Mimic is now expanding their\n\nespionage efforts from PCs to mobile devices, which marks a major shift in tactics.\n\nMobileOrder starts by registering itself as device administrator so that a normal user cannot uninstall\n\nit by simply clicking “uninstall” in settings. It will copy an embedded PDF file from “res/raw/rd.pdf” to\n\nSD card “/android/9074ca3f18e201c204ec1d852264bb5432644ba46f54f361a146957.pdf” and\n\nlaunches the mobile device’s default PDF viewer to display this PDF file, which acts as a decoy\n\ndocument. After displaying the decoy document, the malicious code runs in background. The\n\nmalicious code consists of the following parts:\n\n[1. An Android geographical location SDK provided by AMAP.](http://lbs.amap.com/)\n\n2. Actor developed code that carries out Trojan’s functionality.\n\nThe malware uses the AMAP SDK to get accurate location of infected devices by GPS, mobile\n\nnetwork (such as base stations), WiFi and other information. MobileOrder acts on instructions\n\nprovided by its C2 server, which it communicates with over TCP port 3728. All C2 communications\n\nare encrypted with the AES algorithm using a key generated by computing five MD5 hashes starting\n\nwith the key “1qazxcvbnm”, and adding a salt value of “.)1/” in each iteration.\n\nThe C2 server will respond to requests from MobileOrder with commands that the Trojan refers to as\n\n“orders”. MobileOrder contains a command handler with functionality that provides a fairly robust set\n\nof commands, as seen in Table 6. The first byte of data provided by the C2 server is order number,\n\nwhich is followed by the encrypted data that needed to carry out the specific order.\n\n\n**Order**\n\n**#**\n\n\n**Order Name** **Behaviors**\n\n\nUpload names and attributes\n18 Order_Folder_List\n\nof files under specified path\n\nUpload all running processes\n20 Order_Process_List\n\ninformation\n\n\nUpload device information\n\nincluding IMEI, IMSI, SIM card\n\nserial number, phone number,\n\nAndroid version, device\n\nmanufacturer device model\n\n\n-----\n\ndevice locking status, country,\n\ncarrier, time zone, language,\n\ninstall app list, browser\n\nbookmarks, etc.\n\n26 Order_FileDelete Delete specified file\n\nDownload specified file to SD\n\n\n27 Order_DownLoad\n\n\ncard’s Android/data/tmp/\n\ndirectory.\n\n\nUpload specified file to C2\n28 Order_UpFile\n\nserver\n\n\n51 Order_Sms\n\n\nUpload all received and sent\n\nSMS addresses, content, date,\n\ntime to C2 server\n\n\nUpload all contacts’\n52 Order_Contact\n\ninformation to C2 server\n\nUpload all phone calling\n53 Order_Call\n\nhistory information\n\n\nTake a picture by device’s\n54 Order_Camera_front_photo\n\nfront camera\n\n56 Order_SetSleepTime Set sleep time interval\n\n57 Order_SetOnline Stop sleep\n\n\nStart audio recorder in\n58 Order_SetMediaRecorder\n\nspecified time\n\n\n59 Order_GetLoc\n\n\nUpload information about\n\nnetwork operator, MCC, MNC,\n\nnetwork type, GSM cell\n\nlocation, CID, LAS, BSSS, etc.\n\nThis information can be used\n\nto locate the device.\n\n\nUpload GPS location by AMAP\n60 Order_GetGps\n\nSDK.\n\n\nActivate phone calling\n\n\n-----\n\nDeactivate phone calling\n62 Order_SetTelRecorderOff\n\nrecording\n\n\n81 Order_Install\n\n\nInstall specified APK file. May\n\ninstall silently or install to\n\nsystem app according to C2\n\ncommand data\n\n\n82 Order_Uninstall Uninstall specified app\n\n84 Order_StartApp Launch specified app\n\nSend specified Android\n\n\n85 Order_SendBroadcast\n\n\nbroadcast to launch other\n\napps\n\n\nExecute specified shell\n86 Order_Shell\n\ncommands\n\nStart geolocation tracking in\n87 Order_OpenTrack\n\nAMAP SDK\n\n\nStop geolocation tracking in\n88 Order_CloseTrack\n\nAMAP SDK\n\n\n90 Order_CheckScreen\n\nTable 6: MobileOrder command handler\n\n\nCheck whether phone screen\n\nis on (or said whether the\n\nphone is used by its owner)\n\n\n### Infrastructure Overlap and Related Tools\n\nThere is some infrastructure overlap in the C2 servers used by almost all of the FakeM variants, as\n\nwell other Trojans such as MobileOrder, Psylo, and CallMe. There are also infrastructure ties\n\nbetween some FakeM variants and older activity using Trojans such as Elirks, Poison Ivy, and\n\nBiFrost, which were used in attacks as old as 2009. The domain names used to host C2 servers are\n\na mix of actor­registered and Dynamic DNS (DDNS,) though most are DDNS. The DDNS domains in\n\nturn are linked to a small grouping of ASNs, with one ASN often largely tied to one FakeM variant.\n\nMost of the FakeM MSN C2s resolve to IP addresses associated with ASN 22781 (RBLHST –\n\nReliablehosting.com). However, we found one MSN sample that shared infrastructure with some\n\nFakeM Custom SSL variants.\n\nThere is a similar overlap between FakeM MSN, FakeM HTML, and FakeM SSL. The registrant email\n\n\n-----\n\nactivity at the same time it was being used for FakeM MSN samples. The targeting and decoy style\n\nalso matches with the FakeM activity.\n\nThere is PE resource overlap between some FakeM MSN samples and some samples of the BiFrost\n\nand Poison Ivy Trojan. This may indicate that the same developer who created the particular BiFrost\n\nand Poison Ivy samples was also involved in developing FakeM MSN. Unit 42 found an overlap\n\nbetween the RT_VERSION resources, which contains the version information of a Portable\n\nExecutable (PE) file, shared amongst the three different Trojans. The shared RT_VERSION resource\n\n(MD5: 55b7a118203a831cc69b37b785015c54) contained the following information:\n\nComments: Release\n\nCompanyName: Develop Team\n\nFileDescription: Utility Application\n\nFileVersion: 4.0\n\nInternalName: Utility\n\nLegalCopyright: Copyright (C) 2008\n\nLegalTrademarks: DT.Inc\n\nOriginalFilename: Utility.EXE\n\nPrivateBuild: 4.0b\n\nProductName: Utility Application\n\nProductVersion: 4.0\n\nThe overlap between Elirks, FakeM SSL, Psylo, and MobileOrder exists entirely in their command\n\nand control infrastructure, through domain names and/or IP resolution. Samples of these three used\n\nsome of the same C2 domains, notably lenovositegroup[.]com, ufoneconference[.]com, and\n\nwebsurprisemail[.]com, while some resolution overlap includes 118.193.212[.]12, 210.206.219[.]241,\n\nand 59.188.239[.]117. Similarly, some FakeM Yahoo C2 domains and FakeM Custom SSL C2\n\ndomains also have overlapping IP resolutions, notably 95.154.204[.]198.\n\nScarlet Mimic also uses the infamous HTRAN tool on at least some of their C2 servers. HTRAN is a\n\nproxying tool that allows actors to conceal the true location of their C2 server. Actors will run HTRAN\n\non a server and configure their malware to interact with that server; however, the actor will configure\n\nHTRAN to forward traffic to another server where the actual C2 server exists. For example, the\n\n[1]\n\nFakeM C2 domain of “muslim.islamhood[.]net” resolved to the IP address 59.188.239.117 during\n\nanalysis, but the server responded with the following error message:\n\n_[SERVER]connection to 68.71.35.135:8081 error_\n\nThis error message suggests that the HTRAN application running on 59.188.239.117 was unable to\n\nconnect to the real C2 server hosted at 68.71.35.135.\n\n## Prior Publications\n\n\n-----\n\nreaders may also find the following publications interesting.\n\n[In 2014, Citizen Lab released a paper on threats against civil society that referenced some of these](https://targetedthreats.net/media/2.2%20Extended%20Analysis-Cluster.pdf)\n\nattacks as the “Domain Name Family” or DNF.\n\nKaspersky Lab has produced excellent research on attacks against Uyghur and Tibetan activists. In\n\n[2013, they identified an Android Trojan that was also targeting these groups. Our analysis indicates](https://securelist.com/blog/incidents/35552/android-trojan-found-in-targeted-attack-58/)\n\nthis malware is different from the MobileOrder Trojan described above, but they serve very similar\n\npurposes.\n\n[On January 12, 2016, Cylance published a blog linking an exploit document to the group Mandiant](https://blog.cylance.com/puttering-into-the-future)\n\nrefers to as APT2 and CrowdStrike as “Putter Panda.” While there does appear to be a small overlap\n\nbetween IP addresses used in attacks from this group and those of Scarlet Mimic, our team has not\n\nconcluded that these groups are one in the same.\n\n## Conclusion\n\nThe information discovered by Unit 42 and shared here indicates Scarlet Mimic is likely a well­funded\n\nand skillfully resourced cyber adversary. Scarlet Mimic has carried out attacks using both spear­\n\nphishing and watering holes since at least 2009 with increasingly advanced malware, and has\n\ndeployed malware to attack multiple operating systems and platforms. Despite the apparent technical\n\nacumen, their decoy documents are typically not well crafted regardless of the use of the target’s\n\nlanguage, though they do use timely subject lures.\n\n[The primary source of data used in this analysis is Palo Alto Networks WildFire, which analyzes](https://www.paloaltonetworks.com/products/technologies/wildfire.html)\n\nmalware used in attacks from around the globe. The system is also fed with malware samples\n\ncollected through sharing partnership with other security vendors, including our partners in the Cyber\n\nThreat Alliance. To connect attacks to each other based on malware behavior and command and\n\n[control infrastructure, we relied on Palo Alto Networks AutoFocus threat intelligence. AutoFocus users](https://www.paloaltonetworks.com/products/platforms/subscriptions/autofocus.html)\n\ncan view all of the files related to Scarlet Mimic and the malware associated with the group using the\n\nfollowing links:\n\nPalo Alto Networks customers are protected from Scarlet Mimic attacks through many components of\n\nour platform.\n\nThreat Prevention signatures for the software vulnerabilities listed in this report are available to\n\ndetect the exploit files during delivery.\n\nTraps, our advanced endpoint solution, can prevent the software vulnerabilities listed in this report\n\nfrom being exploited on a Windows host.\n\nWildFire classified all of the Android and Windows malware described in this report as malicious.\n\nWe have released anti­malware signatures for the files listed in this report.\n\nThe domain names used for command and control have been classified as malicious in PANDB.\n\n\n-----\n\n### FakeM Custom SSL Samples\n\n12dedcdda853da9846014186e6b4a5d6a82ba0cf61d7fa4cbe444a010f682b5d\n\n33e50c44804d4838dba6627b08210029ff9106fa7fd16cd7255271e153f58b05\n\n3d9bd26f5bd5401efa17690357f40054a3d7b438ce8c91367dbf469f0d9bd520\n\n5182dc8667432d76a276dc4f864cdfcef3e481783ebaf46d3b1397080b798f4a\n\n523ad50b498bfb5ab688d9b1958c8058f905b634befc65e96f9f947e40893e5b\n\n5dade00db195087aa336ce190b5fd1c22992c49556c623b42a9f742d73241a7f\n\n7156f6416e7116e52f9c67f4e716b1dbea17387e61009c7f2825debbbb4dcb73\n\n79aca57905cca1e56b0cedf48a4d81812639c333ee6532d90a074d64b3852d6f\n\n879edf0417c4a9759040b51bf83b2fc918a6644a7c29a52252003a63036aea5c\n\n9b77bbb620f50632fae17c40c7469fc93ffdbc4136a6d893a9a10a44bc435da5\n\na1b7fe2acdb7a5b0c52b7c1960cfad531a7ca85b602fc90044c57a2b2531699f\n\na268cc4931781d1d8094a4f8f596c2de3d662f2581c735b0810ff0ecefe3f859\n\na4abbcfdbf4a6c52349a843eac0396e6d8abb05f1324223980d824629a42ef7a\n\na569f3b02a4be99e0b4a9f1cff43115da803f0660dd4df114b624316f3f63dc6\n\nb4c1e9c99f861a4dd7654dcc3548ab5ddc15ee5feb9690b9f716c4849714b20d\n\nbbdedcfe789641e7f244700e8c028ef51094b66508f503876eb0d6aa16df6aa8\n\nc7b9e6b5ab07e6da404af9894c8422d9a0c9586334ddc0a3c1ea6bf23ef97fb2\n\ncaeace73a17e220634525d2a4117525fd60cb86a06873c86571e89d156f8d72d\n\ncaf76e19a2681dd000c96d8389afc749e774c083aef09f023d4f42fbc49d4d3d\n\ne96097826179a66cc3061be0f99f7b55cc9692a6378b5c4364699327823098ab\n\nf511b13341c9fb4ec9ecfcfe5a5813b964c362d7c709c402ead4e010d857bf6c\n\nfa08a498da0b31e77669d51a28dff166d84983fa6af693063c08f312fdce93e3\n\ndf9872d1dc1dbb101bf83c7e7d689d2d6df09966481a365f92cd451ef55f047d\n\n### FakeM SSL Samples\n\n0aab09bf0db30a4be28d19475082fd5e7f75879bf9029fdd8dfc3a1e1f072b0c\n\n2e1472a65a8df43c8bc9b0aff954fbc1a093c4214f6a718a08e1321db83ca683\n\n3209ab95ca7ee7d8c0140f95bdb61a37d69810a7a23d90d63ecc69cc8c51db90\n\n41948c73b776b673f954f497e09cc469d55f27e7b6e19acb41b77f7e64c50a33\n\n4a4dfffae6fc8be77ac9b2c67da547f0d57ffae59e0687a356f5105fdddc88a3\n\n5154511a439bb367b7dd56232eb15281cb6dc4d64ea3a06e7fbbe6b176e385d4\n\n5fae5750797ebe7e7a6a6919a7d66deffb141ec28737bd72a1f7da8edd330b60\n\naa8a302a53bd39b2d2a6e3d8497575e2a5f9757b248e34c8e0821ce9eee5cc32\n\nb3c9bb22fa1bc358dc23a1a4bdaf85ad1add4d812b107b7ab887affbf689933a\n\ncd506679fd32dab16dee6fbf1cfdfe0836e092a4f5669418a199d99c9cd33abd\n\nd1dd4469c7b5c462e5ff2dcef5d22775250e9ebf395f65da624f18ea7144e173\n\nd698008e417da867d02e2f5cdcc80ff92af753dd585fada42fc611c2d7332c3a\n\n\n-----\n\n53af257a42a8f182e97dcbb8d22227c27d654bea756d7f34a80cc7982b70aa60\n\n9adda3d95535c6cf83a1ba08fe83f718f5c722e06d0caff8eab4a564185971c5\n\n53cecc0d0f6924eacd23c49d0d95a6381834360fbbe2356778feb8dd396d723e\n\n631fc66e57acd52284aba2608e6f31ba19e2807367e33d8704f572f6af6bd9c3\n\n7bfbf49aa71b8235a16792ef721b7e4195df11cb75371f651595b37690d108c8\n\n7c9421a4605decfa1b3e22addbca98d86ea757dcd8ff8e075d13228c99618637\n\n202975d10ba417cf441e8f9986d2496807fe39e057d3226ec3b2713f0c218cd8\n\n22e7517d8996e92998eb996416f9d8ef06b3b1c220c1a5d29ccd5aaef7b10c72\n\n435df30d139ccbe5ce4e5ca6fe072e42e96d5ea1efd5317deebce462ecccc7ab\n\n47d9ba5f7bf70c5d2b7a832e070957cc7ebdcfd0a6ee75851df16dc45971ce8a\n\n4a3d0df9fa198a7ebe45db5239d22067e74924b1aace52029b3acc9b51af691e\n\n4d539f638ed476ca08da838cdfbf710dae82b582256d60a009e9d304f6822e65\n\nbe0e8da7e261ec7d08eaa78e79ceb1be47c324b8e142097bf6569f9471c98a4e\n\nc30d03750458bb5f2b03d6bd399ffca6d378a3adb5a74bee3b6ba4b982dbf273\n\ncc7db456825e266849090b6fa95a94ad8c4c717712b610b0d39077af5222f4be\n\nd6d2a77f8ed2fe9fed9ee6dcb4cc0b339ba47a575c717c35815243c752d8f60c\n\ndb8338e6b883fdceaa02c10ad683547a26ae32e0d4641cc24c7bd3b45154abb0\n\ne8e5ecf525c5259651bfbdf1923215729ec67658225eca1b02519f5f6279eacb\n\nec4deb761b09ddc706804ef669836cf4b199f1d74b14ad623a6f6cc2f38190b8\n\n669ce0975c133d54e414dbf1de546aed742e76fe3e60568e2bd4747b7e0f8b70\n\n0d77f5f1d4c0f02fb88ac33fa365b17d28d1521cea59329ca4b3dd0b7031a60e\n\n363d9557861fab2d83d04847b967996361e670e571b335c7a535bc6278cba149\n\n7fb2c37431fd7b05414b134732ba0b29cd7dad17fc176627ee0815aac60c1ab9\n\n77e4ef9e08f1095487b4fa27492b4c9b8e833f29598f99a0d10f7c85b4254761\n\na4ffca5f1c3d9c21629fa98a1e91121d954ab9347e86ac3c9613dae61bf30393\n\n428121c421bf81a0d689014cf21ec7951b0c32add86198e06f7d636981f68755\n\na195f564aa2fb66db119e2fbec93e319a973e5cf50fbf9fc08bd81f9b7ee8af8\n\nc1e8ff8ebe3754bc7d14509ef3678edf7551d876d3fa847d07d469c09bceae91\n\n53238f67ac7e4cc27264efbacc8712bd97a5775feaf633c63adaa0785d038e8a\n\n508a7cab0f2a69ba66e92e86817a49ecd1b9c8ae11a995147944995fc868dfad\n\nfb60d14de4dba022f11437845d465a661d0c78d3d097a38770816f06992bf0af\n\n8da2f9afd914a4318a97f4d74809c0c383f8ebf0d3d6e3d3715efbd71a66a52f\n\n6fe33c672fd30bba9bbc89dc7d88993d8783382c9f9c510677b1bb068a5f1e51\n\n6a1c7999b4ba92899d3364fc729d0f052680be5a71dd0f13cbabdb19b82bf858\n\n5db51f2f7c31de7d165ec4892ae7dcedaa036caedeef718b57953d7935582f04\n\n27167a9d63f5ddc68a12decb1a1e0a2a29c72fe0681dca2c4f3d169f048a9d38\n\n6f10c892133b5dac6c40cfe77ca32b42572bc56909481b236080dfc143ef9afd\n\nde12cd8d11478d17342c60239837c1afcc9fee72df6ffdf9943802640d43f77a\n\n0f2db64b8283b76d49c9bb272beafab8323f941b6dc3888b42ff02f08634d016\n\n\n-----\n\na9f0bddc3d3516af8355e8ac17309528cd018347e5f56a347c14da0a83b0028a\n\n00bb399c429e0f1f7de751103fe92b5f820d1686d01662a08583b7a94aaed94e\n\n### MobileOrder Sample\n\n03004ccc23033a09532bea7dfa08c8dfa85814a15f5e3aedb924a028bcd6f908\n\n### CallMe Samples\n\n071c34b9701dd84f9590ba899a8af3eeec228a928f2d98a80dbc780e396ee01a\n\nd1f0658bbb15ab2bccc210d7e1f21b96e14ae22de8494ca95b12e182f3d0f693\n\n9ff687a813a5cb5ff10374c86f852534c1aa3e5a221123214bf52b2ff455a5da\n\n8c423506c0c7ebe1e61071374ecf0806463a02a2100b5daa1bd942129ff8a235\n\n91e36e720477146f1a0c050d3bc74bc6683a03e7631317ded3c598a10465dcc8\n\nc981db20d588ba2d0f437b4e5459e7c6763f52a97841450c94591ca28a9a2d69\n\n95dba004f949e44cb447246f3d2420b01db4541d0e4fa7b00d798f38a3d251e4\n\n### FakeM Custom SSL C2 Servers\n\naaa123.spdns[.]de\n\nadmin.spdns[.]org\n\ndetail43.myfirewall[.]org\n\neconomy.spdns[.]de\n\nfirefox.spdns[.]de\n\nfirewallupdate.firewall­gateway[.]net\n\nintersecurity.firewall­gateway[.]com\n\nkaspersky.firewall­gateway[.]net\n\nkasperskysecurity.firewall­gateway[.]com\n\nkissecurity.firewall­gateway[.]net\n\nmail.firewall­gateway[.]com\n\nnews.firewall­gateway[.]com\n\nopero.spdns[.]org\n\nsys.firewall­gateway[.]net\n\n### FakeM SSL C2 Servers\n\naccount.websurprisemail[.]com\n\naddi.apple.cloudns[.]org\n\nbailee.alanna.cloudns[.]biz\n\nbee.aoto.cloudns[.]org\n\nbook.websurprisemail[.]com\n\ndesk.websurprisemail[.]com\n\ndolat.diyarpakzimin[.]com\n\n\n-----\n\ngithub.ignorelist[.]com\n\nislam.youtubesitegroup[.]com\n\nmareva.catherine.cloudns[.]us\n\nmuslim.islamhood[.]net\n\np.klark.cloudns[.]in\n\nppcc.vasilevich.cloudns[.]info\n\npress.ufoneconference[.]com\n\nvip.yahoo.cloudns[.]info\n\n### FakeM Original C2 Servers\n\n207.204.225[.]117\n\naccounts.yourturbe[.]org\n\naddnow.zapto[.]org\n\nbits.githubs[.]net\n\nclean.popqueen.cloudns[.]org\n\neconomy.spdns[.]eu\n\neemete.freetcp[.]com\n\nemail.googmail[.]org\n\nfish.seafood.cloudns[.]org\n\nfreeavg.sytes[.]net\n\nfreeonline.3d­game[.]com\n\nibmcorp.slyip[.]com\n\nlemondtree.freetcp[.]com\n\nliumingzhen.myftp[.]org\n\nliumingzhen.zapto[.]org\n\nn.popqueen.cloudns[.]org\n\nnews.googmail[.]org\n\noic­oci.3­a[.]net\n\npolat.googmail[.]org\n\nqq.ufoneconference[.]com\n\nqq.yourturbe[.]org\n\nsisiow.slyip[.]com\n\nupdate.googmail[.]org\n\nuprnd.flnet[.]org\n\nvideo.googmail[.]org\n\nwebmail.yourturbe[.]org\n\nworldwildlife.effers[.]com\n\nwww.angleegg.ddns[.]us\n\nwww.angleegg.xxxy[.]info\n\nwww.googmail[.]org\n\n\n-----\n\nzjhao.dtdns[.]net\n\n### Psylo C2 Servers\n\napple.lenovositegroup[.]com\n\nmm.lenovositegroup[.]com\n\nftp112.lenta.cloudns[.]pw\n\nwww.gorlan.cloudns[.]pro\n\notcgk.border.cloudns[.]pw\n\n### MobileOrder C2 Servers\n\nziba.lenovositegroup[.]com\n\n### CallMe C2 Servers\n\napple12.crabdance[.]com\n\nupdate.googmail[.]org\n\napple12.crabdance[.]com\n\nalma.apple.cloudns[.]org\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/zhour42vz6sxf7aws3oj70i1rd5ib8kx"
    ],
    "report_names": [
        "PaloAlto_Scarlet-Mimic(Jan-24-16)"
    ],
    "threat_actors": [
        {
            "id": "8c5c318c-0e71-4184-92bb-d1c28f68a411",
            "created_at": "2022-10-25T15:50:23.692481Z",
            "updated_at": "2025-03-27T02:00:55.525121Z",
            "deleted_at": null,
            "main_name": "Scarlet Mimic",
            "aliases": [
                "Scarlet Mimic"
            ],
            "source_name": "MITRE:Scarlet Mimic",
            "tools": [
                "Psylo",
                "MobileOrder",
                "CallMe",
                "FakeM"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "abd17060-62f6-4743-95e8-3f23c82cc229",
            "created_at": "2022-10-25T15:50:23.428772Z",
            "updated_at": "2025-03-27T02:00:55.466186Z",
            "deleted_at": null,
            "main_name": "Putter Panda",
            "aliases": [
                "Putter Panda",
                "APT2",
                "MSUpdater"
            ],
            "source_name": "MITRE:Putter Panda",
            "tools": [
                "pngdowner",
                "3PARA RAT",
                "4H RAT",
                "httpclient"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9fc2aed1-c838-41e9-b469-922e7bab6f94",
            "created_at": "2022-10-25T16:07:24.162936Z",
            "updated_at": "2025-03-27T02:02:10.128098Z",
            "deleted_at": null,
            "main_name": "Scarlet Mimic",
            "aliases": [
                "Golfing Taurus"
            ],
            "source_name": "ETDA:Scarlet Mimic",
            "tools": [
                "BrutishCommand",
                "CallMe",
                "CrypticConvo",
                "Elirks",
                "FakeFish",
                "FakeHighFive",
                "FakeM",
                "FakeM RAT",
                "FullThrottle",
                "HTran",
                "HUC Packet Transmit Tool",
                "MobileOrder",
                "Psylo",
                "RaidBase",
                "SkiBoot",
                "SubtractThis",
                "Terminator RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a1ce86c2-3efc-4115-a85e-92c5fa461838",
            "created_at": "2022-10-25T16:47:55.561071Z",
            "updated_at": "2025-03-27T02:05:17.261424Z",
            "deleted_at": null,
            "main_name": "BRONZE ELGIN",
            "aliases": [
                "Lotus Blossom ",
                "Lotus Panda ",
                "Lstudio",
                "Spring Dragon ",
                "CTG-8171 "
            ],
            "source_name": "Secureworks:BRONZE ELGIN",
            "tools": [
                " Lzari",
                "Elise"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "468b7acd-895c-4c93-b572-b42f4035b4d4",
            "created_at": "2023-01-06T13:46:38.265636Z",
            "updated_at": "2025-03-27T02:00:02.788514Z",
            "deleted_at": null,
            "main_name": "APT2",
            "aliases": [
                "G0024",
                "PLA Unit 61486",
                "PUTTER PANDA",
                "MSUpdater",
                "4HCrew",
                "SearchFire",
                "TG-6952"
            ],
            "source_name": "MISPGALAXY:APT2",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cac03bbf-0c42-470d-951e-0e92656be6cb",
            "created_at": "2023-01-06T13:46:38.463275Z",
            "updated_at": "2025-03-27T02:00:02.840123Z",
            "deleted_at": null,
            "main_name": "Scarlet Mimic",
            "aliases": [
                "G0029",
                "Golfing Taurus"
            ],
            "source_name": "MISPGALAXY:Scarlet Mimic",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2fa14cf4-969f-48bc-b68e-a8e7eedc6e98",
            "created_at": "2022-10-25T15:50:23.538608Z",
            "updated_at": "2025-03-27T02:00:55.495551Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "Lotus Blossom",
                "DRAGONFISH",
                "Spring Dragon",
                "RADIUM",
                "Raspberry Typhoon"
            ],
            "source_name": "MITRE:Lotus Blossom",
            "tools": [
                "Elise"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7c8cf02c-623a-4793-918b-f908675a1aef",
            "created_at": "2023-01-06T13:46:38.309165Z",
            "updated_at": "2025-03-27T02:00:02.801298Z",
            "deleted_at": null,
            "main_name": "APT15",
            "aliases": [
                "BRONZE PALACE",
                "Nylon Typhoon",
                "VIXEN PANDA",
                "Playful Dragon",
                "BRONZE DAVENPORT",
                "BRONZE IDLEWOOD",
                "G0004",
                "Red Vulture",
                "Ke3Chang",
                "Metushy",
                "Lurid",
                "Social Network Team",
                "Royal APT"
            ],
            "source_name": "MISPGALAXY:APT15",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "eaa8168f-3fab-4831-aa60-5956f673e6b3",
            "created_at": "2022-10-25T16:07:23.805824Z",
            "updated_at": "2025-03-27T02:02:09.986613Z",
            "deleted_at": null,
            "main_name": "Lotus Blossom",
            "aliases": [
                "ATK 1",
                "ATK 78",
                "Billbug",
                "Bronze Elgin",
                "CTG-8171",
                "Dragonfish",
                "Lotus Blossom",
                "Operation Lotus Blossom",
                "Red Salamander",
                "Spring Dragon",
                "Thrip"
            ],
            "source_name": "ETDA:Lotus Blossom",
            "tools": [
                "BKDR_ESILE",
                "Catchamas",
                "EVILNEST",
                "Elise",
                "Group Policy Results Tool",
                "Hannotog",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "PsExec",
                "Rikamanu",
                "Sagerunex",
                "Spedear",
                "Syndicasec",
                "WMI Ghost",
                "Wimmie",
                "gpresult"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "87a20b72-ab72-402f-9013-c746c8458b0b",
            "created_at": "2023-01-06T13:46:38.293223Z",
            "updated_at": "2025-03-27T02:00:02.796483Z",
            "deleted_at": null,
            "main_name": "LOTUS PANDA",
            "aliases": [
                "Lotus BLossom",
                "Spring Dragon",
                "ST Group",
                "DRAGONFISH",
                "BRONZE ELGIN",
                "ATK1",
                "G0030",
                "Red Salamander"
            ],
            "source_name": "MISPGALAXY:LOTUS PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4b066585-3591-4ddd-b3cc-f4e19e0e00ef",
            "created_at": "2022-10-25T16:07:24.086915Z",
            "updated_at": "2025-03-27T02:02:10.103556Z",
            "deleted_at": null,
            "main_name": "Putter Panda",
            "aliases": [
                "APT 2",
                "Group 36",
                "Putter Panda",
                "SearchFire",
                "TG-6952"
            ],
            "source_name": "ETDA:Putter Panda",
            "tools": [
                "3PARA RAT",
                "4H RAT",
                "4h_rat",
                "MSUpdater",
                "httpclient",
                "pngdowner"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041674,
    "ts_creation_date": 1454974167,
    "ts_modification_date": 1454974167,
    "files": {
        "pdf": "https://archive.orkl.eu/9a7bd4348f8ad97d5440d287b81382d47f71d954.pdf",
        "text": "https://archive.orkl.eu/9a7bd4348f8ad97d5440d287b81382d47f71d954.txt",
        "img": "https://archive.orkl.eu/9a7bd4348f8ad97d5440d287b81382d47f71d954.jpg"
    }
}