{
    "id": "2a438d72-7a30-4aa1-814a-2dbdd0319204",
    "created_at": "2023-01-12T15:10:40.28989Z",
    "updated_at": "2025-03-27T02:09:29.523736Z",
    "deleted_at": null,
    "sha1_hash": "bef03ec407dd929353157db745d4ed39fd7941dc",
    "title": "2019-06-17 - Good riddance, GandCrab! We’re still fixing the mess you left behind",
    "authors": "",
    "file_creation_date": "2022-05-27T21:48:22Z",
    "file_modification_date": "2022-05-27T21:48:22Z",
    "file_size": 1077771,
    "plain_text": "# Good riddance, GandCrab! We’re still fixing the mess you left behind.\n\n**[labs.bitdefender.com/2019/06/good-riddance-gandcrab-were-still-fixing-the-mess-you-left-behind](https://labs.bitdefender.com/2019/06/good-riddance-gandcrab-were-still-fixing-the-mess-you-left-behind)**\n\n\n-----\n\n[Bogdan BOTEZATU](http://10.10.0.46/blog/labs/author/bbotezatu/)\nJune 17, 2019\n\nOne product to protect all your devices, without slowing them down.\n[Free 90-day trial](http://10.10.0.46/media/html/consumer/new/get-your-90-day-trial-opt/index.html)\n\n\n-----\n\nOn January 28th 2018, our analysts on watch saw a small blip pop up on the Bitdefender\nThreat Map. It was one of millions of blips we see daily here at Bitdefender, but that blip\nmarked the birth of a new family of ransomware that would cause great pain to innocent\nvictims around the world. The same blip would show up at least 50,000 more times in the\nfollowing month and several more million times in the next year. It came to be known as\n“GandCrab.”\n\n[Download the GandCrab decryptor](http://download.bitdefender.com/am/malware_removal/BDGandCrabDecryptTool.exe)\n\nThis family of ransomware, likely operated out of the former Soviet space, grabbed more\nthan 50 percent of the ransomware market share by August 2018. Access to GandCrab\nransomware was sold on underground markets to affiliates, who were responsible for\ninfecting victims and extorting money from them. In exchange, the affiliates gave 40% of\ntheir profit to the original GandCrab developers. This fostered a diverse distribution system.\nSome affiliates would spam out their payloads, while others would infect victims through, for\ninstance, exploit kits or remote access to enterprise computers.\n\nAt Bitdefender, we’ve carefully counted these blips and spared no effort in bringing relief to\nthe unlucky ones who crossed paths with the GandCrab team. In collaboration with partner\nlaw enforcement agencies including Europol, Romanian Police, DIICOT, FBI, NCA and\n\n\n-----\n\nMetropolitan Police, as well as Police Offices in France, Bulgaria, we have managed to offer\nseveral decryptors to help GandCrab victims get their data back for free.\n\nThese tools totaled more than 30,000 successful decryptions and have saved victims\nroughly $US 50 MILLION in unpaid ransom. Most importantly, it helped us weaken the\nransomware operators by cutting off their monetization mechanisms and establishing a\npositive mindset among new victims, who would rather wait for a new decryptor than give in\nto hackers’ ransom demands.\n\nIn more than a year of operation, we estimate GandCrab has claimed more than 1.5 million\nvictims around the world, both home users and corporations. GandCrab operators and\naffiliates boldly claimed on private underground forums recently that the team behind the\n[malware has extorted more than $2 billion from victims.](https://www.bleepingcomputer.com/news/security/gandcrab-ransomware-shutting-down-after-claiming-to-earn-25-billion/)\n\nWhile the number is clearly exaggerated, the GandCrab operation was prolific enough to\nscore enough revenue to allow its masters to retire. According to the same claim, the\nGandCrab team has stopped affiliates from accessing new versions of the malware and has\nurged them to prepare for an imminent shutdown. The shutdown will be followed by deletion\nof all keys, leaving the victims unable to retrieve the ransomed data even if they do pay\nransom.\n\n\n-----\n\n[GandCrab shutdown announcement – photo courtesy to bleepingcomputer.com](https://www.bleepingcomputer.com/news/security/gandcrab-ransomware-shutting-down-after-claiming-to-earn-25-billion/)\nFortunately, we have released an update to the tool that neutralizes the latest versions of\nGandCrab, including version 5.2. The tool is available immediately and can be downloaded\n[for free below or from the No More Ransom Project.](https://www.nomoreransom.org/en/decryption-tools.html)\n\n**Facts and figures about GandCrab**\n\nFrom its inception in January of 2018, GandCrab quickly became hackers’ go-to tool for\naffiliate-based ransomware. Likely based in the former Soviet space, its operators and\naffiliates target victims all around the world, with the exception of Russian-speaking\ncountries and several others where market economics make it impossible for victims to pay\nup (such as Syria). In less than a year, GandCrab became the world’s widest-spread\nransomware, accounting for half of all ransomware infections.\n\nA key advantage of GandCrab over other ransomware families is its ransomware-as-aservice licensing model, where distributors purchase and spread the malware and split the\ndecryption fees with the original developer. Affiliates keep 60%, while the rest goes to the\ndevelopers. This segregation of duties allow developers to improve on the code and add\nnew features (such as antivirus circumvention techniques) and let the distributors focus on\ndelivery and exploitation of victims.\n\nThe GandCrab business also brings new features, such as a chat service for victims to\ncontact the affiliates to negotiate discounts, extend the payment deadline or ask for help\nexchanging fiat money into digital currency.\n\n\n-----\n\nIn addition to bridging communications with the victim, the chat also has a “secret” area that\n[gives shady data recovery companies a discount on behalf of victims to mask a ransom](https://www.bleepingcomputer.com/news/security/gandcrab-ransomware-helps-shady-data-recovery-firms-hide-ransom-costs/)\npayment as a “data recovery fee” for customers.\n\nNot all victims are treated equally: GandCrab prioritizes ransomed information and sets\nindividual pricing by type of victim. An average computer costs from $600 and $2,000 to\ndecrypt, and a server decryption costs $10,000 and more. While helping victims with\ndecryption, we’ve seen ransom notes asking for as much as $700,000, which is quite a\nprice for one wrong click.\n\nThe three decryptors released in collaboration with partner law enforcement agencies – and\nparticularly the GandCrab decryptor for version 5.1 – compelled GandCrab affiliates shrink\ntheir business to avoid unnecessary costs. For instance, in February 2019, after the release\nof the decryptor for version 5.1, affiliates kept pushing decryptable versions of the malware\nfor more than a week, allowing fresh victims to decrypt their data for free. As of March\n2019, GandCrab’s market share has shrunk back to 30 percent, with almost one in three\ninfections tied to the group.\n\n**How to stay safe**\n\nRansomware decryption is a delicate matter, as the malware writers use the same\ntechnology that helps people protect their banking transactions, communications and online\ninteractions. Encryption is easy, but decryption without a key is nearly impossible. Every\nmonth, Bitdefender sees 12 new strains of ransomware, which means cyber-criminals push\nout a total of more than 140 new families a year. Out of these, almost 10 percent are\ndecryptable by leveraging loopholes in the attackers’ code or through partnerships with law\nenforcement organizations\n\n\n-----\n\nWhen dealing with ransomware, prevention is key. Once your system gets encrypted,\nchances of decryption are thin, despite the industry’s efforts to bring your data back. Here\nare some tips to help you prevent ransomware attacks and minimize the amount of money\nthat flows to cyber-crime operators:\n\n1. Run a security solution. If you have a security solution installed, make sure that you\n\nare using the full range of technologies to fend off a ransomware attack. Behavioralbased detection, heuristics based on machine learning and ransomware remediation\nare key technologies to detect and block ransomware attacks. If you don’t have one\ninstalled, Bitdefender offers [a highly effective security solution for free.](https://www.bitdefender.com/solutions/free.html)\n2. Make frequent backups on offline media. Backups are an extremely effective solution\n\nagainst loss of data if disaster strikes. Get a portable hard-drive and religiously back\nimportant data up as you create it. DO NOT keep the drive connected for longer than\nneeded for backup purposes, as most ransomware encrypts information on connected\nremovable drives and network shares.\n3. If all else fails, do not pay the ransom. Ransom payments allow the attackers to thrive,\n\nand let them develop more aggressive strains of malware. If your system becomes\ninfected, back the affected data up and immediately notify the Police. While they might\nnot be able to immediately help you out with decryption, they will log the incident and\nstart working with partner private cybersecurity companies on a solution.\n\n**Ready to take your data back? Download the tool below.**\n\n[Download the GandCrab decryptor](http://download.bitdefender.com/am/malware_removal/BDGandCrabDecryptTool.exe)\n\n**TAGS**\n\n[anti-malware research](http://10.10.0.46/blog/labs/tag/antimalware-research/) [free tools](http://10.10.0.46/blog/labs/tag/free-tools/)\n\n**AUTHOR**\n\n## Bogdan BOTEZATU\n\n[Information security professional. Living my second childhood at @Bitdefender as director](http://10.10.0.46/blog/labs/author/bbotezatu/)\nof threat research.\n\n\n-----\n\n[View all posts](http://10.10.0.46/blog/labs/author/bbotezatu/)\n\n\n[View all posts](http://10.10.0.46/blog/labs/author/bbotezatu/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-17 - Good riddance, GandCrab! We’re still fixing the mess you left behind.pdf"
    ],
    "report_names": [
        "2019-06-17 - Good riddance, GandCrab! We’re still fixing the mess you left behind.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536240,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653688102,
    "ts_modification_date": 1653688102,
    "files": {
        "pdf": "https://archive.orkl.eu/bef03ec407dd929353157db745d4ed39fd7941dc.pdf",
        "text": "https://archive.orkl.eu/bef03ec407dd929353157db745d4ed39fd7941dc.txt",
        "img": "https://archive.orkl.eu/bef03ec407dd929353157db745d4ed39fd7941dc.jpg"
    }
}