{
    "id": "2a586211-1775-4c50-b744-22c9515ce58f",
    "created_at": "2024-05-16T02:04:50.789537Z",
    "updated_at": "2025-03-27T02:17:05.602127Z",
    "deleted_at": null,
    "sha1_hash": "9692c542bca6d2effb58a63da1ea75ecc3cfba4d",
    "title": "APT44 Report",
    "authors": "",
    "file_creation_date": "2024-04-29T08:53:36Z",
    "file_modification_date": "2024-04-29T08:53:32Z",
    "file_size": 4853480,
    "plain_text": "##### UNDERSTANDING THE 'KAPEKA' BACKDOOR: DETAILED ANALYSIS BY APT44\n\n\n-----\n\n###### TABLE OF CONTENTS\n\n Introduction 4\n\n\n###### 4 i\n\n Countries Targeted by APT44 (Sandworm)\n\n 5 i i\n\n 8 i i\n\n 6 i\n\n Backdoor Analysis\n\n 7i\n\n IOCs\n\n Detection\n\n Backdoor Dropper Analysis\n\n Backdoor Analysis\n\n 8i i i\n\n\n###### 12\n\n 6\n\n 17\n\n 18\n\n\n###### 22 i 22\n\n\n###### 8\n\n 19\n\n Dropper Yara Rule\n\n 19\n\n Backdoor Yara Rule\n\n 20\n\n 20\n\n 21\n\n i 22\n\n\n-----\n\n###### Get 30 Days Free Trial\n\n\n-----\n\n###### 4 i i i\n\n#### Kapeka Baickdoor is a sophisticated malware that prepares a platform for malware execution by communicating with infected devices. Through command-and-control (C2) communication, attackers can send commands and take control of target systems. This backdoor is similar to another backdoor known as QUEUESEED, which has the same hash and characteristics. Both malware have been attributed to the Russian APT group Sandworm.\n\n###### Thiis report aims to highlighti the imporit anc e of tihiis t hreat byi di scussing the teicihinic al deta ils and a titack vec tors of the Kapeka Backdioor in detaili. I t aliso iaims to help oirganizations be better pr eparied for su ch a ttaciks by provi ding i nfor mation on a tta ck detiec tion and defen sei s trategie s.\n i i i\n\n Kapeka Backdoor is a sophisticated malware that prepares a platform for malware execution by communicating with infected devices. Through command-and- control (C2) communication, attackers can send commands and take control of target systems. This backdoor is similar to another backdoor known as QUEUESEED, which has the same hash and characteristics. Both malware have been attributed to the Russian APT group Sandworm.\n\n This report aims to highlight the importance of this threat by discussing the technical details and attack vectors of the Kapeka Backdoor in detail. It also aims to help organizations be better prepared for such attacks by providing information on attack detection and defense strategies.\n\n\n###### ttaciks\n\n and\n\n the\n defense\n\n\n###### Understanding the 'Kapeka' Backdoor: Detailed Analysis by APT44This report focuses on a technical analysis of the origins, propagation methods, and activities of the recently discovered Kapeka Backdoor. In particular, a detailed examination and evaluation of the Kapeka Backdoor attributed to the Russian Sandworm Group was conducted. The analysis revealed that this malware has been actively used by the Russian APT44 group since 2022.\n\n\n###### U\n\n\n-----\n\n###### 5 i i i\n\n Understanding the 'Kapeka' Backdoor: Detailed Analysis by APT44\n\n Kapekia is a sophisticated backdoor designed for initial discovery and persistent infiltration of targeted systems. It is developed in C++ and disguises itself as a Microsoft Word Add-in (.wll). The installer silently installs, runs the backdoor, and removes itself from the environment. It continues to initiate data collection and external data transfer to threat actors, providing persistence through scheduled task creation or autorun registry entries, depending on system privileges.\n\n Using m iul ti -thrieaiding, Kapeka ef ficiientl y pr ioiciess eis incomi ng d irecitives i aind coimmu nic ates with the Comm and i a nd Control i ( C2) serv eir viia t ihe Win Htt p i5.1 COM interfacei. Its capabiliities incluide filei manipulation, execution of upl oaded co ide, ex ecuti on o f sihell comm and s, aind ev en isieilf-u pdati ng and iuni nst allation, givi ng attack ers extens ive cont rol ioiver comipromise d system s.\n i i i i i i\n\n Iniiti allyi droppeid as a hidd en ifiile in side a fol ider inam eid 'Miicro sof t' in ipaths siuch as 'C:\\ProgramData' or 'C:\\Users<useirname>\\iAppData\\Local i', Kapeka proc eeds iviiia a i schedu lied tasik or iauto run reigis try entry, d epend ing oni th e p rivile ges of the pro cess. i i i i i i i\n\n Thiei backdoor operates iwith fiouri miain threads: the firist threadi manages the in itialization, C2 communication, and exit routines; the second thread moniitor s Windows logou t e vents an d siignal s the p rimaryi th rea d to eixiecute the ex it routine during logout; the third thread monitors incoming tasks and starts subsequent threads to execute each task received from C2; and the last thread monitors task completion and sends the processed results back to C2.\n\n\n###### In a ddition, the backd oior commu niica tes with the Ci2 se rver to receive ta isikis iandi sen d b ack fiingeirpri nt i nfior matiion an d ta sk resu lts. It hais a rieconfigurable feature andi allows updaites during runtime by fetchinig a neiw verisio n from t he C 2 iser ver. Th e liatest i iteirat ion of the backdo or include s a special algorithm that applieis CRC32 and PRNG operations to both iGUID and hard-coided values within the binary file. Furthermore, the embedded and persistent configurations of the backdoor are encoded in JSON format.\n\n\n###### In addition, the backdoor communicates with the C2 server to receive tasks and send back fingerprint information and task results. It has a reconfigurable feature and allows updates during runtime by fetching a new version from the C2 server. The latest iteration of the backdoor includes a special algorithm that applies CRC32 and PRNG operations to both GUID and hard-coded values within the binary file. Furthermore, the embedded and persistent configurations of the backdoor are encoded in JSON format.\n\n\n###### 5\n\n\n-----\n\n###### 6 i i i\n\n APT44 iis a threat actor operating in a wide geographical area and targeting organizations in various sectors. It operates in countries such as Azerbaijan, Belarus, Georgia, Iran, Israel, Kazakhstan, Kyrgyzstan, Lithuania, Poland, and Russia, with a particular focus on Ukraine. In addition to targeting organizations related to energy, industrial control systems, SCADA, and national defense, this group targets organizations in various sectors such as governments, transportation, energy, media, and social organizations. APT44's activities pose a significant risk, especially in regions that intersect with the interests of the Russian state, which is why it also targets organizations in North America, Europe, the Middle East, Central Asia, and Latin America.\n\n APT44 is a threat actor operating in a wide geographical area and targeting organizations in various sectors. It operates in countries such as Azerbaijan, Belarus, Georgia, Iran, Israel, Kazakhstan, Kyrgyzstan, Lithuania, Poland, and Russia, with a particular focus on Ukraine. In addition to targeting organizations related to energy, industrial control systems, SCADA, and national defense, this group targets organizations in various sectors such as governments, transportation, energy, media, and social organizations. APT44's activities pose a significant risk, especially in regions that intersect with the interests of the Russian state, which is why it also targets organizations in North America, Europe, the Middle East, Central Asia, and Latin America.\n\n\n###### APT44 iis a threat actor operating in a wide geographical area and targeting organizations in various sectors. It operates in countries such as Azerbaijan, Belarus, Georgia, Iran, Israel, Kazakhstan, Kyrgyzstan, Lithuania, Poland, and Russia, with a particular focus on Ukraine. In addition to targeting organizations related to energy, industrial control systems, SCADA, and national defense, this group targets organizations in various sectors such as governments, transportation, energy, media, and social organizations. APT44's activities pose a significant risk, especially in regions that intersect with the interests of the Russian state, which is why it also targets organizations in North America, Europe, the Middle East, Central Asia, and Latin America.\n\n APT44 is a threat actor operating in a wide geographical area and targeting organizations in various sectors. It operates in countries such as Azerbaijan, Belarus, Georgia, Iran, Israel, Kazakhstan, Kyrgyzstan, Lithuania, Poland, and\n\n\n-----\n\n###### 7 i i i\n\n INFECTION CHAIN\n\n\n###### 7\n\n\n-----\n\n###### 8 i i i\n\n Figure 1 - Dropped dll\n\n Backdoor Dropper Analysis\n\n File Name File Name\n\n dropper.exe MD5\n\n SHA256 50b5582904fe34451f5cb2362e11cb24\n\n Figure 1 - Dropped dll\n\n bd07 fb1e 9b47 68e72 02de6cc 454 c78 c6891270a f02 085c51fce5539 db138 6c3f i i i\n\n|File Name|File Name|\n|---|---|\n|dropper.exe|MD5|\n|50b5582904fe34451f5cb2362e11cb24|SHA256|\n\n\n###### 8\n\n\n###### 8\n\n\n-----\n\n###### 9 i i i\n\n Figure 2 - Execute dll\n\n The provided command utilizes the ShellExecute API to invoke the rundll32.exe utility with specific parameters. It directs the system to execute the function designated by ordinal number 1 within the vozet.wll DLL file located at ”C:\\Users\\admin\\AppData\\Local\\Microsoft\" directory. The addition of the \"-d\" flag instructs the DLL to run in debug mode. This command facilitates executing a particular function within the DLL through rundll32.exe, providing a pathway for potential debugging and analyzing the DLL's behavior.Figure 2 - Execute dll\n\n\n-----\n\n###### 10 i i i\n\n Figure 3 - Registry entry\n\n Figure 3i - Registry enitiry i i i i i i i i i i i i i i i i i i i i i i\n\n\n-----\n\n###### 11 i i i\n\n Fiigure 5- .bat file detiail\n\n A batch file is created under the directory \"C:\\Users\\admin\\AppData\". This batch file is designed to facilitate the removal of the malicious backdoor dropper from the system after the backdoor has been installed.\n\n Figure 5- .bat file detail\n\n After the installer completes the installation of the backdoor, it creates a batch file that checks for its presence and deletes it if it exists. This batch file is executed using a command prompt (cmd.exe) on the system. The installer thus permanently removes itself from the system.\n\n\n###### 11\n\n\n-----\n\n###### 12 i i i\n\n Backdoor Analysis\n\n File Name File Name\n\n kapeka.dll MD5\n\n SHA256f30b9f6e913798ca52154c88725ee262a7bf92fe7caac1ae2e5147e457b9b08a 5294aaf2ff80547172ebb9e0bcb52e0f\n\n Fiigure 6- The -d parameteri is used to check whetheir iit is irunning or not\n\n The backdoor also reads the current configuration held in the registry during the initialization phase. Depending on whether the backdoor is initialized with the '-d' argument and the current configuration in the registry, the backdoor chooses which configuration to use. If the '-d' argument (specifying the first run) is provided, the backdoor prefers its embedded configuration, otherwise it reads the current configuration from the registry, reverting to the embedded configuration if it is not available.\n\n|File Name|File Name|\n|---|---|\n|kapeka.dll|MD5|\n|5294aaf2ff80547172ebb9e0bcb52e0f|SHA256f30b9f6e913798ca52154c88725ee262a7bf92fe7caac1ae2e5147e457b9b08a|\n\n\n-----\n\n###### 13 i i i\n\n Figure 7- Create a registry key\n\n Fiigure 8- Create mutex\n\n The backdoor protects its settings by storing them in a registry value named \"Seed\" in the path \"HKU<SID>\\Software\\Microsoft\\Cryptography\\Providers<GUID>\". Initially, it gets a GUID value by using GetCurrentHwProfileW() and obtaining the szHwProfileGuid field. If GetCurrentHwProfileW() fails, the backdoor defaults to a hard-coded GUID value. Also, the backdoor generates the mutex using an algorithm similar to \"Global\\BFE_Notify_Event_{{{e3d32dc0-dd0b-11ed-a558-806e6f6e6963}}\".\n\n\n###### 13\n\n\n-----\n\n###### 14 i i i\n\n Figure 9- Json keys\n\n Additionally, the backdoor employs JSON formatting for both internal data exchange and communication with the command and control server. In total, there are 36 distinct JSON keys utilized, each concealed and comprised of 6 characters. To ensure security, the backdoor employs three distinct encryption and encoding methods: AES-256 in CBC mode, XOR, and RSA-2048.\n\n Figure 9- Json keys\n\n\n-----\n\n###### 15 i i i\n\n Fiigure 11- C2 coinfiiguriation i\n\n Figure 11- C2 configuration \n\n JSON data is the configuration of the Kapeka backdoor. It contains keys and values used to control the functionality and behavior of the backdoor. This structure includes settings such as the URL for connecting to a specific command and control server, connection frequency, update time and other properties. It covers both embedded (hard-coded) and persistent configuration information, indicating that it contains configuration settings stored on the device. This structure covers the key features that are crucial for determining the backdoor's control mechanisms and communication behaviors.\n\n\n###### 15\n\n\n-----\n\n###### 16 i i i\n\n Figure 12- Sends information about the user profile in JSON format\n\n During the initialization phase, the backdoor obtains information about the infected system and its user through a series of Windows APIs and registry queries. This information is organized internally in a predefined structure and then converted into JSON format. During its initial and subsequent interactions with the command and control server, the backdoor transmits this JSON data to the server\n\n After acquiring device-specific information, the Kapeka backdoor completes its access to the compromised device.\n\n Leveraging the generated autorun key, the backdoor ensures that it is automatically reactivated on every system boot and seamlessly re-establishes communication with the designated server.\n\n\n###### Figure 13- Details of the information sent in JSON\n\n\n###### Figurie 13- Dietails of the informatioin sent iini J SON i i i i\n\n\n###### After acquiring device-specific information, the Kapeka backdoor completes its access to the compromised device.\n\n Leveraging the generated autorun key, the backdoor ensures that it is automatically reactivated on every system boot and communication with the designated server.\n\n Figurie 13- Dietails of the informatioin sent iini J SON i i i\n\n\n-----\n\n### Mitre Attack\n\n\n###### 17 i i i\n\n Command and Scriipiting Interprete\n ri: Windows Command Shell\n\n Boot or Logon Autostart Executiion\n : Riegistry Run Keys / Startup Folder\n\n System Informatiion iDiscovery\n\n Modiify Reigistry\n\n System Biinary Proxy Execuition: Rundll32\n\n Masqueradiing\n\n Appliicaition Layer Protocol: W\n eb Protocols\n\n Understanding the 'Kapeka' Backdoor: Detailed Analysis by APT44\n\n|Executiion|T1059.003|Command and Scriipiting Interprete ri: Windows Command Shell|\n|---|---|---|\n|Persiistence|T1547.001|Boot or Logon Autostart Executiion : Riegistry Run Keys / Startup Folder|\n|Diiscovery|T1082|System Informatiion iDiscovery|\n|Defense Evaision|T1112|Modiify Reigistry|\n|Defense Evaision|T1218.011|System Biinary Proxy Execuition: Rundll32|\n|Defense Evaision|T1036|Masqueradiing|\n|Command and Control|T1071.001|Appliicaition Layer Protocol: W eb Protocols|\n\n\n###### Un\n\n\n-----\n\n###### 18 i i i\n\n\n## IOC’s\n\n|IP|185[.]38[.]150[.]8|\n|---|---|\n|IP|196[.]245[.]156[.]154|\n|IP|193[.]189[.]100[.]203|\n|IP|5[.]45[.]75[.]45|\n|URL|hxxps://185[.]38[.]150[.]8:443/star/key|\n|URL|hxxps://194[.]61[.]121[.]211/appliicaition|\n|Dropper Hash|bd07fb1e9b4768e7202de6cc454c78c6891270af02085c51f ce5539db1386c3f|\n|Dropper Hash|80fb042b4a563efe058a71a647ea949148a56c7c|\n|Backdoor Hash|272cfaebf22e0f6a34c0a93b7c9c5b67c725947ba0f17e60e d67dbf6e1602043|\n|Backdoor Hash|6c3441b5a4d3d39e9695d176b0e83a2c55fe5b4e|\n|Backdoor Hash|5294aaf2ff80547172ebb9e0bcb52e0f|\n\n\n###### Un\n\n\n-----\n\n###### Understanding the Kapeka Backdoor: Detailed Analysis by APT44\n\n DETECTION\n\n 19\n\n import \"hash\" import \"hash\"\n\n rule Kapeka_Backdoor{   meta: i   author = \"Kerime Gencay\"   sourcie i= \"ThreatMon\"   diescription = \"Kapeka_Backdoor Rule\"   file_name = \"dropper.exe\"\n\n  i hash = \"50b5582904fe34451f5cb2362e11cb24\" strings:\n\n $opc1 = {8B 55 C8 8D 45 F8 8B 4D FC 50 C7 45 F8 00 00 00 00 E8 AB EB FF FF 84 C0 74 1A 8D 45 F4} $opc2 = {FF 15 9C D0 40 00 50 FF 15 A0 D0 40 00 8B F0 85 F6 74 19 53 8D 45 DC 50 56 FF 15 9C D1 40 00 8B 45 FC}\n\n\n###### }\n\n\n-----\n\n###### 20 i i i\n\n import \"hash\"\n\n irule Kapeka_Backdoor{   meta:\n\n   author = \"Kerime Gencay\"   source = \"ThrieatMon\"   description = \"Kapeka_Backdoor Rule\"   file_inaime = \"kapeka.dll\"   hiash = \"5294aaf2ff80547172ebb9e0bcb52e0f\" strings:  i $str1 = \"jxs2HZ\" $str2 = \"BFF9F38C7760A28C\" $str3 = \"LsHsAO\" $str4 = \"jRcZrx\" $str5 = \"SIsKba\" $str6 = \"KKGCUr\"  $str7 = \"GafpPS\" $str8 = \"LsHsAO\"  $opc1 = {E8 E4 AE FF FF 4C 8B C0 33 D2 33 C9 FF 15 37 D7 00 00 48 85 C0 48 89 87 08 04 00 00}\n\n $opc2 = {48 8D 0D 54 63 00 00 E8 43 10 FF FF 41 8D 54 24 05 48 8B D8 48 8D 4C 24 20} $opc3 = {FF 15 22 F4 00 00 48 8D 0D 83 1A 01 00 48 89 47 10 FF 15 F1 F5 00 00 48 8D 0D 92 1A 01 00 48 89 47 60 FF 15 E0 F5 00 00} condition:\n\n   iuiint16(0) == 0x5A4D and (any of ($str*,$opc*)) } i }\n\n\n###### 20\n\n\n-----\n\n###### 21 i i i\n\n# Implement application whitelisting to allow only trusted and authorized programs to run on the system.\n\n###### Restrict u ser iandi ap pliicaitiion acc ess to the Windows Regi stry aind regularly monitor and audit registry changes.\n\n Rimiti unnecessary infiormiation exposure andi regularliy review and restr icti access to isensiitive data.\n\n Uisie advanced thr ieat detiect ion tools tha t can iden tifiy O bfus catedi o r i i\n\n encrypted files and code. i i i Implement sitrong authentication and access controls and educate users about social engineering tactics.\n\n Regularly monitor and reistriict the use of archive and compress ion t ools. i i i i\n\n Use secure. eincrypted conniections (HTTPS), aind implement muilti-factor authentication to protect session cookies.\n\n Impl ement pr oper passw ord poliicie s and pra ctic ies, and r eguliarly au dit andi seicure credentials. i i\n\n Implement proper password policies and practices, and regularly audit and secure credentials.\n\n\n###### 21\n\n\n-----\n\n# Uncover the Advantages of the ThreatMon’s Module\n Offerings\n\n###### ThreatMon Advanced Threat Intelligence\n Platform combines Threat Intelligence\n, External Attack Surface Managemen t, and Digital Risk Protection. Threat Mon identifies the distinctive nature of each business and provides bespoke solu\n tions that cater to its specific needs.\n\n\n-----\n\n###### Uncover the Advantages of the ThreatMon’s Module Offerings\n\n\n###### Extensive Integrations Leverage extensive integrations that align seamlessly with all your security programs, third-party security tools, and external repositories.\n\n\n###### %100 Cloud Get h ighe r avail ability a nd flexi bil ity b y elimi nat ing the depende ncy o n physical servers.\n\n\n###### Inform your organization about future threats in advance with threat detection methods trained with Artificial Intelligence and Machine Learning models. View all threats that may directly or indirectly affect your organization and new emerging threats in real time with their analysis.\n\n\n###### Custom API Integration Provide high -level securi ty by easily integrat ing with ot her s ecurit y products with an API personalised to your needs.\n\n\n###### Empower your organization with ThreatMon’s broad intelligence platform, enabling in-depth analysis of intelligence data and accurate prediction of threats for more effective security measures. All-in-One Platform\n\n\n-----\n\n###### Reputationi Trackig i i\n\n### Features at a Glance\n\n###### Phishi\n Integra Critical Dat\n ng/Impe\n ted Takedown a Breach Monitoring\n rsonating Domain Monitoring\n\n Digital Asset Detection Passive Vulnerabil Darkweb Intielligence & Continuous ity Scian Seciurity iNews i i Monitoring Continuous iPentest Threait Reports Vulnerable Asset Customizedi iAlarm & Notification APiT iMITRE ATT&CK,i a Intelligence Customer API nd Giraph iThrieat Feeds Real-time Dashboards Integration Threat Feed/IOCs Integration Digital Asset Detiec Vulnerability Critical Data Breach tioni & Continuous Monitoring Intelligence Monitoring Vulinerablei Asise AI/ML-based Thireat Intelligence Reputation Tracking t Intielligencei Threait Hunting VIP Protection Real-time Diashboards Threat Activity Alerts i i ThreatMoni Asseti Riisk Scoring Customer API Inte Siocial iMedia Monitioring Mobiile Applicatiiion gration Seciurity iPosture iCard\n\n\n-----\n\n###### “See Beyond the Surface”\n\n\n###### Advanced Threat Intelligence Platform\n\n\n###### With External Attack Surface Management\n and Digital Risk Protection\n\n\n###### 30 Days of Free Trial\n\n\n###### @ThreatMon @ThreatMon @MonThreat @threatmon\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://threatmon.io/storage/understanding-the-kapeka-backdoor-detailed-analysis-by-apt44.pdf"
    ],
    "report_names": [
        "understanding-the-kapeka-backdoor-detailed-analysis-by-apt44.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1715825090,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1714380816,
    "ts_modification_date": 1714380812,
    "files": {
        "pdf": "https://archive.orkl.eu/9692c542bca6d2effb58a63da1ea75ecc3cfba4d.pdf",
        "text": "https://archive.orkl.eu/9692c542bca6d2effb58a63da1ea75ecc3cfba4d.txt",
        "img": "https://archive.orkl.eu/9692c542bca6d2effb58a63da1ea75ecc3cfba4d.jpg"
    }
}