{
    "id": "2a5cec63-0d5a-4962-8240-7d7211a4cd33",
    "created_at": "2022-10-25T16:48:15.310615Z",
    "updated_at": "2025-03-27T02:17:02.460311Z",
    "deleted_at": null,
    "sha1_hash": "892e3677718b44d08c8b95f63867c55215931363",
    "title": "Modified Elephant APT and a Decade of Fabricating Evidence",
    "authors": "Sentinal One",
    "file_creation_date": "2022-02-09T09:25:31Z",
    "file_modification_date": "2022-02-09T09:25:35Z",
    "file_size": 5404102,
    "plain_text": "# MODIFIED ELEPHANT APT\n AND A DECADE OF\n FABRICATING EVIDENCE\n\nAuthor: Tom Hegel, Juan Andres Guerrero-Saade February 2022 SentinelLABS Research Team\n\n\n-----\n\n## TABLE OF\n CONTENTS 3 EXECUTIVE SUMMMARY\n\n#### 4  BACKGROUND\n\n 5  TARGETS & OBJECTIVES\n\n 5  INFECTION ATTEMPTS\n\n 7  WEAPONS OF CHOICE\n\n 11  RELATIONS TO OTHER\n THREAT CLUSTERS\n\n 12  ATTRIBUTION\n\n 12  CONCLUSION\n\n 13  INDICATORS OF COMPROMISE\n\n 18  TECHNICAL REFERENCES\n\n 19  ABOUT SENTINELLABS\n\n\n-----\n\n## EXECUTIVE SUMMARY\n\n- Our research attributes a decade of activity to a threat actor we call ModifiedElephant.\n\n- ModifiedElephant is responsible for targeted attacks on human rights activists,\n\nhuman rights defenders, academics, and lawyers across India with the objective of\n\nplanting incriminating digital evidence.\n\n- ModifiedElephant has been operating since at least 2012, and has repeatedly\n\ntargeted specific individuals.\n\n- ModifiedElephant operates through the use of commercially available remote access\n\ntrojans (RATs) and has potential ties to the commercial surveillance industry.\n\n- The threat actor uses spearphishing with malicious documents to deliver malware,\n\nsuch as NetWire, DarkComet, and simple keyloggers with infrastructure overlaps\n\nthat allow us to connect long periods of previously unattributed malicious activity.\n\n#### S e n t i n e l L a b s Te a m\n\n\n-----\n\n### BACKGROUND\n\nIn September 2021, SentinelLabs published research into the operations of a Turkish-nexus threat\n\n[actor we called EGoManiac, drawing attention to their practice of planting incriminating evidence](https://www.sentinelone.com/labs/egomaniac-an-unscrupulous-turkish-nexus-threat-actor/)\n\non the systems of journalists to justify arrests by the Turkish National Police. A threat actor willing\n\nto frame and incarcerate vulnerable opponents is a critically underreported dimension of the cyber\n\nthreat landscape that brings up uncomfortable questions about the integrity of devices introduced\n\nas evidence. Emerging details in an [unrelated case caught our attention as a potentially similar](https://www.washingtonpost.com/world/asia_pacific/india-bhima-koregaon-activists-jailed/2021/02/10/8087f172-61e0-11eb-a177-7765f29a9524_story.html)\n\nscenario worthy of more scrutiny.\n\nLong-standing racial and political tensions in India were inflamed on January 1st, 2018 when\n\ncritics of the government clashed with pro-government supporters near [Bhima Koregaon. The](https://www.theguardian.com/world/2021/aug/12/bhima-koregaon-case-india-conspiracy-modi)\n\nevent led to subsequent protests, resulting in more violence and at least one death.\n\nIn the following months, Maharashtra police linked the cause of the violence to the banned Naxalite\nMaoist Communist party of India. On April 17th, 2018, police conducted raids and arrested a\n\nnumber of individuals on terrorism-related charges. The arresting agencies identified incriminating\n\nfiles on the computer systems of defendants, including plans for an alleged assassination attempt\n\nagainst Prime Minister Modi.\n\nThanks to the public release of digital forensic investigation results by Arsenal Consulting and those\n\nreferenced below, we can glean rare insights into the integrity of the systems of some defendants\n\nand grasp the origin of the incriminating files. It turns out that a compromise of defendant systems\n\nled to the [planting of files that were later used as evidence of terrorism and justification for the](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-I.zip)\n\ndefendants’ imprisonment. The intrusions in question were not isolated incidents.\n\nOur research into these intrusions revealed a decade of persistent malicious activity targeting\n\nspecific groups and individuals that we now attribute to a previously unknown threat actor named\n\nModifiedElephant. This actor has operated for years, evading research attention and detection\n\ndue to their limited scope of operations, the mundane nature of their tools, and their regionally\nspecific targeting. ModifiedElephant is still active at the time of writing.\n\n\n-----\n\n### TARGETS & OBJECTIVES\n\nThe objective of ModifiedElephant is long-term surveillance that at times concludes with the\n\ndelivery of ‘evidence’ –files that incriminate the target in specific crimes– prior to conveniently\n\ncoordinated arrests.\n\nAfter careful review of the attackers’ campaigns over the last decade, we have identified hundreds\n\nof groups and individuals targeted by ModifiedElephant phishing campaigns. Activists, human\n\nrights defenders, journalists, academics, and law professionals in India are those most highly\n\ntargeted. Notable targets include individuals associated with the Bhima Koregaon case.\n\n### INFECTION ATTEMPTS\n\nThroughout the last decade, ModifiedElephant operators sought to infect their targets via\n\nspearphishing emails with malicious file attachments, with their techniques evolving over time.\n\nTheir primary delivery mechanism is malicious Microsoft Office document files weaponized to\n\ndeliver the malware of choice at the time. The specific payloads changed over the years and across\n\ndifferent targets. However, some notable trends remain.\n\n  - In mid-2013, the actor used phishing emails containing executable file attachments with\n\nfake double extensions (filename.pdf.exe).\n\n  - After 2015, the actor moved on to less obvious files containing publicly available exploits,\n\nsuch as .doc, .pps, .docx, .rar, and password protected .rar files. These attempts involved\n\nlegitimate lure documents in .pdf, .docx, and .mht formats to captivate the target’s\n\nattention while also executing malware.\n\n  - In 2019 phishing campaigns, ModifiedElephant operators also took the approach of\n\nproviding links to files hosted externally for manual download and execution by the target.\n\n   - [As first publicly noted by Amnesty in reference to a subset of this activity, the attacker also](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\n\nmade use of large .rar archives (up to 300MB), potentially in an attempt to bypass detection.\n\n[Observed lure documents repeatedly made use of CVE-2012-0158, CVE-2014-1761, CVE-2013-](https://nvd.nist.gov/vuln/detail/cve-2012-0158)\n\n[3906, CVE-2015-1641 exploits to drop and execute their malware of choice.](https://msrc-blog.microsoft.com/2013/11/05/cve-2013-3906-a-graphics-vulnerability-exploited-through-word-documents/)\n\nThe spearphishing emails and lure attachments are titled and generally themed around topics\n\nrelevant to the target, such as activism news and groups, global and local events on climate\n\nchange, politics, and public service. A public deconstruction of two seperate 2014 phishing emails\n\n[was shared by Arsenal Consulting in early 2021.](https://web.archive.org/web/20210421135320/https://twitter.com/ArsenalArmed/status/1384867766675595264)\n\n\n-----\n\nFig 1: Spearphishing email containing malicious attachment attributed to ModifiedElephant\n\nModifiedElephant continually made use of free email service providers, like Gmail and Yahoo,\n\nto conduct their campaigns. The phishing emails take many approaches to gain the appearance\n\nof legitimacy. This includes fake body content with a forwarding history containing long lists of\n\nrecipients, original email recipient lists with many seemingly fake accounts, or simply resending\n\ntheir malware multiple times using new emails or lure documents. Notably, in specific attacks, the\n\nactor would be particularly persistent and attempt to compromise the same individuals multiple\n\ntimes in a single day.\n\nBy reviewing a timeline of attacker activity, we can observe clear trends as the attacker(s) rotate\n\ninfrastructure over the years.\n\nFig 2: Timeline sample of ModifiedElephant and SideWinder C2 Infrastructure.\n\n\n-----\n\nFor example, from early-2013 to mid-2016, a reasonably clear timeline\n\ncan be built with little overlap, indicating a potential evolution or\n\nexpansion of activities. Dates are based on first and last spearphishing\n\nemails observed delivering samples that communicate with a given\n\ndomain. Notably, a separate Indian-nexus threat actor, SideWinder, is\n\nplaced alongside ModifiedElephant in this graph as they were observed\n\ntargeting the same individuals.\n\n### WEAPONS OF CHOICE\n\nThe malware most used by ModifiedElephant is unsophisticated and\n\ndownright mundane, and yet it has proven sufficient for their objectives–\n\nobtaining remote access and unrestricted control of victim machines.\n\nThe primary malware families deployed were NetWire and DarkComet\n\nremote access trojans (RATs). Both of these RATs are publicly available,\n\nand have a long history of abuse by threat actors across the spectrum\n\nof skill and capability.\n\nOne particular activity revolves around the file _Ltr_1804_to_cc.pdf,_\n\nwhich contains details of an assassination plot against Prime Minister\n\n[Modi. A forensic report by Arsenal Consulting showed that this file, one](https://web.archive.org/web/20210917152050/https://scroll.in/article/991095/why-isnt-the-government-looking-for-the-source-of-modi-assassination-malware-on-rona-wilsons-pc)\n\n[of the more incriminating pieces of evidence obtained by the police,](https://web.archive.org/web/20210917152050/https://scroll.in/article/991095/why-isnt-the-government-looking-for-the-source-of-modi-assassination-malware-on-rona-wilsons-pc)\n\n[was one of many files delivered via a NetWire RAT remote session that](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-I.zip)\n\nwe associate with ModifiedElephant. [Further analysis showed how](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Surendra-Gadling-Report-III.zip)\n\nModifiedElephant was performing nearly identical evidence creation\n\nand organization across multiple unrelated victim systems within\n\nroughly fifteen minutes of each other.\n\n### INCUBATOR KEYLOGGER\n\nKnown victims have also been targeted with keylogger payloads stretching\n\n[as far back as 2012 (0a3d635eb11e78e6397a32c99dc0fd5a). These](https://www.virustotal.com/gui/file/d780446e89cb71d5346ac7a389266c15b0c0d5c42e46c7a88003f93aab2ba8b5)\n\nkeyloggers, packed at delivery, are written in Visual Basic and are not\n\nthe least bit technically impressive. Moreover, they’re built in such a\n\nbrittle fashion that they no longer function.\n\nThe overall structure of the keylogger is fairly similar to code openly\n\nshared on [Italian hacking forums in 2012. The ModifiedElephant](https://italianhack.forumfree.it/?t=63131534)\n\nvariant creates a hidden window titled ‘cssrs incubator’ along with\n\n_SetWindowsHookEx to monitor for keystrokes. It registers the mutex_\n\n\n-----\n\n[“4oR_$$$tonelsu-mviiLempel-Ziv” and uses the VBScript to WMI connector to query for the victim](https://docs.microsoft.com/en-us/windows/win32/wmisdk/connecting-to-wmi-with-vbscript)\n\nsystem’s MAC address and operating system. The malware eventually exfiltrates the logs under\n\nthe header “Logs from <COMPUTERNAME>” via email.\n\nFig 3: Log upload format string\n\nIn some ways, the Incubator keylogger is far more brittle than the code referenced above as it\n\nrelies on specific web content to function (that code is no longer available on the internet at the\n\ntime of writing). For example, the keylogger will use a GET request to an outdated ‘whatismyip.\n\ncom’ endpoint in order to get the victim system’s IP.\n\nFig 4: Outdated WhatIsMyIp endpoint used to check the victim’s IP\n\nSimilarly, in order to exfiltrate the logs, the keylogger pulls Microsoft schema templates to set up\n\nan SMTP server and push out the content using a hardcoded (but obfuscated) email address. None\n\nof the schema sites requested by the keylogger are available at the time of writing, rendering the\n\nkeylogger (in its 2012 form) unable to function.\n\nFig 5: Incubator keylogger using Microsoft schema templates to create an SMTP server\n\n\n-----\n\nThe keylogger makes use of hardcoded SMTP credentials and email addresses to deliver the logged\n\nkeystrokes to attacker controlled accounts, including:\n\n**Email** **Associated Sample**\n\nchiragdin3@gmail.com 0a3d635eb11e78e6397a32c99dc0fd5a\n\nloggerdata123@gmail.com c095d257983acca64eb52979cfc847ef\n\n0a3d635eb11e78e6397a32c99dc0fd5a\n56d573d4c811e69a992ab3088e44c268\n\nmaalhamara@gmail.com 1396f720bc7615385bc5df49bbd50d29\n\nd883399966cb29c7c6c358b7c9fdb951\neff9b8e1ee17cd00702279db5de39a3c\n\n0db49f572bb1634a4217b5215b1c2c6f\n\nmaalhamara2@gmail.com ea324dd1dbc79fad591ca46ead4676a1\n\nfd4902b8a4a4718f5219b301475e81aa\n\nnayaamaal1@yahoo.com 0db49f572bb1634a4217b5215b1c2c6f\n\nnayaamaal122@yahoo.com d883399966cb29c7c6c358b7c9fdb951\n\nnayaamaal2@yahoo.in ea324dd1dbc79fad591ca46ead4676a1\n\nnayaamaal4@yahoo.com 1396f720bc7615385bc5df49bbd50d29\n\nnewmaal@yahoo.com fd4902b8a4a4718f5219b301475e81aa\n\nshab03@indiatimes.com c095d257983acca64eb52979cfc847ef\n\ntamizhviduthalai@gmail.com 1720ae54d8ca630b914f622dcf0c1878\n\ntryluck222@gmail.com 56d573d4c811e69a992ab3088e44c268\n\nvolvoxyz123@gmail.com ef42dc2b27db73131e1c01ca9c9c41b6\n\nThe keylogger samples also contain VBP and PDB paths, providing some potential context to their\n\noriginating development environments.\n\nIn some cases, the attacker conducted multiple unique phishing attempts with the same payloads\n\nacross one or more targets. However, ModifiedElephant generally conducts each infection attempt\n\nwith new malware samples.\n\n\n-----\n\n### ANDROID TROJAN\n\nModifiedElephant also sent multiple phishing emails containing both NetWire and Android malware\n\npayloads at the same time. The Android malware is an unidentified commodity trojan delivered as\n\n[an APK file (0330921c85d582deb2b77a4dc53c78b3). While the Android trojan bears marks of](https://www.virustotal.com/gui/file/4dbb14ff2836733b34594956c4234d2a54c04257710dd31a0884b1926d35d7bc)\n\nbeing designed for broader cybercrime, its delivery at the same time as ModifiedElephant Netwire\n\nsamples indicates that the same attacker was attempting to get full coverage of the target on both\n\nendpoint and mobile.\n\nFig 6: ModifiedElephant Phishing email with malicious\nattachments for Netwire and Android GM Bot variants.\n\nFig 7: ModifiedElephant Phishing email with malicious\nattachments for Netwire and Android GM Bot variants.\n\nThe trojan enables the attackers to intercept and manage SMS and call data, wipe or unlock the\n\ndevice, perform network requests, and remote administration. In a very basic form, the trojan\n\nprovides the attackers with an ideal low-cost mobile surveillance toolkit.\n\n\n-----\n\n### RELATIONS TO OTHER THREAT CLUSTERS\n\nOur research into this threat actor reveals multiple interesting threads that highlight the complex\n\nnature of targeted surveillance and tasking, where multiple actors swoop in with diverse mechanisms\n\nto track the same group of individuals. These include private sector offensive actors (PSOAs) and\n\ngroups with possible commercial facades to coordinate their illicit activities.\n\nBased on our analysis of ModifiedElephant, the group operates in an overcrowded target space and\n\nmay have relations with other regional threat actors. From our visibility, we can’t further disambiguate\n\nthe shape of that relationship–whether as part of an active umbrella organization, cooperation and\n\nsharing of technical resources and targets across threat groups, or simply coincidental overlaps.\n\nSome interesting overlaps are detailed below.\n\n  - Multiple individuals targeted by ModifiedElephant over the years have also been either targeted\n\n[or confirmed infected with mobile surveillance spyware. Amnesty International identified NSO](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\n\nGroup’s Pegasus being used in targeted attacks in 2019 against human rights defenders related\n\nto the Bhima Koregaon case. Additionally, the Bhima Koregaon case defendant Rona Wilson’s\n\n[iPhone was targeted with Pegasus since 2017 based on a digital forensics analysis of an iTunes](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-IV.zip)\n\nbackup found in the forensic disk images analyzed by Arsenal Consulting.\n\n  - Between February 2013 and January 2014 one target, Rona Wilson, received phishing\n\nemails that can be attributed to the SideWinder threat actor. The relationship between\n\nModifiedElephant and SideWinder is unclear as only the timing and targets of their phishing\n\nemails overlap within our dataset. This could suggest that the attackers are being provided with\n\n[similar tasking by a controlling entity, or that they work in concert somehow. SideWinder is a](https://github.com/malwarekiwi/Public-Content/raw/master/Global%20Perspective%20of%20the%20SideWinder%20APT.pdf)\n\n[threat actor targeting government, military, and business entities primarily throughout Asia.](https://github.com/malwarekiwi/Public-Content/raw/master/Global%20Perspective%20of%20the%20SideWinder%20APT.pdf)\n\n[• ModifiedElephant phishing email payloads (b822d8162dd540f29c0d8af28847246e) share](https://www.virustotal.com/gui/file/828de55ffbfb1c1b6ffcbb56b838486dbaecc9b41a0d111fcca290978ed05e95)\n\n[infrastructure overlaps (new-agency[.]us) with Operation Hangover. Operation Hangover includes](https://web.archive.org/web/20210226131047/https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2013/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf)\n\nsurveillance efforts against targets of interest to Indian national security, both foreign and\n\ndomestic, in addition to industrial espionage efforts against organizations around the world.\n\n  - Another curious finding is the inclusion of the string “Logs from Moosa’s” found in a keylogger sample\n\n[closely associated with ModifiedElephant activity in 2012 (c14e101c055c9cb549c75e90d0a99c0a).](https://www.virustotal.com/gui/file/b665efe9b3dd575e17631146706d6a950d642aa7b7401ac794480c2bb557594c)\n\n[The string could be a reference to Moosa Abd-Ali Ali, the Bahrain activist targeted around the](https://www.theverge.com/2015/1/21/7861645/finfisher-spyware-let-bahrain-government-hack-political-activist)\n\n[same time, with FinFisher spyware. Without greater information, we treat this as a low confidence](https://www.theverge.com/2015/1/21/7861645/finfisher-spyware-let-bahrain-government-hack-political-activist)\n\nconjecture in need of greater research.\n\n\n-----\n\n### ATTRIBUTION\n\nAttributing an attacker like ModifiedElephant is an interesting challenge. At this time, we possess\n\nsignificant evidence of what the attacker has done over the past decade, a unique look into who\n\nthey’ve targeted, and a strong understanding of their technical objectives.\n\nWe observe that ModifiedElephant activity aligns sharply with Indian state interests and that there\n\nis an observable correlation between ModifiedElephant attacks and the arrests of individuals in\n\ncontroversial, politically-charged cases.\n\n### CONCLUSION\n\nThe Bhima Koregaon case has offered a revealing perspective into the world of a threat actor willing\n\nto place significant time and resources into seeking the disruption of those with opposing views.\n\nOur profile of ModifiedElephant has taken a look at a small subset of the total list of potential\n\ntargets, the attackers techniques, and a rare glimpse into their objectives. Many questions about\n\nthis threat actor and their operations remain; however, one thing is clear: Critics of authoritarian\n\ngovernments around the world must carefully understand the technical capabilities of those who\n\nwould seek to silence them.\n\n\n-----\n\n### INDICATORS OF COMPROMISE\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n### TECHNICAL REFERENCES\n\n1 : [h t t p s : // w w w. a m n e s t y. o r g /e n / l a t e s t / r e s e a r c h / 2 0 2 0 / 0 6 / i n d i a -](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\n[h u m a n - r i g h t s - d e f e n d e r s - t a r g e t e d - b y - a - c o o r d i n a t e d - s p y w a r e -](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\n[o p e r a t i o n / [ A r c h i v e d ]](https://www.amnesty.org/en/latest/research/2020/06/india-human-rights-defenders-targeted-by-a-coordinated-spyware-operation/)\n\n2 : [h t t p s : //a r s e n a l e x p e r t s . c o m / p e r s i s t e n t / r e s o u r c e s / p a g e s / B K - C a s e -](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-I.zip)\n[R o n a - W i l s o n - R e p o r t - I . z i p [ A r c h i v e d ]](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-I.zip)\n\n3 : [h t t p s : //a r s e n a l e x p e r t s . c o m / p e r s i s t e n t / r e s o u r c e s / p a g e s / B K - C a s e -](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-II.zip)\n[R o n a - W i l s o n - R e p o r t - I I . z i p [ A r c h i v e d ]](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-II.zip)\n\n4 : [h t t p s : //a r s e n a l e x p e r t s . c o m / p e r s i s t e n t / r e s o u r c e s / p a g e s / B K - C a s e -](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Surendra-Gadling-Report-III.zip)\n[S u r e n d r a - G a d l i n g - R e p o r t - I I I . z i p [ A r c h i v e d ]](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Surendra-Gadling-Report-III.zip)\n\n5 : [h t t p s : //a r s e n a l e x p e r t s . c o m / p e r s i s t e n t / r e s o u r c e s / p a g e s / B K - C a s e -](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-IV.zip)\n[R o n a - W i l s o n - R e p o r t - I V. z i p [ A r c h i v e d ]](https://arsenalexperts.com/persistent/resources/pages/BK-Case-Rona-Wilson-Report-IV.zip)\n\n6 : [h t t p s : // w e b . a r c h i v e . o r g / w e b / 2 0 2 1 0 2 2 6 1 3 1 0 4 7/ h t t p s : // p a p e r.](https://web.archive.org/web/20210226131047/https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2013/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf)\n[s e e b u g . o r g / p a p e r s /A P T/A P T _ C y b e r C r i m i n a l _ C a m p a g i n / 2 0 1 3 / N S -](https://web.archive.org/web/20210226131047/https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2013/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf)\n[U n v e i l i n g - a n - I n d i a n - C y b e r a t t a c k - I n f r a s t r u c t u r e _ F I N A L _ We b . p d f](https://web.archive.org/web/20210226131047/https://paper.seebug.org/papers/APT/APT_CyberCriminal_Campagin/2013/NS-Unveiling-an-Indian-Cyberattack-Infrastructure_FINAL_Web.pdf)\n\n7 : [h t t p s : //a r c h i v e . o r g /d o w n l o a d / u n v e i l i n g - a n - i n d i a n - c y b e r a t t a c k -](https://archive.org/download/unveiling-an-indian-cyberattack-infrastructure-appendixes/Unveiling%20an%20Indian%20Cyberattack%20Infrastructure%20-%20appendixes.pdf)\n[i n f r a s t r u c t u r e - a p p e n d i x e s / U n v e i l i n g % 2 0 a n % 2 0 I n d i a n % 2 0](https://archive.org/download/unveiling-an-indian-cyberattack-infrastructure-appendixes/Unveiling%20an%20Indian%20Cyberattack%20Infrastructure%20-%20appendixes.pdf)\n[C y b e r a t t a c k % 2 0 I n f r a s t r u c t u r e % 2 0 - % 2 0 a p p e n d i x e s . p d f](https://archive.org/download/unveiling-an-indian-cyberattack-infrastructure-appendixes/Unveiling%20an%20Indian%20Cyberattack%20Infrastructure%20-%20appendixes.pdf)\n\n8 : [h t t p s : //g i t h u b . c o m / m a l w a r e k i w i / P u b l i c - C o n t e n t / r a w/ m a s t e r/](https://github.com/malwarekiwi/Public-Content/raw/master/Global%20Perspective%20of%20the%20SideWinder%20APT.pdf )\n[G l o b a l % 2 0 P e r s p e c t i v e % 2 0 o f % 2 0 t h e % 2 0 S i d e W i n d e r % 2 0 A P T. p d f](https://github.com/malwarekiwi/Public-Content/raw/master/Global%20Perspective%20of%20the%20SideWinder%20APT.pdf )\n\n\n-----\n\n## ABOUT SENTINELLABS\n\nInfoSec works on a rapid iterative cycle where new discoveries occur daily and authoritative\nsources are easily drowned in the noise of partial information. SentinelLabs is an open venue\nfor our threat researchers and vetted contributors to reliably share their latest findings with a\nwider community of defenders. No sales pitches, no nonsense. We are hunters, reversers, exploit\ndevelopers, and tinkerers shedding light on the world of malware, exploits, APTs, and cybercrime\n\nacross all platforms. SentinelLabs embodies our commitment to sharing openly –providing tools,\n\ncontext, and insights to strengthen our collective mission of a safer digital life for all.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/u4ugjnwl2w9f7pdfz22uh1l7cqc3xpdr",
        "https://www.sentinelone.com/wp-content/uploads/2022/02/Modified-Elephant-APT-and-a-Decade-of-Fabricating-Evidence-SentinelLabs.pdf"
    ],
    "report_names": [
        "SentinalOne_modified-elephant-apt(02-09-2022)",
        "Modified-Elephant-APT-and-a-Decade-of-Fabricating-Evidence-SentinelLabs.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88854a9f-641a-4412-89db-449b4d5cbc51",
            "created_at": "2022-10-25T16:07:23.963599Z",
            "updated_at": "2025-03-27T02:02:10.051548Z",
            "deleted_at": null,
            "main_name": "Operation HangOver",
            "aliases": [
                "Monsoon",
                "Operation HangOver",
                "Viceroy Tiger"
            ],
            "source_name": "ETDA:Operation HangOver",
            "tools": [
                "AutoIt backdoor",
                "BADNEWS",
                "BackConfig",
                "JakyllHyde",
                "TINYTYPHON",
                "Unknown Logger",
                "WSCSPL"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd350b-de30-4d29-bbee-28159f26c8c2",
            "created_at": "2023-01-06T13:46:38.433736Z",
            "updated_at": "2025-03-27T02:00:02.832565Z",
            "deleted_at": null,
            "main_name": "VICEROY TIGER",
            "aliases": [
                "OPERATION HANGOVER",
                "Donot Team",
                "APT-C-35",
                "SectorE02",
                "Orange Kala"
            ],
            "source_name": "MISPGALAXY:VICEROY TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9c884c88-2c9f-49c5-856a-2383ad1d8ef8",
            "created_at": "2024-05-01T02:03:08.152Z",
            "updated_at": "2025-03-27T02:05:17.422887Z",
            "deleted_at": null,
            "main_name": "ZINC EMERSON",
            "aliases": [
                "Dropping Elephant ",
                "EHDevel ",
                "Manul ",
                "Monsoon ",
                "Operation Hangover ",
                "Patchwork ",
                "TG-4410 ",
                "Viceroy Tiger ",
                "Confucius "
            ],
            "source_name": "Secureworks:ZINC EMERSON",
            "tools": [
                " Hanove",
                " Mac OS X KitM Spyware",
                " Proyecto2",
                " YTY Backdoor",
                "Enlighten Infostealer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c81067e0-9dcb-4e3f-abb0-80126519c5b6",
            "created_at": "2022-10-25T15:50:23.285448Z",
            "updated_at": "2025-03-27T02:00:55.42906Z",
            "deleted_at": null,
            "main_name": "Patchwork",
            "aliases": [
                "Hangover Group",
                "Dropping Elephant",
                "Chinastrats",
                "Operation Hangover"
            ],
            "source_name": "MITRE:Patchwork",
            "tools": [
                "NDiskMonitor",
                "QuasarRAT",
                "BackConfig",
                "TINYTYPHON",
                "AutoIt backdoor",
                "PowerSploit",
                "BADNEWS",
                "Unknown Logger",
                "Socksbot"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67e56ffa-aad6-4a0d-89fe-ac443dfb2f1b",
            "created_at": "2023-01-06T13:46:39.364262Z",
            "updated_at": "2025-03-27T02:00:03.062992Z",
            "deleted_at": null,
            "main_name": "ModifiedElephant",
            "aliases": [],
            "source_name": "MISPGALAXY:ModifiedElephant",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1644398731,
    "ts_modification_date": 1644398735,
    "files": {
        "pdf": "https://archive.orkl.eu/892e3677718b44d08c8b95f63867c55215931363.pdf",
        "text": "https://archive.orkl.eu/892e3677718b44d08c8b95f63867c55215931363.txt",
        "img": "https://archive.orkl.eu/892e3677718b44d08c8b95f63867c55215931363.jpg"
    }
}