{
    "id": "2a7d8d2c-2c79-4bb1-88ff-f7ae2ba3159c",
    "created_at": "2023-01-12T15:02:46.62711Z",
    "updated_at": "2025-03-27T02:09:30.011724Z",
    "deleted_at": null,
    "sha1_hash": "c2abb89e36cf0b8d4a02821fd81af4c43b7a1b2e",
    "title": "2017-11-20 - OSX.Proton spreading through fake Symantec blog",
    "authors": "",
    "file_creation_date": "2022-05-28T17:59:31Z",
    "file_modification_date": "2022-05-28T17:59:31Z",
    "file_size": 460373,
    "plain_text": "# OSX.Proton spreading through fake Symantec blog\n\n**blog.malwarebytes.com/threat-analysis/mac-threat-analysis/2017/11/osx-proton-spreading-through-fake-symantec-**\nblog/\n\nThomas Reed November 20, 2017\n\n[Sunday night, a series of tweets from security researcher @noarfromspace revealed a new](https://twitter.com/noarfromspace)\nvariant of the OSX.Proton malware, spreading in a concerning new method—spoofing\nsecurity company Symantec’s blog.\n\n\n-----\n\n## Method of infection\n\nThe malware is being promoted via a fake Symantec blog site at symantecblog[dot]com. The\nsite is a good imitation of the real Symantec blog, even mirroring the same content. The\nregistration information for the domain appears, on first glance, to be legitimate, using the\nsame name and address as the legitimate Symantec site. The email address used to register\nthe domain is a dead giveaway, however:\n\n\n-----\n\nEven more suspicious is the certificate used by the site. It is legitimate SSL certificate, but\nwas issued by Comodo rather than Symantec’s own certificate authority.\n\nThe fake site contains a blog post about a supposed new version of CoinThief, a piece of\nmalware from 2014. The fake post claims that a new variant of CoinThief has been spotted.\nIn fact, as far as I’ve been able to determine, this is a made-up story, and no such new\nvariant of CoinThief actually exists.\n\nThe fake post promotes a program called “Symantec Malware Detector,” supposedly to\ndetect and remove the malware. No such program actually exists.\n\nUnfortunately, links to the fake post have been spreading on Twitter. Some of the accounts\ntweeting the link appear to be fake accounts, but others seem to be legitimate. Given the fact\nthat the primary goal of the Proton malware is to steal passwords, these could be hacked\naccounts whose passwords were compromised in a previous Proton outbreak. However,\nthey could also simply be the result of people being tricked into thinking the fake blog post is\nreal.\n\nUsers who download and run the “Symantec Malware Detector” will instead be infected with\nmalware.\n\n## Malware behavior\n\nWhen run, the malicious Symantec Malware Detector application displays a very simple\nwindow, using the Symantec logo:\n\n\n-----\n\nIf the user quits the application at this point, the malware does not actually get installed.\nHowever, let’s be honest—if you’ve been tricked into downloading and opening this\napplication, you probably won’t bail out at this point.\n\nClicking the “Check” button results in a request for an admin password:\n\nThe average Mac user has seen these kinds of password request many times before, so\nagain, this is unlikely to raise suspicions among users who have gotten this far. In reality, this\nis a very well-done fake and will give the malware your password. (Unlike the legitimate\npassword request this is designed to imitate, which does not give the requesting software the\nuser’s password.)\n\nIf an admin password is provided, the application displays a progress bar claiming to be\nscanning the computer.\n\n\n-----\n\nIn reality, however, the application has installed the Proton malware.\n\nThe malware will begin capturing information, including logging the user’s admin password in\nclear text, among a lot of other personally-identifying information (PII) to a hidden file:\n```\n[...]\n<metadata>\n <date>2017-11-19T20:29:19.801Z</date>\n <serial>*********</serial>\n <username>test</username>\n <fullname>test</fullname>\n <hostname>test%E2%80%99s Mac</hostname>\n <password>testpw</password>\n <os_version>10.12.6</os_version>\n <os_locale>en_US</os_locale>\n</metadata>\n[...]\n\n```\nThe malware also captures and exfiltrates things like keychain files, browser auto-fill data,\n1Password vaults, and GPG passwords. Since the malware has phished the user’s\npassword, the hackers will be able to decrypt the keychain files at a minimum.\n\n## Indicators of compromise\n\nThe Symantec Malware Detector application is, as far as I’m able to determine, a completely\nmade-up name. If you see such an application—perhaps in the Downloads folder, or perhaps\nin the Applications folder, depending on where the user puts it—it should be deleted.\n\n\n-----\n\nIf you are unsure of whether the application is actually malicious, you can check the code\nsignature. Enter the following command in the Terminal, substituting the actual path:\n```\ncodesign -dvvv \"path/to/Symantec Malware Detector.app\"\n\n```\nThe malicious application has been signed by someone named Sverre Huseby, using a\ncertificate with a team identifier of E224M7K47W. Anything signed with this certificate should\nbe considered malicious.\n\nOnce this malicious “dropper” application has been run, the following paths will be found on\nthe system:\n```\n/Library/LaunchAgents/com.apple.xpcd.plist\n/Library/.cachedir/\n/Library/.random/\n\n```\nThe .random directory holds the malicious Proton executable, which is kept running by the\ncom.apple.xpcd.plist launch agent. The .cachedir folder contains data that has been or will\nbe exfiltrated.\n\nIn addition to these files, the /private/etc/sudoers file will have been modified. The following\nline will have been added to the end:\n```\nDefaults !tty_tickets\n\n```\nThat line should be removed from the sudoers file.\n\nFortunately, Apple is aware of this malware and has revoked the certificate used to sign the\nmalware. This will prevent future infections by the Symantec Malware Detector. Revoking the\ncertificate will not, by itself, do anything to protect a machine that is already infected.\n\n\n-----\n\n## Implications\n\n[Malwarebytes for Mac will detect and remove Proton infections for free. If you find your Mac](https://malwarebytes.com/mac)\nto be infected, it’s quite easy to remove the malware. However, removing the malware is only\na part of the solution.\n\nSince Proton is designed to steal login credentials, you will need to take some emergency\nactions post-infection. You should treat all online passwords as compromised and change\nthem all. Be sure, while you’re at it, to use different passwords on every site, and use a\n[password manager (such as 1Password or LastPass) to keep track of them. Since](https://blog.malwarebytes.com/glossary/password-manager/)\n1Password vaults are a target of Proton, be sure that you don’t store your password\nmanager’s master password in your keychain or anywhere else on the computer. That\nshould be the one and only password that you memorize, and it should be strong.\n\nYou should also enable two-factor authentication on every account that will allow you to do\nso. That will minimize the impact of such breaches in the future by ensuring that a hacker will\nneed more than just your password to access your accounts.\n\nIn addition to passwords, you should consider any other information that may have been part\nof the compromise. For example, if you store credit card numbers or other sensitive data in\nthe keychain, it should be treated as compromised and you should respond accordingly.\n\nAs always, if the machine that was compromised was issued to you by your employer, or has\ncompany data on it, you should notify IT immediately. Failure to do so could lead to a very\nserious breach of your company’s systems.\n\n## Conclusion\n\nProton has been circulating for quite some time after its initial appearance in March. It has\n[previously been distributed via a compromise of the Handbrake application and a similar](https://blog.malwarebytes.com/threat-analysis/mac-threat-analysis/2017/05/handbrake-hacked-to-drop-new-variant-of-proton-malware/)\n[compromise of a couple Eltima Software applications. It is highly likely that Proton will](https://blog.malwarebytes.com/cybercrime/2017/10/mac-malware-osx-proton-strikes-again/)\ncontinue to circulate, and similar incidents will continue to occur.\n\nProton illustrates an increasing problem in the Mac community. The prevailing attitude that\nyou can avoid Mac malware if you’re careful enough is failing in the face of supply chain\nattacks, such as the hacks of the Handbrake and Eltima Software systems.\n\nFurther, so-called “fake news” being used to distribute malware is a highly dangerous threat.\nMany people these days are looking to download malware removal software for the Mac, due\nto the increasing prevalence of annoying Mac adware. Unfortunately, it is often the case that\nsuch software will be downloaded after a search that gives questionable results, or after\nseeing a recommendation from a hacked or fake account on social media or forums.\n\n\n-----\n\nMacs are the targets of an increasing amount of malware. They can no longer be assumed\nto be safe. The old advice that “Macs don’t get viruses,” which can still be found echoing in\nmany Mac-centric forums, has never been true, and this is becoming increasingly obvious to\nthose following such events. Do not fall victim due to a false sense of security caused by the\nfact that you have a Mac!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-11-20 - OSX.Proton spreading through fake Symantec blog.pdf"
    ],
    "report_names": [
        "2017-11-20 - OSX.Proton spreading through fake Symantec blog.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535766,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653760771,
    "ts_modification_date": 1653760771,
    "files": {
        "pdf": "https://archive.orkl.eu/c2abb89e36cf0b8d4a02821fd81af4c43b7a1b2e.pdf",
        "text": "https://archive.orkl.eu/c2abb89e36cf0b8d4a02821fd81af4c43b7a1b2e.txt",
        "img": "https://archive.orkl.eu/c2abb89e36cf0b8d4a02821fd81af4c43b7a1b2e.jpg"
    }
}