{
    "id": "2aa9e47e-5604-4248-834e-331348a914d2",
    "created_at": "2023-01-12T14:59:20.454214Z",
    "updated_at": "2025-03-27T02:06:06.38482Z",
    "deleted_at": null,
    "sha1_hash": "a6710386ea0fbe0e78c4a4c3793885f1ee401dfa",
    "title": "2020-06-10 - Misconfigured Kubeflow workloads are a security risk",
    "authors": "",
    "file_creation_date": "2022-05-29T01:26:17Z",
    "file_modification_date": "2022-05-29T01:26:17Z",
    "file_size": 354121,
    "plain_text": "# Misconfigured Kubeflow workloads are a security risk\n\n**[microsoft.com/security/blog/2020/06/10/misconfigured-kubeflow-workloads-are-a-security-risk/](https://www.microsoft.com/security/blog/2020/06/10/misconfigured-kubeflow-workloads-are-a-security-risk/)**\n\nJune 10, 2020\n\nAzure Security Center (ASC) monitors and defends thousands of Kubernetes clusters\nrunning on top of AKS. Azure Security Center regularly searches for and research for new\nattack vectors against Kubernetes workloads. We recently published a blog post about a\nlarge scale campaign against Kubernetes clusters that abused exposed Kubernetes\ndashboards for deploying cryptocurrency miners.\n\nIn this blog, we’ll reveal a new campaign that was observed recently by ASC that targets\nKubeflow, a machine learning toolkit for Kubernetes. We observed that this attack effected on\ntens of Kubernetes clusters.\n\nKubeflow is an open-source project, started as a project for running TensorFlow jobs on\nKubernetes. Kubeflow has grown and become a popular framework for running machine\nlearning tasks in Kubernetes. Nodes that are used for ML tasks are often relatively powerful,\nand in some cases include GPUs. This fact makes Kubernetes clusters that are used for ML\ntasks a perfect target for crypto mining campaigns, which was the aim of this attack.\n\nDuring April, we observed deployment of a suspect image from a public repository on many\ndifferent clusters. The image is ddsfdfsaadfs/dfsdf:99. By inspecting the image’s layers, we\ncan see that this image runs an XMRIG miner:\n\nThis repository contains several more images, which differ in the mining configuration. We\nsaw some deployments of those images too.\n\nLooking at the various clusters that the above image ran on showed that most of them run\nKubeflow. This fact implies that the access vector in this attacker is the machine-learning\nframework.\n\nThe question is how can Kubeflow be used as an access vector for such an attack?\n\nKubeflow framework consists of many different services. Some of those services include:\nframeworks for training models, Katib and Jupyter notebook server, and more.\n\n\n-----\n\nKubeflow is a containerized service: the various tasks run as containers in the cluster.\nTherefore, if attackers somehow get access to Kubeflow, they have multiple ways to run their\nmalicious image in the cluster.\n\nThe framework is divided into different namespaces, which are a collection of Kubeflow\nservices. Those namespaces are translated into Kubernetes namespaces in which the\nresources are deployed.\n\nIn first access to Kubeflow, the user is prompted to create a namespace:\n\nIn the picture above, we created a new namespace with the default name anonymous. This\nnamespace is broadly seen in the attack and was one of the indicators to the access vector\nin this campaign.\n\nKubeflow creates multiple CRDs in the cluster which expose some functionality over the API\nserver:\n\n\n-----\n\nIn addition, Kubeflow exposes its UI functionality via a dashboard that is deployed in the\ncluster:\n\nThe dashboard is exposed by Istio ingress gateway, which is by default accessible only\ninternally. Therefore, users should use port-forward to access the dashboard (which tunnels\nthe traffic via the Kubernetes API server).\n\nIn some cases, users modify the setting of the Istio Service to Load-Balancer which exposes\nthe Service (istio-ingressgateway in the namespace istio-system) to the Internet. We\nbelieve that some users chose to do it for convenience: without this action, accessing to the\ndashboard requires tunneling through the Kubernetes API server and isn’t direct. By\nexposing the Service to the Internet, users can access to the dashboard directly. However,\nthis operation enables insecure access to the Kubeflow dashboard, which allows anyone to\nperform operations in Kubeflow, including deploying new containers in the cluster.\n\nIf attackers have access to the dashboard, they have multiple methods to deploy a backdoor\ncontainer in the cluster. We will demonstrate two options:\n\n1. Kubeflow enables users to create a Jupyter notebook server. Kubeflow allows users to\n\nchoose the image for the notebook server, including an option to specify a custom\nimage:\n\n\n-----\n\nThis image doesn’t necessarily have to be a legitimate notebook image, thus attackers can\nrun their own image using this feature.\n\n\n-----\n\n1. Another method that attackers can use is to deploy a malicious container from a real\n\nJupyter notebook: attackers can use a new or existing notebook for running their\nPython code. The code runs from the notebook server, which is a container by itself\nwith a mounted service account. This service account (by default configuration) has\npermissions to deploy containers in its namespace. Therefore, attackers can use it to\ndeploy their backdoor container in the cluster. Here’s an example of deploying a\ncontainer from the notebook using its service account:\n\nThe [Kubernetes threat matrix that we recently published contains techniques that can be](https://www.microsoft.com/security/blog/2020/04/02/attack-matrix-kubernetes/)\nused by attackers to attack the Kubernetes cluster. A representation of this campaign in the\nmatrix would look like:\n\n\n-----\n\nThe attacker used an exposed dashboard (Kubeflow dashboard in this case) for gaining\n**initial access to the cluster. The execution and persistence in the cluster were performed**\nby a container that was deployed in the cluster. The attacker managed to move laterally and\ndeploy the container using the mounted service account. Finally, the attacker impacted the\ncluster by running a cryptocurrency miner.\n\n## How to check if your cluster is impacted?\n\n1. Verify that the malicious container is not deployed in the cluster. The following\n\ncommand can help you to check it:\n\n_kubectl get pods –all-namespaces -o jsonpath=”{.items[*].spec.containers[*].image}” | grep -i_\n_ddsfdfsaadfs_\n\n1. In case Kubeflow is deployed in the cluster, make sure that its dashboard isn’t exposed\n\nto the internet: check the type of the Istio ingress service by the following command\nand make sure that it is not a load balancer with a public IP:\n\n_kubectl get service istio-ingressgateway -n istio-system_\n\n## Conclusion\n\nAzure Security Center has detected multiple campaigns against Kubernetes clusters in the\npast that have a similar access vector: an exposed service to the internet. However, this is\nthe first time that we have identified an attack that targets Kubeflow environments\nspecifically.\n\nWhen deploying a service like Kubeflow within a cluster it is crucial to be aware of security\naspects such as:\n\n1. Authentication and access control to the application.\n2. Monitor the public-facing endpoints of the cluster. Make sure that sensitive interfaces\n\nare not exposed to the internet in an unsecure method. You can restrict public load\nbalancers in the cluster by using Azure Policy, which now has integration with\nGatekeeper.\n3. Regularly monitor the runtime environment. This includes monitoring the running\n\ncontainers, their images, and the processes that they run.\n4. Allow deployments of only trusted images and scan your images for vulnerabilities. The\n\nallowed images in the cluster can be restricted by using Azure Policy.\n\nTo learn more about AKS Support in Azure Security Center, [please see this documentation.](https://docs.microsoft.com/en-us/azure/security-center/azure-kubernetes-service-integration)\n\n[Start a trial of Azure Security Center Standard to get advanced threat protection capabilities.](https://azure.microsoft.com/en-us/free/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-10 - Misconfigured Kubeflow workloads are a security risk.pdf"
    ],
    "report_names": [
        "2020-06-10 - Misconfigured Kubeflow workloads are a security risk.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535560,
    "ts_updated_at": 1743041166,
    "ts_creation_date": 1653787577,
    "ts_modification_date": 1653787577,
    "files": {
        "pdf": "https://archive.orkl.eu/a6710386ea0fbe0e78c4a4c3793885f1ee401dfa.pdf",
        "text": "https://archive.orkl.eu/a6710386ea0fbe0e78c4a4c3793885f1ee401dfa.txt",
        "img": "https://archive.orkl.eu/a6710386ea0fbe0e78c4a4c3793885f1ee401dfa.jpg"
    }
}