{
    "id": "2aab9ce3-c1ec-4d9f-b32f-deac4f13ae83",
    "created_at": "2023-01-12T15:10:21.326581Z",
    "updated_at": "2025-03-27T02:11:15.750093Z",
    "deleted_at": null,
    "sha1_hash": "ea22e3f492cd406c7c051abbebfc8d2af37dc623",
    "title": "2015-07-08 - Butterfly- Profiting from high-level corporate attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T18:19:44Z",
    "file_modification_date": "2022-05-28T18:19:44Z",
    "file_size": 766221,
    "plain_text": "# Endpoint Protection\n\n**[symantec.com/connect/blogs/butterfly-profiting-high-level-corporate-attacks](https://www.symantec.com/connect/blogs/butterfly-profiting-high-level-corporate-attacks)**\n\n[A L Johnson](https://community.broadcom.com/symantecenterprise/network/members/profile?UserKey=cbd453fd-3ce1-4c47-af77-d746256f9bc4)\n\n\nJul 08, 2015 07:35 AM\n\n\n_Note: “Morpho” was used in the original publication to refer to this attack group. Symantec_\n_has renamed the group “Butterfly” to avoid any link whatsoever to other legitimate corporate_\n_entities named “Morpho”_\n\nA corporate espionage group has compromised a string of major corporations over the past\nthree years in order to steal confidential information and intellectual property. The gang,\nwhich Symantec calls Butterfly, is not-state sponsored, rather financially motivated. It has\nattacked multi-billion dollar companies operating in the internet, IT software,\npharmaceutical, and commodities sectors. Twitter, Facebook, Apple, and Microsoft are\namong the companies who have publicly acknowledged attacks.\n\nButterfly is technically proficient and well resourced. The group has developed a suite of\ncustom malware tools capable of attacking both Windows and Apple computers, and\nappears to have used at least one zero-day vulnerability in its attacks. It keeps a low profile\n\n\n-----\n\nand maintains good operational security. After successfully compromising a target\norganization, it cleans up after itself before moving on to its next target.\n\nThis group operates at a much higher level than the average cybercrime gang. It is not\ninterested in stealing credit card details or customer databases and is instead focused on\nhigh-level corporate information. Butterfly may be selling this information to the highest\nbidder or may be operating as hackers for hire. Stolen information could also be used for\ninsider-trading purposes.\n\n**A history of ambitious attacks**\nThe first signs of Butterfly’s activities emerged in early 2013 when several major technology\n[and internet firms were compromised. Twitter,](https://blog.twitter.com/2013/keeping-our-users-secure) [Facebook,](https://www.facebook.com/notes/facebook-security/protecting-people-on-facebook/10151249208250766) [Apple and](http://www.reuters.com/article/2013/02/19/us-apple-hackers-idUSBRE91I10920130219) [Microsoft disclosed](http://blogs.technet.com/b/msrc/archive/2013/02/22/recent-cyberattacks.aspx)\nthat they had been compromised by very similar attacks. The attackers attacked victims by\ncompromising a website used by mobile developers and using a Java zero-day exploit to\ninfect them with malware.\n\n[The malware used in these attacks was a Mac OS X back door known as OSX.Pintsized.](http://www.symantec.com/security_response/writeup.jsp?docid=2013-022017-1613-99)\nSubsequent analysis by security researcher Eric Romang identified a Windows back door,\n[Backdoor.Jiripbot, which was also used in the attacks.](http://www.symantec.com/security_response/writeup.jsp?docid=2014-111100-1423-99)\n\nFollowing this flurry of publicity, the Butterfly group slipped back into the shadows. However,\nan investigation by Symantec has found that the group has been active since at least March\n2012 and its attacks have not only continued to the present day, but have also increased in\nnumber. Symantec has to date discovered 49 different organizations in more than 20\ncountries that have been attacked by Butterfly. Over time, a picture has emerged of a\ncybercrime gang systematically targeting large corporations in order to steal confidential\ndata.\n\n\n-----\n\n_Figure 1. Top regions impacted by the Butterfly attack group_\n\n**Multiple sectors targeted**\n\nAside from the four companies which have publicly acknowledged attacks, Symantec has\nidentified five other large technology firms compromised by Butterfly, primarily\nheadquartered in the US. However, technology is not the only sector the group has focused\non and Symantec has found evidence that Butterfly has attacked three major European\npharmaceutical firms. In the first attack, the attackers gained a foothold by first attacking a\nsmall European office belonging to one firm and using this infection to then move on to its\nUS office and European headquarters. This template appeared to be followed in the two\nsubsequent attacks on big pharma firms, with Butterfly compromising computers in a\nnumber of regional offices before being discovered.\n\n\n-----\n\nButterfly has also shown an interest in the commodities sector, attacking two major\ncompanies involved in gold and oil in late 2014. In addition to this, the Central Asian offices\nof a global law firm were compromised in June 2015. The company specializes in finance\nand natural resources specific to that region. The latter was one of at least three law firms\nthe group has targeted over the past three years.\n\n_Figure 2. Timeline showing when attacks against different industry sectors began_\n\n\n-----\n\n**Stolen information**\nButterfly appears to have a good working knowledge of the organizations it is attacking and\nis focused on stealing specific kinds of information. In many attacks, the group has\nsucceeded in compromising Microsoft Exchange or Lotus Domino email servers in order to\nintercept company emails and possibly use them to send counterfeit emails.\n\nThe group has also attacked enterprise content management systems, which would often\nbe home to legal and policy documents, financial records, product descriptions, and training\ndocuments.\n\nIn some instances, the group has zoned in on specialist systems. For example, one attack\nsaw it gain access to a Physical Security Information Management (PSIM) system, which is\nused for managing and monitoring physical security systems, including swipe card access.\nThis could have provided the attackers with access to CCTV feeds, allowing them to track\nthe movement of people around buildings.\n\n**Suite of custom malware tools**\nButterfly has a number of malware tools at its disposal, all of which appear to be internally\ndeveloped. Each tool is well documented, indicating that a group rather than an individual is\nresponsible for the attacks.\n\n[Its primary tools are two back door Trojans. OSX.Pintsized is capable of opening a back](http://www.symantec.com/security_response/writeup.jsp?docid=2013-022017-1613-99)\n[door on Mac OS X computers. Its Windows counterpart is Backdoor.Jiripbot, which has](http://www.symantec.com/security_response/writeup.jsp?docid=2014-111100-1423-99)\nshown signs of continuous development over the past two years, with various minor\nfeatures being removed or added.\n\n[Butterfly has also developed a number of its own hacking tools. Hacktool.Securetunnel is a](http://www.symantec.com/security_response/writeup.jsp?docid=2015-070315-0811-99)\nmodified version of OpenSSH which contains additional code to pass a command-andcontrol (C&C) server address and port to a compromised computer.\n\n[Hacktool.Bannerjack is meanwhile used to retrieve default messages issued by Telnet,](http://www.symantec.com/security_response/writeup.jsp?docid=2015-070314-4857-99)\nHTTP, and generic Transmission Control Protocol (TCP) servers. Symantec believes it is\nused to locate any potentially vulnerable servers on the local network, likely including\nprinters, routers, HTTP servers, and any other generic TCP server. Butterfly uses\n[Hacktool.Multipurpose to help it move across a compromised networking by editing event](http://www.symantec.com/security_response/writeup.jsp?docid=2015-070314-5743-99)\nlogs to hide activity, dumping passwords, securely deleting files, encrypting files, and\ncarrying out basic network enumeration.\n\n[The group uses Hacktool.Eventlog to parse event logs, dumping out ones of interest, and](http://www.symantec.com/security_response/writeup.jsp?docid=2015-070315-0037-99)\n[delete entries. It also kills processes and performs a secure self-delete. Hacktool.Proxy.A is](http://www.symantec.com/security_response/writeup.jsp?docid=2015-070315-0515-99)\nused to create a proxy connection that allows attackers to route traffic through an\nintermediary node, onto their destination node.\n\n\n-----\n\n**Motivated by financial gain**\nBased on the profile of the victims and the type of information targeted by the attackers,\nSymantec believes that Butterfly is financially motivated, stealing information it can\npotentially profit from. The group appears to be agnostic about the nationality of its targets,\nleading us to believe that Butterfly is unaffiliated to any nation state.\n\nThe group’s malware is documented in fluent English, indicating that some of the group\nmembers, if not all, can speak the language. They also display some knowledge of English[speaking pop culture, such as using the meme AYBABTU (All your base are belong to us)](https://en.wikipedia.org/wiki/All_your_base_are_belong_to_us)\nas an encryption key in Backdoor.Jiripbot.\n\nCommand-and-control server activity is highest at times that correspond to the US working\nday, which may suggest some or all of the group are operating in this region. However, this\ncould also be accounted for by the fact that many of the group’s victims are located in the\nUS.\n\nButterfly may profit from its attacks in a number of ways. The group may be operating as\n“hackers for hire”, targeting corporations on request. Alternatively, it may select its own\ntargets and either sell stolen information to the highest bidder or use it for insider-trading\npurposes.\n\nButterfly is a disciplined, technically capable group with a high level of operational security.\nHaving managed to increase its level of activity over the past three years while maintaining\na low profile, the group poses a threat that ought to be taken seriously by corporations.\n\n**Protection**\nSymantec and Norton products have the following protections against the Butterfly toolset:\n\n**Antivirus**\n\n**Intrusion prevention system**\n\n**Further reading**\nFor detailed technical analysis and indicators of compromise, please read our whitepaper:\n[Butterfly: Corporate spies out for financial gain](http://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/butterfly-corporate-spies-out-for-financial-gain.pdf)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-07-08 - Butterfly- Profiting from high-level corporate attacks.pdf"
    ],
    "report_names": [
        "2015-07-08 - Butterfly- Profiting from high-level corporate attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "a653b7ac-97b5-465b-98cd-8713223b06a7",
            "created_at": "2023-01-06T13:46:38.592385Z",
            "updated_at": "2025-03-27T02:00:02.868419Z",
            "deleted_at": null,
            "main_name": "WildNeutron",
            "aliases": [
                "Morpho",
                "Sphinx Moth"
            ],
            "source_name": "MISPGALAXY:WildNeutron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "92c0dae2-e255-4b90-8d8f-be88e393ab8d",
            "created_at": "2022-10-25T16:07:24.402328Z",
            "updated_at": "2025-03-27T02:02:10.209983Z",
            "deleted_at": null,
            "main_name": "Wild Neutron",
            "aliases": [
                "Butterfly",
                "Morpho",
                "Sphinx Moth",
                "The Postal Group",
                "Wild Neutron"
            ],
            "source_name": "ETDA:Wild Neutron",
            "tools": [
                "HesperBot",
                "Jiripbot",
                "JripBot"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536221,
    "ts_updated_at": 1743041475,
    "ts_creation_date": 1653761984,
    "ts_modification_date": 1653761984,
    "files": {
        "pdf": "https://archive.orkl.eu/ea22e3f492cd406c7c051abbebfc8d2af37dc623.pdf",
        "text": "https://archive.orkl.eu/ea22e3f492cd406c7c051abbebfc8d2af37dc623.txt",
        "img": "https://archive.orkl.eu/ea22e3f492cd406c7c051abbebfc8d2af37dc623.jpg"
    }
}