{
    "id": "2ad28eb7-8936-4104-9eba-fbeb6d1b1a4d",
    "created_at": "2023-01-12T15:08:56.786624Z",
    "updated_at": "2025-03-27T02:06:11.711704Z",
    "deleted_at": null,
    "sha1_hash": "ac76257730fa4025a844db10733067b861d1de0e",
    "title": "2022-01-02 - -Cracking Open the Malware Piñata- Series- Intro to Dynamic Analysis with RedLineStealer",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:58Z",
    "file_modification_date": "2022-06-01T12:23:58Z",
    "file_size": 1908411,
    "plain_text": "# \"Cracking Open the Malware Piñata\" Series: Intro to Dynamic Analysis with RedLineStealer\n\n**[atomicmatryoshka.com/post/cracking-open-the-malware-piñata-series-intro-to-dynamic-analysis-with-redlinestealer](https://www.atomicmatryoshka.com/post/cracking-open-the-malware-pi%C3%B1ata-series-intro-to-dynamic-analysis-with-redlinestealer)**\n\nz3r0day_504 January 2, 2022\n\nz3r0day_504\n\nJan 2\n\n6 min read\n\nDynamic analysis involves running a binary and observing its behavior in a controlled environment. This\ncan be of significant benefit because some capabilities of malware come to life only at runtime, meaning\nthat the indicators and behaviors would not be observed if only analyzed statically.\n\nIn this iteration of my latest series, we dive into RedLineStealer. At the time of writing this blog post,\nMalwareBazaar shows RedLineStealer as the second most prevalent malware family in the last 14 days.\nThe variant we're analyzing is relatively noisy, as you'll see in the content below.\n\nIf you're interested in viewing my previous posts in this series, please check them out here:\n\n[\"Cracking Open the Malware Piñata\" Series: Analysis Environment Setup](https://www.blogger.com/#)\n\n[\"Cracking Open the Malware Piñata\" Series: Intro to Static Analysis with Kazy Trojan](https://www.blogger.com/#)\n\nAdditionally, if you'd like to get right to the counter-hacking, scroll down to the \"Pushing the Big Red\nButton\" headling. :)\n\n\n-----\n\n## BEFORE THE BOOM\n\nPrior to double-clicking on that badness-laden executable, there are a couple of things that need to be\ndone to prepare the environment.\n\n### Network Configuration\n\nFirst and foremost, we need to check the networking between virtual machines. Verify that the network\nadapters are set to host only. From there, go into REMnux and identify its IP.\n\nMaking note of it, we return to the Windows VM and take the following steps:\n\n1. Access the network adapter settings in Windows\n\n2. Change the Windows IP to be on the same subnet as the REMnux IP\n\n3. Input the REMnux IP as the default gateway and preferred DNS server in the Windows settings\n\n4. Close all dialog boxes\n\n5. Ping the REMnux VM from the Windows VM to make sure the connection is functional\n\nThis ensures that any time the Windows VM attempts to establish a network connection, the connection\nwill be routed to the REMnux VM. This will be useful when it comes time to observing what the malware\ncalls out to when detonating.\n\n### Registry Snapshot\n\nNext, let's grab a snapshot of the registry. RegShot is a tool originally developed in 1999 by TiANWEi but\ncontributed to by Maddes, XhmikosR, tulipfan, and Belogorokhov Youri amongst a large cohort of others\nover the course of two decades. The RegShot utility enables to user to grab \"snapshots\" of the registry\nprior to and after a specific event. The utility also has a \"compare\" feature, which highlights the\ndifferences between the \"before\" and \"after\" shots.\n\n\n-----\n\nTo grab our \"before\" shot, it's as simple as:\n\n1. Double-click on the RegShot executable\n\n2. Click on \"1st Shot,\" then \"Shot and Save\"\n\n3. Once complete, name your file and where to save it\n\n### VM Snapshot\n\nAfter completing the registry baseline, it's a good time to take a snapshot of the VM. This will allow you to\nrevert the Windows VM to this state after detonating the malware. I recommend taking the VM snapshot\nafter taking the initial registry snapshot to avoid having to repeat the process again.\n\nTo take a VM snapshot in VMWare:\n\n1. Go to the toolbar at the top of the window and click on \"VM\"\n\n2. Hover over \"Snapshot\"\n\n3. Click \"Take Snapshot...\"\n\n4. Name it something intuitive and click \"Take Snapshot\"\n\n## PREPARE THE WATCH\n\nThe environment is now configured and baselines have been captured. At this stage, we start spinning\nup the tools that will actively be running when the malware is executed. It's important to have these tools\nactive prior to initiating detonation so that we capture all events that take place.\n\n### Process Hacker\n\nProcess Hacker is one of the first tools I spin up at this point. Developed by Wen Jia Liu with help from\nXhimkosR and a plethora of additional contributors, it is a \"task manager on steroids.\" The GUI is\nintuitive with highlighting showing which processes are spawning and terminating, modifiable columns,\nand additional details visible with just the hover of a mouse.\n\n\n-----\n\n### Fiddler Classic\n\nFiddler allows you to observe and inspect HTTP/S network requests. Developed by Telerik, this tool is\none of the several tools available to observe the networking capabilities of the malware once detonated.\n\n### FakeDNS\n\nPossible overkill, but I normally have this and Fiddler running concurrently. FakeDNS is a command-line\ntool available on REMnux and developed by Verisign's iDefense group. It captures all DNS requests sent\nto the device its running on and lists them in the terminal in real-time.\n\n\n-----\n\n### WireShark\n\nWhile I won't be using it in this specific scenario, Wireshark is an incredibly useful packet capture tool.\nPacket inspection is a very useful technique, especially when characterizing communications between a\npiece of malware and the infrastructure it's \"calling out\" to. Dissecting this information can better help\npaint the picture of what information the malware is sending or receiving.\n\n### Process Monitor\n\nDeveloped by Mark Russinovich as part of Windows Sysinternals, Process Monitor captures file,\nprocess, registry, and networking events all in real-time. In dynamic analysis, this is magnificent in that in\ncatches a lot of artifacts that may no longer be present by the time an analyst goes digging for evidence.\nIt is also very effective at painting a timeline of events.\n\n\n-----\n\n## PUSHING THE BIG RED BUTTON\n\nNow we're locked and loaded to let the badness run rampant. Here we'll start our analysis of RedLine\nStealer with a sample I've pulled from MalwareBazaar. If you're not familiar, you can check them out\n[here. IOCs identified through this process will be summarized at the bottom of the post.](https://www.blogger.com/#)\n\nRight out of the gate, here's the evolution of Process Hacker after initial execution:\n\n\n-----\n\nsetup_x86_x64_install.exe spawns setup_installer.exe, which in turn spawns several instances of\nSat19d470e8e0597fc47.exe. Process Hacker allows you to take a look at the memory strings during\nruntime. This can be done by right-clicking on the process of interest, clicking \"Properties,\" navigating to\nthe \"Memory\" tab, and clicking on \"Strings...\" Below are screenshots of what this looked like for\nSat19d470e8e0597fc47.exe.\n\n\n-----\n\nWe see references to \"tempuri[.]org\" as well as references to \"TryInitNordVPN\" and \"TryInitOpenVPN.\"\nBased on cursory research, the last two references don't appear to be existing open-source\nlibraries/APIs, so these could've been developed by the malware author.\n\nTaking a look over in fakeDNS, we have quite a few attempts to contact domains, aside from general\nWindows noise:\n\nOver the course of time, the malware consistently attempted to call out to hhieuw33[.]com. We were able\nto take a closer look at that communication in Fiddler:\n\n\n-----\n\nIn the URL, the malware is attempting to pass some information in the parameters named \"sid\" and\n\"key.\" Additionally, the content of the POST request is encoded in multiple layers, with the outermost\nlayer being base64.\n\nMoving to the RegShot comparison, output:\n\n\n-----\n\nRegShot does an awesome job tracking everything related to the registry, and even goes as far as\ntracking file and folder events. We can see several that stand out in relation to the activity we've already\nseen, such as the keys which contain the malware executable names.\n\nIn a similar but more robust \"all encompassing\" ability, Process Monitor grabs a plethora of data as well:\n\n\n-----\n\nUsing some of the pre-built filters located on the toolbar makes it easier to parse through some of the\ndata. This information could be further whittled down if necessary, but during the initial glance I prefer to\nkeep as much digestible information as necessary. Process Monitor has a \"process tree\" feature,\npictured below:\n\n\n-----\n\nIn this image, it can be observed that the processes associated with the malware spawn cmd.exe, which\nthen spawns powershell.exe. There's an event in the Process Monitor data showing PowerShell with a\n\"Process Start\" operation after spawning from cmd.exe. This caught my interest because it was a unique\noperation in comparison with the bulk of PowerShell events. Further analysis resulted in catching this:\n\nFor those unfamiliar, Set-MpPreference is a PowerShell cmdlet associated with Windows Defender\nscans. The malware authors developed the specimen such that it would leverage PowerShell to disable\nDefender monitoring on the directory where the malware resides. In layman's terms, they're using\nPowerShell to tell Defender \"nothing to see here\" when it comes to the folder where all of the badness is.\nThis is what could be considered an evasive maneuver.\n\nA useful tool related to Process Monitor is ProcDOT. Developed by Christian Wojner, it provides\ncorrelation and visualization of Process Monitor and PCAP data. If there's a ton of data, the visual can\nseem convoluted from a zoomed out view, but it helps in showing how processes, file writes, and other\nevents are related.\n\n\n-----\n\nWithout being able to connect back to its \"mothership,\" the malware doesn't do much more than what's\nalready been displayed. In order to further analyze a specimen of this nature, being reliant on a network\nconnection, it would be useful to utilize dispensable hardware, a public network, and a VPN solution, with\nthe intent being to do a full system restoration after detonation. This method is labor intensive and risky\nand not recommended for folks with minimal experience.\n\n## SO...WHAT IS REDLINESTEALER?\n\nRedLineStealer is a credential stealer that targets web browsers. Access to the tool is available on the\nforums for several hundred dollars. The website HaveIBeenPwned recently added almost half a million\n[entries related to RedLineStealer credential theft. Check it out here if you have concerns regarding your](https://www.blogger.com/#)\ncreds and whether or not they've been compromised in a malicious campaign.\n\n## Indicators of Compromise (IOCs) for RedLineStealer\n\n**File name: setup_x86_x64_install.exe**\n\n**File hash: a12d74b1756d49531e21f755fef2049ab6c83626f0834cb945c781c39d40a177**\n\n**File name: Sat19d470e8e0597fc47.exe (or similarly named matching the same alphanumeric pattern)**\n\n**File path: C:\\Users\\User\\AppData\\Local\\Temp\\7zS4441B019\\Sat19d470e8e0597fc47.exe**\n\n**File hash: BC118B7708D56B93707A9BB025D3BF62D723B7932435A08299F59249C1C37DBE**\n\n**File name: @.cmd**\n\n**File path: C:\\Users\\User\\AppData\\Local\\Temp\\IXP000.TMP\\@.cmd**\n\n**File hash: 286227287F1FA79D5D5D909C2F457FC4D0AEFA6BE9E940F9A1F214D113FF88B4**\n\n**File name: Sat195518974c.exe**\n\n**File path: C:\\Users\\User\\AppData\\Local\\Temp\\7zS0437FC5D\\Sat195518974c exe**\n\n\n-----\n\n**File hash: 13357A53F4C23BD8AC44790AA1DB3233614C981DED62949559F63E841354276A**\n\n**File name: IXP000.TMP**\n\n**File path: C:\\Users\\User\\AppData\\Local\\Temp\\IXP000.TMP**\n\n**Directory: C:\\Program Files (x86)\\FarLabUninstaller\\***\n\n**Domains associated:**\n\nwww.hhiuew33[.]com\n\ngp.gamebuy768[.]com\n\none-mature-tube[.]com\n\ncloudjah[.]com\n\nkelenxz[.]xyz\n\nad-postback[.]biz\n\n**IPs associated:**\n\n212.193.30[.]45\n\n159.69.246[.]184\n\n**Registry keys:**\n\nHKLM\\SOFTWARE\\Microsoft\\Tracing\\Sat194d446031aec9ca_RASAPI32\nHKLM\\SOFTWARE\\Microsoft\\Tracing\\Sat194d446031aec9ca_RASMANCS\nHKLM\\SOFTWARE\\Microsoft\\Tracing\\Sat19f1c04426464e86_RASAPI32\nHKLM\\SOFTWARE\\Microsoft\\Tracing\\Sat19f1c04426464e86_RASMANCS\n\nHKLM\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\FarLabUninstaller.exe_is1\n\n## TOOLS AND REFERENCES\n\n[Process Monitor](https://www.blogger.com/#)\n\n[ProcDOT](https://www.blogger.com/#)\n\n[WireShark](https://www.blogger.com/#)\n\n[Fiddler](https://www.blogger.com/#)\n\n[Process Hacker](https://www.blogger.com/#)\n\n[FakeDNS](https://www.blogger.com/#)\n\n[RegShot](https://www.blogger.com/#)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-02 - -Cracking Open the Malware Piñata- Series- Intro to Dynamic Analysis with RedLineStealer.pdf"
    ],
    "report_names": [
        "2022-01-02 - -Cracking Open the Malware Piñata- Series- Intro to Dynamic Analysis with RedLineStealer.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536136,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1654086238,
    "ts_modification_date": 1654086238,
    "files": {
        "pdf": "https://archive.orkl.eu/ac76257730fa4025a844db10733067b861d1de0e.pdf",
        "text": "https://archive.orkl.eu/ac76257730fa4025a844db10733067b861d1de0e.txt",
        "img": "https://archive.orkl.eu/ac76257730fa4025a844db10733067b861d1de0e.jpg"
    }
}