{
    "id": "2ad22ee8-0264-48b6-b444-6005210da09d",
    "created_at": "2023-02-02T02:07:38.532082Z",
    "updated_at": "2025-03-27T02:05:22.288804Z",
    "deleted_at": null,
    "sha1_hash": "7fc56c13e1bae4c83dd421d309c735d5c2e2d634",
    "title": "2023-01-03 - BitRAT Now Sharing Sensitive Bank Data as a Lure",
    "authors": "",
    "file_creation_date": "2023-02-01T07:40:50Z",
    "file_modification_date": "2023-02-01T07:40:50Z",
    "file_size": 780394,
    "plain_text": "# BitRAT Now Sharing Sensitive Bank Data as a Lure\n\n**[blog.qualys.com/vulnerabilities-threat-research/2023/01/03/bitrat-now-sharing-sensitive-bank-data-as-a-lure](https://blog.qualys.com/vulnerabilities-threat-research/2023/01/03/bitrat-now-sharing-sensitive-bank-data-as-a-lure)**\n\nAkshat Pradhan January 3, 2023\n\n## Introduction\n\n[In June of 2022 Qualys Threat Research Unit (TRU) wrote an in-depth report on Redline, a](https://blog.qualys.com/vulnerabilities-threat-research/2022/11/10/qsc-2022-qualys-threat-research-unit-tru-our-shield-is-your-shield)\ncommercial off the shelf infostealer that spreads via fake cracked software hosted on\nDiscord’s content delivery network. Since then, we have continued to track similar threats to\nidentify their evolving capabilities. In this blog, we will highlight our findings on another\ncommercial off the shelf malware – BitRAT.\n\nBitRAT is a fairly recent, notorious remote access trojan (RAT) marketed on underground\ncybercriminal web markets and forums since Feb 2021. The RAT is particularly well known\nfor its social media presence and functionality such as:\n\n1. Data exfiltration\n2. Execution of payloads with bypasses.\n3. DDoS\n4. Keylogging\n5. Webcam and microphone recording\n6. Credential theft\n7. Monero mining\n8. Running tasks for process, file, software, etc.\n\nThese features along with its relatively low cost of 20$ make BitRAT a pervasive threat.\n\n## Breach details\n\nWhile investigating multiple lures for BitRAT we identified that, an adversary had hijacked a\nColumbian cooperative bank’s infrastructure. Moreover, the lures themselves contain\nsensitive data from the bank to make them appear legitimate. This means that the attacker\nhas gotten access to customers’ data. While digging deeper into the infrastructure we\nidentified logs that point to the usage of the tool sqlmap to find potential SQLi faults, along\nwith actual database dumps. Overall, 4,18,777 rows of sensitive data have been leaked of\n[customers with details such as Cedula numbers (Columbian national ID), email addresses,](https://www.cancilleria.gov.co/tramites_servicios/tramites_exterior/cedula_ciudadania)\nphone numbers, customer names, payment records, salary, address etc. As of today, we\nhave not found this information shared on any of our darkweb/clearweb monitored lists.\n\nWe are following standard breach disclosure guidelines with the identified victims and will\nupdate this article with additional data as things progress.\n\n\n-----\n\nThe data from the tables was reused in Excel maldocs as well as part of the database\ndump.\n\nFig.1 Excel Maldocs\nThese Excel sheets act as lures for BitRAT. All of them are authored by “Administrator”.\n\n## Sample Analysis \n\nThe excel contains a highly obfuscated macro that will drop an inf payload and execute it.\nThe .inf payload is segmented into hundreds of arrays in the macro. The de-obfuscation\nroutine performs arithmetic operations on these arrays to rebuild the payload. The macro\nthen writes the payload to temp and executes it via advpack.dll.\n\nFig.2 Macro content\nThe .inf file contains a hex encoded second stage dll payload which is decoded via certutil,\nwritten to %temp%\\ and executed by rundll32. The temp files are then deleted.\n\n\n-----\n\nFig.3 inf payload\nThis dll uses various anti-debugging techniques to download and execute the final BitRAT\npayload. It uses the WinHTTP library to download BitRAT embedded payloads from GitHub\nto the %temp% directory.\n\nFig.4 Writing BitRAT from GitHub.\nThe dll then uses WinExec to start the %temp% payload and exits. The GitHub repository\nwas created in mid-November and the account is a throwaway created just to host multiple\npayloads.\n\n\n-----\n\nFig.5 Adversary GitHub profile\n\nFig.6 Adversary GitHub repository\nEach of these files are BitRAT loader samples obfuscated via DeepSea. The BitRAT sample\nis embedded into the loaders and is obfuscated via SmartAssembly. The loader decodes the\nbinary and reflectively loads them.\n\nFig.7 BitRAT obfuscation\nThey also contain hijacked resources from two different companies to appear legitimate.\n\n\n-----\n\nFig.8 Hijacked resources\nThe BitRAT sample starts and relocates the loader to user’s startup for persistence. It has\nthe following configuration:\n```\n\"Host\": \"<C2 IP>\",\n\n\"Port\": \"7722\",\n\n\"Tor Port\": \"0\",\n\n\"Install Dir\": \"0\",\n\n\"Install File\": \"0\",\n\n\"Communication Password\": \"c4ca4238a0b923820dcc509a6f75849b\",\n\n\"Tor Process Name\": \"tor\"\n\n\n```\nFig.9 BitRAT C2\n\n## Conclusion\n\n\n-----\n\nCommercial off the shelf. RATs have been evolving their methodology to spread and infect\ntheir victims. They have also increased the usage of legitimate infrastructures to host their\npayloads and defenders need to account for it. We at Qualys Threat Research Unit will\ncontinue to monitor and document such threats to understand their evolving TTPs.\n\n## Qualys solutions\n\nQualys provides a whole suite of solutions to help protect your environment against\nadvanced threats like BitRAT.\n\n[Qualys Multi-Vector Endpoint Detection and Response (EDR) is a dynamic detection and](https://www.qualys.com/apps/endpoint-detection-response/)\nresponse service powered by the Qualys Cloud Platform. Qualys Multi-Vector EDR detects\nmalware like BitRAT by unifying multiple context vectors to spot its insertion into a network\nendpoint. Qualys Cloud Platform provides asset management, vulnerability detection, policy\ncompliance, patch management, and file integrity monitoring capabilities – all delivered with\na single agent and cloud-based delivery for a lower total cost of ownership.\n\n[Qualys External Attack Surface Management (EASM) enables organizations to continuously](https://www.qualys.com/company/newsroom/news-releases/usa/qualys-launches-external-attack-surface-management-easm/)\nmonitor and reduce the entire enterprise attack surface including internal and internet-facing\nassets and discover previously unidentified exposures. It also helps synchronize with\nCMDBs, detect security gaps like unauthorized or end-of-support software, open ports,\nremotely exploitable vulnerabilities, digital certificate issues, unsanctioned apps and\ndomains, and mitigate risk by taking appropriate actions.\n\n## MITRE ATT&CK® Mapping\n\nT1071.001 Application Layer Protocol: Mail Protocols\n\nT1102 Web Service\n\nT1218.011 System Binary Proxy Execution: Rundll32\n\nT1218 System Binary Proxy Execution\n\nT1584 Compromise Infrastructure\n\nT1059.003 Command and Scripting Interpreter: Windows Command Shell\n\nT1140 Deobfuscate/Decode Files or Information\n\nT1204.002 User Execution: Malicious File\n\nT1547.001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-01-03 - BitRAT Now Sharing Sensitive Bank Data as a Lure.pdf"
    ],
    "report_names": [
        "2023-01-03 - BitRAT Now Sharing Sensitive Bank Data as a Lure.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1675303658,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1675237250,
    "ts_modification_date": 1675237250,
    "files": {
        "pdf": "https://archive.orkl.eu/7fc56c13e1bae4c83dd421d309c735d5c2e2d634.pdf",
        "text": "https://archive.orkl.eu/7fc56c13e1bae4c83dd421d309c735d5c2e2d634.txt",
        "img": "https://archive.orkl.eu/7fc56c13e1bae4c83dd421d309c735d5c2e2d634.jpg"
    }
}