{
    "id": "2b202925-5260-47e2-9cbb-ebe41200234b",
    "created_at": "2023-05-06T02:08:30.155942Z",
    "updated_at": "2025-03-27T02:10:10.669836Z",
    "deleted_at": null,
    "sha1_hash": "010ee45b424cf72374cf7c41e9f9de6b9c2ff4ae",
    "title": "2023-03-09 - BatLoader Continues to Abuse Google Search Ads to Deliver Vidar Stealer and Ursnif",
    "authors": "",
    "file_creation_date": "2023-05-05T02:06:07Z",
    "file_modification_date": "2023-05-05T02:06:07Z",
    "file_size": 3822021,
    "plain_text": "# BatLoader Continues to Abuse Google Search Ads to Deliver…\n\n**[esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif](https://www.esentire.com/blog/batloader-continues-to-abuse-google-search-ads-to-deliver-vidar-stealer-and-ursnif)**\n\nPartners\n\nPARTNER PROGRAM\n\ne3 Ecosystem\n\nWe provide sophisticated cybersecurity solutions for Managed Security Service Providers\n(MSSPs), Managed Service Providers (MSPs), and Value-Added Resellers (VARs). Find out\nwhy you should partner with eSentire, the Authority in Managed Detection and Response,\ntoday.\n\n[Learn more](https://www.esentire.com/partners)\n[Adversaries don’t work 9-5 and neither do we. At eSentire, our 24/7 SOCs are staffed with](https://www.esentire.com/what-we-do/security-operations-center)\nElite Threat Hunters and Cyber Analysts who hunt, investigate, contain and respond to\nthreats within minutes.\n\nWe have discovered some of the most dangerous threats and nation state attacks in our\nspace – including the Kaseya MSP breach and the more_eggs malware.\n\nOur Security Operations Centers are supported with Threat Intelligence, Tactical Threat\nResponse and Advanced Threat Analytics driven by our Threat Response Unit – the TRU\nteam.\n\nIn TRU Positives, eSentire’s Threat Response Unit (TRU) provides a summary of a recent\nthreat investigation. We outline how we responded to the confirmed threat and what\nrecommendations we have going forward.\n\n**Here’s the latest from our TRU Team…**\n\n## What did we find?\n\n[In December, we published\na summary of BatLoader activity whereby](https://www.esentire.com/blog/recent-batloader-activity-observed-in-december-2022) [Google Search Ads](https://www.esentire.com/blog/icedid-malware-shifts-its-delivery-strategy)\nwere used to impersonate software such as WinRAR to deliver malicious Windows Installer\nfiles. The installer files contained custom action commands which used PowerShell to\ndownload and execute payloads (Redline Stealer, Ursnif, etc.) hosted on legitimate websites.\n\nThroughout February 2023, TRU has observed a series of newly registered websites\nimpersonating various applications and brands. Included among these are:\n\n\n-----\n\nChatGPT (chatgpt-t[.]com)\nZoom (zoomvideor[.]com)\nSpotify (spotify-uss[.]com)\nTableau (tableau-r[.]com)\nAdobe (adobe-l[.]com)\n\nIn addition to comparable domain registration attributes, these websites tend to follow a\nsimilar naming convention where one or more characters are appended to the impersonated\nbrand name (e.g., adobe-l[.]com vs adobe.com). These sites were used to host imposter\ndownload pages and all likely stem from malicious advertisements on Google Search Ads. A\nmore complete list can be found at the end of this post.\n\nBatLoader continues to see changes and improvement since it first emerged in 2022. Recent\nsamples analyzed by TRU utilize Windows Installer files masquerading as the above\napplications to launch embedded Python scripts.\n\n## BatLoader's Python Loader\n\n[In mid-February 2023, eSentire MDR for\nEndpoint blocked an attempt to execute Ursnif via](https://www.esentire.com/how-we-do-it/signals/endpoint)\ncode injection on a\nmanufacturing customer’s endpoint. A subsequent investigation traced\nthe\ninfection to a Google search result for Adobe Reader by the victim user.\n\nThe user had clicked on a top-of-page ad on the search\nresults page where they were\ndirected via an intermediary website (adolbe[.]website) to adobe-e[.]com, a webpage\nmasquerading as Adobe Acrobat Reader (Figure 1). As a\nresult, the user unknowingly\ndownloaded and executed AdobeSetup.msi(9ebbe0a1b79e6f13bfca014f878ddeec),\nBatLoader’s Windows Installer file.\n\nFigure 1 adobe-e[.]com, Adobe Acrobat Reader lookalike webpage.\nLike previous versions of BatLoader, the MSI file contains\nCustom Actions to execute\ncommands. In this case, the command executed an\nembedded batch file (seen here as\nInstallPython.bat,\nalso observed as PythonFramework.bat) with admin\nprivileges in a hidden\n\n\n-----\n\nwindow.\n\nA decoy application was written to C:\\Program Files (x86)\\Chat\nMapper along with BatLoader\nscripts and supporting files (Figure 2).\n\nFigure 2 BatLoader Python scripts and supporting files.\nThe batch file (figure 3, insert) performs the following actions:\n\n1. Installs Python 3.9.9 using an included setup binary.\n2. Uses pip to install pywin32 and wmi packages.\n3. Unpacks the compressed OpenSSL library files using PowerShell into multiple\n\nlocations.\n4. Starts two Python files in sequence after a short timeout.\n\nFigure 3 Batch file execution via Windows Installer custom action.\n\n## BatLoader's Python Files\n\n\n-----\n\nIn this case, two Python files (framework.py and frameworkb.py) were included in the\npackage. These were protected using PyArmor and require unpacking with tools such as\n[PyArmor-Unpacker (Figure 4). The files use a script copied from a Stack Overflow question](https://github.com/Svenskithesource/PyArmor-Unpacker)\nas a template for executing Python code with elevated privileges.\n\nFigure 4 Decoded Python Loader “framework.py”\nBatLoader’s instruction set is inserted into the main function of the Stack Overflow Python\nscript. The code retrieves an encrypted payload as control.exe.enc then executes a series of\nWindows commands. The instructions executed by both Python files were nearly identical\nexcept for a change in the payload URL.\n\nThe commands shown in Figure 5 are summarized as follows:\n\n1. Download encrypted payload control.exe.enc from https://shvarcnegerhistory[.]com/\n\nThe payload is saved under %appdata% or %userprofile%.\n2. Modify Defender settings to exclude paths, processes, and file extensions.\n3. Decrypt control.exe.enc using the OpenSSL library installed by the previous batch file.\n\nThe password tor9232jds is used and the file is saved as control.exe.\n[4. WorkFolders.exe is called, leveraging a signed execution LOLBAS technique to](https://lolbas-project.github.io/lolbas/Binaries/WorkFolders/)\n\nexecute control.exe.\n\n\n-----\n\nFigure 5 Windows commands from “framework.py” and “frameworkb.py”, summarized\nIn the above-mentioned case, the payload intercepted by MDR for Endpoint was Ursnif\n(md5hash 0cb75b1192b23b8e03d955f1156ad19e), specifically isfb_v2.14+ variant\nconfigured to connect to the following C2 domains:\n\n_uelcoskdi[.]ru_\n_iujdhsndjfks[.]ru_\n_isoridkf[.]ru_\n_gameindikdowd[.]ru_\n_jhgfdlkjhaoiu[.]su_\n_reggy506[.]ru_\n_reggy914[.]ru_\n\n\n-----\n\nUrsnif s persistence was achieved using a registry run key (VirtualStop) under\n_HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run. This value_\nexecuted a shortcut (LineType.lnk) which in turn launches a PowerShell script\n(CharReturn.ps1), as seen in Figure 6.\n\nFigure 6 CharReturn.ps1\n_CharReturn.ps1 executed a staged\nPowerShell loader from registry at_\n_HKEY_USERS\\Software\\AppDataLow\\Software\\Microsoft\\[randomstring]. The loader_\ncontained\nthe embedded Ursnif binary which is injected into the Explorer process.\n\nIn this incident, MDR for Endpoint identified and blocked PowerShell\nexecution of the Ursnif\nloader stored in registry.\n\n## Other Batloader Observations\n\nObserved URL structures would suggest multiple payloads are available for download:\n\n_/t1s1j1/index/c1/?servername=msi_\n_/t1s1j1/index/c2/?servername=msi_\n_/t1s1j1/index/c3/?servername=msi_\n_/t1s1j1/index/c4/?servername=msi_\n_/t1s1j1/index/b1/?servername=msi_\n\nBatLoader has historically been linked to payloads such as Redline Stealer, SystemBC RAT,\nSyncro RMM, Vidar Stealer, Ursnif and Cobalt Strike. Analysis of more recent samples in\nMarch 2023 has yielded both Vidar Stealer and Ursnif trojans.\n\nTRU has reviewed samples from public malware repositories which exhibited slightly\n[different behavior than what was seen in the February incident described above. This sample](https://www.virustotal.com/gui/file/eb3e65106ee1d8f7c58e2d4c2a1f86a3c6a431a3b2d8500b9c1ed9c67defc62b/detection)\nfrom mid-February contained a third Python file named ‘networkframework.py’:\n\n\n-----\n\nFigure 7 BatLoader's batch file containing a third Python file \"networkframework.py\"\nLike the others, it is obfuscated with PyArmor and contains an identical series of commands\nto handle payload retrieval, decryption and execution via WorkFolder.exe. In addition,\nnetframework.py contains checks for curating payloads for domain-joined systems with more\nthan 2 IP neighbors in the system’s ARP table.\n\nFigure 8 Snippet of BatLoader Python script showing system profiling.\nThis behavior has been previously observed whereby BatLoader executed Cobalt Strike in\naddition to the standard payloads such as Ursnif or Vidar. We assess this is done to prep\nsystems residing in business networks for further infiltration.\n\nAs of time of writing, the payload URLs were no longer available for retrieval, but given that\nthis fits into BatLoader’s known historical target selection patterns, we assess that Cobalt\nStrike is the probable candidate.\n\n## How did we find it?\n\neSentire [MDR for Endpoint\nidentified and blocked BatLoader’s payload execution.](https://www.esentire.com/how-we-do-it/signals/endpoint)\n\n\n-----\n\n## What did we do?\n\nOur team of [24/7 SOC Cyber Analysts investigated the blocked behavior and worked](https://www.esentire.com/what-we-do/security-operations-center)\nwith the customer on remediating the system.\n\n## What can you learn from this TRU positive?\n\nUse of Google Search Ads by various malware families has been widely observed in\n[early 2023. We wrote about this tactic in a previous TRU Positive post.](https://www.esentire.com/blog/icedid-malware-shifts-its-delivery-strategy)\n\nDespite overall observations diminishing in February 2023, BatLoader’s use\ncontinues to persist. This assertion is supported by observations in our own\ntelemetry but also by the continued registration of website infrastructure\nthroughout the month of February.\nBatLoader targets various popular applications for impersonation, such as ChatGPT,\nZoom, Adobe, AnyDesk, Microsoft Teams, Java, etc. This is no accident, as these\napplications are commonly found in business networks and thus, they would yield more\nvaluable footholds for monetization via fraud or hands-on-keyboard intrusions.\nCobalt Strike, a known BatLoader payload, enables hands-on-keyboard access to\nfootholds and facilitates network intrusion actions. BatLoader should be considered a\nprecursor threat to ransomware and any observation prioritized for treatment.\n\nA [November 2022 report by Microsoft linked Royal Ransomware to BatLoader.](https://www.microsoft.com/en-us/security/blog/2022/11/17/dev-0569-finds-new-ways-to-deliver-royal-ransomware-various-payloads/)\n\n## Recommendations from our Threat Response Unit (TRU) Team:\n\nRaise awareness of malware masquerading as legitimate applications, and include\n[relevant examples within your Phishing and Security Awareness Training (PSAT)](https://www.esentire.com/what-we-do/managed-vulnerability-and-risk/technical-testing/security-awareness-training-managed-phishing-training)\nprogram to educate your employees on how to protect themselves against similar\ncyber threats.\n\nRemember – an effective PSAT program emphasizes building cyber resilience by\nincreasing risk awareness, rather than trying to turn everyone into security\nexperts.\nProtect endpoints against malware.\n\nEnsure antivirus signatures are up-to-date.\nUse a Next-Gen AV (NGAV) or [Endpoint Detection and Response (EDR) product](https://www.esentire.com/how-we-do-it/signals/endpoint)\nto detect and contain threats.\n\n## Indicators of Compromise\n\nSuspected BatLoader Domains Registered in February 2023:\n\n**Domain** **Creation Date**\n\nchatgpt-t[.]com 2023-02-28\n\n|Domain|Creation Date|\n|---|---|\n\n\n-----\n\n|zoomvideor[.]com|2023-02-27|\n|---|---|\n|adobe-l[.]com|2023-02-22|\n|freecad-l[.]com|2023-02-22|\n|microso-t[.]com|2023-02-22|\n|spotify-uss[.]com|2023-02-21|\n|quickbooks-q[.]com|2023-02-21|\n|freecad-f[.]com2|2023-02-20|\n|java-s[.]com|2023-02-13|\n|adobe-e[.]com|2023-02-13|\n|anydesk-o[.]com|2023-02-13|\n|anydesk-r[.]com|2023-02-09|\n|java-r[.]com|2023-02-09|\n|tableau-r[.]com|2023-02-09|\n|java-a[.]com|2023-02-07|\n|basecamp-a[.]com|2023-02-07|\n|adobe-a[.]com|2023-02-03|\n|visualstudio-t[.]com|2023-02-03|\n|openoffice-a[.]com|2023-02-03|\n|bitwarden-t[.]com|2023-02-01|\n|gimp-t[.]com|2023-02-01|\n|figma-t[.]com6|2023-02-01|\n\n\n## Other Indicators of Compromise\n\n|Indicator|Note|\n|---|---|\n|3db1edc5b5550f54abdcb5520cf91d75|Vidar|\n|0cb75b1192b23b8e03d955f1156ad19e|Ursnif|\n\n\n-----\n\n|85fbc743bb686688ce05cf3289507bf7|Ursnif|\n|---|---|\n|11ae3dabdb2d2458da43558f36114acb|AdobeSetup.msi (BatLoader)|\n|9ebbe0a1b79e6f13bfca014f878ddeec|AdobeSetup.msi (BatLoader)|\n|shvarcnegerhistory[.]com|BatLoader C2|\n|Pixelarmada[.]su|BatLoader C2|\n|uelcoskdi[.]ru|Ursnif C2|\n|iujdhsndjfks[.]ru||\n|isoridkf[.]ru||\n|gameindikdowd[.]ru||\n|jhgfdlkjhaoiu[.]su||\n|reggy506[.]ru||\n|reggy914[.]ru||\n\n\neSentire’s Threat Response Unit (TRU) is a world-class team of threat researchers who\ndevelop new detections enriched by original threat intelligence and leverage new machine\nlearning models that correlate multi-signal data and automate rapid response to advanced\nthreats.\n\nIf you are not currently engaged with an MDR provider, eSentire MDR can help you reclaim\nthe advantage and put your business ahead of disruption.\n\nLearn what it means to have an elite team of Threat Hunters and Researchers that works for\nyou. [Connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\n\n-----\n\neSentire Threat Response Unit (TRU)\n\nOur industry-renowned Threat Response Unit (TRU) is an elite team of threat hunters and\nresearchers, that supports our 24/7 Security Operations Centers (SOCs), builds detection\nmodels across our Atlas XDR Cloud Platform, and works as an extension of your security\nteam to continuously improve our Managed Detection and Response service. TRU has been\nrecognized for its threat hunting, original research and content development capabilities.\nTRU is strategically organized into cross-functional groups to protect you against advanced\nand emerging threats, allowing your organization to gain leading threat intelligence and\nincredible cybersecurity acumen.\n\n\n-----\n\nCookies allow us to deliver the best possible experience for you on our website - by\ncontinuing to use our website or by closing this box, you are consenting to our use of\n[cookies. Visit our Privacy Policy to learn more.](https://www.esentire.com/legal/privacy-policy)\n\nAccept\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-09 - BatLoader Continues to Abuse Google Search Ads to Deliver Vidar Stealer and Ursnif.pdf"
    ],
    "report_names": [
        "2023-03-09 - BatLoader Continues to Abuse Google Search Ads to Deliver Vidar Stealer and Ursnif.pdf"
    ],
    "threat_actors": [
        {
            "id": "cf4d333d-ef79-40aa-b233-886e6de875a3",
            "created_at": "2023-12-08T02:00:05.754609Z",
            "updated_at": "2025-03-27T02:00:03.266797Z",
            "deleted_at": null,
            "main_name": "DEV-0569",
            "aliases": [
                "Storm-0569"
            ],
            "source_name": "MISPGALAXY:DEV-0569",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338910,
    "ts_updated_at": 1743041410,
    "ts_creation_date": 1683252367,
    "ts_modification_date": 1683252367,
    "files": {
        "pdf": "https://archive.orkl.eu/010ee45b424cf72374cf7c41e9f9de6b9c2ff4ae.pdf",
        "text": "https://archive.orkl.eu/010ee45b424cf72374cf7c41e9f9de6b9c2ff4ae.txt",
        "img": "https://archive.orkl.eu/010ee45b424cf72374cf7c41e9f9de6b9c2ff4ae.jpg"
    }
}