{
    "id": "2b8c59df-aeef-4e35-b60d-dae9aaf90670",
    "created_at": "2023-01-12T15:00:07.231196Z",
    "updated_at": "2025-03-27T02:05:59.10042Z",
    "deleted_at": null,
    "sha1_hash": "f9c83d5e7b97b432637796ec4138e7d73bf50de9",
    "title": "2022-01-20 - Treasury Sanctions Russian-Backed Actors Responsible for Destabilization Activities in Ukraine (Taras Kozak, Oleh Voloshyn, Volodymyr Oliynyk, Vladimir Sivkovich)",
    "authors": "",
    "file_creation_date": "2022-05-28T23:51:03Z",
    "file_modification_date": "2022-05-28T23:51:03Z",
    "file_size": 299817,
    "plain_text": "# Treasury Sanctions Russian-Backed Actors Responsible for Destabilization Activities in Ukraine\n\n**home.treasury.gov/news/press-releases/jy0562**\n\nJanuary 20, 2022\n\nWASHINGTON – Today, the Department of the Treasury’s Office of Foreign Assets Control\n(OFAC) sanctioned four individuals engaged in Russian government-directed influence\nactivities to destabilize Ukraine. This is the latest action we have taken to target purveyors of\n[Russian disinformation, including designations in April 2021.](https://home.treasury.gov/news/press-releases/jy0126)\n\nToday’s action is intended to target, undermine, and expose Russia’s ongoing destabilization\neffort in Ukraine. This action is separate and distinct from the broad range of high impact\nmeasures the United States and its Allies and partners are prepared to impose in order to\ninflict significant costs on the Russian economy and financial system if it were to further\ninvade Ukraine.\n\nThe individuals designated today act at the direction of the Russian Federal Security Service\n(FSB), an intelligence service sanctioned by the United States, and support Russia-directed\ninfluence operations against the United States and its allies and partners. The four\nindividuals have played various roles in Russia’s global influence campaign to destabilize\nsovereign countries in support of the Kremlin’s political objectives. The United States will\ncontinue to take steps, through actions like this one, and in partnership with the Ukrainian\ngovernment, to identify, expose, and undercut Russia’s destabilization efforts.\n\n\n-----\n\nThe United States is taking action to expose and counter Russia s dangerous and\nthreatening campaign of influence and disinformation in Ukraine,” said Deputy Secretary of\nthe Treasury Wally Adeyemo. “We are committed to taking steps to hold Russia accountable\nfor their destabilizing actions.”\n\nRussian intelligence services, including the FSB, recruit Ukrainian citizens in key positions to\ngain access to sensitive information, threaten the sovereignty of Ukraine, and then leverage\nthese Ukrainian officials to create instability in advance of a potential Russian invasion. The\nUnited States has worked closely with the Government of Ukraine to identify and expose\nthese actors to thwart Russia’s influence operations.\n\nIn 2020, Kremlin officials launched a comprehensive information operation plan designed in\npart to degrade the ability of the Ukrainian state to function independently and without\nRussian interference. This included identifying and co-opting pro-Russian individuals in\nUkraine and undermining prominent Ukrainians viewed as pro-Western, who would stand in\nthe way of Russian efforts to bring Ukraine within its control. Goals of the plan included\ndestabilizing the political situation in Ukraine and laying the groundwork for creating a new,\nRussian-controlled government in Ukraine.\n\nRussia’s influence campaigns are not only focused on Ukraine. For over a decade, Russia\nhas employed disinformation outlets and intelligence service affiliates to spread false\nnarratives in support of its strategic goals. Since at least 2016, Russian agents have even\nsought to influence U.S. elections by spreading disinformation, sowing discord among U.S.\naudiences, and falsely denigrating U.S. politicians and political parties.\n\n## FSB PAWNS IN UKRAINE CONTINUE DESTABILIZATION ACTIVITIES\n\nRussia has directed its intelligence services to recruit current and former Ukrainian\ngovernment officials to prepare to take over the government of Ukraine and to control\nUkraine’s critical infrastructure with an occupying Russian force. At the heart of this effort are\n**Taras Kozak (Kozak) and Oleh Voloshyn (Voloshyn), two current Ukrainian Members of**\nParliament from the party led by Victor Medvedchuk (Medvedchuk), who is already subject to\nU.S. sanctions for his role in undermining Ukrainian sovereignty in 2014. Medvedchuk\nmaintains close ties with the Kremlin, and also took part in directing these activities.\n\nKozak, who controls several news channels in Ukraine, supported the FSB’s plan to\ndenigrate senior members of Ukrainian President Volodymyr Zelenskyy’s inner circle, falsely\naccusing them of mismanagement of the COVID-19 pandemic. Furthermore, Kozak used his\nnews platforms to amplify false narratives around the 2020 U.S. elections first espoused by\nU.S.-designated Andrii Leonidovych Derkach (Derkach). Kozak has attempted to legitimatize\nDerkach’s claims by rebroadcasting Derkach’s false assertions about U.S. political\ncandidates. Throughout 2020, Kozak worked alongside FSB intelligence agents.\n\n\n-----\n\nVoloshyn has worked with Russian actors to undermine Ukrainian government officials and\nadvocate on behalf of Russia. Voloshyn also worked with U.S.-designated Konstantin\nKilimnik, a Russian national with ties to Russian intelligence who was sanctioned for\nattempts to influence the U.S. 2020 presidential election, to coordinate passing on\ninformation to influence U.S. elections at the behest of Russia.\n\nKozak is being designated pursuant to Executive Order (E.O.) 14024 for being responsible\nfor or complicit in, or for having directly or indirectly engaged or attempted to engage in,\ninterference in a United States or other foreign government election, for or on behalf of, or for\nthe benefit of, directly or indirectly, the Government of the Russian Federation.\n\nVoloshyn is being designated pursuant to E.O. 14024 for having acted or purported to act for\nor on behalf of, directly or indirectly, the Government of the Russian Federation.\n\n## FSB-CONNECTED FORMER UKRAINIAN OFFICIALS SUPPORTING RUSSIA\n\n**Volodymyr Oliynyk (Oliynyk) is a former Ukrainian official who fled Ukraine to seek refuge**\nin Russia. Oliynyk has a history of supporting Russia, currently resides in Moscow, Russia,\nand shares Russia’s anti-Western sentiments. In 2021, Oliynyk worked at the direction of the\nFSB to gather information about Ukrainian critical infrastructure.\n\nAs in previous Russian incursions into Ukraine, repeated cyber operations against Ukraine’s\ncritical infrastructure are part of Russia’s hybrid tactics to threaten Ukraine. The overall\nstrategy is designed to pull Ukraine into Russia’s orbit by thwarting Ukraine’s efforts at\nWestern integration, especially with the European Union (EU) and North Atlantic Treaty\nOrganization (NATO). As Russia has pursued broad cyber operations against critical\ninfrastructure, it has focused on disrupting one critical infrastructure sector in particular:\nUkraine’s energy sector. Russia has also degraded Ukraine’s access to energy products in\nthe middle of winter. Acting through Russia’s state-owned gas company Gazprom, Russia\nhas repeatedly disrupted supplies to Ukraine—a vital transshipment country with pipelines to\nother European countries—due to purported disputes over gas pricing.\n\nOliynyk is being designated pursuant to E.O. 14024 for having acted or purported to act for\nor on behalf of, directly or indirectly, the Government of the Russian Federation.\n\n**Vladimir Sivkovich (Sivkovich) is the former Deputy Secretary of the Ukrainian National**\nSecurity and Defense Council. In 2021, Sivkovich worked with a network of Russian\nintelligence actors to carry out influence operations that attempted to build support for\nUkraine to officially cede Crimea to Russia in exchange for a drawdown of Russian-backed\nforces in the Donbas, where separatists continue to receive support from Russia. In early\n2020, Sivkovich coordinated with Russian intelligence services to promote Derkach’s\ndisinformation campaign against the U.S. 2020 presidential election. Sivkovich, who has ties\nto the FSB, also supported an influence operation targeting the United States from 2019 to\n2020.\n\n\n-----\n\nSivkovich is being designated pursuant to E.O. 14024 for having acted or purported to act for\nor on behalf of, directly or indirectly, the Government of the Russian Federation.\n\n## SANCTIONS IMPLICATIONS\n\nAs a result of today’s action, all property and interests in property of the designated persons\ndescribed above that are in the United States or in the possession or control of U.S. persons\nare blocked and must be reported to OFAC. In addition, any entities that are owned, directly\nor indirectly, 50 percent or more by one or more blocked persons are also blocked. Unless\nauthorized by a general or specific license issued by OFAC, or exempt, OFAC’s regulations\ngenerally prohibit all transactions by U.S. persons or within (or transiting) the United States\nthat involve any property or interests in property of designated or otherwise blocked persons.\nThe prohibitions include the making of any contribution or provision of funds, goods, or\nservices by, to, or for the benefit of any blocked person, or the receipt of any contribution or\nprovision of funds, goods, or services from any such person.\n\n[Click here for more information on the individuals designated today.](https://home.treasury.gov/policy-issues/financial-sanctions/recent-actions/20220120)\n\n###\n\nUse featured image\n\nOff\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-20 - Treasury Sanctions Russian-Backed Actors Responsible for Destabilization Activities in Ukraine (Taras Kozak, Oleh Voloshyn, Volodymyr Oliynyk, Vladimir Sivkovich).pdf"
    ],
    "report_names": [
        "2022-01-20 - Treasury Sanctions Russian-Backed Actors Responsible for Destabilization Activities in Ukraine (Taras Kozak, Oleh Voloshyn, Volodymyr Oliynyk, Vladimir Sivkovich).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535607,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653781863,
    "ts_modification_date": 1653781863,
    "files": {
        "pdf": "https://archive.orkl.eu/f9c83d5e7b97b432637796ec4138e7d73bf50de9.pdf",
        "text": "https://archive.orkl.eu/f9c83d5e7b97b432637796ec4138e7d73bf50de9.txt",
        "img": "https://archive.orkl.eu/f9c83d5e7b97b432637796ec4138e7d73bf50de9.jpg"
    }
}