{
    "id": "2b9e475b-596b-4b2c-b3fb-d63facdea82e",
    "created_at": "2023-01-12T15:08:42.876515Z",
    "updated_at": "2025-03-27T02:15:45.219974Z",
    "deleted_at": null,
    "sha1_hash": "3f69d593750522727f6166a74d18fb853d2ef90a",
    "title": "2020-05-20 - What happened between the BigBadWolf and the Tiger-",
    "authors": "",
    "file_creation_date": "2022-05-27T19:01:53Z",
    "file_modification_date": "2022-05-27T19:01:53Z",
    "file_size": 3268947,
    "plain_text": "# What happened between the BigBadWolf and the Tiger?\n\n**[medium.com/insomniacs/what-happened-between-the-bigbadwolf-and-the-tiger-925549a105b2](https://medium.com/insomniacs/what-happened-between-the-bigbadwolf-and-the-tiger-925549a105b2)**\n\nasuna amawaka May 20, 2020\n\n[asuna amawaka](https://medium.com/@asuna.amawaka?source=post_page-----925549a105b2--------------------------------)\n\nMay 20, 2020\n\n\n10 min read\n\nWhile I was doing research for my previous posts, I came across mentions of a trending Chineselanguage-based C2-side controller called 大灰狼 (pronounced as Da Hui Lang, which translates\nliterally to Big Gray Wolf). I’m just going to call it BigBadWolf here :) Simply because the name is\ncute, I picked it up and took a closer look. Turns out, it is modelled after (or should I say, it’s an edit\nof) the infamous Gh0stRAT, and samples that are built from the BigBadWolf matches Gh0stRAT\nsignatures, as well as this YARA rule [1]:\n\nrule IronTiger_Gh0stRAT_variant\n\n{\nmeta:\n\nauthor=”Cyber Safety Solutions, Trend Micro”\n\ncomment=”This is a detection for a s.exe variant seen in Op. Iron Tiger”\n\nstrings:\n\n$mz=”MZ”\n\n$str1=”Game Over Good Luck By Wind” nocase wide ascii\n\n$str2=”ReleiceName” nocase wide ascii\n\n$str3=”jingtisanmenxiachuanxiao.vbs” nocase wide ascii\n\n$str4=”Winds Update” nocase wide ascii\n\ncondition:\n\n$mz at 0 and (any of ($str*))\n\n}\n\nThere are plenty of articles and analysis walkthroughs out there on Gh0stRATs, given its very long\nhistory. However, I decided to go ahead to further this exploration because I’ve seen this YARA rule\nhit often enough to wonder about whether the samples are really related to Iron Tiger, or could it be\nthe case that the strings are no longer unique enough to identify any particular variant.\n\nI’m sure that in your lifetime browsing VirusTotal, you would have come across community comments\nlike this:\n\n\n-----\n\nI was not able to get my hands on the exact sample that this rule was based on but I did find a few\nother samples that contains those strings, and I picked 3 to do comparisons with binaries generated\nfrom the BigBadWolf builder:\n\nBBE7D708310EC7E5F981CE4BA9928A19C4D2169B5520FFA573085F9698F90C25\nC02A360C6F64609403B4E4D4FC130014C40EBB77F71DF816C6408851C7C9ED54\n9DCDDC7FFCE78526057888B43B57E76BA7F3FED0C13FB4FA4214DCB08412C447\n\nWhile I was preparing this post, I came across a tweet[2] from malwaremustd1e that mentioned a\n“KuGou” backdoor along with screenshots that looked somewhat like what I observed while exploring\nBigBadWolf. I added these files as part of my comparison attempts, later in this post.\n\n852FA14860260023289EE6577DBD5E0193DF31DAE5F3C078142D3CAC030C7462 (EXE\ndropper)\n7BAEE22C9834BEF64F0C1B7F5988D9717855942D87C82F019606D07589BC51A9 (DLL\nRAT)\n\nLet’s get started!\n\n**The Misunderstood Wolf?**\n\nMaybe it all started as a tool for education. Really. It even came with a warning against doing evil with\nthis toolkit. Although ticking that checkbox at the bottom of the disclaimer does felt a little like “I\nsolemnly swear I am up to no good”.\n\n\n-----\n\nThe builder component comes with the standard set of features e.g. specify the C2 IP address,\nmutex, name of the service to create for persistency, location to store the malicious binary on disk,\noptions to delete the binary upon single run. There seems to be another binary (“1.dll” shown in the\nscreen capture) that needs to be downloaded by the generated binary. Leaving this field blank causes\nthe build to fail. This is quite typical of a Gh0stRAT deployment — a simple dropper/loader and a DLL\nthat contains the main logic of the RAT.\n\nI found a copy of the required DLL file that came within the bundle of C2-side binaries, and it looks to\nbe encoded/encrypted. The last 32 bytes of the file looks like a marker of sorts. Make a mental note\nof this, we’ll see how this is used later.\n\n\n-----\n\nThe output of the builder is a rather lightweight (9.5KB) EXE file, with almost no strings to analyze.\nThankfully, there is still something to hint of “evilness” within this executable — two sets of base64\nencoded strings.\n\nThe use of these strings are very quickly found within the binary.\n\n\n-----\n\nThe first set of string can be decoded with base64, ADD 0x7a and finally a XOR 0x59. This gives us\nthe address to fetch the DLL that we specified in the builder. ADD and XOR operations are typical\nencoding seen in Gh0stRAT variants.\n\n\n-----\n\nThe binary then proceeds to download this DLL and store it in C:\\Program Files\\AppPatch. This path\nis not configurable within the builder. As said earlier, the DLL is the meat of the RAT — all the EXE\ndoes is to download it, decrypt it, execute it and load the configuration data into its memory. Speaking\nof configuration data, that happens to be the second set of encoded strings we saw. The decoding of\nthat set of string is the responsibility of the DLL. We’ll look at that in awhile.\n\nLet’s talk about the DLL. After receiving the DLL, the loader checks for the magic footer before\nproceeding to decrypt it.\n\n\n-----\n\nThe decryption algorithm is nothing fanciful, just RC4, where the key is “Kother599”. One more thing\nthat we have to do before we can analyze this DLL with a disassembler: unpack it with ‘upx -d’.\n\n\n-----\n\n**Your big ears are showing, grandma…**\n\nThe first thing that the DLL is tasked to do is to decode the configuration data. Most of this\nconfiguration data is set in the builder, while some appears to be hardcoded.\n\nThe decoding of the configuration is the same sequence (but using different hex values) seen above:\nbase64, ADD 0x77, XOR 0x56.\n\nThe structure is as such:\n\n\n-----\n\n[C2 Address][QQ User ID][C2 Port 1][C2 Port 2][RC4 Password][Version][Service Name][Service\nDisplay Name][Service Description][Installation Path][Filename][Mutex][Group Option][Additional\nDownload][Installation Type, Logging Options][IP address tool][placeholder string][reverse DNS tool]\n\n[placeholder strings][QQ profile URL]\n\nNow we come to the interesting part — the callbacks. As we know, Gh0stRATs have their signature 5byte magic headers (the length varies in some cases, I know), followed by some size information, and\nfinally the Zlib compressed data. However, I don’t see this structure in the traffic. What I do see is a\nZlib header magic 0x78 9C. Let’s see what happened to the first few bytes prior to this Zlib header.\n\nIt’s not hard to identify the part that performs the encryption (RC4 again) of the communicated data.\nHowever, the author made a choice not to encrypt the entire data, but only the header portion,\nconsisting of the 5byte magic, size of entire data, size of uncompressed payload, a total of 0xD bytes.\nThis is done perhaps in a (futile) attempt to evade standard network signatures used to identify\nGh0stRAT communications. However, since the length of the header remains the same after\nencryption, a slight tweak to such network signatures should suffice to work. The key used in the\nencryption is found within the configuration data earlier read by the binary. This key is made up of\n<user defined password within builder> appended with <username used to login to the C2>.\n\n\n-----\n\n**And I huff and I puff, to clear the mysterious fog surrounding these samples!**\n\nSo what made these samples get flagged with that YARA rule I mentioned in the beginning of this\npost?\n\nThe presence of this strange VBS name:\n\n\n-----\n\nWhat does this VBS do? I gave the function some mock data as arguments, and the contents of the\nVBS is formed as follows. Looks like it is just for creating or manipulating a user account with “net\nuser”. The name of the VBS is not related to its contents. Just for fun, I’m guessing\n“jingtisanmenxiachuanxiao” is written as 警惕三门峡传销 in Chinese, which literally translate to “Be\nwary of Sanmenxia MLM”. Strange name to give to a script in any case.\n\nThe exact same function is found in all 4 files I cross-examined.\n\nNow, let’s find out if they are all BigBadWolf related.\n\nThe laziest way to start is to do BinDiff on the 3 files in relation to the DLL related to BigBadWolf.\nResults from BinDiff, pretty high scores. Not surprising, since they all stemmed from Gh0st code.\n\n\n-----\n\nSimilarity with\nC02A360C6F64609403B4E4D4FC130014C40EBB77F71DF816C6408851C7C9ED54Confidence\n0.988735 | Similarity 0.886978\nSimilarity with\nBBE7D708310EC7E5F981CE4BA9928A19C4D2169B5520FFA573085F9698F90C25Confidence\n0.984084 | Similarity 0.767249\nSimilarity with\n9DCDDC7FFCE78526057888B43B57E76BA7F3FED0C13FB4FA4214DCB08412C447Confidence\n0.988665 | Similarity 0.879644\n\nWhat are the differences then? Looks like all of the 3 has a different magic header — “KuGou”, while\nthe binary from BigBadWolf has “DHLAQ” as the magic (if you didn’t notice, DHL is the acronym of its\nChinese name Da Hui Lang). The size of the RC4 encrypted header also differs.\n\nLeft: from BigBadWolf; Right: from\nBBE7D708310EC7E5F981CE4BA9928A19C4D2169B5520FFA573085F9698F90C25\nAnother obvious difference is that the configuration data is not given as an encoded input, but instead\nfound as plaintext strings handled directly within the functions.\n\n\n-----\n\nSo, there is another Gh0st variant out there similar to BigBadWolf but yet implemented differently in\nsome ways, let’s call this set “KuGou”.\n\nRemember at the start of this post, I mentioned some KuGou malware tweeted by malwaremustd1e?\nLet’s see if they are the same as the 3 KuGou binaries we saw above.\n\nThe dropper EXE (SHA256:\n852FA14860260023289EE6577DBD5E0193DF31DAE5F3C078142D3CAC030C7462) contains\nencoded string that points the binary to download its DLL payload. Familiar yes?\n\n\n-----\n\nThe downloaded DLL (SHA256:\n7BAEE22C9834BEF64F0C1B7F5988D9717855942D87C82F019606D07589BC51A9) is RC4decrypted with key “Kother599”. Again, familiar! There’s a slight difference here, the EXE did not\nverify that the file has a footer signature e.g. “SSSSSSVID:2014-SV8”, and the DLL does not contain\nsuch a footer.\n\n\n-----\n\nThe next difference lies in the configuration data passed to be decrypted by the DLL. In this binary,\nthe configuration is encrypted with RC4, and not just Base64/ADD/XOR encoded as seen from the\nBigBadWolf’s DLL. RC4 key used here is “Strong798”. Notice how the structure of the configuration\nafter decryption is identical to what we saw in BigBadWolf. And even that string of Chinese (监测和监\n视新硬件设备并自动更新设备驱动) used as Service Description is identical.\n\nSince the configuration data is encrypted in a different manner, there must be another server-side\nbinary responsible for building this sample. To my surprise, the 5-byte magic used in the\ncommunications is “DHLAR”. Perhaps this explains the similarities shared with our BigBadWolf\nsample. Another thing is for sure, this file does not belong to the same set as the 3 “KuGou” binaries\nwe just looked at. If I had to pin a family name to this file, it would be BigBadWolf.\n\n\n-----\n\nA search on Google pointed me to a Operation PZCHAO report by BitDefender[3], in which a\njingtisanmenxiachuanxiao.vbs of a different content is documented. The samples that were described\nin this report somewhat bear resemblance to what we are seeing in BigBadWolf’s DLL, yet there are\ndifferences.\n\nFor example,\n\n“the malware then searches inside its own binary for a string delimiter SSSSSSS, returning a\nstring pointer to the beginning of the encrypted configuration string”\n\n\n-----\n\nThis is similar to how our sample looks for the marker SSSSSS (note the length here is only 6) to\nverify that the DLL downloaded is correct before proceeding to decrypt.\n\nAs another example,\n\n“Until it checks in with its C2 controller, the RAT server searches for the encrypted configuration\nbuffer containing the C&Cs that will get decrypted using an AES key derived from a hardcoded\nstring “Mother360””\n\nThe configuration is encoded with base64/ADD/XOR in BigBadWolf sample instead. Even when\nencryption is used, the algorithm in place is RC4.\n\nYet, this sample documented by Bitdefender will also match the Yara rule on “s.exe variant”, based on\nthe presence of the strings within the file. And we now know that it is a different variant from\nBigBadWolf, and even KuGou.\n\n**What a dreadful night!**\n\nI think you’re lost. Let’s try to summarise all of these information:\n\nAt the end of the day, I think I’ve established (further) that Gh0stRATs has too many variants. The\nbuilder that was behind that particular s.exe seen in Operation Iron Tiger has perhaps been\nreferenced/ modified/ improved, causing other binaries to contain similar keywords but belong to\ndifferent subvariants of Gh0stRAT that probably has nothing to do with the s.exe and its user\n(adversary group).\n\nPhew, glad I’ve got all of that information sorted out :)\n\nThat’s it for today!\n\n\n-----\n\n[1]: Operation Iron Tiger Appendix, TrendLabs Security Intelligence Blog, 2015\n\n[2]: [https://twitter.com/malwaremustd1e/status/1262274362872229888](https://twitter.com/malwaremustd1e/status/1262274362872229888)\n\n[3]: Operation PZCHAO, Bitdefender, 2017\n\n~~\n\n## Asuna\n\n### The latest Tweets from Asuna (@AsunaAmawaka). [Malware Analyst]. Binary World\n\ntwitter.com\n\nDrop me a DM if you would like to share findings or samples ;)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-20 - What happened between the BigBadWolf and the Tiger-.pdf"
    ],
    "report_names": [
        "2020-05-20 - What happened between the BigBadWolf and the Tiger-.pdf"
    ],
    "threat_actors": [
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536122,
    "ts_updated_at": 1743041745,
    "ts_creation_date": 1653678113,
    "ts_modification_date": 1653678113,
    "files": {
        "pdf": "https://archive.orkl.eu/3f69d593750522727f6166a74d18fb853d2ef90a.pdf",
        "text": "https://archive.orkl.eu/3f69d593750522727f6166a74d18fb853d2ef90a.txt",
        "img": "https://archive.orkl.eu/3f69d593750522727f6166a74d18fb853d2ef90a.jpg"
    }
}