{
    "id": "2bea425d-74f2-489a-a5c3-f1a83ea3c8a4",
    "created_at": "2023-05-06T02:08:23.891593Z",
    "updated_at": "2025-03-27T02:05:22.473072Z",
    "deleted_at": null,
    "sha1_hash": "e34a0975e134300da4b4e3a8da5fe7ad9772979d",
    "title": "2023-04-04 - Rorschach – A New Sophisticated and Fast Ransomware",
    "authors": "",
    "file_creation_date": "2023-05-05T01:48:11Z",
    "file_modification_date": "2023-05-05T01:48:11Z",
    "file_size": 2780624,
    "plain_text": "# Rorschach – A New Sophisticated and Fast Ransomware\n\n**[research.checkpoint.com/2023/rorschach-a-new-sophisticated-and-fast-ransomware/](https://research.checkpoint.com/2023/rorschach-a-new-sophisticated-and-fast-ransomware/)**\n\nApril 3, 2023\n\n**Research by: Jiri Vinopal, Dennis Yarizadeh and Gil Gekker**\n\n**Key Findings:**\n\nCheck Point Research (CPR) and Check Point Incident Response Team (CPIRT)\nencountered a previously unnamed ransomware strain, we dubbed Rorschach,\ndeployed against a US-based company.\nRorschach ransomware appears to be unique, sharing no overlaps that could easily\nattribute it to any known ransomware strain. In addition, it does not bear any kind of\nbranding which is a common practice among ransomware groups.\nThe ransomware is partly autonomous, carrying out tasks that are usually manually\nperformed during enterprise-wide ransomware deployment, such as creating a domain\n[group policy (GPO). In the past, similar functionality was linked to LockBit 2.0.](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/)\nThe ransomware is highly customizable and contains technically unique features, such\nas the use of direct syscalls, rarely observed in ransomware. Moreover, due to different\nimplementation methods, Rorschach is one of the fastest ransomware observed, by\nthe speed of encryption.\nThe ransomware was deployed using DLL side-loading of a Cortex XDR Dump Service\nTool, a signed commercial security product, a loading method which is not commonly\nused to load ransomware. The vulnerability was properly reported to Palo Alto\nNetworks.\n\n## Introduction\n\nWhile responding to a ransomware case against a US-based company, the CPIRT recently\ncame across a unique ransomware strain deployed using a signed component of a\ncommercial security product. Unlike other ransomware cases, the threat actor did not hide\nbehind any alias and appears to have no affiliation to any of the known ransomware groups.\nThose two facts, rarities in the ransomware ecosystem, piqued CPR interest and prompted\nus to thoroughly analyze the newly discovered malware.\n\nThroughout its analysis, the new ransomware exhibited unique features. A behavioral\nanalysis of the new ransomware suggests it is partly autonomous, spreading itself\nautomatically when executed on a Domain Controller (DC), while it clears the event logs of\nthe affected machines. In addition, it’s extremely flexible, operating not only based on a builtin configuration but also on numerous optional arguments which allow it to change its\n\n\n-----\n\nbehavior according to the operator s needs. While it seems to have taken inspiration from\nsome of the most infamous ransomware families, it also contains unique functionalities,\nrarely seen among ransomware, such as the use of direct syscalls.\n\nThe ransomware note sent out to the victim was formatted similarly to Yanluowang\nransomware notes, although other variants dropped a note that more closely resembled\n[DarkSide ransomware notes (causing some to mistakenly refer to it as DarkSide). Each](https://asec.ahnlab.com/en/47174/)\nperson who examined the ransomware saw something a little bit different, prompting us to\nname it after the famous psychological test – Rorschach Ransomware.\n\n## Execution Flow\n\nAs observed in the wild, Rorschach execution uses these three files:\n\n**cy.exe – Cortex XDR Dump Service Tool version 7.3.0.16740, abused to side-load**\n```\n   winutils.dll\n\n```\n**winutils.dll – Packed Rorschach loader and injector, used to decrypt and inject the**\nransomware.\n**config.ini – Encrypted Rorschach ransomware which contains all the logic and**\nconfiguration.\n\nUpon execution of cy.exe, due to DLL side-loading, the loader/injector winutils.dll is\nloaded into memory and runs in the context of cy.exe. The main Rorschach payload\n```\nconfig.ini is subsequently loaded into memory as well, decrypted and injected into\nnotepad.exe, where the ransomware logic begins.\n\n```\nFigure 1 – Rorschach’s High Level Execution Flow on both endpoints and on Domain\nControllers.\n\n\n-----\n\n### Security Solution Evasion\n\nRorschach spawns processes in an uncommon way, running them in SUSPEND mode and\ngiving out falsified arguments to harden analysis and remediation efforts. The falsified\nargument, which consists of a repeating string of the digit 1 based on the length of the real\nargument, rewritten in memory and replaced with the real argument, resulting in a unique\nexecution:\n\nFigure 2 – Rorschach’s process tree spawns processes with falsified arguments.\n\nThe ransomware uses this technique to run the following operations:\n\nAttempt to stop a predefined list of services, using net.exe stop.\nDelete shadow volumes and backups to harden recovery, using legitimate Windows\ntools such as vssadmin.exe, bcdedit.exe, wmic.exe, and wbadmin.exe\nRun wevutil.exe to clear the following Windows event logs: Application, Security,\nSystem and Windows Powershell.\nDisable the Windows firewall, using netsh.exe\n\n### Self-propagation\n\nWhen executed on a Windows Domain Controller (DC), the ransomware automatically\ncreates a Group Policy, spreading itself to other machines within the domain. Similar\n[functionality was linked in the past to LockBit 2.0, although the Rorschach Ransomware](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/)\nGPO deployment is carried out differently, as described below:\n\n\n-----\n\n1. Rorschach copies its files into the scripts folder of the DC, and deletes them from the\n\noriginal location.\n2. Rorschach then creates a group policy (see Appendix C) that copies itself into the\n```\n   %Public% folder of all workstations in the domain.\n\n```\n3. The ransomware creates another group policy in an attempt to kill a list of predefined\n\nlist of processes. This is done by creating a schedule task invoking taskkill.exe.\n4. Finally, Rorschach creates another group policy that registers a scheduled task which\n\nruns immediately and upon user logon, to run Rorschach’s main executable with the\nrelevant arguments.\n\n[Our colleagues in AhnLab published a more thorough behavioral analysis of another](https://asec.ahnlab.com/en/47174/)\nRorschach variant which provides further details into the operations.\n\n## Ransomware Analysis\n\nIn addition to the ransomware’s uncommon behavior described above, the Rorschach binary\nitself contains additional interesting features, differentiating it further from other ransomware.\n\n### Binary and Anti-Analysis Protection\n\nThe actual sample is protected carefully, and requires quite a lot of work to access. First, the\ninitial loader/injector winutils.dll is protected with UPX-style packing. However, this is\nchanged in such a way that it isn’t readily unpacked using standard solutions and requires\nmanual unpacking. After unpacking, the sample loads and decrypts config.ini, which\ncontains the ransomware logic.\n\nAfter Rorschach is injected into notepad.exe, it’s still protected by VMProtect. This results in\na crucial portion of the code being virtualized in addition to lacking an IAT table. Only after\ndefeating both of these safeguards is it possible to properly analyze the ransomware logic.\n\n### Security Solution Evasion\n\nAlthough Rorschach is used solely for encrypting an environment, it incorporates an unusual\ntechnique to evade defense mechanisms. It makes direct system calls using the “syscall”\ninstruction. While previously observed in other strains of malware, it’s quite startling to see\nthis in ransomware.\n\nThe procedure involves utilizing the instruction itself, and it goes as follows:\n\n1. The ransomware finds the relevant syscall numbers for NT APIs, mainly related to file\n\nmanipulation.\n2. Rorschach then stores the numbers in a table for future use.\n3. When needed, it calls a stub routine that uses the number directly with the syscall\n\ninstruction instead of using the NT API.\n\n\n-----\n\nIn other words, the malware first creates a syscall table for NT APIs used for file encryption:\n\nFigure 3 – Creation of syscall table for certain NT APIs.\n\nThe end of the table is a section with the relevant syscall numbers:\n\nFigure 4 – Section containing the syscall table.\n\nThe example below shows how the syscall numbers are used:\n\n\n-----\n\nFigure 5 – Example use of direct syscall.\n\nThis obfuscated process is not required for the ransomware encryption logic, which suggests\nit was developed to bypass security solutions monitoring direct API calls.\n\n### Command Line Arguments\n\nIn addition to the hardcoded configuration, the ransomware comes with multiple built-in\noptions, probably for the operators comfort. All of them are hidden, obfuscated, and not\naccessible without reverse-engineering the ransomware. This table contains some of the\narguments that we discovered:\n\n\n**Argument** **Example**\n**Parameter**\n\n\n**Description**\n\n\n**–run** =1234 Password needed to run the sample, possibly built on\ndemand.\n\n**–nomutex** =1 Do not create a mutex, therefore do not insure that only a\nsingle instance is running.\n\n**–log** =1 Create log files.\n\n**–nodel** =0 Do not self-delete on execution.\n\n**–path** =“C:” Encrypt only the following path.\n\n**–noshare** =1 Do not encrypt shares.\n\n**–pt** =”C:.dll” Explicitly state the loader DLL.\n\n**–cg** =”C:.ini” Explicitly state the configuration file that stores the malware.\n\n**–we** =”C:.exe” Explicitly state the main executable.\n\n**–diskpart** =1 Run diskpart.exe /s AppData_x.txt that removes readonly volume attributes.\n\n\n-----\n\n**Argument** **Example**\n**Parameter**\n\n\n**Description**\n\n\n**–nobk** =1 Do not change the wallpaper of the infected machine.\n\n**–thread** =4 Number of threads per CPU.\n\n\n**–at** =2023/03/24\n05:04:20\n\n\nActivation time (trigger time).\n\n\n**–nomail** =1 Do not create a ransom note.\n\nThis is only a partial list, with additional arguments suggesting networking capabilities, such\nas listen, srv and hostfile.\n\nExample of how some of these arguments are used:\n```\ncy.exe --run=1234 --nomutex=0 --log=1 --nodel=1 --path=\"C:\\Myfolder\" --full=1 -diskpart=1 --nobk=0\n\n### Language Based Protection\n\n```\nBefore encrypting the target system, the sample runs two system checks that can halt its\nexecution:\n\nIt uses GetSystemDefaultUILanguage and GetUserDefaultUILanguage to determine\nwhat language the user is using.\nIt exits if the return value is commonly used in CIS countries:\n```\n{\n\n  0x042b: \"Armenian_Armenia\",\n\n  0x042c: \"Azeri_Latin\",\n\n  0x043f: \"Kazakh\",\n\n  0x082c: \"Azeri_Cyrillic\",\n\n  0x419: \"Russian\",\n\n  0x422: \"Ukrainian\",\n\n  0x423: \"Belarusian\",\n\n  0x428: \"Tajik\",\n\n  0x437: \"Georgian\",\n\n  0x440: \"Kyrgyz_Cyrillic\",\n\n  0x442: \"Turkmen\",\n\n  0x443: \"Uzbek_Latin\",\n\n  0x819: \"Russian_Moldava\",\n\n  0x843: \"Uzbek_Cyrillic\"\n\n}\n\n### Encryption Process\n\n```\n\n-----\n\nThe Rorschach ransomware employs a highly effective and fast hybrid-cryptography\n[scheme, which blends the curve25519 and eSTREAM cipher hc-128 algorithms for](http://cr.yp.to/ecdh.html)\nencryption purposes. This process only encrypts a specific portion of the original file content\ninstead of the entire file. The WinAPI CryptGenRandom is utilized to generate\ncryptographically random bytes used as a per-victim private key. The shared secret is\ncalculated through curve25519, using both the generated private key and a hardcoded public\nkey. Finally, the computed SHA512 hash of the shared secret is used to construct the KEY\nand IV for the eSTREAM cipher hc-128.\n\nFigure 6 – The Rorschach hybrid-cryptography scheme.\n\nAnalysis of Rorschach’s encryption routine suggests not only the fast encryption scheme\nmentioned previously but also a highly effective implementation of thread scheduling via I/O\n**completion ports. In addition, it appears that compiler optimization is prioritized for speed,**\nwith much of the code being inlined. All of these factors make us believe that we may be\ndealing with one of the fastest ransomware out there.\n\nTo verify our hypothesis, we conducted five separate encryption speed tests in a controlled\nenvironment (with 6 CPUs, 8192MB RAM, SSD, and 220000 files to be encrypted), limited to\nlocal drive encryption only. To provide a meaningful comparison with other known fast\nransomware, we compared Rorschach with the notorious LockBit v.3.\n\nThe result of the speed tests:\n\n**Ransomware** **Average approximate time of encryption**\n\nLockBit v.3 7 minutes\n\n\n-----\n\n**Ransomware** **Average approximate time of encryption**\n\nRorschach 4 minutes, 30 seconds\n\nIt turned out that we have a new speed demon in town. What’s even more noteworthy is that\nthe Rorschach ransomware is highly customizable. By adjusting the number of encryption\nthreads via the command line argument --thread, it can achieve even faster times.\n\n### Technical Similarity to Other Ransomware\n\nWhen we compared Rorschach to other well-known ransomware families, we noticed that\nRorschach uses a variety of time-honored methods together with some novel ideas in the\nransomware industry. The name itself, “Rorschach”, is quite self-explanatory; with deep\nreverse engineering of the code and its logic, we found certain similarities with some of the\nmore technically advanced and established ransomware groups.\n\nWe discussed Rorschach’s hybrid-cryptography scheme in detail above, but we suspect that\n[this routine was borrowed from the leaked source code of Babuk ransomware. See the](https://github.com/vxunderground/MalwareSourceCode/blob/main/Win32/Ransomware/Ransomware.Multi.Babuk.c.rar)\nfollowing code snippets as examples:\n\nFigure 7 – Hybrid-cryptography scheme of Rorschach vs. Babuk.\n\nRorschach’s inspiration from Babuk is evident in various routines, including those\nresponsible for stopping processes and services. In fact, the code used to stop services\nthrough the service control manager appears to have been directly copied from Babuk’s\nsource code:\n\n\n-----\n\nFigure 8 – Stopping predefined list of services – Rorschach vs. Babuk.\n\nIt is also worth noting that the list of services to be stopped in Rorschach’s configuration is\nidentical to that in the leaked Babuk source code. However, the list of processes to be\nstopped differs slightly, as Rorschach omits notepad.exe, which is used as a target for code\ninjection.\n\nRorahsach takes inspiration from another ransomware strain: LockBit. First, the list of\nlanguages used to halt the malware is exactly the same list that was used in LockBit v2.0\n(although the list is commonly used by many Russian speaking groups, and not just LockBit).\nHowever, the I/O Completion Ports method of thread scheduling is another component\nwhere Rorschach took some inspiration from LockBit. The final renaming of the encrypted\nmachine files in Rorschach is implemented via NtSetInformationFile using\n**FileInformationClass** `FileRenameInformation, just like in LockBit v2.0.`\n\nFigure 9 – Renaming of encrypted file using NtSetInformationFile.\n\nAs noted before, Rorschach’s code is protected and obfuscated in a way that is unusual for\nransomware, and is compiled with compiler optimization to favor speed and code inlining as\nmuch as possible. This makes finding similarities with other well-known ransomware families\n\n\n-----\n\na real brain-buster. But we can still say that Rorschach took the best from the ransomware\nfamilies with the highest reputation, and then added some unique features of its own.\n\n## Ransom Notes\n\nAs we noted, Rorschach does not exhibit any clear-cut overlaps with any of the known\nransomware groups but does appear to draw inspiration from some of them.\n\nWe mentioned previously that Ahnlab reported a similar attack earlier this year. While it was\ncarried out through different means, the ransomware described in the report triggers an\nalmost identical execution flow. However, the resulting ransom note was completely different.\nThe note was actually very similar to those issued by DarkSide, which probably led to this\n[new ransomware being named “DarkSide,” despite the group being inactive since May 2021.](https://www.nytimes.com/2021/05/14/business/darkside-pipeline-hack.html)\n\nThe Rorschach variant we analyzed leaves a different ransom note based on the structure\nused by Yanlowang, another ransomware group:\n\nFigure 10 – Ransom note from Rorschach.\n\n## Conclusion\n\nOur analysis of Rorschach reveals the emergence of a new ransomware strain in the\ncrimeware landscape. Its developers implemented new anti-analysis and defense evasion\ntechniques to avoid detection and make it more difficult for security software and researchers\nto analyze and mitigate its effects. Additionally, Rorschach appears to have taken some of\nthe ‘best’ features from some of the leading ransomwares leaked online, and integrated them\nall together. In addition to Rorschach’s self-propagating capabilities, this raises the bar for\nransom attacks. The operators and developers of the Rorschach ransomware remain\nunknown. They do not use branding, which is relatively rare in ransomware operations.\n\n\n-----\n\nOur findings underscore the importance of maintaining strong cybersecurity measures to\nprevent ransomware attacks, as well as the need for continuous monitoring and analysis of\nnew ransomware samples to stay ahead of evolving threats. As these attacks continue to\ngrow in frequency and sophistication, it is essential for organizations to remain vigilant and\nproactive in their efforts to safeguard against these threats.\n\n[Harmony Endpoint provides runtime protection against ransomware with instant automated](https://www.checkpoint.com/harmony/advanced-endpoint-protection/)\nremediation, even in offline mode.\n\nWhen running on a machine infected with the Rorschach ransomware, Harmony Endpoint\nAnti-ransomware detected the encryption process in different folders, including modifications\nmade to Harmony Endpoint ‘honeypot’ files. It ran a ranking algorithm that provided a verdict\nidentifying the process as a ransomware.\n\n## Samples/IOCs\n\n### Files\n\n**Name** Hash Comments\n\n**cy.exe** 2237ec542cdcd3eb656e86e43b461cd1 PA Cortex Dump Service Tool\n(benign file)\n\n**winutils.dll** 4a03423c77fe2c8d979caca58a64ad6c Loader and injector into\nnotepad.exe\n\n**config.ini** 6bd96d06cd7c4b084fe9346e55a81cf9 Encrypted ransomware payload\n\n## Appendix A – Services and processes terminated through GPO by Rorschach\n\nThe following services are stopped through a GPO issued by Rorschach, probably to prevent\nconflicting write orders to Database files (and thus preventing encryption):\n\n\n-----\n\nSQLPBDMS\n\nSQLPBENGINE\n\nMSSQLFDLauncher\n\nSQLSERVERAGENT\n\nMSSQLServerOLAPService\n\nSSASTELEMETRY\n\nSQLBrowser\n\nSQL Server Distributed Replay Client\n\nSQL Server Distributed Replay Controller\n\nMsDtsServer150\n\nSSISTELEMETRY150\n\nSSISScaleOutMaster150\n\nSSISScaleOutWorker150\n\nMSSQLLaunchpad\n\nSQLWriter\n\nSQLTELEMETRY\n\nMSSQLSERVER\n\nThe following processes are killed using a group policy (scheduled task) issued by\nRorschach executing C:\\windows\\system32\\taskkill.exe. Some are likely terminated to\nprevent write conflicts, and some are security solutions:\n\nwxServer.exe\n\nwxServerView.exe\n\nsqlmangr.exe\n\nRAgui.exe\n\nsupervise.exe\n\nCulture.exe\n\nDefwatch.exe\n\nhttpd.exe\n\nsync-taskbar\n\nsync-worker\n\nwsa_service.exe\n\nsynctime.exe\n\nvxmon.exe\n\nsqlbrowser.exe\n\ntomcat6.exe\n\nSqlservr.exe\n\n## Appendix B – Hardcoded Rorschach configuration\n\nThe following is a list of services, hardcoded in its configuration, to be stopped via the\nservice control manager:\n\n\n-----\n\nAcronisAgent\n\nAcrSch2Svc\n\nbackup\n\nBackupExecAgentAccelerator\n\nBackupExecAgentBrowser\n\nBackupExecDiveciMediaService\n\nBackupExecJobEngine\n\nBackupExecManagementService\n\nBackupExecRPCService\n\nBackupExecVSSProvider\n\nCAARCUpdateSvc\n\nCASAD2DWebSvc\n\nccEvtMgr\n\nccSetMgr\n\nDefWatch\n\nGxBlr\n\nGxCIMgr\n\nGxCVD\n\nGxFWD\n\nGxVss\n\nIntuit.QuickBooks.FCS\n\nmemtas\n\nmepocs\n\nPDVFSService\n\nQBCFMonitorService\n\nQBFCService\n\nQBIDPService\n\nRTVscan\n\nSavRoam\n\nsophos\n\nsql\n\nstc_raw_agent\n\nsvc$\n\nveeam\n\nVeeamDeploymentService\n\nVeeamNFSSvc\n\nVeeamTransportSvc\n\nVSNAPVSS\n\nvss\n\nYooBackup\n\nYooIT\n\nzhudongfangyu\n\nThe following is a hardcoded list of directories and files to be omitted from encryption:\n\n\n-----\n\n.\n\n..\n\n#recycle\n\n$Recycle.Bin\n\n1_config.ini\n\nAhnlab\n\nAll Users\n\nAppData\n\nAUTOEXEC.BAT\n\nautoexec.bat\n\nautorun.inf\n\nbegin.txt\n\nBoot\n\nboot.ini\n\nbootfont.bin\n\nbootmgfw.efi\n\nbootmgr\n\nbootmgr.efi\n\nbootsect.bak\n\nconfig.ini\n\ndesktop.ini\n\nfinish.txt\n\nGoogle\n\niconcache.db\n\nInternet Explorer\n\nMozilla\n\nMozilla Firefox\n\nNETLOGON\n\nntldr\n\nntuser.dat\n\nNTUSER.DAT\n\nntuser.dat.log\n\nntuser.dat.LOG1\n\nntuser.dat.LOG2\n\nntuser.ini\n\nOpera\n\nOpera Software\n\nPolicies\n\nProgram Files\n\nProgram Files (x86)\n\nProgramData\n\nscripts\n\nSYSVOL\n\nthumbs.db\n\nTor Browser\nWindows\n\nWINDOWS\n\nWindows.old\n\n\n-----\n\nThe following is a list of process names that during Rorschach s execution these names are\ncompared to those running on the machine and killed if matched. This is done through a\ncombination of CreateToolhelp32Snapshot, Process32FirstW, Process32NextW,\n```\nOpenProcess, and TerminateProcess. There is some overlap and redundancy to the list of\n\n```\nservices killed via the service control manager.\n\nAcronisAgent\n\nAcrSch2Svc\n\nagntsvc.exe\n\nBackExecRPCService\n\nbackup\n\nBackupExecAgentAccelerator\n\nBackupExecDiveciMediaService\n\nBackupExecJobEngine\n\nbedbg\n\nCAARCUpdateSvc\n\nccEvtMgr\n\nCulserver\n\ndbeng50.exe\n\ndbeng8\n\ndbsnmp.exe\n\ndbsrv12.exe\n\nDefWatch\n\nencsvc.exe\n\nexcel.exe\n\nfirefox.exe\n\ninfopath.exe\n\nIntuit.QuickBooks.FCS\n\nisqlplussvc.exe\n\nmemtas\n\nmepocs\n\nmsaccess.exe\n\nMSExchange\n\nmsftesql-Exchange\n\nmsmdsrv\n\nmspub.exe\n\nMSSQL\n\nmydesktopqos.exe\n\nmydesktopservice.exe\n\nocautoupds.exe\n\nocomm.exe\n\nocssd.exe\n\nonenote.exe\n\noracle.exe\n\noutlook.exe\n\nPDVFSService\n\npowerpnt.exe\n\nQBCFMonitorService\n\nQBFCService\n\nQBIDPService\n\n\n-----\n\nSavRoam\nsophos\nsqbcoreservice.exe\nsql.exe\nsqladhlp\nSQLADHLP\nsqlagent\nSQLAgent\nSQLAgent$SHAREPOINT\nSQLBrowser\nSQLWriter\nsteam.exe\nsynctime.exe\ntbirdconfig.exe\nthebat.exe\nthunderbird.exe\ntomcat6\nveeam\nVeeamDeploymentService\nVeeamNFSSvc\nVeeamTransportSvc\nvisio.exe\nvmware-converter\nvmware-usbarbitator64\nWinSAT.exe\nwinword.exe\nwordpad.exe\nwrapper.exe\nWSBExchange\nxfssvccon.exe\nYooBackup\n\n## Appendix C – Group Policies executed by Rorschach\n\n**Transferring its own files to each workstation:**\n\n\n-----\n\n```\n<Files clsid {215B2E53 57CE 475c 80FE 9EEC14635851} >\n\n  <File clsid=\"{50BE44C8-567A-4ed1-B1D0-9234FE1F38AF}\" name=\"0305_winutils.dll\"\nstatus=\"0305_winutils.dll\" image=\"2\" changed=\"2023-03-05 08:51:22\" uid=\"{3F490769A341-4220-90A3-51964B4A0C12}\" bypassErrors=\"1\">\n\n    <Properties action=\"U\"\nfromPath=\"\\\\**REDACTED**\\sysvol\\**REDACTED**.local\\scripts\\winutils.dll\"\ntargetPath=\"%Public%\\winutils.dll\" readOnly=\"0\" archive=\"1\" hidden=\"0\" suppress=\"0\"\n/>\n  </File>\n\n  <File clsid=\"{50BE44C8-567A-4ed1-B1D0-9234FE1F38AF}\" name=\"0305_config.ini\"\nstatus=\"0305_config.ini\" image=\"2\" changed=\"2023-03-05 08:51:22\" uid=\"{F513F283-3C664C71-9B9B-4CE9BBFCEEF1}\" bypassErrors=\"1\">\n\n    <Properties action=\"U\"\nfromPath=\"\\\\**REDACTED**.local\\sysvol\\**REDACTED**.local\\scripts\\config.ini\"\ntargetPath=\"%Public%\\config.ini\" readOnly=\"0\" archive=\"1\" hidden=\"0\" suppress=\"0\" />\n\n  </File>\n\n  <File clsid=\"{50BE44C8-567A-4ed1-B1D0-9234FE1F38AF}\" name=\"0305_cy.exe\"\nstatus=\"0305_cy.exe\" image=\"2\" changed=\"2023-03-05 08:51:22\" uid=\"{0A16D469-26484849-99C8-95D1B777D59A}\" bypassErrors=\"1\">\n\n    <Properties action=\"U\"\nfromPath=\"\\\\**REDACTED**.local\\sysvol\\**REDACTED**.local\\scripts\\cy.exe\"\ntargetPath=\"%Public%\\cy.exe\" readOnly=\"0\" archive=\"1\" hidden=\"0\" suppress=\"0\" />\n  </File>\n\n</Files>\n\n```\n**Executing a scheduled task to run the attack:**\n\n\n-----\n\n```\n<TaskV2 clsid {D8896631 B747 47a7 84A6 C155337F3BC8} name 2_0305_cy.exe image 2 \nchanged=\"**REDACTED**\" uid=\"{3772E17D-6354-4DF1-A73B-8868AC352B23}\">\n\n  <Properties action=\"U\" name=\"2_0305_cy.exe\" runAs=\"%LogonDomain%\\%LogonUser%\"\nlogonType=\"InteractiveToken\">\n\n    <Task version=\"1.2\">\n\n      <RegistrationInfo>\n\n        <Author>**REDACTED**\\Administrador</Author>\n\n        <Description></Description>\n\n      </RegistrationInfo>\n\n      <Principals>\n\n        <Principal id=\"Author\">\n\n          <UserId>%LogonDomain%\\%LogonUser%</UserId>\n\n          <LogonType>InteractiveToken</LogonType>\n\n          <RunLevel>HighestAvailable</RunLevel>\n\n        </Principal>\n\n      </Principals>\n\n      <Settings>\n\n        <IdleSettings>\n\n          <Duration>PT10M</Duration>\n\n          <WaitTimeout>PT1H</WaitTimeout>\n\n          <StopOnIdleEnd>false</StopOnIdleEnd>\n\n          <RestartOnIdle>false</RestartOnIdle>\n\n        </IdleSettings>\n\n        <MultipleInstancesPolicy>IgnoreNew</MultipleInstancesPolicy>\n\n        <DisallowStartIfOnBatteries>false</DisallowStartIfOnBatteries>\n\n        <StopIfGoingOnBatteries>false</StopIfGoingOnBatteries>\n\n        <AllowHardTerminate>true</AllowHardTerminate>\n\n        <AllowStartOnDemand>true</AllowStartOnDemand>\n\n        <Enabled>true</Enabled>\n\n        <Hidden>false</Hidden>\n\n        <ExecutionTimeLimit>P3D</ExecutionTimeLimit>\n\n        <Priority>7</Priority>\n\n      </Settings>\n\n      <Triggers>\n\n        <RegistrationTrigger>\n\n          <Enabled>true</Enabled>\n\n        </RegistrationTrigger>\n\n        <LogonTrigger>\n\n          <Enabled>true</Enabled>\n\n        </LogonTrigger>\n\n      </Triggers>\n\n      <Actions Context=\"Author\">\n\n        <Exec>\n\n          <Command>%Public%\\cy.exe</Command>\n\n          <Arguments>--run=**REDACTED**</Arguments>\n\n        </Exec>\n\n      </Actions>\n\n    </Task>\n\n  </Properties>\n\n</TaskV2>\n\n```\n\n-----\n\nGO UP\n[BACK TO ALL POSTS](https://research.checkpoint.com/latest-publications/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-04 - Rorschach – A New Sophisticated and Fast Ransomware.pdf"
    ],
    "report_names": [
        "2023-04-04 - Rorschach – A New Sophisticated and Fast Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338903,
    "ts_updated_at": 1743041122,
    "ts_creation_date": 1683251291,
    "ts_modification_date": 1683251291,
    "files": {
        "pdf": "https://archive.orkl.eu/e34a0975e134300da4b4e3a8da5fe7ad9772979d.pdf",
        "text": "https://archive.orkl.eu/e34a0975e134300da4b4e3a8da5fe7ad9772979d.txt",
        "img": "https://archive.orkl.eu/e34a0975e134300da4b4e3a8da5fe7ad9772979d.jpg"
    }
}