{
    "id": "2bfde28f-5c24-46f3-b958-2119fc58bf4a",
    "created_at": "2023-01-12T14:59:25.728833Z",
    "updated_at": "2025-03-27T02:05:33.748595Z",
    "deleted_at": null,
    "sha1_hash": "92f846c8ca30556352ea2981423b36c36c56a1be",
    "title": "2015-01-11 - The Mozart RAM Scraper",
    "authors": "",
    "file_creation_date": "2022-10-02T12:11:05Z",
    "file_modification_date": "2022-10-02T12:11:05Z",
    "file_size": 391373,
    "plain_text": "# securitykitten.github.io/_posts/2015-01-11-the-mozart-ram-scraper.md\n\n**[github.com/malware-kitten/securitykitten.github.io/blob/master/_posts/2015-01-11-the-mozart-ram-scraper.md](https://github.com/malware-kitten/securitykitten.github.io/blob/master/_posts/2015-01-11-the-mozart-ram-scraper.md)**\n\nmalware-kitten\n\nCannot retrieve contributors at this time\n\n**layout** **title** **excerpt** **date**\n\ncategory-post The Mozart RAM Scraper The Elusive POS Malware 2015-01-11 17:51:53 -0500\n\nAs a reverse engineer on the CBTS Advanced Cyber Security team, I spend a large part of my time pulling apart and\nprofiling the latest and greatest malware. The Mozart malware was hidden from the public for some time. I hope to shed\nsome light on it in this post.\n\n## Introduction\n\nThe Home Depot breach was a very high profile case this year, which brought the security of point of sale machines into the\nspotlight. After some mumblings and a bunch of misinformation about who/what and how the attack came about, little pieces\nof information started to make their way to the surface. Several of which were reports a new malware dubbed \"Mozart.\"\n\nWhen I heard of the initial reports behind Mozart, I was eager to get my hands on it. There were very few copies floating\naround, and the copies available were not being shared. So as you can imagine, I was thrilled when I saw this\n[http://totalhash.com/analysis/1b96a74d8a649dfde269ce2f322732d760c97049.](http://totalhash.com/analysis/1b96a74d8a649dfde269ce2f322732d760c97049)\n\nAll the reports out there didn't have much information on this tool and the deepest level of analysis that I could find was a\nstrings dump of the malware. Not interesting. The purpose of this post is to dig deeper into this elusive tool and talk about\nhow it works so that we can collectively learn and understand.\n\n## Diving In\n\nThe first thing that this malware does is sets itself up as a service for persistence. It uses a legit looking service name \"NCR\nSelfServ Platform Remote Monitor\" with the short name of \"NCR_RemoteMonitor\". For those unfamiliar, NCR is a company\nthat specializes in retail point of sale machines. To the untrained eye, these services would look benign. When running the\nmalware for the first time, it'll pop up a command window with the following text:\n\n\n-----\n\nO ce t e se ce s set up, t g ab t e ost a e o t e syste\n\nThe malware will build the string java.exe (manually from bytes) and then store it. It will later focus on dumping processes\nnamed java.exe.\n\nThe malware will also grab the current working directory and use that to store \"garbage.tmp\". This will be the file where the\nscraped credit card numbers are staged.\n\nThe malware uses a pretty typical combination of GetCurrentProcessId -> EnumProcesses -> OpenProcess ->\nVirtualQueryEx -> ReadProcessMemory to peer into process memory space to capture unencrypted credit card information\nthat is sitting in RAM.\n\nChunks of memory are then passed to a function that is responsible for parsing out the track information. The function will\nlook for common sentinels and be responsible for identifying track 1 and track 2 data.\n\n\n-----\n\nSetting a breakpoint within the function will allow us to see the data being passed around in a buffer.\n\nAll results are then passed to a function that will use Luhn's algorithm to validate the code (utilizing a lookup table). This is\nthe defacto algorithm for credit card validation and is a common component in many credit card scraping utilities. A\nscreenshot of Luhn's pseudocode can be seen below:\n\nOnce the data is validated, it is passed to an encoding function that is responsible for doing an ADD and base64 to encode\nthe data and output it to a file. The key that is used for the ADD operation is the string \"java.exe\". The encoded information is\nthen stored in garbage.tmp and multiple entries are delimited by '|'\n\nA decoder can be written for the data in garbage.tmp using ruby. The following script will decode track information.\n\n\n-----\n\n{% g g t uby %} {% a %}\n\n#!/usr/bin/ruby\n\nrequire 'base64'\n\nencoded =\n\"npmumWSVq5ahkayRZZerncippbGMla2Vn5Kmkl6VqJWakaaRXpWpl5qUp5pfnaiam5qnkV6VqJWa|npmumWSVq5ahkayRZZernaeRq5\nitems = encoded.split('|')\nitems.each do |elem|\ndecoded = Base64.decode64(elem)\nkey = (\"java.exe\"*10).split(//).map {|x|\nx.ord}\ncount = 0\n```\ndecoded.each_byte do |char|\n\n     print \"#{(char - key[count]).chr}\"\n\n     count += 1\n\nend\n\nputs\n\n\n```\nend\n\n{% endraw %}\n{% endhighlight %}\n\nWhich when ran, will echo back our track data\n\n{% highlight bash %}\n{% raw %}\n\nruby ./decode.rb\n4888603170607238^H/P^050510100000000001203191805191000000\n4888603170607238=05051011203191805191\n\n{% endraw %}\n{% endhighlight %}\n\nThe data that is stored in garbage.tmp will be appended to the file at the hardcoded path\n\"\\STWISM\\DeviceUpdates\\500\\athena.dll\". This is particularly interesting as it appears STWISM is the internal name of a\nserver. By having the POS systems dump data to a single location, the attackers needed to retrieve data only from a single\nspot rather than re-visiting each point of sale machine.\n\nThis is done on a random time schedule that is seen (in pseudo code) below, where the malware will check the local time\nand compare it with the random value. When the backup function is finished, a new value is generated. The numbers that\nare generated correspond to regular working hours between 09:00 and 18:00.\n\n## Oddities\n\nSimilar to FrameworkPOS, Mozart contains anti-American messages, including two links to the following sites:\n\nAnd a message of \"America's Deadliest Export: Democracy\". These aren't referenced by code or used in anyway. This is the\nassumed mechanism the author is using to let the analyst known his/her sentiments.\n\nAnother oddity that could give away information about the author is the name of the PDB (debugging symbols) that was used\nwhen they were building this file.\n\nz:\\Slender\\mozart\\mozart\\Release\\mozart.pdb\n\nThere have been plenty of reports speculating information about the Slender persona, so it would be redundant information\nto dive into that here.\n\n## Detection\n\n\n-----\n\nWhile this is an older piece of malware, detecting it is still important. At the time of this writing it's scoring 34/56 on Virustotal.\nIn earlier December it was scoring much more poorly with a total of 5/56. While sharing malware may not be in the interest of\nthe customer, this goes to show that even the AV vendors were not in the loop.\n\nThe following yara rule will detect this variant of Mozart:\n```\nrule Mozart\n\n{\n\n  meta:\n\n    author = \"Nick Hoffman\"\n\n    description = \"Detects samples of the Mozart POS RAM scraping utility\"\n\n  strings:\n\n    $pdb = \"z:\\\\Slender\\\\mozart\\\\mozart\\\\Release\\\\mozart.pdb\" nocase wide ascii\n\n    $output = {67 61 72 62 61 67 65 2E 74 6D 70 00}\n\n    $service_name = \"NCR SelfServ Platform Remote Monitor\" nocase wide ascii\n\n    $service_name_short = \"NCR_RemoteMonitor\"\n\n    $encode_data = {B8 08 10 00 00 E8 ?? ?? ?? ?? A1 ?? ?? ?? ?? 53 55 8B AC 24 14 10 00 00 89 84 24 0C 10 00\n00 56 8B C5 33 F6 33 DB 8D 50 01 8D A4 24 00 00 00 00 8A 08 40 84 C9 ?? ?? 2B C2 89 44 24 0C ?? ?? 8B 94 24 1C 10\n00 00 57 8B FD 2B FA 89 7C 24 10 ?? ?? 8B 7C 24 10 8A 04 17 02 86 E0 BA 40 00 88 02 B8 ?? ?? ?? ?? 46 8D 78 01 8D\nA4 24 00 00 00 00 8A 08 40 84 C9 ?? ?? 2B C7 3B F0 ?? ?? 33 F6 8B C5 43 42 8D 78 01 8A 08 40 84 C9 ?? ?? 2B C7 3B\nD8 ?? ?? 5F 8B B4 24 1C 10 00 00 8B C5 C6 04 33 00 8D 50 01 8A 08 40 84 C9 ?? ?? 8B 8C 24 20 10 00 00 2B C2 51 8D\n54 24 14 52 50 56 E8 ?? ?? ?? ?? 83 C4 10 8B D6 5E 8D 44 24 0C 8B C8 5D 2B D1 5B 8A 08 88 0C 02 40 84 C9 ?? ?? 8B\n8C 24 04 10 00 00 E8 ?? ?? ?? ?? 81 C4 08 10 00 00}\n\n  condition:\n\n   any of ($pdb, $output, $encode_data) or\n\n   all of ($service*)\n\n}\n\n\n```\nThe signature will look for the service names, the filename garbage.tmp, the build path and the encoding routine used to\nobfuscate credit card numbers.\n\n## Conclusion\n\nThe malware was compiled on 2014:04:10 18:12:41-04:00. The first rumors of (in the public space) the Home Depot breach\nwas in September. This gives an idea of potentially how long this malware had access to credit card numbers before being\ndiscovered.\n\nTo me, one of the most surprising things about this malware is how long it was hidden from the malware analyst community.\nThere was a high profile hack, and in the interest of non-disclosure, samples were not shared. It should be an obvious\nstatement that this does not enable the security community and the clients they are protecting, but rather leaves them\ndefenseless as they can't guard against what they don't know.\n\nIn terms of the malware, this uses fairly common techniques and employs simple protections to prevent itself from being\ncaught. The malware does not utilize a packer and it'll hide in plainsight by using a service name that looks legitimate. Unlike\nDexter, the malware doesn't use process injection that could potentially set off anti-virus engines. A combination of using\nWindows networking and only transferring files during work hours, this malware was able to remain undetected for quite\nsome time, proving simplicity is the ultimate sophistication.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-01-11 - The Mozart RAM Scraper.pdf"
    ],
    "report_names": [
        "2015-01-11 - The Mozart RAM Scraper.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535565,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1664712665,
    "ts_modification_date": 1664712665,
    "files": {
        "pdf": "https://archive.orkl.eu/92f846c8ca30556352ea2981423b36c36c56a1be.pdf",
        "text": "https://archive.orkl.eu/92f846c8ca30556352ea2981423b36c36c56a1be.txt",
        "img": "https://archive.orkl.eu/92f846c8ca30556352ea2981423b36c36c56a1be.jpg"
    }
}