{
    "id": "2c42e88f-d0d4-4199-8f82-7fde68d16006",
    "created_at": "2023-01-12T15:09:24.592802Z",
    "updated_at": "2025-03-27T02:08:36.206538Z",
    "deleted_at": null,
    "sha1_hash": "3f6e70e68cdcf819abb78b39eab5594b46419e01",
    "title": "2020-02-21 - Exploring the Genesis Supply Chain for Fun and Profit- Part 1 – Misadventures in GUIDology",
    "authors": "",
    "file_creation_date": "2022-05-28T05:03:18Z",
    "file_modification_date": "2022-05-28T05:03:18Z",
    "file_size": 2352611,
    "plain_text": "# Exploring the Genesis Supply Chain for Fun and Profit\n\n**[ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/)**\n\nFebruary 21, 2020\n\n## Bottom Line Up Front\n\nThis is the first post in a series of posts reviewing the supply chain of the Genesis Store\nmarket – a likely-Russian threat actor operating a successful, borderline innovative, pay-per_bot store since 2018. The following post features a quick-and-easy methodology breaking_\ndown over 335,000 unique Genesis infections into four malware groups, allowing us to\nattribute over 300,000 AZORult infections to the Genesis actors **currently involved in**\n**campaigns resulting is tens of thousands of new AZORult infections per month.**\nFurthermore, it seems Genesis isn’t necessarily leading these campaigns, but rather working\nwith various Malware-as-a-Service (MaaS) providers and cybercrime services.\n\nThis discovery, linking Genesis with widely known commodity malware, highlights the\n**ongoing threat to organizations and the proliferation of illegal data obtained from**\n**infections. It also sheds light on the supply chain relationships between actors operating**\nwithin the cybercrime financial ecosystem (read: Dark Net); we’ll explore this theme,\nincluding specific actors and trends, in the next posts.\n\n## Preface\n\nMuch has been written about the Genesis Store: the threat it poses to organizations, the\n[native fingerprinting abilities embedded in the tools it provides, or (shameless plug alert) the](https://www.kaspersky.com/about/press-releases/2019_meet-genesis-the-underground-e-shop-with-tens-of-thousands-of-digital-doppelgangers)\n[shift in cybercrime business models it represents.](https://ke-la.com/one-attackers-trash-is-another-attackers-treasure/)\n\n\n-----\n\nOn a day-to-day operations basis, KELA automatically monitors new listings on the\n**market – allowing our clients to monitor relevant infections. While these real-time alerts allow**\nthreat intelligence or incident response teams to remediate relevant threats, many of our\nclients were interested in a wider, more contextual understanding of Genesis. For example,\n[one report indicated that Genesis “introduced a new breed of stealers specifically designed](https://intsights.com/resources/research-report-digital-browser-identities)\n_to collect digital fingerprints and artifacts;” another referred to the Genesis “botnet.” That_\nraises the question, what do Genesis actors actually do? Develop specialized stealers,\nmanage a MaaS botnet, or sell credentials obtained by other actors?\n\nSeeking to demystify the threat, we focused on three major areas:\n\n**1. Technical abilities – which trojan is being used: commodity malware or a tailored tool?**\n\n**2. Operational independence – are the Genesis actors leading independent campaigns,**\ndetermining targets and infection methods, or reselling data obtained by other parties?\n\n**3. Scale – the spread, infection rate and profits pocketed by the actors**\n\nOur research aims to evaluate the actionable threat level: if ACME Corp found an infected\nendpoint offered for sale on the market, what should be the next steps of the incident\nresponse team? What does a Genesis infection say about further threat hunting, threat\ncontainment and lateral movement, or impending payloads? In the age of cybercrime intergroup relations and joint campaigns, understanding how Genesis actors position themselves\nin the cybercrime financial ecosystem as an emerging threat group can be extremely helpful\nto defenders.\n\nLuckily, it’s our business to have access to large cybercrime-related data; as such, KELA’s\n**systems have been scraping Genesis ever since it became a prominent market,**\ncaching every infected machine’s data and metadata, resulting in over 335,000 unique\ndevices at the time of writing. However, unlike a day-to-day malware analysis assignment,\n**we had no specific infection to investigate. Since KELA is an external service provider,**\nwe learn about Genesis infections affecting our clients from listings on the market and any\nnetwork or endpoint indicators, leaving us with no access to actual samples.\n\nSo, the first question to answer was:How do you analyze a campaign without traditional\nindicators of compromise?\n\n## Let Me GUID You\n\nLet’s begin by introducing the components of a typical Genesis listing: the bot metadata,\nproviding context and data on the infected machine; and the data itself – showing the actual\nstolen credentials and associated details.\n\n\n-----\n\n_Figure 1: Typical bot listing on the Genesis market_\n\nNotably, Genesis obscures a significant property, which other actors selling infostealer data\nprovide: the infection type. While other markets and sellers clearly indicate which Trojan was\nused to source the stolen credentials, Genesis prefers white-labeling and rebranding data as\ntheir own.\n\n_Figure 2: A bot for sale on a different market, stating it was obtained using Vidar stealer_\n\n\n-----\n\nWith our main area of interest being the attributed stealer – the one data point Genesis\nactively hides – our methodology focused on trying to extrapolate the available data points.\nThe GUID, _module and infection date proved useful in answering that question._\n\n**Our preliminary assumption is that the bot name – the title of each Genesis bot – is a**\n**globally unique identifier, which we will refer to as the bot GUID. To put that into context,**\nnote the structure of the bot GUID in Figure 1: it’s composed of five alphanumerical octets\nseparated by hyphens. However, not all Genesis bots follow this distinct pattern; scanning\nthe website, we’ve identified several GUID structures. So, if each GUID structure is\n**associated with a particular malware, could we use the patterns to classify infection**\n**types?**\n\n_Figure 3: Genesis bots with different GUID patterns_\n\nTo answer that, we attempted to group all >335k Genesis bots scraped by KELA into\n**distinct GUID classes, based on the structure and syntax observed. We then assigned**\nevery GUID group to a malware, effectively mapping the Genesis malware supply chain. Our\nmethodology involved three steps:\n\n1. Mapping possible delimiters and splitting each GUID into tokens, accordingly;\n\n2. Mining seemingly meaningful strings from all tokens into a dictionary; and\n\n3. Classifying each GUID based on the length of the token in its GUID and whether an\nimportant string appears in any of the tokens.\n\n\n-----\n\n_Figure 4: KELA’s classification of different GUID patterns in Genesis_\n\n**Incorporating this methodology, we grouped all Genesis bots into 340 distinct GUID**\n**classes. That might seem like a major achievement, allowing us to map 340 different GUIDs**\nto known (or unknown!) information stealers. However, as can be seen in Figure 5, many of\nthe GUIDs share another syntactic feature: they end in “_20,” meaning that regardless of\nhow the raw GUID starts, it ends in 20 alphanumeric characters following an underscore.\n\n\n-----\n\n_Figure 5: Initial GUID classes: the grey ones are distinct and well-formed, while the pink ones are less_\n_distinct, and were later grouped based on secondary properties_\n\n## The Four GUIDers of the Apocalypse\n\nThis insight, along with the meaningful strings appearing in some GUIDs, quickly led us to\nrealize that these GUIDs are essentially a Windows machine name concatenated with a\nseemingly unique 20-character string. We refer to this class as {MACHINENAME}_20. This\ntweak to the classification methodology allowed us to group over 330 different GUIDs,\nresulting in four key structures across the entire Genesis dataset.\n\n\n-----\n\n_Figure 6: Breakdown of bot GUID structures_\n\nWith the four malware families classified and the number of infections accounted for, we\ncould decipher other meta-properties and make sense of how Genesis operates. Reviewing\ninfection classes over time suggests Genesis actors have been experimenting with\n**different** **Trojans: as seen in Figure 7, during its first year, Genesis only sold infections of**\n_{MACHINENAME}_20 class, and switched to 8-8-8-8-8 in late 2018, boosting the number of_\ninfected machines obtained by the actors.\n\n\n-----\n\n_Figure 7: Infection types (by GUID class) over time; dates indicate when the machine was infected_\n\nAnother interesting date was late 2019 when the 32 GUID class appeared on the market;\nGenesis actors might have considered introducing a new malware type into the market, but\neventually decided to revert to their leading product – the 8-8-8-8-8 class.\n\nArmed with these insights, we set to analyze the 8-8-8-8-8 class based on its ongoing\nubiquity. In our next post, we’ll dive into the 32 class, providing insights into its short rise and\nfall on the market, and explore the historical themes of the two remaining categories.\n\n## 88888, the Number of the GUID\n\nSeeing this pattern, our first suspect was AZORult infostealer, a malware that uses a\nsimilar GUID. However, it was circumstantial at best; we needed some hard evidence linking\nthe two.\n\n\n-----\n\n_Figure 8: AZORult’s GUID featuring the 8-8-8-8-8 structure (analyzed by Cylance)_\n\nLuckily, the cybercrime financial ecosystem is abundant with actors sharing samples of their\n“logs” – collections obtained via various malware types. We soon came across a prominent\nMaaS provider operating in a top-tier Russian cybercrime forum. Retrieving some of the data\nshared by the actor, we were able to find official AZORult logs – stolen credentials\nadvertised as having been obtained via AZORult – that share the same GUIDs as Genesis’\n**_8-8-8-8-8 category. That, along with corresponding metadata, confirmed the 8-8-8-8-8 class,_**\nwhich comprises over 90% of Genesis infections, is based on AZORult.\n\n_Figure 9: Genesis listing (top) and an AZORult log obtained from a prominent MaaS provider (bottom)_\n_sharing the same GUID and metadata, confirming the “8-8-8-8-8” Genesis GUIDs are indeed AZORult_\n\n\n-----\n\nOperating since 2016, AZORult is a commodity malware widely used by multiple threat\n[actors in numerous campaigns. While its author stopped maintaining the project in late 2018,](https://www.blueliv.com/cyber-security-and-cyber-threat-intelligence-blog-blueliv/research/azorult-crydbrox-stops-sells-malware-credential-stealer/)\n[AZORult is still widespread and used in active campaigns. AZORult’s source code was](https://www.cybereason.com/blog/the-hole-in-the-bucket-attackers-abuse-bitbucket-to-deliver-an-arsenal-of-malware)\n[readily available to numerous actors who modified the original, producing unofficial variants](https://securityaffairs.co/wordpress/82948/malware/azorult-c-variant.html)\nfor small-scale, independent campaigns. In the case of Genesis, this could mean actors\neither operate their own version of the stealer, resell infection from a MaaS provider, or both.\n\nGoing back to the AZORult log samples mentioned in Figure 9, we analyzed fifteen months’\nworth of records offered by the MaaS provider and found correlating GUIDs and over 10,000\n**such bots. These findings might indicate a supply chain link between Genesis and**\n**known cybercriminals, where actors monetize their campaigns by selling data to Genesis.**\n\n_Figure 10: Possible cooperation between Genesis and a MaaS provider offering access to AZORult-_\n_infected machines_\n\nNot only does Genesis use commodity malware for over 90% of its bots – the actors do so\nas part of a joint business venture with MaaS providers. This offers a glimpse into an\ninteresting aspect of the cybercrime sector: interactions and cooperation between actors. In\nthe case of Genesis, old **forum posts indicate they’re not entirely independent and are**\n\n\n-----\n\n**interested in gaining access to compromised machines. As can be seen in Figures 7**\nand 10, Genesis obviously found a supplier – most likely several – of infections they can\nutilize for credential-stealing purposes.\n\n_Figure 11: A post from the early days of the Genesis Store: “Asking you kindly, if you want to work with us,_\n_we need loads in big volumes. Topical infections of 5-10 a week will not do”_\n\nThe next parts of this research will dive deeper into the supply chain relations Genesis has\nwith at least one prominent MaaS provider, shedding light on cybercriminal business models.\n\n## The GUID, the Bad, and the Obvious\n\nIn the first part of our research, we focused on developing a methodology for continuous\nmonitoring of the Genesis Store – specifically supply-related trends. Analyzing the elements\nof one of today’s most prolific cybercrime outlets, we were able to link over 300,000\n**AZORult infections to Genesis – or at least to their providers. Behind these numbers are**\ndiverse victims: from SMBs to enterprises, from the private sector up to government officials.\n\nWhile the fact that a top-tier market uses one of the most popular stealers is hardly\nsurprising, our main point is this: Genesis actors are not going anywhere anytime soon,\n**so we might as well keep tabs on them. Gaining a better understanding of the threat, as**\nwell as demystifying it, is crucial in establishing KPIs for further monitoring. Only now – when\nwe have clear definitions of the necessary data points to extrapolate from the operations of\nGenesis actors – can we establish baseline metrics and measure when they’re being\ndisrupted. Adding new malware strains, utilizing new and different credential-stealing\nmodules, or shifting infection volumes can serve as threat indicators to improve awareness.\n\n\n-----\n\n**This is also our motivation for the upcoming parts of this research, where we will try to:**\n\nIdentify the three remaining GUID classes, linking them to known malware;\nDescribe the different stages of Genesis’ evolution, from inception to a top-tier provider\nof the cybercriminal underground;\nDeep dive into specific MaaS actors involved, both directly and indirectly, in the\nGenesis supply chain;\nExplore themes and trends in the MaaS industry and the broader cybercrime financial\necosystem, and their effects on consumers of threat intelligence;\nRefer to biases, traps and gaps in our methodology; and\nCome up with as many GUID-themed puns as possible.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-21 - Exploring the Genesis Supply Chain for Fun and Profit- Part 1 – Misadventures in GUIDology.pdf"
    ],
    "report_names": [
        "2020-02-21 - Exploring the Genesis Supply Chain for Fun and Profit- Part 1 – Misadventures in GUIDology.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536164,
    "ts_updated_at": 1743041316,
    "ts_creation_date": 1653714198,
    "ts_modification_date": 1653714198,
    "files": {
        "pdf": "https://archive.orkl.eu/3f6e70e68cdcf819abb78b39eab5594b46419e01.pdf",
        "text": "https://archive.orkl.eu/3f6e70e68cdcf819abb78b39eab5594b46419e01.txt",
        "img": "https://archive.orkl.eu/3f6e70e68cdcf819abb78b39eab5594b46419e01.jpg"
    }
}