{
    "id": "2c4aae9c-68eb-492a-89fe-cb6c755c3afb",
    "created_at": "2022-10-25T16:48:20.558984Z",
    "updated_at": "2025-03-27T02:17:11.61371Z",
    "deleted_at": null,
    "sha1_hash": "ec958b81f6d51eddea363ef6256e0d166fbd6269",
    "title": "Two Years of Pawn Storm Examining an Increasingly Relevant Threat",
    "authors": "",
    "file_creation_date": "2017-04-27T08:52:29Z",
    "file_modification_date": "2017-04-27T08:52:55Z",
    "file_size": 1347841,
    "plain_text": "# Two Years of Pawn Storm\n\n###### Examining an Increasingly Relevant Threat\n\n Feike Hacquebord\n\n Forward-Looking Threat Research (FTR) Team\n\n\n-----\n\nTREND MICRO LEGAL DISCLAIMER\n\nThe information provided herein is for general information\n\nand educational purposes only. It is not intended and\n\nshould not be construed to constitute legal advice. The\n\ninformation contained herein may not be applicable to all\n\nsituations and may not reflect the most current situation.\n\nNothing contained herein should be relied on or acted\n\nupon without the benefit of legal advice based on the\n\nparticular facts and circumstances presented and nothing\n\nherein should be construed otherwise. Trend Micro\n\nreserves the right to modify the contents of this document\n\nat any time without prior notice.\n\nTranslations of any material into other languages are\n\nintended solely as a convenience. Translation accuracy\n\nis not guaranteed nor implied. If any questions arise\n\nrelated to the accuracy of a translation, please refer to\n\nthe original language official version of the document. Any\n\ndiscrepancies or differences created in the translation are\n\nnot binding and have no legal effect for compliance or\n\nenforcement purposes.\n\nAlthough Trend Micro uses reasonable efforts to include\n\naccurate and up-to-date information herein, Trend Micro\n\nmakes no warranties or representations of any kind as\n\nto its accuracy, currency, or completeness. You agree\n\nthat access to and use of and reliance on this document\n\nand the content thereof is at your own risk. Trend Micro\n\ndisclaims all warranties of any kind, express or implied.\n\nNeither Trend Micro nor any party involved in creating,\n\nproducing, or delivering this document shall be liable\n\nfor any consequence, loss, or damage, including direct,\n\nindirect, special, consequential, loss of business profits,\n\nor special damages, whatsoever arising out of access to,\n\nuse of, or inability to use, or in connection with the use of\n\nthis document, or any errors or omissions in the content\n\nthereof. Use of this information constitutes acceptance for\n\nuse in an “as is” condition.\n\n\n### Contents\n\n#### 4\n\n##### False Flag Operations\n\n#### 8\n\n##### How Pawn Storm Attacks Free and Corporate Webmail\n\n#### 19\n\n##### Pawn Storm Phishing Campaigns\n\n#### 29\n\n##### Preferred Attacks, Resources, and Tools\n\n#### 37\n\n##### Conclusion and Defending Against Pawn Storm\n\n\n-----\n\nPawn Storm is an active cyber espionage actor group that has been very aggressive and ambitious in\n\nrecent years. The group’s activities show that foreign and domestic espionage and influence on geopolitics\n\nare the group’s main motives, and not financial gain. Its main targets are armed forces, the defense\n\nindustry, news media, politicians, and dissidents.\n\nWe can trace activities of Pawn Storm back to 2004[1], and before our initial report in 2014[2] there wasn’t\n\nmuch published about this actor group. However, since then we have released more than a dozen\n\ndetailed posts on Pawn Storm.[3] This new report is an updated dissection of the group’s attacks and\n\nmethodologies—something to help organizations gain a more comprehensive and current view of these\n\nprocesses and what can be done to defend against them.\n\nPawn Storm is becoming increasingly relevant particularly because it is doing more than just espionage\n\nactivities. In 2016, the group attempted to influence public opinion, to influence elections, and sought\n\ncontact with mainstream media with some success. Now the impact of these malicious activities can\n\nbe felt by various industries and enterprises operating throughout the world. Even average citizens of\n\ndifferent countries might be affected as Pawn Storm tries to manipulate people’s opinions about domestic\n\nand international affairs. The attacks of Pawn Storm may even serve as an example for other actors, who\n\ncould copy tactics and repurpose them to fit their own objectives.\n\nAs we look at Pawn Storm’s operations over a two-year period, we can see how the group has become\n\nmore adept at manipulating events and public opinion through the gathering and controlled release of\n\ninformation. Many events—like their involvement in the Democratic National Convention hack—have\n\nbeen covered extensively. The group’s cyber propaganda methods—using electronic means to influence\n\nopinion[4]—creates problems on multiple levels. Aside from manipulating the public, their operations also\n\ndiscredit political figures and disrupt the established media. The proliferation of fake news and fake\n\nnews accusations in 2017 can in part be attributed to constant information leaks and manipulations by\n\nmalicious actors. Media sources have already confirmed that Pawn Storm offered them exclusive peeks at\n\nhigh-impact information, presumably in an attempt to skew public perception on a certain topic or person.\n\nIn this paper, we take a deeper look at the facts we have compiled and delve into the variety of attacks\n\nthat the group is using. Pawn Storm is known for its sophisticated social engineering lures, efficient\n\ncredential phishing, zero days, a private exploit kit, an effective set of malware, false flag operations, and\n\ncampaigns to influence the public opinion about political issues.\n\nAt its core, Pawn Storm—also known as Sednit[5], Fancy Bear, APT28[6 7], Sofacy, and STRONTIUM[8]—is still\n\na persistent cyber espionage actor group. The actors often attack the same target from different sides,\n\nusing multiple methods to reach their goals. It generally relies on practiced techniques, specifically when\n\nit comes to phishing. Credential phishing has been a key part of many compromises done by Pawn Storm\n\nin recent years and we were the first to describe them in detail from 2014 and onwards.\n\nWe start this paper with a section on false flag operations and a rundown of Pawn Storm’s attempts\n\nto influence the public opinion. The second section focuses on different methods used to attack free\n\nand corporate webmail—mostly through sophisticated phishing tactics. The third section details Pawn\n\nStorm’s campaigns that we tracked over the years, and lists their intended targets. The next section\n\ncovers their preferred attacks, facilitators, and also their attitude towards their own operational security.\n\nAnd lastly, we give some guidelines on how to defend against Pawn Storm.\n\n\n-----\n\n## False Flag Operations\n\nPawn Storm uses a variety of tactics to collect information from their identified targets—often through\n\ncredential phishing. Some of the information is then leaked on websites that are specifically designed\n\nto display stolen data. More than once Pawn Storm disguised itself as “hacktivists” or whistleblowers\n\nmotivated by some agenda.\n\n##### Operating Under Alternative Fronts\n\nAfter Pawn Storm breached the World Anti-Doping Agency (WADA) and the Court of Arbitration for Sport\n\n(TAS-CAS) in 2016, a group that calls themselves the “Fancy Bears’ Hack team” posted medical records\n\nof athletes on their website (security company CrowdStrike uses “Fancy Bear” to identify Pawn Storm\n\nactors). The hack team claims they stood for “fair play and clean sport”, however, in reality they leaked\n\nconfidential medical records that were very likely stolen by Pawn Storm. This move could be meant as\n\nretaliation against the decision of WADA to block several athletes from the Olympics in Rio de Janeiro,\n\nBrazil. It could also be meant to weaken the position of WADA and influence the public opinion of doping\n\nincidents.\n\nIn 2015, US Army information was released on the site cyb3rc.com by a group calling itself the Cyber\n\nCaliphate. The group presented itself as pro-ISIS and suggested that they are an Islam-inspired terrorist\n\ngroup. In the same year, Cyber Caliphate claimed to have taken down the live broadcast of French TV\n\nstation TV5 for a number of hours. Pro-ISIS messages from the group also appeared on the Twitter and\n\nFacebook accounts of TV5. This was particularly painful for France, a country that was still in shock from\n\nterrorist attacks on the editors of Charlie Hebdo, a French satirical weekly magazine. However, it was later\n\nreported that the Cyber Caliphate was actually a front of Pawn Storm.\n\nFrench magazine L’Express shared indicators with us that clearly connected Cyber Caliphate to Pawn\n\nStorm, which French authorities later confirmed. The motives for the TV5 attack are still unclear. Of course,\n\nit is also possible that this attack was the work of undisciplined Pawn Storm actors. Though the Pawn\n\nStorm actors normally work in a professional way, there have been a few other incidents where some\n\nPawn Storm actors showed a lack of discipline.\n\n\n-----\n\n##### Maneuvers Used Against Political Organizations\n\nIn 2016 the Democratic National Committee (DNC) was allegedly hacked by Pawn Storm. Stolen emails\n\nwere published by WikiLeaks and a site called dcleaks[.]com, a domain very likely controlled by Pawn Storm.\n\nAfter the DNC hack became public, a lone hacker called Guccifer 2.0 claimed responsibility. He claimed\n\nto be Romanian (just like the real hacker Guccifer who was convicted in 2016 for compromising the email\n\naccounts of American business executives, political figures and celebrities), but while communicating\n\nwith the press, it appeared that Guccifer 2.0 was not fluent in Romanian at all.\n\nA study of ThreatConnect[9] showed that Guccifer 2.0 approached news media and offered them exclusive\n\naccess to password-protected parts of the dcleaks[.]com site. This specific site actually leaks email\n\nrepositories taken from mainly US Pawn Storm targets that have been victimized by the group’s advanced\n\nGmail credential phishing campaigns. We were able to collect a substantial amount of information on\n\nthe Gmail credential phishing campaigns of Pawn Storm from 2014 onwards (as we discuss in the How\n\nPawn Storm Attacks Free and Corporate Webmail section). This makes it very likely that Guccifer 2.0 is\n\na creation of the Pawn Storm actor group.\n\nMeanwhile, WikiLeaks, which has dubbed itself a “multi-national media organization and associated\n\nlibrary”, published emails from the DNC and the AK party of Turkish President Erdogan in 2016. We know\n\nthat the DNC received a wave of aggressive credential phishing attacks from Pawn Storm in March and\n\nApril 2016: during the campaign, dozens of politicians, DNC staff, speech writers, data analysts, former\n\nstaff of the Obama campaign, staff of the Hillary Clinton campaign, and even corporate sponsors were\n\ntargeted multiple times. Pawn Storm also used phishing campaigns against the Turkish government and\n\nparliament in early 2016. This makes it highly plausible that the emails published by WikiLeaks were\n\noriginally stolen by the Pawn Storm actor group.\n\n##### Utilizing Mainstream Media\n\nThere have been instances when Pawn Storm uses mainstream media to publicize their attacks and\n\ninfluence public opinion. Several media outlets have confirmed that they were offered exclusive access\n\nto data stolen by Pawn Storm. When the reputable German magazine Der Spiegel reported on doping in\n\nJanuary 2017,[10] Der Spiegel wrote they were in contact with the “Fancy Bear hackers” for months and that\n\nin December 2016 they received “several sets of data containing PDF and Word documents in addition to\n\nhundreds of internal emails from United States Anti-Doping Agency (USADA) and WADA, the World Anti\nDoping Agency.” This is a clear example where Pawn Storm successfully contacted mainstream media to\n\ninfluence the public opinion about a political topic.\n\n\n-----\n\nThe reports on the Democratic Congressional Campaign Committee (DCCC) being compromised,\n\npublished at end of July 2016, serve as another example. We discovered that the website was severely\n\ncompromised more than five weeks before it became public. All donations meant for dccc.org were first\n\nredirected to a site that was under Pawn Storm’s control—this means that the actors had the opportunity\n\nto compromise donors of the Democratic Party. At the time of discovery, the compromise was about\n\na week old and still live. We disclosed the compromise to US authorities responsibly and the problem\n\nwas addressed quickly. We did not publish our findings as a public report could actually benefit Pawn\n\nStorm by highlighting their capabilities and also impact the US elections. But then more than five weeks\n\nlater the compromise did make headlines. Pawn Storm possibly contacted mainstream media about the\n\ncompromise and, just like in other cases, offered “exclusive” access to stolen information.\n\n##### Phishing and Things Pawn Storm Can Do with the Data\n\nIn April and May 2016 Pawn Storm launched phishing campaigns against the German political party\n\nChristian Democratic Union (CDU) headed by Angela Merkel, which is also around the same time the\n\ngroup set up phishing sites against two German free webmail providers.[11] German authorities later\n\nconfirmed that this attack was the work of Pawn Storm. However it is unknown if they were successful or\n\nnot. No emails of CDU have been leaked yet, but in some instances Pawn Storm has waited for more than\n\na year before it started to leak stolen data. The timed release of information is one way a threat actor can\n\nmaximize the impact of their attack against a target.\n\nIn early 2016, Pawn Storm also set up credential phishing sites that targeted ministries of the Turkish\n\ngovernment and the Turkish parliament.[12] Another credential phishing site was set up to target the\n\nparliament of Montenegro in October 2016—this was likely the work of Pawn Storm as well.\n\nPawn Storm has also probably leaked stolen information via cyber-berkut[.]org. This is the website of an\n\nactor group posing as an activist group with a particular interest in leaking documents from the Ukraine.\n\nThe exact relation between Pawn Storm and CyberBerkut is unknown, but we have credible information\n\nthat CyberBerkut has published information which was stolen during Pawn Storm’s credential phishing\n\ncampaigns. Prior to leaking the information, parts of the documents and emails were allegedly altered.\n\nThe authenticity of leaked data is generally not verified, allowing threat actors to alter the stolen data to\n\ntheir own benefit and present it as real and unaltered. By publishing carefully selected pieces of unaltered\n\nstolen data, threat actors can even more effectively influence public opinion in a way that is aligned with\n\ntheir interests.\n\n\n-----\n\nThe incidents mentioned above show Pawn Storm’s interest in influencing politics in different countries.\n\nThis is not limited to the presidential elections in the US, but goes beyond that. Resourceful threat actors\n\nsuch as Pawn Storm can sustain long-term operations and leverage different attacks that can last for\n\nyears—such as credential phishing. The next sections will detail how credential phishing has been so\n\neffective for Pawn Storm.\n\n\n-----\n\n## How Pawn Storm Attacks Free and Corporate Webmail\n\n##### Credential Phishing\n\nCredential phishing is an effective tool in espionage campaigns. A lot of internet users are trained by\n\nexperience not to fall victim to phishing. They are trained to spot obvious grammar and spelling errors,\n\nuncommon domains in the phishing URLs and the absence of a secure, encrypted connection in the\n\nbrowser bar. However, professional actors have the resources to avoid simple mistakes and invent clever\n\nsocial engineering tactics. They send phishing emails in flawless English and other languages when\n\nneeded, and they have no problem evading spam filters.\n\nEssentially, credential phishing attacks have become an effective and dangerous tool that can have\n\nseverely damaging effects. In these attacks a huge amount of sensitive data might be stolen. Credential\n\nphishing also serves as the first step to penetrate deeper into the infrastructure of a target organization.\n\nSeveral attack scenarios are possible through credential phishing:\n\n  - silent data gathering over an extended period of time—Pawn Storm being a prime example since\n\nour data tracks them silently collecting information for more than a year\n\n  - compromised accounts are used to further penetrate into the network of a victim organization, for\n\nexample by sending emails using stolen identities\n\n  - leaking sensitive emails in order to cause harm to the victim organization and influence public\n\nopinion\n\n  - domestic espionage on citizens of nations\n\n\n-----\n\nUsing these simple, but oftentimes well-prepared credential phishing attacks, a group can collect an\n\nenormous amount of data. Pawn Storm is doing all of the above. In 2016 the group is believed to have\n\nstolen information from the DNC, Hillary Clinton’s campaign team, and WADA. They also launched\n\ncredential phishing attacks on numerous other organizations: armed forces, defense companies, media,\n\nand many others.\n\nIt is very likely that from July 2015 to August 2016, Pawn Storm had access to the Gmail account of Colin\n\nPowell, former United States Secretary of State under the George Bush administration. In September\n\n2016, more than one year after the initial compromise, dcleaks[.]com posted several of his personal\n\nemails online. This was just one of the many examples where Pawn Storm leaked confidential information,\n\nand it shows that some of the compromises span a lengthy period.\n\nRussian citizens—journalists, software developers, politicians, researchers at universities, and artists—\n\nare also targeted by Pawn Storm.[13] Several Russian media organizations (including mainstream media\n\ncorporations) and foreign embassies in Moscow are common targets too.\n\nPawn Storm has maintained long-running campaigns against high profile users of free international\n\nwebmail providers like Yahoo and Gmail; as well as webmail providers for Ukrainian internet users (Ukr.\n\nnet), and Russian users (Yandex and Mail.ru). Pawn Storm sets up phishing sites of other free webmail\n\nproviders for very specific targets only. We found Pawn Storm phishing domains for relatively small\n\nwebmail providers in Cyprus, Belgium, Italy, Norway, and other countries. Users of university webmail in\n\nEstonia and Russia were targeted as well. These were probably part of tailored attacks where Pawn Storm\n\nhad very specific and high profile targets in mind.\n\nThe credential phishing attacks against high profile Google, Yahoo and Ukr.net users are relatively\n\nvoluminous. We were able to collect thousands of phishing emails since early 2015. It was not continuous.\n\nPawn Storm sometimes paused activities, which they but then later on resumed. Some targets get multiple\n\nphishing emails in one week.\n\n##### Credential Phishing Attacks on Corporate Webmail\n\nAttacking corporate email makes a lot of sense for threat actors as email is one of the weakest points\n\nin the targets’ defense. In the last four years, Pawn Storm has launched numerous credential phishing\n\nattacks against the corporate email system of many organizations. Targets included armed forces,\n\ndefense industry, political parties, NGOs, media, and governments around the world. Breaching corporate\n\nemail accounts may lead threat actors to valuable, confidential data and it can be a stepping stone for\n\npenetrating deeper into the target organization.\n\n\n-----\n\nMany organizations allow their employees to read email while they are out of the office. While this greatly\n\nenhances user convenience, webmail introduces significant risks. Webmail that can be accessed from\n\nanywhere introduces an attack surface that can be probed not only through direct hacking, but also\n\nby advanced social engineering. While people might be used to less sophisticated credential phishing\n\nemails, advanced actors have shown remarkable creativity in their attacks and often they are fluent in\n\nforeign languages as well. For some of the attacks, victims cannot be blamed for falling for the social\n\nengineering tricks. We have seen phishing lures that are almost indistinguishable from legitimate emails.\n\nOne of the social engineering lures makes use of a form of tabnabbing, which is discussed below.\n\nHere are some considerations on the security of webmail:\n\n  - Two-factor authentication improves security, but it doesn’t make social engineering impossible. All\n\ntemporary tokens can be phished by an attacker.\n\n  - Even when two-factor authentication is used, an attacker only has to phish for the second\n\nauthentication token one or two times to get semi-permanent access to a mailbox. They can set\n\nup a forwarding address or a token that allows third party applications full access to the system.\n\n  - Mandatory logging in onto a company VPN network does raise the bar for an attacker. However,\n\nVPN credentials can also be phished, and we’ve seen targeted attackers specifically go after VPN\n\naccess credentials.\n\n  - Authentication with a physical security key makes credential phishing virtually impossible unless\n\nthe attacker has physical access to the equipment of the target. When a target uses a physical\n\nsecurity key, the attacker either has to find an exploit to get unauthorized access, or he has to get\n\nphysical access to the security key and the target’s laptop.\n\n  - To add to authentication methods that are based on what you know and what you have, one could\n\nadd authentication that is based on what you are: fingerprints or other biometric data. Biometrics\n\nhave already been used by some laptops and phone vendors, and have also been a common\n\nauthentication method in datacenters for more than a decade.\n\n\n-----\n\n##### Phishing Campaign Targets\n\nThis section lists some of the organizations that were targeted by Pawn Storm with a campaign that was\n\nspecifically set up for them. In many cases, only very few employees of these organizations were targeted.\n\n|Date|Organization|Phishing Domain|\n|---|---|---|\n|Military|||\n|12/12/13|Chilean military|mail.fach.rnil.cl|\n|05/15/14|Armenian military|mail.rnil.am|\n|10/23/14|Latvian military|web.mailmil.lv|\n|02/25/15|Romanian military|fortele.ro|\n|03/25/15|Danish military|webmail-mil.dk|\n|03/26/15|Portuguese military|webmail.exerclto.pt|\n|05/13/15|Greek military|webmail-mil.gr|\n|09/04/15|Danish military|fkit-mil.dk|\n|09/05/15|Saudi military|mail.rsaf.qov.sa.com|\n|10/16/15|United Arab Emirates army|mailmil.ae|\n|10/19/15|Kuwaiti military|mail.kuwaitarmy.gov-kw.com|\n|10/21/15|Romanian military|mail-navy.ro|\n|03/04/16|Bulgarian army|mail.armf.bg.message-id8665213.tk|\n|Ministry of Defense (MOD)|||\n|01/23/14|MOD Bulgaria|mail.arnf.bg|\n|02/11/14|MOD Poland|poczta.mon.q0v.pl|\n|04/04/14|MOD Hungary|mail.hm.qov.hu|\n|04/30/14|MOD Albania|mod.qov.al|\n|05/22/14|MOD Spain|mail.mod.qov.es|\n|11/18/14|MOD Afghanistan|mail.mod.qov.af|\n|09/05/15|MOD Saudi Arabia|mail.moda.qov.sa.com|\n|02/19/16|MOD Poland|poczta.mon-gov.pl|\n|Ministry of Foreign Affairs (MFA)|||\n|03/17/15|MFA South Georgia|email.mfa.qov.gs|\n|07/16/15|MFA Armenia|webmail-mfa.am|\n|10/02/15|MFA United Arab Emirates|webmail.mofa.qov.ae|\n|10/02/15|MFA United Arab Emirates|webmail.mfa.qov.ae|\n|12/10/15|MFA Qatar|mail.mofa.g0v.qa|\n\n\n-----\n\n|Date|Organization|Phishing Domain|\n|---|---|---|\n|Intelligence Units|||\n|01/10/14|National Security Bulgaria|dansa.bg|\n|Defense Industry|||\n|04/24/14|Academi|mail.academl.com|\n|04/24/14|Boston Dynamics|mail.bostondynamlcs.com|\n|08/11/14|Science Applications International Corporation (SAIC)|webmail-saic.com|\n|09/10/14|Polski Holding Obronny|mailpho.com|\n|Media|||\n|11/01/14|New York Times|privacy-yahoo.com|\n|12/01/14|New York Times|link.candybober.info|\n|01/22/15|Buzzfeed|account.password-google.com|\n|06/22/15|The Economist Intelligence Unit|accounts.g00qle.com|\n|08/24/15|Sanoma Media|mobile-sanoma.net|\n|02/24/16|Hurriyet|posta-hurriyet.com|\n|03/14/16|Anadolu Agency|anadolu-ajansi.com|\n|03/15/16|Anadolu Agency|mail.anadoluajansi.web.tr|\n|05/11/16|Hurriyet|webmail-hurriyet.com|\n|06/12/16|Hurriyet|mail-hurriyet.com|\n|11/14/16|Al Jazeera|account-aljazeera.net|\n|11/14/16|Al Jazeera|ssset-aljazeera.net|\n|11/15/16|Al Jazeera|sset-aljazeera.net|\n|11/16/16|Al Jazeera|sset-aljazeera.com|\n|11/21/16|Al Jazeera|mail-aljazeera.net|\n|Political Parties|||\n|03/01/15|National Democratic Institute|url.googlesetting.com|\n|04/01/15|National Democratic Institute|login.accoounts-google.com|\n|01/12/16|Prime Minister Turkey|e-post.byegm.web.tr|\n|01/12/16|Prime Minister Turkey|mail.byegm.web.tr|\n|02/01/16|Prime Minister Turkey|eposta.basbakanlik.qov.web.tr|\n|02/01/16|Parliament Turkey|e-posta.tbmm.qov.web.tr|\n|03/01/16|Democratic Party US|myaccount.google.com- securitysettingpage.gq|\n\n\n-----\n\n|Date|Organization|Phishing Domain|\n|---|---|---|\n|04/01/16|Democratic Party US|myaccount.google.com- changepasswordmyaccount- idx8jxcn4ufdmncudd.gq|\n|04/22/16|CDU|webmail-cdu.de|\n|05/06/16|CDU|support-cdu.de|\n|06/06/16|Democratic Party US|actblues.com|\n|10/20/16|Parliament Montenegro|mail-skupstina.me|\n|03/15/17|Emmanuel Macron campaign|onedrive-en-marche.fr|\n|04/05/17|Konrad Adenauer Stiftung|kasapp.de|\n|Religion|||\n|06/19/15|Orthodox Church America|accounts.g00qle.com|\n|Academics|||\n|03/04/16|Tartu University|mail.university-tartu.info|\n|09/13/16|Baikal State University|mail-isea.ru|\n|Government Agencies|||\n|05/24/15|Government of Montenegro|mail-gov.me|\n|09/14/15|Safety Board Netherlands|vpn.onderzoekraad.nl|\n|09/28/15|Safety Board Netherlands|sftp.onderzoekraad.nl|\n|09/29/15|Department of Civil Aviation Malaysia|mail.dca.qov.my|\n|11/03/15|Government of Montenegro|mail.g0v.me|\n|Energy Sector|||\n|12/10/14|Westing House Nuclear|webmail.westinqhousenuclear.com|\n|International Organisations|||\n|06/18/14|Organization for Security and Co- operation in Europe (OSCE)|login-osce.org|\n|04/23/15|Partnership for Peace Information Management System|mail-pims.org|\n|08/03/16|World Anti-Doping Agency (WADA)|mail.wada-awa.org|\n|08/08/16|World Anti-Doping Agency (WADA)|inside.wada-arna.org|\n|08/08/16|Tribunal Arbitral du Sport (TAS, Court of Arbitration for Sport)|tas-cass.org|\n\n\nTable 1. List of targeted organizations and specific sites set up to target said entities\n\n\n-----\n\n##### Tabnabbing in Credential Phishing\n\nTabnabbing is a term that was originally introduced by researcher Aza Raskin.[14] He describes the attack\n\nas follows: a URL in an open tab of the browser is changed to a phishing site when simple JavaScript\n\ndetects that the user has moved on to another tab or is inactive for some time. When the target believes\n\nthat the phishing site is the real login site of the internet service he was using, he might reenter his\n\ncredentials on the phishing site.\n\nThe trick exploits internet users’ habit of keeping several tabs open in their browser for an extended\n\nperiod of time. Many services like online banking require reentering credentials after a certain period of\n\ninactivity so the user might be familiar with this routine.\n\nPawn Storm has been using a variant of tabnabbing.[15] In this attack scenario, the target gets an email\n\nsupposedly coming from a website he might be interested in—maybe from a conference he is likely to visit\n\nor a news site he has subscribed to. The email has a link to a URL that looks very legitimate. When the\n\ntarget reads his email and clicks on the link, it will open in a new tab. This new tab will show the legitimate\n\nwebsite of a conference or news provider after being redirected from a site under the attackers’ control.\n\nThe target is likely to spend some time browsing this legitimate site. Distracted, he probably did not notice\n\nthat just before the redirection, a simple script was run, changing the original webmail tab to a phishing\n\nsite. When the target has finished reading the news article or conference information on the legitimate site,\n\nhe returns to the tab of his webmail. He is informed that his session has expired and the site needs his\n\ncredentials again. He is then likely to reenter his password and give his credentials away to the attackers.\n\nThis attack scenario is very simple and doesn’t require any exploit. Its success depends on good\n\npreparation by the attacker, but even experienced security researchers could fall for this social engineering\n\ntrick, in particular when they are on the road and not paying attention to details.\n\nIn Table 2 we show some examples of organizations that have been targeted with credential phishing\n\nattacks that made use of this tabnabbing trick.\n\n|Target Organization|Phishing domain|Malicious Domain (Social Lure)|Real Domain|\n|---|---|---|---|\n|Academi|mail.academl.com|tolonevvs.com|tolonews.com|\n|Armed forces Latvia|mailmil.lv|tusexpo2015.com|tusexpo.com|\n|imperialconsult.com|mail.imperialc0nsult.com|skidkaturag.com|skidkatur.com|\n|MOD Hungary|mail.hm.qov.hu|aadexpo2014.co.za|adexpo.co.za|\n|MOD Hungary|mail.hm.qov.hu|itec2014.co.uk|itec.co.uk|\n|MOD Hungary|mail.hm.qov.hu|sofexjordan2014.com|sofexjordan.com|\n\n\n-----\n\n|Target Organization|Phishing domain|Malicious Domain (Social Lure)|Real Domain|\n|---|---|---|---|\n|MOD Hungary|mail.hm.qov.hu|eurosatory2014.com|eurosatory.com|\n|MOD Spain|mail.mod.qov.es|gdforum.net|gdforum.org|\n|National Security Bulgaria|mail.dansa.bg|counterterorexpo.com|counterterrorexpo.com|\n|National Security Bulgaria|mail.dansa.bg|novinitie.com|novinite.com|\n|National Security Bulgaria|mail.dansa.bg|standartnevvs.com|standartnews.com|\n|OSCE|login-osce.org|vice-news.com|news.vice.com|\n|SAIC|webmail-saic.com|natoexhibitionff14.com|natoexhibition.org|\n|Yahoo users|us6-yahoo.com|us6-yahoo.com|youtube.com|\n\n\nTable 2. Organizations that were targeted in 2014 with credential phishing that made use of\n\nthe tabnabbing trick\n\nFigure 1. A target clicks on a link in an email and is redirected to a legitimate news site\n\nthat will likely hold his interest\n\n\n-----\n\nFigure 2. Simple Javascript that is run on the Pawn Storm-controlled website, just before the user is\n\nredirected to the legitimate news site.\n\nThe JavaScript is not malicious and will point the URL in the parent window to a credential phishing site.\n\nFigure 3. The credential phishing site that was opened in the browser by the tabnabbing trick\n\nThe phishing site is practically indistinguishable from the original webmail site apart from one typo in the\n\ndomain. The target is very likely to fall victim to the attack.\n\n\n-----\n\n##### Compromising DNS settings\n\nIn another simple but dangerous attack scenario against corporate email systems, the DNS settings\n\nof the mail servers are compromised and changed to point to a foreign server. It is not an unknown\n\nscenario, as even reputable companies have had their DNS settings compromised in the past. Often\n\nthese compromises are done by hackers who want some media attention either for themselves or for a\n\nspecific cause. These hacks are detected quickly and undone quickly, especially if the hackers are just\n\nseeking media attention. They simply put up a “hah, you are hacked” message or something similar on the\n\nhijacked domain. A more advanced attacker can apply the same kind of tricks, but as quietly as possible.\n\nWhen an attacker gets DNS admin credentials, he can modify the zone file of a domain name (note that\n\nreputable registrars offer enhanced security and changes to zone files have to be confirmed by a DNS\n\nadmin over the phone). By changing the MX record of a domain to point to a proxy IP address he controls,\n\nan attacker can receive all incoming email.\n\nThe proxy can be set up to forward all incoming email to the real, actual receiving email server of the\n\ntarget. This allows the attacker to read all metadata of incoming emails, as well as the contents of any\n\nemail that isn’t encrypted. While this kind of attack is not advanced in nature it can have devastating\n\nconsequences. We know of a Ministry of Foreign Affairs in an Eastern European country that had the MX\n\nrecord of their domain compromised by Pawn Storm for many months.\n\nWe warned the Ministry of Foreign Affairs about the compromise, but the process wasn’t that\n\nstraightforward. All of the email communications of the ministry couldn’t be trusted and we did not trust\n\nin the safety of their phone system either. As a solution, we first contacted a CERT contact in Europe by\n\nphone. We described the issue and sent the details in a PGP-encrypted email to the Western European\n\nCERT. The CERT sent a secure message to an embassy in the affected country. The embassy decrypted\n\nand printed the email. After that, a courier gave the message to the Ministry of Foreign Affairs and the\n\nissue was addressed and resolved.\n\n\n-----\n\n1\n\n\n2\n\n\n5\n\n\nThe CERT sent a secure\nmessage to the embassy\n\n\n4\n\n\n6\n\n\nThe message was\ndecrypted and printed by\nthe embassy\n\n\n3\n\n\nThe printed message was\nbrought to the MFA by\ncourier\n\n\nFigure 4. How Trend Micro warned the MFA about the discovered compromise\n\nThis attack scenario shows how important it is for organizations to use reputable DNS providers and\n\nregistrars only, and to lock down their domain registration so that they don’t get hijacked easily.\n\nIn the past there was at least one other instance where the DNS settings of a government institution in a\n\nWest African country were compromised by Pawn Storm for a couple of months.\n\n\n-----\n\n## Pawn Storm Phishing Campaigns\n\n##### Credential Phishing Campaigns\n\nPawn Storm is constantly trying to get access to the mailboxes of high profile users of free webmail\n\nservices. We know of dozens of campaigns, each targeting up to thousands of high profile individuals.\n\nThe social engineering lures used in the campaigns vary in quality, but some lures can be particularly\n\ndangerous.\n\nIn this section we show a couple of these attacks. We collected credential phishing emails that were sent\n\nby Pawn Storm to a handful of high profile Yahoo accounts from January 2015 to December 2016. The\n\ndiagram below shows the distribution of more than 160 credential phishing attacks that were sent to these\n\nhigh profile Yahoo users.\n\n\n-----\n\nFigure 5. Distribution of Pawn Storm’s 160 credential phishing attacks\n\nThe diagram shows that Pawn Storm took a long break during the holidays at the end of 2015. However,\n\nfrom mid-November to mid-December 2015, Pawn Storm was particularly active with credential phishing\n\nagainst high profile targets. Within this period, Pawn Storm was using a particularly dangerous and\n\neffective method of credential phishing we will discuss below.\n\n\n-----\n\nA serious compromise of a target organization can start with this relatively simple credential phishing\n\nemail:\n\nFigure 6. Email requesting installation of malicious application “Google Defender”\n\n\n-----\n\nThe email poses as an advisory from Gmail to install an “official” application called “Google Defender”.\n\nNormally an internet user will be wary of installing applications he did not ask for. In this particular case\n\nhowever, a click on the link will lead to a page on Google.com that looks like this:\n\nFigure 7. A legitimate-looking “Google Defender” page asking for email access permissions\n\nAt first sight this might look like a legitimate service of Google: the URL is hosted on the legitimate domain\n\naccounts.google.com, and the communication with this website is encrypted like usual. The average\n\ninternet user might actually be convinced this is all legitimate. However, despite being on accounts.\n\ngoogle.com, the application doesn’t belong to Google. It is a third party application made by Pawn Storm.\n\nIn this social lure Open Authentication (OAuth), an open authentication standard, is abused. Below we will\n\nexplain in more detail what OAuth is normally used for.\n\n\n-----\n\nSimilar attacks from Pawn Storm targeted high profile Yahoo users. For example in one of the late-2015\n\ncampaigns McAfee Email Protection was offered:\n\nFigure 8. A phishing attack targeting high profile Yahoo users\n\nClicking on the phishing link would lead the target to a URL on the legitimate Yahoo domain api.login.\n\nyahoo.com. Here the user is asked to turn on “McAfee email protection” that would protect the user\n\nagainst various threats. If this offer is accepted, Pawn Storm actors would have full access to his email.\n\nThis lure is similar to the one that was used against Gmail users. It is particularly dangerous as most\n\ninternet users might not realize the applications are not endorsed and carefully checked by their email\n\nprovider.\n\n\n-----\n\nFigure 9. Pawn Storm lure for Open Authentication abuse created for Yahoo users at the end of 2015\n\nThis social engineering lure makes use of an authorization method called Open Authentication (OAuth).\n\nOAuth is a way of authorizing third party applications to login to users’ online accounts for free webmail\n\nand other services. The big advantage is that users don’t have to reveal their password to the third party.\n\nInstead the third party applications get a token that can be used for authentication.\n\nOAuth is great for the users’ experience on the web. For example, by allowing social networks to access\n\nyour webmail contact list, it is easier to find friends who are subscribed to the same social network.\n\nAnother popular use for OAuth is merging different free webmail accounts into one email account.\n\nWhile OAuth offers convenience and useful applications, it also exposes the user to risks. In particular\n\nit allows for advanced social engineering schemes that take advantage of it, particularly when no good\n\nbackground checks are done for applications that are authorized by service providers to use OAuth. For\n\nsome free webmail services an email address and a website is enough to allow a third party application to\n\nuse OAuth. Because of that, OAuth abuse is straightforward and actor groups like Pawn Storm are taking\n\nadvantage of OAuth for credential phishing schemes.\n\nThese attacks can have the same negative consequences as traditional credential phishing, even when\n\nno credentials are given away. The scheme is quite simple:\n\n  - an actor creates and signs up a rogue application with an online service provider—like a free\n\nwebmail provider that supports OAuth\n\n  - the application passes the (basic) security checks the online service provider does to confirm\n\nwhether the application is legitimate\n\n  - the actor now sends out emails to targets with a social engineering lure that would trick the\n\nrecipients into allowing OAuth authentication for the rogue application\n\n\n-----\n\n  - the target might be familiar with generic phishing emails, but not so much with OAuth abuse tricks.\n\nChances are significant that even well-educated targets get fooled\n\n  - once OAuth access has been authorized, the target account can be accessed until the user or the\n\nprovider revokes the token. If the target changes his password, the actor can still use the OAuth\n\ntoken to access the mailbox. In this case the target might have a false sense of security.\n\nWe informally spoke with two large webmail providers that allow OAuth authentication by third party\n\napplications. As a result of our informal talks, one webmail provider has changed the way new applications\n\nare authorized to use OAuth. New applications have to go through a more thorough check before they\n\ncan use OAuth. For this provider we noticed that since late 2015 Pawn Storm stopped sending phishing\n\nlures that abuse OAuth. Instead Pawn Storm went back to plain old credential phishing, which is generally\n\nless efficient.\n\n##### Spear-Phishing Campaigns\n\nPawn Storm tries to snare targets using spear-phishing emails that have a malicious attachment or emails\n\nthat link to an exploit URL. The spear-phishing emails are usually about a recent event covered in the\n\nnews that is likely to be of interest to the targets. Pawn Storm often uses the exact same headlines from\n\nrecent news reports seen on media sites like CNN, Al Jazeera, Huffington Post, Military Times and many\n\nothers.\n\n\n4\n\n\n6\n\n\n2\n\n\nFlash exploit\n(CVE-2016-7855)\n\n\n5\n\n\n3\n\n\nWindows privilege\nescalation exploit\n\n(CVE-2016-7255)\n\n\n1\n\n\nPayload\n\n\nFigure 10. Typical infection chain of Pawn Storm’s spear-phishing campaigns\n\n\n-----\n\nIn 2015 and 2016 Trend Micro blocked dozens of these spear-phishing campaigns against high profile\n\ncustomers. Below we list some of the spear-phishing emails that contained a link to the private exploit kit\n\nof Pawn Storm, as well as the date and email subject line used.\n\n|Date|Subject line|\n|---|---|\n|02/03/15|Pro-Russian rebels launch new offensive|\n|03/18/15|NATO’s role in conventional arms control|\n|03/25/15|Open Skies Consultative Commission|\n|03/26/15|News: Exercise Ramstein Dust I 2015 is underway in Italy|\n|04/01/15|News: Yemen air strikes kill 23 in factory: residents|\n|04/01/15|National Armaments Directors|\n|04/01/15|Heavy clashes on Saudi-Yemeni border|\n|04/06/15|North Korea declares no-sail zone, missile launch seen as possible - reports|\n|04/06/15|What does Russia’s President Putin really want?|\n|04/06/15|Ukraine Today: Russian-backed militants appeal to Merkel|\n|04/06/15|Ambassador of Ukraine to Jordan Dr. SergiyPasko held talks with Director of the European Department of the MFAE of Jordan Mr. Daifallah al-Fayez|\n|04/08/15|Petro Poroshenko congratulated Muhammadu Buhari on his election as President of the Federal Republic of Nigeria|\n|04/15/15|News: Obama, in ‘therapeutic’ meetings with U.S. Jewish leaders, stresses how much he cares|\n|04/21/15|China, Japan and South Korea hold renewed talks|\n|04/22/15|News: Foreign Ministry denies any suspected incidence of corruption in Tunisia’s embassy in Amman|\n|04/30/15|News: Tragedy in Nepal|\n|05/05/15|News: Chimerica in Decline?|\n|05/07/15|Diplomatic Access: The United States|\n|05/12/15|News: Can China and the EU Cooperate on International Security?|\n|05/13/15|News: Kerry: Now is ‘Critical Moment’ for Ukraine Conflict|\n|05/15/15|Russian soldiers quit over Ukraine|\n|05/20/15|Foreign Minister Szijjarto: NATO must respond to new threats|\n|06/17/15|Ambassadors RSG Wolfsbos bezoeken Europees Parlement|\n|06/19/15|Pew Survey: Irredentism Alive and Well in Russia|\n|07/03/15|For Your Information: Latest from OSCE Special Monitoring Mission (SMM) to Ukraine|\n|07/08/15|For Your Information: Latest from OSCE Special Monitoring Mission(SMM) to Ukraine|\n\n\n-----\n\n|Date|Subject line|\n|---|---|\n|07/09/15|For Your Information: ANNUAL MEETING & EXPOSITION 12-14 October 2015|\n|07/09/15|Iran nuclear deal: Snapping back sanctions|\n|07/10/15|CNN Politics:What the Iran deal is really about|\n|07/23/15|NATO Won’t Establish Permanent Military Bases In Poland Amid Russia Tension, US Diplomat Says|\n|08/27/15|Russia to increase wheat supplies to Egypt, says Putin|\n|09/08/15|Iraq Puts New F-16s Into Action Against ISIS Jihadists|\n|09/09/15|Bulgaria Bars Syria-Bound Russian Planes as NATO Fears Grow|\n|09/16/15|Russia gives Assad firepower, spurring US strategy adjustment|\n|09/17/15|Burkina Faso: an attempted coup?|\n|09/18/15|Croatia closes road border crossings with Serbia after migrant influx|\n|09/21/15|US, Russian Defense Heads Talk about Syrian Military Buildup|\n|09/21/15|Tsipras returns as PM in decisive Greek election|\n|09/22/15|Foreign Information Policy|\n|09/22/15|THE FIGHT AGAINST ISIS|\n|09/22/15|Despite Attention to Islamic State, Al-Qaida May Be Bigger Threat|\n|09/23/15|US military reports 75 US-trained rebels return to Syria|\n|09/24/15|Assad is Moscow’s pawn in regional power stakes|\n|09/24/15|Russia Warns of Response to Reported US Nuke Buildup in Turkey|\n|10/01/15|Russia rejects claims its ‘anti-sisl’ airstrikes hitcivilians and other rebels|\n|10/05/15|Israel launches airstrikes on targets in Gaza|\n|10/12/15|Suicide car bomb targets NATO troop convoy in Kabul|\n|10/12/15|Syrian troops make gains as Putin defends air strikes|\n\n\nTable 3. Spear-phishing campaigns by Pawn Storm in 2015, data from Trend Micro’s Smart\n\nProtecting Network\n\nThe subject lines clearly indicate that Pawn Storm uses recent newsworthy events to encourage victims\n\nto click. Though these are targeted attacks, some of the campaigns are relatively noisy and have been\n\nfrequently deployed from 2015 to 2016. Most of the attacks were not widely reported in media, but some\n\ndid make it to the news.\n\nIn 2016, awareness grew due the amount of research that was published by Trend Micro and other\n\ninternet security vendors. For example in September 2016 several major German newspapers published\n\nstories of German politicians that were being attacked by Pawn Storm in August 2016. We can confirm\n\nthat Trend Micro saw spear-phishing emails sent by Pawn Storm using German political themes as social\n\n\n-----\n\nengineering lures. However these emails were part of a much bigger campaign with targets in many other\n\ncountries as well. The spear-phishing campaigns as reported in the German media were actually not that\n\nuncommon, but almost business as usual for the Pawn Storm actors. Still, it shows that in 2016 the actors\n\nshowed a clear interest in compromising political organizations.\n\nThough some of the spear-phishing emails are relatively noisy, Pawn Storm is careful with how they infect\n\ntheir targets. First of all, the exploit URLs are specific for every victim—each has a parameter that is unique\n\nto the particular target. In case a target clicks on an exploit URL, he will first get fingerprinted with invasive\n\nJavaScript code that is not malicious by itself. The JavaScript will upload information like the operating\n\nsystem version, language settings, browser plugins, and time zone of the target’s computer to the exploit\n\nserver. Depending on the fingerprinting results, the exploit server might give back an old exploit, a zero\nday, or a social engineering lure.[16] In a lot of cases nothing will happen, apart from a redirection to a benign\n\nnews site that has an article related to the social engineering lure of the spear-phishing email. The use of\n\na zero-day will also depend on how valuable that zero-day still is to Pawn Storm. Once the zero-day gets\n\ndiscovered and a fix is underway, its value in the attack portfolio will be devalued.\n\nIn 2016 we witnessed that during the interval of a Windows privilege escalation vulnerability being\n\ndisclosed and then patched, Pawn Storm ramped up its operations and targeted a broader range of\n\ngovernmental personnel. The group used the just-patched Flash zero-day and the still open Windows\n\nprivilege escalation vulnerability.[17]\n\nEven when a target does get infected with malware, he will first get relatively simple first stage malware\n\ninstalled. This gives Pawn Storm another chance to learn whether a target is worth a deeper probe. If the\n\ntarget is interesting enough, the actor will install second stage components like X-Agent and X-Tunnel.\n\nAfter this, Pawn Storm might try to penetrate deeper into the network infrastructure, so that it can control\n\nmore nodes in the victim’s network.\n\nIn 2016, Pawn Storm started to use RTF and other Office documents embedded with a Flash file. The\n\nFlash file will upload information on the targets’ system to a remote server. We have witnessed that the\n\nremote server may respond with a chain of exploits, zero-days and privilege escalation that will infect the\n\ntarget’s computer. This kind of infection chain was first described by Palo Alto Network researchers and\n\ndubbed Dealers Choice.[18]\n\n\n-----\n\n## Preferred Attacks, Resources, and Tools\n\n##### Watering Hole Attacks\n\nPawn Storm has compromised websites that targets are likely to visit. For this kind of attack, the actors\n\nhave to wait and see who will visit the compromised sites. On these compromised sites, Pawn Storm\n\ncan choose to inject scripts that will serve their objectives. We have seen instances where Pawn Storm\n\ninjected the so-called Browser Exploitation Framework (BeEF)[19] exploit on legitimate websites. In other\n\ncases, links were inserted that would lead to Pawn Storm’s private exploit kit.\n\nLike the name already suggests BeEF works from the browser to attack internet users. BeEF is used by\n\nlegitimate penetration testers and it is very invasive. The framework includes many modules, including\n\ntools for reconnaissance, social engineering and active exploitation of vulnerabilities.\n\nBeEF is particularly useful to an attacker when the target doesn’t close inactive tabs in his internet browser.\n\nWhen an internet user opens a browser tab and visits a website that has been compromised to link to a\n\nBeEF exploit URL, the attacker has ample time to do reconnaissance and try out different attacks until\n\nthe browser tab gets closed. These attacks may include social engineering attacks, grabbing passwords,\n\nand exploiting vulnerabilities.\n\nWe have seen that the website of a Ukrainian defense company was compromised to link to a BeEF\n\nexploit on a remote server. Visitors of the defense company’s website are likely to be interesting targets to\n\nPawn Storm, and might have been exposed to various attacks. An injection of a BeEF exploit happened\n\nto the websites of some Ministries of Foreign Affairs in Europe and Africa as well.\n\nEarlier in 2014, Pawn Storm compromised Polish government sites and the website of the Power Exchange\n\nin Poland. Visitors to the websites were exposed to Pawn Storm’s private exploit kit.\n\n\n-----\n\nAnd as we previously mentioned, in June 2016 Pawn Storm compromised the website of the DCCC.\n\nAnyone donating money via dccc.org would be redirected to a Pawn Storm-controlled site. Pawn Storm\n\npossibly intended to compromise donors of the Democratic Party in the US and to spy on them. However\n\nwe have not been able to confirm the exact infection chain.\n\n##### Zero-Days\n\nPawn Storm is known to have used several zero-days.[20] For example, at the end of October 2016 Pawn\n\nStorm was identified as using a Flash zero-day together with a privilege escalation in Windows. Soon after\n\nthe Flash vulnerability (CVE-2016-7855) was patched, Pawn Storm started to make the most out of these\n\npartially patched zero-days by exposing more targets to them. On October 28, 2016 a relatively noisy\n\ncampaign was launched that sent several RTF documents to targets.\n\nFigure 11. A Pawn Storm spear-phishing email with an RTF document\n\nThe RTF document has a Flash file embedded in it that is a simple downloader. We saw that it first\n\ndownloaded an encrypted Flash exploit (CVE-2016-7855) from a remote server. Then it downloaded a\n\nsecond file that crashed Microsoft Word. In other reported cases the second file was a first stage payload\n\nof Pawn Storm.\n\n\n-----\n\nIn July 2015 Trend Micro discovered a Java zero-day that was exploited together with a privilege escalation\n\nthat evades the click to play protection in Java.\n\nAPR\n2015\n\n**CVE-2015-3043**\n\nApril 14 **CVE-2015-1701**\n\nFlash zero-day May 12\n\nprivilege escalation Windows\nkernel\n\nMAY\n2015\n\n**CVE-2015-2590**\n\nJuly 14 **CVE-2015-1701**\n\nJava zero-day July 14\n\nJUL2015 Microsoft Office zero-day\n\n**CVE-2015-7645**\n\n**CVE-2015-4902**\n\nOctober 16\n\nFlash zero-day OCT2015 October 20\n\nprivilege escalation Java\n\n**CVE-2016-7855**\n\nOCT\n\nOctober 26 2016\n\nFlash zero-day\n\n**CVE-2016-7255[21]**\n\nNovember 8\n\nprivilege escalation Windows\nkernel\n\nNOV\n2016\n\nFigure 12. Zero-days that are believed to have been used by Pawn Storm exclusively\n\nbefore they were patched\n\nApart from these zero-days, Pawn Storm was also quick to use other vulnerabilities that were disclosed\n\nin the leaks of Hacking Team.\n\n##### Second Stage C&C Servers\n\nWe were able to keep track of the live second stage C&C servers from late 2013 until today. At the end of\n\n2013 there were about five live X-Agent C&C servers. In early October 2016, we counted 26 live X-Agent\n\nC&C servers. This is a strong indication that Pawn Storm has been very active in 2016.\n\n\n-----\n\nAnother local peak was in the fall of 2014, possibly because around that time Trend Micro’s first paper on\n\nPawn Storm was published and the actor group made changes to their infrastructure.\n\n30\n\n15\n\n0\n\nOCT 2014 APR JUL OCT 2015 APR JUL OCT 2016 APR JUL OCT 2017\n\nFigure 13. Tracking the number of live X-Agents C&Cs from Oct 2013 to Feb 2017\n\nAround the Christmas holidays of 2016, the number of live X-Agents C&Cs slightly increased to 27. In\n\nJanuary 2017 the number peaked at 28 live X-Agent IP addresses. Pawn Storm did not take a long break\n\nduring the 2016 holidays. Right after Christmas, on December 26 2016, we saw Pawn Storm recommence\n\ntheir spear-phishing campaign. In January 2017, the usual credential phishing also continued.\n\n##### Facilitators\n\nPawn Storm has a clear preference for certain webhosting providers and registrars. This preference is\n\nsometimes so specific that newly set up domains can be spotted before they are even used in attacks. In\n\nrecent months, however, Pawn Storm’s use of IP ranges is getting more diverse and parts of their activity\n\nhave become more difficult to track.\n\nGenerally speaking, Pawn Storm uses the internet infrastructure in well-connected countries like the\n\nUS, UK, France, Netherlands, Latvia, Romania and Germany. In these countries, the national intelligence\n\nservices could probably easily and legally intercept connections to Command and Control servers, sources\n\nof (spear) phishing emails, and Pawn Storm’s exploit sites that are set up in their country. Encryption and\n\nTLS in both web traffic and email traffic will limit the usefulness of these legal intercepts, though.\n\n\n-----\n\nFor example, for sending credential phishing emails Pawn Storm probably doesn’t have to worry about\n\nauthorities unless the authorities have access to the servers that are sending the emails. In the table below\n\nwe illustrate the infrastructure that was used by Pawn Storm to send out Yahoo credential phishing emails\n\nin 2015. As far as we are aware, for all of 2015, Pawn Storm only used one IP address in Germany and\n\none in Netherlands to send out the phishing emails.\n\nDate Sender IP Server Name Backend IP Server Name\n\nJan-15 80.255.3.94 ubuntu 46.166.162.90 Henry-PC\n\nFeb-15 80.255.3.94 ubuntu 46.166.162.90 Henry-PC\n\nFeb-15 193.169.244.35 security.service-facebook.com 46.166.162.90 Henry-PC\n\nMar-15 80.255.3.94 ubuntu 46.166.162.90 Henry-PC\n\nMar-15 193.169.244.35 security.service-facebook.com 46.166.162.90 Henry-PC\n\nApr-15 193.169.244.35 security.service-facebook.com 46.166.162.90 Henry-PC\n\nApr-15 193.169.244.35 security.service-facebook.com 46.183.217.74 Henry-PC\n\nMay-15 193.169.244.35 security.service-facebook.com 46.183.217.74 Henry-PC\n\nJun-15 80.255.3.94 set121.com 46.183.217.74 Henry-PC\n\nJul-15 80.255.3.94 set121.com 46.183.217.74 Henry-PC\n\nAug-15 193.169.244.35 security.service-facebook.com 46.183.217.74 Henry-PC\n\nSep-15 80.255.3.94 set121.com 46.183.217.74 Henry-PC\n\nOct-15 193.169.244.35 security.service-facebook.com 46.183.217.74 Henry-PC\n\nNov-15 193.169.244.35 security.service-facebook.com 46.183.217.74 Henry-PC\n\nWINNov-15 193.169.244.35 security.service-facebook.com 185.82.202.102\n17MK2DLAHLN\n\nNov-15 80.255.3.94 exua.email N/A N/A\n\nNov-15 193.169.244.35 security.service-facebook.com 87.121.52.145 Hans-PC\n\nDec-15 193.169.244.35 security.service-facebook.com 87.121.52.145 Hans-PC\n\nWINDec-15 193.169.244.35 security.service-facebook.com 185.82.202.102\n17MK2DLAHLN\n\nTable 4. Infrastructure used in 2015 by Pawn Storm to send credential phishing emails to high profile\n\nYahoo users\n\n|Date|Sender IP|Server Name|Backend IP|Server Name|\n|---|---|---|---|---|\n|Jan-15|80.255.3.94|ubuntu|46.166.162.90|Henry-PC|\n|Feb-15|80.255.3.94|ubuntu|46.166.162.90|Henry-PC|\n|Feb-15|193.169.244.35|security.service-facebook.com|46.166.162.90|Henry-PC|\n|Mar-15|80.255.3.94|ubuntu|46.166.162.90|Henry-PC|\n|Mar-15|193.169.244.35|security.service-facebook.com|46.166.162.90|Henry-PC|\n|Apr-15|193.169.244.35|security.service-facebook.com|46.166.162.90|Henry-PC|\n|Apr-15|193.169.244.35|security.service-facebook.com|46.183.217.74|Henry-PC|\n|May-15|193.169.244.35|security.service-facebook.com|46.183.217.74|Henry-PC|\n|Jun-15|80.255.3.94|set121.com|46.183.217.74|Henry-PC|\n|Jul-15|80.255.3.94|set121.com|46.183.217.74|Henry-PC|\n|Aug-15|193.169.244.35|security.service-facebook.com|46.183.217.74|Henry-PC|\n|Sep-15|80.255.3.94|set121.com|46.183.217.74|Henry-PC|\n|Oct-15|193.169.244.35|security.service-facebook.com|46.183.217.74|Henry-PC|\n|Nov-15|193.169.244.35|security.service-facebook.com|46.183.217.74|Henry-PC|\n|Nov-15|193.169.244.35|security.service-facebook.com|185.82.202.102|WIN- 17MK2DLAHLN|\n|Nov-15|80.255.3.94|exua.email|N/A|N/A|\n|Nov-15|193.169.244.35|security.service-facebook.com|87.121.52.145|Hans-PC|\n|Dec-15|193.169.244.35|security.service-facebook.com|87.121.52.145|Hans-PC|\n|Dec-15|193.169.244.35|security.service-facebook.com|185.82.202.102|WIN- 17MK2DLAHLN|\n\n\n-----\n\nIn 2016 Pawn Storm started to use legitimate email providers like GMX and Yandex to send out credential\n\nphishing emails from VPN servers like IPVanish. Actual data communication to C&C servers like X-Agent\n\nwill be encrypted and this means that exfiltrated data cannot be read unless a decryption algorithm is\n\navailable. Pawn Storm clearly doesn’t care that intelligence services might have some visibility on the\n\nidentities of the victimized targets.\n\nThis becomes even more apparent when we realize that a lot of the X-Agent C&Cs are live for several\n\nmonths. Averaged over 3 years of data, X-Agent C&Cs are live for 6 months. Ten of the X-Agent C&Cs\n\nwere live for more than 12 months. This shows that Pawn Storm is somewhat brazen: the actors don’t\n\nreally care if they get caught at some point. You could consider this bad operational security, however it\n\nalso indicates the difficulties targets face when defending against the Pawn Storm actors. In a lot of the\n\nattacks the actors get what they were after anyway.\n\nThe graph below shows the distribution of second stage X-Agent C&C servers to each country from\n\nNovember 2013 until February 2017. It clearly illustrates the distribution of live C&C servers averaged\n\nover a 3 year period.\n\nCanada\n\n**4%** Netherlands Germany Romania\n\n**14%** **9%** **1%**\nLatvia\n\n**15%**\n\nUnited Kingdom\n\nUnited States **15%**\n\n**22%** France\n\n**12%**\n\nItaly\n\n**2%**\n\n**3%**\n\nBulgaria\n\nFigure 14. Distribution of live X-Agent C&C servers averaged over a 3 year period\n\n\n-----\n\n##### Operational Security\n\nOperational security is defined as the precautions that actors take to hide their activities and whereabouts.\n\nThe operational security of Pawn Storm is quite remarkable, since for many of its operations it has\n\nbecome apparent that hiding activities is not always a high priority for the Pawn Storm actors. However,\n\nactions of Pawn Storm cannot easily be attributed to nicknames or profiles in the underground. For many\n\ncybercriminal groups at least some nicknames from the underground are known, but not so with this\n\ngroup. The identities of the individual Pawn Storm actors seem to be protected very well. Pawn Storm\n\nhas a clear preference for some hosting providers, DNS service providers, and domain registrars. By\n\nmonitoring these service providers, it can be relatively easy for a researcher to spot new infrastructure\n\nthat is being set up. In this way, a lot of Pawn Storm’s infrastructure can be discovered early—sometimes\n\neven before the attacks have actually started.\n\nThere is another side of this apparent lack of operational security though. Pawn Storm is also using\n\nanonymous registration of domains, and in certain cases they choose very different providers. Attacks\n\nusing this infrastructure might easily get overlooked and not attributed to Pawn Storm.\n\nMoreover, the preferred service providers of Pawn Storm give the actors good anonymity, one reason\n\nbeing these providers usually accept Bitcoin as payment. Pawn Storm makes good use of webhosting\n\nproviders in Western countries that offer privacy to their customers. We don’t know for sure whether\n\nthese hosting companies are knowingly providing services to cyber criminals and cyber spies, perhaps\n\nat premium rates. However some of the webhosting companies have had ties with so called Bulletproof\n\nhosting providers in the past. We actually described an example of a hosting provider in the Netherlands\n\nin a 2016 article.[22] We witnessed that Pawn Storm makes extensive use of VPN servers to connect to free\n\nwebmail providers and then send out spear-phishing emails to their targets. Some of the C&C servers may\n\njust relay traffic to intermediate proxies and thus relay stolen data back to the actual backend servers over\n\nmore than one hop. Just a couple of proxy nodes will greatly enhance operational security and anonymity\n\nof the actors.\n\nEven when the infrastructure of Pawn Storm gets discovered quickly, vast amounts of data might have\n\nalready been exfiltrated to a foreign computer server before the target is aware something is happening.\n\nThere are several examples of infections and compromises that were discovered after months, and even\n\nafter more than a year in some cases.\n\n\n-----\n\nThe vast majority of the campaigns Pawn Storm is doing would interest intelligence services around the\n\nworld. Investigations by normal police will usually lead nowhere as the problem of espionage[23] can only be\n\naddressed at higher political levels and not by criminal investigations. Communications between different\n\nlaw enforcement agencies are not always optimal within one country and between different countries.\n\nThis can imply that agency X in a country may know about an attack by Pawn Storm in its country or\n\nanother country, but is unable to inform the target in a timely manner. This further adds to the success of\n\nactors like Pawn Storm.\n\nIt is not unthinkable that the Pawn Storm actors actually appreciate it when researchers dissect and write\n\nabout their operations (after they have achieved their goal anyway). These articles are likely to be picked\n\nup by mass media, which the actors may consider as free publicity of their capabilities and the media\n\nreports might also be damaging to the affected target organizations. Normal cybercriminals often don’t\n\nlike media attention and even suspend their activities temporarily when their actions are discovered and\n\nwritten about. Pawn Storm doesn’t slow down at all. On the contrary: a lot has been written about Pawn\n\nStorm since fall of 2014, and their activities have only grown, both in aggressiveness and number.\n\n\n-----\n\n## Conclusion and Defending Against Pawn Storm\n\nThis closer look at the activities, operational capacity, and tactics of Pawn Storm gives a comprehensive\n\npicture of the group’s real motives and capabilities. With a clear understanding of the trends that Pawn\n\nStorm is following, along with their history and past operations, hopefully potential victims and targets can\n\nproperly address this threat. This last section is dedicated to defending against Pawn Storm.\n\nProtecting yourself against an attacker like Pawn Storm is a challenge. They have resources that allow\n\nthem to run lengthy campaigns over years, and seem to be single-minded in their pursuit of their targets.\n\nWe’ve seen how the group’s credential phishing tactics work to ensnare even the most savvy webmail\n\nusers, and how sophisticated their attacks look. Pawn Storm has used several zero-days in 2015 and\n\n2016. They also have well-established tactics, from using tabnabbing to compromising DNS settings,\n\ncreating watering holes and advanced social engineering. And they have no trouble finding new ways to\n\nabuse technology.\n\nPawn Storm attacks from many different sides, and dedicate more of their resources when they identify\n\na worthwhile target. Successfully repelling numerous attacks is not a guarantee; only one has to succeed\n\nfor the attackers to achieve their goal.\n\nHowever, there are some things you can do to raise the level of your defenses:\n\n1. Minimize your attack surface—systems that do not need to be exposed to the open internet\n\nshouldn’t be.\n\n2. Require remote workers to use the corporate VPN to access your systems.\n\n3. Minimize the number of domain names you maintain and centralize email servers.\n\n4. Prevent DNS hijacking of your domains. Work with reputable registrars only, or those that allow for\n\ntwo-factor authentication of your DNS administrator account. Lock your domain at the registrar to\n\nfurther raise the bar for unauthorized changes to your domains. For example you could choose to\n\n\n-----\n\nlet your registrar call back your authorized DNS administrator to double check whether changes to\n\nDNS zones really have to be made.\n\n5. Enforce two-factor authentication for corporate webmail, or a better option would be to require\n\nauthentication by means of a physical (USB) security key.\n\n6. Educate employees on securing their private free webmail and social media accounts too, and\n\ndon’t let them use those accounts for work purposes.\n\n7. When your employees travel overseas or attend conferences, let them take a clean loan computer\n\nwith them. Wipe the data from the computer and do a fresh OS install after the trip.\n\n8. Outsourced services can be compromised too, use only reputable third-party services.\n\n9. Educate workers about email system and/or email account best practices: specifically, don’t store\n\nsensitive information in email boxes without encryption and don’t send sensitive information by\n\nemail without encryption.\n\n10. Let a reputable company do penetration testing of your network regularly. Include social engineering\n\nin these tests.\n\n11. Keep software updated and patched.\n\n\n-----\n\n##### References\n\n1. TrendLabs. (22 July 2004). _Trend Micro Threat Encyclopedia. “TROJ_SCONATO.A”. Last accessed 08 Match 2017._ [http://](http://www.trendmicro.com/vinfo/us/threat-encyclopedia/archive/malware/troj_sconato.a)\n[www.trendmicro.com/vinfo/us/threat-encyclopedia/archive/malware/troj_sconato.a.](http://www.trendmicro.com/vinfo/us/threat-encyclopedia/archive/malware/troj_sconato.a)\n\n2. L.Kharouni, F. Hacquebord, N.Huq, J. Gogolinski, F.Mercês, A.Remorin, D. Otis. (22 October 2014). Trend Micro. “Operation\n[Pawn Storm: Using Decoys to Evade Detection.” Last accessed on 12 March 2017. http://www.trendmicro.com/cloud-content/](http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-operation-pawn-storm.pdf)\n[us/pdfs/security-intelligence/white-papers/wp-operation-pawn-storm.pdf.](http://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-operation-pawn-storm.pdf)\n\n3. TrendLabs. (16 January 2016). Trend Micro. “Operation Pawn Storm: Fast Facts and the Latest Developments.” Last accessed\n[on 20 February 2017. https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-pawn-storm-fast-facts.](https://www.trendmicro.com/vinfo/us/security/news/cyber-attacks/operation-pawn-storm-fast-facts)\n\n4. [TrendLabs. (10 March 2017). Trend Micro. “Cyber propaganda 101”. Last accessed 13 March 2017. https://www.trendmicro.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/cyber-propaganda-101)\n[com/vinfo/us/security/news/cybercrime-and-digital-threats/cyber-propaganda-101.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/cyber-propaganda-101)\n\n5. [Eset researchers. (20 October 2016). ESET. “Dissection of Sednit Espionage Group”. Last accessed 17 March 2017. https://](https://www.eset.com/int/about/newsroom/research/dissection-of-sednit-espionage-group/)\n[www.eset.com/int/about/newsroom/research/dissection-of-sednit-espionage-group/.](https://www.eset.com/int/about/newsroom/research/dissection-of-sednit-espionage-group/)\n\n6. FireEye Threat Intelligence (27 October 2014). FireEye. “APT28: A Window into Russia’s Cyber Espionage Operations?“ Last\n[accessed 16 March 2017. https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-apt28.pdf.](https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-apt28.pdf)\n\n7. R. Benchea, C. Vatamanu, A. Maximciuc, V. Luncaşu. _Bit Defender. “APT28 Under the Scope: A Journey into Exfiltrating_\n[Intelligence and Government Information.” Last accessed 13 March 2017. http://download.bitdefender.com/resources/media/](http://download.bitdefender.com/resources/media/materials/white-papers/en/Bitdefender_In-depth_analysis_of_APT28%E2%80%93The_Political_Cyber-Espionage.pdf)\n[materials/white-papers/en/Bitdefender_In-depth_analysis_of_APT28%E2%80%93The_Political_Cyber-Espionage.pdf.](http://download.bitdefender.com/resources/media/materials/white-papers/en/Bitdefender_In-depth_analysis_of_APT28%E2%80%93The_Political_Cyber-Espionage.pdf)\n\n8. Security Intelligence Microsoft. (16 November 2015). TechNet Microsoft. “Microsoft Security Intelligence Report: Strontium”.\n[Last accessed 15 March 2017. https://blogs.technet.microsoft.com/mmpc/2015/11/16/microsoft-security-intelligence-report-](https://blogs.technet.microsoft.com/mmpc/2015/11/16/microsoft-security-intelligence-report-strontium)\n[strontium.](https://blogs.technet.microsoft.com/mmpc/2015/11/16/microsoft-security-intelligence-report-strontium)\n\n9. ThreatConnect Research Team. (12 August 2016). ThreatConnect. “Does a Bear Leak in the Woods?” Last accessed 3 March\n[2017. https://www.threatconnect.com/blog/does-a-bear-leak-in-the-woods/.](https://www.threatconnect.com/blog/does-a-bear-leak-in-the-woods/)\n\n10. R. Buschmann, L. Eberle, C. Henrichs and G. Pfeil. (15 January 2017). Der Spiegel. “Inside the Desperate Battle against Sports\nDoping”. Last accessed 16 March 2017. [http://www.spiegel.de/international/world/sports-doping-and-the-difficult-fight-to-](http://www.spiegel.de/international/world/sports-doping-and-the-difficult-fight-to-prevent-it-a-1129918.html)\n[prevent-it-a-1129918.html.](http://www.spiegel.de/international/world/sports-doping-and-the-difficult-fight-to-prevent-it-a-1129918.html)\n\n11. Feike Hacquebord. (11 May 2016). Trend Micro. “Pawn Storm Targets German Christian Democratic Union”. Last accessed 13\nMarch 2017. [http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-targets-german-christian-democratic-](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-targets-german-christian-democratic-union/)\n[union/.](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-targets-german-christian-democratic-union/)\n\n12. Feike Hacquebord. (7 March 2016). Trend Micro. “Pawn Storm Campaign Adds Turkey To Its List of Targets”. Last accessed 10\n[March 2017. http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-adds-turkey-list-targets/.](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-adds-turkey-list-targets/)\n\n13. Feike Hacquebord. (18 August 2015). _Trend Micro. “Pawn Storm’s Domestic Spying Campaign Revealed; Ukraine and US_\n[Top Global Targets”. Last accessed 13 March 2017. http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storms-](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storms-domestic-spying-campaign-revealed-ukraine-and-us-top-global-targets/)\n[domestic-spying-campaign-revealed-ukraine-and-us-top-global-targets/.](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storms-domestic-spying-campaign-revealed-ukraine-and-us-top-global-targets/)\n\n[14. AzaRaskin. Aza Rask.in. “Tabnabbing: A New Type of Phishing Attack.” Last accessed on, 7 March 2017. http://www.azarask.](http://www.azarask.in/blog/post/a-new-type-of-phishing-attack/)\n[in/blog/post/a-new-type-of-phishing-attack/.](http://www.azarask.in/blog/post/a-new-type-of-phishing-attack/)\n\n15. Feike Hacquebord. (24 October 2014). _Trend Micro. “Operation Pawn Storm: Putting Outlook Web Access Users at Risk”_\nLast accessed 15 Febuary 2017. [http://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-putting-](http://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-putting-outlook-web-access-users-at-risk/)\n[outlook-web-access-users-at-risk/.](http://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-putting-outlook-web-access-users-at-risk/)\n\n\n-----\n\n16. Feike Hacquebord. (16 April 2015). Trend Micro. “Operation Pawn Storm Ramps Up its Activities; Targets NATO, White House”\n[Last accessed 16 March 2017. http://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-ramps-up-](http://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-ramps-up-its-activities-targets-nato-white-house/)\n[its-activities-targets-nato-white-house/.](http://blog.trendmicro.com/trendlabs-security-intelligence/operation-pawn-storm-ramps-up-its-activities-targets-nato-white-house/)\n\n17. Feike Hacquebord, Stephen Hilt. (9 November 2016). Trend Micro. “Pawn Storm Ramps Up Spear-phishing Before Zero-Days\n[Get Patched” Last accessed 17 March 2017. http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-ramps-](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-ramps-up-spear-phishing-before-zero-days-get-patched/)\n[up-spear-phishing-before-zero-days-get-patched/.](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-ramps-up-spear-phishing-before-zero-days-get-patched/)\n\n18. Robert Falcone, Bryan Lee. (17 October 2016). Research Center Paolo Alto Networks. “‘Dealers Choice’ is Sofacy’s Flash Player\n[Exploit Platform”. Last accessed 2 March 2017. http://researchcenter.paloaltonetworks.com/2016/10/unit42-dealerschoice-](http://researchcenter.paloaltonetworks.com/2016/10/unit42-dealerschoice-sofacys-flash-player-exploit-platform/)\n[sofacys-flash-player-exploit-platform/.](http://researchcenter.paloaltonetworks.com/2016/10/unit42-dealerschoice-sofacys-flash-player-exploit-platform/)\n\n19. The Browser Exploitation Framework Project. Last accessed 8 March 2017. http://beefproject.com/.\n\n20. Brooks Li, Feike Hacquebord. (11 July 2015). Trend Micro. “Pawn Storm Update: Trend Micro Discovers New Java Zero-Day\n[Exploit” Last accessed 16 March 2017. http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-update-trend-](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-update-trend-micro-discovers-new-java-zero-day-exploit/)\n[micro-discovers-new-java-zero-day-exploit/.](http://blog.trendmicro.com/trendlabs-security-intelligence/pawn-storm-update-trend-micro-discovers-new-java-zero-day-exploit/)\n\n21. Jack Tang. (2 December 2016). Trend Micro. “One Bit To Rule A System: Analyzing CVE-2016-7255 Exploit In The Wild” Last\naccessed 20 February 2017. [http://blog.trendmicro.com/trendlabs-security-intelligence/one-bit-rule-system-analyzing-cve-](http://blog.trendmicro.com/trendlabs-security-intelligence/one-bit-rule-system-analyzing-cve-2016-7255-exploit-wild/)\n[2016-7255-exploit-wild/.](http://blog.trendmicro.com/trendlabs-security-intelligence/one-bit-rule-system-analyzing-cve-2016-7255-exploit-wild/)\n\n22. Feike Hacquebord. (21 April 2016). Trend Micro. “Looking Into a Cyber-Attack Facilitator in the Netherlands.” Last accessed\n15 March 2017. [http://blog.trendmicro.com/trendlabs-security-intelligence/looking-into-a-cyber-attack-facilitator-in-the-](http://blog.trendmicro.com/trendlabs-security-intelligence/looking-into-a-cyber-attack-facilitator-in-the-netherlands/)\n[netherlands/.](http://blog.trendmicro.com/trendlabs-security-intelligence/looking-into-a-cyber-attack-facilitator-in-the-netherlands/)\n\n[23. Roman Dobrokhotov. (8 November 2016). Aljazeera. “Under surveillance in Russia.” Last accessed12 March 2017. http://www.](http://www.aljazeera.com/indepth/opinion/2016/11/surveillance-russia-161107133103258.html)\n[aljazeera.com/indepth/opinion/2016/11/surveillance-russia-161107133103258.html.](http://www.aljazeera.com/indepth/opinion/2016/11/surveillance-russia-161107133103258.html)\n\n\n-----\n\nCreated by:\n\nThe Global Technical Support and R&D Center of TREND MICRO\n\nTREND MICRO[TM]\n\nTrend Micro Incorporated, a global cloud security leader, creates a world safe for exchanging digital information with its Internet content security and\n\nthreat management solutions for businesses and consumers. A pioneer in server security with over 20 years experience, we deliver top-ranked client,\n\nserver, and cloud-based security that fits our customers’ and partners’ needs; stops new threats faster; and protects data in physical, virtualized, and\n\ncloud environments. Powered by the Trend Micro™ Smart Protection Network™ infrastructure, our industry-leading cloud-computing security technology,\n\nproducts and services stop threats where they emerge, on the Internet, and are supported by 1,000+ threat intelligence experts around the globe.\n\nFor additional information, visit www.trendmicro.com.\n\nwww.trendmicro.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://documents.trendmicro.com/assets/wp/wp-two-years-of-pawn-storm.pdf"
    ],
    "report_names": [
        "wp-two-years-of-pawn-storm.pdf"
    ],
    "threat_actors": [
        {
            "id": "afb851c4-b2e8-40e3-ac37-c55d8c0ab3cd",
            "created_at": "2022-10-25T16:07:23.516432Z",
            "updated_at": "2025-03-27T02:02:09.841372Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [
                "Kiberberkut"
            ],
            "source_name": "ETDA:Cyber Berkut",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "268479f9-6666-488e-a41e-14593ed4c2f7",
            "created_at": "2023-01-06T13:46:38.614508Z",
            "updated_at": "2025-03-27T02:00:02.873733Z",
            "deleted_at": null,
            "main_name": "Cyber Berkut",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Berkut",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ea4f255b-346d-4907-a801-1f797a99d4b0",
            "created_at": "2023-01-06T13:46:38.693529Z",
            "updated_at": "2025-03-27T02:00:02.893459Z",
            "deleted_at": null,
            "main_name": "Cyber Caliphate Army",
            "aliases": [
                "UUC",
                "CyberCaliphate",
                "Islamic State Hacking Division",
                "CCA",
                "United Cyber Caliphate"
            ],
            "source_name": "MISPGALAXY:Cyber Caliphate Army",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1493283149,
    "ts_modification_date": 1493283175,
    "files": {
        "pdf": "https://archive.orkl.eu/ec958b81f6d51eddea363ef6256e0d166fbd6269.pdf",
        "text": "https://archive.orkl.eu/ec958b81f6d51eddea363ef6256e0d166fbd6269.txt",
        "img": "https://archive.orkl.eu/ec958b81f6d51eddea363ef6256e0d166fbd6269.jpg"
    }
}