{
    "id": "2c73bb39-36c2-4f6b-bf77-b9bd12ffb668",
    "created_at": "2023-01-12T15:02:43.485507Z",
    "updated_at": "2025-03-27T02:13:58.373835Z",
    "deleted_at": null,
    "sha1_hash": "ccb1bfb80f48e8f677074e75052ea0f8a30d721f",
    "title": "2021-11-09 - THREAT ANALYSIS REPORT- From Shatak Emails to the Conti Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T16:05:28Z",
    "file_modification_date": "2022-05-28T16:05:28Z",
    "file_size": 1501424,
    "plain_text": "# THREAT ANALYSIS REPORT: From Shathak Emails to the Conti Ransomware\n\n**[cybereason.com/blog/threat-analysis-report-from-shatak-emails-to-the-conti-ransomware](https://www.cybereason.com/blog/threat-analysis-report-from-shatak-emails-to-the-conti-ransomware)**\n\nWritten By\nCybereason Global SOC Team\n\nNovember 9, 2021 | 9 minute read\n\n\n-----\n\nThe Cybereason Global Security Operations Center (GSOC) issues Cybereason Threat Analysis reports to\ninform on impacting threats. The Threat Analysis reports investigate these threats and provide practical\nrecommendations for protecting against them.\n\nIn this Threat Analysis report, the GSOC investigates recent attack campaigns that reflect the current\ndevelopments of the ITG23 threat group (also known as the TrickBot Gang or Wizard Spider). The ITG23 group is\npartnering with the TA551 (Shathak) threat group to distribute ITG23’s TrickBot and BazarBackdoor malware,\nwhich malicious actors use to deploy ITG23’s Conti ransomware on compromised systems.\n\n## Key Findings\n\n**Beware of Shathak Emails: In** [partnership with the ITG23 threat group, the Shathak threat group](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\ndistributes ITG23’s TrickBot and BazarBackdoor malware as password-protected archive files\nattached to phishing emails. The archive files contain malicious documents whose macros download\nand execute the TrickBot or BazarBackdoor malware. Malicious actors actively use this malware to\ndeploy ITG23’s Conti ransomware on compromised systems.\n**Average Two Days Time-to-Ransom (TTR): Conti actors do not deploy ransomware immediately**\nafter initial infection using the TrickBot or BazarBackdoor malware—the actors first conduct other\nactivities, such as reconnaissance, credential theft, and data exfiltration. We observed an average\nTTR of approximately two days after initial infection.\n**Detected and Prevented: The** [Cybereason Defense Platform detects and prevents infections that use](https://www.cybereason.com/platform)\nthe TrickBot and BazarBackdoor malware that the Shathak threat group distributes, as well as\nmalicious activities that Conti actors conduct.\n**Cybereason Managed Detection and Response (MDR): The Cybereason GSOC has zero tolerance**\ntowards attacks that involve ransomware, such as the Conti ransomware, and categorizes such\n[attacks as critical, high-severity incidents. The Cybereason GSOC MDR team issues a](https://www.cybereason.com/services/managed-detection-response-mdr)\ncomprehensive report to customers when such an incident occurs. The report provides an in-depth\noverview of the incident, which helps to scope the extent of compromise and the impact on the\ncustomer’s environment. In addition, the report provides attribution information when possible, as well\nas recommendations for mitigating and isolating the threat.\n\n## Introduction\n\nThe threat group TA551, also known as Shathak, is an email-based malware distributor that distributes malware\n[through phishing emails. Shathak has distributed a variety of malware, predominantly malware with information-](https://unit42.paloaltonetworks.com/ta551-shathak-icedid/)\nstealing capabilities, such as Ursniff and Valak in 2020, and the IcedID malware after mid-July 2020.\n\nIn October 2021, the IBM X-Force [reported that the threat group ITG23, also known as the TrickBot Gang or](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\nWizard Spider, had partnered with Shathak at some time around July 2021 to distribute the TrickBot and the\nBazarBackdoor (also referred to as BazarLoader) malware. ITG23 develops and maintains TrickBot and\nBazarBackdoor. TrickBot and BazarBackdoor can deploy additional malware on compromised systems. TrickBot\nis a feature-rich and modular malware that has been present on the threat landscape since 2016.\n\nThe implementation of TrickBot has evolved over the years, with recent versions of TrickBot implementing\nmalware-loading capabilities. TrickBot has played a major role in many attack campaigns conducted by different\nthreat actors, from common cybercriminals to nation-state actors. These campaigns have often involved the\n[deployment of ransomware such as the Ryuk ransomware.](https://www.cybereason.com/blog/triple-threat-emotet-deploys-trickbot-to-steal-data-spread-ryuk-ransomware)\n\n[Since March 2021, malicious actors have been using TrickBot and BazarBackdoor to deploy the Conti](https://www.sentinelone.com/labs/conti-unpacked-understanding-ransomware-development-as-a-response-to-detection/)\nransomware on compromised systems. The ITG23 threat group originally developed and now maintains the Conti\nransomware. ITG23 uses the [ransomware-as-a-service (RaaS) model, according to which the developers of the](https://www.cybereason.com/blog/what-is-ransomware-as-a-service-and-how-does-it-work)\nransomware pay the operators of the ransomware a wage for a successful attack, or a percentage of ransom\npayments.\n\n\n-----\n\nConti actors, or [Conti ransomware operators, have proven to be a substantial threat by compromising](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)\norganizations where IT outages can have life-threatening consequences, such as hospitals and law enforcement\nagencies. In September 2021, the US Cybersecurity and Infrastructure Security Agency (CISA) and the US\n[Federal Bureau of Investigation (FBI) reported that more than 400 Conti ransomware attacks had taken place on](https://us-cert.cisa.gov/ncas/alerts/aa21-265a)\nU.S. and international organizations. Conti actors frequently use a double extortion tactic: if the victim refuses to\npay for data decryption, the malicious actor threatens to leak the data or sell it for profit.\n\nThis report discusses recent attack campaigns that reflect the current developments of ITG23 partnering with\nShathak to distribute the TrickBot and BazarBackdoor malware, which malicious actors use to deploy the Conti\nransomware on compromised systems. To this end, the report first provides an overview of a system infection\nusing the TrickBot or BazarBackdoor malware that the Shathak group distributes, based on recent Shatak\nmalware distribution campaigns that we analyzed.\n\nThe report then discusses Conti actor activities that are common across recent Conti actor attack campaigns that\nwe analyzed. We focus on activities that Conti actors conduct after establishing a foothold in a system using\n[BazarBackdoor or TrickBot and before ransomware deployment. A previous report by the Cybereason Nocturnus](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)\nteam documents the execution of the Conti ransomware.\n\n## Analysis\n\n### A Successful Partnership: Shathak and the TrickBot Gang\n\nThe figure below depicts a typical infection using the ITG23’s TrickBot or the BazarBackdoor malware that the\nShathak group distributes:\n\n_A typical infection using the TrickBot or the BazarBackdoor malware_\n\nThe Shathak group distributes TrickBot and BazarBackdoor through malicious documents, such as Microsoft\nWord documents. Shathak stores malicious documents in password-protected archive files and attaches the\narchive files to phishing emails. A typical malicious document contains a macro, which a user can execute by\nopening the document and enabling macro execution.\n\n\n-----\n\nThe macro drops a Microsoft Hypertext Markup Language (HTML) Applications (HTA) file on the file system and\nthen executes the file using the mshta.exe Windows utility. Malicious actors use mshta.exe to execute malicious\nHTA files and bypass application control solutions that do not account for the malicious use of the Windows utility.\n\nAn HTA file that we analyzed, named boxDeling.hta, has two main components: a base-64 encoded code stored\nin the <div> section of the boxDeling.hta file with an ID of mainSetDel, and a VBScript script that executes the\nencoded code:\n\n_A macro in a malicious Microsoft Word document executes an HTA file as seen in the Cybereason Defense_\n_Platform_\n\n\n-----\n\n_The content of  boxDeling.hta: base-64 encoded code and a VBScript script that executes the encoded code_\n\nThe base-64 encoded code is a JavaScript script that the malicious actors have obfuscated by using the string\nreversal technique. The JavaScript script conducts the following activities:\n\nContacts the attacker-controlled endpoint airloweryd.com, located in Germany, and downloads the\nTrickBot malware in the form of a dynamic-link library (DLL) file. The JavaScript script in other HTA\nfiles may contact a different endpoint and download another malware, such as BazarBackdoor.\nStores the downloaded DLL file as the boxDelInt.jpg file in the Public directory, such as\n_C:\\users\\Public\\._\n\nExecutes boxDelInt.jpg—the TrickBot malware—using the regsvr32.exe Windows utility. The\nJavaScript script executes regsvr32.exe using the WshShell object of the Windows Script Host object\nmodel:\n\n\n-----\n\n_The obfuscated and deobfuscated version of the JavaScript script in  boxDeling.hta_\n\nIn recent Shathak malware distribution campaigns that we analyzed, the attacker-controlled endpoints from which\nmalicious HTA files downloaded malware were primarily located in European countries, with the Netherlands and\nSlovakia at the top of the list.\n\nMalicious actors use the TrickBot or BazarBackdoor malware that the Shathak group distributes to deploy\nadditional malware, such as the Conti ransomware. In recent Conti actor attacks that we analyzed, we observed\nthat Conti actors do not deploy ransomware immediately after initial compromise using TrickBot or\n\n\n-----\n\nBazarBackdoor.\n\nThe actors first conduct other activities, such as reconnaissance, credential theft, and data exfiltration. We\nobserved an average TTR of approximately two days after initial infection. The next section discusses Conti actor\nactivities that are common across recent attack campaigns that we analyzed. We focus on activities that Conti\nactors conduct after establishing a foothold in a system by using the BazarBackdoor or TrickBot malware that\nShathak distributes and before ransomware deployment.\n\n### Conti Actors Take Over from Shathak: Common Activities\n\n**Cobalt Strike Deployment**\n\n[Conti actors deploy a Cobalt Strike beacon after initial system compromise by using TrickBot or BazarBackdoor.](https://www.cobaltstrike.com/help-beacon)\nCobalt Strike is a common tool of Conti actors for different malicious activities, such as command execution,\ncredential theft, and lateral movement. Conti actors deploy a Cobalt Strike beacon in the form of a dynamic-link\nlibrary (DLL) file stored in the ProgramData directory, such as C:\\ProgramData. Conti actors then invoke an\nexported function of the DLL file, such as StartW or gimbild, using the rundll32.exe Windows utility:\n\n_Conti actors execute a Cobalt Strike beacon as seen in the Cybereason Defense Platform_\n\nConti actors establish persistence of the deployed Cobalt Strike beacon by creating a scheduled task using the\n_[schtasks Windows utility. The scheduled task executes the Cobalt Strike beacon by invoking an exported function](https://docs.microsoft.com/en-us/windows/win32/taskschd/schtasks)_\nof the DLL file that implements the beacon using the rundll32.exe utility. Conti actors deploy Cobalt Strike\nbeacons laterally on other networked machines by executing the schtasks utility, with the command line\nparameter /s specifying the target machine:\n\n_A scheduled task executes a Cobalt Strike beacon as seen in the Cybereason Defense Platform_\n\n**Reconnaissance**\n\nIn attack campaigns where a BazarBackdoor infection is the initial entry point into an infrastructure, Conti actors\nconduct reconnaissance activities by using BazarBackdoor to execute the following commands:\n\n\n-----\n\n**Command** **Description**\n\n\n_nltest_\n_/domain_trusts_\n_/all_trusts_\n\n_net localgroup_\n_administrator_\n\n_net group \"domain_\n_admins\" /domain_\n\n_net view /all_\n_/domain_\n\n\nEnumerates trust relationships in a Windows Active Directory (AD) environment.\n\nEnumerates users that are members of the administrator local group.\n\nEnumerates users that are members of the domain admins group such that the\ndesignated Domain Controller (DC) is conducting the enumeration activity.\n\nEnumerates all shared computers and resources on the system and all domains in the\nnetwork.\n\n\n_net view /all_ Enumerates all shared computers and resources on the system.\n\nIn addition to the nltest and net Windows utilities, Conti actors use publicly available network scanning tools for\nreconnaissance, such as the _[Advanced IP Scanner and](https://www.advanced-ip-scanner.com/)_ _[NetScan tools:](https://www.softperfect.com/products/networkscanner/)_\n\n_Conti actors conduct reconnaissance activities using net and NetScan s seen in the Cybereason Defense_\n_Platform_\n\n[In addition to the nltest and net utilities, Conti actors use the AdFind tool to explore AD environments in greater](https://www.joeware.net/freetools/tools/adfind/)\ndetail. Conti actors typically execute AdFind stored in a Windows Batch file (.bat) that is placed on the file system:\n\n\n-----\n\n_Conti actors execute AdFind commands as seen in the Cybereason Platform_\n\n**Credential and Data Theft**\n\nConti actors steal credentials by dumping the memory of the Local Security Authority Subsystem Service (lsass)\nprocess. Conti actors download PowerShell payload from an attacker-controlled endpoint, such as\n_httpx://datasecuritytoday[.]com::757/securiday, which dumps credentials from lsass:_\n\n_Conti actors download payload from httpx://datasecuritytoday[.]com::757/securiday as seen in the Cybereason_\n_Defense Platform_\n\nIn addition to credentials present in the memory of lsass instances, Conti actors steal AD data and credentials\nthat are stored in ntds.dit files by copying these files. The ntds.dit files are database files that are present on AD\nDCs, and these files store AD data, such as password hashes and information about AD user objects, groups,\n\n\n-----\n\nand group memberships. Conti actors copy ntds.dit files into the C:\\Windows\\Temp\\crashpad directory by using\nthe ntdsutil tool:\n\n_ntdsutil “ac i ntds” “ifm” “create full c:\\windows\\temp\\crashpad” q q_\n\nIn addition to ntdsutil, Conti actors use the _[NtdsAudit tool to dump AD domain user details and password hashes](https://github.com/Dionach/NtdsAudit)_\nfrom previously copied ntds.dit files:\n\n_ntdsAudit.exe ntds.dit -s SYSTEM -p pwddump.txt -u users.csv_\n\nOn machines running Microsoft Structured Query Language (SQL) database servers, Conti actors dump data\n[databases by using the sqlcmd utility. The sqlcmd commands that the actors execute follow the guidelines for](https://docs.microsoft.com/en-us/sql/tools/sqlcmd-utility?view=sql-server-ver15)\n[dumping data from databases in the publicly disclosed manuals of the Conti Ransomware Affiliate Program:](https://darkfeed.io/2021/08/07/conti-affiliate/)\n\n_Conti actors dump data from a database as seen in the Cybereason Defense Platform_\n\n**Lateral Movement**\n\nConti actors move laterally to Windows Server instances primarily by using the Remote Desktop Protocol (RDP).\nConti actors enable RDP connectivity if necessary on compromised machines by creating and setting the\nfollowing registry value to 0:\n\n_HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections_\n\nConti actors then use the netsh utility to modify Windows Firewall rules:\n\n_netsh advfirewall set allprofiles state off_\n\n_netsh advfirewall firewall set rule group=”remote desktop” new enable=Yes_\n\n_netsh firewall set service type = remotedesktop mode = enable_\n\nIn addition to establishing RDP connections, Conti actors deploy Cobalt Strike beacons laterally on networked\nmachines by executing the schtasks utility, with the command line parameter /s specifying the target machine.\nConti actors also disable the real-time monitoring feature of the Windows Defender security solution laterally on\n[networked machines by executing the PowerShell command Set-MpPreference -DisableRealTimeMonitoring](https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2019-ps)\n_$true._\n\n\n-----\n\nConti actors execute the PowerShell command laterally by using the schtasks utility and the Windows\nManagement Instrumentation (WMI) command-line utility (WMIC) with the node _WMIC parameter specifying the_\ntarget machine:\n\nConti actors laterally disable the real-time monitoring feature of Windows Defender as seen in the Cybereason\nDefense Platform\n\n**Data Exfiltration**\n\nConti actors typically exfiltrate data before deploying the Conti ransomware. The exfiltrated data contains stolen\ncredentials and other data, including potentially sensitive data that the actors can use for extortion. To exfiltrate\n[data to a remote endpoint, Conti actors use the Rclone tool, whose executable name the actors typically change](https://rclone.org/)\nto evade detection. In the Conti actor campaigns that we analyzed, the actors have changed the executable\nname of Rclone to sihosts.exe and serhosts.exe:\n\nConti actors execute Rclone (executable name changed to sihosts.exe) to exfiltrate data as seen in the\nCybereason Defense Platform\n\n## Detection and Prevention\n\n### The Cybereason Defense Platform\n\n\n-----\n\nThe [Cybereason Defense Platform detects threats using multi layer protection that detects and blocks malicious](https://www.cybereason.com/platform)\nactivities with threat intelligence, machine learning, and next-generation antivirus (NGAV) capabilities. The\nCybereason Platform is able to detect and prevent infections that use the TrickBot and BazarBackdoor malware\nthat the Shathak threat group distributes, as well as malicious activities that Conti actors conduct. For example,\nthe Cybereason Platform detects:\n\nUsers opening malicious email attachments distributed by the Shathak group\n\n_The Cybereason Defense Platform detects users opening malicious email attachments_\n\nConti actors deploying a Cobalt Strike beacon\n\n\n-----\n\n_The Cybereason Defense Platform detects the deployment of Cobalt Strike beacons_\n\nConti actors stealing credentials by dumping the memory of the lsass process\n\n_The Cybereason Defense Platform detects the dumping of lsass memory_\n\nConti actors exfiltrating data using the Rclone tool\n\n\n-----\n\n_The Cybereason Defense Platform detects data exfiltration activities_\n\n[Conti actors executing the Conti ransomware](https://www.cybereason.com/blog/cybereason-vs.-conti-ransomware)\n\n### General Recommendations\n\nSecurely handle email messages that originate from external sources. This includes disabling\nhyperlinks and investigating the content of email messages to identify phishing attempts.\nEnable the Anti-Ransomware feature in Cybereason NGAV and set the _Anti-Ransomware protection_\n[mode to Prevent.](https://nest.cybereason.com/documentation/product-documentation/190/anti-ransomware-settings#set-protection-mode)\n[Enable the Anti-Malware feature in Cybereason NGAV and enable the Detect and Prevent modes of](https://nest.cybereason.com/documentation/product-documentation/190/anti-malware-settings)\nthis feature.\nDisable unused RDP services, properly secure used RDP services, and regularly monitor RDP log\ndata for irregular activities.\nRegularly backup files to a secured remote location and implement a data recovery plan. Regular data\nbackups ensure that you can restore your data after a ransomware attack.\nUse secure passwords, regularly rotate passwords, and use multi-factor authentication where\npossible.\n\nCybereason is dedicated to teaming with defenders to end cyber attacks from endpoints to the enterprise to\n[everywhere—including modern ransomware. Schedule a demo today to learn how your organization can benefit](https://www.cybereason.com/request-a-demo)\nfrom an [operation-centric approach to security.](https://www.cybereason.com/blog/the-cybereason-malop-achieving-operation-centric-security)\n\n## MITRE ATT&CK Techniques\n\n\n-----\n\n**Initial Access** **Execution** **Persistence** **Defense**\n**Evasion**\n\n\n**Discovery** **Lateral**\n**Movement**\n\n\nAccount\nDiscovery\n\nDomain\n[Trust](https://attack.mitre.org/techniques/T1482/)\nDiscovery\n\nNetwork\n[Service](https://attack.mitre.org/techniques/T1046/)\nScanning\n\nRemote\n[System](https://attack.mitre.org/techniques/T1018/)\nDiscovery\n\n\n**Exfiltration**\n\nExfiltration\nOver\nAlternative\nProtocol\n\n\nPhishing:\n[Spearphishing](https://attack.mitre.org/techniques/T1566/001/)\nAttachment\n\n\nUser\n[Execution:](https://attack.mitre.org/techniques/T1204/002/)\nMalicious File\n\nScheduled\nTask/Job:\nScheduled\nTask\n\nWindows\n[Management](https://attack.mitre.org/techniques/T1047/)\nInstrumentation\n\n\nScheduled\nTask/Job:\nScheduled\nTask\n\n\nSigned\nBinary\n[Proxy](https://attack.mitre.org/techniques/T1218/005/)\nExecution:\nMshta\n\nSigned\nBinary\n[Proxy](https://attack.mitre.org/techniques/T1218/010/)\nExecution:\nRegsvr32\n\nSigned\nBinary\n[Proxy](https://attack.mitre.org/techniques/T1218/011/)\nExecution:\nRundll32\n\nModify\nregistry\n\n\n**Credential**\n**Access**\n\nOS\nCredential\n[Dumping:](https://attack.mitre.org/techniques/T1003/001/)\nLSASS\nMemory\n\nOS\nCredential\nDumping:\nNTDS\n\n\nRemote\nServices:\n[Remote](https://attack.mitre.org/techniques/T1021/001/)\nDesktop\nProtocol\n\n\n### About the Researchers:\n\n**Aleksandar Milenkoski, Senior Threat and Malware Analyst, Cybereason Global SOC**\n\nAleksandar Milenkoski is a Senior Threat and Malware Analyst with the Cybereason Global\n\nSOC team. He is involved primarily in reverse engineering and threat research activities. Aleksandar has a PhD\nin system security. Prior to Cybereason, his work focused on research in intrusion detection and reverse\nengineering security mechanisms of the Windows 10 operating system.\n\n**Eli Salem, Senior Security Analyst, Cybereason Global SOC**\n\nEli is a lead threat hunter and malware reverse engineer at Cybereason. He has worked in the\n\nprivate sector of the cyber security industry since 2017. In his free time, he publishes articles about malware\nresearch and threat hunting.\n\n**Yonatan Gidnian, Senior Security Analyst and Threat Hunter, Cybereason Global SOC**\n\n\n-----\n\nYonatan Gidnian is a Senior Security Analyst and Threat Hunter with the Cybereason Global\n\nSOC team. Yonatan analyses critical incidents and hunts for novel threats in order to build new detections. He\nbegan his career in the Israeli Air Force where he was responsible for protecting and maintaining critical\ninfrastructures. Yonatan is passionate about malware analysis, digital forensics, and incident response.\n\nAbout the Author\n\n**Cybereason Global SOC Team**\n\nThe Cybereason Global SOC Team delivers 24/7 Managed Detection and Response services to customers on\nevery continent. Led by cybersecurity experts with experience working for government, the military and multiple\nindustry verticals, the Cybereason Global SOC Team continuously hunts for the most sophisticated and pervasive\nthreats to support our mission to end cyberattacks on the endpoint, across the enterprise, and everywhere the\nbattle moves.\n\n[All Posts by Cybereason Global SOC Team](https://www.cybereason.com/blog/authors/cybereason-global-soc-team)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-09 - THREAT ANALYSIS REPORT- From Shatak Emails to the Conti Ransomware.pdf"
    ],
    "report_names": [
        "2021-11-09 - THREAT ANALYSIS REPORT- From Shatak Emails to the Conti Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535763,
    "ts_updated_at": 1743041638,
    "ts_creation_date": 1653753928,
    "ts_modification_date": 1653753928,
    "files": {
        "pdf": "https://archive.orkl.eu/ccb1bfb80f48e8f677074e75052ea0f8a30d721f.pdf",
        "text": "https://archive.orkl.eu/ccb1bfb80f48e8f677074e75052ea0f8a30d721f.txt",
        "img": "https://archive.orkl.eu/ccb1bfb80f48e8f677074e75052ea0f8a30d721f.jpg"
    }
}