{
    "id": "2c8d3ea9-a45c-4c48-a2a4-aa589dcb72f3",
    "created_at": "2023-01-12T15:01:04.015188Z",
    "updated_at": "2025-03-27T02:06:11.36116Z",
    "deleted_at": null,
    "sha1_hash": "7b458cf7c261d520bf5765550e31de7c5d8a3928",
    "title": "2019-01-18 - Spotted- JobCrypter Ransomware Variant With New Encryption Routines, Captures Desktop Screenshots",
    "authors": "",
    "file_creation_date": "2022-05-28T16:00:54Z",
    "file_modification_date": "2022-05-28T16:00:54Z",
    "file_size": 1070777,
    "plain_text": "# Spotted: JobCrypter Ransomware Variant With New Encryption Routines, Captures Desktop Screenshots\n\n**trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/jobcrypter-ransomware-with-new-routines-for-**\nencryption-desktop-screenshots\n\nA variant of [JobCrypter](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/ransom_jobcrypter.b) [ransomware was observed using new routines for encryption and](https://www.trendmicro.com/vinfo/us/security/definition/RANSOMWARE)\nfeatures the ability to send a screenshot of the victim’s desktop to an email address. Aside\nfrom encrypting files twice, the ransom note is unconventionally found in the same encrypted\nfile. Trend Micro machine learning and behavioral detection technology has proactively\nblocked this variant of JobCrypter at the time of discovery.\n**_Routine_**\n\nThe new sample of JobCrypter (detected by Trend Micro as\n[RANSOM.WIN32.JOBCRYPTER.THOAAGAI) was observed in the wild, reportedly seen on](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Ransom.Win32.JOBCRYPTER.THOAAGAI)\na suspected compromised website. While the malware's installation and launch procedures\nare similar with the 2017 attacks, this sample adds a routine that sends a screenshot of the\nvictim’s desktop and system information to an email address via SMTP. It also deletes the\nregistry it created, HKCU\\Software\\MOI.\n\n\n-----\n\n_Figure 1. JobCrypter’s new routine includes capturing screenshots of the infected unit’s_\n_screen._\n\n_Figure 2. The malware sends the desktop screenshot and system information to an email_\n_address._\n\n\n-----\n\n_Figure 3. JobCrypter’s network activity. According to analysis, the information sent to the_\n_email address includes the system’s running processes, volume serial number, machine_\n_name, and the 67-digit encryption/decrypter key._\n\nThe wallpaper of the infected machine changes to include the ransom note and a display box\nfor the cybercriminal’s ransom demand and instructions.\n\n_Figure 4. Desktop wallpaper is changed to the ransom note._\n\n\n-----\n\nA display box also appears with a text box and a button that reads Unblock my files, as well\nas a link that says “Don’t have a password? Click here.” When clicked, it opens\n_%Desktop%\\Comment débloquer mes fichiers.txt via notepad. Should the user of the_\ninfected machine have the decrypting key — found in the registry HKCU\\Software\\MOI\nbefore deletion — the ransomware will use the input text to decrypt %User\n_Profile%\\ntuser.ini.css. If successful, it will continue decrypting all the files with the .css_\nextension, delete the registries it created including the autostart registry, the files it dropped,\nand the malware itself. If not, another message box will appear with the text “Mot de passe\n_invalide” or “Invalid password”._\n\n_Figure 5. The message displayed also says “All your files are encrypted. Don’t have a_\n_password? Click here” and “Unblock my files” button._\n\n**[Read:** **[JavaScript malware in spam spreads ransomware, miners, spyware, worm]](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/javascript-malware-in-spam-spreads-ransomware-miners-spyware-worm)**\n\nThis ransomware variant has a few unique routines. Once it finds a file, it encodes all the\nfile’s content to Base64 and encrypts the encoded content with Triple DES algorithm, and\nthen encodes the encrypted file again to Base64. It also prepends the ransom note with the\nencrypted file instead of dropping another file in the system as most ransomware routines do\nbefore it finally deletes the original file in the drive. All the encrypted files are changed to .css\nextension.\n\n_Figure 6. The malware encodes the file content to Base64._\n\n_Figure 7. The encoded file is encrypted with Triple DES then further encoded._\n\n\n-----\n\n_Figure 8. The ransom note is found in the encrypted file, and the original file is deleted from_\n_the drive._\n\nThe ransom note demands a payment of €1,000 within 24 hours to get the decrypter. The\nkey is made of 67 digits of random numbers between 0 to 9 – found in the registry and body\nof the sent email – but is deleted by the malware itself during encryption of the files. Since\nthe key used in encrypting the files was in the system prior to deletion, decryption is possible.\nExperienced cybersecurity practitioners will notice and know that while the routine is\nunconventional, the ransom note always ends in “;” and is prepended before the encrypted\nfile content, making it possible to recover important data files.\n\n**[Read:** **[Ransomware MongoLock immediately deletes files, formats backup drives]](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-mongolock-immediately-deletes-files-formats-backup-drives)**\n\nJobCrypter was among the new ransomware families that affected thousands of businesses\n[and individuals in early 2017. We can expect cybercriminals to continue exploring and](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/threat-reports/roundup/2017-annual-roundup-the-paradox-of-cyberthreats)\ncombining new techniques with old malware and tools to infiltrate systems for profit. These\nbest practices can help defend against this threat:\n\nRegularly download updates and patches from legitimate vendors.\nInstall a multi-layered security solution that can scan and block malicious URLs.\n\n\n-----\n\nPractice the [3-2-1 system for backing up your files.](https://blog.trendmicro.com/trendlabs-security-intelligence/world-backup-day-the-3-2-1-rule/)\n\n**_Trend Micro Solutions_**\n\n[Trend Micro Smart Protection Suites™ proactively detects and blocks this threat.](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html)\n\n**_Indicators of Compromise_**\n\n**SHA256** **Detection**\n\n\n37e28559fba615aee1204eebf551dc588f7dc\n5b8a7e11893a1602da40b03f4fb\n\n\n[RANSOM.WIN32.JOBCRYPTER.THOAAGAI](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/RANSOM.WIN32.JOBCRYPTER.THOAAGAI)\n\n\n**_With additional insights from Raphael Centeno and Warren Sto. Tomas_**\n\nHIDE\n\n**Like it? Add this infographic to your site:**\n1. Click on the box below.  2. Press Ctrl+A to select all.  3. Press Ctrl+C to copy.  4. Paste\nthe code into your page (Ctrl+V).\n\nImage will appear the same size as you see above.\n\n[Posted in Cybercrime & Digital Threats,](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats) [Ransomware](https://www.trendmicro.com/vinfo/us/security/news/ransomware)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-18 - Spotted- JobCrypter Ransomware Variant With New Encryption Routines, Captures Desktop Screenshots.pdf"
    ],
    "report_names": [
        "2019-01-18 - Spotted- JobCrypter Ransomware Variant With New Encryption Routines, Captures Desktop Screenshots.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535664,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653753654,
    "ts_modification_date": 1653753654,
    "files": {
        "pdf": "https://archive.orkl.eu/7b458cf7c261d520bf5765550e31de7c5d8a3928.pdf",
        "text": "https://archive.orkl.eu/7b458cf7c261d520bf5765550e31de7c5d8a3928.txt",
        "img": "https://archive.orkl.eu/7b458cf7c261d520bf5765550e31de7c5d8a3928.jpg"
    }
}