{
    "id": "2c9757df-2f0f-43a0-a953-0249836d2049",
    "created_at": "2023-01-12T15:04:01.716969Z",
    "updated_at": "2025-03-27T02:09:18.360754Z",
    "deleted_at": null,
    "sha1_hash": "8c0248b30f634fdd20db2e34a392d2ad47d7d468",
    "title": "2019-07-19 - Elusive MegaCortex Ransomware Found - Here is What We Know",
    "authors": "",
    "file_creation_date": "2022-05-27T01:58:36Z",
    "file_modification_date": "2022-05-27T01:58:36Z",
    "file_size": 2306508,
    "plain_text": "# Elusive MegaCortex Ransomware Found - Here is What We Know\n\n**[bleepingcomputer.com/news/security/elusive-megacortex-ransomware-found-here-is-what-we-know/](https://www.bleepingcomputer.com/news/security/elusive-megacortex-ransomware-found-here-is-what-we-know/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nJuly 19, 2019\n03:00 AM\n0\n\nA sample of the ransomware called MegaCortex that is known to target the enterprise in\ntargeted attacks has been found and analyzed. In this article, we will provide a brief look at\nthe MegaCortex Ransomware and how it encrypts a computer.\n\nWhen modern ransomware were first released, attackers would distribute the malware in a\nwide net in order to catch as many victims as possible. Over the past year, ransomware has\nevolved into more targeted enterprise attacks that have been earning extremely large\npayouts. Due to these payouts, we continue to see new players in the targeted ransomware\nscene.\n\nWhile Ryuk, BitPaymer, and Sodinokibi (REvil) have become commonly known as\n\"enterprise ransomware\", the MegaCortex Ransomware less known. This article will\nhopefully shed some light on how it operates.\n\n## Installed via targeted attacks\n\nWe first heard about MegaCortex when Sophos reported that victims contacted them about\n[being infected with a new ransomware called MegaCortex.](https://www.bleepingcomputer.com/news/security/new-megacortex-ransomware-found-targeting-business-networks/)\n\n\n-----\n\nWhen Sophos analyzed the victim s computers, they found that the attackers were gaining\naccess to a network and then compromising the Windows domain controller. Once the\ndomain controller was compromised the attackers would install Cobalt Strike in order to\nopen a reverse shell back to the attackers.\n\nNow that the attackers had full access to the network, they would use PsExec to distribute a\nbatch file and the ransomware named as winnit.exe to the rest of the computers on the\nnetwork. It would then execute this batch file in order to encrypt the various compromised\nworkstations.\n\n**Portion of batch file**\nWhen launching the winnit.exe executable, a particular base64 encoded string would need\nto be provided in order for the ransomware to extract and inject a DLL into memory. This\nDLL is the main ransomware component that encrypts a computer.\n\nIt is not known exactly how the attackers gained access to a network, but Sophos stated\nthat the Emotet or Qakbot Trojans were present on networks also infected with\nMegaCortex.\n\n## The MegaCortex encryption process\n\n[In a sample of MegaCortex discovered by MalwareHunterTeam, analyzed by](https://twitter.com/malwrhunterteam) [Vitali Kremez,](https://twitter.com/VK_Intel)\nand shared with BleepingComputer, we are able to gain new insight into how the\nransomware operates.\n\nThe particular sample that was found is code signed with a certificate from a UK company\n[named \"ABADAN PIZZA LTD\". This company was probably abandoned and then claimed](https://beta.companieshouse.gov.uk/company/10750374)\nby the attackers under their own aliases in order to purchase a certificate.\n\n\n-----\n\n**Certificate used to sign**\n\n**ransomware**\nIn this sample, it is no longer necessary to provide a special base64 encoded string for the\nDLL payload to be unpacked and injected into memory. Now you can simply run the\nexecutable and the ransomware will begin encrypting the computer.\n\nKremez thinks this change was made in order to increase the scale of their operations and\nto simplify its execution.\n\n\"I think they are trying to scale their ops and reach more victims Simplifying their approach\nwithout multiple layered script execution\" Kremez told BleepingComputer.\n\nWhen executed, MegaCortex will display a running output of the files processed and its\ncurrent stage of operation. As you can see by the output of the ransomware below,\nMegaCortex was designed to be monitored by a live attacker and then cleaned up after\nexecution is finished.\n\n\n-----\n\n**MegaCortex Encrypting Files**\nKremez told BleepingComputer that when the executable is launched it will terminate or\ndisable 1,396 different Windows services and processes. These processes include security\nsoftware, database servers, mail servers, and backup software. A full list of disabled\n[services and terminated processes can be found in Kremez's GitHub repository.](https://github.com/k-vitali/Malware-Misc-RE/blob/master/2019-07-18-megacortex-ransomware-note.vk.txt)\n\nThis termination process was previously done in a batch file, but is now integrated into the\nransomware itself.\n\nThe ransomware will then begin to encrypt files on the victim's hard drives. When\nencrypting files, it will not encrypt any of the following types of files, file names, or files\nunder listed folders.\n\n\n-----\n\n```\n.dll\n.exe\n.sys\n.mui\n.tmp\n.lnk\n.config\n.manifest\n.tlb\n.olb\n.blf\n.ico\n.regtrans-ms\n.devicemetadata-ms\n.settingcontent-ms\n.bat\n.cmd\n.ps1\ndesktop.ini\niconcache.db\nntuser.dat\nntuser.ini\nntuser.dat.log1\nntuser.dat.log2\nusrclass.dat\nusrclass.dat.log1\nusrclass.dat.log2\nbootmgr\nbootnxt\ntemp\\\n.+\\\\Microsoft\\\\(User Account Pictures|Windows\\\\(Explorer|Caches)|Device\nStage\\\\Device|Windows)\\\\\n\n```\nAs the ransomware encrypts a file it will append the .megac0rtx extension to the encrypted\nfile's name. For example, test.jpg will be encrypted and renamed to test.jpg.megac0rtx.\n\n\n-----\n\n**Folder of MegaCortex Encrypted Files**\nEach file that is encrypted, will also include the MEGA-G8= file marker as shown below.\n\n\n-----\n\n**File Marker in Encrypted Files**\nAs its encrypting, the ransomware will also create a log file at C:\\x5gj5_gmG8.log that will\ncontain a list of files that could not be encrypted by the ransomware.\n\nWhen done encrypting files the ransomware will create a ransom note named !!!_READ**ME_!!!.txt and save it on the victim's desktop. This ransom note contains emails that the**\nvictim can use to contact the attackers to find out payment instructions. The note states that\nransom amounts range anywhere from 2-3 bitcoins to 600 BTC.\n\n\n-----\n\n**MegaCortex Ransom Note**\nDuring its execution, the ransomware will also delete Shadow Volume Copies using\nthe `vssadmin delete shadows /all /for=C:\\ command.`\n\nIn addition, Kremez told BleepingComputer that there are references to the\nWindows `Cipher /W: command, which is used to overwrite deleted data so that it cannot`\nbe recovered using file recovery software.\n\nNow that a sample has been found, the ransomware's encryption algorithm will be analyzed\nby researchers for weaknesses. If anything new develops, we will update this article.\n\n## Ransom note may detract payments\n\nWe have seen a lot of ransom notes here at BleepingComputer and I can say that the\nlanguage used in MegaCortex's is one of the most aggressive ones I have seen to date.\n\nMost ransomware will try to walk a victim through the payment process and display almost\nsympathetic undertones to their requests. Instead, the MegaCortex ransom note goes the\ncomplete opposite direction.\n\n\n-----\n\nThey point blank say they do not negotiate, do not care about your hardships, and have no\nsympathy that they encrypted your files.\n\nAnd please do not start your first letter to us with the words:\n\"It's a mistake !! Our company is just trimming and grooming little dogs. We don't have\nmoney at all.\"\n\"There is a big mistake on our site !\nWe are not leaders in our industry and all our competitors don't suck our huge **ck.\nWe're just ? small company, and we are dying because of hard competition.\"\n\"We are not the Super Mega International Corporation ltd., we are just a nursery etc.\"\n\nWe see it 5 times a day. This sh*t doesn't work at all !!!\nDon't waste our and your time.\n\nRemember ! We don't work for food.\nYou have to pay for decryption in Bitcoins (BTC).\nIf you think you pay $500 and you'll get the decryptor, you are 50 million light years away\nfrom reality :)\nThe ransom begins from 2-3 BTC up to 600 BTC.\nIf you don't have money don't even write to us.\nWe don't do charity !\n\nWhether or not this tone will do the ransomware developer's any favors is hard to\ndetermine. What I do no know is that ransomware victims feel violated, hurt. and angry and\nthis ransom note won't make them feel any better.\n\n## IOCs:\n\n### Hashes:\n```\n77ee63e36a52b5810d3a31e619ec2b8f5794450b563e95e4b446d5d3db4453b2\n\n Associated Files:\nwinnit.exe\nx5gj5_gmG8.log\npayload.dll\n!!!_READ-ME_!!!.txt\n\n Ransom Note Text:\n\n```\n\n-----\n\n```\nIf you are reading this text, it means, we ve hacked your corporate network.\nNow all your data is encrypted with very serious and powerful algorithms (AES256 and\nRSA-4,096).\nThese algorithms now in use in military intelligence, NSA and CIA .\nNo one can help you to restore your data without our special decipherer.\nDon't even waste your time.\nBut there are good news for you.\nWe don't want to do any damage to your business.\nWe are working for profit.\nThe core of this criminal business is to give back your valuable data in original\nform (for ransom of course).\nIn order to prove that we can restore all your data, we'll decrypt 3 of your files\nfor free.\nPlease, attach 2-3 encrypted files to your first letter.\nEach file must be less than 5 Mb, non-archived and your files should not contain\nvaluable information\n(databases, backups, large word files or excel sheets, etc.).\nYou will receive decrypted samples and our conditions how to get the decipherer.\nFor the fastest solution of the problem, please, write immediately in your first\nletter:\nthe name of your company,\nthe domain name of your corporate network and\nthe URL of your corporate website\nIt is important !\nAnd please do not start your first letter to us with the words:\n\"It's a mistake !! Our company is just trimming and grooming little dogs. We don't\nhave money at all.\"\n\"There is a big mistake on our site !\nWe are not leaders in our industry and all our competitors don't suck our huge **ck.\nWe're just ? small company, and we are dying because of hard competition.\"\n\"We are not the Super Mega International Corporation ltd., we are just a nursery\netc.\"\nWe see it 5 times a day. This sh*t doesn't work at all !!!\nDon't waste our and your time.\nRemember ! We don't work for food.\nYou have to pay for decryption in Bitcoins (BTC).\nIf you think you pay $500 and you'll get the decryptor, you are 50 million light\nyears away from reality :)\nThe ransom begins from 2-3 BTC up to 600 BTC.\nIf you don't have money don't even write to us.\nWe don't do charity !\nOne more time :\n1.(In first letter) write the name of your company, the domain name of your\ncorporate network and the URL of your corporate website\n2. Attach 2-3 encrypted files (we'll show you some magic)\n3. Use Google in order to find out how to buy bitcoins fast\n\n```\n\n-----\n\n```\nAs soon as we get bitcoins you'll get all your decrypted data back.\nContact emails:\nMckinnisKamariyah91@mail.com\nor\nThomassenVallen1999@mail.com\nMan is the master of everything and decides everything.\n\n### Associated Email addresses:\nMckinnisKamariyah91@mail.com\nThomassenVallen1999@mail.com\n\n```\n[Enterprise](https://www.bleepingcomputer.com/tag/enterprise/)\n[MegaCortex](https://www.bleepingcomputer.com/tag/megacortex/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/over-8-500-google-chrome-bug-reports-larger-rewards-in-store/)\n[Next Article](https://www.bleepingcomputer.com/news/security/ransomware-attacks-grow-rampant-paying-still-not-a-good-option/)\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-07-19 - Elusive MegaCortex Ransomware Found - Here is What We Know.pdf"
    ],
    "report_names": [
        "2019-07-19 - Elusive MegaCortex Ransomware Found - Here is What We Know.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535841,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653616716,
    "ts_modification_date": 1653616716,
    "files": {
        "pdf": "https://archive.orkl.eu/8c0248b30f634fdd20db2e34a392d2ad47d7d468.pdf",
        "text": "https://archive.orkl.eu/8c0248b30f634fdd20db2e34a392d2ad47d7d468.txt",
        "img": "https://archive.orkl.eu/8c0248b30f634fdd20db2e34a392d2ad47d7d468.jpg"
    }
}