{
    "id": "2cae90cc-cf9e-4357-95fc-114f180809c5",
    "created_at": "2023-01-12T15:06:52.686927Z",
    "updated_at": "2025-03-27T02:16:28.807838Z",
    "deleted_at": null,
    "sha1_hash": "b1787c783377f3921d0238b34afa74c3318ff3c6",
    "title": "2019-02-01 - Tracking OceanLotus’ new Downloader, KerrDown",
    "authors": "",
    "file_creation_date": "2022-05-28T17:56:51Z",
    "file_modification_date": "2022-05-28T17:56:51Z",
    "file_size": 2588126,
    "plain_text": "# Tracking OceanLotus’ new Downloader, KerrDown\n\n**[unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/](https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/)**\n\nVicky Ray, Kaoru Hayashi February 1, 2019\n\nBy [Vicky Ray and](https://unit42.paloaltonetworks.com/author/vicky-khan/) [Kaoru Hayashi](https://unit42.paloaltonetworks.com/author/khayashi/)\n\nFebruary 1, 2019 at 6:00 AM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [KerrDown,](https://unit42.paloaltonetworks.com/tag/kerrdown/) [OceanLotus](https://unit42.paloaltonetworks.com/tag/oceanlotus/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/tracking-oceanlotus-new-downloader-kerrdown/)\n\nOceanLotus (AKA APT32) is a threat actor group known to be one of the most sophisticated\nthreat actors originating out of south east Asia. [Multiple attack campaigns have](http://blogs.360.cn/post/oceanlotus-apt.html)\nbeen [reported by number of security organizations in the last couple of](https://www.welivesecurity.com/2018/11/20/oceanlotus-new-watering-hole-attack-southeast-asia/)\nyears, [documenting the tools and tactics used by the threat actor. While OceanLotus’ targets](https://www.cybereason.com/blog/operation-cobalt-kitty-apt)\nare global, their operations are mostly active within the APAC region which encompasses\ntargeting private sectors across multiple industries, foreign governments,\nactivists, and dissidents connected to Vietnam.\n\nThis blog will cover a new custom downloader malware family we’ve named\n“KerrDown” which OceanLotus have been actively using since at least early 2018. We also\n[show how the jaccard-index algorithm was used to quickly find similarities between the](https://en.wikipedia.org/wiki/Jaccard_index)\nnew KerrDown malware family within our datasets. This method has proven to be very useful\nto extract similarities from large sample datasets and connecting attack\ncampaigns together. Given the large number of “KerrDown” samples found, we were also\nable to discern possible patterns in OceanLotus’ working hours and days of a week which is\ndiscussed in the later sections of this blog.\n\nWe identified two methods to deliver the KerrDown downloader to targets. One is using the\nMicrosoft Office Document with a malicious macro and the other\n[is RAR archive which contains a legitimate program with DLL side-loading. For RAR archive](https://attack.mitre.org/techniques/T1073/)\nfiles, the file names used to trick targets are all in Vietnamese as shown in Figure 11. Our\nanalysis shows that the primary targets of the ongoing campaign discussed in this blog are\neither in Vietnam or Vietnamese speaking individuals.\n\n### Malicious Document\n\nOur analysis began with an active mime document, something we've seen OceanLotus use\nbefore but this time involving a new payload KerrDown The lure hash is\n\n\n-----\n\n(SHA256:89e19df797481ae2d2c895bcf030fe19e581976d2aef90c89bd6b3408579bfc3)\n\nFigure 1 below shows a snapshot of the lure file. Once the victim opens the lure\ndocument, which includes an image file with a message in Vietnamese which that asks the\nvictim to enable macros to view the contents of the file. At first glance the document may look\nlike there is no other content other than the notification to enable macros. However, a closer\nlook reveals two different base64 blobs inserted in the page in separate tables and the font\nsize has been changed to 1 which may deceive victims to overlook the content. Another\nreason for this technique may be that many automated tools are able to detect the presence\nof an embedded binary within the streams of such files and this technique may allow them to\ngo undetected.\n\n## Delivery Document Analysis\n\n_Figure 1: Lure document_\n\nOnce we increase the font size, the base64 blobs are visible in two different tables. Once\ndecoded you can see the MZ header of the PE DLL at the beginning of each table, as shown\nin Figure 2.\n\n\n-----\n\n_Figure 2: Base64 encoded pedll files embedded as text in the document._\n\nFigure 3 shows a code excerpt from the embedded macro that checks which base64 blob\nshould be decoded based on the iCheck variable, a Boolean value which is set to true if\nthe victim system is running on a 64-bit system and false on a 32-bit system. If the system is\nfound to be 64-bit, the base64 encoded blob on the left is\ndecoded otherwise the base64 encoded blob on the right is decoded.\n\n\n-----\n\n_Figure 3: Base64 blob selection based on system check_\n\n[We also noticed that the actors reused the VBS decode function published by Motobit.](https://www.motobit.com/tips/detpg_Base64/)\nFigure 4 shows the comparison between the base64 function used in the macro code and\nthe VBS base64 decoder function published by Motobit.\n\n_Figure 4: Base64 decoder comparison_\n\n## Similarity Analysis of KerrDown Samples using Jaccard-Index\n\nOnce we decoded and extracted both DLL files from the document we used a similarity\n[analysis algorithm using the Jaccard index to check the binaries against known set of](https://en.wikipedia.org/wiki/Jaccard_index)\nmalware families used by OceanLotus which yielded no matches with any\nprevious OceanLotus malware families. However, we were able to find multiple other\nsamples in our datasets using the imphash value of the KerrDown samples and the\naccompanying C2 domains. Given the high number of samples found,\n[we again used a similarity analysis algorithm using Jaccard Index to extract similarities](https://en.wikipedia.org/wiki/Jaccard_index)\nbetween all the samples found. At this stage we were not sure if the DLL files were a\nbackdoor or had any other functionality. Hence, we included a few\nother known OceanLotus malware family samples used no earlier than 2017 to our similarity\ntest, and in most cases samples which were final payloads dropped in victim machines. One\nof the main objectives was to quickly discern if KerrDown could have been variants of the\n\n\n-----\n\nknown malware families we have been tracking or was OceanLotus employing a new\nmalware family in their playbooks and in the recent campaigns. Plotting the Jaccard index\n[results using networkx we can quickly visualize the similarities extracted. As you can see](https://pypi.org/project/networkx/)\nfrom Figure 5, there is a thick cluster of samples at the top right of the networkx graph which\ndid not have any similarities with the other known OceanLotus malware family\nsamples. Therefore, this observation was helpful for us to understand that the samples we\nwere looking into were likely a new malware family being employed by\nthe OceanLotus group at the time of analysis, which we have now named KerrDown.\n\n_Figure 5: Similarity analysis using Jaccard Index_\n\n## KerrDown to Cobalt Strike Beacon\n\n\n-----\n\nAs discussed in the delivery document analysis above, depending on the OS architecture\neither of the embedded KerrDown DLLs will be dropped in the victim machine. The DLL is\ndropped in the directory location ‘Users\\Administrator\\AppData\\Roaming\\’ as\n‘main_background.png’. The DLL retrieves the payload from the URL, decrypts it by using\nDES algorithm and execute it in the memory. Therefore, it is observed that only\nthe KerrDown DLL downloader is saved in the system and the payload directly gets executed\nin the memory without being written in the system. Table 1 shows the URL the downloader\nwill attempt to download the payload from depending on the OS architecture of the victim\nmachine.\n\n**OS Architecture** **URL** **User Agent**\n\n32 bit https://syn.servebbs[.]com/kuss32.gif Mozilla/5.0 (Windows NT\n10.0; Win32; x32; rv:60.0)\n\n64 bit https://syn.servebbs[.]com/kuss64.gif Mozilla/5.0 (Windows NT\n10.0; Win64; x64; rv:60.0)\n\n_Table 1 : Payload DLL selection based on architecture_\n\nThe link to the final payload of KerrDown was still active during the time of analysis and\nhence we were able to download a copy which turned out to be a variant of\n[Cobalt Strike Beacon. Cybereason also published previously on OceanLotus using](https://www.cybereason.com/blog/operation-cobalt-kitty-apt)\nCobalt Strike in their campaigns and it is interesting to see the use of a new downloader\nmalware family being used to still deliver the final payload of Cobalt Strike. As we can see in\nthis case, the purpose of the malware is to download and execute the Cobalt Strike Beacon\npayload in memory. Though Cobalt Strike is a commercial penetration testing tool, various\nthreat actors are known to have used it in their campaigns.\n\n## RAR Archives with KerrDown\n\nWhile investigating KerrDown we found multiple RAR files containing a variant of\nthe malware. We haven’t yet identified the delivery method or targets of this variant. The\nattacker changed the downloader code by adding more stages and hiding each stage by\ncompression and encryption. They also changed the way to execute the malicious code\nfrom an Office macro to the DLL side-loading technique through a legitimate program.\n\nThe RAR archive\n\n(SHA256:040abac56542a2e0f384adf37c8f95b2b6e6ce3a0ff969e3c1d572e6b4053ff3)\n\nhas the Vietnamese file name ‘Don khieu nai.rar’ which translates to 'Complaint letter' in\nEnglish. The archive contains a legitimate older version of Microsoft Word (Microsoft Word\n2007) executable file that is named ‘Noi dung\n\n\n-----\n\nchi tiet don khieu nai gui cong ty.exe which translates to Learn more about how to use your\ncompany’ in English. The attacker used the DLL side loading technique to load a malicious\nDLL by the older version of Microsoft Word. When opening the executable file in the archive,\nit loads the malicious DLL in the same directory. The DLL executes multi-stage\nshellcodes and each shellcode employs various technique to hide the next stage. The\noverall installation steps are below:\n\n1. The Microsoft Word exe loads wwlib.dll in the same directory and executes ‘FMain’\n\nfunction of the DLL.\n2. The DLL decodes base64 encoded shellcode in the body and executes it.\n3. The shellcode decompresses the second shellcode which is compressed with the open\n\nsource compression code UCL and execute it.\n4. The second shellcode decrypts the third shellcode with AES.\n5. The third shellcode retrieves the shellcode from the following remote location and\n\nexecutes it: https://cortanasyn[.]com/Avcv\n6. The fourth shellcode loads the embedded Cobalt Strike Beacon DLL in memory and\n\nexecutes it.\n\n\n-----\n\n_Figure 6: Execution flow of sideloaded malicious downloader_\n\nLooking at the compile timestamps of all the KerrDown samples in our datasets we were\nable to discern a couple of observations:\n\nOceanLotus has been using the new downloader in their campaigns since at least\nMarch 2018 and continues to actively use it in their campaigns. Figure 7 shows the\ntimeline of the KerrDown samples:\n\n\n-----\n\n_Figure 7: Downloader DLL compile time lines_\n\nWhile it is already widely believed that the OceanLotus group may originate from\nVietnam, we wanted to find possible working hour patterns from the samples in our\ndatasets. We plotted the compile times based on GMT +7 and found a clear pattern of\nthe possible working hours of the group. The OceanLotus group has a typical 9 AM to 6\nPM working pattern with most samples compiled during this period of the\nday. Figure 8 shows the malware compilation timestamps in GMT +7 for each unique\nsample found in our dataset.\n\n\n-----\n\n_Figure 8: Malware compilation times in GMT +7_\n\nWe also observed all the samples were compiled during the weekdays - between\nMonday to Friday. Therefore, it is clear that the OceanLotus group works during\nweekdays and takes a break during the weekends. Figure 9 shows the samples\ncompiled during the week.\n\n\n-----\n\n_Figure 9: Malware compilation during weekdays_\n\n## Conclusion\n\nOceanLotus has been an active threat actor group for a number of years and remains one of\nthe most sophisticated threat actors in the APAC region. As we have seen with the\nnew KerrDown downloader being used in their recent campaigns, the group continues to\nbuild and employ new tools and techniques in their overall operations and playbooks. It is\ntherefore imperative to understand and keep a track of the group’s ongoing operations and\ncapability to better defend against such threats. Given the high number of samples observed,\nwe were also able to discern possible working hour patterns which shows us that the group\nlikely has formal working hours and operating out of a region which is like Vietnam or nearby\ncountries. While most of the targeting observed is towards Vietnamese speaking victims,\ngiven the known broader geographic and industry wide target base of OceanLotus, the group\nmay use similar tools and playbooks against other targets.\n\nPalo Alto Networks customers are already protected via:\n\nAll samples in this report have a malicious verdict in WildFire\nDomains have been classified as malicious\n[AutoFocus tags are available for additional context: OceanLotus and](https://autofocus.paloaltonetworks.com/) [KerrDown.](https://autofocus.paloaltonetworks.com/)\n\n## Indicators of Compromise:\n\n\n-----\n\n### Lure Docs:\n\n73dcbcc47d6bd95dcf031ebbd34ac42301a20ee1143ac130b405e79b4ba40fc8\n\n89e19df797481ae2d2c895bcf030fe19e581976d2aef90c89bd6b3408579bfc3\n\na4a066341b4172d2cb752de4b938bf678ceb627ecb72594730b78bd05a2fad9d\n\n8bf22202e4fd4c005afde2266413cba9d1b749b1a2d75deac0c35728b5eb3af8\n\ndf8210d20c5eb80d44ba8fa4c41c26c8421dcb20168e4f796e4955e01ebc9e13\n\n94fab926b73a6a5bc71d655c8d611b40e80464da9f1134bfce7b930e23e273ab\n\n4321a9f95901a77b4acfbaef3596cf681712345e1cbd764873c6643fe9da7331\n\n### KerrDown DLLs:\n\n4a0309d8043e8acd7cb5c7cfca95223afe9c15a1c34578643b49ded4b786506b\n\n4b431af677041dae3c988fcc901ac8ec6e74c6e1467787bf099c4abd658be5be\n\n4bc00f7d638e042da764e8648c03c0db46700599dd4f08d117e3e9e8b538519b\n\n4e2f8f104e6cd07508c5b7d49737a1db5eeba910adfdb4c19442a7699dc78cfc\n\n4e791f2511c9bd3c63c8e37aa6625d8b590054de9e1cca13a7be2630bc2af9ce\n\n539e8a53db3f858914cfe0d2132f11de34a691391ba71673a8b1e61367a963c7\n\n53cd92f37ffd0822cc644717363ba239d75c6d9af0fa305339eaf34077edd22d\n\n53efaac9244c24fab58216a907783748d48cb32dbdc2f1f6fb672bd49f12be4c\n\n5c18c3e6f7ac0d0ac2b5fa9a6435ee90d6bd77995f85bed9e948097891d42ca2\n\n5cda7d8294a8804d09108359dd2d96cdf4fdcf22ec9c00f0182d005afff76743\n\n5f0db8216314da1f128b883b918e5ac722202a2ae0c4d0bf1c5da5914a66778e\n\n6010d44cdca58cdec4559040e08798e7b28b9434bda940da0a670c93c84e33cd\n\n60b65ebb921dca4762aef427181775d10bbffc30617d777102762ab7913a5aa1\n\n6146aedfe47597606fb4b05458ec4b99d4e1042da7dc974fa33a57e282cd7349\n\n6245b74b1cc830ed95cb630192c704da66600b90a331d9e6db70210acb6c7dfa\n\n67cd191eb2322bf8b0f04a63a9e7cb7bc52fb4a4444fcb8fed2963884aede3aa\n\n\n-----\n\n68f77119eae5e9d2404376f2d87e71e4ab554c026e362c57313e5881005ae79e\n\n69e679daaaff3832c39671bf2b813b5530a70fb763d381f9a6e22e3bc493c8a9\n\n6faa7deb1e1e0c3a7c62c2bb0ecdfa56b6e3ba4fe16971ec4572267ac70b9177\n\n6fb397e90f72783adec279434fe805c732ddb7d1d6aa72f19e91a1bf585e1ea5\n\n70db041fb5aadb63c1b8ae57ba2699baa0086e9b011219dcebcccbf632017992\n\n7673f5468ba3cf01500f6bb6a19ce7208c8b6fc24f1a3a388eca491bc25cd9cd\n\n77805a46f73e118ae2428f8c22ba28f79f7c60aeb6305d41c0bf3ebb9ce70f94\n\n788265447391189ffc1956ebfec990dc051b56f506402d43cd1d4de96709c082\n\n7be613237b57fbc3cb83d001efadeed9936a2f519c514ab80de8285bdc5a666c\n\n7dbb7fab4782f5e3b0c416c05114f2a51f12643805d5f3d0cd80d32272f2731a\n\n7ec77e643d8d7cc18cc67c123feceed91d10db1cc9fa0c49164cba35bb1da987\n\n860f165c2240f2a83eb30c412755e5a025e25961ce4633683f5bc22f6a24ddb6\n\n868ed69533fac80354a101410d3dd0a66f444385c6611cc85c5b0be49db2d6fd\n\n89759e56d5c23085e47d2be2ce4ad4484dfdd4204044a78671ed434cec19b693\n\n8b7fb1cd5c09f7ec57ccc0c4261c0b4df0604962556a1d401b9cbfd750df60ba\n\n8d6e31c95d649c08cdc2f82085298173d03c03afe02f0dacb66dd3560149184f\n\n942d763604d0aefdff10ce095f806195f351124a8433c96f5590d89d809a562f\n\n98a5f30699564e6d9f74e737a611246262907b9e91b90348f7de53eb4cf32665\n\n9e6011d6380207e2bf5105cde3d48e412db565b92cdc1b3c6aa15bd7bd4b099f\n\na106e0a6b7cc30b161e5ea0b1ec0f28ab89c2e1eb7ba2d5d409ddbabc3b037e6\n\na2b905c26e2b92e63de85d83e280249258cb21f300d8c4a3a6bdb488676e9bcf\n\na4a86e96f95f395fcf0ceb6a74a2564f4ba7adbe1b40cc702b054427327a0399\n\na8192656dd1db0be4cec9d03b4d10e0529d9c52c899eda8d8e72698acfb61419\n\na8f776bd3a9593e963b567ce790033fec2804ea0afb40a92d40e21d8f33d066f\n\nb4966f8febdba6b2d674afffc65b1df11e7565acbd4517f1e5b9b36a8c6a16ed\n\n\n-----\n\nbb25f1a73d095d57b2c8c9ac6780e4d412ddf3d9eef84a54903cc8e4eaefc335\n\nbc82bce004afb6424e9d9f9fc04a84f58edf859c4029eda08f7309dbeec67696\n\nc30198e0b0e470d4ac8821bd14bb754466e7974f1c20be8b300961e9e89ed1ea\n\ncaabc45e59820a4349db13f337063eddede8a0847ae313d89a800f241d8556c8\n\nd3ef6643ad529d43a7ec313b52c8396dc52c4daad688360eb207ee91a1caf7b2\n\ne3c818052237bb4bb061290ab5e2a55c3852c8a3fef16436b1197e8b17de2e18\n\ne56ffcf5df2afd6b151c24ddfe7cd450f9208f59b5731991b926af0dce24285a\n\ne8704bf6525c90e0f5664f400c3bf8ff5da565080a52126e0e6a62869157dfe3\n\ne8a454cd8b57a243f0abeec6945c9b10616cfdcc4abfb4c618bfc469d026d537\n\neac776c3c83c9db1a770ffaf6df9e94611c8293cbd41cb9257148603b8f2be0b\n\nead0f3e6f0ca16b283f09526d09e8e8cba687dab642f0e102e5487cb565bf475\n\nf011a136996fa53fdbde944da0908da446b9532307a35c44ed08241b5e602cc9\n\nf2a2f4fa2ed5b2a94720a4661937da97ab21aa198a5f8c83bb6895aa2c398d22\n\nf62f21ee7e642f272b881827b45ceb643c999a742e1d3eac13d1ba014d1e7f67\n\nf9f0973dc74716b75291f5a9b2d59b08500882563011d1def2b8d0b1b9bbb8ae\n\n### C2:\n\ntheme[[.]]blogsite[.]org\n\ncortana[.]homelinux[.]com\n\nword[.]webhop[.]info\n\nwork[.]windownoffice[.]com\n\ncortanasyn[.]com\n\ne[.]browsersyn[.]com\n\nsyn[.]servebbs[.]com\n\nservice[.]windown-update[.]com\n\ncheck[.]homeip[.]net\n\n\n-----\n\noutlook[.]updateoffices[.]net\n\nmail[.]fptservice[.]net\n\noffice[.]windown-update[.]com\n\ncortanazone[.]com\n\nbeta[.]officopedia[.]com\n\nvideos[.]dyndns[.]org\n\nservice[.]serveftp[.]org\n\nsyn[.]browserstime[.]com\n\ncheck[.]webhop[.]org\n\nristineho[.]com\n\n## Appendix A:\n\nCobalt Strike Beacon contains the hard-coded configuration data in its body. JPCERT\npublished an article about the structure of the configuration. The sample we obtained has the\nfollowing configuration (Figure 10) and connects to the C2 server,\nhttps:// b.cortanazone[.]com.\n\n\n-----\n\n_Figure 10: Cobalt Strike Beacon configuration_\n\n## Appendix B:\n\nFigure 11 shows some of the contents of the individual RAR files. All the .exe files are copies\nof Windows Word and the associated ‘wwlib.dll’ file is the malicious downloader\nDLL KerrDown, which is sideloaded when the .exe file gets executed.\n\n\n-----\n\n_Figure 11: RAR archives with malicious DLL for sideloading_\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\n\n-----\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-01 - Tracking OceanLotus’ new Downloader, KerrDown.pdf"
    ],
    "report_names": [
        "2019-02-01 - Tracking OceanLotus’ new Downloader, KerrDown.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "93542ae8-73cb-482b-90a3-445a20663f15",
            "created_at": "2022-10-25T16:07:24.058412Z",
            "updated_at": "2025-03-27T02:02:10.093621Z",
            "deleted_at": null,
            "main_name": "PKPLUG",
            "aliases": [
                "Stately Taurus"
            ],
            "source_name": "ETDA:PKPLUG",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536012,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1653760611,
    "ts_modification_date": 1653760611,
    "files": {
        "pdf": "https://archive.orkl.eu/b1787c783377f3921d0238b34afa74c3318ff3c6.pdf",
        "text": "https://archive.orkl.eu/b1787c783377f3921d0238b34afa74c3318ff3c6.txt",
        "img": "https://archive.orkl.eu/b1787c783377f3921d0238b34afa74c3318ff3c6.jpg"
    }
}