{
    "id": "2cb73935-8d1a-481e-9d17-70264d3cdba5",
    "created_at": "2023-01-12T15:08:47.811385Z",
    "updated_at": "2025-03-27T02:06:07.993256Z",
    "deleted_at": null,
    "sha1_hash": "30b2df31c7ad87d3c66cf52dbca5d76a891d0a13",
    "title": "2021-06-21 - DarkRadiation - Abusing Bash For Linux and Docker Container Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:24:01Z",
    "file_modification_date": "2022-05-28T19:24:01Z",
    "file_size": 4163441,
    "plain_text": "# DarkRadiation | Abusing Bash For Linux and Docker Container Ransomware\n\n**[sentinelone.com/blog/darkradiation-abusing-bash-for-linux-and-docker-container-ransomware/](https://www.sentinelone.com/blog/darkradiation-abusing-bash-for-linux-and-docker-container-ransomware/)**\n\nJune 21, 2021\n\n[While new ransomware families are a common occurrence these days, a recently discovered](https://www.sentinelone.com/blog/the-good-the-bad-and-the-ugly-in-cybersecurity-week-25-2/)\nransomware dubbed ‘DarkRadiation’ is especially noteworthy for defenders. First, it targets\nLinux and Docker cloud containers, making it of particular concern to enterprises. Secondly,\nDarkRadiation is written entirely in Bash, a feature that can make it difficult for some security\nsolutions to identify as a threat. In this post, we’ll take a look at the DarkRadiation Bash\nscripts and show how this novel ransomware can be detected.\n\n\n-----\n\n## What is DarkRadiation Ransomware?\n\n[DarkRadiation appears to have been first noticed in late May by Twitter user @r3dbU7z and](https://twitter.com/r3dbU7z/status/1398501806326652929?s=20)\n[was later reported on by researchers at Trend Micro. It appears to have come to light as part](https://www.trendmicro.com/en_us/research/21/f/bash-ransomware-darkradiation-targets-red-hat--and-debian-based-linux-distributions.html)\nof a set of hacker tools through discovery on VirusTotal.\n\n\n-----\n\nAt this time, we have no information on delivery methods or evidence of in-the-wild attacks.\nHowever, analysis of its various components suggest that the actors behind its development\nintend on using it as a campaign targeting Linux installs and Docker containers.\n\nThe [ransomware uses a complex collection of Bash scripts and at least half a dozen C2s, all](https://www.sentinelone.com/cybersecurity-101/ransomware/)\nof which appear to be currently offline, to communicate with Telegram bots via hardcoded\nAPI keys.\n\n\n-----\n\nDarkRadiation is part of a larger collection of hacking scripts\nThe DarkRadiation scripts have a number of dependencies including `wget,` `curl,`\n```\nsshpass, pssh and openssl . If any of these are not available on the infected device,\n\n```\nthe malware attempts to download the required tools using YUM (Yellowdog Updater,\nModified), a python-based package manager widely adopted by popular Linux distros such\nas RedHat and CentOS.\n\nDarkRadiation checks for and installs dependencies\nCode artifacts in the same script show the ransomware attempting to stop, disable and\ndelete the `/var/lib/docker directory, used by Docker to store images, containers, and`\nlocal named volumes. Despite the name of the function, `docker_stop_and_encrypt, it`\n\n\n-----\n\nappears that at least in its current form it acts purely as a wiper for Docker images. However,\nas other researchers have noted, several versions of these scripts were found on the threat\nactor’s infrastructure, suggesting that they may be in nascent development and not yet ready\nfor full deployment.\n\nThe ransomware appears to wipe the main Docker directory\nIn order to facilitate communication, the ransomware relies on another script,\n```\nbt_install.sh, to set up and test a Telegram bot, written to the local file path at\n\"/usr/share/man/man8/mon.8.gz\" . Fans of the popular science fiction trilogy “The\n\n```\n[Matrix” may recognize the test message, “Knock, knock, Neo.” included in the](https://youtu.be/1o6cTUyfX7k?t=43) `bt_install`\nshell script.\n\n\n-----\n\nDarkRadiation threat actors appear to be fans of The Matrix Trilogy\nThe same script also installs and enables a service called “griphon” as a way to gain\npersistence. If the malware has been run with admin rights, the service is installed as\n“griphon.service” at the default `\"/etc/systemd/system/\" path and ensures the Telegram`\nbot is brought up and running each time the device is re-booted.\n\nA systemd service called ‘Griphon’ is installed for persistence\nThe `ExecStart command ensures that the bot is started either on system boot or by`\nmanual invocation of the service via `systemctl .`\n\n## Bash Ransomware Script and Obfuscation\n\n\n-----\n\nDarkRadiation embedded ransomware note\nThe ransomware script exists in several versions called `supermicro_cr and` `crypt . An`\nobfuscated version in the attacker’s repository uses a simple technique that we’ve seen\n[before in shell script-based malware, which has been common on macOS for a while. The](https://www.sentinelone.com/blog/coming-out-of-your-shell-from-shlayer-to-zshlayer/)\ntechnique involves assigning random variables to “chunks” of script code.\n\nThe ransomware script is obfuscated with node-bash-obfuscate\nComments left in the code in Russian suggest the author used an npm package called nodebash-obfuscate’.\n\n\n-----\n\nTranslated comments reveal the hacker’s choice of obfuscation tool\nDespite the apparent complexity of the obfuscated script, all such scripts can be easily\ntranslated back to plain text simply by replacing the `eval command with` `echo, which`\nprints the script to stdout without executing it.\n\nOn execution, the script creates a new user with the name “ferrum”. In some versions, the\npassword is downloaded from the attacker’s C2 via `curl and in others it is hardcoded with`\nstrings such as `“$MeGaPass123#” .`\n\nThe ransomware script creates a new user and password\nFor the purpose of avoiding accidental discovery, the ransomware writes itself to\n```\n\"/usr/share/man/man8/\", a folder typically reserved for the man pages associated with\n\n```\nSystem administration controls: in other words, a directory not likely to be traversed by\n\n\n-----\n\nchance even by admin users. Moreover, in order to facilitate privilege escalation, the script\nuses a fairly blunt but often wildly effective ‘social engineering’ technique: by simply asking\nthe user for the required privileges.\n\nThe execution chain is caught by the SentinelOne agent and reflected in the Management\nconsole:\n\nThe chain of execution as seen in the SentinelOne console\nIf allowed to execute, the ransomware script uses `openssl (one of the dependencies we`\nnoted earlier) to encrypt files enumerated via the `grep and` `xargs utilities. Encrypted files`\nare appended with the extension `.☢`, and the encryption key is sent to the attacker’s C2\nvia the Telegram bot.\n\nopenssl is used for file encryption\n\n## How SentinelOne Deals With DarkRadiation\n\nFor [endpoints protected by SentinelOne, DarkRadiation is blocked from the outset, so there’s](https://www.sentinelone.com/cybersecurity-101/endpoint-security/)\nno risk of any data being encrypted by the malware. As always, it’s safest to have your\nSentinelOne endpoints use the ‘Protect’ policy to ensure that threats are killed and\n\n\n-----\n\nquarantined automatically. When this occurs, the Management console gives a full report of\n[what processes were killed and quarantined, and shows associated MITRE TTPs in the](https://www.sentinelone.com/cybersecurity-101/mitre-attack-framework/)\nThreat Indicators panel.\n\nDarkRadiation MITRE TTPs shown in SentinelOne console\nIn the demo video below, we show how SentinelOne deals with DarkRadiation using the\nDetect-only policy.\n\nSentinelOne vs DarkRadiation\n(Bash Ransomware)\n[Watch Now](https://assets.sentinelone.com/ransom/darkradiation-vd?lb-mode=overlay)\n\n## Conclusion\n\nMalware written in shell script languages allows attackers to be more versatile and to avoid\nsome common detection methods. As scripts do not need to be recompiled, they can be\niterated upon more rapidly. Moreover, since some security software relies on static file\nsignatures, these can easily be evaded through rapid iteration and the use of simple\nobfuscator tools to generate completely different script files.\n\nHowever, no amount of iteration or obfuscation changes the nature of what the malware\nactually does on execution. Hence, security teams are advised to use a trusted behavioral\n[detection engine such as SentinelOne Singularity that can detect malicious behavior before it](https://www.sentinelone.com/platform/singularity-cloud/)\ndoes harm to your Linux systems, servers or Docker containers.\n\n\n-----\n\n[If you would like to learn more about how SentinelOne can help secure your organization,](https://www.sentinelone.com/platform/)\n[contact us for more information or request a free demo.](https://www.sentinelone.com/contact/)\n\n## Indicators of Compromise\n\n**SHA256/SHA1**\n\nsupermicro_cr\n\nd0d3743384e400568587d1bd4b768f7555cc13ad163f5b0c3ed66fdc2d29b810\n\ne437221542112affc30e036921e4395b72fe6504\n\nsupermicro_bt\n\n652ee7b470c393c1de1dfdcd8cb834ff0dd23c93646739f1f475f71a6c138edd\n\n5b231b4d834220bf378d1a64c15cc04eca6ddaf6\n\nsupermicro_cr_third (obfuscated)\n\n9f99cf2bdf2e5dbd2ccc3c09ddcc2b4cba11a860b7e74c17a1cdea6910737b11\n\n1bea1c2715f44fbfe38c80d333dfa5a28921cefb\n\nsupermicro_cr_third (deobfuscated)\n\n654d19620d48ff1f00a4d91566e705912d515c17d7615d0625f6b4ace80f8e3a\n\n83881c44a41f35a054513a4fa68306183100e73b\n\ncrypt3.sh\n\n0243ac9f6148098de0b5f215c6e9802663284432492d29f7443a5dc36cb9aab5\n\n919b574a4d000161e52d57b827976b6d9388b33f\n\ncrypt2_first.sh\n\ne380c4b48cec730db1e32cc6a5bea752549bf0b1fb5e7d4a20776ef4f39a8842\n\n215d777140728b748fc264ef203ebd27b2388666\n\nbt_install.sh\n\nfdd8c27495fbaa855603df4f774fe86bbc21743f59fd039f734feb07704805bd\n\n45b57869e3857b50c1d794baba6ceca2641a7cfa\n\nMITRE ATT&CK\n\n[T1027 Obfuscated Files or Information](https://attack.mitre.org/techniques/T1027)\n\n[T1202 Indirect Command Execution](https://attack.mitre.org/techniques/T1202/)\n\n[T1082 System Information Discovery](https://attack.mitre.org/techniques/T1082/)\n\n[T1083 File and Directory Discovery (System Object Enumeration)](https://attack.mitre.org/techniques/T1083/)\n\n[T1486 Data Encrypted for Impact](https://attack.mitre.org/techniques/T1486/)\n\n[T1059.004 Command and Scripting Interpreter: Unix Shell](https://attack.mitre.org/techniques/T1059/004/)\n\n[T1059 Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059/)\n\n[T1014 Rootkits](https://attack.mitre.org/techniques/T1014/)\n\n[T1548 Abuse Elevation Control Mechanism](https://attack.mitre.org/techniques/T1548/)\n\n[T1543 002 Create or Modify System Process: Systemd Service](https://attack.mitre.org/techniques/T1543/002/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-21 - DarkRadiation - Abusing Bash For Linux and Docker Container Ransomware.pdf"
    ],
    "report_names": [
        "2021-06-21 - DarkRadiation - Abusing Bash For Linux and Docker Container Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536127,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653765841,
    "ts_modification_date": 1653765841,
    "files": {
        "pdf": "https://archive.orkl.eu/30b2df31c7ad87d3c66cf52dbca5d76a891d0a13.pdf",
        "text": "https://archive.orkl.eu/30b2df31c7ad87d3c66cf52dbca5d76a891d0a13.txt",
        "img": "https://archive.orkl.eu/30b2df31c7ad87d3c66cf52dbca5d76a891d0a13.jpg"
    }
}