{
    "id": "2cc4db8f-2e83-4afc-a64a-1afb304356e0",
    "created_at": "2023-01-12T15:06:15.478201Z",
    "updated_at": "2025-03-27T02:05:23.320615Z",
    "deleted_at": null,
    "sha1_hash": "13d73d81f6d7aa7feed1d3992aaaab467942cb5a",
    "title": "2019-12-04 - Buer, a new loader emerges in the underground marketplace",
    "authors": "",
    "file_creation_date": "2022-05-28T15:57:03Z",
    "file_modification_date": "2022-05-28T15:57:03Z",
    "file_size": 3870046,
    "plain_text": "# Buer, a new loader emerges in the underground marketplace\n\n**[proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)**\n\n\nDecember 4, 2019\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nBuer, a new loader emerges in the underground marketplace\n\nDecember 04, 2019 Kelsey Merriman | Dennis Schwarz | Kafeine | Axel F | Proofpoint Threat Insight Team\n\n\n-----\n\n## Overview\n\nFor several years, Proofpoint researchers have been tracking the use of first-stage downloaders, which are used by threat actors to install\nother forms of malware during and after their malicious email campaigns. In particular, over the last two years, these downloaders have\nbecome increasingly robust, providing advanced profiling and targeting capabilities.\n\nMore importantly, downloaders and other malware like botnets and banking Trojans have displaced ransomware as primary payloads, giving\nthreat actors the flexibility to deploy a range of malware in secondary infections. For example, one of the most prevalent, Smoke Loader, has\nbeen used extensively to drop payloads such as Ursnif and The Trick banking Trojans, as well as using its own modules for credential and\nother information and data-stealing, among other malicious functions.\n\nSince late August 2019, Proofpoint researchers have been tracking the development and sale of a new modular loader named Buer by its\nauthors. Buer has features that are highly competitive with Smoke Loader, is being actively sold in prominent underground marketplaces, and\nis intended for use actors seeking a turn-key, off-the-shelf solution.\n\n## Campaigns\n\n### August 28, 2019\n\nOn August 28, Proofpoint researchers observed malicious email messages that appear to reply to earlier legitimate email conversations. They\ncontained Microsoft Word attachments that use Microsoft Office macros to download the next stage payload.\n\n_Figure 1: Example Microsoft Word attachment used in the August 28, 2019, campaign_\n\nWe observed the next-stage payload being downloaded from URLs including:\n\n**hxxp://jf8df87sdfd.yesteryearrestorations[.]net/gate.php**\n\n**hxxp://93345fdd.libertycolegios[.]com/gate.php**\n\n\n-----\n\ne d opped pay oad as a ed **e** **ste e** **s o** **e** **ste e33 e e (a** a g co e t o t at t e acto used du g t at pe od) stead\nof the [Dreambot variant of Ursnif frequently associated with this actor, the payload was an undocumented loader not previously observed in](https://www.proofpoint.com/us/threat-insight/post/ursnif-variant-dreambot-adds-tor-functionality)\nthe wild.\n\nIn the following weeks over September and October, Proofpoint researchers and other members of the infosec community [1] observed several\ncampaigns from the same actor dropping either the Dreambot variant of Ursnif or this new loader.\n\n### October 10, 2019\n\nOn October 10, Proofpoint researchers observed a malvertising campaign in Australia redirecting to the Fallout Exploit Kit (EK) dropping the\nnew loader.\n\n_Figure 2: HTTP network traffic trace with the Fallout EK exploiting vulnerable browsers_\n\nThe loader then dropped several second-stage malware payloads including KPOT stealer, Amadey, and Smoke Loader.\n\n### October 21, 2019\n\nSince the beginning of July, Proofpoint researchers observed approximately 100 campaigns involving Ostap [2] almost exclusively loading\nseveral instances of The Trick. On the 21, however, Proofpoint researchers observed malicious email messages with subject lines such as\n**“Penalty Notice # PKJWVBP” containing Microsoft Word attachments. The documents contained macros that, if enabled, would execute**\nOstap. We observed Ostap downloading this loader from\n\n**hxxps://185.130.104[.]187/nana/kum.php?pi=18b&[redacted]**\n\nwhich in turn loaded The Trick “ono22” from its C&C: garrisontx[.]us\n\n_Figure 3: Network traffic observed once the macro in the malicious documents is enabled._\n\n\n-----\n\n_Figure 4: Example Microsoft Word attachment used in the October 21 campaign_\n\n## Marketplace & Feature Analysis\n\nBecause we began observing this new loader in use in multiple, distinct campaigns, we expected that it was being sold in an underground\nmarketplace to multiple actors. Moreover, we discovered an advertisement from August 16 on an underground forum describing a loader\nnamed “Buer” that matched the functionality of the malware observed in the above campaigns.\n\nThe features added and advertised in the following weeks match exactly with the evolution of the loader found in these campaigns.\n\nWe retrieved text from a bulletin board posting by the author, in Russian, requesting a payment of $400 for the malware, and offering their\nservices to set up the software for prospective customers in order to get it up and running. The author also notes that updates and bug fixes\nare free of charge, but there is a $25 surcharge for “rebuilding to new addresses.”\n\nThe following text, which Proofpoint also extracted from the underground marketplace, and is presumed to be written by the author of the\nmalware, is a summary of the functionality of the loader as described in the original Russian:\n\n\n-----\n\n_Figure 5. Text from underground forum post describing Buer Loader bot functionality_\n\nSimilarly, the advertisement also lists control panel functionality. The author notes that the modular bot is written entirely in C, using a control\npanel written in .NET Core, emphasizing higher performance in both the client and server due to the choice of programming language.\n\nAs per the description, the bot has a total payload of 55 to 60 kilobytes, functions as a native Windows executable and dynamic link\nlibrary, runs entirely in resident memory, and is compatible with 32-bit and 64-bit Microsoft Windows operating systems.\nThe bot communicates over an HTTPS connection and can be updated remotely from the control panel after the decrypt as well as the\nrebuild.\nThe author also notes that the loader runs as a surrogate process of a trusted application, and functions using User level privileges.\nMost notably, the software will not run in the CIS (former Soviet states, such as Russia).\n\nThe ad describes the following features for the server and control panel:\n\nThe control panel is advertised as also being written in .NET Core, noting easy installation on Ubuntu / Debian Linux server systems.\nThe server provides a wide range of statistics, including counters for online, living, dead, and total bots; a real-time update for the list of\nbots; a file download counter; and an ability to filter systems by type of operating system, access rights of installed bots, and number of\nlogical CPU cores.\nDownloaded files from the infected systems are stored in encrypted form on the server, with access granted by a token.\nMost importantly, like the bots themselves, the author notes that the server does not process API requests sent from within CIS-member\ncountries.\n\nThe forum post also included technical release notes for the Buer loader and control panel (version 1.1.2). In the introduction, the author noted\nthat launching the loader now consists of three steps -- if the first two steps are unsuccessful on the infected system, and the injection into the\nsurrogate process fails (for example, due to incompatibility with the crypt itself), the loader will execute under its own process instead.\n\nThe release notes call out the following for the loader:\n\n[The loader uses a FastFlux architecture.](https://www.proofpoint.com/us/threat-insight/post/sandiflux-another-fast-flux-infrastructure-used-malware-distribution-emerges)\nThe loader works from under a trusted process within Microsoft Windows. The MemLoadEx process now supports x64 [.]exe as a trusted\napplication.\nMemLoad has been updated and now supports native x32 [.]exe.\n\nThe release notes call out the following features for the control panel:\n\n\n-----\n\naccess s acco p s ed us g S t suppo t o se s g ed ce t cates\nSupport for editing tasks in the panel. The user can stop the task during execution and change the payload and the number of\nexecutions.\nAdded the ability to create a task by bot ID. Very suitable for point loads.\nA step-by-step window for creating tasks.\nA notification that allows you to learn about the necessary bots online.\nThe uniqueness of the bot ID has been increased.\nTags have been added to the panel, allowing sorting bots for subsequent actions with them.\nDisplays the computer name in the table.\nImproved crypto compatibility.\nAdded bot history.\n“The panel now expands to Docker” (Docker container support).\n\n**Proofpoint Researcher Note: We presume this feature is for ease of integration into leased Docker hosts, simplifying installation,**\n[although potentially the panel/C&C could be installed on a compromised Docker host.](https://www.zdnet.com/article/a-hacking-group-is-hijacking-docker-systems-with-exposed-api-endpoints/?ftag=TRE49e8aa0&bhid=22108669915048766929494654526268)\nValidation on the file on the panel. Now the panel will not miss the file that the loader will not be able to download and will notify the client\nabout this.\nTasks can now be repeated.\n\nFinally, the author described the following technical changes for version 1.1.9. These are noteworthy as they demonstrate that the malware is\nunder active, professional development.\n\nThe loader has acquired a new method for launching External for local files. The advantages of the method are uniqueness and no\nCreateProcess / ShellExecute through the loader. The launch produces a trusted process without any commands to it.\nThe panel has the ability to tag all bots that have performed a specific task. This will allow the user to distribute the payload to certain\ngroups of bots.\nImplemented integration API. Available documentation for it.\nAdded the ability to send a file by reference in proxy mode. The file is transferred to the bot in encrypted form.\nThe bug of counting bots by country has been fixed and other improvements have been added.\n\n## Control Panel Screenshots\n\nThe following control panel screenshots were included in the underground advertisement, showing some of the back end capabilities available\nto customers, including telemetry monitoring, host filtering, and more.\n\n\n-----\n\n_Figure 6: Control panel login UX for the Buer Loader C&C_\n\n\n-----\n\n_Figure 7: Bot telemetry monitoring screen for the Buer control panel._\n\n\n-----\n\n_gu e 8_ _a_ _ode bot te e_ _et y_ _o to_ _g sc ee_ _o t e_ _ue co t o pa e_\n\n_Figure 9: Control panel filter view depicting remote bots filtered by Microsoft Windows architecture._\n\n\n-----\n\n_Figure 10: Control panel view depicting file management for loader tasks_\n\n_Figure 11: Control panel view of remote bots sorted by user rights._\n\n\n-----\n\n_Figure 12: Control panel view, task status_\n\n_Figure 13: Control panel view, creation of a task_\n\n\n-----\n\n## Malware Analysis\n\nBuer Loader is a new downloader malware that downloads and executes additional payloads.\n\n### Anti-analysis features\n\nThe loader contains some basic anti-analysis functionality:\n\nChecks for debuggers by inspecting the NtGlobalFlag in the Process Environment Block (PEB) and Thread Environment Block (TEB)\nChecks for virtual machines using the Red Pill [4], No Pill [5], and related mechanisms\nChecks locale to make sure the malware is not running in specific countries (Figure 14)\n\n_Figure 14: Malware check to make sure it is not running in specific countries_\n\n### Persistence\n\nPersistence is set up by configuring a Registry RunOnce entry. Depending on the version, the registry entry will execute the malware directly\nor schedule a task to execute it.\n\n### Encrypted Strings\n\nThis sample contains a function to encrypt strings.\n\n\n-----\n\n_gu e_ _5_ _ec ypt o_ _seque ce o st_ _gs_\n\nThe following function is an example of how to decrypt the encrypted strings in Ghidra using Jython:\n\n_Figure 16: Decryption sequence for strings (Python version)_\n\n_Figure 17: Example string decryptions_\n\n### Windows API Calls\n\nThis sample uses a hashing algorithm to resolve most of its Windows API calls. The hashing algorithm ensures each character of the API\nname is a capital letter. It then rotates right (ROR) each character by 13 and adds them together.\n\n_Figure 18: Hashing algorithm to resolve Windows API calls_\n\nThe following function is an example of how Python can be used to help resolve the API calls.\n\n\n-----\n\n_Figure 19: Example Python script used to aid in resolving hashed Windows API calls_\n\nThe following table contains a list of some selected hashes used and their corresponding Windows API name:\n\nCreateMutexW 0xed619452\n\nOpenMutexW 0x7bffe25e\n\nCreateProcessW 0xb4f0f46f\n\nWinHttpOpen 0xaf7f658e\n\nWinHttpCrackUrl 0x8ef04f02\n\nWinHttpConnect 0x9f47a05e\n\nWinHttpOpenRequest 0x1dd1d38d\n\n_Table 1: Windows API calls with selected hashes_\n\n### Command and Control\n\nCommand and control (C&C) functions are handled via HTTP(S) GET requests. An example command beacon looks like Figure 20:\n\n_Figure 20: Example command beacon_\n\nThese requests go to the “update API” and contain an encrypted parameter. This parameter can be decrypted by:\n\n1. Base64 decoding\n2. Hex decoding\n3. RC4 decryption (the key used in the analyzed samples was “CRYPTO_KEY”)\n\nAn example of the plaintext parameter is:\n\n**_88a5e68a2047fa5ebdc095a8500d8fae565a6b225ce94956e194b4a0e8a515ae|ab21d61b35a8d1dc4ffb3cc4b75094c31b8c00de3ffaaa17ce1ad_**\n**_7|x64|4|Admin|RFEZOWGZPBYYOI_**\n\nIt contains pipe-delimited data consisting of:\n\nBot ID (SHA-256 hex digest of various system parameters such as hardware profile GUID and name, computer name, volume serial\nnumber, and CPUID)\nAn SHA-256 hash of its own executable image\nWindows version\nArchitecture type\n\n\n-----\n\nu be o p ocesso s\nUser privileges\nComputer name\n\nAn example command beacon response is shown in Figure 21:\n\n_Figure 21: Example command beacon response_\n\nIt can be decrypted similarly to the request parameter above, except that the hex-encoded bytes are separated by dash characters. An\nexample plaintext response is shown in Figure 22:\n\n_Figure 22: Plaintext command beacon response_\n\nThe decrypted text is a JSON object containing various options on how to download and execute a payload:\n\ntype - there are two types:\n\nupdate - update self\ndownload_and_exec - download and execute\noptions - specifies options for the payload to download:\n\nHash - only applicable to “update” type to determine whether a new update is available\nx64 - whether the payload is 64-bit\nFileType - not used in analyzed samples\nAssemblyType - not used in analyzed samples\nAccessToken - used to download the payload (see below)\nExternal - indicates whether the payload is downloaded from the C&C or an external URL\n\n\n-----\n\net od et od o e ecut o\nexelocal - create process\nmemload - inject and manually load payload\nmemloadex - inject and manually load payload\nloaddllmem - inject and manually load payload\nparameters - parameters to pass on the command line\npathToDrop - not used in analyzed samples\nautorun - indicates whether to setup Registry RunOnce persistence for the payload\nmodules - see Modules section below\ntimeout - not used in analyzed samples\n\nPayloads downloaded from the C&C server are done via requests to the “download API” as seen in Figure 23:\n\n_Figure 23: Downloading payload from C&C_\n\nAn example of the plaintext request parameter is shown below:\n\n**88a5e68a2047fa5ebdc095a8500d8fae565a6b225ce94956e194b4a0e8a515ae|58007044-67d4-4963-9f5f-400dfbc69e74**\n\nIt contains the bot’s ID and “AccessToken” from the command beacon response. If the payload is downloaded from the C&C, it is encrypted\nwith RC4. In the analyzed samples the key was “CRYPTO_KEY”.\n\n### Modules\n\nThe command beacon response contains a “modules” list. Proofpoint researchers have not observed Buer modules being used in the wild yet,\nbut based on the code this list will contain module AccessTokens. The module file name is queried by sending an AccessToken to the\n**“module API” of the C&C. The module will then be downloaded using the “downloadmodule API”. Once downloaded and decrypted, it is**\nloaded using the “loaddllmem” method.\n\n## Conclusion\n\nA new downloader, Buer, has appeared recently in a variety of campaigns, via malvertising leading to exploit kits; as a secondary payload via\nOstap; and as a primary payload downloading malware such as The Trick banking Trojan.\n\nThe new loader has robust geotargeting, system profiling, and anti-analysis features and is currently being marketed on underground forums\nwith value-added setup services. The Russian-speaking author(s) is actively developing the downloader with sophisticated control panels and\na rich feature set, making the malware competitive in underground markets.\n\nThe downloader is written in C while the control panel is written in .NET core, indicating optimization for performance and small download\nfootprint, as well as the ability to easily install the control panel on Linux servers -- built-in support for Docker containers will further facilitate its\nproliferation on rented hosts used for malicious purposes, and potentially, compromised hosts as well. The latter capability is included in its\nadvertised features and release notes.\n\n## References\n\n[1] [https://twitter.com/malware_traffic/status/1182456890095259652](https://twitter.com/malware_traffic/status/1182456890095259652)\n\n[2] [https://www.cert.pl/en/news/single/ostap-malware-analysis-backswap-dropper/](https://www.cert.pl/en/news/single/ostap-malware-analysis-backswap-dropper/)\n\n\n-----\n\n[3] ttps // p oo po t co /us/t eat [s g t/post/ostap be de](https://www.proofpoint.com/us/threat-insight/post/ostap-bender-400-ways-make-population-part-with-their-money) 00 ays a e popu at o pa t t t e o ey\n\n[4] [https://www.aldeid.com/wiki/X86-assembly/Instructions/sidt](https://www.aldeid.com/wiki/X86-assembly/Instructions/sidt)\n\n[5] [https://www.aldeid.com/wiki/X86-assembly/Instructions/sldt](https://www.aldeid.com/wiki/X86-assembly/Instructions/sldt)\n\n## Indicators of Compromise (IOCs)\n\n**IOC** **IOC Type** **Description**\n\nfa699eab565f613df563ce47de5b82bde16d69c5d0c05ec9fc7f8d86ad7682ce sha256 2019-08-28\n\nhttp[://45.76.247[.177:8080/api/update/ URL Buer C&C callback\n\n2019-08-28\n\n6c694df8bde06ffebb8a259bebbae8d123effd58c9dd86564f7f70307443ccd0 sha256 2019-09-03\n\n197163b6eb2114f3b565391f43b44fb8d61531a23758e35b11ef0dc44d349e90 sha256 2019-09-24\n\nhttps[://173.212.204[.171/api/update/ URL Buer C&C callback\n\n2019-09-24\n\n9e8db7a722cc2fa13101a306343039e8783df66f4d1ba83ed6e1fe13eebaec73 sha256 2019-10-16\n\n(Fallout Drop)\n\nhttp[://134.0.119[.53:8080/api/update/ URL Buer C&C callback\n\n2019-10-16\n\nab21d61b35a8d1dc4ffb3cc4b75094c31b8c00de3ffaaa17ce1ad15e876dbd1f sha256 2019-10-21\n\n(Ostap drop)\n\nhttps[://garrisontx[.us/api/update/ URL Buer C&C callback\n\n2019-10-21\n\nhttps[://185.130.104[.187/nana/kum.php?pi=18b URL Ostap instance dropping Buer - 2019-10-21\n\n753276c5887ba5cb818360e797b94d1306069c6871b61f60ecc0d31c78c6d31e sha256 Buer 2019-11-28\n\n\nffload01[.top|185.125.58[.11\n\nffload01[.top|185.186.141[.129\n\n## ET and ETPRO Suricata/Snort Signatures\n\n2029077 || ET TROJAN Buer Loader Update Request\n\n2029079 || ET TROJAN Buer Loader Response\n\n2029078 || ET TROJAN Buer Loader Download Request\n\n2839684 || ET TROJAN Buer Loader Successful Payload Download\n\n2029080 || SSL/TLS Certificate Observed (Buer Loader)\n\nSubscribe to the Proofpoint Blog\n\n\ndomain|IP Buer C&C 2019-11-28\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-04 - Buer, a new loader emerges in the underground marketplace.pdf"
    ],
    "report_names": [
        "2019-12-04 - Buer, a new loader emerges in the underground marketplace.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535975,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653753423,
    "ts_modification_date": 1653753423,
    "files": {
        "pdf": "https://archive.orkl.eu/13d73d81f6d7aa7feed1d3992aaaab467942cb5a.pdf",
        "text": "https://archive.orkl.eu/13d73d81f6d7aa7feed1d3992aaaab467942cb5a.txt",
        "img": "https://archive.orkl.eu/13d73d81f6d7aa7feed1d3992aaaab467942cb5a.jpg"
    }
}