{
    "id": "2ccdb67e-0a8a-46e2-bda2-ff110b8f9ee6",
    "created_at": "2023-01-12T15:09:35.836532Z",
    "updated_at": "2025-03-27T02:15:49.362023Z",
    "deleted_at": null,
    "sha1_hash": "c4ce3f0616ba16b6fb058bdad12744a13e26ecfb",
    "title": "2021-11-20 - Corporate Loader -Emotet-- History of -X- Project Return for Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-27T21:45:01Z",
    "file_modification_date": "2022-05-27T21:45:01Z",
    "file_size": 1095820,
    "plain_text": "# Corporate Loader \"Emotet\": History of \"X\" Project Return for Ransomware\n\n**[advintel.io/post/corporate-loader-emotet-history-of-x-project-return-for-ransomware](https://www.advintel.io/post/corporate-loader-emotet-history-of-x-project-return-for-ransomware)**\n\nAdvIntel November 19, 2021\n\nNov 19, 2021\n\n7 min read\n\n_By Yelisey Boguslavskiy & Vitali Kremez_\n\n\n-----\n\n_AdvIntel deep-dives into the contemporary threat landscape illustrating how Emotet’s return_\n_might re-shift the ransomware ecosystem._\n\n**Executive Summary - Why Corporate Loader Returned?**\n\nThe November 14, return of Emotet (project \"X\" internally) correlates with two long-term\ndevelopments in the ransomware ecosystem: 1) unfulfilled loader commodity demand 2)\ndecline of the decentralized RaaS (Ransomware-as-a-Service) model, and the return of the\nmonopoly of organized crime syndicates such as Conti.\n\nAdvIntel’s visibility into the adversary space enables us to confirm that it was the former Ryuk\nmembers who were able to convince former Emotet operators to set up a backend and a\nmalware builder from the existing repository project to return to business in order to restore\nthe TrickBot-Emotet-Ryuk triad. This partnership enables the Conti syndicate to answer the\nunfulfilled demand for initial accesses on an industrial scale, while competitor groups such as\nLockBit or HIVE will need to rely on individual low-quality access brokers. As a result, Conti\ncan further advance their goal of becoming a ransomware monopolist.\n\n\n-----\n\n_Image 1: Emotet progression from ransomware partnership taxonomy._\n\n**Threat Landscape**\n\nOn November 14, AdvIntel identified the return of the Emotet loader which has been inactive\nsince January 2021 after a law enforcement takedown. AdvIntel's investigative hypothesis is\nthat this return has been shaped by the contemporary ransomware landscape and will have\na major impact on the development of ransomware.\n\nThis resurgence of Emotet will likely cause the largest threat ecosystem shift in 2021 and\nbeyond due to three reasons:\n\n\n-----\n\n1. Emotet s unmatched continuous loader capabilities\n\n2. The correlation between these capabilities and the demanded of the contemporary\n\ncybercrime market\n\n3. The return of the TrickBot-Emotet-Ransomware triad resulted from the first two points.\n\n**_Emotet - “The Most Dangerous Loader”_**\n\nEmotet is a loader botnet and a criminal syndicate managing this botnet using a loader-as-aservice model. This means that Emotet offers the capabilities of a loader to deliver the\npayload of its customer.\n\nEmotet became successful in developing this model (and in choosing the “right” ransomware\ncustomers); the Department of Homeland Security defined it as one of the most costly and\ndestructive forms of malware, leaving no sector from government to private industry safe.\n\nEmotet’s strategic, operational, and tactical agility was executed through a modular system\nenabling them to tailor payload functionality and specialization for the needs of specific\ncustomers. At the same time, Emotet operators leveraged understanding of social issues\nand conflicts that enabled them to weaponize the socio-political domain for email spam\ncampaigns.\n\nOverall, Emotet's success was constituted by three things.\n\n1. Technical delivery of the payload\n\n2. Creative and persistent approach to spam dissemination\n\n3. Alliances with top-tier groups such as TrickBot and Ryuk\n\n**_Unfulfilled “Corporate” Loader Demand_**\n\n\n-----\n\nMost likely because no other groups were able to replicate such capabilities, after leaving\ncyberspace in January 2021, Emotet left a vacuum that was not filled even with\nMASSLOADER, also known as Hancitor. Other botnets like QBot attempted to step in but\nlargely failed as a persistent and continuous loader system.\n\nThis created a major interruption within the ransomware supply chains.\n\nAfter the takedown of Emotet, the demand for an efficient source of high-quality access and\nadvanced dissemination was not matched with a proper supply. According to AdvIntel’s\nsensitive source intelligence, even top-tier groups who have their venues for organized\naccess supply-chains such as Conti (relies on TrickBot, BazarLoader, and Cobalt Strike\nspam delivery) or DoppelPaymer (relies on Dridex) express concerns regarding the lack of\ninitial accesses.\n\nThis discrepancy between supply and demand makes Emotet’s resurgence important. As\nthis botnet returns, it can majorly impact the entire security environment by matching the\nransomware groups’ fundamental gap.\n\n_Image 2: Emotet backend displays the partnership profit cut._\n\n**_Ransomware Market Monopolization_**\n\n\n-----\n\nIn the Spring and Summer of 2021, most of the major ransomware-as-a-service (RaaS)\ngroups including REvil, Darkside, Avaddon, Blackmatter, Babuk, and others quit the\ncriminal market. Remaining groups such as LockBit and HIVE faced a major decline in\npayments from victims due to extensive use of backups and more advanced defenses.\n\nThis decline of RaaS made the ransomware landscape look closer to its pre-2019 shape in\nwhich long-term strategic criminal partnerships between top-tier organized crime groups\nenabled unprecedented revenues. This possibly motivated larger groups including Conti\nwhich has been fulfilling the vacuum left by REvil and other RaaSes to consider\nreestablishing the Emotet liaison.\n\nThis prospective partnership could be motivated by a major success of a previous alliance\nachieved in 2018 between Emotet, TrickBot, and Ryuk. These centralized, highly organized\ngroups with advanced technical and social skills primarily relied on encryption skills, high\ndiscipline, teamwork, division of labor, and the highest levels of centralization and\norganization. After joining efforts, they dominated the cybercrime environment up until 2019.\n\nIn 2019-2021, this monopoly was challenged by RaaSes, their decentralized affiliates, and\ntheir emphasis on data exfiltration and not data encryption. However, after two years this\nmodel started to prove unsustainable.\n\nExit-scams, lack of proper coordination and organization (greedy affiliates attacking critical\nindustry such as Colonial Pipeline), affiliates using low-level access sellers and brokers, and\nother organizational challenges lead to RaaS closings by late 2021. Moreover, simple data\ntheft, which was at the center of RaaS models, briefly led to the situation in which the victims\nsimply allow criminals to dump the data and decline to pay the ransom.\n\nWith RaaSes disappearing, traditional groups: Ryuk (in the form of Conti), TA505, and\nEvilCorp regained their dominance in the threat hierarchy. They have become the center of\ngravity for the talented malware specialists who are massively leaving disbanded RaaSes in\norder to find a stable and ordered operational environment.\n\n\n-----\n\nThis new environment made Emotet s return a highly anticipated event. For Conti, the\nsyndicate had full capacity to approach Emotet once again, being the ransomware “top-dog”,\nthey already had Ryuk’s former member on board and had maintained the alliance with\nTrickBot. Emotet was the last missing part.\n\n**_The Newer Crime Triad_**\n\nAs the threat environment is returning to its pre-2019 shape, we see a resurgence of the\ncrime triad that was the pinnacle of the traditional ransomware model - Emotet-TrickBot**Ryuk. In the 2021 landscape, the triad is renewed as TrickBot-Emotet-Conti.**\n\nIn November 2021, AdvIntel utilized our unique visibility into the TrickBot adversarial domain\nin order to spot a major threat shift: Emotet’s partner loader program began resourcing\nexisting TrickBot infections. In other words, TrickBot began dropping Emotet loaders. The\nEmotet compilation timestamp is Sun Nov 14 14:50:34 2021 UTC. The unpacked core is\nknown as \"X.dll\" with the export function \"Control_RunDLL\"\n\n\n-----\n\n_Source: https://twitter[.]com/VK_Intel/status/1460308855129313281_\n\nAt this point, AdvIntel assesses with a high level of confidence that the Conti syndicate will or\nis establishing a new partnership with Emotet and is planning to actively expand the loader\noperations. This is especially important as Conti is known to rely on sustainable methods of\noperations, one of which is a holistic locker lifecycle starting with initial access and ending\nwith victim negotiations. It is likely that this holistic approach and guarantees of operational\nsecurity may become a convening point for Emotet. More importantly, this means that Emotet\nwill likely work with Conti in an exclusive manner.\n\nAt the same time, Emotet’s liaison can solve Conti’s major demand in loader commodities\nand initial accesses. Moreover, it even further positions Conti as a dominating player in the\nthreat landscape. RaaS groups - Conti’s competitors - rely primarily on massive\ndissemination of low-quality spam, abuse of vulnerable and exposed RDPs, and abuse of\nvulnerable VPNs. The majority of the RaaS offensive capabilities come from affiliates who\nwere tasked to harvest initial access themselves and most often relied on underground lowquality credential and log sellers.\n\nEven though, initially, this model enabled a spray-and-pray targeting vulnerable endpoints\nwithout major effort, by 2021, patching, increasing cyber hygiene, more proper audits, and\nother defensive actions made it infeasible to rely on the affiliate-driven attacks.\n\nThis makes Emotet’s persistent spam campaigns a competitive advantage for the Conti\ngroup.\n\n\n-----\n\n**Conclusion**\n\nEmotet’s return is not coincidental, it is caused by major shifts in the overall cybercrime\ndomain. The growing monopolization of the ransomware world, which is rapidly conquered\nby only a few highly-organized criminal corporations, leads to better opportunities for criminal\nventures like the Emotet botnet developers.\n\nLarger organized crime groups have higher profits working together in a liaison. This has\nbeen proven by the alliance of TrickBot, Emotet, and Ryuk: the three major players of the\npre-2019 cybercrime hierarchy. In late 2021, as the smaller actors are losing their impact and\npower, while larger ones are becoming even bigger, the new criminal alliance between\n**TrickBot, Emotet, and Conti, is a logical avenue for criminals.**\n\nThis can become the largest adversarial shift in the last five years since the Emotet\nattempted takedown in January 2020.\n\n**Indicators of Compromise (IOCS):**\n\nThe attached MISP JSON and CSV IOC exportable documents are available.\n\n2021-11-18-ADVINTEL-EMOTET-misp.event.vk.7734.json\n\n.txt\n\nDownload TXT • 119KB\n\n2021-11-18-ADVINTEL-EMOTET-misp.event.vk.7734\n\n.csv\n\nDownload CSV • 2KB\n\n\n-----\n\n**Attack Pattern**\n\nSpearphishing Attachment - T1193\n\nSpearphishing Link - T1192\n\nCommand-Line Interface - T1059\n\nExecution through Module Load - T1129\n\nCreate Account - T1136\n\nAccess Token Manipulation - T1134\n\nCode Signing - T1116\n\nNew Service - T1050\n\nScripting - T1064\n\nRundll32 - T1085\n\nRegsvr32 - T1117\n\nRegsvcs/Regasm - T1121\n\nPowerShell - T1086\n\nMshta - T1170\n\nXSL Script Processing - T1220\n\nKerberoasting - T1208\n\nCredential Dumping - T1003\n\nNetwork Share Discovery - T1135\n\nPassword Policy Discovery - T1201\n\nFile and Directory Discovery - T1083\n\nDomain Trust Discovery - T1482\n\nAccount Discovery - T1087\n\nSystem Information Discovery - T1082\n\nPass the Ticket - T1097\n\n\n-----\n\nPass the Hash - T1075\n\nExploitation of Remote Services - T1210\n\nData Staged - T1074\n\nEmail Collection - T1114\n\nMan in the Browser - T1185\n\nData Obfuscation - T1001\n\nData Encoding - T1132\n\nMulti-hop Proxy - T1188\n\nData Encrypted - T1022\n\nAutomated Exfiltration - T1020\n\nExfiltration Over Command and Control Channel - T1041\n\nData Encrypted for Impact - T1486\n\n**Course of Action**\n\nAutomated Exfiltration Mitigation - T1020\n\nBypass User Account Control Mitigation - T1088\n\nCredential Dumping Mitigation - T1003\n\nCustom Command and Control Protocol Mitigation - T1094\n\nEmail Collection Mitigation - T1114\n\nExfiltration Over Alternative Protocol Mitigation - T1048\n\nExfiltration Over Command and Control Channel Mitigation - T1041\n\nMultilayer Encryption Mitigation - T1079\n\nPass the Hash Mitigation - T1075\n\nPass the Ticket Mitigation - T1097\n\n\n-----\n\n_Our proprietary platform,_ **_[Andariel, provides a mirrored view of criminal and botnet activity,](https://8dfd1b9a-1d6d-4233-af4b-26b0945b72b9.filesusr.com/ugd/f5c79d_5402ee54b71b4dc9945ff3f62ca746a4.pdf)_**\n_which supplies our users with predictive insight that is used to prevent intrusions from_\n_maturing into large-scale threat events such as ransomware attacks._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-20 - Corporate Loader -Emotet-- History of -X- Project Return for Ransomware.pdf"
    ],
    "report_names": [
        "2021-11-20 - Corporate Loader -Emotet-- History of -X- Project Return for Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "838f6ced-12a4-4893-991a-36d231d96efd",
            "created_at": "2022-10-25T15:50:23.347455Z",
            "updated_at": "2025-03-27T02:00:55.449316Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "Andariel",
                "Silent Chollima",
                "PLUTONIUM",
                "Onyx Sleet"
            ],
            "source_name": "MITRE:Andariel",
            "tools": [
                "Rifdoor",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "110e7160-a8cc-4a66-8550-f19f7d418117",
            "created_at": "2023-01-06T13:46:38.427592Z",
            "updated_at": "2025-03-27T02:00:02.830659Z",
            "deleted_at": null,
            "main_name": "Silent Chollima",
            "aliases": [
                "Subgroup: Andariel",
                "Onyx Sleet",
                "PLUTONIUM",
                "OperationTroy",
                "Guardian of Peace",
                "GOP",
                "WHOis Team",
                "Andariel"
            ],
            "source_name": "MISPGALAXY:Silent Chollima",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4a502340-ae29-4a3a-8142-7fbbc2ec79b5",
            "created_at": "2024-05-01T02:03:08.138302Z",
            "updated_at": "2025-03-27T02:05:17.416542Z",
            "deleted_at": null,
            "main_name": "NICKEL HYATT",
            "aliases": [
                "Dark Seoul",
                "Jumpy Pisces ",
                "Onyx Sleet ",
                "RIFLE Campaign",
                "Silent Chollima ",
                "Andariel"
            ],
            "source_name": "Secureworks:NICKEL HYATT",
            "tools": [
                " DTrack",
                " Rifle",
                " UnitBot",
                " Valefor",
                "ActiveX 0-day"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc6e3644-3249-44f3-a277-354b7966dd1b",
            "created_at": "2022-10-25T16:07:23.760559Z",
            "updated_at": "2025-03-27T02:02:09.968605Z",
            "deleted_at": null,
            "main_name": "Andariel",
            "aliases": [
                "APT 45",
                "Andariel",
                "Jumpy Pisces",
                "Onyx Sleet",
                "Operation BLACKMINE",
                "Operation BLACKSHEEP/Phase 3.",
                "Operation Blacksmith",
                "Operation DESERTWOLF/Phase 3",
                "Operation GHOSTRAT",
                "Operation GoldenAxe",
                "Operation INITROY/Phase 1",
                "Operation INITROY/Phase 2",
                "Operation Mayday",
                "Operation VANXATM",
                "Operation XEDA",
                "Plutonium",
                "Silent Chollima",
                "Stonefly"
            ],
            "source_name": "ETDA:Andariel",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536175,
    "ts_updated_at": 1743041749,
    "ts_creation_date": 1653687901,
    "ts_modification_date": 1653687901,
    "files": {
        "pdf": "https://archive.orkl.eu/c4ce3f0616ba16b6fb058bdad12744a13e26ecfb.pdf",
        "text": "https://archive.orkl.eu/c4ce3f0616ba16b6fb058bdad12744a13e26ecfb.txt",
        "img": "https://archive.orkl.eu/c4ce3f0616ba16b6fb058bdad12744a13e26ecfb.jpg"
    }
}