{
    "id": "2d0fe7f7-c5a6-4821-a024-198c3eec10c5",
    "created_at": "2023-01-12T15:04:01.397525Z",
    "updated_at": "2025-03-27T02:09:26.451382Z",
    "deleted_at": null,
    "sha1_hash": "8e79fcb18c42cb18da6bf6f816552ee06f5685ea",
    "title": "2021-07-26 - Wiper Malware Riding the 2021 Tokyo Olympic Games",
    "authors": "",
    "file_creation_date": "2022-05-28T03:11:19Z",
    "file_modification_date": "2022-05-28T03:11:19Z",
    "file_size": 683704,
    "plain_text": "# Wiper Malware Riding the 2021 Tokyo Olympic Games\n\n**[fortinet.com/blog/threat-research/wiper-malware-riding-tokyo-olympic-games](https://www.fortinet.com/blog/threat-research/wiper-malware-riding-tokyo-olympic-games)**\n\nJuly 26, 2021\n\n**[FortiGuard Labs Threat Research Report](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)**\n\nAs society becomes increasingly reliant on technology, and as the world is more connected\nthan ever, attacks by threat actors are not only more prevalent but also more disruptive.\nBecause of the variety of agendas held by different malicious entities including—\ncybercriminals, hacktivists, nation states, etc.—attacks and disruptions targeted at high\nprofile events are easy targets for sowing chaos, distributing malware, capturing or\nexfiltrating data, or even shutting down an event altogether. But regardless of the purpose,\nmass disruption and fear almost always occurs whether that was the intended goal of the\nattackers or not.\n\nIn that context, [FortiGuard Labs has observed new threat samples targeting the 2021 Tokyo](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)\nOlympic games. It includes a wiper component, which, if successful, could cause a disruption\nto targeted machines.\n\n\n-----\n\n## Background\n\nThe most recent attack targeting the Olympics was documented during the 2018 Winter\nGames. The lure was a malicious Word document titled, \"Russian figure skater won the\n_PyeongChang Winter Olympics in South Korea.doc.\" Once the user opened the document,_\nthe sample called and dropped a backdoor component, called Icefog. First discovered in\n2013, the Icefog backdoor was used to attack sectors in the APAC region, with a focus on\nJapan and South Korea.\n\nThe threat actor group responsible for Icefog is very methodical. Targets are carefully\nchosen, and the group seems to know what they are after beforehand. Icefog leveraged\nCVE-2012-0158—a older vulnerability in Windows common controls—relying on the fact that\nmany system administrators, especially those in organizations with a large number of\ncomputers (governments, NGOs, companies, various organizations, etc.), often find patching\ncumbersome. Because of this, older exploits such as this are often a successfully exploited\nvector, even though this particular vulnerability was over 6 years old at the time of the attack.\n\nFast forward to today, and in the wee hours of the Tokyo Olympic Games an interesting\nWiper malware surfaced that reminded us of the same destructive malware that targeted the\nPyeongchang Winter Games. This one is called “Olympic Destroyer.” Its file name is “【至\n急】東京オリンピック開催に伴うサイバー攻撃等発生に関する被害報告について.exe”\n(English translation: “(Urgent) Damage report in relation with cyber attacks targeting the\nTokyo Olympics Games.exe”.\n\nAlthough this particular malware is listed in some OSINT reports as potentially related to the\nOlympic Destroyer sample, we have not observed this to be the case. We also do not have\nany information on the delivery mechanism or methods used by the attacker, nor its intended\ntargets. However, given its ties to the Olympics, and the relative short time frame for\nexploitation, we feel it is important that we share what we know so far about this new wiper\nmalware.\n\n**_Note: This is an evolving situation, and we will update this blog with relevant information_**\n_when available._\n\nFor a historical summary of attacks targeting the Olympic Games, please visit the Cyber\nThreat Alliance whitepaper, for which FortiGuard Labs was a contributing author:\n\n[UPDATING THE 2020 SUMMER OLYMPICS THREAT ASSESSMENT](https://cyberthreatalliance.org/updating-the-2020-summer-olympics-threat-assessment/)\n\n**Q. When was this malware found?**\n\nThe malware was uploaded to a publicly available file repository on July 20, 2021. A relatedth\nfile was subsequently found to have been uploaded to the same repository on July 17,th\n2021. Both files have a PDF icon.\n\n\n-----\n\n**Q. Are Fortinet customers protected?**\n\nYes, FortiGuard Labs has the following AV coverage in place for the malware:\n\nW32/KillFiles.NKP!tr.ransom\n\n[All known IOCs are blocked by FortiEDR’s advanced real-time protection and have already](https://www.fortinet.com/products/endpoint-security/fortiedr)\nbeen added to our cloud intelligence to prevent further execution on customer systems.\nAll network IOC’s are blocked by the WebFiltering client.\n\n**Q. How are the two files related?**\n\nThose files do not work in tangent with each other. The malware uploaded on July 20 hasth\nfile deletion capability. The July 17 sample includes everything but the destruction feature.th\n\n\n**Q. What does the malware do?**\n\nThe destroyer malware searches for and deletes files with the following file extensions in the\ncompromised machine.\n\n.doc\n.docm\n.docx\n.dot\n.dotm\n.dotx\n.pdf\n.csv\n.xls\n.xlsx\n.xlsm\n.ppt\n.pptx\n.pptm\n.jtdc\n.jttc\n.jtd\n.jtt\n.txt\n.exe\n.log\n\nThe malware also silently accesses a benign adult site. Lastly, the threat deletes itself when\nall actions are completed.\n\n\n-----\n\n**Q. Does the malware have worm capability?**\n\nNo, the malware does not have any propagation mechanism.\n\n**Q. Which organization did the malware target?**\n\nCurrently, there is no information available pertaining to the targets or victims.\n\n**Q: Is there any similarity to Olympic Destroyer?**\n\nNo, this malware and Olympic Destroyer do not have any similarity in code.\n\n**Q. Is there any nation state involvement?**\n\nAt this time, there is insufficient evidence to support the involvement of any nation state.\nBased on the relative lack of sophistication of the code, however, it seems unlikely that a\nnation state is behind the malware.\n\n**Q: Is there anything note-worthy about the malware?**\n\nThe malware has one interesting trick up its sleeve to deter researchers—it checks to see\nwhether its own code has been modified. For example, the non-wiper (July 17 ) sampleth\nincludes the following code.\n\nEssentially, what this means is that for certain functions, such as Enum_Procs,\nCheck_Debuggers, and Check_VMX (seen in the above screenshot), the malware checks\nthe first 5 bytes to see if it contains the “0xCC” opcode. This x86 assembly instruction stands\nfor INT3, which tells debuggers to temporarily stop a running program. This method works as\nanother anti-debug check because it detects to see if this function has been disabled.\n\n\nThe wiper (July 20 ) version of this malware goes a step further. Aside from checking forth\n“0xCC”, it also checks for others such as “0xEB” (call), “0xE8” (jmp), and “0xE9” (jmp). These\ninstructions divert program flow away from the intended flow created by the original\nprogrammer. One reason to divert program flow is to hook and monitor Windows APIs. An\nAPI monitor can report what a program is doing while it is running, saving researchers a lot\nof reverse engineering time and effort. However, if any of this code has been modified to\nenable monitoring, the wiper exits without performing any malicious activities. This is yet\nanother anti-analysis check to avoid behavioral monitoring. More information about diverting\n[program flow can be found on the Microsoft Detours website.](https://www.microsoft.com/en-us/research/project/detours/)\n\nAs this is an ongoing event, FortiGuard Labs is monitoring the situation and will provide\nrelevant updates for significant findings as they are uncovered.\n\n## MITRE Classifications\n\n**Defensive Evasion**\n\n\n-----\n\nT1480: Execution Guardrails\nT1070.004: File Deletion\nT1027.002: Software Packing\nT1497: Virtualization/Sandbox Evasion\nT1497.001: System Checks\nT1497.003: Time Based Evasion\n\n**Discovery**\n\nT1083: File and Directory Discovery\nT1057: Process Discovery\nT1518.001: Security Software Discovery\nT1497: Virtualization/Sandbox Evasion\nT1497.001: System Checks\nT1497.003: Time Based Evasion\n\n**Impact**\n\nT1485: Data Destruction\n\n## IOCs\n\n**Sample SHA-256:**\n\n_fb80dab592c5b2a1dcaaf69981c6d4ee7dbf6c1f25247e2ab648d4d0dc115a97_\n\n_c58940e47f74769b425de431fd74357c8de0cf9f979d82d37cdcf42fcaaeac32_\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n_Learn more about Fortinet’s_ _[free cybersecurity training, an initiative of Fortinet’s Training](https://www.fortinet.com/training/cybersecurity-professionals?utm_source=blog&utm_medium=campaign&utm_campaign=Freetraininginitiative)_\n_Advancement Agenda (TAA), or about the_ _Fortinet Network Security Expert_\n_[program, Security Academy program, and](https://training.fortinet.com/local/staticpage/view.php?page=fnsa&utm_source=pr&utm_campaign=fnsa)_ _[Veterans program. Learn more about FortiGuard](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=fortivet)_\n_Labs global threat intelligence and research and the FortiGuard Security Subscriptions and_\n_Services portfolio._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-26 - Wiper Malware Riding the 2021 Tokyo Olympic Games.pdf"
    ],
    "report_names": [
        "2021-07-26 - Wiper Malware Riding the 2021 Tokyo Olympic Games.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d9dfc61-6138-497a-b9da-33885539f19c",
            "created_at": "2022-10-25T16:07:23.720008Z",
            "updated_at": "2025-03-27T02:02:09.944484Z",
            "deleted_at": null,
            "main_name": "Icefog",
            "aliases": [
                "ATK 23",
                "Dagger Panda",
                "Icefog",
                "Red Wendigo"
            ],
            "source_name": "ETDA:Icefog",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Dagger Three",
                "Fucobha",
                "Icefog",
                "Javafog",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1aead86d-0c57-4e3b-b464-a69f6de20cde",
            "created_at": "2023-01-06T13:46:38.318176Z",
            "updated_at": "2025-03-27T02:00:02.803684Z",
            "deleted_at": null,
            "main_name": "DAGGER PANDA",
            "aliases": [
                "IceFog",
                "RedFoxtrot",
                "Red Wendigo",
                "PLA Unit 69010"
            ],
            "source_name": "MISPGALAXY:DAGGER PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535841,
    "ts_updated_at": 1743041366,
    "ts_creation_date": 1653707479,
    "ts_modification_date": 1653707479,
    "files": {
        "pdf": "https://archive.orkl.eu/8e79fcb18c42cb18da6bf6f816552ee06f5685ea.pdf",
        "text": "https://archive.orkl.eu/8e79fcb18c42cb18da6bf6f816552ee06f5685ea.txt",
        "img": "https://archive.orkl.eu/8e79fcb18c42cb18da6bf6f816552ee06f5685ea.jpg"
    }
}