{
    "id": "2d1ba29c-ddd2-46cc-9da3-0ec9f96a27c5",
    "created_at": "2022-10-25T16:48:16.127822Z",
    "updated_at": "2025-03-27T02:08:00.105529Z",
    "deleted_at": null,
    "sha1_hash": "4bb6d80c828654e3bff8610397c39d440371cbf3",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-02-11T08:57:23Z",
    "file_modification_date": "2020-02-11T08:57:23Z",
    "file_size": 409078,
    "plain_text": "# MartyMcFly Malware: Targeting Naval Industry\n\n**[marcoramilli.com/2018/10/17/martymcfly-malware-targeting-naval-industry](https://marcoramilli.com/2018/10/17/martymcfly-malware-targeting-naval-industry/)**\n\nView all posts by marcoramilli October 17, 2018\n\n[Today I’d like to share an interesting analysis of a Targeted Attack found and dissected by Yoroi](http://www.yoroi.company/)\n[(technical details are available here). The victim was one of the most important leader in the field](https://blog.yoroi.company/?p=1829)\nof security and defensive military grade Naval ecosystem in Italy. Everything started from a well\ncrafted email targeting the right office asking for naval engine spare parts prices. The mail was\nquite clear, written in a great language within detailed spare parts matching the real engine parts.\nThe analysed email presented two attachments to the victim:\n\nA company profile, aiming to present the company who was asking for spare parts\nA Microsoft .XLSX where (apparently) the list of the needed spare parts was available\n\nThe attacker asked for a quotation of the entire spare part list available on the spreadsheet. In\nsuch a way the victim needed to open-up the included Microsoft spreadsheet in order to\nenumerate the “fake customer” needs. Opening up The Excel File it gets infected.\nLet’s go deep into that file and see what is happening there. As a first sight the office document\nhad an encrypted content available on OleObj.1 and OleObj.2. Those objects are real Encrypted\nOle Objects where the Encrypted payload sits on “EncryptedPackage” section and information on\nhow to decrypt it are available on “EncryptionInfo” xml descriptor. However, in that time, the\nEncryptionInfo was holding encryption algorithm and additional information regarding the payload\nbut no keys were provided. The question here was disruptive. How Microsoft Excel is able to\ndecrypt such a content if no password is requested to the end user ? In other way if the victim\nopens the document and he/she is not aware about “secret key” how can he/she get infected ?\nAnd why the attacker used an encrypted payload if the victim cannot open it ?\n\nStage1: Encrypted Content\n\nUsing an encrypted payload is quite a common way to evade Antivirus, since the encrypted\npayload changes depending on the used key. But what is the key ?\nWell, on Microsoft Excel there is a common way to open documents called “Read Only”. In “Read\nOnly” mode the file could be opened even if encrypted. Microsoft excel asks to the user a\ndecryption key only if the user wants to save, to print or to modify the content. In that case\nMicrosoft programmers used a special and static key to decrypt the “Read Only” documents.\n[Such a key sees the following value: “VelvetSweatshop” (anice old article on that). Let’s try to](http://www.securiteam.com/windowsntfocus/6K003150KG.html)\n\n\n-----\n\nuse this “key” to try to decrypt the content! The following image shows a brand new stage where a\nvalid extracted xlsx file wraps more objects, we define it as Stage2.\n\nStage2: OleOBj inclusion (click to expand it)\n\nA quick analysis on the Stage2 exposes a new object inclusion. (as shown in picture Stage2:\nOleOBJ inclusion). That object was crafted on 2018-10-09 but it was seen only on 2018-10-12. At\nthis time the extracted object is clear text and not encrypted content was find at all. The following\nimage shows the extracted object from Stage2.\n\nStage2: extracted Payload\n\nIt’s not hard to see what the payload does (CVE-2017-11882 ), but if you run it on a dynamic\nengine you would probably have more chances to prove it. The Payload exploits CVE-201711882 by spawning the Equation Editor, dropping and executing an external PE file. We might\ndefine the Equation Editor dropping and executing as the Stage3. The following image shows the\nconnection to a dropping website performed by EquationEditor (click to magnify it).\n\nStage3: Equation Editor Spawned and connecting to Dropping URL\n\nEvidence of what dissected is shown on the following image (Introducing Stage4) where the\nEquationEditor network trace is provided. We are introducing a new stage: the Stage4.\n**GEqy87.exe (Stage4) is a common windows PE. It’s placed inside an unconventional folder**\n(js/jquery/file/… ) into a compromised and thematic website. This placement usually have a\nduplice target: (a) old school or un-configured IDS bypassing (b) hiding malicious software into\nwell-known and trusted folder structure in order to persist over website upgrades.\n\nIntroducing Stage4. PE file droppend and executed\n\n\n-----\n\nStage4 is pretty interesting per-se. It’s a nice piece of software written in Borland Delphi\n**7. According to VirusTotal the software was “seen in the Wild” in 2010 but submitted only on**\n2018-10-12 ! This is pretty interesting isn’t it ? Maybe hash collision over multiple years ? Maybe\na buggy variable on VirusTotal ? Or maybe not, something more sophisticated and complex is\nhappening out there.\nLooking into GEqy87 is quite clear that\nthe sample was hiding an additional\nwindows PE. On one hand it builds up the\nnew PE directly on memory by running\ndecryption loops (not reversed here). On\nthe other hand it fires up 0xEIP to preallocated memory section in order to\nreach new available code section.\n\nStage4: According to Virus Total\n\nStage5: Windows PE hidden into GEqy87.exe\n\n**Stage5 deploys many evasion tricks such as: GetLastInputIn, SleepX and GetLocalTime to**\ntrick debuggers and SandBoxes. It makes an explicit date control check to 0x7E1 (2017). If the\ncurrent date is less or equals to 0x7E1 it ends up by skipping the real behaviour while if the\ncurrent date is, for example 2018, it runs its behaviour by calling “0xEAX” (typical control flow\nredirection on memory crafted).\n[For more technical details, please have a look here. What it looks very interesting, at least in](https://blog.yoroi.company/?p=1829)\n**my personal point of view, are the following evidences:**\n\n**Assuming there were not hash collisions over years**\n**Assuming VirusTotal: “First Seen in The Wild” is right (and not bugged)**\n\n**We might think that: “we are facing a new threat targeting (as today) Naval Industry**\n**planned in 2010 and run in 2018″.**\nThe name MartyMcFly comes pretty natural here since the “interesting date-back from Virus\nTotal”. I am not confident about that date, but I can only assume VirusTotal is Right.\n[For IoC please visit the analysis from here.](https://blog.yoroi.company/?p=1829)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.10.17_MartyMcFly_Targeting_Naval_Industry/MartyMcFly%20Malware_%20Targeting%20Naval%20Industry.pdf"
    ],
    "report_names": [
        "MartyMcFly Malware_ Targeting Naval Industry"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041280,
    "ts_creation_date": 1581411443,
    "ts_modification_date": 1581411443,
    "files": {
        "pdf": "https://archive.orkl.eu/4bb6d80c828654e3bff8610397c39d440371cbf3.pdf",
        "text": "https://archive.orkl.eu/4bb6d80c828654e3bff8610397c39d440371cbf3.txt",
        "img": "https://archive.orkl.eu/4bb6d80c828654e3bff8610397c39d440371cbf3.jpg"
    }
}