{
    "id": "2d226616-b8f3-4ff8-a925-02ae056bd36e",
    "created_at": "2023-01-12T15:08:02.83123Z",
    "updated_at": "2025-03-27T02:05:25.737061Z",
    "deleted_at": null,
    "sha1_hash": "77650363973c753093cf81f3cf3a78bc30f45fb4",
    "title": "2021-05-04 - Transferring leverage in a ransomware attack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:09:57Z",
    "file_modification_date": "2022-05-28T19:09:57Z",
    "file_size": 967143,
    "plain_text": "# See what it's like to have a partner in the fight.\n\n**redcanary.com/blog/rclone-mega-extortion/**\n\nRansomware has always been about leverage, and sometimes, just encrypting files is\nenough to get a payment. However, as organizations have gotten better about data backup\n[and recovery practices—by implementing policies like the “3-2-1 rule,” for example—](https://www.hpe.com/us/en/insights/articles/protecting-backups-from-ransomware-is-as-easy-as-3-2-1-2005.html)\nransomware operators find themselves having to apply more and different kinds of\nleverage.\n\n[A so-called “double extortion” scheme, where an adversary encrypts files and threatens to](https://www.infosecurity-magazine.com/blogs/double-extortion-ransomware/)\nleak stolen data, is one prominent example of this. In fact, the extortion side of these\nschemes is proving so effective that [one prominent ransomware group recently announced](https://therecord.media/babuk-gang-says-it-will-stop-ransomware-attacks-after-dc-police-incident/)\nthat it would stop encrypting files and focus entirely on extortion moving forward.\n\nWhile piling extortion on top of ransomware is an effective way of increasing leverage, it\nalso adds conspicuous opportunities for detection in the form of illicit file transfer activity.\nThis post offers some detection strategies that security teams can employ to detect\nmalicious file transfer activity. Since we’re publishing this on Star Wars Day, we’d like to\ntake you on an epic detection adventure. May the fourth be with you!\n\n\n-----\n\nWith the growing number of data backup solutions, it can be hard to decipher where\nransomware operators might choose to store their newly stolen data. Detection can be a\nparticular challenge when adversaries choose to use services that are common in\nenterprise environments, like Google Drive or Amazon S3. Luckily for us though, they very\nfrequently use cloud storage services that aren’t normal in enterprise environments. And\neven when adversaries exfiltrate your data to seemingly normal cloud storage providers,\nthey often do so with unusual file transfer utilities.\n\n[Red Canary has observed Mega.io used as an exfiltration destination in multiple incident](https://twitter.com/redcanary/status/1372671150950645761?s=20)\nresponse engagements this year. In these attacks, we’ve also witnessed adversaries\nleveraging legitimate file transfer utilities that Mega provides for free to its customers,\nmaking it easy for users to upload files. We’ve identified exfiltration to file sharing services\nvia other tools as well, but we’re going to focus entirely on Mega-related tools, like\n[MegaSync and](https://github.com/meganz/MEGAsync) [MegaCmd, and on the open source, cross-platform utility Rclone.](https://github.com/meganz/MEGAcmd)\n\n## Asking the right questions\n\nEven if our focus is somewhat limited, the detection principles included in this article can be\nreadily abstracted and applied to additional file transfer utilities and other legitimate tools\nthat are being co-opted for evil. Simply alerting on the use of any of these tools is trivial, and\nwe include various binary metadata below that you can use to accomplish just that.\nUnfortunately, our experience across many short term incident response engagements is\n[that adversaries generally try to evade simple security controls by renaming these tools.](https://redcanary.com/threat-detection-report/techniques/rename-system-utilities/)\n\nAs such, you’ll need to understand the following:\n\nThe authorized file sharing services and utilities in your environment\nThe file sharing services and tools used in your environment, authorized or not\nThe normal installation file paths for these tools\nThe legitimate binary metadata associated with these tools\nThe behaviors typically associated with these tools, including if and where they make\nnetwork connections\n\n## Mega detection\n\nMega provides users with end-to-end encryption of files, a free basic storage tier, and a\nsuite of tools used to transfer files remotely. Rather than hassling with hosting their own file\nsharing servers, adversaries would rather make use of already existing cloud storage,\nespecially ones that allow semi-anonymous payment via cryptocurrency like Bitcoin. Simply\nblocking network connections to Mega-related IP addresses might be a viable security\ncontrol in certain environments, but detecting the actual file transfer utilities that adversaries\nleverage will offer better defense-in-depth against illicit data transfer.\n\n\n-----\n\nOne such utility is Mega s main client application MegaSync, which is designed for routine\nfile transfers and operates similarly to other cloud storage software such as Google Drive\nand Dropbox. In addition to MegaSync, we’ve also observed adversaries using the\ninteractive command line variant known as MegaCmd. This tool offers many of the same\ncapabilities as MegaSync but from the command line.\n\n### Establishing the baseline\n\nUnder normal circumstances, you can expect MegaSync to have the following attributes:\n\n**Metadata attribute** **Value**\n\n\nMetadata attribute :\n**Process name**\n\nMetadata attribute :\n**Process path**\n\nMetadata attribute :\n**Description**\n\nMetadata attribute :\n**Internal name**\n\nMetadata attribute :\n**Product name**\n\n\nValue :\n```\nmegasync.exe\n\n```\nValue :\n```\nC:\\Users\\{user}\\AppData\\Local\\MEGAsync\\MEGAsync.exe\n\n```\n\nValue :\nMEGAsync\n\nValue :\n```\nMEGAsync.exe\n\n```\nValue :\nMEGAsync\n\n\n-----\n\nIt’s important to understand these baseline attributes because adversaries rarely execute\ntools like MegaCmd or MegaSync under their original filename. In this way, successful\ndetection requires that you are able to determine the true identity of a given process\nregardless of what it claims to be. In other words, you might achieve a good detection\noutcome by identifying processes based on metadata like their internal name and then\nalerting when the internal name and the presented process name do not match. Similarly,\nyou may be able to achieve success by looking for file path deviations.\n\n### Overt use of Mega\n\nAdversaries often rename MegaSync to circumvent application controls in environments\nwhere the utility is not approved for use. However, this isn’t always the case. Trend Micro\nhas reported that the [Nefilim ransomware simply drops MegaSync into its normal file path](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/updated-analysis-on-nefilim-ransomware-s-behavior)\nunder its normal name. If MegaSync isn’t approved software in your environment, then you\nmay be able to detect its use by looking for the execution of a process that is\n```\nmegasync.exe from a path that includes the following: \\\\AppData\\\\Local\\\\MEGAsync\n\n```\nOn top of client applications such as those provided by Mega, many ransomware families\nmay use other software or built-in operating system utilities to exfiltrate data. We’ll use\nMega as the example here, but you could just as well replace `mega.io with whatever`\nservice you want to look out for. Since blocking a domain outright is trivial, we’ll assume that\nyou’re okay with web browsers making network connections to Mega but want to know\nwhen anything else does.\n\nIf that’s the case, you can look for execution of any process that is\n**not** `chrome.exe,` `firefox.exe,` `safari.exe,` `opera.exe,` `iexplore.exe,`\n```\nmicrosoftedge.exe, microsoftedgecp.exe, browser_broker.exe, msedge.exe,\n\n```\nor `brave.exe initiating a network connection to the domains` `mega.io or` `mega.co.nz .`\n\n### Abnormal installation paths\n\nIn some instances, adversaries will execute MegaSync under its real name but from an\nunusual installation path. A detection analytic for identifying relocated copies of MegaSync\nexecution may look something like this:\n\n_Binary named_ `megasync.exe`\n_File execution path does not include_ `AppData\\\\Local\\\\MEGAsync\\\\`\n\nIf there are circumstances in which it’s acceptable for Megasync to run from an abnormal\ndirectory, then consider tuning your detection logic accordingly.\n\n\n-----\n\n### Renaming MegaSync\n\nWe’ve observed adversaries executing renamed instances of Mega during incident\nresponse engagements associated with ransomware families like Nefilim, Sodinokibi, Pysa,\nand Conti. Alerting on the use of renamed instances of MegaSync could help prevent or\nreduce the scope of similar incidents moving forward. The following pseudo-analytic should\ndetect renamed instances of MegaSync:\n\n_Look for the execution of a process that is not named_ `megasync.exe` _but that_\n_executes with any any of the following corresponding metadata:_\n\n_a binary internal name that is_ `megasync.exe`\n_a binary product name that is_ `MEGAsync`\n_a binary description that is_ `MEGAsync`\n\nThe following image shows the execution of `meg.exe . However, examining binary`\nmetadata reveals that `meg.exe was in fact a renamed instance of MegaSync.`\n\n## Rclone detection\n\nShifting our focus away from Mega-specific tooling, it wouldn’t be a blog post about\nexfiltration if we didn’t shine a light on the cross-platform, open source file transfer utility\nknown as Rclone. Once a ransomware operator has hooked an organization, Rclone helps\nthem reel in their catch. Without the ability to cut the data loose, any attempts at double\nextortion go out the window.\n\n\n-----\n\nSo, what makes Rclone so special? Its versatility. Once an adversary drops it on an\nendpoint, modifying the exfiltration destination is trivial. Adversaries can also choose from a\nlist of built-in command flags that will perform various actions, or they can opt to supply their\nown configuration file and avoid the need to execute with various command line flags. As an\nexample, maybe using a cloud storage provider is not an option because of a technical\ncontrol that disallows network connections to the adversary’s hosting provider of choice.\nRclone makes it very simple to use file transfer protocols such as FTP or SFTP, effectively\nenabling adversaries to move files wherever they want. See the Appendix for a list of known\nand supported Rclone commands at the end of this report.\n\n### Establishing the baseline\n\nAs was the case with MegaSync, understanding the binary metadata associated with\nRclone is a necessary first step if you want to detect adversaries who rename the tool.\nUnder normal circumstances, you can expect `rclone to have the following attributes:`\n\n**Metadata attribute** **Value**\n\n\nMetadata attribute :\n**Process name**\n\nMetadata attribute :\n**Original name**\n\nMetadata attribute :\n**Description**\n\nMetadata attribute :\n**Internal name**\n\nMetadata attribute :\n**Company name**\n\n\nValue :\n```\nrclone.exe\n\n```\nValue :\n```\nrclone.exe\n\n```\n\nValue :\nRsync for cloud storage\n\nValue :\n```\nrclone\n\n```\nValue :\n```\nhttps://rclone.org\n\n```\n\n-----\n\n**Metadata attribute** **Value**\n\n\nMetadata attribute :\n**Product name**\n\n\nValue :\nRclone\n\n\n### Overt use of Rclone\n\nIf Rclone isn’t permitted in your environment, then you can simply look for the execution of a\nprocess named `rclone.exe . It’s worth noting that there isn’t any standard path that`\nRclone executes from, so unfortunately we cannot pare things down further like we were\nable to with MegaSync.\n\n### Renaming Rclone\n\nRed Canary has observed the execution of renamed versions of Rclone during IR\nengagements, in an attempt to bypass basic application controls. Taking this into account,\nwe can begin creating detection analytics for renamed instances of Rclone, just as we did\nwith MegaSync.\n\nYou can do so by looking for the execution of a process that is not named `rclone.exe but`\nthat executes with any of the following binary metadata:\n\na binary original name that is `rclone.exe`\na binary description that is “Rsync for cloud storage”\na binary internal name that is `rclone`\na binary company name that is `https://rclone.org`\na binary product name that is `Rclone`\n\nThe following image shows the execution of `sihosts.exe . However, an examination of`\nbinary metadata revealed that `sihosts.exe was in fact a renamed instance of Rclone:`\n\n\n-----\n\n### Suspicious command line flags\n\nIn the interest of building resilient detection analytics, it’s worth noting that metadata could\nbe altered in some way for these binaries, enabling an adversary to circumvent some of the\nsecurity controls mentioned above. Considering that, it’s worth looking out for command line\nflags that are consistent with suspicious executions of `rclone as well (see Appendix for`\nthe list of helpful command line perimeters).\n\nAny time you observe these command line flags in play, it might be time to get your\nmagnifying lens out and dig into how Rclone is being used in your environment. Of course,\nthis can differ from one organization to the next. If you have approved legitimate use cases\nfor Rclone in your environment, then you may have to tune your analytics accordingly.\n\nWe’ve had success looking for command lines including one or more of the command line\nparameters: `rclone,` `lsd,` `remote:,` `ftp:,` `mega,` `--config,` `--auto-confirm,`\nor `--multi-thread-streams and` `copy,` `config,` `create,` `lsd,` `remote,` `mega,`\n```\nuser, pass, --config, --progress, --no-check-certificate, --ignoreexisting, --auto-confirm, --multi-thread-streams`, --transfers, ftp:,\nremote:, or \\\\ .\n\n```\nThe following image shows what some of these command line flags might look like in the\nwild:\n\nWhile this is a great place to start, the Rclone project is constantly being updated with new\n[functionality, so keeping an eye on the ChangeLog and](https://rclone.org/changelog/) [Docs may be helpful when looking](https://rclone.org/docs/)\nfor new ways to identify the utility moving forward.\n\nRemember: detect or do not detect. There is no try.\n\n\n-----\n\n## Appendix\n\nAs promised, the following table includes a list of Rclone commands that may be of\nparticular interest.\n\n**Flag** **Action**\n\n\nFlag:\n```\nsync\n\n```\nFlag:\n```\ncopy\n\n```\n\nFlag:\n```\nconfig\n\n```\nFlag:\n```\ncreate\n\n```\n\nFlag:\n```\nlsd\n\n```\nFlag:\n```\nremote\n\n```\n\nAction :\nSync files to a destination\n\nAction :\nCopy files to a destination\n\nAction :\nSpecify a configuration file\n\nAction :\nCreate a configuration file\n\nAction :\nList directories\n\nAction :\nDefines a remote destination when building a configuration\nfile\n\n\n-----\n\n**Flag** **Action**\n\n\nFlag:\n```\nmega\n\n```\nFlag:\n```\nuser\n\n```\n\nFlag:\n```\npass\n\n```\nFlag:\n```\n--config\n\n```\n\nFlag:\n```\n--progress\n\n```\nFlag:\n```\n--no-checkcertificate\n\n```\nFlag:\n```\n--ignore-existing\n\n```\n\nAction :\nMega, the cloud provider, defined while building a\nconfiguration file\n\nAction :\nUsername to authenticate to a remote destination\n\nAction :\nPassword to authenticate to a remote destination\n\nAction :\nSpecifies a configuration file to use in lieu of direct CLI\ncommands\n\nAction :\nLists the progress of files being transferred\n\nAction :\nSkips certificate checks when brokering a network\nconnection\n\nAction :\nIgnores any files that may already exist on a remote\ndestination\n\nAction :\nYes to all confirmation prompts\n\nAction :\nDefine the maximum number of streams for transferring files\n\nAction :\nDefines the maximum number of concurrent transfers\n\nAction :\nA predefined FTP destination, observed in direct CLI\nexecution\n\n\nFlag:\n```\n--auto-confirm\n\n```\nFlag:\n```\n--multi-threadstreams\n\n```\nFlag:\n```\n--transfers\n\n```\n\nFlag:\n```\nftp:\n\n```\n\n-----\n\n**Flag** **Action**\n\n\nFlag:\n```\nremote:\n\n```\nFlag:\n```\n\\\\\n\n```\n\nAction :\nA predefined remote destination, observed in direct CLI\nexecution\n\nAction :\nNot a flag, but a CLI option consistent with network shares\n\n\nRelated Articles\n\nDetection and response\n\n### ChromeLoader: a pushy malvertiser\n\nDetection and response\n\n### Intelligence Insights: May 2022\n\nDetection and response\n\n### The Goot cause: Detecting Gootloader and its follow-on activity\n\nDetection and response\n\n### Marshmallows & Kerberoasting\n\n**Subscribe to our blog**\n\nOur website uses cookies to provide you with a better browsing experience. More\n[information can be found in our Privacy Policy.](https://redcanary.com/privacy-policy)\n\nX\n\n**Privacy Overview**\n\nThis website uses cookies to improve your experience while you navigate through the\nwebsite. Out of these cookies, the cookies that are categorized as necessary are stored on\nyour browser as they are essential for the working of basic functionalities of the website. We\nalso use third-party cookies that help us analyze and understand how you use this website\n\n\n-----\n\nThese cookies will be stored in your browser only with your consent. You also have the\noption to opt-out of these cookies. But opting out of some of these cookies may have an\neffect on your browsing experience.\n\nNecessary cookies are absolutely essential for the website to function properly. This category\nonly includes cookies that ensures basic functionalities and security features of the website.\nThese cookies do not store any personal information.\n\nAny cookies that may not be particularly necessary for the website to function and is used\nspecifically to collect user personal data via analytics, ads, other embedded contents are\ntermed as non-necessary cookies. It is mandatory to procure user consent prior to running\nthese cookies on your website.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-04 - Transferring leverage in a ransomware attack.pdf"
    ],
    "report_names": [
        "2021-05-04 - Transferring leverage in a ransomware attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536082,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653764997,
    "ts_modification_date": 1653764997,
    "files": {
        "pdf": "https://archive.orkl.eu/77650363973c753093cf81f3cf3a78bc30f45fb4.pdf",
        "text": "https://archive.orkl.eu/77650363973c753093cf81f3cf3a78bc30f45fb4.txt",
        "img": "https://archive.orkl.eu/77650363973c753093cf81f3cf3a78bc30f45fb4.jpg"
    }
}