{
    "id": "2d98ed24-3af8-4847-bbbb-86ae7677c35d",
    "created_at": "2023-01-12T15:06:21.949628Z",
    "updated_at": "2025-03-27T02:16:26.289997Z",
    "deleted_at": null,
    "sha1_hash": "e8502b3c2924b121370e0aae93f34d259eb3fc9f",
    "title": "2017-12-18 - Jack of all trades",
    "authors": "",
    "file_creation_date": "2022-05-27T22:00:00Z",
    "file_modification_date": "2022-05-27T22:00:00Z",
    "file_size": 3285126,
    "plain_text": "# Jack of all trades\n\n**securelist.com/jack-of-all-trades/83470/**\n\nAuthors\n\nNikita Buchka\n\nAnton Kivva\n\n[Dmitry Galov](https://securelist.com/author/dmitrygalov/)\n\nNowadays, it’s all too easy to end up with malicious apps on your smartphone, even if you’re\nusing the official Google Play app store. The situation gets even worse when you go\nsomewhere other than the official store – fake applications, limited security checks, and so\non. However, the spread of malware targeting Android OS is not limited to unofficial stores –\nadvertising, SMS-spam campaigns and other techniques are also used. Among this array of\nthreats we found a rather interesting sample – Trojan.AndroidOS.Loapi. This Trojan boasts a\ncomplicated modular architecture that means it can conduct a variety of malicious activities:\nmine cryptocurrencies, annoy users with constant ads, launch DDoS attacks from the\naffected device and much more. We’ve never seen such a ‘jack of all trades’ before.\n\n\n-----\n\n## Distribution and infection\n\nSamples of the Loapi family are distributed via advertising campaigns. Malicious files are\ndownloaded after the user is redirected to the attackers’ malicious web resource. We found\nmore than 20 such resources, whose domains refer to popular antivirus solutions and even a\nfamous porn site. As we can see from the image below, Loapi mainly hides behind the mask\nof antivirus solutions or adult content apps:\n\nAfter the installation process is finished, the application tries to obtain device administrator\npermissions, asking for them in a loop until the user agrees. Trojan.AndroidOS.Loapi also\nchecks if the device is rooted, but never subsequently uses root privileges – no doubt they\nwill be used in some new module in the future.\n\n\n-----\n\n-----\n\nAfter acquiring admin privileges, the malicious app either hides its icon in the menu or\nsimulates various antivirus activity, depending on the type of application it masquerades as:\n\n## Self-protection\n\nLoapi aggressively fights any attempts to revoke device manager permissions. If the user\ntries to take away these permissions, the malicious app locks the screen and closes the\nwindow with device manager settings, executing the following code:\n\n\n-----\n\nAs well as this fairly standard technique to prevent removal, we also found an interesting\nfeature in the self-protection mechanism. The Trojan is capable of receiving from its C&C\nserver a list of apps that pose a danger. This list is used to monitor the installation and\nlaunch of those dangerous apps. If one of the apps is installed or launched, then the Trojan\nshows a fake message claiming it has detected some malware and, of course, prompts the\nuser to delete it:\n\n\n-----\n\n-----\n\nThis message is shown in a loop, so even if the user rejects the offer, the message will be\nshown again and again until the user finally agrees and deletes the application.\n\n## Layered architecture\n\nLet’s take a look at the Trojan’s architecture in more detail:\n\n1. At the initial stage, the malicious app loads a file from the “assets” folder, decodes it\n\nusing Base64 and afterwards decrypts it using XOR operations and the app signature\nhash as a key. A DEX file with payload, which was retrieved after these operations, is\nloaded with ClassLoader.\n\n\n-----\n\n2. At the second stage, the malicious app sends JSON with information about the device\n\nto the central C&C server hxxps://api-profit.com:\n\nA command in the following format is received as a response from the server:\n\nWhere “installs” is a list of module IDs that have to be downloaded and launched;\n“removes” is a list of module IDs that have to be deleted; “domains” is a list of domains\nto be used as C&C servers; “reservedDomains” is an additional reserved list of\ndomains; “hic” is a flag that shows that the app icon should be hidden from the user;\nand “dangerousPackages” is a list of apps that must be prevented from launching and\ninstalling for self-protection purposes.\n\n\n-----\n\n3. At the third stage, the modules are downloaded and initialized. All the malicious\n\nfunctionality is concealed inside them. Let’s take a closer look at the modules we\nreceived from the cybercriminals’ server.\n\n## Advertisement module\n\n_Purpose and functionality: this module is used for the aggressive display of advertisements_\non the user’s device. It can also be used for secretly boosting ratings. Functionality:\n\nDisplay video ads and banners\nOpen specified URL\nCreate shortcuts on the device\nShow notifications\nDownload and install other applications\n\nExample of task to show ads received from the server:\n\n\n-----\n\nWhile handling this task, the application sends a hidden request with a specific User-Agent\nand Referrer to the web page hxxps://ronesio.xyz/advert/api/interim, which in turn redirects to\na page with the ads.\n\n## SMS module\n\n_Purpose and functionality: this module is used for different manipulations with text_\nmessages. Periodically sends requests to the C&C server to obtain relevant settings and\ncommands. Functionality:\n\nSend inbox SMS messages to attackers’ server\nReply to incoming messages according to specified masks (masks are received from\nC&C server)\nSend SMS messages with specified text to specified number (all information is\nreceived from C&C server)\nDelete SMS messages from inbox and sent folder according to specified masks (masks\nare received from C&C server)\nExecute requests to URL and run specified Javascript code in the page received as a\nresponse (legacy functionality that was later moved to a separate module)\n\n## Web crawling module\n\n_Purpose and functionality: this module is used for hidden Javascript code execution on web_\npages with WAP billing in order to subscribe the user to various services. Sometimes mobile\noperators send a text message asking for confirmation of a subscription. In such cases the\n\n\n-----\n\nTrojan uses SMS module functionality to send a reply with the required text. Also, this\nmodule can be used for web page crawling. An example of a web page crawling task\nreceived from the server is shown below:\n\nThis module together with the advertisement module tried to open about 28,000 unique\nURLs on one device during our 24-hour experiment.\n\n## Proxy module\n\n_Purpose and functionality: this module is an implementation of an HTTP proxy server that_\nallows the attackers to send HTTP requests from the victim’s device. This can be used to\norganize DDoS attacks against specified resources. This module can also change the\ninternet connection type on a device (from mobile traffic to Wi-Fi and vice versa).\n\n## Mining Monero\n\n_Purpose and functionality: this module uses the Android version of minerd to perform Monero_\n(XMR) cryptocurrency mining. Mining is initiated using the code below:\n\n\n-----\n\nThe code uses the following arguments:\n\n_url – mining pool address, “stratum+tcp://xmr.pool.minergate.com:45560”_\n_this.user – username, value randomly selected from the following list:_\n“lukasjeromemi@gmail.com”, “jjopajopaa@gmail.com”, “grishaobskyy@mail.ru”,\n“kimzheng@yandex.ru”, “hirt.brown@gmx.de”, “swiftjobs@rambler.ru”,\n“highboot1@mail333.com”, “jahram.abdi@yandex.com”, “goodearglen@inbox.ru”,\n[girlfool@bk.ru](http://10.10.0.46/mailto:girlfool@bk.ru)\n_password – constant value, “qwe”_\n\n## Old ties\n\nDuring our investigation we found a potential connection between Loapi and\n[Trojan.AndroidOS.Podec. We gathered some evidence to support this theory:](https://securelist.com/sms-trojan-bypasses-captcha/69169/)\n\n\n-----\n\n_Matching C&C server IP addresses. The current address of the active Loapi C&C_\nserver is resolved with DNS to 5.101.40.6 and 5.101.40.7. But if we take a look at the\nhistory, we can see other IP addresses to which this URL resolved before:\n\nAt first, this URL was resolved to the IP address 91.202.62.38. If we analyze the history\nof DNS records that resolved to this address, we see the following:\n\n\n-----\n\nAs we can see from the records, in 2015 (when Podec was active), this IP address was\nresolved from various generated domains, and many of them were used in Podec (for\nexample, obiparujudyritow.biz, in the 0AF37F5F07BBF85AFC9D3502C45B81F2\nsample).\n\n\n-----\n\n_Matching unique fields at the initial information collection stage. Both Trojans collect_\ninformation with similar structure and content and send it in JSON format to the\nattackers’ server during the initial stage. Both JSON objects have the fields “Param1”,\n“Param2” and “PseudoId”. We performed a search in our internal ElasticSearch\nclusters – where we store information about clean and malicious applications – and\nfound these fields were only used in Podec and Loapi.\n_Similar obfuscation._\n_Similar ways of detecting SU on a device._\n_Similar functionality (both can subscribe users to paid services)._\n\nNone of these arguments can be considered conclusive proof of our theory, but taken\ntogether they suggest there’s a high probability that the malicious applications Podec and\nLoapi were created by the same group of cybercriminals.\n\n## Conclusion\n\nLoapi is an interesting representative from the world of malicious Android apps. It’s creators\nhave implemented almost the entire spectrum of techniques for attacking devices: the Trojan\ncan subscribe users to paid services, send SMS messages to any number, generate traffic\nand make money from showing advertisements, use the computing power of a device to\nmine cryptocurrencies, as well as perform a variety of actions on the internet on behalf of the\nuser/device. The only thing missing is user espionage, but the modular architecture of this\nTrojan means it’s possible to add this sort of functionality at any time.\n\n## P.S.\n\nAs part of our dynamic malware analysis we installed the malicious application on a test\ndevice. The images below show what happened to it after two days:\n\n\n-----\n\nBecause of the constant load caused by the mining module and generated traffic, the battery\nbulged and deformed the phone cover.\n\n## C&C\n\nronesio.xyz (advertisement module)\n\napi-profit.com:5210 (SMS module and mining module)\n\nmnfioew.info (web crawler)\n\nmp-app.info (proxy module)\n\n## Domains\n\nList of web resources from which the malicious application was downloaded:\n\n**Domain** **IP**\n\na2017-security.com 91.202.62.45\n\nalert.com–securitynotice.us 104.18.47.240,104.18.46.240\n\nalibabadownload.org 91.202.62.45\n\nantivirus-out.net 91.202.62.45\n\n\n-----\n\nantivirus360.ru 91.202.62.45,31.31.204.59,95.213.165.247,\n\n194.58.56.226,194.58.56.50\n\nclean-application.com 91.202.62.45\n\ndefenderdevicebiz.biz 104.27.178.88,104.27.179.88\n\nfixdevice.biz 104.18.45.199,104.18.44.199\n\nhighspeard.eu 91.202.62.45\n\nhoxdownload.eu 91.202.62.45\n\nlilybrook.ru 104.24.113.21,104.24.112.21\n\nnootracks.eu 91.202.62.45\n\nnoxrow.eu 91.202.62.45\n\ns4.pornolub.xyz 91.202.62.45\n\nsidsidebottom.com 9.56.163.55,104.27.128.72\n\ntitangelx.com 104.27.171.112,104.27.170.112\n\ntrust.com-mobilehealth.biz 04.27.157.60,104.27.156.60\n\ntrust.com-securitynotice.biz 104.31.68.110,104.31.69.110\n\nvioletataylor.ru 104.31.88.236,104.31.89.236\n\n[Adware](https://securelist.com/tag/adware/)\n[Fake AV](https://securelist.com/tag/fake-av/)\n[Google Android](https://securelist.com/tag/google-android/)\n[Miner](https://securelist.com/tag/miner/)\n[Mobile Malware](https://securelist.com/tag/mobile-malware/)\n[SMS Trojan](https://securelist.com/tag/sms-trojan/)\n\nAuthors\n\nNikita Buchka\n\n\n-----\n\nAnton Kivva\n\n[Dmitry Galov](https://securelist.com/author/dmitrygalov/)\n\nJack of all trades\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-18 - Jack of all trades.pdf"
    ],
    "report_names": [
        "2017-12-18 - Jack of all trades.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e8e18067-f64b-4e54-9493-6d450b7d40df",
            "created_at": "2022-10-25T16:07:24.515213Z",
            "updated_at": "2025-03-27T02:02:10.267637Z",
            "deleted_at": null,
            "main_name": "Mummy Spider",
            "aliases": [
                "ATK 104",
                "Gold Crestwood",
                "Mummy Spider",
                "TA542"
            ],
            "source_name": "ETDA:Mummy Spider",
            "tools": [
                "Emotet",
                "Geodo",
                "Heodo"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "506404b2-82fb-4b7e-b40d-57c2e9b59f40",
            "created_at": "2023-01-06T13:46:38.870883Z",
            "updated_at": "2025-03-27T02:00:02.939775Z",
            "deleted_at": null,
            "main_name": "MUMMY SPIDER",
            "aliases": [
                "TA542",
                "GOLD CRESTWOOD"
            ],
            "source_name": "MISPGALAXY:MUMMY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535981,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653688800,
    "ts_modification_date": 1653688800,
    "files": {
        "pdf": "https://archive.orkl.eu/e8502b3c2924b121370e0aae93f34d259eb3fc9f.pdf",
        "text": "https://archive.orkl.eu/e8502b3c2924b121370e0aae93f34d259eb3fc9f.txt",
        "img": "https://archive.orkl.eu/e8502b3c2924b121370e0aae93f34d259eb3fc9f.jpg"
    }
}