{
    "id": "2d9eabd0-dc77-49a4-a038-22e4837d2707",
    "created_at": "2023-04-07T02:09:25.578992Z",
    "updated_at": "2025-03-27T02:17:00.456234Z",
    "deleted_at": null,
    "sha1_hash": "1f7237fb84511e669d9e2b3fa2d895130da3aa9d",
    "title": "Buzz of the bumblebee - A new malicious loader - Emerging Threats Protection Report",
    "authors": "",
    "file_creation_date": "2022-05-25T10:15:54Z",
    "file_modification_date": "2022-09-19T17:45:28Z",
    "file_size": 2922335,
    "plain_text": "# Buzz of the Bumblebee\n\n – A new malicious loader\n\n## Emerging Threats Protection Report\n\n\n#### Every other week a new vulnerability is\n\n discovered and becomes public. Some\n customers know how to deal with them, \n\n others – don’t.\n Logpoint Security Research team researches\n\n and investigates new major vulnerabilities discovered, and builds SIEM rules and SOAR\n\n playbooks for investigation and response.\n\n\n-----\n\n###### This report is the outcome of Logpoint’s Security Research team and Global Services, as\n\n part of our Emerging Threat Protection service to provide Logpoint’s customers with up- to-date detection rules, Investigation and Response playbooks, and security best practices.\n This time, the talk of the town is Bumblebee, a malware loader, that is hard to detect, being used by multiple ransomware threat groups as a replacement to the infamous Bazarloader.\n\n### Analysis of the used tactics,  techniques, and procedures\n\nThe TTP most commonly used among all known attack vectors follows a pattern that we are going to\n\nuse to detect any potential that might be brewing in our network.\n\n#### Initial access\n\nAs with any initial access attempt, the bumblebee has been known to perform both spearphishing\n\nand whaling attacks to get the victim to download the malware loader. In this case, it is the\n\nbumblebee loader.\n\n#### URLs and HTML attachments\n\nThe first line of email phishing campaigns started with a DocuSign-branded email campaign with\n\ntwo alternate paths designed to lead the victim into downloading a malicious ISO file.\n\nThe first path begins with the victim clicking on “REVIEW THE DOCUMENT“. Once clicked, a zipped ISO\n\nhosted on Onedrive would download onto the victim’s computer.\n\n_Image courtesy of_ _[Proofpoint.](https://www.proofpoint.com/us/blog/threat-insight/bumblebee-is-still-transforming)_\n\n\n-----\n\nThe second path begins with the HTML file attached to the email. The file is created to resemble\n\nan email. The content might vary, but the user is prompted to click on a link that would eventually\n\nlead to the downloading of the same malicious ISO file.\n\nFor alerts against phishing, Logpoint comes out of the box with vendor-specific phishing alerts.\n\nPlease check the vendor list if any of your devices are supported.\n\nHowever, an alert can be created to detect a phishing attack and modified as per required. This however\n\nrequires some sort of email security application that hashes the receiving file.\n\nAlerts can be created to detect a phishing attack and modified as per required based on pre\nexisting alerts. Bumblebee detection, however, requires some sort of email security application that\n\nhashes the receiving file. An example could be:\n\n```\n1 label=File file=* sender=* receiver=* hash IN BUMBLEBEE_HASHES\n\n```\n\n-----\n\n#### Thread hijacking: Zipped ISO attachments\n\nThe researchers this month observed a campaign that delivered emails that appeared to reply to\n\nexisting and legitimate email conversations and also included malicious zipped ISO attachments.\n\nThe Proofpoint researchers said they are highly confident \"based on malware artifacts\" that \"all the\n\ntracked threat actors using Bumblebee are receiving it from the same source.\"\n\nThe loader is unusual in that most of it is pulled together into a single function. Most malware breaks\n\nout initialization, request sending, and response handling into different functions. In addition, its\n\nconfiguration is stored in plaintext, though the Proofpoint researchers expect obfuscation features\n\nwill be used in the future.\n\nWhat's more, the embedded URL in the HTML attachment makes use of a traffic direction system\n\n(TDS) dubbed Prometheus — which is available for sale on underground platforms for $250 a month\n\n— to redirect the URLs to the archive files based on the time zone and cookies of the victims.\n\n\n-----\n\n#### Contact forms: Stolen images\n\nLate August to March 2022 saw a rise in another campaign, wherein emails were generated by\n\nsubmitting a message to a contact form on the target organization's website claiming that stolen\n\nimages were contained on the site.\n\nThe message included a link to a landing page that directed the victim to download an ISO file\n\ncontaining copies of the stolen images containing \"DOCUMENT_STOLENIMAGES.LNK\" and \"neqw.dll\").\n\nThe shortcut file, if run, execute an \"attachments.dll\" with the correct parameters to start the\n\nBumblebee downloader.\n```\n     1 (hash IN BUMBLEBEE_HASHES OR hash_sha1 IN BUMBLEBEE_HASHES OR\n       hash_sha256 IN BUMBLEBEE_HASHES) | \n     2 rename hash as ioc, hash_sha1 as ioc, hash_sha256 as iochash IN\n       BUMBLEBEE_HASHES\n\n```\nThis has been made into an alert and can be found as Bumblebee IoC Hashes Detected.\n\n\n-----\n\n#### Execution\n\nThe ISO file contains files named \"ATTACHME.LNK\" and \"Attachments.dat\". If run, the shortcut file\n\n\"ATTACHME.LNK\" executed \"Attachments.dat\" with the correct parameters to run the downloader,\n\nBumblebee.\n\nAnalyzing the shortcut file, it runs the terminal and waits for a random time before running the\n\nATTACHME.LNK file. It then calls the rundll32 executable to run the Attachements.dat and IternalJob.\n\nProcess tree from the shortcut file:\n\n##### cmd.exe /c start /wait \"\" \"C:\\Users\\[removed]\\AppData\\Local\\Temp\\ATTACHME.LNK\" rundll32.exe \"C:\\Windows\\System32\\rundll32.exe\" Attachments.dat,IternalJob\n\nThis is crucial information as we can use it to create alerts.\n\nAlso, a few existing alerts that come out of the box with Logpoint can be used, such as:\n\nProcess Execution from Suspicious Location\n```\n  1 norm_id=WinServer event_id=4688 \"process\" IN\n  2 [\"C:\\ProgramData\\*.exe\", \"*\\AppData\\Local\\*.exe\",\n    \"*\\AppData\\Roaming\\*.exe\", \"C:\\Users\\Public\\*\"]\n  3 -\"process\" IN [\"*\\Teams.exe\", \"*\\Teams\\Update.exe\",\n    \"*\\Temp\\*\\dismhost.exe\", \"*Microsoft\\OneDrive\\*\\FileCoAuth.exe\",\n    \"C:\\ProgramData\\Microsoft\\*\\MpCmdRun.exe\",\n    \"*\\Local\\Temp\\*\\BackgroundDownload.exe\", \"*Microsoft\\Windows\n    Defender\\*\\NisSrv.exe\", \"C:\\ProgramData\\Microsoft\\*\\MsMpEng.exe\"]\n\n```\n\n-----\n\nAnd also,\n\nSuspicious Rundll32 Activity Detected\n```\n  1 norm_id=WindowsSysmon event_id=1 command IN [\"\\rundll32.exe url.dll,\n    OpenURL \", \"\\rundll32.exe url.dll, OpenURLA \", \"\\rundll32.exe\n    url.dll, FileProtocolHandler \", \"\\rundll32.exe zipfldr.dll,\n    RouteTheCall \", \"\\rundll32.exe Shell32.dll, Control_RunDLL \",\n    \"\\rundll32.exe javascript:\", \"* url.dll, OpenURL \", \" url.dll,\n    OpenURLA \", \" url.dll, FileProtocolHandler \", \" zipfldr.dll,\n    RouteTheCall \", \" Shell32.dll, Control_RunDLL \", \" javascript:\",\n    \".RegisterXLL\", \"\\rundll32C:\\PerfLogs*\", \"\\rundll32C:\\ProgramData*\",\n    \"*\\rundll32 *\\AppData\\Local\\Temp*\"] -user IN EXCLUDED_USERS\n\n```\n[The campaign was run by the threat group TA579, which has been active since August 2021. TA579](https://www.theregister.com/2022/04/29/bumblee-malware-conti-malware/)\n\nhas been observed using the BazarLoader and IcedID loaders in its previous campaigns.\n\nProofpoint linked another group, TA578, to this campaign. TA578 has been around since at least May\n\n2020 and has used BazarLoader, IcedID, Cobalt Strike, Ursnif, KPOT Stealer, and Buer Loader.\n\nAfter the initial execution, the BumbleBee DLL is copied to the %programdata%/{RandomDir}\n\ndirectory. In addition to the DLL, a VBS script is also dropped to the same directory:\n\n###### • [a-z]:\\\\programdata\\\\[a-z0-9]{16}\\\\[a-z0-9]{16}\\.[vbs|dll]\n\nThis has been added as a new alert in the latest release pack as:\n\nSuspicious DLL or VBS Files being created in ProgramData\n```\n  1 norm_id=WindowsSysmon event_id=11 file IN [\"*.dll\", \"*.vbs\"]\n    path=\"C:\\ProgramData*\"\n\n```\nThis may result in a very noisy log if the given server has a lot of files that are installed often.\n\n\n-----\n\n#### Persistence\n\nWe detected a scheduled task execution during the BumbleBee infection:\n\n##### Grandparent process: svchost.exe -k netsvcs -p -s Schedule Parent process: wscript.exe [a-z]:\\\\programdata\\\\[a-z0-9]{16}\\\\[a-z0-9]{16}\\.vbs Child process: rundll32.exe [a-z]:\\\\programdata\\\\[a-z0-9]{16}\\\\[a-z0-9]{16}\\.dll,{Export}\n\nSuspicious SVCHOST Process Creation\n```\n     1 norm_id=WindowsSysmon event_id=1\n     2 image=\"*\\svchost.exe\" (-parent_image=\"*\\services.exe\"\n     3 -command=\"* -k *\") -parent_image=\"*\\MsMpEng.exe\"\n\n```\nLP_Suspicious Scheduled Task Creation\n```\n     1 norm_id=WinServer label=Schedule label=Task label=Create\n       command IN [\"*C:\\Users*\", \"*C:\\Windows\\Temp*\",\n       \"*C:\\ProgramData*\"] -command=\"C:\\ProgramData\\Microsoft\\Windows\n       Defender\\Platform*\"\n\n```\nWe also observed WMI execution. The VBS file that was executed via a scheduled task, was also\n\nexecuted through WMI:\n\n##### Grandparent process: svchost.exe -k DcomLaunch Parent process: wmiprvse.exe -Embedding Child process: wscript.exe [a-z]:\\\\programdata\\\\[a-z0-9]{16}\\\\[a-z0-9]{16}\\.vbs\n\nSuspicious WMPRVSE Child Process\n```\n  1 norm_id=WindowsSysmon event_id=1 parent_image=\"*\\wmprvse.exe\"\n  2 -image IN [\"C:\\Windows\\System32\\conhost.exe\",\n    \"C:\\Windows\\system32\\wbem\\WMIC.exe\",\n    \"C:\\Windows\\syswow64\\wbem\\WMIC.exe\",\n    \"C:\\Windows\\system32\\WerFault.exe\",\n    \"C:\\Windows\\SysWOW64\\WerFault.exe\"]\n\n```\n\n-----\n\n#### Defense evasion\n\nIn lab tests by [Cynet, Bumblebee was found to be using several hardcoded anti-VM methods to](https://www.cynet.com/blog/orion-threat-alert-flight-of-the-bumblebee/)\n\navoid detection. This included checking for VM-related processes and usernames commonly\n\nassociated with sandboxing environments.\n\nIn addition, it uses WMI queries to collect system details and information:\n\n - SELECT * FROM Win32_BaseBoard\n\n - SELECT * FROM Win32_Bus\n\n - SELECT * FROM Win32_ComputerSystem\n\n - SELECT * FROM Win32_Fan\n\n - SELECT * FROM Win32_NTEventlogFile\n\n - SELECT * FROM Win32_OperatingSystem\n\n - SELECT * FROM Win32_PnPDevice\n\n - SELECT * FROM Win32_PnPEntity\n\n\n-----\n\n#### Discovery\n\nWe found that the threat actors used the AdFind tool to enumerate and map the victim’s network.\n\nThe ADFind tool was found in the %ProgramData% directory.\n\nIn the instance we observed, the following commands were used:\n\n  - adfind.exe -gcb -sc trustdmp\n\n  - adfind.exe -f “(objectcategory=group)”\n\n  - adfind.exe -f “(objectcategory=organizationalUnit)”\n\n  - adfind.exe -f “objectcategory=computer”\n\n  - adfind.exe -f “(objectcategory=person)”\n\nActive Directory Enumeration via ADFind alert has been modified to further improve detection\n```\n  1 image=\"*\\adfind.exe\"\n  2 command IN ['* -f *objectcategory=*', '* -sc trustdmp*,\n    \"*lockoutduration*\", \"*lockoutthreshold\",\n    \"*lockoutobservationwindow*\", \"*maxpwdage*\", \"*minpwdage*\",\n    \"*minpwdlength*\", \"*pwdhistorylength*\", \"*pwdproperties*\", \"*-sc\n    admincountdmp*\", \"*-sc exchaddresses*\"']\n\n```\nFalse Positive Warning: Administrative activity\n\n**Command and Control**\n\nAfter the initial execution, the BumbleBee process (Rundll32) communicated with the Command-and\nControl server (C2). We’ve seen several C2 servers from different IR cases:\n\n  - IP: 23.82.19[.]208:443\n\n  - IP: 192.236.198[.]63:433\n\n  - IP: 45.147.229[.]177:433\n\nUsing the database from Malwarebazaar, we have created a list of known IPs and domain names\n\nassociated with Bumblebee and its campaigns. They can be used to check if any network activity\n\nhas been seen.\n\nBumblebee IoC IPs Detected\n```\n  1 source_address IN BUMBLEBEE_IPS OR destination_address IN\n    BUMBLEBEE_IPS\n\n```\nBumblebee IoC Domains Detected\n\n```\n1 (domain IN BUMBLEBEE_DOMAINS OR query IN BUMBLEBEE_DOMAINS)\n\n```\n\n-----\n\n#### Evolution:\n\nThe transition from Bazarloader to Bumblebee is further evidence that these threat actors — likely\n\ninitial access brokers who infiltrate targets and then sell that access to others — are receiving the\n\nmalware from a common source, while also signaling a departure after the Conti group's attack\n\n[toolkit became public knowledge around the same time.](https://thehackernews.com/2022/04/gold-ulrick-hackers-still-in-action.html)\n\nThe development also coincides with Conti taking over the [infamous TrickBot botnet and shutting it](https://thehackernews.com/2022/02/notorious-trickbot-malware-gang-shuts.html)\n\ndown to focus on the development of Bazarloader and Anchor malware. It's not immediately clear if\n\nBumblebee is the work of TrickBot actors and whether the leaks prompted the gang to abandon\n\nBazarloader in favor of entirely new malware.\n\nBumblebee includes sophisticated techniques to evade detection and appears to be early in its\n\ndevelopment. It has added techniques like an anti-virtual machine and anti-sandbox checks over\n\nthe past month and more recently added an encryption layer to its network communications\n\nroutines, plus checks that detect whether malware analysis tools are being used.\n\nDetailed code analysis by [Eli Salem is a good read for all the programming-centric analysts or a](https://elis531989.medium.com/the-chronicles-of-bumblebee-the-hook-the-bee-and-the-trickbot-connection-686379311056)\n\nbetter understanding of the malware on a low-level understanding.\n\nBased on the process analysis, after the execution, Bumblebee uses the Windows Management\n\nInstrumentation (WMI) framework to query system information and build a unique ID for the infected\n\nmachine. It then connects back to the Command-and-Control (C&C) server every 25 seconds to\n\ntake in commands to be executed. The attackers so far have been manually providing the payloads\n\nand hence can take hours or days after the initial infection before any malicious activities are seen\n\nin the infected device.\n\nThe commands supported by the bot allow the attackers to directly download and execute files, to\n\ninject DLLs and shellcode into existing processes, and establish persistence on the system. The\n\npersistence mechanism involves copying the Bumblebee DLL to the %APPDATA% folder and creating\n\na VBS script that will load the DLL based on a scheduled task.\n\nThe samples detected since March show that the loader is seeing active development with\n\nimprovements being made and new features being added. An example is the addition of anti-VM\n\nand anti-sandbox routines that are meant to prevent the malware from executing inside virtualized\n\nenvironments commonly used by researchers and honeypot systems. The loader now also has a list\n\nof processes associated with common tools used by malware analysts and defenders and it checks\n\nif they are running on the system.\n\nIn the latest samples, attackers can specify multiple command-and-control servers, the query time\n\nhas been modified from 25 seconds to random intervals, and the communication with the C&C\n\nservers is now encrypted. All these changes are meant to make the malware's activity stealthier and\n\nharder to detect.\n\n\"Proofpoint assesses with high confidence Bumblebee loader can be used as an initial access\n\nfacilitator to deliver follow-on payloads such as ransomware,\" the researchers said. \"Based on the\n\ntiming of its appearance in the threat landscape and use by multiple cybercriminal groups, it is likely\n\nBumblebee is, if not a direct replacement for Bazarloader, then a new, multifunctional tool used by\n\nactors that historically favored other malware.\"\n\n\n-----\n\n#### Bumblebee hunting using Logpoint\n\nDuring the development of the malware, there are some tell-tell signs of Bumblebee.\n\n**1. Using known hashes**\n\nWe added IoC alerts in Alert Rules v5.x.x for detecting the Bumblebee malware. In the same package,\n\nBUMBLEBEE_HASHES has been added.\n\nBUMBLEBEE_HASHES list contains the IoC hashes for all forms of Bumblebee that have been detected\n\nand collected over at [Malwarebazaar.](https://bazaar.abuse.ch/browse/tag/BUMBLEBEE)\n\nRunning the following query will give all the hashes that match within the given list.\n\nBumblebee IoC Hashes Detected\n```\n  1 (hash IN BUMBLEBEE_HASHES OR hash_sha1 IN BUMBLEBEE_HASHES OR\n    hash_sha256 IN BUMBLEBEE_HASHES) |\n  2 rename hash as ioc, hash_sha1 as ioc, hash_sha256 as ioc\n\n```\nAs mentioned in the analysis, this query has been added as a new alert with the latest alert pack.\n\n**2. Using user agent**\n\nEarlier samples of BUMBLEBEE used the user-agent 'bumblebee'. Detecting this user agent inside the proxy logs\n\nis trivial, and every SOC/security team should have already done this search by now.\n\nBumblebee User-Agent Detected\n\n```\n1 user_agent = bumblebee\n\n```\n\nHowever, this has been added as a new alert and can be easily deployed.\n\n**2.1. Using 10 digits randomized user agent**\n\n[In the report by the NCC group, which is worth reading, it was mentioned that newer samples of](https://research.nccgroup.com/2022/04/29/adventures-in-the-land-of-bumblebee-a-new-malicious-loader/)\n\nBUMBLEBEE use a hard-coded key as a user agent, with which the communication is encrypted.\n```\n  1 user_agent=* |\n  2 process regex('(?P<match>^[a-zA-Z]{10}$)', user_agent)|\n  3 search match=*\n\n```\n\n-----\n\nAlso, since failed attempts are taking in the random user agents, successful connections will have\n\nthe same user agent used multiple times so a successful connection be detected as\n```\n  1 user_agent=*\n  2\n  3 | process regex('(?P<match>^[a-zA-Z]{10}$)', user_agent)\n  4\n  5 | search match=* | chart count() by user_agent, source_address desc()\n\n```\n**3. “/“ gates**\n\nAs written by [NCCGroup, the latest URI is \"/gates\", as can also be seen in the sandbox reports. Here,](https://research.nccgroup.com/2022/04/29/adventures-in-the-land-of-bumblebee-a-new-malicious-loader/)\n\ntoo, a search in the proxy logs is worthwhile, or the setting up an alerting for corresponding accesses.\n```\n  1 url in (\"/gates\", \"gate\", \"get_load\")\n\n```\nHowever, still used and hardcoded in early editions of the malware, it is easily changeable. With this\n\nin mind, the query can be used as a hunting method and is not recommended to create an alert\n\nbased solely on a URI path.\n\nThe given alerts are available in the latest release and can be manually downloaded through the\n\ngiven link.\n\n[Alerts download](https://servicedesk.logpoint.com/hc/en-us/articles/115003928409)\n\n\n-----\n\n#### Log Source Requirements\n\nTo make proper use of the detection techniques, Logpoint requires the following sources.\n\n - Endpoint Detection and Response tools\n\n - Windows Native Auditing\n\n - Proxy Server\n\n - Network Firewall\n\n - Web Application Firewall\n\n - Sysmon\n\n#### Incident investigation and response using Logpoint SOAR\n\n**Compromise investigation**\n\nThe necessary steps in investigating post-compromise activity include inspecting:\n\n - If any accounts have been compromised, passwords are changed or are receiving unusual\nlogins, emails, or requests from any users.\n\n - Mass or targeted phishing or suspicious emails are being sent to employees.\n\n - Any traffic has been found between the compromised domains.\n\n - Unusual files that have been downloaded.\n\n - Commands that have used generic evasion techniques.\n\n - Known vulnerabilities that are yet to be patched in the network.\n\n - Processes being attributed to suspicious parent processes or are being run from unusual\nsources like %TEMP%.\n\n - Credential dumping attempts.\n\n - Impacket use or attempts of use.\n\n - Disabling of important features including but not limited to the crash dump feature.\n\n - Logs are being cleared.\n\n - Suspicious scheduled tasks are being created.\n\n - Unusual Remote Access Tools (RATs) making connections.\n\n - Security settings are being changed rapidly.\n\nIn no way would monitoring for the listed activities eliminate the chance of being compromised, but\nwould provide basic coverage of any attempt when added to existing company cybersecurity\npolicies.\n\nThese playbooks provide operational procedures for planning and conducting cybersecurity\nincident and vulnerability response activities and detail each step for both incident and vulnerability\ndetection.\n\nThe main playbook for investigation, with its multiple subplaybooks, goes deep into detection and\ninvestigation if an attack has taken place.\n\n\n-----\n\n#### Incident response\n\nIf and when an active attack has been detected, an organization should always follow the already\n\nset IT and Security guidelines. Plenty of resources are available to create and follow. Some notable\n\nones are provided by [CISA, FBI, and frameworks by NIST.](https://www.cisa.gov/uscert/ncas/alerts/aa22-057a)\n\nHowever, using Logpoint Technology, the following actions can be taken for immediate responses to\n\nthe attacks.\n\n1. **Blocking IoCs: We have updated our IoC lists with hashes, domains, and IPs, which can be turned**\n\non as alerts and used to block as soon as they are detected in the network.\n2. **Isolate the endpoints: When an attack is detected or a system is compromised, the immediate**\n\naction should be to isolate the system, take proper logs, evaluate the situation and remediate.\n\nThese solutions come out of the box as playbooks that can be deployed with the latest release of\n\nLogpoint.\n\n#### A. Isolate Endpoint Mitigation -Generic\n\nThe playbook checks if a host has been infected. If the result is true, the playbook tries to isolate it\n\nusing the EDR and contain and quarantine it before it spreads into other machines.\n\nThe dependencies for this playbook include:\n\n**Integrations**\n\nEndpoint Detection and Response tools.\n\nAntivirus\n\nThreat Intelligence\n\n\n-----\n\n**2. Block Indicators - Generic**\n\nThis playbook is a do-all blocker. It checks if any IP, domain, URL, or host exists in a list of indicators of\n\ncompromise, blocks them, and adds them to the blocked list.\n\nThe dependencies for this playbook include:\n\n**Integrations**\n\nFirewall / WAF\n\nEndpoint Detection and Response tools.\n\nAntivirus\n\nThreat Intelligence\n\nAlong with the given playbooks, the organizations detecting potential APT activity in their IT or OT\n\nnetworks should:\n\n1. Secure backups. Ensure your backup data is offline and secure. If possible, scan your backup\n\ndata with an antivirus program to ensure it is free of malware.\n2. Collect and review relevant logs, data, and artifacts.\n3. Consider soliciting support from a third-party IT organization to provide subject matter expertise,\n\nensure the actor is eradicated from the network, and avoid residual issues that could enable\nfollow-on exploitation.\n\n**Note: The provided playbooks are a generic version and will not work without adapting according to**\n\nyour environment. Contact Logpoint for tailor-made playbooks and queries.\n\n\n-----\n\n#### Security best practices\n\n - Use the included indicators of compromise to investigate whether they exist in your\n\nenvironment and assess for potential intrusion.\n\n - Use Endpoint Detection (EDR) tools with proper restrictive policies to avoid leakage of\n\ndata and MBR/VBR modifications.\n\n - Review all authentication activity for remote access infrastructure, with a particular\n\nfocus on accounts configured with single-factor authentication, to confirm the\nauthenticity and investigate any anomalous activity.\n\n - Create active monitoring and incident response plans by using tools like Logpoint\n\nSIEM and SOAR.\n\n - Enable multifactor authentication (MFA) to mitigate potentially compromised\n\ncredentials and ensure that MFA is enforced for all remote connectivity. Use\npasswordless authenticator tools for an extra level of security.\n\n###### • Make sure all the systems are actively patched and signatures are up to date for all\n\nendpoints, security products, and software products.\n\n\n-----\n\n###### About Logpoint\n\nLogpoint is the creator of a reliable, innovative cybersecurity operations platform — empowering\n\n\nTrusted by more than 1,000 enterprises\n\nAwards and honors\n\n\n###### About Logpoint\n\nLogpoint is the creator of a reliable, innovative cybersecurity operations platform — empowering\n\norganizations worldwide to thrive in a world of evolving threats. By combining sophisticated technology and\n\na profound understanding of customer challenges, Logpoint bolsters security teams’ capabilities while\n\nhelping them combat current and future threats. Logpoint offers SIEM, UEBA, and SOAR technologies in a\n\ncomplete platform that efficiently detects threats, minimizes false positives, autonomously prioritizes risks,\n\nresponds to incidents, and much more. Headquartered in Copenhagen, Denmark, with offices around the\n\nworld, Logpoint is a multinational, multicultural, and inclusive company. For more information, visit\n\nwww.logpoint.com\n\n###### Contact Logpoint\n\nIf you have any questions or want to learn more about Logpoint and our next\ngen SIEM solution, don’t hesitate to contact us at www.logpoint.com/en/contact/\n\n\nGartner Magic Quadrant\n\n\nFor more information,\n\nvisit logpoint.com\n\n\nEmail: sales@logpoint.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.logpoint.com/wp-content/uploads/2022/05/buzz-of-the-bumblebee-a-new-malicious-loader-threat-report-no-3.pdf"
    ],
    "report_names": [
        "buzz-of-the-bumblebee-a-new-malicious-loader-threat-report-no-3.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "62585174-b1f8-47b1-9165-19b594160b01",
            "created_at": "2023-01-06T13:46:39.369991Z",
            "updated_at": "2025-03-27T02:00:03.065156Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [],
            "source_name": "MISPGALAXY:TA578",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8492b1a0-126f-4113-b8f7-101d28559629",
            "created_at": "2023-01-06T13:46:38.864213Z",
            "updated_at": "2025-03-27T02:00:02.938147Z",
            "deleted_at": null,
            "main_name": "GRIM SPIDER",
            "aliases": [
                "GOLD ULRICK"
            ],
            "source_name": "MISPGALAXY:GRIM SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "53f39e5d-6d69-4402-b03c-ec2dbe045788",
            "created_at": "2024-06-19T02:03:08.132007Z",
            "updated_at": "2025-03-27T02:05:17.401832Z",
            "deleted_at": null,
            "main_name": "GOLD ULRICK",
            "aliases": [
                "UNC1878 ",
                "Grim Spider "
            ],
            "source_name": "Secureworks:GOLD ULRICK",
            "tools": [
                " Buer Loader",
                " Cobalt Strike",
                " Conti",
                " Diavol",
                " Powershell Empire",
                " Ryuk",
                " SystemBC",
                " Team9 (aka BazarLoader)",
                " TrickBot",
                "Bloodhound"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "52eb5fb6-706b-49c0-9ba5-43bea03940d0",
            "created_at": "2024-11-01T02:00:52.694476Z",
            "updated_at": "2025-03-27T02:00:55.51014Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [
                "TA578"
            ],
            "source_name": "MITRE:TA578",
            "tools": [
                "Latrodectus",
                "IcedID"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1f87ac52-682a-4bc7-b7ce-fac8d79815fa",
            "created_at": "2023-01-06T13:46:39.373008Z",
            "updated_at": "2025-03-27T02:00:03.066186Z",
            "deleted_at": null,
            "main_name": "TA579",
            "aliases": [],
            "source_name": "MISPGALAXY:TA579",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1680833365,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1653473754,
    "ts_modification_date": 1663609528,
    "files": {
        "pdf": "https://archive.orkl.eu/1f7237fb84511e669d9e2b3fa2d895130da3aa9d.pdf",
        "text": "https://archive.orkl.eu/1f7237fb84511e669d9e2b3fa2d895130da3aa9d.txt",
        "img": "https://archive.orkl.eu/1f7237fb84511e669d9e2b3fa2d895130da3aa9d.jpg"
    }
}