{
    "id": "2dc6fa73-7c79-4c48-a56a-42b2ec5146ab",
    "created_at": "2023-01-12T15:09:52.298158Z",
    "updated_at": "2025-03-27T02:06:15.003865Z",
    "deleted_at": null,
    "sha1_hash": "b996ee76eef5421d1d2ee9695565e088e9665e65",
    "title": "2021-07-31 - BlackMatter ransomware gang rises from the ashes of DarkSide, REvil",
    "authors": "",
    "file_creation_date": "2022-05-27T02:09:25Z",
    "file_modification_date": "2022-05-27T02:09:25Z",
    "file_size": 989112,
    "plain_text": "# BlackMatter ransomware gang rises from the ashes of DarkSide, REvil\n\n**[bleepingcomputer.com/news/security/blackmatter-ransomware-gang-rises-from-the-ashes-of-darkside-revil/](https://www.bleepingcomputer.com/news/security/blackmatter-ransomware-gang-rises-from-the-ashes-of-darkside-revil/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nJuly 31, 2021\n11:12 AM\n3\n\nA new ransomware gang named BlackMatter is purchasing access to corporate networks\nwhile claiming to include the best features from the notorious and now-defunct REvil and\nDarkSide operations.\n\n[Last week, both Recorded Future and security researcher pancak3 shared that a new threat](https://www.recordedfuture.com/blackmatter-ransomware-successor-darkside-revil/)\nactor named 'BlackMatter' had posted to hacking forums where they want to purchase\naccess to corporate networks.\n\n\n-----\n\n**Forum post by BlackMatter to the Exploit forum**\nIn the post, the threat actor stated that they want to buy access to networks in the USA,\nCanada, Australia, and Great Britain, except for networks associated with medical and\ngovernment entities.\n\nThey further shared that they were willing to spend $3,000 to $100,000 per network that\nhad the following criteria:\n\nRevenue of $100 million or more.\nThe network should contain 500-15,000 devices.\nIt should be a new network that other threat actors have not already targeted.\n\nTo show that they were serious, the threat actor deposited four bitcoins ($120,000) in the\nExile hacking forum's cryptocurrency wallet to show that they mean business and were a\nserious player.\n\nAs forums promoting ransomware are now banned on the XSS and Exploit forums, the\nthreat actor did not indicate how they would use the network access.\n\n\n-----\n\n## BlackMatter ransomware gang emerges\n\nThat same day, researchers from Recorded Future revealed that a new Tor data leak site\nfor a 'BlackMatter' ransomware operation appeared on the dark web last week.\n\nThe name indicates that the BlackMatter threat actor is the public-facing representative for\nthe ransomware operation under the same name.\n\n**New**\n\n**BlackMatter data leak site**\nIn addition to posting information about themselves their operation, BlackMatter states that\nthey will not target entities in the following industries:\n\nHospitals.\nCritical infrastructure facilities (nuclear power plants, power plants, water treatment\nfacilities).\nOil and gas industry (pipelines, oil refineries).\n\n\n-----\n\nDefense industry.\nNon-profit companies.\nGovernment sector.\n\nRecorded Future says the gang's ransomware executables come in various formats so that\nthey can encrypt different operating systems and device architecture.\n\n\"The ransomware is provided for several different operating systems versions and\narchitectures and is deliverable in a variety of formats, including a Windows variant with\nSafeMode support (EXE / Reflective DLL / PowerShell) and a Linux variant with NAS\n[support: Synology, OpenMediaVault, FreeNAS (TrueNAS),\" reported Recorded Future.](https://www.recordedfuture.com/blackmatter-ransomware-successor-darkside-revil/)\n\n\"According to BlackMatter, the Windows ransomware variant was successfully tested on\nWindows Server 2003+ x86/x64 and Windows 7+ x64 / x86. The Linux ransomware variant\nwas successfully tested on ESXI 5+, Ubuntu, Debian, and CentOs. Supported file systems\nfor Linux include VMFS, VFFS, NFS, VSAN.\"\n\nAt this time, there are no victims listed on the site. However, the ransomware gang states\nthat \"all blogs hidden for now. For a very short time,\" indicating that they are actively\nattacking victims.\n\nBleepingComputer has been able to confirm that there are active attacks underway and that\nat least one victim paid $4 million to the threat actors this week.\n\n\n-----\n\n**BlackMatter Tor negotiation site**\n\n_Source: BleepingComputer_\nBased on the negotiation chat, this is a veteran ransomware operation and most likely a\nrebrand of one of the larger and now-defunct groups that recently shut down.\n\n## Rising from the ashes of DarkSide and REvil?\n\nInformation discovered by security researchers as well as the similarities in web sites\nand partners may indicate that BlackMatter has recruited or was created by threat actors\nthat were previously with the DarkSide and the REvil ransomware operations.\n\nAs ransomware gangs commonly rebrand to evade law enforcement, when we first reported\non DarkSide in August 2020, some security researchers and law enforcement believed\nREvil was rebranding as the new DarkSide operation.\n\nHowever, both gangs continued operating side-by-side for almost a year until DarkSide\nattacked Colonial Pipeline. Feeling the full pressure of the US government and law\n[enforcement, DarkSide shut down its operation in May.](https://www.bleepingcomputer.com/news/security/darkside-ransomware-servers-reportedly-seized-operation-shuts-down/)\n\n\n-----\n\nThe shut down of DarkSide was first reported by REvil s public-facing representative,\nUnknown, who posted about it on a hacking forum.\n\n**Forum post by UKNK about DarkSide seizure**\nTwo months later, it was [REvil's turn to shut down after conducting a](https://www.bleepingcomputer.com/news/security/revil-ransomware-gangs-web-sites-mysteriously-shut-down/) massive attack on\nmanaged service providers worldwide through a zero-day Kaseya VSA vulnerability.\n\n[Like DarkSide, REvil was feeling massive pressure from the US government and](https://www.bleepingcomputer.com/news/security/biden-asks-putin-to-crack-down-on-russian-based-ransomware-gangs/)\ninternational law enforcement. It is widely speculated that the Russian government told\nthem to shut down and disappear for a while.\n\nAfter seeing the BlackMatter Tor site, security researchers found that it showed a strong\nresemblance to the now-defunct DarkSide ransomware's Tor site.\n\nBoth pages share a similar color theme, similar language, a similar way of referring to\nthemselves, and also included a list of targets they would not attack.\n\nRecorded Future also reported that BlackMatter said, \"The project has incorporated in itself\nthe best features of DarkSide, REvil, and LockBit.\"\n\nFinally, cybersecurity firm Mandiant has seen indicators suggesting that an actor previously\nconnected to DarkSide is now partnering with BlackMatter.\n\n\"We have seen some indication that currently suggests that at least one actor connected to\nsome DARKSIDE ransomware operations is aligning themselves with\nBLACKMATTER,\" Kimberly Goody, Mandiant Director of Financial Crime Analysis, told\nBleepingComputer.\n\n\"This isn’t necessarily surprising as we commonly see ransomware affiliates partnering with\nmultiple providers.\"\n\n\n-----\n\nWhile many clues indicate that this may be a rebrand of DarkSide, or possibly created by\nactors from both groups, we will not know for sure until a sample of the ransomware is\nanalyzed for code similarities.\n\nAs BlackMatter attacks are ongoing, researchers will likely find a sample soon.\n\n### Related Articles:\n\n[REvil ransomware returns: New malware sample confirms gang is back](https://www.bleepingcomputer.com/news/security/revil-ransomware-returns-new-malware-sample-confirms-gang-is-back/)\n\n[Conti ransomware shuts down operation, rebrands into smaller units](https://www.bleepingcomputer.com/news/security/conti-ransomware-shuts-down-operation-rebrands-into-smaller-units/)\n\n[The Week in Ransomware - May 6th 2022 - An evolving landscape](https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-may-6th-2022-an-evolving-landscape/)\n\n[Conti, REvil, LockBit ransomware bugs exploited to block encryption](https://www.bleepingcomputer.com/news/security/conti-revil-lockbit-ransomware-bugs-exploited-to-block-encryption/)\n\n[REvil's TOR sites come alive to redirect to new ransomware operation](https://www.bleepingcomputer.com/news/security/revils-tor-sites-come-alive-to-redirect-to-new-ransomware-operation/)\n\n[BlackMatter](https://www.bleepingcomputer.com/tag/blackmatter/)\n[DarkSide](https://www.bleepingcomputer.com/tag/darkside/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n[Rebrand](https://www.bleepingcomputer.com/tag/rebrand/)\n[REvil](https://www.bleepingcomputer.com/tag/revil/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/fbi-warns-investors-of-fraudsters-posing-as-brokers-and-advisers/)\n[Next Article](https://www.bleepingcomputer.com/news/microsoft/remote-print-server-gives-anyone-windows-admin-privileges-on-a-pc/)\n\n### Comments\n\n\n-----\n\n[Amigo-A - 9 months ago](https://www.bleepingcomputer.com/forums/u/998576/amigo-a/)\n\n\"\"\"BlackMatter said, \"The project has incorporated in itself the best features of\nDarkSide, REvil, and LockBit.\"\"\"\nThis confession is the best proof, not even a sample is needed to tie together the\nextortionists behind it. They are not connected with Russia, they are by themselves,\noutside the area of responsibility.\n\n[Some-Other-Guy - 9 months ago](https://www.bleepingcomputer.com/forums/u/1150694/some-other-guy/)\n\nA confession is not proof\n\nplat1098 Photo\n[plat1098 - 9 months ago](https://www.bleepingcomputer.com/forums/u/980399/plat1098/)\n\nA Twitter post via BC suggests this gang will not attack oil and pipeline infractructure-to me, another clue that this BlackMatter gang is a re-do of REvil.\n\nI see Biden's threats aren't having the desired effects at the moment. Let's try yet\nagain, sir. Or is it a waste of time?\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\n\n-----\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-31 - BlackMatter ransomware gang rises from the ashes of DarkSide, REvil.pdf"
    ],
    "report_names": [
        "2021-07-31 - BlackMatter ransomware gang rises from the ashes of DarkSide, REvil.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536192,
    "ts_updated_at": 1743041175,
    "ts_creation_date": 1653617365,
    "ts_modification_date": 1653617365,
    "files": {
        "pdf": "https://archive.orkl.eu/b996ee76eef5421d1d2ee9695565e088e9665e65.pdf",
        "text": "https://archive.orkl.eu/b996ee76eef5421d1d2ee9695565e088e9665e65.txt",
        "img": "https://archive.orkl.eu/b996ee76eef5421d1d2ee9695565e088e9665e65.jpg"
    }
}