{
    "id": "2dd7f18f-a8e3-4403-a4c1-2e25dce1b66b",
    "created_at": "2024-04-19T02:05:19.25903Z",
    "updated_at": "2025-03-27T02:17:05.639784Z",
    "deleted_at": null,
    "sha1_hash": "4485a72e8dfe4255f38ac3e0f3f2c549ec82a01f",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-04-17T16:02:34Z",
    "file_modification_date": "2024-04-17T16:02:35Z",
    "file_size": 1639506,
    "plain_text": "## APT44: Unearthing Sandworm \n\n# APT44\n\n\n-----\n\n###### Authors\n\n Gabby Roncone, Dan Black, John Wolfram, Tyler McLellan, Nick Simonian,  Ryan Hall, Anton Prokopenkov, Dan Perez, Lexie Aytes, Alden Wahlstrom\n\n Acknowledgements\n\n Collaboration with companies and governments to track and mitigate threats is critical to our collective efforts to defend our networks against adversaries. The efforts of Mandiant Consulting across many incident response engagements in Ukraine since 2022 enabled much of the analysis included in this report. We’d additionally like to thank Mandiant's FLARE team, former Mandiant employees, ESET, Microsoft, Google TAG, numerous global government organizations, and most importantly, all of our partners in Ukraine. Our work would not be possible without their contributions.\n\n\n-----\n\n### Executive Summary\n\n###### With Russia's war in Ukraine in its third year, Sandworm  remains a formidable threat to Ukraine. The group’s operations  in support of Moscow’s war aims have proven tactically and operationally adaptable,  and as of today, appear to be better integrated with the activities of Russia’s conventional forces than in any other previous phase of the conflict. To date, no other Russian government-backed cyber group has played a more central role in shaping and supporting Russia’s military campaign.\n\n Yet the threat posed by Sandworm is far from limited to Ukraine. Mandiant continues to see operations from the group that are global in scope in key political, military, and economic hotspots for Russia. Looking forward, a record number of people will participate in national elections in 2024, and Sandworm’s history of attempting to interfere in democratic processes further elevates the threat the group may pose in the near-term. Given the active and persistent threat to governments and critical infrastructure operators globally, Mandiant has decided to graduate the group into APT44.\n\n Key Judgments\n\n • Sponsored by Russian military intelligence, APT44 is a dynamic and operationally mature threat actor, actively engaged in the full spectrum of espionage, attack,  and influence operations.\n\n • APT44 has aggressively pursued a multi-pronged effort to help the Russian  military gain a wartime advantage and is responsible for nearly all of the  disruptive and destructive operations against Ukraine over the past decade.\n\n • We assess with high confidence that APT44 is seen by the Kremlin as a flexible instrument of power capable of servicing Russia's wide ranging national interests  and ambitions, including efforts to undermine democratic processes globally. \n\n • Due to the group’s history of aggressive use of network attack capabilities across political and military contexts, APT44 presents a persistent, high severity threat to governments and critical infrastructure operators globally where Russian national interests intersect.\n\n\n-----\n\n### Overview of APT44\n\n###### APT44 (commonly known as Sandworm, FROZENBARENTS, and Seashell Blizzard)  is a Russian Federation backed threat group attributed by multiple governments to Unit 74455, the Main Centre for Special Technologies (GTsST) within the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GU), commonly known as the Main Intelligence Directorate (GRU). Mandiant has tracked APT44 operations for over a decade, with publicly available images of the unit’s anniversary insignia placing the group’s formation in 2009.\n\n While most Russian state-backed threat groups tend to specialize in a specific mission, APT44 is a uniquely dynamic threat actor that is actively engaged in the full spectrum  of cyber espionage, attack, and influence operations. These respective components constitute the gamut of special activities typically carried out by the GRU’s Information Operation Troops (VIO), to which we assess APT44 is highly likely subordinated.  We therefore view APT44 as a characteristic representation of the information confrontation (IPb) concept that underpins Russia’s present-day cyber forces.\n\n\n###### Unit 26165 85th Main Special Services Center (GTsSS)\n\n APT28\n\n\n###### Unit 74455 Main Center for Special Technologies (GTsST)\n\n\n-----\n\n###### ESPIONAGE\n\n Cryptographic Reconnaissance  of Information and Communication Systems (KRIKS)\n\n Криптографическая Разведка информационно-Коммуникационных  Систем (КРИКС)\n\n\n#### FULL SPECTRUM OPERATIONS\n\n###### ATTACK\n\n Information-Technical Influence / Effects (ITV)\n\n Информационно-Техническое  Воздействие (ИТВ)\n\nFigure 2. APT44 Full Spectrum Cyber Operations\n\n\n###### INFLUENCE\n\n Information-Psychological Influence / Effects (IPV)\n\n Информационно-Психологические Воздействие (ИПВ)\n\n\n-----\n\n###### A Global Targeting Mandate\n\n APT44 operations are global in scope and mirror Russia's wide ranging national interests and ambitions. In the post-Maidan Revolution era, this has led to cyber operations primarily centered on Ukraine, the epicenter of Russia’s revanchist geopolitical aims  over the past decade. However, even with an ongoing war, we have observed the group sustain access and espionage operations across North America, Europe, the Middle East, Central Asia, and Latin America. Patterns of activity over time indicate that APT44 is tasked with a range of different strategic priorities and is highly likely seen by the Kremlin as a flexible instrument of power capable of serving both enduring and emerging intelligence requirements.\n\n • APT44 primarily targets government, defense, transportation, energy, media, and civil society organizations in Russia’s near abroad. Government bodies and other Critical Infrastructure and Key Resources (CIKR) operators in Poland, Kazakhstan, and within Russia have frequently been included in the group’s recent targeting.\n\n • APT44 has repeatedly targeted Western electoral systems and institutions, including those in current and prospective North Atlantic Treaty Organization (NATO) member countries. As part of this activity, APT44 has attempted to interfere with democratic processes in select countries by leaking politically sensitive information and deploying malware to access election systems and misreport election data.\n\n • In less discriminate operations, Mandiant continues to observe APT44 conduct\n widespread credential theft targeting public and private sector mail servers globally. This campaign, which dates back to at least 2019, has targeted various mail environments including Exim, Zimbra and Exchange servers across a wide-range  of industry verticals. \n\n • APT44 also frequently targets journalists, civil society organizations, and non- governmental bodies involved in research or investigations into the Russian government. Examples include the 2018 operation targeting the Organization for the Prohibition of Chemical Weapons (OPCW) for its role in the Novichok poisoning investigations and a phishing campaign by an assessed APT44 initial access cluster between December 2023 and January 2024 which targeted Bellingcat and other investigative journalism entities .\n\n\n-----\n\n###### A Highly Adaptive Adversary\n\n APT44 is a persistent and operationally mature adversary that uses diverse initial access methods ranging from common vectors such as phishing, credential harvesting, and known vulnerability exploitation to targeted supply chain compromises. The group commonly leverages nonselective initial access vectors that provide wide-ranging access to targets of interest, later down-selecting victims of interest for the full spectrum of follow-on activity.\n\n • APT44 frequently achieves initial access through the exploitation of edge  infrastructure such as routers and virtual private network (VPN) appliances.  We have observed the group fulfill a variety of missions from footholds gained on network perimeters, including reconnaissance, information theft, downstream phishing, and the deployment of wiper malware.\n\n • Following in the footsteps of ETERNALPETYA (aka NotPetya), APT44 also continues to subvert software supply chains for initial access. In one recent case, access to a software developer resulted in the downstream compromise of critical infrastructure networks in Eastern Europe and Central Asia, followed by the deployment of wiper malware to a select victim organization.\n\n • APT44 is also known to employ unconventional methods to compromise targets of interest. As of February 2024, the group continues to leverage trojanized software installers distributed via torrents on Ukrainian- and Russian-language forums as a means of achieving opportunistic initial access to potential targets of interest. Once downloaded, victims of interest are manually flagged by APT44 operators with specifics such as the victim organizations or unit names, designating them for follow-on exploitation. We have seen these victims receive payloads such as DARKCRYSTALRAT (or DCRAT), commodity malware that APT44 has also used  to target telecommunications entities in Ukraine. \n\n\n-----\n\n###### Once inside a network, APT44 commonly uses living-off-the-land (LOTL) techniques to further its access, establish persistence,  and exfiltrate information. The group is also known for its “low-equity” approach to malware delivery that prioritizes open source  or criminally sourced tools over using its own custom implants.\n\n • APT44 operates with a high degree of operational security and continuously adapts to circumvent best-practice defensive principles. To achieve this outcome, we have seen the group generally adhere to a playbook designed to help scale its operations, limit forensic evidence in victim environments, and make post-exploitation activity hard to detect (see Figure 3).\n\n • Once inside a network, APT44 is highly judicious about deploying its most advanced, and likely most costly to develop, tools.  When custom malware is needed, APT44 typically deploys lightweight tools that are expendable and do not pose any significant attrition to the group’s overall capabilities when used or exposed.\n\n • APT44 almost certainly relies on a diverse set of Russian companies and criminal marketplaces to source and sustain its more frequently operated offensive capabilities.\n\n – Leaked documents from Russian company NTC Vulkan detailed project requirements for a framework used to enable cyber operations contracted by APT44’s parent military unit.\n\n – We also assess that at least one additional Russian cybersecurity company has provided direct operational support to APT44’s operations in Ukraine.\n\n – Since Russia’s re-invasion of Ukraine in early 2022, we have observed a relative increase in APT44’s use of tools and bulletproof hosting infrastructure acquired from criminal marketplaces. We assess that APT44 has likely long viewed criminally sourced tools and infrastructure as a latent pool of disposable capabilities that can be operationalized on short notice without immediate attributive links to its past operations.\n\n 1 2 3 4 5\n\n\n###### Going for the GPO\n\n Creating persistent, privileged access from which wipers can be deployed using a tried- and-true script\n\n\n###### Disrupt and Deny\n\n Deploying “pure”  wipers and disruptive tools to fit a variety of scenarios\n\n ITV | ИТВ\n\n Information-Technical Influence / Effects\n\n Информационно- Техническое Воздействие\n\n\n###### Living on the Edge\n\n Leveraging compromised edge infrastructure  to gain and regain entry into target networks\n\n\n###### Living off the Land\n\n Using pre-existing tools for recon, lateral movement and information theft on target networks, aiming to evade detection\n\n KRIKS | КРИКС\n\n\n###### Telegraphing “Success”\n\n Amplifying the narrative of successful disruption via hacktivist personas, regardless of the actual impact of the operation\n\n IPV | ИПВ\n\n Information- Psychological Influence / Effects\n\n Информационно- Психологические Воздействие\n\n\n###### Cryptographic Reconnaissance of Information  and Communication Systems\n\n Криптографическая Разведка информационно- Коммуникационных Систем\n\n\nFigure 3. Phases of Activity Commonly Observed in APT44 Operations\n\n\n-----\n\n###### Moscow’s Primary  Cyber Sabotage Unit\n\n Over the past decade, APT44 has established itself as Russia’s preeminent cyber sabotage unit. As an arm of Russia’s military,  it has been responsible for the majority of the GRU’s cyber- enabled sabotage in Ukraine stretching back to the initial invasion of the country in 2014. However, APT44’s attack operations are not limited to military objectives and also span Russia’s wider national interests, such as the Kremlin’s political signaling efforts, responses to crises, or intended non-escalatory responses to perceived slights to Moscow’s stature in the world.\n\n • Since Russia’s re-invasion of Ukraine in February 2022, APT44 has been responsible for almost all of the disruptive and destructive cyber attacks against Ukrainian CIKRs that Mandiant has responded to. We assess with high confidence  it is the primary cyber attack unit both within the GRU and across all Russian state-sponsored cyber units.\n\n • Since at least 2015, APT44 has operated and advanced a set of attack capabilities intended to disrupt industrial control and safety systems with the potential to cause significant physical damage. Since Russia’s reinvasion, further advancements in APT44’s cyber-physical attack capabilities have been observed, including a new variant of Industroyer and Operational Technology (OT)-specific living-off-the-land attack capabilities abusing a native MicroSCADA binary. While operations to date have primarily targeted Ukraine’s energy grid, the underlying technologies exploited hold the potential to impact a wider range of sectors including railways, seaports, airports,  and hospitals.\n\n • APT44 has also periodically engaged in cyber sabotage operations intended to signal bilateral displeasure, retaliate  for political grievances, or otherwise signal the weight  of the threat posed by Russia’s cyber program. For example:\n\n\n###### – In June 2017, APT44 deployed ETERNALPETYA  (aka NotPetya), a wiper disguised as ransomware,  timed to coincide with Ukraine’s Constitution Day  marking its sovereignty and independence from Russia. \n\n – In February 2018, APT44 used SOURGRAPES  (aka OlympicDestroyer) destructive malware against IT systems during the opening ceremony of the Pyeongchang Olympic Games as likely retaliation for Russia’s doping suspension. According to the UK government, preparations were also carried out to disrupt the 2020 Summer Olympics in Tokyo before they were postponed.\n\n – In October 2022, a cluster believed to be APT44 with medium confidence deployed PRESSTEA (aka Prestige) ransomware against logistics entities in Poland and Ukraine, likely to signal its ability to threaten supply lines transiting lethal aid to Ukraine. Notably, this operation is a rare instance where APT44 has shown a willingness to use a disruptive capability intentionally against a NATO member country, and reflects the group’s penchant for risk taking.\n\n Due to its history of aggressive cyber attacks across political and military contexts, we judge APT44 to present a persistent, high severity threat to governments and critical infrastructure operators globally where Russian national interests intersect. The threat of future disruptive or destructive cyber operations likely extends to individuals or entities involved in war crimes investigations or other inquiries into the Russian Federation’s transgressions in Ukraine. \n\n We also judge APT44 to present a significant proliferation  risk for new cyber attack concepts and methods. Continued advancements and in-the-wild use of the group’s information technology (IT) and OT cyber attack capabilities have also likely lowered the barrier of entry for other state and non-state actors to replicate and develop their own cyber attack programs.  Russia itself is almost certainly alert to and concerned about this proliferation risk, as Mandiant has observed Russian cybersecurity entities exercise their ability to defend against categories of disruptive cyber capabilities originally used by APT44 against Ukraine. \n\n\n-----\n\n### APT44’s Wartime  Cyber Operations\n\n###### APT44 has aggressively pursued a multi-pronged effort to help the Russian military  gain a wartime advantage with its cyber operations. Of the Russian government-backed cyber groups that we have tracked contributing to Russia’s military campaign in Ukraine, APT44 has and continues to play the most central role, seeking to advance Moscow’s war aims in multiple distinct ways. The group’s operational focus and methods have adapted significantly in the second year of the war to support Russia’s evolving theory  of victory, with increasing emphasis placed on military-relevant targets and tactical intelligence collection. \n\n • Disruptive Operations: APT44 is responsible for an intensive campaign of cyber disruptions stretching from invasion day in February 2022 to present. The group  has aggressively deployed wiper malware against a mix of civilian and military  targets, and has attempted to make the effects of the war felt beyond the front  lines in the day-to-day lives of Ukrainians.\n\n • Military Enablement: APT44 has also increasingly conducted espionage likely intended to enable Russian conventional military operations. These operations appear to focus on mobile networks, devices, applications and other technologies that could help to intercept communications and gain tactical and operational battlefield advantages. \n\n • Information Operations: APT44 has used front personas embedded in the pro- Russian Telegram ecosystem to attempt to shape the information environment  and draw attention to the alleged “impact” of select cyber operations.\n\n APT44 Disruptive Tooling\n\n SOURGRAPES\n\n BLACKENERGY INDUSTROYER ETERNALPETYA VPNFILTER INDUSTROYER.V2\n\n\n###### NEARMISS\n\n\n###### SDELETE PARTYTICKET\n\n\n###### PRESSTEA\n\n\n###### NEARTWIST\n\n\nPure Disruptive Cyber Tool\n\nMultifunctional Disruptive Cyber Tool\n\nDisguised as Ransomware\n\nModified Publicly or Commercially Available Tool\n\nPublicly or Commercially Available Tool\n\n\n###### NIKOWIPER\n\n\n###### JUNKMAIL\n\n\n###### CADDYWIPER ROARBAT\n\n\n###### NIKOWIPER.MBR\n\n\nFigure 4. Categories of Disruptive Malware Used by APT44\n\n\n-----\n\n###### Disruptive Operations Against Ukrainian Critical Infrastructure\n\n Mandiant has tracked an intensive campaign of cyber attacks against Ukrainian  entities by APT44 that reflect its primary mandate. These disruptive cyber operations have surpassed the scale, scope, and intensity of the group’s operations conducted in the war’s eight prior years, and have incorporated a wide arsenal of different disruptive or destructive malware families.\n\n • APT44’s disruptive activities have occurred in punctuated phases, mirroring the main stages of the war. Gaps between waves of disruptive activity have likely provided necessary windows to retool and replenish access to operationally relevant targets.\n\n • Targets of APT44’s disruptive activity have primarily been government networks  and critical infrastructure operators, with an emphasis on Ukraine’s energy sector.  We continue to see malware delivery operations seeking access to energy sector targets from a subcluster of APT44 activity tracked by CERT-UA as UAC-0099.\n\n • We assess with high confidence that, in specific operations, APT44 has coordinated the timing of these cyber attacks with conventional military activity, such as kinetic strikes or other forms of sabotage, in order to achieve joint military objectives in Ukraine. This repeated pattern of activity indicates either unity of command or operational coordination with other elements of Russia’s military. \n\n – For example, in October 2022, APT44 disrupted IT and OT systems at a power distribution entity in the midst of Russia’s winter campaign of military and drone strikes targeting Ukraine’s energy grid. Notably, this activity aligns with Microsoft’s independent analysis identifying a similar pattern of coordination between APT44 and other elements of the Russian military in the same timeframe.\n\n Mandiant has previously written about APT44’s shift to pure disruptive tools as a strategy to sustain its wartime tempo of operations. In furtherance of this arsenal management strategy, the second year of the war has seen the group progress from “low equity” to “no equity” tooling, abusing common utilities and publicly available tools like SDELETE, WinRAR, or native MicroSCADA binaries instead of custom-developed tools to achieve disruptive objectives.\n\n • As the war has progressed, Mandiant has also observed APT44 rely more heavily on open source tooling (e.g. webshells such as WEEVELY and REGEORG.NEO and tunnelers such as CHISEL) to gain and further access to networks preceding its disruptive activity.\n\n • The ready availability of these open source tools, variants of which can be created on-demand, has almost certainly provided the group an expendable reserve of new malware to cycle into its disruptive operations, helping to trivially replenish variants exhausted through prior use.\n\n\n-----\n\n###### Six Phases of APT44 Disruptive Operations during the 2022 War in Ukraine\n\n Cyber \n PHASE I Espionage and\n Pre-Positioning\n\n\n###### PARTYTICKET\n\n NEARMISS\n\n\n###### Initial  Destructive  Cyber  Operations  and Military Invasion\n\n Sustained Targeting and Attacks\n\n\n###### NEARTWIST\n\n SDELETE\n\n\n###### INDUSTROYER.V2, CADDYWIPER, SOLOSHRED, AWFULSHRED\n\n CADDYWIPER\n\n CADDYWIPER\n\n CADDYWIPER\n\n CADDYWIPER\n\n CADDYWIPER\n\n\n###### PARTYTICKET\n\n CADDYWIPER\n\n JUNKMAIL\n\n\n###### Maintaining Footholds for Strategic Advantage\n\n Renewed Campaign of Disruptive Attacks\n\n\n###### PRESSTEA\n\n NIKOWIPER.MBR\n\n\n###### CADDYWIPER, native MicroSCADA binary\n\n CADDYWIPER\n\n\n###### Refocus  on Cyber Espionage\n\n\n###### NIKOWIPER\n\n\n###### Target Industries\n\n Government Telecom Financial Media Energy Transportation\n\n\nFigure 5. APT44 Disruptive Operations Against Ukraine\n\n\n-----\n\n###### Espionage Operations  for Military Enablement \n\n In the second year of Russia’s re-invasion, we have also seen  a relative increase in APT44’s espionage activity to support battlefield reconnaissance and other tactical military needs.  This activity has included an apparent focus on communication systems and mobile devices, and is part of a wider transition amongst Russian military-linked actors to attempt to collect tactically relevant information from networks, devices, and applications used by the Ukrainian military. \n\n • Extending back to at least April 2023, APT44 has provisioned infrastructure for use by likely forward-deployed Russian military forces to exfiltrate encrypted Telegram and Signal communications from mobile devices captured on  the battlefield.\n\n – Related infrastructure contains step-by-step Russian language instructions on how to link the victim’s chat applications to actor-controlled infrastructure (See Figure 7). In order to follow these instructions, an operator would almost certainly require physical access to the devices  being paired.\n\n – The infrastructure also contains a link to contact an  APT44 developer on an actor-controlled Telegram account, indicating efforts to provide troubleshooting and support  to non-technical operators, such as forward deployed Russian military units in Ukraine.\n\nFigure 6. Links and instructions for Signal and Telegram exploitation\n\n\n###### – As noted by Google’s TAG, this operation’s infrastructure and tooling also contained derogatory language towards Ukrainians, providing a lens into the mindset of APT44’s operators as they support Russia’s military campaign.\n\n • With drones becoming increasingly crucial for battlefield success, APT44 has also conducted multiple phishing waves targeting organizations involved in drone manufacturing and logistics. Conforming with APT44’s tendency to use criminally-sourced malware, this activity exploited a known WinRAR vulnerability to deliver a SMOKELOADER dropper that subsequently loaded RADTHIEF (aka Rhadmanthys Stealer) in-memory.\n\n • We have also observed a surge in APT44 activity focused on gaining access to internet service providers and telecommunications entities providing mobile connectivity  to Ukrainian civilians and military personnel. As highlighted  by CERT-UA, these APT44 operations have periodically been used to enable disruptive activity as well. \n\n • In August 2023, multiple governments disclosed an additional espionage-focused capability, “Infamous Chisel,” operated by APT44 to collect information from Android devices, including system device information, commercial application information, as well as information from applications specific to the Ukrainian military.\n\nFigure 7. APT44 Provisioned Instructions for Linking Signal Accounts via QR Code\n\n\n-----\n\n###### Information Operations Amplifying Cyber Activity\n\n A particular feature of APT44’s approach to cyber operations  over the years has been its emphasis on attempting to generate second-order psychological effects to augment its espionage  and sabotage activities. These efforts have evolved since Russia’s re-invasion of Ukraine, with APT44 leveraging a series of front personas primarily on Telegram to publicly claim credit for data leaks and disruptive operations. Beyond a crude attempt to maximize its operational impact, we assess that these follow-on information operations are likely intended by APT44  to serve multiple wartime objectives. These aims include priming the information space with narratives favorable  to Russia, generating perceptions of popular support for the  war for domestic and foreign audiences, and making the GRU’s cyber capabilities appear more potent through exaggerated claims of impact.\n\n APT44 relies upon conventional information operations methods  to achieve its wider objectives. The group’s efforts are primarily focused on hack-and-leak or attack-and-leak operations, where sensitive documents or other “proof” of preceding cyber operations are posted primarily to Telegram to draw attention  to their alleged “impacts”. Consistent with the group’s pre-war activity leveraging personas such as Anonymous Poland and Guccifer 2.0, APT44 continues to cultivate hacktivist identities  as assets for its follow-on information operations. It has cycled through at least three primary hacktivist-branded Telegram channels to claim responsibility for its wartime disruptive operations: XakNet Team, CyberArmyofRussia_Reborn[1],  and Solntsepek.\n\n • We assess that APT44 continues to use these specific  channels due to their established followings and their positions of influence in the wider pro-Russian Telegram ecosystem, and suspect that the GRU has played a role in cultivating their prominence over time. Although the channels are operated  in parallel, they do not post the same content concurrently.\n\n • APT44’s exact relationship and control over each of these front personas likely varies. However, we have observed the closest operational relationship between APT44 and CyberArmyofRussia_Reborn (Russian: Народная CyberАрмия) and judge that the operators behind APT44  have the ability to direct and influence CyberArmyofRussia_ Reborn’s activity across multiple platforms.\n\n\n###### – Google’s TAG observed CyberArmyofRussia_Reborn’s YouTube channel being created from infrastructure attributed to APT44. The YouTube channel received minimal engagement and was terminated upon identification.\n\n – Mandiant has observed known APT44 infrastructure used to exfiltrate data from victims later leaked in the CyberArmyofRussia_Reborn Telegram channel, as well as egress to Telegram in close temporal proximity to the persona’s posted claims.\n\n – In one case, a series of APT44 operator errors resulted in CyberArmyofRussia_Reborn’s claims on Telegram preceding the network attack they referenced.\n\n – These patterns of interaction align with TAG’s assessment that CyberArmyofRussia_Reborn is created and controlled  by APT44.\n\n – Prior to rebranding as a “hacker group” in 2023 and claiming responsibility for APT44 disruptive cyber operations, Solntsepek (Russian: Солнцепек) conducted a long-term campaign of leaking personally identifiable information from Ukrainian military and security personnel, indicating the persona’s likely established relationship with the GRU.\n\n – Mandiant assesses that, since its rebranding, Solntsepek  has likely been used as a primary vehicle to claim responsibility for and leak stolen information from  APT44 disruptive cyber attacks.\n\n – Solntsepek’s posts have mirrored APT44’s operational focus in the second year of the war, claiming cyber attacks on military-relevant targets more often than previous APT44 front personas.\n\n Efforts at follow-on amplification of APT44 associated Telegram posts appear to be largely constrained to cross-posting within established pro-Russian Telegram communities. For example, JokerDNR played a significant role in amplifying Solntsepek  when the Telegram channel first launched and then again as it rebranded into a hacker group. While we have observed limited attempts to break into other communities through defacements, we suspect the group primarily relies upon organic media coverage for reach and credibility rather than investing resources to spread its messaging on other platforms. Mandiant does not currently attribute the JokerDNR persona to a specific threat group or sponsor.\n\n\n1 Mandiant had previously attributed XakNet and CyberArmyofRussia Reborn activity to APT28 based on a case of cohabitation where APT28 and APT44 were both operating in the same\n\n\n-----\n\n###### XAKNET Cyber Army of Russia Reborn (CARR) Solntsepek\n\nFigure 8. Hacktivist Telegram Personas Associated with APT44\n\n\n###### CyberArmyofRussia_Reborn Video Content Claims Manipulation of of US and European Critical Infrastructure OT Assets\n\n A majority of the attack-and-leak activity that Mandiant has tracked from GRU linked Telegram personas has centered on Ukrainian entities. However, CyberArmyofRussia_Reborn’s claimed intrusion activity has not been so limited.\n\n • Between 17 and 18 January 2024, the group’s Telegram channel posted videos taking credit for the manipulation of human machine interfaces (HMI) controlling operational technology (OT) assets  at Polish and U.S. water utilities.\n\n • On 02 March 2024, the group posted an additional video claiming  to disrupt electricity generation at a French hydroelectric facility  by manipulating water levels.\n\n • Each of the videos posted by CyberArmyofRussia_Reborn appear  to show an actor haphazardly interacting with interfaces controlling the respective water or hydroelectric facilities’ OT assets.\n\n Mandiant cannot independently verify the above claimed intrusion activity or its links to APT44 at this time. However, we note that officials from the affected U.S. utilities later publicly acknowledged incidents at entities advertised as victims in the CyberArmyofRussia_Reborn video.\n\n • Approximately two weeks after the Telegram post taking credit for the U.S. targeting, a local official publicly confirmed a “system malfunction” that led to a tank overflowing at one of the claimed victim facilities. This activity was reportedly part of a series of cyber incidents impacting multiple local U.S. water infrastructure systems that stemmed from “vendor software they use that keeps their water\n\n\nFigure 9. CyberArmyofRussia_Reborn video screenshot\nshowing manual manipulation of well control inputs\n\n\n-----\n\n### Takeaways\n\n###### APT44 continues to present one of the widest and high severity cyber threats globally.  It has been at the forefront of the threat landscape for over a decade and is responsible for a long list of firsts that have set precedents for future cyber attack activity. The combination of APT44's high capability, risk tolerance, and far-reaching mandate to support Russia’s foreign policy interests places governments, civil society, and CIKR operators around the world at risk of falling into the group's sights on short notice. Patterns of historical activity, such as efforts to influence elections or retaliate against international sporting bodies, suggests there is no limit to the nationalist impulses that may fuel the group’s operations in the future.\n\n Despite its bias for action and emphasis on psychological effect, APT44 has shown  itself to be patient, resourceful, and able to remain undetected for long periods of time in victim environments. The group’s playbook is almost certainly tailored to carry out intrusions undetected, and its use of both open source and criminally-sourced malware can often result in activity being disregarded as a commodity threat. Organizations  at high risk of being targeted by APT44 should prioritize detections of LOTL techniques and carefully investigate instances of commercially available malware as potential APT44 activity. Responses to APT44 should also consider the group’s sensitivity to counterintelligence risk. This is an actor that is highly aware of incident response and detection efforts, and, in certain cases, mitigation efforts may drive an intrusion toward disruptive activity.\n\n As Russia’s war continues, we anticipate Ukraine will remain the principal focus of APT44 operations. However, as history indicates, the group’s readiness to conduct cyber operations in furtherance of the Kremlin’s wider strategic objectives globally is ingrained in its mandate. We assess that changing Western political dynamics, future elections, and emerging issues in Russia’s near abroad will continue to shape APT44’s operations for the foreseeable future.\n\n Protecting The Community\n\n As part of our efforts to combat serious threat actors, TAG uses the results of our research to improve the safety and security of Google’s products. Upon discovery,  all identified websites and domains are added to Safe Browsing to protect users  from further exploitation. TAG also sends all targeted Gmail and Workspace users government-backed attacker alerts notifying them of the activity and encourages potential targets to enable Enhanced Safe Browsing for Chrome and ensure that  all devices are updated. Where possible, Mandiant sends victim notifications via  the Victim Notification Program.\n\n To protect high risk user accounts, we offer the Advanced Protection Program (APP), which is our highest form of account security and has a strong track record protecting users. If you are a Google Chronicle Enterprise+ customer, Chronicle rules were released to your Emerging Threats rule pack, and IOCs listed in this report are available for prioritization with Applied Threat Intelligence.\n\n We are committed to sharing our findings with the security community to raise awareness, and with companies and individuals that might have been targeted by these activities. We hope that improved understanding of tactics and techniques will enhance threat hunting capabilities and lead to stronger user protections across the industry.\n\n\n-----\n\n### Technical Annex\n\n###### APT44 Indicators of Compromise\n\n For IOCs, please see our VT Collection.\n\n Malware\n\n This section includes malware Mandiant observed APT44 using since 2018, with the exception of ETERNALPETYA (aka NotPetya), which was deployed by APT44 in 2017. We have split this section into three: custom malware unique to APT44, malware that is publicly or commercially available but modified and customized by APT44, and publicly or commercially available malware used by APT44.\n\n Custom\n\n Malware Role Description\n\nARGUEPATCH is a malicious launcher that decrypts a file on disk using a trivial XOR algorithm and executes a second stage\nARGUEPATCH Launcher\npayload in memory.\n\nAXETERROR is a backdoor written in Go. Upon startup, the malware creates persistence as either a cron job or a system\nAXETERROR Backdoor startup script. AXETERROR communicates over HTTPS and supports the following commands: update or delete itself,\ndownload or upload files to C2, execute shell commands, set proxy configuration, update C2, and update beacon interval.\n\nBACKORDER is a downloader written in Go which targets Windows machines. It downloads and executes a second stage\nBACKORDER Downloader payload from a remote server. BACKORDER is usually delivered within trojanized installer files and is hard coded to execute\nthe original setup executable.\n\nBACKORDER.v2 is a downloader written in Go that targets the Windows environment. It downloads and executes a second\nstage payload from a remote server. The malware can set the %TEMP% directory as an excluded folder from Windows\n\nBACKORDER.V2 Downloader\n\nDefender before downloading a zip file to that folder from its C2 server. The malware unzips the downloaded zip file and\nexecutes the file inside.\n\nBRUSHPASS is a Webshell written in C# which provides a threat actor with the means to execute commands, alter victim\nfirewall configurations, upload files to the victim device, perform directory listing, file deletion and file collection. Additional\n\nBRUSHPASS Webshell\n\ncapabilities in some BRUSHPASS samples include the collection of the current page URL as an absolute path, both uploading\nand downloading of files, and opening ports on the victim machine.\n\nCADDYWIPER is a disruptive file wiper written in C which enumerates the file system physical drives and overwrites both file\nCADDYWIPER Wiper\ncontent and partitions with null bytes. CADDYWIPER has both executable and shellcode variants.\n\nCOLDWELL is a dropper written in C that contains an encrypted and embedded payload. Upon execution COLDWELL\nCOLDWELL Dropper generates a random filename to write an embedded payload, configures persistence, and blends the next-stage timestamp\nwith a legitimate file on disk.\n\nEARLYBLOOM is a backdoor written in C++ that communicates over HTTPS. Supported backdoor commands include shell\nEARLYBLOOM Backdoor\ncommand execution, file transfer, file execution, and uninstall.\n\nEXARAMEL is a backdoor that is capable of encrypting and exfiltrating files from a configured directory as well as receiving\nand executing commands from C2. EXARAMEL stores its configuration, structured as XML, in the registry. The configuration\n\nEXARAMEL Backdoor\n\ndefines its C2, exfiltration directory, proxy, and beacon interval. EXARAMEL is capable of executing the following tasks:\nlaunch a process, create a file, upload a file, execute a shell command, and execute a VB Script.\n\nFACEFISH is a dropper, which releases a rootkit, and its main function is determined by the rootkit module, which works at the\nRing3 layer and is loaded using the LD_PRELOAD feature to steal user login credentials by hooking ssh/sshd program related\n\nFACEFISH Dropper functions. FACEFISH also supports some backdoor functions and supports pretty flexible configuration, uses Diffie-Hellman\n\nexchange keys, Blowfish encrypted network communication, and targets Linux x64 systems. The main functions of\nFACEFISH are: upload device information, stealing user credentials, bounce Shell and execute arbitrary commands.\n\nFAIRROOT is a VBScript macro used to deliver an encoded payload usually decoded using a fixed string as a key. FAIRROOT\nFAIRROOT Dropper\nis capable of determining if the system is running in a sandbox.\n\nFELIXROOT is a memory-only DLL backdoor that is capable of system reconnaissance, data exfiltration, and remote code\nFELIXROOT Backdoor execution. All communications, including exfiltrated data, are AES-encrypted with one of two hard-coded public keys, and\nsent back to the C2 server via HTTP or HTTPS.\n\nFIZZLESHELL is a PHP webshell that employs well written cryptographic code to obfuscate three supported commands.\nFIZZLESHELL Webshell These commands are invoked by setting a cookie to a specific value. FIZZLESHELL sends its HTTP(S) POST data with the\ncontent of a MIME message to a hardcoded C2 server.\n\nFREETOW is an in-memory dropper for a shellcode payload. FREETOW has been identified as a payload patched into\nMemory Only legitimate Microsoft applications FREETOW contains an anti emulation technique where it requires the first character of the\n\n\n-----\n\nGOGETTER is a tunneler written in Go that proxies communications for its C2 server using the open-source library Yamux\nGOGETTER Tunneler\nover TLS.\n\nICYWELL is a backdoor written in C++ that gives a threat actor a reverse shell, executes arbitrary commands, can write and\nICYWELL Backdoor\nread files, and in some instances updates itself on host.\n\nILLICITORDER is a dropper written in C++ which contains an XOR and Base64-encoded second stage payload. Upon\nILLICITORDER Dropper execution, ILLICITORDER drops the second stage payload to disk and executes it alongside a legitimate installer.\nILLICITORDER is usually embedded into trojanized software installation media.\n\n\nDisruptive\nINDUSTROYER Malware\nFramework\n\n\nINDUSTROYER is a modular malware framework that is designed to survey and manipulate power grid control systems.\nIncluded in the framework are four modules that issue commands to open (and close) circuit breakers, a wiper module\ndesigned to search for and overwrite several control system specific files, and a SIPROTEC DoS module.\n\n\nITCHYSPARK is a lateral movement tool used to deploy the NEARMISS wiper. ITCHYSPARK enumerates the local network via\nITCHYSPARK Utility\nvarious APIs, attempts an SMB connection, and is capable of port scanning.\n\nITCHYSPARK.SMB Utility ITCHYSPARK.SMB is a lateral movement tool used to copy an executable to a remote SMB server, and to execute the file.\n\nITCHYSPARK.WMI is a lateral movement tool used to copy an executable to a remote path, and execute the file as a Windows\nITCHYSPARK.SMB Utility\nservice or a standard process via WMI/COM.\n\nJUNKMAIL is a .NET wiper which uses an unknown obfuscator and junk code to obfuscate control flow. JUNKMAIL\nJUNKMAIL Wiper enumerates each domain controller under the domain as well as drives, their respective directories, and files. It wipes files by\noverwriting them with null bytes.\n\nLUCKYPIE is a launcher that loads and executes a DLL from its resource section. The malware is embedded into the zlib\nLUCKYPIE Launcher\nlibrary code and exports many zlib functions.\n\nNEARMISS is a master boot record (MBR) wiper that disables the Shadow Volume Copy and CrashDumps before wiping the\nNEARMISS Wiper\nMBR. After successful execution, the wiper will initiate a system shutdown, rendering the targeted device inoperable.\n\nNEARTWIST is a disruptive file wiper written in C which enumerates the device’s physical drives and attempts to wipe them\nNEARTWIST Wiper\neither directly or through overwriting the content of each file using data obtained from a pseudorandom number generator.\n\n\nMemory-Only\nNEWRETURN\nDropper\n\n\nNEWRETURN is an in-memory .Net dropper which contains an embedded binary that is decompressed and executed as the\nmain functionality of this malware family. Some identified samples are padded with a huge number of null bytes, likely to\nmake this sample infeasible for submission to automated analysis tools.\n\n\nNIKOWIPER is a disruptive tool written in C that contains an embedded SysInternal's SDelete executable that is used to\nNIKOWIPER Wiper\ndelete files on disk.\n\nNIKOWIPER.MBR is a disruptive tool written in C that contains an embedded SysInternal's SDelete executable that is used to\nNIKOWIPER.MBR Wiper\ndelete files on disk. NIKOWIPER.MBR contains additional functionality that wipes the Master Boot Record on victim devices.\n\nPARTYTICKET is a disruptive file wiper written in Go that enumerates the file system and selects files to wipe based on the\nPARTYTICKET Wiper\nfile extension. PARTYTICKET will then encrypt the content of the files with AES.\n\nPENNYBAG is a malicious macro dropper used to decode and write a payload to disk. Encoded payloads are stored as a\nPENNYBAG Dropper series of byte arrays. PENNYBAG has historically been used to distribute BLACKENERGY.V2 and V3 and STRAYKEY in\ntargeted attacks.\n\nPRESSTEA is ransomware written in C++ that encrypts local files. Observed extensions for encrypted files include “.enc”.\nPRESSTEA Ransomware\nPRESSTEA uses wbadmin to delete the backup catalog on a computer then wipes the volume shadow copies.\n\nQUICKTOW is a lightweight backdoor written in Go that communicates via HTTP. Its supported backdoor commands include\nQUICKTOW Backdoor command execution, opening a new session, and disconnecting. QUICKTOW can also connect to other instances of the\nbackdoor to forward commands.\n\nROARBAT Wiper ROARBAT is a batch disruptive wiper responsible for enumerating drives and directories and using WinRAR to delete data.\n\nDisruptive SOURGRAPES is a disruptive malware which is responsible for destroying files on network shares and disabling all services\nSOURGRAPES\nMalware on a victim system.\n\nSHARPCOFFEE is a downloader written in JavaScript which retrieves payloads via HTTP. Downloaded payloads are executed\nSHARPCOFFEE Downloader from memory using a PowerShell sub-process, and console output is uploaded to a remote server via HTTP. SHARPCOFFEE\nhas been observed being delivered via SHARPIVORY, and subsequently downloading SHARPENTRY.\n\nSHARPCOFFEE. SHARPCOFFEE.VBS is a Windows downloader written in Visual Basic used to download other malware and upload data via\nDownloader\nVBS Powershell.\n\nSHARPENTRY is a downloader written in C that retrieves payloads via TCP. Details of the remote server are provided as\nSHARPENTRY Downloader command-line arguments. Payloads are decoded and mapped into memory, with the entry-point being determined at run-time.\nSHARPENTRY has been observed being deployed via SHARPCOFFEE and subsequently deploying METERPRETER.\n\nSHARPIVORY is a dropper written in .NET that writes an embedded payload to disk and establishes persistence via scheduled\nSHARPIVORY Dropper tasks. The dropper also drops and opens a decoy Microsoft Office Word document. SHARPIVORY has been observed\ndropping SHARPCOFFEE.\n\nSPAREPART is a lightweight backdoor written in C that uses the device's UUID as a unique identifier for communications with\nSPAREPART Backdoor the C2. Upon successful connection to a C2, SPAREPART will download the tasking and execute it through a newly created\nprocess.\n\nSWEETTREAT is a utility service which provides cryptographic functionality upon request via a named pipe or RPC.\nSWEETTREAT Utility\nSWEETTREAT appears to represent a class of functionality that is uncommon.\n\n\n-----\n\n###### Modified Publicly or Commercially Available\n\n Malware Role Description\n\nEarly BLACKENERGY malware variants were used to create distributed denial-of-service (DDoS)-focused botnets and have\nsince evolved over time. Variants of BLACKENERGY, BLACKENERGY.V2 and BLACKENERGY.V3, are modular backdoors\nwhich have the ability to download additional conditional modules to targeted machines. BLACKENERGY.V2 and\n\nBLACKENERGY Backdoor BLACKENERGY.V3 samples used by Sandworm only utilized modules to conduct espionage. Often configured to\n\ncommunicate with two C2 servers, these BLACKENERGY variants contain basic capabilities such as victim profiling, updating\nits configuration block, downloading and executing files, downloading and loading plugins, unloading and deleting plugins,\nand uninstalling the backdoor.\n\nHEXCHAMBER is a custom implementation of open-source project, Malicious Macro Generator (MMG). The variation of this\nHEXCHAMBER Builder macro breaks encoded strings into binary and hex-based counterparts and concatenates them into an encoded command\nstring later decoded with a constant. HEXCHAMBER has been used to distribute PowerShell Empire.\n\nPetya is ransomware family that is atypical in that the malware does not encrypt individual files on victims' systems, but\ninstead overwrites the master boot record (MBR) and encrypts the master file table (MFT), which renders the system\ninoperable until the ransom has been paid. The malware contains a dropper, custom boot loader, and a small Windows kernel\n\nETERNALPETYA Wiper\n\nthat executes additional encryption routines. The ETERNALPETYA variant of PETYA is a disruption tool capable of encrypting\nfiles, encrypting the MBR, installing a bootkit, extracting credentials, performing lateral movement, and remote exploitation\nvia known vulnerabilities.\n\nPOWERDISCO is a Windows PowerShell script that has the capability to enumerate Group Policies Objects (GPO) using the\nActive Directory Service Interface (ADSI). It may only be able to find policies linked to the Root domain. POWERDISCO may\n\nPOWERDISCO Utility\n\nhave been sourced from a blog post by Medium user @pentesttas called “Discover Hidden GPO(s) on Active Directory using\nPS>ADSI” and then modified by the attacker.\n\nTANKTRAP is a utility written in PowerShell that utilizes Windows group policy to spread and launch a wiper. TANKTRAP has\n\nTANKTRAP Utility been observed being used with NEARMISS, SDELETE, PARTYTICKET, and CADDYWIPER. TANKTRAP is likely inspired by\n\n[public projects like SharpGPOAbuse and PowerGPOAbuse.](https://github.com/FSecureLABS/SharpGPOAbuse)\n\nWILDDIME is a PowerShell backdoor capable of downloading, uploading and executing files. WILDDIME has been identified\nWILDDIME Backdoor deployed via a LNK file and is responsible for opening a decoy document. WILDDIME is a modified variant of the public tool\nHTTP-Shell, a tool developed by the developer JoelGMSec.\n\n###### Publicly or Commercially Available\n\n\n-----\n\nPIVOTNACCI Tunneler\n\n\nPIVOTNACCI is an open-source tunneler tool which allows pivot into the internal network by deploying HTTP agents.\nPIVOTNACCI allows the creation of a SOCKS server which communicates with HTTP agents. This tool was inspired by\nanother open-source tunneler REGEORG. However, it includes some improvement, including support for balanced servers,\ncustomizable polling intervals, auto-dropping connections closed by a server or password-protected agents.\n\n\nWSO is a PHP-based webshell that functions as a backdoor. Supported backdoor commands include shell command\nWSO Webshell execution, reverse shell, file transfer, arbitrary PHP code execution, SQL database management, and file management. WSO\nrequires a password to operate.\n\n\n-----\n\n###### APT44 Related Hunting Rules\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n###### Mandiant Security Validation Actions\n\n Organizations can validate their security controls using the following actions with Mandiant Security Validation.\n\n VID Name\n\nA101-165 Application Vulnerability - APT44, CVE-2019-10149, Remote Code Execution, Benign Payload\n\nA101-166 Application Vulnerability - APT44, CVE-2019-10149, Remote Code Execution, Malicious Payload\n\nA102-517 Command and Control - APT44, AXETERROR, Beacon, Variant #1\n\nA107-038 Command and Control - APT44, BLACKENERGY, Beacon, Variant #1\n\nA106-188 Command and Control - APT44, BRUSHPASS, DNS Query, Variant #1\n\nA107-010 Command and Control - APT44, DARKCRYSTALRAT, C2 Communication, Variant #2\n\nA105-312 Command and Control - APT44, DARKCRYSTALRAT, DNS Query, Variant #1\n\nA105-407 Command and Control - APT44, DNS Query, Variant #1\n\nA105-408 Command and Control - APT44, DNS Query, Variant #2\n\nA107-026 Command and Control - APT44, FELIXROOT, Beacon, Variant #1\n\nA106-106 Command and Control - APT44, GOGETTER, DNS Query, Variant #1\n\nA107-024 Command and Control - APT44, PASWEB, Download File\n\nA107-027 Command and Control - APT44, PASWEB, Establish Connection\n\nA107-033 Command and Control - APT44, PASWEB, Execute phpinfo() Command\n\nA107-013 Command and Control - APT44, PASWEB, Execute Version Command\n\nA107-016 Command and Control - APT44, PASWEB, File Search\n\nA107-031 Command and Control - APT44, PASWEB, Upload File\n\nA106-103 Command and Control - APT44, QUICKTOW, C2 Communication, HTTP Post, Variant #1\n\nA106-102 Command and Control - APT44, QUICKTOW, DNS Query, Variant #1\n\nA106-008 Command and Control - APT44, SPAREPART, Beaconing, Variant #1\n\nA107-001 Command and Control - APT44, TRICKSHOW, Beacon, Variant #1\n\nA106-994 Command and Control - APT44, TRICKSHOW, Beacon, Variant #2\n\nA106-996 Command and Control - UNC1908, STRAYKEY, Check-in\n\nA106-998 Command and Control - UNC1908, STRAYKEY, Command Response\n\nA106-999 Command and Control - UNC1908, STRAYKEY, Startup Communication\n\nA104-850 Host CLI - APT44, Add New Local User mysql_db, Linux\n\nA106-193 Host CLI - APT44, BRUSHPASS, Modifying Firewall Rules\n\nA106-439 Host CLI - APT44, CADDYWIPER, Scheduled Task, Variant #1\n\n\n-----\n\n-----\n\nA102-993 Malicious File Transfer - APT44, INDUSTROYER, Download, Variant #2\n\nA107-012 Malicious File Transfer - APT44, ITCHYSPARK.SMB, Download, Variant #1\n\nA107-011 Malicious File Transfer - APT44, ITCHYSPARK.WMI, Download, Variant #1\n\nA101-887 Malicious File Transfer - APT44, Malicious Bash Script, Download, Variant #2\n\nA101-390 Malicious File Transfer - APT44, METERPRETER, Download\n\nA102-573 Malicious File Transfer - APT44, NEARMISS, Download, Variant #1\n\nA102-574 Malicious File Transfer - APT44, NEARMISS, Download, Variant #2\n\nA102-662 Malicious File Transfer - APT44, NEARTWIST, Download, Variant #1\n\nA106-995 Malicious File Transfer - APT44, NEWRETURN Dropper, Download, Variant #1\n\nA105-426 Malicious File Transfer - APT44, OWA Credential Harvesting Page, Download, Variant #1\n\nA105-427 Malicious File Transfer - APT44, OWA Credential Harvesting Page, Download, Variant #2\n\nA105-428 Malicious File Transfer - APT44, OWA Credential Harvesting Page, Download, Variant #3\n\nA105-429 Malicious File Transfer - APT44, OWA Credential Harvesting Page, Download, Variant #4\n\nA102-663 Malicious File Transfer - APT44, PARTYTICKET, Download, Variant #1\n\nA103-614 Malicious File Transfer - APT44, POWERDISCO, Download, Variant #1\n\nA107-023 Malicious File Transfer - APT44, REGEORG.NEO, Download, Variant #1\n\nA107-019 Malicious File Transfer - APT44, REGEORG.NEO, Upload, Variant #1\n\nA106-009 Malicious File Transfer - APT44, SPAREPART, Download, Variant #1\n\nA106-546 Malicious File Transfer - APT44, STOWAWAY, Download, Variant #1\n\nA106-547 Malicious File Transfer - APT44, STOWAWAY, Download, Variant #2\n\nA107-030 Malicious File Transfer - APT44, TANKTRAP, Download, Variant #1\n\nA102-579 Malicious File Transfer - APT44, VPNFILTER, Download, Variant #1\n\nA102-580 Malicious File Transfer - APT44, VPNFILTER, Download, Variant #2\n\nA102-581 Malicious File Transfer - APT44, VPNFILTER, Download, Variant #3\n\nA101-287 Malicious File Transfer - CVE-2019-10149, APT44, Malicious Bash Script, Download\n\nA106-997 Malicious File Transfer - UNC4209, SWEETJADE, Download, Variant #1\n\nA106-988 Malicious File Transfer - WSO, Upload, Variant #1\n\nA107-035 Phishing Email - APT44, Malicious Attachment, FAIRROOT, Variant #1\n\nA107-034 Phishing Email - APT44, Malicious Attachment, FELIXROOT, Variant #1\n\nA107-039 Phishing Email - APT44, Malicious Attachment, HEXCHAMBER, EMPIRE, Variant #1\n\nA107-022 Phishing Email - APT44, Malicious Attachment, HEXCHAMBER, Variant #1\n\nA107-032 Phishing Email - APT44, Malicious Attachment, HEXCHAMBER, Variant #2\n\nA107-044 Phishing Email - APT44, Malicious Attachment, PENNYBAG, BLACKENERGY, Variant #1\n\nA107-014 Phishing Email - APT44, Malicious Attachment, PENNYBAG, BLACKENERGY, Variant #2\n\nA107-042 Phishing Email - APT44, Malicious Attachment, PENNYBAG, BLACKENERGY, Variant #3\n\nA107-036 Phishing Email - APT44, Malicious Attachment, PENNYBAG, BLACKENERGY, Variant #4\n\nA101-158 Phishing Email - Malicious Attachment, APT44, Doc Lure\n\nA103-626 Phishing Email - Malicious Attachment, APT44, EARLYBLOOM, HTML Downloader\n\nA107-041 Phishing Email - Malicious Attachment, APT44, TRICKSHOW Dropper, Variant #1\n\nA107-007 Protected Theater - APT44, ILLICITORDER, Execution, Variant #1\n\nA107-020 Protected Theater - APT44, BLACKENERGY, Execution, Variant #1\n\nA105-030 Protected Theater - APT44, CADDYWIPER, Execution, Variant #1\n\nA106-437 Protected Theater - APT44, CADDYWIPER, Execution, Variant #2\n\nA107-002 Protected Theater - APT44, COLIBRI Dropper, Mount ISO, Variant #1\n\nA106-989 Protected Theater - APT44, COLIBRI, Execution, Variant #1\n\nA107-004 Protected Theater - APT44, COLIBRI, Execution, Variant #2\n\nA106-107 Protected Theater - APT44, Create GOGETTER Scheduled Task\n\nA107-005 Protected Theater - APT44, DARKCRYSTALRAT, Execution, Variant #1\n\nA105-346 Protected Theater - APT44, EARLYBLOOM, CVE-2022-30190, HTML Downloader, Execution\n\n\n-----\n\nA106-372 Web Server Activity - APT44, BRUSHPASS, Webshell File Upload Activity\n\n\n###### For more information visit cloud.google.com 332694141\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/apt44-unearthing-sandworm.pdf"
    ],
    "report_names": [
        "apt44-unearthing-sandworm.pdf"
    ],
    "threat_actors": [
        {
            "id": "0bce7575-ba34-4742-afb7-a4d3ade12dbe",
            "created_at": "2023-11-14T02:00:07.091122Z",
            "updated_at": "2025-03-27T02:00:03.221412Z",
            "deleted_at": null,
            "main_name": "XakNet",
            "aliases": [
                "UAC-0100",
                "UAC-0106"
            ],
            "source_name": "MISPGALAXY:XakNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "154da875-2e93-41ab-8a41-90fdd66b214b",
            "created_at": "2024-01-09T02:00:04.2024Z",
            "updated_at": "2025-03-27T02:00:03.279588Z",
            "deleted_at": null,
            "main_name": "UAC-0099",
            "aliases": [],
            "source_name": "MISPGALAXY:UAC-0099",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2b45a355-6d1d-44d8-8bc3-20c17e30757d",
            "created_at": "2023-12-21T02:00:06.092349Z",
            "updated_at": "2025-03-27T02:00:03.272612Z",
            "deleted_at": null,
            "main_name": "Solntsepek",
            "aliases": [],
            "source_name": "MISPGALAXY:Solntsepek",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d58f7d9f-abb3-4e78-a13a-b87399fc03e5",
            "created_at": "2024-04-20T02:00:03.559673Z",
            "updated_at": "2025-03-27T02:00:03.353905Z",
            "deleted_at": null,
            "main_name": "Cyber Army of Russia Reborn",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Army of Russia Reborn",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1713492319,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1713369754,
    "ts_modification_date": 1713369755,
    "files": {
        "pdf": "https://archive.orkl.eu/4485a72e8dfe4255f38ac3e0f3f2c549ec82a01f.pdf",
        "text": "https://archive.orkl.eu/4485a72e8dfe4255f38ac3e0f3f2c549ec82a01f.txt",
        "img": "https://archive.orkl.eu/4485a72e8dfe4255f38ac3e0f3f2c549ec82a01f.jpg"
    }
}