{
    "id": "2e33292b-b540-4a79-af73-9c5405c99326",
    "created_at": "2023-01-12T15:09:03.652731Z",
    "updated_at": "2025-03-27T02:10:09.997369Z",
    "deleted_at": null,
    "sha1_hash": "89aba852a9cbc040e40cbe21301a60db92702d08",
    "title": "2019-05-09 - Top-Tier Russian Hacking Collective Claims Breaches of Three Major Anti-Virus Companies",
    "authors": "",
    "file_creation_date": "2022-05-28T03:14:50Z",
    "file_modification_date": "2022-05-28T03:14:50Z",
    "file_size": 1131678,
    "plain_text": "# Top-Tier Russian Hacking Collective Claims Breaches of Three Major Anti-Virus Companies\n\n**[advanced-intel.com/blog/top-tier-russian-hacking-collective-claims-breaches-of-three-major-anti-virus-companies](https://www.advanced-intel.com/blog/top-tier-russian-hacking-collective-claims-breaches-of-three-major-anti-virus-companies)**\n\nAdvIntel May 9, 2019\n\nMay 9, 2019\n\n3 min read\n\n**Executive Summary**\n\n\"Fxmsp\" is a high-profile Russian- and English-speaking hacking collective. They\nspecialize in breaching highly secure protected networks to access private corporate\nand government information.\n\n\n-----\n\nThey have a long-standing reputation for selling sensitive information from high-profile\nglobal government and corporate entities.\n\nIn March 2019, Fxmsp stated they could provide exclusive information stolen from\nthree top anti-virus companies located in the United States. They confirmed that they\nhave exclusive source code related to the companies' software development. They are\noffering to sell it, and network access, for over $300,000 USD.\n\nAdvIntel subject matter experts assess with high confidence that Fxmsp is a credible\nhacking collective with a history of selling verifiable corporate breaches returning them\nprofit close to $1,000,000 USD. AdvIntel alerted law enforcement regarding these\nclaimed intrusions.\n\n**Background**\n\nFxmsp is a hacking collective that has operated in various top-tier Russian- and Englishspeaking underground communities since 2017. They are known for targeting corporate and\ngovernment networks worldwide.\n\n_Image 1: Fxmsp offered access to one compromised hotel chain on April 5, 2018._\n\n**Tactics, Techniques & Procedures (TTPs)**\n\nThroughout 2017 and 2018, Fxmsp established a network of trusted proxy resellers to\npromote their breaches on the criminal underground. Some of the known Fxmsp TTPs\nincluded accessing network environments via externally available remote desktop protocol\n(RDP) servers and exposed active directory.\n\n\n-----\n\nMost recently, the actor claimed to have developed a credential-stealing botnet capable of\ninfecting high-profile targets in order to exfiltrate sensitive usernames and passwords. Fxmsp\nhas claimed that developing this botnet and improving its capabilities for stealing information\nfrom secured systems is their main goal.\n\n_Image 2: AdvIntel research revealed sophisticated method of operation behind Fxmsp._\n\n**Fxmsp: Three Major Antivirus Company Breaches**\n\nOn April 24, 2019, Fxmsp claimed to have secured access to three leading antivirus\ncompanies. According to the hacking collective, they worked tirelessly for the first quarter of\n2019 to breach these companies and finally succeeded and obtained access to the\ncompanies’ internal networks.\n\n\n-----\n\nThe collective extracted sensitive source code from antivirus software, AI, and security\nplugins belonging to the three companies. Fxmsp also commented on the capabilities of the\ndifferent companies’ software and assessed their efficiency.\n\n_Image 3: Fxmsp revealed the stolen source code stored in the debug information._\n\nThe collective provided a list of specific indicators through which it is possible to identify the\ncompany even when a seller is not disclosing its name. Fxmsp offered screenshots of folders\npurported to contain 30 terabytes of data, which they allegedly extracted from these\n\n\n-----\n\nnetworks. The folders seem to contain information about the company s development\ndocumentation, artificial intelligence model, web security software, and antivirus software\nbase code.\n\n**Motivation Behind Antivirus Company Breaches**\n\nTargeting antivirus companies appears to have been the primary goal of Fxmps' latest\nnetwork intrusions. The actor claimed that antivirus breach research has been their main\nproject over the last six months, which directly correlates with the six-month period during\nwhich they were silent on the underground forums where they normally post. This period\nstarted with their seeming disappearance in October 2018 and concluded with their return in\nApril 2019.\n\n**Attribution Claims Behind Fxmsp Moniker**\n\nAccording to “ShadowRunTeam,” a high-profile Russian threat actor operating on Telegram,\nFxmsp is reportedly a Moscow resident with the first name \"Andrey\" who started to engage in\ncybercrime activities in mid-2000 and specialized in social engineering.\n\nOur subject matter experts assess with high confidence that Fxmsp is a credible hacking\ncollective that has a history of selling verifiable corporate breaches returning them profit\nclose to $1,000,000 USD. AdvIntel alerted US law enforcement regarding the purported\nintrusions.\n\n**Recommendations & Possible Mitigation**\n\nMonitoring and reviewing the network perimeter for any externally-exposed Remote\nDesktop Protocol (RDP) servers and Active Directory (AD) might reduce exposure to\nthe known two initial attack vectors.\n\nEmploying robust patching and security hygiene, as well as monitoring for\nspearphishing email messages might assist with identifying early warnings linked to the\nFxmsp's newer attack vector environment.\n\nSegregating and protecting sensitive source code development environments from\naccess to the main network might thwart attempts to exfiltrate intellectual property from\nthe network.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-09 - Top-Tier Russian Hacking Collective Claims Breaches of Three Major Anti-Virus Companies.pdf"
    ],
    "report_names": [
        "2019-05-09 - Top-Tier Russian Hacking Collective Claims Breaches of Three Major Anti-Virus Companies.pdf"
    ],
    "threat_actors": [
        {
            "id": "312b7781-5501-4c1e-a9d5-9b75e9ad8455",
            "created_at": "2022-10-25T16:07:24.488292Z",
            "updated_at": "2025-03-27T02:02:10.251188Z",
            "deleted_at": null,
            "main_name": "Fxmsp",
            "aliases": [
                "ATK 134",
                "TAG-CR17"
            ],
            "source_name": "ETDA:Fxmsp",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ab5dc2a3-16dc-421e-af45-d60c8b4aafac",
            "created_at": "2023-01-06T13:46:39.012588Z",
            "updated_at": "2025-03-27T02:00:02.977037Z",
            "deleted_at": null,
            "main_name": "Fxmsp",
            "aliases": [],
            "source_name": "MISPGALAXY:Fxmsp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536143,
    "ts_updated_at": 1743041409,
    "ts_creation_date": 1653707690,
    "ts_modification_date": 1653707690,
    "files": {
        "pdf": "https://archive.orkl.eu/89aba852a9cbc040e40cbe21301a60db92702d08.pdf",
        "text": "https://archive.orkl.eu/89aba852a9cbc040e40cbe21301a60db92702d08.txt",
        "img": "https://archive.orkl.eu/89aba852a9cbc040e40cbe21301a60db92702d08.jpg"
    }
}