{
    "id": "2e350be1-0448-4a99-bf70-00e85c1dfc67",
    "created_at": "2023-01-12T15:07:43.262955Z",
    "updated_at": "2025-03-27T02:17:27.572266Z",
    "deleted_at": null,
    "sha1_hash": "4197d8bbc5d70a90942d4056e289ed560d3bbf02",
    "title": "2016-10-04 - OilRig Malware Campaign Updates Toolset and Expands Targets",
    "authors": "",
    "file_creation_date": "2013-02-08T10:42:59Z",
    "file_modification_date": "2013-02-08T12:24:59Z",
    "file_size": 2677075,
    "plain_text": "### 2013 Cisco Annual Security Report\n\n\n-----\n\nCybercriminals are taking advantage of the rapidly expanding attack surface found\nin today’s “any-to-any” world, where individuals are using any device to access\nbusiness applications in a network environment that utilizes decentralized cloud\n\n## Living in today’s services. The Cisco® 2013 Annual Security Report highlights global threat trends\n\nbased on real-world data, and provides insight and analysis that helps businesses\nand governments improve their security posturing for the future. The report\ncombines expert research with security intelligence that was aggregated from\n\n## “any-to-any” world. across Cisco, focusing on data collected during the 2012 calendar year.\n\n\n-----\n\n###### The Nexus of Devices, Clouds, and Applications 6\n\n Endpoint Proliferation 12\n\n Services Reside in Many Clouds 18\n\n# Contents\n\n###### Blending of Business and Personal Use 22\n\nMillennials and the Workplace\n\n###### Big Data 28\n\nA Big Deal for Today’s Enterprises\n\n###### State of the Exploit 32\n\nDanger Lurks in Surprising Places\n\n###### Evolutionary Threats 50\n\nNew Methods, Same Exploits\n\n###### Spam the Ever Present 58\n\n Security Outlook 2013 70\n\n About Cisco Security Intelligence Operations 74\n\n\n-----\n\n##### The any-to-any world and the\n Internet of Everything is an evolution in connectivity and collaboration that is unfolding rapidly. It’s the nexus of devices, clouds, and applications.\n\n# The Nexus\n\nWhile this evolution is not unexpected, toward the formation of the “Internet\ntoday’s enterprises may be unprepared of Everything.” This is the intelligent\nfor the reality of navigating an “any- connection of:\nto-any” world—at least, from a security\n\n                                                                                                                       - People: Social networks, population\n\n# of Devices, perspective.\n\ncenters, digital entities\n\n“The crux of the any-to-any issue is                                                         - Processes: Systems, business\n\nthis: We’re quickly reaching the point processes\nwhere it is increasingly less likely that\n\n                                                                                                                       - Data: World Wide Web, information\n\n# Clouds, and a user is going to access a business\n\nthrough an enterprise network,” says                                                        - Things: Physical world, devices\nChris Young, Senior Vice President of and objects\nthe Security and Government Group at\nCisco. “More and more, it’s about any\n\n# Applications device in any location coming over any “More and more, it’s about any\n\ninstantiation of the network. Internet- device in any location coming\nenabled devices—smartphones, tablets, over any instantiation of the\nand more—are trying to connect to network. Internet-enabled\napplications that could be running devices—smartphones, tablets,\nanywhere, including in a public and more—are trying to connect\nsoftware-as-a-service (SaaS) cloud, to applications that could be\nin a private cloud, or in a hybrid cloud.” running anywhere.”\n\nChris Young, Senior Vice President of the\n\nAt the same time, another evolution Security and Government Group at Cisco\nis under way—a steady movement\n\n\n-----\n\nThe Internet of Everything is a\nfuture state, to be sure, but is not\nso distant when the any-to-any\nissue is considered. And while it,\ntoo, will create security challenges\nfor enterprises, it will bring new\nopportunities as well. “Amazing things\nwill happen and be created as the\n\n\nInternet of Everything grows,” says component is cloud data. By 2016,\n\n###### “The growth and convergence Nancy Cam-Winget, distinguished global cloud traffic will make up nearly Another complicating factor in\n of people, processes, data, and engineer, Cisco. “The growth and two-thirds of total data center traffic. the any-to-any equation is young, things on the Internet will make convergence of people, processes, mobile workers. This group networked connections more data, and things on the Internet will Piecemeal security solutions, such believes they should be able relevant and valuable than\n make networked connections more as applying firewalls to a changeable to do business wherever they ever before.” relevant and valuable than ever before. network edge, don’t secure data that happen to be and on whatever\n\nNancy Cam-Winget, Distinguished Ultimately, the Internet of Everything is now constantly in motion among devices they have at hand.\nEngineer, Cisco will create new capabilities, richer devices, networks, and clouds. Even\n\nexperiences, and unprecedented among data centers—which now\neconomic opportunities for countries, house organizations’ “crown jewels” the changing attitudes that college\n\nThe Internet of Everything builds on businesses, and individuals.” (big data)—virtualization is becoming students and young professionals\n\nmore the rule than the exception.\n\nan “Internet of Things”[1] foundation around the globe have toward work,\n\nAddressing security challenges\n\nby adding network intelligence that How the Cloud technology, and security.\n\npresented by virtualization and the\n\nallows convergence, orchestration, Complicates Security\nand visibility across previously The challenge of securing a wide cloud requires rethinking security The latest study shines even more\ndisparate systems. Connections in range of applications, devices, and postures to reflect this new paradigm— light on these workers’ attitudes\nthe Internet of Everything aren’t just users—whether in an “any-to-any” or perimeter-based controls and old toward security, with a special focus\nabout mobile devices or laptops and Internet of Everything context—is made models of access and containment on privacy and how much or how\ndesktops, but also the rapidly growing tougher by the popularity of the cloud need to be changed to secure the new often a company can intrude on an\nnumber of machine-to-machine (M2M) as a means of managing enterprise business model. employee’s desire to freely roam the\nconnections coming online each day. systems. According to data compiled Internet while at work. The 2012 Cisco\nThese “things” are often objects we by Cisco, global data center traffic is Connected Workers _Connected World Technology Report_\ntake for granted or rely on each day, expected to quadruple over the next and Data Privacy study also examines whether online\nand don’t traditionally think of as being five years, and the fastest-growing Another complicating factor in privacy is still something that all users\nconnected—such as a home heating the any-to-any equation is young, actively worry about.\nsystem, a wind turbine, or a car. mobile workers. This group believes\n\nthey should be able to do business Data Analysis and\n\nThe Internet of Everything is a Global data center traffic is wherever they happen to be and on Global Security Trends\nfuture state, to be sure, but is not expected to quadruple over the whatever devices they have at hand. The 2013 Cisco Annual Security\nso distant when the any-to-any next five years, and the fastest- Featured in this year’s 2013 Cisco _Report includes in-depth analysis of_\nissue is considered. And while it, growing component is cloud _Annual Security Report are findings_ web malware and spam trends, based\ntoo, will create security challenges data. By 2016, global cloud traffic from the 2012 Cisco Connected World on research conducted by Cisco.\nfor enterprises, it will bring new will make up nearly two-thirds of _Technology Report which build on_ While many who operate in the\nopportunities as well. “Amazing things total data center traffic. research conducted in 2011 about\nwill happen and be created as the\n\n\n-----\n\n###### “We are seeing some disturbing changes in the threat environment\n facing governments, companies, and societies.”\n\nJohn N. Stewart, Senior Vice President and Chief Security Officer at Cisco\n\n“shadow economy” have centered their and recover from a disruptive cyber\n\nefforts in recent years on developing event—whether that event takes the\nincreasingly sophisticated techniques, form of a DDoS attack directed at the\nCisco’s research makes clear that company; a critical, Internet-enabled\ncybercriminals are often turning to manufacturing facility suddenly going\nwell-known and basic methods to offline; an advanced multistage attack\ncompromise users. by the criminal underground; or\n\nsomething else never before seen.\n\nThe rise in distributed denial of\nservice (DDoS) attacks over the past “While the IT security discussion has\nyear is just one example of the trend suffered more than its fair share\ntoward “what’s old is new again” in of alarmism over the years, we are\ncybercrime. For several years, DDoS seeing some disturbing changes\nattacks—which can paralyze Internet in the threat environment facing\nservice providers (ISPs) and disrupt governments, companies, and\ntraffic to and from targeted websites— societies,” says John N. Stewart,\nhave been low on the list of IT security Senior Vice President and Chief\npriorities for many enterprises. Security Officer at Cisco. “Cybercrime\nHowever, recent campaigns against is no longer an annoyance or another\na number of high-profile companies— cost of doing business. We are\nincluding U.S. financial institutions[2] approaching a tipping point where\n—serve as a reminder that any the economic losses generated\ncybersecurity threat has the potential by cybercrime are threatening to\nto create significant disruption, overwhelm the economic benefits\nand even irreparable damage, if created by information technology.\nan organization is not prepared for Clearly, we need new thinking and\nit. Therefore, when creating their approaches to reducing the damage\nbusiness continuity management that cybercrime inflicts on the well-\nplans, enterprises would be wise to being of the world.”\nconsider how they would respond to\n\n\n-----\n\n##### The “any-to-any” evolution already\n involves billions of Internet-connected devices; in 2012, the number of these devices globally grew to more than 9 billion.3\n\n# Endpoint\n\nConsidering that less than 1 percent near future, it will simply increase the\nof things in the physical world are number of things on the Internet by\nconnected today, there remains one. Now, think about the numerous\nvast potential to “connect the other elements to which your car could\n\n# Proliferation unconnected.”[4] It is projected that\n be connected—other cars, stoplights,\n\nwith an Internet that already has your home, service personnel, weather\nan estimated 50 billion “things” reports, warning signs, and even the\nconnected to it, the number of road itself.”[6]\nconnections will increase to\n13,311,666,640,184,600 by the\nyear 2020. Adding just one more “When your car becomes\nInternet-connected “thing” (50 billion\n\n###### connected to the Internet of\n\n+ 1) will increase the number of\n\n###### Everything in the near future, it\n\nconnections by another 50 billion.[5]\n\n###### will simply increase the number of things on the Internet by one.\n\nAs for the “things” that will eventually\n\n###### Now, think about the numerous\n\ncomprise the “everything,” they will\nrange from smartphones to home other elements to which your car\nheating systems to wind turbines could be connected—other cars,\nto cars. Dave Evans, Cisco’s Chief stoplights, your home, service\nFuturist with the Internet Business personnel, weather reports,\nSolutions Group, explains the concept warning signs, and even the\nof endpoint proliferation like this: road itself.”\n“When your car becomes connected David Evans, Chief Futurist, Cisco\n\nto the Internet of Everything in the\n\n\n-----\n\nIn the Internet of Everything,\n\nFigure 1: The Internet of Everything connections are what matter most. “The Internet of Everything is\nThe Internet of Everything is the intelligent connection of people, processes, data, The types of connections, not the quickly taking shape, so the\nand things.\n\nnumber, are what create value security professional needs to\nbetween people, processes, data, and think about how to shift their\nthings. And eventually, the number focus from simply securing\nof connections will dwarf the number endpoints and the network\n\n###### People to\n\nof things.[7] The explosion of new perimeter.”\n\n###### People to People (P2P)\n\nconnections already becoming part\n\n###### Machine (P2M) Chris Young, Senior Vice President of the\n\nof the Internet of Everything is driven Security and Government Group at Cisco\nprimarily by the development of more\n\n###### People and more IP-enabled devices, but also\n\nby the increase in global broadband\n\n“The Internet of Everything is quickly\n\n###### Home Mobile availability and the advent of IPv6. The\n\ntaking shape, so the security\n\nsecurity risks posed by the Internet of\n\n###### Process Everything are not just related to the professional needs to think about\n\nhow to shift their focus from simply\n\nany-to-any endpoint proliferation that\n\n###### Things Data is bringing us closer, day by day, to an securing endpoints and the network\n\nperimeter,” says Chris Young. “There\n\neven more highly connected world,\n\nwill be too many devices, too many\n\nbut also the opportunity for malicious\n\n###### Business actors to utilize even more inroads connections, and too many content\n\ntypes and applications—and the\n\nto compromise users, networks, and\n\nnumber will only keep growing. In this\n\ndata. The new connections themselves\n\n###### Machine to create risk because they will generate new landscape, the network itself Machine (M2M) even more data in motion that needs becomes part of the security paradigm\n\nthat allows enterprises to extend\n\nto be protected in real time—including\n\npolicy and control over different\n\nthe ballooning volumes of big data that\n\nenvironments.”\n\nenterprises will continue to collect,\nstore, and analyze.\n\n###### In the Internet of Everything, connections are what matter most.\n The types of connections, not the number, are what create value between people, processes, data, and things.\n\n\n-----\n\n###### Cisco BYOD Update\n\nFigure 2: Cisco Mobile Device Deployment\n\nEndpoint proliferation is a phenomenon Cisco knows well within its own organization of\n70,000 employees worldwide. Since formalizing its bring-your-own-device (BYOD) practice DEC DEC DEC\ntwo years ago, the company has witnessed a 79 percent growth rate in the number of 2010 2011 2012\nmobile devices in use in the organization.\n\n###### PLATFORM\n\nThe Cisco 2011 Annual Security Report [8] first examined Cisco’s unfolding BYOD journey,\nwhich is part of the organization’s ongoing and broader transition toward becoming a “virtual iPhone\nenterprise.” By the time Cisco reaches the last stage of its planned journey, which will take\nseveral years, the company will be increasingly location- and service-independent—and iPad\nenterprise data still will be secure.[9]\n\nBlackBerry\n\nIn 2012, Cisco added about 11,000 smartphones and tablet computers companywide—or\nabout 1,000 new Internet-enabled devices per month. “At the end of 2012, there were nearly Android\n60,000 smartphones and tablets in use in the organization—including just under 14,000 Other\niPads—and all of them were Bring Your Own (BYO),” says Brett Belding, Senior Manager\noverseeing Cisco IT Mobility Services. “Mobile at Cisco is now BYO, period.”\n\n###### TOTAL\n\nThe device type that’s seen the biggest increase in use at Cisco is the Apple iPad.\n“It’s fascinating to think that three years ago, this product didn’t even exist,” says Belding.\n“Now, there are more than 14,000 iPads being used at Cisco every day by our employees\n\nfor a variety of activities—both personal- and work-related. And employees are using\niPads in addition to their smartphones.”\n\nAs for smartphones, the number of Apple iPhones in use at Cisco has almost tripled in two controls. For example, users who want to check their email and calendar on their device\nyears’ time to nearly 28,600. RIM BlackBerry, Google Android, and Microsoft Windows are required to take Cisco’s security profile that enforces remote wipe, encryption and\ndevices are also included in the BYOD program at Cisco. Employees make the choice to passphrase.\ntrade having access to corporate data on their personal device with agreement on security\n\nSocial support has been a key component of the BYOD program at Cisco from the start.\n“We rely heavily on [the enterprise collaboration platform] WebEx Social as our BYOD support\n\nplatform, and it’s paid huge dividends,” says Belding. “We have more devices supported\nthan ever before and, at the same time, we’ve had the fewest number of support cases.\nOur goal is that someday an employee can simply bring in any device and self-provision\n\n###### “We have more devices supported than ever before and, at the\n using the Cisco Identity Services Engine (ISE) and set up our core WebEx collaboration\n\n same time, we’ve had the fewest number of support cases. Our goal tools, including Meeting Center, Jabber, and WebEx Social.” is that someday an employee can simply bring in any device and\n The next step for BYOD at Cisco, according to Belding, is to further improve security by self-provision using the Cisco Identity Services Engine (ISE) and set increasing visibility and control over all user activity and devices, on both the physical up our core WebEx collaboration tools, including Meeting Center, network and virtual infrastructure, while improving the user experience. “Caring about the Jabber, and WebEx Social.” user experience is a core consumerization of IT trend,” says Belding. “We’re trying to apply\n\nthis concept to our organization. We have to. I think what we’re seeing now is an ‘IT-ization’\n\nBrett Belding, Senior Manager Overseeing Cisco IT Mobility Services of users. We’re beyond the point of them asking, ‘Can I use this device at work?’ Now\n\nthey’re saying, ‘I understand you need to keep the enterprise secure, but don’t interfere\nwith my user experience.’”\n\n\n-----\n\n##### Global data center traffic is on the rise. According to the Cisco Global Cloud Index, global data center traffic is expected to quadruple over the next five years and will grow\n\n# Services\n\n##### at a compound annual growth rate (CAGR) of 31 percent between 2011 and 2016.10\n\n# Reside in\n\nOf this tremendous growth, the tools such as firewalls and antivirus\nfastest-growing component is cloud software be applied when the network\ndata. Global cloud traffic will increase edge cannot be defined?\n\n# Many Clouds sixfold over the next five years,\n\ngrowing at a rate of 44 percent from No matter how many security\n2011 to 2016. In fact, global cloud questions are raised, it’s clear more\ntraffic will make up nearly two-thirds and more enterprises are embracing\nof total data center traffic by 2016.[11] the benefits of clouds—and those\n\nThis explosion in cloud traffic\nraises questions about the ability of\n\n###### Global cloud traffic will increase\n\nenterprises to manage this information.\n\n###### sixfold over the next five years,\n\nIn the cloud, the lines of control are\n\n###### growing at a rate of 44 percent\n\nblurred: Can an organization place\n\n###### from 2011 to 2016.\n\nsafety nets around its cloud data when\nthey don’t own and operate the data\ncenter? How can even basic security\n\n\n-----\n\nthat have are not likely to return to a Lowered cost of entry “Virtualization and cloud computing\nthe private data center model. While Virtualization has lowered the cost of create problems just like those of “Virtualization and cloud\nthe opportunities of the cloud for entry to provide services like a virtual BYOD, but turned on their head,” computing create problems\norganizations are many—including private server (VPS). Compared to says Joe Epstein, former Chief just like those of BYOD, but\ncost savings, greater workforce older hardware-based data center Executive Officer of Virtuata, a turned on their head... High-value\ncollaboration, productivity, and a models, we are seeing growth in company acquired by Cisco in 2012 applications and high-value\nreduced carbon footprint—the possible quick, cheap, and easily available that provides innovative capabilities data are now moving around\nsecurity risks that enterprises face as infrastructure for criminal activities. for securing virtual machine-level the data center.”\na result of moving business data and For instance, there are many VPS information in data centers and\n\nJoe Epstein, Former Chief Executive\n\nprocesses to the cloud include: services available for instant sale cloud environments. “High-value Officer of Virtuata\n\n(with the ability to purchase using applications and high-value data are\n\n###### Hypervisors Bitcoin or other hard-to-trace payment now moving around the data center.\nIf compromised, this software that types) that are targeted to the criminal And the notion of virtual workloads\n\nThe answer to these growing cloud\n\ncreates and runs virtual machines underground. Virtualization has made makes enterprises uncomfortable.\n\nand virtualization challenges is\n\ncould lead to mass hacking or infrastructure much cheaper and In the virtual environment, how do\n\nadaptive and responsive security.\n\ndata compromise against multiple easier to provide—with little to no you know you can trust what you’re\n\nIn this case, security must be a\n\nservers—applying the same ease policing of activities. running? The answer is that you\n\nprogrammable element seamlessly\n\nof management and access that haven’t been able to so far—and that\n\nintegrated into the underlying data\n\nvirtualization provides to a successful “Decoupling” of virtualized uncertainty has been a key barrier to\n\ncenter fabric, according to Epstein. In\n\nhack. A rogue hypervisor (taken applications cloud adoption.”\n\naddition, security needs to be built in\n\ncontrol of by “hyperjacking”) can take Because virtualized applications are\n\nat the design phase, instead of being\n\ncomplete control of a server.[12] decoupled from the physical resources But Epstein notes that it is becoming\n\nbolted on post-implementation.\n\nthey use, it becomes more difficult increasingly difficult for enterprises\nfor enterprises to apply traditional to ignore virtualization and the\nsecurity approaches. IT providers cloud. “The world is going to share\n\n###### A rogue hypervisor (taken control seek to minimize cost with a very everything,” he says. “Everything\n of by “hyperjacking”) can take elastic offering in which they can move will be virtualized; everything will complete control of a server. resources as needed—contrasted with be shared. It will not make sense to\n\nthe security group seeking to collocate continue running only private data\nservices of like security posture and centers; hybrid clouds are where IT\nkeep them apart from others that may is heading.”\nbe less secure.\n\n\n-----\n\n##### Modern workers—particularly young “Millennials”—want the freedom to\n browse the web not only when and how they want to, but also with the devices they choose. However, they\n\n# Blending of\n\n##### don’t want these freedoms impinged upon by their employers, a situation that can spell tension for security\n\n# Business and\n\n##### professionals.\n\nAccording to the 2012 Cisco latest Connected World study also\n\n# Personal Use Connected World Technology Report show that Millennials have strong\n\nstudy, two-thirds of respondents feelings about employers tracking the\nbelieve employers should not track online activity of workers—even those\nemployees’ online activities on who report they work at organizations\ncompany-issued devices. In short, where such tracking does not occur.\n\n#### Millennials and\n\nthey do not think employers have any\nbusiness monitoring such behavior.\nOnly about one-third (34 percent) of\n\n###### Only one in five respondents\n\n#### the Workplace workers surveyed say they don’t mind\n\n###### say their employers do track\n\nif employers track their online behavior.\n\n###### their online activities on\n\nOnly one in five respondents say company-owned devices,\ntheir employers do track their online while 46 percent say their\nactivities on company-owned devices, employers do not track activity.\nwhile 46 percent say their employers\ndo not track activity. Findings for the\n\n\n-----\n\nCompounding the challenges for Privacy and Millennials information secure, while 17 percent\nsecurity professionals, there appears say they trust most websites to keep “Millennials are now\n\nAccording to the 2012 Cisco\n\nto be a disconnect between what their information private. However, entering the workplace\n\n_Connected World Technology Report,_\n\nemployees think they can do with 29 percent say that not only do and bringing with them\n\nMillennials have accepted the fact that,\n\ntheir company-issued devices and they not trust websites to keep their new working practices and\n\nthanks to the Internet, personal privacy\n\nwhat policies IT actually dictates information private, they also are very attitudes to information and\n\nmay be a thing of the past. Ninety-one\n\nabout personal usage. Four out of 10 percent of young consumers surveyed concerned about security and identity the associated security\nrespondents say they are supposed say that the age of privacy is over and theft. Compare this to the idea of thereof. They believe in the\nto use company-issued devices for believe they can’t control the privacy sharing data with an employer who demise of privacy—that it’s\nwork activity only, while a quarter of their information, with one-third of has the context about who they are simply defunct in practice,\nsay they are allowed to use company respondents reporting they are not and what they do. and it’s in this paradigm\ndevices for non work activity. However, worried about the data that is stored that organizations must\n90 percent of IT professionals “Millennials are now entering the\n\nand captured about them. operate—a concept that will\n\nsurveyed say they do indeed have workplace and bringing with them\n\n###### be alarming to the older\n\npolicies that prohibit company-issued In general, Millennials also believe new working practices and attitudes generation in the workplace.”\ndevices being used for personal their online identity is different from to information and the associated\nonline activity—although 38 percent their offline identity. Forty-five percent security thereof. They believe in the Adam Philpott, Director, EMEAR Security Sales, Cisco\nacknowledge that employees break say these identities are often different demise of privacy—that it’s simply\npolicy and use devices for personal depending on the activity in question, defunct in practice, and it’s in this\nactivities in addition to doing work. while 36 percent believe these paradigm that organizations must\n(You can find information about Cisco’s identities are completely different. operate—a concept that will be\napproach to these BYOD challenges Only 8 percent believe these identities alarming to the older generation in\non page 16.) are the same. the workplace,” says Adam Philpott,\n\nDirector, EMEAR Security Sales, Cisco.\n\nYoung consumers also have high “Organizations can, however, look to\nexpectations that websites will keep provide information security education\n\n###### There appears to be a their information private, often feeling to their employees to alert them to the disconnect between what more comfortable sharing data with risks and provide guidance on how employees think they can do large social media or community sites best to share information and leverage\n\ngiven the cloak of anonymity the crowd online tools within the realms of\n\n###### with their company-issued\n\nprovides. Forty-six percent say they data security.”\n\n###### devices and what policies\n\nexpect certain websites to keep their\n\n###### IT actually dictates about personal usage.\n\n\n-----\n\n###### Why Enterprises Need to Raise Awareness\n of Social Media Disinformation\n\n**by Jean Gordon Kocienda**\nGlobal Threat Analyst, Cisco\n\nSocial media has been a boon for many enterprises; the ability to connect directly with\ncustomers and other audiences via Twitter and Facebook has helped many organizations\nbuild brand awareness via online social interaction.\n\nThe flip side of this lightning-fast direct communication is that social media can allow\ninaccurate or misleading information to spread like wildfire. It isn’t hard to imagine a\nscenario in which a terrorist coordinates on-the-ground attacks by using misleading\ntweets with the intent to clog roads or phone lines, or to send people into the path of\ndanger. One example: India’s government blocked hundreds of websites and curbed\ntexts[13] this summer in an attempt to restore calm in north-eastern part of the country\nafter photographs and text messages were posted. The rumors prompted thousands\nof panicked migrant workers to flood train and bus stations.\n\nSimilar social media disinformation campaigns have affected market prices as well. A\nhijacked Reuters Twitter feed reported that the Free Syrian Army had collapsed in Aleppo.\nA few days later, a Twitter feed was compromised, and a purported top Russian diplomat\ntweeted that Syrian President Bashar Al-Assad was dead. Before these accounts could\nbe discredited, oil prices on international markets spiked.[14]\n\nSecurity professionals need to be alert to such fast-moving and potentially damaging\nsocial media posts, especially if they are directed at the enterprise itself—and quick\naction is needed to defend networks from malware, alert employees to a bogus phishing\nattempt, re-route a shipment, or advise employees regarding safety. The last thing\nsecurity executives want to do is alert managers to a breaking story that turns out to\nbe a hoax.\n\nThe first safeguard against falling for fabricated stories is to confirm the story across\nmultiple sources. At one time, journalists did this job for us, so that by the time we read\nor heard the news, it was vetted. These days, many journalists are getting their stories\nfrom the same Twitter feeds that we are, and if several of us fall for the same story, For fast-breaking news requiring quick action, your best bet may be to\nwe can easily mistake re-tweets for story confirmation.\n\n###### use the old-fashioned “sniff test.” If the story seems far-fetched, think\n\nFor fast-breaking news requiring quick action, your best bet may be to use the twice before repeating or citing it.\nold-fashioned “sniff test.” If the story seems far-fetched, think twice before repeating\nor citing it.[15]\n\n\n-----\n\n##### The business world is abuzz about “big data”—and the potential for\n analytics “gold” that can be mined from the vast volumes of information that enterprises generate, collect,\n\n# Big Data\n\n##### and store.\n\nThe 2012 Cisco Connected World for businesses. But there are security\n_Technology Report examined the_ concerns about big data. The 2012\n\n#### A Big Deal for\n\nimpact of the big-data trend on _Connected World study’s findings_\nenterprises—and more specifically, show that a third of respondents\ntheir IT teams. According to the (32 percent) believe big data\n\n#### Today’s Enterprises study’s findings, about three-quarters complicates security requirements\n\n(74 percent) of organizations globally and protection of data and networks\nare already collecting and storing because there is so much data and too\ndata, and management is using many ways of accessing it. In short,\nanalysis of big data to make business big data increases the vectors and\ndecisions. Additionally, seven in 10 angles that enterprise security teams—\nIT respondents reported that big and security solutions—must cover.\ndata will be a strategic priority for\ntheir company and IT team in the\nyear ahead.\n\n###### About 74 percent of organizations\n\nAs mobility, cloud, virtualization, globally are already collecting and\nendpoint proliferation, and other storing data, and management\nnetworking trends evolve or emerge, is using analysis of big data to\nthey will pave the way for even more make business decisions.\nbig data and analytics opportunities\n\n\n-----\n\nsolutions, lack of IT staff, and lack data could truly take off. As a result,\n\n###### Korea, Germany, the United of IT expertise. The fact that almost in some cases, the study indicates There are some countries where States, and Mexico had the one in four respondents globally\n cloud adoption will impact the rate of big-data discussions are resulting highest percentages of IT (23 percent) said lack of expertise adoption—and benefits—of big-data in meaningful decisions on respondents who believe big and personnel was an inhibitor to their efforts. strategy, direction, and solutions. data complicates security. enterprise’s ability to use big data China, Mexico, India, and\n\neffectively indicates a need for more More than half of overall IT Argentina lead in this regard, with\nprofessionals entering the job market respondents also confirmed that well over half of the respondents\n\nKorea (45 percent), Germany to be trained in this area. big-data discussions within their from these countries claiming\n(42 percent), the United States companies are not fruitful yet. That that big-data discussions in\n\nThe cloud is a factor in big data is not surprising considering the\n\n(40 percent), and Mexico (40 percent) their organizations are well under\n\nsuccess, as well, according to 50 market is just now trying to understand\n\nhad the highest percentages of way—and leading to solid actions\n\npercent of IT respondents to the 2012 how to harness their big data,\n\nIT respondents who believe big and results.\n\n_Connected World study. They believe_ analyze it, and use it strategically.\n\ndata complicates security. To help\n\ntheir organizations need to work In some countries, however, big-data\n\nensure security, the majority of IT\n\nthrough cloud plans and deployments discussions are resulting in meaningful\n\nrespondents—more than two-thirds\n\nto make big data a worthwhile venture. decisions on strategy, direction, and\n\n(68 percent)—believe the entire IT\n\nThis sentiment was prominent in China solutions. China (82 percent), Mexico\n\nteam should participate in strategizing\n\n(78 percent) and India (76 percent), (67 percent), India (63 percent), and\n\nand leading big data efforts within\n\nwhere more than three out of four Argentina (57 percent) lead in this\n\ntheir companies. Gavin Reid, Director\n\nrespondents believed there was a regard, with well over half of the\n\nof Threat Research for Cisco Security\n\ndependency on cloud before big respondents from these countries\n\nIntelligence Operations, says “Big data\n\nclaiming that big-data discussions\n\ndoesn’t complicate security—it makes it\n\nin their organizations are well under\n\npossible. At Cisco we collect and store\n2.6 trillion records every day—that As for solutions that are designed way—and leading to solid actions\nforms the platform from which we can to help enterprises both better and results.\nstart incident detection and control.” manage and unlock the value of\n\nThree out of five IT respondents to the\n\n###### their big data, there are barriers\n\n_2012 Connected World Report believe_\n\nAs for solutions designed to help to adoption. Respondents pointed\n\nbig data can help countries and their\n\nenterprises both better manage and to lack of budget, lack of time to\n\neconomies become more competitive\n\nunlock the value of their big data, there study big data, lack of appropriate\n\nin the global marketplace.\n\nare barriers to adoption. Respondents solutions, lack of IT staff, and lack\npointed to lack of budget, lack of time of IT expertise.\nto study big data, lack of appropriate\n\n\n-----\n\n##### Many security professionals—and certainly a large community of online users—hold preconceived ideas about where people are most likely to stumble across dangerous\n\n# State of\n\n##### web malware.\n\nThe general belief is that sites that are often hidden in plain sight through\npromote criminal activity—such as exploit-laden online ads that are\n\n# the Exploit sites selling illegal pharmaceuticals distributed to legitimate websites, or\n\nor counterfeit luxury goods—are most hackers targeting the user community\nlikely to host malware. Our data reveals on the common sites they use most.\nthe truth of this outdated notion, as\nweb malware encounters are typically In addition, malware-infected\n\n#### Danger Lurks in\n\nnot the by-product of “bad” sites in websites are prevalent across many\ntoday’s threat landscape. countries and regions—not just in\n\none or two countries, dispelling the\n\n#### Surprising Places “Web malware encounters occur notion that some countries’ websites\n\neverywhere people visit on the are more likely to host malicious\nInternet—including the most legitimate content than others. “The web is the\nof websites that they visit frequently, most formidable malware delivery\neven for business purposes,” says mechanism we’ve seen to date,\nMary Landesman, Senior Security outpacing even the most prolific\nResearcher with Cisco. “Indeed,\nbusiness and industry sites are one\nof the top three categories visited\nwhen a malware encounter occurred. Dangers are often hidden in\nOf course, this isn’t the result of plain sight through exploit-laden\nbusiness sites that are designed to online ads.\nbe malicious.” The dangers, however,\n\n\n-----\n\nworm or virus in its ability to reach— encounters, fell dramatically to\n\nFigure 3: Risk by Company Size and infect—a mass audience silently sixth position in 2012. Denmark and\nUp to 2.5 times more risk of encountering web malware for large organizations.\n\nand effectively,” says Landesman. Sweden now hold the third and fourth\n“Enterprises need protection, even if spots, respectively. The United States\n\nthey block common ‘bad’ sites, with retains the top ranking in 2012, as it\nadditional granularity in inspection did in 2011, with 33 percent of all web\n\nNumber of Employees\n\nand analysis.” malware encounters occurring via\n\nwebsites hosted in the United States.\n\n###### 250 or less Malware Encounters\n\nChanges in geographical location\n\n###### by Company Size\n\nbetween 2011 and 2012 likely reflect\n\n###### 251–500 The largest enterprises (25,000+\n\nboth changes in detection and user\n\nemployees) have more than 2.5\n\nhabits. For example, “malvertising,”\n\n###### 501–1000 times the risk of encountering web or malware delivered via online ads,\n\nmalware than smaller companies.\n\nplayed a more significant role in\n\nThis increased risk may be a reflection\n\n###### 1001–2500 web malware encounters in 2012\n\nthat larger companies possess more\n\nthan in 2011. It is worth repeating\n\nhigh-value intellectual property and\n\nthat web malware encounters most\n\n###### 2501–5000 thus are more frequently targeted.\n\nfrequently occur via normal browsing\nof legitimate websites that may have\n\n###### 5001–10,000 While smaller companies have fewer been compromised or are unwittingly\n\nweb malware encounters per user, it’s\n\nserving malicious advertising.\n\nimportant to note that all companies—\n\n###### 10,001–25,000 Malicious advertising can impact any\n\nregardless of size—face significant\n\nwebsite, regardless of the site’s origin.\n\nrisk of web malware encounters.\n\n###### Above 25,000 Every organization should focus on\n\nOverall, the geographical data for\n\nthe fundamentals of securing its\n\n2012 demonstrates that the web is an\n\nnetwork and intellectual property.\n\nequal-opportunity infector—contrary to\nthe perceptions that only one or two\n\n###### All companies—regardless of size—face significant risk of web malware Malware Encounters\n countries are responsible for hosting encounters. Every organization should focus on the fundamentals of by Country web malware or that any one country\n\nis safer than another. Just as the\n\n###### securing its network and intellectual property. Cisco’s research shows significant\n\ndynamic content delivery of Web 2.0\n\nchange in the global landscape for\n\nenables the monetization of websites\n\nweb malware encounters by country\n\nacross the globe, it can also facilitate\n\nin 2012. China, which was second\n\nthe global delivery of web malware.\n\non the list in 2011 for web malware\n\n\n-----\n\n|1 33.14% United States|United Kingdom 4 3 1.95% 7 10 Ireland 9 5 2 9.79% Russia 2.27% 8 Netherlands 6 6.11% Germany 5.65% China 2.63% Turkey Overall, the geographical data for 2012 demonstrates that the web is|\n|---|---|\n\n\nFigure 4: Web Malware Encounters by Country\nOne-third of all web malware encounters resulted from domains hosted in the United States.\n\nGAIN FROM 2011 DECLINE FROM 2011 9.55% 9.27%\n\n###### 4.07% Denmark Sweden\n United Kingdom\n 4\n\n**7** **3**\n\n###### 1.95% 10\n\n**9**\n\n###### Ireland 5 1 2 9.79%\n Russia\n 2.27% 8\n Netherlands 6\n\n 6.11%\n Germany\n 5.65%\n China\n\n 2.63% Turkey\n\n 33.14%\n United States\n\n Overall, the geographical data for 2012 demonstrates that the web is an equal-opportunity infector—contrary to the perceptions that only one or two countries are responsible for hosting web malware or that any one country is safer than another.\n\n\n-----\n\nAndroid malware grew substantially\nfaster than any other form of webdelivered malware, an important trend\ngiven that Android is reported to hold\nthe majority of mobile device market\nshare worldwide. It is important to\nnote that mobile malware encounters\ncomprised only 0.5 percent of all web\nmalware encounters in 2012, with\nAndroid taking over 95 percent of all\nthese web malware encounters. In\naddition 2012 saw the emergence of\n\n\nLooking at the wider landscape for\nweb malware, it is not surprising that\nmalicious scripts and iFrames\ncomprised 83 percent of encounters\nin 2012. While this is relatively\nconsistent with previous years,\nit’s a finding worthy of reflection\n\n\nOf course, there is a distinct the first documented Android botnet\n\nFigure 5: Top Web Malware Types difference between where a web in the wild, indicating that mobile\nAndroid malware encounters grew 2577 percent over 2012, though mobile malware only\n\nmalware encounter occurs and malware developments in 2013\n\nmakes up a small percentage of total web malware encounters.\n\nwhere the malware is actually hosted. bear watching.\nIn malvertising, for example, the\nencounter typically occurs when While some experts are claiming\nvisiting a reputable, legitimate website Android is the “biggest threat”\nthat happens to carry third-party or should be a primary focus for\n\nExploit 9.8% advertising. However, the actual enterprise security teams in 2013—\n\nmalware intended for delivery is the actual data shows otherwise. As\nhosted on a completely different noted above, mobile web malware\ndomain. Since Cisco’s data is based on in general makes up less than 1\n\nInfostealing 3.4% where the encounter occurred, it has percent of total encounters—far from\n\nno bearing on actual malware origin. the “doomsday” scenario many are\nFor instance, increased popularity of detailing. The impact of BYOD and\n\nDownloader 1.1% social media and entertainment sites the proliferation of devices cannot\n\nMalscript/iframe **83.4%** in Denmark and Sweden, coupled with be overstated, but organizations\n\nmalvertising risks, is largely responsible should be more concerned with\n\nWorm 0.89% for increased encounters from sites threats such as accidental data loss,\n\nhosted in those regions but is not ensuring employees do not “root”\n\nVirus 0.48% indicative of actual malware origin. or “jailbreak” their devices, and only\n\ninstall applications from official and\n\nMobile 0.42%\n\n###### Top Web Malware\n trusted distribution channels. If users\n\nScareware 0.16% choose to go outside official mobile\n\n###### Types in 2012\n\nRansomware 0.058% app stores, they should ensure, before\n\nAndroid malware grew substantially\n\nMalware/Hack Kit 0.057% downloading an app, that they know\n\nfaster than any other form of web-\n\nand trust the app’s author and can\n\ndelivered malware, an important trend\n\nAndroid Growth validate that the code has not been\n\ngiven that Android is reported to hold\n\ntampered with.\n\nthe majority of mobile device market\nshare worldwide. It is important to Looking at the wider landscape for\nnote that mobile malware encounters web malware, it is not surprising that\ncomprised only 0.5 percent of all web malicious scripts and iFrames\n\nAndroid Growth: 2577% malware encounters in 2012, with comprised 83 percent of encounters\n\nJAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC Android taking over 95 percent of all in 2012. While this is relatively\n\nthese web malware encounters. In consistent with previous years,\naddition 2012 saw the emergence of\n\n\n-----\n\nMalware creators constantly seek to\nmaximize their return on investment\n(ROI) by finding ways to reach the\nlargest population of potential victims\nwith the least effort, and they often\ntake advantage of cross-platform\ntechnologies when possible. Toward\nthese ends, exploit toolkits generally\ndeliver exploits in a specific order;\nonce a successful exploit has been\ndelivered, no further exploits are\nattempted. The high concentration\nof Java exploits—87 percent of total\nweb exploits—shows that these\nvulnerabilities are attempted prior\nto other types of exploits and also\n\n\nThese types of attacks often represent vulnerability management process and\nmalicious code on “trusted” webpages for users to keep to their hardware and Figure 6: Top Malware Content Types for 2012\n\nJava exploits comprised 87 percent of total web exploits.\n\nthat users may visit every day— software up to date.\nmeaning an attacker is able to\ncompromise users without even Rounding out the top five are Monthly Major Content Types\nraising their suspicion. infostealers, with 3.5 percent of the\n\n100%\n\ntotal web malware encounters in\n\nExploits take the second spot, with 2012, downloaders (1.1 percent), and 80% ApplicationText\n10 percent of the total number of worms (0.8 percent). Once again, 60% Image\nweb malware encounters last year. these numbers are a reflection of 40% Video\nHowever, these figures are largely a where the block occurs, generally 20% Audio\n\nMessage\n\nresult of where the block occurred at the point in which the malicious 0%\nversus actual concentration of exploits script or iFrame is first encountered. J F M A M J J A S O N D\non the web. For example, the 83 As a result, these numbers are not\npercent of malicious scripts and reflective of the actual number of Exploit Content Types\nhidden iFrames are blocks that occur infostealers, downloaders, or worms\n\n100%\n\nat an earlier stage, prior to any exploit being distributed via the web.\n\n80% Java\n\nrendering; hence, they may artificially PDF\ndecrease the number of exploits observed. Top Malware\nContent Types 40%60%20% FlashActive-X\n\nExploits remain a significant cause Malware creators constantly seek to 0%\n\nmaximize their return on investment J F M A M J J A S O N D\n\nof infection via the web, and their\n\n(ROI) by finding ways to reach the\n\ncontinued presence underscores the\n\nlargest population of potential victims\n\nneed for vendors to adopt security Total Major Content Types\n\nwith the least effort, and they often\n\nbest practices in their product life\n\ntake advantage of cross-platform Application Text Image Video Audio Message\n\ncycles. Organizations should focus on\n\ntechnologies when possible. Toward\n\nsecurity as part of the product design\n\nthese ends, exploit toolkits generally\n\nand development process, with timely\nvulnerability disclosures, and prompt/ deliver exploits in a specific order; 65.05% 33.81% 1.09% 0.05% 0.01% 0.00%\n\nonce a successful exploit has been\n\nregular patch cycles. Organizations\n\ndelivered, no further exploits are\n\nand users also need to be made aware\n\nattempted. The high concentration\n\nof the security risks associated with The high concentration of Java exploits shows that these vulnerabilities\n\nof Java exploits—87 percent of total\n\nusing products that are no longer are attempted prior to other types of exploits and also demonstrates\n\nweb exploits—shows that these\n\nsupported by vendors. It is also critical that attackers are finding success with Java exploits.\n\nvulnerabilities are attempted prior\n\nfor organizations to maintain a core\n\nto other types of exploits and also\n\n\n-----\n\nSaaS &\nWeb- B2B\nBased 1.40%\nEmail\n1 37%\n\n\ndemonstrates that attackers are Top Site Category\n\nFigure 7: Top Site Category finding success with Java exploits.\nOnline shopping sites are 21 times more likely to deliver malicious content than counterfeit As Cisco data shows, the notion\n\nAdditionally, with over 3 billion devices\n\nsoftware sites. that malware infections most\n\nrunning Java,[16] the technology\n\ncommonly result from “risky” sites\n\nNote: The “Dynamic Content” category is at the top of Cisco’s list of top locations for the represents a clear way for hackers\nlikelihood of malware infections. This category includes content-delivery systems such as web such as counterfeit software is a\n\nto scale their attacks across multiple\n\nstatistics, site analytics, and other non-advertising-related third-party content. misconception. Cisco’s analysis\n\nplatforms.\n\nindicates that the vast majority of web\nmalware encounters actually occur\n\nDynamic Content Two other cross-platform\nBusiness & Advertisements16.81% & CDN 18.30% technologies—PDF and Flash—took via legitimate browsing of mainstream\nIndustry 8.15% websites. In other words, the majority\n\nthe second and third spots in Cisco’s\n\nof encounters happen in the places\n\nanalysis of the top content types\n\nthat online users visit the most—and\n\nGames 6.51% for malware distribution. Though think are safe.\n\nActive X is still being exploited, Cisco\nresearchers have seen a consistently\n\nWeb Hosting Holding the second spot on the list\n4.98% low use of the technology as a vehicle are online advertisements, comprising\n\nfor malware. However, as noted earlier\n\n16 percent of total web malware\n\nregarding Java, lower numbers of\n\nSearch Engines encounters. Syndicated advertising\n& Portals 4.53% certain types of exploits are largely a is a common means of monetizing\n\nreflection of the order in which exploits\n\nwebsites, so a single malicious ad\n\nComputers & are attempted.\nInternet 3.57% distributed in this manner can have a\n\nOnline Communities 2.66%\n\ndramatic, adverse impact.\n\nIn examining media content, Cisco\n\nShopping 3.57% Entertainment 2.57%\n\ndata reveals almost twice as much\n\nTravel 3.00% Online Storage & image-based malware than non-Flash\n\nBackup 2.27% video. However, this is due, in part, The vast majority of web\n\nto the way browsers handle declared malware encounters actually\n\nNews 2.18%\n\ncontent types, and attackers’ efforts occur via legitimate browsing of\nto manipulate these controls by mainstream websites. In other\n\nSports & Recreations\n\nHealth & 2.10% declaring erroneous content types. words, the majority of encounters\nNutrition 0.97% Transportation1.11% Education1.17% In addition, malware command-and- happen in the places that online\n\nFile Transfer Services control systems often distribute server users visit the most—and think\n1.50%\n\ninformation via comments hidden in are safe.\n\nSaaS & ordinary image files.\nWeb- B2B\nBased 1.40%\nEmail\n1 37%\n\n\n-----\n\n###### Popular Applications\n\n Cybercriminals have paid close Figure 8: Popular Applications by Hits attention to modern browsing by Hits Social media and online video change how employees spend their time at work—and expose\n\nChanges in how people spend new vulnerabilities.\n\n###### habits to expose the largest\n\ntheir time online are expanding the\n\n###### possible population to web\n\nsurface for cybercriminals to launch\n\n###### malware.\n\nexploits. Organizations of all sizes are Other\nembracing social media and online\nvideo; most major brands have a Social Network 9% Search Engine\npresence on Facebook and Twitter, 20%\n\nLooking further down the list of site and many are integrating social media 36%\ncategories through which malware into their actual products. As these\nencounters occurred, business web destinations draw massive\nand industry sites—which include audiences and are accepted into 13%\neverything from corporate sites to enterprise settings, more opportunities 22%\nhuman resources to freight services— to deliver malware are also created. Ads\nare in third place. Online gaming is in\nfourth place, followed by web hosting According to data from Cisco\nsites and search engines in fifth and Application Visibility and Control Online Video\nsixth places, respectively. The top (AVC), the vast majority (91 percent)\n20 website categories are absent of of web requests were split among\nsites typically thought of as malicious. search engines (36 percent); online\nThere is a healthy mix of popular and video sites (22 percent); advertising If the data on the top websites visited across the Internet is correlated\nlegitimate site types such as online networks (13 percent); and social with the most dangerous category of website, the very same places\nshopping (#8), news (#13), and networks (20 percent). online users have the most exposure to malware, such as search\nSaaS/business-to-business\n\n###### engines, are among the top areas that drive web malware encounters.\n\napplications (#16).\n\nCybercriminals have paid close Organizations of all sizes are\nattention to modern browsing habits to embracing social media and If the data on the top websites visited malware encounters. This correlation\nexpose the largest possible population online video; most major brands across the Internet is correlated with shows once again that malware\nto web malware. Where the online have a presence on Facebook the most dangerous category of creators are focused on maximizing\nusers are, malware creators will follow, and Twitter, and many are website, the very same places online their ROI—and therefore, they will\ntaking advantage of trusted websites integrating social media into users have the most exposure to center their efforts on the places\nthrough direct compromise or third- their actual products. malware, such as search engines, are where the number of users and ease\nparty distribution networks. among the top areas that drive web of exposure are greatest.\n\n\n-----\n\nBhavani Thuraisingham. “Cloud-based” Malware Detection for Evolving Data Streams. ACM Transactions on\nManagement Information S stems (TMIS) 2(3) October 2011\n\n\n###### When Gothic Horror Gives Birth to Malware\n\n**by Kevin W. Hamlen**\nAssociate Professor, Computer Science Department, The University of Texas at Dallas\n\n_Malware camouflage is an emerging threat that security professionals may increasingly face._\nWhile most malware already uses simple mutation or obfuscation to diversify and make itself In general, our research suggests that next-generation malware\nharder to reverse-engineer, self-camouflaging malware is even stealthier, blending in with may increasingly eschew simple mutations based on encryption and\nthe specific software already present on each system it infects. This can elude defenses that\nlook for software anomalies like runtime unpacking or encrypted code, which often expose packing in favor of advanced metamorphic binary obfuscations like\nmore conventional malware. those used by Frankenstein.\n\nThe latest self-camouflaging malware technology—appropriately dubbed Frankenstein[17]—is\na product of our research this year in the Cyber Security Research and Education Center\nat The University of Texas at Dallas. Like the fictional mad scientist in Mary Shelley’s 1818\n\nEach such discovered sequence is finally assembled to form a fresh mutant. In practice,\n\nhorror novel, “Frankenstein malware” creates mutants by stealing body parts (i.e., code)\n\nFrankenstein discovers over 2,000 gadgets per second, accumulating over 100,000 from\n\nfrom other software it encounters and stitches the code together to create unique variants of\n\njust two or three victim binaries in under five seconds. With such a large gadget pool at\n\nitself. Each Frankenstein mutant is therefore composed entirely of non-anomalous, benign-\n\ntheir disposal, the resulting mutants rarely share any common instruction sequences; each\n\nlooking software; performs no suspicious runtime unpacking or encryption; and has access\n\ntherefore looks unique.\n\nto an ever-expanding pool of code transformations learned from the many programs it\nencounters. In general, our research suggests that next-generation malware may increasingly eschew\n\nsimple mutations based on encryption and packing in favor of advanced metamorphic\n\nUnder the hood, Frankenstein brings its creations to life using an array of techniques drawn\n\nbinary obfuscations like those used by Frankenstein. Such obfuscations are feasible to\n\nfrom compiler theory and program analysis. Victim binaries are first scanned for short byte\n\nimplement, support rapid propagation, and are effective for concealing malware from the\n\nsequences that decode to potentially useful instruction sequences, called gadgets. A small\n\nstatic analysis phases of most malware detection engines. To counter this trend, defenders\n\nabstract interpreter next infers the possible semantic effects of each gadget discovered.\n\nwill need to deploy some of the same technologies used to develop Frankenstein, including\n\nBacktracking search is then applied to discover gadget sequences that, when executed in\n\nstatic analyses based on semantic, rather than syntactic, feature extraction, and semantic\n\norder, have the effect of implementing the malware payload’s malicious behavior.\n\nsignatures derived from machine learning[18] rather than purely manual analysis.\n\n_This article reports research supported in part by National Science Foundation (NSF) award_\n_#1054629 and U.S. Air Force Office of Scientific Research (AFOSR) award FA9550-10-1-_\n_0088. Any opinions, findings, conclusions, or recommendations expressed are those of the_\n_author and do not necessarily reflect those of the NSF or AFOSR._\n\n###### Like the fictional mad scientist in Mary Shelley’s 1818 horror novel, “Frankenstein malware” creates mutants by stealing body parts\n\n (i.e., code) from other software it encounters and stitches the code together to create unique variants of itself.\n\n17 \u0007Vishwath Mohan and Kevin W. Hamlen. “Frankenstein: Stitching Malware from Benign Binaries.” In Proceedings\n\n_of the USENIX Workshop on Offensive Technologies (WOOT), pp. 77-84, August 2012._\n\n18 \u0007Mohammad M. Masud, Tahseen M. Al-Khateeb, Kevin W. Hamlen, Jing Gao, Latifur Khan, Jiawei Han, and\n\nBhavani Thuraisingham. “Cloud-based” Malware Detection for Evolving Data Streams. ACM Transactions on\n\n\n-----\n\n###### 2012 Vulnerability and Threat Analysis\n\nFigure 10: Vulnerability and Threat Categories\n\nThe Vulnerability and Threat Categories chart shows a significant increase in threat totals—\nin 2012, threats increased 19.8 percent over 2011. This sharp increase in threats is placing\na serious strain on the ability of organizations to keep vulnerability management systems 2010 Monthly 2011 Monthly 2012 Monthly\nupdated and patched—especially given the shift to virtual environments. Alert Numbers Alert Numbers Alert Numbers\n\nTotal  Reamp  New Total  Reamp  New Total  Reamp  New\n\nOrganizations are also attempting to address the increasing use of third-party and open-\nsource software included in their products and in their environments. “Just one vulnerability January 417 259 158 417 403 237 166 403 552 344 208 552\nin third-party or open-source solutions can impact a broad range of systems across the February 430 253 177 847 400 176 224 803 551 317 234 1103\nenvironment, which makes it very difficult to identify and patch or update all those systems,”\n\nMarch 518 324 194 1364 501 276 225 1304 487 238 249 1590\n\nsays Jeff Shipley, Manager of Cisco Security Research and Operations.\n\nApril 375 167 208 1740 475 229 246 1779 524 306 218 2114\n\nAs for the types of threats, the largest group is resource management threats; this generally May 322 174 148 2062 404 185 219 2183 586 343 243 2700\nincludes denial of service vulnerabilities, input validation threats such as SQL injection June 534 294 240 2596 472 221 251 2655 647 389 258 3347\nand cross-site scripting errors, and buffer overflows that result in denial of service. The July 422 210 212 3018 453 213 240 3108 514 277 237 3861\npreponderance of similar threats from previous years, combined with the sharp increase in\n\nAugust 541 286 255 3559 474 226 248 3582 591 306 285 4452\n\nthreats, indicates that the security industry needs to become better equipped at detecting\n\nSeptember 357 167 190 3916 441 234 207 4023 572 330 242 5024\n\nand handling these vulnerabilities.\n\nOctober 418 191 227 4334 558 314 244 4581 517 280 237 5541\n\nThe Cisco IntelliShield Alert Urgency Ratings reflect the level of threat activity related to November 476 252 224 4810 357 195 162 4938 375 175 200 5916\nspecific vulnerabilities. The substantial increase in Level 3 urgency ratings indicates that\n\nDecember 400 203 197 5210 363 178 185 5301 376 183 193 6292\n\nmore vulnerabilities are actually being exploited. This is likely due to the increase in publicly\nreleased exploits either by researchers or test tools, and the incorporation of those exploits 5210 2780 2430 5301 2684 2617 6292 3488 2804\ninto attack toolkits. These two factors are allowing more exploits to be available and used\nacross the board by hackers and criminal groups.\n\nThe Cisco IntelliShield Alert Severity Ratings reflect the impact level of successful\nvulnerability exploits. The severity ratings also show a noticeable increase in Level 3 8000 2010   2011    2012\n\n7000\n\nthreats—for the same reasons indicated above relating to the ready availability of 6000\nexploit tools. 5000\n\n4000\n3000\n2000\n\nFigure 9: Urgency and Severity Ratings 1000\n\n0\n\n2010   2011    2012 J F M A M J J A S O N D\n\nRating Rating\n\nUrgency ≥3 Severity ≥3\n\nUrgency ≥4 Severity ≥4 “Just one vulnerability in third-party or open-source solutions can impact\n\n###### a broad range of systems across the environment, which makes it very\n\nUrgency ≥5 Severity ≥5 difficult to identify and patch or update all those systems.”\n\nJeff Shipley, Manager, Cisco Security Research and Operations\n\n0 10 20 30 40 50 60 0 500 1000 1500 2000\n\n\n-----\n\n##### Anything goes when it comes\n to cyber exploits today—as long as the method selected will get the job done.\n\nThis is not to say that actors in the and even nation states will be the\n\n# Evolutionary shadow economy do not remain perpetrators”[19] of these attacks in the\n\ncommitted to creating ever-more future, working both collaboratively\nsophisticated tools and techniques to and independently.\ncompromise users, infect networks,\nand steal sensitive data, among many “We are seeing a trend in DDoS, with\n\n# Threats other goals. In 2012, however, there attackers adding additional context\n\nwas a trend toward reaching back about their target site to make the\nto “oldies but goodies” to find new outage more significant,” says\nways to create disruption or evade Gavin Reid, Director of Threat\nenterprise security protections. Research for Cisco Security\n\n#### New Methods,\n\nIntelligence Operations, “Instead of\n\nDDoS attacks are a primary example— doing a SYN flood, the DDoS now\nseveral major U.S. financial institutions attempts to manipulate a specific\n\n#### Same Exploits were the high-profile targets of two application in the organization—\n\nmajor and related campaigns launched potentially causing a cascading set\nby foreign hacktivist groups in the of damage if it fails.”\nlast six months of 2012 (for detailed\nanalysis, see the 2012 Distributed\nDenial of Service Trends section).\nSome security experts warn that these In 2012 there was a trend\nevents are just the beginning and that toward reaching back to “oldies\n“hacktivists, organized crime rings,\n\n###### but goodies” to find new ways to create disruption or evade enterprise security protections.\n\n\n-----\n\nAnother trend in the cybercrime Amplification and Reflection Attacks\n\n###### “Even against a sophisticated—but community revolves around the\n\nDNS amplification and reflection attacks[20] utilize domain name system (DNS) open recursive\n\n###### average—adversary, the current “democratization” of threats. We are\n\nresolvers or DNS authoritative servers to increase the volume of attack traffic sent to a\n\n###### ‘state of the art’ in network increasingly seeing that the tools victim. By spoofing[21] DNS request messages, these attacks conceal the true source of\n security is often significantly and techniques—and intelligence the attack and send DNS queries that return DNS response messages 1000 to 10,000 outmatched.” about how to exploit vulnerabilities— percent larger than the DNS request message. These types of attack profiles are commonly\n\nobserved during DDoS[22] attacks.\n\nare being “broadly shared” in the\n\nGregory Neal Akers, Senior Vice President\nfor the Advanced Security Initiatives Group shadow economy today. “Tradecraft Organizations are inadvertently participating in these attacks by leaving open recursive\nat Cisco capabilities have evolved a great deal,” resolvers out on the Internet. They can detect the attacks using various tools[23] and flow\n\ntelemetry[24] technologies and can help prevent them by securing[25] their DNS server or\n\nAkers says. “We’re now seeing more\n\nrate-limiting[26] DNS response messages.\n\nspecialization and more collaboration\namong malicious actors. It’s a threat\n\nWhile enterprises may believe they\n\nassembly line: Someone develops a\n\nare adequately protected against the 2012 Distributed Denial of Service Trends\n\nbug, someone else writes the malware,\n\nDDoS threat, more than likely their another person designs the social The following analysis is derived from the Arbor Networks ATLAS repository, which consists\nnetwork could not defend against the of global data gathered from a number of sources, from 240 ISPs, monitoring peak traffic of\n\nengineering component, and so on.”\n\ntype of high-volume and relentless 37.8 Tbps.[27]\nDDoS attacks witnessed in 2012. Creating potent threats that will Attack Sizes Continue to Trend Upward\n“Even against a sophisticated—but help them gain access to the large Overall, there has been an increase in the average size of attacks over the past year. There\n\naverage—adversary, the current ‘state volumes of high-value assets coming was a 27 percent increase in throughput of attacks (1.23 Gbps in 2011 to 1.57 Gbps in 2012)\n\nand a 15 percent increase in the packets per second used in attacks (1.33 Mpps in 2011 to\n\nof the art’ in network security is across the network is one reason that\n\n1.54 Mpps in 2012).\n\noften significantly outmatched,” says cybercriminals are combining their\nGregory Neal Akers, Senior Vice expertise more often. But like any real- Attack Demographics\n\nThe top three monitored attack sources, after removing 41 percent of sources for which\n\nPresident for the Advanced Security world organization that outsources there is no attribution due to data anonymization, are China (17.8 percent), South Korea\nInitiatives Group at Cisco. tasks, efficiency and cost savings (12.7 percent), and the United States (8.0 percent).\n\nare among the primary drivers for\n\nLargest Attacks\n\nthe “build-a-threat” approach in the The largest monitored attack was measured at 100.84 Gbps and lasted approximately 20\ncybercrime community. The “freelance minutes (source of attack is unknown due to data anonymization). The corresponding largest\ntalent” hired for these tasks typically monitored attack in (pps) was measured at 82.36 Mpps and lasted approximately 24 minutes\nadvertise their skills and pay rates to (source of attack is unknown due to data anonymization).\nthe broader cybercrime community via\nsecret online marketplaces.\n\n\n-----\n\n###### Weaponization of Modern\n\nFigure 11: Live Intrusion Prevention System (IPS) Evasions Cybercriminals are constantly\n\n###### Evasion Techniques\n evolving new techniques to\n\nCybercriminals are constantly evolving\n\n###### bypass security devices. Cisco\n\nnew techniques to bypass security\n\n###### researchers watch vigilantly\n\ndevices. Cisco researchers watch\n\n###### for new techniques and the\n\nvigilantly for new techniques and\n\n###### “weaponization” of well-known\n\nthe “weaponization” of well-known\n\n**Transmission Control Protocol, Src Port: 32883 (32883), Dst** techniques.\n**DCE RPC Bind, Fragment: Single, FragLen: 820, Call: 0** techniques.\n**Version: 5**\n**Version (minor): 0**\n**Packet type: Bind (11)** Cisco Security Research and\n\n**Packet Flags: 0x03** Operations runs several malware labs\n**Data Representation: 10000000**\n**Frag Length: 820** to observe malicious traffic in the\n**Auth Length: 0**\n**Call ID: 0** wild. Malware is intentionally released\n**Max Xmit Frag: 5840** in the lab to ensure security devices\n**Max Recv Frag: 5840**\n**Assoc Group: 0x00000000** are effective; computers are also left\n**Num Ctx Items: 18 Context ID: 0** intentionally vulnerable and exposed to\n\n**Num Trans Itms: 1** the Internet.\n**Interface UUID: c681d4c7-7f36-33aa-6cb8-535560c3f0e9**\n**Context ID: 1**\n**Num Trans Items: 1** During one such test, Cisco Intrusion\n**Interface UUID: 2ec29c7e-6d49-5e67-9d6f-4c4a37a87355**\n\nPrevention System (IPS) technology\ndetected a well-known Microsoft\nRemote Procedure Call (MSRPC)\nattack. Careful analysis determined\nthat the attack was utilizing a\npreviously unseen malware evasion\ntactic in an attempt to bypass security\n\n###### Cisco Security Research and Operations runs several malware labs to devices.[28] The evasion sent several observe malicious traffic in the wild. Malware is intentionally released bind context IDs inside the initial bind in the lab to ensure security devices are effective; computers are also request. This type of attack can evade left intentionally vulnerable and exposed to the Internet. protections unless the IPS monitors\n\nand determines which of the IDs were\nsuccessful.\n\n\n-----\n\n###### CASE STUDY Operation Ababil\n\nDuring September and October 2012, Cisco and Arbor Networks monitored a targeted sent to TCP/UDP port 53 (DNS) or 80 (HTTP). While traffic on UDP port 53 and TCP port\nand very serious DDoS attack campaign known as “Operation Ababil,” which was aimed 53 and 80 represent normally valid traffic, packets destined for UDP port 80 represent an\nat U.S.-based financial institutions.” The DDoS attacks were premeditated, focused, anomaly not commonly used by applications.\nadvertised before the fact, and executed to the letter. Attackers were able to render several\n\nA detailed report of the patterns and payloads of the Operation Ababil campaign can\n\nmajor financial sites unavailable to legitimate customers for a period of minutes—and in\n\nbe found in Cisco Event Response: Distributed Denial of Service Attacks on Financial\n\nthe most severe instances, hours. Over the course of the events, several groups claimed\n\nInstitutions.[31]\n\nresponsibility for the attacks; at least one group purported to be protesting copyright and\nintellectual property legislation in the United States. Others broadcast their involvement as\na response to a YouTube video offensive to some Muslims.\n\n###### Lessons Learned\n\nFrom a cybersecurity standpoint, Operation Ababil is notable because it took advantage of While they are a critical part of any network security portfolio, IPS and firewall devices rely\ncommon web applications and hosting servers that are as popular as they are vulnerable. on stateful traffic inspection. Application-layer techniques used in the Operation Ababil\nThe other obvious and uncommon factor used in this series of attacks was that simultaneous campaign easily overwhelmed those state tables and, in several cases, caused them to\nattacks, at high bandwidth, were launched against multiple companies in the same industry fail. Intelligent DDoS mitigation technology was the only effective countermeasure.\n(financial).\n\nManaged security services and ISPs have their limits. In a typical DDoS attack, the prevailing\n\nAs is often seen in the security industry, what’s old is new again. wisdom says to deal with volumetric attacks in the network. For application-layer campaigns\n\nthat are deployed closer to the victim, these should be addressed at the data center or on\n\nOn September 18, 2012, “Cyber Fighters of Izz ad-Din al-Qassam” posted on Pastebin[29] the “customer edge.” Because multiple organizations were targeted concurrently, network\nbeseeching Muslims to target major financial institutions and commodities trading platforms. scrubbing centers were strained.\nThe threats and specific targets were put up for the world to see and continued for four\nconsecutive weeks. Each week, new threats with new targets were followed up by actions It is critical to keep hardware and software current on DDoS mitigation appliances. Older\nat the appointed times and dates. By the fifth week, the group stopped naming targets deployments are not always able to deal with newer threats. It is also important to have the\nbut made it clear that campaigns would continue. As promised, the campaigns renewed in right capacity in the right locations. Being able to mitigate a large attack is useless if traffic\nearnest in December 2012, once again targeting multiple large U.S. financial organizations. cannot be channeled to the location where the technology has been deployed.\n\nPhase 2 of Operation Ababil was also announced on Pastebin.[30] Instead of infected While cloud or network DDoS mitigation typically has much higher bandwidth capacity,\nmachines, a variety of PHP web applications, including the Joomla Content Management on-premise solutions provide better reaction time against, control of, and visibility into the\nSystem, served as the primary bots in the campaign. Additionally, many WordPress sites, attacks. Combining the two makes for a more complete solution.\noften using the out-of-date TimThumb plug-in, were being compromised around the same\n\nIn conjunction with cloud and network DDoS technologies, and as part of the collateral\n\ntime. The attackers often went after unmaintained servers hosting these applications and\n\nproduced for the Operation Ababil events, Cisco has outlined detection and mitigation\n\nuploaded PHP webshells to deploy further attack tools. The concept of “command and\n\ntechniques in the Identifying and Mitigating the Distributed Denial of Service Attacks\n\ncontrol” did not apply in the usual manner, however; the attackers connected to the tools\n\nTargeting Financial Institutions Applied Mitigation Bulletin.[32] These techniques include\n\ndirectly or through intermediate servers, scripts, and proxies. During the cyber events in\n\nthe use of Transit Access Control List (tACL) filtering, NetFlow data analysis, and unicast\n\nSeptember and October 2012, a wide array of files and PHP-based tools were used, not just\n\nReverse Path Forwarding (uRPF). In addition, there are a number of best practices that\n\nthe widely reported “tsoknoproblembro” (aka “Brobot”). The second round of activity also\n\nshould be regularly reviewed, tested, and implemented that will greatly help enterprises\n\nutilized updated attack tools such as Brobot v2.\n\nto prepare for and react to network events. A library of these best practices can be found\n\nOperation Ababil deployed a combination of tools with vectors crossing application-layer by referencing the Cisco SIO Tactical Resources[33] and Service Provider Security Best\nattacks on HTTP, HTTPS, and DNS with volumetric attack traffic on a variety of TCP, UDP, Practices.[34]\nICMP, and other IP protocols. Cisco’s analysis showed that the majority of packets were\n\n\n-----\n\n##### Spam volumes are continuing to\n decline worldwide, according to Cisco’s research, but spam remains a go-to tool for many cybercriminals, who view it as an efficient and\n\n# Spam the\n\n##### expedient way to expose users to malware and facilitate a wide range of scams.\n\n# Ever Present\n\nHowever, despite the perception quickest way to attract clicks and\nthat malware is typically deployed purchases—and to generate a profit—is\nthrough spam email attachments, to leverage spoofed brands and take\nCisco’s research shows that very few advantage of current events that have\nspammers today rely on this method; the attention of large groups of users.\ninstead, they turn to malicious links\nwithin the email as a far more efficient Global Spam Trends\ndistribution mechanism.\n\nSince the large-scale botnet\ntakedowns of 2010, high-volume\n\nSpam is also less “scattershot” than\n\nspam isn’t as effective as it once\n\nin the past, with many spammers\n\nwas, and spammers have learned\n\npreferring to target specific groups\n\nand changed their tactics. There is a\n\nof users with the hope of generating\n\nclear evolution toward smaller, more\n\nhigher returns. Name-brand\n\ntargeted campaigns based on world\n\npharmaceuticals, luxury watch brands,\n\nevents and particular subsets of users.\n\nand events such as tax season top the\n\nHigh-volume spam is also more likely\n\nlist of things that spammers promote\n\nto be noticed by mail providers and\n\nmost in their campaigns. Over time,\n\nshut down before its purpose can\n\nspammers have learned that the\n\nbe fulfilled.\n\n\n-----\n\nFigure 12: Global Spam Trends\nGlobal spam volumes are down 18 percent, with most spammers keeping\nbankers’ hours on weekends.\n\nGAIN FROM 2011 DECLINE FROM 2011\n\n###### 4.19% 4.60% China Korea\n\n 3.88% Russia\n 6\n\n 10\n 2 2.72% 3\n Poland 4\n\n 3.60% 8\n Saudi Arabia 9\n 1\n\n 5\n\n 12.3%\n 7 India\n 11.38%\n United States 4.00%\n Vietnam\n\n 3.60%\n Brazil\n 2.94% Taiwan\n\nEnglish\n79% Russian Catalan Japanese Danish German French Romanian Spanish Chinese High-volume spam is more likely to be noticed by mail providers and\n\n5% 3% 3% 2% 1% 1% 1% 1% 1%\n\n###### shut down before its purpose can be fulfilled.\n\nSpam Language\n\n\n-----\n\nIn 2012, there were several examples\n\n###### In 2012, there were several of spammers using news about world Figure 13: Spam Origination\n\nIndia retains the spam crown, and the United States skyrockets into second position.\n\n###### examples of spammers using events—and even human tragedy—to news about world events—and take advantage of users. During even human tragedy—to take Superstorm Sandy, for example, Cisco advantage of users. researchers identified a massive\n\nSPAM VOLUMES\n\n“pump and dump” stock scam based\n\naround a spam campaign. Using\na pre-existing email message that -18%\n\nIn 2011, overall global spam volumes urged people to invest in a penny DECLINE FROM 2011 TO 2012\nwere down 18 percent. This is far from stock focused on natural resource\nthe dramatic drop in volume seen in exploration, the spammers began MONDAY\n2010 following the botnet takedowns, attaching sensational headlines about\n\nTUESDAY +10%\n\nbut the continued downward trend is a Superstorm Sandy. An unusual aspect GAIN FOR MIDDLE\npositive development nonetheless. of this campaign is that the spammers WEDNESDAY OF THE WEEK\n\nutilized unique IP addresses to send a\n\nSpammers continue their focus on batch of spam—and have not activated THURSDAY\nminimizing effort while maximizing those addresses since. FRIDAY\nimpact. According to Cisco’s research,\nspam volumes fall by 25 percent on SATURDAY\n\n###### Spam Origination -25%\n\nweekends, when users are often away DECLINE FOR WEEKENDS\n\nIn the world of spam, some countries SUNDAY\n\nfrom their email. Spam volumes rise\n\nremain the same while others\n\nto the highest levels on Tuesday and\n\ndramatically change their rankings. In\n\nWednesday—an average of 10 percent\n\n2012, India retains the top spot as a\n\nhigher than on other weekdays. This\n\nsource of spam worldwide, with the\n\nheightened activity in the middle of\n\nUnited States moving up from sixth in\n\nthe week and lower volumes on the\n\n2011 to second in 2012. Rounding out\n\nweekend allow spammers to live spoken by the largest audiences languages that are being used in\n\nthe top five spam-originating countries\n\n“normal lives.” who use email on a regular basis. the spam message; for example,\n\nare Korea (third), China (fourth) and\n\nAccording to Cisco’s research, the while India was the number one\n\nVietnam (fifth).\n\nIt also gives them time to spend top language for spam messages in spam-originating country in 2012,\ncrafting tailored campaigns based on 2012 was English, followed by Russian, local dialects did not break the top\n\nOverall, the majority of spammers\n\nworld events early in the week that Catalan, Japanese, and Danish. Of 10 in terms of languages used in spam\n\nfocus their efforts on creating spam\n\nwill help them to generate a higher note, there are gaps between where sent from India. The same was true\n\nmessages that feature the languages\n\nresponse rate to their campaigns. spam is being sent from and the for Korea, Vietnam, and China.\n\n\n-----\n\n###### Email Attachments As the “Spoofed Brands” analysis that\n\nFigure 14: Email Attachments appears later in this section reveals, a\nOnly 3 percent of spam has an attachment versus 25 percent of valid email, Spam has long been thought of as\n\nmajority of spam comes from groups\n\nbut spam attachments are 18 percent larger. a delivery mechanism for malware,\n\nwho seek to sell a very specific group\n\nespecially when an attachment is\n\nof name-brand goods—from luxury\n\nSpam Email Valid Email involved. But Cisco’s recent research\n\nwatches to pharmaceuticals—that are,\n\non the use of email attachments in\n\nin most cases, fake.\n\nspam campaigns shows that this\n\n###### 3% 25%\n\nperception may be a myth.\n\n###### IPv6 Spam\n\nOnly 3 percent of total spam has an While IPv6-based email remains a very\nattachment, versus 25 percent of small percentage of overall traffic, it is\nvalid email. And in the rare cases growing as more email users move to\nwhen a spam message does include IPv6-enabled infrastructure.\nan attachment, it is an average of\n\nSpam attachments are 18% larger 18 percent larger than a typical However, while overall email\n\nattachment that would be included volumes are growing at a rapid\n\n###### 18% in valid email. As a result, these attachments tend to stand out. clip, this is not the case with IPv6 spam. This suggests that spammers\n\nare hedging against the time and\n\nIn modern email, links are king. expense to migrate to the new\n\nFigure 15: IPv6 Spam\nWhile IPv6-based email remains a very small percentage of overall traffic, it is growing as Spammers design their campaigns Internet standard. There is no driving\nmore email users move to IPv6-enabled infrastructure. to convince users to visit websites need for spammers—and little to no\n\nwhere they can purchase products material benefit—to cause such a shift\nor services (often dubious). Once at present. As IPv4 addresses are\n\nIPv6 Email Growth: 862% there, users’ personal information exhausted and mobile devices and\n\nIPv6 Spam Growth: 171% is collected, often without their M2M communication drive explosive\n\nknowledge, or they are compromised growth in IPv6, expect spammers\nin some other way. to upgrade their infrastructure and\n\naccelerate their efforts.\n\n###### In modern email, links are king. Spammers design their campaigns to convince users to visit websites where they can purchase products or services. Once there, users’ personal information is collected, often without their knowledge, or they are compromised in some other way.\n\nJUN JUL AUG SEP OCT NOV DEC\n\n\n-----\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|Col12|\n|---|---|---|---|---|---|---|---|---|---|---|---|\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n|||||||||||||\n||Windows 8 consumer preview released||||||Cellular related spam coinciding with iPhone 5 release|||||\n\n\n###### Spoofed Brands\n\nFigure 16: Spoofed Brands The bottom line is spammers\nSpammers target pharmaceuticals, luxury watches, and tax season. With spoofed-brands spam email, are in it for the money, and over\n\nspammers use organizations and\n\n###### the years, they have learned that\n\n5% 50% 100% products to send their messages in\n\n###### the quickest way to attract clicks\n\nhopes that online users click on a link\n\n###### and purchases is by offering\n\nor make a purchase. The majority of\n\nJAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC spoofed brands are prescription drugs, pharmaceuticals and luxury\n\nPrescription Drugs such as anti-anxiety medication and goods and by tailoring their\n\nLuxury Watches painkillers. In addition, luxury watch attacks toward events to which\n\nCredit Card brands form a constant layer of “noise” much of the world is paying\n\nBusiness Reviews that retains consistency across the attention.\n\nProfessional Network entire year.\n\nElectronic Money Transfer\n\nAccounting Software Cisco’s analysis shows that spammers\n\nSocial Network are also skilled at tying their From September to November 2012,\n\nProfessional Associations campaigns to news events. From spammers ran a series of campaigns\n\nAirline January to March 2012, Cisco data posing as cellular companies,\n\nMail shows a spike in spam relating to coinciding with the release of the\n\nWeight Loss Windows software, which coincided iPhone 5.\n\nGovernment Organization with the release of the Windows 8\n\nWindows Software operating system. From February to The bottom line: Spammers are in it for\n\nApril 2012, during the U.S. tax season, the money, and over the years, they\n\nCellular Company\n\nanalysis shows a precipitous increase have learned that the quickest way\n\nOnline Classifieds\n\nin tax software spam. to attract clicks and purchases is by\n\nTaxes\n\noffering pharmaceuticals and luxury\n\nHuman Growth Hormone\n\nFrom January to March 2012, and then goods and by tailoring their attacks\n\nNews\n\nagain from September to December toward events to which much of the\n\nElectronic Payment Services\n\n2012—the beginning and the end of world is paying attention.\n\nGreeting Cards\n\nthe year—spam relating to professional\n\nLuxury Cars\n\nnetworks made grand entrances,\n\nPayroll Services\n\nperhaps because spammers know\n\nWindows 8 consumer Cellular related spam coinciding that people often begin job searches\npreview released with iPhone 5 release\n\nduring these times of the year.\n\nAccounting software Spam related to professional\nduring U.S. tax season social networks\n\n\n-----\n\n###### Vulnerability Management: A Vendor Has to Do More\n Than Enumerate Ambivalently35\n\nHow a vendor discloses its product security issues is the most visible aspect of their Improvement of security disclosure practices should be ongoing as well. In early 2013,\nvulnerability management practices. At Cisco, Security Advisories[36] are researched and Cisco will begin using a new document type—the Cisco Security Notices—to disclose low-\npublished by the Product Security Incident Response Team (PSIRT), a group of senior to-medium-severity product security issues. Cisco Security Notice will improve the efficacy\nsecurity experts who understand that protection of Cisco customers and of the corporation of communication around security issues not deemed severe enough to warrant a Cisco\nmust go hand in hand. Security Advisory. These documents will be available publicly and indexed by a Common\n\nVulnerability and Exposure (CVE) identifier to improve visibility.\n\n“Security Advisories announce our most severe product security issues and are generally the\n\nfirst public evidence of a Cisco product vulnerability,” says Russell Smoak, Senior Director To further enhance how to best digest the ongoing reporting of security issues, vendors\nof Cisco Security Research and Operations, “As such, it’s critical that they be an effective (including Cisco) have begun to include the Common Vulnerability Reporting Framework\ncommunications vehicle that helps customers make informed decisions and manage their (CVRF)[39] and Open Vulnerability Assessment Language (OVAL)[40] formats in their disclosures.\nrisk. Combined with the advanced mitigation techniques[37] we provide for our customers to These emerging standards help end users evaluate vulnerabilities across multiple platforms\nleverage the capabilities in their existing Cisco gear, we are able to provide as many details and technologies with confidence—and the standards are able to scale due to the benefits\nas possible to respond quickly and confidently.” of machine-readable format. Smoak says, “Ensuring that our customers have the tools that\n\nthey need to properly evaluate threats to their networks helps reduce risk and allows them to\n\nVulnerability management, however, starts much earlier in the lifecycle of a vulnerability and\n\nprioritize tasks required to secure their infrastructures.”\n\ncan extend beyond initial disclosure. “Continuous improvement in vulnerability management\npractices is imperative to keeping pace with the changing security environment as a result of\nevolving threats as well as new products and technologies,” says Smoak.\n\nIn other words, a vendor that fails to evolve with threat technologies—and that does not\ndisclose threats—risks falling behind. For example, innovation of internal vulnerabilities\nmanagement tools at Cisco has taken place in the area of bundled third-party software. In the year ahead, for additional updates and in-depth analysis on security trends,\nThird-party software is any code included in a vendor’s product that was not written by the and for information about the latest enterprise security-related publications from Cisco,\nvendor itself; this typically includes commercial third-party or open-source software. visit the Cisco Security Reports website.\n\nhttp://www.cisco.com/go/securityreport\n\nCisco takes advantage of custom-built tooling that uses vulnerability data from Cisco\nIntelliShield[38] to notify the product development teams when a security issue that originates\n\nFor ongoing insight from Cisco’s experts on a wide range of security topics,\n\nin third-party software may impact a Cisco product. This tool, called the Cisco Internal\n\nvisit the Cisco Security Blog.\n\nAlert Manager, has greatly increased the ability to manage security issues that originate\n\nblogs.cisco.com/security\n\nin non-Cisco code.\n\n###### A vendor that fails to evolve with threat technologies—and that does\n not disclose threats—risks falling behind.\n\n\n-----\n\n##### The threat landscape of today is not\n a problem caused by uneducated users visiting malicious sites or is it solved by blocking known “bad” locations on the web.\n\n# Security\n\nThis report has demonstrated how cybercriminals take advantage of the\nattackers have become increasingly fact that every private or public sector\nmore sophisticated, going after the enterprise has its own IT security\nsites, tools, and applications that program,” says John Stewart. “Yes, we\n\n# Outlook 2013 are least likely to be suspected, and go to conferences and stay in touch\n\nusers visit most frequently. Modern with each other, but we really need to\nthreats are capable of infecting mass move from individualized IT security\naudiences silently and effectively, not to one based on real-time intelligence\ndiscriminating by industry, business, sharing and collective response.”\nsize or country. Cybercriminals\nare taking advantage of the rapidly Building a better security infrastructure\nexpanding attack surface found in doesn’t mean creating a more\ntoday’s “any-to-any” world, where complex architecture—in fact, quite\nindividuals are using any device to the opposite. It’s about making the\naccess their business network. infrastructure and the elements within\n\nAs critical national infrastructure,\nbusinesses, and global financial\n\n###### Modern threats are capable of\n\nmarkets continue their move to\n\n###### infecting mass audiences silently\n\ncloud-based services and mobile\n\n###### and effectively, not discriminating\n\nconnectivity, an integrated, layered\n\n###### by industry, business size, or\n\napproach to security is needed to\n\n###### country.\n\nprotect the burgeoning Internet\nof Everything. “Hackers and\n\n\n-----\n\nit work together, with more intelligence and timely security decisions. As\nto detect and mitigate threats. With attackers become more sophisticated,\nthe rapid adoption of BYOD, the reality enterprises must design security\nof multiple devices per user, and capabilities into the network from the\ngrowth of cloud-based services, the beginning, with solutions that bring\nera of managing security capabilities together threat intelligence, security\non each endpoint is over. “We must policy, and enforceable controls across\ntake a holistic approach to security all touch points on the network.\nthat ensures we are monitoring threats\nacross all vectors, from email to web As the attackers become more\nto users themselves,” says Michael sophisticated so, too, must the tools\nCovington, Product Manager for Cisco used to thwart their efforts. With the\nSIO. “Threat intelligence needs to be network providing a common fabric\nelevated above individual platforms in for communication across platforms,\norder to gain a network perspective.” it will also serve as a means to protect\n\nthe devices, services, and users that\n\nAs threats increasingly target users routinely use it to exchange sensitive\nand organizations across multiple content. The network of tomorrow is\nvectors, businesses need to collect, an intelligent one that must provide\nstore, and process all security- better security through a collaborative\nrelevant network activity to better framework than previously possible\nunderstand the scope and extent through the sum of its individual\nof attacks. This level of analysis can components.\nthen be augmented with the context\nof network activity to make accurate\n\n###### The network of tomorrow is an intelligent one that must provide better security through a collaborative framework than previously possible through the sum of its individual components.\n\n\n-----\n\n##### It has become an increasing challenge to manage and secure today’s distributed and agile networks.\n\nOnline criminals continue to exploit Cisco SIO aggregates data from\n\n# About Cisco users’ trust in consumer applications across threat vectors and analyzes\n\nand devices, increasing the risk it using both automated algorithms\nto organizations and employees. and manual processing in an effort to\nTraditional security, which relies on understand how the threats propagate.\nthe layering of products and the use SIO then categorizes threats and\n\n# Security of multiple filters, is not enough to creates rules using more than 200\n\ndefend against the latest generation parameters. Security researchers also\nof malware, which spreads quickly, analyze information about security\nhas global targets, and uses multiple events that have the potential for\nvectors to propagate. widespread impact on networks,\n\n# Intelligence applications, and devices. Rules are\n\nCisco stays ahead of the latest threats dynamically delivered to deployed\nusing real-time threat intelligence from Cisco security devices every three\nCisco Security Intelligence Operations to five minutes.\n(SIO). Cisco SIO is the world’s largest\n\n# Operations cloud-based security ecosystem, in\n\nwhich more than 75 terabits of live\ndata feeds from deployed Cisco email, Cisco SIO is the world’s largest\nweb, firewall, and IPS solutions are cloud-based security ecosystem,\nanalyzed each day. in which more than 75 terabits\n\n###### of live data feeds from deployed Cisco email, web, firewall,\n and IPS solutions are analyzed each day.\n\n\n-----\n\nThe Cisco SIO team also sources, including Cisco email, web, Cisco Security IntelliShield Alert Manager Service\npublishes security best practice firewall, and intrusion prevention\n\nCisco Security IntelliShield Alert Manager Service provides a comprehensive, cost-effective\n\nrecommendations and tactical system (IPS) security solutions;\n\nsolution for delivering the vendor-neutral security intelligence organizations need to identify,\n\nguidance for thwarting threats. these platforms sit on the front lines prevent, and mitigate IT attacks. This customizable, web-based threat and vulnerability\nCisco is committed to providing protecting customer networks from alert service allows security staff to access timely, accurate, and credible information about\ncomplete security solutions that are malicious content and intruders. In threats and vulnerabilities that may affect their environments. IntelliShield Alert Manager\n\nallows organizations to spend less effort researching threats and vulnerabilities, and focus\n\nintegrated, timely, comprehensive, and addition to these on-premise customer\n\nmore on a proactive approach to security.\n\neffective—enabling holistic security protection mechanisms, Cisco also\nfor organizations worldwide. With collects data from a worldwide Cisco offers a free 90-day trial of the Cisco Security IntelliShield Alert Manager Service.\n\nBy registering for this trial, you will have full access to the service, including tools and threat\n\nCisco, organizations can save time deployment of sensors that perform\n\nand vulnerability alerts.\n\nresearching threats and vulnerabilities functions such as trapping spam and\nand focus more on taking a proactive crawling the web to actively seek out To learn more about Cisco Security IntelliShield Alert Manager Services, visit:\n\nhttps://intellishield.cisco.com/security/alertmanager/trialdo?dispatch=4.\n\napproach to security. new instances of malware.\n\nFor early-warning intelligence, threat Using these tools and the data they\nand vulnerability analysis, and proven collect, Cisco’s massive network\nCisco mitigation solutions, please visit: footprint gives SIO systems and\nhttp://www.cisco.com/security. researchers insight into a tremendous\n\n###### For More Information\n\nsampling of both legitimate and\n\n###### Methodology malicious activities on the Internet. Cisco Security Intelligence Operations\nwww.cisco.com/security Cisco Security Products\nwww.cisco.com/go/security\n\nNo security vendor has total visibility\n\nThe analysis presented in this report\n\ninto all malicious encounters. The data Cisco Security Blog Cisco Corporate Security\n\nis based on data that was gathered [blogs.cisco.com/security](http://blogs.cisco.com/security) Programs Organization\n\npresented in this report is Cisco’s\n\nfrom a variety of anonymized global www.cisco.com/go/cspo\n\nperspective on the current state of Cisco Remote Management Services\nthe threat landscape and represents www.cisco.com/en/US/products/\n\nps6192/serv_category_home\n\nour best attempt to normalize data\n\n###### Cisco collects data from a and reflect global trends and patterns worldwide deployment of based on the data available at\n sensors that perform functions the time. such as trapping spam and crawling the web to actively seek out new instances of malware.\n\n\n-----\n\n1 \u0007“\u0007The Internet of Things,” by Michael Chui, Markus Löffler, and Roger Roberts, McKinsey Quarterly, 20 \u0007“\u0007Maliciously Abusing Implementation Flaws in DNS,” DNS Best Practices, Network Protections, and Attack\n\nMarch 2010: http://www.mckinseyquarterly.com/The_Internet_of_Things_2538. _Identification, Cisco.com: http://www.cisco.com/web/about/security/intelligence/dns-bcp.html#3._\n\n2 \u0007“\u0007Cisco Event Response: Distributed Denial of Service Attacks on Financial Institutions,” October 1, 2012: 21 “\u0007IP Spoofing,” by Farha Ali, Lander University, available at Cisco.com: http://www.cisco.com/web/about/\n\nhttp://www.cisco.com/web/about/security/intelligence/ERP-financial-DDoS.html. ac123/ac147/archived_issues/ipj_10-4/104_ip-spoofing.html.\n\n3 Cisco Internet Business Solutions Group. 22 \u0007\u0007“\u0007Distributed Denial of Service Attacks,” by Charalampos Patrikakis, Michalis Masikos, and Olga Zouraraki,\n\nNational Technical University of Athens, The Internet Protocol Journal - Volume 7, Number 4. Available at:\n\n4 \u0007“\u0007The World Market for Internet Connected Devices—2012 Edition,” media release, IMS Research, October http://www.cisco.com/web/about/ac123/ac147/archived_issues/ipj_7-4/dos_attacks.html.\n\n4, 2012: http://imsresearch.com/press-release/Internet_Connected_Devices_Approaching_10_Billion_to_\nexceed_28_Billion_by_2020&cat_id=210&type=LatestResearch. 23 \u0007\u0007“\u0007DNS Tools,” The Measurement Factory: http://dns.measurement-factory.com/tools.\n\n5 Cisco Internet Business Solutions Group. 24 \u0007 \u0007For more on DNS Tools, see DNS-OARC (https://www.dns-oarc.net/oarc/tools) and The Measurement\n\nFactory (http://dns.measurement-factory.com/tools/index.html).\n\n6 \u0007“\u0007Internet of Everything: It’s the Connections That Matter,” by Dave Evans, Cisco Blog, November 29, 2012:\n\nhttp://blogs.cisco.com/news/internet-of-everything-its-the-connections-that-matter/. 25 \u0007“\u0007Secure BIND Template Version 7.3 07 Aug 2012,” by TEAM CYMRU, cymru.com: http://www.cymru.com/\n\nDocuments/secure-bind-template.html.\n\n7 \u0007 Cisco Internet Business Solutions Group.\n\n26 \u0007“\u0007Response Rate Limiting in the Domain Name System (DNS RRL),” RedBarn.org: http://www.redbarn.org/dns/\n\n8 \u0007Cisco 2011 Annual Security Report, December 2011: http://www.cisco.com/en/US/prod/collateral/vpndevc/ ratelimits.\n\nsecurity_annual_report_2011.pdf.\n\n27 \u0007Arbor Networks’ ATLAS data is derived from “honey pots” deployed within service provider networks around\n\n9 \u0007“\u0007Remote Access and BYOD: Enterprises Working to Find Common Ground with Employees,” 2011 Cisco the world; ASERT malware research; and, an hourly feed of anonymized data based on NetFlow, BGP, and\n\n_Annual Security Report, December 2011, p. 10: http://www.cisco.com/en/US/prod/collateral/vpndevc/_ SNMP correlation. The anonymized data provided by Arbor Peakflow SP customers is collated and trended\n\nsecurity_annual_report_2011.pdf. within ATLAS to provide a detailed view of the threats and traffic patterns on the Internet.\n\n10 \u0007“\u0007Cisco Global Cloud Index: Forecast and Methodology, 2011–2016”: http://www.cisco.com/en/US/solutions/ 28 \u0007“\u0007IPS Testing,” Cisco.com: http://www.cisco.com/web/about/security/intelligence/cwilliams-ips.html.\n\ncollateral/ns341/ns525/ns537/ns705/ns1175/Cloud_Index_White_Paper.html.\n\n29 \u0007“\u0007Bank of America and New York Stock Exchange under attack unt [sic],” Pastebin.com, September 18, 2012:\n\n11 Ibid http://pastebin.com/mCHia4W5.\n\n12 \u0007“\u0007A Deep Dive Into Hyperjacking,” by Dimitri McKay, SecurityWeek, February 3, 2011: http://www.securityweek. 30 \u0007“Phase 2 Operation Ababil,” Pastebin.com, September 18, 2012: http://pastebin.com/E4f7fmB5.\n\ncom/deep-dive-hyperjacking.\n\n31 \u0007“\u0007Cisco Event Response: Distributed Denial of Service Attacks on Financial Institutions”: http://www.cisco.com/\n\n13 \u0007India Asks Pakistan to Investigate Root of Panic,” by Jim Yardley, The New York Times, August 19, 2012: web/about/security/intelligence/ERP-financial-DDoS.html.\n\nhttp://www.nytimes.com/2012/08/20/world/asia/india-asks-pakistan-to-help-investigate-root-of-panic.\nhtml?_r=1&. 32 \u0007Identifying and Mitigating the Distributed Denial of Service Attacks Targeting Financial Institutions Applied\n\n_Mitigation Bulletin: http://tools.cisco.com/security/center/viewAMBAlert.x?alertId=27115._\n\n14 \u0007“\u0007Twitter Rumor Sparked Oil-Price Spike,” by Nicole Friedman, WSJ.com, August 6, 2012: http://online.wsj.\n\ncom/article/SB10000872396390444246904577573661207457898.html. 33 \u0007“\u0007Security Intelligence Operations Tactical Resources,” Cisco.com: http://tools.cisco.com/security/center/\n\nintelliPapers.x?i=55.\n\n15 \u0007 \u0007This originally appeared on the Cisco Security blog: http://blogs.cisco.com/security/sniffing-out-social-\n\nmedia-disinformation/ 34 \u0007“\u0007Service Provider Security Best Practices,” Cisco.com: http://tools.cisco.com/security/center/\n\nserviceProviders.x?i=76.\n\n16 \u0007Java.com: http://www.java.com/en/about/.\n\n35 \u0007 Anagram courtesy of anagramgenius.com.\n\n17 \u0007 \u0007Vishwath Mohan and Kevin W. Hamlen. Frankenstein: Stitching Malware from Benign Binaries. In Proceedings\n\nof the USENIX Workshop on Offensive Technologies (WOOT), pp. 77-84, August 2012. 36 \u0007Cisco Security Advisories: http://cisco.com/go/psirt.\n\n18 \u0007 \u0007Mohammad M. Masud, Tahseen M. Al-Khateeb, Kevin W. Hamlen, Jing Gao, Latifur Khan, Jiawei Han, and 37 \u0007Cisco Applied Mitigation Bulletins, Cisco.com: http://tools.cisco.com/security/center/searchAIR.x.\n\nBhavani Thuraisingham. Cloud-based Malware Detection for Evolving Data Streams. ACM Transactions on\nManagement Information Systems (TMIS), 2(3), October 2011. 38 \u0007Cisco Intellishield Alert Manager Service: http://www.cisco.com/web/services/portfolio/product-technical-\n\nsupport/intellishield/index.html.\n\n19 \u0007“DDoS Attacks: 2013 Forecast, Experts Say Recent Hits Only the Beginning,” by Tracy Kitten,\n\nBankInfoSecurity.com, December 30, 2012: http://ffiec.bankinfosecurity.com/ddos-attacks-2013- 39 \u0007CVRF, ICASI.com: http://www.icasi.org/cvrf.\nforecast-a-5396. 40 \u0007\u0007OVAL, Oval International: http://oval.mitre.org/.\n\n\n-----\n\nAmericas Headquarters Asia Pacific Headquarters Europe Headquarters\nCisco Systems, Inc. Cisco Systems (USA) Pte. Ltd. Cisco Systems International\nSan Jose, CA Singapore BV Amsterdam,\n\nThe Netherlands\n\nCisco has more than 200 offices worldwide. Addresses, phone numbers, and fax numbers are listed on the\nCisco Website at www.cisco.com/go/offices.\n\nAll contents are Copyright © 2011–2013 Cisco Systems, Inc. All rights reserved. This document is Cisco Public\nInformation. Cisco and the Cisco Logo are trademarks of Cisco Systems, Inc. and/or its affiliates in the U.S.\nand other countries. A listing of Cisco’s trademarks can be found at www.cisco.com/go/trademarks. Third party\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Cisco - Annual Security Report - 2013.pdf"
    ],
    "report_names": [
        "Cisco - Annual Security Report - 2013.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a7d4fe31-d92f-425a-ba8c-c70219f52fb8",
            "created_at": "2022-10-25T15:50:23.466009Z",
            "updated_at": "2025-03-27T02:00:55.477162Z",
            "deleted_at": null,
            "main_name": "Frankenstein",
            "aliases": [
                "Frankenstein"
            ],
            "source_name": "MITRE:Frankenstein",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8e1bae2f-2a21-4ba8-a6f1-42155f96aec8",
            "created_at": "2022-10-25T16:07:23.645758Z",
            "updated_at": "2025-03-27T02:02:09.905135Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Ajax Security Team",
                "Flying Kitten",
                "Group 26",
                "Operation Saffron Rose"
            ],
            "source_name": "ETDA:Flying Kitten",
            "tools": [
                "Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bb08058c-a744-4129-aa80-10aa34ed8766",
            "created_at": "2022-10-25T16:07:24.474826Z",
            "updated_at": "2025-03-27T02:02:10.245391Z",
            "deleted_at": null,
            "main_name": "Cyber fighters of Izz Ad-Din Al Qassam",
            "aliases": [
                "Cyber fighters of Izz Ad-Din Al Qassam",
                "Fraternal Jackal",
                "QCF",
                "Qassam Cyber Fighters"
            ],
            "source_name": "ETDA:Cyber fighters of Izz Ad-Din Al Qassam",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f4d7cba1-dbdd-42a9-88c5-4d0c81659ee0",
            "created_at": "2023-01-06T13:46:38.357581Z",
            "updated_at": "2025-03-27T02:00:02.813318Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Saffron Rose",
                "AjaxSecurityTeam",
                "Ajax Security Team",
                "Group 26",
                "Sayad",
                "SaffronRose"
            ],
            "source_name": "MISPGALAXY:Flying Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d63af7da-1b27-4f7e-a006-e7398c38f436",
            "created_at": "2023-01-06T13:46:38.702633Z",
            "updated_at": "2025-03-27T02:00:02.896029Z",
            "deleted_at": null,
            "main_name": "Cyber fighters of Izz Ad-Din Al Qassam",
            "aliases": [
                "Fraternal Jackal"
            ],
            "source_name": "MISPGALAXY:Cyber fighters of Izz Ad-Din Al Qassam",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "56b3eb1d-6baf-4ee4-a098-ec0081280315",
            "created_at": "2024-09-28T02:05:36.599884Z",
            "updated_at": "2025-03-27T02:05:17.250078Z",
            "deleted_at": null,
            "main_name": "ALUMINUM THORN",
            "aliases": [
                "WIRTE ",
                "Frankenstein "
            ],
            "source_name": "Secureworks:ALUMINUM THORN",
            "tools": [
                " Powershell Empire",
                "FruityC2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536063,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1360320179,
    "ts_modification_date": 1360326299,
    "files": {
        "pdf": "https://archive.orkl.eu/4197d8bbc5d70a90942d4056e289ed560d3bbf02.pdf",
        "text": "https://archive.orkl.eu/4197d8bbc5d70a90942d4056e289ed560d3bbf02.txt",
        "img": "https://archive.orkl.eu/4197d8bbc5d70a90942d4056e289ed560d3bbf02.jpg"
    }
}