{
    "id": "2e5d87f6-60bf-4c63-ad2b-a8d2e68419c8",
    "created_at": "2023-05-06T02:08:56.045755Z",
    "updated_at": "2025-03-27T02:16:53.035987Z",
    "deleted_at": null,
    "sha1_hash": "33e8c0d3fdea758d5b6f17027ce319eaa009948b",
    "title": "2023-04-18 - U.S. Citizens and Russian Intelligence Officers Charged with Conspiring to Use U.S. Citizens as Illegal Agents of the Russian Government",
    "authors": "",
    "file_creation_date": "2023-05-05T02:04:44Z",
    "file_modification_date": "2023-05-05T02:04:44Z",
    "file_size": 112218,
    "plain_text": "# U.S. Citizens and Russian Intelligence Officers Charged with Conspiring to Use U.S. Citizens as Illegal Agents of the Russian Government\n\n**[justice.gov/opa/pr/us-citizens-and-russian-intelligence-officers-charged-conspiring-use-us-citizens-illegal](https://www.justice.gov/opa/pr/us-citizens-and-russian-intelligence-officers-charged-conspiring-use-us-citizens-illegal)**\n\nApril 18, 2023\n\nDepartment of Justice\n\nOffice of Public Affairs\n\nFOR IMMEDIATE RELEASE\n\nTuesday, April 18, 2023\n\n## Defendants Sought to Sow Discord, Spread Pro-Russia Propaganda and Interfere in Elections Within the United States\n\nA federal grand jury in Tampa, Florida, returned a superseding indictment charging four U.S.\ncitizens and three Russian nationals with working on behalf of the Russian government and\nin conjunction with the Russian Federal Security Service (FSB) to conduct a multi-year\nforeign malign influence campaign in the United States. Among other conduct, the\nsuperseding indictment alleges that the Russian defendants recruited, funded and directed\nU.S. political groups to act as unregistered illegal agents of the Russian government and sow\ndiscord and spread pro-Russian propaganda; the indicted intelligence officers, in particular,\nparticipated in covertly funding and directing candidates for local office within the United\nStates.\n\nAdditionally, in a separate case out of the District of Columbia, a criminal complaint was\nunsealed charging Russian national Natalia Burlinova with conspiring with an FSB officer to\nact as an illegal agent of Russia in the United States\n\n\n-----\n\nRussia s foreign intelligence service allegedly weaponized our First Amendment rights –\nfreedoms Russia denies its own citizens – to divide Americans and interfere in elections in\nthe United States,” said Assistant Attorney General Matthew G. Olsen of the Justice\nDepartment’s National Security Division. “The department will not hesitate to expose and\nprosecute those who sow discord and corrupt U.S. elections in service of hostile foreign\ninterests, regardless of whether the culprits are U.S. citizens or foreign individuals abroad.”\n\n“Efforts by the Russian government to secretly influence U.S. elections will not be tolerated,”\nsaid Assistant Attorney General Kenneth A. Polite, Jr. of the Justice Department’s Criminal\nDivision. “As today’s announcement demonstrates, the Criminal Division is committed to\neradicating foreign malign influence from the U.S. political system and helping ensure the\nintegrity of our elections.”\n\n“Today’s announcement paints a harrowing picture of Russian government actions and the\nlengths to which the FSB will go to interfere with our elections, sow discord in our nation and\nultimately recruit U.S citizens to their efforts,” said Acting Assistant Director Kurt Ronnow of\nthe FBI’s Counterintelligence Division. “All Americans should be deeply concerned by the\ntactics employed by the FSB and remain vigilant to any attempt to undermine our democracy.\nThe FBI remains committed to confronting this egregious behavior and ultimately disrupting\nour adversaries and those who act on their behalf.”\n\n_United States v. Ionov, et al._\n\nAccording to the superseding indictment returned in the Middle District of Florida, Aleksandr\nViktorovich Ionov, a resident of Moscow, was the founder and president of the AntiGlobalization Movement of Russia (AGMR), an organization headquartered in Moscow,\nRussia, and funded by the Russian government. Ionov allegedly utilized AGMR to carry out\nRussia’s malign influence campaign. Ionov’s influence efforts were allegedly directed and\nsupervised by Moscow-based FSB officers, including indicted defendants Aleksey Borisovich\nSukhodolov and Yegor Sergeyevich Popov.\n\n“The prosecution of this criminal conduct is essential to protecting the American public when\nforeign governments seek to inject themselves into the American political process,” said U.S.\nAttorney Roger B. Handberg for the Middle District of Florida. “We thank our partners at the\nFBI for their tireless investigation of these events and their commitment to ensure justice is\ndone.”\n\nAmong other illegal activities, the superseding indictment alleges that Ionov, Sukhodolov and\nPopov conspired to directly and substantially influence democratic elections in the United\nStates by clandestinely funding and directing the political campaign of a particular candidate\nfor local office in St. Petersburg, Florida, in 2019. For instance, the superseding indictment\nalleges that Popov expressly referred to this effort on behalf of the FSB as “our election\ncampaign,” and Ionov referring to the candidate as the “candidate whom we supervise.”\n\n\n-----\n\nIonov and Popov allegedly intended that this election interference plot would extend beyond\nthe 2019 local election cycle in St. Petersburg, and subsequently discussed that the “USA\nPresidential election” was the FSB’s “main topic of the year.”\n\nMoreover, from at least November 2014 until July 2022, Ionov allegedly engaged in a yearslong foreign malign influence campaign targeting the United States. As a part of the\ncampaign, Ionov allegedly recruited members of political groups within the United States,\nincluding the African People’s Socialist Party and the Uhuru Movement (collectively, the\nAPSP) in Florida, Black Hammer in Georgia and a political group in California (referred to in\nthe superseding indictment as U.S. Political Group 3), to participate in the influence\ncampaign and act as agents of Russia in the United States, including the following indicted\ndefendants:\n\nOmali Yeshitela, a U.S. citizen residing in St. Petersburg, Florida, and St. Louis,\nMissouri, who served as the chairman and founder of the APSP;\nPenny Joanne Hess, a U.S. citizen residing in St. Petersburg, Florida, and St. Louis,\nMissouri, who served as the leader of a component of the APSP;\nJesse Nevel, a U.S. citizen residing in St. Petersburg, Florida, and St. Louis, Missouri,\nwho served as a member of a component of the APSP; and\nAugustus C. Romain Jr., aka Gazi Kodzo, a U.S. citizen residing in St. Petersburg,\nFlorida, and Atlanta, who served as a leader of the APSP and a founder of Black\nHammer in Georgia.\n\nOne focus of Ionov’s alleged influence operation was to create the appearance of American\npopular support for Russia’s annexation of territories in Ukraine. For example, in May 2020,\nIonov allegedly sent a request he stated was from “Russia, the Donetsk People’s Republic” –\nan apparent reference to a Russian-occupied region in eastern Ukraine – to Yeshitela and\nmembers of other U.S. political groups to make statements in support of the independence of\nthe so-called Donetsk People’s Republic, a Russian-backed breakaway state in eastern\nUkraine. Ionov later allegedly touted to the FSB that Yeshitela’s video-recorded statement of\nsupport was the first time that “American nonprofit organizations congratulated citizens” of\nthe occupied region.\n\nIonov’s use of the APSP to promote Russian propaganda relating to Ukraine allegedly\ncontinued after Russia’s invasion of Ukraine. On the day Russia invaded Ukraine, Feb. 24,\n2022, Ionov allegedly emailed Nevel an “URGENT MESSAGE” which contained pro-Russian\ntalking points in support of the invasion. Thereafter, throughout March 2022, the APSP\nrepeatedly hosted Ionov via video conference to discuss the war, during which Ionov falsely\nstated that anyone who supported Ukraine also supported Naziism and white supremacy,\nand Yeshitela and another APSP member allegedly made statements of solidarity with the\nRussian government.\n\n\n-----\n\nIonov, Sukhodolov, Popov, Yeshitela, Hess, Nevel and Romain are charged with conspiring\nto have U.S. citizens act as illegal agents of the Russian government within the United\nStates without providing prior notification to the Attorney General, as required by law. If\nconvicted, they each face a maximum penalty of five years in prison. Yeshitela, Hess and\nNevel are also charged with acting as agents of Russia within the United States without such\nprior notification. If convicted, they each face a maximum penalty of 10 years in prison. If\nconvicted, a federal district court judge will determine any sentence after considering the\nU.S. Sentencing Guidelines and other statutory factors.\n\nAssistant U.S. Attorneys Daniel J. Marcet and Risha Asokan for the Middle District of Florida,\nTrial Attorney Menno Goedman of the Justice Department’s Counterintelligence and Export\nControl Section, and Trial Attorney Demetrius Sumner of the Criminal Division’s Public\nIntegrity Section are prosecuting the case.\n\n_United States v. Burlinova_\n\nAccording to the affidavit in support of the criminal complaint unsealed in the District of\nColumbia, Russian national Natalia Burlinova, a resident of Moscow, conspired with an FSB\nofficer to recruit U.S. citizens from academic and research institutions to travel to Russia to\nparticipate in a public diplomacy program called Meeting Russia. The program was operated\nby PICREADI, a Russian organization led by Burlinova, funded by the Russian government\nand devoted to promoting Russian national interests.\n\n“The defendant is accused of subverting our foreign agent notification laws to promote\nRussian national interests here in the United States, concealing from the public that her\nrecruitment efforts were funded by a Russian security service,” said U.S. Attorney Matthew\nM. Graves for the District of Columbia. “We will continue to expose these serious crimes and\nhold all who perpetrate them accountable.”\n\nThe affidavit alleges that the FSB officer provided funding and other support for Burlinova’s\nforeign recruitment and her efforts to advance Russian interests in the United States. In\nreturn, Burlinova provided the FSB officer with extensive information about U.S. citizens who\nwere recruited to attend her programs, including their résumés, passport information,\nphotographs and analyses of their views toward Russia. Burlinova further identified for the\nFSB officer particular U.S. citizens who, in Burlinova’s view, had expressed positive attitudes\ntowards Russia and were prepared to continue to collaborate. During a recruitment trip to the\nUnited States in fall 2018, Burlinova met with U.S. citizens at various universities and\nresearch institutions and provided to photographs of her meetings to the FSB officer. The\nFSB officer used the information Burlinova provided prepare FSB intelligence reports.\nBurlinova never notified the Attorney General of these efforts or otherwise disclosed to the\npublic that her recruitment efforts were supported and funded by a Russian security service.\n\n\n-----\n\nAssistant U.S. Attorney Michael J. Friedman for the District of Columbia and Trial Attorney\nEmma D. Ellenrieder of the National Security Division’s Counterintelligence and Export\nControl Section are prosecuting the case.\n\n_An indictment and a complaint are merely an allegation. All defendants are presumed_\n_innocent until proven guilty beyond a reasonable doubt in a court of law._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-04-18 - U.S. Citizens and Russian Intelligence Officers Charged with Conspiring to Use U.S. Citizens as Illegal Agents of the Russian Government.pdf"
    ],
    "report_names": [
        "2023-04-18 - U.S. Citizens and Russian Intelligence Officers Charged with Conspiring to Use U.S. Citizens as Illegal Agents of the Russian Government.pdf"
    ],
    "threat_actors": [
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1683338936,
    "ts_updated_at": 1743041813,
    "ts_creation_date": 1683252284,
    "ts_modification_date": 1683252284,
    "files": {
        "pdf": "https://archive.orkl.eu/33e8c0d3fdea758d5b6f17027ce319eaa009948b.pdf",
        "text": "https://archive.orkl.eu/33e8c0d3fdea758d5b6f17027ce319eaa009948b.txt",
        "img": "https://archive.orkl.eu/33e8c0d3fdea758d5b6f17027ce319eaa009948b.jpg"
    }
}