{
    "id": "2e6769d4-aed3-4912-b988-0a385dda1504",
    "created_at": "2023-01-12T15:02:16.776304Z",
    "updated_at": "2025-03-27T02:05:56.947316Z",
    "deleted_at": null,
    "sha1_hash": "2b016f1c99cf5a78a830810bcffccfee40b2e5d9",
    "title": "2017-08-24 - Crystal Finance Millennium used to spread malware",
    "authors": "",
    "file_creation_date": "2022-05-27T21:15:30Z",
    "file_modification_date": "2022-05-27T21:15:30Z",
    "file_size": 314725,
    "plain_text": "# Crystal Finance Millennium used to spread malware\n\n**[bartblaze.blogspot.com/2017/08/crystal-finance-millennium-used-to.html](https://bartblaze.blogspot.com/2017/08/crystal-finance-millennium-used-to.html)**\n\nEarlier today, Costin from Kaspersky tweeded the following intriguing tweet:\n\nThe Crystal Finance Millennium website in Ukraine has been hacked and distributing\nmalware since at least August 18.\n[— Costin Raiu (@craiu) August 23, 2017](https://twitter.com/craiu/status/900302689128656896)\n\nAfter some hunting, it was revealed the Crystal Finance Millennium website was indeed\nhacked, and serving three different flavors of malware. In this short blog post, we'll take a\nlook at the malware variants that were distributed, and provide minimal background.\n\n**Introduction**\n\nCrystal Finance Millennium' website is currently taken offline by the hosting provider, but\narchives of the website exist online.\n\n\n-----\n\nFigure 1 - \"At this moment the site is blocked by the hosting administrator\"\n\nFrom the archived webpage, it becomes apparent they provide accounting software,\nperonalisation of medical records, blood service and \"full automation of the doctor's office\" contrary to what their company name suggests, it appears they are (mostly) focused on\nmedical software.\n\nFigure 2 - archived webpage of CFM's services\n\nMoving on to the malware present on their website:\n**Smoke Loader**\n\nSmoke Loader, also known as Dofoil, Sharik or just 'Smoke', is a botnet with the main\npurpose of downloading other malware - a downloader.\n\nSmoke Loader was originally downloaded from:\n\nhXXp://cfm.com[.]ua/awstats/load.exe\n\n\n-----\n\nAdditionally, it was also mirrored at:\nhXXp://nolovenolivethiiswarinworld[.]com/ico/load.exe\n\nSmoke Loader drops itself in a random directory inside the user's %appdata% folder, for\nexample:\n\\AppData\\Roaming\\Microsoft\\sfujsddu\\\n\nAdditionally, it performs an HTTP POST request to the following domains:\ncontsernmayakinternacional[.]ru\nsoyuzinformaciiimexanikiops[.]com\nkantslerinborisinafrolova[.]ru\n\nSmokeLoader has a debug path which is likely fake, or automatically generated:\n_c:\\backward\\inch\\enumeration\\Atmel\\neces.pdb_\n\nWe won't go any further into Smoke Loader here, but there's an excellent blog post by\n[@hasherazade over at Malwarebytes here:](https://twitter.com/hasherezade)\n[Smoke Loader – downloader with a smokescreen still alive](https://blog.malwarebytes.com/threat-analysis/2016/08/smoke-loader-downloader-with-a-smokescreen-still-alive/)\n\n**Chthonic**\n\nChthonic is a banking trojan and derivative of Zeus, well-known banking malware. Zeus, also\nknown as Zbot, was leaked several years ago and has since then spawned multiple new,\nand often improved, banking trojans.\n\nChthonic uses a custom encryptor and, as a result, its payload hash will differ every time.\n\nIt was observed as a dropper from the following websites:\n\nhXXp://nolovenolivethiiswarinworld[.]com/ico/load.exe\n\nhXXp://crystalmind[.]ru/versionmaster/nova/load.exe\n\nAdditionally, it drops its payload into the user's %appdata% folder; for example:\n\\AppData\\Roaming\\Microsoft\\MicrosoftStart.exe\n\nWhile Smoke Loader employs totally random filenames, Chthonic tries to hide by looking like\na legitimate program.\n\nIt performs an HTTP POST request to the following domain:\nnolovenolivethiiswarinworld[.]com\n\nInterestingly enough, Chthonic was spotted in June targeting a government institution in\nUkraine:\n[Chthonic Trojan is back in nation-state cyberattack against Ukraine](https://nioguard.blogspot.co.uk/2017/06/chthonic-trojan-is-back-in-nation-state.html)\n\n\n-----\n\nWhoever s behind this Chthonic campaign however, has a sense of humour by sporting the\nfollowing debug path: C:\\postmaster\\merge\\Peasants\\Billy.pdb\n\nChthonic will also create a simple batch file which goes through a loop and will delete the\ndropper and the batch file once it has installed the payload.\n\n**PSCrypt**\n\nPSCrypt, which is based on GlobeImposter, another ransomware variant, has been hitting\nUkraine in the past:\nhttps://www.bleepingcomputer.com/news/security/before-notpetya-there-was-anotherransomware-that-targeted-ukraine-last-week/\n\nInterestingly enough, the same PSCrypt campaign was spotted earlier this month by\n[@malwarehunterteam:](https://twitter.com/malwrhunterteam)\n\nLooks like PSCrypt actors started a new campaign targeting Ukraine in past 2\n[days...@BleepinComputer](https://twitter.com/BleepinComputer) [@demonslay335](https://twitter.com/demonslay335)\n[— MalwareHunterTeam (@malwrhunterteam) August 16, 2017](https://twitter.com/malwrhunterteam/status/897746418244485120)\n\nThis tweet suggests the attacks started as early as the 14th of August.\n\nPSCrypt was originally downloaded from:\n\nhXXp://cfm.com[.]ua/awstats/wload.exe\n\nPSCrypt will encrypt files and append an extension of .pscrypt - in order to restore your\nfiles, which asks for 3500 Hryvnia (~ EUR 115):\n\nFigure 3 - PSCrypt ransom message\n\nPSCrypt provides a fully detailed ransom message on how to send bitcoins to the\ncybercriminal, as well as a personal ID (\"Ваш личный идентификатор\"). The ransom note\nappears to have several spelling mistakes, and may not be original Ukrainian language.\n\n\n-----\n\nAdditionally, PSCrypt will remove RDP related files and registry keys, likely to prevent an\nadministrator to clean an infected machine remotely. It will also clear all event logs using\nwevtutil:\n\nFigure 4 - Batch file which goes through commands in sequential order\n\nWhoever's behind this PSCrypt campaign also shows sign of humour, indicating an address\nin the US, pointing to a company called \"Unlock files LLC\". Such company does not exist:\n\nFigure 5 - Unlock files LLC address\n\nFigure 6 - Companies at the same address\n\nUnfortunately, the Bitcoin address shows a history of already paid ransoms, dating back to\nthe 15th of August: [1Gb4Pk85VKYngfDPy3X2tjYfzvU62oL](https://blockchain.info/address/1Gb4Pk85VKYngfDPy3X2tjYfzvU62oLnas)\n\nAt time of writing, a total of 0.0924071 has been received, which is around EUR 328.\n\nSince the first payment was on the 15th of August, this supports the theory of CFM's\n**website being compromised at least before or on the 15th, quite possibly the 14th.**\n\nThe general recommendation is to NOT pay, but rather restore files from a backup.\n\n\n-----\n\n**Conclusion**\n\nWhile Crystal Finance Millenium's website was hacked, it's possible its software was not\naffected. In the mean time, I'd advise to not upgrade or update any software belonging to the\ncompany, but rather wait for an official statement from their side.\n\nThe hacking of a company or personal website can always happen, and as such, it is\nimportant to act fast once it's happened - the (hosting) company did the right thing to take the\nwebsite offline while things are being fixed in the background.\n\nThe bigger question here is if it may be a targeted attack - recently, Ukraine has been\ntargeted heavily by not only EternalPetya (also known as NotPetya), but also by Xdata and\nPSCrypt. Additionally, seemingly targeted attacks had Chthonic as payload, and, as reported\nin this blog post, another software company in Ukraine has been compromised.\n\nAs usual, best is to wait until further data is available before making any judgments.\n\nPrevention advise for ransomware can be found on my dedicated page about ranomware\nprevention:\n[https://bartblaze.blogspot.co.uk/p/ransomware-prevention.html](https://bartblaze.blogspot.co.uk/p/ransomware-prevention.html)\n\nAnd, as always, indicators of compromise (IOCs) can be found below, as well as additional\nresources.\n\n**IOCs**\n\n**Resources**\n\nNew Cyberattack wave is launched using officialweb site of the accounting software\ndeveloper«Crystal Finance Millennium» (PDF)\n[“Crystal Attack” analysis – behavior analysis of the “load.exe” sample (PDF)](https://issp.ua/issp_system_images/UPD_samples_analysis_eng.pdf)\n\n[Massive phishing scam Zeus banking Trojan](http://cert.gov.ua/?p=2875)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-08-24 - Crystal Finance Millennium used to spread malware.pdf"
    ],
    "report_names": [
        "2017-08-24 - Crystal Finance Millennium used to spread malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535736,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1653686130,
    "ts_modification_date": 1653686130,
    "files": {
        "pdf": "https://archive.orkl.eu/2b016f1c99cf5a78a830810bcffccfee40b2e5d9.pdf",
        "text": "https://archive.orkl.eu/2b016f1c99cf5a78a830810bcffccfee40b2e5d9.txt",
        "img": "https://archive.orkl.eu/2b016f1c99cf5a78a830810bcffccfee40b2e5d9.jpg"
    }
}