{
    "id": "2e7ee04b-8970-445f-a3cc-63d106977e13",
    "created_at": "2023-01-12T14:58:58.519695Z",
    "updated_at": "2025-03-27T02:05:55.2629Z",
    "deleted_at": null,
    "sha1_hash": "fdafcf5b882e892ab772d9ecefc9cf8518aed857",
    "title": "2019-12-02 - Facebook Ads Manager Targeted by New Info-Stealing Trojan",
    "authors": "",
    "file_creation_date": "2022-05-27T01:58:54Z",
    "file_modification_date": "2022-05-27T01:58:54Z",
    "file_size": 1359211,
    "plain_text": "# Facebook Ads Manager Targeted by New Info-Stealing Trojan\n\n**[bleepingcomputer.com/news/security/facebook-ads-manager-targeted-by-new-info-stealing-trojan/](https://www.bleepingcomputer.com/news/security/facebook-ads-manager-targeted-by-new-info-stealing-trojan/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nDecember 2, 2019\n05:24 PM\n4\n\nAttackers are distributing an information-stealing Trojan disguised as a PDF reader that\nsteals Facebook and Amazon session cookies as well as sensitive data from the Facebook\nAds Manager.\n\nOver the weekend, [MalwareHunterTeam found numerous sites distributing a fake PDF](https://twitter.com/malwrhunterteam/status/1201552349715673088)\nediting program called 'PDFreader'.\n\n\n-----\n\n**Site promoting PDFreader**\nThe executables distributed from this site are signed by a digital certificate issued by\nSectigo to \"Rakete Content Gmbh\".\n\n\n-----\n\n**Digital signature**\n\n[VirusTotal detects this Trojan as Socelars, but it also shares characteristics with other](https://www.virustotal.com/gui/file/306c26c0e659cdf3b696f3e0fd543846b8b324b51c60887dee1d3169be282df5/detection)\n[Trojans, such as AdKoob and](https://news.sophos.com/en-us/2018/07/29/adkoob-information-thief-targets-facebook-ad-purchase-info/) [Stresspaint, that also attempt to extract and steal Facebook](https://www.bleepingcomputer.com/news/security/stresspaint-malware-steals-facebook-credentials-and-session-cookies/)\ndata from various URLs.\n\nAccording to [Vitali Kremez, who analyzed this Trojan, there is not much code similarity](https://twitter.com/VK_Intel)\nbetween this Trojan and the others, so it may be inspired rather than evolved from previous\ninfections.\n\n\"That tells it must be a newer (maybe inspired) variant or significantly improved one over\nthe previous generation. I assess this might be only the beginning of the evolution of this\ntype of malware targeting ad and social media providers,\" Kremez told\nBleepingCOmputer.com\n\n## Targets Facebook Ads Manager\n\nWhen launched, Kremez told BleepingComputer that the Trojan will first attempt to steal\nFacebook sessions cookies from Chrome and Firefox by accessing the Cookies SQLite\ndatabase.\n\nOnce the cookie is retrieved, it will be used to connect a variety of Facebook URLs where\ninformation is extracted.\n\n\n-----\n\n```\nhttps://www.facebook.com/bookmarks/pages?ref_type logout_gear\nhttps://secure.facebook.com/settings\nhttps://secure.facebook.com/ads/manager/account_settings/account_billing/\n\n```\nThe account_billing URL will be used to extract the user's account_id and access_token,\nwhich will then be used in a Facebook Graph API call to steal data from the user's Ads\nManager settings.\n\n**Facebook Graph API call**\nThe graph API call used is below:\n```\nhttps://graph.facebook.com/v4.0/act_{account_id}?\n_reqName=adaccount&_reqSrc=AdsPaymentMethodsDataLoader&fields=%5B%22all_payment_metho\n\n```\nThe stolen data, which consists of session cookies, access tokens, account ids, advertising\nemail address, associated pages, credit card info (number, expiration date), PayPal email,\nad balances, spending limits, etc, is then compiled and sent to the attacker's Command &\nControl server.\n\nWith the USA election season looming and state-sponsored actors abusing Facebook ads\nin the past, it is important for anyone running political campaigns to know that malware is\ntargeting Facebook's ad infrastructure.\n\n\"Also, I think in light of the upcoming elections and intensified FB campaigns running\npolitical messages, this tool is almost like an espionage malware looking for possible\npolitical narratives (and grabbing account information),\" Kremez told\nBleepingComputer.com.\n\n\n-----\n\nTo make matters worse, with the information stolen by the attackers, they could potentially\nuse these stolen Facebook cookies to access accounts and use them to create their own ad\ncampaigns.\n\n## Steals Amazon session cookies\n\nWhile the main focus of this Trojan is to steal data from Facebook, the malware will also\nattempt to steal session cookies for Amazon.com and Amazon.co.uk.\n\n**Stealing Amazon session cookie**\nUnlike the Facebook routine, this cookie will simply be sent back to the attacker and will not\nbe used by the Trojan to extract any other information. Once again, if the attacker gains\naccess to a user's Amazon session cookie they will be able to log in as that user.\n\n## Distributed via adware bundles\n\nAs the sites promoting the 'PDFreader' program do not have active links that allow a user to\ndownload the program, BleepingComputer investigated how this malware may be\ndistributed.\n\nAfter following trail of other malware that communicated with one of the PDFreader\ndomains, we found that many of the requests to the PDFreader domains came from adware\nbundles installing unwanted programs such as YeaDesktop or pretending to be copyrighted\nsoftware.\n\nAs this Trojan is silently executed and performs all its tasks in the background, users will not\nbe aware that anything was installed and will just see whatever adware or copyrighted\nsoftware was downloaded.\n\n\n-----\n\n### Related Articles:\n\n[Pixiv, DeviantArt artists hit by NFT job offers pushing malware](https://www.bleepingcomputer.com/news/security/pixiv-deviantart-artists-hit-by-nft-job-offers-pushing-malware/)\n\n[New powerful Prynt Stealer malware sells for just $100 per month](https://www.bleepingcomputer.com/news/security/new-powerful-prynt-stealer-malware-sells-for-just-100-per-month/)\n\n[New Meta information stealer distributed in malspam campaign](https://www.bleepingcomputer.com/news/security/new-meta-information-stealer-distributed-in-malspam-campaign/)\n\n[New BlackGuard password-stealing malware sold on hacker forums](https://www.bleepingcomputer.com/news/security/new-blackguard-password-stealing-malware-sold-on-hacker-forums/)\n\n[Fake Binance NFT Mystery Box bots steal victim's crypto wallets](https://www.bleepingcomputer.com/news/security/fake-binance-nft-mystery-box-bots-steal-victims-crypto-wallets/)\n\n[Adware](https://www.bleepingcomputer.com/tag/adware/)\n[Amazon](https://www.bleepingcomputer.com/tag/amazon/)\n[Facebook](https://www.bleepingcomputer.com/tag/facebook/)\n[Info Stealer](https://www.bleepingcomputer.com/tag/info-stealer/)\n[Password Stealing Trojan](https://www.bleepingcomputer.com/tag/password-stealing-trojan/)\n[Trojan](https://www.bleepingcomputer.com/tag/trojan/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/microsoft-warns-of-spear-phishing-attacks-shares-tips-to-dodge-them/)\n[Next Article](https://www.bleepingcomputer.com/news/security/smith-and-wesson-web-site-hacked-to-steal-customer-payment-info/)\n\n### Comments\n\n[buddy215 - 2 years ago](https://www.bleepingcomputer.com/forums/u/64042/buddy215/)\n\nLikely Russia....since Mueller outed it spreading propaganda...is behind this.\nFacebook users will once again be bombarded with pro-Trump Russian propaganda.\nFacebook has refused to ban political ads like Twitter has done. That's assuming the\nSenate will not vote to impeach Trump out of fear of losing their jobs. Trump is going\nall out in rallies across the country with his lies about Ukraine...not Russia...interfering\nin the last election. Voters should think about why Russia wanted Trump elected.\n\n\n-----\n\n[herbman - 2 years ago](https://www.bleepingcomputer.com/forums/u/827130/herbman/)\n\nYou cannot be serious LOL. Are you really this ridiculously clueless ?\n\nEverything you said is completely bogus, it was democrats who colluded with Russia\nand Ukraine helped the democrats in the 2016 election.\n\nYou got to stop watching fake news, see official list of fake news below.\n\nCnn, Msnbc,Abc,Cbs, Nbc, HuffPost, NYT, WashPost, The AP, BuzzFeed, Politico,\nNewsWeek, The Hill, Rolling Stone, Sky News, USA Today, Time, LA Times, Reuters,\nBBC, Boston Globe, Vox, The Miami Herald, Mother Jones, HLN Yahoo, MSN, NY\nDaily News, Vice, Univision, People, PBS, NPR, New Yorker, Wall Street Journal,\nDaily Beast, Bloomberg, Aurn, National Journal, BI,\n\n\"Politicians And Their Families Are Playing in The Corrupt Ukrainian Sandbox\"\n\nhttp://newswithviews.com/politicians-and-their-families-are-playing-in-the-corruptukrainian-sandbox/\n\n\"The impeachment investigation into President Donald J. Trump’s alleged quid pro\nquo conversation with Ukrainian President Volodymyr Zelensky is beyond the theatre\nof the absurd. The continued harassment and ongoing defamation against the 45th\npresident of the United States are acts of harassment, obstruction, and treason.\nDemocrats and the liberal mainstream fake news media have been on a perpetual\nwitch hunt to overthrow the duly elected POTUS and their credibility has reached new\nlows. If the United States is to remain a republic, the Democrat Party and their liberal\npropaganda media puppets must be stopped.\"\n\nPresident Trump has the moral high ground and he has always been a fighter. He will\nnot sit idly by and allow a socialist-communist coup d’etat overthrow of his presidency\nto occur. As President Trump has said, “They’re not really after me, they’re after you.\nI’m just in their way.”\n\n[http://newswithviews.com/impeach-the-enemy-within-for-treason/](http://newswithviews.com/impeach-the-enemy-within-for-treason/)\n\n\n-----\n\n[Whalley_World - 2 years ago](https://www.bleepingcomputer.com/forums/u/1128131/whalley-world/)\n\nI thought this was a site for technical information, not political bickering. We certainly\nneed relevant FACTS (verifiable) to protect ourselves from this cyber-security threat,\nbut political finger-pointing and competing conspiracy theories will not help us here.\n\n[Lawrence Abrams - 2 years ago](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nOn topic political comments are allowed, but let's not stray from the content of the\narticle.\n\nIf it continues, I will disable comments for this article.\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-02 - Facebook Ads Manager Targeted by New Info-Stealing Trojan.pdf"
    ],
    "report_names": [
        "2019-12-02 - Facebook Ads Manager Targeted by New Info-Stealing Trojan.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535538,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1653616734,
    "ts_modification_date": 1653616734,
    "files": {
        "pdf": "https://archive.orkl.eu/fdafcf5b882e892ab772d9ecefc9cf8518aed857.pdf",
        "text": "https://archive.orkl.eu/fdafcf5b882e892ab772d9ecefc9cf8518aed857.txt",
        "img": "https://archive.orkl.eu/fdafcf5b882e892ab772d9ecefc9cf8518aed857.jpg"
    }
}