{
    "id": "2e845539-2fd7-4501-ae00-d901bb54f8a8",
    "created_at": "2022-10-25T16:48:15.55032Z",
    "updated_at": "2025-03-27T02:17:16.745383Z",
    "deleted_at": null,
    "sha1_hash": "f1e5b814ff4ee85f0be263cdc4a7048fad658933",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-04-12T15:23:50Z",
    "file_modification_date": "2021-04-12T15:24:08Z",
    "file_size": 7873127,
    "plain_text": "###### ®\n\n#### M-TRENDS\n\n## 2021FIREEYE MANDIANT SERVICES | SPECIAL REPORT\n\n\n#### M-TRENDS\n\n## 2021FIREEYE MANDIANT SERVICES | SPECIAL REPORT\n\n\n#### M-TRENDS\n\n## 2021FIREEYE MANDIANT SERVICES | SPECIAL REPORT\n\n\n-----\n\n###### Table of Contents\n\nExecutive Summary 4 Targeted Attacks 19\n\nExpanding Knowledge by Sharing Intrusion Realities 5 Threat Groups 20\n\nBy the Numbers 8 Malware 21\n\nData From FireEye Mandiant Investigations 9 Threat Techniques 28\n\nDetection by Source 10\n\nDwell Time 11\n\nIndustry Targeting 17\n\n\n-----\n\n###### M-TRENDS\n\nFIREEYE MANDIANT SERVICES | SPECIAL REPORT\n# 2021\n\nRansomware 36 UNC2452 62\n\nRansomware Evolves Into Multifaceted Extortion 37 Mapping UNC2452 Activity to the Targeted\n\nAttack Lifecycle Framework 63\n\nSteps toward Proactive Hardening Against\nRansomware in Multiple Environments 41 Case Studies 72\n\nRecovery and Reconstitution Challenges in Insider Threat Risks to Flat Environments 73\nPost-Ransomware Scenarios 45\n\nRed Team Makes the Most of Social Engineering\n\nNewly Named Threat Groups 49 and System Misconfigurations 76\n\nFIN11 50\n\nConclusion 80\n\nPandemic-Related Threats 56\n\nMore Security Awareness to Build Best Practicess 81\n\nThreats Against Organizations Working with\nCOVID-19 Information and Research 57\n\n\n-----\n\n### EXECUTIVE SUMMARY\n\n\n-----\n\n###### Expanding Knowledge by  Sharing Intrusion Realities\n\n Security practitioners faced a series of challenges in this past year which forced organizations into uncharted waters. As\nransomware operators were attacking state and municipal networks alongside\nhospitals and schools, a global pandemic response to COVID-19 necessitated a\nmove to remote work for a significant portion of the economy. Organizations had to\nadopt new technologies and quickly scale outside of their normal growth plans.\n\nAs organizations settled into a new understanding of “normal,” UNC2452, a\nsuspected nation-state threat actor, conducted one of the most advanced cyber\nespionage campaigns in recent history. Many security teams were forced to\nsuspend wide-ranging analyses around the adoption of remote work policies and\ninstead focus on a supply chain attack from a trusted platform.\n\n\n-----\n\nNation states taking a cyber espionage approach to COVID research, threat groups\nworking together to achieve their objectives, exploitation of quickly adopted workfrom-home strategies and a wake-up call for global supply chain compromise –\nexperiences in 2020 will shape security policies for years to come.\n\nThemes covered in M-Trends 2021 include: :\n\n- 59% of the security incidents investigated by Mandiant last year were initially\ndetected by the organizations themselves, an improvement of 12% from the prior\nyear.\n\n- Ransomware has evolved into multifaceted extortion where actors not only\ndeploy ransomware encryptors across victim environments, but also employ\na variety of other extortion tactics to coerce victims into complying with\ndemands.\n\n- FIN11, a recently named financially motivated threat group, was responsible for\nwidespread phishing campaigns, that conducted several multifaceted extortion\noperations.\n\n- Pervasive ransomware campaigns drove down the median dwell time as threat\nactors sought to capitalize on shifting trends in the workspace and a global\ncrisis.\n\n\n-----\n\n- UNC2452, a suspected state-sponsored group, undertook a broad-scale\nespionage campaign after injecting a trojanized DLL into the SolarWinds\nOrion build process. Mandiant identified the campaign and worked with law\nenforcement agencies and industry partners to protect organizations and\nrespond to the adversary.\n\n- Mandiant experts observed the use of 63% of MITRE ATT&CK techniques, and\njust over a third of techniques observed were seen in more than 5% of intrusions.\n\n- Threat actors took advantage of infrastructure supporting work-at-home with an\nincreased focus on vulnerability exploitation.\n\nOne of the most striking trends for the period of October 1st, 2019 to September\n30th, 2020 was the significant reduction in the global median dwell time. At 24\ndays, this is the first time Mandiant has observed the global median dwell time\ndip below one month. While this reduction in dwell time may correlate to better\nvisibility and response, it is also likely the preponderance of ransomware helped\ndrive down the time between initial infection and identification.\n\nWith the inclusion of all the observations listed above, the addition of new\nmetrics reported in By The Numbers, the introduction of the named threat\ngroup FIN11, new case studies, and many other topics, M-Trends 2021 builds on\nour transparency to continue providing critical knowledge to those tasked with\ndefending organizations. The information in this report has been sanitized to\nprotect identities of victims and their data.\n\n\n-----\n\n### BY THE  NUMBERS\n\n\n-----\n\n###### Data from FireEye Mandiant Investigations\n\n The metrics reported in M-Trends 2021 are based on FireEye Mandiant investigations of targeted attack activity conducted between October 1, 2019 and September 30, 2020.\n\n Detection by Source\n\nOrganizations continue to improve their ability to discover compromises within\n\n**Internal detection is** their environments. While M-Trends 2020 noted a drop in internal notifications\nwhen an organization for 2019 compared to 2018, Mandiant experts observed a return to organizations\nindependently\n\ndetecting the majority of incidents internally in 2020. Organizations increased\n\ndiscovers it has been\ncompromised. internal incident detection to 59% in 2020—a 12-point increase compared to\n\n2019. This return to organizations detecting the majority of intrusions within their\nenvironments is in line with the overall trend towards increased internal detection\nobserved over the last decade. It shows a continued dedication to the expansion\nand enhancement of organic detection and response capabilities. The increase in\n\n**External notification** ransomware activity affects this category as well.\nis when an outside\nentity informs an\norganization it has been\ncompromised.\n\n\n-----\n\n###### DETECTION BY SOURCE, 2011-2020\n\n100\n\n\n90\n\n**94%**\n\n80\n\n70\n\n60 **63%**\n\n50\n\n50\n\n30\n\n20\n\n10\n\n0\n2011 2012\n\n\n**37%** 33% **31%** **47%** **53%** **62%** **59%** **47%** **59%**\n\n**94%**\n\n**63%** 67% **69%**\n\n**53%** **53%**\n\n**47%**\n\n**38%** **41%** **41%**\n\n\n2013 2014 2015 2016 2017 2018 2019 2020\n\n\nExternal\nInternal\n\n\n###### DETECTION BY SOURCE BY REGION, 2020\n\n**AMERICAS**\n\n\n**APAC**\n\n\n**EMEA**\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\n**48%** **52%**\n\nExternal Internal\n\n\n80\n\n60\n\n40\n\n20\n\n0\n\n\nExternal\n\n\n**47%** **53%**\n\n\nExternal Internal\n\n\nInternal\n\n\n###### DETECTION BY SOURCE BY REGION, 2019-2020 COMPARISON\n\n70\n\n\n30\n\n40\n\n\n60\n\n50\n\n\n40\n\n30\n\n\n50\n\n60\n\n\n20\n\n\n70\n\n80\n\n\n2019 2020\n\n\n-----\n\n**Dwell time is calculated**\nas the number of days\nan attacker is present\nin a victim environment\nbefore they are detected.\nThe median represents\na value at the midpoint\nof a data set sorted\nby magnitude.\n\n**Median Dwell Time**\n###### 416 24\n**DAYS IN 2011** **DAYS IN 2020**\n\n\n###### Dwell Time\n\nOrganizations continue to find and contain adversaries faster than in previous\nyears. Over the past decade, there has been a marked reduction in median dwell\ntime, from just over one year (2011) to just under one month (2020).\n\n###### Global Dwell Time\nIn 2020, the global median dwell time dropped below one month for the first time.\nOrganizations are now detecting incidents in only 24 days—more than twice as fast\nas 2019. These improvements in detection hold true regardless of the notification\nsource. Global median dwell time for incidents which were detected internally\ndropped to just 12 days and incidents with external notification sources came in at\n73 days.\n\n\n###### GLOBAL MEDIAN DWELL TIME, 2011-2020\n\n|Compromise Notifications All External Notification Internal Detection|2011 416 — —|2012 243 — —|2013 229 — —|2014 205 — —|2015 146 320 56|2016 99 107 80|2017 101 186 57.5|2018 78 184 50.5|2019 56 141 30|2020 24 73 12|\n|---|---|---|---|---|---|---|---|---|---|---|\n\n\n-----\n\n###### Global Median Dwell Time Distribution\nGlobally, organizations are detecting more incidents within the first 30 days of\nan intrusion and fewer incidents with a dwell time longer than 700 days. The\ndistribution of global dwell time continues to show an increased proportion of\nincidents with a dwell time of 30 days or fewer. In 2020, 52% of the compromises\ninvestigated by Mandiant experts had dwell times of 30 days or fewer, compared\nto 41% in 2019 and 31% in 2018. There were also improvements at the other end of\nthe spectrum; Mandiant observed a 3% decrease in investigations with dwell times\ngreater than 700 days.\n\n\nThe overall trends across multiple years could be explained by continued\ndevelopment and improvement of organizational detection capabilities and an\nevolution of the threat landscape.\n\n###### GLOBAL MEDIAN DWELL TIME DISTRIBUTION, 2018-2020\n\n\n35%\n\n\n**35**\n\n**30**\n\n\n**25**\n\n**20**\n\n\n**15**\n\n**10**\n\n\n**5**\n\n**0**\n\n\n22%\n\n15%\n\n\n3%\n\n2%\n\n\n6%\n\n4%\n\n3%\n\n\n3%\n\n1%\n\n\n0\n\n\n2020\n2019\n\n2018\n\n\n7%\n\n5%\n\n4%\n\n\n7%\n\n4%\n\n3%\n\n\n2%\n\n1%\n\n\nDwell time (days)\n\n\n14%\n\n9%\n\n\n-----\n\n**Investigations Involving Ransomware**\n###### 14 25\n\n**% IN 2019** **% IN 2020**\n\n\nA major factor contributing to the increased proportion of incidents with dwell\ntimes of 30 days or fewer is the continued surge in the proportion of investigations\nthat involved ransomware, which rose to 25% in 2020 from 14% in 2019. Of these\nransomware intrusions, 78% had dwell times of 30 days or fewer compared to\n44% of non-ransomware intrusions. Mandiant experts also observed that only 1%\nof ransomware intrusions had dwell times of 700 days or more compared to 11% of\nnon-ransomware intrusions.\n\n\n###### GLOBAL DWELL TIME BY INVESTIGATION TYPE, 2020\n\n0\n\n\n10\n\n20\n\n\n30\n\n40\n\n\n50\n\n60\n\n\n70\n\n80\n\n\n90\n\n100\n\n|Col1|Col2|Col3|\n|---|---|---|\n||||\n|||7 Days|\n|7 Days||14|\n|14 Median 24|Median 5|30 Median 45|\n|Days 30|Days|Days 7 Days|\n||||\n|90||90 14|\n||||\n|200||200 30|\n||||\n|400||400 700|\n|700||90 200 400 700|\n||||\n||||\n||||\n||||\n\n\nMedian\n###### 45\nDays\n\n\nMedian\n###### 5\nDays\n\n\nAll Investigations Ransomware Non-Ransomware\nInvestigations Investigations\n\n\nMedian\n###### 24\nDays\n\n\n-----\n\n**Change in**\n**Americas Median Dwell Time**\n###### 60\n\n**DAYS IN 2019** **DAYS IN 2020**\n\n###### [17]\n\n\n###### Americas Median Dwell Time\nThe Americas saw median dwell time continue to decrease in 2020. The dwell time\nfor incidents which were discovered internally improved the most—from 32 days\ndown to nine days. This is the first time Mandiant has observed the median dwell\ntime in any region dip into single digits.\n\nMedian dwell time in the Americas was 3.5 times shorter in 2020 than in 2019.\nCompanies were detecting incidents internally 3.6 times faster and receiving external\nnotification of compromises 2.1 times faster.\n\nIn 2020, 27.5% of incidents investigated in the Americas involved ransomware. The\nlarge number of investigations which involved ransomware undoubtedly drove down\nthe median dwell time. Ransomware incidents in the Americas had a median dwell\ntime of just three days and accounted for 41% of incidents with a dwell time of 14\ndays or fewer.\n\n\n###### AMERICAS MEDIAN DWELL TIME, 2016-2020\n\n**140**\n\n\n**120**\n\n**100**\n\n\n**80**\n\n**60**\n\n\nNotifications All\n\nExternal\n\nInternal\n\n\n**40**\n\n**20**\n\n\n**0**\n\n\n2016\n\n\n2017\n\n\n2018\n\n\n2020\n\n\n2019\n\n\n-----\n\n**Change in**\n**APAC Median Dwell Time**\n\n###### 54 76\n\n**DAYS IN 2019** **DAYS IN 2020**\n\n\n###### APAC Median Dwell Time\nThe median dwell time for APAC increased from 54 days in 2019 to 76 days in\n2020. APAC saw a decrease in the number of ransomware-related breaches which\naccounted for 12.5% of incidents investigated in 2020 as compared to 18% in 2019.\nThe reduction in ransomware-related incidents was a likely contributor to the\noverall increase in median dwell time for APAC.\n\nAdversaries continue to maintain access in compromised organizations in APAC\nfor extensive periods of time. Consistent with observations in 2019, 10% of\nbreaches investigated in APAC during 2020 showed dwell times of more than\nthree years and 4% were greater than nine years.\n\n\n###### APAC MEDIAN DWELL TIME, 2016-2020\n\n**1200**\n\n\n**1000**\n\n**800**\n\n\n**600**\n\n**400**\n\n\nNotifications All\n\nExternal\n\nInternal\n\n\n**200**\n\n**0**\n\n\n2016\n\n\n2017\n\n\n2019\n\n\n2020\n\n\n2018\n\n\n-----\n\n**Change in**\n**EMEA Median Dwell Time**\n###### 54\n\n**DAYS IN 2019** **DAYS IN 2020**\n\n###### [66]\n\n\n###### EMEA Median Dwell Time\nThe median dwell time for EMEA increased from 54 days in 2019 to 66 days in\n2020. Mandiant experts observed that 28% of incidents in EMEA had a dwell time\nof one week or less, and 8% of incidents had dwell times longer than three years.\nOrganizations in EMEA continue to respond to long-standing intrusions while also\ncontending with faster paced compromises such as ransomware.\n\nWhen separated by notification source, median dwell time for EMEA increased\nfor incidents discovered internally but decreased when companies were notified\nof a compromise by an external entity. For incidents that were detected internally,\nEMEA saw median dwell time increase by 20%, from 23 days in 2019 to 29 days in\n2020. Conversely, compromises in EMEA with an external notification source had a\n25% decrease in median dwell time, from 301 days in 2019 to 225 days in 2020.\n\n\n###### EMEA MEDIAN DWELL TIME, 2016-2020\n\n**500**\n\n\n**400**\n\n**300**\n\n\nNotifications All\n\nExternal\n\nInternal\n\n\n**200**\n\n**100**\n\n\n**0**\n\n\n2016 2017 2018\n\n\n2019\n\n\n2020\n\n\n-----\n\n###### Industry Targeting\n\nMandiant has observed that the most targeted industries continue to remain\nconsistent year over year. The top five most targeted industries in 2020 were\nbusiness and professional services, retail and hospitality, financial, healthcare, and\nhigh technology. Over the past decade, business and professional services and\nfinancial have consistently placed in the top five most targeted industries. Overall,\nthe top targeted industries change little while position in the rankings is somewhat\nfluid.\n\n###### Big Movers\nMandiant experts observed that retail and hospitality organizations were targeted\nmore heavily in 2020, coming in as the second most targeted industry, compared\nto 11th in 2019. Healthcare rose to 3rd most targeted industry in 2020, compared\nto 8th in 2019. In the other direction, Mandiant experts observed a decrease in\ntargeting of entertainment and media which dropped from the most targeted\nindustry in 2019 to 6th in 2020.\n\n\n-----\n\n###### TARGETED INDUSTRIES, 2015-2020\n\n Rank 2016 2017 2018 2019 2020\n\n 1\n\n 2\n\n 3\n\n 4\n\n 5\n\n 6\n\n 7\n\n 8 Manufacturing\n\n 9\n\n 10\n\n 11\n\n 12\n\n 13\n\n 14\n\n 15 Biotechnology\n\n\nBusiness/\nProfessional\nServices\n\nRetail/\nHospitality\n\nHealthcare\n\nFinancial\n\nHigh Tech\n\nConstruction/\nEngineering\n\nEntertainment/\nMedia\n\nTelecommunications\n\nEducation\n\nGovernment\n\nTransportation/\nLogistics\n\nAerospace/\nDefense\n\n\n-----\n\nResell\nAccess\n\n\n###### Targeted Attacks\n\nMandiant experts responded to a wide variety of intrusions in 2020, making\nobservations about initial infection vectors, adversary operations and victim\nenvironments.\n\n###### Initial Infection Vector\nWhile phishing remains an effective vector for initial compromise, in 2020,\nMandiant observed adversaries leveraging exploits more often than other vectors.\nIn cases where the initial vector of compromise was identified, evidence of exploits\nwas found in 29% of intrusions whereas phishing accounted for 23% of intrusions.\nMandiant experts also observed adversaries used stolen credentials or brute\nforcing as the initial attack vector in 19% of the investigations. Prior compromise\naccounted for 12% of the intrusions in which the initial compromise was identified.\n\n###### Adversary Operations\nAdversaries continue to use intrusions for monetary gain through methods that\ninclude extortion, ransom, payment card theft and illicit transfers. Direct financial\ngain was the likely motive for 36% of intrusions and an additional 2% of intrusions\nwere likely perpetrated to resell access.\n\nIn 2020, data theft remained an important mission objective for threat actors. In\n32% of intrusions adversaries stole data and in 29% of those cases (9% of all cases)\nthe data theft likely supported intellectual property or espionage end goals.\n\nApproximately 3% of intrusions likely only served to compromise architecture for\nfurther attacks, and insider threats remain rare, represented by fewer than 1% of\nintrusions.\n\n###### Environment \nIn 29% of cases, Mandiant experts identified more than one distinct threat group in\nthe victim environment—nearly twice the percentage noted in 2019.\n\n\n**Objective: Data Theft**\n\nData Theft\n\n32%\n\n9%\n\nEspionage\n\n**Multiple Threat Groups**\n**Identified**\n(per environment)\n\n###### 15 29\n\n**% in 2019** **% in 2020**\n\n\n-----\n\nNewly Tracked\nThreat Groups\n\nNewly Tracked\nand Observed\n\n652 Threat Groups\n\n161\n\nObserved\n\n246 Threat Groups\n\n###### THREAT GROUPS, 2020\n\n\n###### Threat Groups\n\nOver the course of Mandiant’s history, Mandiant experts have tracked more than\n2,400 threat groups, which includes 650+ newly tracked threat groups in 2020.\nMandiant experts have combined or eliminated approximately 500 of these groups\nover the years, leaving more than 1,900 distinct threat groups tracked at this\ntime. By expanding and refining a vast threat actor knowledgebase, Mandiant can\nsupport a broad spectrum of investigations while maintaining fidelity within that\ndataset. In 2020, Mandiant experts graduated one group to a named threat group\nand merged 75 threat groups based on extensive research into activity overlaps.\nFor details on how Mandiant defines and references UNC groups and merges,\nplease see, “How Mandiant Tracks Uncategorized Threat Actors.”[1]\n\nIn 2020, Mandiant experts investigated intrusions that involved 246 distinct\nthreat groups. Organizations faced intrusions by four named financial threat (FIN)\ngroups; six named advanced persistent threat (APT) groups, including groups\nfrom the nation-states of China, Iran and Vietnam; and 236 uncategorized threat\n(UNC) groups. Of the 246 threat groups observed at intrusion clients, 161 of these\nthreat groups were newly tracked threat groups in 2020.\n\n###### 2\nActive FIN Groups\nFrom These Geolocations\n\n            - Russia\n\n            - Ukraine\n\n###### 4\nActive FIN\nGroups\n\n###### 6\nActive APT\nGroups\nFrom These\n\n###### 11 Nation-States• China  \nFIN Groups(1 Graduated) **6**                    - Iran  • Vietnam\n\nActive APT\nGroups\n\n###### 652 I\nUNC Groups **41**\nIdentified APT Groups\n\n(75 Merged)\n\n###### 1900+\nTotal Groups\n\n**Tracked**\n\n[1. FireEye (December 17, 2020). DebUNCing Attribution: How Mandiant Tracks Uncategorized Threat](https://www.fireeye.com/blog/products-and-services/2020/12/how-mandiant-tracks-uncategorized-threat-actors.)\n[Actors.](https://www.fireeye.com/blog/products-and-services/2020/12/how-mandiant-tracks-uncategorized-threat-actors.)\n\n\n###### 2\nActive FIN Groups\nFrom These Geolocations\n\n                                        - Russia\n\n                                       - Ukraine\n\n###### 4\n 55 Active FIN\nActive UNC Groups\nFrom These Groups **6**\nGeolocations Active APT\n\n         - China Groups\n\n          - Iran From These\n\n              - North Korea• Nigeria Active UNC 236 **11** Nation-States• China\n\n           - Sweden• Russia Groups FIN Groups(1 Graduated) **6Active APT**            - Iran  • Vietnam\n\n      - Switzerland Groups\n\n      - Slovenia\n\n     - Uganda\n\n        - Vietnam• Ukraine UNC Groups 652 **I** **41**\n\nIdentified APT Groups\nin 2020\n(75 Merged)\n\n###### 1900+\n\n\n-----\n\nNewly Tracked\nMalware Families\n\nNewly Tracked\nand Observed\nMalware Families\n\n\n###### Malware\n\nMandiant continually expands its knowledgebase of malware families based\non insights gained from frontline Mandiant investigations, public reporting,\ninformation sharing and other research. In 2020, Mandiant began tracking more\nthan 500 new malware families. This is on par with the number of newly tracked\nmalware families compared to the previous year.\n\n\n294 Observed\n\nMalware Families Mandiant responds to hundreds of diverse intrusions each year where adversaries\n\nprovide organizations with unique challenges. In 2020, Mandiant experts observed\n294 distinct malware families in use during investigations into compromised\nenvironments. Of the nearly 300 malware families observed by Mandiant experts\nduring intrusions, 144 were malware families which Mandiant began tracking in\n2020. Adversaries not only use established malware but also continue to innovate\n**A malware family is**\na program or set of and adapt to be effective in victim environments.\nassociated programs\nwith sufficient “code\noverlap” among the\nmembers that Mandiant\nconsiders them to\nbe the same thing,\na “family”. The term\nfamily broadens the\nscope of a single piece\nof malware as it can\nbe altered over time,\nwhich in turn creates\nnew, but fundamentally\noverlapping pieces of\nmalware.\n\n\n-----\n\n**A malware category**\ndescribes a malware\nfamily’s primary purpose.\nEach malware family\nis assigned only one\ncategory that best\ndescribes its primary\npurpose, regardless if\nit has functionality for\nmore than one category.\n\n\n###### Malware Families by Category \nThe malware category distribution remains relatively consistent year over year.\nOf the 514 newly tracked malware families in 2020, the top five categories\nwere backdoors (36%), downloaders (16%), droppers (8%), launchers (7%) and\nransomware (5%).\n\n\n**Malware category** **Primary purpose**\n\n**Backdoor** A program whose primary purpose is to allow a threat actor to\ninteractively issue commands to the system on which it is installed.\n\n**Credential Stealer** A utility whose primary purpose is to access, copy or steal authentication\ncredentials.\n\n**Downloader** A program whose sole purpose is to download (and perhaps launch) a file\nfrom a specified address, and which does not provide any additional\nfunctionality or support any other interactive commands.\n\n**Dropper** A program whose primary purpose is to extract, install and potentially\nlaunch or execute one or more files.\n\n**Launcher** A program whose primary purpose is to launch one or more files. Differs\nfrom a dropper or an installer in that it does not contain or configure the\n\nfile, but merely executes or loads it.\n\n**Ransomware** A program whose primary purpose is to perform some malicious action\n(such as encrypting data), with the goal of extracting payment from the\nvictim in order to avoid or undo the malicious action.\n\n**Other** Includes all other malware categories such as utilities, keyloggers, point of\nsale (POS), tunnelers and data miners.\n\n\n###### NEWLY TRACKED MALWARE FAMILIES BY CATEGORY, 2020\n\n25%\n\nOther\n\nLauncher 4%\n\n5%\n\nRansomware\n\n7%\n\nCredential Stealer 8%\n\nDropper\n\n\n-----\n\n**An observed malware**\n**family is a malware**\nfamily identified during\nan investigation by\nMandiant experts.\n\n\n###### Observed Malware Families by Category \nBackdoors are a mainstay for adversaries and consistently comprise the largest\nmalware family category observed during investigations. Mandiant experts\nobserved that attackers deployed at least one backdoor in more than half of the\nintrusions investigated. Of the 294 malware families observed in 2020, the top five\ncategories were backdoors (41%), downloaders (9%), droppers (9%), ransomware\n(8%) and launchers (6%).\n\n\n###### OBSERVED MALWARE FAMILIES BY CATEGORY, 2020\n\nOther 22%\n\nCredential Stealer 4%\n\n6%\n\nRansomware\n\n\nBackdoor\n\nDownloader\n\n\n-----\n\n###### Newly Tracked Malware Families by Availability\nMandiant experts observed that 81% of newly tracked malware families were\nnon-public whereas 19% were publicly available. While adversaries do use publicly\navailable tools and code, the majority of malware families tracked were likely\nprivately developed or their availability is restricted.\n\n###### NEWLY TRACKED MALWARE FAMILIES BY AVAILABILITY, 2020\n\n**A publicly available tool** 19% Public\n**or code family is readily**\nobtainable without\nrestriction. This includes\ntools that are freely\navailable on the Internet,\nas well as tools that\nare sold or purchased,\nas long as they can be\npurchased by any buyer.\n\n81%\n\nNon-public\n\n**A non-public tool or**\n**code family is, to the**\nbest of our knowledge,\nnot publicly available\n(either for free or for\nsale). They may include\ntools that are privately\ndeveloped, held or used,\nas well as tools that are\nshared among or sold\nto a restricted set of\ncustomers.\n\n\n-----\n\n###### Observed Malware Families by Availability\nSimilar to the availability for newly tracked malware families, in 2020, Mandiant\nexperts observed that 78% of malware families used by adversaries during an\nintrusion were non-public and 22% were publicly available.\n\n###### OBSERVED MALWARE FAMILIES BY AVAILABILITY, 2020\n\nPublic\n\n22%\n\n78%\n\nNon-public\n\n\n-----\n\n###### Most Frequently Seen Malware Families \nThe top five malware families seen most frequently during intrusions investigated\nby Mandiant experts were BEACON, EMPIRE, MAZE, NETWALKER, and\nMETASPLOIT. BEACON was so prevalent in 2020 that it was observed at nearly a\nquarter of all the intrusions Mandiant investigated. Mandiant experts also observed\na lack of cross-pollination with respect to the malware used across incidents.\nJust 3.4% of malware families seen during an intrusion were observed at 10 or\nmore intrusions, and 70% percent of malware families seen were only observed\nduring a single intrusion.\n\n\n###### MOST FREQUENTLY SEEN MALWARE FAMILIES, 2020\n\n**25**\n\n**24%**\n\n**20**\n\n**15**\n\n**10**\n\n\n**5**\n\n**0**\n\n\nBEACON\n\n\nEMPIRE MAZE NETWALKER METASPLOIT\n\n\n**0**\n\n\n\n**•** **BEACON is a backdoor that is commercially available as part of the Cobalt Strike**\nsoftware platform and commonly used for pen-testing network environments.\nThe malware supports several capabilities, such as injecting and executing\narbitrary code, uploading and downloading files and executing shell commands.\nMandiant has seen BEACON used by a wide range of named threat groups\nincluding APT19, APT32, APT40, APT41, FIN6, FIN7, FIN9 and FIN11, as well as\nnearly 300 UNC groups.\n\n**•** **EMPIRE is a publicly available PowerShell post-exploitation framework that**\nallows users to run PowerShell agents without the use of powershell.exe.\nPowerShell Empire also allows actors to run various types of post-exploitation\nmodules and make adaptable communications while evading detection.\nMandiant experts track 90 threat groups that have utilized EMPIRE including\nAPT19, APT33, FIN10, FIN11 and 86 UNC Groups.\n\n\n\n**•** **MAZE is a ransomware family that encrypts files stored locally and on network**\nshares. MAZE can be configured to infect remote and removable drives as well as\nsend basic system information via HTTP. Mandiant has observed a dozen distinct\nfinancially motivated threat groups leverage MAZE ransomware.\n\n**•** **NETWALKER ia ransomware family capable of deleting volume shadow copies**\nand encrypting files on a victim host and any mapped network drives using\na combination of SALSA20 and Curve25519 encryption algorithms. Mandiant\ntracks eight threat groups that have used NETWALKER ransomware to further\ntheir monetary end goals.\n\n\n\n**•** **METASPLOIT is a penetration testing platform that enables users to find, exploit,**\nand validate vulnerabilities. Mandiant has seen METASPLOIT used by APT40,\nAPT41, FIN6, FIN7, FIN11 and 40 UNC groups with end goals ranging from\nespionage and financial gain to penetration testing\n\n\n-----\n\nThe operating system\n**effectiveness of a malware**\nfamily is the operating\nsystem(s) that the malware\ncan be used against.\n\n\n###### Operating System Effectiveness \nIn keeping with previous trends, the majority of newly tracked malware families\nwere effective on Windows. Only 8% and 3% of newly tracked malware families\nwere effective on Linux and MacOS, respectively.\n\n\n###### EFFECTIVENESS OF NEWLY TRACKED MALWARE FAMILIES BY OPERATING SYSTEM, 2020\n\n94% Windows Effective\n\n89% Windows Only\n\n8% Linux Effective\n\n3% Linux Only\n\n###### 514\nNewly Tracked\nMalware\nFamilies\n\n3% MacOS Effective\n\n1% MacOS Only\n\nSimilar to trends seen for newly tracked malware families, the majority of malware\nfamilies observed during Mandiant investigations were effective on Windows.\nMalware effective on Linux and MacOS was also observed but accounted for only\n13% and 5% of malware families, respectively.\n\n###### EFFECTIVENESS OF OBSERVED MALWARE FAMILIES BY OPERATING SYSTEM, 2020\n\n95% Windows Effective\n\n86% Windows Only\n\n13% Linux Effective\n\n4% Linux Only\n\n###### 294\nObserved\nMalware\nFamilies\n\n5% MacOS Effective\n\n0% MacOS Only\n\n\n-----\n\n**MITRE ATT&CK® is a**\nglobally-accessible\nknowledge base of\nadversary tactics and\ntechniques based on\nreal-world observations.\nThe ATT&CK knowledge\nbase is used as a\nfoundation for the\ndevelopment of\nspecific threat models\nand methodologies\nin the private sector,\ngovernment and the\ncyber security product\nand service community.\n\n\n###### Threat Techniques\n\nMandiant continues to support community and industry efforts by mapping its\nfindings to the MITRE ATT&CK framework. In 2020, significant changes were made\nto the MITRE ATT&CK framework with the introduction of sub-techniques and the\nincorporation of PRE-ATT&CK in Enterprise ATT&CK. Due in part to these changes\nand the continued refinement of its data model, Mandiant now has MITRE ATT&CK\ntechniques mapped to more than 1800 Mandiant techniques and subsequent\nfindings.\n\nWhen making security decisions, organizations must consider the likelihood of\nspecific techniques being used during an intrusion. In 2020, Mandiant experts\nobserved attackers use 63% of MITRE ATT&CK techniques and 24% of subtechniques. However, only 37% of the techniques observed (23% of all techniques)\nwere seen in more than 5% of intrusions.\n\nIn more than half of the intrusions investigated in 2020, Mandiant observed\nthat adversaries used obfuscation, such as encryption or encoding, on files or\ninformation to make detection and subsequent analysis more difficult (T1027).\nAdversaries regularly used a command or scripting interpreter to further intrusions\n(T1059) and 80% of those cases involved the use of PowerShell (T1059.001).\nSystem services (T1569) were also a popular execution method, represented in 31%\nof intrusions, all of which used Windows services (T1569.002). Adversaries also\nused Remote Services (T1021) to further intrusions, with 88% of those using the\nRemote Desktop Protocol (T1021.001). Adversaries often take advantage of what is\navailable in a victim’s environment; this tendency is highlighted by how frequently\nadversaries used PowerShell, Windows services and Remote Desktop.\n\n\n###### MITRE ATT&CK TECHNIQUES USED MOST FREQUENTLY, 2020\n\n\nObserved in\nMandiant Investigations\n\nSeen in More Than\n5% of Intrusions\n\n\n-----\n\n###### FREQUENTLY TARGETED TECHNOLOGIES, 2020\n\n88% Remote Desktop Protocol (T1021.001)\n\n\nUsed in 25% of all intrusions\n\n100% Windows services (T1569.002)\n\n\nUsed in 31% of all intrusions\n\n80% PowerShell (T1059.001)\n\nUsed in 41% of all intrusions\n\n\nfor intrusions using remote services (T1021)\n\nfor intrusions using system services (T1569)\n\nfor intrusions using command or scripting interpreter (T1059)\n\n\n-----\n\n###### MITRE ATT&CK TECHNIQUES RELATED TO ATTACK LIFECYCLE, 2020\n\n\nInitial Reconnaissance\n\nReconnaissance\n\nT1595: Active Scanning 0.2%\n\nResource Development\n\n\nInitial Compromise\n\n\nInitial Access\n\n|T1595: Active Scanning 0.2%|Col2|\n|---|---|\n\n|T1588: Obtain Capabilities 21.3%|T1588.003: Code Signing 21.0% Certificates|\n|---|---|\n|T1583: Acquire 7.8% Infrastructure|T1583.003: Virtual Private 7.8% Server|\n|T1584: Compromise 5.1% Infrastructure||\n|T1587: Develop 1.2% Capabilities|T1587.003: Digital 1.2% Certificates|\n\n|T1190: Exploit Public- 21.0% Facing Application T1566: Phishing 14.2%|Col2|\n|---|---|\n||T1566.001: Spearphishing 8.1% Attachment|\n||T1566.002: Spearphishing 7.1% Link|\n||T1566.003: 0.5% Spearphishing via Service|\n|T1133: External Remote 11.5% Services||\n|T1078: Valid Accounts 6.8%||\n|T1199: Trusted 3.2% Relationship||\n|T1189: Drive-by 1.5% Compromise||\n|T1091: Replication 0.5% Through Removable Media||\n|T1195: Supply Chain 0.5% Compromise|T1195.002: Compromise 0.5% Software Supply Chain|\n|T1200: Hardware 0.5% Additions||\n\n\nMandiant Attack Lifecycle\n\nMITRE ATT&CK Framework\n\n20+\n10–19.99\n5–9.99\n2–4.99\n0–1.99\n\n\n-----\n\nEstablish Foothold\n\n\nEscalate Privileges\n\n\nPersistence\n\n\nPrivilege Escalation\n\n|T1053: Scheduled Task/ 15.2% Job|T1053.005: Scheduled 6.6% Task|\n|---|---|\n|T1505: Server Software 12.2% Component|T1505.003: Web Shell 12.2%|\n|T1133: External Remote 11.5% Services||\n|T1098: Account 9.0% Manipulation||\n|T1543: Create or Modify 9.0% System Process|T1543.003: Windows 9.0% Service|\n|T1078: Valid Accounts 6.8%||\n|T1136: Create Account 6.1%|T1136.001: Local Account 0.2%|\n||T1136.002: Domain 0.2% Account|\n|T1547: Boot or Logon 4.2% Autostart Execution|T1547.001: Registry Run 4.2% Keys /Startup Folder|\n||T1547.009: Shortcut 0.2% Modification|\n|T1546: Event Triggered 3.2% Execution|T1546.008: Accessibility 1.2% Features|\n||T1546.011: Application 1.2% Shimming|\n||T1546.003: Windows 0.7% Management Instrumentation Event Subscription|\n|T1574: Hijack Execution 3.2% Flow|T1574.001: DLL Search 2.4% Order Hijacking|\n||T1574.002: DLL Side- 2.4% Loading|\n||T1574.008: Path 0.2% Interception by Search Order Hijacking|\n|T1197: BITS Jobs 0.7%||\n|T1542: Pre-OS Boot 0.2%|T1542.003: Bootkit 0.2%|\n|||\n|||\n\n|T1055: Process Injection 18.1%|T1055.003: Thread 1.0% Execution Hijacking|\n|---|---|\n||T1055.012: Process 0.5% Hollowing|\n|T1053: Scheduled Task/ 15.2% Job|T1053.005: Scheduled 6.6% Task|\n|T1543: Create or Modify 9.0% System Process|T1543.003: Windows 9.0% Service|\n|T1078: Valid Accounts 6.8%||\n|T1134: Access Token 5.9% Manipulation|T1134.001: Token 0.2% Impersonation/Theft|\n|T1547: Boot or Logon 4.2% Autostart Execution|T1547.001: Registry Run 4.2% Keys / Startup Folder|\n||T1547.009: Shortcut 0.2% Modification|\n|T1546: Event Triggered 3.2% Execution|T1546.008: Accessibility 1.2% Features|\n||T1546.011: Application 1.2% Shimming|\n||T1546.003: Windows 0.7% Management Instrumentation Event Subscription|\n|T1574: Hijack Execution 3.2% Flow|T1574.001: DLL Search 2.4% Order Hijacking|\n||T1574.002: DLL Side- 2.4% Loading|\n||T1574.008: Path 0.2% Interception by Search Order Hijacking|\n|T1548: Abuse Elevation 0.7% Control Mechanism|T1548.002: Bypass User 0.5% Account Control|\n||T1548.001: Setuid and 0.2% Setgid|\n|T1068: Exploitation for 0.2% Privilege Escalation||\n|T1484: Domain Policy 0.2% Modification|T1484.001: Group Policy 0.2% Modification|\n|||\n\n\n-----\n\n|Lateral Movement Internal Reconnaissance|Col2|Col3|\n|---|---|---|\n|Discovery Lateral Movement|||\n|T1082: System 24.2% Information Discovery|T1021: Remote Services 28.4% T1497.001: System 1.5% Checks T1091: Replication 0.5% Through Removable Media|T1021.001: Remote 24.9% Desktop Protocol|\n|T1083: File and Directory 21.8% Discovery||T1021.002: SMB/ 3.9% Windows Admin Shares|\n|T1012: Query Registry 13.0%||T1021.004: SSH 3.2%|\n|T1016: System Network 13.0% Configuration Discovery|||\n|||T1021.006: Windows 1.0% Remote Management|\n|T1497: Virtualization/ 12.7% Sandbox Evasion|||\n|||T1021.003: Distributed 0.2% Component Object Model|\n|T1057: Process 12.0% Discovery|||\n||||\n|T1518: Software 11.5% Discovery|||\n|T1033: System Owner/ 9.8% User Discovery|T1550: Use Alternate 0.5% Authentication Material|T1550.002: Pass the 0.2% Hash|\n|T1049: System Network 5.4% Connections Discovery||T1550.003: Pass the 0.2% Ticket|\n|T1007: System Service 4.9% Discovery|T1563: Remote Service 0.5% Session Hijacking|T1563.002: RDP 0.2% Hijacking|\n|T1482: Domain Trust 4.9% Discovery|T1534: Internal 0.2% Spearphishing||\n|T1087: Account Discovery 4.2%|T1087.004: Cloud 0.2% Account T1087.002: Domain 0.2% Account T1069.003: Cloud 0.2% Groups||\n|T1010: Application 2.4% Window Discovery|||\n|T1069: Permission 2.4% Groups Discovery|||\n|T1046: Network Service 1.7% Scanning|||\n|T1124: System Time 1.0% Discovery T1018: Remote System 0.2% Discovery T1135: Network Share 0.2% Discovery T1217: Browser 0.2% Bookmark Discovery T1538: Cloud Service 0.2% Dashboard T1580: Cloud 0.2% Infrastructure Discovery|||\n\n\n-----\n\nMaintain Persistence\n\n\nMission Completion\n\n\nPersistence\n\n\nCollection\n\n|T1560: Archive Collected 15.2% Data|T1560.001: Archive via 3.4% Utility|\n|---|---|\n||T1560.002: Archive via 1.5% Library|\n|T1056: Input Capture 4.9%|T1056.001: Keylogging 4.9%|\n|T1213: Data from 4.2% Information Repositories|T1213.002: Sharepoint 0.2%|\n|T1113: Screen Capture 3.2%||\n|T1114: Email Collection 3.2%|T1114.003: Email 1.5% Forwarding Rule|\n|T1115: Clipboard Data 2.7%||\n|T1530: Data from Cloud 0.5% Storage Object||\n|T1074: Data Staged 0.2%||\n|T1123: Audio Capture 0.2%||\n|T1125: Video Capture 0.2%||\n\n\nExfiltration\n\n0.2%\n\nImpact\n\n|T1567: Exfiltration Over 0.2% Web Service|Col2|\n|---|---|\n\n|T1053: Scheduled Task/ 15.2% Job|T1053.005: Scheduled 6.6% Task|\n|---|---|\n|T1505: Server Software 12.2% Component|T1505.003: Web Shell 12.2%|\n|T1133: External Remote 11.5% Services||\n|T1098: Account 9.0% Manipulation||\n|T1543: Create or Modify 9.0% System Process|T1543.003: Windows 9.0% Service|\n|T1078: Valid Accounts 6.8%||\n|T1136: Create Account 6.1%|T1136.001: Local Account 0.2%|\n||T1136.002: Domain 0.2% Account|\n|T1547: Boot or Logon 4.2% Autostart Execution|T1547.001: Registry Run 4.2% Keys /Startup Folder|\n||T1547.009: Shortcut 0.2% Modification|\n|T1546: Event Triggered 3.2% Execution|T1546.008: Accessibility 1.2% Features|\n||T1546.011: Application 1.2% Shimming|\n||T1546.003: Windows 0.7% Management Instrumentation Event Subscription|\n|T1574: Hijack Execution 3.2% Flow|T1574.001: DLL Search 2.4% Order Hijacking|\n||T1574.002: DLL Side- 2.4% Loading|\n||T1574.008: Path 0.2% Interception by Search Order Hijacking|\n|T1197: BITS Jobs 0.7%||\n|T1542: Pre-OS Boot 0.2%|T1542.003: Bootkit 0.2%|\n\n|T1489: Service Stop 13.4%|Col2|\n|---|---|\n|T1529: System 3.2% Shutdown/Reboot||\n|T1490: Inhibit System 2.7% Recovery||\n|T1486: Data Encrypted 2.2% for Impact||\n|T1496: Resource 2.0% Hijacking||\n|T1565: Data 1.7% Manipulation|T1565.001: Stored Data 1.7% Manipulation|\n|T1531: Account Access 1.0% Removal||\n|T1491: Defacement 0.7%|T1491.002: External 0.7% Defacement|\n\n\n-----\n\n|Across the Lifecycle|Col2|Col3|Col4|\n|---|---|---|---|\n|Credential Access||Command and Control||\n|T1003: OS Credential 8.8% Dumping|T1003.001: LSASS 4.4% Memory|T1105: Ingress Tool 24.2% Transfer||\n||T1003.003: NTDS 3.4%|T1573: Encrypted 15.9% Channel|T1573.002: Asymmetric 15.9% Cryptography|\n||T1003.002: Security 0.7% Account Manager|T1095: Non-Application 13.0% Layer Protocol||\n||T1003.006: DCSync 0.2%|T1071: Application Layer 9.5% Protocol|T1071.001: Web 7.6% Protocols|\n||T1003.008: /etc/passwd 0.2% and /etc/shadow||T1071.004: DNS 1.7%|\n|T1110: Brute Force 6.1%|T1110.003: Password 2.0% Spraying||T1071.003: Mail 0.5% Protocols|\n||T1110.001: Password 1.2% Guessing||T1071.002: File Transfer 0.2% Protocols|\n|T1056: Input Capture 4.9%|T1056.001: Keylogging 4.9%|T1572: Protocol 5.4% Tunneling||\n|T1555: Credentials from 1.7% Password Stores|T1555.003: Credentials 1.0% from Web Browsers|T1090: Proxy 4.9%|T1090.003: Multi-hop 3.2% Proxy|\n|T1552: Unsecured 1.0% Credentials|T1552.004: Private Keys 0.5%||T1090.004: Domain 0.2% Fronting|\n||T1552.001: Credentials 0.2% In Files|T1102: Web Service 1.0%||\n|T1111: Two-Factor 0.7% Authentication Interception||T1219: Remote Access 0.7% Software||\n|T1558: Steal or Forge 0.7% Kerberos Tickets|T1558.003: 0.2% Kerberoasting|T1001: Data Obfuscation 0.2%||\n|T1187: Forced 0.2% Authentication||T1568: Dynamic 0.2% Resolution|T1568.002: Domain 0.2% Generation Algorithms|\n|T1539: Steal Web 0.2% Session Cookie||T1571: Non-Standard 0.2% Port||\n\n|Col1|Execution|Col3|\n|---|---|---|\n|T1059: Command and 51.3% Scripting Interpreter|T1059.001: PowerShell 40.8%||\n||T1059.003: Windows 15.4% Command Shell||\n||T1059.005: Visual Basic 5.9%||\n||T1059.007: JavaScript/ 2.7% JScript||\n||T1059.006: Python 1.0%||\n|T1569: System Services 30.6%|T1569.002: Service 30.6% Execution||\n|T1053: Scheduled Task/ 15.2% Job|T1053.005: Scheduled 6.6% Task||\n|T1204: User Execution 11.5%|T1204.001: Malicious 7.3% Link||\n||T1204.002: Malicious 4.2% File||\n|T1203: Exploitation for 4.9% Client Execution|||\n|T1047: Windows 2.7% Management Instrumentation|||\n|T1106: Native API 0.2%|||\n\n\n-----\n\n|Across the Lifecycle|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n\n|Col1|Defense|Evasion|Col4|\n|---|---|---|---|\n|T1027: Obfuscated Files 52.6% or Information|T1027.001: Binary 0.2% Padding|T1140: Deobfuscate/ 2.7% Decode Files or Information||\n||T1027.004: Compile 0.2% After Delivery|T1218: Signed Binary 2.4% Proxy Execution|T1218.010: Regsvr32 1.0%|\n||T1027.005: Indicator 1.0% Removal from Tools||T1218.002: Control Panel 0.5%|\n||T1027.002: Software 8.1% Packing||T1218.005: Mshta 0.5%|\n||T1027.003: 0.5% Steganography||T1218.003: CMSTP 0.2%|\n|T1070: Indicator 24.4% Removal on Host|T1070.004: File Deletion 18.1%||T1218.011: Rundll32 0.2%|\n||T1070.006: Timestomp 5.9%|T1564: Hide Artifacts 2.2%|T1564.003: Hidden 2.0% Window|\n||T1070.001: Clear 4.2% Windows Event Logs||T1564.004: NTFS File 0.2% Attributes|\n||T1070.005: Network 1.2% Share Connection Removal|T1036: Masquerading 1.5%|T1036.003: Rename 0.7% System Utilities|\n|T1553: Subvert Trust 21.3% Controls|T1553.002: Code Signing 21.0%||T1036.001: Invalid Code 0.5% Signature|\n|T1055: Process Injection 18.1%|T1055.003: Thread 1.0% Execution Hijacking||T1036.005: Match 0.2% Legitimate Name or Location|\n||T1055.012: Process 0.5% Hollowing|T1480: Execution 1.5% Guardrails||\n|T1112: Modify Registry 15.6%||T1197: BITS Jobs 0.7%||\n|T1497: Virtualization/ 12.7% Sandbox Evasion|T1497.001: System 1.5% Checks|T1548: Abuse Elevation 0.7% Control Mechanism|T1548.002: Bypass User 0.5% Account Control|\n|T1562: Impair Defenses 9.8%|T1562.001: Disable or 5.9% Modify Tools||T1548.001: Setuid and 0.2% Setgid|\n||T1562.004: Disable or 5.1% Modify System Firewall|T1578: Modify Cloud 0.5% Compute Infrastructure|T1578.002: Create Cloud 0.5% Instance|\n||T1562.007: Disable or 0.2% Modify Cloud Firewall||T1578.003: Delete Cloud 0.2% Instance|\n|T1078: Valid Accounts 6.8%||T1550: Use Alternate 0.5% Authentication Material|T1550.002: Pass the 0.2% Hash|\n|T1134: Access Token 5.9% Manipulation|T1134.001: Token 0.2% Impersonation/Theft||T1550.003: Pass the 0.2% Ticket|\n|T1202: Indirect 3.7% Command Execution||T1127: Trusted Developer 0.2% Utilities Proxy Execution|T1127.001: MSBuild 0.2%|\n|T1574: Hijack Execution 3.2% Flow|T1574.001: DLL Search 2.4% Order Hijacking|T1211: Exploitation for 0.2% Defense Evasion||\n||T1574.002: DLL Side- 2.4% Loading|T1484: Domain Policy 0.2% Modification|T1484.001: Group Policy 0.2% Modification|\n||T1574.008: Path 0.2% Interception by Search Order Hijacking|T1542: Pre-OS Boot 0.2%|T1542.003: Bootkit 0.2%|\n\n\n-----\n\n### RANSOMWARE\n\n\n-----\n\n###### Ransomware Evolves  Into Multifaceted Extortion\n\n Our understanding of ransomware was appropriate for 2019 but the way ransomware attacks are conducted today has changed, resulting in different business consequences and different protections must be put in place. When business leaders and risk\nmanagers hear “ransomware,” they often envision scenarios of malware encrypting\nfiles, making them inaccessible to legitimate users, and ultimately resulting in\nsome level of business disruption. They also believe that the best protection\nagainst these sorts of attacks is solid offline backups. Now, however, the problem\nis fundamentally different, yet we still refer to the problem as ransomware. This\nmischaracterization does not serve organizations well and they are unprepared\nwhen an attack’s true nature is revealed in the midst of a real incident. To\nbetter confront and mitigate these incidents, Mandiant has adopted the term\n“multifaceted extortion” to characterize this evolved form of ransomware.\n\n\n-----\n\n###### 2.\n\n 3.\n\n 4.\n\n\n###### The Facets of Multifaceted Extortion\n\n Deployment of ransomware encryptors.\nThe target organization’s files are encrypted and made unavailable. The attacker\ndemands a payment for the decryption tool and key.\n\n###### Theft of sensitive data.\nThe organizations files are stolen and the attacker demands a payment not to\npublish the sensitive data. This extortion is much more consequential than the\nfirst and it may give the attacker more leverage. With a multifaceted extortion, the\nattacker turns a service disruption into a data breach. Data breaches may have\nmore serious business consequences than service disruptions. A data breach can\nresult in greater reputational damage, regulatory fines, class action lawsuits and\nderailed digital transformation initiatives. These consequences were typically not\nseen with traditional ransomware before 2019. Organizations may not expect such\nconsequences if they continue to think of modern multifaceted extortion attacks\nsimply as ransomware.\n\n###### Publication of stolen data on a “name-and-shame” website.\nMany multifaceted extortion threat actors operate such sites on the Tor network.\nThe actors may engage security and technology media organizations to amplify\ntheir attacks and attempt to coerce victims into paying.\n\nWith multifaceted extortion, in addition to deploying ransomware encryptors and\ndisrupting business operations, the threat actors steal data, publish it and shame\nvictims. Having good backups only addresses part of the problem.\n\n###### Additional coercive tactics.\nTo compel victims into paying extortion demands, threat actors have applied\npressure in various ways:\n\n- Convinced news and media organizations to write stories on victim security\nincidents\n\n- Called and harassed employees\n\n- Notified business partners of data theft, creating friction in relationships and\nprompting breach disclosures\n\n- Conducted distributed denial of service attacks to further disrupt operations\n\n###### Disruption and Brand Damage Due to Multifaceted Extortion\nMultifaceted extortion continues to be a leading concern for organizations as\nthreat actors evolve their technology and tradecraft in response to changes in the\nsecurity landscape. Mandiant has observed these actors trending away from purely\nopportunistic campaigns, which seek to maximize the volume of attacks, toward\ncampaigns which require greater complexity. Attacker behavior patterns have\nbegun to emerge which demonstrate adoption of tools, tactics and procedures\n(TTPs) which are more consistent with more advanced threat groups. As defense\ntechnology advances so do multifaceted extortion operators. The impetus to\nmaintain operations and increase monetary gains has forced these operators to\nadopt new techniques and even more dramatic extortion demands. While attacker\nobjectives remain consistent, their methods have evolved, leading to greater\nmonetary gains for threat actors and a growing population of threat groups\nseeking to replicate these successes.\n\n\n-----\n\nBeginning in November 2019 and increasing throughout 2020, Mandiant observed\nthreat actors combining ransomware operations with data theft extortion. During\nthese types of operations, malicious actors steal sensitive data before deploying\nransomware on the network and then threaten to release the stolen data if the\nransom is not paid. Actors use the release of sensitive data during negotiations\nto drive up the price of extortion and secure more timely payments from a victim\norganization. The exposure of data which triggers a notification requirement is\noften a major concern during an organization’s incident response process. While\nsome stolen sets of data would not trigger regulatory reaction, these actors would\noften prey upon the potential brand damage which could occur as a result in a loss\nof confidence and trust from partners and customers.\n\nHistorically, post-compromise ransomware actors have used data theft to obtain\ninformation that can expand their presence in a target network. However, they\nare now seeking additional types of data to support their extortion operations.\nAs ransomware operators evolve into multifaceted extortion operators they seek\naccess to sensitive information which can provide enhanced leverage during\nnegotiations, and the opportunities to detect them increase dramatically. Mandiant\nhas observed these operators steal a diverse set of data from target environments,\nincluding termination agreements, contracts, medical records and encryption\ncertificates. Depending on the organization’s degree of network segmentation,\naccess to the enclaves which would house these data types would require the use\nof multiple credentials across disparate systems. Each system introduces further\nopportunities for the attacker to be detected and evicted from the network prior\nto any theft of sensitive data or activation of encryption tools.\n\nMultifaceted extortion operators have used a wide range of tactics to increase\npressure on data theft victims. Operators of the MAZE ransomware threatened\nto use stolen data to conduct targeted spam campaigns while the operators of\nthe Ragnar Locker ransomware used Facebook ads to shame victims. The most\ncommon tactic was the creation and maintenance of name-and-shame sites\nwhere these operators would post data stolen from victims who refused to pay\nthe extortion. Analysis of the content available on various shaming websites\nfrom October 1, 2019 to September 30, 2020, highlights several trends among\nvictims; the data is obviously skewed toward those who chose not to acquiesce to\nextortion demands. There is a distinct upward trend in both the number of victims\nthat have appeared on these sites (Fig. 1) and the number of groups using this\nmethodology to pressure victims.\n\nThis method of combining ransomware and data theft has proven successful for\nseveral multifaceted extortion operations. Consequently, other threat actors have\nattempted to follow suit. MAZE operators started the shaming website trend\nin December 2019 and in February 2020, SODINOKIBI and DOPPELPAYEMER\nfollowed suit with their own versions of shaming websites. By March 2020, NEMTY,\nNEFILIM, CLOP, Sekhmet and m1x operators also started using shaming websites.\nSince then, there has been an average of at least one new shaming website each\nmonth through September 2020. Based on these shaming websites, media outlets\nand Mandiant incident response engagements, Mandiant Threat Intelligence has\nidentified more than 800 alleged multifaceted extortion victims who likely had\ndata stolen. This number has continued to grow steadily as more operators have\nstarted websites to support extortion demands and data publishing.\n\n\n-----\n\n**Figure 1.**\nPercentage of\nvictims from\nDecember 2019 to\nSeptember 2020.\n\n\n**30**\n\n**25**\n\n\n**20**\n\n**15**\n\n\n**10**\n\n**5**\n\n\n**0**\n\n\nDec\n2019\n\n\nJan Feb Mar April May Jun Jul Aug Sep\n2020\n\n\nMost of the victim organizations listed on shaming websites have been based in\nthe U.S. and spanned nearly every industry vertical, demonstrating the widespread\ntargeting basis of these operations. Based on available data, organizations within\nthe manufacturing sector have been impacted more than other industries. There\nare likely several contributing factors including the perception these organizations\nmay be more likely to pay to prevent monetary losses due to production\ndowntime and their overall cyber security posture relative to other sectors. Several\nransomware families have also been deployed alongside scripts with process kill\nlists for industrial processes. Other industries experiencing frequent multifaceted\nextortion attacks included professional services, retail, technology, financial\nservices, healthcare and construction and materials.\n\nOver the last few years, traditional malware based ransomware has evolved\ninto multifaceted extortion through repeated and deliberate operations costing\norganizations and governments millions of dollars. In response, many organizations\ntook steps to limit the potential impact of broad-scale encryption by ensuring their\ndisaster recovery plans included a similar scenario. However attacker-encrypted\nfiles is just one of many impacts victims face in a multifacted extortion incident.\nNew technologies and better visibility into the methodologies used by attack\ngroups have increased opportunities for early detection. As defensive security\nevolves and organizations continue to invest in a broader security position,\nattackers are guaranteed to modify their operations to keep pace with those\nchanges. Until multifaceted extortion operations can be reliably interrupted\nthrough legal and policy changes, the burden of their effects will continue to fall on\norganizations and the security teams which support them.\n\n\n-----\n\n###### Steps Toward Proactive Hardening Against Ransomware in Multiple Environments\n\n Given the surge of ransomware events observed throughout 2020 and into 2021, organizations must proactively ensure environments are hardened to mitigate the potential impact of ransomware deployment. After reviewing ransomware engagements\nsupported throughout 2020, Mandiant experts uncovered several actions\norganizations should prioritize to mitigate the risk of ransomware incidents. These\nactions would address several common issues observed, including:\n\n                           - Large numbers of highly privileged accounts in Active Directory\n\n                           - Highly privileged non-computer accounts configured with service principal\nnames (SPNs)\n\n                           - Security controls not configured to minimize the exposure and usage of\nprivileged accounts across endpoints\n\n                           - Attackers modifying Group Policy Objects (GPOs) for ransomware deployment\n\n###### Large Numbers of Highly Privileged Accounts in Active Directory\n\nWhen conducting initial reconnaissance within target environments, Mandiant\nexperts observed ransomware attackers “living off the land”: using native builtin tools (such as cmd.exe, PowerShell, WMI) to query information from Active\nDirectory. Attackers also often used open-source tools, such as AdFind and\nBloodHound, to identify privileged accounts and accounts that presented a path\nto Domain Admin.\n\nPrivileged accounts within Active Directory represent more than just accounts\nassigned membership in the built-in domain-based privileged groups (Domain\nAdmins, Enterprise Admins, Schema Admins, Administrators and Server\nOperators). Apart from the domain-based privileged groups, many organizations\nhave delegated permissions to additional groups and accounts throughout\nActive Directory, which significantly increases the number of resources deemed\n\n\n-----\n\n**Figure 2.**\nPowerShell\ncommand to\nidentify noncomputer accounts\nassigned an SPN.\n\n\nto be highly privileged. If an attacker is able to capture valid credentials or even\nimpersonate access from an account assigned privileged access, this can escalate\nthe attacker’s ability to move laterally, access data and deploy ransomware to\nmany endpoints.\n\nOrganizations should proactively review Active Directory for accounts resident in\nthe default domain-based privileged groups as well as accounts which:\n\n- Have been delegated permissions at the root of the domain–including\npermissions for DS-Replication-Get-Changes and DS-Replication-Get-ChangesAll (which can be used to initiate a DCSync attack)\n\n- Have been explicitly assigned elevated permissions on domain controllers\n\n- Have been delegated explicit permissions for organizational units (OUs) that\ncontain many computer and user objects\n\n- Have local administrative permissions on many endpoints\n\n- Are configured for unconstrained or constrained Kerberos delegation\n\n- Are not configured to protect against delegation (not members of the Protected\nUsers Security Group – or do not have the “Sensitive and Cannot Be Delegated”\nattribute configured)\n\n- Are protected by AdminSDHolder\n\n- Have the ability to edit, link or unlink Group Policy Objects (GPOs)\n\n- Have the ability to change passwords for many accounts (User-Force-ChangePassword permissions)\n\n- Have user rights assignment permissions configured in Group Policy that permit\nremote logon capabilities to a large scope of endpoints\n\n###### Highly Privileged Non-Computer Accounts Configured with Service Principal Names (SPNs)\n\nService principal names (SPNs) are legitimately used by Active Directory to\nidentify unique service instances with service logon accounts for Kerberos\nauthentication. Non-computer accounts configured with an SPN represent\naccounts that ransomware attackers will initially target for Kerberoasting.[1] If an\naccount’s password can be brute-forced using the Kerberoasting technique, an\nattacker can potentially use the account for lateral movement, privilege escalation\nand ransomware staging and deployment. Unfortunately, many organizations have\nhighly privileged accounts configured with an SPN, which makes this attack-path\nhighly successful.\n\nOrganizations can proactively review the scope of accounts configured with an\nSPN using PowerShell. (Fig 2.)\n\nget-aduser -filter {(ServicePrincipalName -like “*”)}\n\n2. The MITRE Corporation (2015-2021). Steal or Forge Kerberos Tickets: Kerberoasting\n\n\n-----\n\nNon-computer accounts configured with an SPN are expected to exist within\nActive Directory since some service accounts will likely have this configuration.\nOrganizations should prioritize permissions assigned to these accounts and ensure\nenforcement of security controls to minimize privileges and lateral movement\ncapabilities.\n\n###### Security Controls Not Configured to Minimize the Exposure and Usage of Privileged Accounts Across Endpoints\n\nWhen endpoint security controls were not configured to minimize the exposure of\nprivileged accounts, ransomware attackers were able to capture valid credentials\nfrom memory to expand the scope of their access. The recent Mandiant white\npaper, Ransomware Protection and Containment Strategies[3], recommends several\nproactive hardening measures to protect privileged accounts:\n\n- Use the Protected Users security group to house non-service privileged\naccounts.\n\n- Disable methods that store clear-text credentials in memory on endpoints (such\nas WDigest and Windows Credential Manager). This also includes using a Group\nPolicy configuration to automatically reapply these settings if they were to be\nmodified on the local endpoint by an attacker.\n\n- Enforce Credential Guard and Remote Credential Guard on Windows 10 and\nWindows Server 2016+ endpoints. For older endpoints, Restricted Admin Mode\nshould be used when remote desktop connections are initiated using privileged\naccounts.\n\n- Use Microsoft LAPSx[4] or other third-party tools to randomize the password for\nthe built-in local administrator account on endpoints.\n\n- Implement a tiered model to guide enforcement of guardrails that define where\nand how privileged accounts can be used. Guardrail enforcement can be defined\nwithin Group Policy Objects (GPOs) or when using authentication silos.\n\n- Ensure privileged actions are only initiated from dedicated privileged access\nworkstations (PAWs) or jump boxes.\n\n- Protect privileged accounts against delegation (such as “Sensitive and Cannot\nBe Delegated” enforcement).\n\n- Enforce the Windows Firewall to restrict protocols which could be used for\nlateral movement, remote access and ransomware deployment across endpoints.\n\n- Restrict the scope of accounts and groups where permissions are configured\nto allow lateral movement across endpoints. Specifically, privileged accounts\nshould be denied the ability to logon to Tier 1 and Tier 2 endpoints (with local or\nGroup Policy settings):\n\n– Deny access to this computer from the network (SeDenyNetworkLogonRight)\n\n– Deny log on through Remote Desktop Services\n(SeDenyRemoteInteractiveLogonRight)\n\n– Deny log on locally (SeDenyInteractiveLogonRight)\n\n– Deny log on as a service (SeDenyServiceLogonRight)\n\n[3. FireEye (2020). Ransomware Protection and Containment Strategies.](https://www.fireeye.com/content/dam/fireeye-www/current-threats/pdfs/wp-ransomware-protection-and-containment-strategies.pdf)\n[4. Microsoft (2021). Microsoft Local Administrator Password Solution (LAPS).](https://www.microsoft.com/en-us/download/details.aspx?id=46899)\n\n\n-----\n\n- Restrict the scope of accounts and groups where permissions could be used for\nprivilege escalation and data access, including assigned user rights that provide\ncapabilities to:\n\n– Debug programs (SeDebugPrivilege)\n\n– Back up files and directories (SeBackupPrivilege)\n\n– Restore files and directories (SeRestorePrivilege)\n\n– Take ownership of files or other objects (SeTakeOwnershipPrivilege)\n\n###### Attackers Modifying Group Policy Objects (GPOs) for Ransomware Deployment\n\nGroup policy was a common method used by attackers to deploy ransomware\nto many endpoints. After compromising an account with GPO edit permissions,\nattackers commonly targeted GPOs which were linked at the root of the domain\n(such as Default Domain Policy), and then added scheduled tasks, logon scripts or\nsoftware installation packages to mass deploy and execute encryptors.\n\nOrganizations should proactively review Active Directory to enumerate accounts\nwith the ability to edit existing GPOs. Additionally, organizations should identify\nwhich accounts can link and unlink GPOs within the domain.\n\nA recently-published Mandiant white paper[5] details specific command references\nfor reviewing GPO permissions as well as strategies for monitoring event logs to\ndetect GPO creations and modifications.\n\n[5. FireEye (2020). Ransomware Protection and Containment Strategies.](https://www.fireeye.com/content/dam/fireeye-www/current-threats/pdfs/wp-ransomware-protection-and-containment-strategies.pdf)\n\n\n-----\n\n###### Recovery and Reconstitution Challenges in Post-Ransomware Scenarios\n\n Following a ransomware attack, sustained business operations are predicated on an organization’s ability to restore and reconstitute systems, data and access in a secure manner.\n\nIdeally, recovery and reconstitution should run parallel to the investigation into\nhow an attacker was able to gain access, move laterally, steal data (if applicable)\nand deploy ransomware. If recovery and reconstitution steps are not performed\nsecurely, an attacker will likely maintain their access, resulting in continued risk,\nextended downtime and future attacks.\n\n###### Investigative Steps to Empower recovery and Reconstitution\n\nMandiant experts noted that organizations that led successful recovery and\nreconstitution efforts were empowered by facts and evidence identified from\ninvestigating the ransomware incident prior to taking action. To ensure a secure\nrecovery and reconstitution plan when responding to ransomware incidents,\nMandiant experts prioritize answering the following questions:\n\n                           - What persistence mechanisms (backdoors) are being used by an attacker to\nmaintain access within the environment?\n\n                           - What command-and-control (CnC) channels are being used by an attacker for\naccess that need to be blocked either at ingress and egress points, or using\nhost-based endpoint firewalls?\n\n                           - How was the ransomware deployed (manual propagation using a tool such as\nPsExec, group policy modification, scheduled tasks or logon script)?\n\n                           - Can the ransomware propagation vector be stopped and contained?\n\n                           - Which compromised accounts can be used for lateral movement and\nransomware deployment?\n\n\n-----\n\n- Which endpoints still exhibit a running encryptor?\n\n- What was the primary vector used for initial access?\n\n- Which accounts have privileged access within the environment?\n\nAs specific facts are uncovered and correlated, proper isolation and hardening\nsteps must be aligned to recovery and reconstitution workstreams. Until specific\ninvestigative information about the ransomware event is understood (primary\npersistence methods and backdoors, CnC channels, ransomware propagation\nmechanisms and scope of compromised accounts), an organization may be forced\nto temporarily disconnect access from the Internet to begin triaging, reviewing and\nsecurely planning for hardening and recovery.\n\n###### Use of Secure Enclaves\n\nOrganizations that were able to successfully recover and reestablish operations\nused processes that included the use of secure enclaves (such as VLANs) to safely\nrestore and reconstitute systems. Initially, systems housed within the enclaves were\nrestricted from communicating with most impacted systems and were designated\nas a clean (green) source of trust and security within the environment.\n\nSystems within the enclaves were only permitted to communicate with trusted\nendpoints and security (EDR) tools and with investigative tools used to ensure\nthe endpoints were not exhibiting signs of active encryptors or other malicious\nactivity.\n\nRestored or newly-built domain controllers were usually the first endpoints\nestablished within the secure enclaves and connectivity to additional endpoints\nwas expanded once the initial ransomware outbreak had been successfully\ncontained.\n\n###### Common Contributors to a Degraded Recovery and  Reconstitution Workstream\n\n Active Directory Lock-Out\nThroughout 2020, Mandiant observed attackers not only deploying ransomware\nwithin victim environments but also locking out administrators from Active\nDirectory. Even if domain controllers were operational, after an attacker\nobtained domain administrative privileges, they changed the passwords for valid\nadministrator accounts. As a result, organizations were unable to regain access and\nsubsequent control within Active Directory to begin recovery and reconstitution\nactions. To regain access to Active Directory, organizations often had to boot a\ndomain controller from physical media and replace the Utility Manager binary\n(utilman.exe) with cmd.exe. Consequently, when the user clicked on Utility\nManager (on the login screen) they actually launched a command prompt from\nwhich a new password could be set for a known account.\n\n\n-----\n\n###### Domain Controller Restoration Challenges\nWhen ransomware is deployed within an environment, domain authentication and\nthe ability to connect to domain-based resources are generally impacted. To begin\nrecovery and reconstitution efforts, most organizations will prioritize restoring\ndomain controllers to an operational state. Unfortunately, when domain controller\nbackups are unavailable or have been corrupted, organizations may be faced with\nrebuilding their domain infrastructure.\n\nThe corruption of SYSVOL is often one of the main factors resulting in domain\nauthentication and domain services being unavailable. SYSVOL refers to a set of\nfolders and files that are present and replicated amongst each domain controller.\nWhen the contents of SYSVOL (which include group policy templates and settings\nas well as scripts) are either encrypted or corrupted and replication occurs,\nthe contents cascade to all domain controllers and impact domain operations.\nWithout timely backups, rebuilding and reconstituting SYSVOL can be a complex\nprocess. To avoid having to rebuild SYSVOL entirely, organizations should ensure\nbackup processes include system state backups of domain controllers. If system\nstate backups are not possible, organizations should at least back up the SYSVOL\ndirectory and data tree (%SYSTEMROOT%\\SYSVOL) as well as the Active\nDirectory database (%SYSTEMROOT%\\ntds\\ntds.dit). Ideally, domain controller\nbackups should be stored and secured either offline or on storage clusters that\nare logically segmented and restricted from being directly accessed using\ndomain accounts.\n\nWhen restoring Active Directory from domain controller backups was the only\nviable option to reconstitute domain services, organizations first needed to\nensure they had a working and tested backup plan and strategy to guarantee the\navailability and integrity of the schema and domain services which needed to be\nreconstituted. The following domain controller recovery and reconstitution best\npractices should be proactively reviewed by the organization:\n\n- Offline backups—offline domain controller backups should be secured and\nstored separately from online backups.\n\n- Encryption—backup data should be encrypted both during transit (over the\nwire) and when at rest or mirrored for offsite storage.\n\n- DSRM Password validation—the Directory Services Restore Mode (DSRM)\npassword should be set to a known value for each domain controller. This\npassword is required when performing an authoritative or non-authoritative\ndomain controller restoration.\n\n- Alert configuration for backup operations—backup products and technologies\nshould be configured to detect and provide alerting for operations critical to\nthe availability and integrity of backup data (such as deletion of backup data,\npurging of backup metadata, restoration events and media errors).\n\n- Role-based access control—Access to backup media and the applications that\ngovern and manage data backups should use role-based access controls to\nrestrict accounts with access to stored data and configuration parameters.\n\n- Testing and verification—both authoritative and non-authoritative domain\ncontroller restoration processes should be documented and tested.\n\n\n-----\n\n###### Insufficient Backup and Restoration Processes\nOrganizations that lacked effective backup and restoration processes struggled\nto reestablish business operations in a timely manner. This resulted in extended\ndowntime, financial impacts, regulatory challenges and an overall impact to brand\nreputation. Many organizations were either unable to restore and reconstitute data\nto meet business operations requirements or had to fully rebuild core systems and\napplications, which further impacted business continuity.\n\nOrganizations that had effective backup and restoration processes were able to\nmobilize quickly and invoke secure restoration activities which ran in parallel to\nthe overall investigation and environment hardening workstreams. Examples of\neffective backup and restoration processes include:\n\n- Clear delineation of responsibility for managing and verifying data and\napplication backups.\n\n- Alignment of backup and restoration processes with business continuity and\ndisaster recovery plans.\n\n- Online and offline data backup retention policies, including initiation, frequency,\nverification and testing (for both on-premises and cloud-based data).\n\n- Backup infrastructure that was segmented within the environment and only\naccessible using dedicated accounts for interfacing with and managing backup\nplatforms and storage.\n\n- A well-defined understanding of crown jewels data and supporting applications\nwhich align to backup, failover and restoration tasks that prioritize missioncritical business operations.\n\n- Role-based access control that restricts the scope of accounts with access to\nbackup media and the applications that govern and manage data backups, as\nwell as stored data and configuration parameters.\n\n- Training and validation exercises for failover and restoration tasks that focuses\nnot only on data, but also crown jewel applications and services.\n\n- Established service level agreements (SLAs) with vendors to prioritize\napplication and infrastructure-focused support.\n\n###### Summary\n\nRansomware resiliency defenses encompass a combination of technical and\nprocess-oriented controls. When organizations are unprepared, the impact can\nbe time-consuming and costly. Throughout 2020, Mandiant worked with many\norganizations to proactively review, test, and enhance defenses to combat\nransomware. While challenges remain, applying best practices can go a long way\ntowards realizing robust recovery and reconstitution efforts.\n\n\n-----\n\n### NEWLY NAMED THREAT GROUPS\n\n\n-----\n\n###### FIN11\n\n FireEye tracks thousands of threat actors and pays attention to groups that carry out repeated intrusions across organizations. Such groups often pursue their objectives over longer periods, typically months or years. They rapidly adapt to a victim organization’s attempts to remove them from the network and frequently target the same victim again if access is lost.\n\nIn 2020, FireEye promoted one attack group from a previously tracked TEMP\ngroup to a FIN group.\n\n\n-----\n\n**How a Threat Activity Cluster Becomes an “APT” or “FIN” Group**\n\nMandiant analysts review threat activity data from a variety of sources—such as\nFireEye security product telemetry and Mandiant incident response engagements\nand research—to identify noteworthy clusters. Our team of technical and threat\nresearchers, analysts and reverse engineers begin their work from known indicators\nand attempt to find related indicators, activity or other data. When only a small\ncluster of activity is found, we reference that activity in finished intelligence\n(FINTEL) without a formal name to various channels, which may include Mandiant\nAdvantage and external blogs. Example: “Suspected Iran-based nation-state threat\nactors sent spear phishing emails….”\n\nUncategorized (UNC) groups are raw attribution analysis that were previously kept\nprimarily in house. An UNC is a cluster of cyber intrusion activity—which includes\nobservable artifacts such as adversary infrastructure, tools, and tradecraft. UNCs\nare created based on a defining, anchoring characteristic often discovered during\na single incident. As we discover new artifacts associated with other incidents and\nproactive collection efforts, the UNC provides a framework to join discrete pieces of\nevidence together.\n\nSome clusters develop further with sufficient or consistent research that identifies\ntheir tactics, techniques, and procedures (TTPs). In these cases, the cluster is given a\ntemporary “TEMP.<xxx>” group name. For example, APT37 was previously reported\nas the “TEMP.Reaper” group.\n\nAs our knowledge of a TEMP group becomes sufficiently mature, we apply a\nconsistent, rigorous methodology to assign the actor a formal APT or FIN number.\nAdvanced persistent threat (APT) groups are generally focused on espionage\nactivities. Financially-motivated (FIN) groups are highly organized criminal groups\nengaging in crime for financial gain, such as payment card data theft, business email\nfraud and extortion activities.\n\n\n###### FIN11: A Widespread Ransomware and Extortion Operation\n\nFIN11 is a financially motivated group that has been active since at least 2016. The\ngroup uses malware such as FlawedAmmyy and FRIENDSPEAK in widespread\nphishing campaigns that have impacted organizations across a broad range of\nsectors and geographic regions. To monetize its operations, FIN11 deploys CLOP\nransomware and extorts victims for the non-release of stolen data shared via its\npublic leak site. In at least one case, Mandiant Threat Intelligence observed FIN11\nuse point-of-sale (POS) malware. Although the group does not exhibit a high level\nof technical sophistication, FIN11 appears to consistent evolve its malware delivery\ntactics and techniques. The group has also relied on several support services to\naccomplish its mission (Fig. 3).\n\nFIN11 includes a subset of activity that some security researchers call TA505. This\nterm has been widely used in the security community to discuss large-scale spam\ncampaigns that date to 2014 and initially distributed malware families such as\nthe Dridex Trojan and Locky ransomware. We have not attributed TA505’s early\noperations to FIN11 and caution against using the names interchangeably.\n\n\n-----\n\n**Figure 3.** Bulletproof\nResources used by Hosting\n\nCode\n\nFIN11. Signing\n\nCertificates\n\nPublicly\nAvailable\nMalware\n##### FIN11\n\nDomain\nRegistration\nServices\n\nWe have no evidence that indicates when FIN11 was formed. We began tracking\nFIN11 (as UNC902) in 2017 (Fig. 4). It is plausible that the historical TA505 activity,\nwhich dates to at least 2014, was FIN11 (or a FIN11 member); however, we can’t\nindependently verify those claims, and the purported use of services (such as\nDridex and Emotet) complicates attribution analysis. Given the lack of first-hand\nknowledge and the mutable nature of criminal groups, any beliefs about when the\ngroup was formed would be speculative.\n\nFIN11 was chosen for graduation due to the group’s high activity level, its\nsuccessful compromise of multiple organizations, our insight into the group’s TTPs\nacross the attack life cycle and our clients’ interest in FIN11 and ransomware. There\nwere several developments in Fall 2019 that supported this decision. From 2017\nthrough mid-2019, we had limited insight into the later stages of FIN11 intrusions.\nIn early Fall 2019, Mandiant responded to multiple FIN11 CLOP deployments that\nhelped fill in those knowledge gaps. Further, in September 2019 the group replaced\nthe FlawedAmmyy backdoor with FRIENDSPEAK and MIXLABEL, which created\nadditional client interest.\n\nFIN11 campaigns have impacted a wide variety of sectors and geographical\nregions. The group’s spam campaigns from 2017 to 2018 primarily targeted\norganizations in the financial, retail and restaurant sectors. In 2019 and 2020, FIN11\nexpanded its targeting to a larger, more indiscriminate and diverse set of industries\nand countries, often using generic financial lures. However, a portion of FIN11’s 2019\nand 2020 campaigns targeted organizations in specific industries or regions; to\nappear more legitimate, the group often used the target’s native language coupled\nwith manipulated email sender information, such as spoofed email display names\nand email sender addresses. The shift in targeting observed during the past two\nyears may be the result of FIN11’s transition from point-of-sale (POS) malware to\nransomware as their main monetization method.\n\n\nCertificates\n\n##### FIN11\n\n\n-----\n\nA hallmark of FIN11 activity since at least January 2019 has been its rapid\nevolution of phishing campaign TTPs. Throughout its 2019 and 2020 phishing\ncampaigns, the group has made small changes to its initial delivery mechanisms,\nlikely in attempts to circumvent victims’ detection regimes. For example, in\nSeptember 2019, the actors attached macro-laden Office files directly to phishing\nemails, but over the next few months the infection chain became incrementally\nmore convoluted. By March 2020, most FIN11 phishing campaigns used HTML\nattachments to load a redirect from a compromised URL to a download domain\nthat subsequently delivered a macro-laden Office file. We assess that these\nrelatively minor and less novel modifications are not reflective of the group’s\nsophistication.\n\nUNC902 Identified TEMP.Warlock\n\n\n**Figure 4.**\nFIN11 timeline.\n\n|@|@|\n|---|---|\n\n|@|@|\n|---|---|\n\n\nFIN11\n\n    - Actor overview\n\n     - Profile report\n\n    - TTP deepdive\n\n    - Affected systems\n\n     - Indicator lists\n\n\n40k\n\n20k\n\n|Col1|Initial incidents FlawedAmmyy backdoor|Target: ServHelper Hospitality, backdoor retail and finance Method: Method: Downloads, Bluesteal weaponized POS office and malware zip files @ @ Phishing New campaigns incidents & adversarial research|Target: Geos MINEDOOR dropper Novel malware FRIENDSPEAK delivering downloader CLOP ransomware @ @ Widespread MIXLABEL phishing & backdoor downloaders|FIN11 • Actor overview • Profile report • TTP deepdive • Affected systems • Indicator lists|\n|---|---|---|---|---|\n||||||\n||||||\n\n\n2017 2018 2019 2020\n\n\nBreach Intelligence\n\nOperational Intelligence\n\n\nMachine Intelligence\n\nAdversarial Intelligence\n\n\nWhile FIN11 doesn’t exhibit a particularly high level of technical sophistication, the\ngroup’s methods are relatively efficient and effective (Fig. 5). The group rarely\nuses exploits as their initial infection vector and instead relies on phishing emails\nand user execution (opening macro-laden Microsoft Office files) to obtain an\ninitial foothold. The actors then use common exploitation frameworks and publicly\navailable utilities for reconnaissance, privilege escalation and lateral movement.\n\n\n-----\n\nWe suspect that several malware families are exclusive to FIN11, but it isn’t clear\nif FIN11 develops its tools or outsources development. It is plausible that FIN11\nuses gaps in phishing activities for tool development, as we have often observed\nnew versions of the MIXLABEL backdoor being deployed shortly after the group\nresumes operations. Some researchers have stated that CLOP is a Cryptomix\nvariant, which could suggest that the tool was acquired. However, while Mandiant\ndid identify some notable overlaps between the two ransomware families, we have\ninsufficient evidence to support the theory that CLOP is a variant of Cryptomix.\n\nWe have no reason to believe that other actors will begin using the malware\nfamilies that appear exclusive to the group. FIN11 seems to be the exclusive user of\nFlawedAmmyy; we have not observed FlawedAmmyy activity since FIN11 ceased\nusing the backdoor in 2019. Similarly, the group has been using BARBWIRE and\nMIXLABEL since 2018, and we have no evidence to suggest that other groups use\nthese tools.\n\nFIN11 has used several similar droppers—MINEDOOR, SPOONBEARD and\nFORKBEARD—to deliver malware such as FRIENDSPEAK and BARBWIRE. We\nsuspect that these droppers are not exclusive to the group, as they have also been\nused to pack malware typically associated with other threat groups.\n\nDespite the group’s widespread high-volume phishing campaigns, we have only\nobserved evidence of FIN11 successfully monetizing its operations in a handful of\ncases. In late 2018, Mandiant observed FIN11 attempt to monetize its operations\nusing the point-of-sale (POS) memory scraping tool BLUESTEAL at a restaurant\norganization. Since then, FIN11 has deployed CLOP ransomware at a variety of\norganizations and incorporated data theft to increase the pressure on victims to\npay extortion fees.\n\nIn 2020, FIN11 has conducted hybrid extortion attacks, combining ransomware\nwith data theft to pressure its victims to submit to extortion demands. In cases\nwhere we observed data theft, the actors accessed several dozen systems, staged\ndata in RAR archives, uploaded the files to MegaSync servers, deployed CLOP\nransomware and then sent an email threatening to publish the data. The exfiltrated\ndata was later posted to a dark website named CL0P^_- LEAKS. Given that we\nhave only observed CLOP distributed by FIN11, we judge that the group also\nmaintains this site.\n\nWe assess with moderate confidence that FIN11 is likely operating out of the\nCommonwealth of Independent States (CIS) based on Russian-language file\nmetadata, avoidance of CLOP deployments in CIS countries and the observance of\nthe Russian New Year and Orthodox Christmas holiday period.\n\nFIN11’s frequent, high-volume phishing campaigns are likely an attempt to cast\na wide net rather than a reflection of the group’s capabilities to monetize an\nexpansive number of victims simultaneously. Even if the campaigns have a\nrelatively low success rate, it is unlikely that FIN11 has the resources to monetize\neach intrusion prior to being detected. FIN11 may selectively choose victims to\nexploit further based on criteria such as their geolocation, sector or perceived\nsecurity posture. Mandiant expects FIN11 spam campaigns to continue in\nthe immediate future and, barring law enforcement action, with continued\ndiversification in delivery tactics.\n\n\n-----\n\n**Figure 5.**\nTargeting attack\nlifecycle for FIN11.\n\n|Figure 5. Targeting attack lifecycle for FIN11. Maintain Presence Move Laterally • Amadey • BARBWIRE • BARBWIRE • BEACON • BEACON • FORKBEARD • FlawedAmmy • Metasploit • FLOWERPIPE • Meterpreter • FORKBEARD • SPOONBEARD • Metasploit • TINYMET • METASTAGE • PuTTY • MIXLABEL • RDP • ServHelper • SHORTBENCH • SPOONBEARD • TINYMET • WINGSPAN • WOOLLYBEAR • ScheduledTasks • Appshim Initial Compromise Establish Foothold Escalate Privilege Internal Reconnaissance Complete Mission|Col2|Col3|Col4|Col5|Col6|\n|---|---|---|---|---|---|\n|||||||\n\n\n-----\n\n### PANDEMIC-RELATED THREATS\n\n\n-----\n\n###### Threats Against Organizations Working with COVID-19 Information and Research\n\n The coronavirus (COVID-19) pandemic caused systemic disruptions to nearly every institution and community, which introduced significant pressure on global leaders to find solutions to prevent or minimize the spread of the illness and economic fallout. In this climate, a successful\ncoronavirus vaccine, as well as proven strategies for containing spread and treating\nsymptoms, are highly prized. Mandiant experts have observed that governments\ndeployed cyber espionage capabilities in pursuit of any information that may\nsupport their own domestic recovery and vaccine development efforts and provide\na strategic advantage internationally.\n\n\n-----\n\nThroughout 2020, Mandiant Threat Intelligence tracked many cyber espionage\ncampaigns likely seeking COVID-19 vaccine or treatment data, including\nVietnamese, Chinese, North Korean, Iranian and Russian threat groups. Many of\nthese threat groups have been active for years and have been successful in the past.\n\nState-sponsored activity potentially targeting COVID-19 research and response\nbegan in January when Mandiant tracked broad China-nexus APT41 activity\naffecting pharmaceutical companies through router and VPN vulnerability\ninformation (Fig. 6). Around the same time frame, Vietnam’s APT32 conducted\na campaign targeting Chinese public and private entities, likely in efforts to gain\ninsight into the management and monitoring of the COVID-19 outbreak.\n\nIn March, the World Health Organization reported on Korea-linked actors targeting\nits officials, and in May, the U.S. released an advisory on ongoing China-linked\ncampaigns targeting COVID-19 research. In April, Iran’s UNC788 targeted US\npharmaceutical organizations; in addition, we observed the actor tracked as\nUNC2062 target medical research facilities in the spring of 2020. In May through\nJuly, the U.S. government released multiple statements and advisories, some of\nwhich were released jointly with foreign partners, related to state-sponsored\ncampaigns targeting COVID-19 data. In the fall, public reporting indicated that\nRussia’s APT28 targeted coronavirus treatment and vaccine research. During this\ntime and into 2021, we also observed North Korean-related activity move to target\nUS pharmaceuticals.\n\n\n**Figure 6.**\nState-sponsored\nactivity potentially\ntargeting COVID-19\nresearch.\n\n\nU.S. DOJ charged\ntwo Chinese\nnationals with\ntargeting\nCOVID-19 data\nglobally\n\nSep Oct Nov Dec\n\nMandiant reported\nactivity with ties\nto TEMP.Hermit\ntargeted U.S.\npharmaceutical fi rm\nwith CUTELOOP\n\nMandiant\ntracked activity set\npublicly reported\nas Kimsuky\ntargeted U.S.\npharmaceutical\nfi rm with\nPENCILDOWN\n\n\nU.S. and UK warn\nof state sponsored\nactivity targeting\norganizations\ninvolved in\ncoronavirus\nresponse with\npassword\nspraying; advisory\nalso mentions\nCitrix and Pulse\nSecure VPN\nvulnerabilities\n\n\nMandiant responded\nto incidents at\nNorth American\nmedical research\nentities involving the\nSIXPLUS backdoor\nand evidence of the\nattacker, UNC2062\n(Suspected APT29)\ntargeting intellectual\nproperty matching\nspecifi c COVID-19related keywords and\ncompressing data\nprior to exfi ltration\n\n\nU.S. FBI advised\nthat state-linked\nand fi nancially\nmotivated actors\nshifted resources\ntoward additional\ntargeting\nhealthcare,\nmedical research,\nand similar\norganizations\n\n\nUK and U.S.\nreleased a\njoint statement\naccusing APT29\nof targeting\nCOVID-19 data\n\n\nU.S. released\nan advisory on\nongoing Chinalinked campaigns\ntargeting\nCOVID-19\nresearch\n\nMandiant\ndescribed Iranian\ngroup UNC788\ntargeting 2FA\ncodes and webmail\ncredentials from\nU.S. pharmaceutical\norganizations;\npublicly reported\ntargeting of\nWHO offi cials’\npersonal email\nlikely conducted by\n**UNC788 as well**\n\n\nMandiant tracked\nbroad APT41\nactivity aff ecting\npharmaceutical\ncompanies\nthrough router\nand VPN\nvulnerability\nexploitation\n\n\nWHO reported\nKorea-linked\nactors targeted\nWHO offi cials\n\nApril\n\n**APT32 campaigns**\ndocumented by\nMandiant Threat\nIntelligence\ntargeted Chinese\ngovernment and\nprivate sector\nentities, likely to\ngain insight into\nthe management\nand monitoring\nof the COVID-19\noutbreak\n\n\n-----\n\n###### APT32\n\nAPT32 is a Vietnam-nexus cyber espionage actor that conducts foreign and\ndomestic surveillance using commercial tools against internal targets. FireEye\nhas tracked APT32 since 2012, and observed targeting of foreign governments,\njournalists, dissidents, and foreign corporations that may have a vested interest in\nVietnam’s manufacturing, consumer products, and hospitality sectors.\n\nFrom at least January to April 2020, APT32 carried out intrusion campaigns\nthat Mandiant believes were designed to collect intelligence on COVID-19. The\ncampaigns targeted select victims in Beijing and Wuhan, where COVID-19 was first\nidentified. The spear phishing emails sent to these targets contained malicious\nattachments and embedded tracking links; a subset of the emails included\nCOVID-19 themes. Targeted organizations included China’s Ministry of Emergency\nManagement and the Wuhan government.\n\nAPT32 likely used coronavirus-themed malicious attachments against additional\nChinese-speaking targets. While we have not uncovered the full attack chain, we\nidentified a METALJACK loader displaying a COVID-19 decoy document with a\nChinese language title while launching its payload.\n\n###### APT41\n\nAPT41 is a Chinese state-sponsored espionage activity in addition to financially\nmotivated activity potentially outside of state control. Its activity traces back to\n2012 when individual members of APT41 conducted primarily financially motivated\noperations focused on the video game industry before expanding into likely statesponsored activity.\n\nBetween January and March 2020, Mandiant observed APT41 attempt to\nexploit vulnerabilities in remote access and network appliances at more than 75\ncustomers. APT41 targeted Citrix NetScaler/ADC, which includes VPN functionality\n(CVE-2019-19781), Cisco routers and Zoho ManageEngine Desktop Central\n(CVE-2020-10189) in attempts to gain access to organizations in the healthcare,\ngovernment, education, aerospace and defense, transportation, public and nonprofit sectors.\n\n###### UNC788\n\nUNC788 is a cluster of threat activity suspected of conducting cyber espionage\noperations on behalf of the Iranian government. Also reported on by ClearSky\nand CERTFA as “Charming Kitten” and by Microsoft as “Phosphorus,” UNC788 is\ncharacterized by credential theft operations against corporate and personal email\naccounts.\n\nIn April 2020, UNC788 carried out a credential-harvesting campaign against multiple\ntargets, including the U.S. pharmaceutical industry. The campaign was aimed at\ngaining personal webmail credentials and likely targeted the victim with a spear\nphishing email which included a link to a spoofed webmail login page. The group is\nalso believed to have targeted global health employees using similar tactics.\n\n\n-----\n\n###### UNC2062\n\nIn July 2020, a joint report from the U.K.’s National Cyber Security Centre (NCSC),\nCanada’s Communications Security Establishment (CSE), and the U.S. Department\nof Homeland Security (DHS) detailed the use of three malware families used to\ncompromise medical research companies in the U.K., U.S., and Canada. The report\nattributed the observed activity to the Russian sponsored threat group APT29.\nWhile plausible, we have not yet been able to corroborate this attribution. APT29\nis believed to be affiliated with the Russian Federal Security Service (FSB) or the\nRussian Foreign Intelligence Service (SVR).\n\nMandiant tracks related activity as UNC2062 and observed the group using the\nSIXPLUS backdoor (publicly referred to as WELLMESS) to target medical research\nentities in the spring of 2020. We have also observed this threat group using\npublicly available tools and targeting data related to COVID-19.\n\n###### Threats Originating From North Korean Actors\n\nSince October 2020, Mandiant Threat Intelligence has tracked multiple distinct\nNorth Korean activity sets expand outside of established targeting patterns to\npharmaceuticals and medical research.\n\nIn November 2020, Mandiant reported to intelligence subscribers that a cyber\nespionage campaign was distributing the CUTELOOP downloader through\nemployment-themed lure material. Since at least April 2020, this group had\nmarginally updated its toolset and expanded its targeting from aerospace and\ndefense to a U.S. pharmaceutical company. We believe this activity set to be North\nKorean in origin and noted potential ties to another North Korean threat actor we\ncall TEMP.Hermit. A separate North Korean activity cluster we typically see seeking\nintelligence on nuclear or international relations issues was also observed targeting\nthe same U.S. pharmaceutical company with the PENCILDOWN downloader.\nWe noted indications of this activity set also targeting organizations involved in\npharmaceutical research, including universities in Germany and South Korea, a\nSouth Korean pharmaceutical company and a U.S. vaccine development company.\nWe also identified associated domains spoofing pharmaceutical, biotechnology,\nresearch and other health institutions in September and October 2020, including\nthe World Health Organization (WHO).\n\nThe actors using PENCILDOWN almost certainly continued to register domains\nspoofing pharmaceutical and healthcare companies in October 2020. They also\ndeployed the VENOMBITE loader against COVID-19 researchers in South Korea\nfrom December 2020 to January 2021. These actors typically carry out strategic\nintelligence collection surrounding ongoing Korean peninsula geopolitical issues\nand most closely align with publicly reported “Kimsuky” operations. Mandiant\nhas detected multiple incidents of activity attributed to this activity cluster, and\nthis group is partially responsible for an increase in the volume of observed North\nKorean espionage targeting multiple industry verticals in 2020. This actor set\npossibly shares resources with both TEMP.Hermit and APT38; however, the lines of\ndemarcation between North Korea-linked groups remains disputed. Infrastructure\nrelated to VENOMBITE also appears to indicate targeting of research universities\nand pharmaceuticals as well. The pace of the group’s focus and targeted efforts on\nmedical and health entities underscore North Korea’s immediate needs related to\nCOVID-19 infections and treatments.\n\n\n-----\n\n###### Outlook and Implications\n\nMandiant assesses with moderate confidence that COVID-19-related targeting of\nthe healthcare, pharmaceutical, medical research and closely related industries will\ncontinue to be prominent for the foreseeable future while the pandemic continues.\nAlthough targeting volume may not increase, the types of information targeted\nand the depth of intrusions may be more impactful than many incidents before\nthe pandemic. Most of this COVID-19-related targeting will very likely continue\nto be from espionage actors, with a much smaller portion likely from financially\nmotivated actors—particularly ransomware operators.\n\nAdditionally, contact tracing systems and applications deployed by governments,\nand often developed and/or operated by third parties, will likely provide additional\ntargets of interest to both espionage and financially motivated actors, given the\nvalue of large-scale databases for intelligence gathering, sale in underground\nmarkets and development of phishing campaigns.\n\n\n-----\n\n### UNC2452\n\n\n-----\n\n###### Mapping UNC2452 Activities  to the Targeted Attack Lifecycle Framework\n\n On December 13, 2020, FireEye published a report which detailed a supply chain attack called SUNBURST—an implant in the SolarWinds Orion platform being used to compromise target environments. Mandiant tracks this activity as UNC2452 and suspects the\ngroup is state-sponsored. While supply chain attacks are not unheard of in the\ninformation security space, this attack used significantly complex, methodical and\ndeliberate tradecraft.\n\nUNC2452 has demonstrated a facility with network intrusions which stand well\noutside the standard set of activities attackers commonly employ during a breach.\nMandiant has observed UNC2452 take advantage of areas in an environment that\nmay be monitored less intensely than others, and remain within those areas as\nlong as possible to reduce opportunities for detection.\n\n\n-----\n\n**Figure 7.**\nTargeted attack\nlifecycle framework.\n\n\nMandiant analysts use the Targeted Attack Lifecycle framework to model attacker\nbehaviors. Over thousands of engagements, the framework has provided a\ncommon nomenclature to describe both individual incidents and attacker\nmethodologies. During an investigation, Mandiant consultants will often collect\nforensic artifacts associated with specific stages of the Targeted Attack Lifecycle.\nMandiant consultants also use the framework to develop a structured narrative for\nreporting investigative findings.\n\n**Maintain Presence** **Move Laterally**\n\n**Establish Foothold** **Escalate Privilege** **Internal Reconnaissance** **Complete Mission**\n\nIn 2020, Mandiant consultants were tasked with scoping the initial stages of\nSUNBURST activity across many complex and disparate environments. The ability\nto tie specific indicators and methodologies to the Targeted Attack Lifecycle\nallowed them to apply a tiered approach to triage potential incidents. Modelling\nUNC2452’s activity not only allowed consultants to respond appropriately but,\nmore importantly, helped highlight how organizations can prepare for and\npotentially detect UNC2452 and the kinds of activity advanced actors can bring to\nbear during a complex intrusion. FireEye Mandiant recently published guidance on\ninvestigating and remediating UNC2452 activity within Azure cloud environments.[6]\n\n###### Initial Compromise\n\nIn the Initial Compromise phase, the attacker successfully executes malicious code\non one or more systems within an environment. UNC2452 targeted SolarWinds\nand implanted SUNBURST into the build cycle of the SolarWinds Orion product.\nUNC2452 managed to subvert the build process for SolarWinds Orion from March\n2020 through June 2020; the trojanized binary maintained the normal trappings\nof a legitimate software package. SolarWinds reported that 18,000 of their\napproximately 33,000 Orion customers downloaded the trojanized dynamicallyloaded library (DLL) which constitutes SUNBURST. UNC2452 appeared to target\nenvironments selectively based on the profiling data submitted to the Command\nand Control (CnC) nodes.[7] It is unclear whether UNC2452 would target victims\nbased on industry vertical or had specific organizations in mind, but the ability to\nscope this phase of the lifecycle accurately is a critical step for security teams.\n\n6. FireEye (January 19, 2021). Remediation and Hardening Strategies for Microsoft 365 to Defend\nAgainst UNC2452.\n\n7. SolarWinds (January 29, 2021). SolarWinds Security Advisory.\n\n\n-----\n\nAfter initial installation, SUNBURST potentially sleeps for up to 14 days, attempts\nto interrupt security instrumentation prior to launch and then starts beaconing via\nDNS requests for avsvmcloud.com. These requests include encoded information\nabout the environment from which SUNBURST is beaconing. Any organization\nthat used SolarWinds Orion and updated to the trojanized version was practically\nguaranteed to have at least attempted DNS requests (Stage 1).\n\nScoping the Initial Compromise phase from the perspective of the endpoint\nfocuses heavily on the SolarWinds Orion endpoints themselves. Security\nteams should work to identify evidence that the malicious hotfix served by the\nSolarWinds update process was downloaded and activated on their SolarWinds\nOrion endpoints. Ideally, security teams would have imaged their SolarWinds Orion\nsystems and analyzed the image or investigated the endpoint using forensically\nsound endpoint detection and response (EDR) capabilities. Fortunately, host\nbased indicators (HBIs) of SUNBURST are fairly straightforward.\n\nDuring the update process the hotfix package is downloaded to the\n%PROGRAMDATA%\\SolarWinds\\Installers\\ directory along with a corresponding\nSolarWinds-Core-v2019.4.5220-Hotfix5.msp.log file in the %PROGRAMDATA%\\\nSolarWinds\\Logs\\Installer\\<YYYY-MM-DD_HH-MM_SS> directory. After\ninstallation, the trojanized DLL associated with SUNBURST is written to the\n%PROGRAMFILES(x86)%\\Solarwinds\\Orion\\ directory.\n\nThe identification of the SUNBURST installer provides two valuable data points\nfor a follow-on investigation. First, confirming the existence of SUNBURST is\ncritical, but defining the earliest evidence of compromise can help drive the pace\nof the investigation. While it was reported SUNBURST may sleep for 14 days\nafter installation, the check is performed against the NTFS Standard Information\nModified timestamp of the BusinessLayer DLL. In some cases, this timestamp\ncan persist from the time the archive was created, making this date less reliable.\nTherefore, the NTFS Create timestamp for the BusinessLayer DLL is used as the\nstart of the timeline for a compromise in which UNC2452 used SUNBURST as the\ninitial vector.\n\nPassive DNS logging makes Scoping Stage 1 SUNBURST requests a trivial exercise.\nWhile it is possible to log requests on a local DNS server within the organization,\na more stable solution includes passive network collection of DNS requests. These\nrequests usually include the source and destination of the request, the time of\nthe request and relevant DNS-specific details such as the query, the answer and\nvarious status indicators of both. In this configuration the sensor’s placement and\nits effect on the quality of the data being captured are critical.\n\nDepending on the placement of a passive sensor, the data captured may lack\nvisibility, reducing the accuracy of its logs. If a sensor is placed north of a local\nserver that provides DNS and recursive lookups, DNS requests emanating from\nthe server may not indicate the true source of the domain lookup. This limitation\nmay be overcome in relatively small or localized SolarWinds deployments, but can\ngenerate more questions in a large-scale deployment. It is more desirable if the\nsensor sits between the individual endpoint and any DNS resolution service.\n\n\n-----\n\n**Figure 8.**\nSample setting for\nReportWatcherRetry.\n\n\nDuring the Establish Foothold phase, the attacker seeks to strengthen their\nposition in the environment by installing a persistent backdoor on the justcompromised endpoint. SUNBURST acts as a fully featured backdoor with\nadministrative access to the endpoint and runs as SYSTEM on the SolarWinds Orion\nendpoint. Consequently, UNC2452 can maintain access to an environment as long\nas the SolarWinds Orion systems remain active.\n\nDuring startup SUNBURST checks the ReportWatcherRetry value in the\nSolarWinds.Orion.Core.BusinessLayer.dll.config file. If it is set to any value other\nthan 3, SUNBURST will launch; a value of 3 in ReportWatcherRetry acts as a\nSUNBURST kill switch, which may be automated or manual. Mandiant experts\nanalyzed SUNBURST and identified a hardcoded list of IP address blocks that\ncontrol the malware’s behavior. DNS records returning values within these blocks\nwould terminate the malware and subsequently update the ReportWatcherRetry\nvalue to prevent further execution. However, Mandiant Consulting engagements\nhave identified instances during which UNC2452 set the ReportWatcherRetry\nvalue to 3 after successful acquisition of a secondary means of access to the\nenvironment. When security teams identify an inactive ReportWatcherRetry value\nthey may need to determine why and how it was set.\n\n<add key=”ReportWatcherRetry” value=”3” />\n\nTo further interact with the environment, UNC2452 can switch the DNS resolution\nrequests for avsvmcloud.com to a CNAME record response containing a domain\nto which SUNBURST will subsequently communicate (Stage 2). While the full\nbreadth of the UNC2452 campaign remains opaque, it is safe to assume that even\nan organization with state sponsorship would not be able to manage the workload\nof 18,000 compromised networks. As of March 2021, the number of environments\nthat entered Stage 2 is suspected to be in the hundreds instead of the thousands.\nSecurity teams can focus on the search for CNAME record responses. Depending\non how DNS traffic is monitored, available data may differ, but the best monitoring\nprovides the query, response and response type. If security teams identify CNAME\nresponses associated with SUNBURST Stage 2, their investigation is likely to\nadvance dramatically.\n\nIdeally, Stage 2 CNAME DNS requests would be captured by passive DNS\nlogging within the environment. Secondary sources such as firewall logs can\nidentify potential Stage 2 activity in the environment but they rely on publicly\navailable threat intelligence. While searching firewall logs for the IP addresses of\nknown Stage 2 domains may help identify Stage 2 activity in an environment, it\nis unlikely that every Stage 2 domain will be publicly disclosed. In fact, Mandiant\nhas identified the use of multiple domains during Stage 2 SUNBURST activity\nin individual environments. Therefore, security teams should hunt for other\nindications of attacker activity in their environment consistent with UNC2452\nacross the Targeted Attack Lifecycle.\n\nIn a few engagements, Mandiant has observed UNC2452 use the memory-only\ndropper TEARDROP, which launches Cobalt Strike BEACON. If Cobalt Strike\nBEACON was used by UNC2452, the CnC infrastructure was separate from the\ninfrastructure used by SUNBURST. UNC2452 has demonstrated significant caution\n\n\n-----\n\nregarding actions which would have exposed SUNBURST; this pattern persisted\nin the instances where TEARDROP was deployed. While Cobalt Strike has a\nreputation for stealth, UNC2452 appeared to take pains to ensure that\nif Cobalt Strike was detected, the SUNBURST backdoor would not be burned in\nthe process.\n\nUNC2452 clearly understands both security operations and incident response.\nAn incident’s initial attack vector often remains a mystery. UNC2452 was likely\ncounting on this knowledge gap to protect SUNBURST as long as possible. If the\nCobalt Strike implant were detected and an incident response process initiated\naround the event, UNC2452 may have hoped that by avoiding a direct line\nbetween SUNBURST and BEACON they could protect the former, a more costly\nand advantageous tool.\n\n###### Escalate Privileges\n\nIn the Escalate Privileges phase, the attacker seeks to obtain further access to\nsystems and data in the target environment. This can include credential harvesting,\nkeystroke logging or the compromise of authentication systems. Success with\ncredential harvesting depends on the attacker’s skillset. UNC2452 is quite able\nto surmount obstacles, research vulnerabilities and move towards their objective.\nUNC2452 tries to progress to lateral movement from the SYSTEM privileges\nprovided by a SolarWinds Orion endpoint. In some cases, Mandiant has observed\na modified version of Mimikatz used to harvest password hashes from memory.\nIn other cases, Mandiant has observed UNC2452 use DCSync, a technique\nthat simulates the Windows domain controller (DC) replication process to an\nunauthorized endpoint.\n\nAs an investigation moves through the cyclical portion of the Targeted Attack\nLifecycle, tracking malware-adverse adversaries relies on an in-depth and wellmaintained monitoring strategy. Groups such as UNC2452, which understand both\nsecurity operation center and incident response procedures, are likely to plan\ntheir actions around activities which leave behind the least forensic evidence. For\nexample, the actions performed during a DCSync attack are legitimate actions\nwithin an Active Directory (AD) environment. The ability to replicate AD objects\nis a convenience that can add efficiency to an AD environment. When attempting\nto identify a DCSync attack, security teams will often, by necessity, focus on\nevents that fall outside of common communications and actions between a DC\nand another endpoint. Where enabled, the Windows Event ID 4662, which details\noperations performed on directory service objects, can be used to identify DCSync\nactivity. It can be overwhelming to track all Event ID 4662 events. To better\nmanage the task, security teams should only enumerate those Event ID 4662\nevents that include values in their Operation > Properties field, such as Replicating\nDirectory Changes All or a combination of the globally unique identifiers (GUIDs)\nlisted in Figure 9.\n\n\n**InIn**\n\n\n**InIn**\n\n\n**Figure 9.**\nControl access\nrights associated\nwith DCSync.\n\n|GUID 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2 9923a32a-3607-11d2-b9be-0000f87a36b2 1131f6ac-9c07-11d1-f79f-00c04fc2dcd2|Control Access Right Symbol DS-Replication-Get-Changes-All DS-Install-Replica DS-Replication-Manage-Topology|\n|---|---|\n\n\n-----\n\nUnfortunately, Event ID 4662 does not provide the source of any operation\nrequest. Security teams will need to carefully scrutinize suspicious events identified\nthrough Event ID 4662 analysis and identify any correlated events that point to the\nsource of the DCSync. Searching for instances of access from SolarWinds systems\nto domain controllers may help reduce the dataset of potential connections.\nHowever, UNC2452 has been observed to run DCSync from systems affected by\nSUNBURST as well as other endpoints.\n\nOn the network, DCSync is accomplished through DCE/RPC sessions between\nthe unauthorized system and the DRSUAPI RPC interface on a domain controller.\nDCE/RPC calls such as DSBind, which creates the context necessary to call other\nfunctions, and DSGetNCChanges, which requests AD object updates from the\ndomain controller, are both key indicators for identifying DCSync. Unfortunately,\nnot all customer environments conduct the degree of internal monitoring\nnecessary to map RDP/DCE to actions taken across the network. While egress\nmonitoring has become more common in the last decade, monitoring internal\ntraffic exacerbates issues that have slowed the adoption of comprehensive\nnetwork monitoring solutions. The UNC2452 attack highlights network monitoring\ngaps which have historically been acceptable risk areas in an organization’s\nmonitoring stance.\n\n###### Internal Reconnaissance\n\nIn the internal reconnaissance phase, the attacker explores the organization’s\nenvironment to better understand its infrastructure, how and where it stores\ninformation of interest, and the roles of critical users. In engagements where\nattackers are less worried about stealth, Mandiant has often observed threat\nactors use reconnaissance utilities that generate large volumes of data and create\ndetection opportunities. For UNC2452, the converse has been observed across\nmultiple organizations. UNC2452 was often found to use common Microsoft\nWindows-related tools. For example, one of the few “noisy” actions conducted by\nUNC2452 was the enumeration of file system shares. UNC2452 would regularly\nperuse filesystem contents on remote systems, an activity that generates a\nconsiderable amount of noise because of how verbose the SMB protocol can be. In\nfact, SMB monitoring is rarely implemented for the same reason.\n\nIn organizations which did have SMB monitoring, reconnaissance performed by\nUNC2452 would stand out because regular and in-depth enumeration of network\nshares sourced from a SolarWinds system are atypical events. While this allowed\nMandiant consultants to identify the types of files UNC2452 would target, it also\nprovided insight into the data sources the attacker would avoid on the way to their\nobjective. As of March 2021, Mandiant has not observed UNC2452 target access to\ncustomer data, personally identifiable information or financial data.\n\nUNC2452 targeted data stores that acted as central stores of knowledge. Mandiant\nhas observed UNC2452 targeting access to online documentation stores, code\nrepositories, and IT and Infosec file shares. Logging resources associated with such\ndata stores are valuable hunting grounds for identifying reconnaissance activities.\nSearching for access from uncommon sources or sources known to have been\naffected by SUNBURST can provide substantial indicators to advance hunting\nefforts. For example, SMB sessions between SolarWinds endpoints affected by\nSUNBURST and a file server or administrative share may highlight times when the\nattacker was particularly active on an endpoint, allowing security teams to identify\nuser accounts accessing data during those times. Similarly, quantifying serial\naccess to documentation stores by individual IP addresses within a set period may\nlead back to a system compromised by UNC2452.\n\n\n-----\n\n###### Lateral Movement\n\nIn the Lateral Movement phase, the attacker uses the accounts and knowledge\nof the network gathered in previous phases to move to additional systems in the\nenvironment. Tracking UNC2452’s lateral movement is quite challenging, given the\nlarge amount of network traffic originating from the SolarWinds Orion platform.\nOnce again, the quantity and quality of logging performed in the environment will\ndetermine the likelihood of accurately identifying attacker activity in this phase.\n\nCreating timelines by identifying windows of attacker activity in the environment\ncan help reduce the amount of data to be analyzed. Reviewing common Windows\nlogon event types in aggregated windows event logs for the identified timelines\ncan help pinpoint instances of lateral movement. Every time UNC2452 progresses\nfurther into an environment, the process of generating timelines, identifying\nsuspicious activities and hunting must be repeated. Every indicator the security\nteam can identify, no matter how small requires the re-examination of existing\ndatasets through a constantly changing lens of attacker motivations. However,\nteams can quickly identify patterns undertaken by UNC2452. Every identification\nof lateral movement becomes an opportunity to further quantify UNC2452\nbehavior and build a comprehensive understanding of their operations and\nobjectives.\n\n###### Maintain Presence\n\nDuring the Maintain Presence phase, the attacker ensures continued access to\nthe environment. Mandiant observed UNC2452 move away from SUNBURST as a\npersistence mechanism when possible. UNC2452 commonly maintained access to\nan environment through legitimate VPN sessions. After VPN access was stabilized,\nUNC2452 sometimes activated the kill switch on SUNBURST and relied solely on\nVPN access.\n\nIn some investigations where Mandiant observed UNC2452 shift to VPN, a distinct\npattern emerged. UNC2452 applied the same level of tradecraft to source VPN\nsessions as they did to other phases of the attack lifecycle. The threat actor\nnot only maintained an individual IP address from which an account would\nauthenticate over the lifetime of the account’s use, it also ensured the GeoIP\nlocation of the IP address showed an address local to the target environment. In\nsome cases, Mandiant observed the threat actor changing the hostname of the\nWindows-based virtual machines they were using to that of a legitimate hostname\nin the target environment. While the actions taken to mask the true origin of the\nVPN sessions were not costly or difficult, the effect on investigations could be\ndramatic. Traditionally, incident response engagements use Windows Event Logs\nas a trusted primary source and efforts to subvert those logs often rely on bulk\ndeletion. While this common tactic limits the ability of security professionals to\nquantify attacker activity during a specific timespan, it still allows the qualification\nof attacker activity. Windows endpoints log the action of Event Log deletion to the\nevent log which can become an actionable indicator of compromise. In fact, most\nincident response firms look for quick wins by enumerating these events early in\nthe investigation. UNC2452 attacked this limitation from the other direction.\n\nInstead of deleting logs, UNC2452 activities reduced the confidence security\nprofessionals could maintain in a critical incident response dataset. Instead of\na one-to-one mapping of hostname to system, analysts would instead have\nto consider a one-to-many mapping of hostname to systems—with at least\none being the legitimate host. These actions did not alter the intrinsic value or\n\n\n-----\n\naccuracy of the logs themselves; instead, they made it dramatically more difficult\nto compensate for the different mappings as the number of scenarios producing\nthis effect increased. A counterfeit hostname for an attacker-controlled system\nis quite rare. As investigations progress, new findings spawn follow-on actions to\npursue deeper analyses. When analysts are not aware that a hostname might be\nfalsified, they may initiate follow-on workstreams which assume the legitimate\nhost is compromised. As analysts review endpoints which have been erroneously\nidentified as compromised, more time is required to disambiguate attacker activity\nand legitimate activity when in truth attacker activity never originated from\nthe legitimate system. These unnecessary workflows draw valuable resources\naway from the investigation—a worthwhile effect in the eyes of an attacker.\nWhile UNC2452 was able to place roadblocks in the path of investigations, the\nroadblocks sometimes provided opportunities for detection.\n\nUNC2452 relied on virtual private server (VPS) infrastructure to limit ingress IP\naddresses to geolocations which matched the target organizations geographical\nspread, which meant VPN logs could be used for broad scale analysis. The source\nIP address from which a VPN connection is established can be cross-referenced\nwith public data, including the autonomous system number (ASN) to which the IP\naddress belongs. Mandiant analyzed correlations between IP addresses extracted\nfrom VPN logs and corresponding ASNs. From this dramatically reduced dataset,\nanalysts could begin to rule out VPN sessions based on an ASN’s owner and\nquickly target ASNs associated with VPS providers. While some advanced users\nmay connect to a corporate VPN through a VPS, it should be a relatively rare\npractice. Security teams should ensure they review each VPN session sourced\nfrom a VPS provider because Mandiant has observed UNC2452 use multiple VPS\nproviders in individual environments.\n\nBy using legitimate VPN credentials, UNC2452 allowed Mandiant to successfully\nperform “Impossible Travel” analysis, which correlates each VPN logon session’s\noriginating IP Address to the geolocation of the IP. Individual accounts with\nsuccessive logons from locations which are too geographically disparate for a\nperson to travel through using conventional means dramatically reduces the\ndataset of potentially suspicious VPN sessions. The UNC2452 campaign was\nconducted during the global lockdown resulting from COVID-19 policies, which\nmeant organizations were likely heavily invested in remote work. This enabled\nthe curation of a more accurate baseline of normal user activity. While UNC2452\nused legitimate credentials and logged on from localities which broadly matched\nthe organization’s, this technique was not infallible. Mandiant observed instances\nwhere accounts for users who were on leave were used by UNC2452 as well as\ncases where international users would log on from US-based locales.\n\nWhile the impact of using hostnames taken from targeted environments as\nVPS hostnames had an appreciable effect on the pace of investigations, the\nidentification of this technique led to novel analysis methodologies. Mandiant\nanalysts were able to use services that perform data collection and historical\nanalysis of changes across the Internet to identify potential systems of interest.\nOne field commonly captured by these services is the RDP SSL certificate which\ncan leak the configured hostname of an endpoint. By querying for endpoints which\npresented leaked hostnames matching those of legitimate hosts within customer\nenvironments, Mandiant consultants were able to identify suspicious VPN sessions\nand then review VPN log data to generate timelines of attacker activity.\n\n\n-----\n\n###### Complete Mission\n\nIn the Complete Mission phase, the attacker accomplishes the objectives of the\nintrusion. In some intrusions this can be intellectual property theft or disruption\nof business operations. Investigation during this phase of the Targeted Attack\nLifecycle depends entirely on the accuracy and consistency of the timelines the\nanalysts previously built based on available data. In environments where UNC2452\nwas able to acquire VPN access, they could freely access data through common\nprotocols such as HTTP(S), SMB and SSH. The cross-referencing of timeline data\nsuch as the VPN IP address with access logs for data stores can help security\nteams identify individual accesses which result in data loss.\n\n###### Conclusion\n\nThe UNC2452 campaign was extremely challenging to uncover and address. The\nattacker was sophisticated enough to implant SUNBURST in the widespread and\nbroadly respected SolarWinds Orion platform. While UNC2452’s knowledge of\noperational security was higher than most incident responders are likely to witness\nfirst-hand, it doesn’t change the mission: security professionals must work to guard\nagainst similar attacks from copycat threat actors. Well-designed environment\nmonitoring practices and procedures, along with rigorous investigation\nmethodologies serve as consistent ways to shine a bright light on the actions of\nadvanced attackers.\n\n\n**cece**\n\n\n-----\n\n### CASE STUDIES\n\n\n-----\n\n###### Insider Threat Risks  to Flat Environments\n\n In mid-2020, a technology provider engaged Mandiant to investigate a suspected intrusion in their environment. The client notified Mandiant\nthat an unauthorized user had accessed their development/test and Amazon Web\nServices (AWS) environments remotely. The client had also identified evidence to\nindicate the unauthorized user deleted Relational Database Service (RDS) backups\nwithin the AWS environment. For this investigation, the insider threat team was\nengaged to:\n\n                                 - Identify the attacker: Collect and deliver evidence that could identify the\nunauthorized user.\n\n                                 - Determine any loss of client data: Review all forensic evidence for data theft.\n\n\n-----\n\n**The Mandiant**\n**insider threat team**\ninvestigates client\nenvironments using\na Follow the Data\nmodel that echoes\nmethodologies\nfrom the National\nInstitute of\nStandards and\nTechnology (NIST)\nand the National\nInsider Threat\nTaskforce (NITTF).\nTheir focused\ndata collection\nallows clients to\ntake necessary\nlegal actions, as\ncoordinated with\ntheir third-party\nlegal counsels.\n\n**Figure 10.**\nTimeline of events\nconstructed by the\ninsider threat case\nstudy.\n\n\n###### Analysis\n\nThe Mandiant insider threat team analyzed AWS CloudTrail logs and Linux\nauthentication logs and identified a timeline of events which detailed the logon\nactivities of the suspected insider threat actor (Fig. 10).\n\nWhile the threat actor took steps to provide a level of anonymity to their actions,\nMandiant experts were able to correlate discrete artifacts across sessions to tie the\nactivity to a single user.\n\nFifteen days before the employee was laid off, the Linux server logged a remote\nSSH session from the IP address x.x.x.121 which authenticated using an SSH key\nassociated with the ubuntu account—a default account in Ubuntu-based Amazon\nMachine Images (AMI). At the time of analysis, the IP address x.x.x.121 was\nassociated with a residential Internet provider.\n\nThree days before the employee was laid off, AWS CloudTrail logged the\nemployee authenticating to cloud infrastructure from the IP address x.x.x.113 using\ntheir legitimate credentials. At the time of analysis, the IP address x.x.x.113 was\nassociated with an anonymized VPN provider. During this session, AWS CloudTrail\nlogged the creation of users and as well as an EC2 instance by the employee.\n\nTwelve hours after the employee had been laid off, the Linux server logged an SSH\nsession from the same x.x.x.113 IP address used to access AWS cloud infrastructure;\nit was authenticated using the private key for the ubuntu account. By correlating\nindividual artifacts across multiple logging sources Mandiant consultants were\nable to develop an evidence-backed narrative which associated the recently\ndischarged employee with both the anonymous VPN IP and the private key used\nfor certificate-based authentication.\n\nAWS CloudTrail logs and host-based forensic artifacts allowed Mandiant\nconsultants to detail the actions undertaken by the recently laid off employee after\nthe employee had authenticated to the development server as the ubuntu account.\nCommand line history and sudo logs extant on the Ubuntu-based EC2 instance\nprovided key artifacts to drive further investigation into the AWS CloudTrail logs.\nMandiant experts identified logs that indicated the installation of the awscli toolset\nwhich facilitates the submission of API requests to the AWS API.\n\n\n**T+12 Hours**\nEmployee\nconnects from\npreviously used\nanonymized\nVPN IP\naddress (T-3)\nusing the SSH\nkey (T-15)\n\n\n**T-15 Days**\n\nEmployee\nfirst accesses\npublic facing\ndev server\nusing SSH\npublic key for\nubuntu user\nfrom corporate\nlaptop\n\n\n**T-3 Days**\nEmployee first\naccesses\nAWS using\nusername from\nan anonymized\nVPN IP address\nand creates\nuser and EC2\ninstances\n\n\n**T-0 Days**\nEmployee is\ndischarged\nand known\naccesses are\nremoved\n\n\n**T+13 Hours**\nEmployee\nconnects from\ndevelopment\nserver to AWS\ncloud and\ncreates users\nand instances\n\n\n**T+15 Hours**\nEmployee\nenumerates\ninstances to\nsee what\nclient data can\nbe viewed\n\n\n**T+16 Hours**\nEmployee\nbegins to\ndelete RDS\nbackups and\nproject data\ncreated while\npreviously\nemployed\n\n\n**T+18 Hours**\nEmployee\nterminates\nsession once\nother logins\nare seen from\nclient\n\n\n-----\n\nThirteen hours after the employee had been laid off, the ubuntu account used the\nawscli utility to provision new AWS IAM user a account in the client’s AWS tenant.\n\nThree hours later, after failing to enumerate the EC2 instances to which the new\nAWS IAM account would have access, the ubuntu account issued API calls\nwhich deleted RDS backups, removed the accounts it had created and terminated\nthe session.\n\n###### Outcome\nThe Mandiant insider threat team was able to build a timeline of unauthorized\nactivity, assure the customer there was no evidence of client data loss and\nsubsequently remediate the environment to prevent similar future insider and\nexternal threats. At the end of the engagement, the client’s environment was more\nsecure.\n\n###### Recommendations\n\n Credential revocation\nThe client believed the insider was not aware of the upcoming layoffs. Mandiant\noften recommends that clients discharging employees should coordinate access\nremoval with notification to protect both the organization and the employee. This\nwould hold true even if an employee voluntarily resigns or retires. All SSH keys,\nPEM files, service passwords and application passwords to which the individual had\naccess should be rotated for all environments. Similarly, provisions within multifactor authentication (MFA) should be immediately unenrolled when an employee\nor contractor leaves the organization.\n\n###### Network Segmentation\nHistorically, Mandiant has found that most client networks enable at least a basic\nlevel of network segmentation. However, there often is no separation between the\ndevelopment and production networks. Access controls between development\nand production networks can limit opportunities for an unauthorized user to move\nlaterally between zones. Mandiant recommends organizations thoroughly review\ntheir network segmentation and limit unnecessary traffic between sensitive and\nless-trusted environments. This will help prevent insider threats from moving\nlaterally or connecting from an internal network segment to a cloud environment.\nAlso, systems that do not need to be public-facing should be segmented from\npublic access and restricted as much as possible.\n\n###### Logging\nIn this case, the client had enabled logging and event aggregation to a security\ninformation and event management (SIEM) system. This ensured the authenticity\nof the logs used during the investigation. Linux based operating systems log\nactivity in plain text which provides an opportunity for an attacker to manually\nedit the log entries generated by their activity. By streaming logs to a secondary\nsource, the client not only followed best-practice logging guidance but maintained\ncritical information necessary for an in-depth investigation.\n\n###### Least Privilege\nThis client had many administrative controls for most of its production systems.\nHowever, the development network had users with extensive permissions that\nextended to the creation of accounts in both the client network and the cloud\nenvironment. Mandiant recommends organizations implement comprehensive\nuser access controls across all environments on their networks to ensure that user,\ndeveloper and administrator accounts have only the necessary level of permissions\nto complete their tasks and maintain business continuity.\n\n\n-----\n\n###### Red Team Makes the Most  of Social Engineering and  System Misconfigurations\n\n A financial services firm engaged Mandiant to evaluate the effectiveness of its information security team’s detection, prevention and response capabilities.\n\nThe Mandiant red team’s objectives were to avoid detection while accomplishing\nthe following tasks:\n\n\n**Mandiant red**\n**team consultants**\nperform targeted,\nobjective-based\nassessments using\na combination of\npublicly available\nand internally\ndeveloped tools.\nOnce the red team\nis able to access\nan environment,\nobserving how\nlegitimate\nemployees interact\nwith workstations\nand applications\nallows the red\nteam to blend in by\nadopting behaviors\ncommon to the\nenvironment.\n\n\n\n- Access Executive Email\n\n- Access Sensitive Production Network\n\nDuring this engagement, the red team consultants emulated advanced nationstate attackers regularly seen on the frontlines of Mandiant incident response\nengagements.\n\n###### Initial Compromise\n\nWhile performing open-source intelligence (OSINT) reconnaissance to identify,\ncatalogue and analyze the client’s Internet-facing infrastructure, the red team\ndiscovered a job application portal through which interview candidates could\nsubmit documents. According to Mandiant threat intelligence, social engineering\nis one of the most common initial attack vectors used by advanced attackers.\nFor this engagement, the red team used the job application portal to deliver\nmalicious documents which might be opened by employees during regular\nbusiness operations. This allowed the red team to use a trusted resource without\nhaving to bypass email-based security controls. To increase the chance the resume\nwould be opened, the red team crafted a suitable candidate for employment\nbased on common job openings published by the customer and submitted the job\napplication and malicious resume through the application portal.\n\n\n-----\n\nThe resume contained a malicious macro and a request that attempted to\nconvince the user to enable macro content to allow the execution of the embedded\ncode on their endpoint. Historically, the red team has found that applying personal\ntouches to attempts at social engineering increases the chance of success. In this\ncase, the red team sent a follow-up email to the HR department to demonstrate\nenthusiasm from the applicant and check on the status of the resume.\n\n###### Establishing a Foothold and Maintaining Access\n\nShortly after sending the follow up email to HR, a recruiter working for the\ncustomer opened the malicious resume and enabled content, which provided\na Cobalt Strike command and control connection. The successful pre-text and\nmacro execution enabled the red team to gain a foothold into the environment.\n\nOnce a foothold is established APT groups often prioritize creating a means\nthrough which consistent access to the environment can be maintained. After\nestablishing a successful Cobalt Strike session Mandiant’s red team sought to do\nthe same. To maintain access, the red team installed a Startup Folder persistence\nmechanism within the profile of the compromised user, which would launch the\nbackdoor each time the user logged on to the compromised system.\n\n###### Escalating Privileges and Lateral Movement\n\nThe ability to quickly reconnoiter an environment while remaining undetected\nis a capability which often separates opportunistic attackers from advanced\nattackers. The Mandiant red team uses tradecraft common to APT groups to\nprofile the behaviors of legitimate users and reduce the chance of detection. The\nred team performed host-based reconnaissance on the HR user’s workstation to\ngain situational awareness regarding the user’s privileges and systems to which\nthe user had access. This helped the red team identify an unquoted service\npath on the system which could be used to escalate privileges. An unquoted\nservice path allows attackers to intercept execution flow by placing a binary in\na directory higher than that of the intended executable. The red team exploited\nthis misconfiguration to gain elevated access to the system. Using the elevated\nprivileges, the red team used Mimikatz to access the local administrator password\nhash on the system.\n\nWhile the privileges acquired through the unquoted service path vulnerability\nprovided a greater level of access to the local host, it did not directly facilitate\nmoving deeper into the environment. The development and adoption of the\nMicrosoft Local Administrator Password Solution (LAPS) has dramatically reduced\nthe attack surface associated with the reuse of Local Administrator passwords.\nHowever, deployment of LAPS can be inconsistent across environments.\nLooking through the client’s Active Directory environment, the Mandiant red\nteam enumerated systems that were not managed by LAPS by querying for the\nabsence of the “ms-Mcs-AdmPwdExpirationTime” computer object attribute.\nThis produced a list of endpoints to which the red team could potentially\nauthenticate using the recently acquired local administrator password hash. The\nred team tested the validity of the compromised Local Administrator account\nand identified several servers on which the credentials were valid. One of those\nservers was configured with the unconstrained delegation property which\ncan allow attackers with administrative access to impersonate any account\nwhich has successfully authenticated to that system. To force the client’s\ndomain controller to authenticate to the just-compromised unconstrained\ndelegation server, the red team used the ‘printer bug’ attack which sends an\n\n\n-----\n\n‘RpcRemoteFindFirstPrinterChangeNotification’ request to a domain controller\nrunning the Print Spooler service. As a result of this request, the domain controller\ntests the connection, which provides the Kerberos Ticket-Granting Ticket (TGT) for\nthe domain controller machine account.\n\nThe red team used the captured Kerberos TGT to impersonate the client’s domain\ncontroller machine account and perform a DCSync attack. A successful DCSync\nattack provides the NTLM password hashes for any account in the target domain,\nincluding domain administrator users. The password hashes acquired through\nDCSync allowed the red team to move through the client’s environment freely and\nfocus on their access objectives.\n\n###### Accessing High-Value Objectives\n\nDuring the initial scoping for the engagement, the client tasked the Mandiant red\nteam to gain access to the contents of an executive’s email account and move\nlaterally into a sensitive production network.\n\n###### Executive Email Access\n\nDue to newly adopted work from home practices paired with heavy adoption\nof cloud services, the client’s employees were not centrally located as would\nbe expected with a traditional office model. Their Office 365 email access was\nprotected by multi-factor authentication (MFA), so the red team chose to target\nexecutive workstations for email access. The NTLM hashes gathered during the\nDCSync attack were processed and fed through an offline password-cracking\nserver internal to Mandiant, which returned plain text credentials for an executive\naccount. The red team then monitored the environment to see when executive\nworkstations were connected to the internal network either directly or through a\nVirtual Private Network (VPN) concentrator. Once an executive’s workstation was\nconnected to the internal network, the red team tested the validity of credentials\nby mapping the C$ share and gained interactive access to the endpoint—and the\nuser’s email—with the executive’s compromised credentials.\n\n###### Accessing Sensitive Production Network\n\nAccess to the production network also presented substantial obstacles for the\nred team. The customer required all connections between the corporate and\nproduction networks to traverse a jumphost protected by MFA. To identify the\njumphosts that bridged the corporate and production environments, the red team\nperformed reconnaissance within Active Directory and identified a jumphost that\nallowed inbound Remote Desktop Protocol (RDP) and Windows Management\nInstrumentation (WMI) connections. While RDP would require the use of MFA,\naccess via WMI was not similarly constrained. Using the Domain Administrator\naccount, the red team queried WMI on the jumphost to identify a list of users\nwho had recently authenticated to the server. The red team then conducted\nDCSync attacks against the list of recently authenticated users to obtain the\nNTLM hashes for each account, which were submitted to a Mandiant-internal\npassword cracking service. The cracking service successfully identified the plain\ntext credentials of multiple users from the list, giving the red team the first element\nneeded to authenticate to RDP. While MFA provides a high degree of security\nfor environments, convenience features that help improve adoption rates are\noften built into the products. One such feature is the ability to generate a push\nnotification on the user’s device and request authorization. Advanced attackers\nand red teams alike can use this feature and hope that a busy employee may\nassume a request is legitimate and authorize the request.\n\n\n-----\n\nIn this case, the red team initiated a Duo Push request that was accepted by the\nend user, which gave the red team interactive access to the jumphost through an\nRDP connection. To perform follow-on actions efficiently and move further into\nthe sensitive production network, the red team needed to place a Cobalt Strike\nbeacon on the jumphost but firewall policy restricted the transfer of files to the\njumphost. Using a compromised user workstation, the red team temporarily stored\na DLL sideloading payload on a corporate-wide file share which could then be\naccessed from the jumphost while the red team was connected through RDP.\nWith a Cobalt Strike beacon in place, the red team could maintain access to the\njumphost and complete the client’s requested objective.\n\n###### Outcomes\n\nIn this case study, at the client’s request, the Mandiant red team gained a\nfoothold in the client’s environment, obtained full administrative control of the\ncompany domain, accessed executive email and connected to the sensitive\nproduction network without any software or operating system exploits. Instead,\nthe red team focused on identifying system misconfigurations, conducting social\nengineering attacks and using the client’s internal tools. They were able to achieve\ntheir objectives despite the obstacles presented by the client’s MFA, network\nsegmentation and employee social engineering awareness.\n\n\n-----\n\n### CONCLUSION\n\n\n-----\n\n###### More Security Awareness to Build Best Practices\n\n 2020 was a year where we were reminded how events in the physical world and cyber security are intertwined. In past M-Trends we reported\non how geopolitical events often have repercussions on cyber security. In 2020\nwe saw how a global pandemic changed business operations and, as a result,\nthe attack surface and risk profile of most businesses. Organizations around the\nworld struggled with adapting to the new norm and maintaining their defenses as\nattackers took advantage of these unprecedented times.\n\nOver the past year we were also reminded of the complexity and impact of supply\nchain attacks, a trend we first mentioned in M-Trends 2013, where we discussed\nhow attackers used third-party service providers to compromise their victims.\nWhile many of the trends we have observed in 2020 are not new, we have seen\nthese issues reach new and memorable levels of sophistication and proportion.\n\n\n-----\n\nWe also witnessed how ransomware evolved to multi-faceted extortion and\ncontinues to escalate. In 2020, we saw the rise of “name and shame” websites\nin addition to encryptor deployment. Threat actors capitalized on infrastructure\ndeployed to support a remote workforce by exploiting new and old vulnerabilities\nfor initial access. These trends underscore the importance of sound fundamentals\nsuch as vulnerability and patch management, least privilege and hardening.\n\nSecurity organizations need to continue to be prepared for ongoing escalations\nwith threat actors and deal with changes to their own environment and attack\nsurface. While much has stayed the same, we are seeing a continued evolution of\npast trends that requires security teams to remain vigilant, adapt and evolve.\n\n\n-----\n\n###### To learn more about FireEye, visit: www.FireEye.com To learn more about Mandiant Solutions, visit: www.FireEye.com/mandiant\n\n\n**FireEye, Inc.** **About FireEye**\n601 McCarthy Blvd. Milpitas, CA 95035 At FireEye, our mission is to relentlessly protect\n408.321.6300/877.FIREEYE (347.3393) organizations with innovative technology,\ninfo@FireEye.com intelligence and expertise gained on the frontlines\n\nof cyber attacks. Learn how at www.FireEye.com.\n©2021 FireEye, Inc. All rights reserved. FireEye\nand Mandiant are registered trademarks of FireEye,\nInc. All other brands, products, or service names are\nor may be trademarks or service marks or service\nmarks of their respective owners.\nM-EXT-RT-US-EN-000372-01\n\n\n**About Mandiant Solutions**\nMandiant Solutions brings together the world’s\nleading threat intelligence and frontline expertise\nwith continuous security validation to arm\norganizations with the tools needed to increase\nsecurity effectiveness and reduce business risk.\n\n|FireEye, Inc. 601 McCarthy Blvd. Milpitas, CA 95035 408.321.6300/877.FIREEYE (347.3393) info@FireEye.com ©2021 FireEye, Inc. All rights reserved. FireEye and Mandiant are registered trademarks of FireEye, Inc. All other brands, products, or service names are or may be trademarks or service marks or service marks of their respective owners. M-EXT-RT-US-EN-000372-01|About FireEye About Mandiant Solutions At FireEye, our mission is to relentlessly protect Mandiant Solutions brings together the world’s organizations with innovative technology, leading threat intelligence and frontline expertise intelligence and expertise gained on the frontlines with continuous security validation to arm of cyber attacks. Learn how at www.FireEye.com. organizations with the tools needed to increase security effectiveness and reduce business risk.|\n|---|---|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/FireEye/mtrends-2021.pdf"
    ],
    "report_names": [
        "mtrends-2021"
    ],
    "threat_actors": [
        {
            "id": "d134593b-1325-47ab-9bb7-b47d6473e352",
            "created_at": "2022-10-25T15:50:23.827908Z",
            "updated_at": "2025-03-27T02:00:55.554076Z",
            "deleted_at": null,
            "main_name": "FIN10",
            "aliases": [
                "FIN10"
            ],
            "source_name": "MITRE:FIN10",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1f3cf3d1-4764-4158-a216-dd6352e671bb",
            "created_at": "2022-10-25T15:50:23.837615Z",
            "updated_at": "2025-03-27T02:00:55.556414Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "APT19",
                "Codoso",
                "C0d0so0",
                "Codoso Team",
                "Sunshop Group"
            ],
            "source_name": "MITRE:APT19",
            "tools": [
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e3a488e-d304-4431-92e0-c8b9c80542bf",
            "created_at": "2022-10-25T16:07:23.627198Z",
            "updated_at": "2025-03-27T02:02:09.895667Z",
            "deleted_at": null,
            "main_name": "FIN10",
            "aliases": [],
            "source_name": "ETDA:FIN10",
            "tools": [
                "EmPyre",
                "EmpireProject",
                "KOMPROGO",
                "PowerShell Empire",
                "Splinter RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1bdb91cf-f1a6-4bed-8cfa-c7ea1b635ebd",
            "created_at": "2022-10-25T16:07:23.766784Z",
            "updated_at": "2025-03-27T02:02:09.971636Z",
            "deleted_at": null,
            "main_name": "Bluenoroff",
            "aliases": [
                "APT 38",
                "ATK 117",
                "Alluring Pisces",
                "Black Alicanto",
                "Bluenoroff",
                "CTG-6459",
                "Copernicium",
                "Nickel Gladstone",
                "Sapphire Sleet",
                "Selective Pisces",
                "Stardust Chollima",
                "T-APT-15",
                "TA444",
                "TAG-71",
                "TEMP.Hermit"
            ],
            "source_name": "ETDA:Bluenoroff",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6728f306-6259-4e7d-a4ea-59586d90a47d",
            "created_at": "2023-01-06T13:46:39.175292Z",
            "updated_at": "2025-03-27T02:00:03.013291Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "TEMP.Warlock",
                "UNC902"
            ],
            "source_name": "MISPGALAXY:FIN11",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c1eadfd8-6e9c-4024-902d-555c9530fcea",
            "created_at": "2023-01-06T13:46:38.645834Z",
            "updated_at": "2025-03-27T02:00:02.881844Z",
            "deleted_at": null,
            "main_name": "TEMP.Hermit",
            "aliases": [],
            "source_name": "MISPGALAXY:TEMP.Hermit",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "277b5119-e193-4f98-b18a-c6db644f32f3",
            "created_at": "2023-01-06T13:46:38.971767Z",
            "updated_at": "2025-03-27T02:00:02.966286Z",
            "deleted_at": null,
            "main_name": "FIN10",
            "aliases": [
                "G0051"
            ],
            "source_name": "MISPGALAXY:FIN10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d0e8337e-16a7-48f2-90cf-8fd09a7198d1",
            "created_at": "2023-03-04T02:01:54.091301Z",
            "updated_at": "2025-03-27T02:00:03.119447Z",
            "deleted_at": null,
            "main_name": "APT42",
            "aliases": [
                "UNC788",
                "CALANQUE"
            ],
            "source_name": "MISPGALAXY:APT42",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "16f2436b-5f84-44e3-a306-f1f9e92f7bea",
            "created_at": "2023-01-06T13:46:38.745572Z",
            "updated_at": "2025-03-27T02:00:02.907444Z",
            "deleted_at": null,
            "main_name": "APT40",
            "aliases": [
                "ISLANDDREAMS",
                "TEMP.Jumper",
                "BRONZE MOHAWK",
                "GADOLINIUM",
                "KRYPTONITE PANDA",
                "TA423",
                "MUDCARP",
                "Gingham Typhoon",
                "TEMP.Periscope",
                "G0065",
                "ATK29",
                "Red Ladon",
                "ITG09"
            ],
            "source_name": "MISPGALAXY:APT40",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "59be3740-c8c7-47aa-84c8-e80d0cb7ea3a",
            "created_at": "2022-10-25T15:50:23.481057Z",
            "updated_at": "2025-03-27T02:00:55.480695Z",
            "deleted_at": null,
            "main_name": "Leviathan",
            "aliases": [
                "MUDCARP",
                "Kryptonite Panda",
                "Gadolinium",
                "BRONZE MOHAWK",
                "TEMP.Jumper",
                "APT40",
                "TEMP.Periscope",
                "Gingham Typhoon"
            ],
            "source_name": "MITRE:Leviathan",
            "tools": [
                "Windows Credential Editor",
                "BITSAdmin",
                "HOMEFRY",
                "Derusbi",
                "at",
                "BLACKCOFFEE",
                "BADFLICK",
                "gh0st RAT",
                "PowerSploit",
                "MURKYTOP",
                "NanHaiShu",
                "Orz",
                "Cobalt Strike",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "47fa514e-15a8-4adb-a782-e2ffb12944d8",
            "created_at": "2024-04-24T02:00:49.644637Z",
            "updated_at": "2025-03-27T02:00:55.560836Z",
            "deleted_at": null,
            "main_name": "UNC788",
            "aliases": [
                "UNC788"
            ],
            "source_name": "MITRE:UNC788",
            "tools": [
                "HilalRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04888f75-158b-47f9-8ad9-4ff83f618ece",
            "created_at": "2024-05-01T02:03:08.03763Z",
            "updated_at": "2025-03-27T02:05:17.319276Z",
            "deleted_at": null,
            "main_name": "COBALT MIRAGE",
            "aliases": [
                "Nemesis Kitten ",
                "PHOSPHORUS ",
                "TunnelVision ",
                "UNC2448 ",
                "DEV-0270 "
            ],
            "source_name": "Secureworks:COBALT MIRAGE",
            "tools": [
                " Custom powershell scripts",
                " DiskCryptor",
                " Drokbk",
                " FRPC",
                " Fast Reverse Proxy (FRP)",
                " Impacket wmiexec",
                " Ngrok",
                " Plink",
                " PowerLessCLR",
                " TunnelFish",
                "BitLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1db21349-11d6-4e57-805c-fb1e23a8acab",
            "created_at": "2022-10-25T16:07:23.630365Z",
            "updated_at": "2025-03-27T02:02:09.897138Z",
            "deleted_at": null,
            "main_name": "FIN11",
            "aliases": [
                "DEV-0950",
                "Lace Tempest",
                "Operation Cyclone"
            ],
            "source_name": "ETDA:FIN11",
            "tools": [
                "AZORult",
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "BLUESTEAL",
                "Cl0p",
                "EMASTEAL",
                "FLOWERPIPE",
                "FORKBEARD",
                "FRIENDSPEAK",
                "FlawedAmmyy",
                "GazGolder",
                "Get2",
                "GetandGo",
                "JESTBOT",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MINEDOOR",
                "MIXLABEL",
                "Meterpreter",
                "NAILGUN",
                "POPFLASH",
                "PuffStealer",
                "Rultazo",
                "SALTLICK",
                "SCRAPMINT",
                "SHORTBENCH",
                "SLOWROLL",
                "SPOONBEARD",
                "TiniMet",
                "TinyMet",
                "VIDAR",
                "Vidar Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "83025f5e-302e-46b0-baf6-650a4d313dfc",
            "created_at": "2024-05-01T02:03:07.971863Z",
            "updated_at": "2025-03-27T02:05:17.278721Z",
            "deleted_at": null,
            "main_name": "BRONZE MOHAWK",
            "aliases": [
                "Flaccid Rose ",
                "GADOLINIUM ",
                "Kryptonite Panda ",
                "Leviathan ",
                "Nanhaishu ",
                "Pickleworm ",
                "Temp.Jumper ",
                "Temp.Periscope ",
                "APT40 "
            ],
            "source_name": "Secureworks:BRONZE MOHAWK",
            "tools": [
                " BlackCoffee",
                " China Chopper",
                " Cobalt Strike",
                " Derusbi",
                " Derusbi Trojan",
                " FUSIONBLAZE",
                " GreenCrash",
                " HOMEFRY",
                " MURKYTOP",
                " Metasploit",
                " Metasploit / Meterpreter",
                " Nanhaishu",
                " Orz",
                " ScanBox",
                " SeDll",
                "AIRBREAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041836,
    "ts_creation_date": 1618241030,
    "ts_modification_date": 1618241048,
    "files": {
        "pdf": "https://archive.orkl.eu/f1e5b814ff4ee85f0be263cdc4a7048fad658933.pdf",
        "text": "https://archive.orkl.eu/f1e5b814ff4ee85f0be263cdc4a7048fad658933.txt",
        "img": "https://archive.orkl.eu/f1e5b814ff4ee85f0be263cdc4a7048fad658933.jpg"
    }
}