{
    "id": "2e90554c-7559-44cf-9f2e-78037649c562",
    "created_at": "2023-01-12T15:05:13.04566Z",
    "updated_at": "2025-03-27T02:16:34.584004Z",
    "deleted_at": null,
    "sha1_hash": "792d4ee200cbaaa65a295b97f95f94333cd18b50",
    "title": "2021-02-25 - Microsoft open sources CodeQL queries used to hunt for Solorigate activity",
    "authors": "",
    "file_creation_date": "2022-05-28T23:09:40Z",
    "file_modification_date": "2022-05-28T23:09:40Z",
    "file_size": 1476737,
    "plain_text": "# Microsoft open sources CodeQL queries used to hunt for Solorigate activity\n\n**[microsoft.com/security/blog/2021/02/25/microsoft-open-sources-codeql-queries-used-to-hunt-for-solorigate-activity/](https://www.microsoft.com/security/blog/2021/02/25/microsoft-open-sources-codeql-queries-used-to-hunt-for-solorigate-activity/)**\n\nFebruary 25, 2021\n\n**UPDATE: Microsoft continues to work with partners and customers to expand our**\nknowledge of the threat actor behind the nation-state cyberattacks that compromised\nthe supply chain of SolarWinds and impacted multiple other organizations. Microsoft\npreviously used ‘Solorigate’ as the primary designation for the actor, but moving\nforward, we want to place appropriate focus on the actors behind the sophisticated\nattacks, rather than one of the examples of malware used by the actors. Microsoft\nThreat Intelligence Center (MSTIC) has named the actor behind the attack against\nSolarWinds, the SUNBURST backdoor, TEARDROP malware, and related\n[components as NOBELIUM. As we release new content and analysis, we will use](https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/)\nNOBELIUM to refer to the actor and the campaign of attacks.\n\nA key aspect of the Solorigate attack is the supply chain compromise that allowed the\nattacker to modify binaries in SolarWinds’ Orion product. These modified binaries were\ndistributed via previously legitimate update channels and allowed the attacker to remotely\nperform malicious activities, such as credential theft, privilege escalation, and lateral\n\n\n-----\n\nmovement, to steal sensitive information. The incident has reminded organizations to reflect\nnot just on their readiness to respond to sophisticated attacks, but also the resilience of their\nown codebases.\n\nMicrosoft believes in leading with transparency and sharing intelligence with the community\nfor the betterment of security practices and posture across the industry as a whole. In this\nblog, we’ll share our journey in reviewing our codebases, highlighting one specific technique:\nthe use of [CodeQL queries to analyze our source code at scale and rule out the presence of](https://securitylab.github.com/tools/codeql)\nthe code-level indicators of compromise (IoCs) and coding patterns associated with\n[Solorigate. We are open sourcing the CodeQL queries that we used in this investigation so](https://aka.ms/Solorigate-CodeQL-Queries)\nthat other organizations may perform a similar analysis. Note that the queries we cover in\nthis blog simply serve to home in on source code that shares similarities with the source in\nthe Solorigate implant, either in the syntactic elements (names, literals, etc.) or in\nfunctionality. Both can occur coincidentally in benign code, so all findings will need review to\ndetermine if they are actionable. Additionally, there is no guarantee that the malicious actor is\nconstrained to the same functionality or coding style in other operations, so these queries\nmay not detect other implants that deviate significantly from the tactics seen in the Solorigate\n[implant. These should be considered as just a part in a mosaic of techniques to audit for](https://techcommunity.microsoft.com/t5/azure-sentinel/solarwinds-post-compromise-hunting-with-azure-sentinel/ba-p/1995095)\ncompromise.\n\nMicrosoft has long had integrity controls in place to verify that the final compiled binaries\ndistributed to our servers and to our customers have not been maliciously modified at any\npoint in the development and release cycle. For example, we verify that the source file\nhashes generated by the compiler match the original source files. Still, at Microsoft, we live\nby the “assume breach” philosophy, which tells us that regardless of how diligent and\nexpansive our security practices are, potential adversaries can be equally as clever and\nresourced. As part of the Solorigate investigation, we used both automated and manual\ntechniques to validate the integrity of our source code, build environments, and production\nbinaries and environments.\n\nMicrosoft’s contribution during Solorigate investigations reflects our commitment to a\n[community-based sharing vision described in Githubification of InfoSec. In keeping with our](https://medium.com/@johnlatwc/the-githubification-of-infosec-afbdbfaad1d1)\nvision to grow defender knowledge and speed community response to sophisticated threats,\n[Microsoft teams have openly and transparently shared indicators of compromise,](https://techcommunity.microsoft.com/t5/azure-active-directory-identity/understanding-quot-solorigate-quot-s-identity-iocs-for-identity/ba-p/2007610) detailed\nattack analysis and MITRE ATT&CK techniques, [advanced hunting queries,](https://techcommunity.microsoft.com/t5/azure-sentinel/solarwinds-post-compromise-hunting-with-azure-sentinel/ba-p/1995095) incident\nresponse guidance, and [risk assessment workbooks during this incident. Microsoft](https://techcommunity.microsoft.com/t5/azure-active-directory-identity/azure-ad-workbook-to-help-you-assess-solorigate-risk/ba-p/2010718)\nencourages other security organizations that share the “Githubification” vision to open source\ntheir own threat knowledge and defender techniques to accelerate defender insight and\nanalysis. As we have shared before, we have compiled a comprehensive resource for\ntechnical details of the attack, indicators of compromise, and product guidance at\n[https://aka.ms/solorigate. As part of Microsoft’s sweeping investigation into Solorigate, we](https://aka.ms/solorigate)\n[reviewed our own environment. As we previously shared, these investigations found activity](https://msrc-blog.microsoft.com/2020/12/31/microsoft-internal-solorigate-investigation-update/))\n\n\n-----\n\nwith a small number of internal accounts, and some accounts had been used to view source\n[code, but we found no evidence of any modification to source code, build infrastructure,](https://www.microsoft.com/security/blog/2021/02/18/turning-the-page-on-solorigate-and-opening-the-next-chapter-for-the-security-community/)\ncompiled binaries, or production environments.\n\n## A primer on CodeQL and how Microsoft utilizes it\n\n[CodeQL is a powerful semantic code analysis engine that is now part of GitHub. Unlike many](https://securitylab.github.com/tools/codeql)\nanalysis solutions, it works in two distinct stages. First, as part of the compilation of source\ncode into binaries, CodeQL builds a database that captures the model of the compiling code.\nFor interpreted languages, it parses the source and builds its own abstract syntax tree\nmodel, as there is no compiler. Second, once constructed, this database can be queried\nrepeatedly like any other database. The CodeQL language is purpose-built to enable the\neasy selection of complex code conditions from the database.\n\nOne of the reasons we find so much utility from CodeQL at Microsoft is specifically because\nthis two-stage approach unlocks many useful scenarios, including being able to use static\nanalysis not just for proactive Secure Development Lifecycle analysis but also for reactive\ncode inspection across the enterprise. We aggregate the CodeQL databases produced by\nthe various build systems or pipelines across Microsoft to a centralized infrastructure where\nwe have the capability to query across the breadth of CodeQL databases at once.\nAggregating CodeQL databases allows us to search semantically across our multitude of\ncodebases and look for code conditions that may span between multiple assemblies,\nlibraries, or modules based on the specific code that was part of a build. We built this\ncapability to analyze thousands of repositories for newly described variants of vulnerabilities\nwithin hours of the variant being described, but it also allowed us to do a first-pass\ninvestigation for Solorigate implant patterns similarly, quickly.\n\n\n-----\n\nWe are open sourcing several of the C# queries that assess for these code-level IoCs, and\n[they can currently be found in the CodeQL GitHub repository. The](https://aka.ms/Solorigate-CodeQL-Queries) [Solorigate-Readme.md](https://aka.ms/Solorigate-CodeQL-ReadMe)\nwithin that repo contains detailed descriptions of each query and what code-level IoCs each\none is attempting to find. It also contains guidance for other query authors on making\nadjustments to those queries or authoring queries that take a different tactic in finding the\npatterns.\n\nGitHub will shortly publish guidance on how they are deploying these queries for existing\nCodeQL customers. As a reminder, CodeQL is free for open-source projects hosted by\nGitHub.\n\n## Our approach to finding code-level IoCs with CodeQL queries\n\nWe used two different tactics when looking for code-level Solorigate IoCs. One approach\nlooks for particular syntax that stood out in the Solorigate code-level IoCs; the other\napproach looks for overall semantic patterns for the techniques present in the code-level\nIoCs.\n\nThe syntactic queries are very quick to write and execute while offering several advantages\nover comparable regular expression searches; however, they are brittle to the malicious\nactor changing the names and literals they use. The semantic patterns look for the overall\ntechniques used in the implant, such as hashing process names, time delays before\ncontacting the C2 servers, etc. These are durable to substantial variation, but they are more\ncomplicated to author and more compute-intensive when analyzing many codebases at\nonce.\n\nBy combining these two approaches, the queries are able to detect scenarios where the\nmalicious actor changed techniques but used similar syntax, or changed syntax but\nemployed similar techniques. Because it’s possible that the malicious actor could change\nboth syntax and techniques, CodeQL was but one part of our larger investigative effort.\n\n## Next steps with CodeQL\n\n\n-----\n\n[The queries we shared in this blog and described in Solorigate-Readme.md target patterns](https://aka.ms/Solorigate-CodeQL-ReadMe)\nspecifically associated with the Solorigate code-level IoCs, but CodeQL also provides many\nother options to query for backdoor functionality and detection-evasion techniques.\n\nThese queries were relatively quick to author, and we were able to hunt for patterns much\nmore accurately across our CodeQL databases and with far less effort to manually review\nthe findings, compared to using text searches of source code. CodeQL is a powerful\ndeveloper tool, and our hope is that this post inspires organizations to explore how it can be\nused to improve reactive security response and act as a compromise detection tool.\n\nIn future blog posts, we’ll share more ways that Microsoft uses CodeQL. We’ll also continue\nopen-sourcing queries and utilities that build upon CodeQL so that others may benefit from\nthem and further build upon them.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-25 - Microsoft open sources CodeQL queries used to hunt for Solorigate activity.pdf"
    ],
    "report_names": [
        "2021-02-25 - Microsoft open sources CodeQL queries used to hunt for Solorigate activity.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535913,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653779380,
    "ts_modification_date": 1653779380,
    "files": {
        "pdf": "https://archive.orkl.eu/792d4ee200cbaaa65a295b97f95f94333cd18b50.pdf",
        "text": "https://archive.orkl.eu/792d4ee200cbaaa65a295b97f95f94333cd18b50.txt",
        "img": "https://archive.orkl.eu/792d4ee200cbaaa65a295b97f95f94333cd18b50.jpg"
    }
}