{
    "id": "2eac3de4-20ef-454e-b6cc-a2b11c46b4c1",
    "created_at": "2022-10-25T16:48:16.946805Z",
    "updated_at": "2025-03-27T02:10:03.766425Z",
    "deleted_at": null,
    "sha1_hash": "45e5e8199a0cc4d393f49136a3f20bc8558243a4",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-06-15T17:05:29Z",
    "file_modification_date": "2017-06-15T17:09:58Z",
    "file_size": 2850459,
    "plain_text": "# FIN10\n###### Anatomy of a Cyber Extortion Operation\n\n**PRIMARY GOAL TO STEAL:** TARGETING CASINOS AND\nBUSINESS DATA, FILES, RECORDS, CORRESPONDENCE AND CUSTOMER PII REQUESTED RANSOMS RANGED\nFROM 100 TO 500 BITCOINS100-500 MINING ORGANIZATIONS IN NORTH AMERICA, WITH A FOCUS ON CANADA BITCOIN RANSOM 100 = $124,000DEMAND AS OF MID-APRIL 2017\n\n\n-----\n\n**2** SPECIAL REPORT\n\n##### CONTENTS\n\nIntroduction 3\n\nBackground 4\n\nTargeting 6\n\nFIN10 Tactics, Techniques and Procedures 6\n\nInitial Compromise 7\n\nEarly Stage Malware 7\n\nLateral Movement & Internal Reconnaissance 8\n\nSystem Disruption 8\n\nEnd-Stage Operations 9\n\nOutlook 10\n\nLessons learned from investigating FIN10 and other disruptive breaches 12\n\nConclusion 14\n\nAppendix - Sample Extortion Email 15\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION **3**\n\n\n**INTRODUCTION**\n\n##### FireEye has identified a set of financially motivated intrusion operations being carried out by an actor we have dubbed FIN10.\n\nWithin these clusters of activity, the attacker(s) have compromised organizations’ networks and sought\nto monetize this illicit access by exfiltrating sensitive data and extorting victim organizations. We have\nobserved FIN10 targeting organizations in North America, predominately in Canada.\n\nFIN10 primarily relies on publicly-available software, scripts and techniques to gain a foothold into\nvictims’ networks. The threat group then posts proof of the stolen data on publicly accessible websites.\nFailure to pay the threat group could result in the public release of stolen data and potential disruption\nor destruction of the victim’s information assets and systems.\n\nIn this report, we describe FIN10’s activities and tactics, techniques and procedures (TTPs), and provide\na glimpse into how they execute their operations.\n\n\n-----\n\n**4** SPECIAL REPORT\n\nTARGETING CASINOS AND\nMINING ORGANIZATIONS IN\nNORTH AMERICA, WITH A\nFOCUS ON CANADA\n\n## Background\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION **5**\n\nFireEye has observed multiple targeted intrusions\n\n#### 100 = $124,000\n\noccurring in North America — predominately\n\nAS OF MID-APRIL 2017\n\nin Canada — dating back to at least 2013 and\ncontinuing through at least 2016, in which the\nattacker(s) have compromised organizations’\nnetworks and sought to monetize this illicit\naccess by exfiltrating sensitive data and\nextorting victim organizations. In some cases,\nwhen the extortion demand was not met, the\nattacker(s) destroyed production Windows\nsystems by deleting critical operating system\nfiles and then shutting down the impacted\nsystems. Based on near parallel TTPs used by\nthe attacker(s) across these targeted intrusions,\nwe believe these clusters of activity are linked\nto a single, previously unobserved actor or\ngroup that we have dubbed FIN10.\n\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION\n\n#### 100 = $124,000\n\nBITCOIN RANSOM AS OF MID-APRIL 2017\n\nDEMAND\n\n\n-----\n\n**6** SPECIAL REPORT\n\n\n**6** SPECIAL REPORT\n\n## Targeting\n\n###### FIN10 Tactics, Techniques and Procedures\n Beginning as early as 2013 and continuing\n The following sections correspond to\n through at least 2016, we have observed the attackers’ TTPs and are organized FIN10 target organizations based in North by the stages of the targeted attack America – predominately in Canada. lifecycle (See Figure 1). Targeted organizations have primarily been casinos and mining organizations.\n\n**E**\n\n**Figure 1. TTPs as organized by targeted attack lifecycle model**\n\n                                  - Compromised\n\ncredentials / VPN\n\n                                - RDP\n\n                                      - Meterpreter\n\n                                     - PowerShell Empire\n\n                                      - SplinterRAT\n\n**INITIAL** **ESTABLISH** **INTERNAL** **COMPLETE**\n**COMPROMISE** **FOOTHOLD** **RECONNAISSANCE** **MISSION**\n\n    - Likely Spear     - Meterpreter     - PowerShell     - Extortion via\n\nPhishing Emails function of Empire False Flag\n\nMetasploit                       - Meterpreter                       - Data Exposure\n\n                      - PowerShell                      - SplinterRAT                      - Destructive Batch\n\nEmpire Scripts\n\n                     - SplinterRAT\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION **7**\n\n\nInitial Compromise\nIn the majority of intrusions attributed to FIN10,\nthere was insufficient evidence to determine\nthe initial infection vector. However, in at least\ntwo intrusions, FIN10 leveraged spear phishing\nemails with malicious attachments, making\nit plausible that this methodology was used\nacross all breaches.\n\n- In both instances where the initial compromise\n\nwas identified, the attacker(s) used social\nengineering and specifically crafted lures to\nentice victims to click on a link that directed\nthem to a FIN10-controlled server. The server\nhosted malicious artifacts that ultimately\nexecuted code on one or more systems. In\nthese instances, the malicious code were\ndownloaders that beaconed out to attackercontrolled infrastructure.\n\n- In one intrusion, the phishing email referenced\n\nan updated holiday schedule for organizational\nstaff. The embedded URL pointed to a\nmalicious HTML Application (HTA) file.\n\n- In another intrusion, a phishing email\n\nreferenced an employee questionnaire. The\nembedded URL pointed to a Word Open XML\nMacro-Enabled Document file (DOCM) file.\n\n- Of note, FIN10 likely uses LinkedIn — among\n\nother social media and public data sources\n— to support the crafting of phishing emails\nthat appear legitimate.\n\nEarly Stage Malware\nThe attacker(s) primarily relied on publiclyavailable software, scripts and techniques to\ngain a foothold into victims’ networks.\n\n**Meterpreter**\nFIN10 used Meterpreter as the primary method\nof establishing an initial foothold within victim\nenvironments. However, in one case, we also\nobserved the group use Splinter Remote Access\nTrojan (SplinterRAT).\n\n\nMeterpreter, short for the Meta-Interpreter, is\nan advanced payload included in the Metasploit\nFramework. It provides functionality that\nwould otherwise be difficult to implement in\nassembly by allowing developers to write their\nown extensions in the form of DLL files that can\nbe uploaded and injected post exploitation.\nMeterpreter and most of its extensions are\nexecuted in memory, thus largely evading\ndetection by standard anti-virus. Due to its\npublic availability, FireEye iSIGHT Intelligence\nhas observed multiple threat actor groups use\nMeterpreter in targeted attacks across various\nindustries.\n\n**PowerShell**\nThreat actors often use PowerShell to write\ntheir own malicious utilities, which typically\ndecrease chance of detection by popular\nendpoint security controls. When scripts are\nexecuted with PowerShell, the scripts run inside\npowershell.exe (locally) or wsmprovhasost.\nexe (remotely), both of which are often trusted\nprocesses. PowerShell provides threat actors\nwith the ability to create scripts that exceed the\ncapabilities of a standard Windows shell, batch\nfiles and VBS files.\n\nIn the majority of cases, we observed FIN10\nleveraging PowerShell Empire (a pen-testing tool\nthat utilizes PowerShell) for elevated persistence,\nmainly by utilizing the Registry and Scheduled\nTask options; however, in at least one intrusion, we\nobserved FIN10 use S4U tasks for this purpose,\nalthough this method was likely abandoned in\nfavor of PowerShell Empire once it was released.\n\nIn at least one instance, PowerShell Empire was\nused to install a randomly named service that\nexecuted a Meterpreter PowerShell script, which\nin turn executed malicious .bat files. The created\nbatch scripts typically contained PowerShell\ncommands for 32-bit and 64-bit operating\nsystems and upon execution could connect to\nan attacker command and control (C2) server.\n\nWe have also observed FIN10 using PowerShell to\nload Metasploit Meterpreter stagers into memory.\n\n\n-----\n\n**8** SPECIAL REPORT\n\nLateral Movement and Internal Reconnaissance\nFIN10 routinely leverages Windows Remote\nDesktop Protocol (RDP) to access systems\nwithin the environment. More specifically,\nattacker(s) leveraged RDP to authenticate to\ninternal systems that were configured to allow\ningress RDP connections from systems residing\noutside organizational firewall perimeters.\nSimilarly, we have observed FIN10, in at least\ntwo instances, use single-factor protected VPN\nto connect remotely to victim networks after\nstealing credentials.\n\nIn multiple events, FIN10 also leveraged\nfunctionality within the PowerShell script\nMeterpreter backdoor to perform internal\nreconnaissance and move laterally throughout\nthe environment. Further analysis found the\nattacker(s) used Meterpreter functionality\nto enumerate users on remote systems and\nexecute additional PowerShell functionality. In\nat least one network compromise, attacker(s)\nmoved laterally using the Local Administrator\naccount and deployed Metasploit Meterpreter\nstagers and SplinterRAT instances on targeted\nsystems. SplinterRAT is an open-source red\nteam collaboration framework. It is a Javabased framework that was publicly available\nand relatively easy to implement with limited\nknowledge. In addition, SplinterRAT provides\ncapabilities such as file system browsing,\nfile upload and download, execution of\n\n\nshell commands and beaconing in case of\ncommunication issues with a C2 server. Both the\nMetasploit related backdoors and SplinterRAT\ninstances were programmed to connect to\nattacker-controlled C2 servers.\n\nWe have regularly observed FIN10 use\nscheduled tasks as a persistence mechanism.\nFor example, in at least one intrusion we\nobserved FIN10 create a scheduled task named\n“C:\\Windows\\System32\\Tasks\\Updater”,\nwhich executed a PowerShell script encoded\nin the Windows registry. The script was\nconfigured to communicate with attackercontrolled C2 infrastructure.\n\nSystem Disruption\nFIN10 routinely deploys destructive batch\nscripts intended to delete critical system files\nand shutdown network systems. Network\ndegradation activity typically consisted of\nthe attacker(s) creating scheduled tasks on\nmultiple systems within the targeted network\nenvironment to disrupt the normal operations\nof those systems by rendering their operating\nsystems unusable. In at least two instances,\nFIN10 created a scheduled task that used\nthe command shown in Figure 2 to delete\nthe Windows directory using the Microsoft\nrobocopy tool on critical systems within\nthe environment.\n\n\n**Figure 2.**\nExample of\nscheduled task\ncreated to disrupt\nnormal operations\n\n\n###### mkdir \"C:\\emptydir\"\n\n robocopy \"C:\\emptydir\" \"C:\\windows\\system32\"/MIR | shutdown /s /t 1800\n\n\nWhile this TTP could potentially be viewed as an attempt by FIN10 to obfuscate malicious\nactivity, the resulting effects of these scheduled tasks were easily detected, suggesting that\nthese activities were intended to lend credence to the perceived threat.\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION **9**\n\n\nEnd-Stage Operations\nWe believe the primary goal of this threat group\nis to steal corporate business data, files, records,\ncorrespondence and customer PII, and then\nto extort victim organizations for non-release\nof the stolen data. The threat group posts\nproof of the stolen data on publicly accessible\nwebsites. Failure to pay the threat group could\nresult in the public release of stolen data and\npotential disruption or destruction of the victim’s\ninformation assets and systems.\n\n**Extortion**\nIn all but one targeted intrusion we have\nattributed to FIN10, the attacker(s) demanded\na variable sum payable in Bitcoin for the nonrelease of sensitive data obtained during\nnetwork reconnaissance stages (See Appendix\nfor sample extortion email).\n\n- Requested sums ranged from 100 to 500\n\nBitcoins (roughly $124,000 to $620,000 as of\nmid-April 2017).\n\n- Notably, we identified at least two victims who\n\nwere issued the same Bitcoin address.\n\n- In the first incident Mandiant investigated that\n\nwas attributed to FIN10, the attacker(s) did not\nextort the targeted organization. However, it is\nplausible that the group was still in the process\nof honing its TTPs.\n\n**Data Exposure**\nFIN10 likely uses a combination of copy tools\nand file transfer utilities to both harvest\nand stage sensitive data. Data exposure is\naccomplished routinely using openly-accessible\nwebsites such as “pastebin.com,” “justpaste.it,”\nand “thepiratebay.se.” We have also observed\nthe group using popular cloud file sharing/\nstorage solutions, such as Dropbox, to receive\nstolen data in extortion attempts\n\nLinks to the leaked data are initially kept private\nand provided solely to the victim organization as\nproof of the authenticity of the compromise.\nWe have seen FIN10 heavily leverage the\n“justpaste.it” service for these purposes.\n\n**Narrative & Messaging**\nAttacker(s) in all instances utilized a false flag — a\nterm used to describe covert operations that are\ndesigned to deceive in such a way that activities\n\n\nappear as though they are being carried out by\nentities, groups or nations other than those who\nactually planned and executed them.\n\n- Based on open-source reporting, the\n\nattacker(s) in at least one intrusion selfidentified as the “Angels_Of_Truth,” and\nclaimed the attacks on the victim were in\nreciprocity for Canada-imposed economic\nsanctions on Russia. The quality of the\nRussian-language posts, however, was\nconsiderably poor and very similar to output\nobtained from online translating solutions,\nmaking it likely the attacker(s) are not native\nRussian speakers and were using this narrative\nto mislead attribution attempts.\n\n- The attacker(s) more commonly used a\n\nmoniker associated with a Serbian hacktivist\ngroup dubbed “Tesla Team.” Given the vast\ndifferences in external targeting calculus\n— targeted industry verticals by FIN10 as\ncompared to political organizations, nongovernmental organizations and websites\nof anti-Serb organizations targeted by Tesla\nTeam — and inconsistencies in tradecraft,\nwe doubt that the Serbian hacktivist group\nTesla Team (previously active in 2013) is\nassociated with FIN10.\n\n–– In at least one intrusion, we observed the\n\ngroup abandon the moniker Tesla Team\nin the group’s last correspondence to the\ntargeted victim and adopt the moniker\n“Anonymous Threat Agent.”\n\n- Emphasis in regional targeting of North\n\nAmerican-based organizations could\npossibly suggest the attacker(s) familiarity\nwith the region.\n\nFIN10 also seeks to increase its leverage by\nsending multiple emails to staff and board\nmembers of the victim organizations, notifying\nthem of the breach and potential consequences\nfor nonpayment. FIN10 also informs open-source\nblogs about breaches in a likely effort to publicly\nexpose these breaches and apply additional\npressure on affected organizations to acquiesce\nto extortion demands. Alternatively, it is just as\nplausible FIN10 does this to simply maximize\nexposure for victims who do not pay. Notably,\nwe have also observed the group engage local\njournalists to publicize these breaches.\n\n\n-----\n\n**10** SPECIAL REPORT\n\n#### 500 = $620,000\n\nBITCOIN RANSOM AS OF MID-APRIL 2017\n\nDEMAND\n\n## Outlook\n\n#### 100-500\n\nREQUESTED RANSOMS RANGED\nFROM 100 TO 500 BITCOINS\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION\n\nThe relative degree of operational success enjoyed by FIN10 makes it\nhighly probable the group will continue to conduct similar extortionbased campaigns at least in the near term. Notably, we already have\nsome evidence to suggest FIN10 has targeted additional victims beyond\ncurrently confirmed targets.\n\n\n**11**\n\n\nFurthermore, while FIN10 is predominantly financially motivated, as\nevidenced by its preferred monetization technique (i.e., extortion), it is\nplausible the group is also motivated, at least in part, by ego. For instance,\nthe group’s willingness to contact cyber security bloggers is likely the\nresult of at least two motivational factors:\n\n### 1 2\n\nTo further the groups operational To gain some degree of notoriety\nobjectives, likely by putting and public exposure of the\nincreased pressure on targeted group’s campaigns\nvictims to acquiesce to now public\nextortion demands\n\nWhile the secondary motivation may be a necessary byproduct of the first,\nmore primary objective, desire to gain notoriety could potentially influence\nthe group’s decision-making calculus.\n\nLastly, while FIN10 has seemingly only targeted organizations within two\nindustry verticals, it is possible the group has previously or will in the\nfuture expand their regional and industry-specific targeting. Historically,\nwe have seen this type of threat activity — cyber attacks resulting in the\ntheft or compromise of sensitive data to be leveraged in extortion plots —\naffect multiple targeted verticals.\n\n|1|2|\n|---|---|\n|To further the groups operational objectives, likely by putting increased pressure on targeted victims to acquiesce to now public extortion demands|To gain some degree of notoriety and public exposure of the group’s campaigns|\n\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION\n\n\n-----\n\n**12** SPECIAL REPORT\n\n## Lessons Learned\n\n##### from investigating FIN10 and other disruptive breaches\n\nResponding to disruptive breaches such as FIN10 is challenging and not easy to plan for given the dynamic\nnature of these attacks and the attacker(s). Unlike breaches where a containment plan may be able to stop an\nattacker from stealing more information, in these disruptive instances the damage may have already been done\nby the time the attacker(s) contacts the victim organization. Therefore, a different response to these incidents\nmight be required. The following ten lessons from our incident response engagements may help organizations\ndeal with disruptive attacks, including those from groups such as FIN10:\n\n###### 1 2 3 4 5\n\n**CONFIRM THERE** **REMEMBER THAT** **TIMING IS** **STAY** **CAREFULLY**\n**IS A BREACH** **YOU’RE DEALING** **CRITICAL** **FOCUSED** **EVALUATE**\n\n**WITH A HUMAN** **WHETHER TO**\n**ADVERSARY** **ENGAGE WITH**\n\n**THE ATTACKER(S)**\n\nJust because someone Humans can be You need to validate It’s easy to get distracted. Attackers do not always\nclaimed they hacked unpredictable and they and scope the breach Evaluate whether the tasks expect a response.\nyou doesn’t necessarily may react out of emotion. as quickly as possible. you are taking on will help If you decide to respond,\nmake it true. Empty Carefully consider how This may require the mitigate, detect, respond limit the interactions\nextortion attempts are an attacker will react to team working nights and to or contain the attack. and carefully consider\nnot uncommon. Examine your action or inaction. weekends, so be careful Remember that you’re everything you say.\nyour environment for They can become more of fatigue and burnout. racing against the clock. Consider involving\nevidence of compromise aggressive if they get You may need to approve Focus on the must-haves law enforcement and\nbefore considering to pay upset. They may back emergency change instead of the nice-to- legal counsel in all\nthe ransom. Usually FIN10 down and allow for more requests within short order. haves and understand that communications.\nprovides data as proof time if they believe you you may need to deploy\n(see the ‘Data Exposure’ are trying to meet their a number of temporary\nsection), so confirm demands. solutions to address the\nthat the data is real and attack.\ndetermine if it came from\nyour environment.\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION **13**\n\n**PRIMARY GOAL TO STEAL:**\nBUSINESS DATA, FILES,\nRECORDS, CORRESPONDENCE\nAND CUSTOMER PII\n\n###### 6 7 8 9 10\n\n**ENGAGE THE EXPERTS** **CONSIDER ALL** **ENSURE STRONG** **AFTER THE INCIDENT** **IF YOU KICK THEM**\n**BEFORE A BREACH** **OPTIONS WHEN** **SEGMENTATION AND** **HAS BEEN HANDLED,** **OUT, THEY MAY TRY**\n\n**ASKED TO PAY A** **CONTROLS OVER** **IMMEDIATELY FOCUS** **TO COME BACK IN A**\n**RANSOM** **YOUR BACKUPS** **ON BROADER SECURITY** **DIFFERENT WAY**\n\n**IMPROVEMENTS**\n\nYou will need forensic, Understand that paying the Most organizations have Regardless of the Don’t forget to\nlegal and public relations ransom may be the right mature backup policies so outcome, you should operationalize and\nsupport to get through a option, but there are no they can recover quickly ensure that attackers such enhance the temporary\ndisruptive breach. Identify guarantees the attacker(s) in the event of a system as FIN10 cannot come solutions that were\npartners before the breach won’t come back for failure. However, it’s back in and do more deployed to immediately\nand get them on retainer. more money or simply common for the systems damage. You also don’t address the attack.\n\nleak the data anyway. containing backups to want a second attacker Conduct penetration\nInclude experts in the be part of the same targeting you because testing and Red Team\ndecision-making process environment compromised they think you are willing assessments to validate\nand understand the risks by the attacker. Tighten to pay a ransom. Ensure your security controls,\nassociated with all options. access to your backup you understand the full identify vulnerabilities and\n\nenvironment to mitigate extent of the breach and fix them immediately.\nthe risk of an attacker implement both tactical\naccessing the system using and strategic actions to\ncompromised credentials prevent future attackers\nand destroying your from gaining access.\nbackups.\n\n\n-----\n\n**14** SPECIAL REPORT\n\n### Conclusion\n\nAlthough FireEye has observed FIN10 primarily\ntargeting casinos and mining organizations in\nNorth America (with a focus on Canada), all\norganizations from around the world must be\nprepared to detect and respond to threats from\nthis group and other bad actors.\n\nWe believe the primary goal of FIN10 is to\nsteal corporate business data, files, records,\ncorrespondence and customer PII for the\npurposes of extorting victim organizations for\nthe non-release of the stolen data. Enterprises\nthat are contacted by a group claiming to have\ntheir data will want to carefully assess if an\nincident has actually occurred. In the case of\nFIN10, we have observed them posting proof of\nthe stolen data on publicly accessible websites.\n\nWhen dealing with these types of extortion-\nbased attacks, we strongly recommend that\norganizations work quickly, stay focused, consider\nall options and potentially involve forensic, legal,\nlaw enforcement and public relations experts\nbefore taking any actions or communicating\nwith the threat actor. Strong segmentation and\ncontrols over backups will help organizations to\nquickly recover from a breach. Additionally, when\nthe incident has been resolved organizations\nshould focus on broader security improvements\nand ensuring the threat actor cannot come back\nin a different way.\n\n\n-----\n\nFIN10: ANATOMY OF A CYBER EXTORTION OPERATION **15**\n\n### Appendix – Sample Extortion Email\n\nThe text below is a redacted email that FIN10 sent to one of their victims.\n\n\n-----\n\n###### To download this or other FireEye Threat Intellience reports, visit: www.fireeye.com/reports\n\n**FireEye, Inc.**\n1440 McCarthy Blvd. Milpitas, CA 95035\n408.321.6300 / 877.FIREEYE (347.3393) / info@FireEye.com\n\n**www.FireEye.com**\n\nFireEye is the intelligence-led security company. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative\nsecurity technologies, nation-state grade threat intelligence, and world-renowned Mandiant® consulting. With this approach, FireEye eliminates the complexity and burden of cyber\nsecurity for organizations struggling to prepare for, prevent, and respond to cyber attacks. FireEye has over 5,300 customers across 67 countries, including more than 845 of the\nForbes Global 2000.\n\n© 2017 FireEye, Inc. All rights reserved. FireEye is a registered trademark of FireEye, Inc.\nAll other brands, products, or service names are or may be trademarks\nor service marks of their respective owners. SP.FIN10.EN-US.062017\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www2.fireeye.com/rs/848-DID-242/images/rpt-fin10.pdf",
        "http://australiansecuritymagazine.com.au/wp-content/uploads/2017/06/rpt-fin10.pdf"
    ],
    "report_names": [
        "rpt-fin10.pdf"
    ],
    "threat_actors": [
        {
            "id": "d134593b-1325-47ab-9bb7-b47d6473e352",
            "created_at": "2022-10-25T15:50:23.827908Z",
            "updated_at": "2025-03-27T02:00:55.554076Z",
            "deleted_at": null,
            "main_name": "FIN10",
            "aliases": [
                "FIN10"
            ],
            "source_name": "MITRE:FIN10",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e3a488e-d304-4431-92e0-c8b9c80542bf",
            "created_at": "2022-10-25T16:07:23.627198Z",
            "updated_at": "2025-03-27T02:02:09.895667Z",
            "deleted_at": null,
            "main_name": "FIN10",
            "aliases": [],
            "source_name": "ETDA:FIN10",
            "tools": [
                "EmPyre",
                "EmpireProject",
                "KOMPROGO",
                "PowerShell Empire",
                "Splinter RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "277b5119-e193-4f98-b18a-c6db644f32f3",
            "created_at": "2023-01-06T13:46:38.971767Z",
            "updated_at": "2025-03-27T02:00:02.966286Z",
            "deleted_at": null,
            "main_name": "FIN10",
            "aliases": [
                "G0051"
            ],
            "source_name": "MISPGALAXY:FIN10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041403,
    "ts_creation_date": 1497546329,
    "ts_modification_date": 1497546598,
    "files": {
        "pdf": "https://archive.orkl.eu/45e5e8199a0cc4d393f49136a3f20bc8558243a4.pdf",
        "text": "https://archive.orkl.eu/45e5e8199a0cc4d393f49136a3f20bc8558243a4.txt",
        "img": "https://archive.orkl.eu/45e5e8199a0cc4d393f49136a3f20bc8558243a4.jpg"
    }
}