{
    "id": "2ebc57b9-7fe5-4c62-9acf-eacb93512bcf",
    "created_at": "2022-10-25T16:48:23.534955Z",
    "updated_at": "2025-03-27T02:17:05.757905Z",
    "deleted_at": null,
    "sha1_hash": "f86cc703b475135372a6639e12d4651121e23fff",
    "title": "CRASHOVERRIDE Analysis of the Threat to Electric Grid Operations",
    "authors": "Dragos",
    "file_creation_date": "2017-06-14T00:12:46Z",
    "file_modification_date": "2017-06-14T00:12:54Z",
    "file_size": 2913349,
    "plain_text": "# CRASHOVERRIDE\n## Analysis of the Threat to Electric Grid Operations\n\n**DRAGOS INC / WWW DRAGOS COM**\n\n\n-----\n\n### CRASHOVERRIDE Analyzing the Threat to Electric Grid Operations\n\n#### Contents\nExecutive Summary 3\nWhy Are We Publishing This 3\nKey Takeaways 4\nBackground 5\nIntroduction to Electric Grid Operations 6\nEvolution of Tradecraft 8\nSTUXNET 8\nDragonfly/HAVEX 9\nBLACKENERGY 2 10\nUkraine Cyber Attack 2015 10\nCRASHOVERRIDE 11\nCapabilities 12\nCapabilities Overview 12\nModule Commonalities 13\nBackdoor/RAT Module 13\nLauncher Module 15\nData Wiper Module 16\nIEC 104 Module 17\nIEC 101 Module 21\n61850 Module 21\nOPC DA Module 21\nSIPROTECT DoS Module 22\nCapability Conclusions 22\nImplications of capability 22\nAttack Option: De-energize substation 22\nAttack Option: Force an Islanding event 23\nAdding Amplification Attacks 24\nUsing OPC to create a Denial of Visibility 24\nUsing CVE-2015-5374 to hamper protective relays 25\n\n\n-----\n\n##### p\n\n#### Executive Summary\n\nDragos, Inc. was notified by the Slovak anti-virus firm ESET of an ICS tailored mal­\nware on June 8th, 2017. The Dragos team was able to use this notification to find\nsamples of the malware, identify new functionality and impact scenarios, and con­\nfirm that this was the malware employed in the December 17th, 2016 cyber-attack\non the Kiev, Ukraine transmission substation which resulted in electric grid opera­\ntions impact. This report serves as an industry report to inform the electric sector\nand security community of the potential implications of this malware and the appro­\npriate details to have a nuanced discussion.\n\n#### Why Are We Publishing This\n\nSecurity firms must always balance a need to inform the public against empowering\nadversaries with feedback on how they are being detected and analyzed. This case is\nno different. In fact, it is more important given that there is no simple fix as the capa­\nbility described in this report takes advantage of the knowledge of electric grid sys­\ntems. It is not an aspect of technical vulnerability and exploitation. It cannot just be\npatched or architected away although the electric grid is entirely defensible. Human\ndefenders leveraging an active defense such as hunting and responding internally to\nthe industrial control system (ICS) networks can ensure that security is maintained.\n\n\npatched or architected away although the electric grid is entirely defensible. Human\ndefenders leveraging an active defense such as hunting and responding internally to\nthe industrial control system (ICS) networks can ensure that security is maintained.\n\n\n-----\n\n##### p\n\n#### Key Takeaways\n\n- The malware self-identifies as “crash” in multiple locations thus leading to the\nnaming convention “CRASHOVERRIDE” for the malware framework.\n\n- CRASHOVERRIDE is the first ever malware framework designed and deployed to\nattack electric grids.\n\n- CRASHOVERRIDE is the fourth ever piece of ICS-tailored malware (STUXNET,\nBLACKENERGY 2, and HAVEX were the first three) used against targets and the\nsecond ever to be designed and deployed for disrupting physical industrial pro­\ncesses (STUXNET was the first).\n\n- CRASHOVERRIDE is not unique to any particular vendor or configuration and\ninstead leverages knowledge of grid operations and network communications\nto cause impact; in that way, it can be immediately re-purposed in Europe and\nportions of the Middle East and Asia.\n\n- CRASHOVERRIDE is extensible and with a small amount of tailoring such as the\ninclusion of a DNP3 protocol stack would also be effective in the North Ameri­\ncan grid.\n\n- CRASHOVERRIDE could be leveraged at multiple sites simultaneously, but the\nscenario is not cataclysmic and would result in hours, potentially a few days, of\noutages, not weeks or more.\n\n- Dragos assesses with high confidence that the same malware was used in the\ncyber-attack to de-energize a transmission substation on December 17, 2016,\nresulting in outages for an unspecified number of customers.\n\n- The functionality in the CRASHOVERRIDE framework serves no espionage pur­\npose and the only real feature of the malware is for attacks which would lead to\nelectric outages.\n\n- CRASHOVERRIDE could be extended to other industries with additional pro­\ntocol modules, but the adversaries have not demonstrated the knowledge of\nother physical industrial processes to be able to make that assessment anything\nother than a hypothetical at this point and protocol changes alone would be\ninsufficient.\n\n- Dragos, Inc. tracks the adversary group behind CRASHOVERRIDE as ELECTRUM\nand assesses with high confidence through confidential sources that ELECTRUM\nhas direct ties to the Sandworm team. Our intelligence ICS WorldView cus­\ntomers have received a comprehensive report and this industry report will not\nget into sensitive technical details but instead focus on information needed for\ndefense and impact awareness.\n\n\n-----\n\n##### p\n\n#### Background\n\nOn June 8th, 2017 the Slovak anti-virus firm ESET shared a subset of digital hash­\nes of the malware described below and a portion of their analysis with Dragos.\nThe Dragos team was asked to validate ESET’s findings to news publications ESET\nhad contacted about the story which would be published June 12th, 2017. Dragos\nwould like to thank ESET for sharing the digital hashes which allowed the Dragos\nteam to spawn its investigation. Without control of the timeline, it was Dragos’\ndesire to publish a report alongside ESET’s report to capture the nuance of elec­\ntric grid operations. The report also contains new discoveries, indicators, and im­\nplications of the tradecraft. Also, because of the connection to the activity group\nDragos tracks as ELECTRUM, it was our decision that an independent report was\nwarranted. The Dragos team has been busy over the last 96 hours reproducing and\nverifying ESET’s analysis, hunting for new samples of the malware and potential ad­\nditional infections, notifying appropriate companies, and informing our customers.\nImportantly, Dragos also updated ICS vendors that needed to be made aware of\nthis capability, relevant government agencies, many national computer emergen­\ncy response teams (CERTs), and key players in the electric energy community. Our\nmany thanks to those involved.\n\nIf you are a Dragos, Inc. customer, you will have already received the more concise\nand technically in-depth intelligence report. It will be accompanied by follow-on\nreports, and the Dragos team will keep you up-to-date as things evolve. It is in\nDragos’ view that the following report contains significant assessments that de­\nserve a wide audience in the electric sector. Avoiding hype and fear should always\nbe paramount but this case-study is of immediate significance, and this is not a\nsingular contained event. The CRASHOVERRIDE capability is purpose built to im­\npact electric grid operations and has been created as a framework to facilitate the\nimpact of electric grids in other countries in the future outside the attack that took\nplace with it December 17th, 2016 in Ukraine. However, as always, the defense is\ndoable.\n\n\n-----\n\n##### p\n\n###### Introduction to Electric Grid Operations\n\nAs with most ICS specific incidents, the most interesting components of the attack\nare in how the adversary has demonstrated they understand the physical industri­\nal process. Whereas vulnerabilities, exploits, and infection vectors can drive dis­\ncussions in intrusion analysis of IT security threats that is not the most important\naspect of an ICS attack. To fully understand the CRASHOVERRIDE framework, its\nindividual capabilities, and overall impact on ICS security it is important to under­\nstand certain fundamentals of electric grid operations.\n\nSimplistically, the electric grid can be categorized into three functions: generation\nof electricity at power plants, transmission from the power plants across typically\nlong distances at high voltage, and then stepped down to lower voltage to distribu­\ntion networks to power customers. Along these long transmission and distribution\nsystems are substations to transform voltage levels, serve as switching stations and\nfeeders, and fault protection.\n\nMany industries feed into the electric grid, and those differences require different\nsystems and communications. As an example, while a power plant feeds energy\ninto the electric grid there is no one-size-fits-all approach to power plants. There\nare power plants that cover different sources of fuel including coal-fired, nuclear\ngeneration, wind farm, solar farm, gas turbine power, hydroelectric and more. This\nmeans that the electric grid must be a robust, almost living creature, which moves\nand balances electricity across large regions. Electric grids use a special type of\nindustrial control system called a supervisory control and data acquisition (SCADA)\nsystem to manage this process across large geographical areas. Transmission and\ndistribution owners have their substations in their particular geographical footprint\nand control centers manage the cross-territory SCADA systems 24/7 by human op­\nerators. These control centers often regularly manage the continual demand and\nresponse of their customers, respond to faults, and plan and work with neighboring\nutilities.\n\nThis simplistic view of grid operations is similar around the world. There are of­\nten vendor and network protocol differences between countries but the electrical\nengineering, and the overall process is largely the same between nations. As an\nexample, these systems use SCADA and leverage systems such as remote terminal\nunits (RTUs) to control circuit breakers. As the breakers open and close, substations\nare energized or de-energized to balance power across the grid. Some network\nprotocols such as IEC 104, a TCP-based protocol, and its serial protocol compan­\nion IEC 101, are often regional specific. Europe, some of Asian, and portions of\nthe Middle East leverage these protocols to control RTUs from the SCADA human\nmachine interfaces (HMIs).\n\n\n-----\n\n##### p\n\nFigure 1: Simplistic Mockup of Electric Grid Operations Systems and Communications Relevant for CRASHOVERRIDE\n\nIn North America, the protocol of choice for this is the Distributed Network Proto­\ncol 3 (DNP3). The various protocols purposes are largely the same though: control\nphysical equipment through RTUs, programmable logic controllers (PLCs), and\nother final control elements via HMIs as a part of the larger SCADA system. Some\nprotocols have been adopted cross-country including IEC 61850 which is usual­\nly leveraged from an HMI to work with equipment such as digital relays and other\ntypes of intelligent electronic devices (IEDs). IEDs are purpose built microproces­\nsor-based control devices and can often be found alongside power equipment\nsuch as circuit breakers. IEDs and RTUs operate in a master/slave capacity where\nthe slave devices are polled and sent commands by master devices.\n\n\n-----\n\n##### p\n\nSubstations manage the flow of power through transmission or distribution lines.\nManagement of energizing and de-energizing of these lines ultimately control\nwhen and where the flow of power moves in and out of the substation. If you\n“open” a breaker you are removing the path where the electricity is flowing, or\nde-energizing it. If you “close” a breaker then you are energizing the line by closing\nthe gap and allowing the power to “flow.” This concept is similar to anyone who\nhas tripped (opened) a breaker in their house. Traditional “IT” or “IT security” staff\nmay be confused on this terminology as it is opposite to how one would describe\nfirewall rules where “open” means network traffic may flow and “closed” means\nnetwork traffic is prohibited.\n\nThe grid is a well-designed system, and while damage can be done, it is vital to un­\nderstand that in nations around the world the electric community has designed the\nsystem to be reliable and safe which has a natural byproduct of increased securi­\nty. In the United States as an example, reliability is reinforced with regular training\nand events such as the North American grid’s GridEx where grid operators train for\nevents from hurricanes, to terrorist incidents, to cyber-attacks and how they will\nrespond to such outages. There is constantly a balance that must be understood\nwhen referring to grid operations: yes, the systems are vulnerable and more must\nbe done to understand complex and multi-stage attacks, but the grid is also in a\ngreat defensible position because of the work of so many over the years.\n\n#### Evolution of Tradecraft\n\nCRASHOVERRIDE represents an evolution in tradecraft and capabilities by ad­\nversaries who wish to do harm to industrial environments. To fully appreciate the\nmalware it is valuable to compare it to its predecessors and the Ukraine 2015 cyber\nattack.\n\n###### STUXNET\n\nThe STUXNET malware has been written about extensively and referenced, at\ntimes, unfortunately, in comparison to most ICS related incidents and malware. It\nwas the first confirmed example of ICS tailored malware leveraged against a tar­\nget. The Windows portion of the code with its four zero-day exploits gained a lot\nof notoriety. However, it was the malware’s payload that was specific to ICS that\nwas the most interesting component. The tradecraft exhibited by STUXNET was\nthe detailed understanding of the industrial process. In IT networks, it is important\nfor adversaries to identify vulnerabilities and exploit them to load malware and gain\nprivileges on systems.\n\n\n-----\n\n##### p\n\nIn ICS networks though, some of the most concerning issues are related to an\nadversary’s ability to learn the physical process such as the engineering of the\nsystems and their components in how they work together. STUXNET’s greatest\nstrength was leveraging functionality in Siemens equipment to interact with nucle­\nar enrichment centrifuges through abuses of intended functionality. The purpose\nof the Siemens equipment was to be able to control and change the speed of the\ncentrifuges. Stuxnet did this as well but with pre-programmed knowledge from the\nattackers on the speeds that would cause the centrifuge to burst from their cas­\nings. ICS tailored malware leveraging knowledge of industrial processes was now a\nthing. However, it was specific to Siemens equipment and unique to the Natanz fa­\ncility in Iran. While tradecraft and exploits can be replicated, it was not reasonable\nto re-purpose the Stuxnet capability.\n\n###### Dragonfly/HAVEX\n\nThe Dragonfly campaign was an espionage effort that targeted numerous industrial\ncontrol system locations, estimates put it at over 2,000 sites, with a large empha­\nsis on electric power and petrochemical asset owners. The Dragonfly campaign\nleveraged the HAVEX malware. There are often not many commonalities between\ndifferent industrial sites. Even a single substation in one company can be almost\nentirely different than a substation in the same company based on vendors, imple­\nmentation, integration, and the physical processes required at each site. One of the\nfew commonalities across numerous ICS industries though is the OPC protocol.\nIt is designed to be the universal translator for many industrial components and is\nreadily accessible in an HMI or dedicated OPC server. The HAVEX malware lever­\naged legitimate functionality in the OPC protocol to map out the industrial equip­\nment and devices on an ICS network. It was a clever use of the protocol and while\nthe malware itself was not complex the tradecraft associated with the usage of\nOPC was sophisticated. However, the Dragonfly campaign was focused entirely on\nespionage. There was no physical disruption or destruction of the industrial pro­\ncess. Instead, it was the type of data you would want to leverage to design attacks\nin the future built for the specific targets impacted with the malware.\n\n\n-----\n\n##### p\n\n###### BLACKENERGY 2\n\nThe Sandworm team has targeted numerous industries ranging from western mil­\nitaries, governments, research organizations, defense contractors, and industrial\nsites. It was their use of the BLACKENERGY 2 malware that caught the ICS indus­\ntry’s attention. This ICS tailored malware contained exploits for specific types of\nHMI applications including Siemens SIMATIC, GE CIMPLICITY, and Advantech We­\nbAccess. BLACKENERGY 2 was a smart approach by the adversaries to target in­\nternet connected HMIs. Upon exploitation of the HMIs, the adversaries had access\nto a central location in the ICS to start to learn the industrial process and gain the\ngraphical representation of that ICS through the HMI. The targeting of HMIs alone\nis often not enough to cause physical damage, but it is an ideal target for espio­\nnage and positioning in an ICS. Gaining a foothold in the network that had access\nto numerous components of the ICS while maintaining command and control to\nInternet locations, positioned it well for espionage.\n\n###### Ukraine Cyber Attack 2015\n\nThe cyber-attack on three power companies in Ukraine on December 23rd, 2015\nmarked a revolutionary event for electric grid operators. It was the first known in­\nstance where a cyber-attack had disrupted electric grid operations. The Sandworm\nteam was attributed to the attack and their use of the BLACKENERGY 3 malware.\nBLACKENERGY 3 does not contain ICS components in the way that BLACKENER­\nGY 2 did. Instead, the adversaries leveraged the BLACKENERGY 3 malware to gain\naccess to the corporate networks of the power companies and then pivot into the\nSCADA networks. While in the environment the adversaries performed their recon­\nnaissance and eventually leveraged the grids systems against itself. They learned\nthe operations and used the legitimate functionality of distribution management\nsystems to disconnect substations from the grid leaving 225,000+ customers\nwithout power for upwards of 6 hours until manual operations could restore pow­\ner. However, due to the wiping of Windows systems through the KillDisk malware\nand destruction of serial-to-Ethernet devices through malicious firmware updates,\nthe Ukrainian grid operators were without their SCADA environment, meaning they\nlost the ability for automated control, for upwards of a year in some locations. The\nmost notable aspect of the attack was the adversary’s focus on learning how to\nleverage the systems against themselves. Malware enabled the attack, and malware\ndelayed restoration efforts, but it was the direct interaction of the adversary lever­\naging the ICS against itself that resulted in the electric power disruptions, not mal­\nware.\n\n\n-----\n\n##### p\n\n###### CRASHOVERRIDE\n\nThe CRASHOVERRIDE malware impacted a single transmission level substation\nin Ukraine on December 17th, 2016. Many elements of the attack appear to have\nbeen more of a proof of concept than what was fully capable in the malware. The\nmost important thing to understand though from the evolution of tradecraft is the\ncodification and scalability in the malware towards what has been learned through\npast attacks. The malware took an approach to understand and codify the knowl­\nedge of the industrial process to disrupt operations as STUXNET did. It leveraged\nthe OPC protocol to help it map the environment and select its targets similar to\nHAVEX. It targeted the libraries and configuration files of HMIs to understand the\nenvironment further and leveraged HMIs to connect to Internet-connected lo­\ncations when possible as BLACKENERGY 2 had done. And it took the same type\nof approach to understanding grid operations and leveraging the systems against\nthemselves displayed in Ukraine 2015’s attack. It did all of these things with added\nsophistication in each category giving the adversaries a platform to conduct at­\ntacks against grid operations systems in various environments and not confined to\nwork only on specific vendor platforms. It marks an advancement in capability by\nadversaries who intend to disrupt operations and poses a challenge for defenders\nwho look to patching systems as a primary defense, using anti-malware tools to\nspot specific samples, and relying upon a strong perimeter or air-gapped network\nas a silver-bullet solution. Adversaries are getting smarter, they are growing in their\nability to learn industrial processes and codify and scale that knowledge, and de­\nfenders must also adapt.\n\n\n-----\n\n##### p\n\n#### Capabilities\n\n###### Capabilities Overview\n\nThe CRASHOVERRIDE malware is a modular framework consisting of an initial\nbackdoor, a loader module, and several supporting and payload modules.\n\nThe most important items are the backdoor, which provides access to the infected\nsystem, the loader module, which enables effects on the target, and the individual\npayload modules. Dragos focused our analysis on the previously mentioned items\nas they are most relevant for defending grid operations.\n\nDragos analysts were able to obtain two samples of the malware related to effects\non the targeted industrial control system. One sample was the IEC 104 protocol\nmodule, and the other sample was the data wiper. Both samples shared common\ndesign characteristics indicative of being part of a broader ICS attack and manip­\nulation framework. ESET was able to uncover an additional IEC 61850 and OPC\nmodule which they have analyzed and shared with Dragos.\n\nBelow contains an overview of program execution flow and dependency.\n\n\nmodule which they have analyzed and shared with Dragos.\n\nBelow contains an overview of program execution flow and dependency.\n\nFigure 2. CRASHOVERRIDE Module Overview Including ESET’s Discoveries\n\n\n-----\n\n##### p\n\n###### Module Commonalities\n\nDragos analysts were able to determine the compile time for both modules ob­\ntained as being within 12 minutes of each other just after 2:30 am on December\n18th in an unknown time zone although timestamps for both samples were zeroed\nout. These times falls in the same timeframe as the Ukraine events. Both mod­\nule samples exported a function named Crash that served as the main function to\nbegin execution. The common Crash function enables the ability to “plug and play”\nadditional modules.\n\n###### Backdoor/RAT Module\n\nKey Features\n\n- Authenticates with a local proxy via the internal network established before the\nbackdoor installation\n\n- After authentication opens HTTP channel to external command and control\nserver (C2) through internal proxy\n\n- Receives commands via the external command and control (C2) server\n\n- Creates a file on the local system (contents not determined)\n\n- Overwrites an existing service to point to the backdoor so the malware persists\nbetween reboots\n\n**Details**\n\nAccess to the ICS network flows through a backdoor module. Dragos obtained\nfour samples which all featured similar functionality. On execution, the malware\nattempts to contact a hard-coded proxy address located within the local network.\nELECTRUM must establish the internal proxy before the installation of the back­\ndoor.\n\nThe malware expects to communicate to an internal proxy listening on TCP 3128.\nThis port is a default port associated with the Squid proxy. The beaconing contin­\nues without pause until it establishes a connection. The backdoor then sends a se­\nries of HTTP POST requests with the victim’s Windows GUID (a unique identifier set\nwith every Windows installation) in the HTTP body. This information authenticates\nthe targeted machine to the command and control (C2) server. If the C2 server\ndoes not respond, the backdoor will exit.\n\n\n-----\n\n##### p\n\nIf the authentication is successful to the internal proxy, the malware attempts to per­\nform an HTTP CONNECT to an external C2 server via the internal proxy. Across four\nsamples, Dragos identified three different C2 addresses which were likely part of the\nDecember 2016 attack on Ukraine:\n```\n   195.16.88.6\n   93.115.27.57\n   5.39.218.152\n\n```\nA check of the TOR project’s ExoneraTOR service indicates that all of the listed IP ad­\ndresses were listed as active TOR nodes during the events in Ukraine.\n\nWhen performing the HTTP CONNECT, the malware attempts to identify the system\ndefault user agent. If this cannot be determined or does not exist, then a hard-coded\ndefault for the malware is used:\n```\n   Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; InfoPath.1)\n\n```\nThe malware can be configured to beacon out periodically afterwards via a hard-coded\nconfiguration value. The implant is designed to retrieve commands from the C2 server:\n\n   - Create a new process as logged in user\n\n   - Create a new process as specified user via CreateProcessWithLogon\n\n   - Write a file\n\n   - Copy a file\n\n   - Execute a command as logged in user\n\n   - Execute a command as specified user\n\n   - Kill the backdoor\n\n   - Stop a service\n\n   - Specify a user (log in as user) and stop a service\n\n   - Specify a user (log in as user) and start a service\n\n   - Alter an existing service to point to specified process and change to start at boot\n\nExecution results in several artifacts left on the host. During execution, the malware\nchecks for the presence of a mutex value. Mutexes are program objects that name re­\nsources to enable sharing with multiple program threads. In this case, CRASHOVERRIDE\nchecks the following:\n```\n   \\Sessions\\1\\Windows\\ApiPortection\n\n```\n\n-----\n\n##### p\n\nThe backdoor may also create and check a blank mutex name. Reviewing memo­\nry during execution and analysis of other modules in the malware indicates that \\\nSessions\\1\\Windows\\ appears multiple times, indicating that a check may be per­\nformed.\n\nThe backdoor writes a file to either C:\\Users\\Public\\ or C:\\Users\\<Executing User>\n\nThe contents of this file were not discovered during our analysis, and it did not\nappear to be vital to the malware functionality. However, this is a good indicator of\nthe observed activity and may be leveraged to detect this specific sample through\nhost-based indicator checking.\n\nThe service manipulation process is the only persistence mechanism for the mal­\nware. When used, the adversary can select an arbitrary system service, direct it to\nrefer to CRASHOVERRIDE, and ensure it is loaded on system boot. If this fails, the\nmalware, although present on disk, will not start when the machine reboots.\n\nWhen evaluating the options provided to the adversary, an important piece of\nfunctionality associated with most remote access tools is absent: a command to\nexfiltrate data. While this functionality could be created via the command execu­\ntion options, one would expect this option to be explicit given options to down­\nload and copy files on the host if the adversary intended to use the tool as an\nall-encompassing backdoor and espionage framework. Instead, the functionality\nof this tool is explicitly designed for facilitating access to the machine and execut­\ning commands on the system and cannot reasonably be confused as an espionage\nplatform, data stealer, or another such item.\n\n###### Launcher Module\n\n**Key Features**\n\n   - Loads payload modules which manipulate the ICS and cause destruction via\nthe wiper\n\n   - Starts itself as a service likely to hide better\n\n   - Loads the payload module(s) defined on the command line during execu­\ntion\n\n   - Launches the payload and begins either 1 or 2 hours countdown before\nlaunching the data wiper (variant dependent)\n\n\n-----\n\n##### p\n\n**Details**\n\nWithin the attack sequence, the ICS payload modules and data wiper module must be\nloaded by a separate loader EXE. Dragos obtained one sample of this file called the\nLauncher.\n\nThe launcher takes three parameters on start:\n\nLauncher.exe <Working Directory> payload.dll configuration.ini\n\nOn launch, the sample analyzed starts a service named defragsvc. It then loads the\nmodule DLL via an exported function named Crash. A new thread is created at the\nhighest priority on the executing machine. Control then passes from the launcher to\nthe loaded module while the launcher waits two hours before executing the data wip­\ner.\n\n###### Data Wiper Module\n\n**Key Features**\n\n   - Clears all registry keys associated with system services\n\n   - Overwrites all ICS configuration files across the hard drives and all mapped net­\nwork drives specifically targeting ABB PCM600 configuration files in this sample\n\n   - Overwrites generic Windows files\n\n   - Renders the system unusable\n\n**Details**\n\nOnce executed, the data wiper module clears registry keys, erase files, and kill pro­\ncesses running on the system. A unique characteristic of the wiper is that the main\nfunctionality was implemented within the Crash function.\n\nThe first task of the wiper writes zeros into all of the registry keys in:\n```\nSYSTEM\\CurrentControlSet\\Services\n\n```\nThis registry tree contains initialization values for each service on the system. Removal\nof these values renders a system inoperable. The next wiper task targets ICS configu­\nration files across the local hard drive and mapped network drives. The malware au­\nthors included functionality to target drives lettered C-Z.\n\n\n-----\n\n##### p\n\nThe wiper also targets file types unique to ABB’s PCM600 product used in substa­\ntion automation in addition to more general Windows files. The below table out­\nlines some of the unique file extensions used by industrial control systems.\n\n**File Extension** **Usage**\n.pcmp PCM600 Project (ABB)\n.pcmi PCM600 IEC File (ABB)\n.pcmt PCM600 Template IED File\n.CIN ABB MicroScada\n.PL Programmable Logic File\n.paf PLC Archive File\n.SCL Substation Configuration Language\n.cid Configured IED Description\n.scd Substation Configuration Description\n\nTable 1. File extensions targeted by the data wiper module\n\n###### IEC 104 Module\n\n**Key Features**\n\n   - Reads a configuration file defining the target (likely an RTU) and action to\ntake\n\n   - ‘Kills’ legitimate the master process on the victim host\n\n   - Masquerades as the new master\n\n   - Enters one of four modes:\n\n       - Sequence mode: continuously sets RTU IOAs to open\n\n       - Range mode: (1) Interrogates each RTU for valid IOAs; (2) toggles each\nIOA between open and closed state\n\n       - Shift mode: unknown at this time\n\n       - Persist mode: unknown at this time/not fully implemented\n\n|File Extension|Usage|\n|---|---|\n|.pcmp|PCM600 Project (ABB)|\n|.pcmi|PCM600 IEC File (ABB)|\n|.pcmt|PCM600 Template IED File|\n|.CIN|ABB MicroScada|\n|.PL|Programmable Logic File|\n|.paf|PLC Archive File|\n|.SCL|Substation Configuration Language|\n|.cid|Configured IED Description|\n|.scd|Substation Configuration Description|\n\n\n-----\n\n##### p\n\n\nFigure 3. Protocol Transmission Types in IEC 104\n\n\n-----\n\n##### p\n\nFigure 4: Execution Flow of IEC 104 Module in CRASHOVERRIDE\n\n**Details**\n\nThe CRASHOVERRIDE IEC 104 module is a complete implementation of IEC 104 to\nserve in a “MASTER” role. This raw functionality creates a Swiss army knife for sub­\nstation automation manipulation yet also provides tailored functionality. The func­\ntions exposed to the malware operator are confined by the options of the configu­\nration file. This report outlines the options analyzed today but notes that extending\nand enhancing functionality is straight forward with the robust protocol implemen­\ntation.\n\n\nFigure 4: Execution Flow of IEC 104 Module in CRASHOVERRIDE\n\n\n-----\n\n##### p\n\nThe design of the IEC 104 module differs from the wiper and suggests that a sec­\nondary group of developers could have been involved. Instead of the exported\ncrash function containing the primary execution instructions, the function parses\nthe config file then starts a thread containing the IEC 104 master. The configuration\nfile can have multiple entries offset by [STATION], followed by 13 values:\n\n**File Extension** **Usage**\ntarget_ip NONE\ntarget_port NONE\nlogfile NONE\nadsu NONE\nstop_comm_service 1\nchange 1\nfirst_action on\nsilence 0\nuselog 0\nstop_comm_service_name <blank>\ntimeout 1 second\nsocket_timeout 15 seconds\nrange NONE\n\nTable 2. IEC-104 module configuration file fields\n\nThe configuration file is critical to achieving an effect on the target, as target spec­\nifications for the device must be provided by the operator in the configuration file\nfor the module to function. There are no observed automated means of enumerat­\ning the network and then impacting RTUs.\n\nEach [STATION]entry spawns a thread for follow-on effects against ICS equipment.\nOnce the IEC 104 master thread begins, the first action is to try to kill the commu­\nnications service process which acts as the master process. Once the module stops\nthe communications service process, a socket opens with the target IP and desti­\nnation port sending data to slave devices and receiving the resulting responses.\n\n|File Extension|Usage|\n|---|---|\n|target_ip|NONE|\n|target_port|NONE|\n|logfile|NONE|\n|adsu|NONE|\n|stop_comm_service|1|\n|change|1|\n|first_action|on|\n|silence|0|\n|uselog|0|\n|stop_comm_service_name|<blank>|\n|timeout|1 second|\n|socket_timeout|15 seconds|\n|range|NONE|\n\n\n-----\n\n##### p\n\nDepending on the mode defined within the configuration file the module may:\n\n   - Set specific values\n\n   - Enumerate IOAs on the target devices\n\n   - Continuously set the IOA to open, or\n\n   - Continuously toggle the IOA between open and closed states.\n\nThis module contains no interactive capability.\n\nRTUs and PLCs, in simplistic terms, act on input and output. Each discrete input\nand output is tied to a memory address. Depending on implementation these ad­\ndresses are referred to as coils, registers, or for IEC 104: information object ad­\ndresses (IOAs). IOAs are typed and can hold different value types, such as Boolean\nor Unsigned Integer values. The 104 module properly understands how to enu­\nmerate and discover IOAs to operate breakers.\n\n###### IEC 101 Module\n\nThis module was unavailable to Dragos at the time of publication. ESET’s analysis\nclaims the functionality is equivalent to the IEC 104 module except with communi­\ncations over serial. However, Dragos was able to confirm that the module exists.\n\n###### IEC 61850 Module\n\nThis module was unavailable to Dragos at the time of publication. ESET’s analysis\nclaims once executed the module leverages a configuration file to identify targets\nand without a configuration file it enumerates the local network to identify poten­\ntial targets. It communicates with the targets to identify whether the device con­\ntrols a circuit breaker switch. For certain variables (no further information avail­\nable) it will change their state while also generating an action log. However, Dragos\nwas able to confirm that this module does exist.\n\n###### OPC DA Module\n\nThis module was unavailable to Dragos at the time of publication. ESET’s analysis\nclaims the module does not require a configuration. It enumerates all OPC servers\nand their associated items looking for a subset related to ABB containing the string\nctl. It then writes 0x01 twice into the item overwriting the proper value giving the\ndevice a primary value out of limits device status. However, Dragos was able to\nconfirm that this module exists.\n\n\n-----\n\n##### p\n\n###### SIPROTEC DoS Module\n\nThis module was unavailable to Dragos at the time of publication. ESET’s analysis\nclaims the module sends UDP packets to port 50000 exploiting CVE-2015-5374\ncausing the SIPROTEC digital relay to fall into an unresponsive state. Dragos could\nnot validate that this module exists.\n\n###### Capability Conclusions\n\nELECTRUM’s ability to adopt a development style described above has several im­\nplications: first, developers can integrate new protocols into the overall framework\nquickly. Second, ELECTRUM could easily leverage external development teams\nskilled at exploiting industrial control systems. Some adversaries would likely ap­\nproach capability development through a ‘two-tier’ approach: a core development\nteam skilled at writing the overall framework and a second team knowledgeable\nabout a given control system. The platform team would take the control sys­\ntem modules and add logic to fit them within the platform. The IEC 104 module\ndemonstrates this approach.\n\nGiven the execution described with secondary threads the team authoring the\nCrash function likely did not author the IEC 104 master portion of the code. Both\ndevelopment teams probably worked together to decide on a log file format for\nconsumption by the main Crash function and executed in each of the IEC 104\nmodule threads.\n\n#### Implications of capability\n\nThis section describes legitimate CRASHOVERRIDE attack and impact scenarios.\nExtensions of these and potential hypothetical scenarios were deemed indetermin­\nistic and will not be addressed.\n\n###### Attack Option: De-energize substation\n\nCRASHOVERRIDE, based on prior knowledge, must have a configuration file for\ntargeting information of one or multiple RTUs. This configuration option allows for\nseveral types of activities. One operation the configuration option allows is ‘se­\nquence.’\n\n.\n\n\n-----\n\n##### p\n\nThe command sequence polls the target device for the appropriate address­\nes. Once it is at the subset of known addresses, it can then toggle the value. The\ncommand then begins an infinite loop and continues to set addresses to this val­\nue effectively opening closed breakers. If a system operator tries to issue a close\ncommand on their HMI the sequence loop will continue to re-open the breaker.\nThis loop maintaining open breakers will effectively de-energize the substation\nline(s) preventing system operators from managing the breakers and re-energize\nthe line(s).\n\nThe effects of de-energizing a line or substation largely depends on the system\ndynamics, power flows, and other variables. In some circumstances, it may have no\nimmediate impact while in others it could put customers into an outage. It is im­\nportant to note that grid operations encompass failure modes and operations can\nnormally compensate. That is, after all, why humans are ‘in the loop’ to monitor\nand maintain the system.\n\nFrom a recovery standpoint, the remote staff will effectively have lost control of the\nbreakers and will be required to send crews to the substation. If the CRASHOVER­\nRIDE loop continues unabated, then the crews will likely sever communications as\nboth a troubleshooting and recovery action. Severing communications puts the\nsubstation in manual operation where a physical presence is now required. This\ncould result in a few hours of outages\n\n###### Attack Option: Force an Islanding event\n\nDragos is currently investigating a separate and more disruptive attack option in\nCRASHOVERRIDE as described by ESET. As before, the attacker must have a config­\nuration file for targeting information of one or multiple RTUs. This configuration file\nnow uses the range command to begin a loop that toggles the status of the break­\ner between open and close continuously. The changing breaker status will invoke\nautomated protective operations to isolate (commonly referred to as ‘islanding’)\nthe substation. This is an intentional self-protective capability of grid operations.\n\nIn effect, this breaker strobing takes the substation offline due to the protective\nrelay scheme’s automated operations causing perturbations of some degree on the\ngrid as scientific principles define how the behavior interacts with frequencies and\nphases. The variables of these effects will dictate impacts but could cause system\ninstabilities depending on the effectiveness of the protection relays and their oper­\nations. Grid operation contingencies become more critical if multiple substations\nwere under attack likely resulting in many small islanding events. This is assuming\ncoordinated targeting of multiple electric sites and could result in a few days of\noutages.\n\n\n-----\n\n##### p\n\n###### Adding Amplification Attacks\n\nForcing an islanding of a substation through continual breaker manipulation is sig­\nnificant by itself. However, CRASHOVERRIDE has the potential to amplify this attack\neven more. Two separate CRASHOVERRIDE modules offer this opportunity.\n\n###### Using OPC to create a Denial of Visibility\n\nThe OPC module ESET analysis suggests it can brute force values. Module OPC.\nexe will send out a 0x01 status which for the target systems equates to a “Primary\nVariable Out of Limits” misdirecting operators from understanding protective relay\nstatus.\n\n**Bit Mask** **Definition**\n0x10 More Status Available – More status information is available via\nCommand 48, Read Additional Status Information.\n0x08 Loop Current Fixed – The Loop Current is being held at a fixed\nvalue and is not responding to process variations.\n0x04 Loop Current Saturated – The Loop Current has reached its\nupper (or lower) endpoint limit and cannot increase (or decrease)\nany further.\n0x02 Non-Primary Variable Out of Limits – A Device variable not\nmapped to the PV is beyond its operating limits.\n0x01 Primary Variable Out of Limits – The PV is beyond its operating\nlimits.\n\nThe outcome of the action infers that various systems can either perform actions\non wrong information or report incorrect information to system operators. This\nDenial of Visibility will amplify misunderstanding and confusion while system op­\nerators troubleshoot the problem as their system view will show breakers closed\nwhen they are open.\n\n.\n\n|Bit Mask|Definition|\n|---|---|\n|0x10|More Status Available – More status information is available via Command 48, Read Additional Status Information.|\n|0x08|Loop Current Fixed – The Loop Current is being held at a fixed value and is not responding to process variations.|\n|0x04|Loop Current Saturated – The Loop Current has reached its upper (or lower) endpoint limit and cannot increase (or decrease) any further.|\n|0x02|Non-Primary Variable Out of Limits – A Device variable not mapped to the PV is beyond its operating limits.|\n|0x01|Primary Variable Out of Limits – The PV is beyond its operating limits.|\n\n\n-----\n\n##### p\n\n###### Using CVE-2015-5374 to Hamper Protective Relays\n\nA second, and more severe, amplifying attack would be to neutralize the auto­\nmated protective system by creating a Denial of Service against some or all of the\nprotective relays. This possibility exists in a tool ESET has claimed to have discov­\nered that implements the known CVE-2015-5374 Denial of Service condition to the\nSiemens SIPROTEC relays. Siemens released a patch for this in July 2015 under Sie­\nmens advisory SCA-732541. At this time it is believed that CVE-2015-5374 causes a\ndenial of service (DoS) of the complete relay functionality and not just the network\ncommunications module. Dragos has independent evidence that this module ex­\nists but it cannot be confirmed.\n\nHampering the protective scheme by disabling the protective relays can broaden\nthe islanding event and, if done at scale, could trigger a larger event causing multi­\nple substations and lines “islanding” from the electric grid. Siemens SIPROTEC was\nlikely chosen in this attack only because that was the vendor device at the Ukraine\nKiev site attacked in December 2016. This same tactic against digital relays, albe­\nit not the same exploit, could have a similar impact on grid operations. However,\nthere are many different types of digital relays each with different configurations.\nThis amplifying attack would be very difficult to do at scale properly and would\nrequire a significant investment on behalf of the adversary.\n\n\n-----\n\n##### p\n\n#### Defense Recommendations\n\nDoing the basics is always appropriate, and it significantly helps move ICS into a\ndefensible position. However, they are not worth repeating here, and instead, more\ntailored approaches specific to ICS security analysts trying to defend against CRA­\nSHOVERRIDE and similar capabilities are presented below:\n\n   - Electric utility security teams should have a clear understanding of where\nand how IEC 104 and IEC 61850 protocols are used. North American elec­\ntric utilities should include DNP3 on this list in case the malware is extended\nto impact U.S. systems. Look specifically for increased usage of the proto­\ncols against baselines established in the environment. Also, look for systems\nleveraging these protocols if they have not before and specifically try to\nidentify systems that are generating new network flows using these proto­\ncols.\n\n   - Similarly, understand OPC implementations and identify how the protocol is\nbeing used. It is a protocol that is pervasive across numerous sectors. Also,\nCRASHOVERRIDE is the second, out of four, ICS tailored malware suite with\nOPC capabilities. OPC will appear abnormal in the CRASHOVERRIDE usage\nas it is being used to scan all devices on the network which would generate\nmore traffic than usual.\n\n   - Robust backups of engineering files such as project logic, IED configura­\ntion files, and ICS application installers should be offline and tested. This will\nhelp reduce the impact of the wiper functionality.\n\n   - Prepare incident response plans for this attack and perform table top exer­\ncises bringing in appropriate stakeholders and personnel across engineer­\ning, operations, IT, and security. The scenario should include substation\noutages with the requirement to do manual operations while recovering the\nSCADA environment and gathering appropriate forensics.\n\n   - The included YARA rules and other indicators of compromise can be lever­\naged to search for possible infections (IOCs). The YARA rules will provide a\nhigher confidence towards discovering an infection than the other IOCs and\nshould be searched for against Windows OT systems especially noting HMIs.\nThe behavioral analytics to identify the communications on the network\nwould provide the highest capability to detect this and similar threats.\n\n\n-----\n\n##### p\n\nWhile some defenses and architecture changes may have value in other situations,\nthe following are responses that are not appropriate for this attack:\n\n   - Transmission and distribution companies should not rely on the usage of\nother protocols such as DNP3 as a protection mechanism. The complete­\nness of the CRASHOVERRIDE framework suggests there may be other un­\ndisclosed modules such as a DNP3 module. Also, adding this functionality\ninto the existing framework would not require extensive work on the part of\nthe adversary.\n\n   - Air gapped networks, unidirectional firewalls, anti-virus in the ICS, and other\npassive defenses and architecture changes are not appropriate solutions for\nthis attack. No amount of security control will protect against a determined\nhuman adversary. Human defenders are required\n\n\n-----\n\n##### p\n\n\n###### Indicators\n\n**TYPE** **SUBTYPE** **IOC**\n\nHost Mutex Value ApiPortection9d3\n\nHost Mutex Value <Blank Value>\n\nHost File C:\\Users\\<Public OR Executing User>\\\nimapi\n\nHost Service Name defragsvc\n\nNetwork IP Address 195.16.88.6\n\nNetwork IP Address 93.115.27.57\n\nNetwork IP Address 5.39.218.152\n\nNetwork User Agent String Mozilla/4.0 (compatible; MSIE 7.0; Win­\ndows NT 5.1; InfoPath.1)\n\nHost Command Line <Drive>:\\<name>.exe -ip=<IP_address>\n-ports=<ports>\n\nHost Registry Key HKLM\\SYSTEM\\CurrentControlSet\\Ser­\nvices\\<target_service_name>\\ImagePath\n<path to malware>\n\nHost SHA1 File Hash F6C21F8189CED6AE150F9E­\nF2E82A3A57843B587D\n\nHost SHA1 File Hash CCCCE62996D­\n578B984984426A024D9B250237533\n\nHost SHA1 File Hash 8E39ECA1E48240C01EE570631AE8F­\n0C9A9637187\n\nHost SHA1 File Hash 2CB8230281B86FA944D3043AE­\n906016C8B5984D9\n\n|TYPE|SUBTYPE|IOC|Description|ICS Kill Chain|Impact|\n|---|---|---|---|---|---|\n|Host|Mutex Value|ApiPortection9d3|Mutex value checked|Stage 2: Install|Recon|\n|Host|Mutex Value|<Blank Value>|Mutex value created|Stage 2: Install|Recon|\n|Host|File|C:\\Users\\<Public OR Executing User>\\ imapi|File dropped and deleted after pro­ gram exit|Stage 2: Install|Recon|\n|Host|Service Name|defragsvc|Name given to service start|Stage 2: C2|Remote Access|\n|Network|IP Address|195.16.88.6|External C2 server [DEC 2016] (likely TOR node at time of attack)|Stage 2: C2|Remote Access|\n|Network|IP Address|93.115.27.57|External C2 server [DEC 2016] (likely TOR node at time of attack)|Stage 2: C2|Remote Access|\n|Network|IP Address|5.39.218.152|External C2 server [DEC 2016] (likely TOR node at time of attack)|Stage 2: C2|Remote Access|\n|Network|User Agent String|Mozilla/4.0 (compatible; MSIE 7.0; Win­ dows NT 5.1; InfoPath.1)|Default user agent string used in C2 if unable to get system default user agent string|Stage 2: C2|Remote Access|\n|Host|Command Line|<Drive>:\\<name>.exe -ip=<IP_address> -ports=<ports>|Command line arguments used to launch custom port scanner observed with malware. Command line logging required to track.|Stage 2: Develop|Recon|\n|Host|Registry Key|HKLM\\SYSTEM\\CurrentControlSet\\Ser­ vices\\<target_service_name>\\ImagePath <path to malware>|Change in Service Image Path in the system registry to point to malware allowing malware to restart on system reboot.|Stage 2: Installa­ tion|Persistence|\n|Host|SHA1 File Hash|F6C21F8189CED6AE150F9E­ F2E82A3A57843B587D|Traffic to <internalIP>:3128, HTTP CONNECT to 5.39.218.152:443. Back­ door/RAT.|Phase2: C2|Remote Access|\n|Host|SHA1 File Hash|CCCCE62996D­ 578B984984426A024D9B250237533|Traffic to <internalIP>:3128, HTTP CONNECT to 5.39.218.152:443. Back­ door/RAT.|Phase2: C2|Remote Access|\n|Host|SHA1 File Hash|8E39ECA1E48240C01EE570631AE8F­ 0C9A9637187|Backdoor/RAT Proxy + HTTP CON­ NECT to 93.115.27.57:443.|Phase2: C2|Remote Access|\n\n\nBackdoor/RAT Proxy + HTTP CON­\nNECT to 195.16.88.6:443\n\n\nPhase2: C2 Remote Access\n\n\n-----\n\n##### p\n\n|Host|SHA1 File Hash|79CA89711CDAEDB16B0CCCCFD­ CFBD6AA7E57120A|Launcher for payload DLL. Takes input as three command line parameters – work­ ing directory, module, and config file.|Stage 2: Attack|Loss of Control|\n|---|---|---|---|---|---|\n|Host|SHA1 File Hash|94488F214B165512D2FC0438A581F­ 5C9E3BD4D4C|Module for 104 efefct. Exports 'Crash' which is invoked by launcher. Functional­ ity requires config file.|Stage 2: Attack|Loss of Control|\n|Host|SHA1 File Hash|5A5FAFBC3FEC8D36FD57B075EBF­ 34119BA3BFF04|Wiper module, wipes list of files by extension, removes system processes, and makes registry changes to prevent system boot.|Stage 2: Attack|Destruction|\n|Host|SHA1 File Hash|B92149F046F00BB69DE329B8457D­ 32C24726EE00|Wiper module, wipes list of files by extension, removes system processes, and makes registry changes to prevent system boot.|Stage 2: Attack|Destruction|\n|Host|SHA1 File Hash|B335163E6EB854DF5E08E85026B­ 2C3518891EDA8|Custom-built port scanner.|Stage 2: Develop|Recon|\n|Host|SHA1 File Hash|7FAC2EDDF22FF692E1B4E­ 7F99910E5DBB51295E6|OPC Data Access protocol enumeration of servers and addresses|Stage 2: Attack|Loss of Control|\n|Host|SHA1 File Hash|ECF6ADF20A7137A84A1B319C­ CAA97CB0809A8454|IEC-61850 enumeration and address manipulation|Stage 2: Attack|Loss of Control|\n|Host|Filename|opc.exe|OPC Data Access protocol enumeration of servers and addresses|Stage 2: Attack|Loss of Control|\n|Host|Filename|61850.exe|IEC-61850 enumeration and address manipulation|Stage 2: Attack|Loss of Control|\n|Host|Filename|haslo.exe|Wiper module, wipes list of files by extension, removes system processes, and makes registry changes to prevent system boot.|Stage 2: Attack|Destruction|\n|Host|Filename|104.dll|IEC-104 module|Stage 2: Attack|Loss of Control|\n|Host|Filename|haslo.dat|Wiper module|Stage 2: Attack|Destruction|\n|OPC Server|OPC Group|Aabdul|OPC DA Module|Stage 2: Attack|Loss of Visibility|\n\n\n-----\n\n##### p\n\n###### Yara Rules\nAlso found at https://github.com/dragosinc/CRASHOVERRIDE\n```\nimport “pe”\nimport “hash”\nrule dragos_crashoverride_exporting_dlls\n{\n    meta:\n       description = “CRASHOVERRIDE v1 Suspicious Export”\n       author = “Dragos Inc”\n    condition:\n       pe.exports(“Crash”) & pe.characteristics\n}\nrule dragos_crashoverride_suspcious\n{\n    meta:\n       description = “CRASHOVERRIDE v1 Wiper”\n       author = “Dragos Inc”\n    strings:\n       $s0 = “SYS_BASCON.COM” fullword nocase wide\n       $s1 = “.pcmp” fullword nocase wide\n       $s2 = “.pcmi” fullword nocase wide\n       $s3 = “.pcmt” fullword nocase wide\n       $s4 = “.cin” fullword nocase wide\n    condition:\n       pe.exports(“Crash”) and any of ($s*)\n}\n\n```\n\n-----\n\n##### p\n\n###### YARA Rules\n```\nrule dragos_crashoverride_name_search {\n    meta:\n       description = “CRASHOVERRIDE v1 Suspicious Strings and Export”\n       author = “Dragos Inc”\n    strings:\n       $s0 = “101.dll” fullword nocase wide\n       $s1 = “Crash101.dll” fullword nocase wide\n       $s2 = “104.dll” fullword nocase wide\n       $s3 = “Crash104.dll” fullword nocase wide\n       $s4 = “61850.dll” fullword nocase wide\n       $s5 = “Crash61850.dll” fullword nocase wide\n       $s6 = “OPCClientDemo.dll” fullword nocase wide\n       $s7 = “OPC” fullword nocase wide\n       $s8 = “CrashOPCClientDemo.dll” fullword nocase wide\n       $s9 = “D2MultiCommService.exe” fullword nocase wide\n       $s10 = “CrashD2MultiCommService.exe” fullword nocase wide\n       $s11 = “61850.exe” fullword nocase wide\n       $s12 = “OPC.exe” fullword nocase wide\n       $s13 = “haslo.exe” fullword nocase wide\n       $s14 = “haslo.dat” fullword nocase wide  \n    condition:\n       any of ($s*) and pe.exports(“Crash”)\n}\n\n```\n\n-----\n\n##### p\n\n###### YARA Rules\n```\nrule dragos_crashoverride_hashes {\n  meta:\n    description = “CRASHOVERRIDE Malware Hashes”\n    author = “Dragos Inc”\n  condition:\n\n```\nfilesize < 1MB and\nhash.sha1(0, filesize) == “f6c21f8189ced6ae150f9ef2e82a3a57843b587d” or\nhash.sha1(0, filesize) == “cccce62996d578b984984426a024d9b250237533” or\nhash.sha1(0, filesize) == “8e39eca1e48240c01ee570631ae8f0c9a9637187” or\nhash.sha1(0, filesize) == “2cb8230281b86fa944d3043ae906016c8b5984d9” or\nhash.sha1(0, filesize) == “79ca89711cdaedb16b0ccccfdcfbd6aa7e57120a” or\nhash.sha1(0, filesize) == “94488f214b165512d2fc0438a581f5c9e3bd4d4c” or\nhash.sha1(0, filesize) == “5a5fafbc3fec8d36fd57b075ebf34119ba3bff04” or\nhash.sha1(0, filesize) == “b92149f046f00bb69de329b8457d32c24726ee00” or\nhash.sha1(0, filesize) == “b335163e6eb854df5e08e85026b2c3518891eda8”\n```\n}\n\n```\n\n-----\n\n##### p\n\n###### YARA Rules\n```\nrule dragos_crashoverride_moduleStrings {\n    meta:\n       description = “IEC-104 Interaction Module Program Strings”\n       author = “Dragos Inc”\n    strings:\n       $s1 = “IEC-104 client: ip=%s; port=%s; ASDU=%u” nocase wide ascii\n       $s2 = “ MSTR ->> SLV” nocase wide ascii\n       $s3 = “ MSTR <<- SLV” nocase wide ascii\n       $s4 = “Unknown APDU format !!!” nocase wide ascii\n       $s5 = “iec104.log” nocase wide ascii\n    condition:\n       any of ($s*)\n}\n\n```\nrule dragos_crashoverride_configReader\n```\n{\n  meta:\n\n```\ndescription = “CRASHOVERRIDE v1 Config File Parsing”\n```\n    author = “Dragos Inc”\n  strings:\n    $s0 = { 68 e8 ?? ?? ?? 6a 00 e8 a3 ?? ?? ?? 8b f8 83 c4 ?8 }\n    $s1 = { 8a 10 3a 11 75 ?? 84 d2 74 12 }\n    $s2 = { 33 c0 eb ?? 1b c0 83 c8 ?? }\n    $s3 = { 85 c0 75 ?? 8d 95 ?? ?? ?? ?? 8b cf ?? ?? }\n  condition:\n    all of them\n}\n\n```\n\n-----\n\n##### p\n\n###### YARA Rules\n```\nrule dragos_crashoverride_weirdMutex\n{\n  meta:\n    description = “Blank mutex creation assoicated with CRASHOVERRIDE”\n    author = “Dragos Inc”\n  strings:\n    $s1 = { 81 ec 08 02 00 00 57 33 ff 57 57 57 ff 15 ?? ?? 40 00 a3 ?? ?? ?? 00\n85 c0 }\n    $s2 = { 8d 85 ?? ?? ?? ff 50 57 57 6a 2e 57 ff 15 ?? ?? ?? 00 68 ?? ?? 40 00}\n  condition:\n    all of them\n}\nrule dragos_crashoverride_serviceStomper\n{\n  meta:\n    description = “Identify service hollowing and persistence setting”\n    author = “Dragos Inc”\n  strings:\n    $s0 = { 33 c9 51 51 51 51 51 51 ?? ?? ?? }\n    $s1 = { 6a ff 6a ff 6a ff 50 ff 15 24 ?? 40 00 ff ?? ?? ff 15 20 ?? 40 00 }\n  condition:\n    all of them\n}\n\n```\n\n-----\n\n##### p\n\n###### YARA Rules\n```\nrule dragos_crashoverride_wiperModuleRegistry\n{\n  meta:\n    description = “Registry Wiper functionality assoicated with CRASHOVERRIDE”\n    author = “Dragos Inc”\n  strings:\n    $s0 = { 8d 85 a0 ?? ?? ?? 46 50 8d 85 a0 ?? ?? ?? 68 68 0d ?? ?? 50 }\n    $s1 = { 6a 02 68 78 0b ?? ?? 6a 02 50 68 b4 0d ?? ?? ff b5 98 ?? ?? ?? ff 15\n04 ?? ?? ?? }\n    $s2 = { 68 00 02 00 00 8d 85 a0 ?? ?? ?? 50 56 ff b5 9c ?? ?? ?? ff 15 00 ??\n?? ?? 85 c0 }\n  condition:\n    all of them\n}\n\n```\nrule dragos_crashoverride_wiperFileManipulation\n```\n{\n  meta:\n\n```\ndescription = “File manipulation actions associated with CRASHOVERRIDE wip­\n```\ner”\n    author = “Dragos Inc”\n  strings:\n    $s0 = { 6a 00 68 80 00 00 00 6a 03 6a 00 6a 02 8b f9 68 00 00 00 40 57 ff 15\n1c ?? ?? ?? 8b d8 }\n    $s2 = { 6a 00 50 57 56 53 ff 15 4c ?? ?? ?? 56 }\n  condition:\n    all of them\n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/cl2m9xiifjoz0iajwthet2eaeyp26e13",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2017/2017.06.12.CRASHOVERRIDE/CrashOverride-01.pdf"
    ],
    "report_names": [
        "Dragos_CrashOverride-01(06-12-2017)",
        "CrashOverride-01"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1497399166,
    "ts_modification_date": 1497399174,
    "files": {
        "pdf": "https://archive.orkl.eu/f86cc703b475135372a6639e12d4651121e23fff.pdf",
        "text": "https://archive.orkl.eu/f86cc703b475135372a6639e12d4651121e23fff.txt",
        "img": "https://archive.orkl.eu/f86cc703b475135372a6639e12d4651121e23fff.jpg"
    }
}