{
    "id": "2ec302a7-21cb-414e-bb1b-91f2705edfd9",
    "created_at": "2023-01-12T15:10:12.599824Z",
    "updated_at": "2025-03-27T02:16:34.807839Z",
    "deleted_at": null,
    "sha1_hash": "17f81def748b821ec350c1568d2b80bf5d141a0a",
    "title": "2020-12-13 - Highly Evasive Attacker Leverages SolarWinds Supply Chain to Compromise Multiple Global Victims With SUNBURST Backdoor",
    "authors": "",
    "file_creation_date": "2022-05-27T19:57:30Z",
    "file_modification_date": "2022-05-27T19:57:30Z",
    "file_size": 131082,
    "plain_text": "# Highly Evasive Attacker Leverages SolarWinds Supply Chain to Compromise Multiple Global Victims With SUNBURST Backdoor\n\n**[fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html)**\n\n## Breadcrumb\n\nThreat Research\n\nFireEye\n\nDec 13, 2020\n\n17 mins read\n\nThreat Research\n\n_[UPDATE (May 2022): We have merged UNC2452 with APT29. The UNC2452 activity described in this post is now](https://www.mandiant.com/resources/unc2452-merged-into-apt29)_\n_attributed to APT29._\n\n**Executive Summary**\n\nWe have discovered a global intrusion campaign. We are tracking the actors behind this campaign as\nUNC2452.\nFireEye discovered a supply chain attack trojanizing SolarWinds Orion business software updates in order to\ndistribute malware we call SUNBURST.\nThe attacker’s post compromise activity leverages multiple techniques to evade detection and obscure their\nactivity, but these efforts also offer some opportunities for detection.\nThe campaign is widespread, affecting public and private organizations around the world.\n\n\n-----\n\nFireEye is releasing signatures to detect this threat actor and supply chain attack in the wild. These are found\n[on our public GitHub page. FireEye products and services can help customers detect and block this attack.](https://github.com/mandiant/sunburst_countermeasures)\n\n**Summary**\n\nFireEye has uncovered a widespread campaign, that we are tracking as UNC2452. The actors behind this\ncampaign gained access to numerous public and private organizations around the world. They gained access to\nvictims via trojanized updates to SolarWind’s Orion IT monitoring and management software. This campaign may\nhave begun as early as Spring 2020 and is currently ongoing. Post compromise activity following this supply chain\ncompromise has included lateral movement and data theft. The campaign is the work of a highly skilled actor and\nthe operation was conducted with significant operational security.\n\n**SUNBURST Backdoor**\n\nSolarWinds.Orion.Core.BusinessLayer.dll is a SolarWinds digitally-signed component of the Orion software\nframework that contains a backdoor that communicates via HTTP to third party servers. We are tracking the\ntrojanized version of this SolarWinds Orion plug-in as SUNBURST.\n\nAfter an initial dormant period of up to two weeks, it retrieves and executes commands, called “Jobs”, that include\nthe ability to transfer files, execute files, profile the system, reboot the machine, and disable system services. The\nmalware masquerades its network traffic as the Orion Improvement Program (OIP) protocol and stores\nreconnaissance results within legitimate plugin configuration files allowing it to blend in with legitimate SolarWinds\nactivity. The backdoor uses multiple obfuscated blocklists to identify forensic and anti-virus tools running as\nprocesses, services, and drivers.\n\n\nSolarWinds digital signature on software with backdoor\n\n\nFigure 1: SolarWinds\n\n\ndigital signature on software with backdoor\n\n\n-----\n\nMultiple trojanzied updates were digitally signed from March May 2020 and posted to the SolarWinds updates\nwebsite, including:\n\nhxxps://downloads.solarwinds[.]com/solarwinds/CatalogResources/Core/2019.4/2019.4.5220.20574/SolarWindsCore-v2019.4.5220-Hotfix5.msp\n\nThe trojanized update file is a standard Windows Installer Patch file that includes compressed resources\nassociated with the update, including the trojanized SolarWinds.Orion.Core.BusinessLayer.dll component. Once\nthe update is installed, the malicious DLL will be loaded by the legitimate SolarWinds.BusinessLayerHost.exe or\nSolarWinds.BusinessLayerHostx64.exe (depending on system configuration). After a dormant period of up to two\nweeks, the malware will attempt to resolve a subdomain of avsvmcloud[.]com. The DNS response will return a\nCNAME record that points to a Command and Control (C2) domain. The C2 traffic to the malicious domains is\ndesigned to mimic normal SolarWinds API communications. The list of known malicious infrastructure is available\non FireEye’s [GitHub page.](https://github.com/mandiant/sunburst_countermeasures)\n\n**Worldwide Victims Across Multiple Verticals**\n\nFireEye has detected this activity at multiple entities worldwide. The victims have included government, consulting,\ntechnology, telecom and extractive entities in North America, Europe, Asia and the Middle East. We anticipate\nthere are additional victims in other countries and verticals. FireEye has notified all entities we are aware of being\naffected.\n\n**Post Compromise Activity and Detection Opportunities**\n\nWe are currently tracking the software supply chain compromise and related post intrusion activity as UNC2452.\nAfter gaining initial access, this group uses a variety of techniques to disguise their operations while they move\nlaterally (Figure 2). This actor prefers to maintain a light malware footprint, instead preferring legitimate credentials\nand remote access for access into a victim’s environment.\n\n\n-----\n\nPost-compromise tactics\n\n\nFigure 2: Post-compromise\n\ntactics\nThis section will detail the notable techniques and outline potential opportunities for detection.\n\n_TEARDROP and BEACON Malware Used_\n\nMultiple SUNBURST samples have been recovered, delivering different payloads. In at least one instance the\nattackers deployed a previously unseen memory-only dropper we’ve dubbed TEARDROP to deploy Cobalt Strike\nBEACON.\n\nTEARDROP is a memory only dropper that runs as a service, spawns a thread and reads from the file\n“gracious_truth.jpg”, which likely has a fake JPG header. Next it checks that HKU\\SOFTWARE\\Microsoft\\CTF\nexists, decodes an embedded payload using a custom rolling XOR algorithm and manually loads into memory an\nembedded payload using a custom PE-like file format. TEARDROP does not have code overlap with any\npreviously seen malware. We believe that this was used to execute a customized Cobalt Strike BEACON.\n\n_[Mitigation: FireEye has provided two Yara rules to detect TEARDROP available on our GitHub. Defenders should](https://github.com/mandiant/sunburst_countermeasures)_\nlook for the following alerts from FireEye HX: MalwareGuard and WindowsDefender:\n\nProcess Information\n\nfile_operation_closed\nfile-path*: “c:\\\\windows\\\\syswow64\\\\netsetupsvc.dll\nactor-process:\npid: 17900\n\n\n-----\n\nWindow s defender Exploit Guard log entries: (Microsoft Windows Security Mitigations/KernelMode event ID 12)\n\nProcess”\\Device\\HarddiskVolume2\\Windows\\System32\\svchost.exe” (PID XXXXX) would have been blocked from\nloading the non-Microsoft-signed binary\n‘\\Windows\\SysWOW64\\NetSetupSvc.dll’\n\n_Attacker Hostnames Match Victim Environment_\n\nThe actor sets the hostnames on their command and control infrastructure to match a legitimate hostname found\nwithin the victim’s environment. This allows the adversary to blend into the environment, avoid suspicion, and\nevade detection.\n\n**Detection Opportunity**\n\nThe attacker infrastructure leaks its configured hostname in RDP SSL certificates, which is identifiable in internetwide scan data. This presents a detection opportunity for defenders -- querying internet-wide scan data sources for\nan organization’s hostnames can uncover malicious IP addresses that may be masquerading as the organization.\n(Note: IP Scan history often shows IPs switching between default (WIN-*) hostnames and victim’s hostnames)\nCross-referencing the list of IPs identified in internet scan data with remote access logs may identify evidence of\nthis actor in an environment. There is likely to be a single account per IP address.\n\n_IP Addresses located in Victim’s Country_\n\nThe attacker’s choice of IP addresses was also optimized to evade detection. The attacker primarily used only IP\naddresses originating from the same country as the victim, leveraging Virtual Private Servers.\n\n**Detection Opportunity**\n\nThis also presents some detection opportunities, as geolocating IP addresses used for remote access may show\nan impossible rate of travel if a compromised account is being used by the legitimate user and the attacker from\ndisparate IP addresses. The attacker used multiple IP addresses per VPS provider, so once a malicious login from\nan unusual ASN is identified, looking at all logins from that ASN can help detect additional malicious activity. This\ncan be done alongside baselining and normalization of ASN’s used for legitimate remote access to help identify\nsuspicious activity.\n\n_Lateral Movement Using Different Credentials_\n\nOnce the attacker gained access to the network with compromised credentials, they moved laterally using multiple\ndifferent credentials. The credentials used for lateral movement were always different from those used for remote\naccess.\n\n**Detection Opportunity**\n\nOrganizations can use HX’s LogonTracker module to graph all logon activity and analyze systems displaying a\none-to-many relationship between source systems and accounts. This will uncover any single system\nauthenticating to multiple systems with multiple accounts, a relatively uncommon occurrence during normal\nbusiness operations.\n\n_Temporary File Replacement and Temporary Task Modification_\n\nThe attacker used a temporary file replacement technique to remotely execute utilities: they replaced a legitimate\nutility with theirs, executed their payload, and then restored the legitimate original file. They similarly manipulated\nscheduled tasks by updating an existing legitimate task to execute their tools and then returning the scheduled task\nto its original configuration. They routinely removed their tools, including removing backdoors once legitimate\nremote access was achieved.\n\n\n-----\n\n**Detection Opportunity**\n\nDefenders can examine logs for SMB sessions that show access to legitimate directories and follow a deletecreate-execute-delete-create pattern in a short amount of time. Additionally, defenders can monitor existing\nscheduled tasks for temporary updates, using frequency analysis to identify anomalous modification of tasks. Tasks\ncan also be monitored to watch for legitimate Windows tasks executing new or unknown binaries.\n\nThis campaign’s post compromise activity was conducted with a high regard for operational security, in many cases\nleveraging dedicated infrastructure per intrusion. This is some of the best operational security that FireEye has\nobserved in a cyber attack, focusing on evasion and leveraging inherent trust. However, it can be detected through\npersistent defense.\n\n**In-Depth Malware Analysis**\n\nSolarWinds.Orion.Core.BusinessLayer.dll (b91ce2fa41029f6955bff20079468448) is a SolarWinds-signed plugin\ncomponent of the Orion software framework that contains an obfuscated backdoor which communicates via HTTP\nto third party servers. After an initial dormant period of up to two weeks, it retrieves and executes commands,\ncalled “Jobs”, that include the ability to transfer and execute files, profile the system, and disable system services.\nThe backdoor’s behavior and network protocol blend in with legitimate SolarWinds activity, such as by\nmasquerading as the Orion Improvement Program (OIP) protocol and storing reconnaissance results within plugin\nconfiguration files. The backdoor uses multiple blocklists to identify forensic and anti-virus tools via processes,\nservices, and drivers.\n\n**Unique Capabilities**\n\nSubdomain DomainName Generation Algorithm (DGA) is performed to vary DNS requests\n\nCNAME responses point to the C2 domain for the malware to connect to\nThe IP block of A record responses controls malware behavior\nDGA encoded machine domain name, used to selectively target victims\nCommand and control traffic masquerades as the legitimate Orion Improvement Program\nCode hides in plain site by using fake variable names and tying into legitimate components\n\n**Delivery and Installation**\n\nAuthorized system administrators fetch and install updates to SolarWinds Orion via packages distributed by\nSolarWinds’s website. The update package CORE-2019.4.5220.20574-SolarWinds-Core-v2019.4.5220Hotfix5.msp (02af7cec58b9a5da1c542b5a32151ba1) contains the SolarWinds.Orion.Core.BusinessLayer.dll\ndescribed in this report. After installation, the Orion software framework executes the .NET program\nSolarWinds.BusinessLayerHost.exe to load plugins, including SolarWinds.Orion.Core.BusinessLayer.dll. This\nplugin contains many legitimate namespaces, classes, and routines that implement functionality within the Orion\nframework. Hidden in plain sight, the class\nSolarWinds.Orion.Core.BusinessLayer.OrionImprovementBusinessLayer implements an HTTP-based backdoor.\nCode within the logically unrelated routine\nSolarWinds.Orion.Core.BusinessLayer.BackgroundInventory.InventoryManager.RefreshInternal invokes the\nbackdoor code when the Inventory Manager plugin is loaded.\n\nSolarWinds.Orion.Core.BusinessLayer.dll is signed by SolarWinds, using the certificate with serial number\n0f:e9:73:75:20:22:a6:06:ad:f2:a3:6e:34:5d:c0:ed. The file was signed on March 24, 2020.\n\n_Initialization_\n\nOn execution of the malicious SolarWinds.Orion.Core.BusinessLayer.OrionImprovementBusinessLayer.Initialize\nmethod the sample verifies that its lower case process name hashes to the value 17291806236368054941. This\nhash value is calculated as the standard FNV-1A 64-bit hash with an additional XOR by 6605813339339102567\nafter computing the FNV-1A. This hash matches a process named \"solarwinds.businesslayerhost\".\n\n\n-----\n\nThe sample only executes if the filesystem write time of the assembly is at least 12 to 14 days prior to the current\ntime; the exact threshold is selected randomly from an interval. The sample continues to check this time threshold\nas it is run by a legitimate recurring background task. Once the threshold is met, the sample creates the named\npipe 583da945-62af-10e8-4902-a8f205c72b2e to act as a guard that only one instance is running before reading\nSolarWinds.Orion.Core.BusinessLayer.dll.config from disk and retrieving the XML field appSettings. The\nappSettings fields’ keys are legitimate values that the malicious logic re-purposes as a persistent configuration.\nThe key ReportWatcherRetry must be any value other than 3 for the sample to continue execution.\n\nThe sample checks that the machine is domain joined and retrieves the domain name before execution continues.\nA userID is generated by computing the MD5 of a network interface MAC address that is up and not a loopback\ndevice, the domain name, and the registry value\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography\\MachineGuid. The userID is encoded via a\ncustom XOR scheme after the MD5 is calculated. The ReportWatcherPostpone key of appSettings is then read\nfrom SolarWinds.Orion.Core.BusinessLayer.dll.config to retrieve the initial, legitimate value. This operation is\nperformed as the sample later bit packs flags into this field and the initial value must be known in order to read out\nthe bit flags. The sample then invokes the method Update which is the core event loop of the sample.\n\n**DGA and Blocklists**\n\nThe backdoor determines its C2 server using a Domain Generation Algorithm (DGA) to construct and resolve a\nsubdomain of avsvmcloud[.]com. The Update method is responsible for initializing cryptographic helpers for the\ngeneration of these random C2 subdomains. Subdomains are generated by concatenating a victim userId with a\nreversible encoding of the victims local machine domain name. The attacker likely utilizes the DGA subdomain to\nvary the DNS response to victims as a means to control the targeting of the malware. These subdomains are\nconcatenated with one of the following to create the hostname to resolve:\n\n.appsync-api.eu-west-1[.]avsvmcloud[.]com\n.appsync-api.us-west-2[.]avsvmcloud[.]com\n.appsync-api.us-east-1[.]avsvmcloud[.]com\n.appsync-api.us-east-2[.]avsvmcloud[.]com\n\nProcess name, service name, and driver path listings are obtained, and each value is hashed via the FNV-1a +\nXOR algorithm as described previously and checked against hardcoded blocklists. Some of these hashes have\nbeen brute force reversed as part of this analysis, showing that these routines are scanning for analysis tools and\nantivirus engine components. If a blocklisted process is found the Update routine exits and the sample will continue\nto try executing the routine until the blocklist passes. Blocklisted services are stopped by setting their\nHKLM\\SYSTEM\\CurrentControlSet\\services\\<service_name>\\Start registry entries to value 4 for disabled. Some\nentries in the service list if found on the system may affect the DGA algorithms behavior in terms of the values\ngenerated. The list of stopped services is then bit-packed into the ReportWatcherPostpone key of the appSettings\nentry for the samples’ config file. If any service was transitioned to disabled the Update method exits and retries\nlater. The sample retrieves a driver listing via the WMI query Select * From Win32_SystemDriver. If any blocklisted\ndriver is seen the Update method exits and retries. If all blocklist tests pass, the sample tries to resolve\napi.solarwinds.com to test the network for connectivity.\n\n**Network Command and Control (C2)**\n\nIf all blocklist and connectivity checks pass, the sample starts generating domains in a while loop via its DGA. The\nsample will delay for random intervals between the generation of domains; this interval may be any random value\nfrom the ranges 1 to 3 minutes, 30 to 120 minutes, or on error conditions up to 420 to 540 minutes (9 hours). The\nDNS A record of generated domains is checked against a hardcoded list of IP address blocks which control the\nmalware’s behavior. Records within the following ranges will terminate the malware and update the configuration\nkey ReportWatcherRetry to a value that prevents further execution:\n\n10.0.0.0/8\n\n\n-----\n\n172.16.0.0/12\n192.168.0.0/16\n224.0.0.0/3\nfc00:: - fe00::\nfec0:: - ffc0::\nff00:: - ff00::\n20.140.0.0/15\n96.31.172.0/24\n131.228.12.0/22\n144.86.226.0/24\n\nOnce a domain has been successfully retrieved in a CNAME DNS response the sample will spawn a new thread of\nexecution invoking the method HttpHelper.Initialize which is responsible for all C2 communications and\ndispatching. The HTTP thread begins by delaying for a configurable amount of time that is controlled by the\nSetTime command. The HTTP thread will delay for a minimum of 1 minute between callouts. The malware uses\nHTTP GET or HTTP POST requests. If the sample is attempting to send outbound data the content-type HTTP\nheader will be set to \"application/octet-stream\" otherwise to \"application/json\".\n\nA JSON payload is present for all HTTP POST and PUT requests and contains the keys “userId”, “sessionId”, and\n“steps”. The “steps” field contains a list of objects with the following keys: “Timestamp”, “Index”, “EventType”,\n“EventName”, “DurationMs”, “Succeeded”, and “Message”. The JSON key “EventType” is hardcoded to the value\n“Orion”, and the “EventName” is hardcoded to “EventManager”. Malware response messages to send to the server\nare DEFLATE compressed and single-byte-XOR encoded, then split among the “Message” fields in the “steps”\narray. Each “Message” value is Base64 encoded separately. Not all objects in the “steps” array contribute to the\nmalware message – the integer in the “Timestamp” field must have the 0x2 bit set to indicate that the contents of\nthe “Message” field are used in the malware message. Step objects whose bit 0x2 is clear in the Timestamp field\ncontain random data and are discarded when assembling the malware response.\n\n**Steganography**\n\nIn observed traffic these HTTP response bodies attempt to appear like benign XML related to .NET assemblies, but\ncommand data is actually spread across the many GUID and HEX strings present. Commands are extracted from\nHTTP response bodies by searching for HEX strings using the following regular expression: \"\\{[0-9a-f-]{36}\\}\"|\"[09a-f]{32}\"|\"[0-9a-f]{16}\". Command data is spread across multiple strings that are disguised as GUID and HEX\nstrings. All matched substrings in the response are filtered for non HEX characters, joined together, and HEXdecoded. The first DWORD value shows the actual size of the message, followed immediately with the message,\nwith optional additional junk bytes following. The extracted message is single-byte XOR decoded using the first\nbyte of the message, and this is then DEFLATE decompressed. The first character is an ASCII integer that maps to\nthe JobEngine enum, with optional additional command arguments delimited by space characters.\n\nCommands are then dispatched to a JobExecutionEngine based upon the command value as described next.\n\n**Supported Commands**\n\n**Command** **Value** **Operation**\n\nIdle 0 No operation\n\nExit 1 Terminate the current thread.\n\n\n-----\n\nSetTime 2 Sets the delay time between main event loop executions Delay is\nin seconds, and varies random between [.9 * <delay>, 1.1 *\n<delay>].     If the delay is < 300 it is doubled on the next\nexecution through the loop, this means it should settle onto an\ninterval of around [5, 10] minutes.     There is a second,\nunrelated delay routine that delays for a random interval between\n\n[16hrs, 83hrs]\n\nCollectSystemDescription 3 Profile the local system including hostname, username, OS\nversion, MAC addresses, IP address, DHCP configuration, and\ndomain information.\n\nUploadSystemDescription 4 Perform a HTTP request to the specified URL, parse the results\nand compare components against unknown hashed values.\nFormat a report and send to the C2 server.\n\nRunTask 5 Starts a new process with the given file path and arguments\n\nGetProcessByDescription 6 Returns a process listing. If no arguments are provided returns\njust the PID and process name.    If an argument is provided it\nalso returns the parent PID and username and domain for the\nprocess owner.\n\nKillTask 7 Terminate the given process, by PID.\n\nGetFileSystemEntries 8 Given a path and an optional match pattern recursively list files\nand directories\n\nWriteFile 9 Given a file path and a Base64 encoded string write the contents\nof the Base64 decoded string to the given file path. Write using\nappend mode. Delay for [1s, 2s] after writing is done.\n\nFileExists 10 Tests whether the given file path exists.\n\nDeleteFile 11 Deletes the specified file path.\n\nGetFileHash 12 Compute the MD5 of a file at a given path and return result as a\nHEX string. If an argument is provided, it is the expected MD5\nhash of the file and returns an error if the calculated MD5 differs.\n\nReadRegistryValue 13 Arbitrary registry read from one of the supported hives\n\nSetRegistryValue 14 Arbitrary registry write from one of the supported hives.\n\nDeleteRegistryValue 15 Arbitrary registry delete from one of the supported hives\n\nGetRegistrySubKeyAndValueNames 16 Returns listing of subkeys and value names beneath the given\nregistry path\n\n\n-----\n\nReboot 17 Attempts to immediately trigger a system reboot.\n\n**Indicators and Detections to Help the Community**\n\nTo empower the community to detect this supply chain backdoor, we are publishing indicators and detections to\nhelp organizations identify this backdoor and this threat actor. The signatures are a mix of Yara, IOC, and Snort\nformats.\n\n[A list of the detections and signatures are available on the FireEye GitHub repository found here. We are releasing](https://github.com/mandiant/sunburst_countermeasures)\ndetections and will continue to update the public repository with overlapping detections for host and network-based\nindicators as we develop new or refine existing ones. We have found multiple hashes with this backdoor and we\nwill post updates of those hashes.\n\n**MITRE ATT&CK Techniques Observed**\n\n**ID** **Description**\n\nT1012 Query Registry\n\nT1027 Obfuscated Files or Information\n\nT1057 Process Discovery\n\nT1070.004 File Deletion\n\nT1071.001 Web Protocols\n\nT1071.004 Application Layer Protocol: DNS\n\nT1083 File and Directory Discovery\n\nT1105 Ingress Tool Transfer\n\nT1132.001 Standard Encoding\n\nT1195.002 Compromise Software Supply Chain\n\nT1518 Software Discovery\n\nT1518.001 Security Software Discovery\n\nT1543.003 Windows Service\n\nT1553.002 Code Signing\n\nT1568.002 Domain Generation Algorithms\n\n\n-----\n\nT1569.002 Service Execution\n\nT1584 Compromise Infrastructure\n\n**Immediate Mitigation Recommendations**\n\nPrior to following SolarWind’s recommendation to utilize Orion Platform release 2020.2.1 HF 1, which is currently\navailable via the SolarWinds Customer Portal, organizations should consider preserving impacted devices and\nbuilding new systems using the latest versions. Applying an upgrade to an impacted box could potentially overwrite\nforensic evidence as well as leave any additional backdoors on the system. In addition, SolarWinds has released\n[additional mitigation and hardening instructions here.](https://www.solarwinds.com/securityadvisory)\n\nIn the event you are unable to follow SolarWinds’ recommendations, the following are immediate mitigation\ntechniques that could be deployed as first steps to address the risk of trojanized SolarWinds software in an\nenvironment. If attacker activity is discovered in an environment, we recommend conducting a comprehensive\ninvestigation and designing and executing a remediation strategy driven by the investigative findings and details of\nthe impacted environment.\n\nEnsure that SolarWinds servers are isolated / contained until a further review and investigation is conducted.\nThis should include blocking all Internet egress from SolarWinds servers.\nIf SolarWinds infrastructure is not isolated, consider taking the following steps:\n\nRestrict scope of connectivity to endpoints from SolarWinds servers, especially those that would be\nconsidered Tier 0 / crown jewel assets\nRestrict the scope of accounts that have local administrator privileged on SolarWinds servers.\nBlock Internet egress from servers or other endpoints with SolarWinds software.\nConsider (at a minimum) changing passwords for accounts that have access to SolarWinds servers /\ninfrastructure. Based upon further review / investigation, additional remediation measures may be required.\nIf SolarWinds is used to managed networking infrastructure, consider conducting a review of network device\nconfigurations for unexpected / unauthorized modifications. Note, this is a proactive measure due to the\nscope of SolarWinds functionality, not based on investigative findings.\n\n**Acknowledgements**\n\nThis blog post was the combined effort of numerous personnel and teams across FireEye coming together. Special\nthanks to:\n\nAndrew Archer, Doug Bienstock, Chris DiGiamo, Glenn Edwards, Nick Hornick, Alex Pennino, Andrew Rector,\nScott Runnels, Eric Scales, Nalani Fraser, Sarah Jones, John Hultquist, Ben Read, Jon Leathery, Fred House,\nDileep Jallepalli, Michael Sikorski, Stephen Eckels, William Ballenthin, Jay Smith, Alex Berry, Nick Richard, Isif\nIbrahima, Dan Perez, Marcin Siedlarz, Ben Withnell, Barry Vengerik, Nicole Oppenheim, Ian Ahl, Andrew\nThompson, Matt Dunwoody, Evan Reese, Steve Miller, Alyssa Rahman, John Gorman, Lennard Galang, Steve\nStone, Nick Bennett, Matthew McWhirt, Mike Burns, Omer Baig.\n\nAlso special thanks to Nick Carr, Christopher Glyer, and Ramin Nafisi from Microsoft.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-13 - Highly Evasive Attacker Leverages SolarWinds Supply Chain to Compromise Multiple Global Victims With SUNBURST Backdoor.pdf"
    ],
    "report_names": [
        "2020-12-13 - Highly Evasive Attacker Leverages SolarWinds Supply Chain to Compromise Multiple Global Victims With SUNBURST Backdoor.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536212,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653681450,
    "ts_modification_date": 1653681450,
    "files": {
        "pdf": "https://archive.orkl.eu/17f81def748b821ec350c1568d2b80bf5d141a0a.pdf",
        "text": "https://archive.orkl.eu/17f81def748b821ec350c1568d2b80bf5d141a0a.txt",
        "img": "https://archive.orkl.eu/17f81def748b821ec350c1568d2b80bf5d141a0a.jpg"
    }
}