{
    "id": "2ed4c42d-cc01-40d3-9823-c9d09a80e829",
    "created_at": "2023-01-12T15:02:59.962994Z",
    "updated_at": "2025-03-27T02:15:01.98523Z",
    "deleted_at": null,
    "sha1_hash": "069e6602490759729db5239b062381666427cf4b",
    "title": "2015-03-31 - Volatile Cedar - Analysis of a Global Cyber Espionage Campaign",
    "authors": "",
    "file_creation_date": "2022-05-28T18:05:25Z",
    "file_modification_date": "2022-05-28T18:05:25Z",
    "file_size": 193440,
    "plain_text": "# Volatile Cedar – Analysis of a Global Cyber Espionage Campaign\n\n**blog.checkpoint.com/2015/03/31/volatilecedar/**\n\nMarch 31, 2015\n\nToday, we announced the discovery of Volatile Cedar, a persistent attacker group\noriginating possibly in Lebanon with political ties.\n\nBeginning in late 2012, the carefully orchestrated attack campaign we call Volatile Cedar\nhas been targeting individuals, companies and institutions worldwide. This campaign, led by\na persistent attacker group, has successfully penetrated a large number of targets using\nvarious attack techniques, and specifically, a custom-made malware implant codenamed\n_Explosive. This report provides an extended technical analysis of Volatile Cedar and the_\n_Explosive malware._\n\nMalware attribution is often tricky and deception-prone. With that in mind, investigation of\nthe evidence leads us to suspect Volatile Cedar originates from Lebanon (hence its\nnickname). Moreover, the Volatile Cedar target vertical distribution strongly aligns with\nnation-state/political-group interests, eliminating the possibility of financially motivated\nattackers.\n\nWe have seen clear evidence that Volatile Cedar has been active for almost 3 years. While\nmany of the technical aspects of the threat are not considered “cutting edge”, the campaign\nhas been continually and successfully operational throughout this entire timeline, evading\ndetection by the majority of AV products. This success is due to a well-planned and carefully\nmanaged operation that constantly monitors its victims’ actions and rapidly responds to\ndetection incidents.\n\n\n-----\n\n_Volatile Cedar is heavily based on a custom-made remote access Trojan named Explosive,_\nwhich is implanted within its targets and then used to harvest information. Tracking down\nthese infections was quite a difficult task due to the multiple concealment measures taken\nby the attackers. The attackers select only a handful of targets to avoid unnecessary\nexposure. New and custom versions are developed, compiled and deployed specifically for\ncertain targets, and ”radio silence” periods are configured and embedded specifically into\neach targeted implant.\n\nThe modus operandi for this attacker group initially targets publicly facing web servers, with\nboth automatic and manual vulnerability discovery. Once in control of a server, the attackers\nfurther penetrate the targeted internal network via various means, including manual online\nhacking as well as an automated USB infection mechanism.\n\nIn our report, we discuss the attack vectors and infection techniques used by the attack\ncampaign as well as provide indicators that can be used to detect and remove the infection.\nWe’ve provided some more basic information below.\n\n[For in-depth information, please view our media alert and](http://www.checkpoint.com/press/2015/media-alert-check-point-researchers-discover-global-cyber-espionage-campaign-with-possible-link-to-lebanese-political-group/) [technical report.](http://www.checkpoint.com/downloads/volatile-cedar-technical-report.pdf)\n\nWe would like to acknowledge the following people for their contribution to the research\nefforts leading to this report: Lead researcher Yaniv Balmas, Irena Damsky, Maya Horowitz,\nAssaf Krintza, Michael Shalyt, Shahar Tal, Ron Davidson and Rachel Teitz.\n**Volatile Cedar – The Facts**\n\n**What is Volatile Cedar?**\n\nVolatile Cedar is an APT malware campaign first detected and investigated by Check Point.\n\n**Who are the attackers behind Volatile Cedar?**\n\nWe have seen evidence which suggests the attacker group is based in Lebanon. Victim\ngeography and verticals may indicate the interests of a government/political group.\n\n**Who was attacked?**\n\nAmong the confirmed targets, we identified defense contractor firms, telecommunications\nand media companies, and educational institutions. We confirmed live infections in\napproximately 10 different countries, including the USA, Canada, UK, Turkey, Lebanon and\nIsrael.\n\n**What technical measures are used in the Volatile Cedar campaign?**\n\nThe attacker’s main tool is a custom malware implant codenamed ‘Explosive’ (named by\nthe attackers). Additionally, we have found traces of common hacking tools such as\nvulnerability scanners, web shells and public exploit code.\n\n\n-----\n\n**Why is it named Volatile Cedar?**\n\nVolatile is a synonym for explosive, and the cedar is Lebanon’s national emblem.\n\n**How long has Volatile Cedar been operational?**\n\nWe have seen evidence of activity starting in early 2012, and it is still ongoing as of this\nwriting.\n\n**What is Check Point doing to mitigate this threat?**\n\nCheck Point has deployed software protections to all its customers against the technical\nindicators of this attack. Additionally, we are publishing a report which describes and\nexamines the security risks involved.\n\n**Has Volatile Cedar been detected before?**\n\nEarlier versions of the Explosive implant have been heuristically classified as malicious by\nmultiple AV products. Each detection has almost immediately been followed by the removal\nof the compromised tool and the creation of a new, undetected, version. This is further proof\nof the group’s relatively high operational level.\n\n**Where did Check Point first detect Volatile Cedar?**\n\nCheck Point detected the Explosive malware on a web server in a customer network.\n\n**What abilities does Explosive have?**\n\nThe implant has both passive collection methods and on-demand capabilities. Once\ninstalled, the tool continuously runs a keylogger and a clipboard logger, which transmit the\nresults to the C&C server. In addition, Explosive has a wide array of options that can be\nactivated by a C&C command, including a variety of data theft and machine fingerprinting\ncapabilities, stealth and self-destruction functions, proliferation options and a remote shell.\n\nFinally, the creators of Explosive went to great lengths to assure operational stealth to\nprotect against exposure, including memory usage monitoring, process listing etc.\n\n**Can Explosive cause damage?**\n\nThe main threat is sensitive data theft and cyber espionage. The implant has built-in file\ndeletion functionality as well as arbitrary code execution, making it possible for the attackers\nto inflict a lot of damage on an infected system.\n\n**How can I remove the Explosive malware?**\n\n\n-----\n\nThe Check Point technical report indicates which elements to remove to mitigate the live\nmalware infection. Note: As in any malware infection, the attackers may have obtained\ncredentials or other methods of accessing to your network, which requires additional means\nof protection.\n\n**I have significant information about the campaign or its victims. Who do I contact?**\n\n[We have opened the [email protected] mailbox for information sharing purposes.](https://blog.checkpoint.com/cdn-cgi/l/email-protection#3741585b56435e5b52545253564577545f52545c47585e59431954585a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-03-31 - Volatile Cedar - Analysis of a Global Cyber Espionage Campaign.pdf"
    ],
    "report_names": [
        "2015-03-31 - Volatile Cedar - Analysis of a Global Cyber Espionage Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e7c75c6-097f-4d80-8c98-73485fe2a729",
            "created_at": "2022-10-25T16:07:24.386715Z",
            "updated_at": "2025-03-27T02:02:10.203847Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Dancing Salome",
                "DeftTorero"
            ],
            "source_name": "ETDA:Volatile Cedar",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Adminer",
                "DirBuster",
                "GoBuster",
                "JuicyPotato",
                "RottenPotato",
                "SharPyShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc5c22a8-29eb-4a87-acd6-4817060e80f2",
            "created_at": "2022-10-25T15:50:23.658256Z",
            "updated_at": "2025-03-27T02:00:55.514297Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Volatile Cedar",
                "Lebanese Cedar"
            ],
            "source_name": "MITRE:Volatile Cedar",
            "tools": [
                "Caterpillar WebShell"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "17b152bc-6f7e-463c-8b4c-a4844caea6df",
            "created_at": "2023-01-06T13:46:38.498795Z",
            "updated_at": "2025-03-27T02:00:02.849085Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Lebanese Cedar",
                "DeftTorero"
            ],
            "source_name": "MISPGALAXY:Volatile Cedar",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535779,
    "ts_updated_at": 1743041701,
    "ts_creation_date": 1653761125,
    "ts_modification_date": 1653761125,
    "files": {
        "pdf": "https://archive.orkl.eu/069e6602490759729db5239b062381666427cf4b.pdf",
        "text": "https://archive.orkl.eu/069e6602490759729db5239b062381666427cf4b.txt",
        "img": "https://archive.orkl.eu/069e6602490759729db5239b062381666427cf4b.jpg"
    }
}