{
    "id": "2ef654ab-4d06-4f6c-8ce3-05b7fad9e222",
    "created_at": "2023-01-12T15:02:28.587583Z",
    "updated_at": "2025-03-27T02:05:43.769128Z",
    "deleted_at": null,
    "sha1_hash": "db3848d094c433156e38e7c9a918ab71c12d7211",
    "title": "2022-03-16 - The Attack of the Chameleon Phishing Page",
    "authors": "",
    "file_creation_date": "2022-05-28T17:11:04Z",
    "file_modification_date": "2022-05-28T17:11:04Z",
    "file_size": 1582484,
    "plain_text": "# The Attack of the Chameleon Phishing Page\n\n**[trustwave.com/en-us/resources/blogs/spiderlabs-blog/the-attack-of-the-chameleon-phishing-page/](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/the-attack-of-the-chameleon-phishing-page/)**\n\nLoading...\n\nBlogs & Stories\n\n## SpiderLabs Blog\n\nAttracting more than a half-million annual readers, this is the security community's go-to destination for\ntechnical breakdowns of the latest threats, critical vulnerability disclosures and cutting-edge research.\n\nRecently, we encountered an interesting phishing webpage that caught our interest because it acts like\na chameleon by changing and blending its color based on its environment. In addition, the site adapts\nits background page and logo depending on user input to trick its victims into giving away their email\ncredentials.\n\nWe see an email with the “initial” URLs in the example below:\n\n\n-----\n\n**Figure 1. The raw phishing email showing the URLs, purporting to be a fax message that needs to be**\n_accessed._\n\nThere are three URLs in the email. The second and third URLs are identical, which we will discuss later.\nTo see what would happen we placed the first URL in a web browser, equating to the email’s\ninstructions for the target to click on the provided link to access the “fax document.” Doing so brought\nus to the phishing site shown below. The webpage is fabricated. The victim’s email address is already\nprovided, and the site only asks for the victim’s password.\n\n\n-----\n\n**Figure 2. Obviously, a phishing website, but wait there’s more.**\n\nAs previously noted, the second and third URLs are identical. This is where things get interesting.\nWhen we checked out these URLs in a browser it appeared to look just like another run of the mill\nphishing site. The phishing URL’s format is the victim’s email address and is referenced on the\nfragment part (#). The fragment was used to auto-populate the email address field in the webpage. This\n[link contains a further explanation of URL fragments. By removing the fragment part of the URL](https://en.wikipedia.org/wiki/URI_fragment)\ncontaining the victim’s email address, most of the web graphics disappear, making the login page look\nrather bland.\n\n\n-----\n\n**Figure 3. Wait, what? Another phishing page? The original fully dressed up and a second kind of**\n_vanilla flavored._\n\nInstead of using the email of the intended recipient, we played around with the URL. We crafted a\ndummy email address and username and used common email provider domains like gmail.com and\noutlook.com. The results were interesting.\n\n**Figure 4. Crafted gmail.com and outlook email address domain name and the results.**\n\n\n-----\n\nThis custom phishing site acts like a chameleon, by changing and blending its images to camouflage\nitself. There were four noticeable web elements that changed whenever we tested a crafted email\naddress in the browser:\n\nThe page’s background\nA blurred logo\nThe title tab\nThe capitalized text of the domain from the email address provider.\n\nWe can dive deeper into how these changes happen on the website in the backend by viewing the\nsource code. The site does not allow this action when we do a mouse right-click, but there’s a keyboard\nshortcut for this in Google Chrome’s browser, CTRL + U, which opens a new page tab containing the\ncode.\n\nWe checked out the scripts in the source code and discovered how the threat actors created their\nbehind-the-scenes trickery. In the JavaScript code, the declared string variable my_slice is commonly\nused. The supplied email address was validated with a regular expression then parsed to extract the\ndomain name.\n\n**Figure 5. One variable that rules them all – my_slice**\n\n### The Page Background\n\nThe iframe with ID mainPage was concatenated with text protocol https:// and the variable my_slice to\nbe its source attribute. This action pulls in content from the domain in the email address, and this helps\nmake the webpage believable, so the victim won’t notice that an incorrect webpage is being accessed.\n\n\n-----\n\n**Figure 6. The iFrame code of the unclickable background.**\n\n### The Blurred Logo\n\nThe code sourced the logo from Google favicon API. The my_slice variable was used in the API query\nto find the matching logo to make the phishing webpage realistic. The sourced logo seemed small, it\nwas stretched, and that’s why it looks blurry on the webpage.\n\n**Figure 7. The stolen logo’s code.**\n\n### The Tab Title and the Capitalized Text Beside the Logo\n\nThe parsed domain name variable, my_slice, then undergoes another parsing, disregarding the TLD,\nextracting the brand, and using it for the logoname global variable.\n\n\n-----\n\n**Figure 8. The parsed domain's code.**\n\nThe code also included various input text field validators to check the text of the email address and\npassword.\n\n**Figure 9. The text validators on the textbox fields.**\n\nAs the victim keys in their password, a notification will appear, “Invalid Details, Please try again.” The\nsubmit button’s text shifts from Continue to Sign in. Unknowingly to the user, each time the button is\nclicked, the email and password data are forwarded to the attacker’s server. After three tries, it finally\nredirects the victim to the correct website. Once more, the variable my_slice is used by concatenating\nwith “http://www.” to be the final landing page destination.\n\n\n-----\n\n**Figure 10. This is where the target’s credentials are taken away and sent to the final landing page.**\n\nWe tried sending a dummy email and password via POST monitored by the network monitoring\napplication, Fiddler; unfortunately, the server is inaccessible.\n\n**Figure 11. The attacker’s server is currently offline, for now.**\n\nPhishing webpages are often taken down in a matter of minutes or become unavailable as soon as\ninformation security companies detect them as being malicious. These templated, or so-called\nchameleon phishing sites, are used repeatedly by malware authors using the clever tricks we just\ndetailed to fool the user into thinking these pages are real. The phishers can easily customize the\ntemplate and use other domains to host these scripts, allowing attackers to prey on unsuspecting users\nover and over again.\n\n[Trustwave MailMarshal defends against this phishing campaign.](https://www.trustwave.com/en-us/services/email-security/)\n\n\n-----\n\n### IOCs:\n\n**URLs**\n\n_hxxps://ipfs[.]io/ipfs/QmWzESuyrcihoEvCZYrzLpYoZjbeH2b9YdhnkhQWYGVJdX#[emailAddress]_\n_hxxps://gateway[.]pinata[.]cloud/ipfs/QmbGkfWJDuhgF7PNYTpeqLqSyvmX8yupDbS1CZXWM7Jz4i#_\n\n_[emailAddress]_\n_https://info[.]hyundai-inidan[.]ro/cgi/apc[.]php_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-16 - The Attack of the Chameleon Phishing Page.pdf"
    ],
    "report_names": [
        "2022-03-16 - The Attack of the Chameleon Phishing Page.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535748,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653757864,
    "ts_modification_date": 1653757864,
    "files": {
        "pdf": "https://archive.orkl.eu/db3848d094c433156e38e7c9a918ab71c12d7211.pdf",
        "text": "https://archive.orkl.eu/db3848d094c433156e38e7c9a918ab71c12d7211.txt",
        "img": "https://archive.orkl.eu/db3848d094c433156e38e7c9a918ab71c12d7211.jpg"
    }
}