{
    "id": "2f00e604-f38c-448c-8bf5-b8cfc3d2b722",
    "created_at": "2022-10-25T16:48:25.146651Z",
    "updated_at": "2025-03-27T02:16:01.159094Z",
    "deleted_at": null,
    "sha1_hash": "dd16552805b96e7cafc27d7edcd05e15014e4091",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-10-14T07:02:27Z",
    "file_modification_date": "2019-10-14T07:02:27Z",
    "file_size": 775968,
    "plain_text": "# Tick Group Weaponized Secure USB Drives to Target Air- Gapped Critical Systems\n\n**[unit42.paloaltonetworks.com/unit42-tick-group-weaponized-secure-usb-drives-target-air-gapped-critical-systems](https://unit42.paloaltonetworks.com/unit42-tick-group-weaponized-secure-usb-drives-target-air-gapped-critical-systems/)**\n\nBy Kaoru Hayashi and Mike Harbison June 22, 2018\n\nSummary\n\nTick is a cyberespionage group primarily targeting organizations in Japan and the Republic of\nKorea. The group is known to conduct attack campaigns with various custom malware such as\nMinzen, Datper, Nioupale (aka Daserf), and HomamDownloader. Unit 42 last wrote about the Tick\n[group in July 2017.](https://researchcenter.paloaltonetworks.com/2017/07/unit42-tick-group-continues-attacks/)\n\nRecently, Palo Alto Networks Unit 42 discovered the Tick group targeted a specific type of secure\nUSB drive created by a South Korean defense company. The USB drive and its management\nsystem have various features to follow security guidelines in South Korea.\n\nThe weaponization of a secure USB drive is an uncommon attack technique and likely done in an\neffort to spread to air-gapped systems, which are systems that do not connect to the public\ninternet. In addition, our research shows that the malware used in these attacks will only try to\ninfect systems running Microsoft Windows XP or Windows Server 2003. This is despite the fact\nthat the malware appears to have been created when newer versions of Windows software were\navailable. This would seem to indicate an intentional targeting of older, out-of-support versions of\n\n\n-----\n\nMicrosoft Windows installed on systems with no internet connectivity. Air-gapped systems are\ncommon practice in many countries for government, military, and defense contractors, as well as\nother industry verticals.\n\nWe have not identified any public reporting on this attack, and we suspect the Tick group used the\nmalware described in this report in attacks multiple years ago. Based on the data collected, we do\nnot believe this malware is part of any active threat campaign.\n\nOur picture of this past attack is incomplete at this time. Based on our research thus far, we are\nable to sketch out the following hypothesized attack scenario:\n\n1. The Tick Group somehow compromised a secure type of USB drive and loaded a malicious\n\nfile onto an unknown number of them. These USB drives are supposed to be certified as\n[secure by the South Korean ITSCC (English).](http://www.itscc.kr/svc/svc/openPage.do?pageId=010100)\n2. The Tick Group created a specific malware we are calling SymonLoader that somehow gets\n\non older Windows systems and continuously looks for these specific USB drives.\n3. SymonLoader specifically targets Windows XP and Windows Server 2003 systems ONLY.\n4. If SymonLoader detects the presence of a specific type of secure USB drive, it will attempt\n\nto load the unknown malicious file using APIs that directly access the file system.\n\nIn the research below, we outline our findings around SymonLoader. We do not currently have\neither a compromised USB drive nor the unknown malicious file we believe is implanted on these\ndevices. Because of this we are unable to describe the full attack sequence.\n\nBecause we do not have either a compromised USB drive or the unknown malicious file, we are\nalso unable to determine how these USB drives have been compromised. Specifically, we do not\nknow if there has been a successful compromise in the supply-chain making these devices, or if\nthese have been compromised post-manufacturing and distributed using other means such as\nsocial engineering.\n\nTick and Trojanized Legitimate Software\n\nUnit 42 hasn’t identified the initial delivery method; the overview of the infection process is shown\nbelow in Figure 1.\n\n\n-----\n\n_Figure 1 Infection process_\n\nFirst, the attacker tricks users with a Trojanized version of legitimate software to install the loader\nprogram, which is a new tool to Tick we’ve named “SymonLoader”.\n\nWhen executed, the loader starts monitoring storage device changes on a compromised\nmachine. If SymonLoader detects the targeted type of secure USB drive, it attempts to access the\nstorage through the device driver corresponding to the secure USB and checks for strings specific\nto one type of secure USB in the drive information fields. Then, it accesses a predefined location\nof the storage on the USB and extracts an unknown PE file.\n\n[As we described in a previous blog last July, the Tick group Trojanized a legitimate program and](https://researchcenter.paloaltonetworks.com/2017/07/unit42-tick-group-continues-attacks/)\nembedded malware called HomamDownloader. The attackers then sent the Trojanized legitimate\napplications as attachments to spear phishing email targets. When executed, the Trojanized\nlegitimate application drops HomamDownloader and installs the legitimate program. Recipients\nmay not be aware of the malware as the legitimate application works as expected.\n\nIn our research into these latest attacks, we found additional legitimate Trojanized Korean\nlanguage software since publishing out blog last year (Table 1). Similar to the previous samples\nwe examined in July 2017, these newly Trojanized legitimate programs also drop\nHomamDownloader. Also like we saw in our July 2017 research, HomamDownloader can install\nother malicious files from the remote C2 server; in this case, pre.englandprevail[.]com.\n\n**Trojanized Legitimate Software** **SHA256**\n\n**Movie Player installer** b1bb1d5f178b064eb1d7c9cc7cad‐\ncf8b3959a940c14cee457ce3aba5795660aa\n\n**Industrial battery monitoring** 3227d1e39fc3bc842245ccdb16eeaadad3bcd298e811573b2e68e‐\n\n\n-----\n\n**Storage encryption software** 92e0d0346774127024c672cc7239d‐\nd269824a79e85b84c532128fd9663a0ce78\n\n**File encryption software** 33665d93ab2a0262551c61ec9a3adca2c2b8d‐\nfea34e6f3f723274d88890f6ceb\n\n_Table 1_ _Trojanized Korean programs_\n\nDuring our investigation, we found an interesting sample on January 21, 2018 (Table 2). Similar to\nthe samples listed above, this sample is a Trojanized version of a legitimate program and drops\nmalware. In this case, the Trojanized application is a Japanese language GO game. Instead of\ninstalling HomamDownloader like we observed in July 2017, this Trojanized program installs a\nnew loader we’ve named SymonLoader.\n\nSymonLoader extracts a hidden executable file from a specific type of secure USB drive and\nexecutes it on the compromised system. Unfortunately, we do not have a copy of this file.\n\n\n**Trojanized Legitimate**\n**Software**\n\n\n**SHA256**\n\n\n**GO Game** 8549dcbdfc6885e0e7a1521da61352ef4f084d969dd30719166b47fd‐\nb204828a\n\n_Table 2_ _Trojanized Japanese language program_\n\nDespite the differences from previous samples, we believe this sample is related to the Tick group\nbecause the shellcode in the Trojanized Japanese game is exactly the same as that found in the\nTrojanized Korean programs described earlier. Also, SymonLoader shares code with\nHomamDownloader (Figure 2). The Tick group is known to develop and consistently update\ncustom tools. As such, code reuse like this is consistent with their development practices.\n\n_Figure 2 Sharing code between SymonLoader and HomamDownloader_\n\nSecure USB\n\nSymonLoader first checks the operating system version of the target host and if it is newer than\nWindows XP or Windows Server 2003, it stops working. According to the timedate stamp in the\nPE header, the malware was created on 26 September 2012. Both Windows 7 and Windows\nServer 2008 were already released by then if the timedate value is not modified.\n\n\n-----\n\nAfter checking the OS version, SymonLoader creates a hidden window named device monitor\nthat starts monitoring storage device changes on the compromised system. When a removable\ndrive is connected the malware checks the drive letter and drive type. If the drive letter is not A or\nB, and the drive type is not a CDROM the malware calls CreateFile API and gets a handle to the\nstorage device. By excluding drives A and B (typically used for floppy drives) and CDROM drive\ntypes, it appears likely that the malware is targeting removable USB drives.\n\n[Next, the malware calls the DeviceIoControl() function with an undocumented custom control](https://msdn.microsoft.com/en-us/library/windows/desktop/aa363216(v=vs.85).aspx)\ncode, 0xE2000010 (Figure 3). The control code consists of four different types of values;\nDeviceType, Function, Access, and Method. In this case, the DeviceType value is 0xE200\n[computed as: (0x0E2000010 & 0xffff0000)>>0x10.  According to Microsoft, this specific](https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/defining-i-o-control-codes)\nDeviceType value should be in the range for third-party vendors. To function properly, the thirdparty driver needs to be present on the compromised system before the malware calls\nDeviceIoControl() with the custom control code 0xE2000010. But which third-party driver? There\nis a clue in the next function.\n\n_Figure 3 DeviceIoControl with custom IoControlCode_\n\nSymonLoader gets device information by SCSI INQUIRY command using the\n[IOCTL_SCSI_PASS_THROUGH parameter and determines if it is the targeted drive by searching](https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/content/ntddscsi/ni-ntddscsi-ioctl_scsi_pass_through)\nfor a specific string in the Vendor or Product identification on INQUIRY data. Our research into the\nstring used in these searches showed a company in the South Korea Defense Industry whose\nname matched the string. This company develops information and communication security\nequipment used by military, police, government agencies and public institutions. In a press, this\ncompany announced that they make secure USB storage devices that are certified to meet\n[security requirements set out by South Korea’s IT Security Certification Center (ITSCC (English)).](http://www.itscc.kr/svc/svc/openPage.do?pageId=010100)\nIn South Korea, certain organizations are required to follow the “USB storage medium guideline”\nand using only the devices passed the audit by the government agency. For example, the\nguideline of the Ministry of Unification of South Korea defines the USB memory and management\nsystem introduction procedure at section 4, item 1 (Figure 4).\n\n_Figure 4 USB memory introduction procedure_\n\nGoogle translation from Korean to English follows\n\n\n-----\n\n_According to Guidelines for Security Management of Auxiliary Storage Media such as USB_\n_Memory’, the headquarters security officer shall request the National Intelligence Service to verify_\n_the security compliance to introduce USB memory.”_\n\nWe found the third-party device driver in question in the installer of the secure USB drive in a\npublic sample repository, and confirmed it supports the custom control code, 0xE2000010. The\ndriver provides some functions to applications, including access to the corresponding secure USB\nvolumes. We feel this evidence shows that the malware attempts to work only on the secure USB\nproduct made by this particular company.\n\nLoading Hidden Module\n\nIf SymonLoader finds it is on a Windows XP or Windows Server 2003 system and finds that a\nnewly attached device is a USB drive made by this particular company, then it will extract an\nunknown executable file from the USB. While we do not have this file, we can glean information\nabout it by analyzing SymonLoader and the third-party driver. The attacker encrypted the\nunknown executable file and concealed it at the ending part of the secure USB storage in\nadvance. The hidden data is not accessible through logical file operation APIs, such as\nReadFile(). Instead, SymonLoader uses Logical Block Addressing(LBA) and SCSI commands to\nread the data physically from the particular expected location on the removable drive.\n\nLBA is a simple linear addressing scheme. Storage is divided into blocks by fixed size, and each\nblock has a number starting from zero to N-1, depends on the volume size. Applications can\nspecify the block number and access the data by SCSI commands.\n\nFinally, SymonLoader saves the extracted file in the temporary directory on the local disk and\nexecutes it. The procedure is as follows:\n\n1. Obtains final Logical Block Address(LBA) of the storage “N-1” by using the READ\n\nCAPACITY (10) command.\n2. Read the third last block “N-3” by READ (10) command and decrypts it.\n3. From the decrypted data, gets the LBA “X” where the main module locates.\n4. Loads data from LBA “X” to “N-4” by READ (10) command and decrypts it.\n5. Saves the decrypted file as %Temp%\\[random characters].tmp and execute it.\n6. Writes hostname and local time of the compromised system at LBA “N-2” by SAVE (10)\n\ncommand.\n\nFigure 5 shows the data layout of the malicious storage from the perspective of Logical Block\nAddressing.\n\n\n-----\n\n_Figure 5 Data layout on the malicious storage_\n\nConclusion\n\nThe Tick group uses Trojanized legitimate applications to trick victims into installing first stage\nmalware, mostly HomamDownloader. In this research, we identified a previously unknown loader\nmalware being dropped instead of HomamDownloader, which was most likely used in attacks\nmultiple years ago. In contrast to HomamLoader, which requires an Internet connection to reach\nits C2 server to download additional payloads, SymonLoader attempts to extract and install an\nunknown hidden payload from a specific type of secure USB drive when it’s plugged into a\ncompromised system. This technique is uncommon and hardly reported among other attacks in\nthe wild.\n\nWhile we do not have a copy of the file hidden on the secure USB, we have more than enough\ninformation to determine it is more than likely malicious. Weaponizing a secure USB drive is an\nuncommon technique and likely done in an effort to compromise air-gapped systems, which are\nsystems that do not connect to the public internet. Some industries or organizations are known for\nintroducing air gapping for security reasons. In addition, outdated versions Operating Systems are\noften used in those environments because of no easy-update solutions without internet\nconnectivity. When users are not able to connect to external servers, they tend to rely on physical\nstorage devices, particularly USB drives, for data exchange. The SymonLoader and secure USB\ndrive discussed in this blog may fit for this circumstance.\n\nPalo Alto Networks customers are protected from these threats in the following ways:\n\n1. All samples discussed are classified as malicious by the WildFire sandbox platform.\n2. All identified domains have been classified as malicious.\n3. AutoFocus users can track the malware described in this report using Tick campaign tag,\n\n\n-----\n\n4. Customers running Traps are protected from the discussed threats.\n\nIoCs\n\n**SymonLoader**\n\n**Malformed Legitimate software SHA256**\n8549dcbdfc6885e0e7a1521da61352ef4f084d969dd30719166b47fdb204828a\n\n**SysmonLoader SHA256**\n31aea8630d5d2fcbb37a8e72fe4e096d0f2d8f05e03234645c69d7e8b59bb0e8\n\n**Mutex**\nSysMonitor_3A2DCB47\n\n**File Path**\n%ProgramFiles%\\Windows NT\\Accessories\\Microsoft\\msxml.exe\n%UserProfile%\\Applications\\Microsoft\\msxml.exe\n\n**Registry Entry**\nHKLM\\Software\\Microsof\\Windows\\CurrentVersion\\run\\”xml” = %ProgramFiles%\\Windows\nNT\\Accessories\\Microsoft\\msxml.exe\n\nHKCU\\Software\\Microsof\\Windows\\CurrentVersion\\run\\”xml” =\n%UserProfile%\\Applications\\Microsoft\\msxml.exe\n\n**HomamDownloader**\n\n**Trojanized Legitimate Software SHA256**\nb1bb1d5f178b064eb1d7c9cc7cadcf8b3959a940c14cee457ce3aba5795660aa\n\n3227d1e39fc3bc842245ccdb16eeaadad3bcd298e811573b2e68ef2a7077f6f6\n\n92e0d0346774127024c672cc7239dd269824a79e85b84c532128fd9663a0ce78\n\n33665d93ab2a0262551c61ec9a3adca2c2b8dfea34e6f3f723274d88890f6ceb\n\n**HomamDownloader SHA256**\n019874898284935719dc74a6699fb822e20cdb8e3a96a7dc8ec4f625e3f1116e\n\nee8d025c6fea5d9177e161dbcedb98e871baceae33b7a4a12e9f73ab62bb0e38\n\nf817c9826089b49d251b8a09a0e9bf9b4b468c6e2586af60e50afe48602f0bec\n\n**C2 of HomamDownloader**\npre.englandprevail[.]com\n\n## Get updates from Palo Alto Networks!\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.06.22.Iick.Group-weaponized-secure-usb/Tick%20Group%20Weaponized%20Secure%20USB%20Drives%20to%20Target%20Air-Gapped%20Critical%20Systems.pdf"
    ],
    "report_names": [
        "Tick Group Weaponized Secure USB Drives to Target Air-Gapped Critical Systems"
    ],
    "threat_actors": [
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716505,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1571036547,
    "ts_modification_date": 1571036547,
    "files": {
        "pdf": "https://archive.orkl.eu/dd16552805b96e7cafc27d7edcd05e15014e4091.pdf",
        "text": "https://archive.orkl.eu/dd16552805b96e7cafc27d7edcd05e15014e4091.txt",
        "img": "https://archive.orkl.eu/dd16552805b96e7cafc27d7edcd05e15014e4091.jpg"
    }
}