{
    "id": "2f4b9bcc-f87f-45d6-9245-3f3892f2aa17",
    "created_at": "2024-06-28T02:04:00.403953Z",
    "updated_at": "2025-03-27T02:17:14.564421Z",
    "deleted_at": null,
    "sha1_hash": "52f8d3331dd82e32b66f8f430f651af346f22fd0",
    "title": "Pawn Storm Uses Brute Force and Stealth Against High-Value Targets | Trend Micro (US)",
    "authors": "",
    "file_creation_date": "2024-06-27T13:41:05Z",
    "file_modification_date": "2024-06-27T13:41:05Z",
    "file_size": 1477907,
    "plain_text": "APT & Targeted Attacks\n\n# Pawn Storm Uses Brute Force and Stealth Against High-Value Targets\n\nTo help defenders learn more about Pawn Storm's activities and adjust their defenses, we offer\na technical analysis of some of the threat actor's recent and updated techniques.\n\nBy: Feike Hacquebord, Fernando Merces\n\nJanuary 31, 2024\n\nRead time: 10 min (2768 words)\n\n###  [] [Subscribe]\n\n##### Introduction\n\n Pawn Storm (also known as APT28 and Forest Blizzard) is an advanced\n\n persistent threat (APT) actor that shows incessant and lasting repetitions in\n\n its tactics, techniques, and procedures (TTPs). Some of the group’s\n\n campaigns involve using the same kind of technical tricks repeatedly,\n\n sometimes targeting hundreds of people in a single organization at the\n\n same time.\n\n The threat actor is known for still using its phishing email campaigns that\n\n are over a decade old and are sent to high-value targets around the world.\n\n Although the methods and infrastructure of these campaigns gradually\n\n change over time, they still provide valuable intelligence on Pawn Storm's\n\n infrastructure, including the ones it uses in more advanced campaigns. \n\n\n-----\n\n##### nature. On the contrary, we have clear indications that Pawn Storm has\n\n compromised thousands of email accounts over time, with some of these\n\n seemingly repetitive attacks being cleverly designed and stealthy. Some also\n\n use advanced TTPs. The loudness of the repetitive, oftentimes crude and\n\n aggressive campaigns, drown out the silence, subtlety, and complexity of\n\n the initial intrusion, as well as the post-exploitation actions that might occur\n\n once Pawn Storm gets an initial foothold in victim organizations.\n\n Based on our estimates, from approximately April 2022 until November\n\n 2023, Pawn Storm attempted to launch NTLMv2 hash relay attacks through\n\n different methods, with huge peaks in the number of targets and variations\n\n in the government departments that it targeted. Those on the receiving end\n\n of Pawn Storm’s malicious spear-phishing campaigns include organizations\n\n dealing with foreign affairs, energy, defense, and transportation. The group\n\n also targeted organizations involved with labor, social welfare, finance,\n\n parenthood, and even local city councils, a central bank, court houses, and\n\n the fire department of a country’s military branch.\n\n Are these attempts at launching Net-NTLMv2 hash relay attacks too noisy\n\n and repetitive? Or are they just Pawn Storm’s cost-efficient method of\n\n automating attempts to brute-force its way into the networks of\n\n governments, the defense industry, and military forces around the world?\n\n We think that is more of the latter. Furthermore, the constant attacks on\n\n governments, logistics, and the defense industry in several regions hide the\n\n more advanced part of the attacks, as described by the Polish ministry of\n\n defense ​and Microsoft in recent blog postings​. Part of the group's post\n exploitation activities involve the modification of folder permissions within\n\n\n-----\n\n##### malicious email messages from within the victim organization.\n\n The group’s targets include a wide range of tools from the government, the\n\n defense industry, the energy and transportation sectors, as well as the\n\n military. According to our telemetry, the targets were in Europe, North\n\n America, South America, Asia, Africa, and the Middle East.\n\n|Target description|Region|\n|---|---|\n|Armed forces|Europe, South America|\n|Central bank|Middle East|\n|City council|Asia, Europe, Middle East, North America, Africa|\n|Defense industry|Europe , North America, South America|\n|Aerospace industry|Europe|\n|Electricity authority|Europe, Middle East|\n|Energy sector|Europe|\n|Intellectual property authority|Middle East|\n|Ministry of Agriculture|Europe, South America|\n|Ministry of Energy|Europe|\n|Ministry of Environment|Europe|\n|Ministry of Finance|Europe , South America|\n|Ministry of Foreign Affairs|Europe, Middle East, Asia|\n|Ministry of the Interior|Europe|\n|Ministry for Labor|Europe, Asia|\n\n\n-----\n\n|Ministry for National Security|Europe|\n|---|---|\n|Business Ministry for Social Affairs|search Europe, Middle East|\n|Ministry of Transportation|Europe|\n|Parliament|Europe|\n|Postal services|Europe|\n|Presidency department|Europe|\n|State government|North America|\n\n\nTable 1. Pawn Storm targets in recent campaigns according to Trend Micro telemetry\n\n##### Pawn Storm, which has been active since at least 2004, began focusing\n\n more on operational security during the past few years, with the group’s\n\n TTPs changing slowly over time.\n\n One of the most common methods used by Pawn Storm to break into\n\n systems is brute-force credential attacks. Since 2019, the actor has been\n\n actively trying to brute-force its way into mail servers and the corporate\n\n virtual private network (VPN) services of organizations around the world​.\n\n We believe that Pawn Storm has had success with its campaigns and we\n\n assess that the threat actor has managed to breach thousands of email\n\n addresses, which we’ve observed are being abused to send additional\n\n waves of spear-phishing emails (most likely for information gathering, but\n\n also to be used as infrastructure for other attacks).\n\n\n-----\n\n##### recent and updated techniques we have seen the group use.\n\n Anonymization layers\n\n To hide their tracks, Pawn Storm employs a wide range of tools, including\n\n VPN services, Tor, data center IP addresses, and compromised EdgeOS\n\n routers that are probably also used by other financially motivated\n\n cybercriminals. In addition, Pawn Storm has compromised numerous email\n\n accounts around the world, using them as a launchpad to send spear\n phishing emails. Finally, the threat actor includes free services such as URL\n\n shorteners, free file hosting services, and free email services in its\n\n repertoire.\n\n Since at least 2019, Pawn Storm has been probing Microsoft Outlook\n\n servers and corporate VPN servers across regions, most likely in an attempt\n\n to use brute-force methods to access corporate and government accounts​.\n\n During that time, these probes were performed from data center computer\n\n servers that we had previously associated with Pawn Storm.\n\n Since 2020, more anonymizing shells were put in place (including Tor and\n\n commercial VPN networks) to continue with scanning and probing​. This use\n\n of anonymization layers is also seen in the group’s spear-phishing emails in\n\n recent years. Often, the spear-phishing emails were sent from\n\n compromised email accounts in the Middle East and Asia that were\n\n accessed over IMAP (Internet Message Access Protocol) from Tor or VPN\n\n exit nodes. When we combined data from the French cybersecurity agency\n\n Agence nationale de la sécurité des systèmes d'information (ANSSI) ​with our\n\n own, we were able to count more than a dozen different VPN services that\n\n have been used by Pawn Storm in 2022 and 2023.\n\n\n-----\n\n|VPN service|Confidence level (ANSSI)|Confidence level (Trend)|\n|---|---|---|\n|Business AnchorFree|N/A|search High|\n|Surfshark|High|N/A|\n|ExpressVPN|High|N/A|\n|CactusVPN|High|High|\n|Proton VPN|High|N/A|\n|Le VPN|N/A|High|\n|Mullvad VPN|N/A|High|\n|Whoer VPN|N/A|High|\n|Windscribe VPN|N/A|High|\n|PrivateVPN|Medium|N/A|\n|IPVanish|Medium|High|\n|NordVPN|Medium|N/A|\n|WorldVPN|Low|N/A|\n|PureVPN|Low|N/A|\n|VPNSecure|Low|N/A|\n\n\nTable 2. VPN services used by Pawn Storm, according to ANSSI ​and Trend data\n\n##### Pawn Storm has also been using EdgeOS routers to send spear-phishing\n\n emails, perform callbacks of CVE-2023-23397 exploits in Outlook, and proxy\n\n credential theft on credential phishing websites. Many of these EdgeOS\n\n routers look to have had implants, such as the Python-based Waitress and\n\n Werkzeug web server gateway interfaces, a Server Message Block (SMB)\n\n\n-----\n\n##### non-standard high TCP ports, like 2222, 58749, and 59417.\n\n We do not know whether Pawn Storm itself compromised these EdgeOS\n\n routers or if it is using routers that were already compromised by a third\n party actor. We have, however, observed commonalities among over a\n\n hundred EdgeOS routers that look to be compromised.\n\n Several of these EdgeOS routers are sources of pharmaceutical and dating\n\n spam, SSH brute-force attacks, and other types of abuse. A smaller subset\n\n was also used by Pawn Storm at the same time as the cybercriminal abuse.\n\n For example, the IP address 202.175.177[.]238 — a regular source of\n\n pharmaceutical spam during the same month — had a Werkzeug implant\n\n on port 8080 that occurred in March 2023, proxying credential theft for\n\n Pawn Storm. This effectively means that Pawn Storm’s use of EdgeOS\n\n routers blended cybercriminal activities, providing the group with an\n\n additional anonymization layer.\n\n Net-NTMLv2 hash relay attack \n\n In March 2023, the critical vulnerability CVE-2023-23397 was patched in\n\n Outlook. This flaw, which has low complexity for the attacker and does not\n\n need any user interaction, affected all versions of the Outlook app running\n\n on Windows. As described in our previous blog entry, the attack involves an\n\n email message being sent to the targeted organization with an extended\n\n Message Application Program Interface (MAPI) property with a Universal\n\n Naming Convention (UNC) path to a remote attacker-controlled SMB (via\n\n TCP 445) server. The attacker remotely sends a malicious calendar invite\n\n represented by .msg — the message format that supports reminders in\n\n\n-----\n\n##### When the victim connects to the attacker’s SMB server, the connection to\n\n the remote server sends the user’s NTLM protocol negotiation message\n\n containing the user’s Net-NTLMv2 hash, which the attacker can use for\n\n authentication against other systems that support NTLM authentication.\n\n This attack is known as a hash relay attack. For this to work, the attacker\n\n must relay the negotiation message after receiving it from the victim’s\n\n machine. Possible targets include Microsoft Exchange Servers from the\n\n same organization and domain. Attackers can also store these hashes to try\n\n and crack them to retrieve the clear-text password, but this process is\n\n heavily dependent on the password’s complexity and length, in case of\n\n dictionary and brute-force attacks.\n\n It appears that Pawn Storm has been using this vulnerability since it was still\n\n a zero-day (which we estimate to be around April 2022). The malicious\n\n messages were sent using hacked email accounts, mostly in the Middle East\n\n and Asia, that were similar to the ones used in 2022 for the over-a-decade\n old credential phishing campaigns of Pawn Storm. The only difference is\n\n that, based on our telemetry, VPN exit nodes like Cactus VPN were used for\n\n the credential phishing campaigns to connect to hacked email account\n\n using IMAP (Internet Message Access Protocol) as opposed to the malicious\n\n emails using CVE-2023-23397, where compromised EdgeOS routers were\n\n being used instead of VPN exit nodes.\n\n These campaigns lasted at least until the end of August 2023. Starting from\n\n April 2023, Pawn Storm used more elaborate methods in its attacks. These\n\n involved scripts hosted on Mockbin (mockbin.org) being sent to the targets\n\n via email. The Mockbin URLs check for particular User-Agent values and\n\n\n-----\n\n##### same free website service that has been abused since at least 2021 in older\n\n credential phishing campaigns of Pawn Storm).\n\nFigure 1. An example of a username exfiltration routine from Pawn Storm `download`\n\n##### Note that Pawn Storm uses a robust filtering system to deter security\n\n researchers, as well as automated scripts, that try to determine whether a\n\n website is malicious or not.\n\n Files uploaded to VirusTotal suggest there were other variants of these\n\n attacks, including one that had a final payload (SHA256:\n\n 52951f2d92e3d547bad86e33c1b0a8622ac391c614efa3c5d167d8a82593717\n\n 9) that is a PowerShell script that helps steal Net-NTLMv2 hashes. When\n\n run, the script leaves two background processes sending requests to\n\n localhost at port 8080, as Figure 2 shows. This will trigger an NTLMv2\n\n authentication via WebDAV, which is HTTP-based.\n\n\n-----\n\n##### The script then creates an HTTP listener to receive the requests:\n\nFigure 3. The HTTP listener for receiving requests `download`\n\n##### Next, the spawned process (client) sends a NEGOTIATE message to the\n\n listener script (server) that replies with a CHALLENGE message. During\n\n legitimate NTLM authentication, this message contains a random 8-byte\n\n number, but in this case, the attackers use a fixed sequence of bytes. The\n\n client then sends an AUTHENTICATE message to the server that forwards it\n\n to mockbin.org:\n\nFigure 4. Sending an AUTHENTICATE message to the server, which is forwarded to `download`\n\nmockbin.org\n\n##### We ran the script with the user “alice” in an ftr.com domain, after which the\n\n following packet was exfiltrated:\n\n\n-----\n\n##### Business search\n\n\nFigure 5. The exfiltrated packet `download`\n\n##### The capture was made with a Windows 10 Pro client that previously joined a\n\n Windows Server 2019 domain with its default settings. The blob matches\n\n the AUTHENTICATE_MESSAGE of the NTLM protocol, which we wrote a\n\n Kaitai Struct for. The packet contains everything needed to build a Net\n NTLMv2 hash string that can be used in a dictionary attack or a relay attack.\n\n Pawn Storm has also been using an exploit in the WinRAR vulnerability CVE\n 2023-38831 in a related hash relay attack.\n\n Recent credential phishing campaign\n\n Pawn Storm launched a credential phishing campaign against various\n\n governments in Europe from Nov. 29 to Dec. 11, 2023, using webhook[.]site\n\n URLs and Mullvad, Whoer, and IPVanish VPN IP addresses to send the\n\n emails. We can relate this campaign to some of the Net-NTLMv2 hash relay\n\n campaigns via technical indicators. For example, the same computer name\n\n was used in both campaigns. That computer name was also used to send\n\n out spear-phishing emails and craft LNK files that were used in some of the\n\n Net-NTLMv2 hash relay campaigns.\n\n\n-----\n\n##### Business search\n\n\nFigure 6. Pawn Storm’s credential phishing website using webhook[.][site URLs in November `download`\n\nand December 2023\n\n##### Information stealer without a C&C server\n\n In October 2022, Pawn Storm sent spear-phishing emails to a select\n\n number of targets, including embassies and other high-profile targets.\n\n These emails included a simple and small information stealer as an\n\n attachment without a command-and-control (C&C) server to reach out to.\n\n\n-----\n\n##### Business search\n\n\nFigure 7. Spear-phishing email sent by Pawn Storm in October 2022 with a malicious `download`\n\nattachment that installs a simple information stealer without a C&C server\n\n##### Once installed on a victim’s computer, the stealer is entirely on its own. The\n\n file creates an internet shortcut at %APPDATA%\\Microsoft\\Windows\\Start\n\n Menu\\Programs\\Startup\\search.url pointing to itself. This makes the file run\n\n upon Windows startup. During regular intervals, the info stealer looks for\n\n the following files:\n\n .pdf\n\n .docx\n\n .doc\n\n .xlsx\n\n .txt\n\n .zip\n\n .xls\n\n##### It then uploads the files in succession with an HTTP PUT request to a free\n\n file-sharing service, free.keep.sh. \n\n\n-----\n\n##### Business search\n\n\nFigure 8. Example of the exfiltration of a text file `download`\n\n##### For every file sent, keep.sh replies with a URL to access the file. The file path\n\n is written to a log.txt file to prevent it from being re-uploaded.\n\n The program then sends a GET request to https://tinyurl.com to get the\n\n value from XSRF-TOKEN in the cookie set. It then sends a POST request to\n\n https://tinyurl.com/app/api/create to create a shortened URL for every file\n\n uploaded to free.keep.sh. The following JSON is sent:\n\nFigure 9. The sent JSON file `download`\n\n##### The alias field is important in this case. This is what comes after tinyurl.com/\n\n so the attackers can access the stolen files. The 20-second delay ensures\n\n that the aliases per victim are unique.\n\n\n-----\n\n##### 86,400 different shortened URLs can be created. Pawn Storm would have to\n\n brute-force these URLs to get to the actual location where the stolen\n\n information has been uploaded. This seems like a crude way of stealing\n\n information, but when such a sample is found in the wild without context, it\n\n would be difficult to attribute this piece of malware to any known intrusion\n\n set or threat actor. We can, however, attribute this information stealer\n\n (SHA256: 4f3992b9dbd1c2a64588a5bc23f1b37a12a4355688d6e1a06408ea2\n\n 449c59368) to Pawn Storm with high confidence, based on the way it was\n\n delivered to the targets.\n\n Conclusion and outlook\n\n Although Pawn Storm has been active for two decades, it still retains its\n\n aggressiveness and determination to break into the networks and emails of\n\n high-profile targets around the world.\n\n Since at least 2019, it has employed brute-force attacks (first from\n\n dedicated servers and then with additional anonymization layers such as\n\n commercial VPN services), Tor, and infrastructure that is very likely being\n\n shared with more standard cybercriminal use. Recently, Pawn Storm has\n\n been using more advanced and stealthy methods that are both loud and\n\n aggressive, which makes it difficult to determine what is happening in the\n\n victim’s network post-compromise​.\n\n In the appendix, we have an extensive list of indicators that can help\n\n network defenders to check whether their organization has been targeted.\n\n Although Pawn Storm makes use of shared IP addresses, such as\n\n commercial VPN services and compromised EdgeOS routers, the group\n\n tends to use the same VPN exit nodes for days and even weeks. The\n\n\n-----\n\n##### more advanced tactics (and even zero-day vulnerabilities) for the\n\n succeeding stages.\n\n Indicators of Compromise (IOCs)\n\n The indicators of compromise for this blog entry can be found here.\n\nTags\n\n[APT & Targeted Attacks](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/apt-and-targeted-attacks) | [Research](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:article-type/research) | [Exploits & Vulnerabilities](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/exploits-and-vulnerabilities) | [Phishing](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/phishing) |\n\n[Articles, News, Reports](https://www.trendmicro.com/en_us/research.html?category=trend-micro-research:medium/article)\n\nAuthors\n\nFeike Hacquebord\nSr. Threat Researcher\n\nFernando Merces\nSr. Threat Researcher\n\n\n[CONTACT US](mailto:tm_research@trendmicro.com)\n\n\nSUBSCRIBE\n\n\n-----\n\n[ICO Scams Leverage 2024 Olympics to Lure Victims, Use AI for Fake Sites](https://www.trendmicro.com/en_us/research/24/f/ico-scams-leverage-2024-olympics-to-lure-victims-use-ai-for-fake.html)\n\n[Attackers in Profile: menuPass and ALPHV/BlackCat](https://www.trendmicro.com/en_us/research/24/f/menupass-alphv-blackcat-threats.html)\n\n[Omdia Report: Trend Disclosed 60% of Vulnerabilities](https://www.trendmicro.com/en_us/research/24/f/omdia-vulnerabilities-report.html)\n\n[See all articles ](https://www.trendmicro.com/en_us/research.html)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2024/2024.01.31.Pawn_Storm_Uses_Brute_Force_and_Stealth_Against_High-Value_Targets/pawn_storm_uses_bruteorce_and_stealth_against_high-value_target.pdf"
    ],
    "report_names": [
        "pawn_storm_uses_bruteorce_and_stealth_against_high-value_target"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1719540240,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1719495665,
    "ts_modification_date": 1719495665,
    "files": {
        "pdf": "https://archive.orkl.eu/52f8d3331dd82e32b66f8f430f651af346f22fd0.pdf",
        "text": "https://archive.orkl.eu/52f8d3331dd82e32b66f8f430f651af346f22fd0.txt",
        "img": "https://archive.orkl.eu/52f8d3331dd82e32b66f8f430f651af346f22fd0.jpg"
    }
}