{
    "id": "2f79d641-ae2c-485c-99a8-2912ef4e3c2e",
    "created_at": "2023-01-12T15:04:54.742596Z",
    "updated_at": "2025-03-27T02:10:49.431025Z",
    "deleted_at": null,
    "sha1_hash": "ec7120f075cc1d5270b25c7c9432be4a16bca183",
    "title": "2018-09-18 - Magecart Skimming Attack Targets Mobile Users of Hotel Chain Booking Websites",
    "authors": "",
    "file_creation_date": "2022-05-27T22:34:10Z",
    "file_modification_date": "2022-05-27T22:34:10Z",
    "file_size": 130911,
    "plain_text": "# Magecart Targets Hotel Booking Websites on Mobile\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/magecart-skimming-attack-targets-mobile-users-of-hotel-chain-booking-websites/](https://blog.trendmicro.com/trendlabs-security-intelligence/magecart-skimming-attack-targets-mobile-users-of-hotel-chain-booking-websites/)**\n\nSeptember 18, 2019\n\nWe discovered a series of incidents where the credit card skimming attack Magecart was used to hit the booking websites of\nchain-brand hotels — the second time we’ve seen a Magecart threat actor directly hit ecommerce service providers instead of\n[going for individual stores or third-party supply chains. Back in May, we discovered a new Magecart-using group called](https://blog.trendmicro.com/trendlabs-security-intelligence/new-magecart-attack-delivered-through-compromised-advertising-supply-chain/)\n[“Mirrorthief,” which compromised an ecommerce service provider used by American and Canadian universities.](https://blog.trendmicro.com/trendlabs-security-intelligence/mirrorthief-group-uses-magecart-skimming-attack-to-hit-hundreds-of-campus-online-stores-in-us-and-canada/)\n\nIn early September, we found two hotel websites (from different hotel chains) that were being injected with a JavaScript code to\nload a remote script on their payment page since August 9. When we first checked the script’s link, it downloaded a normal\nJavaScript code. However, we found that the same link could also download a different script when we requested it from mobile\ndevices like Android or iOS phones. The downloaded script for mobile devices is a credit card skimmer which can steal the\ninformation entered on the hotel booking page and send it to a remote server.\n\nWe found both of the affected hotel websites were developed by Roomleader, a company from Spain that helps hotels build their\nonline booking websites. The malicious code wasn’t injected directly into the website but rather into the script of Roomleader’s\nmodule called “viewedHotels” that was provided to its clients and subsequently used for two websites of two different hotel chains.\nDespite the seemingly small number of affected sites, we still consider the attack significant given that one of the brands has 107\nhotels in 14 countries while the other has 73 hotels in 14 countries. Note that we have reached out to Roomleader regarding this\nissue.\n\n**The script injected into the hotel booking website**\n\n[Figure 1. Infection chain of the Magecart skimming attack on the online hotel booking websites](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-1.jpg)\n\nFigure 1. Infection chain of the Magecart skimming attack on the online hotel booking websites\n\nAs mentioned, the injection was done on a JavaScript library of Roomleader’s “viewedHotels” module located at hxxps://[hotel\n_website]/modulos/viewedHotels/templates/public/js/history_setter[.]js. This library is used for saving the viewed hotel information_\nin the visitor’s browser cookies. The attacker injected the malicious code in the middle of the original script.\n\nThe injected code first checks if an HTML element containing the ID “customerBookingForm” is present on the webpage to make\nsure it is running on the hotel’s booking page. If the injected code is found to not be running on the page, it will go to sleep for one\nsecond and check repeatedly thereafter. However, if the code detects the booking page, it will check if the browser debugger is\nclosed and then load another JavaScript from the URL hxxps://googletrackmanager[.]com/gtm[.]js — which is where the card\nskimmer code is actually located. It’s worth noting that the style of the URL is meant to emulate the legitimate URL used by\n[Google Tag Manager.](https://tagmanager.google.com/)\n\n[Figure 2. The injected script (highlighted) in the JavaScript library used by hotel websites](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-2.png)\n\nFigure 2. The injected script (highlighted) in the JavaScript library used by hotel websites\n\n\n-----\n\n**Analysis of the credit card skimmer**\n\nWhen we first connected to the skimmer URL, it returned normal JavaScript code copied from the GitHub project detect-mobilebrowser. However, we suspected it was not the real payload because the code isn’t actually used by the affected websites.\n\nUpon further testing of the URL, we found that it downloaded a different script when we made a request using an HTTP UserAgent from a mobile device. This script turned out to be a credit card skimmer. Although we found the skimmer to work on both\nPC and mobile browsers, it seems the attacker only targeted mobile users. This is most likely because the threat actor behind it\nwants to avoid detection from PC-based security software. The skimmer is not a new one — we’ve seen instances where it was\nused by other groups. Most likely, it is a general skimmer that is shared via underground forums.\n\n[Figure 3. The different scripts downloaded from the skimmer URL for desktop and mobile](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-3.png)\n\nFigure 3. The different scripts downloaded from the skimmer URL for desktop and mobile\n\nThe credit card skimmer is designed to steal data from payment forms. The skimmer hooks its function to the JavaScript events\n“submit” and “click,” which are usually triggered when people submit a payment or a booking. When the hooked event is triggered,\nthe skimmer will check if the browser debugger is closed. Then it copies the name and value from any “input” or “select” HTML\nelement on the booking page. In this case, the gathered information includes names, email addresses, telephone numbers, hotel\nroom preferences, and credit card details.\n\nThe copied information is encrypted using RC4 with a hardcoded key: “F8C5Pe4Q”. Next, the skimmer will generate a random\nstring to encode the encrypted data again using XOR. The data will then be sent via HTTP POST to the remote URL\n“https://googletrackmanager[.]com/gtm.php?id=” that uses generated random string appended at the end. Upon receipt of the\ninformation, the attacker can then decrypt the data and collect the credit card information.\n\n[Figure 4. Credit card skimmer code to steal information from hotel booking page](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-4.png)\n\nFigure 4. Credit card skimmer code to steal information from hotel booking page\n\n**Magecart replaces the original booking page with a fake one**\n\nAlthough the skimmer itself is not unique, we found that it removes the original credit card form on the booking page and injects\nanother one prepared by the threat actor. We theorize two possible reasons for this. The first is that some hotels don’t ask\ncustomers to make online payments but instead ask them to pay at the hotel upon arrival. In cases like this, the booking form will\nask for credit card information but without the CVC number. To ensure that all credit card information are captured, the attacker\nreplaces the original form with one that contains the CVC number column.\n\nThe second possible reason is that, sometimes, the booking page will host the credit card form in a different domain using an\n[HTML iframe element to make it more secure. In this scenario, a regular JavaScript skimmer will not be able to copy the data](https://developer.mozilla.org/en-US/docs/Web/HTML/Element/iframe)\ninside the secure iframe. Therefore, the attacker removes the iframe of the secured credit card form and injects his own form so\nthe skimmer can copy the information.\n\n[Figure 5. The original credit card form (above) from the hotel website and the injected form (below) from the skimmer](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-5.png)\n\n[Figure 5. The original credit card form (above) from the hotel website and the injected form (below) from the skimmer](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-6.png)\n\nFigure 5. The original credit card form (above) from the hotel website and the injected form (below) from the skimmer\n\n[Figure 6. The skimmer script used to remove the original form from the booking page and replace it with the fake one](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-7.png)\n\nFigure 6. The skimmer script used to remove the original form from the booking page and replace it with the fake one\n\nTo make it seem more legitimate, the attacker also prepared credit card forms in eight languages: English, Spanish, Italian,\nFrench, German, Portuguese, Russian, and Dutch. These languages match the languages supported by the targeted hotel\nwebsites. The skimmer will check which language the customer is using for the website and inject the corresponding fake credit\ncard form into the page.\n\n[Figure 7. The eight languages of the fake credit card form inside the skimmer](https://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2019/09/magecart-mobile-hotels-8.png)\n\nFigure 7. The eight languages of the fake credit card form inside the skimmer\n\n\n-----\n\nWe were unable to find any strong connections to previous Magecart groups based on the network infrastructure or the malicious\ncode used in this attack. However, it’s possible that the threat actor behind this campaign was also involved in previous\ncampaigns.\n\n**Conclusion**\n\n[Recent incidents involving credit card skimmers like Magecart emphasize the need for businesses to secure their websites from](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/security-technology/security-by-design-devops-in-the-era-of-the-gdpr?_ga=2.167625470.1324830332.1567993238-94385647.1557215823)\npotential compromise by implementing security best practices, which include regularly updating software to the latest versions\nand segregating networks to ensure that as little customer data as possible is exposed.\n\nFurthermore, users can consider using payment systems such as Apple Pay and Google Pay, which offer additional\nauthentication methods — minimizing the chance that attackers will be able to use the credit card even if they manage to collect\nthe card’s details. The following Trend Micro solutions protect users and businesses by blocking the scripts and preventing access\nto the malicious domains:\n\n[Trend Micro™ Security](https://blog.trendmicro.com/en_us/forHome/products.html)\n[Smart Protection Suites and](https://blog.trendmicro.com/en_us/business/products/user-protection.html) [Worry-Free™ Business Security](https://blog.trendmicro.com/en_us/small-business/worry-free-services-suites.html)\n[Trend Micro Network Defense](https://blog.trendmicro.com/en_us/business/products/network.html)\n[Hybrid Cloud Security](https://blog.trendmicro.com/en_us/business/products/hybrid-cloud.html)\n\n**Indicators of Compromise (IoCs)**\n\n\n**SHA-256 Hash/ URL** **File**\n**Name**\n\n\n**Details** **Detection name**\n\n\nac58602d149305bd2331d555c15e6292bd5d09c34ade9e5eebb81e9ef1e7b312 _gtm.js_ Credit\ncard\nskimmer\n\ngoogletrackmanager[.]com Magecart\nDomain\n\n\nTrojanSpy.JS.MAGECART.B\n\n\n_[With special thanks to our colleagues at abuse.ch and](https://abuse.ch/)_ _[The Shadowserver Foundation for helping to take down the Magecart](http://shadowserver.org/)_\n_domain._\n\nCyber Threats\n\nWe discovered a series of incidents where the credit card skimming attack was used to hit the booking websites of chain-brand\nhotels — the second time we’ve seen a Magecart threat actor directly hit ecommerce service providers.\n\nBy: Joseph C Chen September 18, 2019 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-09-18 - Magecart Skimming Attack Targets Mobile Users of Hotel Chain Booking Websites.pdf"
    ],
    "report_names": [
        "2018-09-18 - Magecart Skimming Attack Targets Mobile Users of Hotel Chain Booking Websites.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535894,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653690850,
    "ts_modification_date": 1653690850,
    "files": {
        "pdf": "https://archive.orkl.eu/ec7120f075cc1d5270b25c7c9432be4a16bca183.pdf",
        "text": "https://archive.orkl.eu/ec7120f075cc1d5270b25c7c9432be4a16bca183.txt",
        "img": "https://archive.orkl.eu/ec7120f075cc1d5270b25c7c9432be4a16bca183.jpg"
    }
}