{
    "id": "2fd0da40-37e6-4e50-9431-afa52fd82406",
    "created_at": "2023-01-12T15:04:40.545418Z",
    "updated_at": "2025-03-27T02:17:14.531743Z",
    "deleted_at": null,
    "sha1_hash": "6f1d57f566db3a23b40354d030a79cc818a58c01",
    "title": "2022-05-19 - .NET Stubs- Sowing the Seeds of Discord (PureCrypter)",
    "authors": "",
    "file_creation_date": "2022-06-13T04:02:31Z",
    "file_modification_date": "2022-06-13T04:02:31Z",
    "file_size": 2856511,
    "plain_text": "# .NET Stubs: Sowing the Seeds of Discord\n\n**[blogs.blackberry.com/en/2022/05/dot-net-stubs-sowing-the-seeds-of-discord](https://blogs.blackberry.com/en/2022/05/dot-net-stubs-sowing-the-seeds-of-discord)**\n\nThe BlackBerry Research & Intelligence Team\n\n**_Update 05.27.22: An unknown APT group is targeting Russian government entities with at_**\n_least four separate spear-phishing campaigns since the beginning of the Ukraine conflict._\n_Source:_ _[Security Affairs.](https://securityaffairs.co/wordpress/131658/apt/unknown-apt-group-target-russia.html)_\n\nEarlier this year, as the rest of the world was just beginning to turn a concerned eye to\nunsettling military actions in Ukraine, the security industry’s attention was trained on\nmalicious cyber activity in the country. When the [WhisperGate wiper was discovered – a](https://blogs.blackberry.com/en/2022/02/threat-spotlight-whispergate-wiper-wreaks-havoc-in-ukraine)\nmulti-staged malicious wiper disguised as ransomware – researchers dug in to see what we\ncould learn about the techniques used by its authors, and what it could teach us about the\nthreat landscape in general.\n\nIn this post, we’ll retrace our steps down a surprising rabbit hole that was revealed while\nexamining this momentous malware. We’ll discuss what we found, and what it can tell us\nabout the methods threat actors are finding useful to accomplish their nefarious actions.\n\n[Analysis of the WhisperGate malware wiper targeting Ukraine in early 2022 first shone a](https://www.cisa.gov/uscert/ncas/alerts/aa22-057a)\n[light on using a Microsoft Intermediate Language (MSIL) stub as a delivery mechanism for](https://www.visualbasicplanet.info/worker-threads/microsoft-intermediate-language-and-the-jitters.html)\nthe malware, which was abusing the Discord content delivery network (CDN). When we\n\n\n-----\n\ninvestigated these stubs further and looked for others like them, we found them to be used\nin the delivery of a far larger array of commodity .NET-based malware.\n\n### Whispers in the Wind\n\n[We’ve covered details regarding WhisperGate in a previous blog, which provides a more](https://blogs.blackberry.com/en/2022/01/threat-thursday-whispergate-wiper)\nextensive breakdown into the third and fourth stages of the wiper. What stood out to us, in\nthe course of conducting that research into the final stages of the malware, was the MSIL\n[stub used in the delivery of the third stage of the malware that was first noted by ESET](https://mattwarren.org/2019/09/26/Stubs-in-the-.NET-Runtime/)\nResearch.\n\nTo put it simply, these stubs are components of small Windows® executable files that act as\ndownloaders for a subsequent main payload. The .NET framework includes individual\ncompilers for various programming languages, such as VB.NET, and C#. An MSIL stub is\ncreated after the compilation of source code by these different .NET compilers, which can\nthen be used across any environment.\n\nThis main payload that this stub delivers is typically commodity .NET malware, such as\n[Agent Tesla, and](https://blogs.blackberry.com/en/2021/06/threat-thursday-agent-tesla-infostealer-malware) [QuasarRAT among others. While WhisperGate appeared to use the](https://blogs.blackberry.com/en/2019/06/threat-spotlight-menupass-quasarrat-backdoor)\nservice that created this stub on only one occasion, we wanted to dive a little further into it\nand see why this method in particular is being used to deliver so many common .NETbased malware families.\n\n_Figure 1 – Code to resolve DownloadData function and download the payload_\n\n### Dissecting the Stub\n\n\n-----\n\nThe WhisperGate stub itself is quite rudimentary; aside from a download function, it also\nsports junk strings, junk code, and other relatively simple attempts at obfuscation. The main\nwork of a stub is done by retrieving the function DownloadData, or in some cases\nGetByteArrayAsync, using the .NET inbuilt function GetMethod to resolve the specified\nfunction call dynamically.\n\nWhile this may not seem like a big deal, the name of the function to be resolved is often\ninterspersed with a specific character, or set of characters, to obfuscate the function name.\nFor example, a function like DownloadData would be obfuscated with character\nreplacement such as DxownxloxadDxatxxax. Upon execution, this would be replaced inline\nto revert the function to its original form to perform its intended task.\n\nOnce the method has been resolved, it then downloads the file at the specified plaintext and\nhardcoded command-and-control (C2) URL. We observed evidence of the Discord CDN\nbeing abused heavily within our data set of files using this stub template, but occasionally\nsaw other IPs and domains used as well.\n\nAnother interesting feature we noted is that the stub used by WhisperGate has been\nobfuscated with a tool called NetReactor, though it appears WhisperGate only used a small\nsubset of the features that the NetReactor tool boasts.\n\nWe decided to test a version of NetReactor to see if the string obfuscation we observed with\nthe resolved functions (as in the example above) was a feature of the packer. It was here\nthat the rabbit hole got deeper. We found that string obfuscation was not a feature, which\nmeant that a separately maintained tool or service was used to create these stubs.\n\n### Digging Into Discord CDN Abuse\n\nDiscord is a large communications platform that is widely used in gaming circles. It is\ncomprised of topic-based channels where people can communicate over text, voice-chat,\nand video calls. They may even share files. These files are kept on Discord's CDN servers.\n\nThreat actors can easily abuse the Discord CDN service to host their malware, which gives\nthem the added benefit of blending in with typical, benign traffic on a network. This abuse\nhas been documented as far back as October 2019, and it has been previously described\n[by many other researchers, notably Sophos. With over 140 million monthly users at the time](https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/)\nof writing this blog, and an easy-to-use file hosting and sharing mechanism, Discord has\nbeen an enticing prospect for abuse by threat actors.\n\nAn [analysis by RiskIQ noted that a large portion of the stub payloads have links that were](https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/)\nformatted as follows:\n\nhxxps://cdn.discordapp[.]com/attachments/[Channel_ID]/[Attachment_ID]/[file-name]\n\n\n-----\n\nIn fact, querying VirusTotal for any files that contain the domain **cdn.discordapp.com and**\nwhich have over 50+ positive hits for malware, returns a staggering 36,600 samples.\n\n_Figure 2 – VT graph showing files that contain cdn.discordapp and 50+ positives_\n\n### PureCrypter\n\nWhile the stubs can differ in their overall make-up, they all have defining features within the\ndownload function that bind them together in a way that identifies them as (most likely)\nhaving been made by the same service.\n\nFor example, the use of the DownloadData and GetByteArrayAsync functions, the manner\nin which they are resolved, and the particular style that’s used to obfuscate each function\nname, all point to their being created by the same service. This similarity also includes how\nfrequently Discord is used as the delivery platform. Yet another lead presented itself when\nwe saw the term “PureCrypter” referenced within one of the binaries gathered from our\nhunting efforts.\n\n\n-----\n\nPureCrypter, as the name suggests, is a crypting service that can be found on the dark\nweb, as well as in known hacking forums. In this context, crypting is the act of obfuscating\nor encrypting a binary through several means, to prevent detection by scanning solutions.\n\nA term we often see in relation to these crypting services is “FUD,” which is short for “Fully\nUn-Detected.” PureCrypter advertises that they do a FUD check every four hours –\nmeaning that they check their obfuscation against existing security solutions, to see\nwhether they’re still “fully undetected” – in order to try keep ahead of defenders.\n\nA hacking forum user that goes by alias of PureCoder has been advertising and actively\npromoting the PureCrypter solution since at least September of 2021.\n\n_Figure 3 – PureCrypter post by PureCoder_\n\nPureCrypter can be purchased on PureCoder’s website along with other illicit cyberofferings such as:\n\n**PureMiner – A silent miner that can be used either to spread itself, or other bots, to**\nautomatically mine Ethereum or Bitcoin into the malware operator’s wallet\n**PureClipper – A silent and hidden clipper that detects and replaces a victim’s crypto**\naddresses with those belonging to the malware operator\n**Discord Worm Mass DM – Sends mass direct messages (DMs), and creates a**\npayload.exe that is used for stealing tokens\n**AsyncRAT fixed plugin – Fixes errors in AsyncRAT plugins**\n\n**RAT Base Source code C# – C# source code for those that are working with RATs**\n(remote access Trojans). It offers FUD and claims to have a clean detection rate at\n0/26 antivirus (AV) products identifying it as malware. It also boasts a small binary size\nat 176KB, and it claims to be better than any other RAT available on GitHub, due to its\nclean detection rate.\n\n\n-----\n\n_Figure 4 – PureCoder’s website_\n\nThe PureCrypter solution offers three different purchase options. The tool features offered\nare the same for all three; the only difference is in the length of time the tool is available for\nthe purchaser to use it, as illustrated in Table 1. The threat actors accept payment in\nBitcoin, Litecoin, Bitcoin Cash, or Monero.\n\n**$59.00 | 30 days** **$109.00 | 90 days** **$245.00 | Lifetime**\n\nStub daily updated\n\n.NET and Native support\n\nInject 32bit and 64bit\n\nCommand line\n\nTime-stamp\n\nExclusion region\n\nHardened name\n\n\n-----\n\nCrypter killer\n\nMemory bombing\n\nAnti-file delete\n\nAnti-sample submission\n\nDiscord and Telegram execution notification\n\nIcon, assembly, and certificate cloner\n\nAdvanced injection\n\nFake message box\n\nThree startup techniques\n\nScanner\n\nBinder\n\nDelay\n\nFree Macro excel builder and downloader\n\n_Table 1 – PureCrypter features_\n\nPureCrypter boasts several additional features such as binary obfuscation, Microsoft®\nExcel® macro builders, and downloader stub creation (sound familiar?). While we won’t\ncover everything that the program is capable of, some of the options that can be set at\nruntime can be seen in Figure 5.\n\n\n-----\n\n_Figure 5 – PureCrypter user interface_\n\nSo far, we have a dataset of related samples, and we have a dark web crypter. The\nquestion is, how do they relate? We found the answer by identifying a command line\nargument, and seeing metadata of the samples at scale.\n\n\n-----\n\n_Figure 6 – PureCrypter with the ”autocrypt“ parameter_\n\nPureCrypter has additional functionality that can be seen when you run the tool with the\n“autocrypt” parameter. Figure 6 shows a “Notification” pane to which execution and infection\nnotifications can be sent, either by a Discord webhook or Telegram bot notification.\n\nWhen we take a topological view of the features we have discussed so far, and apply them\nto our dataset of similar stub files, we can see several places where they overlap:\n\nIn addition to the payload download, multiple stubs contacted Telegram Bot API URLs.\nIn addition to the payload download, multiple stubs contacted Discord webhooks.\n\nMultiple stubs had Excel macro execution as a delivery mechanism.\n\nWe can say with a high degree of confidence that the stubs in our sample set were created\nvia PureCrypter.\n\nNow that we’ve ascertained the origin of the stubs, let’s look at the variety of malware that\nuses PureCrypter’s services.\n\nFigure 7 provides a high-level overview of the varying execution chains seen within the\nstubs we found in our dataset. Each one starts with a likely PureCrypter-generated\ndownload stub, which is then typically designed to retrieve a .NET malware payload from\none of three locations: a compromised website, a malicious Discord CDN link, or a malware\nhosting server that was specifically set up for this purpose.\n\n\n-----\n\n_Figure 7 – Malware delivery execution chain_\n\n### The Who’s Who of .NET Malware\n\nBeing a C#/.NET/MSIL stub, the malware that is downloaded as the latter stage of a\nmalware likely generated with PureCrypter is also C#/.NET. The following graphic displays a\nbreakdown of the various malware families that were seen to be delivered as the final stage\npayload during our investigation.\n\n[As shown in Figure 8, Agent Tesla made up the largest portion of our sample set, at](https://blogs.blackberry.com/en/2020/04/threat-spotlight-secret-agent-tesla)\n34.44%. The second most prevalent family was Snake Keylogger, at 15.89%, closely\nfollowed by Ave Maria, at 11.92%. While the samples we have aren’t categorical, it’s\ncertainly interesting to note which families have appeared most in our hunting.\n\n\n-----\n\n_Figure 8 – Samples of malware families likely using PureCrypter, breakdown by percent_\n\n### Timeline of Use\n\nThe diagram in Figure 9 displays a loose timeline of when each malware family appeared in\nthe wild in 2022.\n\n_Figure 9 – Timeline of each malware family first seen in the wild in 2022_\n\n### Conclusions\n\n\n-----\n\nJanuary 2022 was significant on the threat landscape due to the appearance of the\n[malware wiper dubbed WhisperGate. This made headlines because of its targeting](https://blogs.blackberry.com/en/2022/02/threat-spotlight-whispergate-wiper-wreaks-havoc-in-ukraine)\nUkraine’s private sector and government agencies.\n\nAs we analyzed WhisperGate samples, we were led to the unique MSIL stub that was used\nas the delivery mechanism to download the next stage payload. Using open-source\nintelligence techniques combined with some threat hunting, we were able to obtain\nadditional files and attribute them to specific campaigns by various other threat actors.\n\nDuring this investigation we kept wondering how these downloader files were created.\nSurely, there was some sort of \"as-a-Service\" tool being used, perhaps offered on the dark\nweb. We were able to get more specific in our findings when we identified references to the\nterm \"PureCrypter\" in our dataset.\n\nUpon further investigation of PureCrypter, we found that it offered a variety of features that\naligned with what we have seen thus far. If threat actors are using this crypter to achieve\ntheir nefarious goals, it means that this tool is doing exactly what they expected. By shining\na light on this tool and associated campaigns, as an industry together, we have uncovered\nwhat they tried to hide.\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats,\nproviding intelligence analysis for the benefit of defenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-19 - .NET Stubs- Sowing the Seeds of Discord (PureCrypter).pdf"
    ],
    "report_names": [
        "2022-05-19 - .NET Stubs- Sowing the Seeds of Discord (PureCrypter).pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535880,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1655092951,
    "ts_modification_date": 1655092951,
    "files": {
        "pdf": "https://archive.orkl.eu/6f1d57f566db3a23b40354d030a79cc818a58c01.pdf",
        "text": "https://archive.orkl.eu/6f1d57f566db3a23b40354d030a79cc818a58c01.txt",
        "img": "https://archive.orkl.eu/6f1d57f566db3a23b40354d030a79cc818a58c01.jpg"
    }
}