{
    "id": "3016fe28-cb07-4386-b311-676d275eed50",
    "created_at": "2023-01-12T15:07:48.190232Z",
    "updated_at": "2025-03-27T02:08:41.520179Z",
    "deleted_at": null,
    "sha1_hash": "986b17e5a59cf45fe48084dd16fa5e93e7de50bb",
    "title": "2022-03-29 - Threat Alert- First Python Ransomware Attack Targeting Jupyter Notebooks",
    "authors": "",
    "file_creation_date": "2022-05-28T16:12:49Z",
    "file_modification_date": "2022-05-28T16:12:49Z",
    "file_size": 818321,
    "plain_text": "# Threat Alert: First Python Ransomware Attack Targeting Jupyter Notebooks\n\n**blog.aquasec.com/python-ransomware-jupyter-notebook**\n\nAssaf Morag\n\nAssaf Morag\n\nMarch 29, 2022\n\n\n-----\n\nTeam Nautilus has uncovered a Python-based ransomware attack that, for the first time, was\ntargeting Jupyter Notebook, a popular tool used by data practitioners. The attackers gained\ninitial access via misconfigured environments, then ran a ransomware script that encrypts\nevery file on a given path on the server and deletes itself after execution to conceal the\nattack. Since Jupyter notebooks are used to analyze data and build data models, this attack\ncan lead to significant damage to organizations if these environments aren’t properly backed\nup.\n\n## What is Jupyter Notebook?\n\nThe Jupyter Notebook is an open source web application used by data professionals to work\nwith data, write and execute code, and visualize the results. Normally, access to the online\napplication should be restricted, either with a token or password or by limiting ingress traffic.\nHowever, sometimes these notebooks are left exposed to the internet with no authentication\nmeans, allowing anyone to easily access the notebook via a web browser. On top of this, a\nbuilt-in feature of Jupyter notebooks enables the user to open a shell terminal with further\naccess to the server.\n\n## Breaking down the Jupyter Notebook ransomware attack\n\nWe set up a honeypot with a Jupyter notebook application exposed to the internet. Below is\nthe kill chain of the attacks we observed:\n\n\n-----\n\nTo conduct the attack, the adversary accessed the server via a misconfigured application,\ndownloaded the libraries and tools that support the attack (for example, encryptors), and\nthen manually created a ransomware script by pasting the Python code and executing the\nscript.\n\nBelow, you can see the actual code that was used during the attack on our honeypot:\n\n\n-----\n\nOur honeypot was designed to simulate a real-life enterprise environment, so it included\nactual Jupyter notebooks and raw data files that the attacker could encrypt. The attack\nstopped before it could cause more damage. We decided to simulate and investigate the\nattack in our lab. In the screenshot below, you can see the execution of the encryptor. Note\nthat the Python file (cpt.py) was designed to delete itself after execution to conceal the\nattack.\n\n\n-----\n\nNo ransom note was presented in this attack. We assume that either the adversary was\nexperimenting with the attack on our machine, or the honeypot timed out before the attack\nwas completed.\n\nOverall, this attack is simple and straightforward, as opposed to more sophisticated\nransomware that uses advanced techniques, such as Locky, Ryuk, WannaCry, or\nransomware-as-a-service such as GandCrab.\n\nWe also suspect that we might be familiar with the attacker due to the unique trademark that\nwas used. In the beginning of the attack, the adversary checked if the server was vulnerable\nby downloading to /tmp directory a text file named f1gl6i6z. This file contains the word ‘bl*t’,\nwhich might indicate that the threat actor has Russian origin. We’ve seen this file used\nbefore in many cryptomining attacks that target Jupyter notebooks and JupyterLab\nenvironments.\n\nA quick Shodan query shows that there are about 200 internet-facing Jupyter notebooks with\nno authentication. Naturally, some of them can be honeypots, but not all. We think that this\nattack can indicate a campaign that executes ransomware on these servers.\n\n## Using Tracee to detect the attack\n\n[Our honeypots are continually monitored by Tracee of Aqua Security, an open source](https://github.com/aquasecurity/tracee)\nruntime security and forensics tool for Linux, built to address common Linux security issues.\nOn GitHub, you can find Tracee-eBPF, a Linux tracing and forensics tool based on eBPF\ntechnology, and Tracee-rules, a runtime security detection engine that allows to detect\nmalicious events.\n\n\n-----\n\nIn this attack, Tracee detected two drift events: dropping and execution on the fly of a binary\nand a Python file. Although a “living off the land” approach — using the existing tools in a\ntarget environment — is common, attackers are often looking to bring in and apply their own\ntools. Tracee was designed to detect these kinds of events. In this case, the attacker\ndownloaded a nano binary to create the file cpt.py and executed this binary along with the\ncpt.py script.\n\n\n-----\n\nThese specific detections aren’t available in the open source Tracee-rules, but are included\nin [Aqua's Cloud Native Detection and Response (CNDR) solution that allows to detect and](https://www.aquasec.com/use-cases/cndr-cloud-native-detection-and-reponse/?_ga=2.47686631.1940777612.1648553588-1564895035.1648553588)\nprevent attacks in runtime. Read more about CNDR’s detection capabilities and how CNDR\nstopped a DeamBus botnet attack.\n\n### Mapping the attack to the MITRE ATT&CK framework\n\nHere we map each component of the attack to the corresponding techniques of the MITRE\nATT&CK framework:\n\n### What actions you should take\n\nThere are a few recommendations you can follow to mitigate these risks and protect your\ndata applications.\n\n**Jupyter Notebook recommendations**\n\n\n-----\n\nUse token or another authentication method to control access to your data\ndevelopment application.\nEnsure that you’re using SSL to protect data in transit.\nLimit inbound traffic to the application either by blocking the internet access completely\nor, if the environment requires internet access, by using network rules or VPN to control\ninbound traffic. It’s also recommended to limit outbound access. For instance, in the\nAqua platform, you can set network rules to limit access to your resources.\nRun your applications with a non-privileged user or one with limited privileges.\nMake sure you know all the Jupyter notebook users. You can query the users in an\nSqlite3 database, which should be found in this path:\n‘./root/.local/share/jupyter/nbsignatures.db’. If SSH access to the server is enabled, you\ncan also inspect the SSH authorized keys files to verify that you're familiar with all the\nkeys and that there are no unknown users or keys.\n\n**General security recommendations**\n\nBack up critical business systems regularly and consistently to avoid data loss.\nApply the least-privilege access principle throughout your environment.\nFollow basic cybersecurity hygiene, which is fundamental to avoiding security gaps that\nemployees might accidentally leave — for example, missing patches and default\npasswords.\nMake sure your IT and security staff are staying vigilant and keeping watch, and that\nthey're prepared to work diligently to protect customers, processes, and systems.\n\n**Recommendations for cloud native environments**\n\nIdentify exposures, vulnerabilities, and misconfigurations that can provide entry points\nfor attackers to gain access and compromise networks.\nScan all your running workloads for critical vulnerabilities with known exploits to\nconduct focused patching and mitigation. You can use trusted open source scanners\nsuch as [Trivy.](http://trivy.dev/?_ga=2.47686631.1940777612.1648553588-1564895035.1648553588)\nScan for vulnerabilities in CI/CD pipelines to ensure that no new vulnerabilities are\nintroduced.\nScan your workloads for suspicious and malicious behavior in runtime with open\n[source tools such as Tracee.](https://www.aquasec.com/products/tracee/?_ga=2.47686631.1940777612.1648553588-1564895035.1648553588)\n\n\n-----\n\n**Assaf Morag**\n\nAssaf is a Lead Data Analyst at Aqua. As part of Team Nautilus, Aqua's research team, he\nfocuses on supporting the data needs of the team, obtaining threat intelligence and helping\nAqua and the industry stay on the forefront of new threats and methodologies for protection.\nHis work has been published in leading info security publications and journals across the\nglobe, and most recently he contributed to the new MITRE ATT&CK Container Framework.\n\n[Security Threats](https://blog.aquasec.com/topic/security-threats)\n\n[Tweet](https://twitter.com/share)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-29 - Threat Alert- First Python Ransomware Attack Targeting Jupyter Notebooks.pdf"
    ],
    "report_names": [
        "2022-03-29 - Threat Alert- First Python Ransomware Attack Targeting Jupyter Notebooks.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536068,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653754369,
    "ts_modification_date": 1653754369,
    "files": {
        "pdf": "https://archive.orkl.eu/986b17e5a59cf45fe48084dd16fa5e93e7de50bb.pdf",
        "text": "https://archive.orkl.eu/986b17e5a59cf45fe48084dd16fa5e93e7de50bb.txt",
        "img": "https://archive.orkl.eu/986b17e5a59cf45fe48084dd16fa5e93e7de50bb.jpg"
    }
}