{
    "id": "30523646-f8bd-411e-afaf-9806d59640a8",
    "created_at": "2023-01-12T15:00:09.435021Z",
    "updated_at": "2025-03-27T02:09:29.15571Z",
    "deleted_at": null,
    "sha1_hash": "b106d8e2d033c6b2e0727b78387ff55f86f6eff0",
    "title": "2022-04-07 - Threat Thursday- AvosLocker Prompts Advisory from FBI and FinCEN",
    "authors": "",
    "file_creation_date": "2022-05-28T23:24:31Z",
    "file_modification_date": "2022-05-28T23:24:31Z",
    "file_size": 2100600,
    "plain_text": "# Threat Thursday: AvosLocker Prompts Advisory from FBI and FinCEN\n\n**[blogs.blackberry.com/en/2022/04/threat-thursday-avoslocker-prompts-advisory-from-fbi-and-fincen](https://blogs.blackberry.com/en/2022/04/threat-thursday-avoslocker-prompts-advisory-from-fbi-and-fincen)**\n\nThe BlackBerry Research & Intelligence Team\n\nAvosLocker and the affiliate group behind it appear to be ramping up their operations\ntargeting critical infrastructure in the U.S., sparking a recent advisory from the FBI and\nFinCEN. The bulletin includes the malware’s Indicators of Compromise (IoCs) and a\nwarning that the criminal group seems to be focusing on financial services, critical\nmanufacturing, government facilities and other critical industries.\n\nFirst seen late 2021, this aggressive ransomware is designed to quickly encrypt valuable\ndata on compromised machines. Like most modern ransomware families such as\n[LokiLocker, AvosLocker is sold and distributed as Ransomware-as-a-Service (RaaS), which](https://blogs.blackberry.com/en/2022/03/lokilocker-ransomware#hero)\nmeans that the attack vectors and targets of the malware are open to the needs of the\nmalware operator. This threat is not just Windows® -based. In early 2022, a Linux® -based\nvariant of the malware was found that targets VMware ESXi Virtual Machine (VM)\nenvironments.\n\n\n-----\n\nAvosLocker has adopted a common feature of modern ransomware in its choice of double\nextortion. This ploy involves attackers compromising the victim’s environment prior to the\nexecution of the ransom attack and exfiltrating valuable data. Like the previously discussed\n[malware family Karma, data pilfered by AvosLocker is often hosted on an Onion page found](https://blogs.blackberry.com/en/2021/11/threat-thursday-karma-ransomware)\nvia the Tor browser. This tactic is meant to put additional pressure on affected organizations\nto pay the ransom demand, as attackers will publish sensitive data online if victims don’t\npay in time.\n\n### Operating System\n\n Risk & Impact\n\n Technical Analysis\n\n**Infection Vector**\n\nSince AvosLocker ransomware is sold as RaaS, attackers can use different mechanisms,\nartifacts, and tooling on victims’ machines. Based on our initial findings, attacks appear to\nbe premeditated, and threat groups perform reconnaissance prior to the deployment of the\n[ransomware. According to the FBI Traffic Light Protocol (TLP) report, tools like Cobalt](https://www.cisa.gov/tlp)\nStrike, Advanced IP Scanner, and AnyDesk are common in AvosLocker attacks.\n\nIt is likely that the threat actor maintains a foothold and has already achieved persistence\non a victim organization’s network to exfiltrate data. The malware operators will execute the\nransomware once initial steps of their attacks are conducted, then clear their tracks after\ntheir objective is achieved.\n\n**File Analysis**\n\nAvosLocker ransomware can affect systems based on Windows (written in C++) and Linux\n(compiled in GCC 4.4.7), with specific versions of the malware developed to target each\noperating system, as seen in Figure 1.\n\n\n-----\n\n_Figure 1 – Side-by-side comparison of Linux (left) and Windows (right) versions of_\n_AvosLocker_\n\nNeither the Windows nor the Linux version of the malware attempts to hide the fact that it is\nmalicious. They are not signed with falsified or stolen digital certificate data, and they do not\ntry to fool a victim into thinking the file is safe, to get them to inadvertently execute the\nmalware.\n\nThis lack of deception is likely because the malware is being executed by attackers that are\nalready on the compromised victim’s network, or through remote code-execution via\npersistence mechanisms already deployed on the compromised network.\n\nThe malware has various flags that will determine its execution flow, including enabling\nfurther features of the malware that can be customized by the malware operator. Depending\non the aim of the threat actor executing the ransomware, various flags can be set, enabling\nfurther features of the malware. These can be seen in the table and Figure 2 below.\n\n### Windows-Based Parameters\n\n\n-----\n\n_Figure 2 – AvosLocker (Windows) parameters_\n\nWhen the Windows version of the malware is executed using its default settings, a dialog\nbox will be generated that indicates this build of the malware (as of early 2022) is called\n“Sonic,” as shown in Figure 3.\n\nBy default, the malware will execute using 200 threads concurrently to achieve its\nencryption, which makes it faster than other ransomware families we have analyzed.\n\n_Figure 3 – Default AvosLocker parameters_\n\n### Preventing Unintentional Corruption\n\nThis malware has a variety of methods in place to prevent itself from damaging a victim’s\nfiles or machine beyond repair. Some of these behaviors are quite common, though one in\nparticular is unexpected.\n\nRansomware commonly avoids encrypting certain directories and files to prevent the entire\nsystem from becoming unrecoverable. Causing this kind of damage would defeat the\nincentive for victims to pay the ransom, so the ransomware will only be destructive to\nspecific file-extensions, omitting key files and directories.\n\n\n-----\n\nThe unique twist in this tactic is that there is a console dialog box created by the running\ninstance of AvosLocker that notifies which files it will skip or avoid encrypting, as shown in\nFigure 4. This only appears to be enabled or disabled by using the flag/variable “-s” or “-unsafe.”\n\n_Figure 4 – Console dialog box of AvosLocker_\n\nThe malware will also create a mutex named “Cheic0WaZie6zeiy.” It uses this marker to\ncheck if it’s already running, to prevent the malware from reinfecting a machine.\n\n### Encryption and Ransom\n\nThe malware will quickly scan for attached drives, looking for files to encrypt. Once\nscanning is complete, the threat will rapidly iterate through the device, appending filenames\non Windows machines with either “.avos” or “.avos2” (for the 2022 version), and\n“AvosLinux” on Linux machines.\n\nOn Windows, the ransom note: “GET_YOUR_FILES_BACK.txt,” shown in Figure 5, is\nadded to all directories that have been affected by the ransomware.\n\n\n-----\n\n_Figure 5 – AvosLocker (Windows) ransom note_\n\nThe malware uses RSA encryption, with a hardcoded RSA public key that is stored within\nthe malware itself. Once a file is encrypted, AvosLocker appends a snippet of Base64 data\nto each file it has encoded, as shown in Figure 6. This is likely done to prevent doubleencryption or re-infection, and to identify files by the decryption methodology the threat\ngroup deploys, so that it can properly decrypt files if a ransom is successfully paid.\n\nIf the ransomware was executed twice on a comprised system, the twice-encrypted data is\nlikely to become un-recoverable and/or corrupt. As with omitting critical files from\nencryption, preventing files from being corrupted is done to avoid defeating the purpose of\ndemanding payment for recovering a victim’s data.\n\n_Figure 6 – Before and after the ransomware encryption routine (Windows)_\n\n### Linux AvosLocker\n\nTo maximize the malware’s damage potential, in early 2022, the threat actors behind\nAvosLocker developed a Linux edition of the ransomware aimed at targeting and encrypting\nVMware ESXi. The file details of the Linux version are shown in Figure 7.\n\n\n-----\n\n_Figure 7 – AvosLocker (Linux) file details_\n\nCompiled in GCC 4.4.7 like its Windows-based counterpart, the malware does little to hide\nitself. It’s also likely to be deployed only after the initial goals of the threat group have been\nachieved.\n\nAlso like the Windows version, the Linux version of the malware has various flags that it can\naccept on execution to carry out specific tasks. This is shown in the table and Figure 8\nbelow.\n\n### Linux-Based Parameters\n\n_Figure 8 – AvosLocker (Linux parameters)_\n\nAfter execution in a Linux environment, the malware will append the file extension\n“AvosLinux” to signify successful encryption. The malware will drop the text document\n“README_FOR_RESTORE,” shown in Figure 9, which has similar content to its Windowsbased counterpart.\n\n\n-----\n\n_Figure 9 – AvosLocker (Linux) ransom note_\n\n### Omitted Files\n\nThe malware will target all files in a Linux environment except for files with the “.avoslinux”\nor “.avos2” file-extension (which are encrypted by the malware), or the\n“README_FOR_RESTORE” ransom note files.\n\nAvosLocker has a variable called “esxi,” which can be used to further limit the file types that\nare encrypted, to only target VMware-related files.\n\n.vmdk\n.vmem\n\n.vsmp\n\n.vswp\n\n.vmsm\n\n.log\n\n### Leak Site\n\nAvosLocker’s Tor Onion website allows malware operators to open a dialogue with affected\norganizations, and is used to host its “leak site,” which is shown in Figure 10. Upon\nencryption, an ID is generated in the ransom note that instructs the victim to download the\nTor Browser and contact the threat actors directly to organize ransom payment.\n\n_Figure 10 – Initial site to contact threat actor(s)_\n\n\n-----\n\nTo add additional pressure to the victim organization, threat actors will post a series of\ndocuments they have successfully exfiltrated. As of the time of writing, there are multiple\nvictims listed. The latest mentioned on its leak site was affected by the ransomware on\nMarch 22, as seen in Figure 11.\n\n_Figure 11 – \"Press Release\" leak site of AvosLocker_\n\n### Conclusion\n\nAvosLocker ransomware is extremely fast and impactful, designed to encrypt a system in a\nmatter of moments. Though AvosLocker shares a lot in common with most advanced\nransomware families currently in the wild, its focus on large-scale targets and varying\ndeployment tactics makes this threat extremely dangerous.\n\nStopping “just” ransomware is difficult enough. But because of the way this threat spreads,\neven if the attempt fails, it’s likely that a breach in the organization’s network has already\noccurred. Documents and valuable data have probably already been stolen before the\nransomware stage of the attack even begins.\n\nConstant activity on the ransomware’s leak site acts as a warning to other companies, and\na direct threat to those who fall victim to the malware. While this double-extortion ploy is\npotentially more lucrative for threat actors, it is also far riskier, as there are several steps\nthat must be accomplished without being detected for them to achieve their nefarious goals.\n\nAvosLocker is constantly evolving, with new updates being periodically released. We will\nupdate this post with new information as it becomes available.\n\n\n-----\n\n### YARA Rule\n\nThe following YARA rule was authored by the BlackBerry Research & Intelligence Team to\ncatch the threat described in this document:\n\nimport \"pe\"\n\nrule mal_ransom_avoslocker_2022_03\n\n{\n\nmeta:\n\ndescription = \"Detects AvosLocker Ransomware\"\n\ncreated_from_sha256 =\n\"6cc510a772d7718c95216eb56a84a96201241b264755f28875e685f06e95e1a2\"\n\nauthor = \"BlackBerry Threat Research Investigations\"\n\ndate = \"29-03-2022\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0\n[(https://www.apache.org/licenses/LICENSE-2.0) and open to any user or organization, as](https://www.apache.org/licenses/LICENSE-2.0)\nlong as you use it under this license and ensure originator credit in any derivative to The\nBlackBerry Research & Intelligence Team\"\n\nclassification = \"Malware\"\n\nsubclass = \"Ransom\"\n\nconfidence = \"1\"\n\nstrings:\n\n// Crypto functionality\n\n$c1 = \"CryptGenRandom\" ascii\n\n$c2 = \"CryptEncrypt\" ascii\n\n$c3 = \"CryptImportKey\" ascii\n\n$c4 = \"CryptDestroyKey\" ascii\n\n// C:\\Users\\pc\\source\\repos\\cryptopp850\\rijndael_simd.cpp\n\n$s1 = {43 3a 5c 55 73 65 72 73 5c 70 63 5c 73 6f 75 72 63 65 5c 72 65 70 6f 73 5c\n63 72 79 70 74 6f 70 70 38 35 30 5c 72 69 6a 6e 64 61 65 6c 5f 73 69 6d 64 2e 63 70\n70}\n\n// Regex error strings\n\n\n-----\n\n$r1 = regex_error(error_collate): The expression contained an invalid collating\nelement name.\" ascii\n\n$r2 = \"regex_error(error_ctype): The expression contained an invalid character class\nname.\" ascii\n\n$r3 = \"regex_error(error_parse)\" ascii\n\n$r4 = \"regex_error\" ascii\n\ncondition:\n\n// Must contain MZ header\n\nuint16(0) == 0x5a4d and\n\n// Contains 5 sections\n\npe.number_of_sections == 5 and\n\n// Must be less than\n\nfilesize < 950KB and\n\n// All noted strings\n\nall of them\n\n}\n\n### Indicators of Compromise (IoCs)\n\n\n-----\n\n**Mutex to prevent double-execution:**\n\nCheic0WaZie6zeiy\n\n**Windows AvosLocker SHA256 (SonicMango):**\n\nda6e60b4e39c6c556836a18a09a52cd83c47f9cf6dc9e3ad298cbcb925a62a96\n373a791f058539d72983e38ebe68e98132fcf996d04e9a181145f22a96689386\n\nfc55f8b61cb79f2b85b8bf35ff1b80f49fc61a860aca7729f35449df4928cd9b\n\n0c50992b87ba354a256dfe4356ffa98c8bc5dd231dab0a4dc64413741edb739b\n\n5b7bed7349f6b1499b7eac111d7264101b13eeb9684830a4a93bab5f9d79d77e\n\nbe19681b21f2a573b477444a788e00eb8dad2d740d11c02f14e878fe5b89fa70\n\n33203ecb5c34c45dacf64c42c3a24cd4aeb2ceb26b0c58ba97fc8f33319da91b\n\n794f3d25c42d383fad485f9af1d6d7c0508bcfe8ed80a1afea0e0b51bf92bc81\n\n**Linux AvosLocker SHA256 (NaughtyELF / SnowELF):**\n\n0cd7b6ea8857ce827180342a1c955e79c3336a6cf2000244e5cfd4279c5fc1b6\n10ab76cd6d6b50d26fde5fe54e8d80fceeb744de8dbafddff470939fac6a98c4\n\n7c935dcd672c4854495f41008120288e8e1c144089f1f06a23bd0a0f52a544b1\n\nc0a42741eef72991d9d0ee8b6c0531fc19151457a8b59bdcf7b6373d1fe56e02\n\ne737c901b80ad9ed2cd800fec7c2554178c8afab196fb55a0df36acda1324721\n\n**Known AvosLocker Leak Site Domains:**\n\navosjon4pfh3y7ew3jdwz6ofw7lljcxlbk7hcxxmnxlh5kvf2akcqjad[.]onion\navosqxh72b5ia23dl5fgwcpndkctuzqvh2iefk5imp3pi5gfhel5klad[.]onion\n\n### BlackBerry Assistance\n\nIf you’re battling this malware or a similar threat, you’ve come to the right place, regardless\nof your existing BlackBerry relationship.\n\n[The BlackBerry Incident Response Team is made up of world-class consultants dedicated to](https://www.blackberry.com/us/en/services/incident-response)\nhandling response and containment services for a wide range of incidents, including\nransomware and Advanced Persistent Threat (APT) cases.\n\nWe have a global consulting team standing by to assist you, providing around-the-clock\nsupport where required, as well as local assistance. Please contact us\nhere: https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incidentresponse-containment\n\n\n-----\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats,\nproviding intelligence analysis for the benefit of defenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-07 - Threat Thursday- AvosLocker Prompts Advisory from FBI and FinCEN.pdf"
    ],
    "report_names": [
        "2022-04-07 - Threat Thursday- AvosLocker Prompts Advisory from FBI and FinCEN.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535609,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653780271,
    "ts_modification_date": 1653780271,
    "files": {
        "pdf": "https://archive.orkl.eu/b106d8e2d033c6b2e0727b78387ff55f86f6eff0.pdf",
        "text": "https://archive.orkl.eu/b106d8e2d033c6b2e0727b78387ff55f86f6eff0.txt",
        "img": "https://archive.orkl.eu/b106d8e2d033c6b2e0727b78387ff55f86f6eff0.jpg"
    }
}