{
    "id": "306dc16d-6447-410f-9e52-971d9ab66a73",
    "created_at": "2023-01-12T14:59:06.690925Z",
    "updated_at": "2025-03-27T02:13:58.314706Z",
    "deleted_at": null,
    "sha1_hash": "2dd2a459efd912b3309eaf9c795c8da23ed07a86",
    "title": "2021-06-30 - REvil Twins Deep Dive into Prolific RaaS Affiliates' TTPs",
    "authors": "",
    "file_creation_date": "2022-05-28T19:38:32Z",
    "file_modification_date": "2022-05-28T19:38:32Z",
    "file_size": 3846729,
    "plain_text": "# REvil Twins\n\n**blog.group-ib.com/REvil_RaaS**\n\n30.06.2021\n\nDeep Dive into Prolific RaaS Affiliates' TTPs\n\nOleg Skulkin\n\nSenior Digital Forensics analyst at Group-IB\n\nRansomware continues to dominate the cybercriminal scene in 2021. The number of attacks\nas well as the ransom demands seem to be growing quickly. According to the Ransomware\nUncovered 2020-2021 report, Ransomware-as-a-Service model, which involves the\ndevelopers selling/leasing malware to the program affiliates for further network compromise\n\n\n-----\n\nand ransomware deployment, became one of the major driving forces behind phenomenal\ngrowth of the ransomware market. Group-IB DFIR team observed that 64% of all\nransomware attacks it analyzed in 2020 came from operators using the RaaS model.\n\nIn this blog post, we would like to focus on one of the most active ransomware collectives,\n**REvil, and their RaaS program, which attracts more and more affiliates due to the**\nshutdown of other RaaS. Group-IB's DFIR experts took a deep dive into the modus operandi\nof REvil affiliates and shared some information on various affiliates' tactics, techniques and\nprocedures observed, so defenders can tune their detection capabilities accordingly.\n\n**Meet REvil RaaS**\n\nThe affiliate program of REvil ransomware (also known as Sodinokibi or Sodin) emerged as\nearly as in 2019. Ever since, the affiliate program has been actively recruiting partners of\ndifferent skills, who attacked various organizations all around the world except for Russia\nand CIS, which gives reasonable ground to believe that REvil developers and operators are\nmost likely Russian speaking.\n\nREvil affiliates have been extremely active lately. REvil affiliates are not concerned about the\nindustry of the targeted companies. Acer, Honeywell, Quanta Computer, JBS, Sol Oriens –\nthese are just some of the big-name companies hit by the affiliates of this ransomware-as-aservice program. From relatively modest amounts in the early days, their ransom demands\nincreased to tens of millions of dollars now/today. Not long ago, they demanded as much as\nUSD 50,000,000 from Acer, and, according to the public reports, were paid USD 11,000,000\nby JBS.\n\nREvil RaaS Program Overview\n\n\n-----\n\nAccording to a message, that a user, allegedly related to the REvil RaaS program, left in a\nthread dedicated to REvil RaaS program on exploit.in, REvil affiliates get at least 75% from\nthe ransom paid by the victims. The post was then deleted. Nevertheless, Group-IB's Threat\nIntelligence & Attribution system was able to retrieve the original post.\n\nSource: Group-IB Threat Intelligence & Attribution system\n\nIn May 2021, this user left a message in the same thread urging REvil affiliates not to attack\nsocial sector and government companies. In addition, the user addressed the affiliates of the\nclosed RaaS programs. This indicates that more partners are joining REvil, so it is fair to\nexpect the growth in the number and scale of attacks involving this ransomware strain.\n\nSource: Group-IB Threat Intelligence & Attribution system\n\n**TTPs of REvil Affiliates**\n\nIt is interesting to note that, while frequently hitting big corporations, some REvil affiliates are\ngoing after companies with relatively small revenues. This fact is very important from the\nTTPs perspective: on rare occasions, the initial access is gained through a brute force attack\nagainst public-facing RDP-servers or just using valid accounts obtained from a third party.\n\n\n-----\n\nWhat s more, REvil affiliates didn t always focus on Big Game Hunting (targeting big\n[companies). Even in December 2020 some of REvil affiliates used malvertising to trick](https://blog.malwarebytes.com/threat-analysis/2020/11/german-users-targeted-with-gootkit-banker-or-revil-ransomware/)\nvictims into downloading an archive with a malicious JS-file. When executed, it abuses\nWindows Command Prompt to run a malicious PowerShell command, which finally leads to\nREvil execution on the target host. The same technique was used for Gootkit trojan\ndistribution.\n\n**Detection tips: Monitor WScript.exe running scripts from uncommon locations, as well as**\nWScript.exe spawning cmd.exe and/or powershell.exe or performing external network\nconnections.\n\nJust like many other ransomware operators, REvil affiliates used commodity malware to\n[obtain initial access to the target networks. Two recent examples are IcedID and Qakbot –](https://blog.group-ib.com/icedid?utm_source=blog_post&utm_campaign=revil_twins&utm_medium=organic)\nboth already have a long history of being involved in the ransomware operations. In the past,\nIcedID was known to have been used by Maze, Egregor and Conti affiliates, while Qakbot –\nby [ProLock,](https://www.group-ib.com/whitepapers/prolock.html?utm_source=blog_post&utm_campaign=revil_twins&utm_medium=organic) [Egregor and DoppelPaymer.](https://www.group-ib.com/whitepapers/egregor-ransomware.html?utm_source=blog_post&utm_campaign=revil_twins&utm_medium=organic)\n\nBoth trojans are distributed via massive spam campaigns. Potential victim receives an email\nwith a weaponized Microsoft Office document, if it's opened and malicious macros is\nenabled, the trojan binary is downloaded and executed on the host, usually via rundll32.exe\nor regsvr32.exe.\n\nPhishing remains of the most popular vectors for ransomware attacks. According to the\nRansomware Uncovered 2020-2021 report, 29% of attacks in 2020, analyzed by Group-IB\nDFIR team, started with spear phishing.\n\n[Detection of Qakbot in action by Group-IB Atmosphere - an intel-driven cloud Email](https://www.group-ib.com/atmosphere.html?utm_source=blog_post&utm_campaign=revil_twins&utm_medium=organic)\nprotection that detonates and hunts for the most advanced email threats. Request a free trial\n[of Group-IB Atmosphere here.](https://www.group-ib.com/atmosphere.html?utm_source=blog_post&utm_campaign=revil_twins&utm_medium=organic)\n\n\n-----\n\n**Detection tips: Monitor winword.exe or excel.exe spawning suspicious processes, like**\nrundll32.exe, regsvr32.exe or mshta.exe, focus on rundll32.exe and regsvr32.exe running\nfiles without .dll extension.\n\nLet's look at some common examples and start from IcedID. Commonly it uses capabilities of\nanother threat actor – Shathak (which is also known for distributing Qakbot), and is\ndistributed via weaponized Microsoft Word documents. Malicious macros drops an .hta file\nand abuses mshta.exe to run it:\n```\n\"C:\\Windows\\SysWOW64\\mshta.exe\" \"C:\\Users\\Public\\leftSwapStorage.hta\"\n\n```\nAs a result, it downloads the initial IcedID DLL and runs it via rundll32.exe:\n```\n\"C:\\Windows\\System32\\rundll32.exe\" \"C:\\users\\public\\leftSwapStorage.jpg,PluginInit\"\n\n```\nThe second trojan has similar delivery mechanism. Most commonly, it is distributed via\nweaponized Microsoft Excel spreadsheets. Once malicious macros is enabled, Qakbot's\ninitial DLL is downloaded and run via regsvr32.exe:\n```\nregsvr32 -s ..\\Post.storg\n\n```\nGroup-IB [Threat Hunting Framework's Huntpoint detecting Qakbot's DLL execution](https://www.group-ib.com/threat-hunting-framework.html)\n\n**Detection tips: Persistent DLLs for both trojans are commonly located in user's profile**\nsubfolders, so you can hunt for rundll32.exe or regsvr32.exe running suspicious DLLs from\nsuch locations.\n\nAs already mentioned, many affiliates abuse external remote services, as well as exploit\npublic-facing applications to obtain initial access to the target network. It's important to note\nthat the RaaS affiliates rarely perform brute force or password spraying attacks against such\ninstances themselves, rather they buy accesses from the brokers.\n\n**Detection tips: Usually, there's some time from the first successful unauthorized access to**\nthe access, from which actual post-exploitation starts, so if you don't have multi-factor\nauthentication for publicly accessible RDS or VPN, make sure your team monitoring\nsuccessful logins from uncommon locations.\n\nBrute force or password spraying are not always the case. REvil affiliates may obtain valid\naccount from various sources, for example, information stealers. For instance, REvil RaaS\nowners even bought KPOT stealer source code, so they can use it to benefit their affiliates.\n\n\n-----\n\nAffiliates may exploit various vulnerabilities in public-facing applications and are known to\n[use web-shells to maintain initial access. According to the media reports, the threat actors](https://www.bleepingcomputer.com/news/security/computer-giant-acer-hit-by-50-million-ransomware-attack/)\nmay have obtained access to Acer network using ProxyLogon vulnerability in the company's\nMicrosoft Exchange server – it's very common for those who exploit it to upload a web-shell\nto maintain access.\n\nOnce the initial foothold is gained, the threat actors commonly continue with obtaining\nadditional credentials and internal reconnaissance.\n\nTwo most common network scanning tools observed during Group-IB's incident response\nengagements were Advanced IP Scanner and SoftPerfect Network Scanner. In some cases,\naffiliates downloaded these tools directly from the official websites, using compromised host.\n\n**Detection tips: The threat actors hardly rename network-scanning tools, so it's easy to**\nsearch for file names or, if such tools are renamed, focus on the product names and\ndescriptions, which still allow you to detect them.\n\nIn many cases, network scanning wasn't the only activity performed during the\nreconnaissance stage. Usually, the affiliates need to collect information about Active\nDirectory, so it's quite common to see evidence of using such tools, as AdFind, ADRecon\nand Sharphound during the incident investigation.\n\n**Detection tips: Popular Active Directory reconnaissance tools commonly observed to be**\nused by REvil affiliates have very typical command line arguments, which can be used for\nbuilding detections.\n\nLike many other threat actors, including state-sponsored adversaries, REvil affiliates use a\nwide range of living-of-the-land techniques, including the abuse of PowerShell, WMI and\nother built-in tools.\n\nFor example, they used Get-ADComputer cmdlet to collect information about Windows\ncomputers in the infrastructure:\n```\nGet-ADComputer -Filter {enabled -eq $true} -properties *|select Name, DNSHostName,\nOperatingSystem, LastLogonDate | Export-CSV C:\\temp\\AllWindows.csv -NoTypeInformation\n-Encoding UTF8\n\n```\nTo collect information about sessions on a Remote Desktop Session Host server, the threat\nactors used qwinsta command:\n```\nqwinsta /server:%COMPUTERNAME%\n\n```\nAnother built-in command was abused by the REvil affiliates to collect information about\ndomain controllers:\n```\nnslookup -q=srv _kerberos._tcp\n\n```\n\n-----\n\nTo collect information about installed applications, including security products, the\nadversaries ran WMI queries:\n```\nget-wmiobject Win32_Product | Format-Table IdentifyingNumber, Name\n\n```\n**Detection tips: REvil affiliates often use various built-in tools to collect information about the**\ntarget network, most of them aren't used by system and network administrators very often,\nso uncommon executions should be easily detected.\n\nAs for the REvil affiliates detect evasion techniques, in many cases the threat actors didn't\ndisable them at first, preferring to switch them in detection-only mode, so no malicious tools\nthey were using were blocked. This allowed affiliates to use very common and easydetectable tools for credential dumping, such as Mimikatz and LaZagne. In some cases, they\nwanted to be more stealth, and used ProcDump to obtain LSASS process dump.\n\nAnother notable example of credential access observed during some of the incidents is\nsearching for passwords in various files in the user profiles, for example, text files.\n\nDepending on the actor, there are multiple post-exploitation tools used, including:\n\nCobalt Strike\nMetasploit\nCrackMapExec\nPowerShell Empire\nImpacket\n\nAll aforementioned tools also enable REvil affiliates to move laterally, especially if they\nalready gathered elevated credentials. Detection tips: Usually the threat actors use postexploitation tools in a quite common way, so if you focus on regular command line arguments\ntypical of Cobalt Strike, PowerShell Empire and others, you'll most likely successfully detect\nthem.\nIn addition, lateral movement was enabled by leveraging Remote Desktop Protocol. The\naffiliates even enabled it on hosts where it wasn't available using WMI and PowerShell:\n```\n(Get-WmiObject Win32_TerminalServiceSetting -Namespace\nroot\\cimv2\\TerminalServices).SetAllowTsConnections(1,1)\n(Get-WmiObject -Class \"Win32_TSGeneralSetting\" -Namespace root\\cimv2\\TerminalServices\n-Filter \"TerminalName='RDP-tcp'\").SetUserAuthenticationRequired(0)\nSet-ItemProperty -Path 'HKLM:\\System\\CurrentControlSet\\Control\\Terminal\nServer\\WinStations\\RDP-Tcp' -name \"UserAuthentication\" -Value 1\nEnable-NetFirewallRule -DisplayGroup \"Remote Desktop\"\n\n```\nREvil affiliates are notorious for exfiltrating data before the actual ransomware deployment. A\ncommon tool used by the threat actors is WinSCP. In many cases, they just install it on the\nserver, and use SMB protocol to access data of interest on other hosts, exfiltrating it to the\nadversary-controlled servers.\n\n\n-----\n\nAnother example is installing cloud storage related applications, for example, MEGASync. At\nthe same time, the threat actors may use web-browser to access similar cloud storages to\nuse them for data exfiltration.\n\n**Detection tips: Monitor your environment for uncommon applications installations, which**\ncan potentially be used for data exfiltration, such as FTP/SFTP and cloud storage clients.\nAlso, take into consideration connection to cloud storage related websites from uncommon\nplaces.\n\nIn addition, before the actual ransomware deployment, many affiliates take care of available\nbackups, either wiping them or running REvil executables on the corresponding servers in\nthe first order.\n\nUsually the threat actors try to deploy ransomware as widely as possible, and use PsExec or\nGroup Policy modification to run a scheduled task to run it. Of course, before it, they fully\ndisable security products or just add a piece of ransomware to exclusions.\n**Conclusion**\n\nAs you can see, REvil affiliates share tactics, techniques and procedures with other threat\nactors involved in the so-called Big Game Hunting. It's not surprising, as many affiliates from\nother RaaS jumped on the REvil train. Given that more threat actors are joining REvil affiliate\nprogram, we've mapped their affiliates TTPs in accordance with MITRE ATT&CK to better\nprepare for their attacks and know what techniques are needed to mitigate security risks\nassociated with REvil.\n\n\n-----\n\n-----\n\nMore information about human-operated ransomware attacks is available in Group-IB s\nRansomware Uncovered 2020/2021 report:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-30 - REvil Twins Deep Dive into Prolific RaaS Affiliates' TTPs.pdf"
    ],
    "report_names": [
        "2021-06-30 - REvil Twins Deep Dive into Prolific RaaS Affiliates' TTPs.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535546,
    "ts_updated_at": 1743041638,
    "ts_creation_date": 1653766712,
    "ts_modification_date": 1653766712,
    "files": {
        "pdf": "https://archive.orkl.eu/2dd2a459efd912b3309eaf9c795c8da23ed07a86.pdf",
        "text": "https://archive.orkl.eu/2dd2a459efd912b3309eaf9c795c8da23ed07a86.txt",
        "img": "https://archive.orkl.eu/2dd2a459efd912b3309eaf9c795c8da23ed07a86.jpg"
    }
}