{
    "id": "308d9802-d52a-4d10-8d33-847ca6f2d948",
    "created_at": "2023-01-12T15:08:17.599824Z",
    "updated_at": "2025-03-27T02:05:56.308222Z",
    "deleted_at": null,
    "sha1_hash": "fec338ca21578aad3f207ead4bdeb8fa073346f4",
    "title": "2018-11-28 - Two Iranian Men Indicted for Deploying Ransomware to Extort Hospitals, Municipalities, and Public Institutions, Causing Over $30 Million in Losses",
    "authors": "",
    "file_creation_date": "2022-05-27T18:38:31Z",
    "file_modification_date": "2022-05-27T18:38:31Z",
    "file_size": 80376,
    "plain_text": "# Two Iranian Men Indicted for Deploying Ransomware to Extort Hospitals, Municipalities, and Public Institutions, Causing Over $30 Million in Losses\n\n**[justice.gov/opa/pr/two-iranian-men-indicted-deploying-ransomware-extort-hospitals-municipalities-and-public](https://www.justice.gov/opa/pr/two-iranian-men-indicted-deploying-ransomware-extort-hospitals-municipalities-and-public)**\n\nNovember 28, 2018\n\nDepartment of Justice\n\nOffice of Public Affairs\n\nFOR IMMEDIATE RELEASE\n\nWednesday, November 28, 2018\n\nA federal grand jury returned an indictment unsealed today in Newark, New Jersey charging\nFaramarz Shahi Savandi, 34, and Mohammad Mehdi Shah Mansouri, 27, both of Iran, in a\n34-month-long international computer hacking and extortion scheme involving the\ndeployment of sophisticated ransomware, announced Deputy Attorney General Rod J.\nRosenstein, Assistant Attorney General Brian A. Benczkowski of the Justice Department’s\nCriminal Division, U.S. Attorney Craig Carpenito for the District of New Jersey and Executive\nAssistant Director Amy S. Hess of the FBI.\n\nThe six-count indictment alleges that Savandi and Mansouri, acting from inside Iran,\nauthored malware, known as “SamSam Ransomware,” capable of forcibly encrypting data on\nthe computers of victims. According to the indictment, beginning in December 2015,\nSavandi and Mansouri would then allegedly access the computers of victim entities without\nauthorization through security vulnerabilities, and install and execute the SamSam\nRansomware on the computers, resulting in the encryption of data on the victims’\ncomputers. These more than 200 victims included hospitals, municipalities, and public\ninstitutions, according to the indictment, including the City of Atlanta, Georgia; the City of\nNewark, New Jersey; the Port of San Diego, California; the Colorado Department of\n\n\n-----\n\nTransportation; the University of Calgary in Calgary, Alberta, Canada; and six health carerelated entities: Hollywood Presbyterian Medical Center in Los Angeles, California; Kansas\nHeart Hospital in Wichita, Kansas; Laboratory Corporation of America Holdings, more\ncommonly known as LabCorp, headquartered in Burlington, North Carolina; MedStar Health,\nheadquartered in Columbia, Maryland; Nebraska Orthopedic Hospital now known as\nOrthoNebraska Hospital, in Omaha, Nebraska and Allscripts Healthcare Solutions Inc.,\nheadquartered in Chicago, Illinois.\n\nAccording to the indictment, Savandi and Mansouri would then extort victim entities by\ndemanding a ransom paid in the virtual currency Bitcoin in exchange for decryption keys for\nthe encrypted data, collecting ransom payments from victim entities that paid the ransom,\nand exchanging the Bitcoin proceeds into Iranian rial using Iran-based Bitcoin exchangers.\nThe indictment alleges that, as a result of their conduct, Savandi and Mansouri have\ncollected over $6 million USD in ransom payments to date, and caused over $30 million USD\nin losses to victims.\n\n“The Iranian defendants allegedly used hacking and malware to cause more than $30 million\nin losses to more than 200 victims,” said Deputy Attorney General Rosenstein. “According to\nthe indictment, the hackers infiltrated computer systems in 10 states and Canada and then\ndemanded payment. The criminal activity harmed state agencies, city governments,\nhospitals, and countless innocent victims.”\n\n“The allegations in the indictment unsealed today—the first of its kind—outline an Iran-based\ninternational computer hacking and extortion scheme that engaged in 21st-century digital\nblackmail,” said Assistant Attorney General Benczkowski. “These defendants allegedly used\nransomware to infect the computer networks of municipalities, hospitals, and other key public\ninstitutions, locking out the computer owners, and then demanded millions of dollars in\npayments from them. As today’s charges demonstrate, the Criminal Division and its law\nenforcement partners will relentlessly pursue cybercriminals who harm American citizens,\nbusinesses, and institutions, regardless of where those criminals may reside.”\n\n“The defendants in this case developed and deployed the SamSam Ransomware in order to\nhold public and private entities hostage and then extort money from them,” said U.S.\nAttorney Carpenito. “As the indictment in this case details, they started with a business in\nMercer County and then moved on to major public entities, like the City of Newark, and\nhealthcare providers, like the Hollywood Presbyterian Medical Center in Los Angeles and the\nKansas Heart Hospital in Wichita—cravenly taking advantage of the fact that these victims\ndepend on their computer networks to serve the public, the sick, and the injured without\ninterruption. The charges announced today show that the U.S. Attorney’s Office for the\nDistrict of New Jersey will continue to act to disrupt such criminal acts, and identify those\nwho are responsible for them, no matter where in the world they may seek to hide.”\n\n\n-----\n\nThis indictment demonstrates the FBI s continuous commitment to unmasking malicious\nactors behind the world’s most egregious cyberattacks,” said Executive Assistant Director\nHess. “By calling out those who threaten American systems, we expose criminals who hide\nbehind their computer and launch attacks that threaten our public safety and national\nsecurity. The actions highlighted today, which represent a continuing trend of cyber criminal\nactivity emanating from Iran, were particularly threatening, as they targeted public safety\ninstitutions, including U.S. hospital systems and governmental entities. The FBI, with the\nassistance of our private sector and U.S. government partners, are sending a strong\nmessage that we will work together to investigate and hold all criminals accountable.”\n\nSavandi and Mansouri are charged with one count of conspiracy to commit wire fraud, one\ncount of conspiracy to commit fraud and related activity in connection with computers, two\nsubstantive counts of intentional damage to a protected computer and two substantive\ncounts of transmitting a demand in relation to damaging a protected computer.\n\nAccording to the indictment, Savandi and Mansouri created the first version of the SamSam\nRansomware in December 2015, and created further refined versions in June and October\n2017. In addition to employing Iran-based Bitcoin exchangers, the indictment alleges that\nthe defendants also utilized overseas computer infrastructure to commit their attacks.\nSavandi and Mansouri would also use sophisticated online reconnaissance techniques (such\nas scanning for computer network vulnerabilities) and conduct online research in order to\nselect and target potential victims, according to the indictment. According to the indictment,\nthe defendants would also disguise their attacks to appear like legitimate network activity.\n\nTo carry out their scheme, the indictment alleges that the defendants also employed the use\nof Tor, a computer network designed to facilitate anonymous communication over the\ninternet. According to the indictment, the defendants maximized the damage caused to\nvictims by launching attacks outside regular business hours, when a victim would find it more\ndifficult to mitigate the attack, and by encrypting backups of the victims’ computers. This was\nintended to—and often did—cripple the regular business operations of the victims, according\nto the indictment. The most recent ransomware attack against a victim alleged in the\nindictment took place on Sept. 25, 2018.\n\nThis case was investigated by the FBI’s Newark Field Office. Senior Counsel William A. Hall\nJr. of the Criminal Division’s Computer Crime and Intellectual Property Section (CCIPS) and\nAssistant U.S. Attorney and Chief of the Cybercrimes Unit Justin S. Herring of the District of\nNew Jersey are prosecuting the case. The Department thanks its law enforcement\ncolleagues at the National Crime Agency (UK), West Yorkshire Police (UK), Calgary Police\nService (Canada), and the Royal Canadian Mounted Police. Significant assistance was\nprovided by the Justice Department’s National Security Division and the Criminal Division’s\nOffice of International Affairs.\n\n\n-----\n\nVictims are encouraged to contact their local FBI field office and file a complaint online with\nthe Internet Crime Complaint Center (IC3). The IC3 staff reviews complaints, looking for\npatterns or other indicators of significant criminal activity, and refers investigative packages\nof complaints to the appropriate law enforcement authorities in a particular city or region. The\nFBI provides a variety of resources relating to ransomware through the IC3, which can be\nreached at [www.ic3.gov.  For more information on ransomware prevention, visit:](http://www.ic3.gov/)\n[https://www.ic3.gov/media/2016/160915.aspx](https://www.ic3.gov/media/2016/160915.aspx)\n\nCharges contained in an indictment are merely allegations, and the defendants are\npresumed innocent until proven guilty beyond a reasonable doubt in a court of law.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-11-28 - Two Iranian Men Indicted for Deploying Ransomware to Extort Hospitals, Municipalities, and Public Institutions, Causing Over $30 Million in Losses.pdf"
    ],
    "report_names": [
        "2018-11-28 - Two Iranian Men Indicted for Deploying Ransomware to Extort Hospitals, Municipalities, and Public Institutions, Causing Over $30 Million in Losses.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536097,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1653676711,
    "ts_modification_date": 1653676711,
    "files": {
        "pdf": "https://archive.orkl.eu/fec338ca21578aad3f207ead4bdeb8fa073346f4.pdf",
        "text": "https://archive.orkl.eu/fec338ca21578aad3f207ead4bdeb8fa073346f4.txt",
        "img": "https://archive.orkl.eu/fec338ca21578aad3f207ead4bdeb8fa073346f4.jpg"
    }
}