{
    "id": "30aa9318-567c-41ff-b58f-47434eff584f",
    "created_at": "2023-01-12T15:08:46.908123Z",
    "updated_at": "2025-03-27T02:12:37.67178Z",
    "deleted_at": null,
    "sha1_hash": "675400baba3df8803e1389097bc5ec8f19b5e639",
    "title": "2019-03-06 - Whitefly- Espionage Group has Singapore in Its Sights",
    "authors": "",
    "file_creation_date": "2022-05-28T21:59:08Z",
    "file_modification_date": "2022-05-28T21:59:08Z",
    "file_size": 963620,
    "plain_text": "# Whitefly: Espionage Group has Singapore in Its Sights\n\n**symantec.com/blogs/threat-intelligence/whitefly-espionage-singapore**\n\nThreat Hunter TeamSymantec\n\n## Group behind the SingHealth breach is also responsible for a string of other attacks in the region.\n\nIn July 2018, an attack on Singapore’s largest public health organization, SingHealth, resulted in a reported 1.5 million patient records\nbeing stolen. Until now, nothing was known about who was responsible for this attack. Symantec researchers have discovered that this\nattack group, which we call Whitefly, has been operating since at least 2017, has targeted organizations based mostly in Singapore\nacross a wide variety of sectors, and is primarily interested in stealing large amounts of sensitive information.\n\nWhitefly compromises its victims using custom malware alongside open-source hacking tools and living off the land tactics, such as\nmalicious PowerShell scripts.\n\n\n-----\n\n#Whitefly, the group behind the SingHealth breach, is also responsible for a string of other attacks in Singapore https://symc.ly/2X1RALf\n[Click to Tweet](https://twitter.com/intent/tweet?text=%23Whitefly,%20the%20group%20behind%20the%20SingHealth%20breach,%20is%20also%20responsible%20for%20a%20string%20of%20other%20attacks%20in%20Singapore%20https://symc.ly/2X1RALf&via=threatintel&hashtags=undefined)\n\n## Whitefly’s targets\n\nFrom mid-2017 to mid-2018, Whitefly launched targeted attacks against multiple organizations. While most of these organizations were\nbased in Singapore, some were multinational organizations with a presence in Singapore.\n\nTo date, Whitefly has attacked organizations in the healthcare, media, telecommunications, and engineering sectors.\n\n## How Whitefly compromises its victims\n\nWhitefly first infects its victims using a dropper in the form of a malicious .exe or .dll file that is disguised as a document or image. These\nfiles frequently purport to offer information on job openings or appear to be documents sent from another organization operating in the\nsame industry as the victim. Given the nature of disguise, it’s highly likely that they are sent to the victim using spear-phishing emails.\n\n[If opened, the dropper runs a loader known as Trojan.Vcrodat on the computer. Whitefly has consistently used a technique known as](https://www.symantec.com/security-center/writeup/2019-013008-4820-99)\nsearch order hijacking to run Vcrodat. This technique takes advantage of the fact that Windows does not require an application to provide\na specific path for a DLL that it wishes to load. If no path is provided, Windows searches for the DLL in specific locations on the computer\nin a pre-defined order. Attackers can therefore give a malicious DLL the same name as a legitimate DLL but place it ahead of the\nlegitimate version in the search order so that it will be loaded when Windows searches for it. Whitefly frequently delivers Vcrodat as a\nmalicious DLL that has the same name as DLLs belonging to legitimate software from various security vendors. The group leverages\nsearch order hijacking to assure that its malicious DLLs will be executed. Targeting security applications could allow the attackers to gain\nhigher privileges for the malware, since the vendor’s component may be run with elevated privileges.\n\nOnce executed, Vcrodat loads an encrypted payload on to the victim’s computer. The payload contacts a command and control (C&C)\ndomain. Whitefly configures multiple C&C domains for each target. The payload sends system information about the infected computer to\nthe C&C server and downloads additional tools.\n\nWhitefly usually attempts to remain within a targeted organization for long periods of time—often months—in order to steal large\nvolumes of information.\n\nOnce the initial computer on the targeted organization’s network is infected with Vcrodat, Whitefly begins mapping the network and\n[infecting further computers. In order to carry out this operation, it uses publicly available tools, including Mimikatz (Hacktool.Mimikatz) and](https://www.symantec.com/security-center/writeup/2012-042615-3731-99)\nan open-source tool (SHA2: 263dc5a8121d20403beeeea452b6f33d51d41c6842d9d19919def1f1cb13226c) that exploits a known\n[Windows privilege escalation vulnerability (CVE-2016-0051) on unpatched computers. The attackers rely heavily on tools such as](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0051)\nMimikatz to obtain credentials. Using these credentials, the attackers are able to compromise more machines on the network and, from\nthose machines, again obtain more credentials. They perform this tactic repeatedly until they gain access to the desired data.\n\nWhitefly usually attempts to remain within a targeted organization for long periods of time—often months—in order to steal large volumes\nof information. It keeps the compromise alive by deploying a number of tools that facilitate communication between the attackers and\ninfected computers. These tools include a simple remote shell tool that will call back to the C&C server and wait for commands, and an\n[open-source hacking tool called Termite (Hacktool.Rootkit), which allows Whitefly to perform more complex actions such as controlling](https://www.symantec.com/security-center/writeup/2002-011710-0057-99)\nmultiple compromised machines at a time.\n\n## Additional malware used in selected attacks\n\n[In some attacks, Whitefly has used a second piece of custom malware, Trojan.Nibatad. Like Vcrodat, Nibatad is also a loader that](https://www.symantec.com/security-center/writeup/2018-080818-0255-99)\nleverages search order hijacking, and downloads an encrypted payload to the infected computer. And similar to Vcrodat, the Nibatad\npayload is designed to facilitate information theft from an infected computer.\n\nWhile Vcrodat is delivered via the malicious dropper, we have yet to discover how Nibatad is delivered to the infected computer. Why\nWhitefly uses these two different loaders in some of its attacks remains unknown. And while we have found both Vcrodat and Nibatad\ninside individual victim organizations, we have not found any evidence of them being used simultaneously on a single computer.\n\n## Links to other attacks\n\nSome of the tools that Whitefly has used in its attacks have also been deployed in other targeted attacks outside Singapore.\n\nBetween May 2017 and December 2018, a multi-purpose command tool (SHA2:\n7de8b8b314f2d2fb54f8f8ad4bba435e8fc58b894b1680e5028c90c0a524ccd9) that has been used by Whitefly was also used in attacks\nagainst defense, telecoms, and energy targets in Southeast Asia and Russia. The tool appears to be custom-built and, aside from its use\nby Whitefly, these were the only other attacks where Symantec has observed its use.\n\nIn another case, Vcrodat was also used in an attack on a UK-based organization in the hospitality sector.\n\n\n-----\n\nIt s possible Whitefly itself performed these attacks but it s more likely that they were carried out by one or more other groups with access\nto the same tools.\n\n## Adept attackers with a large toolset\n\nIt now appears that the SingHealth breach was not a one-off attack and was instead part of a wider pattern of attacks against\norganizations in the region. Whitefly is a highly adept group with a large arsenal of tools at its disposal, capable of penetrating targeted\norganizations and maintaining a long-term presence on their networks. Links with attacks in other regions also present the possibility that\nit may be part of a broader intelligence gathering operation.\n\n## Protection/Mitigation\n\nSymantec has the following protection in place to protect customers against these attacks:\n\n**File-based protection**\n\n[Trojan.Vcrodat](https://www.symantec.com/security-center/writeup/2019-013008-4820-99)\n[Trojan.Nibatad](https://www.symantec.com/security-center/writeup/2018-080818-0255-99)\n[Hacktool.Rootkit](https://www.symantec.com/security-center/writeup/2002-011710-0057-99)\n[Hacktool.Mimikatz](https://www.symantec.com/security-center/writeup/2012-042615-3731-99)\n\n## Indicators of Compromise\n\n**MD5** **SHA2** **Description**\n\neab0a521aa7cac62d98d78ef845a8319 a196dfe4ef7d422aadf1709b12511ae82cb96aad030422b00a9c91fb60a12f17 Trojan.Vcrodat\n\n79bef92272c7d1c6236a03c26a0804cc d784a12fec628860433c28caa353bb52923f39d072437393629039fa4b2ec8ad Trojan.Vcrodat\n\n394df628b3c8977661c8bebea593e148 6e874ac92c7061300b402dc616a1095fa7d13c8a18c8a3ea5b30ffa832a7372c Trojan.Nibatad\n\n51862c3615e2f8a807b1d59f3aef3507 ed3cd71eaca603a00e4c0804dc34d84dc38c6c1e1c1f43af0568fb162c44c995 DLL Shellcode\nLoader\n\nb4a7049b90503534d494970851bdda62 9d9a6337c486738edf4e5d1790c023ba172ce9b039df1b7b9720ed4c4c9ade90 DLL Shellcode\nLoader\n\n93c9310f3984d96f53f226f5177918c4ca78b2070d5843f08d2cf351e8c239d5 Mimikatz\n\n263dc5a8121d20403beeeea452b6f33d51d41c6842d9d19919def1f1cb13226c CVE-20160051 privilege\nescalation\n\nb2b2e900aa2e96ff44610032063012aa0435a47a5b416c384bd6e4e58a048ac9 Termite\n\ndda22de8ad7d807cdac8c269b7e3b35a3021dcbff722b3d333f2a12d45d9908d Simple\ncommand line\nremote access\ntool\n\nf562e9270098851dc716e3f17dbacc7f9e2f98f03ec5f1242b341baf1f7d544c Simple\ncommand line\nremote access\ntool\n\n7de8b8b314f2d2fb54f8f8ad4bba435e8fc58b894b1680e5028c90c0a524ccd9 Multi-purpose\ncommand tool\n\n## About the Author\n\n### Threat Hunter Team\n\n\n-----\n\n**y**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced\nprotection in Symantec products, and offer analysis that helps customers respond to attacks.\n\n## Want to comment on this post?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-03-06 - Whitefly- Espionage Group has Singapore in Its Sights.pdf"
    ],
    "report_names": [
        "2019-03-06 - Whitefly- Espionage Group has Singapore in Its Sights.pdf"
    ],
    "threat_actors": [
        {
            "id": "ad5c6ff2-0646-4b29-88bb-d88c75e4866d",
            "created_at": "2022-10-25T15:50:23.662882Z",
            "updated_at": "2025-03-27T02:00:55.515808Z",
            "deleted_at": null,
            "main_name": "Whitefly",
            "aliases": [
                "Whitefly"
            ],
            "source_name": "MITRE:Whitefly",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cd9f8d91-c55c-4086-a1a0-23e78d194d46",
            "created_at": "2023-01-06T13:46:38.943454Z",
            "updated_at": "2025-03-27T02:00:02.958535Z",
            "deleted_at": null,
            "main_name": "Whitefly",
            "aliases": [],
            "source_name": "MISPGALAXY:Whitefly",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "df9bfbf1-bb9d-492f-b381-95b9e1482267",
            "created_at": "2022-10-25T16:07:24.394491Z",
            "updated_at": "2025-03-27T02:02:10.207352Z",
            "deleted_at": null,
            "main_name": "Whitefly",
            "aliases": [
                "ATK 83",
                "Bronze Walker",
                "Mofang",
                "SectorM04",
                "TEMP.Mimic"
            ],
            "source_name": "ETDA:Whitefly",
            "tools": [
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Nibatad",
                "Shim RAT",
                "ShimRAT",
                "Vcrodat"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536126,
    "ts_updated_at": 1743041557,
    "ts_creation_date": 1653775148,
    "ts_modification_date": 1653775148,
    "files": {
        "pdf": "https://archive.orkl.eu/675400baba3df8803e1389097bc5ec8f19b5e639.pdf",
        "text": "https://archive.orkl.eu/675400baba3df8803e1389097bc5ec8f19b5e639.txt",
        "img": "https://archive.orkl.eu/675400baba3df8803e1389097bc5ec8f19b5e639.jpg"
    }
}