{
    "id": "30e14d37-fcbf-4af7-9482-d7dd549f0240",
    "created_at": "2023-01-12T15:10:01.35124Z",
    "updated_at": "2025-03-27T02:05:21.794225Z",
    "deleted_at": null,
    "sha1_hash": "b3a11ff00950c1e6bbeba19c4f1956f8d08f7ab2",
    "title": "2021-06-08 - Another Brick in the Wall- eCrime Groups Leverage SonicWall VPN Vulnerability",
    "authors": "",
    "file_creation_date": "2022-05-28T19:42:27Z",
    "file_modification_date": "2022-05-28T19:42:27Z",
    "file_size": 396757,
    "plain_text": "# How eCrime Groups Leverage an Old SonicWall Vulnerability\n\n**[crowdstrike.com/blog/how-ecrime-groups-leverage-sonicwall-vulnerability-cve-2019-7481/](https://www.crowdstrike.com/blog/how-ecrime-groups-leverage-sonicwall-vulnerability-cve-2019-7481/)**\n\nHeather Smith and Hanno Heinrichs June 8, 2021\n\n**BLOG UPDATE AUG. 6, 2021:**\n\n**Following further communication with the SonicWall PSIRT, the vulnerability was**\n**identified as CVE-2021-20028, affecting End of Life SonicWall VPN Devices running**\n**SMA/SRA versions 8.x, 9.0.0.9-26sv and earlier. This vulnerability does not affect any**\n**of the latest available versions of firmware for the Secure Remote Access (SRA) and**\n**the Secure Mobile Access (SMA) product lines. The SonicWall PSIRT has issued the**\n**following advisory and has worked to notify affected customers:**\n**[https://psirt.global.sonicwall.com/vuln-detail/SNWLID-2021-0017.](https://psirt.global.sonicwall.com/vuln-detail/SNWLID-2021-0017)**\n\n**_Our original post follows._**\n\nCrowdStrike Services incident response teams identified eCrime actors leveraging an\nolder SonicWall VPN vulnerability, CVE-2019-7481, that affects Secure Remote Access\n(SRA) 4600 devices; the ability to leverage the vulnerability to affect SRA devices was\npreviously undisclosed by SonicWall\nCrowdStrike Intelligence researchers confirmed that CVE-2019-7481 affects SRA\ndevices running the latest versions of 8.x and 9.x firmware, and that the latest versions\nof Secure Mobile Access (SMA) firmware do not mitigate the CVE for SRA devices\n\n\n-----\n\nCrowdStrike recommends organizations always implement multifactor authentication\n(MFA) and replace legacy, end-of-life devices with the latest vendor-supported versions\n\nThe year 2021 has already been a busy one for vulnerability patching and management, with\nseveral new zero-day vulnerabilities impacting many companies’ primary means of remote\nauthentication in a world still working from anywhere. With increased dependency on VPN\ndevices, it is not surprising that both eCrime and nation-state actors focus on VPN device\ncompromise as an initial attack vector. In this blog, we discuss a 2019 exploit, CVE-20197481, that also affects end-of-life SonicWall SRA VPN devices running firmware versions 8.x\nand 9.x. CrowdStrike has identified big game hunting (BGH) ransomware actors leveraging\nthis vulnerability against these older SonicWall SRA 4600 VPN devices during various\nincident response investigations.\n\nOn Feb. 4, 2021, SonicWall’s Product Security Incident Response Team (PSIRT) announced\na new zero-day vulnerability, CVE-2021-20016, that affects its SMA (Secure Mobile Access)\ndevices. Within the documentation, SonicWall stated this new vulnerability affects the SMA\n100 series product, and updates are required for versions running 10.x firmware. SonicWall\ndid not state if or how this newest exploit affects any older SRA VPN devices still in\nproduction environments.\n\nIn fact, the older SRA VPN devices have not been mentioned in vulnerability disclosures\nsince SonicWall’s CVE advisories in 2017, however the December 2019 CVE vulnerabilities\n[were referenced for SRA devices in an article from Security Week in early 2020. This article](https://www.securityweek.com/serious-vulnerabilities-expose-sonicwall-sma-appliances-remote-attacks)\nnoted that the SonicWall PSIRT advisories published in 2019 only mention the SMA devices,\nas the SRA devices were deemed end-of-life, stating, “SonicWall SMA100 9.0.0.4 and\n9.0.0.5 patch the vulnerabilities identified by the researcher.”\n\n## Trends from the Front Lines\n\nMeanwhile, on the front lines, CrowdStrike’s Incident Response team has been busy battling\nBGH ransomware actors wreaking havoc on organizations worldwide. One of CrowdStrike’s\nmain objectives in every investigation is to answer the question: What was the initial attack\nvector or the root cause of the attack? Depending on dwell time and the amount of data still\navailable, this question may not always be answered with direct evidence.\n\nBut in some recent investigations, CrowdStrike’s Incident Response team has had correlative\nevidence indicating a root cause via VPN access without brute forcing. These investigations\nhave a common denominator: All organizations used SonicWall SRA VPN appliances\nrunning 9.0.0.5 firmware. Further, timeline analysis of systems and network appliance data,\nspecifically SonicWall VPN log information, showed another common denominator: The\nstring `msg=\"Virtual Assist Installing Customer App\" appears in the minutes`\nleading up to the earliest system access or compromise by the adversary.\n\n\n-----\n\nThis drove CrowdStrike s Incident Response and Intelligence teams to join forces and ask\nthe question: Are SRA VPN devices running the latest 9.0.0.5 firmware still vulnerable to\nCVE-2019-7481? Moreover, are these incident response investigations potentially related to\na SonicWall vulnerability against SRA devices not previously disclosed? CrowdStrike\nfocused on looking at if the 2019 CVE, rather than the 2021 CVE, could be leveraged against\nSRA appliances because 1) public proof of concept and code are available for the 2019\nvulnerability, and 2) CrowdStrike does not want to introduce any information that could be\nused by an adversary, as the 2021 vulnerability does not have proof-of-concept code publicly\navailable at this time.\n\n## Testing CVE-2019-7481\n\nCrowdStrike confirmed with SonicWall PSIRT that the patching recommendation for the older\nSRA devices is now available through SMA firmware updates, and that these devices are\ninterchangeable. SonicWall PSIRT further stated that only devices with version 8.x are\naffected by CVE-2019-7481; in a public statement on this vulnerability, they further mention\nversions 9.0.0.3 and earlier are affected. Based on this, it stood to reason that devices with\nversion 9.0.0.5 firmware should be considered patched to the injection vulnerability. To verify,\nCrowdStrike began testing the injection attack on the older SonicWall SRA 4600 device,\nversion 9.0.0.5.\n\nCrowdStrike Intelligence developed the following injection script in Python to test the SRA\n4600 device:\n\n\n-----\n\n(Click to enlarge)\n\nBelow is the output of the Python script showing its usage and help menu, along with the\noutput after running against the older SRA 4600 device with 9.0.0.5 firmware:\n\n\n-----\n\nExecuted on the SRA 4600 version 9.0.0.5, configured with test user sessions running, the\nresults are as follows:\n\nThe older SRA device is still vulnerable despite patching to version 9.0.0.5, the\nrecommended patch prescribed for SMA devices in 2019.\n\nWhile this was previously thought to be a one-to-one match from older SRA to newer\nSMA firmware, the ability to patch SRA with SMA updates does not always appear to\nmitigate vulnerabilities in SRA devices.\n\nTo fully prepare environments that may still be running these devices, CrowdStrike reached\nout to SonicWall PSIRT with these results. SonicWall confirmed that SRA devices have been\ndeemed end-of-life, and that the latest mitigation instruction is to update to the 10.x firmware\npatches provided in the latest 2021 vulnerability patching announcements that affected the\nSMA 100 devices.\n\nHowever, this mitigation may still pose risk to an organization with end-of-life devices.\nCrowdStrike found that the patching thought to be applicable in a reverse-compatible manner\nfrom newer SMA to older SRA in 2019 is still able to be exploited, even with the most recent\npatching recommendations for the older CVE (CVE-2019-7481).\n\n## Further Analysis\n\nTo help organizations that may find themselves with these devices still in place, CrowdStrike\nanalyzed the log output from the older SRA 4600 devices to determine if there may be an\nindicator of the [SQL injection attack. Within the SonicWall VPN logs, there is a functionality](https://www.crowdstrike.com/cybersecurity-101/sql-injection/)\nfor remote assistance called “Virtual Assist.” CrowdStrike tested the injection attack without\nVirtual Assist present on the SRA device and was still able to extract credentials for active\n\n\n-----\n\nsessions on the device. Resulting logs for this activity showed two main indicators: the\nmessage field included the words “Virtual Assist Installing Customer App,” and the agent\nfield contained “python-requests/*”. Here is an example of those log fields:\n```\nmsg=\"Virtual Assist Installing Customer App\" agent=\"python-requests/2.24.0\"\n\n## Recommendations\n\n```\nCrowdStrike’s Services and Intelligence teams hope that in conducting this vulnerability\nanalysis, we shed light on a risk that can arise from end-of-life support and on the potentially\nerroneous assumption that version updates fully mitigate exploits in older, untested models.\nWhile SonicWall’s recommendation is to upgrade any legacy SRA devices to the 10.x\nversioning recommended in light of the 2021 zero-day disclosure, CrowdStrike would\nadditionally recommend that organizations consider replacing any legacy models for newer\ndevices that are in-scope for vendor testing and support.\n\nWith attacker focus still heavy on remote entry points to an organization, CrowdStrike\nrecommends a Zero Trust approach to securely operate even with ongoing threats to VPN\ninfrastructure. CrowdStrike recommends adding two-factor authentication to VPN access and\nany additional remote applications, portals and email that are open to remote access.\nAdditionally, CrowdStrike recommends organizations protect their endpoints with endpoint\ndetection and response (EDR) software to all domain-joined systems (as are compatible) —\nshould any attacker breach the first wall of defense, ensuring that the organization has\nprevention software in place to mitigate unauthorized access from moving further can make\na significant difference in impact to the environment.\n\nLastly, If your organization still has an SRA device in place, CrowdStrike recommends\nfollowing SonicWall’s PSIRT advisory to patch to the latest version of SMA 100 firmware.\nCrowdStrike also recommends ingesting and monitoring all VPN logs, and security teams\nshould consider adding alerting for messages that indicate the call of “Virtual Assist” in\nSonicWall VPN logs.\n\n## Conclusion\n\nWhile the assumption had been that SRA devices, though end-of-life, could be maintained by\nimplementing the latest SMA firmware upgrades and vulnerability patches, CrowdStrike\nfound that these firmware version recommendations previously considered “patched” can still\nbe vulnerable. As the SRA devices are no longer being supported by SonicWall, an upgrade\nto a supported device is recommended to mitigate risk. Further, while this vulnerability allows\nan attacker to see session data, two-factor authentication may slow or halt an attack.\nCrowdStrike recommends MFA on any point of remote access into an environment.\n\n\n-----\n\nBGH ransomware actors will continue to target VPN and remote access vulnerabilities, and\ndefense-in-depth remains an organization’s best weapon against these very opportunistic\nadversaries.\n\n**Additional Resources**\n\n_For more information on CVEs you should know about, read Falcon Complete Stops_\n_Microsoft Exchange Server Zero-Day Exploits,_ _Vulnerability Roundup: 10 Critical CVEs_\n_[of 2020, and our Patch Tuesday blogs for February 2021,](https://www.crowdstrike.com/blog/patch-tuesday-analysis-february-2021/)_ _[March 2021 and](https://www.crowdstrike.com/blog/patch-tuesday-analysis-march-2021/)_ _[April 2021.](https://www.crowdstrike.com/blog/patch-tuesday-analysis-april-2021/)_\n_[Read more about how you can stay aware of weaknesses and vulnerabilities in your](https://www.crowdstrike.com/blog/how-to-stay-ahead-of-common-vulnerabilities-and-exposures-in-your-environment/)_\n_environment._\n_A CrowdStrike_ _[IT Hygiene Assessment identifies vulnerabilities, missing patches,](https://www.crowdstrike.com/services/am-i-mature/it-hygiene-assessment/)_\n_unprotected devices and ineffective security settings so you can proactively safeguard_\n_your network before a breach occurs._\n_Learn how you can continuously monitor and assess the vulnerabilities in your_\n_[environment with Falcon Spotlight™.](https://www.crowdstrike.com/endpoint-security-products/falcon-spotlight-vulnerability-management/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-08 - Another Brick in the Wall- eCrime Groups Leverage SonicWall VPN Vulnerability.pdf"
    ],
    "report_names": [
        "2021-06-08 - Another Brick in the Wall- eCrime Groups Leverage SonicWall VPN Vulnerability.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536201,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653766947,
    "ts_modification_date": 1653766947,
    "files": {
        "pdf": "https://archive.orkl.eu/b3a11ff00950c1e6bbeba19c4f1956f8d08f7ab2.pdf",
        "text": "https://archive.orkl.eu/b3a11ff00950c1e6bbeba19c4f1956f8d08f7ab2.txt",
        "img": "https://archive.orkl.eu/b3a11ff00950c1e6bbeba19c4f1956f8d08f7ab2.jpg"
    }
}