{
    "id": "30e9ea04-8edc-4ea5-92ed-9992bad9f4dd",
    "created_at": "2023-01-12T15:03:06.763605Z",
    "updated_at": "2025-03-27T02:14:11.960946Z",
    "deleted_at": null,
    "sha1_hash": "bc895228f9f2579a25d3e5d318fca903771f5056",
    "title": "2022-03-23 - Trustwave’s Action Response- The Lapsus$ Hacker Group Shows Us the Importance of Securing the Digital Supply Chain",
    "authors": "",
    "file_creation_date": "2022-09-01T10:08:58Z",
    "file_modification_date": "2022-09-01T10:08:58Z",
    "file_size": 460633,
    "plain_text": "# Trustwave’s Action Response: The Lapsus$ Hacker Group Shows Us the Importance of Securing the Digital Supply Chain\n\n**trustwave.com/en-us/resources/blogs/spiderlabs-blog/trustwaves-action-response-the-lapsus-hacker-group-shows-us-**\nthe-importance-of-securing-the-digital-supply-chain\n\n_Update March 24: This blog has been updated to reflect the new information provided by_\n_vendors attacked by Lapsus$ and the reported arrests._\n\n**_Trustwave is actively tracking the threat of Lapsus$ for our clients. We encourage all_**\n**_organizations, especially those part of the digital supply chain, to remain vigilant and_**\n**_ensure that cyber best practices are implemented._**\n\n**_We are actively investigating all unusual login behaviors for clients that use Okta. For_**\n**_more information on the Okta incident, please visit_** **_[their blog. Trustwave does not use](https://www.okta.com/blog/2022/03/updated-okta-statement-on-lapsus/)_**\n**_Okta._**\n\n**_Actionable security recommendations for organizations can be found below._** **_Join our_**\n**_[threat briefing on Monday, March 28 for additional insights and recommendations](https://www2.trustwave.com/trustwave-webinar-lapsus-threat-to-supply-chain-registration-page.html)_**\n**_from Trustwave SpiderLabs._**\n\nLapsus$ is the breakout cybercriminal gang making government entities and organizations in\nmanufacturing, higher education, energy, retailers, and healthcare around the world question\nwhether they could be the victim of a cyberattack.\n\n\n-----\n\nThe new and unique Lapsus$ cyber gang (or DEV-0537 as they are tracked by Microsoft)\nappears to be following a very different path – from the group’s communications to its tactics\nand techniques – compared to well-known groups like Conti, REvil and DarkSide.\n\n## The Rise to Infamy\n\nThe Lapsus$ hacker group began operations in late 2021 when the gang began targeting\norganizations in the Western hemisphere. These targets included Brazil’s health ministry,\nSouth American telecom companies, and Brazilian car rental services.\n\nWhile Lapsus$ is reportedly loosely formed, the gang was able to effectively attack additional\n[South American organizations before graduating to hacking telecom giant Vodafone, video](https://www.bleepingcomputer.com/news/security/vodafone-portugal-4g-and-5g-services-down-after-cyberattack/)\n[game developer Ubisoft, tech icon](https://www.bleepingcomputer.com/news/security/ubisoft-confirms-cyber-security-incident-resets-staff-passwords/) [Samsung, and chipmaker NVIDIA.](https://www.forbes.com/sites/daveywinder/2022/03/08/samsung-confirms-massive-galaxy-hack-after-190gb-data-torrent-shared-via-telegram/?sh=115c127b658c)\n\nLapsus$ most recently made headlines for allegedly exfiltrating source code data from LG\nElectronics and [Microsoft – while most notably claiming to have had access to a ‘super user’](https://www.tomshardware.com/news/microsoft-investigating-possible-azuredevops-intrusion)\n[account of identity access management provider Okta.](https://www.cnn.com/2022/03/22/tech/okta-report-of-breach/index.html)\n\n\n-----\n\nMicrosoft confirmed no customer code or data was involved in the observed activities of\nLapsus$. Their investigation found a single account had been compromised, granting limited\naccess.\n\n[Okta has stated the access Lapsus$ claimed was part of a January 2022 security incident](https://www.okta.com/blog/2022/03/updated-okta-statement-on-lapsus/)\n[that has since been resolved. The hacker group has responded – sharing how it believed the](https://www.bleepingcomputer.com/news/security/okta-confirms-support-engineers-laptop-was-hacked-in-january/)\nattack was a success and alleging Okta has downplayed the effectiveness of the breach.\n\nOn March 24, the [BBC reported that City of London Police arrested seven people between](https://www.bbc.com/news/technology-60864283)\nthe ages of 16 and 21 in connection with an investigation into a hacking group. According to\nthe BBC, the police did not name the group, but the news agency cited cybersecurity\nresearchers and fellow hackers who say at least one of those arrested is associated with\nLapsus$.\n\n## Lapsus$ Communication Behavior: Constant Contact With Their Community\n\nLapsus$ is communicating with its ‘audience’ mainly via Telegram Channel and a chat room.\nThe main channel names spotted are \"minsaude,\" \"minsaudebr,\" \"minsaudebrnews,\" and\n\"saudechat.\" The word “Saude” translates from Portuguese as “Health!”\n\nThe group frequently looks to engage with members of its Telegram channel – even putting\ntheir next data leak up for a member poll. They also like to ‘tease’ information out – “Get\n\nready!!! Samsung data coming today.”\n\nLapsus$ also likes to let people know when it has interested buyers. However, confirming\nthis type of information is not always possible.\n\n\n-----\n\n## Motivations: If Not Money, Hacker Clout?\n\nAt this time, it is not known whether Lapsus$ has successfully monetized any of the attacks it\nhas executed. There is a strong indication that money isn’t the group’s primary goal. Instead,\nit appears more preoccupied with being in the spotlight for its extortion tactics, and the group\nfeels more like a modern incarnation of [LulzSec than](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/latest-web-hacking-incident-database-whid-entries/) [REvil.](https://www.trustwave.com/en-us/resources/blogs/trustwave-blog/russias-fsb-takes-down-revil-cyber-gang-in-an-unprecedented-series-of-raids/)\n\nHowever, some of the group's posts do imply that financial gain is a desired outcome, but at\nthe same time it is not using the tactics of a traditional ransomware gang. The group does\nleverage extortion tactics in an effort to get what it wants. In one post, Lapsus$ threatened to\npublicly release some of the data it claims to have exfiltrated from NVIDIA unless the\ncompany removed a feature known as LHR, short for \"Lite Hash Rate,\" from its graphics\ncards – which blocks crypto mining on graphics cards – according to [ARS Technica.](https://arstechnica.com/information-technology/2022/03/cybercriminals-who-breached-nvidia-issue-one-of-the-most-unusual-demands-ever/)\n\nLapsus$’s demand for NVIDIA to remove mining restrictions from its hardware is likely more\nof an attempt to ingratiate themselves with the run-of-the-mill hacker and crypto community.\nMany in those communities see NVIDIA's restrictions as improperly leveraging its power to\nhalt crypto-mining.\n\nTrustwave SpiderLabs observed a post where Lapsus$ advertised the sale of an LHR\nbypass for $1 million. The unusually high price reflects the potential financial opportunities\nthat an LHR bypass could provide to hackers who purchase the bypass, at least according to\nthe group's statement.\n\n\n-----\n\nThe essentially public communication efforts made by Lapsus$ are gaining the group\nheadlines, but as we've seen with many similar groups in the past, a high profile also means\na big target on your back.\n\nBut the threat of cyberattack from Russia could be the perfect diversion for groups like\nLapsus$ to continue to grow and execute successful attacks.\n\n## Lapsus$ Offers to Pay Insiders for Access to Digital Supply Chain Leaders\n\nAnother interesting tactic from Lapsus$ is its very public call for insider assistance. To\nshortcut the process of obtaining VPN (virtual private network) and virtual desktop\ninfrastructure (VDI) information needed to gain entry to its victims, the threat group simply\nposted a request on its Telegram channel stating it is willing to pay for access. The\nadvertisement also indicated which organizations it may be targeting in the future.\n\n[Paying for insider information is a tried and trusted hacker tactic, and threat actors are often](https://www.trustwave.com/en-us/resources/blogs/trustwave-blog/is-your-organization-prepared-for-an-insider-threat/)\nable to pay someone several times their usual salary for access.\n\nIn its advertisement Lapsus$ said it was looking for employees from major technology\norganizations like Microsoft, Apple, IBM and Electronic Arts, alongside telcos such as Claro,\nTelefonica and AT&T, call centers and server hosts.\n\nOf note, most of these organizations are deeply rooted in the digital supply chain.\n\n\n-----\n\nIn the end, it’s hard to get a handle on how widespread the true insider threat is. Although\nhaving someone \"on the inside\" makes the process of gaining an initial foothold and\nperforming reconnaissance easier, finding an insider that has the access you need, is IT\nsavvy, and whom they can trust to risk it all to commit a crime could prove to be difficult.\n\n## Tactics and Techniques Reportedly Used by Lapsus$\n\n[Per Microsoft, the threat actors gain initial access using the following methods:](https://www.microsoft.com/security/blog/2022/03/22/dev-0537-criminal-actor-targeting-organizations-for-data-exfiltration-and-destruction/)\n\nDeploying the malicious Redline password stealer to obtain passwords and session\ntokens.\nPurchasing credentials and session tokens on underground criminal forums.\nPaying employees at targeted organizations (or suppliers/business partners) for access\nto credentials and MFA approval.\nSearching public code repositories for exposed credentials.\n\nFrom that foothold, the group expands its access via virtual private network (VPN), remote\ndesktop protocol (RDP), Virtual Desktop Infrastructure (VDI) including Citrix, or Identity\nproviders (including Azure Active Directory and Okta) and collect high-valued data to use for\nextortion.\n\n\n-----\n\nMicrosoft has observed instances where the group successfully gained access to\norganizations through recruited employees.\n\nAccording to Microsoft, once Lapsus$ obtained access to the target network using the\ncompromised account, it used multiple tactics to discover additional credentials or intrusion\npoints to extend their access including:\n\nExploiting unpatched vulnerabilities on internally accessible servers including JIRA,\nGitlab, and Confluence\nSearching code repositories and collaboration platforms for exposed credentials and\nsecrets.\n\nLapsus$ has also been reported to use social engineering techniques via phone – reaching\nout to support centers at organizations in an attempt to reset a privileged account’s login\ncredentials. They’ve reportedly answered common recovery prompts such as “first street you\nlived on” or “mother’s maiden name” to convince helpdesk personnel of authenticity.\n\nBecause helpdesks are frequently outsourced, this can be a weak point in supply chain\nsecurity.\n\nOverall, Lapsus$ appears to be following a path that differs from conventional cyber gangs –\nopting for exfiltration, destruction and extortion techniques over ransomware.\n\nAs more organizations comment on their breaches, we likely will obtain more information.\n\n## Defend and Protect Against Lapsus$ - Hardening the Digital Supply Chain\n\nIf you’re an organization that provides software that is used at scale by numerous other\norganizations, you are part of the digital supply chain. These types of organizations need to\nremain extra vigilant during this time. The cyber fundamentals are especially critical during\nthis time of Lapsus$ and the threat of nation-state hackers.\n\nTrustwave will continue to monitor the threat Lapsus$ poses as more intel becomes available\nand respond accordingly for its clients.\n\nRemember, threat actors – whether a hacker group or a nation-state affiliated – are always\nlooking for the path of least resistance and companies that are susceptible to breach due to\nnot executing the cyber basics.\n\n## Ensure your organization is executing these cyber fundamentals:\n\nOperate under an assume-breach mindset.\nEnsure that cybersecurity/IT personnel focus on identifying, detecting, assessing and\nresponding to any unexpected or unusual network behavior.\n\n\n-----\n\nConduct proactive [threat hunting to ensure unknown threats are not lurking within your](https://www.trustwave.com/en-us/services/managed-detection-and-response/proactive-threat-hunting/)\nenvironment.\nConduct an [asset audit focusing on assets that have external access; eliminate stale](https://www.trustwave.com/en-us/services/database-security/appdetectivepro/)\naccounts and check privileged access.\nConduct a [third-party vendor / supply chain assessment. Focus on those places](https://www.trustwave.com/en-us/resources/library/documents/managed-vendor-risk-assessment/)\nwhere [third parties have access to your environment. Ensure no old entry points are left](https://www.trustwave.com/en-us/resources/blogs/trustwave-blog/supply-chain-risk-preparedness/)\nopen.\nInstitute multi-factor authentication (MFA) for internal and external users. Check that\npasswords are strong.\nBring your workers to a higher state of alert, tell them to triple check links and\nattachments in emails before clicking to guard against [phishing attacks.](https://www.trustwave.com/en-us/resources/library/documents/trustwave-mailmarshal-secure-email-gateway/)\nDeploy an effective endpoint detection and response (EDR) solution.\n[Conduct crisis simulations to ensure all parts of your organization are prepared to](https://www.trustwave.com/en-us/resources/blogs/trustwave-blog/crisis-simulation-the-4-most-common-cybersecurity-incident-shortfalls/)\nrespond to a major cyber event, not just IT staff.\nReward employees for reporting if a suspicious contact reaches out asking for access\n\n## Tips to harden your defenses against potential insider threats:\n\nInstitute strong authentication and passwords measures; practice least-privileged\naccess.\nImplement specific insider threat solutions: data loss prevention (DLP), user and entity\nbehavior analysis (UEBA).\nLimit employee access to the minimum necessary and routinely review this access and\nmake updates as roles change or people leave the company.\nPractice good encryption hygiene.\nDon’t forget about physical security at the office (key cards, ID badges, unattended\nequipment, etc.).\nEnsure you have strong data access, use, and exfiltration policies in place.\nRoutinely review software that is installed on employees' computers and look for\nunauthorized installations of software such as AnyDesk.\nUtilize an IDS or IPS (intrusion detection system, or intrusion prevention system) with\nanomaly detection features to detect if your employee is connecting remotely (or\nbehaving oddly).\nUtilize database protection and monitoring tools to detect anomalies and flag\nsuspicious activities or requests that violate policies.\nWork closely with your HR department to ensure there are culture policies in place that\nemployee satisfaction doesn’t deteriorate.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-23 - Trustwave’s Action Response- The Lapsus$ Hacker Group Shows Us the Importance of Securing the Digital Supply Chain.pdf"
    ],
    "report_names": [
        "2022-03-23 - Trustwave’s Action Response- The Lapsus$ Hacker Group Shows Us the Importance of Securing the Digital Supply Chain.pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535786,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1662026938,
    "ts_modification_date": 1662026938,
    "files": {
        "pdf": "https://archive.orkl.eu/bc895228f9f2579a25d3e5d318fca903771f5056.pdf",
        "text": "https://archive.orkl.eu/bc895228f9f2579a25d3e5d318fca903771f5056.txt",
        "img": "https://archive.orkl.eu/bc895228f9f2579a25d3e5d318fca903771f5056.jpg"
    }
}