{
    "id": "312df6f1-b432-4343-9c7d-b417406aa369",
    "created_at": "2022-10-25T16:48:14.704292Z",
    "updated_at": "2025-03-27T02:14:39.102439Z",
    "deleted_at": null,
    "sha1_hash": "e374781848bd51add20e73f9dab3e0559e4db342",
    "title": "2016-06-06 - Everyone sees not what they want to see",
    "authors": "",
    "file_creation_date": "2018-10-18T10:22:45Z",
    "file_modification_date": "2018-10-18T10:22:48Z",
    "file_size": 7935215,
    "plain_text": "# GREYENERGY\n## A successor to BlackEnergy\n\n\n-----\n\n### CONTENTS\n\nINTRODUCTION .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 2\n\nGREYENERGY MODUS OPERANDI  .   .   .   .   .   .   .   .   .   .   .   3\n\nGREYENERGY MINI .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 4\n\nGREYENERGY MALWARE .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 7\n\nIn-memory-only mode .   .   .   .   .   .   .   .   .   .   .   .   .   .  8\n\nService DLL persistence .   .   .   .   .   .   .   .   .   .   .   .   .   .  8\n\nConfiguration and communication  .   .   .   .   .   .   .   .   .   . 11\n\nGreyEnergy modules  .   .   .   .   .   .   .   .   .   .   .   .   .   .   14\n\nAnti-reversing and anti-forensics techniques  .   .   .   .   .   .  15\n\nTOOLS  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 17\n\nWEB SERVER BACKDOORS .   .   .   .   .   .   .   .   .   .   .   .   .   . 17\n\nPROXY C&C (AKA TRIUNGULIN)  .   .   .   .   .   .   .   .   .   .   .   . 18\n\nINTERNET FACING C&C SERVERS .   .   .   .   .   .   .   .   .   .   .  20\n\nGREYENERGY AND BLACKENERGY COMPARISON .   .   .   .   .   . 21\n\nMOONRAKER PETYA .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 21\n\nCONCLUSION .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   24\n\nIOCS .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   25\n\nESET Detection names  .   .   .   .   .   .   .   .   .   .   .   .   .   . 25\n\nGreyEnergy document .   .   .   .   .   .   .   .   .   .   .   .   .   .  25\n\nGreyEnergy mini .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  26\n\nGreyEnergy droppers .   .   .   .   .   .   .   .   .   .   .   .   .   .   26\n\nGreyEnergy dropped DLLs .   .   .   .   .   .   .   .   .   .   .   .   . 26\n\n\u0007GreyEnergy in-memory-only DLLs  .   .   .   .   .   .   .   .   .   . 27\n\nMoonraker Petya .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 27\n\nPHP and ASP scripts  .   .   .   .   .   .   .   .   .   .   .   .   .   .   . 27\n\nCustom port scanner .   .   .   .   .   .   .   .   .   .   .   .   .   .   28\n\nMimikatz  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   28\n\nWinExe  .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .   .  28\n\nGreyEnergy mini C&C addresses .   .   .   .   .   .   .   .   .   .   . 28\n\nGreyEnergy C&C addresses .   .   .   .   .   .   .   .   .   .   .   .   29\n\n\n-----\n\nESET researchers have discovered and analyzed advanced malware, previously undocumented, that\n\nhas been used in targeted attacks against critical infrastructure organizations in Central and Eastern\n\nEurope. The malware, named GreyEnergy by ESET researchers, exhibits many conceptual similarities with\n\n[BlackEnergy, the malware used in attacks against the Ukrainian energy industry in December 2015. Besides](https://www.welivesecurity.com/2016/01/03/blackenergy-sshbeardoor-details-2015-attacks-ukrainian-news-media-electric-industry/)\n\nthese similarities, there are links that suggest that the group behind GreyEnergy has been working\n\ntogether with the TeleBots group, known in connection with many destructive attacks.\n\nThis report reveals the activities of the GreyEnergy group over the past few years.\n\n### INTRODUCTION\n\nIn December 2015, the BlackEnergy group mounted an attack against the Ukrainian energy industry\n\nusing the BlackEnergy and KillDisk malware families. That was the last known use of the BlackEnergy\n\nmalware in the wild. Following this attack, the BlackEnergy group evolved into at least two subgroups:\n\nTeleBots and GreyEnergy.\n\nThe main goal of the TeleBots group is to perform cybersabotage attacks on Ukraine, which are\n\nachieved through computer network attack (CNA) operations. The group performed a number of such\n\ndisruptive attacks, including:\n\n- [A series of attacks in December 2016 using an updated version of the KillDisk malware designed for](https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/)\n\n[Windows and Linux OSes](https://www.welivesecurity.com/2017/01/05/killdisk-now-targeting-linux-demands-250k-ransom-cant-decrypt/)\n\n- [The notorious NotPetya attack of June 2017, performed using a sophisticated backdoor that was](https://www.welivesecurity.com/2017/06/30/telebots-back-supply-chain-attacks-against-ukraine/)\n\nembedded into the Ukrainian accounting software M.E.Doc\n\n- [The attack using the BadRabbit family in October 2017.](https://www.welivesecurity.com/2017/10/24/bad-rabbit-not-petya-back/)\n\nESET researchers have been tracking the activities of the GreyEnergy group for several years. The group\n\nis using a unique family of malware that we detect as GreyEnergy. The design and architecture of the\n\nmalware are very similar to those of the BlackEnergy malware.\n\nBesides the conceptual similarities in the malware itself, there are links that suggest that the group\n\nbehind the GreyEnergy malware has been working closely with the TeleBots group. Specifically, the\n\nGreyEnergy group deployed a NotPetya-like worm in December 2016, and a more advanced version of\n\nthis malware was used later by the TeleBots group in the notorious June 2017 attack.\n\nWe should say the GreyEnergy group has different goals than the TeleBots group: this group is mostly\n\ninterested in industrial networks belonging to various critical infrastructure organizations and unlike\n\nTeleBots, the GreyEnergy group is not limited to Ukrainian targets.\n\nIn late 2015, we first spotted the GreyEnergy malware targeting an energy company in Poland. Still, as\n\nwith BlackEnergy and TeleBots, the group’s main focus has been on Ukraine. They have primarily shown\n\ninterest in the energy sector, followed by transportation and other high-value targets. At least one\n\norganization that had previously been targeted by BlackEnergy has more recently been under attack by\n\nGreyEnergy. The most recently observed use of the GreyEnergy malware was in mid-2018.\n\n[The GreyEnergy malware is modular, but unlike Industroyer, we have not seen GreyEnergy incorporate](https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/)\n\nany module capable of affecting industrial control systems (ICS). However, the operators of this\n\nmalware have, on at least one occasion, deployed a disk-wiping component to disrupt operating\n\nprocesses in the affected organization and to cover their tracks.\n\nOne of the most intriguing details discovered during our research is that one of the GreyEnergy samples\n\nwe found was signed with a valid digital certificate that had likely been stolen from a Taiwanese\n\ncompany that produces ICS equipment. In this respect, the GreyEnergy group has literally followed in\n\n_[Stuxnet’s footsteps.](https://www.welivesecurity.com/2010/07/22/a-few-facts-about-win32stuxnet-cve-2010-2568/)_\n\n\n-----\n\n### GREYENERGY MODUS OPERANDI\n\nDuring our tracking of the GreyEnergy group’s activity, we have mostly seen the attackers use two\n\ninitial infection vectors. The first one is relevant for organizations with self-hosted web services. If such\n\na public-facing web service is running on a server that is connected to an internal network, attackers\n\nwill try to compromise it and then sneak inside the network. The second infection vector is the use of\n\nspearphishing emails with malicious attachments.\n\nWe have observed that malicious documents have been dropping “GreyEnergy mini”, a lightweight\n\nfirst-stage backdoor that does not require administrative privileges. After compromising a computer\n\nwith GreyEnergy mini, attackers map the network and collect passwords in order to obtain domain\n\nadministrator privileges. With these privileges, the attackers can control the whole network. The\n\nGreyEnergy group uses fairly standard tools for these tasks: Nmap and Mimikatz.\n\nOnce attackers are done with the initial network mapping, they can deploy their flagship backdoor –\n\nthe main GreyEnergy malware. This malware requires administrator privileges, which must already have\n\nbeen obtained before this stage is reached. According to our research, the GreyEnergy actors deploy this\n\nbackdoor mainly on two types of endpoints: servers with high uptime, and workstations used to control\n\nICS environments.\n\nTo make communication with command and control (C&C) servers stealthier, the malicious actors may\n\ndeploy additional software on internal servers in the compromised network, so each server would act\n\nas a proxy. Such a proxy C&C redirects requests from infected nodes inside the network to an external\n\nC&C server on the internet. This way, it might be less suspicious to a defender who notices that multiple\n\ncomputers are “talking” to an internal server, rather than to a remote server. This technique can be also\n\nused by attackers to control the malware in different segments of a compromised network. A similar\n\n[technique using internal servers as C&C proxies was used by the Duqu 2.0 APT.](https://securelist.com/the-mystery-of-duqu-2-0-a-sophisticated-cyberespionage-actor-returns/70504/)\n\nIf an affected organization has public-facing web servers connected to an internal network, the\n\nattackers may deploy “backup” backdoors onto these servers. These backdoors are used to regain access\n\nto the network in the event that the main backdoors are detected and removed.\n\nAll C&C servers we have seen used by the GreyEnergy malware have been Tor relays.\n\nFigure 1. // Simplified scheme of the two network compromise scenarios used by the GreyEnergy group\n\n\n-----\n\n### GREYENERGY MINI\n\nGreyEnergy mini is a lightweight first-stage backdoor that is used by attackers in order to evaluate a\n\ncompromised computer and gain an initial foothold in the network. Usually GreyEnergy mini malware is\n\ndownloaded by a malicious document that was delivered using spearphishing email. GreyEnergy mini is\n\n[also known as FELIXROOT.](https://www.fireeye.com/blog/threat-research/2018/07/microsoft-office-vulnerabilities-used-to-distribute-felixroot-backdoor.html)\n\nIn September 2017 ESET detected a Microsoft Word decoy document in the Ukrainian language, carrying\n\na malicious macro. The decoy document was designed to look like an interactive form, prompting the\n\nvictim to enable macros in order to fill it in.\n\nFigure 2. // Decoy document used by GreyEnergy group in September 2017\n\nOnce the macro is enabled, its code attempts to download and execute a binary from a remote server.\n\nFigure 3 // Malicious VBA macro (comments added by ESET)\n\n\n-----\n\nInterestingly, that document has, embedded in its body, a link that points to a remote picture. Once the\n\ndocument is opened, it makes an attempt to download that picture. Therefore, attackers are notified\n\nwhen the document is opened. This technique allows tracking a success ratio between targets who\n\nenabled the malicious macro versus those who just opened the document without enabling macros.\n\nFigure 4. // A link to an external “tracker” image in the malicious document\n\nThe downloaded executable is a GreyEnergy mini dropper. The dropper writes a malicious DLL in the\n```\n%APPDATA% folder using a randomly generated GUID as its name. In addition, the dropper creates a\n.LNK file, using a blank filename, in the Startup folder in the Start Menu with an entry that executes\nrundll32.exe with the path to the DLL as a command line argument. This is the persistence method\n\n```\nused by GreyEnergy mini.\n\nThis dropped DLL is the main module of GreyEnergy mini; it is disguised as a legitimate file that belongs\n\nto Microsoft Windows.\n\nFigure 5. // The GreyEnergy mini DLL disguised as a legitimate Windows DLL\n\nIn order to assess the value of a compromised computer, the malware collects as much information as\n\npossible and sends the collected data to the C&C. The information collection is performed using WMI\n\nQuery Language (WQL) and queries to the Windows registry. The following information is collected:\n\n- Computer name\n\n- Operating system version, including service pack version\n\n- Default locale\n\n- Username\n\n- Current Windows user privileges, elevation, UAC level\n\n- Proxy settings\n\n- Information about computer (manufacturer, model, system type)\n\n- Time zone\n\n- Installed security software (antivirus and firewall)\n\n\n-----\n\n- List of users and domains\n\n- List of installed software obtained from registry\n\n- Information about network (IP addresses, DHCP Server, etc.)\n\n- List of running processes\n\nThe malware receives commands from a C&C server. The following commands are supported:\n\n\nCommand ID Meaning\n\n\n1 Collect information about computer\n\n2 Download and run executable file from temporary directory\n\n3 Run shell command\n\n4 Uninstall itself from compromised computer\n\n5 Download and run .BAT file from temporary directory\n\n6 Download file to local drive\n\n7 Upload file\n\nThe configuration of the malware is embedded, in JSON format, inside the binary and is encoded with\n\na custom algorithm. The encrypted data contains four bytes at the beginning; these bytes are used as\n\nthe key for an XOR operation to decrypt the rest of the data. Most strings used by the malware are\n\nencrypted using this algorithm.\n\nFigure 6. // The embedded configuration of GreyEnergy mini malware before and after decryption\n\nAll GreyEnergy mini configurations we have seen contain HTTPS and HTTP servers used as C&Cs. This\n\nallows attackers to switch to HTTP on targets where HTTPS is not allowed by network or firewall\n\nconfigurations.\n\nThe GreyEnergy mini malware shares code similarities with other GreyEnergy malware. In addition to\n\nthat, both GreyEnergy mini and the main GreyEnergy backdoor shared exactly the same C&C servers.\n\n\n-----\n\n### GREYENERGY MALWARE\n\nThe GreyEnergy malware is the flagship backdoor of the GreyEnergy group. The malware samples\n\nanalyzed here are written in C and compiled using Visual Studio, but without using the standard C\n\nrun-time libraries (CRT) functions. Packed samples may contain a forged PE timestamp, but once the\n\nsamples are unpacked, the PE timestamp is zero (representing 1 January, 1970).\n\nFigure 7. // The PE timestamp of an unpacked GreyEnergy sample\n\nInterestingly, one of the first GreyEnergy malware samples analyzed was digitally-signed with a code\nsigning certificate belonging to a company named Advantech. Advantech is a Taiwanese company that\n\nproduces industrial equipment and IoT hardware. Since we discovered that exactly the same certificate\n\nwas used to sign clean, non-malicious software from Advantech, we believe that this certificate was\n\nlikely stolen. It is worth noting that the discovered sample does not have countersignatures, which\n\nmeans that the digital signature became invalid once the certificate’s validity period had expired.\n\nFigure 8. // Advantech code-signing certificate used to sign a GreyEnergy malware sample\n\n\n-----\n\nThe certificate data are as follows:\n```\nSerial Number: 15:f4:8f:98:c5:79:41:00:6f:4c:9a:63:9b:f3:c1:cc\n\nValidity:\n\n      Not Before: Feb 10 00:00:00 2014 GMT\n\n      Not After : Feb 26 23:59:59 2017 GMT\n\nSHA1 Fingerprint=97:53:AD:54:DF:6B:D6:73:E0:6C:00:36:3D:34:6A:06:00:7A:0A:9B\n\n```\nWe observed that the GreyEnergy malware is usually deployed in two modes: in-memory-only mode,\n\nand using Service DLL persistence. The former mode is used when attackers are confident that malware\n\ndeployment does not require any persistence at all (e.g. servers with high uptime); the latter mode is\n\nused when the malware needs to be able to survive any possible reboot.\n\n#### In-memory-only mode\n\nFor the in-memory-only mode, attackers put a DLL file in a specific folder and then execute it using the\n\nWindows application rundll32.exe. We have seen that the attackers are using Windows Sysinternals\n\nPsExec tool locally in order to execute rundll32.exe under the highest possible privileges (NT\n```\nAUTHORITY\\SYSTEM).\n\n```\nHere is an actual command line used in the initial stage of GreyEnergy’s in-memory-only execution:\n```\ncmd.exe /c “C:\\Windows\\System32\\rundll32.exe “C:\\Sun\\Thumbs.db”,#1\nCAIAABBmAAAgAAAA8GFGvkHVGDtGRqcl3Z3nYJ9aXCm7TVZX8klEdjacOSU=”\n\n```\nIn this example, Thumbs.db represents a GreyEnergy DLL file, of which the function with the first\n\nordinal is called by the rundll32.exe process. The supplied command line parameter contains\n\na base64-encoded sequence of bytes that is later used as an AES-256 key to decrypt a small stub.\n\nAfterwards, the code in the stub launches a new instance of the svchost.exe process and injects a\n\nGreyEnergy payload there. In the final step, the GreyEnergy rundll32.exe process is terminated and\n\nthe malicious DLL file is secure-wiped from the disk. The GreyEnergy payload would therefore exist only\n\nin the context of its svchost.exe’s process memory.\n\nApparently, the malware authors’ intention was to design the malware in such a way that without\n\nhaving the key provided on the command line, it is impossible to decrypt the stub and payload.\n\nFigure 9. // An internal name of GreyEnergy DLL for in-memory-only mode\n\nIf the in-memory-only mode is used, terminating the corresponding svchost.exe process or rebooting\n\nthe computer is enough to remove the GreyEnergy malware.\n\n#### Service DLL persistence\n\nTo use this method, the malware operators deploy a GreyEnergy dropper, which must be executed\n\nunder administrator privileges.\n\nThe ServiceDLL registry key is a feature that allows starting a service DLL module in the context of the\n```\nsvchost.exe process. This feature is not well documented by Microsoft; however, it has been used by a\n\n```\nnumber of malware families, including the prolific Conficker worm.\n\n\n-----\n\nFor service DLL persistence, the malware dropper finds an already existing service and adds a new\n\nServiceDLL registry key. Since using this method could break the system, the dropper first performs a\n\nseries of checks in order to pick a service that fulfills many requirements.\n\nFirst, the dropper enumerates all Windows services that are currently stopped, by executing the\n\nfollowing WQL query:\n```\nSelect * from Win32_Service where PathName Like ‘%%svchost%%’ and State =\n‘Stopped’\n\n```\nThe following conditions can be added to the query:\n```\nand StartMode = ‘Disabled’ or and StartMode = ‘Manual’\nand ServiceType = ‘Own Process’ or and ServiceType = ‘Share Process’\n\n```\nNext, the dropper tries to pick the right service by enumerating the results and skipping those that\n\nmatch the following conditions:\n\n- Service name contains winmgmt (Windows Management Instrumentation) or BITS (Background\n\nIntelligent Transfer Service)\n\n- The dropper does not have access to the service or the registry key\n\n- The DependOnService registry value is not empty\n\n- A registry value does not exist for ServiceDll or ImagePath\n\n- The service’s command line contains one of these words:\n\n - DcomLaunch, LocalServiceNetworkRestricted, LocalServiceNoNetwork,\n```\n  LocalServicePeerNet, LocalSystemNetworkRestricted,\n  NetworkServiceNetworkRestricted, secsvcs, wcssvc\n\n```\nOnce a service is found that satisfies these conditions, the malware drops a DLL file into the system32\n\ndirectory of Windows and writes the ServiceDLL registry key. The name of the DLL contains four\n\nrandomly generated characters and svc.dll or srv.dll at the end. In addition, the dropper forges the\n\nfile’s time metadata by copying it from the existing user32.dll file.\n\nThe latest version of the GreyEnergy dropper supports both 32- and 64-bit operating systems.\n\n\n-----\n\nFigure 10. // The GreyEnergy DLL deployed using the Service DLL persistence method\n\nThe dropper uses an interesting trick to disguise the malicious DLL as a legitimate file. Specifically, the\n\ndropper makes a copy of the VERSIONINFO resource, which contains a detailed file description from\n\nthe executable that belongs to the original Windows service, and writes this data into the malicious\n\nDLL. It’s done by using the BeginUpdateResource/UpdateResource/EndUpdateResource Windows\n\nAPI functions The latest versions don’t call these functions from the API; their code is implemented in\n\nthe malware itself, in order to avoid dropping the DLL file onto the disk without the fake VERSIONINFO\n\nresource, presumably to evade detection by some security product. The same dropper could create\n\nmalicious DLL files with different descriptions on different computers. Each sample deployed in this way\n\nwill have a unique hash.\n\nIf the malware is already present on the system, then the dropper can update it using a named pipe.\n\nIn the final step, the dropper deletes itself securely, by overwriting the file with zeros and removing the\n\n[file from the disk. In addition, the dropper cleans the USN journal. All these actions are performed by](https://en.wikipedia.org/wiki/USN_Journal)\n\nexecuting the following shell command:\n\ntimeout 2 > nul & fsutil file setzerodata offset=0 length=%DROPPER_FILESIZE%\n```\n“%DROPPER_PATH%” & timeout 2 & cmd /c del /F /Q “%DROPPER_PATH%” & fsutil usn\ndeletejournal /D %DROPPER_DRIVE%\n\n```\n\n-----\n\n#### Configuration and communication\n\nThe persistence mode selected by the operators does not affect the functionality of the malware, which\n\nremains the same in both methods.\n\nThe malware contains an embedded configuration that is encrypted using the AES-256 algorithm and\n\ncompressed using the LZNT1 algorithm.\n\nMIME multipart format is used for the malware’s embedded configuration. The malware authors didn’t\n\n[implement their own parser for this format; instead they use the IMimeMessage and IMimeBody COM](https://docs.microsoft.com/en-us/previous-versions/windows/desktop/oe/oe-imimemessagetree)\n\ninterfaces. Interestingly, Microsoft’s documentation recommends not using these interfaces.\n\nFigure 11. // Example of embedded GreyEnergy configuration\n\n\n-----\n\nAn identical MIME format is used for external configuration; however, the malware encrypts the\n\nexternal configuration differently. The malware uses the Data Protection application programming\n\ninterface (DPAPI) — specifically the CryptProtectData and CryptUnprotectData Windows API\n\nfunctions. The external configuration is stored in the following path C:\\ProgramData\\Microsoft\\\n```\nWindows\\%GUID%, where %GUID% is a randomly generated GUID value.\n\n```\nSome GreyEnergy samples contain a bit-obfuscated version of the configuration. Specifically, such a\n\nconfigurations Type fields contain letters instead of configuration option names.\n\nFigure 12. // Example of an obfuscated GreyEnergy configuration\n\nThe configuration may contain the following values:\n\n\nConfiguration option Obfuscated name Meaning\n\n\nList of C&C servers (this value can be encoded\nType: ServerUrls Type: D\n\nusing base64)\n\nUser D1\n\nPassword D2\n\nAccess D3 1 – Don’t use Proxy, 3 – Use proxy\n\nList of proxy servers (this value can be encoded\nType: ServerProxies Type: E\n\nusing base64)\n\nProxyType E1 Not used\n\nType: Client Type: F Hexadecimal Campaign ID\n\n\nTime out in minutes between requests to C&C\nSleep F1\n\nservers\n\nTime out in minutes between requests to C&C\nFSleep F2\n\nservers (in case of failed connection)\n\nF3 Not used\n\nNumber of days the malware can tolerate with no\nLifetime F4\n\nsuccessful connection to C&C servers\n\n\nThe high-order part of the time of the last\nLastrequestH F5\n\nsuccessful connection to C&C servers\n\nThe low-order part of the time of the last\nLastrequestL F6\n\nsuccessful connection to C&C servers\n\n\nNumber of attempts to send requests to C&C\nAttempts F7\n\nservers\n\nNumber maximum attempts to send request to\nMaxAttempts F8\n\nC&C servers\n\n\n-----\n\nThe malware deletes itself from the compromised computer if the number of failed connection attempts\n\nis greater than the MaxAttempts value and the last successful connection was more than Lifetime\n\ndays ago.\n\nC&C communication is usually over HTTPS; however, in some cases HTTP is used also. The same MIME\n\nformat is encapsulated in HTTP requests. However, it should be noted that the data are encrypted using\n\nAES-256 and RSA-2048.\n\nFigure 13. // GreyEnergy communication over HTTP, captured in Wireshark\n\n\n-----\n\nIf HTTP is used, then it’s easier to identify a compromised machine in a network by analyzing its\n\nnetwork traffic. The analyzed malware samples always used the following hardcoded user agents:\n\n- Mozilla/5.0 (Windows NT 6.1; Trident/7.0; rv:11.0) like Gecko\n\n- Mozilla/5.0 (compatible, MSIE 11, Windows NT 6.3; Trident/7.0; rv:11.0) like\n```\n Gecko\n\n```\nTo help the malware operators identify infected computes, the malware sends the results of the\n\nfollowing WQL queries to a C&C server:\n\n- `SELECT Caption, Version, CSName, ProductType, CurrentTimeZone, LocalDateTime,`\n```\n OSLanguage, OSType FROM Win32_OperatingSystem\n\n```\n- `SELECT MACAddress, IPAddress, IPSubnet, DHCPEnabled, DHCPServer, DNSDomain FROM`\n\nWin32_NetworkAdapterConfiguration WHERE MACAddress IS NOT NULL\n\nThe C&C server’s answers are encrypted, but once an answer is decrypted, it contains the same MIME\n\nformat, with the following possible values:\n\n\nCommand Obfuscated name Meaning\n\n\nType: Image Type: A Contains Base64 encoded and compressed binary\n\nVersion A1 Not used\n\nOption A2\n\nName A3 Name of image\n\nContains text of module command and\nType: Command Type: B\n\nparameters\n\nSession B1 Sets token for impersonation\n\nType: Payload Type: C Contains Base64 encoded and compressed binary\n\nPID C1\n\nThe GreyEnergy malware loads additional modules and payloads into memory using its own loader for\n\nPE files.\n\n#### GreyEnergy modules\n\nLike many complex threats, the GreyEnergy malware has a modular architecture. The functionality of\n\nthe malware can be easily extended with additional modules. A GreyEnergy module is a DLL file that\n\ngets executed by calling the function with the first ordinal. Each module, including the main GreyEnergy\n\nmodule, accepts text commands with various parameters.\n\nThe malware operators do not push all modules at once to a compromised machine. The malware\n\nusually downloads and executes modules that are necessary for its current task.\n\nSo far, we are aware of the existence of the following GreyEnergy modules:\n\n\nModule name Purpose\n\n\nremoteprocessexec Injects a PE binary into a remote process\n\ninfo Collects information about system, event logs, SHA-256 of malware\n\nfile File system operations\n\nsshot Grabs screenshots\n\nkeylogger Harvests pressed key strokes\n\npasswords Collects saved passwords from various applications\n\nmimikatz Mimikatz software used to collect Windows credentials\n\nplink Plink software used to create SSH tunnels\n\n3proxy 3proxy software used to create proxies\n\n\n-----\n\nThe remoteprocessexec module allows the attacker to execute arbitrary binaries in the context of\n\nalready existing processes. For example, the attackers can execute Mimikatz or a port scanner in the\n\ncontext of Windows Explorer, without dropping them on the disk. To redirect the standard output and\n\nto handle threads and process termination the module hooks five Windows API functions.\n\nFigure 14. // Windows API functions hooked by the remoteprocessexec module\n\nSince the dropped GreyEnergy DLL is unique for each infected machine, the attackers could collect their\n\nSHA-256 hashes using the info module. Having these hashes would allow the attackers to track whether\n\nthe file was uploaded to one of the public “multi-scanner” web services, such as VirusTotal.\n\n#### Anti-reversing and anti-forensics techniques\n\nGreyEnergy malware implements several tricks to make forensic and malware analysis harder. For one,\n\nthe malware encrypts strings. Some of the variants use the exact same algorithm as GreyEnergy mini.\n\nHowever, most of the GreyEnergy samples use a slightly different encryption algorithm. Specifically, the\n\nfirst four bytes in an encrypted blob are not used as the key for XOR operations. Instead, they are used\n\n[to initialize the seed of a Mersenne Twister pseudorandom number generator (PRNG) algorithm and then](https://en.wikipedia.org/wiki/Mersenne_Twister)\n\nthe generated four bytes are used as the key. Before freeing the memory buffer holding the plaintext\n\nstring, the malware overwrites the buffer with zeros.\n\n\n-----\n\nFigure 15. // Decompiled code of string -decoding function of GreyEnergy malware\n\nThe malware hooks DeleteFileA and DeleteFileW functions in the import table of each PE binary\n\nloaded in memory. The hook replaces these functions with a function that wipes files securely.\n\nSpecifically, the file is overwritten with zeroes before deleting it from the disk. Thus, each payload or\n\nplugin would use such a feature without the malware author’s need to implement it in each module.\n\nFigure 16. // Decompiled code of routine that hooks DeleteFileA and DeleteFileW functions\n\n\n-----\n\n### TOOLS\n\nThe attackers have been using the Nmap port-scanner as their main tool for mapping their victims’\n\ninternal networks. However, we have seen instances where they used a lightweight, custom-made port\n\nscanner when they couldn’t use Nmap.\n\nFigure 17. // Console output of custom port scanner used by GreyEnergy\n\n[The attackers actively use legitimate tools such as SysInternals PsExec and WinExe to perform lateral](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\n\nmovement across a compromised network. The WinExe tool is an open-source equivalent to PsExec, but\n\nit can be controlled from a Linux computer, for example from a compromised Linux web server.\n\nIt is worth mentioning that in addition to these tools, the attackers use a number of PowerShell scripts.\n\n### WEB SERVER BACKDOORS\n\nAs mentioned before, the attackers deploy additional backdoors to web servers if these servers are\n\naccessible from the internet. We observed that the GreyEnergy group tends to use backdoors written\n\nin PHP for these purposes. Specifically, they use publicly available PHP webshells named WSO webshell\n\nand c99shell.\n\nThe attackers can modify an already-existing PHP script on a web server or deploy a new one. The real\n\nPHP code of the backdoor is usually hidden under several layers of obfuscation and encryption.\n\nFigure 18. // Obfuscated code of PHP backdoor used by the GreyEnergy group\n\nThe final layer of code is protected using a stream cipher. A keystream generation of this cipher is based\n\non a string from a cookie value, provided via an HTTP request by the attacker. Each such PHP backdoor\n\nis encrypted with a separate key.\n\n\n-----\n\nFigure 19. // The final layer that decrypts the PHP backdoor code by using a cookie value\n\nThis obfuscation technique is used to prevent analysis and to prevent other cybercriminals from using\n\nthe same php backdoor.\n\n### PROXY C&C (AKA TRIUNGULIN)\n\nAs mentioned before, the attackers can use an internal server as a proxy C&C.\n\nIt is important to note that we have discovered that the attackers have even built chains of proxy C&C\n\nservers, in which the first such server would redirect network traffic to the next proxy C&C and so on,\n\nuntil it reaches its final destination on the internet.\n\nThe attackers use different methods to turn an internal server into a proxy C&C. To do so, the attackers\n\ncould use the GreyEnergy malware itself, additional third-party software, or scripts. In the first case,\n\nthe attackers could compromise a Windows server with the GreyEnergy malware, turning it into a\n\nproxy C&C by pushing 3proxy and plink modules. While monitoring GreyEnergy activity we have seen\n\ndeployment of the following legitimate third-party software on internal Linux servers:\n\n- 3proxy tiny proxy server\n\n- Dante SOCKS server\n\n- PuTTY Link (Plink)\n\nInstead of third-party software, the attackers have leveraged internal webservers by deploying their\n\nown scripts on them. For this, they have used the PHP and ASP programming languages.\n\nIn all the cases we observed, the PHP scripts deployed were obfuscated and encrypted using the same\n\ntype of obfuscation that was used for webserver backdoors. However, in this case the cookie that\n\ncontains a decryption key is supplied by the GreyEnergy malware itself. For that reason, the malware\n\noperators have to use a special configuration format for the ServerUrls value.\n\nFigure 20. // A GreyEnergy configuration containing a cookie value used for decryption of the PHP backdoor code\n\n\n-----\n\n[Interestingly, the malware configuration contains the word triungulin in the path to the obfuscated](https://en.wiktionary.org/wiki/triungulin)\n\nproxy PHP script. It seems that this is an internal name for this proxy C&C technique used by the\n\nmalware operators.\n\nIt is important to note that if the malware has an internal proxy C&C server in its configuration, then it\n\ndoes not contain the external C&C. In order to find an external C&C address it is, therefore, necessary to\n\nhave both a malware sample and all associated PHP scripts.\n\nWe have seen the following PHP scripts used:\n\n- A custom PHP proxy script\n\n- [A slightly modified version of the Antichat Socks5 Server](https://github.com/tennc/webshell/blob/master/xakep-shells/PHP/Antichat Socks5 Server.php.php.txt)\n\nA custom PHP proxy script contains a URL with the external C&C in the header.\n\nFigure 21. // External C&C embedded in custom PHP proxy script\n\nThe custom PHP proxy script uses OpenSSL and Curl libraries in order to redirect requests from the\n\nmalware to an external C&C server on the internet.\n\nFigure 22. // The code of a custom PHP proxy script used by GreyEnergy\n\n\n-----\n\nAs mentioned before, the attackers could use ASP scripts for the same purpose. In one case that we saw,\n\nan ASP script was using a cookie supplied by the malware in order to decrypt only a real C&C address\n\nusing AES: the rest of the code was not encrypted or obfuscated.\n\nFigure 23. // The code of an ASP proxy used by GreyEnergy\n\n### INTERNET FACING C&C SERVERS\n\nAll C&C servers used by the GreyEnergy malware were running Tor relay software when they were\n\nactive. This C&C infrastructure setup is similar to BlackEnergy, TeleBots, and Industroyer, which all used\n\nservers that were Tor relays as well.\n\nIt is likely that each C&C server has an onion address and attackers are using it to access, control or\n\ntransfer data. It seems this is an OPSEC requirement, which adds an additional level of anonymity for\n\nthe attackers.\n\nESET researchers identified the C&C servers used by GreyEnergy malware in the past three years. The\n\nlist is located in the IoCs section of this paper.\n\n\n-----\n\n### GREYENERGY AND BLACKENERGY COMPARISON\n\nThe GreyEnergy and BlackEnergy malware families have a similar design, and a similar set of modules\n\nand features. Although the implementation of these features is different, they are still comparable.\n\n\nBlackEnergy malware GreyEnergy malware\n\n\nModular Yes Yes\n\nPersistence Driver Service DLL registry key\n\nEmbedded configuration format XML MIME multipart\n\nEmbedded configuration contains\n\nYes Yes\ninternal proxies\n\nExternal configuration encryption Modified RC4 DPAPI\n\nUsed compression aPlib LZNT1\n\nMini version persistence .LNK file .LNK file\n\nMini version configuration format X.509 JSON\n\nC&C servers run Tor relay Yes Yes\n\nMost targeted countries Ukraine, Poland Ukraine, Poland\n\n### MOONRAKER PETYA\n\nIn December 2016 the attackers deployed a worm that we believe to have been a predecessor to\n\nNotPetya (also known in as Petya, ExPetr, Nyetya, EternalPetya). This worm was deployed against a\n\nsmall number of targets and had limited spreading capabilities, which is why it wasn’t generally known\n\nto the security research community.\n\nThe worm is a DLL file deployed under the name msvcrt120b.dll in the Windows directory. The\n\n[internal name of the DLL is moonraker.dll, which is possibly a reference to a James Bond movie and](https://en.wikipedia.org/wiki/Moonraker_(film))\n\n_[novel of the same name, hence we named this worm Moonraker Petya.](https://en.wikipedia.org/wiki/Moonraker_(novel))_\n\nFigure 24. // An internal name of the worm deployed in December 2016.\n\nThe PE Timestamp of the DLL suggests that it was compiled in December 2016, probably immediately\n\nbefore deployment.\n\n\n-----\n\nMoonraker Petya contains code that makes the computer unbootable. Specifically, it rewrites the\n```\nImagePath registry value in the [HKEY_LOCAL_MACHINE\\System\\ControlSet001\\Services\\ACPI]\n\n```\nand [HKEY_LOCAL_MACHINE\\System\\ControlSet002\\Services\\ACPI] registry keys and wipes\n\nthe first sector of the system drive. However, unlike NotPetya, Moonraker Petya does not contain code\n\nthat directly interacts with the MBR and bootloader. Instead, the Moonraker Petya DLL contains an\n\nencrypted blob of binary data. The malware expects a command line argument, which will later be\n\nused as a decryption key. After decryption and decompression using the zlib library, this code is loaded\n\ninto memory as a PE binary and executed. We do not have the key for decryption, but we analyzed disk\n\nimages of affected computers. These images contained MBR and bootloader code that exactly matches\n\ncode found in the original Green Petya, which was used by various cybercrime groups. This leads us to\n\nbelieve that this blob may contain the original Green Petya malware.\n\nFigure 25. // The splash screen displayed after reboot on computers affected by Moonraker Petya.\n\nInterestingly, the decryption routine used by Moonraker Petya is very similar to a routine used by\n\nGreyEnergy in-memory-only DLL files.\n\n\n-----\n\nFigure 26. // Comparison of decompiled code of Moonraker Petya (left) and GreyEnergy (right)\n\nMoonraker Petya is able to spread through the local network using SysInternals PsExec. The malware\n\ncontains a zlib-compressed binary of PsExec in its resources. Later this binary is dropped into the\n\nWindows directory with the filename conhost.exe.\n\nThe malware spreads itself in a similar manner to NotPetya: it enumerates network hosts using various\n\nmethods (WNetEnumResourceW, GetIpNetTable, GetExtendedTcpTable, NetServerEnum,\n\nTERMSRV-records using CredEnumerateW), then it connects to a network host using the\n```\nWNetAddConnection2W function and saves the malware as \\\\%TARGET-HOST%\\admin$\\%MALWARE%.\n\n```\nAfterward, Moonraker Petya executes the following command, which starts the malware on the remote\n\ncomputer using the dropped PsExec:\n```\nC:\\Windows\\conhost.exe \\\\%TARGET-HOST% -accepteula -s -d C:\\Windows\\\nSystem32\\rundll32.exe “C:\\Windows\\msvcrt120b.dll”, #1 %TIMEOUT%\n\n```\n“USER1:PASSWORD1;USER2:PASSWORD2” “%DECRYPTIONKEY%”\n\nIt is important to note that the malware does not contain a credential-harvesting functionality using\n\nMimikatz, nor does it contain the EternalBlue exploit.\n\nIn addition to all the functionality already mentioned, Moonraker Petya features file encryption. The\n\nmalware enumerates all files on all fixed drives. After that, it attempts to encrypt them using the AES\n256 encryption algorithm. After the file encryption process has finished the malware may create a\n```\nREADME.txt file with payment instructions.\n\n```\n\n-----\n\nThe payment instruction file contains a personal key encrypted with RSA-2048. In addition, it contains\n\nthe same text and onion addresses as the original Green Petya. It seems that the attackers wanted to\n\ndisguise usage of this malware as a Green Petya attack.\n\nFigure 27. // The Readme file with payment instructions created by Moonraker Petya\n\nAs the final step, Moonraker Petya attempts to reboot the computer.\n\n### CONCLUSION\n\nGreyEnergy is an important part of the arsenal of one of the most dangerous APT groups that has been\n\nterrorizing Ukraine for the past several years. We consider it to be the successor of the BlackEnergy\n\ntoolkit, and have outlined the similarities and differences in this paper. The main reasons for this\n\nconclusion are the similar malware design, specific choice of targeted victims, and modus operandi.\n\nThe transition from BlackEnergy to GreyEnergy happened at the end of 2015 – perhaps because the\n\nattackers needed to update their malware toolset when the BlackEnergy framework became the center\n\nof attention after it was used in the attack against the Ukrainian power grid that year.\n\nAn interesting piece of the puzzle was revealed when we identified the group’s use of Moonraker Petya,\n\nwhich we believe is the predecessor of the destructive NotPetya worm of June 2016. This shows that\n\nthe TeleBots and GreyEnergy subgroups are cooperating, or at least sharing some ideas and code.\n\nNonetheless, we consider them to be distinct groups with slightly different goals. As of this writing, we\n\nhave never seen intentional TeleBots activity outside of Ukraine, but we have seen GreyEnergy – just as\n\nBlackEnergy before it – active outside of Ukraine’s borders.\n\nIt should be noted that we are not attributing this malware and activity to any nation state. Our\n\ndescriptions of ‘APT groups’ focus on technical indicators rather than investigative work of intelligence\n\nagencies.\n\nHowever, it is certain that the threat actors responsible for GreyEnergy are extremely dangerous in their\n\npersistence and stealth.\n\nESET encourages individuals, businesses and institutions to have the most up-to-date endpoint security\n\nprotection to stay safe from this threat. We will continue monitoring GreyEnergy and TeleBots activity\n\nand report further findings.\n\n\n-----\n\n### IOCS\n\n#### ESET Detection names:\n\n- VBA/TrojanDownloader.Agent.EYV\n\n- Win32/Agent.SCT\n\n- Win32/Agent.SCM\n\n- Win32/Agent.SYN\n\n- Win64/Agent.SYN\n\n- Win32/Agent.WTD\n\n- Win32/GreyEnergy\n\n- Win64/GreyEnergy\n\n- Win32/Diskcoder.MoonrakerPetya.A\n\n- PHP/Agent.JS\n\n- PHP/Agent.JX\n\n- PHP/Agent.KJ\n\n- PHP/Agent.KK\n\n- PHP/Agent.KL\n\n- PHP/Agent.KM\n\n- PHP/Agent.KN\n\n- PHP/Agent.KO\n\n- PHP/Agent.KP\n\n- PHP/Agent.KQ\n\n- PHP/Agent.KR\n\n- PHP/Agent.KS\n\n- PHP/Agent.KT\n\n- PHP/Agent.KU\n\n- PHP/Agent.LC\n\n- PHP/Agent.NBP\n\n- PHP/Kryptik.AB\n\n- PHP/TrojanProxy.Agent.B\n\n- ASP/Agent.L\n\n- Win64/HackTool.PortScanner.A\n\n- Win32/HackTool.PortScanner.A\n\n- Win64/Riskware.Mimikatz.A\n\n- Win64/Riskware.Mimikatz.AE\n\n- Win64/Riskware.Mimikatz.AH\n\n- Win32/Winexe.A\n\n- Win64/Winexe.A\n\n- Win64/Winexe.B\n\n#### GreyEnergy document:\n```\nSHA-1:\n• 177AF8F6E8D6F4952D13F88CDF1887CB7220A645\n\n```\n\n-----\n\n#### GreyEnergy mini:\n```\nSHA-1:\n• 455D9EB9E11AA9AF9717E0260A70611FF84EF900\n• 51309371673ACD310F327A10476F707EB914E255\n• CB11F36E271306354998BB8ABB6CA67C1D6A3E24\n• CC1CE3073937552459FB8ED0ADB5D56FA00BCD43\n• 30AF51F1F7CB9A9A46DF3ABFFB6AE3E39935D82C\n\n GreyEnergy droppers:\nSHA-1:\n• 04F75879132B0BFBA96CB7B210124BC3D396A7CE\n• 69E2487EEE4637FE62E47891154D97DFDF8AAD57\n• 716EFE17CD1563FFAD5E5E9A3E0CAC3CAB725F92\n• 93EF4F47AC160721768A00E1A2121B45A9933A1D\n• 94F445B65BF9A0AB134FAD2AAAD70779EAFD9288\n• A414F0A651F750EEA18F6D6C64627C4720548581\n• B3EF67F7881884A2E3493FE3D5F614DBBC51A79B\n• EBD5DC18C51B6FB0E9985A3A9E86FF66E22E813E\n• EC7E018BA36F07E6DADBE411E35B0B92E3AD8ABA\n\n GreyEnergy dropped DLLs:\nSHA-1:\n• 0B5D24E6520B8D6547526FCBFC5768EC5AD19314\n• 10D7687C44BECA4151BB07F78C6E605E8A552889\n• 2A7EE7562A6A5BA7F192B3D6AED8627DFFDA4903\n• 3CBDC146441E4858A1DE47DF0B4B795C4B0C2862\n• 4E137F04A2C5FA64D5BF334EF78FE48CF7C7D626\n• 62E00701F62971311EF8E57F33F6A3BA8ED28BF7\n• 646060AC31FFDDFBD02967216BC71556A0C1AEDF\n• 748FE84497423ED209357E923BE28083D42D69DE\n• B75D0379C5081958AF83A542901553E1710979C7\n• BFC164E5A28A3D56B8493B1FC1CA4A12FA1AC6AC\n• C1EB0150E2FCC099465C210B528BF508D2C64520\n• CBB7BA92CDF86FA260982399DAB8B416D905E89B\n• DF051C67EE633231E4C76EC247932C1A9868C14F\n• DFD8665D91C508FAF66E2BC2789B504670762EA2\n• E2436472B984F4505B4B938CEE6CAE26EF043FC7\n• E3E61DF9E0DD92C98223C750E13001CBB73A1E31\n• E496318E6644E47B07D6CAB00B93D27D0FE6B415\n• EDA505896FFF9A29BD7EAE67FD626D7FFA36C7B2\n• F00BEFDF08678B642B69D128F2AFAE32A1564A90\n• F36ECAC8696AA0862AD3779CA464B2CD399D8099\n\n```\n\n-----\n\n#### GreyEnergy in-memory-only DLLs:\n```\nSHA-1:\n• 0BCECB797306D30D0BA5EAEA123B5BF69981EFF4\n• 11159DB91B870E6728F1A7835B5D8BE9424914B9\n• 6ABD4B82A133C4610E5779C876FCB7E066898380\n• 848F0DBF50B582A87399428D093E5903FFAEEDCD\n• 99A81305EF6E45F470EEE677C6491045E3B4D33A\n• A01036A8EFE5349920A656A422E959A2B9B76F02\n• C449294E57088E2E2B9766493E48C98B8C9180F8\n• C7FC689FE76361EF4FDC1F2A5BAB71C0E2E09746\n• D24FC871A721B2FD01F143EB6375784144365A84\n• DA617BC6DCD2083D93A9A83D4F15E3713D365960\n• E4FCAA1B6A27AA183C6A3A46B84B5EAE9772920B\n\n Moonraker Petya\nSHA-1:\n• 1AA1EF7470A8882CA81BB9894630433E5CCE4373\n\n PHP and ASP scripts\nSHA-1:\n• 10F4D12CF8EE15747BFB618F3731D81A905AAB04\n• 13C5B14E19C9095ABA3F1DA56B1A76793C7144B9\n• 1BA30B645E974DE86F24054B238FE77A331D0D2C\n• 34F8323B3B6BCF4B47D0ABEFCF9E38E15ECD2858\n• 438C8F9607E06E7AC1261F99F8311B004C23DEC3\n• 4D1C282F9942EC87C5B4D9363187AFDC120F4DC7\n• 4E0C5CCFFB7E2D17C26F82DB5564E47F141300B3\n• 5377ADB779DE325A74838C0815EEA958B4822F82\n• 58A69A8D1B94E751050DECF87F2572E09794F0F8\n• 5DD34FB1C8E224C17DCE04E02A4409E9393BCE58\n• 639BCE78F961C4B9ECD9FE1A8537733388B99857\n• 7127B880C8E31FBEB1D376EB55A6F878BC77B21A\n• 71BA8FE0C9C32A9B987E2BB827FE54DAE905D65E\n• 78A7FBDD6ADF073EA6D835BE69084E071B4DA395\n• 81332D2F96A354B1B8E11984918C43FB9B5CB9DB\n• 8CC008B3189F8CE9A96C2C41F864D019319EB2EE\n• 940DE46CD8C50C28A9C0EFC65AEE7D567117941B\n• A415E12591DD47289E235E7022A6896CB2BFDE96\n• D3AE97A99D826F49AD03ADDC9F0D5200BE46AB5E\n• E69F5FF2FCD18698BB584B6BC15136D61EB4F594\n• E83A090D325E4A9E30B88A181396D62FEF5D54D5\n• ECF21EFC09E4E2ACFEEB71FB78CB1F518E1F5724\n\n```\n\n-----\n\n#### Custom port scanner\n```\nSHA-1:\n• B371A5D6465DC85C093A5FB84D7CDDEB1EFFCC56\n• B40BDE0341F52481AE1820022FA8376E53A20040\n\n Mimikatz\nSHA-1:\n• 89D7E0DA80C9973D945E6F62E843606B2E264F7E\n• 8B295AB4789105F9910E4F3AF1B60CBBA8AD6FC0\n• AD6F835F239DA6683CAA54FCCBCFDD0DC40196BE\n\n WinExe\nSHA-1:\n• 0666B109B0128599D535904C1F7DDC02C1F704F2\n• 2695FCFE83AB536D89147184589CCB44FC4A60F3\n• 3608EC28A9AD7AF14325F764FB2F356731F1CA7A\n• 37C837FB170164CBC88BEAE720DF128B786A71E0\n• 594B809343FEB1D14F80F0902D764A9BF0A8C33C\n• 7C1F7CE5E57CBDE9AC7755A7B755171E38ABD70D\n• 90122C0DC5890F9A7B5774C6966EA694A590BD38\n• C59F66808EA8F07CBDE74116DDE60DAB4F9F3122\n• CEB96B364D6A8B65EA8FA43EB0A735176E409EB0\n• FCEAA83E7BD9BCAB5EFBA9D1811480B8CB0B8A3E\n\n```\nWarning! Most of the servers with these IP addresses were part of the Tor network, which means that\n\nthe use of these indicators could result in false positive matches.\n\n#### GreyEnergy mini C&C addresses\n```\n• https://82.118.236[.]23:8443/27c00829d57988279f3ec61a05dee75a\n• http://82.118.236[.]23:8080/27c00829d57988279f3ec61a05dee75a\n• https://88.198.13[.]116:8443/xmlservice\n• http://88.198.13[.]116:8080/xmlservice\n• https://217.12.204[.]100/news/\n• http://217.12.204[.]100/news/\n• http://pbank.co[.]ua/favicon.ico (IP: 185.128.40.90)\n\n```\n\n-----\n\n#### GreyEnergy C&C addresses\n\n\nActive period IP address\n\n```\n2015 - 2016 109.200.202.7\n2015 - 2015 193.105.134.68\n2015 - 2016 163.172.7.195\n2015 - 2016 163.172.7.196\n2016 - 2016 5.149.248.77\n2016 - 2016 31.148.220.112\n2016 - 2016 62.210.77.169\n2016 - 2016 85.25.211.10\n2016 - 2016 138.201.198.164\n2016 - 2017 124.217.254.55\n2017 - 2017 46.249.49.231\n2017 - 2017 37.59.14.94\n2017 - 2017 213.239.202.149\n2017 - 2017 88.198.13.116\n2017 - 2017 217.12.202.111\n2017 - 2017 176.31.116.140\n2017 - 2018 185.217.0.121\n2017 - 2018 178.150.0.200\n2018 - 2018 176.121.10.137\n2018 - 2018 178.255.40.194\n2018 - 2018 193.105.134.56\n2018 - 2018 94.130.88.50\n2018 - 2018 185.216.33.126\n\n```\n\n-----\n\n### ABOUT ESET\n\n[For 30 years, ESET® has been developing industry-leading IT security software and services for](http://www.eset.com/int/)\n\nbusinesses and consumers worldwide. With solutions ranging from endpoint and mobile security,\n\nto encryption and two-factor authentication, ESET’s high-performing, easy-to-use products give\n\nconsumers and businesses the peace of mind to enjoy the full potential of their technology. ESET\n\nunobtrusively protects and monitors 24/7, updating defenses in real time to keep users safe and\n\nbusinesses running without interruption. Evolving threats require an evolving IT security company.\n\n[Backed by R&D centers worldwide, ESET becomes the first IT security company to earn 100 Virus](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)\n\n_[Bulletin VB100 awards, identifying every single “in-the-wild” malware without interruption since 2003.](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)_\n\n[For more information, visit www.eset.com or follow us on LinkedIn, Facebook and Twitter.](https://www.linkedin.com/company/28967?trk=tyah&trkInfo=tarId%3A1402921556545%2Ctas%3AESET%2Cidx%3A2-1-4)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://www.welivesecurity.com/wp-content/uploads/2018/10/ESET_GreyEnergy.pdf",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.10.17.GreyEnergy/ESET_GreyEnergy.pdf",
        "https://papers.vx-underground.org/papers/ICS SCADA/GreyEnergy and BlackEnergy/GreyEnergy - A successor to Black Energy.pdf"
    ],
    "report_names": [
        "ESET_GreyEnergy.pdf",
        "ESET_GreyEnergy",
        "GreyEnergy - A successor to Black Energy.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d9cdc7f-72d6-4e17-89d8-f6323bfcaebb",
            "created_at": "2023-01-06T13:46:38.82716Z",
            "updated_at": "2025-03-27T02:00:02.928984Z",
            "deleted_at": null,
            "main_name": "GreyEnergy",
            "aliases": [],
            "source_name": "MISPGALAXY:GreyEnergy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1539858165,
    "ts_modification_date": 1539858168,
    "files": {
        "pdf": "https://archive.orkl.eu/e374781848bd51add20e73f9dab3e0559e4db342.pdf",
        "text": "https://archive.orkl.eu/e374781848bd51add20e73f9dab3e0559e4db342.txt",
        "img": "https://archive.orkl.eu/e374781848bd51add20e73f9dab3e0559e4db342.jpg"
    }
}