{
    "id": "316e7c63-67ea-4269-94ac-156254ffd0a7",
    "created_at": "2023-01-12T15:00:28.224039Z",
    "updated_at": "2025-03-27T02:14:02.707615Z",
    "deleted_at": null,
    "sha1_hash": "1d201c25b4cbadaa1a24d1208fdd39d050afc79b",
    "title": "2021-03-17 - China’s Five-Year Plan- A Pursuit for GDP Growth & Technological Self-Sufficiency",
    "authors": "",
    "file_creation_date": "2022-05-28T17:49:17Z",
    "file_modification_date": "2022-05-28T17:49:17Z",
    "file_size": 752642,
    "plain_text": "# China’s Five-Year Plan: A Pursuit for GDP Growth & Technological Self-Sufficiency\n\n**quointelligence.eu/2021/03/chinas-five-year-plan/**\n\nMarch 17, 2021\n\nChina’s [14th Five-Year Plan draft, which sets goals and strategies for developing the](http://www.xinhuanet.com/politics/2021lh/2021-03/05/c_1127172897.htm)\ncountry’s economy until 2025, was unveiled last week.\n\nChina’s Five-Year Plans set economic and social development targets, and this year’s FiveYear Plan highlights China’s continued interest in technological selfreliance; ongoing geopolitical tensions with the US, Hong Kong, and Taiwan; and the need to\naddress security, cybersecurity and climate change.\n\n**QuoIntelligence analyzed the plan carefully. Check out our** **infographic for the**\n**key-takeaways or read the in-depth analysis focusing closely on self-reliance in**\n**technology, GDP / domestic growth, national security, etc. and its impact on**\n**cybersecurity and geopolitics.**\n\n## At Least Six Percent Economic Growth planned for Semiconductors and Other High-Tech Industries\n\nFor the first time, the Five-Year Plan did not set out GDP targets for the whole Five-Year\nperiod but allowed for annual target adjustments, setting a goal of at least 6 percent growth\nfor 2021. Continuing on from the previous Five-Year Plan as well as the Made in China\n\n\n-----\n\n2025 policy, technological self-reliance is central to the Plan as a tool for development and\ngrowth.\n\nTo achieve the GDP growth target, the government will provide strategic support to develop\n[key sectors and increase R&D spending by more than 7 percent annually. The](https://www.wsj.com/articles/china-targets-ai-chips-among-seven-battlefronts-in-tech-race-with-u-s-11615135881) key sectors\nidentified are high-end semiconductors, computer processors, cloud computing, artificial\nintelligence (AI), quantum information, brain science, genetic research and biotechnology,\nand clinical medicine and health.\n\n## China’s Pursuit for Economic Independence from the US\n\nIn light of current geopolitical tensions, China aims to lessen its dependence on foreign\nsuppliers. For example, in the face of US tariffs and trade restrictions, China seeks to\npromote domestic consumption by boosting Chinese-supplied components and technology\nand relying less on foreign inputs. Additionally, the Five-Year policy aims to bolster China’s\nnational security system with an announced 6.8 percent rise in military spending.\n\nFor more details on China’s Five-Year Plan and our analysis scroll below the\ninfographic.\n\n[Talk To An Expert](https://quointelligence.eu/talk-to-an-expert/)\n\n\n-----\n\n[Work With Us!](https://quointelligence.eu/talk-to-an-expert/)\n\n## Key-Takeaways Through a Cybersecurity and Geopolitics Lense\n\nFrom the perspective of cyber intelligence, international security, and geopolitics, the keytakeaways and potential implications from the 14th Five-Year Plan are:\n\n### Achieving technological self-sufficiency\n\n[Chinese leaders identified tech development as a matter of national security for the first time](https://www.bloomberg.com/news/articles/2021-03-05/chinese-premier-calls-for-major-breakthroughs-in-core-tech)\nin a Five-Year Plan. This comes as a result of increasing pressure on trade, such\nas through US sanctions and tariffs, which impact China’s ability to rely on a stable supply of\nthe technologies that help drive its economic growth.\n\n\n-----\n\nThe increased importance of tech development could lead to an increase in cyber industrial\nespionage as in the past, QuoIntelligence observed Chinese-linked Advanced Persistent\nThreat (APT) groups, like the Winnti Group, targeting companies in sectors of high interest to\nthe Chinese government. Furthermore, China’s emphasis on developing alternative supply\nchains to counteract US sanctions will likely further exacerbate the ongoing tech race.\n\nHowever, while governments around the world, including the US and EU, have expressed\ntheir interest in shortening supply chains and bolstering domestic production, the highly\ncomplex and globalized state of supply chains makes success unlikely over the short to\nmedium term. Therefore, based on previous observations, China’s attempt to bolster\ndomestic manufacturing could result in more industrial espionage campaigns and further\ndeteriorate relations between the US and China.\n\n### Growth strategy centered on boosting domestic demand:\n\nChina is trying to counter US tariffs by boosting domestic demand while also promoting\n[the integration of the Chinese economy with the rest of the world. However, prioritizing the](https://www.scmp.com/economy/china-economy/article/3124497/chinas-two-sessions-key-takeaways-annual-government-work)\nconsumption of Chinese-made products across China could increase costs for Chinese\ncompanies relying on imported goods and technology and hinder growth objectives.\n\n### National security focus and increased defense expenditure\n\nFor the first time, the plan contains a special section for security development, aiming to\nbolster national security capabilities. The plan contemplates a 6.8 percent rise in military\nspending amid territorial disputes with India, as well as tensions with Taiwan and in the South\nChina Sea, as well as ambitions to match the US and Russia in weapons technology.\n\nThe focus on national security and defense is likely to be accompanied by increasing cyber\ncapabilities and campaigns to support China’s development and strategic ambitions. For\n[example, the recent espionage campaign involving the Chinese-linked HAFNIUM](https://quointelligence.eu/2021/03/weekly-intelligence-snapshot-week-9/)\ngroup exploiting vulnerabilities in Microsoft Exchange servers to target research, defense,\nand policy-making groups across the US highlights this threat. A potential increase in\ngovernment and military espionage points towards China’s growing focus on military and\ngeopolitical ambitions.\n\n### Actively deploy global partnerships with the EU\n\nAmid tensions with the US government, China appears to be prioritizing partnerships\nwith nations regarded as close US allies. For example, China intends to finalize an\n[investment treaty with the EU based on an agreement reached last December and China](http://english.www.gov.cn/premier/news/202103/05/content_WS60419319c6d0719374afa06c.html)\n[also aims to implement the China-Japan-South Korea free trade agreement.](https://thediplomat.com/2021/03/whats-on-the-agenda-for-chinas-national-peoples-congress/)\n\n### Reduce CO2 emissions intensity\n\n\n-----\n\nChina aims to reduce the amount of CO2 produced by 18 percent over the period 2021 to\n2025. The prioritization of new and green technology might also result in increased industrial\nespionage, which would allow Chinese companies to accelerate the development of green\nproducts.\n\n### Tighten control over Hong Kong\n\nWhile the central government said it will ensure the implementation of the doctrine that\nguarantees Hong Kong’s high degree of autonomy, officials have announced changes to\nHong Kong electoral system that will reduce the public’s role in government. This could\ncomplicate China’s relations with Western countries and potentially hinder trade agreements\nwith the EU.\n\n## Espionage Campaigns Targeting the High- Tech Sector Expected To Rise\n\nThe Five-Year Plan provides an insight into China’s priorities in the coming years and can\nhelp countries and organizations forecast future challenges. The 2021-2025 Five-Year\nPlan positions technology innovation as a matter of national security. As a result,\nQuoIntelligence expects continued sophisticated espionage campaigns targeting the hightech sector, particularly the semiconductor sector.\n\nIn addition, emerging tech sectors such as quantum computing and self-driving and\nhydrogen cars could become increasingly targeted. China’s growing focus on its military\ndevelopment and defense expenditure indicates a shift from China’s previous focus on using\ntrade and economics to further China’s interests globally, to also include military power.\n\nChina’s more aggressive tone, already seen with democratic restrictions in Hong Kong and\ncontinued pressure on Taiwan, could hinder China’s relations with Western countries, such\nas the potential EU trade agreement.\n\n[Talk To An Expert!](https://quointelligence.eu/talk-to-an-expert/)\n\n## Join Our Newsletter!\n\nSubscribe to our newsletter to receive Weekly Intelligence Summaries, cyber news, and\nexciting updates!\n\nOnly valid business emails will be approved.\n\n## Join Our Newsletter!\n\nSubscribe to our newsletter to receive Weekly Intelligence Summaries, cyber news, and\nexciting updates!\n\n\n-----\n\nOnly valid business emails will be approved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-17 - China’s Five-Year Plan- A Pursuit for GDP Growth & Technological Self-Sufficiency.pdf"
    ],
    "report_names": [
        "2021-03-17 - China’s Five-Year Plan- A Pursuit for GDP Growth & Technological Self-Sufficiency.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bbced13-72f7-40dc-8c41-dcce75bf885e",
            "created_at": "2022-10-25T15:50:23.695735Z",
            "updated_at": "2025-03-27T02:00:55.525839Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Winnti Group"
            ],
            "source_name": "MITRE:Winnti Group",
            "tools": [
                "PipeMon",
                "Winnti for Windows",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "945a572f-ebe3-4e2f-a288-512fe751cfa8",
            "created_at": "2022-10-25T16:07:24.413971Z",
            "updated_at": "2025-03-27T02:02:10.212853Z",
            "deleted_at": null,
            "main_name": "Winnti Group",
            "aliases": [
                "Wicked Panda",
                "Winnti Group"
            ],
            "source_name": "ETDA:Winnti Group",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535628,
    "ts_updated_at": 1743041642,
    "ts_creation_date": 1653760157,
    "ts_modification_date": 1653760157,
    "files": {
        "pdf": "https://archive.orkl.eu/1d201c25b4cbadaa1a24d1208fdd39d050afc79b.pdf",
        "text": "https://archive.orkl.eu/1d201c25b4cbadaa1a24d1208fdd39d050afc79b.txt",
        "img": "https://archive.orkl.eu/1d201c25b4cbadaa1a24d1208fdd39d050afc79b.jpg"
    }
}