{
    "id": "319ae9e9-043a-486c-89d4-e1738abad0c0",
    "created_at": "2022-10-25T16:48:11.608317Z",
    "updated_at": "2025-03-27T02:16:44.763997Z",
    "deleted_at": null,
    "sha1_hash": "f29079c38ee0d5b3a9afb0462b4475e226e9b4ab",
    "title": "Study of targeted attacks on Russian research institutes",
    "authors": "",
    "file_creation_date": "2021-04-02T13:58:34Z",
    "file_modification_date": "2021-04-02T13:58:34Z",
    "file_size": 2871973,
    "plain_text": "# Study of targeted attacks on Russian research institutes\n\n\n-----\n\n**© Doctor Web, Ltd., 2021. All rights reserved.**\n\nThis document is the property of Doctor Web, Ltd. (hereinafter - Doctor Web). No part of this\ndocument may be reproduced, published or transmitted in any form or by any means for any\npurpose without proper attribution.\n\nDoctor Web develops and distributes Dr.Web information security solutions which provide\nefficient protection from malicious software and spam.\n\nDoctor Web customers can be found among home users from all over the world and in\ngovernment enterprises, small companies and nationwide corporations.\n\nDr.Web antivirus solutions are well known since 1992 for continuing excellence in malware\ndetection and compliance with international information security standards. State certificates and\nawards received by the Dr.Web solutions, as well as the globally widespread use of our products\nare the best evidence of exceptional trust to the company products.\n\n**Study of targeted attacks on Russian research institutes**\n**4/2/2021**\n\nDoctor Web Head Office\n2-12A, 3rd str. Yamskogo polya\nMoscow, Russia\n125124\n\nWebsite: www.drweb.com\nPhone: +7 (495) 789-45-87\n\nRefer to the official website for regional and international office information.\n\n\n-----\n\n## Table of Contents\n\n###### Introduction 4\n\n Who’s behind the attacks? 5\n\n Comparative code analysis of BackDoor.DNSep.1 and BackDoor.Cotx.1 7\n\n Comparative code analysis of the Skeye, Mikroceen and Logtu backdoors 15\n\n Conclusion 23\n\n Operating Routine of Discovered Malware Samples 24\n\n**BackDoor.Skeye.1** **24**\n\n**BackDoor.DNSep.1** **33**\n\n**BackDoor.Remshell.24** **39**\n\n**BackDoor.Farfli.130** **41**\n\n**Trojan.Mirage.12** **42**\n\n**BackDoor.Siggen2.3268** **48**\n\n###### Appendix 1. Indicators of compromise 58\n\n\n-----\n\n### Introduction\n\nAt the end of September 2020, one of the Russian research institutes contacted the Doctor Web\nvirus laboratory seeking assistance. The research institute’s staff drew our attention to technical\nproblems that could indicate the presence of malware on one of the servers in their local\nnetwork. During the investigation, Doctor Web virus analysts found that the institute had been\nthe victim of a targeted attack using specialized backdoors. A detailed study of the incident\nrevealed that the facility's network had been compromised long before the institute contacted us\nand, judging by the available data, by more than one APT group.\n\nThe data obtained during the investigation suggests that the first APT group compromised the\ninternal network of the institute in fall 2017. The initial infection was carried out using\nBackDoor.Farfli.130—a modification of the Gh0st RAT malware. Later in spring 2019 the network\nwas infected with Trojan.Mirage.12, and again in June 2020—with BackDoor.Siggen2.3268.\n\nThe second hacker group infiltrated the institute's network no later than April 2019. The infection\nbegan with the installation of BackDoor.Skeye.1. During the course of the investigation, we also\nfound that around the same time—in May 2019—Skeye was deployed to the local network of\nanother Russian research institute.\n\n[Meanwhile, in June 2019, FireEye published a report on that backdoor used in a targeted attack](https://www.fireeye.com/blog/threat-research/2019/06/government-in-central-asia-targeted-with-hawkball-backdoor.html)\non the public sector of a number of Central Asian countries. Doctor Web virus analysts later\nuncovered various trojans that were installed in the institute’s network between August and\nSeptember 2020 by the same APT group. The previously unknown BackDoor.DNSep.1 DNS\n[backdoor, as well as the all-too-familiar BackDoor.PlugX were among the malware.](https://vms.drweb.com/search/?q=BackDoor.PlugX&lng=en)\n\nTo top that off, in December 2017, a BackDoor.RemShell.24 was also installed on the servers of\nthe research institute that contacted us. Samples of this malware family were previously\n[described by Positive Technologies specialists in the study \"Operation Taskmasters\". At the](https://www.ptsecurity.com/ww-en/analytics/operation-taskmasters-2019/)\nmoment we do not have enough data to decisively determine which of the two APT groups\nused this backdoor.\n\n\n-----\n\n### Who’s behind the attacks?\n\nWhat we know about the first APT group is not enough to identify the attackers as one of the\npreviously described hacker groups. At the same time, analysis of the malware and infrastructure\nused revealed that this group has been active since at least 2015.\n\nWe believe the second APT group that attacked the research institute is TA428, previously\n[described by Proofpoint researchers in the \"Operation Lag Time IT\" study. The following facts](https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology)\nsupport this conclusion:\n\n1. There are explicit intersections in the code of the BackDoor.DNSep and BackDoor.Cotx\nbackdoors.\n\n2. Both BackDoor.Skeye.1 and Trojan.Loader.661 were used in the same attack. The latter is a\nknown tool of TA428.\n\n3. The backdoors we analyzed during the investigation of these attacks have intersections in the\nC&C servers' addresses and the network infrastructure with the backdoors used by TA428.\n\nAt this point, we’ll take a closer look at the uncovered connections. The graph shows part of the\ninfrastructure involved in the attack with intersections between the Skeye backdoor and another\nwell-known APT backdoor—PoisonIvy:\n\n\n-----\n\nThis graph shows the infrastructure intersections between the Skeye and Cotx backdoors:\n\n\n-----\n\nA detailed analysis of the DNSep backdoor and a code comparison with the Cotx backdoor code\nrevealed similarities in the general logic of processing commands from the C&C server and in\nspecific implementations of individual commands.\n\nAnother interesting finding was the Logtu backdoor. We previously described one of its samples\nduring our investigation of the incident in Kyrgyzstan. Its C&C server turned out to be atob[.]\nkommesantor[.]com, which was also the server for the Skeye backdoor. In this regard, we also\n[conducted a comparative analysis of BackDoor.Skeye.1 with samples of BackDoor.Logtu.1 and](https://vms.drweb.ru/virus/?i=21517232&lng=en)\n[BackDoor.Mikroceen.11.](https://vms.drweb.ru/virus/?i=21512308&lng=en)\n\n### Comparative code analysis of BackDoor.DNSep.1 and BackDoor.Cotx.1\n\nEven though Cotx and DNSep have radically different communication channels with the C&C\nserver, we managed to find interesting matches in the code of both backdoors.\n\nThe function responsible for processing commands from the C&C server takes the structure as\nan argument:\n```\n struct st_arg\n {\n  _BYTE cmd;\n  st_string arg;\n };\n\n```\nAt the same time, if the required function accepts several arguments, they are all written in the\n```\narg field with the separator |.\n\n```\nThe BackDoor.Cotx has more commands than the BackDoor.DNSep.1 does and includes all\nthe commands as the latter.\n\nThe table below shows an almost complete code match for some of the backdoor functions. It is\nworth noting that Cotx uses Unicode encoding, while DNSep uses ANSI encoding.\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\n-----\n\nThe data obtained during the analysis suggests that the author of the DNSep backdoor had\naccess to the Cotx source codes. Since these resources are not publicly available, we assume the\nauthor or group of authors of DNSep is related to TA428. The DNSep sample supports this\nversion, as it was found in the same compromised network along with other known TA428\nbackdoors.\n\n\n-----\n\n### Comparative code analysis of the Skeye, Mikroceen and Logtu backdoors\n\nOver the course of the Skeye backdoor study, we found that the Logtu backdoor uses the same\nC&C server address. For comparative analysis, we used the previously described\n**BackDoor.Logtu.1 and the BackDoor.Mikroceen.11 samples.**\n\n**Logging functions**\n\nLogging in all cases is obfuscated.\n\n - BackDoor.Mikroceen.11—messages in the %d - %d-%d %d:%d:%d <msg>\\r\\n format is\nwritten to the %TEMP%\\WZ9Jan10.TMP file, where <msg> is a random text string. In the\nsample 2f80f51188dc9aea697868864d88925d64c26abc, the messages are written to\nthe 7B296FB0.CAB file;\n\n - BackDoor.Logtu.1—messages in the [%d-%02d-%02d %02d:%02d:%02d] <rec_id>\n```\n <error_code>\\n<opt_message>\\n\\n format before writing to the %TEMP%\n \\rar<rnd>.tmp file are encrypted with the XOR operation with the key 0x31;\n\n```\n - BackDoor.Skeye.1—messages in the format %4d/%02d/%02d %02d:%02d:%\n```\n 02d\\t<rec_id>\\t<error_code>\\n are written to the %TEMP%\\wcrypt32.dll file.\n\n```\nThe general logic of the sequence of writing messages to the log is also similar for all three\nsamples:\n\n - The start of the execution is fixed.\n\n - A direct connection to the C&C server is recorded in the log in Logtu and Mikroceen.\n\n - In each case, the proxy used to connect to the server is specified.\n\n - A separate entry is recorded in the log in case of an error when obtaining a proxy from a\nparticular source.\n\nIt should be noted that such detailed and obfuscated logging is extremely rare. Obfuscation\nimplements the logging of some message codes and, in some cases, additional data. In\naddition, in this case, the general principle of the sequence of recording events is traced as\nfollows:\n\n - The start of the execution is fixed\n\n - Direct connection attempt\n\n - Proxy addresses obtainment\n\n - A record of the connection via a particular server\n\n\n-----\n\n**Search for a proxy server**\n\nThe connection sequence to the C&C server also looks similar in all three samples. Initially, each\nbackdoor attempts to connect to the server directly, and in case of failure, it can use proxy\nservers whose addresses are originating from three sources in addition to the built-in one.\n\n**BackDoor.Mikroceen.11 can obtain proxy servers addresses:**\n\n- From the %WINDIR%\\debug\\netlogon.cfg file;\n\n- From its own log file; and\n\n- By searching for connections to remote hosts via ports 80, 8080, 3128, 9080 in the TCP table.\n\n\n-----\n\nSearch for a proxy in the own log file:\n\n\n-----\n\nSearch in active connections:\n\n**BackDoor.Logtu.1 can obtain proxy servers addresses:**\n\n- From the registry HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet\n```\n Settings\\ProxyServer;\n\n```\n- From the HKU section of the registry by the SID of the active user; and\n\n- By the WinHttpGetProxyForUrl WinHTTP API requesting google.com.\n\n\n-----\n\n**BackDoor.Skeye.1 can obtain proxy servers addresses:**\n\n- From the HCKU section of the registry\n```\n Software\\Microsoft\\Windows\\CurrentVersion\\Internet\n Settings\\ProxyServer;\n\n```\n- From the HKU section of the registry by the SID of the active user; and\n\n- By searching for connections to remote hosts via ports 80, 8080, 3128, 9080 in the TCP table.\n\n\n-----\n\n**Intersections in the network infrastructure**\n\nSome samples shared the same network infrastructure. A fragment of the graph clearly shows\nthe relationship between the families.\n\n**IDs**\n\nThe Logtu and Mikroceen samples contain strings that are used as builds IDs or version IDs.\nSome of these strings share the same format.\n\n|BackDoor.Mikroceen.11|Col2|BackDoor.Logtu.1|Col4|\n|---|---|---|---|\n|SHA1|Id|SHA1|id|\n|ce21f798119dbcb7a63f8cdf0 70545abb09f25ba|intl0113|029735cb604ddcb9ce85de92 a6096d366bd38a24|intpz0220|\n\n\n-----\n\n|0eb2136c5ff7a92706bc9207d a32dd85691eeed5|hisa5.si4|7b652e352a6d2a511f226e4d 0cc22f093e052ad8|retail2007|\n|---|---|---|---|\n|2f80f51188dc9aea697868864 d88925d64c26abc|josa5w5n|1c5e5fd53fc2ee778342a5cae 3ac2eb0ac345ed7|retail|\n|2e50c075343ab20228a8c0c0 94722bbff71c4a2a|enc0225|00ddcc200d1031b863902653 2c0087bfcc4520c9|716demo|\n|3bd16f11b5b3965a124a6fc3 286297e5cfe77715|520299|b599797746ae8ccf7907cf88d e232faa30ec95e6|gas-zhi|\n|5eecdf63e85833e712a1ff88df 1341bbf32f4ab8|Strive|2d672d7818a56029b337e879 2935195d53576a9d|jjlk|\n|bd308f4d1a32096a3b90cfdae 45bbc5c13e5e801|R0916|||\n|b1be4b2f874c8309f553acce9 0287c8c6bb2b6b1|frsl.1ply|||\n|21ffd24b8074d7cffdf4cc339d 1fa8fe892eba27|Wdv|||\n|8fbec09e646311a285aee06b3 dd45ccf58928703|intz726|||\n|19921cc47b3de003186e65fd1 2b82235030f060d|122764|||\n|0f70251abc8c64cbc7b24995c 3d32927514d0a4b|V20180224|||\n|149947544ca4f7baa5bc3d00 b080d0e943d8036b|SOE|||\n|e7f5a33b33e023a82ac9eee6e d40e4a38ce95277|int815|||\n|b4790eec7daa9f931bed43a5 3f66168b477599a7|UOE|||\n|ab660a3ac46d563c756463bd 1b64cc45f347a1f7|B.Z11NOV20D|||\n|d0181759a175fbcc60975983b 351f88970f484f9|299520|||\n\n\n-----\n\n|7a63fc9db2bc1e9b1ef793723 d5877e6b4c566b8|WinVideo|Col3|\n|---|---|---|\n|13779006d0dafbe4b27bd282 230df299eef2b8dc|SSLSSL||\n|f53c77695a162c78c68f693f57 f65752d17f6030|int007server||\n|924341cab6106ef993b506193 e6786e459936069|intl1211||\n|8ebf78c84cd7f66ca8708467a 28d83658bcf6710|intl821||\n|f2856d7d138430e164f83662e 251ee311950d83c|intl821||\n\n\nIn addition, a significant number of samples showed that this ID is equal to the value of TEST or\n```\ntest.\n\n```\n**BackDoor.Logtu.1 example (9ea2488f07bf3edda23d9b7759c2d0c3c8501f92):**\n\n**BackDoor.Mirkoceen.11 example (81bb895a833594013bc74b429fb1f24f9ec9df26):**\n\nThus, the comparative code analysis revealed similarities in the considered families in:\n\n- The logic of event logging and its obfuscation;\n\n- The logic of connection to the C&C server and in the proxy address search algorithms; and\n\n- The network infrastructure.\n\n\n-----\n\n### Conclusion\n\nThroughout the investigation into the attacks on the Russian research institutes, our virus\nanalysts found and described several families of specialized backdoors, including previously\nunknown samples. It is worth noting that the unauthorized presence of the first APT group has\ngone unnoticed since 2017.\n\nOne of the most interesting findings is the code and network infrastructure intersections of the\nanalyzed samples. We assume that the discovered connections indicate that the backdoors in\nquestion belong to the same APT groups.\n\nDoctor Web specialists suggest regular monitoring of important network resources and pay\ntimely attention to failures that may be the results of malware activity in the network. APT poses\na significant threat not only by compromising data, but also by the prolonged presence of\nintruders in corporate networks. This allows them to monitor the organization’s work for years\nand gain access to sensitive information at will. If malicious activity within a corporate network is\nsuspected, the prudent course of action is to contact the Doctor Web virus laboratory for\nqualified help. Prompt countermeasures will significantly reduce any actual damage and prevent\nfurther detrimental consequences of targeted attacks.\n\n\n-----\n\n### Operating Routine of Discovered Malware Samples\n\n#### BackDoor.Skeye.1\n\nA backdoor written in C and designed to operate in the 64-bit versions of Microsoft Windows\noperating systems. It is used for targeted attacks on information systems, collecting information\nabout the infected devices and remotely controlling them by launching cmd.exe and redirecting\nthe I/O to the attacker's C&C server. The malicious module’s original name is sk.exe. The\nbackdoor’s code has similarities with the code of Mikroceen and Logtu malware.\n\n##### Operating routine\n\nIt has one exported function DllEntry of the following structure:\n\n\n-----\n\nWhen running the sample as an EXE file, only the malmain function is run.\n\nThe backdoor writes the event log to the %TEMP%\\\\wcrypt32.dll file containing the date\nand time of the message; but instead of the readable message, the program logs its code. The\ntable below shows the message codes decryption.\n\n|code|arg|msg|\n|---|---|---|\n|4|0|Backdoor launch|\n|5|Error code|Error upon process launch|\n|10|botid|A new botid is received from the server|\n\n\n-----\n\n|16|0|Proxy settings for the current user are received|\n|---|---|---|\n|17|0|Proxy settings for the current user are not received|\n|18|0|Proxy settings for the active user are received|\n|19|0|Proxy settings for the active user are not received|\n|20|Error code|Error while receiving SID of the active user|\n|32|Attempt number|Attempting to check the availability of the server|\n|65|status code|A code other than 200 is received while the command is requested.|\n|66|Attempt number|Failed to request a command|\n|67|status code|Attempting to check the availability of the server|\n|68|0|The proxy flag is not set in the system settings|\n|70|Error code|Failed to connect to the C&C server|\n|71|Error code|Request creation error|\n|72|Error code|Request transmission error|\n|100 + cmdid|0|Execution command received|\n|153|Error code|Failed to obtain the status code for the sent request|\n|256|Attempt number|Attempting to request an execution command|\n\n\n-----\n\nThe backdoor initializes the list of commands it can execute upon operation.\n\nThis is followed by the initial check for any debugging processes—the backdoor checks the\n```\nBeingDebugged flag in the PEB (Process Environment Block). If there is a debugging process,\n\n```\nthe backdoor closes.\n\nNext, it creates a test0 or test0_cu mutex in case it is not run from NT\n```\nAUTHORITY/SYSTEM. If the specified mutex already exists, the backdoor terminates.\n\n```\nIt then reads the bot ID from the file %TEMP%\\\\test0.dat. An 8-byte encryption key is\ninitialized based on the bot ID.\n\n\n-----\n\nNext, BackDoor.Skeye.1 begins operation with the C&C server. Before sending requests, it again\nchecks whether the sample debugging process is present. This time, using the\n```\nNtQueryInformationProcess function it checks ProcessDebugPort,\nProcessDebugObjectHandle and ProcessDebugFlags. If the backdoor spots the\n\n```\ndebugging process, it closes.\n\nThe requests use the User-Agent string:\n```\nMozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; Trident/4.0;\nSLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729;\nMedia Center PC 6.0; InfoPath.2).\n\n```\nWhen connection to the C&C server, the backdoor first sends a GET request to check the\navailability of the server; the sample contains two sets (server-port) of the C&C addresses.\n```\nhxxps://atob.kommesantor.com/?t=%d&&s=%d&&p=%s&&k=%d, where t parameter is\n\n```\nthe bot ID, s is session number, p is dut6@bV0 string, and k is the result of the\n```\nGetTickCount() function.\n\n```\nIf the response is code 200, it means the server connection has been successfully established,\nand the backdoor requests an execution command. If the response is code 403, the program\ntries to repeat the request, while it enters www.mail[.]ru in the Host HTTP header instead of\nentering the C&C address. If the code 200 still cannot be obtained, the backdoor then checks\nthe second C&C server. In case of repeated failure, it waits for a few seconds and then makes\nanother attempt.\n\nA GET request with the address hxxps://atob.kommesantor.com/?e=%d&&t=%d&&k=%\n```\nd is used to request the command, where e is null, t is the bot ID, and k is the result of the\nGetTickCount() function.\n\n```\n\n-----\n\nIf the response is the code 200, the cookie of that response contains the ID of the command to\nbe executed, and the response data is encrypted with an XOR operation with an 8-byte key\nbased on the bot ID.\n\nA POST request with the address hxxps://atob.kommesantor.com/?e=%d&&t=%d&&k=%\n```\nd is used to send back the results, where e is the command ID, t is the bot ID, and k is the result\n\n```\nof the GetTickCount() function; the result of the request is transmitted as data encrypted by\nan XOR operation with an 8-byte key based on the bot ID.\n\nCommand list\n\n|Command id|Resulting action|\n|---|---|\n|1|To set a new botid|\n|16|To idle|\n|17|To send information about the infected system|\n|18|To launch a process|\n|19|To launch a process and send its output|\n|20|To run the command shell with I/O redirecting to pipes|\n|21|To close the command shell|\n|22|To send the command shell output|\n|23|To launch its file with the stop parameter|\n|24|To terminate the backdoor operation|\n|48|To run the file manager|\n|64|To send the information about disks|\n|65|To send the directory listing|\n|66|To delete a file|\n|67|To move a file|\n|80|To send a process list|\n|81|To terminate a process|\n|85|To send a service list|\n\n\n-----\n\n|86|To launch a process|\n|---|---|\n\n\nDuring the investigation of the related targeted attack, the following servers were found:\n```\natob[.]kommesantor[.]com\nterm[.]internnetionfax[.]com\nrps[.]news-click[.]net\n\n```\nAll three domains are resolved to 103.97.124[.]193.\n\n**Other modifications of the Skeye backdoor**\n\nAnother uncovered backdoor sample (0b33a10c0b286c6ffa1d45b261d8a338) has been added\nto Dr.Web database as BackDoor.Skeye.2.\n\nThe key differences of this modification are:\n\n- Exported functions are absent.\n\n- The sample runs as a service, installing or deleting itself, depending on the arguments it is\nrunning with (install, uninstall, without arguments).\n\n\n-----\n\nThe malmain function is also run from ServiceMain;\n\n- The bot ID is read from the file %TEMP%\\Date, but the encryption key is generated in the\nsame manner.\n\n- The configuration (mutex name, server address, port, and proxy) is encrypted with the XOR\noperation with the key 0xB7. www2.morgoclass[.]com is the C&C address. The port is\n443.\n\n\n-----\n\n- The protocol of communication with the C&C server is binary. The connection is made via a\nTCP socket. After connecting to the server, the backdoor sends an 8-byte packet: the first 4\nbytes are the bot ID, the second 4 bytes are zeros. Receiving a response from the server is\nperformed in 2 stages: first, a packet with the length of the data (header) is received, then the\ndata itself is received and decrypted. The header structure is the following:\n```\n struct packet_header\n {\n   BYTE marker;\n   DWORD cmd_id;\n   DWORD size;\n }\n\n```\nWith that, the marker field must be equal to 0xFF. The data is sent to the server by a single\ncall to send with the same header.\n\n- This sample does not include all the commands described in the first sample\n(a259db436aa8883cc99af1d59f05f4b1d97c178b). Commands 80, 81, 85, and 86 are absent\n\n- There are differences in the event log message codes. Codes 10, 65-68, and 70-72 are absent.\n\nThe event log message codes are shown in the table.\n\n|The message code|Code|Description|\n|---|---|---|\n|0|argc|Written at the beginning of main|\n|2|0|The backdoor is launched with the install command (installing the service)|\n|3|0|The backdoor is launched with the uninstall command (deleting the service)|\n|9|0|An unhandled exception occurred, the program will restart|\n|21|0|Successful connection to the proxy server|\n\n\n-----\n\n|The message code|Code|Description|\n|---|---|---|\n|22|0|Failed to connect via proxy (no addresses from the registry or SID of the active user were received)|\n|23|Error code|Error at the proxy server connection|\n|24|Error code|Failed to connect to the C&C server without proxy|\n|25|Error code|Failed to send a packet to the C&C server|\n|26|Error code|No answer from the C&C server|\n|48|command ID|A received command. It is written to the log 2 times|\n|257|0|Failed to connect to the C&C server|\n|258|0|Failed to send an initial packet (bot ID)|\n|cmd_id+10000|0|Command ID + 10000. It is recorded immediately after receiving and decrypting the command|\n\n\nIt is worth noting that the two samples use different sets of codes to log the connection to the\nC&C server. In the first case, these are the codes 70-72, while the connection to the server is\nmade via HTTP. In the second case, these are the codes 24-26, and the connection is made via a\nsocket.\n\n#### BackDoor.DNSep.1\n\nA backdoor written in C and C++ and designed to run on 32- and 64-bit Microsoft Windows\noperating systems. Its main purpose is to provide a communication channel with the C&C server\nthrough DNS requests and facilitate unauthorized control over the infected computer. It consists\nof a malicious loader (a .DLL library), and the main module operating in RAM. Its code has\nmultiple overlaps with the Cotx backdoor.\n\n\n-----\n\n##### Operating routine\n\nThe malware is a DNS backdoor. C&C server communication occurs by reading the TXT records\nof subdomains formed in a certain way.\n\n**Loader module**\n\nThe original name in the export table is Stager.dll. The library has a number of exported\nfunctions.\n\nWith that, most of the functions do not perform any actions. The only working function is\n```\nInitLoad, where the backdoor is launched. The same function is called from DllMain.\n\n```\nThe backdoor unpacks the payload from its resources. It is located in the DAT resource\ncompressed through RtlCompressBuffer. In the unpacked main module, the loader searches\nfor the CQKUZXadCXS string, which is a plug for the configuration. After the string is found, the\nloader replaces it with the current configuration. In the analyzed sample, this string is\n```\nAB1d3d3MS5kb3RvbWF0ZXIuY2x1Yjsw.\n\n```\nNext, the %WINDIR%\\\\System32\\\\dllhost.exe process is launched, where the main\nmodule is then injected. If the third character in the configuration is 0, both the executable file of\nthe process in the context of which the loader operates and the file of the loader itself are\ndeleted.\n\n\n-----\n\n**The main module operation**\n\nThe main module is written in C++, with extensive use of the STL library.\n\nAt the beginning, the backdoor verifies the embedded configuration that was earlier replaced by\nthe loader. If the first two characters do not match AB, it considers the configuration to be\nabsent, so it stops running. Otherwise, it decodes the configuration from Base64, starting from\nthe 4th character: www1.dotomater.club;0.\n\nThe configuration format is simple and represents a domain of the C&C server and the IP\naddress of the DNS server, which are separated by a semicolon. If the DNS server address is not\nspecified or specified as null, the backdoor uses the DNS servers used by the infected computer.\n\n\n-----\n\nNext, the backdoor creates several threads. The first is used to send heartbeat packets.\n\nIn response, the C&C server sends the heartbeat%d string where %d is the same number from\nthe packet sent by the bot.\n\nThe second thread is used to parse the packets queue and send them to the C&C server.\n\nAfter that, it transmits the information about the infected system:\n```\nsprintf(Str, \"%s;%s;%s;%d;%s\", szCompName, szUserName, szOSVer,\nisx64, szCurDateTime);.\n\n```\n\n-----\n\nNext, the backdoor enters the cycle of receiving and processing commands from the C&C server.\n\n**Command code** **Command description**\n\n1 Set bot ID\n\n2 Run the command shell and redirect the I/O to the pipes\n\n3 Execute the command in the previously launched shell (command No.2)\n\n4 Get information about the disk or directory listing\n\n6 Send file to the C&C server\n\n7 Copy a file\n\n8 Delete a file\n\n9 Get information about the file size\n\n10 Save file to the specified path\n\n11 Change the interval of C&C server communication\n\n13 Self-deletion\n\n**C&C server communication protocol**\n\nFrom the data sent to the C&C server the following structure is initially formed:\n```\n #pragma pack(push, 1)\n struct st_packet\n {\n  _BYTE magic; // 0x65\n  _WORD botid;\n  _DWORD pktid;\n  _BYTE data[];\n };\n #pragma pack(pop)\n\n```\n- botid initially has the 0 value, but it changes upon the C&C server command, containing\n```\n opcode == 1, which is sent as a response to the information about the infected system;\n\n```\n- pktid has the initial value 0, but it changes upon receiving each packet from the C&C server;\n\n- data contains the packet data, including command ID.\n\n|Command code|Command description|\n|---|---|\n|1|Set bot ID|\n|2|Run the command shell and redirect the I/O to the pipes|\n|3|Execute the command in the previously launched shell (command No.2)|\n|4|Get information about the disk or directory listing|\n|6|Send file to the C&C server|\n|7|Copy a file|\n|8|Delete a file|\n|9|Get information about the file size|\n|10|Save file to the specified path|\n|11|Change the interval of C&C server communication|\n|13|Self-deletion|\n\n\n-----\n\nThe received packet is encrypted with the following function:\n\nThe dadadadadadadada string is sent into this function as a key.\n\nThe received encrypted data is coded with Base64. From the encrypted data the subdomain\nname for the domain, listed in the configuration, is formed. With that, if the length of the\nencoded data exceeds 62 symbols, the dot is added after each 62nd symbol.\n\nNext, the DNS request to receive TXT records of the formed domain is made.\n\nThe response from the C&C server is decrypted the same way. First, it is decoded from Base64,\nfollowed by decryption with the dadadadadadadada key. The resulting data is:\n\n\n-----\n\n#### BackDoor.Remshell.24\n\nA backdoor written in C and designed to operate in the 32-bit versions of the Microsoft\nWindows operating systems. It allows attackers to remotely control infected computers by\nimplementing remote shell functions—launching cmd.exe and redirecting the I/O to the\nattacker's C&C server. The malicious module’s original name is client_dll.dll.\n\n##### Operating routine\n\nThe library has one exported function that implements the main functionality of the backdoor:\n```\nServiceMain.\n\n```\nAt the beginning of the operation, the backdoor creates a mutex to exclude the simultaneous\nlaunch of its copy. It then decrypts the strings with an XOR operation with the byte 0x0F. List of\ndecrypted strings:\n```\n Mozilla/4.0 (compatible; MSIE 10.0; Windows NT 6.2;+SV1;\n ns02.ns02.us/<redacted>/0xD.html\n /webdav/0.htm\n /webdav/%s.htm\n %02d%02d\n -download\n Download OK!\n Download failed...\n -pslist\n -pskill\n -upload\n Upload OK!\n Upload failed...\n Process is Killed!\n Process killed failed.\n -exit\n cmd.exe /c \n\n```\nThe URL ns02[.]ns02[.]us/<redacted>/0xD.html is hardcoded in the body of the\nbackdoor that locates both primary C&C servers.\n\nAfter decrypting the strings, BackDoor.Remshell.24 uses the %02d%02d format to store the\ncurrent minutes and seconds. These values are then used in requests to the C&C server.\n\nNext, a separate thread is started in which, in an infinite loop, the program attempts to obtain or\nupdate the address of the second-level C&C server. When the address of the secondary C&C\nserver is received, the backdoor starts a thread in which it sends heartbeat requests to this\nserver.\n\n\n-----\n\nThe backdoor then periodically requests commands from the C&C server and executes them.\n\n**Obtaining the address of the secondary C&C server**\n\nTo get an address, a GET request is sent to the URL specified in the configuration. In response,\nthe server sends the string -set <arg> or -SET <arg>, where <arg> is either a number or\nan IP address. The resulting number is interpreted as the interval for accessing the URL specified\nin the configuration. If an IP address is received, the backdoor adopts it as a secondary C&C\nserver.\n\nIt is worth noting that the thread does not stop working when it receives the valid address of the\nC&C server. It continues to work, which allows one to change the C&C server addresses without\nrestarting the backdoor.\n\n**Protocol for communicating with the secondary C&C server**\n\nAt the beginning of the data sent by the PUT request, the backdoor appends a header consisting\nof 5 bytes, which is a string formed according to the format %02d%02d. The minute and second\nvalues representing when the request was formed are substituted in this string.\n\nWith that, the request and response data are encrypted. The value of each sent byte of the\nrequest data is reduced by 0x7F, and each received byte is increased by 0x7F.\n\nAs heartbeat requests, a PUT request is sent to <cnc_addr>/webdav/0.htm with data\ncontaining the name of the infected computer and the values of the minute and second when\nthe backdoor was launched.\n\nTo request commands from the C&C server, the backdoor sends a GET request to\n```\n<cnc_addr>/webdav/O.html. It then decrypts the server’s response and parses it for\n\n```\ncommands.\n\nCommands list\n\n|Command|Description|\n|---|---|\n|-download|To download a specified file|\n|-exit|To terminate the backdoor operation|\n|-pskill|To terminate a specified process|\n|-pslist|To form a list of processes|\n|-upload|To send a specified file to the server|\n|others|Other commands are launched via cmd.exe /c|\n\n\n-----\n\nResponses to commands are sent by PUT requests to <cnc_addr>/webdav/<minsec>.htm,\nwhere <minsec> is the values of the minute and second when the backdoor was launched.\n\n#### BackDoor.Farfli.130\n\nA malicious .DLL library written in C++ and supports the 32- and 64-bit Microsoft Windows\noperating systems. It is a backdoor that allows attackers to remotely control infected computers\nvia the remote shell―by running cmd.exe and redirecting input-output to their C&C server.\n\n##### Operating routine\n\nIts original name from the export table is state.dll. It has the Cja and ServiceMain exported\nfunctions.\n\nThe C&C server address is eye[.]darknightcloud[.]com:443.\n\nThis malware is based on the publicly available Gh0st backdoor source code. Compared to the\noriginal program, BackDoor.Farfli.130 has noticeably fewer capabilities, but also has several\nspecific features. In this regard, this description will only cover the essential differences from the\nclassic Gh0st RAT.\n\nThe C&C server address is encoded with Base64 and encrypted with a simple algorithm:\n\nOther encrypted strings are decrypted by subtracting 1 from each byte of the string.\n\nThe infected computer ID is stored in the %APPDATA%\\wins.tmp file instead of the system\nregistry.\n\nThe traffic between the backdoor and C&C server is encrypted using the RC4 algorithm with the\nfollowing key:\n```\nb25lIGluIHRvIE5ldyBZb3JrIHRoYXQgbW9ybmluZyBmb3IgdGhpcyBmZW5jaW5nIG1lZ\nXQgd2l0aCBNY0J1cm5leSBTY2hvb2wuIE9ubHksIHdlIGRpZG4ndCBoYXZlIHRoZSBtZW\nV0LiBJIGxlZnQgYWxsIHRoZSBmb2lscyBhbmQgZXF1aXBtZW50IGFuZCBzdHVmZiBvbiB\n0aGUgZ29kZGFtIHN1YndheS4gSXQgd2Fzbid0IGFsbCBteSB.\n\n```\n\n-----\n\nThe BackDoor.Farfli.130 functionality is limited to the following:\n\n - Obtaining information about storage discs\n\n - Receiving the process list\n\n - Launching the command shell and redirecting input-output to the C&C server\n\n - Shutting down the computer\n\n - Setting the ID of the infected computer\n\n#### Trojan.Mirage.12\n\n**Trojan.Mirage.12 is a multi-component backdoor trojan written in C++ with the use of the**\nActive Template Library (ATL) and designed for Windows 32- and 64-bit operating systems. It is\nused to facilitate unauthorized control over infected computers and enabling access to\ninformation stored on them. The trojan is a COM server that operates in RAM within the system\nprocess.\n\n##### Operating routine\n\nThe trojan only operates if it is loaded into either the explorer.exe or regsvr32.exe\nprocess. This is due to the specifics of the sample’s operation. The trojan is registered in the\nsystem via regsvr32.exe, and its execution takes place in the context of explorer.exe.\n\nWhen running through regsvr32 (with the key /i or without keys), the DllRegisterServer\nfunction exported by the trojan is called, which registers its COM interface in the system:\n\n\n-----\n\nwhere <path> is the path to trojan’s file and <homedir> is its home directory.\n\nThe trojan enables its autorun also via regsvr32:\n```\n[<HKLM>\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\ShellIconO\nverlayIdentifiers\\ServerShellIcon] '' = '{D8956119-6E66-43BD-AAA5231F94859EE6}'.\n\n```\nThus, the process explorer.exe will load the trojan on the next restart.\n\n**Main functionality**\n\nThe trojan begins performing the primary functions either by calling the exported function\n```\nDllUnregisterServerA, or by loading the process explorer.exe. The difference is that when\n\n```\n\n-----\n\nloading by the process explorer.exe, the trojan creates a FEca72d-abc-efef mutex to prevent\nanother copy from running simultaneously.\n\nNext, it reads its configuration from the [HKCU\\\\Software\\\\Microsoft\\\\Keyboard\\\n```\n\\Set] 'HPConf’ registry key. If the specified key does not exist or the configuration stored in\n\n```\nthe registry does not match the hardcoded configuration, it uses the hardcoded configuration\nand writes it to the registry.\n\nThe configuration in the registry and in the trojan’s body is stored in encrypted form: the RC4\nalgorithm is used for encryption. The encryption key is hardcoded in the trojan body:\n```\n13 36 CF 83 2E CC 79 DF 2E AB 79 64.\n\n```\nDecryption function:\n\nThe decrypted configuration has the following structure:\n\n\n-----\n\nIn the hardcoded configuration, the fields compname_sum and compname have null values. As\nthe trojan decrypts it, it assigns values to these fields, then encrypts the already updated\nconfiguration and writes it to the registry. compname_sum is calculated based on the computer\nname:\n\nNext, the trojan loads the available plug-ins. To do so, it checks whether the %APPDATA%\\\n```\n\\Microsoft\\\\Media Player folder is present. If it exists, the trojan searches for libraries\n\n```\nwith two exported functions—GetValue and PluginEntryPoint. For each located library,\n```\nPluginEntryPoint, and then GetValue are called sequentially. The second function returns\n\n```\nthe handle of the thread that the trojan is waiting for to complete. After the thread is terminated,\nthe library file is unloaded from the process and deleted.\n\nThe sleep_time configuration parameter can contain two dates (year, month, day, hour, and\nminute) that define the time period when the trojan does not communicate with the C&C server.\nIf the current date and time do not fall within this interval or this parameter is not set, the trojan\ncommunicates with the C&C server.\n\n\n-----\n\n**Communication with the C&C server**\n\nThe trojan configuration can contain up to two C&C server’s addresses. Each server has a\nspecified domain and port. The configuration can also specify the URL to which the trojan sends\nrequests to get the control domain address—fallback_url.\n\nAll requests to the C&C server contain the bot ID:\n\nThe trojan can send two types of requests:\n\n1. A POST request with URI /result?hl=en&meta=<botid>, where botid is the bot ID.\nThe request data is encrypted using the same algorithm as the configuration.\n\n2. A GET request with URI /search?hl=en&q=<data>&meta=<botid>, where botid is the\nbot ID, and data is the request data encrypted in the same way as the configuration, and\nthen encoded in Base64 and urlencode.\n\nA POST request is only used to send a file from an infected computer to the C&C server if the\nsize of the data being sent exceeds 528 bytes.\n\nThe requests use the User-Agent string: Mozilla/4.0 (compatible; MSIE 6.0;\n```\nWin32).\n\n```\nTo check the C&C server’s operability, the trojan sends the st_pkt_hello packet:\n```\n struct st_pkt_hello\n {\n  _DWORD rnd;\n  _DWORD cmdid; // 0x10001000\n  _BYTE gap[36]; // 0x00\n };\n\n```\nwhere rnd is a random number. If the server responds to this request, the trojan uses this server\nfor further work. If none of the servers specified in the configuration work, the trojan sends a\n```\nGet request (just like that, not GET) to the specified URL. In response, it expects to obtain the\n\n```\nC&C server’s address, encrypted according to the same algorithm as the trojan configuration.\nThe address obtained in this way is then checked for operability in the same way—using the\n```\nst_pkt_hello packet.\n\n```\n\n-----\n\nWhen the trojan finds the C&C server, it starts periodically requesting commands. The packet for\nthe command request is the following:\n```\nstruct st_pkt_req_cmd\n{\n _DWORD rnd;\n _DWORD cmdid;    // 0x10001001\n _DWORD compname_sum;\n char compname[16];\n _BYTE gap[16];    // 0x00\n};\n\n```\nwhere rnd is a random number, compname_sum is the number derived from the computer’s\nname, and compname is the computer’s name.\n\nIf the server responded with the *NONE* string, the trojan ignores the \"silent\" time specified in\nthe configuration and repeats the request. If the received response is different from *NONE*, the\ntrojan saves this data to the %APPDATA%\\\\jbl file. This file is then decrypted (using the same\nalgorithm as the configuration) and divided into commands. The trojan determines the\ncommand to execute based on its first three characters:\n```\nopcode = cmdbuf[2] ^ (cmdbuf[1] * cmdbuf[0]);\n\n```\nCommand list\n\n|Command id|cmd|Description|\n|---|---|---|\n|0x2718|del|To delete a file|\n|0x28D7|get|To send the current configuration to the server|\n|0x2A43|cmd|To run the command in the command shell and send the result to the server|\n|0x2B2B|dow|To send a specified file to the server|\n|0x2C89|sde|To change the time interval for connection to the server|\n|0x2C97|rem|Self-deletion|\n|0x2D7E|wai|To idle for a specified period of time|\n|0x2EB5|loa|To launch the trojans plug-in|\n|0x2F3D|exe|To open a file|\n|0x30E1|sle|To set the inactivity period for the trojan|\n\n\n-----\n\n|0x322A|unl|To unload a plug-in and delete it from the disk|\n|---|---|---|\n|0x3353|upc|To update the configuration|\n|0x3354|upd|To request and install malicious module updates|\n|0x335C|upl|To get a file from the server and save it to the specified path|\n\n\n#### BackDoor.Siggen2.3268\n\nA backdoor written in C++ and designed to run on 32- and 64-bit Microsoft Windows operating\nsystems. The functionality of the 32-bit and 64-bit versions is identical. The backdoor is linked to\nthe OpenSSL library, which implements AES- and RSA-based encryption, as well as key\ngeneration. It is used in targeted attacks on information systems to gain unauthorized access to\ndata and transferring it to C&C servers. In the infected system, the sample was located in\n```\nSystem32 as a DLL named ssdtvrs.dll. It was installed by the ssdtvrs service. This description\n\n```\nis based on the 64-bit version.\n\n##### Operating routine\n\nIt exports the service entry point ServiceMain. Once launched, the backdoor registers a\nfunction that handles control requests, creates a thread in which it performs the main functions,\nand then waits in a loop for the service to stop.\n\n\n-----\n\n**The main thread**\n\nFirst, it prepares a configuration that can be stored both in the registry of the infected computer\nand in the body of the backdoor. It then decrypts the name of the registry key\n```\nSoftware\\Microsoft\\Internet Explorer\\Security.\n\n```\nThe backdoor checks the presence of this key first in the HKCU section, then in the HKLM section\nof the registry. Then, it loads the encrypted configuration from a parameter whose name\nmatches the name of the malicious DLL file (in this case, ssdtvrs). If the configuration is not in\nthe registry, the backdoor uses the hardcoded one.\n\nThe configuration is encrypted with RC4 and the key is generated using the following algorithm:\n\nThe configuration is stored as a sequence of blocks.\n\nBYTE BYTE BYTE[item_len]\n\nitem_id item_len item_data\n\nThe backdoor parses all the blocks in turn and saves the resulting configuration as a structure:\n\n|BYTE|BYTE|BYTE[item_len]|\n|---|---|---|\n|item_id|item_len|item_data|\n\n\n-----\n\nAfter preparing the configuration, BackDoor.Siggen2.3268 checks that the current system time\nranges between cfg.time_1 and cfg.time_2, and waits until this condition is met.\n\nIt then prepares and sends the registration packet to the C&C server. First, it creates an object of\nthe SBC02DEFE6 class (RTTI structures remained in the backdoor). This object contains another\nobject that stores connection information, and also encapsulates the AZ092342345 object,\nwhich is responsible for data encryption. After creating the SBC02DEFE6 object, the backdoor\nattempts to hinder the debugging process by closing a deliberately incorrect handle. The\nexception that occurs is processed; and if the debugger is not present, the backdoor continues\nto operate.\n\n\n-----\n\nAfter that, the cfg.C2_index_0x0D parameter is checked, according to which a specific C&C\nserver is selected from the configuration. The following addresses are hardcoded in the\nconfiguration:\n\n- 144.34.145.168\n\n- snow.swingfished[.]com\n\nThe backdoor then creates a TCP socket to connect to the server, and then prepares the\nencryption keys. The backdoor has a hardcoded public RSA key, which is encrypted with the\nsame algorithm that is used to encrypt the registry key that stores the configuration.\n\nThe decrypted RSA key is shown below.\n\n\n-----\n\nAfter that, the backdoor generates a random <span class=\"string”>WORD type value, which will\nbe used to form a packet and check the response from the server.\n\nThen, using OpenSSL, it generates a random AES key (256 bits) and generates encryption and\ndecryption keys.\n\nIt uses the RSA key to encrypt the generated key for further transmission to the C&C server.\n\n\n-----\n\nThe backdoor stores keys in the AZ092342345 object. Its structure can be represented as\nfollows:\n```\n struct AZ092342345\n {\n  vtable_AZ092342345 *vtable;\n  AB2952354 o_AB2952354_response_data;\n  AB2952354 o_AB2952354_decoded_data;\n  AB2952354 o_AB2952354_3;\n  AB2952354 o_AB2952354_4;\n  WORD check_word;\n  BYTE gap[6];\n  RSA **p_RSA; //RSA - the structure from OpenSSL library\n  AES_key AES_key;\n  WORD rnd_word;\n  DWORD dword_362;\n };\n struct AB2952354 //objects of the AB2952354 class are used as data\n containers, such as those sent and received from the server\n {\n  vtable_AB2952354 *vtable;\n  BYTE *p_buffer;\n  BYTE *p_buffer_end;\n  DWORD data_size;\n  CRITICAL_SECTION crit_sect;\n };\n struct AES_key\n {\n  char userKey[32];\n  char ivec[20];\n  int field_34;\n  QWORD field_38;\n  AES_KEY encryptKey; //AES_KEY structure from OpenSSL\n  AES_KEY decryptKey;\n };\n\n```\nThe packet sent during the handshake has a 0x10A + <rnd> length, where rnd is a random\nvalue from 0 to 63, and comes with the following structure:\n\n|WORD|DWORD|DWORD|BYTE[]|\n|---|---|---|---|\n|проверочное значение|случайное значение|случайная часть длины пакета|зашифрованный AES- ключ|\n\n\n-----\n\nThe first test value (WORD) is formed as follows.\n\nThe packet is sent to the server and a separate thread is started, which uses select to wait for a\nresponse transmitted to the socket from which the handshake packet was sent. When receiving a\nresponse, it checks the first 2 bytes of the incoming packet..\n\nIf the result is 1, the connection is reset. Otherwise, the backdoor parses the packet with the\nfollowing header.\n\nWORD DWORD DWORD DWORD\n\nпроверочное длина пакета с длина упакованных длина распакованных\nзначение заголовком данных данных\n\nThe data is encrypted using the AES algorithm with the key sent to the server in a handshake\npacket and also compressed by the zlib library.\n\nThe KCPOI982S object is initialized in the main backdoor thread and is responsible for\nprocessing commands from the C&C server.\n\n|WORD|DWORD|DWORD|DWORD|\n|---|---|---|---|\n|проверочное значение|длина пакета с заголовком|длина упакованных данных|длина распакованных данных|\n\n\n-----\n\nAfter initializing the handshake procedure, BackDoor.Siggen2.3268 encrypts the configuration\nusing RC4 in the main thread and stores it in the registry. Next, it prepares information about the\nsystem for subsequent transmission to the server. The packet header is equivalent to the packet\nheader received from the server during the handshake process; the data is compressed by zlib\nand encrypted using the AES algorithm. The transmitted information about the infected system\nis represented by the structure:\n```\n struct sysinfo\n {\n  BYTE id;\n  OSVERSIONINFOEXA os_version;\n  DWORD CPU_MHz;\n  DWORD sin_addr;\n  BYTE cfg_item_0x29_or_hostname[64];\n  BYTE cfg_C2_index;\n  DWORD tick_count_diff;\n  char field_F0[64];\n };\nid is the packet ID. In this case it is equal to 0x66.\nsin_addr is the IP address of the C&C server to which the connection is established.\ncfg_item_0x29_or_hostname is the value of the configuration parameter with the ID equal\n\n```\nto 0x29. If it is not specified, the name of the infected computer is used as the value.\n```\nfield_F0 takes values depending on the configuration parameter with the ID equal to 0x1E.\n\n```\n- cfg_item_0x1E == 0 => cfg.item_0x1F\n\n- cfg_item_0x1E == 1 => cfg.item_0x21\n\n- cfg_item_0x1E == 2 => \"c\"\n\n- cfg_item_0x1E == 3 => \"p\"\n\nAfter the sysinfo structure, a random sequence of 0 to 255 bytes is appended.\n\nAfter sending the system information, an object of the KCPOI982S class is created to process\ncommands from the C&C server. The main purpose of this object is to check the command ID\nand create another object designed to handle a specific command. The KCPOI982S object and\nother command handler objects are inherited from the AM1876234af3 class, which contains\nonly an event descriptor for synchronization and a reference to the SBC02DEFE6 object for\nmanaging the connection.\n```\nKCPOI982S creates separate threads for each command and stores an array of descriptors of\n\n```\nthese threads and interrupts them in its destructor.\n\n\n-----\n\n**Processing the C&C server’s commands**\n\nThe command ID is contained in the 1st byte of the packet payload sent by the server (after\ndecryption and unpacking).\n\n|id|Name of the handler object|Description|\n|---|---|---|\n|0x10|BCJI09RUC|To send a list of processes The following structure is formed for each process: struct process_info { BYTE id; //0x73 DWORD PID; char sz_ExeFile[x]; char sz_exe_full_path[x]; }|\n|0x15|AS01243895|To create a command shell from cmd.exe. The backdoor runs cmd.exe with StdIn,StdOut,StdErr redirection to pipes. It then sends a packet with the 0x76 byte in the payload. After that, it attempts to read the result from the pipe and send it to the server in a loop.|\n|0x01|AF434faf845|To send information about all disks (iterates through the letters, except A and B). The following structure is formed for each disk: struct drive_info { BYTE id; //0x67 BYTE drive_type; DWORD total_kbytes; DWORD kbytes_available; char sz_type_name[x]; //szTypeName field of the SHFILEINFOA structure after SHGetFileInfoA call (eg, Local Disk) char sz_filesystem_name; }|\n|0x20|AC92784f908234|To send the configuration to the C&C server. The packet’s payload is represented as the following structure: struct config_packet { BYTE id; //0x77|\n\n\n-----\n\n|Col1|Col2|cfg config; }|\n|---|---|---|\n|0x00|-|To reset the connection|\n\n\n**Artifacts**\n\n**BackDoor.Siggen2.3268 contains numerous debugging strings and the links are missing.**\n\n\n-----\n\n### Appendix 1. Indicators of compromise\n\n##### SHA1 hashes\n\n**BackDoor.Skeye**\n\na259db436aa8883cc99af1d59f05f4b1d97c178b: acess.exe\n\nb0ff476e3a273af600840d0f3dcd099274035e76: skeye.exe\n\n\n-----\n\n**BackDoor.DNSep.1**\n\n14a652b5b9d71171224541ce2b950cf55da38190: ccL100U.dll\n\nf76ae6ee508cf22f52b8533d704667a1893860d9: (payload)\n\n**BackDoor.RemShell.24**\n\nfffec74a6330e25f97b687f989bb287aeb5fbb76: ftps.dll\n\n**BackDoor.Siggen2.3268**\n\nbfa1e457afbb1f160094f65b456503b64832d249: ssdtvrs.dll\n\nce3fc5b40231b5a9dd4aeeb0f0c7ef6f7779c53e: ssdtvrs.dll\n\n**BackDoor.Farfli.130**\n\nb33e65fd1790260ad47a0dbdad2f12f555a0d6ca: Irmon32.dll\n\n**Trojan.Mirage.12**\n\nfc698eb0d7d6948605a7e5ba6708752b691a3fec: dnvdisp32.dll\n\n**BackDoor.PlugX.67**\n\nad5fc8dfe8341d08c118abe72caa7cc8d40efa11: mcutil.dll.bbc\n\n##### Domains\n\nwww2[.]morgoclass[.]com\n\nterm[.]internnetionfax[.]com\n\natob[.]kommesantor[.]com\n\nrps[.]news-click[.]net\n\nwww1[.]dotomater[.]club\n\nns02[.]ns02[.]us\n\nsnow[.]swingfished[.]com\n\n\n-----\n\nskype[.]swingfished[.]com\n\ndog[.]darknightcloud[.]com\n\neye[.]darknightcloud[.]com\n\nhome[.]sysclearprom[.]space\n\ntick[.]sysclearprom[.]space\n\natlas[.]golianbooks[.]com\n\ndm[.]golianbooks[.]com\n\n##### IP\n\n103.97.124[.]193\n\n103.91.67[.]251\n\n144.34.145[.]168\n\n185.70.185[.]231\n\n45.76.34[.]147\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://st.drweb.com/static/new-www/news/2021/april/drweb_research_attacks_on_russian_research_institutes_en.pdf"
    ],
    "report_names": [
        "drweb_research_attacks_on_russian_research_institutes_en.pdf"
    ],
    "threat_actors": [
        {
            "id": "ed4c7e37-461f-40f1-ad43-6ad7e21b32bc",
            "created_at": "2022-10-25T16:07:24.303712Z",
            "updated_at": "2025-03-27T02:02:10.165915Z",
            "deleted_at": null,
            "main_name": "TaskMasters",
            "aliases": [],
            "source_name": "ETDA:TaskMasters",
            "tools": [
                "404-Input-shell web shell",
                "ASPXSpy",
                "ASPXTool",
                "AtNow",
                "DbxDump Utility",
                "HTran",
                "HUC Packet Transmit Tool",
                "Mimikatz",
                "NBTscan",
                "PortScan",
                "ProcDump",
                "PsExec",
                "PsList",
                "RemShell",
                "RemShell Downloader",
                "gsecdump",
                "jsp File browser",
                "nbtscan",
                "pwdump",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a4aca3ca-9e04-42d1-b037-f7fb3fbab0b1",
            "created_at": "2023-01-06T13:46:39.042499Z",
            "updated_at": "2025-03-27T02:00:02.984002Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Colourful Panda",
                "BRONZE DUDLEY"
            ],
            "source_name": "MISPGALAXY:TA428",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4ae78ca3-8bc8-4d67-9df1-a85df250a8a0",
            "created_at": "2024-10-08T02:00:04.469211Z",
            "updated_at": "2025-03-27T02:00:03.437849Z",
            "deleted_at": null,
            "main_name": "TaskMasters",
            "aliases": [
                "BlueTraveller"
            ],
            "source_name": "MISPGALAXY:TaskMasters",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3c7097f4-849b-4bc0-a7e6-ba2b510722b6",
            "created_at": "2022-10-25T16:07:23.869951Z",
            "updated_at": "2025-03-27T02:02:10.003542Z",
            "deleted_at": null,
            "main_name": "Mikroceen",
            "aliases": [
                "SixLittleMonkeys"
            ],
            "source_name": "ETDA:Mikroceen",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "Microcin",
                "Mikroceen",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "PCRat",
                "logon.dll",
                "logsupport.dll",
                "pcaudit.bat",
                "sqllauncher.dll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c39b0fe6-5642-4717-9a05-9e94265e3e3a",
            "created_at": "2022-10-25T16:07:24.332084Z",
            "updated_at": "2025-03-27T02:02:10.175452Z",
            "deleted_at": null,
            "main_name": "Tonto Team",
            "aliases": [
                "Bronze Huntley",
                "CactusPete",
                "Earth Akhlut",
                "HartBeat",
                "Karma Panda",
                "LoneRanger",
                "Operation Bitter Biscuit",
                "TAG-74",
                "Tonto Team"
            ],
            "source_name": "ETDA:Tonto Team",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Bioazih",
                "Bisonal",
                "CONIME",
                "Dexbia",
                "Korlia",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1617371914,
    "ts_modification_date": 1617371914,
    "files": {
        "pdf": "https://archive.orkl.eu/f29079c38ee0d5b3a9afb0462b4475e226e9b4ab.pdf",
        "text": "https://archive.orkl.eu/f29079c38ee0d5b3a9afb0462b4475e226e9b4ab.txt",
        "img": "https://archive.orkl.eu/f29079c38ee0d5b3a9afb0462b4475e226e9b4ab.jpg"
    }
}