{
    "id": "31b6dc40-2df9-40f1-a66b-1b46808aa136",
    "created_at": "2022-10-25T16:48:20.108366Z",
    "updated_at": "2025-03-27T02:15:13.872866Z",
    "deleted_at": null,
    "sha1_hash": "f7e0afcb7fd22d35bb6ca3bd665f830c2991b713",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-08-31T15:02:20Z",
    "file_modification_date": "2019-08-31T15:02:20Z",
    "file_size": 1550936,
    "plain_text": "# More_eggs, Anyone? Threat Actor ITG08 Strikes Again\n\n**[securityintelligence.com/posts/more_eggs-anyone-threat-actor-itg08-strikes-again](https://securityintelligence.com/posts/more_eggs-anyone-threat-actor-itg08-strikes-again/)**\n\n[IBM X-Force Incident Response and Intelligence Services (IRIS) responds to security incidents](https://www.ibm.com/security/services/ibm-x-force-incident-response-and-intelligence)\nacross the globe. During a recent incident response investigation, our team identified new attacks\n[by the financially motivated attack group ITG08, also known as FIN6.](https://attack.mitre.org/groups/G0037/)\n\nITG08 is an organized cybercrime gang that has been active since 2015, mostly targeting pointof-sale (POS) machines in brick-and-mortar retailers and companies in the hospitality sector in\nthe U.S. and Europe. More recently, the group has been observed targeting e-commerce\nenvironments by injecting malicious code into online checkout pages of compromised websites —\na technique known as online skimming — thereby stealing payment card data transmitted to the\nvendor by unsuspecting customers.\n\nBased on our investigation and analysis of its adversarial tactics, techniques and procedures\n(TTPs), we believe ITG08 is actively attacking multinational organizations, targeting specific\nemployees with spear phishing emails advertising fake job advertisements and repeatedly\n[deploying the More_eggs JScript backdoor malware (aka Terra Loader, SpicyOmelette). This tool,](https://attack.mitre.org/software/S0284/)\na TTP observed in ITG08 attacks since 2018, is sold on the dark web by an underground\nmalware-as-a-service (MaaS) provider. Attackers use it to create, expand and cement their\nfoothold in compromised environments. Past campaigns by ITG08 using the More_eggs backdoor\n[were last reported in February 2019.](https://usa.visa.com/dam/VCOM/global/support-legal/documents/fin6-cybercrime-group-expands-threat-To-ecommerce-merchants.pdf)\n\nIn the campaign we investigated, the attackers employed additional TTPs historically associated\nwith ITG08, including the use of Windows Management Instrumentation (WMI) to automate the\nremote execution of PowerShell scripts, PowerShell commands with base64 encoding, and\n[Metasploit and PowerShell to move laterally and deploy malware. Lastly, the attackers used](https://www.metasploit.com/)\nComodo code-signing certificates several times during the course of the campaign. Many of the\nabove TTPs are not unique to ITG08, but collectively, and with the use of More_eggs, strengthen\nthe link to this group.\n\n\n-----\n\nLet s take a closer look at ITG08 s TTPs that are relevant to the campaign we investigated,\nstarting with its spear phishing and intrusion tactics and covering information on its use of the\n[More_eggs backdoor. Please note that Visa has attributed the use of this backdoor to FIN6 in](https://usa.visa.com/dam/VCOM/global/support-legal/documents/fin6-cybercrime-group-expands-threat-To-ecommerce-merchants.pdf)\nattacks that took place in 2018. Further linking the activity with the same threat actor, several of\nthe network indicators and TTPs we encountered in this case — including the use of fake job\nadvertisements as a lure in spear phishing — overlap with those reported earlier in 2019 by both\n[Visa and Proofpoint researchers.](https://www.proofpoint.com/us/threat-insight/post/fake-jobs-campaigns-delivering-moreeggs-backdoor-fake-job-offers)\n\n## Analysis of the Intrusion\n\nITG08’s TTPs in compromising targeted organizations follow the typical framework for APT\nattacks. The following sections go over the steps taken by the attackers to gain an initial foothold\nand persist on the victimized organization’s networks.\n\n### Initial Compromise\n\nTo gain access to victim environments, the threat actor began by targeting handpicked employees\nusing LinkedIn messaging and email, advertising fake jobs to lure recipients into checking into the\nsupposed offers. In one case, we uncovered evidence indicating that the attacker had established\ncommunication with a victim via email and convinced them to click on a Google Drive URL\npurporting to contain an attractive job advert. Once clicked, the URL displayed the message,\n“Online preview is not available,” then presented a second URL leading to a compromised or\nrogue domain, where the victim could download the payload under the guise of a job description:\n\n_Figure 1: Link provided in spear phishing email to an employee_\n\nThat URL, in turn, downloaded a ZIP file containing a malicious Windows Script File (WSF) that\ninitiated the infection routine of the More_eggs backdoor:\n\n\n-----\n\n_Figure 2: Final landing page that downloads a malicious file_\n\nBased on file system artifacts examined during our investigation, the ZIP file and WSF files were\ndeleted upon a successful malware infection, likely in an attempt to prevent researchers from\nrecovering the original files from the filesystem. The filesystem, however, contained evidence of a\nnonmalicious decoy document dropped to the disk drive during the spear phishing attacks.\n\n### Gaining a Foothold\n\nThe spear phishing attacks unfortunately led to initial compromise and the installation of the\nMore_eggs JScript backdoor, which established a reverse shell connection to the attacker’s\ncommand-and-control (C&C) infrastructure. Additional capabilities of the More_eggs malware\ninclude the download and execution of files and scripts and running commands using cmd.exe.\n\nX-Force IRIS determined that the More_eggs backdoor later downloaded additional files,\nincluding a signed binary shellcode loader and a signed Dynamic Link Library (DLL), as described\nbelow, to create a reverse shell and connect to a remote host. The shellcode loader was\nobserved on one infected device as updater.exe with the Metasploit-style service name\n_APTYnDS1ABEuUHEA, indicating that it was installed as a service._\n\n### Reconnaissance, Lateral Movement and Privilege Escalation\n\nOnce the attackers established a foothold on the network, they employed WMI and PowerShell\ntechniques to perform network reconnaissance and move laterally within the environment. This\ntype of method, called living off the land, can often blend with legitimate system administration\nactivities, which can make it challenging for security controls to detect.\n\nThe attackers used this technique to remotely install a Metasploit reverse TCP stager on select\n[systems, subsequently spawning a Meterpreter session and Mimikatz. Meterpreter is a payload](https://www.csoonline.com/article/3353416/what-is-mimikatz-and-how-to-defend-against-this-password-stealing-tool.html)\ncomponent in the Metasploit Framework that uses in-memory DLL injection, which can lead to a\n\ni b l li i d / d Mi ik t i t l it ti t l\n\n\n-----\n\nOnce the Metasploit reverse TCP stager executed, it downloaded and loaded a second stage\nMeterpreter DLL into memory, allowing the attacker to spawn a Meterpreter session via a handler\nand initiate the loading of extensions, such as Mimikatz. In addition to the More_eggs malware,\nthe attacker leveraged in-memory attacks by injecting malicious code, in this case Mimikatz, into\nlegitimate system processes.\n\n### Establishing Persistence\n\nTo cement their foothold and add persistence throughout the compromised environment, X-Force\nIRIS uncovered evidence that the attacker had selected several additional devices on which to\ninstall the More_eggs backdoor, creating redundancy in ways to get back into the network. ITG08\nremotely connected to these devices using PowerShell and WMI and downloaded and executed a\nDLL file, subsequently installing More_eggs on the device without dropping the nonmalicious\ndecoy document.\n\n## More_eggs: Malware Analysis\n\n### ITG08 Leveraging a Malware-as-a-Service Provider\n\nA recently rising attack tool in ITG08 campaigns has been the More_eggs JScript backdoor. But\nwhile it was recently identified with ITG08 activity, the More_eggs backdoor is apparently\n[developed and sold through an underground MaaS provider. This vendor not only supplies the](https://medium.com/@quoscient/golden-chickens-uncovering-a-malware-as-a-service-maas-provider-and-two-new-threat-actors-using-61cf0cb87648)\nbackdoor malware, but also offers related technical services, such as preparing the network\ninfrastructure to download More_eggs-related files and furnishing resources for C&C purposes.\n\nIn addition to More_eggs, the same underground vendor is also responsible for producing the\nsigned DLL described below, which creates a reverse shell (ReverseShell Executable). We based\nthis assessment on code similarities between the DLL and other samples created by the same\nvendor, including the DLL that drops the More_eggs backdoor.\n\n\n-----\n\n_Figure 3: Network indicators revealing the use of an underground MaaS vendor selling_\n_More_eggs and malicious infrastructure services_\n\n### The More_eggs Dropper DLL\n\nAfter a successful phishing attack in which users have opened emails and browsed to malicious\nlinks, ITG08 attackers install the More_eggs JScript backdoor on user devices alongside several\nother malware components.\n\nThe process begins with the consistent execution of a malicious DLL using the legitimate\n_regsvr32.exe Windows Utility. Once executed, the DLL is deleted from the system and its_\ncomponents are dropped to the system.\n\nBefore being deleted, the DLL executes a string decoding routine that is designed to execute for\nabout a minute, spiking central processing unit (CPU) usage for the regsvr32.exe process. Once\nthe strings are decoded, the More_eggs components are decrypted, dropped to the system\n(normally in the %APPDATA%\\Microsoft\\ or %ProgramData%\\Microsoft\\ directories) and\nexecuted.\n\n\n-----\n\n_Figure 4: Sample encoded and decoded strings_\n\n### More_eggs Components\n\nThe More_eggs dropper DLL creates the following components on the infected device (further\ndetail on each component in the chart follows in the next section):\n\n**Sample File Name** **Description**\n\n5795C3AC7F57F.txt An XSL stylesheet file that contains an obfuscated More_eggs\nJScript loader.\n\n625222E09B6CD028459.txt Benign XML document occasionally used as a parameter when exe‐\ncuting the msxsl.exe utility.\n\n27603.docx Benign Word Document decoy. The Decoy was not always dropped\nin the executions of the DLLs analyzed.\n\nA70613FF7F5DE98.txt Obfuscated script file that executes msxsl.exe with the appropriate\nparameters as arguments. Once the script executes, the More_eggs\nJScript is loaded into the memory space of msxsl.exe.\n\nmsxsl.exe Benign Microsoft Command Line Transformation Utility known to be\nused to execute malicious code and bypass application whitelisting.\n\n_Figure 5: Components created by DLL_\n\n_msxsl.exe is executed by the script file A70613FF7F5DE98.txt, which is obfuscated as shown_\nbelow:\n\n_Figure 6: Obfuscated script file A70613FF7F5DE98.txt_\n\nThe use of msxsl.exe is a known tactic to execute malicious code and bypass application\nwhitelisting. The deobfuscated command is built as follows:\n\n_“C:\\Users\\<username>\\AppData\\Roaming\\Microsoft\\msxsl.exe” “C:\\Users\\_\n\n\n-----\n\nOnce the above command is executed, the More_eggs JScript loader 5795C3AC7F57F.txt will\ndeobfuscate the embedded More_eggs JScript. A sample loader is shown below.\n\nThe start of the XSL file:\n\n_Figure 7: JScript loader sample_\n\nThe end of the XSL file:\n\n_Figure 8: JScript loader sample_\n\nThe “select” value within the template tag points to the function in the msxsl:script tag, which will\nexecute when the msxsl.exe command is run. The JScript loader file is highly obfuscated and\ndecodes the More_eggs backdoor in a variety of ways, including RC4 decryption.\n\n### Analyzing the More_eggs JScript Backdoor\n\nThe analysis in this section details the functionality of More_eggs backdoor samples specific to\nthis investigation, so please bear in mind that the same malware can be deployed differently in\nother campaigns and by alternate attackers.\n\nThe core functionality of the samples analyzed in this campaign remained the same as described\nby previous researchers. We aimed to add additional detail about the inner workings of the\nmalware, including its C&C communications flow, its filesystem activity, and some encryption and\nencoding schemes used by the samples we analyzed.\n\nThe More_eggs backdoor is executed entirely in memory, never touching the filesystem in an\nunencrypted state. Notable configuration data is hardcoded and includes its C&C server address,\nmalware version number and an Rkey value, which is believed to identify campaign perpetrators\nto the vendor:\n\nThe Rkey value is appended with a two-byte, pseudorandomly generated string used to\nconstruct an RC4 key.\nThe Rkey variable is part of the ciphering key used to encrypt C&C communications.\nThe RC4 key is then used to encrypt data, which is additionally basE91 encoded and sent\n\n\n-----\n\nUpon initial execution, the backdoor checks its environment to determine whether it is running\nwith administrative or user privileges, and if proper components are present on the system. To\ncheck the user’s privilege level on the newly infected device, it attempts to read the registry key\n_HKEY_USERS\\S-1-5-19\\Environment\\TEMP; a successful read means it is running with_\nadministrative privileges, and the backdoor builds the path %ProgramData%\\Microsoft. If it is not\nrunning with administrative privileges, the path %AppData%\\Microsoft is used.\n\nThe More_eggs backdoor obtains the username and computer name of the infected device, and if\nrunning with privileges, it reads the following registry key:\n_HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Notepad\\<computername>. If not running with_\nprivileges, it reads the key HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Notepad\\\n_<username> instead._\n\nThe data in these Windows registry keys is expected to be a comma-separated list of files with no\nextension. The .txt extension is appended to the name by the backdoor. If these files exist along\nwith msxsl.exe in the proper location, either %ProgramData%\\Microsoft or %AppData%\\Microsoft,\nthe malware’s execution continues.\n\nOnce the environment is checked, the backdoor will check for network connectivity by sending an\nHTTP GET request to hxxp://www.w3[.]org/1999/XSL/Format, ensuring the response is “This is\nanother XSL namespace\\n.”\n\n_GET /1999/XSL/Format HTTP/1.1_\n_Accept: */*_\n_Accept-Language: en-us_\n_UA-CPU: [CPU version]_\n_Accept-Encoding: gzip, deflate_\n_User-Agent: [User agent string here]_\n_Host: www.w3.org_\n_Connection: Keep-Alive,_\n\n_Figure 9: HTTP GET request_\n\nIf the connection is successful, the backdoor builds a string formatted with “|<random-value>|”.\nThe random value is between 8 and 32 bytes long, RC4-encrypted, basE91 encoded, and\nsubsequently sent to the C&C in an HTTP POST request.\n\nThe RC4 key used is generated from the Rkey variable value:\n\n_POST HTTP/1.1_\n_Connection: Keep-Alive_\n_Accept: */*_\n_Accept-Language: en-us_\n_User-Agent: [User agent string]_\n_Content-Length: 36_\n_Host:_\n_6R+#9fWCy)htQSo4:H9&JSMTx|X[OEKj^gXE_\n\n_Figure 10: HTTP POST request_\n\nThe C&C response is expected to be between 8 and 32 bytes long, nothing is done with the\n\nTh d l t h d h k b t th b kd d th C&C\n\n\n-----\n\n_GET /avIRga9sfvjGj3HCPGlgzaBXOof3u7wq HTTP/1.1_\n_Connection: Keep-Alive_\n_Accept: */*_\n_Accept-Language: en-us_\n_User-Agent: [User agent string]_\n_Host: 8.8.8.8_\n\n_Figure 11: HTTP GET request to 8.8.8.8_\n\nIf the handshake is successful, the backdoor proceeds to collect system information from the\ninfected device using a series of WMIC commands.\n\n_“%comspec% /c wmic path win32_Operatingsystem get SerialNumber /FORMAT:Textvaluelist | find‐_\n_str /R /C:\\”SerialNumber=\\” >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\12025.txt\\” & vol %HOMEDRIVE% >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\50573.txt\\” & wmic csproduct get Name_\n_/FORMAT:Textvaluelist | findstr /R /C:\\”Name=\\” >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\58678.txt\\” & tasklist /FO CSV /NH >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\39054.txt\\” & ver >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\28535.txt\\” & wmic os get ProductType_\n_/FORMAT:Textvaluelist | findstr /R /C:\\”ProductType=\\” >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\4140.txt\\” & ipconfig | findstr /R /C:\\”IPv4 Address\\” >_\n_\\”C:\\\\Users\\\\mal_re\\\\AppData\\\\Local\\\\Temp\\\\65390.txt\\””_\n\n_Figure 12: System information collection_\n\nThe infected device’s system information is written to several %Temp%\\<random-filenames>.txt\nfiles. The contents of the files are read and then the files themselves are deleted.\n\nThe More_eggs backdoor accepts the following commands from its remote operator:\n\n**Command** **Description**\n\nd&exec Download and execute an executable (.exe or .dll).\n\nmore_eggs Delete the current More_eggs and replace it.\n\nGtfo Uninstall activity.\n\nmore_onion Execute a script.\n\nvia_c Run a command using “cmd.exe /C”.\n\n_Figure 13: More_eggs commands_\n\n### Meterpreter Reverse TCP Stagers\n\nBeyond using More_eggs as a backdoor, the attackers in this campaign also used offensive\n\n|Command|Description|\n|---|---|\n|d&exec|Download and execute an executable (.exe or .dll).|\n|more_eggs|Delete the current More_eggs and replace it.|\n|Gtfo|Uninstall activity.|\n|more_onion|Execute a script.|\n|via_c|Run a command using “cmd.exe /C”.|\n\n\n-----\n\nThe PowerShell scripts analyzed during our investigation contained Metasploit Reverse TCP\nstagers. These stagers were used to execute shellcode that connected back to an attacker’s\nserver and injected Meterpreter components, such as Mimikatz, into the memory space of\nlegitimate processes. After injecting Meterpreter into memory, the attacker had complete control\nof the infected device.\n\nThe reverse TCP PowerShell stagers functioned as follows:\n\n1. The reverse TCP PowerShell stagers were obfuscated with base64 encoding and GZip\n\ncompression. This encoding scheme is standard for Meterpreter PowerShell stagers. The\noriginal command contained a base64-encoded loader script.\n2. The loader script base64 decodes, Gzip decompresses and executes a Metasploit\n\nPowerShell reflection payload in memory.\n3. The reflection payload base64 decodes a Meterpreter reverse TCP shellcode, injects it into\n\nmemory using .NET reflection methods and executes the decoded shellcode.\n4. The shellcode connects back to the attacker’s server. Meterpreter components, such as the\n\ncore module and metsvr.dll, and extensions, such as Mimikatz, are injected into the\nmemory space of a legitimate process.\n\n_Figure 14: Original command_\n\n_Figure 15: Decoded loader_\n\n_Figure 16: Decoded reflection payload_\n\n### Metasploit Shellcode Loader\n\nAs our analysis continued, X-Force IRIS found a UPX-packed Metasploit shellcode loader\n(49340.txt) during the forensic investigation of compromised devices. This loader attempted to\nmasquerade as the Apache Bench application and notably contained metadata and project paths\n(.PDB), indicating that it may be attempting to masquerade as other applications as well, a rather\ntypical behavior for malicious binaries.\n\nThe shellcode was loaded into memory and designed to receive an RC4-encrypted buffer, which\nwas decrypted and executed in memory. The sample also contained a Comodo code-signing\ncertificate issued to “MAHTEM LTD,” which we believe is one of a number of fake companies\nestablished to purchase the certificates.\n\nThe sample we analyzed further contained five binary entries in a resource named “REGISTRY”\n— 35, 224, 409, 3908 and 4994 — each containing some obfuscated shellcode.\n\nOnce loaded into memory, the shellcode connected back to a remote host, receiving 4 bytes in\nreturn. Those were XORed with the string 0xad350bdd and had 0x100 added to it. This value was\nthen used as the size specification for the next received buffer, which was RC4-decrypted with the\nresulting 16-byte key and executed in memory.\n\n### A ReverseShell Executable\n\nYet another tool in the attackers’ arsenal for this campaign was a DLL backdoor executable that\nX-Force IRIS found during the investigation When executed via its DllRegisterServer export\n\n\n-----\n\n## ITG08 Attacks Organizations for Financial Gain\n\nITG08 has been around for over four years now. Its attacks are financially motivated,\nsophisticated and persistent. The group historically has specialized in stealing payment card data\nfrom POS machines and has more recently expanded operations to target card-not-present data\nfrom online transactions. To follow information about ITG08 as it emerges, please join us on XForce Exchange.\n\n## Mitigation Tips\n\nEffective network defense and threat intelligence rely on multiple factors, such as knowing the\nnetwork’s attack surface, understanding the threat actor’s motivations and TTPs, and the skill and\nknowledge of the security team that enable it to identify malicious behavior.\n\nIBM X-Force IRIS has gained insight into ITG08’s intrusion methods, ability to navigate laterally,\nuse of custom and open-source tools, and typical persistence mechanisms. Our team has\nprovided the following mitigation tips for defenders who are looking out for attacks by this group.\n\n### Educate Users About Email\n\nX-Force IRIS determined that the ITG08 compromise was the result of a phishing email in which\nthe initial compromise was made possible by a victim who clicked on a malicious attachment.\nRole-based security awareness training should be at the top of the list of any organization’s\nmitigation strategies to help employees recognize phishing emails and possible malicious\nattachments, and to educate them about their security responsibilities with regards to reporting\npotentially malicious emails.\n\n### Search for Known IoCs\n\nAfter the phishing email resulted in a successful infiltration, ITG08 used the More_eggs backdoor\nto gain a foothold and infect additional devices. More_eggs-related artifacts such as the DLL\ndropper have extremely low antivirus (AV) detection rates, based on analysis conducted via\nVirusTotal (VT). For example, a More_eggs DLL dropper submitted to VT on April 18, 2019 had a\ndetection rate of only 5 percent.\n\nTo detect this malware, critical events should be analyzed based on the attacker’s patterns.\nSYSMON or an endpoint detection and response tool should be configured to detect the\ncombined use of msxsl.exe and WMI. In addition, Registry keys and scheduled tasks should be\nanalyzed for indications of persistence. The network should also be scrutinized for any privilege\nescalation events and any signs of internal reconnaissance. YARA signatures should also be\ncreated to assist security personnel in detecting the More_eggs malware. YARA signatures for XForce IRIS premium subscribers can be provided on request.\n\n### Analyze Logs\n\nOther mitigation strategies against this type of activity include analyzing host-based firewall logs\nfor internal pivoting, unauthorized listening executables and scanning activity. In addition,\nconfiguring PowerShell script logging and identifying any obfuscation will assist in mitigating\n\n\n-----\n\n### Monitor for Remote Services\n\nX-Force IRIS also recommends taking steps to prevent lateral movement. Although lateral\nmovement can be difficult to detect, a spike in usage of Windows tools, such as remote\nadministration services (PowerShell Remoting and WMI), should be monitored. Detection and\nmonitoring capabilities should be in place and network defenders should be familiar with what is\nconsidered a “normal” baseline on their user network. Without a baseline of “normal” activity, the\nuse of Windows tools may blend in with legitimate activity, which can allow attackers to continue\nto live off the land unnoticed.\n\n### Rethink Network Architecture\n\nSecurity defenders should examine network architecture to see how the network is segregated,\nwhat Windows tools are restricted or used by administrators, and what alerts are set up to warrant\npersonnel review. Least privilege principals should be implemented for all users on the network,\nand a strong password management system with two-factor authentication and password\nexpiration dates should be deployed as an additional layer of security.\n\n### Pen Test!\n\nOrganizations looking to limit the ways by which attackers can infiltrate their networks should be\nmindful of ongoing patching of vulnerabilities. After reaching maturity on the vulnerability\n[assessment front, mitigation strategies should also include penetration testing to find unknown](https://www.ibm.com/security/services/offensive-security-services)\nvulnerabilities related to people, software and hardware used on the organization’s critical assets\nand externally facing resources.\n\n### Incident Response\n\n[Nowadays, no organization can be exempt from planning and drilling incident response plans in](https://securityintelligence.com/articles/how-to-create-an-effective-incident-response-plan/)\nthe face of potential security incidents. Conducting tabletop exercises and regularly drilling plans\ncan help organizations proactively prepare and take control of an incident if ever one should\noccur.\n\n[For additional resources and information, please check out X-Force IRIS. If you believe your](https://www.ibm.com/security/services/ibm-x-force-incident-response-and-intelligence)\norganization may be under attack, please call the X-Force Emergency Response Hotline at 888241-9812.\n\n## Appendix A: IoCs\n\n**More_eggs C&C domains:**\n\napi[.]cloudservers[.]kz\nmail[.]rediffmail[.]kz\nsecure[.]cloudserv[.]ink\nmetric[.]onlinefonts[.]kz\nnews[.]bradpitt[.]kz\n\n**Landing page domains (downloads files):**\n\n\n-----\n\n**Meterpreter C&C IP addresses:**\n\n185[.]162[.]128[.]70*.\n185[.]243[.]115[.]50\n192[.]99[.]20[.]90\n192[.]187[.]103[.]42\n37[.]1[.]221[.]212.\n\n_*Also the C&C IP address for the Metasploit Shellcode Loader._\n\n**ReverseShell executable (DLL) C&C IP address:**\n\n185[.]204[.]2[.]182\n\n**File hashes:**\n\n**Description** **SHA256**\n\n5795C3AC7F57F.txt b3537701e054823836da9c532560d30f01e38e549f‐\nb813206afd699ecde8a97c\n\nA70613FF7F5DE98.txt 28497c50d65c9f1d0233fc193a43014497fadddb1af8e7f5dbc6eef‐\nb3d4ede02\n\n625222E09B6CD028459.txt 80716c2a49739850d8ccd1c035ea4bcc2‐\nda39527693c71b800c99ed2ea2c430f\n\nMore_eggs backdoor 37831e465728a913a‐\ncab317b65c4474b8e6a4570e78c39c8b8c9b956e5d6db25\n\nMetasploit Shellcode d9a245f1fb502606c226c364aa1090f25916e68f5ff24e‐\nLoader f75be87ad6a2e6dcc9\n\nReverseShell Executable 78a87d540c1758c6b4dcabb7b825ea3a186ef61e7439045e‐\nce3ce3205c7e85a2\n\n[Ole Villadsen](https://securityintelligence.com/author/ole-villadsen/)\nCyber Threat Hunt Analyst, IBM Security\n\nOle Villadsen is an analyst on the Threat Hunt & Discovery Team within IBM X-Force Incident\nResponse and Intelligence Services (IRIS), where he investiga...\n[read more](https://securityintelligence.com/author/ole-villadsen/)\n\n|Description|SHA256|\n|---|---|\n|5795C3AC7F57F.txt|b3537701e054823836da9c532560d30f01e38e549f‐ b813206afd699ecde8a97c|\n|A70613FF7F5DE98.txt|28497c50d65c9f1d0233fc193a43014497fadddb1af8e7f5dbc6eef‐ b3d4ede02|\n|625222E09B6CD028459.txt|80716c2a49739850d8ccd1c035ea4bcc2‐ da39527693c71b800c99ed2ea2c430f|\n|More_eggs backdoor|37831e465728a913a‐ cab317b65c4474b8e6a4570e78c39c8b8c9b956e5d6db25|\n|Metasploit Shellcode Loader|d9a245f1fb502606c226c364aa1090f25916e68f5ff24e‐ f75be87ad6a2e6dcc9|\n|ReverseShell Executable|78a87d540c1758c6b4dcabb7b825ea3a186ef61e7439045e‐ ce3ce3205c7e85a2|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.08.29.FIN6_ITG08/More_eggs%2C%20Anyone_%20Threat%20Actor%20ITG08%20Strikes%20Again.pdf"
    ],
    "report_names": [
        "More_eggs, Anyone_ Threat Actor ITG08 Strikes Again"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7a257844-df90-4bd4-b0f1-77d00ff82802",
            "created_at": "2022-10-25T16:07:24.376356Z",
            "updated_at": "2025-03-27T02:02:10.199451Z",
            "deleted_at": null,
            "main_name": "Venom Spider",
            "aliases": [
                "Golden Chickens",
                "Venom Spider"
            ],
            "source_name": "ETDA:Venom Spider",
            "tools": [
                "More_eggs",
                "PureLocker",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Taurus Loader Reconnaissance Module",
                "Taurus Loader Stealer Module",
                "Taurus Loader TeamViewer Module",
                "Terra Loader",
                "TerraCrypt",
                "TerraPreter",
                "TerraRecon",
                "TerraStealer",
                "TerraTV",
                "TerraWiper",
                "ThreatKit",
                "VenomKit",
                "VenomLNK",
                "lite_more_eggs"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88802a4b-5b3d-42ee-99e6-8a4f5fd231f6",
            "created_at": "2023-01-06T13:46:38.851345Z",
            "updated_at": "2025-03-27T02:00:02.935087Z",
            "deleted_at": null,
            "main_name": "GC01",
            "aliases": [
                "Golden Chickens",
                "Golden Chickens01",
                "Golden Chickens 01"
            ],
            "source_name": "MISPGALAXY:GC01",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ee3363a4-e807-4f95-97d8-b603c31b9de1",
            "created_at": "2023-01-06T13:46:38.485884Z",
            "updated_at": "2025-03-27T02:00:02.845851Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "Camouflage Tempest",
                "MageCart Group 6",
                "G0037",
                "TA4557",
                "SKELETON SPIDER",
                "ITG08",
                "White Giant",
                "GOLD FRANKLIN",
                "ATK88"
            ],
            "source_name": "MISPGALAXY:FIN6",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f5c90ccc-0f18-4e07-a246-b62101ab2f6f",
            "created_at": "2023-01-06T13:46:38.854407Z",
            "updated_at": "2025-03-27T02:00:02.935908Z",
            "deleted_at": null,
            "main_name": "GC02",
            "aliases": [
                "Golden Chickens",
                "Golden Chickens02",
                "Golden Chickens 02"
            ],
            "source_name": "MISPGALAXY:GC02",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "12517c87-040a-4627-a3df-86ca95e5c13f",
            "created_at": "2022-10-25T16:07:23.61665Z",
            "updated_at": "2025-03-27T02:02:09.889471Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "ATK 88",
                "Camouflage Tempest",
                "FIN6",
                "Gold Franklin",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "TAG-CR2",
                "White Giant"
            ],
            "source_name": "ETDA:FIN6",
            "tools": [
                "AbaddonPOS",
                "Agentemis",
                "AmmyyRAT",
                "Anchor_DNS",
                "BlackPOS",
                "CmdSQL",
                "Cobalt Strike",
                "CobaltStrike",
                "FlawedAmmyy",
                "FrameworkPOS",
                "Grateful POS",
                "JSPSPY",
                "Kaptoxa",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LockerGoga",
                "MMon",
                "Magecart",
                "Meterpreter",
                "Mimikatz",
                "More_eggs",
                "NeverQuest",
                "POSWDS",
                "Reedum",
                "Ryuk",
                "SCRAPMINT",
                "SONE",
                "SpicyOmelette",
                "StealerOne",
                "Taurus Loader Stealer Module",
                "Terra Loader",
                "TerraStealer",
                "Vawtrak",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "cobeacon",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b3acfb48-b04d-4d3d-88a8-836d7376fa2e",
            "created_at": "2024-06-19T02:03:08.052814Z",
            "updated_at": "2025-03-27T02:05:17.368029Z",
            "deleted_at": null,
            "main_name": "GOLD FRANKLIN",
            "aliases": [
                "ITG08 ",
                "MageCart Group 6 ",
                "Skeleton Spider ",
                "White Giant ",
                "FIN6 "
            ],
            "source_name": "Secureworks:GOLD FRANKLIN",
            "tools": [
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " PowerSploit",
                " PowerUpSQL",
                " RemCom",
                "FrameWorkPOS"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ea7bfe06-7c23-481d-b8ba-eafa6cda3bc9",
            "created_at": "2022-10-25T15:50:23.317961Z",
            "updated_at": "2025-03-27T02:00:55.440858Z",
            "deleted_at": null,
            "main_name": "FIN6",
            "aliases": [
                "FIN6",
                "Magecart Group 6",
                "ITG08",
                "Skeleton Spider",
                "TAAL",
                "Camouflage Tempest"
            ],
            "source_name": "MITRE:FIN6",
            "tools": [
                "FlawedAmmyy",
                "GrimAgent",
                "FrameworkPOS",
                "More_eggs",
                "Cobalt Strike",
                "Windows Credential Editor",
                "AdFind",
                "PsExec",
                "LockerGoga",
                "Ryuk",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041713,
    "ts_creation_date": 1567263740,
    "ts_modification_date": 1567263740,
    "files": {
        "pdf": "https://archive.orkl.eu/f7e0afcb7fd22d35bb6ca3bd665f830c2991b713.pdf",
        "text": "https://archive.orkl.eu/f7e0afcb7fd22d35bb6ca3bd665f830c2991b713.txt",
        "img": "https://archive.orkl.eu/f7e0afcb7fd22d35bb6ca3bd665f830c2991b713.jpg"
    }
}