{
    "id": "31cb4c9f-304e-4ce6-9a55-69831405ebec",
    "created_at": "2023-01-12T15:01:08.063085Z",
    "updated_at": "2025-03-27T02:05:40.960205Z",
    "deleted_at": null,
    "sha1_hash": "946c53b6e9412ee87043524e12fc65f34dec9618",
    "title": "2020-05-30 - Exposing the UAE’s Underground Digital Dangers- The Attack Surface of One of the Most Digitally Advanced Countries in the Arab World",
    "authors": "",
    "file_creation_date": "2022-05-28T03:56:59Z",
    "file_modification_date": "2022-05-28T03:56:59Z",
    "file_size": 2972248,
    "plain_text": "# Exposing the UAE’s Underground Digital Dangers: The Attack Surface of One of the Most Digitally Advanced Countries in the Arab World\n\n**ke-la.com/exposing-the-uaes-underground-digital-dangers-the-attack-surface-of-one-of-the-most-digitally-advanced-**\ncountries-in-the-arab-world/\n\nMay 30, 2021\n\nThe UAE has gained global attention for the incredible improvements the country has\n**gone through over the last few decades. While the UAE’s economy continues to**\n**flourish, cybercriminals will carry on with their efforts of trying to identify where their**\n**next worthy targets may be. With the growing success of advancing their economy and**\ntechnological capabilities, UAE-related entities must continue to push their cybersecurity\nefforts as well to ensure that their wealth will not be harmed by lucrative cybercriminals\noperating in the cybercrime underground ecosystem. This research lays out the major\nunderground digital dangers that KELA’s researchers have identified posing a threat to UAErelated entities.\n\nThe research’s highlights include:\n\nDuring the last six months (December 2020-May 2021), KELA observed numerous\n**compromised network access listings to UAE-related private and public entities**\n**offered for sale on cybercrime forums, including one that was possibly used in**\n**an attack by the Avaddon ransomware gang.**\nAmong these, KELA detected several threat actors specifically targeting UAE\n**entities, by selling data and network access related to UAE companies.**\nKELA discovered that UAE-related email addresses were exposed more than 1.2\n**million times, with more than 200,000 of them being related to employees of**\ngovernment, educational, academic, and nonprofit entities.\nKELA also identified more than 68,000 compromised accounts related to UAE\n**users on corporate portals, social media, e-commerce stores, and government**\nwebsites.\n\n## Exposure of the Humans: Diving into UAE Organizations’ Compromised Credentials and Accounts\n\nControlling every move made by employees is never simple, especially in organizations\nwhere employees are connecting from all different locations and may be registered to all\ntypes of services with their corporate email addresses. To kick off this research, KELA looked\ninto the possible leaked credentials or compromised accounts pertaining to UAE-related\nentities, which could provide cybercriminals with what they need to compromise an\norganization. Let’s first put the terms upfront:\n\n\n-----\n\n**[Leaked Credentials refer to credentials from various breached databases constantly traded](https://www.zdnet.com/article/23600-hacked-databases-have-leaked-from-a-defunct-data-breach-index-site/)**\nand circulating in the underground. For the most part, these databases include private and\ncorporate email addresses and associated passwords, including plaintext ones. This data\ncan enable attackers to access the company’s resources and provide further malicious\nactivity, such as account takeover attacks, social engineering, phishing, and malware\nspreading campaigns.\n**Compromised Accounts refer to credentials, cookie sessions and additional technical**\nfingerprints which are offered for sale on automated underground marketplaces such as\n[Genesis and more. These accounts are breached and stolen from victims’ computers](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/)\ngenerally via infections by banking trojans or other stealers. Such accounts can grant access\nto tools and software used in a targeted environment, such as RDP, VPN solutions, and\nmore. They could be leveraged by a sophisticated actor to gain initial network access to the\nrelevant corporate network.\nUpon analyzing this data, we identified that compromised UAE data is generally seen due to\n[third-party breaches and leaks – such as in the recent Facebook dump, however, we also](https://www.khaleejtimes.com/technology/facebook-data-on-more-than-500-million-accounts-found-online)\nidentified the Middle East- or UAE-specific offers being offered by criminal actors in\nunderground forums. These databases can contain personal and corporate email addresses,\npasswords, phone numbers, corporate documents, internal information of companies, and\nmore.\nThe most typical offers that our research identified include:\n**Databases containing companies’ information**\nAmong several, KELA’s researchers have handpicked just a couple of examples to\nshowcase the severity of compromised company information being traded between criminal\nactors. One recent offer we identified was a threat actor offering a database for sale most\nlikely containing leads’ contact information of various B2B and B2C businesses in the UAE.\nAnother interesting listing contained data of a major UAE telecommunications company,\nincluding its users’ usernames and passwords, employees’ information, contract files, and\npayment details.\nThese exposed details can be abused by cybercriminals in many different ways. For\ninstance, cybercriminals can leverage the victims’ contact details to execute phishing or\nsocial engineering attacks, allowing them to possibly steal further information from these\nusers or lure them into transferring money. The contract files and other sensitive data, on the\nother hand, can be used for even further damage, such as demanding ransom or trading it\nwith unscrupulous competitors. Finally, when corporate credentials are leaked in these\ndatabases, cybercriminals can leverage these to perform business email compromise (BEC)\nattacks and, in some cases, to gain an initial foothold in a network in order to perform lateral\nmovement and plant malware.\n\n\n-----\n\n_Users selling UAE databases._\n\n\n-----\n\n**Databases containing government and educational entities data.**\nCybercriminals often target government entities via phishing and social engineering attacks\nusing data leaked or bought on cybercrime forums. Recently, KELA observed an instance of\na user trying to sell data belonging to a UAE ministry. Such data has been in demand for\nquite some time already; in 2019, a user leaked a database belonging to a university in the\nUAE, and as other members are still interested in it, the publisher periodically updates the\ndownload link to enable everyone to access the data.\n\n_A user selling data of a UAE’s ministry._\n\n_A user offering a database of a university in the UAE in 2019, which is still in demand._\n\nSuch leaks and sales result in massive amounts of leaked credentials available for\ncybercriminals to use in order to conduct phishing, social engineering, BEC, and other\nattacks. When analyzing leaked credentials pertaining to certain domains associated with\ngovernment and educational institutions (gov.ae, ac.ae, mil.ae, sch.ae, org.ae), KELA\ndiscovered more than 221,000 leaked credentials of their personnel.\n\n\n-----\n\n_Leaked credentials found through KELA’s solutions (the overall number of leaked credentials is the_\n_minimum exposed quantity since it’s based on the .ae TLD, while many UAE companies have_\n_international TLDs)_\n\n**Dumps of documents**\n\nKELA has recently observed users offering scans of UAE passports and IDs. Such data can\nbe used for various fraudulent activities, including manipulation of personal data for\ncybercriminals interested in taking advantage of citizens’ financial aid. This phenomenon has\nonly grown during 2020 as more and more cybercriminals were interested in taking\nadvantage of COVID-19 aid packages offered for those in need globally.\n\n\n-----\n\n_A user offers UAE passports, IDs, CVs, and photos (auto translated from Russian)_\n\nHowever, leaked credentials and personal information aren’t the only way that cybercriminals\ncould take advantage of UAE users and companies. As mentioned above, another common\nway is through compromised accounts – logins and passwords to accounts that grant access\nto tools and software used on a compromised computer, such as RDP, VPN solutions, and\nmore, which are usually being sold through underground automated shops.\n\nIf the compromised machine resides in a corporate environment, these offerings, which are\nfor sale for just a few dollars per bot (computer), provide criminal actors with unauthorized\naccess to systems that could allow them to perform a variety of large-scale attacks, ranging\nfrom attacks such as social engineering to malware attacks. KELA identified at least 68,000\ncompromised accounts to tools and software used in UAE-related entities (based on the .ae\ntop domain).\n\n\n-----\n\n_A few examples showing compromised accounts available for UAE government services (taken from_\n_within KELA’s DARKBEAST)_\n\n_Bots offered on one popular underground market and enabling access to social media, e-commerce sites,_\n_corporate and government portals._\n\n## The Path to a Ransomware Attack: Initial Network Access and Ransomware in the UAE\n\nInitial network access listings offered on underground forums can serve as entry points for\nransomware operators and other malicious actors looking for a foothold into a victim’s\nnetwork. Initial Access Brokers – the actors selling those accesses, offer these items for sale\nso that buyers can purchase them to attempt to move laterally within the targeted network\nand to deploy ransomware or steal intellectual property. During the last six months\n**(December 2020-May 2021), KELA observed numerous UAE accesses offered for sale**\n\n\n-----\n\n**on underground forums. Each of these accesses can be turned into millions of dollars of**\nransom demanded by buyers who would manage to leverage them to infect the victims with\nransomware.\n\nKELA regularly tracks initial access brokers and the network accesses that they are selling\non a daily basis. The image below shows a typical example of a network access listing\npublished for sale on an underground forum.\n\n_A user selling Pulse Secure VPN access to a UAE government body._\n\n\n-----\n\nThough identifying the direct connection between the network access sale and a\nransomware attack is not always possible, we observed an instance in which a recently sold\nnetwork access seems to have possibly resulted in a ransomware attack on a manufacturing\ncompany based in Dubai. On March 31, 2021, Avaddon ransomware operators published a\nblog post claiming they hit the company and published “proof-of-breach” documents\npertaining to the company. Prior to this event, on March 8, 2021, a threat actor offered for\nsale access to a UAE-based manufacturing company in a private conversation with KELA.\nSince the offer was made about a month prior to Avaddon disclosing the victim, it is possible\nthat the actor sold the access to one of Avaddon’s affiliates who then exploited it to get into\nthe system and infiltrate the network with the Avaddon ransomware. The data of the victim\nwas leaked in full after the victim apparently refused to pay the ransom.\n\n_UAE victim in the Avaddon ransomware blog_\n\n\n-----\n\n_UAE victim in Nefilim ransomware gang’s blog_\n\nThe other listings of compromised network access were related to various companies,\nincluding government organizations as well as organizations in the telecommunications,\nhealthcare, and financial services sectors. In some cases, such as the one below, initial\naccess brokers sell not only the access to the victim’s network, but also the data that they\nmanaged to extract from the victim’s systems.\n\n_A user selling both access and database related to the “biggest airline company in UAE ”_\n\n\n-----\n\nWhile analyzing these different initial access brokers, we observed that there are certain\nones who specialize in targeting victims in the Middle East. For example, in 2020, one of the\nactors who claimed to be a “Turkish Hacker” mostly offered access to companies located in\nthe UAE, Jordan, Saudi Arabia, Egypt, and a few additional countries in the region. The actor\nmentioned that they bought and used the Thanos ransomware, illustrating that initial access\nbrokers earn their money in many ways. Here, the actor also offered various databases\npertaining to the UAE police and private companies.\n\n_A user known for selling initial access to UAE companies sells databases belonging to UAE companies._\n\nIt’s crucial to note that the majority of listings were offered by a number of different initial\naccess brokers, and not all offered by the same one. This indicates that there are multiple\ncybercriminals attempting to target UAE companies and they use different approaches to\nmonetize the compromised networks.\n\n## Conclusions and Mitigation Efforts\n\nAs the UAE stands as one of the most [digitally advanced countries in the Arab world,](https://gulfnews.com/technology/uae-most-digitally-advanced-in-arab-world-1.2239034)\nunderground cybercriminals will continue to view it as a lucrative target. With leaked\ncredentials, compromised accounts, and network access listings for sale, the UAE-related\nentities must take major steps to avoid potential significant damage due to cyberattacks.\n\nCyber readiness applies not only to organizations in the UAE but to organizations around the\nworld. If anything was made clear for businesses in 2020, it was the need for proper\ncybersecurity measures to be put in place. Though many companies have adapted to the\nforced work-from-home trend, many still are facing numerous threats from criminal actors\noperating in the cybercrime underground ecosystem. Organizations in the UAE, and globally,\nshould ensure to continually:\n\n\n-----\n\n1. Train all employees and key individuals on how to safely use their credentials\n\n**and personal information online. This cyber training should include specifying how to**\nidentify suspicious activities, such as possible scam emails, or unusual requests from\nunauthorized individuals or email addresses. The human factor plays a significant role\nin an organizations’ cybersecurity, and the larger the organization, the bigger chance of\nthreats – therefore creating this mandatory cybersecurity training across all these\norganizations would significantly reduce the chances that they would be compromised\ndue to an unknown mistake of an employee of theirs.\n2. Invest in regular vulnerability monitoring and patching. Due to the increased use\n\nof digital systems, and ongoing updates of technologies, vulnerabilities in an\norganization’s network are constantly going to rise. These organizations must invest in\nregular monitoring of their entire network infrastructure to ensure that any possible\nentry points for initial access brokers or other network intruders are immediately\nblocked.\n3. Targeted monitoring of your assets to automatically detect your most relevant\n\n**threats emerging from the cybercrime underground ecosystem. Nowadays, every**\norganization – private or government, small, medium, or large, is constantly at risk due\nto the ever-growing cybercrime ecosystem. Cybercriminals continually search for new\nopportunities to achieve one simple goal: monetize the data they obtain. They are\nactive in the hardest-to-reach corners of the cybercrime underground and organizations\nare constantly in need of defeating these cybercriminals. Therefore, constant\nautomated and scalable monitoring of an organizations’ assets could significantly\nimprove maintaining a reduced attack surface, ultimately helping organizations thwart\npossible attempts of cyberattacks against them.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-30 - Exposing the UAE’s Underground Digital Dangers- The Attack Surface of One of the Most Digitally Advanced Countries in the Arab World.pdf"
    ],
    "report_names": [
        "2020-05-30 - Exposing the UAE’s Underground Digital Dangers- The Attack Surface of One of the Most Digitally Advanced Countries in the Arab World.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535668,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653710219,
    "ts_modification_date": 1653710219,
    "files": {
        "pdf": "https://archive.orkl.eu/946c53b6e9412ee87043524e12fc65f34dec9618.pdf",
        "text": "https://archive.orkl.eu/946c53b6e9412ee87043524e12fc65f34dec9618.txt",
        "img": "https://archive.orkl.eu/946c53b6e9412ee87043524e12fc65f34dec9618.jpg"
    }
}