{
    "id": "32021cfe-055a-431c-94bb-f3d1d0c7c906",
    "created_at": "2023-01-12T15:05:31.609078Z",
    "updated_at": "2025-03-27T02:05:24.948642Z",
    "deleted_at": null,
    "sha1_hash": "a862ff42928c3b7bade4d671ed9050c9f594cccb",
    "title": "2020-02-26 - What’s Dead May Never Die- AZORult Infostealer Decommissioned Again",
    "authors": "",
    "file_creation_date": "2022-05-28T04:49:09Z",
    "file_modification_date": "2022-05-28T04:49:09Z",
    "file_size": 444825,
    "plain_text": "# What’s Dead May Never Die: AZORult Infostealer Decommissioned Again\n\n**[ke-la.com/whats-dead-may-never-die-azorult-infostealer-decommissioned-again/](https://ke-la.com/whats-dead-may-never-die-azorult-infostealer-decommissioned-again/)**\n\n## Bottom Line Up Front\n\n\nFebruary 26, 2020\n\n\nSince mid-February, discussions throughout multiple cybercrime communities have been\nnoting that the main password stealing features of the AZORult infostealer – one of the most\nprevalent stealers currently in use, and the main culprit behind the ongoing campaign – have\nbeen disabled by a recent Google Chrome update. Since AZORult isn’t actively maintained,\nmany actors are now regarding the stealer as fully decommissioned.\n\n## One Chrome Update to Rule Them All\n\nOver the last several days, threat actors in a variety of cybercrime forums have been\nspreading obituaries for AZORult – one of the major, most prevalent infostealers in use by\nthe cybercrime underground. This is not the first time AZORult dies. In late 2018, sales by\nthe official developer have stopped because the source code became too ubiquitous and\nsprang too many offshoots. However, [as shown in our latest research, AZORult remained](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/)\nvery active – it’s been seen in recent campaigns and is directly related to over 300,000\ninfections paddled on the Genesis Store botnet market.\n\nThis time, the situation is different – the word around the cybercriminal underground is that\nAZORult is not capable of handling features bundled by a recent Google Chrome update.\nOne of AZORult’s main functions is stealing browser-saved credentials, and threat actors are\nclaiming that Chrome’s move to hashing locally-saved password in the AES-256 algorithm\nthwarts AZORult’s best efforts to steal them.\n\n\n-----\n\n_Top: an obituary to AZORult posted in a closed Russian hacking forum; from Russian: “Azor is finished._\n_Not only that – all the older cracked versions of different stealers are finished”. Bottom: actors_\n_discussing AZORult’s apparent demise on a different forum. From Russian: “What is the new encryption of_\n_passwords in chrome?”; “aes256”_\n\nAs can be seen in the excerpt above – noting “all the older cracked versions of different\nstealers are finished” – AZORult is not the only stealer that was affected by the update. The\nRaccoon stealer, for example, was also affected by the update. However, unlike AZORult,\nRaccoon is actively maintained by a centralized management – and as such was able to\nadapt the malware to bypass Chrome’s effort to hide important user data. Other users have\n[noted KPot stealer has also updated its mechanisms to cope with the new update.](https://www.proofpoint.com/us/threat-insight/post/new-kpot-v20-stealer-brings-zero-persistence-and-memory-features-silently-steal)\n\n_Raccoon’s announcement on updating the stealer to support the new Chrome release_\n\n## What's Next?\n\n\n-----\n\nAZORult s apparent demise – for now, at least – can also be tracked in Genesis. Following\nthe methodology outlined in our latest research, we’re able to notice a turning point in the last\nweek: for the first time in over a year, Genesis ditched AZORult and went all-in on a\ncurrently-unidentified trojan as the major infection type. This showcases an important\nbusiness principle: never have a single point of failure. The fact that Genesis was cultivating\nrelationships with several malware providers just might have saved their business, as they\nwere quickly able to fully pivot to a new malware.\n\n_New infections in Genesis in the past week, broken down by infection type – AZORult vs. a currently-_\n_unknown malware_\n\nAZORult’s decommissioning in late 2018 was meant to leave a vacuum in the cybercrime\nfinancial ecosystem; many new infostealers were publishing themselves as the new\nreplacement for seemingly-dead malware. Now, with no apparent heir to fix the deep issues\ncaused by the new Chrome update, it seems that actors – if we’re extrapolating from\nGenesis – have actually decided to move on to new stealers. That is, of course, unless an\n\n\n-----\n\nactor picks up the AZORult source code and decides to adapt it to the new Chrome policies\nindependently; a similar approach was taken by actors not long ago, when a new version of\nthe stealer, [coded in C++ opposed to its native Delphi, was found in active campaigns.](https://securelist.com/azorult-analysis-history/89922/)\n\nOne interesting note to track would be AZORult’s non-infostealing features, which might not\n[be affected by the Chrome update – for example, it’s loader modules allowing spreading of](https://www.proofpoint.com/us/threat-insight/post/new-version-azorult-stealer-improves-loading-features-spreads-alongside)\nother malware following an AZORult infection – shouldn’t be thwarted by the change in\nChrome password encryption.\n\nFollowing our detailed methodologies and targeted Dark Net research, KELA plans to keep\ntabs on these changes in order to effectively defend our clients from commodity malware\nthreats.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-26 - What’s Dead May Never Die- AZORult Infostealer Decommissioned Again.pdf"
    ],
    "report_names": [
        "2020-02-26 - What’s Dead May Never Die- AZORult Infostealer Decommissioned Again.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535931,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653713349,
    "ts_modification_date": 1653713349,
    "files": {
        "pdf": "https://archive.orkl.eu/a862ff42928c3b7bade4d671ed9050c9f594cccb.pdf",
        "text": "https://archive.orkl.eu/a862ff42928c3b7bade4d671ed9050c9f594cccb.txt",
        "img": "https://archive.orkl.eu/a862ff42928c3b7bade4d671ed9050c9f594cccb.jpg"
    }
}