{
    "id": "32040b3b-c95d-4984-baf9-b6f546b53edf",
    "created_at": "2023-01-12T15:05:06.420754Z",
    "updated_at": "2025-03-27T02:09:30.076886Z",
    "deleted_at": null,
    "sha1_hash": "2e8a245d0114aa447cae87b0664f4316c888571f",
    "title": "2021-01-12 - Important Update from Mimecast",
    "authors": "",
    "file_creation_date": "2022-05-29T01:32:57Z",
    "file_modification_date": "2022-05-29T01:32:57Z",
    "file_size": 399989,
    "plain_text": "# Important Update from Mimecast\n\n**mimecast.com/blog/important-update-from-mimecast/**\n\nMicrosoft recently informed us that a Mimecast-issued certificate provided to certain\ncustomers to authenticate Mimecast Sync and Recover, Continuity Monitor, and IEP\nproducts to Microsoft 365 Exchange Web Services has been compromised by a\nsophisticated threat actor.\n\nApproximately 10 percent of our customers use this connection. Of those that do, there are\nindications that a low single digit number of our customers’ M365 tenants were targeted. We\nhave already contacted these customers to remediate the issue.\n\nAs a precaution, we are asking the subset of Mimecast customers using this certificatebased connection to immediately delete the existing connection within their M365 tenant and\nre-establish a new certificate-based connection using the new certificate we’ve made\navailable. Taking this action does not impact inbound or outbound mail flow or associated\nsecurity scanning.\n\nThe security of our customers is always our top priority. We have engaged a third-party\nforensics expert to assist in our investigation, and we will work closely with Microsoft and law\nenforcement as appropriate.\n\n\n-----\n\n## Forward-Looking Statements\n\nThis communication contains “forward-looking” statements, which are subject to the safe\nharbor provisions of the Private Securities Litigation Reform Act of 1995 and other federal\nsecurities laws, that are based on currently available information and our current beliefs,\nexpectations and understanding. These forward-looking statements include statements\nregarding Mimecast’s current understanding of the cause and nature of the compromise of a\ncertificate-based connection between Mimecast and Microsoft’s M365 Exchange Web\nServices, the scope and impact of the compromise, the number of targeted and impacted\ncustomers, the effectiveness of any current or future remediation efforts, the information\nprovided to us by Microsoft and others in their investigations to date, the impact on our\ncustomers’ inbound or outbound mail flow and associated security scanning, and our\nongoing investigation into this situation. Mimecast intends that all such forward-looking\nstatements to be covered by the safe harbor provisions for forward-looking statements\ncontained in Section 21E of the Securities Exchange Act of 1934, as amended, and the\nPrivate Securities Litigation Reform Act of 1995.\n\nThese statements are subject to future events, risks and uncertainties – many of which are\nbeyond our control or are currently unknown to Mimecast. These risks and uncertainties\ninclude, but are not limited to, risks and uncertainties relating to the uncovering of new\ninformation in the course of our investigation related to the nature, cause and scope of the\nissue, the reputational, financial, legal and other risks related to potential adverse impacts to\nour customers and partners, and the other risks, uncertainties and factors detailed in\nMimecast’s filings with the Securities and Exchange Commission. Mimecast is providing the\ninformation in this communication as of this date and assumes no obligations to update the\ninformation included in this communication or revise any forward-looking statements,\nwhether as a result of new information, future events or otherwise.\n\nUp Next\n\n\n-----\n\nEmail Security | Jan 21, 2021\n\nImportant Security Update\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-12 - Important Update from Mimecast.pdf"
    ],
    "report_names": [
        "2021-01-12 - Important Update from Mimecast.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535906,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653787977,
    "ts_modification_date": 1653787977,
    "files": {
        "pdf": "https://archive.orkl.eu/2e8a245d0114aa447cae87b0664f4316c888571f.pdf",
        "text": "https://archive.orkl.eu/2e8a245d0114aa447cae87b0664f4316c888571f.txt",
        "img": "https://archive.orkl.eu/2e8a245d0114aa447cae87b0664f4316c888571f.jpg"
    }
}