{
    "id": "325944e1-759c-4ff9-8a1f-9cee981e3fe3",
    "created_at": "2023-01-12T15:07:06.299975Z",
    "updated_at": "2025-03-27T02:09:29.385369Z",
    "deleted_at": null,
    "sha1_hash": "5cd15a1b9b73577a8931d55b1a290935e0884fbf",
    "title": "2020-04-23 - ESET researchers disrupt cryptomining botnet VictoryGate",
    "authors": "",
    "file_creation_date": "2022-05-28T00:28:40Z",
    "file_modification_date": "2022-05-28T00:28:40Z",
    "file_size": 64495,
    "plain_text": "# ESET researchers disrupt cryptomining botnet VictoryGate\n\n**[eset.com/int/about/newsroom/press-releases/research/eset-researchers-disrupt-cryptomining-botnet-victorygate/](https://www.eset.com/int/about/newsroom/press-releases/research/eset-researchers-disrupt-cryptomining-botnet-victorygate/)**\n\n23 Apr 2020\n\n[Next story](https://www.eset.com/int/about/newsroom/press-releases/research/eset-investigates-grandoreiro-a-trojan-exploiting-the-coronavirus-pandemic/)\n\n23 Apr 2020\n\n**BRATISLAVA, BUENOS AIRES – ESET researchers have recently discovered a previously**\nundocumented botnet named VictoryGate. It has been active since at least May 2019, and\nis composed mainly of devices in Peru, where over 90% of the infected devices are located.\nThe main activity of the botnet is mining Monero cryptocurrency. The victims include\norganizations in both public and private sectors, including financial institutions. Thanks to\ndata obtained during this research and shared with the nonprofit Shadowserver Foundation,\nat least a portion of the botnet operation has been disrupted.\n\nESET researchers have been “sinkholing” several domain names that control the botnet’s\nactions, replacing them with machines that do not send the botnet’s slave computers the\ncommands they expect, but simply monitor botnet activity. Based on this data and ESET\ntelemetry, ESET estimates that at least 35,000 devices became infected with VictoryGate at\none point or another during this campaign.\n\nThe only infection vector used for spreading VictoryGate is via removable devices. “The\nvictim receives a USB drive that at some point was connected to an infected machine. It\nseemingly has all the files with the same names and icons that it contained before being\ninfected. Because of this, the content will look almost identical at first glance. However, all\nthe original files were replaced by a copy of the malware,” says ESET researcher Alan\nWarburton, who investigated the botnet. “When an unsuspecting user attempts to open one\nof these files, the script will open both the file that was intended and the malicious\npayload.”\n\nWarburton also warns about the impact on victims’ machines: “There is very high resource\nusage by the botnet, resulting in a constant 90% to 99% CPU load. This slows down the\ndevice and can cause overheating and possible damage.”\n\nAccording to ESET research, VictoryGate has made a much greater effort to avoid\ndetection than in previous, similar campaigns observed in the Latam region. And, given the\nfact that the botmaster can update functionality of the payloads that are downloaded and\n\n\n-----\n\nexecuted on the infected devices from cryptomining to any other malicious activities at any\ngiven time, this poses a considerable risk. This is particularly true since many of the victims\nidentified were in either the public sector or in financial institutions.\n\nIf you suspect your device may have been infected with this malware, you can use our\nfree [ESET Online Scanner to clean your machine. The first-stage module is detected by](https://www.eset.com/home/online-scanner/)\nESET security products as MSIL/VictoryGate.\n\nThe peak number of unique IP addresses\n\nconnecting to the botnet command and control server per day.\n\nFor more technical details about the VictoryGate botnet, read the blogpost Following\nESET’s discovery, a Monero mining botnet is disrupted on WeLiveSecurity. Make sure to\nfollow [ESET research on Twitter for the latest news from ESET Research.](https://twitter.com/ESETresearch)\n\n**About ESET**\n[For more than 30 years, ESET® has been developing industry-leading IT security software](http://www.eset.com/int/)\nand services for businesses and consumers worldwide. With solutions ranging from\nendpoint and mobile security to encryption and two-factor authentication, ESET’s highperforming, easy-to-use products give consumers and businesses the peace of mind to\nenjoy the full potential of their technology. ESET unobtrusively protects and monitors 24/7,\nupdating defenses in real time to keep users safe and businesses running without\ninterruption. Evolving threats require an evolving IT security company. Backed by R&D\ncenters worldwide, ESET is the first IT security company to earn 100 Virus Bulletin\nVB100 awards, identifying every single “in-the-wild” malware without interruption since\n[2003. For more information, visit www.eset.com or follow us on](http://www.eset.com/int/) [LinkedIn,](https://www.linkedin.com/company/28967?trk=tyah&trkInfo=tarId%3A1402921556545%2Ctas%3AESET%2Cidx%3A2-1-4) [Facebook,](https://www.facebook.com/eset?ref=br_tf)\n[and Twitter.](https://twitter.com/ESET)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-23 - ESET researchers disrupt cryptomining botnet VictoryGate.pdf"
    ],
    "report_names": [
        "2020-04-23 - ESET researchers disrupt cryptomining botnet VictoryGate.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536026,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653697720,
    "ts_modification_date": 1653697720,
    "files": {
        "pdf": "https://archive.orkl.eu/5cd15a1b9b73577a8931d55b1a290935e0884fbf.pdf",
        "text": "https://archive.orkl.eu/5cd15a1b9b73577a8931d55b1a290935e0884fbf.txt",
        "img": "https://archive.orkl.eu/5cd15a1b9b73577a8931d55b1a290935e0884fbf.jpg"
    }
}