{
    "id": "32977976-c4ef-46cf-8ae1-c3810cae83fb",
    "created_at": "2024-06-25T07:49:00.244243Z",
    "updated_at": "2025-03-27T02:13:34.806356Z",
    "deleted_at": null,
    "sha1_hash": "3d4b5f7bdcb6dd228dfae77fbd4fbcff36662cf8",
    "title": "SneakyChef espionage group targets government agencies with SugarGh0st and more infection techniques",
    "authors": "",
    "file_creation_date": "2024-06-25T06:57:53Z",
    "file_modification_date": "2024-06-25T06:57:53Z",
    "file_size": 1727258,
    "plain_text": "# SneakyChef espionage group targets government agencies with SugarGh0st and more infection techniques\n\n**blog.talosintelligence.com/sneakychef-sugarghost-rat**\n\nChetan Raghuprasad June 21, 2024\n\n[By Chetan Raghuprasad, Ashley Shen](https://blog.talosintelligence.com/author/chetan/)\n\nFriday, June 21, 2024 08:00\n\n[Threats RAT](https://blog.talosintelligence.com/category/threats/)\n\nCisco Talos recently discovered an ongoing campaign from SneakyChef, a newly\ndiscovered threat actor using SugarGh0st malware, as early as August 2023.\nIn the newly discovered campaign, we observed a wider scope of targets spread\n[across countries in EMEA and Asia, compared with previous observations that](https://blog.talosintelligence.com/new-sugargh0st-rat/)\nmainly targeted South Korea and Uzbekistan.\nSneakyChef uses lures that are scanned documents of government agencies,\nmost of which are related to various countries’ Ministries of Foreign Affairs or\nembassies.\nBeside the two infection chains disclosed by Talos in November, we discovered an\nadditional infection chain using SFX RAR files to deliver SugarGh0st.\n\n\n-----\n\nThe language used in the SFX sample in this campaign reinforces our previous\nassertion that the actor is Chinese speaking.\n\n_Cisco Talos would like to thank the Yahoo! Paranoids Advanced Cyber Threats Team for_\n_their collaboration in this investigation._\n\n## SneakyChef actor profile\n\n[In early August 2023, Talos discovered a campaign using the SugarGh0st RAT to target](https://blog.talosintelligence.com/new-sugargh0st-rat/)\nusers in Uzbekistan and South Korea. We continued to observe new activities using the\nsame malware to target users in a wider geographical location. Therefore, we created an\nactor profile for the group and dubbed them “SneakyChef.”\n\nTalos assesses with medium confidence that SneakyChef operators are likely Chinesespeaking based on their language preferences, the usage of the variants of Gh0st RAT\n— a popular malware among various Chinese-speaking actors — and the specific\ntargets, which includes the Ministry of Foreign affairs of various countries and other\ngovernment entities. Talos also discovered another RAT dubbed “SpiceRAT” used in the\n[campaign. Read the corresponding research here.](https://blog.talosintelligence.com/new-spicerat-sneakychef/)\n\n\n-----\n\n## Targets across EMEA and Asia\n\nTalos assess with low confidence that the following government agencies are the\npotential targets in this campaign based on the contents of the decoy documents:\n\nMinistry of Foreign affairs of Angola\nMinistry of Fisheries and Marine Resources of Angola\nMinistry of Agriculture and Forestry of Angola\nMinistry of Foreign affairs of Turkmenistan\nMinistry of Foreign affairs of Kazakhstan\nMinistry of Foreign affairs of India\nEmbassy of the Kingdom of Saudi Arabia in Abu Dhabi\nMinistry of Foreign affairs of Latvia\n\nMost of the decoy documents we found in this campaign are scanned documents of\ngovernment agencies, which do not appear to be available on the internet. During our\nresearch, we observed and analyzed various decoy documents with government-and\nresearch conference-themed lures in this campaign. We are sharing a few samples of\nthe decoy documents accordingly.\n\n## Lures targeting Southern African countries\n\nThe threat actor has used decoy documents impersonating the Ministry of Foreign\naffairs of Angola. The lure content in one of the sample documents appeared to be a\ncircular from the Angolan Ministry of Fisheries and Marine Resources about a debt\nconciliation meeting between the ministry authority and a financial advisory company.\n\n\n-----\n\nAnother document contained information about a legal decree concerning state or public\nassets and their disposal. This document appealed to anyone interested in legal affairs\nand public heritage regimes and was addressed to the Ministry of Foreign Affairs –\nMIREX, a centralized institution in Luanda.\n\n## Lures targeting Central Asian countries\n\nThe decoy documents used in the attacks likely targeting countries in Central Asia were\neither impersonating the Ministry of Foreign affairs of Turkmenistan or Kazakhstan. One\nof the lures is related to a meeting organized with the Turkmenistan embassy in\nArgentina and the heads of transportation and infrastructure of the Italian Republic.\nAnother document was a report of planned events and the government-issued list of\npriorities to be addressed in the year 2024 that includes a formal proclamation-signing\nevent between the Ministry of Defense of Uzbekistan and the Ministry of Defense of\nKazakhstan.\n\n|Col1|Col2|\n|---|---|\n\n\n-----\n\n|Col1|Col2|\n|---|---|\n\n\n## Lures targeting Middle Eastern countries\n\nA decoy document we observed in the attack likely targeting Middle Eastern countries\nwas an official circular regarding the declaration of an official holiday for the Founding\nDay of the Kingdom of Saudi Arabia.\n\n\n-----\n\n## Lures targeting Southern Asian countries\n\nWe found another sample that was likely used to target the Indian Ministry of Foreign\nAffairs. It has decoy documents, including an Indian passport application form, along\nwith a copy of an Aadhar card, a document that serves as proof of identity in India.\n\n\n-----\n\n|Col1|Col2|\n|---|---|\n\n\nOne of the decoy Word documents we observed contained lures related to India-U.S.\nrelations, including a list of events involving interactions between India’s prime minister\nand the U.S. president.\n\n\n-----\n\n## Lures targeting European countries\n\nA decoy document found in a sample likely targeting the Ministry of Foreign Affairs of\nLatvia was a circular impersonating the Embassy of Lithuania. It contained a lure\ndocument regarding an announcement of an ambassador’s absence and their\nreplacement.\n\n\n-----\n\n## Other targets\n\nAlong with the government-themed decoy document samples we analyzed, we observed\na few other samples from these campaigns. These included decoys such as an\n[application form to register for a conference run by the Universal Research Cluster](https://universal-conference.com/aboutus.php)\n[(URC) and a research paper abstract of the ICCSE international conference. We also](https://universal-conference.com/aboutus.php)\nsaw a few other decoys related to other conference invitations and details, including\nthose for the Political Science and International Relations conference.\n\n\n-----\n\n|Col1|Col2|\n|---|---|\n\n\n[Recently, Proofpoint researchers reported a SugarGh0st campaign targeting an](https://www.proofpoint.com/us/blog/threat-insight/security-brief-artificial-sweetener-sugargh0st-rat-used-target-american)\norganization in the U.S. involved in artificial intelligence across academia, the private\ntechnology sector, and government services, highlighting the wider adoption of\nSugarGh0st RAT in targeting various business verticals.\n\n## Threat actor continues to leverage old and new C2 domains\n\nAfter Talos’ initial disclosure of SugarGh0st campaign in November 2023, we are\nattributing the past attacks to the newly named threat actor SneakyChef. Despite our\ndisclosure, SneakyChef continued to use the C2 domain we mentioned and deployed\nthe new samples in the following months after our blog post. Most of the samples\nobserved in this campaign communicate with the C2 domain account[.]drive-google[com[.]tk, consistent with their previous campaign. Based on Talos’ Umbrella records,](https://blog.talosintelligence.com/new-sugargh0st-rat/)\nresolutions to the C2 domain were still observed until mid-May.\n\n\n-----\n\nDNS requests for the SugarGh0st C2 domain.\n\n[Talos also observed the new domain account[.]gommask[.]online, reported by Proofpoint](https://www.proofpoint.com/us/blog/threat-insight/security-brief-artificial-sweetener-sugargh0st-rat-used-target-american)\nas being used by SugarGh0st. The domain was created in March 2024, and queries\nwere observed through April 21.\n\n## Infection chain abuse SFX RAR as the initial attack vector\n\nWith Talos’ first reporting of the [SugarGh0st campaign in November, we disclosed two](https://blog.talosintelligence.com/new-sugargh0st-rat/)\ninfection chains that utilized a malicious RAR with an LNK file, likely delivered via\nphishing email. In the newly observed campaign, in addition to the old infection chains,\nwe discovered a different technique from a few malicious RAR samples.\n\n\n-----\n\nThe threat actor is using an SFX RAR as the initial vector in this attack. When a victim\nruns the executable, the SFX script executes to drop a decoy document, DLL loader,\nencrypted SugarGh0st, and a malicious VB script into the victim’s user profile temporary\nfolder and executes the malicious VB script.\n\nThe malicious VB script establishes persistence by writing the command to the registry\nkey UserInitMprLogonScript which executes when a user belonging to either a local\nworkgroup or domain logs into the system.\n\nRegistry key Value\n\nHKCU\\Environment\\UserInitMprLogonScript regsvr32.exe /s %temp%\\update.dll\n\nWhen a user logs into the system, the command runs and launches the loader DLL\n“update.dll” using regsvr32.exe. The loader reads the encrypted SugarGg0st RAT\n“authz.lib”, decrypts it and injects it into a process. This technique is same as that of the\n[SugarGh0st campaign disclosed by the Kazakhstan government in February.](https://sts.kz/en/2024/02/09/sugargh0st-rat-atakuet-kazahstan/)\n\n## Coverage\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[execution of the malware detailed in this post Try Secure Endpoint for free here](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium=web-referral?utm_source=cisco&utm_campaign=amp-free-trial&utm_term=pgm-talos-trial&utm_content=amp-free-trial)\n\n|Registry key|Value|\n|---|---|\n|HKCU\\Environment\\UserInitMprLogonScript|regsvr32.exe /s %temp%\\update.dll|\n\n\n-----\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\n[threat actors as part of their campaign. You can try Secure Email for free here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium=web-referral&utm_source=cisco&utm_campaign=cmd-free-trial-request&utm_term=pgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW)](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[appliances such as Threat Defense Virtual, Adaptive Security Appliance and Meraki MX](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html)\ncan detect malicious activity associated with this threat.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to](https://umbrella.cisco.com/)\nmalicious domains, IPs and URLs, whether users are on or off the corporate network.\n[Sign up for a free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium=web-referral?utm_source=cisco&utm_campaign=umbrella-free-trial&utm_term=pgm-talos-trial&utm_content=automated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are\n[available from the Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized](https://signup.duo.com/?utm_source=talos&utm_medium=referral&utm_campaign=duo-free-trial)\nare accessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading\n[the latest rule pack available for purchase on Snort.org. Snort SID for this threat is](https://www.snort.org/products)\n62647.\n\nClamAV detections are also available for this threat:\n\nWin.Trojan.SugarGh0stRAT-10014937-0\n\nWin.Tool.DynamicWrapperX-10014938-0\n\nTxt.Loader.SugarGh0st_Bat-10014939-0\n\nWin.Trojan.SugarGh0stRAT-10014940-0\n\nLnk.Dropper.SugarGh0stRAT-10014941-0\n\nJs.Trojan.SugarGh0stRAT-10014942-1\n\nWin.Loader.Ramnit-10014943-1\n\nWin.Backdoor.SugarGh0stRAT-10014944-0\n\nWin.Trojan.SugarGh0st-10030525-0\n\n\n-----\n\nWin.Trojan.SugarGh0st-10030526-0\n\n### Orbital Queries\n\n[Cisco Secure Endpoint users can use Orbital Advanced Search to run complex](https://orbital.amp.cisco.com/help/)\nOSqueries to see if their endpoints are infected with this specific threat. For specific\nOSqueries related to this threat, please follow the links:\n\n[SugarGh0st RAT file detected](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/sugargh0st_rat_file_path.yaml)\n[SugarGh0st RAT Registry key](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/sugargh0st_rat_registry_key.yaml)\n\n## Indicators of Compromise\n\n[Indicators of Compromise associated with this threat can be found here](https://github.com/Cisco-Talos/IOCs/tree/main/2024/06)\n\n[© 2024 Cisco Systems, Inc. and/or its affiliates. All rights reserved. View our Privacy](http://www.cisco.com/web/siteassets/legal/privacy_full.html)\n[Policy.](http://www.cisco.com/web/siteassets/legal/privacy_full.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2024/2024.06.21.sneakychef-sugarghost-rat/SneakyChef%20espionage%20group%20targets%20government%20agencies%20with%20SugarGh0st%20and%20more%20infection%20techniques.pdf"
    ],
    "report_names": [
        "SneakyChef espionage group targets government agencies with SugarGh0st and more infection techniques"
    ],
    "threat_actors": [
        {
            "id": "784ccdda-6196-40a3-a269-4e9cf8c2dd1c",
            "created_at": "2024-06-25T02:00:05.044608Z",
            "updated_at": "2025-03-27T02:00:03.390302Z",
            "deleted_at": null,
            "main_name": "SneakyChef",
            "aliases": [],
            "source_name": "MISPGALAXY:SneakyChef",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1719301740,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1719298673,
    "ts_modification_date": 1719298673,
    "files": {
        "pdf": "https://archive.orkl.eu/3d4b5f7bdcb6dd228dfae77fbd4fbcff36662cf8.pdf",
        "text": "https://archive.orkl.eu/3d4b5f7bdcb6dd228dfae77fbd4fbcff36662cf8.txt",
        "img": "https://archive.orkl.eu/3d4b5f7bdcb6dd228dfae77fbd4fbcff36662cf8.jpg"
    }
}