{
    "id": "3309d585-a343-45c6-8ae4-c75b4f00255a",
    "created_at": "2023-01-12T14:59:45.65018Z",
    "updated_at": "2025-03-27T02:16:26.082246Z",
    "deleted_at": null,
    "sha1_hash": "969b726ca22fa5bb70a3fc4c57ad224be43bc15b",
    "title": "2021-07-18 - Pegasus- The new global weapon for silencing journalists",
    "authors": "",
    "file_creation_date": "2022-05-28T18:58:19Z",
    "file_modification_date": "2022-05-28T18:58:19Z",
    "file_size": 852230,
    "plain_text": "# Pegasus: The new global weapon for silencing journalists\n\n**[forbiddenstories.org/pegasus-the-new-global-weapon-for-silencing-journalists/](https://forbiddenstories.org/pegasus-the-new-global-weapon-for-silencing-journalists/)**\n\nAt least 180 journalists around the world have been selected as targets by clients of the\ncybersurveillance company NSO Group, according to a new Forbidden Stories\ninvestigation, published today.\n\nBy Phineas Rueckert\n\nReading time: 21m\n\n[THE PEGASUS PROJECT | July 18, 2021](https://forbiddenstories.org/case/the-pegasus-project/)\n\nKhadija Ismayilova’s home in Baku had become like a prison. In Azerbaijan, an oil-rich\nnation nestled next to the Caspian Sea that since 2014 has increasingly stifled free speech\nand dissent, Ismayilova’s investigations into the ruling family had made her a prime target of\nher own government.\n\nThe Azerbaijani investigative journalist knew she was constantly being watched – and had\nbeen told as much by friends and family who had been asked to spy on her.\n\n\n-----\n\nThe authorities had thrown the book at her: surreptitiously installing cameras in her home to\nfilm her during sex; arresting her and accusing her of driving a colleague to suicide; and\neventually charging her with tax fraud and sentencing her to seven years in prison.\n\nShe was released on bail after 18 months and banned from leaving the country for five\nyears.\n\nSo in May 2021, at the end of the travel ban, when Ismayilova packed away her belongings\nand boarded a plane to Ankara, Turkey, she may have thought she was leaving all of that\nbehind.\n\nLittle did she know the most invasive spy was coming with her.\n\nFor nearly three years, Khadija Ismayilova’s phone was regularly infected with Pegasus, a\nhighly-sophisticated spyware tool developed by Israeli company NSO Group that gives\nclients access to the entirety of a phone’s contents and can even remotely access the\ncamera and microphone, according to a forensic analysis by Amnesty International’s\nSecurity Lab, in partnership with Forbidden Stories.\n\n“All night I’ve been thinking about what did I do with my phone,” she told journalists from her\ntemporary home in Ankara the day after learning her phone had been compromised. “I feel\nguilty for the messages I’ve sent. I feel guilty for the sources who sent me [information]\nthinking that some encrypted messaging ways are secure and they didn’t know that my\nphone is infected.”\n\n“My family members are also victimized,” she added. “The sources are victimized, people\nI’ve been working with, people who told me their private secrets are victimized.”\n\n\n-----\n\nKhadija Ismayilova (on left), with Pegasus Project journalist Miranda Patrucic from the\nOCCRP, when she learned her phone was regularly infected with Pegasus for nearly three\nyears.\n\n_Credit: PBS/Forbidden Films_\n\n## The Pegasus Project\n\nIsmayilova is one of nearly 200 journalists around the world whose phones have been\nselected as targets by NSO clients, according to the Pegasus Project, an investigation\nreleased today by a global consortium of more than 80 journalists from 17 media outlets in\n10 countries, coordinated by Forbidden Stories with the technical support of Amnesty\nInternational’s Security Lab.\n\nForbidden Stories and Amnesty International had access to a leak of more than 50,000\nrecords of phone numbers that NSO clients selected for surveillance. According to an\nanalysis of these records by Forbidden Stories and its partners, the phones of at least 180\njournalists were selected in 20 countries by at least 10 NSO clients. These government\nclients range from autocratic (Bahrain, Morocco and Saudi Arabia) to democratic (India and\nMexico) and span the entire world, from Hungary and Azerbaijan in Europe to Togo and\nRwanda in Africa. As the Pegasus Project will show, many of them have not been afraid to\nselect journalists, human rights defenders, political opponents, businesspeople and even\nheads of state as targets of this invasive technology.\n\n\n-----\n\nStating contractual and national security considerations NSO Group wrote in a letter to\nForbidden Stories and its media partners that it “cannot confirm or deny the identity of our\ngovernment customers.” Forbidden Stories and its media partners reached out to each of\nthe government clients cited in this project, all of whom either failed to respond to the\nquestions by the deadline or denied being clients of NSO Group.\n\nIt is impossible to know whether a specific phone number appearing in the list was\nsuccessfully compromised without analyzing the device. However, Amnesty International’s\nSecurity Lab, in partnership with Forbidden Stories, was able to perform forensics analyses\non the phones of more than a dozen of these journalists – and 67 phones in total –\nrevealing successful infections through a security flaw in iPhones as recently as this month.\n\nThe leaked phone numbers, which Forbidden Stories and its partners analyzed over\nmonths, reveal for the first time the staggering scale of surveillance of journalists and\nhuman rights defenders – despite NSO Group’s repeated claims that its tools are\nexclusively used for targeting serious criminals and terrorists – and confirm the fears of\npress advocates about the scope of spyware being used against journalists.\n\n“The numbers vividly show the abuse is widespread, placing journalists’ lives, those of their\nfamilies and associates in danger, undermining freedom of the press and shutting down\ncritical media,” said Agnes Callamard, secretary general of Amnesty International. “It is\nabout controlling public narrative, resisting scrutiny, suppressing any dissenting voice.”\n\nJournalists appearing in these records have received legal threats, others have been\narrested and defamed, and some have had to flee their countries due to persecution – only\nto later find that they were still under surveillance. In rare cases journalists have been killed\nafter having been selected as targets. Today’s revelations make clear that the technology\nhas emerged as a key tool in the hands of repressive government actors and the\nintelligence agencies that work for them.\n\n“Putting surveillance on a journalist has a very strong chilling effect,” Carlos Martinez de la\nSerna, program director at the Committee to Protect Journalists, told Forbidden Stories.\n“This is a very, very important problem that everyone needs to take seriously, not only in\ncontext of where journalists are working in a hostile environment for journalism, but in the\nUS and Western Europe and other places.”\n\nCOUNTRIES WHERE JOURNALISTS WERE SELECTED AS TARGETS\n\n\n-----\n\nNSO group, in a written response to Forbidden Stories and its media partners, wrote that\nthe consortium’s reporting was based on “wrong assumptions” and “uncorroborated\ntheories” and reiterated that the company was on a “life-saving mission.”\n\n“NSO Group firmly denies false claims made in your report which many of them are\nuncorroborated theories that raise serious doubts about the reliability of your sources, as\nwell as the basis of your story,” the company wrote. “Your sources have supplied you with\ninformation that has no factual basis, as evidenced by the lack of supporting documentation\nfor many of the claims.”\n\n“The alleged amount of ‘leaked data of more than 50,000 phone numbers,’ cannot be a list\nof numbers targeted by governments using Pegasus, based on this exaggerated number,”\nNSO Group added.\n\nIn a legal letter sent to Forbidden Stories and its media partners, NSO Group also wrote:\n“NSO does not have insight into the specific intelligence activities of its customers, but even\na rudimentary, common sense understanding of intelligence leads to the clear conclusion\nthat these types of systems are used mostly for purposes other than surveillance.”\n\n## As dangerous as a suspected terrorist\n\nFor Szabolcs Panyi, an investigative journalist at Direkt36 in Hungary, learning that his cell\nphone had been infected with Pegasus spyware was “devastating.”\n\n\n-----\n\nThere are some people in this country who consider a regular journalist as dangerous as\nsomeone suspected of terrorism,” he told Forbidden Stories over an encrypted line of\ncommunication.\n\nPanyi is in his mid-30s. He wears round frame glasses, and has short stubble. The awardwinning journalist has reported on defense, foreign affairs and other sensitive subjects and\nhas a rolodex of thousands of contacts across multiple countries, including the United\nStates, where he spent a year on a Fulbright scholarship – making him an ideal target for\nintelligence services, who are known to be distrustful of US influence in Hungary.\n\nPanyi was working on two major scoops during the time his phone was compromised in\n2019. Forbidden Stories, in partnership with the Amnesty International’s Security Lab, was\nable to confirm successful infections of his phone over a 9-month period from April to\nDecember. These infections, Panyi said, often matched his official requests for comment\nand important meetings with sources.\n\nHungarian journalist Szabolcs Panyi.\n_Credit: Andras Petho (Direkt36)_\n\nOne of the digital intrusions occurred when he was meeting with a Hungarian\nphotojournalist who had been serving as a fixer for a reporter from a US-based news outlet\nworking on a story about the International Investment Bank, a Russia-backed bank that in\n\n\n-----\n\n2019 was pushing to establish branches in Budapest.\n\nAround that time, the photojournalist fixer was also selected as a target, according to the\nrecords accessed by Forbidden Stories.\n\n“It’s real likely that those who are operating this system were interested in what these\nHungarian and American journalists were going to write about this Russian bank,” Panyi\nsaid.\n\nLike Panyi, many journalists who are the subject of digital threats and cyber surveillance are\ninteresting to state intelligence agencies on account of their sources, according to Igor\nOstrovskiy, a private investigator in New York City who previously spied on journalists\nincluding Ronan Farrow, Jodi Kantor and Wall Street Journal reporter Bradley Hope as a\nsubcontractor for the Israeli company Black Cube and now trains journalists in information\nsecurity.\n\n“We all know that journalists have a ton of information passing through their hands so that\ncould be why state security could be interested,” he said. “State security could be interested\nin who’s leaking inside the government, or inside of a business that’s vital to the\ngovernment, and they might be looking for that source.”\n\nHalfway around the world, the phone of Paranjoy Guha Thakurta, an Indian investigative\njournalist and author of a number of books about Indian business and politics, was hacked\nin 2018. Thakurta told Forbidden Stories that he often spoke with sources on the condition\nof anonymity, and said that at the time of his targeting he was working on an investigation\ninto the finances of the late Drirubhai Ambani, formerly the richest man in India.\n\n“They would know who our sources were,” Thakurta said. “The purpose of getting into my\nphone and looking at who are the people I’m speaking to would be to find out who are the\nindividuals who have been providing information to me and my colleagues.”\n\nThakurta is one of at least 40 Indian journalists selected as targets of an NSO client that\nappears to be the Indian government, based on the consortium’s analysis of the leaked\ndata.\n\n## PROFILES | Journalists under surveillance\n\nThe Indian government has never confirmed nor denied being a client of NSO Group. “The\nallegations regarding government surveillance on specific people has no concrete basis or\ntruth associated with it whatsoever ” wrote a spokesperson for the Ministry of Electronics\n\n\n-----\n\nand Information Technology in a response to detailed questions sent by Forbidden Stories\nand its partners.\n\nWhile previous reporting showed four journalists among the 121 Pegasus targets revealed\nin India in 2019, the records accessed by Forbidden Stories show that this surveillance may\nhave been much more extensive. More than 2,000 Indian and Pakistani numbers were\nselected as targets between 2017 and 2019, among them Indian journalists from nearly\nevery major media outlet, including The Hindu, Hindustan Times, the Indian Express, India\nToday, Tribune, and The Pioneer. Local journalists were also selected as targets, including\nJaspal Singh Heran, the editor in chief of a Punjab-based outlet that publishes only in\nPunjabi.\n\nThe phones of two of the three cofounders of the independent online news outlet The Wire\n– Siddharth Varadarajan and MK Venu – were both infected by Pegasus, with Venu’s phone\nhacked as recently as July. A number of other journalists who work for or have contributed\nto the independent news outlet – including columnist Prem Shankar Jha, investigative\nreporter Rohini Singh, diplomatic editor Devirupa Mitra and contributor Swati Chaturvedi –\nwere all selected as targets, according to the records accessed by Forbidden Stories and its\npartners, which include The Wire.\n\n“It was alarming to see so many names of people linked to The Wire, but then there are lots\nof people not linked to the Wire,” Varadarajan, whose phone was compromised in 2018,\nsaid. “So this seems to be a general predisposition towards subjecting journalists to high\nlevel surveillance on the part of the government.”\n\nMany of the journalists who spoke with Forbidden Stories and its partner news\norganizations expressed dismay at having learned that despite the precautions they had\ntaken to secure their devices – such as using encrypted messaging services and updating\ntheir phones regularly – their private information was still not secure.\n\n“We’ve been recommending each other this tool or that tool, how to keep [our phones] more\nand more secure from the eyes of the government,” Ismayilova said. “And yesterday I\nrealized that there is no way. Unless you lock yourself in [an] iron tent, there is no way that\nthey will not interfere into your communications.”\n\nPanyi worried that the public knowledge of his targeting could dissuade sources from\ngetting in contact with him in the future.\n\n“It’s every journalist who has been targeted’s concern that once it’s revealed that you were\nsurveilled and even our confidential messages could have been compromised, who the hell\nis going to talk to us in the future?” he asked. “Everyone will think that we’re toxic, that we’re\na liability.”\n\n\n-----\n\n## “Reading over your shoulder”: How Pegasus is used to spy on journalists in zero clicks\n\nAmnesty International Security Lab’s forensics analyses of cell phones targeted with\nPegasus as part of the Pegasus Project are consistent with past analyses of journalists\ntargeted through NSO’s spyware, including the dozens of journalists allegedly hacked in the\nUAE and Saudi Arabia and identified by Citizen Lab in December of last year.\n\n“There are a bunch of different pieces, essentially, and they all fit together very well,”\nClaudio Guarnieri, director of Amnesty International’s Security Lab, said. “There’s no doubt\nin my mind that what we’re looking at is Pegasus because the characteristics are very\ndistinct and all of the traces that we see confirm each other.”\n\nIn all, the Committee to Protect Journalists (CPJ) had previously documented 38 cases of\nspyware – developed by software companies in four countries – used against journalists in\nnine countries since 2011.\n\nEva Galperin, the director of cybersecurity at the Electronic Frontier Foundation (EFF), was\none of the first security researchers to identify and document cyber attacks against\njournalists and human rights defenders in Mexico, Vietnam and elsewhere in the early\n2010s.\n\nAt the time, in the early 2010s, most malware attacks were less sophisticated than they are\ntoday, she explained.\n\n“Back in 2011, you would receive an email and the email would go to your computer and the\nmalware would be designed to install itself on your computer,” she said.\n\nIt wasn’t until around 2014 that a “mobile-first” approach to spying on journalists gained\npopularity, as smartphones became more ubiquitous, she said. Clients of companies like\nNSO, Hacking Team and FinFisher used “social engineering” to send specifically-crafted\nmessages to targets, often baiting them with information about potential scoops or targeted\ninformation about members of their families. Targets would have to click a link in order for\nthe malware to be installed onto their phones.\n\nJournalists are obvious targets for intelligence agencies, Ostrovskiy said, because they are\nalways seeking new sources of information – opening themselves up to phishing attempts –\nand because many often don’t follow “industry best practices on digital security.”\n\nSome of the first Pegasus infections of journalists were identified in Mexico in 2015 and\n2016.\n\n\n-----\n\nIn January 2016, Carmen Aristegui, an investigative journalist in Mexico and the founder of\nAristegui Noticias, began to receive messages with suspicious links after she published an\ninvestigation into property owned by former Mexican President Enrique Pena Nieto.\n\nAristegui received more than 20 text messages containing malicious Pegasus links, digital\nrights group Citizen Lab would later reveal in the 2017 Gobierno Espia (“Government\nSpying”) report. According to the report, the phones of a number of her colleagues and\nfamily members were also targeted with text messages containing malicious links during\nthat same time period, including those of colleagues Sebastian Barragan and Rafael\nCabrera and her son Emilio Aristegui – just 16-years-old at the time.\n\nForbidden Stories and its partners were able to identify for the first time three other people\nclose to Aristegui who were selected as targets for surveillance in 2016: her sister Teresa\nAristegui, her CNN producer Karina Maciel and her former assistant Sandra Nogales.\n\n“It was a huge shock to see others close to me in the list,” Aristegui, who was part of the\nPegasus Project, said. “I have six siblings, but at least one of them, my sister, was entered\ninto the system. My assistant Sandra Nogales, who knew everything about me – who had\naccess to my schedule, all of my contacts, my day-to-day, my hour-to-hour – was also\nentered into the system.”\n\nMexican journalist Carmen Aristegui.\n_Credit: PBS/Forbidden Films_\n\nSince those early days, the installation of Pegasus spyware on smartphones has become\nmore subtle, Guarnieri said. Instead of the target having to click on a link to install the\nspyware, so-called “zero-click” exploits allow the client to take control of the phone without\nany engagement on the part of the target.\n\n“The complexity of performing these attacks has increased exponentially,” he said.\n\nOnce successfully installed on the phone, Pegasus spyware gives NSO clients complete\ndevice access and thereby the ability to bypass even encrypted messaging apps like\nSignal, WhatsApp and Telegram. Pegasus can be activated at will until the device is shut\noff. As soon as it’s powered back on, the phone can be reinfected.\n\n“If someone is reading over your shoulder, it doesn’t matter what kind of encryption was\nused,” said Bruce Schneier, a cryptologist and a fellow at Harvard’s Berkman Klein Center\nfor Internet and Society.\n\nAccording to Guarnieri, Pegasus operators are able to remotely record audio and video,\nextract data from messaging apps, use the GPS for location tracking, and recover\npasswords and authentication keys, among other things. Spying governments have moved\n\n\n-----\n\nin recent years toward a more hit and run strategy to avoid detection, Galperin said:\ninfecting phones, exfiltrating the data and quickly exiting the device.\n\nThese types of digital technologies go hand-in-hand with physical surveillance, according to\nOstrovskiy.\n\n“Digital intrusions are extremely valuable,” he said. “If we could, for instance, have known\nyour calendar, if we could have known that you’re going to have a certain meeting or we\ncould take a look at your email, your notes to whatever the materials that most of us have\non our phones, we’d have a huge leg up in being more successful in whatever goal we’re\ntrying to achieve.”\n\n## A new spyware marketplace\n\nSurveillance of journalists is not new, security experts say. What has changed is the market\nfor spyware.\n\nWhereas in the past governments developed spyware tools in-house, private spyware\ncompanies like NSO Group, FinFisher and Hacking Team saw an opening for selling their\nproducts to governments who didn’t previously have the technical expertise to develop their\nown signals intelligence programs, according to Galperin. This created a sort of “wild west”\nof spying on journalists and activists, she said.\n\nIn its 2018 “Hide and Seek” report, digital rights organization Citizen Lab identified\noperators of NSO’s Pegasus in a number of countries with records of arbitrarily detaining\njournalists and human rights defenders, including Saudi Arabia, Morocco and Bahrain. Put\ntogether, NSO clients in these countries have selected tens of thousands of phone\nnumbers, based on the consortium’s analysis of the leaked data.\n\nSome reporters, like Moroccan freelance investigative journalist Omar Radi, whose cyber\nintrusion Forbidden Stories reported on in 2020, or Indian journalist and human rights\ndefender Anand Teltumbde, were imprisoned after their phone infections were documented\nby advocacy groups and media outlets.\n\nSpyware companies have faced relatively few legal or financial consequences for the use of\ntheir spyware against journalists and human rights defenders – although recent legal cases\nhave begun to put pressure on these providers. In June 2021, executives of French\nspyware company Amesys have been indicted for “complicity in acts of torture” for selling its\nspyware to Libya between 2007 and 2011. According to plaintiffs in that case, information\ngleaned through digital surveillance was used to identify and hunt down opponents of\ndeposed dictator Muammar Gaddafi, who were later tortured in prison.\n\n\n-----\n\nIf you are doing good journalism, you are speaking truth to power and you are pissing off\npeople with power,” Galperin said. “The people who were doing journalism that was telling\nstories about corruption were often targeted. People who were doing activism that was\nagain, protesting corruption, protesting authoritarianism, those were often the people who\nwere on the front lines of being spied on.”\n\nNSO Group maintains that its technology is used exclusively by intelligence agencies to\ntrack criminals and terrorists. According to NSO Group’s Transparency and Responsibility\nreport, released in June 2021, the company has 60 clients in 40 countries around the world.\n\n“[Pegasus] is not a mass surveillance technology, and only collects data from the mobile\ndevices of specific individuals, suspected to be involved in serious crime and terror,” NSO\nGroup wrote in the report.\n\nAlthough the company also says that it has a list of 55 countries that it will not sell to on\naccount of their human rights records, those countries are not listed in the report. According\nto the report, NSO Group has revoked access to five clients since 2016 after investigations\ninto misuse and terminated contracts with five others that did not meet human rights\nstandards.\n\n“NSO Group will continue to investigate all credible claims of misuse and take appropriate\naction based on the results of these investigations,” NSO Group wrote in its statement to\nForbidden Stories and its media partners. “This includes shutting down of a customer’s\nsystem, something NSO has proven it’s (sic) ability and willingness to do, due to confirmed\nmisuse, done it multiple times in the past, and will not hesitate to do again if a situation\nwarrants.”\n\nYet the leaked data show that many other authoritarian governments known to repress\nfreedom of speech remain clients.\n\nAs part of the Pegasus Project, Forbidden Stories has been able to document the use of\nPegasus for the first time in Azerbaijan. More than 40 Azerbaijani journalists were selected\nas targets, including reporters from Azadliq.info and Mehdar TV, two of the only remaining\nindependent media outlets in the country.\n\nIn Azerbaijan, most independent news outlets are blocked and family members of\njournalists have routinely been harassed by the authorities. Under President Ilham Aliyev,\nwhose family has ruled Azerbaijan for decades, the space for critical voices – according to\nHuman Rights Watch – has been “virtually extinguished.”\n\nFreelance journalist Sevinc Vaqifqizi’s phone was compromised between 2019 and 2021,\naccording to an analysis conducted by Amnesty International’s Security Lab, in partnership\nwith Forbidden Stories. As a freelance reporter for Mehdar TV, Vaqifqizi had already\n\n\n-----\n\nreceived a number of threats, and in February 2020 was badly beaten while covering a\nprotest.\n\nThe reporter, in her early 30s with shoulder-length black hair, told journalists from the\nForbidden Stories consortium that she already assumed the government had access to her\nprivate information.\n\n“I said always to my friends that they can listen to us,” she said. “I’m worried about my\nsources who trust us and write us on WhatsApp. If they face some problems, that’s not\ngood for us.”\n\nAlthough she’s currently in Germany on a three-month fellowship, she did not feel safe from\nthe authorities. As Amnesty International and others have documented, Azerbaijani activists\nhave been physically and digitally targeted even after leaving the country.\n\n“If you have a phone, they can probably continue [targeting you] in Germany,” she said.\n\n## Out of sight, not out of reach\n\nThe walls of Hicham Mansouri’s office at the Maison des Journalistes (House of Journalists)\nin Paris are covered with posters from Reporters Without Borders and other press freedom\nadvocacy organizations. The journalist used to lived in the building, which doubles as an\nexposition space and a residence for refugee journalists. He has since moved out, but still\nshares a small office on the ground floor where he goes to work three times per week.\n\nBefore speaking with Forbidden Stories, Mansouri turned off his borrowed phone and\nburied it deep in his backpack. According to a forensic analysis by Amnesty International’s\nSecurity Lab, Mansouri’s previous iPhone had been infected with Pegasus more than 20\ntimes during a three-month period from February to April 2021.\n\nMansouri, a freelance investigative journalist and cofounder of the Moroccan Association of\nInvestigative Journalists (AMJI, by its French initials) who is currently working on a book\nabout the illegal drug trade in Moroccan prisons, fled Morocco in 2016 after numerous legal\nand physical threats against him.\n\n\n-----\n\nMoroccan journalist Hicham Mansouri.\n\nIn 2014, he was beaten by two unknown assailants after leaving a meeting with human\nrights defenders, including historian Maati Monjib, who was later targeted with Pegasus. A\nyear later, armed intelligence agents raided his home at 9 a.m., finding him and a female\nfriend in his bedroom together. They stripped him naked and arrested him for “adultery,”\nwhich is a crime in Morocco. He spent 10 months in a Rabat prison (a previous version of\n_this article stated that Mansouri was imprisoned in Casablanca), in a cell reserved for the_\nmost serious criminals that inmates had nicknamed “La Poubelle,” or “The Trash Bin.” The\nday after he was released from prison, Mansouri left Morocco for France, where he applied\nfor and was granted asylum.\n\nFive years later, Mansouri found out he was still a target of the Moroccan government.\n\n“Every authoritarian regime sees danger everywhere,” Mansouri told Forbidden Stories.\n“We don’t see ourselves as dangerous because we do things that we consider to be\nlegitimate, that we know are in our rights, but to them they’re dangerous.”\n\n“They’re afraid of the sparks, because they know they’re flammable,” he added.\n\n\n-----\n\nAt least 35 journalists in four countries were selected as targets by an NSO client that\nappears to be the Moroccan government, based on the consortium’s analysis of the leaked\ndata. Many of the Moroccan journalists selected as targets have been at some point\narrested, defamed or targeted in some way by intelligence services. Others who were\nselected as targets – including most notably newspaper editors Taoufik Bouachrine and\nSoulaimane Raissouni – are currently in prison on charges that human rights defense\norganizations contend were instrumentalized in an effort to shut down independent\njournalism in Morocco.\n\nIn a statement shared with Forbidden Stories and its partners, a Moroccan embassy\nrepresentive wrote that it did not “understand the context” of the questions sent by the\nconsortium and was “waiting for material proof” of “any relationship between Morocco and\nthe stated Israeli company.”\n\nBouachrine, the editor of Akhbar al-Youm, was arrested in February 2018 on charges of\nhuman trafficking, sexual assault, rape, prostitution, and harassment. Of 14 women who\nallegedly accused Bouachrine, 10 showed up to court and five declared that Bouachrine\nwas innocent, according to CPJ. The publisher had previously penned op-eds critical of the\nMoroccan regime, accusing various high level government officials of corruption. He was\nsentenced to 15 years in prison, and spent more than a year in solitary confinement.\n\nForbidden Stories and its partners have been able to confirm that the numbers of at least\ntwo women involved in the case were selected as targets of Pegasus.\n\nBouachrine’s successor, Soulaimane Raissouni, was also arrested on sexual assault\ncharges in May 2020, and was sentenced to five years in prison in July 2021. Raissouni\nwas accused of assault by an LGBTQ activist, Adil Ait Ouchraa, who told CPJ that he hadn’t\npreviously felt comfortable filing a public claim because of his sexual identity.\n\nJournalists and press freedom advocates told CPJ they believed the claim had been filed as\nretaliation against Raissouni’s critical reporting. In 2021, still awaiting trial, Raissouni began\na hunger strike that as of this writing, had lasted more than 100 days. His family members\nsaid that after 76 days he was in critical condition.\n\n“The point [of surveillance] is presumably to track the private lives of individuals in order to\nfind a hook on which they can hang any big trial,” said Ahmed Benchemsi, a former\njournalist and founder of the independent media organizations TelQuel and Nichane who\nnow leads communications for the MENA region at Human Rights Watch.\n\nWhile in the past Moroccan journalists were routinely hit with legal attacks for things they\nwrote – such as defamation or disrespecting the king – the new tactic was to accuse them\nof more serious crimes such as espionnage and later rape and sexual assault, he said.\nSurveillance emerged as a key tool in gleaning personal information that could be used to\nthose ends.\n\n\n-----\n\nThere s often a sliver of truth to a large mass of slander, but that sliver of truth is usually\nsomething personal and confidential that can only come from surveillance,” he said.\n\nForeign journalists who have covered the plight of Moroccan journalists have also been\nselected as targets and in some cases their phones were successfully infected.\n\nThe phone of Edwy Plenel, the director and one of the cofounders of Mediapart, a French\ninvestigative journalism outlet, was compromised in the summer of 2019, according to an\nanalysis by Amnesty International’s Security Lab that was peer-reviewed by the digital rights\norganization Citizen Lab.\n\nIn June of that year, Plenel had attended a two-day conference in Essaouira, Morocco, at\nthe request of a journalist partner of Mediapart – Ali Amar, the founder of the Moroccan\ninvestigative magazine LeDesk – whose phone number also appears in the records\naccessed by Forbidden Stories. At the event, Plenel gave a number of interviews in which\nhe spoke about human rights violations committed by the Moroccan state. Upon his return\nto Paris, suspicious processes began appearing on his device.\n\n“We worked with Ali Amar; we published some investigations together and I knew Ali Amar,\na bit like I know many of the journalists fighting for a free press in Morocco,” Plenel said in\nan interview with Forbidden Stories. “So when I learned about my surveillance, all of this\nmade sense.”\n\n\n-----\n\nDirector of Mediapart Edwy Plenel.\n_Credit: Place au Peuple / Licence CC BY-SA 2.0._\n\nPlenel said that the targeting of his phone and that of another Mediapart journalist, Lenaig\nBredoux, with Pegasus was most likely a “Trojan Horse aimed at our Moroccan colleagues.”\n\nLike Mansouri, many Moroccan journalists have either fled the country or stopped doing\njournalism altogether. Raissouni and Bouachrine’s newspaper, Akhbar al-Yaoum, burdened\nby their consecutive arrests and financial pressure, stopped publishing in March 2021.\n\n“There was space for free speech in Morocco about 10 or 15 years ago,” Benchemsi said.\n“There is no more. It’s over. Surviving today means internalizing a high level of selfcensorship, unless you support the authorities of course.”\n\n## A deadly weapon?\n\nIn NSO Group’s 2021 transparency report, one phrase appears three times: “save lives.”\n“Our goal,” the company writes at one point, “is to help states protect their citizens and save\nlives.” Yet the troubling use of NSO spyware against journalists and their family members,\nas identified in the Pegasus Project and in previous reports by digital rights NGOs, casts\ndoubts on this narrative.\n\nOn October 2, 2018, around 1 pm, Washington Post columnist Jamal Khashoggi walked\ninto the Saudi consulate in Turkey and never came back out. The brazen assassination of\nthe dissident journalist initiated a wave of global responses, with world leaders, human\nrights groups and concerned citizens calling for an in-depth investigation into his murder –\nand the potential implication of NSO Group’s spyware in it.\n\nTwo weeks after his murder, digital rights organization Citizen Lab reported that a close\nfriend of Khashoggi, Omar Abdulaziz, had been targeted with NSO’s Pegasus in the months\nbefore Khashoggi’s murder.\n\nNSO, for its part, has repeatedly said that it has access to a “kill switch” and that it has\nrevoked access to clients when human rights are not respected. The company has\ncategorically denied any involvement in Khashoggi’s murder.\n\nBut new revelations from Forbidden Stories and its partners have found that Pegasus\nspyware was successfully installed on the phone of Khashoggi’s fiancée Hatice Cengiz just\nfour days after the murder. The phone of Khashoggi’s son, Abdullah, was selected as a\ntarget of an NSO client that appears to be the UAE government, based on the consortium’s\nanalysis of the leaked data, several weeks after the murder. Close friends, colleagues and\nfamily members of the murdered journalist were all selected as targets by NSO clients that\nappear to be the governments of Saudi Arabia and the UAE, according to the Pegasus\nProject revelations released today.\n\n\n-----\n\nHatice Cengiz, Jamal Khashoggi's fiancée.\n\n_Credit: PBS/Forbidden Films_\n\n“As NSO has previously stated, our technology was not associated in any way with the\nheinous murder of Jamal Khashoggi,” NSO Group wrote in its letter to Forbidden Stories.\n“We can confirm that our technology was not used to listen, monitor, track or collect\ninformation regarding him or his family members mentioned in your inquiry.”\n\nKhashoggi’s death, and the spyware lingering on the margins of it, security experts say, was\nnot necessarily a unique case.\n\n“[Khashoggi is] certainly not the first journalist to have been killed by an angry government.\nAnd he’s not the first journalist to have been killed by an angry government for his\njournalism with some element of malware and surveillance involved,” Galperin, at EFF, said.\n“These are things that very frequently go together.”\n\nOn March 2, 2017, local Mexican journalist Cecilio Pineda took out his phone and recorded\nhis final broadcast. In it, the reporter from the city of Altamirano, who ran a Facebook with\nmore than 50,000 followers, spoke about alleged collusion between state and local police\nand the leader of a drug cartel.\n\nTwo hours later, he was dead – shot at least six times by two men on a motorcycle as he\nlay in a hammock outside of a car wash.\n\n\n-----\n\nWhen Pineda was assassinated in 2017, at the age of 38, the world blinked and moved on.\nHis death was seen as just another reporter killed in Mexico – the deadliest non-conflict\nzone in the world to be a journalist. But Pineda’s death may have been more than a driveby job by a local cartel, according to the records accessed by Forbidden Stories and its\npartners.\n\nJust a few weeks before he was killed, Pineda’s work cell phone was selected as a target of\nan NSO client in Mexico.\n\nForbidden Stories has been able to confirm that not just Pineda, but also the state\nprosecutor who investigated the case, Xavier Olea Pelaez, were selected as targets of\nPegasus in the weeks and months before his murder. Forbidden Stories was unable to\nanalyze Pineda’s phone because it disappeared immediately after his death. Pelaez did not\nkeep his phone from the time, so it was not possible to confirm an infection by Pegasus.\n\nPineda’s reporting, however, gives traces as to why Pineda’s work could have troubled\nMexican authorities who may have had access to this technology. At the time of his\nselection, Pineda was investigating links between the local crime boss, known as El\nTequilero, and the governor of the state of Guerrero, Hector Astudillo. Friends and family\nwho spoke with Forbidden Stories and its partners said that Pineda had received threats\nand had asked to be placed in a federal mechanism for the protection of journalists.\n\n“Cecilio received many serious threats but he would play them down,” Israel Flores, a friend\nof Pineda’s, said in a recent interview. “He’d always say ‘nothing will happen.’”\n\nAs Pineda continued to report on the nexus of local politicians and drug traffickers, the\nthreats came ever closer to him. A few days before his death, men in a white car took\nphotos of his home, his mother said.\n\nThe day he was killed, he stopped by his mother’s house before meeting a friend at a\npolitical rally. That was the last time she saw him.\n\n“He told me ‘the bad guys aren’t going to kill me, they know me, they’re my friends. If they\nkill me it will be the government,” her mother said in an interview.\n\nPineda’s wife, Marisol Toledo, told a member of the Forbidden Stories consortium that the\nday after Pineda’s death she received a call from a government employee who told her he\nwas investigating the murder. He never followed up.\n\n“We don’t know what happened in the investigation,” Toledo said. “We don’t want trouble.\nPeople with power can do what they want, to who they want.”\n\nPineda’s phone was also never found – as it had disappeared from the crime scene by the\ntime the authorities had arrived. But when told about the possible role of spyware in tracking\nPineda’s movements, Toledo was not surprised.\n\n\n-----\n\nIf they succeeded, they would have known where he was at all times, she said.\n\n## The Pegasus Project | All the articles\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-18 - Pegasus- The new global weapon for silencing journalists.pdf"
    ],
    "report_names": [
        "2021-07-18 - Pegasus- The new global weapon for silencing journalists.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf02412a-041a-4c8d-8ffa-3bff7dd812b5",
            "created_at": "2024-02-02T02:00:04.018717Z",
            "updated_at": "2025-03-27T02:00:03.289534Z",
            "deleted_at": null,
            "main_name": "Blue Tsunami",
            "aliases": [
                "Black Cube"
            ],
            "source_name": "MISPGALAXY:Blue Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535585,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653764299,
    "ts_modification_date": 1653764299,
    "files": {
        "pdf": "https://archive.orkl.eu/969b726ca22fa5bb70a3fc4c57ad224be43bc15b.pdf",
        "text": "https://archive.orkl.eu/969b726ca22fa5bb70a3fc4c57ad224be43bc15b.txt",
        "img": "https://archive.orkl.eu/969b726ca22fa5bb70a3fc4c57ad224be43bc15b.jpg"
    }
}