{
    "id": "332b92d7-b881-4366-bd60-92cc68b06a55",
    "created_at": "2023-01-12T15:07:34.383932Z",
    "updated_at": "2025-03-27T02:05:31.22163Z",
    "deleted_at": null,
    "sha1_hash": "ebc8a81151c0bff3bfde8e0dbd8d167eeee59082",
    "title": "2022-03-24 - Phishing-kit market- what’s inside “off-the-shelf” phishing packages",
    "authors": "",
    "file_creation_date": "2022-05-28T21:40:17Z",
    "file_modification_date": "2022-05-28T21:40:17Z",
    "file_size": 1619485,
    "plain_text": "# What are phishing kits?\n\n**[securelist.com/phishing-kit-market-whats-inside-off-the-shelf-phishing-packages/106149/](https://securelist.com/phishing-kit-market-whats-inside-off-the-shelf-phishing-packages/106149/)**\n\nAuthors\n\n[Olga Svistunova](https://securelist.com/author/olga-svistunova/)\n\n[Anton Yatsenko](https://securelist.com/author/anton-yatsenko/)\n\nOne of the most common tricks scammers use in phishing attacks is to create a fake official\npage of a famous brand. Attackers tend to copy design elements from the real website,\nwhich is why users can find it hard to distinguish the fake pages from the official ones. Even\nphishing page domain name can often look like the real web address of a certain brand, as\ncybercriminals include the name of the company or service they are posing as in the URL.\nThis trick is known as combosquatting.\n\n\n-----\n\n**_Combosquatting: registering a fake website with a domain name which contains_**\n**_“facebook.com”_**\n\nGiven phishing websites can be efficiently blocked or added to anti-phishing databases,\ncybercriminals have to generate these pages quickly and in large numbers. Creating them\nfrom scratch over and over again is time-consuming, and not all cybercriminals have the\nweb-development and administration skills it takes. That is why cybercriminals favor phishing\nkits, which are like model aircraft or vehicle assembly kits. They consist of ready-made\ntemplates and scripts which can be used to create phishing pages quickly and on a massive\nscale. Phishing kits are fairly easy to use, which is why even inexperienced attackers who do\nnot have any technical skills can get their heads around them.\n\nCybercriminals tend to use hacked official websites to host pages generated using the\nphishing kits or rely on companies which offer free web-hosting providers. The latter are\nconstantly working to combat phishing and block the fake pages, although phishing websites\n[often manage to serve the intended purpose within their short period of activity, which is to](https://securelist.com/phishing-page-life-cycle/105171/)\ncollect and send personal data of victims to criminals.\n\n## Contents of phishing kits: basic and complex phishing kits\n\nPhishing kits are ready-to-deploy packages which require the bare minimum effort to use.\nMoreover, their developers usually provide instructions with their products for inexperienced\nattackers. Phishing kits usually are designed to generate copies of websites representing\nfamous brands with large audiences. After all, the more potential victims there are, the more\nmoney there is to be stolen. The phishing kits we detected in 2021 most frequently created\ncopies of Facebook, the Dutch banking group ING, the German bank Sparkasse, as well as\nAdidas and Amazon.\n\n\n-----\n\nThe most basic option phishing kits offer is a ready-made phishing page which is fairly simple\nto upload on a web-hosting service.\n\n**_Contents of simple phishing-kit archive_**\n\nThese phishing kits have two essential components for practical reasons:\n\n1. An HTML page with a phishing data-entry form and related content (style, images,\n\nscripts and other multimedia components). Attackers aim to make the page look\nidentical to pages on the company’s official website whose users they want to target in\nthe attack. However, the fake page’s HTML code differs from the original code.\n2. The phishing script that sends data victims enter on the fake page to cybercriminals. It\n\nis usually a simple script which parses the phishing data-entry form. In the phishing\nscript’s code, cybercriminals also indicate the Telegram bot authentication token, e-mail\naddress or other third-party online resources where stolen data will be sent using the\nphishing kit. The phishing kit’s creators often comment the line where an address or\ntoken needs to be entered.\n\n**_Telegram bot token in a phishing kit’s code_**\n\nInstead of providing ready-to-load pages, more sophisticated phishing kits contain their\nelements (images, forms, phishing script, text fragments etc.), along with a separate script\nwhich creates new pages from these elements.\n\n\n-----\n\n**_Contents of a phishing-kit archive: phishing pages created automatically when_**\n**_index.php file is run_**\n\nThere are also advanced phishing packages which not only come with all the tools and\nelements needed to assemble the web pages, but also include a control center with a user\ninterface. Attackers can use this control center to tailor how a phishing page functions, e.g.,\nby specifying how they would like to receive stolen data. Some sophisticated phishing kits\nallow to generate pages which target users from different countries using a built-in dictionary\ncontaining the same phrases in different languages.\n\n\n-----\n\n**_Dictionary from an advanced phishing kit_**\n\nIn addition to tools for attackers to create phishing pages themselves, some phishing kits can\ninclude scripts for sending out messages to potential victims via popular messaging apps or\ne-mail which contain links to phishing pages. These mailings tend to be the go-to channel\ncybercriminals use to get their pages out there. The contact details of potential victims can\nbe found on the dark web, where a colossal amount of databases are sold which detail\nclients of various companies and services.\n\nMany of the scripts for sending out messages included in phishing kits or sold separately can\nadd a URL parameter in the links which contains the recipient’s e-mail address. This\nparameter is used extensively in corporate phishing attacks. Some known phishing kits\nwhich target the corporate sector are able to capture the e-mail domain located in the URL\nparameter and generate a phishing page tailored to this domain name. There are several\ncommon ways to deploy this dynamic content generation:\n\nThe text on the page adapts to the domain name, which makes it look more\npersonalized to increase the victim’s trust.\n\n\n-----\n\nIcons are loaded from the Internet which are related to the victim s domain name,\nwhere the domain itself is essentially the key word used in a search request to load\nicons.\n\n**_Code with the URL of a loaded icon corresponding to the victim’s domain_**\n\n\n-----\n\n**_User-Related Dynamic Content: content from phishing website along with text_**\n**_and an icon loaded using the domain name in the URL_**\n\n\n-----\n\nLegal iFrame Background: based on the e-mail domain, an iFrame opens with the\nlegitimate website in the background and a phishing entry form imposed on top of it.\n\n**_iFrame with legitimate website as the background_**\n\n## Anti-detection methods\n\nSome sophisticated phishing kits include functional elements which prevent a page from\nbeing accessed by unwelcome agents, such as bots used by known anti-phishing solution\ndevelopers or search engines. The latter are unwelcome, because if a phishing page ends\nup being a search-result hit, there’s a high risk it’ll soon get blocked.\n\n\n-----\n\n**_Contents of sophisticated phishing-kit archive with bot detection_**\n\nApart from that, some of the phishing kits we detected used geoblocking. For example,\nphishing attacks written in Japanese had pages which could only be opened from Japanese\nIP addresses. Blocking tended to be triggered by the detection of the User Agent string,\nwhich identifies the user’s browser, or based on their IP address, although there are also\nsome technologies which analyze request headers. This was all done in order to reduce the\nrisk of detection by bots from the developers of anti-phishing solutions scanning the phishing\npage, and to avoid ending up in anti-phishing databases.\n\nSome phishing kits add various obfuscation options for the generated pages and pure “junk”\ncode which aims to make it harder for anti-phishing solutions to detect and block these\npages. Some tricks worth highlighting include:\n\n\n-----\n\n**Caesar cipher. Every character in the text is replaced by a character which is a fixed**\nnumber of positions further along in the alphabet. This results in the text in the original\ncode of the phishing page looking like alphabet soup, but when the page is loaded the\nshift reverts back and the user sees the page with normal decoded text. The script for\nimplementing Caesar code is written by the creators of the phishing kits themselves.\n\n**_Code of a page with text encrypted in Caesar code_**\n\n**Page source encoding. Text or even the page’s entire HTML code is encoded using**\nan algorithm such as base64 or AES and decoded on the browser’s end. Unlike\nCaesar code, the algorithms for decoding and decrypting data in the phishing kit’s code\nare implemented using standard libraries.\n\n\n-----\n\n**Invisible HTML tags. A large amount of code is added to the page which does not do**\nanything during the rendering process when code becomes what’s visible on screen —\nits aim is to make the page harder to detect. See the example below, where chunks of\ntext are hidden among junk HTML tags which do not appear on screen according to the\ninformation in the style sheet.\n\n**_Junk HTML tags_**\n\n\n-----\n\n**String slicing. Cutting a string into groups of characters which can be rearranged, and**\nreferring to characters by their number in a code table instead of explicitly writing them\nout. A massive puzzle of these substrings is pieced together when a page is loaded to\nform the full string.\n\n**_String slicing: concealing malicious links in code_**\n\n**Randomized HTML attributes. The randomization of tag attribute values which then**\nhave no further use in the code. This is used to trick anti-phishing technologies which\nwork by analyzing layout: when a page’s code contains a lot of variable attributes, the\ndetection rules the technology relies on cannot count all of them because the\nprobability of making a false detection is too high.\n\nIt is also worth mentioning that similar forms of obfuscation can also be used by the\ndevelopers of phishing kits themselves with the aim of getting hold of data their clients have\nmanaged to collect using their product. In this case, it is not the text of the phishing page\nthat’s obfuscated, but the code responsible for transferring information back to the creator of\nthe phishing kit is made obscure to prevent the client using the kit from understanding it.\n\nThese methods may aim to prevent anti-phishing solutions from finding clues in the original\npage which would allow them to classify it as a phishing page. However, we have learned\nhow to detect and successfully block these fake pages using deep automated analysis of\ncontent.\n\n## Phishing-kit pricing and marketplace\n\n\n-----\n\nPhishing kits can be purchased on insider forums on the dark web or through private\nTelegram channels. Prices vary and more often than not depend on the level of\nsophistication and quality a particular kit has to offer. For instance, phishing kits up for sale\non one Telegram channel are priced from USD 50 to 900. Moreover, some phishing kits are\nfreely available online.\n\n**_Phishing kits up for sale on a Telegram channel_**\n\nPhishing kits are also sold as part of software-as-a-service (SaaS) package. It’s dubbed\nPhishing-as-a-Service (PHaaS) and lately it’s been growing more popular. The packages\nconsist of a wide range of specialized scamming services: from the creation of fake websites\nposing as a popular brand to launching a targeted data-theft campaign. This includes\nstudying the target audience, sending out phishing messages, as well as encrypting and\nsending the stolen data to the client.\n\nFor example, one online resource offering Phishing-as-a-Service has a phishing kit for\nstealing login credentials from a Microsoft account using an invitation to view an Excel\ndocument as bait, which can be purchased for a relatively small sum of money. The seller\n\n\n-----\n\nguarantees the product has been tried and tested on all device types. It claims 100% of\nbuyers were satisfied with the quality of the product, and promises to send the victim’s data\nvia e-mail.\n\n\n-----\n\n-----\n\n**_Phishing kit for creating a fake website using an Excel document as bait, sold as_**\n**_Phishing-as-a-Service_**\n\n## Statistics\n\nLast year we detected 469 individual phishing kits, which allowed us to block 1.2 million\nphishing websites. The graph below shows the dynamics of the TOP 10 phishing kits we\ndetected over a period from August 2021 to January 2022, along with the number of unique\ndomains where each of these phishing kits were encountered. Overall, the number of unique\ndomains where we detected content unboxed from phishing kits exceeded 25,000 in\nOctober.\n\n_Number of unique domains using the TOP 10 phishing kits, August 2021 — January 2022_\n_[(download)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2022/03/21120307/01-en-phishkit-market.png)_\n\nBased on the data presented here, we can conclude that some phishing kits are used fairly\nextensively and survive for a rather long time, while others are no longer visible after a month\nor two.\n\n## Conclusion and advice\n\nScammers often rely on phishing kits to orchestrate phishing campaigns, especially those\nwho are inexperienced and have a poor grasp of programming. They are relatively simple\ntools for quickly creating fake websites and collecting the data cybercriminals steal using\nthem. Some kits can also include tools for sending out phishing e-mails, a control panel and\ndictionaries to localize the phishing attacks.\n\nCybercriminals usually get their phishing kits from forums on the dark web or closed\nTelegram channels. Scammers who are poor or on a tight budget can find some basic opensource tools accessible online. Those who are better-off can commission Phishing-as-aService, which often includes various phishing kits.\n\nLast year alone, we detected and blocked around 1.2 million phishing pages created using\nphishing kits. In addition to no-frills phishing kits, we encountered more sophisticated ones\nwhich had anti-bot features, geoblocking and anti-detection methods, such as obfuscation\nand junk code.\n\n\n-----\n\nPhishing websites are most frequently circulated in spam campaigns via e-mail or messaging\napp. We recommend users take the following precautions to avoid getting reeled in by the\nphishers:\n\nTreat links in e-mails and messages sent by people you don not know with suspicion,\nas well as “viral” messages which prompt you to forward them to a set number of your\ncontacts. Avoid clicking on links where possible and manually type out the URL in the\naddress bar instead or open the app in question.\nBefore entering your login credentials on a website, make sure the URL in the address\nbar is correct.\nUse a [reliable security solution which blocks attempts to follow links leading to phishing](https://www.kaspersky.com/internet-security)\nwebsites.\n\nWe recommend companies keep track of new phishing kits targeting their clients or\nemployees. You can receive information about phishing kits through services which provide\n[data about cyberthreats, such as Kaspersky Threat Intelligence Portal.](https://opentip.kaspersky.com/Help/Doc_data/About.htm)\n\n[Cybercrime](https://securelist.com/tag/cybercrime/)\n[Fraud](https://securelist.com/tag/fraud/)\n[Phishing](https://securelist.com/tag/phishing/)\n[Phishing kits](https://securelist.com/tag/phishing-kits/)\n[Phishing websites](https://securelist.com/tag/phishing-websites/)\n[Thematic phishing](https://securelist.com/tag/thematic-phishing/)\n\nAuthors\n\n[Olga Svistunova](https://securelist.com/author/olga-svistunova/)\n\n[Anton Yatsenko](https://securelist.com/author/anton-yatsenko/)\n\nPhishing-kit market: what’s inside “off-the-shelf” phishing packages\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-24 - Phishing-kit market- what’s inside “off-the-shelf” phishing packages.pdf"
    ],
    "report_names": [
        "2022-03-24 - Phishing-kit market- what’s inside “off-the-shelf” phishing packages.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536054,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653774017,
    "ts_modification_date": 1653774017,
    "files": {
        "pdf": "https://archive.orkl.eu/ebc8a81151c0bff3bfde8e0dbd8d167eeee59082.pdf",
        "text": "https://archive.orkl.eu/ebc8a81151c0bff3bfde8e0dbd8d167eeee59082.txt",
        "img": "https://archive.orkl.eu/ebc8a81151c0bff3bfde8e0dbd8d167eeee59082.jpg"
    }
}