{
    "id": "335fd697-2f15-40de-a942-7e87103e3ec2",
    "created_at": "2023-01-12T15:00:23.684799Z",
    "updated_at": "2025-03-27T02:16:55.43715Z",
    "deleted_at": null,
    "sha1_hash": "3401282d3885a4fafaaf467584f09a5f9a4a70e5",
    "title": "2020-06-14 - Deep-dive- The DarkHotel APT",
    "authors": "",
    "file_creation_date": "2022-05-27T22:06:43Z",
    "file_modification_date": "2022-05-27T22:06:43Z",
    "file_size": 1124027,
    "plain_text": "# Deep-dive: The DarkHotel APT\n\n**[blog.bushidotoken.net/2020/06/deep-dive-darkhotel-apt.html](https://blog.bushidotoken.net/2020/06/deep-dive-darkhotel-apt.html)**\n\nBushidoToken\n\n\n-----\n\n**PART 1: DARKHOTEL**\n\nDarkHotel is a sophisticated and active advanced persistent threat (APT) group. It’s highly\ncapable and is known for finding and taking advantage of previously unknown vulnerabilities\nin common software also known as a 0day. It is a well-established group that has been\nactive since 2007, are known Korean-speakers, and are working on behalf of a nation state.\n\nDarkHotel was first disclosed in 2014 and is also known as DUBNIUM, Black Shop, Fallout\nTeam, Karba, Luder, Nemim, Nemain, Tapaoux, Pioneer, Shadow Crane, APT-C-06, and\nTUNGSTEN BRIDGE. From the NSA’s [sigs.py script (also known as Territorial Dispute or](https://www.crysys.hu/publications/files/tedi/ukatemicrysys_territorialdispute.pdf)\nTeDi) DarkHotel is signature number 25 (SIG25). Malware associated with DarkHotel\nincludes Asruex, Parastic Beast, Inexsmar, Retro backdoor, Gh0st RAT, and the new\nRamsay toolkit. Vulnerabilities leveraged in its 0day exploits include CVE-2018-8174, CVE\n\n-----\n\n2018-8373, CVE-2019-1458, CVE-2019-13720, CVE-2019-17026, and CVE-2020-0674.\nDarkHotel also often exploits CVE-2017-8570 and CVE-2017-11882, high-risk well-known\nissues in Microsoft Office.\n\nDarkHotel appropriately earned its name infecting the WiFi networks (WLANs) of hotels\ntypically used by business executives. This was in effort to compromise their devices such as\nsmartphones and laptops that may potentially contain intellectual property and the\nindividual’s emails or contact lists. The WLAN of the hotels are compromised via leveraging\nstolen certificates, deploying .HTA files that masquerades as software updates containing the\nmalware. The WiFi routers themselves are taken over either by remotely exploiting\nvulnerabilities or by gaining physical access inside the targeted hotels. As DarkHotel is statesponsored it more than likely has capable human operators to deploy during its campaign.\n\nThis APT has targeted a wide array of countries in Asia, Europe, North America, and Africa.\nIt primarily focuses on North Korea, South Korea, Japan, and China. Organisations in\nsectors such as telecommunications, manufacturing, finance, pharmaceutical, chemicals,\nautomotive, defence, law enforcement, militaries, and NGOs have all been compromised by\nDarkHotel.\n\nDarkHotel has repeatedly demonstrated its capabilities of developing exploits for 0day\n**vulnerabilities in software such as Google Chrome, Mozilla Firefox, Internet Explorer, and**\nWindows Kernel. The exploits are leveraged to deliver malware that can provide backdoor\naccess and remote control over the target device. DarkHotel hides its malware behind layers\nof encryption, obfuscation, and only deploys it in singular attacks so as not to expose its\n\n\n-----\n\nstolen certificates or 0day vulnerabilities. This group is a well-established expert at spearphishing where it has researched its targets using OSINT and potentially HUMINT. Its lures\nhave included political news, changes in legislation, and other business news.\n\nIn November 2014, we saw the first details of the specific activities of the DarkHotel APT.\nKaspersky published a report detailing a sophisticated cyber-espionage campaign targeting\nbusiness travelers in the Asia-Pacific region. The group has been around for nearly a\ndecade and some researchers believe its members are Korean speakers. In 2015, it was\nfound that DarkHotel was more than likely exploiting a leaked 0day vulnerability from the\nItalian offensive security firm, Hacking Team. DarkHotel used spear-phishing emails with\n.RAR archives that appear to hold a harmless-looking .jpg file. If opened, MS paint is\nlaunched and its malware is executed in the background.\n\nIn May 2018, DarkHotel was found to be responsible for distributing a 0day for CVE-2018**8174. This attack used URLMoniker to invoke Internet Explorer via Microsoft Word while**\nignoring the victim's default browser settings - a previously unknown technique. The group\nalso leveraged CVE-2018-8373 later that same year.\n\nIn November 2019, a threat campaign was discovered, dubbed ‘Operation WizardOpium’,\nwhich exploited a vulnerability in Google’s Chrome Browser, tracked as CVE-2019-13720.\nThe exploit was deployed on a Korean-language news portal, the site’s main page had\nmalicious JavaScript injected into it. No threat group has been linked directly to Operation\nWizardOpium, but similarities in code samples have been correlated with both the Lazarus\nand DarkHotel APTs. Part of the attacks included a Microsoft Windows privilege escalation\n0day exploit - which was later assigned CVE-2019-1458 - that utilised the win32k component\nof the Windows kernel. This bug, CVE-2019-1458, meant that the attackers could bypass\ndetection systems on Google Chrome’s sandbox to deploy the other 0day exploit for CVE[2019-13720. [1]](https://securelist.com/the-zero-day-exploits-of-operation-wizardopium/97086/)\n\nMore recently, ESET uncovered a previously unreported cyber-espionage toolkit, dubbed\n**Ramsay, that is tailored for collection and exfiltration of sensitive documents and is capable**\nof operating within air-gapped networks. It shares similarities with the Retro backdoor and is\n[linked to DarkHotel. [2]](https://www.welivesecurity.com/2020/05/13/ramsay-cyberespionage-toolkit-airgapped-networks/)\n\nTencent has further analysed the Ramsay attacks and cross-analysed the IOCs with\ncampaigns it has tracked in the past. Interestingly, these attacks and those related to the\nRetro backdoor go as far back as 18 years ago and later incorporated the Asruex backdoor\n\n\n-----\n\nto attack isolated networks since 2015. Tencent has linked these attacks to DarkHotel, a\nthreat group that it claims is allegedly working for the National Intelligence Service of the\n**[South Korean government. [3]](https://s.tencent.com/research/report/1000.html)**\n\nThe DarkHotel threat group has launched a large campaign targeting Chinese government\nagencies and their employees. The attacks began in March, and are thought to be using\ncoronavirus-themed lures. The threat actors are using a 0day vulnerability (tracked as SRC2020-281) in Sangfor SSL VPN servers to provide remote access to enterprise and\n[government networks. [4]](http://blogs.360.cn/post/APT_Darkhotel_attacks_during_coronavirus_pandemic.html%20%20https://twitter.com/RedDrip7/status/1247737928953946112)\n\nSecurity research group RedDrip also found that the DarkHotel threat group developed a\nnew exploit for another Internet Explorer (IE) vulnerability, CVE-2019-1367, to target China.\nAt the time of reporting, the malicious file being used to exploit this flaw is currently detected\n[by 18 out of 57 engines on VirusTotal. [5,](https://twitter.com/RedDrip7/status/1222887262234394624) [6]](https://www.virustotal.com/gui/file/be8fdfce55ea701e19ab5dd90ce4104ff11ee3b4890b292c46567d9670b63b82/detection)\n\nIn April 2020, JPCERT found that an APT group was exploiting two vulnerabilities patched\nearlier this year in Firefox and Internet Explorer (IE). These attacks have mostly been aimed\nat China and Japan. The first flaw affects the Firefox browser and is tracked as CVE-2019**17026. The second, designated CVE-2020-0674, is a remote code execution (RCE) flaw in**\nInternet Explorer. Both bugs were patched in January and February 2020. Both\nvulnerabilities were used as part of a campaign aimed at Chinese government agencies and\nattributed to the DarkHotel APT. This campaign delivered the Gh0st RAT malware onto\n[compromised devices. [7]](https://blogs.jpcert.or.jp/ja/2020/04/ie_firefox_0day.html)\n\nThreat actors recently attempted to break into the systems of the World Health\n**Organization (WHO). The organisation reported a significant increase in attacks against it**\nsince the start of the coronavirus pandemic. The most recent activity was observed around\n13 March, when a group of malicious actors launched a fake site impersonating the WHO's\ninternal email system. It has not be confirmed who is exactly responsible for the attack but\nresearchers believe that it was the DarkHotel threat group. Further, Kaspersky researchers\nfound that the same infrastructure was also used in targeting other healthcare and\n[humanitarian organisations. [8]](https://www.reuters.com/article/us-health-coronavirus-who-hack-exclusive/exclusive-elite-hackers-target-who-as-coronavirus-cyberattacks-spike-idUSKBN21A3BN)\n\n**PART 2: STARCRUFT**\n\n\n-----\n\nIn mid-2019 ScarCruft APT was also dislcosed by Kaspersky researchers. Their investigation\nled to uncovering that it's another Korean-speaking threat actor with several connections to\nDarkHotel. StarCruft became known for creating new tools and techniques to identify\n**Bluetooth devices. These are used for information gathering campaigns and finding targets.**\n\nStarCruft also developed a new method to steal data from smartphones and created\nmalware that could fingerprint Bluetooth devices using the Windows Bluetooth API.\nInterestingly, the group's targets include investment and trading companies in Vietnam and\nRussia that have links to North Korea, along with organisations based in Hong Kong and\n[North Korea. [1,](https://www.kaspersky.com/about/press-releases/2019_scarcruft-evolve) [2]](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/scarcruft-launches-malware-with-bluetooth-device-harvesting-capability)\n\nPART 3: HIGAISA\n\nLate last year, a new APT was publicly disclosed by Tencent, dubbed Higaisa. It was initially\nthought that the group was North Korean, but researchers concluded that Higaisa instead\n**originated from South Korea. The Higaisa APT's main targets have been government,**\ndiplomatic, and trade organisations with links to North Korea. It has carried out attacks in\nChina, Japan, Russia, Poland, and other nation states. Higaisa is an evolving threat as it\nbegan by distributing executable files in an unsophisticated way. Now, however, the group\nleverages exploits and complex multi-stage infection chains with advanced defence evasion\ntechniques.\n\nMore recently COVID-19-themed phishing lures have been linked to Higaisa. The decoy\ndocument used in the attacks, an LNK file disguised as a PDF, contains a World Health\n**Organisation (WHO) situation report regarding the spread of COVID-19. If opened, arbitrary**\ncommands are executed to download an encrypted payload to initiate the infection chain.\nAfter several stages of obfuscated payloads, the compromised device is connected to\nHigaisa’s C&C server. Other malware observed in the attacks includes Gh0st RAT that\nprovides backdoor access and remote control for further post-exploitation activities. A simple\ninfostealer is used to collect system information that also facilitates the execution of console\ncommands and relays the responses to the C&C server. Newer Higaisa attacks now\nleverage the Zeplin collaborative platform in more decoy PDFs disguised as LNK files\nthat also deliver Gh0st RAT.\n\n\n-----\n\nInterestingly, PT Security researchers found that two of the classes in Higaisa APT's\nmalware code were named “SK_Parasite” and “NIS_K”. The researchers speculate that\nthese could reference the South Korean film Parasite and the National Intelligence Service\n(NIS) of the Republic of Korea. Alone, these are insufficient to draw firm conclusions;\n[however, they can be seen as circumstantial evidence of a connection with South Korea.[1,](https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/covid-19-and-new-year-greetings-the-higaisa-group/?sphrase_id=75104)\n[2,](https://www.zscaler.com/blogs/research/return-higaisa-apt) [3]](https://blog.malwarebytes.com/threat-analysis/2020/06/higaisa/)\n\n**CONCLUSION:**\n\nLittle is known about South Korea’s cyber capabilities and nothing has been confirmed.\nHowever, DarkHotel has been linked to both Higaisa and StarCruft, all of them have some\nconnection to South Korea in one way or another. All share similar targets, strategies, and\ncampaigns have led security researchers to conclude that the three groups either work\nalongside one another or are the same group using new tactics.\n\nDarkHotel is one of the most dangerous and active APT actors on the current threat\nlandscape. There is currently not enough evidence to confidently say DarkHotel belongs to\nthe NIS of the ROK, as APT actors often purposely scatter false flags in their code to lead\nresearchers down a rabbit hole.\n\n\n-----\n\nNonetheless, DarkHotel s ability to consistently find 0day vulnerabilities and develop exploits\nfor them is a major security concern for governments and businesses worldwide. All\norganisations, specifically those with business or diplomatic relationships with South Korea\nmust remain cautious of this sophisticated APT, along with the well-established APTs from\nNorth Korea such as Lazarus, Kimsuky, Konni, and Reaper.\n\nKaspersky video on Dark Hotel (2014)\n\nWatch Video At:\n\nhttps://youtu.be/HQpGzivvtqg\n\nIOCs: [https://otx.alienvault.com/browse/pulses?q=DarkHotel](https://otx.alienvault.com/browse/pulses?q=DarkHotel)\n\nSources:\n\n[https://malpedia.caad.fkie.fraunhofer.de/actor/darkhotel](https://malpedia.caad.fkie.fraunhofer.de/actor/darkhotel)\n\n[https://securelist.com/the-darkhotel-apt/66779/](https://securelist.com/the-darkhotel-apt/66779/)\n\n[https://securelist.com/the-zero-day-exploits-of-operation-wizardopium/97086/](https://securelist.com/the-zero-day-exploits-of-operation-wizardopium/97086/)\n\n[https://s.tencent.com/research/report/1000.html](https://s.tencent.com/research/report/1000.html)\n\n[https://s.tencent.com/research/report/741.html](https://s.tencent.com/research/report/741.html)\n\n\n-----\n\n[https://twitter.com/RedDrip7/status/1247737928953946112](https://twitter.com/RedDrip7/status/1247737928953946112)\n\n[https://twitter.com/RedDrip7/status/1222887262234394624](https://twitter.com/RedDrip7/status/1222887262234394624)\n\nhttps://www.securityweek.com/darkhotel-apt-uses-hacking-team-exploit-target-specificsystems\n\n[https://www.securityweek.com/darkhotel-apt-uses-new-methods-target-politicians](https://www.securityweek.com/darkhotel-apt-uses-new-methods-target-politicians)\n\nhttps://www.microsoft.com/security/blog/2016/06/09/reverse-engineering-dubnium-2/3/?\nsource=mmpc\n\nhttps://teamt5.org/newsroom/2020/05/27/teamt5-and-macnica-networks-release-joint-projecton-2019-s-apt-attacks-in-japan.html\n\nhttps://www.welivesecurity.com/2020/05/13/ramsay-cyberespionage-toolkit-airgappednetworks/\n\n[http://blogs.360.cn/post/APT_Darkhotel_attacks_during_coronavirus_pandemic.html](http://blogs.360.cn/post/APT_Darkhotel_attacks_during_coronavirus_pandemic.html)\n\nhttps://www.virustotal.com/gui/file/be8fdfce55ea701e19ab5dd90ce4104ff11ee3b4890b292c4\n6567d9670b63b82/detection\n\nhttps://www.reuters.com/article/us-health-coronavirus-who-hack-exclusive/exclusive-elitehackers-target-who-as-coronavirus-cyberattacks-spike-idUSKBN21A3BN\n\nhttps://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/covid-19-and-new-yeargreetings-the-higaisa-group/\n\n[https://blog.malwarebytes.com/threat-analysis/2020/06/higaisa/](https://blog.malwarebytes.com/threat-analysis/2020/06/higaisa/)\n\n[https://www.zscaler.com/blogs/research/return-higaisa-apt](https://blog.malwarebytes.com/threat-analysis/2020/06/higaisa/)\n\nhttps://www.anomali.com/blog/covid-19-themes-are-being-utilized-by-threat-actors-ofvarying-sophistication\n\n## Lessons from the Conti Leaks\n\n How Do You Run A Cybercrime Gang?\n\n Ransomware Decryption Intelligence\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-14 - Deep-dive- The DarkHotel APT.pdf"
    ],
    "report_names": [
        "2020-06-14 - Deep-dive- The DarkHotel APT.pdf"
    ],
    "threat_actors": [
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2008a79d-2f3a-475f-abef-3bc119a1bf38",
            "created_at": "2022-10-25T16:07:24.028651Z",
            "updated_at": "2025-03-27T02:02:10.084983Z",
            "deleted_at": null,
            "main_name": "Operation WizardOpium",
            "aliases": [],
            "source_name": "ETDA:Operation WizardOpium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cd3fcb0-eb56-49ac-8125-47ebee93311d",
            "created_at": "2023-01-06T13:46:39.065814Z",
            "updated_at": "2025-03-27T02:00:02.988828Z",
            "deleted_at": null,
            "main_name": "Operation WizardOpium",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation WizardOpium",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "873919c0-bc6a-4c19-b18d-c107e4aa3d20",
            "created_at": "2023-01-06T13:46:39.138138Z",
            "updated_at": "2025-03-27T02:00:03.005534Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [],
            "source_name": "MISPGALAXY:Higaisa",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b43c8747-c898-448a-88a9-76bff88e91b5",
            "created_at": "2024-02-02T02:00:04.058535Z",
            "updated_at": "2025-03-27T02:00:03.302832Z",
            "deleted_at": null,
            "main_name": "Opal Sleet",
            "aliases": [
                "OSMIUM",
                "Konni",
                "Vedalia"
            ],
            "source_name": "MISPGALAXY:Opal Sleet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b13c19d6-247d-47ba-86ba-15a94accc179",
            "created_at": "2024-05-01T02:03:08.149923Z",
            "updated_at": "2025-03-27T02:05:17.422065Z",
            "deleted_at": null,
            "main_name": "TUNGSTEN BRIDGE",
            "aliases": [
                "DUBNIUM ",
                "DarkHotel ",
                "CTG-1948 "
            ],
            "source_name": "Secureworks:TUNGSTEN BRIDGE",
            "tools": [
                "Nemim"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b9458777-d970-4e89-b2d2-e532140a390f",
            "created_at": "2024-05-01T02:03:08.140328Z",
            "updated_at": "2025-03-27T02:05:17.41728Z",
            "deleted_at": null,
            "main_name": "NICKEL JUNIPER",
            "aliases": [
                "OSMIUM ",
                "Opal Sleet ",
                "Konni"
            ],
            "source_name": "Secureworks:NICKEL JUNIPER",
            "tools": [
                "KONNI"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "30c9c492-afc6-4aa1-8fe6-cecffed946e0",
            "created_at": "2022-10-25T15:50:23.400822Z",
            "updated_at": "2025-03-27T02:00:55.461334Z",
            "deleted_at": null,
            "main_name": "Higaisa",
            "aliases": [
                "Higaisa"
            ],
            "source_name": "MITRE:Higaisa",
            "tools": [
                "PlugX",
                "certutil",
                "gh0st RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535623,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1653689203,
    "ts_modification_date": 1653689203,
    "files": {
        "pdf": "https://archive.orkl.eu/3401282d3885a4fafaaf467584f09a5f9a4a70e5.pdf",
        "text": "https://archive.orkl.eu/3401282d3885a4fafaaf467584f09a5f9a4a70e5.txt",
        "img": "https://archive.orkl.eu/3401282d3885a4fafaaf467584f09a5f9a4a70e5.jpg"
    }
}