{
    "id": "33c8dc4a-75ac-49c1-acad-195534da88f2",
    "created_at": "2023-01-12T15:06:52.778912Z",
    "updated_at": "2025-03-27T02:17:23.538573Z",
    "deleted_at": null,
    "sha1_hash": "806a5febfba46889f001fde27fda4e5949050e7c",
    "title": "2020-01-31 - Rich Headers- leveraging this mysterious artifact of the PE format",
    "authors": "",
    "file_creation_date": "2022-05-28T17:43:01Z",
    "file_modification_date": "2022-05-28T17:43:01Z",
    "file_size": 745571,
    "plain_text": "# VB2019 paper: Rich Headers: leveraging this mysterious artifact of the PE format\n\n**[virusbulletin.com/virusbulletin/2020/01/vb2019-paper-rich-headers-leveraging-mysterious-artifact-pe-format/](https://www.virusbulletin.com/virusbulletin/2020/01/vb2019-paper-rich-headers-leveraging-mysterious-artifact-pe-format/)**\n\n### Michal Poslušný & Peter Kálnai\n\n_ESET, Czech Republic_\n\nTable of contents\n\nAbstract\n\nIntroduction\n\nThe structure\n\nXOR key (checksum)\n\nBehaviour\n\nStatistics\n\nUse cases\n\nLevels of similarity\n\nIdentical Rich Headers\n\nIdentical XOR keys\n\nIdentical ProdIDs + builds (unsorted)\n\nIdentical ProdIDs + builds (sorted)\n\nSpecific values query/conjunction of various ProdIDs\n\nAnomalies\n\nInvalid Rich Header values\n\nDuplicate Rich Header values\n\nInvalid XOR key checksum\n\nRich Header offset\n\nPE Optional Header linker information mismatch\n\nImports\nResources\n\nAPT malware\n\nWin32/Industroyer & Win32/Exaramel\n\nWin{32,64}/NukeSped\n\nCrimeware\nWin32/Kasidet\n\nWin{32,64}/Dridex\n\nWin{32,64}/Dridex v1, v2 & v3 (2014 – 2015)\n\nWin{32,64}/Dridex v3 (2016)\n\nWin{32,64}/Dridex v4 (2017 – 2018)\n\nWin{32,64}/Dridex v5(v2) (2018 – 2019)\n\nWin{32,64}/Sathurbot\n\nMalware packers\n\nRich Headers & YARA\n\nConclusion\n\nReferences\n\n## Abstract\n\n\n-----\n\nEver since the release of Visual Studio 97 SP3, Microsoft has placed an undocumented chunk of data between the\nDOS and PE headers of every native Portable Executable (PE) binary produced by its linker without any possibility\nto opt out. The data contains information about the build environment and the scale of the project, stored in a simple\nyet effective way using blocks of the following values: a product identifier, its build number, and the number of times\nit was used during the build process. Several research papers on this topic have been released over the years,\ncoming up with the name ‘Rich Header’ and shedding some light on its purpose and structure, but we feel that it has\nnever been used to its full potential by the security industry.\n\nWhen an analyst encounters a rare custom malware sample involved in, say, an APT, and is clutching at straws to\ndraw conclusions about the case, this mysterious structure could provide some reasonable clues. Not only does it\nreveal the type of components involved in the project behind the malware and the build tools used, but, forming an\nabounding set of variations, it also helps with locating similar samples. We introduce a hierarchy of similarity levels,\ntogether with real-world examples where they have successfully been applied.\n\nFor various crimeware kits, which are (re)distributed on a daily basis, the header could indicate whether their source\ncode is available more widely or under the control of a single actor. Moreover, the headers from their encapsulating\nmalware packers often manifest their own anomalies and could cluster a larger set of samples of the same nature.\nThese inconsistencies could easily be identified and turned into heuristics based on the situation, such as: an\nunusual offset or the size of the header, an invalid identifier or its combination with the build version, the image size\nnot corresponding to the magnitude of the project, etc.\n\nWe will also showcase our in-house designed database infrastructure and the tooling we’ve built around it: similarity\nlookup, a rule-based notification system for malware hunting and the detection of anomalies. The database currently\nholds the Rich Header information for tens of millions of executables and continuously processes a live feed of new,\nincoming files. It is currently growing by ~180,000 unique records per day.\n\n## Introduction\n\nPE ‘Rich Headers’ were introduced with the release of Visual Studio 97 SP3. Microsoft didn’t announce that it had\nimplemented such a feature or give a reason for its introduction, and never released any kind of documentation for it,\nso we cannot really be sure about its original purpose, but it seems that Microsoft simply wanted to have some sort\nof development environment fingerprint stored in the executables, or perhaps to help with diagnostics and\ndebugging. Regardless of the original intent, the Rich Header has proved to be a very valuable block of data for\nmalware researchers, where a few hundred bytes, when interpreted correctly, can be used as a very strong factor for\nattribution and detection.\n\nFigure 1: PE binary with Rich Headers highlighted.\n\n### The structure\n\n\n-----\n\nThe meaning of the header is actually quite straightforward. In Figure 2 we can see the structure of the header, as\ndescribed by Microsoft in the Windows 2000 source code leak [1]. The data is inserted after the\nIMAGE_DOS_HEADER and its stub and before the beginning of the PE header (IMAGE_NT_HEADERS structure).\n\nIts end is marked by the Rich keyword (0x68636952) followed by an XOR key DWORD, which was used to encrypt\nthe rest of the header. The beginning of the plaintext header is marked by the DanS keyword (0x536E6144),\nfollowed by padding of three null DWORDs.\n\nFigure 2: Rich Headers\n\ndefinition in Microsoft Windows 2000 source code leak.\n\nAs we can see in Figure 2, the data is an array of simple 64-bit PRODITEM structures that consist of two 32-bit\nfields: dwProdid and dwCount. The dwProdid field is a combination of a product identifier (ProdID) and its\ncorresponding Build number and can be considered as two separate 16-bit values.\n\nProdID represents a product from the Visual Studio development toolchain – these include objects like linkers,\nC/C++ compilers, MASM, resources, imports, implibs, etc. One is assigned to every object file upon creation and\neventually all ProdIDs from every object file used in a project are collected and written into the resulting binary, by\nthe linker, during the linking process.\n\nSince ProdIDs are an enumeration of numerical values, it is quite hard to identify their meaning on their own. Luckily,\nwe can find the values and their corresponding names in the Visual Studio installation directory in one of the\nmsobj.lib binaries. For example, Figure 3 shows the msobj140-msvcrt.lib file, which can be found in Visual Studio\n_2015 – 2019, and which contains a list of all ProdID values followed by their names._\n\n\n-----\n\nFigure 3: ProdID names as\n\nfound in the msobj.lib binary.\n\nThe easiest way to find the Rich Header is to look for the Rich DWORD between the DOS and PE header (which\nmarks the end of the Rich Header), extract the following XOR key DWORD and go backwards, XORing the data\nuntil the decrypted DanS DWORD is reached.\n\nFigure 4: The\n\nunencrypted Rich Headers structure.\n\n### XOR key (checksum)\n\nThe XOR key used for encryption of the Rich Header is a unique four-byte value generated for every executable\nbuilt by a Microsoft compiler (linker). The value is a checksum of the DOS header, the DOS stub and plaintext Rich\nHeader data. The checksum calculation algorithm can be found in the IMAGE::CbBuildProdidBlock function in Visual\n_Studio’s link.exe binary. A code snippet is shown in Figure 5._\n\n\n-----\n\nFigure 5: XOR key generation in\n\nMicrosoft’s Visual Studio 2019 linker executable.\n\nSince the checksum algorithm consists of a simple addition and 32-bit rotate left, it can produce collisions. We have\nidentified a few cases where the collision happens for one of two specific reasons.\n\nThe first case is when two projects contain identical PRODITEM entries, but in a different order. This is not\nnecessarily unwanted behaviour and might even be intended by its designer. Both samples in Table 1 have the XOR\nkey 0xAEB29219 [2].\n\nkb.dll (2010-12-6 13:36:13) phpF746.exe (2017-11-19 7:7:58)\n\nprodidMasm614  | b8444 | 1 prodidLinker512 | b8078 | 9\nprodidLinker512 | b8078 | 9 prodidMasm614  | b8444 | 1\n\nTable 1: XOR key collision example – order of PRODITEMs.\n\nAnother common case is due to the 32-bit rotation used in the algorithm (ProdID + build is rotated by its count). If\ntwo projects have identical ProdID and build but different counts whose delta is a multiple of 32, the resulting\nchecksum will be identical. Table 2 is another example of two samples that also have the XOR key 0xAEB29219.\n\nmoar.exe (2017-5-9 10:24:58) phpF746.exe (2017-11-19 7:7:58)\n\nprodidLinker512 | b8078 | 41 prodidLinker512 | b8078 | 9\nprodidMasm614  | b8444 | 1 prodidMasm614  | b8444 | 1\n\nTable 2: XOR key collision example – counts delta.\n\n### Behaviour\n\nRich Headers reflect the nature and scale of the project and simply by looking at the ProdID names, we can see the\nvarious features used in the project like imports, resources, or whether the project was written in Assembly, C, C++\nor (pre .NET) Visual Basic, and approximately how large the project is, based on the product counts.\n\nRich Headers tend to change over time in an actively developed project – new ProdIDs may appear and their counts\noften increase as new source files and other resources are added to the project, and with regular updates to Visual\n_Studio the build numbers can change too. When changing a development environment completely (e.g. upgrading_\nfrom VS2010 to VS2015) ProdIDs will also change for the equivalent in the new version.\n\n### Statistics\n\n|kb.dll (2010-12-6 13:36:13)|phpF746.exe (2017-11-19 7:7:58)|\n|---|---|\n|prodidMasm614 | b8444 | 1 prodidLinker512 | b8078 | 9|prodidLinker512 | b8078 | 9 prodidMasm614 | b8444 | 1|\n\n|moar.exe (2017-5-9 10:24:58)|phpF746.exe (2017-11-19 7:7:58)|\n|---|---|\n|prodidLinker512 | b8078 | 41 prodidMasm614 | b8444 | 1|prodidLinker512 | b8078 | 9 prodidMasm614 | b8444 | 1|\n\n\n-----\n\nThe most important question when talking about how useful Rich Headers may be is How often do they actually\nappear in executables?’ If Rich Headers appeared only in a small portion of files, they would not be a very useful\nfeature. Luckily, this is not the case: when looking at our large malicious dataset consisting of roughly one million\nunique malicious Win32 and Win64 native binaries (no .NET), we found that 73.20% of the PEs contain a Rich\nHeader.\n\nOf the 26.80% of files that do not contain a Rich Header, many are produced by other compilers (Turbo C++, MinGW\nGCC, Clang, etc.), or are developed in a completely different environment such as Delphi or Go. When such files are\ndiscarded, the percentage of PEs containing Rich Headers rises to 83.30%. At this point, the absence of a Rich\nHeader is caused by explicit removal by malware authors or custom packers, etc. For our clean dataset of 120,000\nsamples, the representation goes as high as 94.20% and 98.50% when taking out other compilers.\n\nFigure 6: Representation of\n\nRich Headers in our malicious dataset.\n\nWe expect this number to decrease slowly over time, as malware authors become more aware of this feature and\nwill try to obfuscate or remove the header completely. A more rapid shift would happen if Microsoft decided to drop\nthis feature completely in some subsequent version of Visual Studio, but as of the recent release of Visual Studio\n_2019, Rich Headers are still generated by the linker._\n\n## Use cases\n\n### Levels of similarity\n\n**Identical Rich Headers**\n\nThis is the strongest link between two files in terms of Rich Header similarity. Considering how often the Rich\nHeaders may change in an actively developed project, it is not the best method of long-term detection of future\nsamples from a given project (a good analogy is hash-based detection of malicious files). That being said, it can still\nbe very handy in various cases.\n\nThe most common case is the simple matching of the Rich Headers of an unknown file to those of some known\nmalware to quickly identify if the file is malicious (rather like looking up a hash on VirusTotal). Rich Headers can\nremain unchanged for weeks or even months in the development cycle of a specific project, so a complete match\nwith older or even newer versions of the project can still happen if the sample set is good enough.\n\nAnother useful case is possible thanks to the fact that commercial protectors like Enigma Protector, Themida and\n_VMProtect preserve the Rich Headers of the original file. This means that when we get our hands on, say, a_\n_Themida-protected file, we could potentially look up the original, non-packed payload by searching for identical Rich_\nHeaders and vice versa. This is especially valuable considering that most of these protectors change the nature of\n\n\n-----\n\nthe file completely and there are no links preserved between the code or data of the original payload. Malware\nauthors sometimes use multiple commercial packers to pack their payloads – we were able to identify the protected\nsamples of a family called Predator Stealer [3] (Win32/Spy.Agent.{PQC,PQK}) and to attribute several custom\nLazarus tools in [4] (Win64.NukeSped.{AA,AB}).\n\nA similar strategy can also be applied to less advanced malware packers that also tend either to preserve the\noriginal Rich Header of the payload or to supplement the resulting packed file with their own.\n\nSometimes the Rich Header might intentionally be misplaced – there is a well-known case reported by Kaspersky [5]\n(and also presented at Virus Bulletin [6]), where a component of Olympic Destroyer contained a copy of the\ncomplete Rich Headers from a file previously attributed to the Lazarus toolset. This is widely considered to have\nbeen a false flag implemented by the attackers to place the blame on a different actor. On the other hand, it might\nvery well have been an Easter egg, testing the attention of malware researchers. In the past there have also been\ncases of malware packers that copied the header from a legitimate explorer.exe.\n\nFor a quick matching, it is best to calculate and store a hash of the Rich Header. In our project we use an indexed\nCRC64 for a blazingly fast lookup.\n\n**Identical XOR keys**\n\nMatching XOR keys have very similar use cases to matching Rich Headers. The advantage of using the XOR key\ninstead of a custom hash is in it being more widely used and being supported by widespread community tools like\nYARA, and integrated into VirusTotal hunting rules. The disadvantages lie in the fact that the value might\nartificially/explicitly be changed and in the potential key collisions that we explained in the previous section.\n\nKnowing that the XOR keys are basically a checksum of the DOS header, DOS stub and Rich Header, we can\nquickly establish that, as a malware project evolves, the key value may change fairly often (with even a single\nincremental change in the Rich Header count), so it is not a very useful feature when trying to track a project over a\nlonger period of time.\n\nOn the other hand, as stated above, a malware packer is a specific project and, in many cases, shares an identical\nRich Header across many packed samples. We have found several values that covered reasonable clusters, e.g.\n0x8F44CEBF, 0xAEB29219, 0x8A17753B, 0xD4F1AE19, 0x887F83A7 (with the CRC64 hash varying within each\nkey!).\n\nThere are several XOR keys associated with well-known formats, as listed in Table 3. They can be found in clean as\nwell as malicious datasets and might be useful for a quick identification of the format.\n\n|Visual Basic 6.0|0x886973F3, 0x8869808D, 0x88AA42CF, 0x88AA2A9D, 0x89A99A19, 0x88CECC0B, 0x8897EBCB, 0xAC72CCFA, 0x1AAAA993, 0xD05FECFB, 0x183A2CFD, 0xACCF9994, 0xC757AD0B, 0xA7EEAD02, 0xD1197995, 0x83CDAD4, 0x8917A389, 0x88CEA841, 0x8917DE83, 0x89AA0373, 0x8ACD8739, 0x8D156179, 0x8ACE4D53, 0x8897FE31, 0x91A515F9, 0xD1983193, 0x8D16E113, 0x9AC47EF9, 0x91A80893, 0xAD0350F9, 0xD180F4F9, 0xAD0EF593, 0x9ACA5793, 0x9ACA5793|\n|---|---|\n|NSIS|0xD28650E9, 0x38BF1A05, 0x6A2AD175, 0xD246D0E9, 0x371742A2, 0xAB930178, 0x69EAD975, 0x69EB1175, 0xFB2414A1, 0xFB240DA1|\n|MASM 6.14 build 8444|0x88737619, 0x89A56EF9|\n|WinRar SFX|0xC47CACAA, 0xFDAFBB1F, 0xD3254748, 0x557B8C97, 0x8DEFA739, 0x723F06DE, 0x16614BC7|\n|Autoit|0xBEAFE369, 0xC1FC1252, 0xCDA605B9, 0xA9CBC717, 0x8FEDAD28, 0x273B0B7D, 0xECFA7F86|\n\n\n-----\n\n|Microsoft Cabinet File|0x43FACBB6|\n|---|---|\n|NTkernelPacker|0x377824C3|\n|Thinstall|0x8B6DF331|\n|MoleBox Ultra v4|0x8CABE24D|\n\n\nTable 3: Various XOR keys associated with known formats.\n\n**Identical ProdIDs + builds (unsorted)**\n\nDisregarding the counts and matching only the files with identical ProdIDs and build numbers also turned out to be a\nvery effective way of looking up similar files. The bigger the project, the more effective this method is, and it should\nbe considered for samples with at least five Rich Header records.\n\nIn the case of the KillDisk-ed casino in Central America [7] we found a 64-bit executable with the internal name\nres.dll. Another file was later acquired, with all metadata pointing to the same threat actor. Despite being Themidaprotected and statically completely different (except for the agreement of PE timestamps), the set of ProdIDs\ntogether with builds were identical and did not match any clean files – see Table 4 (both detected as\nWin64/NukeSped.Z). This inspired us to index the sequence of pairs (ProdID, build) as they are located in the\nheader, omitting the counts. The CRC64 checksum of unsorted sequences of these pairs reliably identified several\nclusters of related malicious projects: not only when the single count of prodidImports0 varied (Win64/CoinMiner.DN,\n0x105E60A5B349F444), but also when multiple counts did (Win32/Pterodo, 0x745E73E5045EE80E or\nWin32/Kryptik.GTXI, 0x613D0D87DAF1658F).\n\nrds.dll (2016-10-24 8:32:11) res.dll (2016-10-24 8:32:11)\n\nprodidUtc1600_LTCG_CPP| b40219 | 9 prodidUtc1600_LTCG_CPP| b40219 | 9\n\nprodidUtc1600_CPP   | b40219 | 27 prodidUtc1600_CPP   | b40219 | 27\n\nprodidUtc1600_C    | b40219 | 100 prodidUtc1600_C    | b40219 | 94\n\nprodidMasm1000    | b40219 | 15 prodidMasm1000    | b40219 | 9\n\nprodidLinker1000   | b40219 | 1 prodidLinker1000   | b40219 | 1\n\nprodidExport1000   | b40219 | 1 prodidExport1000   | b40219 | 1\n\nprodidImplib900    | b30729 | 9 prodidImplib900    | b30729 | 9\nprodidImport0     | b0   | 130 prodidImport0     | b0   | 131\n\nTable 4: Similar metadata from two Themida-protected 64-bit Lazarus backdoors.\n\n**Identical ProdIDs + builds (sorted)**\n\nThe situation gets more complicated when searching for files from the same project that have different architectures.\nRich Headers tend to be almost identical between 32-bit and 64-bit equivalents of an application, but sometimes the\nProdIDs are in a slightly different order. This led us to a new similarity level, namely the CRC64 checksum of the\nsequence of ProdIDs and their builds sorted by the ProdID values to compare the Rich Header regardless of the\norder. Again, the counts were omitted.\n\nThis turned out to be useful in many cases, for example when we encountered several almost identical samples of\nWin/GreyEnergy [8], each for a different architecture, having the same ProdIDs, but in a slightly different order.\n\n|rds.dll (2016-10-24 8:32:11)|res.dll (2016-10-24 8:32:11)|\n|---|---|\n|prodidUtc1600_LTCG_CPP| b40219 | 9 prodidUtc1600_CPP | b40219 | 27 prodidUtc1600_C | b40219 | 100 prodidMasm1000 | b40219 | 15 prodidLinker1000 | b40219 | 1 prodidExport1000 | b40219 | 1 prodidImplib900 | b30729 | 9 prodidImport0 | b0 | 130|prodidUtc1600_LTCG_CPP| b40219 | 9 prodidUtc1600_CPP | b40219 | 27 prodidUtc1600_C | b40219 | 94 prodidMasm1000 | b40219 | 9 prodidLinker1000 | b40219 | 1 prodidExport1000 | b40219 | 1 prodidImplib900 | b30729 | 9 prodidImport0 | b0 | 131|\n\n|zlib_x86.dll, zlibwapi_x86.dll|zlib_x64.dll, zlibwapi_x64.dll|\n|---|---|\n\n\n-----\n\nprodidAliasObj1000  | b20115 | 5\n\nprodidUtc1600_CPP   | b40219 | 25\n\nprodidMasm1000    | b40219 | 17\n\nprodidUtc1600_C    | b40219 | 110\n\nprodidImplib900    | b30729 | 3\n\nprodidImport0     | b0   |[87-88]\n\nprodidUtc1600_LTCG_CPP| b40219 | 22\n\nprodidExport1000   | b40219 | 1\n\nprodidLinker1000   | b40219 | 1\n\n\nprodidAliasObj1000   | b20115 | 5\n\nprodidUtc1600_CPP   | b40219 | 25\n\nprodidUtc1600_C    | b40219 | 107\n\nprodidMasm1000     | b40219 | 9\n\nProdidImplib900    | b30729 | 3\n\nprodidImport0     | b0   | [88-89]\n\nprodidUtc1600_LTCG_CPP | b40219 | [22-23]\n\nprodidExport1000    | b40219 | 1\n\nprodidLinker1000    | b40219 | 1\n\n\nTable 5: Similar metadata from Win32/GreyEnergy payloads for both platforms.\n\n**Specific values query/conjunction of various ProdIDs**\n\nWhile matching identical Rich Headers is nice and can be useful in many cases, for a more robust lookup we need\nsome variability. This can be achieved by searching for combinations of specific ProdIDs combined with builds and a\nrange of counts based on a value from the underlying sample. If such a query is constructed in a smart way, it can\neasily yield many older and/or newer samples from the same project with slightly different Rich Headers as\ndevelopment progressed. For example, given a file that contains prodidUtc1600_CPP build 40219 with a count of\n48, we might search for all files with prodidUtc1600_CPP build 40219 and a count between 42 and 54. So far we\nhave not found a generic approach for how best to construct these queries and instead use our ‘instincts’ that we\nhave acquired over time while working with Rich Headers.\n\nFor example, there were cases of a two-stage threat when the dropper and the payload were projects of very similar\nsize, e.g. Win32/Exaramel [9]. Both files were 32-bit, so the order of ProdIDs was identical and counts very similar,\nwith the exception of one additional ProdID in the payload, as seen in Table 6.\n\nxml.exe (2018-4-13 08:36:04) wsmprovav.exe (2018-4-13 08:35:52)\n\nprodidUtc1900_CPP | b24215 | 3 prodidUtc1900_CPP | b24215 | 1\n\nprodidUtc1900_CPP | b24123 | 33 prodidUtc1900_CPP | b24123 | 29\n\nprodidUtc1900_C  | b24215 | 7 prodidUtc1900_C  | b24215 | 11\n\nprodidUtc1900_C  | b24123 | 17 prodidUtc1900_C  | b24123 | 17\n\nprodidMasm1400  | b24123 | 18 prodidMasm1400  | b24123 | 17\n\nprodidLinker1400 | b24215 | 1 prodidLinker1400 | b24215 | 1\n\nprodidCvtres1400 | b24210 | 1 prodidCvtres1400 | b24210 | 1\n\nprodidUtc1810_CPP | b40116 | 121 prodidUtc1810_CPP | b40116 | 120\n\nprodidUtc1810_C  | b40116 | 24 prodidUtc1810_C  | b40116 | 24\n\nprodidMasm1210  | b40116 | 9 prodidMasm1210  | b40116 | 9\n\nprodidResource  | b0   | 1 prodidResource  | b0   | 1\n\nprodidImplib900  | b30729 | 9 prodidImplib900  | b30729 | 25\n\nprodidImport0   | b0   | 109 prodidUtc1500_C  | b30729 | 4\n\nprodidImport0   | b0   |200\n\nTable 6: Similar metadata for the dropper and the payload of Win32/Exaramel.\n\nOne should always try to keep the number of items in the query to a bare minimum to distinguish different projects,\nbut at the same time leave some space for potential changes. Generally, ProdIDs containing ‘_CPP’ or ‘_C’ should\nbe prioritized in the search as they tend to have the biggest count variability and the count distance could be around\n+/- 10%.\n\n|xml.exe (2018-4-13 08:36:04)|wsmprovav.exe (2018-4-13 08:35:52)|\n|---|---|\n|prodidUtc1900_CPP | b24215 | 3 prodidUtc1900_CPP | b24123 | 3 3 prodidUtc1900_C | b24215 | 7 prodidUtc1900_C | b24123 | 17 prodidMasm1400 | b24123 | 18 prodidLinker1400 | b24215 | 1 prodidCvtres1400 | b24210 | 1 prodidUtc1810_CPP | b40116 | 121 prodidUtc1810_C | b40116 | 24 prodidMasm1210 | b40116 | 9 prodidResource | b0 | 1 prodidImplib900 | b30729 | 9 prodidImport0 | b0 | 109|prodidUtc1900_CPP | b24215 | 1 prodidUtc1900_CPP | b24123 | 29 prodidUtc1900_C | b24215 | 11 prodidUtc1900_C | b24123 | 17 prodidMasm1400 | b24123 | 17 prodidLinker1400 | b24215 | 1 prodidCvtres1400 | b24210 | 1 prodidUtc1810_CPP | b40116 | 1 20 prodidUtc1810_C | b40116 | 24 prodidMasm1210 | b40116 | 9 prodidResource | b0 | 1 prodidImplib900 | b30729 | 2 5 prodidUtc1500_C | b30729 | 4 prodidImport0 | b0 |200|\n\n\n-----\n\n### Anomalies\n\nBasing detection on Rich Header similarity or adding it as a feature to existing detection systems is a great thing.\nAnother potential use case is heuristic detection based on anomalies and inconsistencies that suggest the file has\nbeen tampered with, or that there is something wrong with it, and that should generally be brought to the attention of\na researcher. Such an anomaly obviously does not instantly mean a given file is malicious, but it might be useful to\nflag files worthy of closer examination by an analyst. Anomalies are especially common in relation to various packers\nand other obfuscation strategies commonly found in malware, as they are usually the result of tampering with the\noriginal file.\n\nIn the following subsections we look at the most common anomalies we have observed in the wild.\n\n**Invalid Rich Header values**\n\nThis is the most obvious anomaly – since the range of valid ProdIDs is known, we can easily identify files that have\nnon-existent values (at the moment, with the release of Visual Studio 2019, all values larger than 0x010e\n(prodidUtc1900_POGO_O_CPP) can be considered invalid). This could be applied to the build number as well, as\neach ProdID has only a specific range of valid build numbers, although this would require quite a lot of work due to\nhaving to gather all possible build numbers for each ProdID. Finally, we could also check for suspicious count\nvalues, as for valid projects they are generally in the tens or hundreds and very rarely in the thousands, so finding a\nvalid ProdID with a count greater than a million could be an indicator too.\n\n**Duplicate Rich Header values**\n\nEvery file with a Rich Header can only have a single, unique combination of ProdID and a build number. This is\nobvious, as the number of those records is represented by the count field instead, so duplicate records are invalid\nbehaviour. Around 1.19% of files in our malicious dataset contain duplicate records. There is not a single one in the\nclean dataset.\n\n**Invalid XOR key checksum**\n\nSince we know how the checksum is calculated, the supplied XOR key can easily be verified. If the value is\nincorrect, we can assume that there is potentially something wrong. In our malicious dataset 9.06% files have an\ninvalid XOR key value, while in the clean dataset only around 0.95% do.\n\n**Rich Header offset**\n\nThe Rich Header offset is the position in the PE at which the header begins. It is based on the size of the DOS stub,\nas it begins right after that, so its value varies with the DOS stub. Since most files nowadays do not use the DOS\npart of the PE at all, they have the widely known default ‘This program cannot be run in DOS mode’ stub generated\nby the compiler, and thanks to that, in most files the Rich Header starts at file offset 0x80. While the mentioned\nstarting position is present in ~99% of cases, there are many, even valid, cases where the offset differs, so it is not a\ngood idea to look for Rich Headers based on this offset (like YARA does [10]). Out of 120,000 real-world clean\napplications with Rich Headers in our clean dataset, only 0.06% do not match the offset 0x80. The distribution for\nour malicious dataset can be seen in Figure 7.\n\n\n-----\n\nFigure\n\n7: Distribution of Rich Header offsets in our malicious dataset.\n\nThere are a few relatively common offsets that can be found even in clean, legitimate projects like some kernel\ndrivers (probably caused by an alignment issue, because even the default stub is aligned to 512 bytes). On the other\nhand, there are also several offsets that are used by a specific malware family or software project (those we have\nidentified are listed in Table 7), which could be one of the ways to identify new samples or at least used as an\nindicator.\n\n**Offset** **Example** **Comment**\n\n0x40 Various The null DOS stub\n\n0x48 Various The minimal valid DOS stub\n\n0x60 Win32/Adware.WintionalityChecker\n\n0x68 Win32/TrojanDownloader.Waski\n\n0x8C Win32/Adware.Virtumonde\n\n0xE0 Win32/TrojanDropper.Agent.NJV\n\n0x100 ESET modules Clean\n\n0x200 Various Some kernel drivers\n\n0x2A8 PKSFX Self Extract Utility by PKWARE Inc. Clean\n\n0x600 Win32/Adware.Trymedia\n\nTable 7: Various types of Rich Header offsets.\n\n**PE Optional Header linker information mismatch**\n\nThe version of a linker used for building the file is also stored in the MajorLinkerVersion and MinorLinkerVersion\nfields inside the PE Optional Header. Comparing this version to the linker version found in Rich Headers (i.e.\nprodidLinker800 should have Optional Header linker version set to 8.0) is also a good way to find inconsistencies,\npacked files, tampered Rich Headers and so on.\n\n|Offset|Example|Comment|\n|---|---|---|\n|0x40|Various|The null DOS stub|\n|0x48|Various|The minimal valid DOS stub|\n|0x60|Win32/Adware.WintionalityChecker||\n|0x68|Win32/TrojanDownloader.Waski||\n|0x8C|Win32/Adware.Virtumonde||\n|0xE0|Win32/TrojanDropper.Agent.NJV||\n|0x100|ESET modules|Clean|\n|0x200|Various|Some kernel drivers|\n|0x2A8|PKSFX Self Extract Utility by PKWARE Inc.|Clean|\n|0x600|Win32/Adware.Trymedia||\n\n\n-----\n\nThere are a few such anomalies caused by known packers for example, the Armadillo packer changes the\nOptional Header linker version to 83.82, but does not alter the Rich Header.\n\n**Imports**\n\nThe prodidImport0 identifier is related to the number of functions in the PE import directory. The values are not\nalways equal but correlate highly and tend to be very close together. A large difference between the number of\nimports and the count of prodidImport0, or its complete absence in the Rich Header when imports are present, and\nvice versa, could be a sign of a packed file or a faked Rich Header.\n\n**Resources**\n\nWhen an executable contains a resource directory populated with resources, it should always be reflected in the\nRich Header by containing prodidCvtresXXXX, where XXXX is the version of Visual Studio used. The count should\nalways be 1, regardless of the number of resources the file has. For example, when building a project that has any\nkind of resource included in Visual Studio 2015 (14.0), the resulting binary should always contain prodidCvtres1400\n= 1 (in our malicious dataset, 4.12% of files have a prodidCvtresXXXX count other than 1; in our clean dataset this\napplies to only 0.01% of files).\n\nThere are multiple ideas for potential heuristics:\n\n1. Files with prodidCvtresXXXX having a count not equal to 1\n2. Files with resources not containing the Cvtres identifier and vice versa\n3. The version of prodidCvtresXXXX not corresponding with the linker version/other ProdIDs, i.e. the file having\n\nprodidCvtres1400 and prodidLinker1200.\n\n### APT malware\n\nIn this section we provide some examples where Rich Header metadata has provided interesting information and\nextended our overall knowledge about executables from APT toolsets. This is not the first attempt to look at Rich\nHeaders and their usability in APT research [11].\n\n**Win32/Industroyer & Win32/Exaramel**\n\nThe article [9] uncovered strong code similarities between the Win32/Industroyer main backdoor (introduced to the\nworld in [12]) and one of the backdoors (Win32/Exaramel) used by TeleBots, the group behind the massive NotPetya\n(Win32/Diskcoder.C) ransomware outbreak. Taking an additional look at the Rich Headers metadata, it turns out that\nthere is additional similarity at the project development and build level – see Table 8.\n\n\nprodidMasm1210    b40116 =  9\n\nprodidUtc1810_CPP   b40116 = 120\n\nprodidUtc1810_C    b40116 = 24\n\nprodidMasm1400    b24123 = 17\n\nprodidUtc1900_CPP   b24123 = 29\n\nprodidUtc1900_C    b24123 = 17\n\nprodidImplib900    b30729 = [15-25]\n\nprodidImport0     b0   = [140-200]\n\nprodidCvtres1400   b24210 =  1\n\nprodidLinker1400   b24215 =  1\n\n\nTable 8: Rule based on the Rich Header values common to Industroyer and Exaramel.\n\n**Win{32,64}/NukeSped**\n\nThis is ESET’s detection name for samples from the Lazarus toolset. It is well known that the toolset is large,\nheterogeneous from various points of view, and all the sources are kept close. In [4] we tried to group executables\nbased on their Rich Header characteristics and the version of the Microsoft linker used. As a result, two main\nLazarus tool subgroups were identified, namely the first one using VS 98 for 32-bit compilations and VS 2010 for 64\n\n-----\n\nbit, and the second one using VS 2010 for both. However, several anomalous combinations were discovered too,\ne.g. one typical malicious project compiled as a 32-bit binary in VS 98 and as a 64-bit binary in VS 2013. In Table 9\nthere are two examples of queries that successfully identified malicious clusters without causing an uncomfortable\nlevel of noise.\n\n\nprodidUtc1600_C  b40219 = [50-300]\nprodidImports  b0  = [227-228]\nprodidImplib900  b30729 = 23\nprodidAliasObj1000  b20115 = 7\n\n\nprodidUtc1500_C  b30729   = 8\nprodidExport1000  b40219   = 1\nprodidUtc1600_C  b40219   = [142-145]\nprodidUtc1600_CPP  b40219   = [61-62]\n\n\nTable 9: Win{32,64}/NukeSped detection rule.\n\nWin32/CrisisHT\n\nThis is ESET’s detection name for samples from the spyware kit operated and sold by the infamous Italian software\ncompany Hacking Team. In [13] many aspects of the threat are considered, e.g. the clustering of the toolset based\non the attached code-signing certificates. In Table 10 we illustrate clustering based on the Rich Header values. The\n‘SPC’ version looks like a testing concept built by an unrelated team – a consequence of the source code leaks in\nJuly 2015.\n\n|Certificate|PE Timestamp|prodidUtcXXXX_CPP and build values|Import0|1900_CPP b24123|Col6|Col7|Col8|\n|---|---|---|---|---|---|---|---|\n|1600_CPP b40219|1600_CPP b30319|1700_CPP b50929|1800_CPP b21005|1900_CPP b24123||||\n|Raffaele Carnacina|16.9.2015||38||||170|\n|Raffaele Carnacina|19.10.2015||64||||247|\n|Raffaele Carnacina|19.10.2015||38||||169|\n|Raffaele Carnacina|5.11.2015|38|||||168|\n|Raffaele Carnacina|17.11.2015|64|||||247|\n|SPC|5.1.2016||||49||163|\n|Raffaele Carnacina|18.1.2016|38|||||170|\n|Raffaele Carnacina|24.3.2016||64||||247|\n|Raffaele Carnacina|24.3.2016||38||||169|\n|ADD Audit|17.6.2016|||70|||251|\n|ADD Audit|1.9.2016|||70|||250|\n\n\n-----\n\n|ADD Audit|19.12.2016|Col3|Col4|44|Col6|Col7|177|\n|---|---|---|---|---|---|---|---|\n|ADD Audit|28.4.2017|38|||||170|\n|ADD Audit|28.4.2017|64|||||259|\n|Ziber Ltd|28.6.2017|||||57|293|\n|Media Lid|28.6.2017|40|||||184|\n|Ziber Ltd|9.10.2017|40|||||190|\n|Ziber Ltd|18.10.2017|||||57|299|\n\n\nTable 10: CrisisHT samples clustered by C++ compiler version Rich Header data.\n\n### Crimeware\n\n**Win32/Kasidet**\n\nKasidet (a.k.a. Neutrino bot) is a crime kit with many capabilities which is sold on underground forums and is popular\nfor its relatively cheap price. The crime kit is distributed via a special builder containing the compiled stub of Neutrino\nbot. In Table 11 we showcase the evolution of four ProdIDs that represent the projects. Each colour band represents\na unique stub that was distributed by various cybercriminal groups [14].\n\n|Col1|PE Timestamp|prodidUtc1500_C|prodidImplib900|prodidImport0|prodidUtc1600_CPP|\n|---|---|---|---|---|---|\n|MiningRats 04|25.07.2017|1|25|175|44|\n|LethicGuys 08|21.10.2017|1|29|179|46|\n|Redirectors 01|25.10.2017|1|29|179|46|\n|LethicGuys 09|31.10.2017|1|29|179|47|\n|LethicGuys 10|07.11.2017|4|31|185|49|\n|Redirectors 03|07.11.2017|4|31|185|49|\n|LethicGuys 11|16.11.2017|4|31|185|49|\n|Redirectors 04|16.11.2017|4|31|185|49|\n|Redirectors 05|17.11.2017|4|31|185|49|\n|MiningRats 07|05.01.2018|4|31|185|49|\n|MiningRats 08|08.01.2018|4|31|185|49|\n|MiningRats 09|12.01.2018|3|31|196|50|\n|LethicGuys 13|13.01.2018|3|31|196|50|\n|LethicGuys 14|15.01.2018|3|31|196|50|\n|ProxyGuys 01|16.01.2018|3|31|196|50|\n|MiningRats 10|20.01.2018|3|31|196|50|\n|LethicGuys 15|21.01.2018|3|31|196|50|\n\n\n-----\n\n|LethicGuys 16|21.01.2018|3|31|196|50|\n|---|---|---|---|---|---|\n|MiningRats 11|30.01.2018|3|29|193|49|\n|ProxyGuys 02|04.02.2018|3|29|193|49|\n|TinukeFareit 01|09.02.2018|3|29|193|49|\n|LethicGuys 17|16.02.2018|3|29|193|49|\n|LethicGuys 18|22.02.2018|3|29|193|49|\n|LethicGuys 19|25.02.2018|3|29|193|49|\n|LethicGuys 20|26.02.2018|3|29|193|49|\n|Redirectors 06|16.03.2018|3|29|193|49|\n|Redirectors 07|19.03.2018|3|29|193|49|\n|LethicGuys 21|22.03.2018|3|29|193|49|\n|LethicGuys 22|22.03.2018|3|29|193|49|\n|LethicGuys 23|02.04.2018|3|29|194|49|\n|ProxyGuys 03|02.04.2018|3|29|194|49|\n|LethicGuys 24|05.04.2018|3|29|194|49|\n|TinukeFareit 02|08.04.2018|3|29|194|49|\n|TinukeFareit 03|23.04.2018|3|29|194|49|\n|TinukeFareit 04|02.05.2018|3|29|194|49|\n|Arsonists 01|07.05.2018|3|29|194|49|\n|TinukeFareit 05|19.05.2018|3|27|192|49|\n|Arsonists 021|21.05.2018|3|27|192|49|\n|TinukeFareit 061|21.05.2018|3|27|192|49|\n|LethicGuys 25|23.05.2018|3|27|192|49|\n|ProxyGuys 04|06.06.2018|3|29|223|54|\n|Arsonists 022|10.06.2018|3|29|223|49|\n|LethicGuys 26|14.06.2018|3|29|224|54|\n\n\nTinukeFareit\n062\n\n\n19.06.2018 3 29 224 55\n\n\n-----\n\n|TinukeFareit 07|05.07.2018|3|29|224|55|\n|---|---|---|---|---|---|\n|MiningRats 12|26.08.2018|3|29|241|56|\n|LethicGuys 27|03.09.2018|3|29|241|56|\n|Arsonists 03|18.09.2018|3|29|241|56|\n|LethicGuys 28|18.09.2018|3|29|241|56|\n|ProxyGuys 05|18.09.2018|3|29|241|56|\n|TinukeFareit 08|20.09.2018|3|29|241|56|\n|MiningRats 13|11.10.2018|3|29|241|56|\n\n\nTable 11: The evolution of the Win32/Kasidet project.\n\nTable 12 lists the Rich Header search rules we use to cover the prevalent Neutrino bot version 5.4.\n\n\nprodidUtc1500_C b30729 = [1-4]\n\nprodidUtc1500_CPP b30729 = 1\n\nprodidImplib900 b30729 = [25-31]\n\nprodidimport0 b0 = [175-241]\n\nprodidUtc1600_C b40219 = 5\n\nprodidUtc1600_CPP b40219 = [44-56]\n\n\nTable 12: Win32/Kasidet version 5.4 detection rule.\n\n**Win{32,64}/Dridex**\n\nIt seems that, at any given time, this infamous banking trojan is actively being developed by a single entity, as all the\nsamples from a given time period/campaign have the same Rich Headers. The development environment has\nchanged at least four times. This could mean that the authors updated their tools or that the source code has\nchanged hands and has either been sold or passed to someone else. The detection rules for various versions can\nbe found in Table 13.\n\nWin{32,64}/Dridex v1, v2 & v3 (2014 – 2015)\n\nThe initial versions of the Dridex banking trojan were developed in Visual Studio 2010. The rule should cover all\nsamples from version 1.100 all the way until 3.102, which is over a year-long period between July 2014 and\nSeptember 2015. We have collected 75 unique builds based on this search and, based on the gaps in the versions\nof samples we were missing, it could potentially cover over 270 unique versions.\n\nWin{32,64}/Dridex v3 (2016)\n\nAfter version 3.102 the development environment changed slightly for the rest of the v3 development cycle and both\n32-bit and 64-bit versions between v3.145 (November 2015) and v3.258 (September 2016) can be covered by the\nrule.\n\n\n-----\n\n{, } ( )\n\nDridex version 4 introduced a few major changes including the infamous Atom bombing technique that made the\nheadlines back in 2017 as well as a major development environment towards Visual Studio 2015. The rule covers\nthe versions between v4.43 and v4.87 and reliably covers both 32-bit and 64-bit samples.\n\nWin{32,64}/Dridex v5(v2) (2018 – 2019)\n\nAnother shift in the development environment of this malware. This time there has been an interesting shift in the\nversioning as well – instead of an expected version 5 it has been set back to version 2. This could indicate a change\nin the ownership of the source code or a change of the developer responsible for the malware. The rule should cover\nthe most recent versions (v2.68 and newer).\n\nVersions 1, 2 and 3 (2014 - 2015) prodidUtc1500_CPP b30729 = 1\nprodidMasm1000  b40219 = [23-26]\nprodidUtc1600_C  b40219 = [99-143]\nprodidUtc1600_CPP b40219 = [32-48]\nprodidUnknown   b0   = 1\n\nVersion 3 (2016) prodidImplib900  b30729 = [3-5]\nprodidImport0   b0   = [1-2]\nprodidUtc1500_C  b30729 = 1\nprodidExport1000 b40219 = 1\nprodidUnknown   b0   = 1\n\nVersion 4 (2017 – 2018) prodidUtc1900_C  b24215 = [22-23]\nprodidUtc1900_CPP b24215 = [58-60]\nprodidLinker1400 b24215 = 1\n\nVersion 5 (v2) (2018 – 2019) prodidUtc1500_C  b30729 = 4\nprodidImplib900  b30729 = 5\nprodidImport0   b0   = 6\nprodidLinker1400 b24215 = 1\nprodidUnknown   b0   = 90\n\nTable 13: Win{32,64}/Dridex detection rules.\n\n**Win{32,64}/Sathurbot**\n\nThis name represents botnets spreading via password attacks on WordPress sites [15]. The malware is a large\nproject which is compiled for both 32- and 64-bit Windows platforms. Table 14 shows the evolution of the build\nenvironment (internal DLL name, PE Timestamp and ProdIDs representing the source files).\n\nprodidUtcXXXX_CPP\n\nPE TS 1600_CPP 1600_CPP b30319 1600_LTCG_CPP 1700_CPP 1800_CPP\nb40219 b30319 b50929 b20806\n\nPerformanceMonitor.dll 22.4.2015 59\n\nPerformanceMonitor.dll 27.4.2015 60\n\nPerformanceMonitor.dll 59\n\nPerformanceMonitor.dll 14.5.2015 60\n\nPerformanceMonitor.dll 59\n\nPerformanceMonitor.dll 21.6.2015 92\n\nPerformanceMonitor.dll 91\n\nPerformanceMonitor.dll 8.7.2015 92\n\n|Versions 1, 2 and 3 (2014 - 2015)|prodidUtc1500_CPP b30729 = 1 prodidMasm1000 b40219 = [23-26] prodidUtc1600_C b40219 = [99-143] prodidUtc1600_CPP b40219 = [32-48] prodidUnknown b0 = 1|\n|---|---|\n|Version 3 (2016)|prodidImplib900 b30729 = [3-5] prodidImport0 b0 = [1-2] prodidUtc1500_C b30729 = 1 prodidExport1000 b40219 = 1 prodidUnknown b0 = 1|\n|Version 4 (2017 – 2018)|prodidUtc1900_C b24215 = [22-23] prodidUtc1900_CPP b24215 = [58-60] prodidLinker1400 b24215 = 1|\n|Version 5 (v2) (2018 – 2019)|prodidUtc1500_C b30729 = 4 prodidImplib900 b30729 = 5 prodidImport0 b0 = 6 prodidLinker1400 b24215 = 1 prodidUnknown b0 = 90|\n\n|Col1|Col2|prodidUtcXXXX_CPP|1600_LTCG_CPP 1700_CPP 1800_CPP b30319 b50929 b20806|Col5|Col6|Col7|\n|---|---|---|---|---|---|---|\n|PE TS|1600_CPP b40219|1600_CPP b30319|1600_LTCG_CPP b30319|1700_CPP b50929|1800_CPP b20806||\n|PerformanceMonitor.dll|22.4.2015||||59||\n|PerformanceMonitor.dll|27.4.2015||||60||\n|PerformanceMonitor.dll||||59|||\n|PerformanceMonitor.dll|14.5.2015||||60||\n|PerformanceMonitor.dll||||59|||\n|PerformanceMonitor.dll|21.6.2015||92||||\n|PerformanceMonitor.dll||91|||||\n\n\n-----\n\n|PerformanceMonitor.dll|30.7.2015|Col3|91|Col5|Col6|Col7|\n|---|---|---|---|---|---|---|\n|PerformanceMonitor.dll|4.8.2015||91||||\n|PerformanceMonitor.dll|18.8.2015||89||||\n|PerformanceMonitor.dll||88|||||\n|PerformanceMonitor.dll|27.8.2015||88||||\n|PerformanceMonitor.dll|15.9.2015||89||||\n|PerformanceMonitor.dll|8.2.2016|89|||||\n|PerformanceMonitor.dll|18.2.2016|89|||||\n|performanceMonitor_64.dll|31.3.2016|||||84|\n|performanceMonitor_32.dll|29.06.2016|||||83|\n|performanceMonitor_64.dll|||||84||\n|performanceMonitor_32.dll|31.8.2016|||||83|\n|performanceMonitor_32.dll|24.10.2016|||||83|\n|performanceMonitor_64.dll|29.12.2016||69|97|||\n|performanceMonitor_32.dll|13.1.2017||68|97|||\n|performanceMonitor_32.dll|16.2.2017||68|97|||\n|performanceMonitor_64.dll||69|97||||\n|performanceMonitor_64.dll|10.3.2017||69|97|||\n|performanceMonitor_64.dll|21.3.2017||69|97|||\n|performanceMonitor_64.dll|27.5.2017|||||79|\n|performanceMonitor_64.dll|7.11.2017|||||79|\n\n\nTable 14: The evolution of Win{32,64}/Sathurbot.\n\nIt is not possible to conclude with high confidence that there is more than a single entity operating the source code.\nHowever, the produced executables suggest that Visual Studio is switched regularly. The merged PE timestamp of\ntwo samples into one cell with a single date means a consecutive compilation for both 32- and 64-bit platforms that\ndiffered by just a few seconds. The order of this compilation varied as well.\n\n**Malware packers**\n\nThe main purpose of malware packers is to provide a container for malware families with features like\npolymorphism, anti-analysis and obfuscation. Because of these features, malware packers often display abnormal\nstatic properties and their Rich Headers are no exception.\n\nThe first interesting case was a validly signed, highly polymorphic obfuscator detected as Win32/Kryptik.GSLI. In\nMay 2019, hundreds of unique samples were distributed in the wild, with Win32/TrojanDownloader.Zurgop.CY as the\nprotected payload. We discovered these campaigns because the prodidCvtres500 identifier contained anomalously\nhigh counts. After collecting many related files, we found that the rules in Table 15 identified the cluster very well.\n\n\n-----\n\nprodidMasm613 b7299 = [12-13]\n\nprodidUtc12_C b9782 = 63\n\nprodidLinker512 b8034 = 11\n\nprodidUtc12_CPP b9782 = 2\n\n\nTable 15: Detection query for Win32/Kryptik.GSLI.\n\nLater, we identified another extremely polymorphic malware packer. The shared static properties include two\n.version PE sections of 1,024 bytes each, a file version of 1.0.0.1 and legal copyright starting with Copyright (C)\n2018. The rest of the features seem randomly generated. We described the cluster with the relatively simple rule\nconjunction seen in Table 16.\n\n\nprodidUtc1500_CPP b21022 = 37\n\nprodidMasm900 b21022 = 17\n\nprodidUtc1500_C b21022 = [112-120]\n\nprodidUtc1500_LTCG_CPP b21022 = 1\n\nprodidCvtres900 b21022 = 1\n\n\nTable 16: Detection query for the malware packer shared across many malware families.\n\nThere were many malware families protected with this packer, including the following (for further examples see [01]):\n\nWin32/PSW.Delf.OSF (aka Azorult)\nWin/Spy.Kronosbot\nWin32/TrojanDownloader.Zurgop.DA\nWin32/Filecoder.Spora\nWin32/Agent.TFY (a backdoor written in GoLang)\nMSIL/Spy.Baldr\nWin32/Ramnit.BV (a virus)\nWin32/Spy.Ursnif.CY\n\n### Rich Headers & YARA\n\nYARA is a great tool for malware researchers, incident responders and security engineers that has become an\nindustry standard for hunting malware and the classification of unknown samples. Hence, being able to write YARA\nrules based on Rich Headers would be a great way to share our findings with the rest of the world.\n\nAlthough YARA does support parsing of Rich Headers and the PE module has a few Rich Header-related fields, at\nthe time of writing (June 2019) there are a few critical drawbacks that greatly limit its usability [16].\n\nFirst, as seen in its source code in Figure 8, YARA incorrectly assumes that the Rich Header always starts at the\ncommon offset 0x80 [10] and will not work for any Rich Header at a different offset. This can easily be fixed and is\nnot that big an issue, since as stated above, over 99% of files with Rich Headers tend to have them at that offset.\n\n\n-----\n\nFigure 8: YARA’s implementation\n\nof Rich Headers lookup.\n\nThe bigger problem is the YARA Rich Header-related API, which is very simple and insufficient for any effective Rich\nHeader-related rules. The version and toolid functions can only look whether a specific ProdID and build is present\nin the Rich Header, but are unable to query its count values, which are the most crucial attribute in most useful\nsearches. The announcement of YARA’s toolid function can be seen in Figure 9.\n\nFigure 9: YARA PE module Rich Headers API documentation.\n\nThe APIs would be much more useful if instead of the existence of a given ProdID, the toolid and version interfaces\nreturned the count (or null), which then could be compared against a ranged interval. This would greatly enhance\nYARA’s Rich Header-related capabilities and would enable more complete leverage of the Rich Header format. We\nhope to contribute to the YARA project and to help to improve the Rich Header-related functionality in the near\nfuture.\n\n## Conclusion\n\nWe started our project with low expectations, thinking that there must be a reason the Rich Headers feature is\noverlooked and not widely utilized. Over time, we became more and more impressed with how much could be\nachieved by searching for feature clusters based on such a small part of an executable, and how powerful it can be\n\n\n-----\n\nwhen leveraged correctly.\n\nThe space of Rich Header features has an extremely fast lookup and is ‘rich’ indeed, in the sense that the detection\nqueries for chosen parts of APT toolsets or crimeware kits identified the clusters well and with a low level of noise.\nBecause of the nature of the information, false positives may occur, however the erroneous verdicts seem to be\nintuitive: clean projects of small magnitude, shared executable containers and, surprisingly, different malicious\nfamilies as well. We believe this kind of static feature may also be utilized in machine-learning algorithms, to assist in\ndeciding maliciousness, and this is the subject of future work.\n\nSharing publicly the various techniques malware researchers use to track cybercriminal actors usually causes an\nobvious reaction: avoidance. In the case of the Rich Header that may be a Pyrrhic victory – any interference with this\ndelicate structure, such as wiping it or substituting it, will produce obvious, easily detectable anomalies just asking\nfor closer attention from our malware analysts.\n\nRich Headers are definitely not a silver bullet that will change the security industry, but they could be a nice and very\nhelpful addition to current detection and hunting methods and systems. We feel that this undocumented structure\ndeserves more attention than it currently receives across the field and imagine that, in the not too distant future, we\nmay see Rich Header YARA rules appearing in malware analysis IoC listings and the like.\n\n## References\n\n[1] [https://github.com/AyalaRs/win/blob/master/private/sdktools/vctools/langapi/include/prodids.h.](https://github.com/AyalaRs/win/blob/master/private/sdktools/vctools/langapi/include/prodids.h)\n\n[[2] ESET GitHub. SHA256 hashes of mentioned files. https://github.com/eset/malware-ioc/tree/master/rich_headers.](https://github.com/eset/malware-ioc/tree/master/rich_headers)\n\n[3] GReAT. A predatory tale: Who’s afraid of the thief? Securelist.com. March 2019. https://securelist.com/apredatory-tale/89779/.\n\n[4] Kálnai, P.; Poslušný, M. Lazarus Group: a mahjong game played with different sets of tiles, Virus Bulletin\nInternational Conference 2018, Montreal. https://www.virusbulletin.com/uploads/pdf/magazine/2018/VB2018-KalnaiPoslusny.pdf.\n\n[5] Kaspersky GReAT. The devil’s in the Rich header. March 2018. https://securelist.com/the-devils-in-the-richheader/84348/.\n\n[6] Rascagnères, P.; Mercer, W. Who wasn’t responsible for Olympic Destroyer. Virus Bulletin International\nConference 2018, Montreal. https://www.virusbulletin.com/uploads/pdf/magazine/2018/VB2018-RascagneresMercer.pdf.\n\n[7] Kálnai, P.; Cherepanov, A. Lazarus KillDisks Central American casino. April 2018.\n[https://www.welivesecurity.com/2018/04/03/lazarus-killdisk-central-american-casino/.](https://www.welivesecurity.com/2018/04/03/lazarus-killdisk-central-american-casino/)\n\n[8] Cherepanov, A. GREYENERGY: A successor to BlackEnergy. October 2018. https://www.welivesecurity.com/wpcontent/uploads/2018/10/ESET_GreyEnergy.pdf.\n\n[9] Cherepanov, A.; Lipovský, R. New Telebots backdoor linking Industroyer and notPetya. WeLiveSecurity.com.\n[October 2018. https://www.welivesecurity.com/2018/10/11/new-telebots-backdoor-linking-industroyer-notpetya/.](https://www.welivesecurity.com/2018/10/11/new-telebots-backdoor-linking-industroyer-notpetya/)\n\n[10] [https://github.com/VirusTotal/yara/blob/master/libyara/modules/pe.c#L190.](https://github.com/VirusTotal/yara/blob/master/libyara/modules/pe.c#L190)\n\n[11] Webster, G.D.; Kolosnjaji, B.; von Pentz, Ch.; Kirsch, J.; Hanif, Z.D.; Zarras, A.; Eckert, C. Finding the Needle: A\nStudy of the PE32 Rich Header and Respective Malware Triage. In: Proceedings of the International Conference on\nDetection of Intrusions and Malware, and Vulnerability Assessment. Springer, pp. 119--138, 2017.\nhttps://www.sec.in.tum.de/i20/publications/finding-the-needle-a-study-of-the-pe32-rich-header-and-respectivemalware-triage.\n\n\n-----\n\n[12] Cherepanov, A. Win32/Industroyer a new threat to industrial control systems. WeLiveSecurity.com. June 2017.\n[https://www.welivesecurity.com/wp-content/uploads/2017/06/Win32_Industroyer.pdf.](https://www.welivesecurity.com/wp-content/uploads/2017/06/Win32_Industroyer.pdf)\n\n[13] Kafka, F. From Hacking Team to Hacked Team to…? Virus Bulletin International Conference 2018, Montreal.\n[https://www.virusbulletin.com/uploads/pdf/magazine/2018/VB2018-Kafka.pdf.](https://www.virusbulletin.com/uploads/pdf/magazine/2018/VB2018-Kafka.pdf)\n\n[14] Soucek, J.; Tomanek, J.; Kálnai, P. Collecting Malicious Particles from Neutrino botnets. The Journal on\nCybercrime & Digital Investigations, Botconf 2018 Conference proceedings,\n[https://journal.cecyf.fr/ojs/index.php/cybin/article/view/22/24.](https://journal.cecyf.fr/ojs/index.php/cybin/article/view/22/24)\n\n[15] ESET Research: Sathurbot: Distributed WordPress password attack. WeLiveSecurity.com. April 2017.\n[https://www.welivesecurity.com/2017/04/06/sathurbot-distributed-wordpress-password-attack/.](https://www.welivesecurity.com/2017/04/06/sathurbot-distributed-wordpress-password-attack/)\n\n[[16] YARA PE module documentation. https://yara.readthedocs.io/en/v3.7.0/modules/pe.html.](https://yara.readthedocs.io/en/v3.7.0/modules/pe.html)\n\n## Latest articles:\n\n### Cryptojacking on the fly: TeamTNT using NVIDIA drivers to mine cryptocurrency\n\nTeamTNT is known for attacking insecure and vulnerable Kubernetes deployments in order to infiltrate organizations’\ndedicated environments and transform them into attack launchpads. In this article Aditya Sood presents a new\nmodule introduced by…\n\n### Collector-stealer: a Russian origin credential and information extractor\n\nCollector-stealer, a piece of malware of Russian origin, is heavily used on the Internet to exfiltrate sensitive data\nfrom end-user systems and store it in its C&C panels. In this article, researchers Aditya K Sood and Rohit\nChaturvedi present a 360…\n\n### Fighting Fire with Fire\n\nIn 1989, Joe Wells encountered his first virus: Jerusalem. He disassembled the virus, and from that moment onward,\nwas intrigued by the properties of these small pieces of self-replicating code. Joe Wells was an expert on computer\nviruses, was partly…\n\n### Run your malicious VBA macros anywhere!\n\nKurt Natvig wanted to understand whether it’s possible to recompile VBA macros to another language, which could\nthen easily be ‘run’ on any gateway, thus revealing a sample’s true nature in a safe manner. In this article he\nexplains how he recompiled…\n\n### Dissecting the design and vulnerabilities in AZORult C&C panels\n\nAditya K Sood looks at the command-and-control (C&C) design of the AZORult malware, discussing his team's\nfindings related to the C&C design and some security issues they identified during the research.\n\n[Bulletin Archive](https://www.virusbulletin.com/virusbulletin/archive)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-01-31 - Rich Headers- leveraging this mysterious artifact of the PE format.pdf"
    ],
    "report_names": [
        "2020-01-31 - Rich Headers- leveraging this mysterious artifact of the PE format.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4d9cdc7f-72d6-4e17-89d8-f6323bfcaebb",
            "created_at": "2023-01-06T13:46:38.82716Z",
            "updated_at": "2025-03-27T02:00:02.928984Z",
            "deleted_at": null,
            "main_name": "GreyEnergy",
            "aliases": [],
            "source_name": "MISPGALAXY:GreyEnergy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536012,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1653759781,
    "ts_modification_date": 1653759781,
    "files": {
        "pdf": "https://archive.orkl.eu/806a5febfba46889f001fde27fda4e5949050e7c.pdf",
        "text": "https://archive.orkl.eu/806a5febfba46889f001fde27fda4e5949050e7c.txt",
        "img": "https://archive.orkl.eu/806a5febfba46889f001fde27fda4e5949050e7c.jpg"
    }
}