{
    "id": "34228263-1203-4e5e-bb30-ee814a28ffc9",
    "created_at": "2023-01-12T15:09:44.081166Z",
    "updated_at": "2025-03-27T02:05:38.783041Z",
    "deleted_at": null,
    "sha1_hash": "36bf5ff1ee58ea26a408c545a1cdd6d5cc1869ea",
    "title": "2022-12-21 - Inside the IcedID BackConnect Protocol",
    "authors": "",
    "file_creation_date": "2022-12-29T00:40:29Z",
    "file_modification_date": "2022-12-29T00:40:29Z",
    "file_size": 1766118,
    "plain_text": "# Inside the IcedID BackConnect Protocol\n\n**[team-cymru.com/post/inside-the-icedid-backconnect-protocol](https://www.team-cymru.com/post/inside-the-icedid-backconnect-protocol)**\n\nS2 Research Team December 21, 2022\n\n## Deriving Threat Actor TTPs from Management Infrastructure Tracking\n\n**You can find our previous work on** **[Stage 1 and](https://www.team-cymru.com/post/a-visualizza-into-recent-icedid-campaigns)** **[Stage 2 of IcedID’s initial infection](https://www.team-cymru.com/post/tracking-bokbot-icedid-infrastructuremapping-a-vast-and-currently-active-icedid-network)**\n**chain in our** **[Dragons News Blog. Data on Stage 1 C2 infrastructure is now also shared](https://www.team-cymru.com/blog/categories/threat-research)**\n**[as part of our Botnet Analysis and Reporting Service (BARS).](https://www.team-cymru.com/malware-and-botnet-analysis-and-detection)**\n\nAs part of our ongoing tracking of IcedID / BokBot, we wanted to share some insights derived\nfrom infrastructure associated with IcedID’s BackConnect (BC) protocol. When deployed post\n“initial” compromise, the BC protocol allows the threat actor(s) additional functionality, using\nthe infected host as a proxy.\n\nAmongst other things, the BC protocol contains a VNC module, providing the malware\noperator(s) with a remote-access channel which can be brokered for profit.\n\n[For a comprehensive description of the BC protocol, we recommend this blog by Netresec.](https://www.netresec.com/?page=Blog&month=2022-10&post=IcedID-BackConnect-Protocol)\n[Furthermore, we must credit @malware_traffic having drawn upon his collection of threat](https://twitter.com/malware_traffic)\nactor [telemetry data to confirm some of the observations shared in this post.](https://www.malware-traffic-analysis.net/index.html)\n\n## Key Findings\n\nEleven BC C2s identified since 01 July 2022, managed via two VPN nodes.\n\nOperators likely located in Moldova and Ukraine managing distinct elements of the BC\nprotocol.\n\nEvidence of malicious use of the SpaceX Starlink network identified.\n\nExposure of several tools and processes utilized by the operators, including temporary\nSMS messaging, file sharing, cryptocurrency wallets, and a favorite local radio station.\n\n\n-----\n\n## Starting Point - 51.89.201.236\n\nThe starting point for our analysis is derived from the two sources mentioned above;\nalthough not a new phenomenon, reporting on the BC protocol is fairly scarce, with the last\n[major point of reference, prior to the most recent coverage, being made in May 2020.](https://blog.group-ib.com/icedid)\n\nIn early October 2022, an IOC (51.89.201.236:8080) derived from an IcedID infection was\n[identified by @malware_traffic. The IOC was later attributed as a C2 server for the BC](https://twitter.com/malware_traffic)\nprotocol by [Netresec, noting a change in the auth value (0x08088b1f) used by the bot and](https://twitter.com/netresec)\nC2 server for verification purposes.\n\n\n-----\n\nFigure 1: [https://twitter.com/netresec/status/1577966512459087874](https://twitter.com/netresec/status/1577966512459087874)\n\nWith an active C2 server for the BC protocol identified, our first step was to examine our\nnetwork telemetry data surrounding this IP address, looking for indications of management\naccess, common peers, and subsequent similar patterns of activity, e.g., evidence of victim\ncommunications over TCP/8080.\n\n\n-----\n\nFigure 2: Initial Data Pivots\n\nOver time, by repeating this process it was possible to identify two long standing\nmanagement IP addresses, which were observed in communication with 11 distinct BC C2\nservers (including 51.89.201.236) since 01 July 2022.\n\n\n-----\n\nFigure 3: C2 Server Timeline (Based on Management Traffic)\n\nBased on the data behind Figure 3, we can state that the average life cycle for a BC C2\nserver, based on first and last observations of management traffic, is approximately four\nweeks and that there are generally one or two servers active at any given time.\n\nAdditionally, in all cases communications between the C2 and management servers\ncommenced and ceased on a Monday to Friday schedule - indicating a degree of\n“professionalism” to the operation and a point which became a trend during this analysis.\n\n## Auth Value Changes\n\nReturning to the aforementioned auth value (0x08088b1f), based on our investigations, the\ncampaigns involving 51.89.201.236 are the first time the “new” auth value was observed.\nHowever, this finding is caveated with the fact that relevant PCAP data was not available for\nthe two preceding C2 IPs - 135.125.242.223 and 198.244.187.242.\n\nAll prior C2s used the “previous” auth value (0x974f014a), which was associated with IcedID\ndating back a number of years. The change in auth value therefore likely happened at some\npoint between 30 August and 22 September 2022.\n\n\n-----\n\nFigure 4: Auth Value for 135.181.175.108 (Last Active 30 August 2022)\n\n## Management Insights\n\nThe remainder of this blog will focus on the two management IP addresses which have been\nassociated with the operation of the BC protocol for at least half a year.\n\nThese IPs consistently connect to the BC C2 servers on the same two (separate) static\nports, one which hosts a VNC service and the second which we hypothesize is associated\nwith the SOCKS proxy module.\n\n\n-----\n\nFigure 5: BackConnect Management\n\nSetting the BC protocol management communications to one side, examining the rest of the\ndata available for these two IP addresses provides an insight into the threat actor(s)\noperation, with some hints at attribution.\n\n**VNC Management**\n\nThe first observation with the VNC Management is that it appears to be a VPN node. When\nexamining inbound connections, a large proportion take place on UDP/1194, a port\ncommonly associated with OpenVPN as the service’s default port.\n\n**The VNC Management IP is therefore most likely used for routing traffic / providing**\n**anonymisation to the operator(s) and may not host any digital artifacts.**\n\nOn the other side of the OpenVPN connections are numerous Moldovan IPs, the vast\nmajority of which are assigned to a large residential broadband provider. In the 30-day period\nprior to the time of writing this report, 31 distinct Moldovan IPs were observed connecting to\n\n\n-----\n\nthe VNC Management IP. Interestingly, the communications do not overlap, pointing towards\na single user / access point.\n\n**Our hypothesis in this case is that the operator(s) of VNC Management IP are**\n**employing some operational security measures whilst operating from / via a**\n**residential access point. The data available points to an end user frequently rebooting**\n**their router in order to refresh their public IP address.**\n\nTurning to outbound connections, a number of observations can be made, indicating\npotential operator TTPs.\n\nFirstly, regular traffic to TeamViewer infrastructure was observed, indicating that the software\nmay be installed on the operator’s machine, with usage routed through TeamViewer’s\nservers. Like VNC, TeamViewer has been used previously by threat actors for remote access\n[management purposes, for example, it is leveraged to gain access to networks and](https://www.zdnet.com/article/following-oldsmar-attack-fbi-warns-about-using-teamviewer-and-windows-7/) establish\npersistence in ransomware operations.\n\nSecondly, communications with a single Tor relay were observed over an extended period.\nThis particular finding may be indicative of a single operator accessing the Tor network via\nthe VNC Management IP.\n\n**By default, the Tor browser utilizes a small pool of Guard relays, which is refreshed**\n**approximately every 60 days. Ongoing communications with a single Tor relay is**\n**therefore indicative of an end user accessing Tor via the Tor browser.**\n\n**As each instance of the Tor browser has its own set of Guard relays, multiple users**\n**accessing the Tor network via the same VPN access point would result in the**\n**observation of connections to multiple Tor relays.**\n\n\n-----\n\nFigure 6: Communications with Tor Relay\n\nBy examining the timeline of activity involving communications with this particular Tor relay,\nwe can see that it was likely associated with the operator until 3 December 2022, when the\nGuard pool likely reset. Since this date we have not observed any further connections to Tor\nrelays; likely as a result of a coverage gap.\n\nThe majority of the Tor activity fits to a Monday to Friday schedule, although there were\nsome days where access took place over the weekend. Most notably on 5 and 6 November\n2022, following a spike in activity on 3 November 2022.\n\n**This activity coincided with a resurgence of Emotet activity, which included a** **new**\n**version of IcedID being dropped alongside it. The spike is therefore a possible**\n**indicator of collusion between the operators of Emotet and IcedID.**\n\nAside from Tor, connections were also observed to IPs assigned to Telegram, indicating likely\nuse of Telegram messenger. This finding is not particularly exciting (Telegram is used\nwidely), but serves to highlight the overall TTPs of the VNC Management IP operators.\n\nMore interestingly, traffic to onlinesim[.]ru caught our attention. This website appears to\nprovide temporary ‘virtual’ numbers to be used for sending / receiving SMS messages.\n\n\n-----\n\n**By virtue of the fact that this domain was accessed via the same infrastructure as is**\n**used to manage the BC C2s, it can be inferred that these temporary numbers serve a**\n**purpose in the overall process; although the exact use-case is currently unknown.**\n\nAnother indicator for operator attribution came in the form of connections to an API for a local\nradio station based in Chelyabinsk, Central Russia.\n\n**We have two hypotheses for this activity, a) the API is embedded in another website**\n**and is pulling data from the radio station in Chelyabinsk, or b) the operator has some**\n**ties to that particular region of Russia; an expat living in Moldova?**\n\nFinally, we observed RDP connections to a set of IPs that share a distinct machine name,\nhowever it is unclear what the purpose of these connections are beyond the obvious use of\nthe RDP protocol.\n\n\n-----\n\nFigure 7: Summary of Activity - VNC Management IP\n\n**SOCKS Management**\n\nIntriguingly, although the SOCKS Management IP serves a similar purpose to the VNC\nManagement IP, there are variations in both how this is accomplished and by whom.\n\nLike the VNC Management IP, the SOCKS Management IP appears to be a VPN node,\nmasking the true location of the operator(s), used to funnel not only BC protocol-related\ncommunications, but also other (mostly) connected activities.\n\nInbound traffic to the SOCKS Management IP is observed over UDP/51820, the default port\nfor the open-source WireGuard VPN service.\n\n\n-----\n\n**Noting the similar use of an (albeit different) open-source, and likely private, VPN**\n**service.**\n\nOn the other end of these communications are a handful of IPs assigned to providers in\nUkraine. Most significantly, several of these IPs are attributable to ‘SpaceX Starlink’\ninfrastructure provided to Ukraine to help maintain Internet connectivity since the\ncommencement of Russia’s “special operation” / illegal invasion in February 2022.\n\n**It is possible that this is the first example of the Starlink infrastructure being used by**\n**cyber criminals.**\n\nBeyond the Ukrainian IPs, in this case it is difficult to attribute the management activity more\nspecifically; as the infrastructure is likely utilized by tens, or even hundreds of users at any\ngiven time.\n\nFigure 8: Inbound and Outbound Activity - SOCKS Management IP\n\nLooking at outbound connections from the SOCKS Management IP, there is similar use of\nTor and Telegram. Although, in the case of Tor, this may be more indicative of some form of\nautomated or hidden service-related activity as communications with numerous Tor relays\nwere observed.\n\n\n-----\n\n**This is in comparison with the VNC Management IP which appeared to only**\n**communicate with the one Tor relay; matching more closely the ‘expected’ behavior of**\n**an individual using the Tor browser.**\n\nAdditionally, a large volume of connections, both inbound and outbound, over TCP and\nUDP/33445 were observed, generally associated with Tox messenger.\n\n**Tox has been utilized by cyber criminals in the past, including for C2 purposes. The**\n**default port for Tox is UDP/33445, however mobile connections default to TCP - it is**\n**therefore possible that the operator(s) of the SOCKS Management IP are using it to**\n**access Tox on both desktop and mobile.**\n\nIn much the same way as the BC C2s have a life cycle of around four weeks, the SOCKS\nManagement IP also communicates with cloud infrastructure (accessed via SSH) with the\ncloud peer IP changing over time. However, it was noted that all of the cloud IPs displayed\nthe same unique SSH Server Host Key, indicating a likely consistent setup.\n\nFinally, looking at outbound web-browsing activity (TCP/80 and TCP/443), the SOCKS\nManagement IP is used to access IP addresses associated with Gofile (file sharing),\nProtonMail, Trezor (cryptocurrency wallet), and a not insignificant number of pornographic\nsites (someone in IcedID senior management needs to crack down on adherence to the\nAcceptable Use Policy!).\n\n\n-----\n\nFigure 9: Summary of Activity - SOCKS Management IP\n\n## Conclusion\n\nThis blog serves two purposes, the first is to highlight our tracking of BC C2 infrastructure,\nsharing details of C2 servers and the process we undertake behind the scenes in order to\nidentify them.\n\n**We will continue to share details of new / emerging BC C2 servers via our Twitter**\n**account** **[@teamcymru_S2.](https://twitter.com/teamcymru_S2)**\n\nThe second is to provide a snapshot into a ‘day in the life of’ the BC operators, and in doing\nso, providing wider context on threat actor TTPs.\n\n\n-----\n\nIn the case of BC, there appears to be two operators managing the overall process within\ndistinct roles. Much of the activity we observe and have described in this blog occurs during\nthe typical working week (Monday to Friday).\n\n**Both of these points indicate a degree of ‘professionalism’ in the operation of the BC**\n**protocol, and by extension IcedID itself.**\n\nEvidence of a ‘dispersed’ workforce undertaking specific tasks may also help to explain\nsome of the variations in the TTPs observed. Whilst seemingly using two distinct VPN\nservices, we can see an overall ‘playbook’ in use, i.e., its best practice to use a VPN for\npurposes of anonymization. The fact that both services are configured with default settings\nindicate either laziness, attempts to ‘hide within the noise’, or a lack of understanding /\nappreciation of the tooling in use.\n\nWe were surprised that beyond the use of a VPN node, very few steps appear to have been\ntaken to cover the operators’ tracks; we think this speaks to a confidence in ‘invincibility’, by\noperating from regions where law enforcement action is difficult to effect / prioritize.\n\nThe use of services like ProtonMail, TeamViewer and Telegram is commonly observed within\nthreat actor operator playbooks, and these mainstream tools continue to be used by\nmaliciously motivated individuals. Services like Gofile and onlinesim[.]ru may point to more\n‘operator-specific’ TTPs, whilst also highlighting a general use of file sharing and temporary\nSMS platforms.\n\n**Finally, by highlighting a number of areas where we still have question marks in our**\n**understanding, we hope that we can encourage future collaboration on the BC**\n**protocol.**\n\nWe hope that this blog post has been informative and has served to provide confidence in\nthe IOCs which we have previously shared on this subject matter.\n\n## IOCs\n\n\n-----\n\nBackConnect C2 Servers\n```\n135.125.242.223\n\n135.181.175.108\n\n137.74.104.108\n\n176.31.136.226\n\n185.156.172.97\n\n188.40.246.37\n\n198.244.187.242\n\n198.251.84.61\n\n212.114.52.91\n\n51.195.169.87\n\n51.89.201.236\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-21 - Inside the IcedID BackConnect Protocol.pdf"
    ],
    "report_names": [
        "2022-12-21 - Inside the IcedID BackConnect Protocol.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536184,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1672274429,
    "ts_modification_date": 1672274429,
    "files": {
        "pdf": "https://archive.orkl.eu/36bf5ff1ee58ea26a408c545a1cdd6d5cc1869ea.pdf",
        "text": "https://archive.orkl.eu/36bf5ff1ee58ea26a408c545a1cdd6d5cc1869ea.txt",
        "img": "https://archive.orkl.eu/36bf5ff1ee58ea26a408c545a1cdd6d5cc1869ea.jpg"
    }
}