{
    "id": "344942fa-4ca5-4cf5-badb-6a4f6313893b",
    "created_at": "2023-01-12T15:01:53.576731Z",
    "updated_at": "2025-03-27T02:05:29.494916Z",
    "deleted_at": null,
    "sha1_hash": "2cb04fde63e0bbd99598c816b1e37d80bec04ab3",
    "title": "2021-05-12 - DarkSide Ransomware Gang- An Overview",
    "authors": "",
    "file_creation_date": "2022-05-27T21:26:30Z",
    "file_modification_date": "2022-05-27T21:26:30Z",
    "file_size": 1433220,
    "plain_text": "# DarkSide Ransomware Gang: An Overview\n\n**unit42.paloaltonetworks.com/darkside-ransomware/**\n\nRamarcus Baylor May 12, 2021\n\nBy [Ramarcus Baylor](https://unit42.paloaltonetworks.com/author/ramarcus-baylor/)\n\nMay 12, 2021 at 1:00 PM\n\n[Category: Ransomware,](https://unit42.paloaltonetworks.com/category/ransomware/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [DarkSide,](https://unit42.paloaltonetworks.com/tag/darkside/) [DDoS,](https://unit42.paloaltonetworks.com/tag/ddos/) [ransomware threat report](https://unit42.paloaltonetworks.com/tag/ransomware-threat-report/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/darkside-ransomware/)\n\n## Executive Summary\n\nIt took an attack on a major U.S. pipeline company, and the possibility of disruption in the\ndelivery of gasoline and jet fuel supplies to a large part of the country, to show the world that\nransomware attackers are not going to rest on their laurels after shaking down municipal\ngovernments, school districts and hospitals.\n\nDarkSide became one of the world’s most well-known hacking groups after the FBI\nconfirmed it is responsible for the highly publicized attack. When a shadowy group can sit\nhalfway across the world and, with a few keystrokes, threaten fuel supplies on the U.S.\nEastern Seaboard, then people do begin to take notice.\n\n\n-----\n\nThe impact of this attack is a reflection of the fact that ransomware operators are always on\nthe move – improving, automating and becoming more effective at targeting larger and larger\norganizations. And they’re getting a lot more money for their efforts. The average cyber\nransom paid more than doubled in 2020 – to $312,493 – compared to 2019, according to the\n[2021 Unit 42 Ransomware Threat Report. So far in 2021, the average payment has nearly](https://unit42.paloaltonetworks.com/ransomware-threat-report-highlights/)\ntripled compared to the previous year – to about $850,000.\n\nDarkSide has helped boost those averages by constantly focusing on ways to optimize its\nbusiness model in the short time it’s been active (we first encountered the group about a\n[year ago). Like other leading ransomware gangs, DarkSide recently embraced the](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/)\nRansomware-as-a-Service (RaaS) model. It outsourced code development, infrastructure\nand operations and turned to the dark web to recruit new staff. As a result, the group can\nnow better focus on getting to know victims and targeting the most valuable types of data at\neach organization, so it can extract the largest-possible ransom and boost the return on\ninvestment in its criminal businesses.\n\nThe group started getting the attention of Unit 42 responders around October 2020. Since\nthen, we’ve been finding its fingerprints in a growing number of cases. What makes DarkSide\nstand out is that the group has shown discipline we've traditionally only seen with nationstate actors – once the threat actors are in, they really dig in. That said, researchers have\nnoted DarkSide is likely a criminal network operating out of Russia; no one has yet directly\nconnected this to the Russian government.\n\nIt is interesting to note that back in November, one ransomware negotiation firm placed the\nDarkSide operation on an internal restricted list after it announced plans to host infrastructure\nin Iran – because Iran is under U.S. sanctions, facilitating payments to that location might run\nafoul of the law.\n\n[Wherever they may be, there are indications that DarkSide attackers are highly experienced](https://www.reuters.com/business/energy/ransom-group-linked-colonial-pipeline-hack-is-new-experienced-2021-05-09/)\nand accomplished in mounting ransomware attacks. They clearly operate at the high end of\nthe ransomware ecosystem, focusing on a smaller pool of victims from whom they can\nextract steep ransoms.\n\nPalo Alto Networks customers are protected from this threat by:\n\n[WildFire: All known samples are identified as malware.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n[Cortex XDR with:](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\nindicators for DarkSide.\nAnti-Ransomware Module to detect DarkSide encryption behaviors.\nLocal Analysis detection to detect DarkSide binaries.\n\n\n-----\n\nCortex XSOAR: Cortex XSOAR s **[ransomware content pack can immediately help](https://blog.paloaltonetworks.com/security-operations/cortex-xsoar-for-automated-ransomware-response/)**\nincident response, threat intelligence and SecOps teams to standardize and speed-up\npost-intrusion response processes. This content pack automates most of the\nransomware response steps, allowing the incident response and SecOps teams to add\ntheir guidance and input.\n[Next-Generation Firewalls: DNS Signatures detect the known command and control](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\n[(C2) domains, which are also categorized as malware in URL Filtering.](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/web-security)\n[AutoFocus: Tracking related activity using the DarkSide tag.](https://www.paloaltonetworks.com/cortex/autofocus)\n\nIf you think you may have been impacted, please email unit42investigations@paloaltonetworks.com or call (855) 875-4631 to get in touch with the Unit 42\nIncident Response team.\n\n## Doubling and Tripling Their Pressure\n\nThe DarkSide group is aggressive in pressuring victims to pay. The threat actors don’t like to\nbe ignored. If victims don’t respond within two or three days, they send threatening emails to\nemployees. If that doesn’t work, they start calling senior executives on mobile phones. And\nthen they might threaten to start contacting customers or the press. And if that doesn’t work,\nthey might launch DDoS to take down external websites.\n\nDarkSide is one of a growing number of ransomware operators that we have seen push the\nboundaries of their trade to include these tactics, which we refer to as double and triple\n[extortion (others include Maze, Sodin,](https://unit42.paloaltonetworks.com/threat-brief-maze-ransomware-activities/) [Clop,](https://unit42.paloaltonetworks.com/clop-ransomware/) [NetWalker and Conti).](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/2/)\n\nThese aggressive techniques build on the pattern of a typical ransomware attack, in which\nfiles are encrypted and a ransom is demanded to decrypt them and restore access. Some\nvictims have backed up their data and do not see a need to pay for decryption keys to\nrestore access to corrupted systems. To prepare for that scenario, attackers also exfiltrate\nsensitive information and study the victim’s network so they can up the ante if a target\nrefuses to pay. Then they threaten to release the data or launch a DDoS attack.\n\nDarkSide even purports to operate under a “code of conduct,” seeking to position the group\nas a trustworthy security “partner.” When victims pay, the threat actors will do things to\ndemonstrate good will including providing decryption keys or presenting evidence that\nappears to show they have deleted stolen data. When asked, they will sometimes even tell\nvictims how they got in so security gaps can be closed.\n\n## DarkSide Ransomware: Tactics, Techniques and Procedures\n\nWe have seen the following software and tools leveraged by the DarkSide group to gain\naccess to the victims’ data:\n\n\n-----\n\nLegitimate remote monitoring and management (RMM) tools to maintain access into\na victim’s network, such as AnyDesk and TeamViewer.\n**Reconnaissance tools (ADRecon) to gather information about victims' Active**\nDirectory prior to ransomware encryption.\nA credential harvesting utility, Mimikatz, to dump password credentials.\n**PowerShell to carry out objectives, such as to apply GPO to create a scheduled task**\nto execute the ransomware.\n**Password management utilities such as Dashlane and LastPass to gain access to**\nadditional credentials.\n**Utilities such as SQLDumper.exe to target SQL Server.**\nVictims’ internal messaging software to contact members of the IT staff.\n**File transferring software Rclone to exfiltrate data to cloud sharing websites (such as**\nPCloud and MegaSync).\n\nNot many groups target non-Windows based systems, but in early 2021, DarkSide\nintroduced an ESXI version of their ransomware that targets VMware virtual machines\n(VMs), which many organizations use to leverage server virtualization to reduce operating\ncosts and increase IT productivity.\n\nWhy does this matter? While we found that in many cases the client’s endpoint security did\nits job protecting Windows PCs from being encrypted, because the servers were heavily\nvirtualized through VMware’s ESXI, the ESXI version of the ransomware made it possible for\nthe DarkSide group to encrypt the virtual infrastructure. The threat actors then essentially\nshut down applications and services, such as file shares, DNS and email, leaving the victims’\nnetworks in a deteriorated state or, worse, not functional.\n\n## What Can We Learn From This?\n\nWe’ve been noting for some time that ransomware attackers are becoming increasingly\nprofessionalized, outsourcing code development, infrastructure and C2 operations, as well\nas operating RaaS. Many of them are organized enough to respond to media inquiries and\noperate victim hotlines.\n\nAs these threat actors continue to up their game, organizations need to follow best practices\nto safeguard their data and protect against groups such as the DarkSide ransomware gang.\n\nOrganizations should also make sure to have an incident response plan in place in case of\nan attack. Unit 42 offers a [Ransomware Readiness Assessment to help organizations get](https://www.paloaltonetworks.com/ransomware-readiness-assessment)\nstarted on bolstering defenses.\n\nPalo Alto Networks customers are protected from this threat by:\n\n[WildFire: All known samples are identified as malware.](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\n\n\n-----\n\n[Cortex XDR with:](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\nindicators for DarkSide.\nAnti-Ransomware Module to detect DarkSide encryption behaviors.\nLocal Analysis detection to detect DarkSide binaries.\nCortex XSOAR: Cortex XSOAR’s **[ransomware content pack can immediately help](https://blog.paloaltonetworks.com/security-operations/cortex-xsoar-for-automated-ransomware-response/)**\nincident response, threat intelligence and SecOps teams to standardize and speed-up\npost-intrusion response processes. This content pack automates most of the\nransomware response steps, allowing the incident response and SecOps teams to add\ntheir guidance and input.\n[Next-Generation Firewalls: DNS Signatures detect the known command and control](https://www.paloaltonetworks.com/network-security/next-generation-firewall)\n[(C2) domains, which are also categorized as malware in URL Filtering.](https://www.paloaltonetworks.com/products/threat-detection-and-prevention/web-security)\n[AutoFocus: Tracking related activity using the DarkSide tag.](https://www.paloaltonetworks.com/cortex/autofocus)\n\n## IOCs\n\n[Indicators associated with Darkside are available on GitHub, have been published to the Unit](https://github.com/pan-unit42/iocs/tree/master/Darkside)\n42 [TAXII feed and are viewable via the ATOM Viewer.](https://stix2.unit42.org/)\n\n## Courses of Action\n\nThis section documents relevant tactics, techniques and procedures (TTPs) used with\nDarkSide and maps them directly to Palo Alto Networks product(s) and service(s). It also\nfurther instructs customers on how to ensure their devices are configured correctly.\n\n**Product / Service** **Course of Action**\n\n**Initial Access, Lateral Movement, Command and Control,**\n**Execution, Exfiltration, Persistence, Collection, Privilege**\n**Escalation, Discovery, Defense Evasion**\n\n**Exploit Public-Facing Application [T1190], External Remote**\n**Services [T1133], Remote Desktop Protocol [T1021.001], Web**\n**Protocols [T1071.001], Multi-hop Proxy [T1090.003], Valid**\n**Accounts [T1078], Phishing [T1566], PowerShell [T1059.001],**\n**Automated Exfiltration [T1020], Scheduled Task [T1053.005],**\n**Archive Collected Data [T1560], Automated Collection [T1119],**\n**Bypass User Account Control [T1548.002], Account Discovery**\n\n**[T1087] Modify Registry [T1112]**\n\nNGFW Ensure application\nsecurity policies exist\nwhen allowing traffic\nfrom an untrusted\nzone to a more\ntrusted zone\n\n\n-----\n\nEnsure 'Service setting of ANY' in a security policy allowing traffic\ndoes not exist\n\nEnsure 'Security Policy' denying any/all traffic to/from IP addresses\non Trusted Threat Intelligence Sources Exists\n\nEnsure that User-ID is only enabled for internal trusted interfaces\n\nEnsure that 'Include/Exclude Networks' is used if User-ID is\nenabled\n\nEnsure that the User-ID Agent has minimal permissions if User-ID\nis enabled\n\nEnsure that the User-ID service account does not have interactive\nlogon rights\n\nEnsure remote access capabilities for the User-ID service account\nare forbidden\n\nEnsure that security policies restrict User-ID Agent traffic from\ncrossing into untrusted zones\n\nSet up File Blocking\n\nEnsure 'SSL Forward Proxy Policy' for traffic destined to the\nInternet is configured\n\nEnsure 'SSL Inbound Inspection' is required for all untrusted traffic\ndestined for servers using SSL or TLS\n\nEnsure that the Certificate used for Decryption is Trusted\n\nThreat Prevention † Ensure a\nVulnerability\nProtection Profile is\nset to block attacks\nagainst critical and\nhigh vulnerabilities,\nand set to default on\nmedium, low and\ninformational\nvulnerabilities\n\nEnsure a secure Vulnerability Protection Profile is applied to all\nsecurity rules allowing traffic\n\nEnsure that antivirus profiles are set to block on all decoders\nexcept 'imap' and 'pop3'\n\nEnsure a secure antivirus profile is applied to all relevant security\npolicies\n\n\n-----\n\nEnsure an anti-spyware profile is configured to block on all\nspyware severity levels, categories, and threats\n\nEnsure DNS sinkholing is configured on all anti-spyware profiles in\nuse\n\nEnsure passive DNS monitoring is set to enabled on all antispyware profiles in use\n\nEnsure a secure Anti-Spyware profile is applied to all security\npolicies permitting traffic to the Internet\n\nEnsure that all zones have Zone Protection Profiles with all\nReconnaissance Protection settings enabled, tuned and set to\nappropriate actions\n\nEnsure that User Credential Submission uses the action of ‘block’\nor ‘continue’ on the URL categories\n\nDNS Security † Enable DNS Security\nin Anti-Spyware\nprofile\n\nURL Filtering † Ensure that URL\nFiltering is used\n\nEnsure that URL Filtering uses the action of ‘block’ or ‘override’ on\nthe <enterprise approved value> URL categories\n\nEnsure that access to every URL is logged\n\nEnsure all HTTP Header Logging options are enabled\n\nEnsure secure URL Filtering is enabled for all security policies\nallowing traffic to the internet\n\nWildFire † Ensure that WildFire\nfile size upload limits\nare maximized\n\nEnsure forwarding is enabled for all applications and file types in\nWildFire file blocking profiles\n\nEnsure a WildFire Analysis profile is enabled for all security\npolicies\n\nEnsure forwarding of decrypted content to WildFire is enabled\n\nEnsure all WildFire session information settings are enabled\n\nEnsure alerts are enabled for malicious files detected by WildFire\n\n\n-----\n\nEnsure 'WildFire Update Schedule' is set to download and install\nupdates every minute\n\nCortex XSOAR Deploy XSOAR\nPlaybook Cortex\nXDR - Isolate\nEndpoint\n\nDeploy XSOAR Playbook - Access Investigation Playbook\n\nDeploy XSOAR Playbook - Impossible Traveler\n\nDeploy XSOAR Playbook - Block Account Generic\n\nDeploy XSOAR Playbook - Block URL\n\nDeploy XSOAR Playbook - Palo Alto Networks - Hunting And\nThreat Detection\n\nDeploy XSOAR Playbook - PAN-OS Query Logs for Indicators\n\nDeploy XSOAR Playbook - Phishing Investigation - Generic V2\n\nDeploy XSOAR Playbook - Endpoint Malware Investigation\n\nCortex XDR Configure Host\nFirewall Profile\n\nEnable Anti-Exploit Protection\n\nEnable Anti-Malware Protection\n\nLook for the following BIOCs alerts to detect activity*:\nCortex XDR Analytics - Possible LSASS memory dump\n\nCortex XDR Analytics - Unsigned process executed as a\nscheduled task\n\nCortex XDR Analytics - Connection to a TOR anonymization proxy\n\nCortex XDR Analytics - Dumping Registry hives with passwords\n\n**Discovery**\n\n**File and Directory Discovery [T1083], Process Discovery**\n\n**[T1057]**\n\n\n-----\n\nCortex XDR Look for the following\nBIOCs alerts to\ndetect activity*:\nCortex XDR\nAnalytics - Multiple\nDiscovery\nCommands\n\n**Impact**\n\n**Service Stop [T1489], Inhibit System Recovery [T1490], Data**\n**Encrypted for Impact [T1486]**\n\nCortex XDR Look for the following\nBIOCs alerts to\ndetect activity*:\nManipulation of\nVolume Shadow\nCopy configuration\n\nCortex XSOAR Deploy XSOAR\nPlaybook Ransomware Manual\n\n_Table 1. Courses of Action for Darkside ransomware._\n_†These capabilities are part of the NGFW security subscriptions service._\n\n_* These analytic detectors will trigger automatically for Cortex XDR Pro customers._\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-12 - DarkSide Ransomware Gang- An Overview.pdf"
    ],
    "report_names": [
        "2021-05-12 - DarkSide Ransomware Gang- An Overview.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535713,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653686790,
    "ts_modification_date": 1653686790,
    "files": {
        "pdf": "https://archive.orkl.eu/2cb04fde63e0bbd99598c816b1e37d80bec04ab3.pdf",
        "text": "https://archive.orkl.eu/2cb04fde63e0bbd99598c816b1e37d80bec04ab3.txt",
        "img": "https://archive.orkl.eu/2cb04fde63e0bbd99598c816b1e37d80bec04ab3.jpg"
    }
}