{
    "id": "345a3b1b-aa19-485a-a936-dcfa3425b9a1",
    "created_at": "2023-01-12T15:06:51.139854Z",
    "updated_at": "2025-03-27T02:16:20.840396Z",
    "deleted_at": null,
    "sha1_hash": "f6d5ac606fd645bad4cc4ea5934b9d20f4c0badf",
    "title": "2017-05-03 - Kazuar- Multiplatform Espionage Backdoor with API Access",
    "authors": "",
    "file_creation_date": "2022-05-28T15:11:56Z",
    "file_modification_date": "2022-05-28T15:11:56Z",
    "file_size": 3433726,
    "plain_text": "# Kazuar: Multiplatform Espionage Backdoor with API Access\n\n**[unit42.paloaltonetworks.com/unit42-kazuar-multiplatform-espionage-backdoor-api-access/](https://unit42.paloaltonetworks.com/unit42-kazuar-multiplatform-espionage-backdoor-api-access/)**\n\nBrandon Levene, Robert Falcone, Tyler Halfpop May 3, 2017\n\nBy [Brandon Levene,](https://unit42.paloaltonetworks.com/author/brandon-levene/) [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Tyler Halfpop](https://unit42.paloaltonetworks.com/author/tyler-halfpop/)\n\nMay 3, 2017 at 2:08 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [.NET Framework,](https://unit42.paloaltonetworks.com/tag/net-framework/) [Carbon,](https://unit42.paloaltonetworks.com/tag/carbon/) [ConfuserEx,](https://unit42.paloaltonetworks.com/tag/confuserex/) [Kazuar,](https://unit42.paloaltonetworks.com/tag/kazuar/) [Snake,](https://unit42.paloaltonetworks.com/tag/snake/) [Trojans,](https://unit42.paloaltonetworks.com/tag/trojans/) [Turla,](https://unit42.paloaltonetworks.com/tag/turla/) [Uroburos](https://unit42.paloaltonetworks.com/tag/uroburos/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-kazuar-multiplatform-espionage-backdoor-api-access/)\n\nUnit 42 researchers have uncovered a backdoor Trojan used in an espionage campaign. The developers refer to this tool by the name Kazuar,\nwhich is a Trojan written using the Microsoft .NET Framework that offers actors complete access to compromised systems targeted by its\noperator. Kazuar includes a highly functional command set, which includes the ability to remotely load additional plugins to increase the\nTrojan’s capabilities. During our analysis of this malware we uncovered interesting code paths and other artifacts that may indicate a Mac or\nUnix variant of this same tool also exists. Also, we discovered a unique feature within Kazuar: it exposes its capabilities through an Application\nProgramming Interface (API) to a built-in webserver.\n\n[We suspect the Kazuar tool may be linked to the Turla threat actor group (also known as Uroburos and Snake), who have been reported to](https://blog.gdatasoftware.com/2014/02/23968-uroburos-highly-complex-espionage-software-with-russian-roots)\nhave compromised embassies, defense contractors, educational institutions, and research organizations across the globe. A hallmark of Turla\n[operations is iterations of their tools and code lineage in Kazuar can be traced back to at least 2005. If the hypothesis is correct and the Turla](https://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/waterbug-attack-group.pdf)\nthreat group is using Kazuar, we believe they may be using it as a replacement for Carbon and its derivatives. Of the myriad of tools observed\nin use by Turla Carbon and its variants were typically deployed as a second stage backdoor within targeted environments and we believe\nKazuar may now hold a similar role for Turla operations.\n\n## The Kazuar Malware\n\n[Kazuar is a fully featured backdoor written using the .NET Framework and obfuscated using the open source packer called ConfuserEx. We](https://yck1509.github.io/ConfuserEx/)\n[used a combination of tools such as NoFuserEx, ConfuserEx Fixer, ConfuserEx Switch Killer, and](https://github.com/CodeShark-Dev/NoFuserEx) [de4d0t in order to deobfuscate the code for](https://github.com/0xd4d/de4dot)\n[in depth analysis. We then used dnSpy to export the code to a Microsoft Visual Studio project, so that we could rename the random method](https://github.com/0xd4d/dnSpy)\nnames to better understand the flow of the code. We will describe how Kazuar works and what capabilities it offers threat actors.\n\n## Initialization\n\nThe malware initializes by gathering system and malware filename information and creates a mutex to make sure only one instance of the\nTrojan executes on the system at a time. Kazuar generates its mutex by using a process that begins with obtaining the MD5 hash of a string\n“[username]=>singleton-instance-mutex”. The Trojan then encrypts this MD5 hash using an XOR algorithm and the serial number of the\nstorage volume. Kazuar uses the resulting ciphertext to generate a GUID that it appends to the string “Global\\\\” to create the mutex.\n\nAn interesting artifact that we found within the mutex creation process is that if the code cannot obtain the system’s storage serial number, it\nwill use a static integer of 16456730 as a key to encrypt the MD5 hash. The hexadecimal representation of 16456730 is 0xFB1C1A, which\nappears to be included by the malware author as a potential reference to the United States’ FBI and CIA organizations.\n\nThe Trojan then creates a set of folders on the system to store various files created during its execution. Kazuar creates its folders using group\nnames, which logically organize the files contained within the folder. Table 1 shows the folder layout:\n\n**Folder Group** **Files Description**\n\n\n-----\n\nbase Parent folder that contains the following folder groups below\n\nsys Files that Kazuar uses for configuration settings, such as the ‘serv’ item that stores the C2 server locations\n\nlog Files contain debug messages\n\nplg Files are plugins used to extend the functionality of Kazuar\n\ntsk Files that Kazuar will process as commands and their arguments\n\nres Files contain the results of the successfully processed tasks\n\n_Table 1 Kazuar's folder group names and the files stored within_\n\nThe Trojan uses a similar process to create these folder and file names as it uses to generate its mutex, generating an MD5 hash of the name,\nusing XOR on each byte using the volume serial number as a key and generating a GUID based on the ciphertext. The resulting GUIDs are\nused as file and folder names, which are combined with the local system path to the %LOCALAPPDATA% folder to create Kazuar’s folders.\n\nThroughout its code, Kazuar verbosely logs its activities by writing debug messages to log files stored within the “log” folder. Kazuar encrypts\n[the debug messages saved in these log files using the Rijndael cipher. We decrypted the initial entry that was added to the log files during the](https://en.wikipedia.org/wiki/Advanced_Encryption_Standard)\nexecution of the Trojan. This entry reveals the following information:\n\n1 malware_file_name[2720]: Kazuar's entry point started in process malware_file_name [2720] as user USERNAME\n\nThe log message above shows that the malware author refers to the Trojan as “Kazuar”. Interestingly, the word “Kazuar” appears in several\nlanguages, such as Polish, Hungarian and Slovenian, and is the ASCII form of the Russian word “казуар”. The word “Kazuar” and казуар\ntranslates to [Cassowary, which is a large flightless bird native to New Guinea and Australia as shown in Figure 1.](https://en.wikipedia.org/wiki/Cassowary)\n\n_Figure 1 Cassowary (Source; Wikicommons)_\n\nAfter initial setup, the method at the main entry point of the malware, as seen in Figure 2 may follow one of four main paths of execution. The\nmain entry point contains a relatively simple set of if statements that determine the execution path of the malware. Interestingly, one of the\npaths appears to be for execution on a Mac or Unix host\n\n\n-----\n\n_Figure 2. Main entry point shows if statements that control the flow of execution_\n\nThe four possible paths of execution taken by Kazuar’s main entry point are as follows:\n\n1. If the malware was executed with the \"install\" command-line argument, which uses .NET Framwork’s InstallHelper method to install the\n\nmalware as a service.\n2. If the malware is started in a non-user interactive environment (no user interface), the malware installs itself as a service.\n\n\n-----\n\n3 o a gu e ts a e p o ded a d t e a a e dete es t s u g a do s e o e t, t sa es a to t e syste t at t\ninjects into the explorer.exe process. The injected DLL executable loads the malware’s executable and runs it within memory of the\nexplorer.exe process.\n4. If the malware was executed with the “single” command-line argument or the malware determines its running in a Mac or Unix\n\nenvironment, it runs the method containing Kazuar’s functional code and will limit certain Windows specific functionality if a Mac or Unix\nenvironment is detected.\n\nThe flow of execution is carefully guided by its operating environment, which is determined using the .NET Framework\nEnvironment.OSVersion.Platform.PlatformID enumeration, as seen in the function in Figure 3 that is responsible for gathering system specific\ninformation. Interestingly, we see a specific boolean variable for a PlatformID value of Unix that suggests that Kazuar might be used against\nMac or Unix targets that return True for that API.\n\n_Figure 3. The getsysinfo() function provides various environment enumeration capabilities for Kazuar._\n\nAfter enumerating the operating environment, Kazuar will attempt to establish persistent access to the system. Kazuar uses the method\ndisplayed in Figure 4 within its Autorun class to set up persistence on Windows systems, which has multiple options including:\n\n1. Adding a shortcut (lnk file) to the Windows startup folder\n2. Adding a sub-key to the following paths in the current user (HKCU) hive:\n\nSOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\nSOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nSOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nSOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell\nSOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\load\n\n\n-----\n\n_Figure 4. Kazuar’s Autorun class is a Windows specific method that contains multiple options for persistence using the startup folder and_\n_registry._\n\n## Command and Control (C2)\n\n\n-----\n\ne a ua oja t a y e es o ts co a d a d co t o c a e to a o acto s to te act t t e co p o sed syste a d to e t ate\ndata. Kazuar has the capabilities to use multiple protocols, such as HTTP, HTTPS, FTP or FTPS, determined by the prefixes of the hardcoded\nC2 URLs. So far, we have only observed HTTP used as the C2 protocol in our sample set. All of the known Kazuar C2 servers appear to be\ncompromised WordPress blogs, suggesting that the threat group using Kazuar in attacks also locates and exploits vulnerable WordPress sites\nas part of their playbook.\n\nTo interact with its C2 server, Kazuar begins its communication by creating an HTTP GET request to use as a beacon. The beacon, generated\nby the code seen in Figure 5 contains a cookie that has an “AuthToken” value that is a base64 encoded GUID used to uniquely identify the\ncompromised system. Kazuar refers to this GUID as an “agent” identifier.\n\n_Figure 5. The createGET and getWebRequest classes define the construction of the HTTP request used for command and control_\n_communication._\n\nDuring our analysis, we observed the beacon seen in Figure 6 sent via HTTP from a Kazuar sample to its C2 server. The initial HTTP beacon\nshows the base64 encoded AuthToken value within the Cookie field that we believe the C2 server uses to uniquely identify and track individual\ncompromised hosts.\n\n\n-----\n\n_Figure 6. Wireshark snippet of a fully constructed HTTP GET request which shows the base64 encoded GUID within the Cookie header._\n\nKazuar will read the response from the C2 server and attempt to parse the response as XML formatted data. The XML formatted data will\ncontain what Kazuar refers to as a “task”, which is comprised of an action identifier and specific arguments for each action. Figure 7 below\nshows the code responsible for receiving the response to the HTTP request and using a long integer stored in the “num” variable as the action\nidentifier.\n\n_Figure 7. The response parser listens for new tasks to be received from the command and control server._\n\nThe action identifier is directly related to the command which the actor wishes to run on the compromised system. Surprisingly, Kazuar also\ncontains methods for each command to equate the action identifier to a string that describes the command, which makes determining the\npurpose of each command much easier. Table 2 shows a list of available commands within Kazuar, specifically each action identifier,\ncommand string and a description.\n\n\n**Action**\n**ID**\n\n\n**Commands** **Description**\n\n\n-----\n\n**1** log Logs a specified debug message\n\n**2** get Upload files from a specified directory. It appears the actor can specify which files to upload based on their modified,\naccessed and created timestamps as well.\n\n**3** put Writes provided data (referred to as ‘payload’) to a specified file on the system.\n\n**4** cmd Executes a specified command and writes the output to a temporary file. The temporary file is uploaded to the C2\nserver\n\n**5** sleep Trojan sleeps for a specified time\n\n**6** upgrade Upgrades the Trojan by changing the current executable’s file extension to “.old” and writing a newly provided\nexecutable in its place\n\n**7** scrshot Takes a screenshot of the entire visible screen. The screenshot is saved to a specified filename or using a filename\nwith the following format: [year]-[month]-[day]-[hour]-[minute]-[second]-[milisecond].jpg. The file is uploaded to the\nC2 server\n\n**8** camshot Creates a Window called “WebCapt” to capture an image from an attached webcam, which it copies to the clipboard\nand writes to a specified file or a file following the same format from the “scrshot” command. The file is uploaded to\nthe C2 server\n\n**9** uuid Sets the unique agent identifier by providing a specific GUID\n\n**10** interval Sets the transport intervals, specifically the minimum and maximum time intervals between C2 communications.\n\n**11** server Sets the C2 servers by providing a list of URLs\n\n**12** transport Sets the transport processes by providing a list of processes that Kazuar will inject its code and execute within.\n\n**13** autorun Sets the autorun type as discussed earlier in this blog. Kazuar will accept the following strings for this command:\nDISABLED, WINLOGON, POLICIES, HKCURUN, RUNONCE, LOADKEY, STARTUP\n\n**14** remote Sets a remote type. We are only aware of one remote type that instructs Kazuar to act as an HTTP server and allow\nthe threat actor to interact with the compromised system via inbound HTTP requests.\n\n**15** info Gathers system information, specifically information referred to as: Agent information, System information, User\ninformation, Local groups and members, Installed software, Special folders, Environment variables, Network\nadapters, Active network connections, Logical drives, Running processes and Opened windows\n\n**16** copy Copies a specified file to a specified location. Also allows the C2 to supply a flag to overwrite the destination file if it\nalready exists.\n\n**17** move Moves a specified file to a specified location. Also allows the C2 to supply a flag to delete the destination file if it\nexists.\n\n**18** remove Deletes a specified file. Allows the C2 to supply a flag to securely delete a file by overwriting the file with random\ndata before deleting the file.\n\n**19** finddir Find a specified directory and list its files, including the created and modified timestamps, the size and file path for\neach of the files within the directory.\n\n**20** kill Kills a process by name or by process identifier (PID)\n\n**21** tasklisk List running processes. Uses a WMI query of “select * from Win32_Process” for a Windows system, but can also\nrunning “ps -eo comm,pid,ppid,user,start,tty,args” to obtain running processes from a Unix system.\n\n**22** suicide We believe this command is meant to uninstall the Trojan, but it is not currently implemented in the known samples.\n\n**23** plugin Installing plugin by loading a provided Assembly, saving it to a file whose name is the MD5 hash of the Assembly’s\nname and calling a method called “Start”.\n\n**24** plugout Removes a plugin based on the Assembly’s name.\n\n**25** pluglist Gets a list of plugins and if they are “working” or “stopped”\n\n**26** run Runs a specified executable with supplied arguments and saves its output to a temporary file. The temporary file is\nup loaded to the C2 server.\n\n_Table 2 Kazuar's command handler, including action identifier, command string and description_\n\n## Capabilities\n\nAs can be seen from the Table 2 above, Kazuar has an extensive command set, many of which are similar in functionality as other backdoor\nTrojans. However, a few commands specific to Kazuar appear to be unique and are worth further discussion.\n\n\n-----\n\nst, se e a o t ese co a ds co ta c ec s to dete e t e e o e t o de to use app op ate pat s o co a ds e tas st\ncommand will use a WMI query or the “ps” command, which allows Kazuar to obtain running processes from both Windows and Unix systems.\nAlso, Kazuar’s ‘cmd’ command will run commands using “cmd.exe” for Windows systems and “/bin/bash” for Unix systems. These two\ncommands provide evidence that the authors of Kazuar intended to use this malware as a cross-platform tool to target both Windows and Unix\nsystems.\n\nKazuar contains three commands related to plugins: plugin, plugout and pluglist. These three commands allow an actor to administer a\nframework that allows Kazuar to use additional plugins. This plugin framework provides Kazuar potentially endless functionality, as its\noperators can provide additional .NET applications that Kazuar can load and execute.\n\n## Kazuar’s Remote API\n\nWhile many backdoor Trojans have extensive command handlers and plugin frameworks, Kazuar’s ‘remote’ command provides a functionality\nthat is rarely seen in backdoors used in espionage campaigns. This command instructs the Trojan to start a thread to listen for inbound HTTP\nrequests, which effectively turns Kazuar into a webserver. This functionality provides an API for the Trojan to run commands on the\ncompromised system. Figure 8 shows the code within Kazuar that provides this functionality.\n\n_Figure 8 HTTP method handler used by Kazuar to provide threat actors with API access_\n\nTo initiate this functionality, the actor will issue the 'remote’ command and provide a list of URI prefixes that Kazuar's HTTP listener will process\nand respond to. The URI prefix supplied by the actor would be added to the “Prefixes” property of the HttpListener class, which requires a\nschema, a host, an optional port and optional path. The actor would then issue HTTP requests to URLs that match these URI prefixes using\nspecific methods, specifically OPTIONS, POST, GET and PUT methods to interact with the compromised system using Kazuar’s command set\nseen in Table 3.\n\nThis functionality flips the communication flow between the Trojan and the C2 server. Instead of the Trojan initiating communications with its\nC2 server, the C2 server sends requests directly to the Trojan. This communications flow is important if the compromised system is a remotely\naccessible server that may raise flags when initiating outbound requests. Also, by creating this type of API access, the threat actors could use\none accessible server as a single point to dump data to and exfiltrate data from.\n\n\n**HTTP**\n**Method**\n\n\n**Description of Functionality**\n\n\n-----\n\nOPTIONS No functionality, just responds with an HTTP “OK” status\n\nPOST Actor provides XML formatted data that Kazuar will use to create a new task. Uses the exact same method (‘readResponse0’\nseen in Figure 7) to parse the XML data obtained in the initial C2 communications channel discussed earlier. Kazuar writes the\nresults of the task to a log file that it references as “res” within a folder referenced as “tsk”.\n\nGET Provides the contents of the results of the previous task created via the HTTP POST request that is stored in the “res” file.\n\nPUT Actor provides XML formatted data that Kazuar will use to create a new task. This method is similar to the POST method,\nhowever, instead of saving the results of the command to a “res” file it responds to the HTTP PUT request with the results of the\ncommand.\n\n_Table 3 HTTP methods and the functionality they provide in Kazuar's API_\n\nThis functionality flips the communication flow between the Trojan and the C2 server. Instead of the Trojan initiating communications with its\nC2 server, the C2 server sends requests directly to the Trojan. This communications flow is important if the compromised system is a remotely\naccessible server that may raise flags when initiating outbound requests. Also, by creating this type of API access, the threat actors could use\none accessible server as a single point to dump data to and exfiltrate data from.\n\n## Conclusion\n\nWhile yet another fully featured backdoor alone is not particularly novel, the existence of a code path for Unix, combined with the portability of\n.NET Framework code makes the Kazuar Trojan an interesting tool to keep an eye on. Another interesting portion of this malware is its remote\nAPI that allows actors to issue commands to the compromised system via inbound HTTP requests. Based on our analysis, we believe that\nthreat actors may compile Windows and Unix based payloads using the same code to deploy Kazuar against both platforms. Palo Alto\nNetworks AutoFocus subscribers can explore additional samples using the Kazuar AutoFocus tag.\n\n## Related Indicators and Identifying Information\n\n**Hashes**\n\n8490daab736aa638b500b27c962a8250bbb8615ae1c68ef77494875ac9d2ada2\n\nb51105c56d1bf8f98b7e924aa5caded8322d037745a128781fa0bc23841d1e70\n\nbf6f30673cf771d52d589865675a293dc5c3668a956d0c2fc0d9403424d429b2\n\ncd4c2e85213c96f79ddda564242efec3b970eded8c59f1f6f4d9a420eb8f1858\n\n**URLs**\n\nhttp://gaismustudija[.]lv/wp-includes/pomo/kontakti.php\n\nhttp://hcdh-tunisie[.]org/wp-includes/SimplePie/gzencode.php\n\nhttp://www.gallen[.]fi/wp-content/gallery/\n\n**File Activity**\n\n%LOCALAPPDATA%\\/[a-f0-9]{32}\\/[a-f0-9]{32}\\.dll\n\n%LOCALAPPDATA%\\/[a-f0-9]{32}\\/[a-f0-9]{32}/\n\n%USERPROFILE%\\Start Menu\\Programs\\Startup\\*.lnk\n\n**RSA Keys**\n\n<RSAKeyValue>\n<Modulus>gSI+OxtBrfXVfSRRSlNIMVYr9HFy40jokIDkUqffhU7Y/VcFB1nc8GwT4GOjK6lR/mJi3XcGg+nxqR9iLoeoOLgBFFz9O1l++81tPtRaVZ8yg\n</Modulus><Exponent>EQ==</Exponent>\n<P>hGjs2pEZW4pN2b0Bm9xl84zxqQ2BMSflj2xpf5MH+XvCY5BBN3YROm24LYtGwy3xOdKeUJOENvYbkvirBcm2ecRxmLgE5AMMeWxZpOayU\n</P>\n<Q>+ap/8gRvidWrAhZcAiCAYdFZIt6hSwBz5ohU5ZSPomv9e/Urtts8cin+QeBvDwF6UvyP1vz3wxUOXycaBI3StCMjCXHuBLN+wfpEhfdt6KKywsmW\n</Q>\n<DP>D5PfoT4/N/InRsrxIWU5K7Y6jFvxFNeEaznuSz55aKUl7ZiAJKR6f1gzyR9xvJv+Qwm4RbcAfu/HAjtfahe7HWJnt50twHjUSoU3uQwU+q964O0w\n</DP>\n<DQ>vuvLQJn68O6v8omRp0YH0lTLsUDVsdMrdA3mkXGbA7v+E38/i9TT3tTRfaugOKbG9CqMHN+QSeLs31oi9Gxz8yntnc+X5XozwYMlV2Lbk8e\n</DQ>\n<InverseQ>cfVixwsMog8F8CDikcYKNmUGNJPeJ4grdJi4ZIMX5mSuhdvSccTnx7JoCMJ2LKwFLyMnmZIIeYF4EYBgwHz6rumL8Zam6Zr04uIpxWL\n\n\n-----\n\n/ e seQ\n<D>PMTR/bJ5Qs4KHMXL5r3Hnr8jvlOBW+YTFtM+RQO0evftpGUviv0crWAJWok9ujGP/z1bs4NOXDHbImkfJPSLZfw8vknglGZZ3+gzaNxmvuGBL\n</D></RSAKeyValue>\n\n<RSAKeyValue>\n<Modulus>m4SbvlZhH5UzcgDLIEIygjTCCQMxc/TrwUYZ5JA5SU2jtSBt9aqwljKJ7h4Tv5eP2Efy4Z+2QajDNtOThift4nVTWsl+iOoMKKV6pvQOFj6k\n</Modulus><Exponent>EQ==</Exponent></RSAKeyValue>\n\n**Decrypted Log and Error Messages**\n\n'{0}' autorun algorithm is not supported!\n\n'{0}' request method isn't supported.\n\nAccessed date mismatch in get command!\n\nAccessed date mismatch in list command!\n\nAction with identifier {0} is not implemented.\n\nAutorun command requeres autorun type to be set!\n\nAutorun failed due to {0}\n\nCmd command requires actual commands list!\n\nCommiting suicide...\n\nControl server address '{0}' is invalid.\n\nCopy command requires destination path!\n\nCopy command requires source path!\n\nCopying file from {0} to {1}...\n\nCreated date mismatch in get command!\n\nCreated date mismatch in list command!\n\nDirectory listing for {0}\n\nExecuting command with {0}...\n\nFailed to create agent due to {0}\n\nFailed to create channel due to {0}\n\nFailed to create injector due to {0}\n\nFatal failure due to {0}\n\nGetting file query {0}...\n\nGetting system information...\n\nGoing to sleep for {0}...\n\nGot '{0}' command from {1}.\n\nGot new '{0}' command.\n\nGot new task #{0} from {1}.\n\nHTTP listening isn't supported.\n\nIPC channel is not ready.\n\nInjected into explorer.\n\nInjected into {0} [{1}].\n\nInjecting into explorer...\n\n\n-----\n\nject g to {0} [{ }]\n\nInjection failed due to {0}\n\nInstalling plugin...\n\nInvalid FTP server status ({0}).\n\nInvalid last contact time.\n\nInvalid or unknown action format ({0})!\n\nInvalid sender interval.\n\nKazuar's {0} started in process {1} [{2}] as user {3}/{4}.\n\nKilling processes...\n\nList command requires file query string!\n\nListening\n\nListing plugins...\n\nListing processes...\n\nMax interval value is less than min value!\n\nMax interval value is more than supported!\n\nMin interval value is less than supported!\n\nModified date mismatch in get command!\n\nModified date mismatch in list command!\n\nMove command requires destination path!\n\nMove command requires source path!\n\nMoving file from {0} to {1}...\n\nMozilla/5.0 (Windows NT {0}.{1}; rv:22.0) Gecko/20130405 Firefox/23.0\n\nMozilla/5.0 (X11; {0} {1}; rv:24.0) Gecko/20100101 Firefox/24.0\n\nNew plugin {0} was installed.\n\nNo servers available now.\n\nPlugin command requires payload!\n\nPlugin installed.\n\nPlugin removed.\n\nPlugin {0} was removed.\n\nPlugin {0} was started.\n\nPlugout command requires plugin name string!\n\nProc kill command requires name or pid to be set!\n\nProcess {0} [{1}] exited with {2} code.\n\nProcess {0} [{1}] impersonated.\n\nPut command requires correct file path!\n\nPut command requires payload!\n\nPutting file to {0}...\n\n\n-----\n\ne ote co t o a ed due to {0}\n\nRemote failed due to {0}\n\nRemote iteration failed due to {0}\n\nRemote request from {0} failed due to {1}\n\nRemove command requires file path!\n\nRemoving file {0}...\n\nRemoving plugin...\n\nRequest was sent to {0}.\n\nResult #{0} was sent to {1}.\n\nResult #{0} was taken by {1}.\n\nRun command requires executable path!\n\nRun-time error {0}:{1:X8}.\n\nRun-time error {0}:{1}.\n\nScheme '{0}' is not supported!\n\nSearching file query {0}...\n\nSend iteration failed due to {0}\n\nSending request to {0}...\n\nSending result #{0} to {1}...\n\nServer command requires at least one server!\n\nSetting agent id to {0}...\n\nSetting autorun type to {0}...\n\nSetting remote type to {0}...\n\nSetting transport interval to [{0} - {1}]...\n\nSetting transport processes:\n\nSetting transport servers:\n\nShellcode error {0:X16}.\n\nSleep interval is longer than supported!\n\nSolving task #{0}...\n\nStartup path is empty.\n\nTaking screen shot...\n\nTaking webcam shot...\n\nTask #{0} execution finished.\n\nTask #{0} execution started:\n\nTask #{0} failed due to {1}\n\nTask #{0} solved.\n\nTransport command requires at least one process name!\n\nTransport process name '{0}' is invalid.\n\n\n-----\n\na spo t p ocesses\n\nUnable to create capture window.\n\nUnable to delete task #{0} file due to {1}\n\nUnable to execute command due to {0}\n\nUnable to execute task #{0} due to {1}\n\nUnable to get last contact time due to {0}\n\nUnable to get task from {0} due to {1}\n\nUnable to impersonate {0} [{1}] due to {2}\n\nUnable to return logs due to {0}\n\nUnable to send result #{0} to {1} due to {2}\n\nUnable to start plugin {0} due to {1}\n\nUnable to stop plugin {0} due to {1}\n\nUnable to store agent id due to {0}\n\nUnable to store autorun type due to {0}\n\nUnable to store interval due to {0}\n\nUnable to store remote type due to {0}\n\nUnable to store servers due to {0}\n\nUnable to store transports due to {0}\n\nUnhandled exception {0}\n\nUpgrade command requires payload!\n\nUpgrading agent...\n\nUsing default agent id due to {0}\n\nUsing default autorun type due to {0}\n\nUsing default interval due to {0}\n\nUsing default remote type due to {0}\n\nUsing default servers due to {0}\n\nUsing default transports due to {0}\n\nUuid command requires identifier!\n\nWaiting for shellcode failed.\n\nWaiting for window '{0}' failed.\n\nexplorer.exe, {0}\n\nERROR: {0}\n\nPlugin {0}\n\n{0} doesn't exist!\n\n{0} was skipped.\n\nproc - {0} [{1}]\n\ntime - {0}\n\n\n-----\n\nuse {0}/{ } ({ })\n\n**[Register for Ignite ’17 Security Conference](http://go.paloaltonetworks.com/ignite2017)**\n_Vancouver, BC June 12–15, 2017_\n\nIgnite ’17 Security Conference is a live, four-day conference designed for today’s security professionals. Hear from innovators and experts,\ngain real-world skills through hands-on sessions and interactive workshops, and find out how breach prevention is changing the security\nindustry. Visit the [Ignite website for more information on tracks, workshops and marquee sessions.](http://www.paloaltonetworksignite.com/)\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-03 - Kazuar- Multiplatform Espionage Backdoor with API Access.pdf"
    ],
    "report_names": [
        "2017-05-03 - Kazuar- Multiplatform Espionage Backdoor with API Access.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536011,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653750716,
    "ts_modification_date": 1653750716,
    "files": {
        "pdf": "https://archive.orkl.eu/f6d5ac606fd645bad4cc4ea5934b9d20f4c0badf.pdf",
        "text": "https://archive.orkl.eu/f6d5ac606fd645bad4cc4ea5934b9d20f4c0badf.txt",
        "img": "https://archive.orkl.eu/f6d5ac606fd645bad4cc4ea5934b9d20f4c0badf.jpg"
    }
}