{
    "id": "34611ad7-858f-45b3-9774-476ad7ccf92f",
    "created_at": "2023-01-12T15:04:34.438984Z",
    "updated_at": "2025-03-27T02:09:29.773335Z",
    "deleted_at": null,
    "sha1_hash": "0cc444d683150b58fbb59c277f9b8331898c11b3",
    "title": "2019-01-29 - Phobos Ransomware, A Combo of CrySiS and Dharma",
    "authors": "",
    "file_creation_date": "2022-05-27T22:59:38Z",
    "file_modification_date": "2022-05-27T22:59:38Z",
    "file_size": 411200,
    "plain_text": "# Phobos Ransomware, A Combo of CrySiS and Dharma\n\n**[coveware.com/blog/phobos-ransomware-distributed-dharma-crew](https://www.coveware.com/blog/phobos-ransomware-distributed-dharma-crew)**\n\nJanuary 18, 2019\n\n**_Updated 01/29/2019_**\n\n_We are researching the possibility that the primary distribution group behind Phobos may_\n_[have been disrupted by the recent xDedic takedown. At approximately the same time that](https://www.coveware.com/blog/xdedic-marketplace-rdp-credentials-ransomware-attacks-taken-down)_\n_xDedic was taken down, all known email addresses associated with Phobos attacks became_\n_disabled and inbound emails bounced. We are unsure at this time if the ransomware_\n_distributors themselves disabled their accounts, or if their email hosting provider disabled the_\n_accounts as part of the law enforcement action. We will further update this post as we learn_\n_more._\n\n**_Original Phobos Post below:_**\n\nA new strain of ransomware has been impacting businesses globally since mid December.\n[The ransomware, dubbed Phobos by the distributors (possibly after the greek god of fear),](https://en.wikipedia.org/wiki/Phobos_(mythology))\n[shares both technical and operational similarities to several recent Dharma variants. The](https://www.coveware.com/blog/2018/11/26/why-new-dharma-ransomware-is-more-dangerous-than-ever)\nattack vectors being leveraged by Phobos distributors are well worn, open or weakly secured\nRDP ports. As usual, the attacks are exacerbated when companies either have no backups,\nor have not properly partitioned them from the network with strong administrative controls.\n\n## Rebranded Dharma Ransom Note and Same Encrypted File Extension Format\n\nMost ransomware leaves behind an obvious ransom note so that the victim can find it and\ncontact the hacker. Typically, these notes vary significantly depending upon the ransomware\nstrain. However, both [Dharma and](https://www.coveware.com/blog/remove-dharma-ransomware) [Phobos use the same ransom note. The only observable](https://www.coveware.com/phobos-ransomware-payment)\ndifference is that Phobos added a bit of branding to the top and bottom as seen in the below\nimage.\n\n\n-----\n\nPhobos Ransomware Note is similar to a Dharma Note\n\nOther than that, the text and composition is identical. The encrypted file name format is also\nthe same as Dharma variants. It is constructed by concatenating the original file name, a\nunique ID number, hacker email, and the .phobos file extension.\n\n## Emails Offer Security Advice when Paying for Decryption Keys\n\n[When a victim of ransomware contacts the email address in the ransom notice to negotiate,](https://www.csoonline.com/article/3313330/ransomware/7-best-practices-for-negotiating-ransomware-payments.html?upd=1539870159312)\nthe first response elicited is often a cut and paste standard response. The first response from\nPhobos is a verbatim match to first responses of several Dharma variants including .bip,\n.gamma, and .adobe. This group’s first responses are unique in that they offer a friendly\n‘upsell’, in addition to extorting the victim for safe decryption of data.\n\n### “we also offer service to you. full of advice for protecting against attacks? - the price of 0.1 BTC, and remember our work is very hard. and it requires a lot of time and costs.”\n\nThe above phrase is at the end of the first response email, and offers security advice for the\nlow low price of 0.1 BTC. This phrase has been consistent across Dharma variants and\nPhobos. To our knowledge, no one has taken them up on this generous offer.\n\n\n-----\n\n## Technically, Phobos Ransomware is only Slightly Different from Dharma\n\nTopically, Phobos appears to a largely cut+paste variant of Dharma.. However, from a\ntechnical perspective, Phobos carries some subtle differences from active Dharma variants.\n[Both type of ransomware draw their lines from the CySis ransomware family and commonly](https://www.mcafee.com/enterprise/en-us/threat-center/threat-landscape-dashboard/ransomware-details.crysis-ransomware.html)\nused AV software will identify a Phobos executable sample as CrySis. The differences\n[observed in a recent analysis by](https://www.bleepingcomputer.com/forums/t/688649/phobos-ransomware-help-topic-phobos-phoboshta/page-2) [@Demonslay335 note that the file marker structure of](https://twitter.com/demonslay335?lang=en)\nPhobos is significantly different from Dharma variants. What is clear is that while the\nransomware type may be different, the group distributing Phobos, the exploit methods,\nransom notes and communications remain the nearly identical to Dharma.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-29 - Phobos Ransomware, A Combo of CrySiS and Dharma.pdf"
    ],
    "report_names": [
        "2019-01-29 - Phobos Ransomware, A Combo of CrySiS and Dharma.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535874,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653692378,
    "ts_modification_date": 1653692378,
    "files": {
        "pdf": "https://archive.orkl.eu/0cc444d683150b58fbb59c277f9b8331898c11b3.pdf",
        "text": "https://archive.orkl.eu/0cc444d683150b58fbb59c277f9b8331898c11b3.txt",
        "img": "https://archive.orkl.eu/0cc444d683150b58fbb59c277f9b8331898c11b3.jpg"
    }
}