{
    "id": "34715a56-e1fb-48d5-b278-1b0c8aba1758",
    "created_at": "2023-01-12T15:00:30.782915Z",
    "updated_at": "2025-03-27T02:12:03.979635Z",
    "deleted_at": null,
    "sha1_hash": "206f16726ef7e10e3a37ef8c41ba7951f93bec43",
    "title": "2021-03-29 - The Unseen One- Hades Ransomware Gang or Hafnium",
    "authors": "",
    "file_creation_date": "2022-05-27T21:30:14Z",
    "file_modification_date": "2022-05-27T21:30:14Z",
    "file_size": 306947,
    "plain_text": "# The Unseen One: Hades Ransomware Gang or Hafnium\n\n**[awakesecurity.com/blog/incident-response-hades-ransomware-gang-or-hafnium/](https://awakesecurity.com/blog/incident-response-hades-ransomware-gang-or-hafnium/)**\n\nMarch 29, 2021\n\n## Threat Intelligence from Hades Incident Response Engagements\n\nWhen you talk about ransomware threat actors, the image that is conjured up is one of\nruthless mercenaries looking to make a quick buck. Unfortunately, much of the security\nindustry operates under this assumption, and perhaps fails to look at broader motives and\n[deeper breaches. Over the past two weeks, we have seen two posts from CrowdStrike and](https://www.crowdstrike.com/blog/hades-ransomware-successor-to-indrik-spiders-wastedlocker/)\n[Accenture respectively documenting the Hades Ransomware Gang. While we agree with](https://www.accenture.com/us-en/blogs/cyber-defense/unknown-threat-group-using-hades-ransomware)\nmany of the technical conclusions in these posts and have observed many of the same tools,\nwe believe there is more to the Hades story. Our incident response engagements with Hades\nand other threat actors has us increasingly convinced that ransom is not the only objective\nfor at least some of these gangs. With that perspective, we are engaging the community to\nshare our analysis. As we encountered the Hades threat actor, they appeared to exhibit a\nnumber of characteristics that were at once unlike other ransomware gangs, almost\namateurish in a sense, while at the same time showing the type of sophistication and\nobfuscation that is more the forte of nation-state based advanced persistent threats (APT).\nOur “spidey sense” certainly went off but given the extremely limited threat intelligence on the\nHades ransomware gang across the community as a whole, it was difficult to paint the full\npicture. However, as our experience with this threat actor has increased, we have been able\nto identify a set of defining characteristics that lead us down the path of challenging the\nconventional wisdom surrounding at least one ransomware gang. Perhaps the other gangs\nhave similar alternate motives that we have not collectively picked out.\n\nIn this post we will break down several aspects we saw during our incident response\nengagements including:\n\nIndustries and Geography\nLeak Sites\n\n\n-----\n\nTactics and Tools\nForensic Practices\nIntelligence Gaps\nDetecting the Techniques\n\nAs you will see below, in responding to this threat actor we uncovered evidence tactics,\ntechniques and procedures that can be attributed to multiple sophisticated adversaries\n[including Hafnium group, the threat actor Microsoft says is behind the recent Exchange](https://en.wikipedia.org/wiki/HAFNIUM_(group))\nServer hack. Based on a forensic timeline we built across multiple engagements, we believe\nthere is significant evidence that points to one of two possibilities:\n\nAn advanced threat actor is operating under the guise of Hades;\nMultiple independent actors just coincidentally compromised the same environment,\npotentially due to weak security practices in general.\n\n## Background\n\nArista’s Awake Labs’ incident response team had the opportunity to help several of the\norganizations impacted by Hades with their incident response needs. Some may already be\n[familiar with the Hades Ransomware attack on Forward Air Trucking Giant Attack in](https://www.bleepingcomputer.com/news/security/trucking-giant-forward-air-hit-by-new-hades-ransomware-gang/)\nDecember 2020, however at the end of 2020 there were several other victims. With such a\nlimited number of publicly disclosed victims of the Hades group, we have a unique\nperspective with data that has not been available to anyone else. As you will see below we\nuncovered evidence of multiple nation-state and ransomware actors tools and techniques,\nwhile at the same time observing behaviors that are uncharacteristic of a sophisticated\nransomware adversary.\n\n## Hafnium and Other Potential Connections to Hades\n\nAs we responded to multiple Hades ransomware attacks over the last few months, the lack\nof logging and forensic data sometimes hampered our ability to identify the initial access\npoint into the network. The one exception being a possible Hafnium compromise. Our team\nwas pulled in after the compromise and encryption to review the situation and in this one\ncase a Hafnium domain was identified as an indicator of compromise within the timeline of\nthe Hades attack. Moreover, this domain was associated with an Exchange server and was\nbeing used for command and control in the days leading up to the encryption event. The\ndomain, p[.]estonine[.]com/p?smb, was identified by a third party forensic firm first engaged\nby the victim. Based on their analysis this domain was first seen in a Hades attack in\nDecember 2020. Clearly at this point the vulnerability in Exchange had not been publicly\ndisclosed but this attack time frame aligns more closely with the DevCore vulnerability\ndiscovery date. This clearly provides evidence of the attack prior to January 2021, which has\nbeen the consensus until now.\n\n\n-----\n\nIn addition to Hafnium and the Hades gang, some victims showed evidence of other threat\nactors. While we were not able to forensically determine the direct connection to the Hades\nattacks, we are providing a summary of these discoveries in case this intelligence is relevant\nto future Hades attacks.\n\n**TimosaraHackerTeam (THT) Tools and Techniques**\n\nRemnants of the TimosaraHackerTerm (THT) ransomware group, named after a town in\nRomania, were identified in one or more environments, a few weeks prior to the Hades\nattack. The THT situation mirrored almost exactly the details in a Sensors Tech Forum\nRemove THT posting from March 2020. Awake Labs also saw the use of BestCrypt as\n[mentioned in a blog post by id-ransomware in June of 2018. In short, we saw the following](https://id-ransomware.blogspot.com/2018/06/tht-ransomware.html)\nactivities.\n\nVSS Admin was used to clear shadow copies of the local machine\nBitlocker or BestCrypt (bcfmgr) was used for encryption on the local machines\nExternal IP connection was made to Romania IP 185[.]225[.]19[.]240\n\nFor the THT IOCs, the IP address mentioned from Romania was observed between October\nand November 2020 with malicious behavior and associated with two new files tracked on\nVirusTotal.\n\nFile MapsBroker.exe\n\nSHA-256:\ned3dc1c727e5de77e3700cd2da699d46e3590dc98f8cabca7a70fd9e6e73977a\n\nOracle.bat\n\nSHA-256: 2fb5766af3d68c210e62518263b2f29ca4c50100c99b6979c3d0e19f05af6a39\n\n[It was also reported with malicious behavior by open intel communities on October 30, 2020](https://otx.alienvault.com/indicator/ip/185.225.19.240)\n(Figure 1).\n\n_Figure 1: TimosaraHackerTeam IOCs_\n\n## Hades Gang: Tactics, Techniques and Procedures\n\n**Industries and Geographies**\n\nOur analysis and intelligence shows that there was relatively a small number of organizations\nthat were hit by the Hades ransomware gang. While there could be more, it is interesting to\nnote that no other victims have been publicly identified in the media or via the known Hades\n\n\n-----\n\nleak methods (more on this below).\n\nThe focus of this gang also appears to be mostly with a few industries. As mentioned above,\na logistics provider has been publicly mentioned as a victim. Our intelligence shows that\nmost of the other organizations have a focus in manufacturing, and more specifically those in\nthe automotive supply chain as well as those with insulation products.\n\nThe locations of the attack were slightly dispersed as each of the companies were global in\ntheir operational footprints. While these organizations were impacted across multiple\ngeographies, we have evidence to suggest that the ransomware attack was focused on the\ngeographies below :\n\nCanada\nGermany\nLuxembourg\nMexico\nUnited States\n\nWhile other ransomware gangs do target specific verticals, they usually run larger campaigns\nwhere the goal is to compromise several organizations with the hope of higher payouts.\nHades’ relatively narrow targeting does stand out as unique comparatively.\n\n**Leak Sites**\n\nAs incident responders know it is common for ransomware actors to set up leak sites for their\ndata, but what was interesting about Hades is that they used methods for both their leaks\nand their drop sites that would likely be taken down within a very short time. There was very\nlittle sophistication in this setup, something that stands apart from other ransomware actors.\nFor example, if you look up @hadesleaks on Twitter today you will see the response “No\nresults for “@hadesleaks”. However, as recently as December 2020 / January 2021, there\nwere a few victims mentioned including the trucking giant (Figure 2). Additionally, we\nobserved that this actor chose multiple different sites for their leaks, with the only consistency\nbeing the Twitter account used to broadcast the message naming the victims.\n\n\n-----\n\n_Figure 2: hadesleaks Twitter_\n\nFor instance, in the first posting on Dec 17, the leak site “hackforums” was used (Figure 3).th\nBut very quickly this site was rendered inaccessible within the forum.\n\n\n-----\n\n_Figure 3: hackforums Dec 17 leak_\n\nEleven days later in their next post, we see the Hades gang use both pastebin and a mirror\nhastebin (Figure 4). Both sites today say “This page is no longer available.” The pastebin\nand the hastebin site were removed.\n\nIn both these sites we see the files hosted on “mega.nz,” a cloud storage provider, which we\nwill provide more context about later.\n\n_Figure 4: Pastebin Hades Leak site_\n\nAs for the Twitter account, Awake Labs and several other organizations requested that it be\nsuspended. On or about January 1, 2021 the account was in fact suspended by Twitter\n(Figure 5) leaving the actor to find other mechanisms to inform the world of its leaks. As of\nthis writing the account continues to be locked out.\n\n_Figure 5: Hadesleaks Twitter Captured on January 2, 2021_\n\nWhen we downloaded and looked at the data from the leak sites and compared it to what our\nincident responders forensically identified as being exfiltrated, it appeared as if the data on\nthe leak sites was not the most consequential data the actor could have leaked. The data\n\n\n-----\n\nchosen for the leak was a very limited set with little repercussions to the victims. Meanwhile\nthe exfiltrated data was very different containing large amounts of data focused on\nmanufacturing processes. The question that therefore arises, what was the objective of\nstealing the crown jewels but disclosing less significant bits of information? Did they hold\nback on publicly sharing the most valuable data because they had alternate means to\nmonetize the proprietary secrets?\n\nWe know the actor requested amounts in the range of $5 to $10 million of ransom and was\nvery slow to respond to some individuals. In some cases, they may not have responded at\n[all. In fact, one Twitter user even claimed “TA never responds.” If there were only a few](https://twitter.com/demonslay335/status/1339324224029274118)\norganizations attacked, why would it take so long to respond to requests for ransom? Was\nthere another potential motive here? Why haven’t we seen Hades since?\n\n**Tactics and Techniques**\n\nOur analysis identified many of the actors’ techniques used during the attack.\n\n**MITRE ATT&CK® Tactic** **Techniques**\n\n\nResource Development\n(TA0042)\n\n\nMalware compilation\n\nObtain Capabilities: Malware – T1588.001\n\n\nExecution (TA0002) Execution of the malware (Ransomware)\n\nMalicious File – T1204.002\n\nWinexe tool for remote execution\n\nSystem Services: Services Execution – T1569.002\n\n\nCredential Access\n(TA0006)\n\n\nUse of service and admin level accounts\n\nValid Accounts – T1078\n\n\nDiscovery (TA0007) GUI navigation of shares and directories\n\nNetwork Share Discovery – T1135\n\nQuery session command qwinsta\n\nRemote System Discovery – T1018\n\n\nLateral Movement\n(TA0008)\n\n\nRemote desktop login\n\nRemote Desktop Protocol – T1021.001\n\nTransfer of malware (Ransomware) via PsExec\n\nLateral Tool Transfer – T1570\n\n\nCollection (TA0009) 7zip and Zip used to compress data prior to exfiltration\n\nArchive Collected Data – T1560\n\nSearch of local file systems and databases\n\nData from network Share Drives – T1039\n\nData from Local System – T1005\n\nArchived files staged for extraction\n\nData Staged: Local Data Staging – T1074.001\n\n\n-----\n\nCommand and Control Hafnium domain\n\nDNS communication – T1071.004\n\nExfiltration (TA0010) Mega.nz Cloud Storage Provider\n\nExfiltration Over Web Service: Exfiltration to Cloud Storage\n– T1567.002\n\nImpact (TA0040) Ransomware\n\nData Encrypted for Impact (T1486)\n\n## Forensic Practices\n\n**Resource Development**\n\nDuring our review, Awake was able to identify timestamps within the AppCompatCache that\nshowed binary modifications. The actor appeared to be compiling the ransomware binary at\nthe same time the data was exfiltrating out of the environment.\n\n**Execution**\n\nWe identified execution of the malware, which was achieved via PsExec, through the\nRecentApps entry, Registry Key LastWrite times and the creation of new services on the\nremote systems it was run against.\n\nThe data we have also shows the usage of the tool winexesvc.exe in one environment which\nhas been used by other actors in the past for remote execution.\n\nSHA-256: be582632770b52fd6c4a5d375c73f150b42199e81e3c138f6fab243316ff9e07\nSHA-256:\na9e2d7c4c796eedb69f3847b44981a13e32a454d324412962a0dc825460b2c90\nSHA-256: 1b5f182ea9e224e8e7f33c7df247b05292de6f4e65381aca0d5e626cf9b00c8\n\nThis software was seen initially executed on an Exchange system.\n\nThe Awake team had fun piecing together screenshot artifacts from the RDP bitmap cache\n(Figure 6 and Figure 7) showing PsExec execution. We were able to validate:\n\nThe user account used to run PsExec and responsible for the service creation on\nremote hosts\nThe option -p <blocked out password> would indicate the partial password for the\naccount was used\nReferences to “PsEx” and “xec.exe” which are portions of PsExec\nReferences to C:\\data\\PsE which we know was where PsExec was run from based on\nthe RecentApp entry\nThe option -s to run the remote process in the System account\n\n\n-----\n\nThe option -f to copy the specified program even if the file already exists on the remote\nsystem\n\n_Figure 6: RDP Cache 1_\n\n_Figure 7: RDP Cache 2_\n\n**Credential Access**\n\nThe threat actor also leveraged valid accounts throughout the environments showing there\nwas some level of compromise that enabled them to obtain privileged access. Awake was\nable to use bitmap cache file entry for RDP typically located in the directory\n\n\\Users\\<user>\\AppData\\Local\\Microsoft\\Terminal Server Client\\Cache\\\n\n\n-----\n\nAwake was also able to see JumpList entries for RDP with the associated user id in the\ndirectory\n\n\\Users\\<user>\\AppData\\Roaming\\Microsoft\\Windows\\Recent\\AutomaticDestinations\\\n\nThese artifacts exposed both service account and privilege admin accounts that were used\nby the threat actor.\n\nWe also are aware of at least one environment where Mimikatz was used as a method to\nextract credentials. This was the same environment with the file winexesvc.exe on the\nExchange system where the Hafnium domain was identified.\n\nSHA-256: 31443b7329b1bdbcf0564e68406beabf2a30168fdcb7042bca8fb2998e3f11c5\n\n**Discovery**\n\n[Remote System Discovery was also conducted by the actors via the query session](https://attack.mitre.org/techniques/T1018/)\ncommand [qwinsta. This command was identified with the Powershell ConsoleHost_history.txt](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/qwinsta)\nfile. The qwinsta command is run to display information about sessions on a Remote\nDesktop Session Host server.\n\n**Lateral Movement**\n\nLike many other attacks, administrator and service accounts were used by the actor with\nPsExec to move lateral from system to system across domains to access and prep files for\nexfiltration. The actor compromised accounts and then used RDP to navigate throughout the\norganizations. Once the exfiltration was done, the actor then used PsExec to push the\nransomware that encrypted the environments.\n\n**Collection**\n\nThe Hades actors searched local file systems and databases to find files of interest and\nsensitive data prior to Exfiltration. They also searched and collected data from network\nshares on remote systems. Common targets of this were accessible shared directories on\nfile servers. Awake identified these activities on multiple systems by analyzing the ShellBags\nregistry artifact.\n\nFor the archiving, the actor was identified downloading 7zip from a regular download site.\nAwake also was aware of the WinRar utility’s use at some of the victim organizations. 7zip\nleaves an archive history in the NTUSER.data registry hive, which provided the ArchHistory\nvalue data which when parsed provides the file listings that were archived. The files listed in\nthe ArchHistroy were compared to files we knew were exfiltrated and they matched.\n\n**Exfiltration**\n\n\n-----\n\nThe exfiltration methods that were concretely identified and used by the Hades gang are not\n[particularly new. For instance, we see in an article from July 2020 where the Mega[.]nz](https://healthitsecurity.com/news/fbi-alerts-to-rise-in-targeted-netwalker-ransomware-attacks)\napplication was used. In this case, we investigated and identified the Hades actor\ndownloading the standard Mega.nz application directly from its main site and using these\ncommonly available tools for exfiltration.\n\n**Impact**\n\nThe actor in more than one instance was particularly destructive. There were several\nconfirmed instances where the actor issued commands such as “kill” to destroy the backup\nstorage systems, rendering the organization incapable of restoring from backup.\n\nOutside of the backup destruction we saw the impact of the encryption across the Microsoft\nWindows environment. With ransomware we know adversaries encrypt files in large numbers\nacross the network. This was similar in the Hades incidents, we identified cross domain\nencryption and several different versions of the encryption software used in the Hades\nincidents. At least one of the files was associated with Sodinokibi ransomware while the\nothers files appear to be associated with a Crypmodng signature.\n\nSHA-256: ea310cc4fd4e8669e014ff417286da5edf2d3bef20abfb0a4f4951afe260d33d\nSHA-256: 0dfcf4d5f66310de87c2e422d7804e66279fe3e3cd6a27723225aecf214e9b00\nSHA-256: fe997a590a68d98f95ac0b6c994ba69c3b2ece9841277b7fecd9dfaa6f589a87\nSHA-256: 1f7b65834408fad403f4959f3c265751c09dd1d55350a68b1c02b603c145fe48\n\n## Detecting the Techniques\n\nThe Awake Security Platform detects these threats across the network. In addition, the\nAwake Labs team can be contacted for detailed forensic investigations. The following is a list\nof the existing network detection and response (NDR) models that can identify the activity\noutlined in this article.\n\n**Awake Security Detection Models**\n\nDiscovery: SMB Admin Share Access\nLateral Movement: Psexec Like Activity\nLateral Movement: Interactive Remote Shell Access through PsExec\nLateral Movement: Remote Desktop Used by Administrator on Non-Admin Device\nLateral Movement and Execution: Remote Command Execution (psexec, cobalt\nstrike, metasploit, others)\nDownload: Possible Ransomware Tool TTPs\nCollection: Device Collecting Several Potentially-Sensitive Files from Destination\nSystem\nC2: Highly Suspicious Domain Communicating Repeatedly With Few Devices\nExfiltration: At Least 1GB of Data Uploaded to Mega\nImpact: Behavior Typical of Ransomware (Numerous New Files Created and Written)\n\n\n-----\n\n## Subscribe!\n\nIf you liked what you just read, subscribe to hear about our threat research and security\nanalysis.\n\nJason Bevis\n\nVP, Awake Labs\n\n[LinkedIn](https://www.linkedin.com/in/jasonbevis/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-29 - The Unseen One- Hades Ransomware Gang or Hafnium.pdf"
    ],
    "report_names": [
        "2021-03-29 - The Unseen One- Hades Ransomware Gang or Hafnium.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535630,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653687014,
    "ts_modification_date": 1653687014,
    "files": {
        "pdf": "https://archive.orkl.eu/206f16726ef7e10e3a37ef8c41ba7951f93bec43.pdf",
        "text": "https://archive.orkl.eu/206f16726ef7e10e3a37ef8c41ba7951f93bec43.txt",
        "img": "https://archive.orkl.eu/206f16726ef7e10e3a37ef8c41ba7951f93bec43.jpg"
    }
}