{
    "id": "34863df7-a3cb-4882-b230-a2ea205458fa",
    "created_at": "2023-01-12T15:02:25.00711Z",
    "updated_at": "2025-03-27T02:06:11.932667Z",
    "deleted_at": null,
    "sha1_hash": "2b6cc10a2d9b0402626b332be2d4c0f5d0ff4d45",
    "title": "2020-10-20 - FBI Investigating Threatening Emails Sent To Democrats In Florida",
    "authors": "",
    "file_creation_date": "2022-05-27T23:17:12Z",
    "file_modification_date": "2022-05-27T23:17:12Z",
    "file_size": 95436,
    "plain_text": "# FBI Investigating Threatening Emails Sent To Democrats In Florida\n\n**[wuft.org/news/2020/10/20/fbi-investigating-threatening-emails-sent-to-democrats-in-florida/](https://www.wuft.org/news/2020/10/20/fbi-investigating-threatening-emails-sent-to-democrats-in-florida/)**\n\nAlex DeLuca October 20, 2020\n\nDemocratic voters in Florida reported receiving threatening emails Tuesday purportedly from\nthe violent, far-right group Proud Boys directing them to vote for President Donald Trump or\n“we will come after you.”\n\nThe head of the Proud Boys in Florida said in an interview that his group was not responsible\nfor the email threats.\n\nThe FBI and the Alachua County Sheriff’s Office were investigating, according to sheriff’s\nspokesman Art Forgey. The county elections office here said “dozens” of Democratic voters\ncomplained they had received the emails. At least some registered Democrats did not.\n\nThis email was sent to registered Democrats in\n\nAlachua County by a sender claiming to be from the Proud Boys, an extremist far-right group\nestablished in 2016.\nRegistered Democrats who received the emails live in Alachua County – one of only nine\ncounties in Florida where Trump lost in 2016 and home to the University of Florida campus.\nLater in the day Democrats elsewhere in Florida from Brevard, Charlotte and Clay counties\nalso reported receiving them.\n\nThe chairman of Proud Boys, Enrique Tarrio of Miami, said his group did not send the emails.\nHe made the remarks in an interview with Fresh Take Florida, a news service operated by\nthe University of Florida College of Journalism and Communications. Tarrio said he was\ncooperating with the FBI’s investigation.\n\n\n-----\n\nWe don t do mass emails, Tarrio said. This is definitely, definitely not us.\n\nTarrio also said the Proud Boys had no history of being involved in voter intimidation.\n\n“It’s just never been a thing,” he said.\n\nProud Boy groups and their affiliates have been encouraging their supporters in recent\nweeks to join the Trump campaign’s Election Day operations, urging them to register as poll\nwatchers.\n\nFlorida is crucially important in the upcoming presidential election, and political polls show a\nremarkably close race here in recent weeks.\n\n“When I clicked it and read more, I was like, this has to be illegal,” said Jessica McCroan, 24,\nof Gainesville, who received one of the emails before noon. She called police and county\nelection officials.\n\nMcCroan said she already voted by mail and was upset about what she described as voter\nintimidation tactics.\n\n“I just can’t believe that people are doing this, when we should be pushing people to vote,\nnot making them scared to go vote,” she said.\n\nThe email said it came from the Proud Boys, an extremist group active in Florida that has\nopenly supported Trump and has engaged in violent clashes in cities around the United\nStates. Among the group’s supporters is Roger Stone, an occasional adviser to Trump who\nwas convicted on charges of witness tampering and lying to investigators. Trump commuted\nhis sentence this summer.\n\nStone, who lives in Florida, did not immediately respond to an email or a phone call to his\nlawyer’s office.\n\nWhen Trump was asked about the Proud Boys during the presidential debate last month,\nand whether he would condemn white supremacists, he answered: “Proud Boys, stand back\nand stand by.” He said the following day that he had intended to tell the group to “stand\ndown.”\n\nIn the email, the perpetrators ominously claimed to have “gained access into the entire voting\ninfrastructure,” but that boast appeared exaggerated: Thousands of registered Democrats in\nFlorida include their email addresses and phone numbers in the state’s voter registration\nrecords, which are publicly available to anyone who requests them.\n\nThe email also warned recipients by name that the group knew their address, email address,\ntelephone number and “everything” – however, those details are generally included in the\nsame voter registration records.\n\n\n-----\n\nWe will know which candidate you voted for, the email said, though ballot selections are\nsecret under Florida law. The email directed Democrats to change their party affiliation to\nRepublican “to let us know you received our message and will comply.”\n\nAttempting to threaten or intimidate voters in federal elections is a federal crime punishable\nby fines and up to one year in prison.\n\nA computer scientist at Johns Hopkins University in Maryland, Max Zinkus, examined the\nrouting information inside one of the threatening emails and said it traced back to a computer\nserver in Saudi Arabia. He said the email appeared to be created on a management\ninterface common on older web servers with known software vulnerabilities that render them\naccessible to hackers.\n\nZinkus said it’s possible the digital breadcrumbs on the emails were falsified to throw off\ninvestigators. “It’s also possible that someone compromised a device and used it to connect\nto this Saudi server, or compromised the Saudi server itself, or both,” said Zinkus, a doctoral\nstudent who studies security, privacy and cryptography.\n\nThe emails were made to appear they were sent from a computer server associated with the\nofficialproudboys.com internet address, but control over that account – which was originally\ncreated in March 2017 – was changed Monday night, according to internet records. That\nwebsite was offline by Tuesday afternoon.\n\nThe identities of those behind the officialproudboys.com address was shielded in internet\nrecords, but they used an email address with a German suffix and were customers of the\ncompany 1&1 IONOS Inc. of Chesterfield, Pennsylvania. A company spokesman wrote in an\nemail after publication of this story that 1&! IONOS has not been contacted by the FBI and\nthat it no longer hosts the website or domain.\n\n**_Editor’s error/correction appended: A previous version of this story stated that Stone was_**\n_imprisoned after his conviction. He was not, as Trump commuted his sentence days before_\n_Stone was to report to prison._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-20 - FBI Investigating Threatening Emails Sent To Democrats In Florida.pdf"
    ],
    "report_names": [
        "2020-10-20 - FBI Investigating Threatening Emails Sent To Democrats In Florida.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535745,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653693432,
    "ts_modification_date": 1653693432,
    "files": {
        "pdf": "https://archive.orkl.eu/2b6cc10a2d9b0402626b332be2d4c0f5d0ff4d45.pdf",
        "text": "https://archive.orkl.eu/2b6cc10a2d9b0402626b332be2d4c0f5d0ff4d45.txt",
        "img": "https://archive.orkl.eu/2b6cc10a2d9b0402626b332be2d4c0f5d0ff4d45.jpg"
    }
}