{
    "id": "34caffa1-da01-4006-82d3-885c665ba3fc",
    "created_at": "2023-01-12T15:09:52.252533Z",
    "updated_at": "2025-03-27T02:16:55.445516Z",
    "deleted_at": null,
    "sha1_hash": "bd6c69527a864c5776ab22601c2639966bfd6755",
    "title": "2021-06-01 - Kimsuky APT continues to target South Korean government using AppleSeed backdoor",
    "authors": "",
    "file_creation_date": "2022-05-28T03:32:44Z",
    "file_modification_date": "2022-05-28T03:32:44Z",
    "file_size": 5425982,
    "plain_text": "# Kimsuky APT continues to target South Korean government using AppleSeed backdoor\n\n**blog.malwarebytes.com/threat-analysis/2021/06/kimsuky-apt-continues-to-target-south-korean-government-using-**\nappleseed-backdoor/\n\nThreat Intelligence Team June 1, 2021\n\n_This blog post was authored by Hossein Jazi._\n\nThe Kimsuky APT—also known as Thallium, Black Banshee, and Velvet Chollima—is a\nNorth Korean threat actor that has been active since 2012. The group conducts cyber\nespionage operations to target government entities mainly in South Korea. On December\n[2020, KISA (Korean Internet & Security Agency) provided a detailed analysis about the](https://boho.or.kr/filedownload.do?attach_file_seq=2695&attach_file_id=EpF2695.pdf)\nphishing infrastructure and TTPs used by Kimsuky to target South Korea.\n\nThe Malwarebytes Threat Intelligence team is actively monitoring this actor and has been\nable to spot phishing websites, malicious documents, and scripts that have been used to\ntarget high profile people within the government of South Korea. The structure and TTPs\nused in these recent activities align with what has been reported in KISA’s report.\n\n## Targets\n\nOne of the lures used by Kimsuky named “외교부 가판 2021-05-07” in Korean language\ntranslates to “Ministry of Foreign Affairs Edition 2021-05-07” which indicates that it has been\ndesigned to target the Ministry of Foreign Affairs of South Korea. According to our collected\ndata, we have identified that it is one entity of high interest for Kimsuky. Other targets\nassociated with the Korean government include:\n\nMinistry of Foreign Affairs, Republic of Korea 1st Secretary\nMinistry of Foreign Affairs, Republic of Korea 2nd Secretary\nTrade Minister\nDeputy Consul General at Korean Consulate General in Hong Kong\nInternational Atomic Energy Agency (IAEA) Nuclear Security Officer\nAmbassador of the Embassy of Sri Lanka to the State\nMinistry of Foreign Affairs and Trade counselor\n\nBeside targeting government, we also have observed that Kimsuky collected information\nabout universities and companies in South Korea including the Seoul National University and\nDaishin financial security company as well as KISA. This does not mean the threat actors\nactively targeted them yet nor that they were compromised.\n\n## Phishing Infrastructure\n\n\n-----\n\nThe group has the capability to set up phishing infrastructure to mimic well known websites\nand trick victims to enter their credentials. This is one of the main methods used by this actor\nto collect email addresses that later will be used to send spearphishing emails. The group is\nstill using similar phishing models previously mentioned in the KISA report with some small\nchanges.\n\nAs an example, they have added the Mobile_detect and Anti_IPs modules from type B to\ntype C (KISA report) in order to be able to detect mobile devices and adjust the view based\non that. This phishing model has the capability to show phishing pages in English or Korean\nbased on the parameter value received from the phishing email. This model has been\ndeployed by Kimsuky to target not only Korean speaking victims but also English speaking\npeople, as well.\n\nFigure 1: Phishing service model\nWe have observed that they developed different phishing techniques to mimic the following\nweb services and steal credentials:\n\nGmail\n\n\n-----\n\nHotmail\nMicrosoft Outlook\nNate\nDaum\nNaver\nTelegram\nKISA\n\nFigure 2: Nate phishing page developed by Kimsuky APT\nWe have identified several URLs used by Kimsuky to host their phishing infrastructure:\n\nhttp://accounts[.]goggle[.]hol[.]es/MyAccount\n\nhttps://myaccount[.]google[.]newkda[.]com/signin\n\nhttp://myaccount[.]google[.]newkda[.]com/signin\n\nhttp://myaccount[.]google[.]nkaac[.]net/signin\n\nhttps://myaccounts-gmail[.]autho[.]co/signin\n\nhttp://myaccounts-gmail[.]kr-infos[.]com/signin\n\nhttp://myaccount[.]cgmail[.]pe[.]hu/signin\n\nhttps://accounts[.]google-manager[.]ga/signin\n\nhttps://accounts[.]google-signin[.]ga/v2\n\nhttps://myaccount[.]google-signin[.]ga/signin\n\nhttps://account[.]grnail-signin[.]ga/v2\n\nhttps://myaccount[.]grnail-signin[.]ga/v2\n\nhttps://myaccounts[.]grnail-signin[.]ga/v2\n\nhttps://accounts[.]grnail-signin[.]ga/v2\n\nhttps://protect[.]grnail-signin[.]ga/v2\n\n\n-----\n\nhttps://accounts[.]grnail-signing[.]work/v2\nhttps://myaccount[.]grnail-signing[.]work/v2\nhttps://myaccount[.]grnail-security[.]work/v2\nhttps://signin[.]grnail-login[.]ml\nhttps://login[.]gmail-account[.]gq\nhttps://signin[.]gmrail[.]ml\nhttps://login[.]gmeil[.]kro[.]kr\nhttps://account[.]googgle[.]kro[.]kr\n\nThe group has used Twitter accounts to find and monitor its targets to prepare well crafted\nspear phishing emails. The group also is using Gmail accounts to use for phishing attacks or\nregistering domains. One of the Gmail accounts used by this actor is\n” tjkim1991@gmail[.]com” which was used to register the following domains:\n\nns1.microsoft-office[.]us\nns2.microsoft-office[.]us\n\nThey were registered on April 3 and we believe have been reserved to be used for future\ncampaigns. Pivoting from these domains, we were able to uncover the infrastructure used by\nthis actor. Some of it has overlap with previously reported campaigns operated by Kimsuky.\n\nFigure 3: Infrastructure pivoting\n\n## Command and Control infrastructure\n\n\n-----\n\nKimsuky reuses some of its phishing infrastructure for its command and control\ncommunications. In their most recent attack against South Korea’s government they reused\nthe infrastructure that has been used to host their phishing websites for AppleSeed backdoor\nC&C communications. Besides using the AppleSeed backdoor to target Windows users, the\n[actor also has used an Android backdoor to target Android users. The Android backdoor can](https://mp.weixin.qq.com/s/8RgFvA_rOR2nIGxjWbEq-w)\nbe considered as the mobile variant of the AppleSeed backdoor. It uses the same command\npatterns as the Windows one. Also, both Android and Windows backdoors have used the\nsame infrastructure. It is also interesting to mention that this actor calls themselves Thallium.\n\nFigure 4: C2 infrastructure\nHere are some of IPs and domains used by the actor for C2 communications:\n\n\n-----\n\n```\n210.16.120[.]34\n216.189.157[.]89\n45.58.55[.]73\n45.13.135[.]103\n27.102.114[.]89\n210.16.121[.]137\n58.229.208[.]146 \n27.102.107[.]63\ndownload.riseknite[.]life\nonedrive-upload.ikpoo[.]cf\nalps.travelmountain[.]ml\ntexts.letterpaper[.]press\n\n## Analysis of the most recent AppleSeed attack\n\n```\nIn this section we provide an analysis of the AppleSeed backdoor that has been used to\ntarget the Ministry of the Foreign Affairs of South Korea.\n\n**Initial Access**\n\nThe actor has distributed its dropper embedded in an archive file (외교부 가판 2021-0507.zip) as an attachment through spearphishing emails. The target email addresses have\nbeen collected using the actor email phishing campaigns we described in the previous\nsection. The actor conducted this spearphishing attack on May 7, 2021.\n\nThe archive file contains a JavaScript file (외교부 가판 2021-05-07.pdf.jse) which pretends to\nbe a PDF file that contains two Base64 encoded blobs. The first one is the content of the\ndecoy PDF file in Base64 format and the other one contains the AppleSeed payload also in\nBase64 format (encoded twice).\nAt first it uses the MSXML Base64 decoding functionality to decode the first layer and then\nuses certutil.exe to decode the second layer and get the final ApppleSeed payload. The\ndecoy PDF file has been decoded using the MSXML Base64 decoding function.\n\n\n-----\n\nFigure 5: JS dropper\nAfter decoding the PDF and AppleSeed payload, the content gets written into the\n_ProgramData directory. At the end, the decoy PDF file is opened by calling Wscript.Shell.Run_\nand the AppleSeed payload executed through PowerShell by calling regsvr32.exe. Calling\n_regsvr32.exe to run a DLL registers it as a server that automatically calls the DLL export_\nfunction that has been named DllRegisterServer.\n```\npowershell.exe -windowstyle hidden regsvr32.exe /s AppleSeed_Payload\nWscript_Shell.Run(Pdf_Name);\n\n```\n**AppleSeed Backdoor**\n\nThe dropped payload is a DLL file that has been packed using the UPX packer. The\nunpacked sample is highly obfuscated and important API calls and strings have been\nencrypted using a custom encryption algorithm. The encrypted version of the strings and API\ncalls are in hex ASCII format. Whenever in the code the malware needs to use a string, it\ntakes the encrypted string and passes it into two functions to decrypt it.\n\nThe first function “string_decryptor_prep” gets the encrypted string and then prepares a\ncustom data structure that has four elements:\n```\ntypedef struct _UNICODESTR {\n     wchar_t *Buffer; // Encrypted string \n     DWORD padding;\n     uint64_t Length; // Length of the string\n     uint64_t MaxLength; // Max length for the string which has been calculated\nbased on the lenght\n} UNICODESTR;\n\n```\nThe second function “string_decryptor” gets the created data structure in the previous\nfunction and then decrypts the string and puts it in the same data structure.\n\n\n-----\n\n-----\n\nFigure 6: String decryptor function\nThe decryptor function first convert the input string in hex ascii format to binary by calling the\n**_hexascii_to_binary function on each two ascii characters (i.e. c3, 42, b1, 1d… in example_**\n1). The first 16 bytes of in the input is then used as the key and the remainder is the actual\nvalue that gets decrypted in 16 byte chunks (i.e. ed, d5, 0d, 60).\nDecryption is a simple xor operation of `key[i] ^ string[i-1] ^ string[i] (For the first`\ncharacter string_to_be_decrypted[i-1] is set to zero).\n\nFigure 7: String decoder example\nMost of the important API calls resolve dynamically during the run time using\n“string_decryptor” function. (288 API calls have been resolved dynamically.)\n\n\n-----\n\nFigure 8: Resolve API calls\nThe AppleSeed payload has an export function named “DllRegisterServer” which will be\ncalled when the DLL is executed using RegSvr32.exe. DllRegisterServer has a function that\nis responsible for performing the DLL initialization and setup that includes the following\nsteps:\n\nCopy itself into “C:\\ProgramData\\Software\\ESTsoft\\Common” and rename itself as\n**_ESTCommon.dll to pretend it is a DLL that belongs to ESTsecurity company._**\nMake itself persistent by creating the following registry key:\n```\nRegistry key name: EstsoftAutoUpdate\nRegistry key value: Regsvr32.exe /s\nC:\\ProgramData\\Software\\ESTsoft\\Common\\ESTCommon.dll\nRegistry location: HKLU\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\n```\n\n-----\n\nFigure 9: Registry creation\n\nFunctionality activation by creating the following files into\n**_“C:\\ProgramData\\Software\\ESTsoft\\Common\\flags” directory and writes “flag” into_**\nthem: FolderMonitor, KeyboardMonitor, ScreenMonitor, UsbMonitor.\n\nIn the next step it creates a Mutex to make sure it only infects a victim once.\n\n\n-----\n\nFigure 10: Mutex creation\nAfter creating that mutex, it checks if the current process has the right access privilege by\ncalling GetTokenInformation API call and if it does not have the right privilege, it tries to\nescalate its privilege using AdjustTokenPrivilege by passing SeDebugPrivilege to it to gain\nsystem level privilege.\n\n\n-----\n\nFigure 11: Privilege escalation\n\n\n-----\n\nAt the end it performs its main functionalities in separate threads. All the the collected data in\neach thread is being zipped and encrypted and is being sent to the command and control\nserver using HTTP POST requests in a separate thread. After sending the data to the server,\nthe data is deleted from the victim’s machine.\nThe ApppleSeed payload is using RC4 for encryption and decryption of the data. To\ngenerate RC4 key, it creates a Random buffer of 117 bytes by Calling CryptGenRandom and\nthen uses CryptCreateHash and CryptHashData to adds the buffer into a MD5 hash object.\nThen it calls CryptDeriveKey to generate the RC4 key.\nThe created 117 bytes buffer is encrypted using RSA algorithm and is sent to the sever along\nwith RC4 encrypted data. The RSA key is in hex ASCII format and has been decrypted using\n“string_decryptor” function.\n\n**Input Capture (KeyLogger)**\n\nThe keylogger function uses GetKeyState and GetKeyboardState to capture the pressed\nkeys on the victim’s machine and logs all keys per process into the log.txt file.\n\n\n-----\n\nFigure 12: KeyLogger\n\n**Screen Capture**\n\nThis module takes screenshots by calling the following sequence of API calls and writes\nthem to files: GetDesktopWindow, GetDC, CreateCompstibleDC, CreateCompatibleBitmap,\n_Bitblt and GetDIBits and then writes them into a file using CreateFileW and WriteFile._\n\n\n-----\n\nFigure 13: Capture Screen\n\n**Collect removable media data**\n\nThis module finds the removable media devices connected to the machine and collects its\ndata before sending it to the command and control server. To identify a USB drive it calls\nCM_Get_Device_IDW to retrieve the device instance ID that would be in format “ <device```\nID>\\<instance-specific-ID> ” and then checks if it contains USB string value.\n\n```\n\n-----\n\n-----\n\nFigure 14: Get removable devices\n\n**Collect files**\n\nThis thread looks for txt, ppt, hwp, pdf, and doc files in the Desktop, Documents, Downloads\nand AppData\\Local\\Microsoft\\Windows\\INetCache\\IE directories and archives them to be\nready to be exfiltrated to the server.\n\n\n-----\n\nFigure 15: File collection\n\n## Command structure\n\nThe AppleSeed backdoor is using a two layer command structure to communicate to its\ncommand and control server. Here is the URL pattern used for C&C communications:\n```\nentity:url url:?m=[command layer one]&p1=[volume serial number]&p2=[command layer\ntwo]\n\n```\nCommand layer one defines the type of command that server expected to be executed on\nthe victim and it can have one of the following values:\n\n\n-----\n\n**Command** **Description**\n\na ping mode (Collect victim info including IP, Time stamp, victim OS version)\n\nb upload data mode\n\nc Download command (Waiting for command)\n\nd Delete command\n\ne Upload command mode\n\nf List directories mode\n\ng Delete file mode\n\nh Check existence of a file mode\n\nCommand Layer one\nCommand layer 2 is only for when the command layer 1 is in upload data mode (c) and\ndefines the type of upload. It can have one of the following values:\n\n**Command** **Description**\n\na Upload command execution results\n\nb Upload files and removable media data\n\nc Upload screenshots\n\nd Upload input capture data (Keylogger data)\n\nCommand layer 2\n\n## Conclusion\n\nKimsuky is one of North Korea’s threat actors that has mainly targeted South Korean\ngovernment entities. In this blog post we took a look at this group’s activities including its\nphishing infrastructure and command and control mechanisms. Our research has shown that\nthe group is still using a similar infrastructure and TTPs as reported on December 2020 by\nKISA. Its most recent campaign targeted the ministry of foreign affairs using the Apple Seed\nbackdoor.\n\n\n-----\n\n## MITRE ATT&CK Techniques\n\n**Tactic** **ID** **Name** **Details**\n\n**Reconnaissance** T1598 Phishing for Information Use phishing to collect\nemail addresses for\ntargeted attack\n\n\n**Resource**\n**Development**\n\n**Resource**\n**Development**\n\n**Resource**\n**Development**\n\n**Resource**\n**Development**\n\n\nT1583.00 Acquire\nInfrastructure: Domains\n\nT1587.001 Develop\nCapabilities: Malware\n\nT1585.002 Establish Accounts: Email\nAccounts\n\nT1585.001 Establish Accounts: Social\nMedia Accounts\n\n\nPurchase and register\ndomains a few month\nbefore the attack\n\nDevelop AppleSeed\nbackdoor for the attack\n\nCreate email accounts to\nregister domains and use in\nphishing attacks\n\nUse Twitter to collect info\nabout victims\n\n\n-----\n\n**Initial Access** T1566.001 Phishing: Spearphishing\nAttachment\n\n**Execution** T1059.001 Command and Scripting\nInterpreter: PowerShell\n\n**Execution** T1059.007 Command and Scripting\nInterpreter: JavaScript\n\n**Persistence** T1547.001 Boot or Logon Autostart\nExecution: Registry Run\nKeys / Startup Folder\n\n\n**Privilege**\n**Escalation**\n\n**Defense**\n**Evasion**\n\n**Defense**\n**Evasion**\n\n**Defense**\n**Evasion**\n\n**Defense**\n**Evasion**\n\n**Defense**\n**Evasion**\n\n**Defense**\n**Evasion**\n\n**Credential**\n**Access**\n\n\nT1134 Access Token\nManipulation\n\nT1134 Access Token\nManipulation\n\nT1140 Deobfuscate/Decode Files\nor Information\n\nT1070.004 Indicator Removal on\nHost: File Deletion\n\n\nT1056.001 Input Capture: Keylogging Log keystrokes on the\nvictim’s machine\n\n\nDistributing archive files\nthat contains JS dropper\nthrough phishing emails\n\nUse PowerShell to execute\ncommands\n\nUse JS to execute\nPowerShell\n\nCreate Registry RunOnce\nkey\n\nAdjust its token privileges to\nhave\nthe `SeDebugPrivilege`\n\nAdjust its token privileges to\nhave\nthe `SeDebugPrivilege`\n\n– Use the\ncommand `certutil to`\ndecode base64 contents\n\n– Decrypt data coming from\nServer\n\nDelete its exfiltrated data to\ncover its tracks\n\n\nT1112 Modify Registry modify the Run registry key\n\n\nT1027 Obfuscated Files or\nInformation\n\nT1218.010 Signed Binary Proxy\nExecution: Regsvr32\n\n\n– All the strings and API\ncalls are obfuscated using\ncustom encryption\n\n– The dropped payload is\npacked with UPX\n\nLoad payload through\nRegsvr32\n\n\n**Discovery** T1083 File and Directory\nDiscovery\n\n**Discovery** T1082 System Information\nDiscovery\n\n\nObtain file and directory\nlistings\n\nCollect OS type and volume\nserial number\n\n\n-----\n\n**Collection** T1560 Archive Collected Data Compress and encrypt\ncollected data prior to\nexfiltration\n\n**Collection** T1005 Data from Local System Collect data from local\nsystem\n\n\n**Collection** T1025 Data from Removable\nMedia\n\n\nCollect data from\nremovable media\n\n\n**Collection** T1056.001 Input Capture: Keylogging Log keystrokes on the\nvictim’s machine\n\n**Collection** T1113 Screen Capture Capture screenshots\n\n\n**Command and**\n**Control**\n\n**Command and**\n**Control**\n\n\nT1001 Data Obfuscation Encrypt data for exfiltration\n\n\nT1071.001 Application Layer\nProtocol: Web Protocols\n\n\nUse HTTP for command\nand control communication\n\nExfiltrate data over the\nsame channel used for C2\n\n\n**Exfiltration** T1041 Exfiltration Over C2\nChannel\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-01 - Kimsuky APT continues to target South Korean government using AppleSeed backdoor.pdf"
    ],
    "report_names": [
        "2021-06-01 - Kimsuky APT continues to target South Korean government using AppleSeed backdoor.pdf"
    ],
    "threat_actors": [
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536192,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1653708764,
    "ts_modification_date": 1653708764,
    "files": {
        "pdf": "https://archive.orkl.eu/bd6c69527a864c5776ab22601c2639966bfd6755.pdf",
        "text": "https://archive.orkl.eu/bd6c69527a864c5776ab22601c2639966bfd6755.txt",
        "img": "https://archive.orkl.eu/bd6c69527a864c5776ab22601c2639966bfd6755.jpg"
    }
}