{
    "id": "34f32aae-c58e-46dd-86d9-4f83ba63087c",
    "created_at": "2022-10-25T16:48:21.719885Z",
    "updated_at": "2025-03-27T02:06:02.725188Z",
    "deleted_at": null,
    "sha1_hash": "b827fd356c2d2022f50721b9d2ccdede281bc62d",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-07-05T15:32:50Z",
    "file_modification_date": "2022-07-05T15:32:58Z",
    "file_size": 566845,
    "plain_text": "_Co-Authored by:_ **TLP:WHITE** Product ID: AA22-187A\n\n\n# North Korean State-Sponsored Cyber Actors Use Maui Ransomware to Target the Healthcare and Public Health Sector \n\n## SUMMARY\n\nThe Federal Bureau of Investigation (FBI), Cybersecurity and Infrastructure Security Agency (CISA),\nand the Department of the Treasury (Treasury) are releasing this joint Cybersecurity Advisory (CSA)\nto provide information on Maui ransomware, which has been used by North Korean state-sponsored\n[cyber actors since at least May 2021 to target Healthcare and Public Health (HPH) Sector](https://www.cisa.gov/healthcare-and-public-health-sector)\norganizations.\n\nThis joint CSA provides information—including tactics, techniques, and procedures (TTPs) and\nindicators of compromise (IOCs)—on Maui ransomware obtained from FBI incident response\nactivities and industry analysis of a Maui sample. The FBI, CISA, and Treasury urge HPH Sector\norganizations as well as other critical infrastructure organizations to apply the recommendations in the\nMitigations section of this CSA to reduce the likelihood of compromise from ransomware operations.\nVictims of Maui ransomware should report the incident to their local FBI field office or CISA.\n\nThe FBI, CISA, and Treasury highly discourage paying ransoms as doing so does not guarantee files\nand records will be recovered and may pose sanctions risks. Note: in September 2021, Treasury\n[issued an updated advisory highlighting the sanctions risks associated with ransomware payments](https://home.treasury.gov/system/files/126/ofac_ransomware_advisory.pdf)\nand the proactive steps companies can take to mitigate such risks. Specifically, the updated advisory\nencourages U.S. entities to adopt and improve cybersecurity practices and report ransomware\nattacks to, and fully cooperate with, law enforcement. The updated advisory states that when affected\nparties take these proactive steps, Treasury’s Office of Foreign Assets Control (OFAC) would be\nmore likely to resolve apparent sanctions violations involving ransomware attacks with a non-public\nenforcement response.\n\n_To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact_\n_your local FBI field office at_ _[fbi.gov/contact-us/field, or the FBI’s 24/7 Cyber Watch (CyWatch) at](http://www.fbi.gov/contact-us/field)_\n_(855) 292-3937 or by e-mail at_ _[CyWatch@fbi.gov. When available, please include the following information](mailto:CyWatch@fbi.gov)_\n_regarding the incident: date, time, and location of the incident; type of activity; number of people affected; type of_\n_equipment used for the activity; the name of the submitting company or organization; and a designated point of_\n_contact. To request incident response resources or technical assistance related to these threats, contact CISA at_\n_[report@cisa.gov.](mailto:report@cisa.gov)_\n\n**_Disclaimer: the information in this joint Cybersecurity Advisory is provided \"as is\" for informational purposes only._**\n_The authors do not provide any warranties of any kind regarding this information or endorse any commercial_\n_product or service, including any subjects of analysis. This document is marked TLP:WHITE. Disclosure is not_\n_limited. Sources may use TLP:WHITE when information carries minimal or no foreseeable risk of misuse, in_\n_accordance with applicable rules and procedures for public release. Subject to standard copyright rules,_\n_TLP:WHITE information may be distributed without restriction. For more information on the Traffic Light Protocol,_\n\n\n-----\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n[For more information on state-sponsored North Korean malicious cyber activity, see CISA’s North](https://www.cisa.gov/uscert/northkorea)\n[Korea Cyber Threat Overview and Advisories webpage.](https://www.cisa.gov/uscert/northkorea)\n\n## TECHNICAL DETAILS\n\nSince May 2021, the FBI has observed and responded to multiple Maui ransomware incidents at HPH\nSector organizations. North Korean state-sponsored cyber actors used Maui ransomware in these\nincidents to encrypt servers responsible for healthcare services—including electronic health records\nservices, diagnostics services, imaging services, and intranet services. In some cases, these\nincidents disrupted the services provided by the targeted HPH Sector organizations for prolonged\nperiods. The initial access vector(s) for these incidents is unknown.\n\n### Maui Ransomware\n\nMaui ransomware (maui.exe) is an encryption binary. According to industry analysis of a sample of\nMaui (SHA256: 5b7ecf7e9d0715f1122baf4ce745c5fcd769dee48150616753fec4d6da16e99e)—\nprovided in [Stairwell Threat Report: Maui Ransomware—the ransomware appears to be designed for](https://stairwell.com/news/threat-research-report-maui-ransomware/)\n[manual execution [TA0002] by a remote actor. The remote actor uses command-line interface](https://attack.mitre.org/versions/v11/tactics/TA0002/)\n\n[[T1059.008] to interact with the malware and to identify files to encrypt.](https://attack.mitre.org/versions/v11/techniques/T1059/008/)\n\nMaui uses a combination of Advanced Encryption Standard (AES), RSA, and XOR encryption to\n[encrypt [T1486] target files:](https://attack.mitre.org/versions/v11/techniques/T1486/)\n\n1. Maui encrypts target files with AES 128-bit encryption. Each encrypted file has a unique AES\nkey, and each file contains a custom header with the file’s original path, allowing Maui to\nidentify previously encrypted files. The header also contains encrypted copies of the AES key.\n2. Maui encrypts each AES key with RSA encryption.\n```\n        o Maui loads the RSA public (maui.key) and private (maui.evd) keys in the same\n\n```\ndirectory as itself.\n3. Maui encodes the RSA public key (maui.key) using XOR encryption. The XOR key is\n\ngenerated from hard drive information (\\\\.\\PhysicalDrive0).\n\nDuring encryption, Maui creates a temporary file for each file it encrypts using GetTempFileNameW().\nMaui uses the temporary to stage output from encryption. After encrypting files, Maui creates\n```\n   maui.log, which contains output from Maui execution. Actors likely exfiltrate [TA0010] maui.log and\n\n```\ndecrypt the file using associated decryption tools.\n\n[See Stairwell Threat Report: Maui Ransomware](https://stairwell.com/news/threat-research-report-maui-ransomware/) for additional information on Maui ransomware,\nincluding YARA rules and a key extractor.\n\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n\n-----\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n### Indicators of Compromise\n\nSee table 1 for Maui ransomware IOCs obtained from FBI incident response activities since May\n2021.\n\n_Table 1: Maui Ransomware IOCs_\n\n**Indicator Type** **Value**\n\n**Filename** maui.exe\n\nmaui.log\n\nmaui.key\n\nmaui.evd\n\naui.exe\n\n**MD5 Hash** 4118d9adce7350c3eedeb056a3335346\n\n9b0e7c460a80f740d455a7521f0eada1\n\nfda3a19afa85912f6dc8452675245d6\n\n2d02f5499d35a8dffb4c8bc0b7fec5c2\n\nc50b839f2fc3ce5a385b9ae1c05def3a\n\na452a5f693036320b580d28ee55ae2a3\n\na6e1efd70a077be032f052bb75544358\n\n802e7d6e80d7a60e17f9ffbd62fcbbeb\n\n**SHA256 Hash** 5b7ecf7e9d0715f1122baf4ce745c5fcd769dee48150616753fec4d6da16e99e\n\n45d8ac1ac692d6bb0fe776620371fca02b60cac8db23c4cc7ab5df262da42b78\n\n56925a1f7d853d814f80e98a1c4890b0a6a84c83a8eded34c585c98b2df6ab19\n\n830207029d83fd46a4a89cd623103ba2321b866428aa04360376e6a390063570\n\n458d258005f39d72ce47c111a7d17e8c52fe5fc7dd98575771640d9009385456\n\n99b0056b7cc2e305d4ccb0ac0a8a270d3fceb21ef6fc2eb13521a930cea8bd9f\n\n3b9fe1713f638f85f20ea56fd09d20a96cd6d288732b04b073248b56cdaef878\n\n87bdb1de1dd6b0b75879d8b8aef80b562ec4fad365d7abbc629bcfc1d386afa6\n\n### Attribution to North Korean State-Sponsored Cyber Actors\n\nThe FBI assesses North Korean state-sponsored cyber actors have deployed Maui ransomware\nagainst Healthcare and Public Health Sector organizations. The North Korean state-sponsored cyber\nactors likely assume healthcare organizations are willing to pay ransoms because these organizations\n\n|Indicator Type|Value|\n|---|---|\n|Filename|maui.exe|\n||maui.log|\n||maui.key|\n||maui.evd|\n||aui.exe|\n|MD5 Hash|4118d9adce7350c3eedeb056a3335346|\n||9b0e7c460a80f740d455a7521f0eada1|\n||fda3a19afa85912f6dc8452675245d6|\n||2d02f5499d35a8dffb4c8bc0b7fec5c2|\n||c50b839f2fc3ce5a385b9ae1c05def3a|\n||a452a5f693036320b580d28ee55ae2a3|\n||a6e1efd70a077be032f052bb75544358|\n||802e7d6e80d7a60e17f9ffbd62fcbbeb|\n|SHA256 Hash|5b7ecf7e9d0715f1122baf4ce745c5fcd769dee48150616753fec4d6da16e99e|\n||45d8ac1ac692d6bb0fe776620371fca02b60cac8db23c4cc7ab5df262da42b78|\n||56925a1f7d853d814f80e98a1c4890b0a6a84c83a8eded34c585c98b2df6ab19|\n||830207029d83fd46a4a89cd623103ba2321b866428aa04360376e6a390063570|\n||458d258005f39d72ce47c111a7d17e8c52fe5fc7dd98575771640d9009385456|\n||99b0056b7cc2e305d4ccb0ac0a8a270d3fceb21ef6fc2eb13521a930cea8bd9f|\n||3b9fe1713f638f85f20ea56fd09d20a96cd6d288732b04b073248b56cdaef878|\n||87bdb1de1dd6b0b75879d8b8aef80b562ec4fad365d7abbc629bcfc1d386afa6|\n\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n\n-----\n\n**TLP:WHITE** FBI | CISA |Treasury\n\nprovide services that are critical to human life and health. Because of this assumption, the FBI, CISA,\nand Treasury assess North Korean state-sponsored actors are likely to continue targeting HPH\nSector organizations.\n\n## MITIGATIONS\n\nThe FBI, CISA, and Treasury urge HPH Sector organizations to:\n\n     - Limit access to data by deploying public key infrastructure and digital certificates to\nauthenticate connections with the network, Internet of Things (IoT) medical devices, and the\nelectronic health record system, as well as to ensure data packages are not manipulated while\nin transit from man-in-the-middle attacks.\n\n     - Use standard user accounts on internal systems instead of administrative accounts, which\nallow for overarching administrative system privileges and do not ensure least privilege.\n\n     - Turn off network device management interfaces such as Telnet, SSH, Winbox, and HTTP for\nwide area networks (WANs) and secure with strong passwords and encryption when enabled.\n\n     - Secure personal identifiable information (PII)/patient health information (PHI) at collection\npoints and encrypt the data at rest and in transit by using technologies such as Transport\nLayer Security (TPS). Only store personal patient data on internal systems that are protected\nby firewalls, and ensure extensive backups are available if data is ever compromised.\n\n     - Protect stored data by masking the permanent account number (PAN) when it is displayed\nand rendering it unreadable when it is stored—through cryptography, for example.\n\n     - Secure the collection, storage, and processing practices for PII and PHI, per regulations such\nas the Health Insurance Portability and Accountability Act of 1996 (HIPAA). Implementing\nHIPAA security measures can prevent the introduction of malware on the system.\n\n     - Implement and enforce multi-layer network segmentation with the most critical\ncommunications and data resting on the most secure and reliable layer.\n\n     - Use monitoring tools to observe whether IoT devices are behaving erratically due to a\ncompromise.\n\n     - Create and regularly review internal policies that regulate the collection, storage, access, and\nmonitoring of PII/PHI.\n\nIn addition, the FBI, CISA, and Treasury urge all organizations, including HPH Sector organizations,\nto apply the following recommendations to prepare for, mitigate/prevent, and respond to ransomware\nincidents.\n\n### Preparing for Ransomware\n\n     - **Maintain offline (i.e., physically disconnected) backups of data, and regularly test**\n**backup and restoration. These practices safeguard an organization’s continuity of**\noperations or at least minimize potential downtime from a ransomware incident and protect\nagainst data losses.\n\n`o` **Ensure all backup data is encrypted, immutable (i.e., cannot be altered or deleted),**\nand covers the entire organization’s data infrastructure.\n\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n\n-----\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n     - **Create, maintain, and exercise a basic cyber incident response plan and associated**\n**communications plan that includes response procedures for a ransomware incident.**\n```\n        o Organizations should also ensure their incident response and communications plans\n\n```\ninclude response and notification procedures for data breach incidents. Ensure the\nnotification procedures adhere to applicable state laws.\n\n            - [Refer to the National Conference of State Legislatures: Security Breach](https://www.ncsl.org/research/telecommunications-and-information-technology/security-breach-notification-laws.aspx)\nNotification Laws for information on each state’s data breach laws.\n\n            - For breaches involving electronic health information, you may need to notify the\nFederal Trade Commission (FTC) or the Department of Health and Human\nServices, and, in some cases, the media. Refer to the FTC’s [Health Breach](https://www.ftc.gov/legal-library/browse/rules/health-breach-notification-rule)\nNotification Rule and U.S. Department of Health and Human Services’ [Breach](https://www.hhs.gov/hipaa/for-professionals/breach-notification/index.html)\nNotification Rule for more information.\n```\n        o See CISA-Multi-State Information Sharing and Analysis Center (MS-ISAC) Joint\n\n```\n[Ransomware Guide and CISA Fact Sheet Protecting Sensitive and Personal](https://cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware%20Guide_S508C_.pdf)\n[Information from Ransomware-Caused Data Breaches for information on creating a](https://www.cisa.gov/sites/default/files/publications/CISA_Fact_Sheet-Protecting_Sensitive_and_Personal_Information_from_Ransomware-Caused_Data_Breaches-508C.pdf)\nransomware response checklist and planning and responding to ransomware-caused\ndata breaches.\n\n### Mitigating and Preventing Ransomware\n\n     - **Install updates for operating systems, software, and firmware as soon as they are**\n**released. Timely patching is one of the most efficient and cost-effective steps an organization**\ncan take to minimize its exposure to cybersecurity threats. Regularly check for software\n[updates and end-of-life notifications and prioritize patching known exploited vulnerabilities.](https://www.cisa.gov/known-exploited-vulnerabilities-catalog)\nConsider leveraging a centralized patch management system to automate and expedite the\nprocess.\n\n     - **If you use Remote Desktop Protocol (RDP), or other potentially risky services, secure**\n**and monitor them closely.**\n```\n        o Limit access to resources over internal networks, especially by restricting RDP and\n\n```\nusing virtual desktop infrastructure. After assessing risks, if RDP is deemed\noperationally necessary, restrict the originating sources, and require multifactor\nauthentication (MFA) to mitigate credential theft and reuse. If RDP must be available\nexternally, use a virtual private network (VPN), virtual desktop infrastructure, or other\nmeans to authenticate and secure the connection before allowing RDP to connect to\ninternal devices. Monitor remote access/RDP logs, enforce account lockouts after a\nspecified number of attempts to block brute force campaigns, log RDP login attempts,\nand disable unused remote access/RDP ports.\n```\n        o Ensure devices are properly configured and that security features are enabled. Disable\n\n```\nports and protocols that are not being used for a business purpose (e.g., RDP\nTransmission Control Protocol Port 3389).\n```\n        o Restrict Server Message Block (SMB) Protocol within the network to only access\n\n```\nservers that are necessary and remove or disable outdated versions of SMB (i.e., SMB\nversion 1). Threat actors use SMB to propagate malware across organizations.\n\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n\n-----\n\n**TLP:WHITE** FBI | CISA |Treasury\n```\n        o Review the security posture of third-party vendors and those interconnected with your\n\n```\norganization. Ensure all connections between third-party vendors and outside software\nor hardware are monitored and reviewed for suspicious activity.\n```\n        o Implement listing policies for applications and remote access that only allow systems\n\n```\nto execute known and permitted programs under an established.\n```\n        o Open document readers in protected viewing modes to help prevent active content\n\n```\nfrom running.\n\n     - **Implement user training program and phishing exercises to raise awareness among users**\nabout the risks of visiting suspicious websites, clicking on suspicious links, and opening\nsuspicious attachments. Reinforce the appropriate user response to phishing and\nspearphishing emails.\n\n     - **[Require MFA](https://us-cert.cisa.gov/ncas/tips/ST05-012)** **for as many services as possible—particularly for webmail, VPNs, accounts**\nthat access critical systems, and privileged accounts that manage backups.\n\n     - **Use strong passwords and avoid reusing passwords for multiple accounts. See CISA Tip**\n[Choosing and Protecting Passwords and National Institute of Standards and Technology](https://www.cisa.gov/tips/st04-002)\n[(NIST) Special Publication 800-63B: Digital Identity Guidelines](https://csrc.nist.gov/publications/detail/sp/800-63b/final) for more information.\n\n     - **Require administrator credentials to install software.**\n\n     - **Audit user accounts with administrative or elevated privileges and configure access**\ncontrols with least privilege in mind.\n\n     - **Install and regularly update antivirus and antimalware software on all hosts.**\n\n     - **Only use secure networks and avoid using public Wi-Fi networks. Consider installing and**\nusing a VPN.\n\n     - **Consider adding an email banner to messages coming from outside your**\n**organizations.**\n\n     - **Disable hyperlinks in received emails.**\n\n### Responding to Ransomware Incidents\n\nIf a ransomware incident occurs at your organization:\n\n     - Follow your organization’s Ransomware Response Checklist (see Preparing for Ransomware\nsection).\n\n     - Scan backups. If possible, scan backup data with an antivirus program to check that it is free\nof malware. This should be performed using an isolated, trusted system to avoid exposing\nbackups to potential compromise.\n\n     - Follow the notification requirements as outlined in your cyber incident response plan.\n\n     - Report incidents to the FBI at a [local FBI Field Office, CISA at](https://www.fbi.gov/contact-us/field-offices) [us-cert.cisa.gov/report, or the](https://us-cert.cisa.gov/report)\n[U.S. Secret Service (USSS) at a USSS Field Office.](http://www.secretservice.gov/contact/field-offices/)\n\n     - [Apply incident response best practices found in the joint Cybersecurity Advisory, Technical](https://us-cert.cisa.gov/ncas/alerts/aa20-245a)\n[Approaches to Uncovering and Remediating Malicious Activity, developed by CISA and the](https://us-cert.cisa.gov/ncas/alerts/aa20-245a)\ncybersecurity authorities of Australia, Canada, New Zealand, and the United Kingdom.\n\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n\n-----\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n**Note: the FBI, CISA, and Treasury strongly discourage paying ransoms as doing so does not**\nguarantee files and records will be recovered and may pose sanctions risks.\n\n## REQUEST FOR INFORMATION\n\nThe FBI is seeking any information that can be shared, to include boundary logs showing\ncommunication to and from foreign IP addresses, bitcoin wallet information, the decryptor file, and/or\nbenign samples of encrypted files. As stated above, the FBI discourages paying ransoms. Payment\ndoes not guarantee files will be recovered and may embolden adversaries to target additional\norganizations, encourage other criminal actors to engage in the distribution of ransomware, and/or\nfund illicit activities. However, the FBI understands that when victims are faced with an inability to\nfunction, all options are evaluated to protect shareholders, employees, and customers. Regardless of\nwhether you or your organization have decided to pay the ransom, the FBI, CISA, and Treasury urge\n[you to promptly report ransomware incidents to the FBI at a local FBI Field Office, CISA at](https://www.fbi.gov/contact-us/field-offices) us[cert.cisa.gov/report, or the USSS at a USSS Field Office. Doing so provides the U.S. Government](https://us-cert.cisa.gov/report)\nwith critical information needed to prevent future attacks by identifying and tracking ransomware\nactors and holding them accountable under U.S. law.\n\n## RESOURCES \n\n     - For more information and resources on protecting against and responding to ransomware,\n[refer to StopRansomware.gov, a centralized, U.S. whole-of-government webpage providing](https://www.cisa.gov/stopransomware/)\nransomware resources and alerts.\n\n     - [CISA’s Ransomware Readiness Assessment](https://www.cisa.gov/uscert/ncas/current-activity/2021/06/30/cisas-cset-tool-sets-sights-ransomware-threat) is a no-cost self-assessment based on a tiered\nset of practices to help organizations better assess how well they are equipped to defend and\nrecover from a ransomware incident.\n\n     - A guide that helps organizations mitigate a ransomware attack and provides a Ransomware\nResponse Checklists: [CISA-Multi-State Information Sharing and Analysis Center (MS-ISAC)](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware%20Guide_S508C.pdf)\n[Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware%20Guide_S508C.pdf)\n\n     - The U.S. Department of State’s Rewards for Justice (RFJ) program offers a reward of up to\n$10 million for reports of foreign government malicious activity against U.S. critical\n[infrastructure. See the RFJ website](http://www.rewardsforjustice.net/rewards/foreign-malicious-cyber-activity-against-u-s-critical-infrastructure/) for more information and how to report information\nsecurely.\n\n## ACKNOWLEDGEMENTS\n\nThe FBI, CISA, and Treasury would like to thank Stairwell for their contributions to this CSA.\n\n\n**TLP:WHITE** FBI | CISA |Treasury\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/uscert/sites/default/files/publications/aa22-187a-north-korean%20state-sponsored-cyber-actors-use-maui-ransomware-to-target-the-hph-sector.pdf"
    ],
    "report_names": [
        "aa22-187a-north-korean%20state-sponsored-cyber-actors-use-maui-ransomware-to-target-the-hph-sector.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1657035170,
    "ts_modification_date": 1657035178,
    "files": {
        "pdf": "https://archive.orkl.eu/b827fd356c2d2022f50721b9d2ccdede281bc62d.pdf",
        "text": "https://archive.orkl.eu/b827fd356c2d2022f50721b9d2ccdede281bc62d.txt",
        "img": "https://archive.orkl.eu/b827fd356c2d2022f50721b9d2ccdede281bc62d.jpg"
    }
}