{
    "id": "350c438b-7322-4d8c-b1cf-3f40148f5331",
    "created_at": "2023-01-12T15:00:05.578619Z",
    "updated_at": "2025-03-27T02:13:29.211864Z",
    "deleted_at": null,
    "sha1_hash": "b3da58b2f532bc09bb520408c4cf464aede7c1f8",
    "title": "2010-12-20 - End of the Line for the Bredolab Botnet-",
    "authors": "",
    "file_creation_date": "2022-05-28T03:40:13Z",
    "file_modification_date": "2022-05-28T03:40:13Z",
    "file_size": 2777574,
    "plain_text": "# End of the Line for the Bredolab Botnet?\n\n**[securelist.com/end-of-the-line-for-the-bredolab-botnet/36335/](https://securelist.com/end-of-the-line-for-the-bredolab-botnet/36335/)**\n\nAuthors\n\nAlexei Kadiev\n\n_On 25 October 2010, the Dutch police force’s Cybercrime Department announced the shutdown of_\n_143 Bredolab botnet control servers. The next day at Armenia’s Yerevan international airport, one_\n_of those formerly responsible for running the botnet was arrested. While it is certainly possible that_\n_this marked the end of Bredolab, the technologies behind it remain and can, unfortunately, still be_\n_used to create new botnets._\n\n## A brief history of Bredolab\n\nMalicious programs from the Backdoor.Win32.Bredolab family were first detected by IT security\nlabs as long ago as mid-2008. Bredolab’s key purpose is to download other malicious programs\nonto victim computers. The download management system, which includes a loader\n(Backdoor.Win32.Bredolab) and an administration panel, was offered for sale on hacker forums. It\nis this software that shaped the foundation of the Bredolab botnet that appeared in mid-2009, and\nwas, according to the Dutch police, comprised of approximately 30 million computers located in\ncountries all over the world.\n\n\n-----\n\nOne of the botnet s most distinguishing features was its method of operation: legitimate websites\nthat had been hacked were used to spread the botnet’s payload. Visitors to these websites were\nredirected to malicious resources which resulted in their computers being infected with\nBackdoor.Win32.Bredolab — everything operated automatically.\n\n### Hacked sites\n\nWhen the botnet was first created, it operated by hiding an iframe tag on hacked websites that\nlinked to a malicious resource. In late 2009, this iframe tag was replaced with obfuscated\nJavaScript code known as the Trojan-Downloader.JS.Pegel script downloader. When the code\nexecuted, the browser decrypted the tag script and placed it on an HTML page with a link to a\nmalicious resource. Pegel was designed to download exploits onto victim computers; and in turn,\nthese exploits downloaded Bredolab. The cybercriminals reverted to their former method of hidden\niframe tags again in the summer of 2010.\n\nIt is worth noting that the scheme used to spread Bredolab is similar to that used by the creators of\nthe Gumblar botnet, while the obfuscation methods used with Pegel were reminiscent of the\nGumblar script downloader’s functions.\n\nThe threat was essentially global: web resources containing malicious code were found in\ncountries all over the world.\n\n**Distribution of web resources infected by Trojan-Downloader.JS.Pegel by country:**\n\n**January-October 2010**\n\nUsers in many countries faced the risk of their computers becoming infected with Bredolab.\n\n\n-----\n\n**Distribution of victim computers infected by Trojan-Downloader.JS.Pegel by country:**\n**January-October 2010**\n\nInternet forums were dotted with messages about obfuscated JavaScript code planted on\nlegitimate websites; the code was redirecting users to web resources controlled by cybercriminals.\n\n**An example of a forum message**\n\nAt the start of 2010, there were lots of forum messages similar to the example given here. At the\ntime, one of the main distinguishing features of Pegel were the /*GNU GPL*/, /*LGPL*/, /*CODE1*/\nor /*Exception*/ comments placed at the start of the malicious JavaScript code. The infected\npage’s code looked something like this:\n\n\n-----\n\n**An example of a legitimate web page that has been infected**\n\nLater, the comments disappeared from the code script and the obfuscation became increasingly\ncomplex:\n\n\n-----\n\n**An example of an infected website in which the JavaScript code is more deeply obfuscated**\n\nThe appearance of the links leading to the malicious resources used by Pegel during the early\nmonths of its existence deserves special mention. The domain portion and the route to the\nmalicious script in these links were composed of known domain names, one after the other, for\nexample:\n\nhxxp://twitpic-com.fastclick.com.shinobijp.bestb***site.ru:8080/google.com/google.com/novoteka.ru/vagos.es/radikal.ru/\nhxxp://google-com-sa.scribd.com.google-hr.\n**bestb***site.ru:8080/bu520.com/bu520.com/google.com/56.com/ups.com/**\nhxxp://staples-com.toysrus.com.ngoisao-net.\n**cars***net.ru:8080/google.com/google.com/livedoor.biz/atwiki.jp/torrents.ru/**\n\nSecond level domains were made up of a series of two or three English words that are usually not\nused together. The creation of these malicious links that resembled the URLs of popular web\nresources was one of the most favored methods of social engineering among cybercriminals as\nsuch a technique minimizes user suspicion.\n\nLater, the domain section of the links was also composed of second level domains:\n\nhxxp://help***ecare.at:8080/vkontakte-ru/google.com/chinahr.com.php\nhxxp://jui***ile.ru:8080/sify-com/google.com/last.fm.php\nhxxp://pass***tblues.ru:8080/google.com/kijiji.ca/pornhub.com.php\nhxxp://best***kstar.info:8080/google.com/travian.com/youjizz.com.php\n\nLater still, the long paths disappeared from the links, and the path was changed to index.php.\n\n### Fast-flux networks\n\nDomains containing malicious links were registered in several domain zones, including: ru, info, at,\nand com. Each domain was on five IP addresses and, in turn, each IP address was linked to\nnumerous malicious domains.\n\n**The connections between IP addresses and malicious domains**\n\nThe number of IP addresses fluctuated between twenty and forty. Over time, some addresses\ndropped off and new ones appeared. Periodically, IP addresses connected to certain domains\nwould change.\n\n\n-----\n\n**A records at different points in time**\n\nIt transpired that all of the IP addresses used belonged to a dedicated server, or virtual dedicated\nservers, of a variety of hosting providers. Moreover, further analysis has shown that Port 80 on\nmany such servers communicates with popular websites that have no links to any criminal activity.\nA detailed picture of the situation leads one to believe that the servers hosting malicious domains\nwere potentially hacked. Cybercriminals used some of the registered domains for DNS services on\nthese very same hacked servers. Furthermore, the NS-records — like the A records — changed\nperiodically.\n\n**NS records at various points in time**\n\nThe details described above fit the profile of fast-flux networks, or more specifically, double-flux\nnetworks, where the address of DNS servers also changes.\n\nThere is another interesting fact: in the overwhelming majority of cases, all malicious links pointed\nto Port 8080, while the HTTP headers contained ‘nginx’ as the server’s response in the Server\nfield. Nginx is a very commonly used HTTP server that is often employed as a reverse proxy.\nUsers who follow the malicious link were routed to proxy servers that then redirected the request\nto the botnet’s actual control center.\n\n\n-----\n\nA fast-flux network consisting of proxy servers helps to conceal the botnet s command center from\nIT security professionals. All of the requests to download malicious code sourced from the\nmalicious JavaScript and exploits, as well as Bredolab requests sent to the command center,\npassed through the fast-flux network’s proxy servers.\n\nMost domains on the fast-flux network were registered by the cybercriminals themselves.\nHowever, in the early summer of 2010, some domains appeared that were actually third-level\nsubdomains:\n\nkollinsoy.skyef***on.com\naospfpgy.dogpl***tation.com\noployau.fancou***logger.com\nhosotpoyu.credi***brary.com\n\nWhile the third-level domains pointed to Bredolab’s fast-flux network proxy servers, the secondlevel domains from these links were planted on legitimate sites. The IP addresses of the third-level\nand second-level domains were different from one another. Somehow, probably by hacking user\naccount details or another similar method, the cybercriminals were able to control the DNS\nsettings of these websites.\n\n### Infection of victim computers\n\nAfter Pegel or iframe assisted in redirecting the user’s browser to a malicious site, JavaScript code\nwas downloaded:\n\n\n-----\n\n…that looked like this after deobfuscation:\n\n\n-----\n\nAfter executing, the JavaScript code planted the following HTML-code on the page:\n\nYet another JavaScript code was downloaded from the link.\n\n\n-----\n\n…and following deobfuscation, its fragment looked like this:\n\n\n-----\n\nThis code redirected user requests in the browser to exploits.\n\nThese exploits took advantage of the following vulnerabilities in certain Adobe Acrobat functions,\nincluding: util.printf (CVE-2008-2992), Collab.collectEmailInfo (CVE-2008-0655), Collab.getIcon\n(CVE-2009-0927), and media.newPlayer (CVE-2009-4324); whilst in the virtual Java machine they\ntook advantage of (CVE-2010-0886) and the MDAC RDS.Dataspace ActiveX component (CVE2006-0003).\n\n\n-----\n\n**A fragment of deobfuscated JavaScript code in a PDF exploit**\n\n\n-----\n\nThe Java exploit is downloaded in two stages: the first download is the Applet1.html page, which\ncontained an tag named as a jar file. The exploits are downloaded next.\n\n**The Applet1.html page that downloads a java exploit**\n\nOnce this process has taken place, the exploits are downloaded onto the victim computer and\nproceed to launch the malicious Backdoor.Win32.Bredolab, which then downloads and launches\nother malicious programs.\n\n**The stages of infection of a victim computer**\n\n## The botnet in action\n\nOnce it has launched on a victim computer, and in order to download more malicious programs,\nthe bot will send a request like the one below to its command center:\n\nhttp://ba***il.ru:8080/new/controller.php?\naction=bot&entity_list=&first=1&rnd=981633&id=1&guid=3676040431.\n\nIn the body of the reply from the botnet’s command center, we can see encrypted executables,\nusually in the form of three or four files, which follow one after the other.\n\n\n-----\n\n**A command center reply containing encrypted malware**\n\nThe header of the reply contains the Entity-Info field, which is composed of a list of elements\nseparated by a semicolon. Each element describes one of the executables found in the body of\nthe reply. The element is separated from a numeric field by a colon — for example; the field\nimmediately following each element contains the size of the respective executable file. In this way,\nit is possible to identify where one file ends and the next begins.\n\nThe reply header’s Magic-Number field contains the key to deciphering the body of the reply. It is\ncomposed of numbers separated by the ‘|’ symbol. The first number is the length of the key, and\nthe second denotes the deciphering algorithm. The number 1 being a typical XOR; the rest of the\nfield is the deciphering key. Note that the malicious JavaScript code, the exploits, Bredolab, and\nthe other malicious programs that were installed by Bredolab on the victim computer were all\ndownloaded from the same domains on the Bredolab botnet’s fast- flux network.\n\nBredolab downloaded a fairly wide variety of malicious programs to victim computers:\n\nTrojan-Spy.Win32.Zbot,\nTrojan-Spy.Win32.SpyEyes,\nTrojan-Spy.Win32.BZub,\nBackdoor.Win32.HareBot,\nBackdoor.Win32.Blakken,\nBackdoor.Win32.Shiz,\n\n\n-----\n\nTrojan-Dropper.Win32.TDSS,\nTrojan-Ransom.Win32.PinkBlocker,\nTrojan.Win32.Jorik.Oficla.\n\nThis list is far from complete.\n\nSome of these malicious programs are transmitted in replies to the command center using\nparameters that denote a partner’s identification number. For example, Backdoor.Win32.Shiz,\nwhen downloaded by Bredolab, transmits the parameter seller=15, which means that it was\ninstalled on the system via Bredolab. The transmission of these ID numbers to the command\ncenter usually means that the malicious program is being spread via partners. This, in addition to\nthe variety of software downloaded by Bredolab, points to the way in which the owners of the\nBredolab botnet were making money from their creation: they were generating revenue from\ndownloads. In other words, they sold the software to other cybercriminals in the form of\ndownloads.\n\nOf all of the downloaded software, Trojan-PSW.Win32.Agent.qgg deserves special mention. Once\nit is installed on a victim machine, this Trojan attempts to find the passwords for FTP accounts\nsaved on the following clients:\n\nFilezilla 3 Ftp Explorer\n\nFtp Navigator FlashFXP\n\nBulletProof Ftp FTPRush\n\nCuteFtp Firefox\n\nALFTP Auto FTP\n\nFar 2 Total Command\n\nFrigate 3\n\nWhen it finds any passwords, the Trojan sends them to the cybercriminals’ server.\n\nTrojan-PSW.Win32.Agent.qgg is interesting because the server to which the Trojan sends its\nstolen passwords belonged to the owner of the Bredolab botnet. The stolen FTP account\npasswords helped the cybercriminals to infect legitimate sites with malicious code. This vicious\ncycle turned out to be very effective indeed.\n\n## The malicious cycle\n\nAfter close examination, it became clear how the botnet was created.\n\n1. When visiting a site infected by Pegel or iframe, users’ browsers download a page containing\n\nmalicious JavaScript code.\n\n\n-----\n\n2. This code initiates the download of Bredolab onto the victim computer. In turn, Bredolab\n\ndownloads other malicious programs, including a Trojan that steals passwords to FTP\naccounts. All of these operations take place via reverse-proxy servers which conceal the\nbotnet’s actual command center.\n3. After some time, the website for which the account details were stolen also becomes\n\ninfected. Using stolen usernames and passwords for FTP accounts, some, though not all of\nthe website’s contents are downloaded from the server. Only those files that start with\nindex*, default* and main* are targeted, as well as all of the files with the *.js extension.\nThese files are then uploaded back onto the website having been injected with malicious\ncode. Remarkably, the download and subsequent upload operations take place via\nnumerous IP addresses. Each file can be downloaded from one IP address, and then\nuploaded from another.\n4. After another user visits the infected site, the process described above begins all over again.\n\nClearly, the computers that ended up participating in the infection of the website are proxy servers.\nThe cybercriminals employed two groups of proxy servers: one for infecting victim computers, and\na second for infecting websites. These two server groups do not appear to interact in any way.\n\n**A fragment of the FTP log illustrating the website infection process**\n\n\n-----\n\n**How the Bredolab botnet was created**\n\nThis method of proliferation was employed by the cybercriminals throughout Bredolab’s entire\nexistence.\n\n## Traffic\n\nThe botnet’s self-sustaining capability as described above is no doubt effective, if only for the way\nthat it automated the process of infecting ever more computers. However, it does have one flaw.\nThe scheme starts to work the moment the user is redirected from the infected legitimate resource\nto a malicious domain on the fast-flux network. Furthermore, the number of victim computers\ninfected by Bredolab that have administrative access to some kind of website is limited. This in\nturn reduces the number of web resources that cybercriminals can infect using stolen FTP account\ncredentials. Malware was removed from sites with high hit-rates relatively quickly. The larger the\nnumber of visitors a site had, the higher the probability a user would notice something suspicious\nand file a report with the website’s administrators. So, although the self-sustaining capability is\neffective as mentioned previously, the actual number of infected machines resulting from this\napproach turned out to be too low for the cybercriminals’ purposes.\n\nIn order to boost the effectiveness of their attacks, the cybercriminals needed to increase traffic,\nthat is to say, the number of visitors redirected to malicious fast-flux network domains, so they tried\na variety of methods to accomplish this goal.\n\n\n-----\n\nStarting in December 2009, many legitimate websites, including some very popular ones, were\ninfected with obfuscated JavaScript code in order to redirect users to malicious resources. Had an\nInternet user opened the page in their browser, the code view may well have looked like this\nexample:\n\n**An example of code from an infected website**\n\nAfter the browser deciphered the code, the page was seeded with a code containing TrojanDownloader.JS.Pegel, which then redirected the user to a malicious resource.\n\nUsers may well have received a link to malicious content labeled “with home delivery” in a spam\nemail. In June 2010, the Trojan-Downloader.JS.Pegel.g variant ranked first among the most\nprevalent malicious attachments in email traffic.\n\n\n-----\n\n**The most widespread malicious files delivered by email in June 2010.**\n\nSome malicious spam attacks were relatively sophisticated. In June 2010, there was also a wave\nof spam purporting to be messages from popular websites such as Twitter, YouTube, Amazon,\nFacebook, Skype and others. These emails contained either HTML attachments infected with\nPegel, or links to infected websites.\n\n\n-----\n\n**An example of a spam email with links to a malicious website**\n\nIf a user clicked on the link, the infected site would load an HTML page with the following code into\nthe browser:\n\nPLEASE WAITING 4 SECOND…\n\nAfter a few seconds, the meta-refresh tag would redirect the user to the Canadian Pharmacy\nwebsite, which sells Viagra and other medication.\n\n\n-----\n\n**The Canadian Pharmacy website**\n\nMeanwhile, the link containing the iframe tag would redirect users to one of the proxy servers in\nthe fast-flux network in order to infect the computer with Bredolab.\n\nIn August 2010, another source of traffic was also identified. The Asprox spambot, which is\ncapable of injecting SQL into websites written in ASP, started to infect legitimate websites by\ninjecting an iframe with a link to the ****n.ru/tds/go.php?sid=1 path .\n\nGET /page.asp?id=425;\n\ndeclare%20@s%20varchar(4000);set%20@s=cast(0x6445634c417245204054207661526368615228\n323535292c406320…5205461424c655f435552736f7220%20as%20varchar(4000));exec(@s);\n**An example of an SQL injection used by the Asprox bot**\n\nAfter a user had visited the infected site, their browser would close the link containing the iframe\ntag. This link was injected with a TDS (traffic distribution system), which then redirected the\nbrowser to malicious domains that belonged to the owners of Bredolab’s fast-flux network in order\nto infect the user’s computer with Bredolab. Approximately 10 thousand users per day were\nredirected in this way.\n\nFinally, in September 2010 the latest method used to redirect users to Bredolab’s fast-flux network\ndomains was discovered. Legitimate websites were hacked using the OpenX banner generator. A\nvulnerability was used in the Open Flash Chart 2 component allowing cybercriminals to download\n\n\n-----\n\nfiles of their choice to the server. As a result, popular websites such as thepiratebay.org,\ntucows.com, afterdawn.com, esarcasm.com, and tutu.ru had banner ads replaced. The banner\nads were flash files containing ActionScript code that redirected users to malicious resources. At\nthe same time, a DDoS attack was launched against the official OpenX project site, leaving users\nunable to download engine updates to patch the vulnerability for several days.\n\n**A fragment of a malicious SWF file**\n\n\n-----\n\n**A fragment of ActionScript code planted in an HTTP page tag script with a link to a malicious site**\n\nAfter a strong upsurge in June related to the spread of spam with links to the botnet’s malicious\nresources, Pegel activity diminished. Nevertheless, the threat could have remained very real — if\nthe Bredolab botnet had not been shut down.\n\n## Conclusion\n\nThe owners of the Bredolab botnet created and controlled a network of over 30 million zombie\ncomputers that functioned over a long period of time. In order to keep the botnet up and running,\nthe cybercriminals skillfully and effectively concealed the botnet’s command center using fast-flux\nnetwork techniques. This scheme not only provided reliable sustainability for the botnet’s\ncommand center, it also simplified management of malicious content: instead of having to manage\nmalicious sites on multiple nodes, all the cybercriminals had to do was place one such site on the\ncommand and control centre and set up redirectors.\n\nDue to its complexity, the Bredolab botnet was most likely controlled by more than one person.\nHowever, at this point only one cybercriminal has been arrested in connection with this botnet. It is\npossible that the other participants in this criminal group are still engaging in these activities, since\nthe scheme that they came up with and put into operation is rather effective. The technologies\nused to create and maintain the botnet’s performance — obfuscated JavaScript code that\ndownloads exploits, the repetitive cycle of building up zombie networks, and the creation of\nnetwork infrastructure using fast-flux, among other things — is a worthy addition to the\ncybercriminals’ arsenals.\n\n\n-----\n\nOne of the key features of the Bredolab botnet is the closely repeating cycle it used to build up its\nzombie networks, in which infected computers subsequently infected websites, which in turn\ninfected new victim computers. Furthermore, the search for new ways to redirect users to\nmalicious domains was ongoing. The main source of threat in this instance was the infected\nwebsites that, when visited, would download malicious programs. Information from the infected\nuser computers could then be used to infect new websites.\n\nIn order to protect yourself against this type of threat, you should follow the security\nrecommendations below regarding computers and websites:\n\n**Protecting your computer**\n\nPromptly install updates and patches for your operating system and third-party applications,\nas most exploits and worms take advantages of software vulnerabilities for which patches\nare already available.\nOf course, you must also install a proprietary antivirus program and keep your antivirus\ndatabase up to date. Antivirus programs are not a panacea, but they can significantly\nminimize the risk of computer infection.\nAlways avoid clicking on links in spam emails, instant messaging apps and in messages\nfrom people you are not familiar with on social networks. No further explanation needed.\n\n**Protecting websites**\n\nVulnerabilities in website coding can be used to infect a website. In order to minimize the\nchances that cybercriminals will take advantage of a vulnerability, monitor the software\nupdates released and promptly update your website’s software.\nKeep in mind that some services provide malware code scanning and scanning for\nunauthorized content changes.\nFor security purposes, it is best to switch off any autosave functionality for FTP passwords\nand FTP clients. Remember, many programs that steal FTP account passwords, particularly\nBredolab’s Trojan-PSW.Win32.Agent.qgg, search for passwords that have been saved on an\ninfected computer.\nIt may be useful to make a backup copy of your website from time to time, including any\ndatabases and files that may contain important data, so that your data is safe in the event of\ninfection.\nIf your site becomes infected despite your best efforts to protect it, simply deleting malicious\ncode from the site may not be sufficient. For example, if your FTP password is stolen, the\nsite may be re-infected at a later date. Take the following steps to resolve the issue fully:\n\n1. Check for any updates for the website’s software and download them, this will help to\n\nprevent infection taking place through vulnerabilities.\n2. Use a proprietary antivirus product with the most up-to-date antivirus databases, and\n\ndo a full scan of your computers that have access to the FTP website.\n3. Change the password to your FTP account regularly.\n4. Remove malicious code from the site.\n\n\n-----\n\nBy following the above recommendations, you can help to minimize the risk of your computer\nresources becoming part of a botnet. Don’t forget — it’s always much easier to prevent an\ninfection than it is to deal with the consequences of an infection.\n\n[Botnets](https://securelist.com/tag/botnets/)\n\nAuthors\n\nAlexei Kadiev\n\nEnd of the Line for the Bredolab Botnet?\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-12-20 - End of the Line for the Bredolab Botnet-.pdf"
    ],
    "report_names": [
        "2010-12-20 - End of the Line for the Bredolab Botnet-.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535605,
    "ts_updated_at": 1743041609,
    "ts_creation_date": 1653709213,
    "ts_modification_date": 1653709213,
    "files": {
        "pdf": "https://archive.orkl.eu/b3da58b2f532bc09bb520408c4cf464aede7c1f8.pdf",
        "text": "https://archive.orkl.eu/b3da58b2f532bc09bb520408c4cf464aede7c1f8.txt",
        "img": "https://archive.orkl.eu/b3da58b2f532bc09bb520408c4cf464aede7c1f8.jpg"
    }
}