{
    "id": "350e286d-a84c-4e5c-88ef-03d9a2427ea6",
    "created_at": "2022-10-25T16:48:14.574542Z",
    "updated_at": "2025-03-27T02:16:26.304249Z",
    "deleted_at": null,
    "sha1_hash": "992959657614e0598cdac414b7796dc37b6eab0d",
    "title": "Chinese Influence Operations Evolve in Campaigns Targeting Taiwanese Elections, Hong Kong Protests",
    "authors": "",
    "file_creation_date": "2020-04-23T13:54:27Z",
    "file_modification_date": "2020-04-23T13:54:48Z",
    "file_size": 6889199,
    "plain_text": "CYBER THREAT ANALYSIS |\n\n# Chinese Influence Operations Evolve in Campaigns  Targeting Taiwanese Elections, Hong Kong Protests\n\n\n## By Insikt Group\n\n\n**®**\n\n\n-----\n\n_Recorded Future analyzed data from the Recorded Future® Platform, social media_\n_sites, local and regional news sites, academic studies, information security reporting,_\n_and other open sources (OSINT) for updates on Chinese state-sponsored influence_\n_operations targeting the 2020 Taiwanese presidential elections and Hong Kong protests._\n_This report covers topics and information from September 21, 2019 through March 20,_\n_2020 and will be of most value to government departments, geopolitical scholars and_\n_researchers, and all users of social media._\n\n### Executive Summary\n\nAs outlined by previous [Insikt Group](https://www.recordedfuture.com/china-social-media-operations/) [research, Chinese influence](https://www.recordedfuture.com/covid-19-chinese-media-influence/)\noperations often aim to present a positive, benign, and cooperative\nimage of China to foreign audiences. However, we have discovered\nthat there is a more aggressive and coercive side of Chinese\ninfluence operations when it comes to the targeting of Taiwan\nand Hong Kong, regions that China has long viewed as domestic\nterritory.\n\nThis research focuses on emerging tactics, techniques, and\nprocedures (TTPs) that Chinese state-affiliated or state-friendly\nactors have deployed in campaigns targeting the 2020 Taiwan\npresidential election and the 2019-2020 Hong Kong protests. In the\ncontext of Taiwan, we observed Chinese state-affiliated activities\nstealthily targeting every segment of the influence operations\nlifecycle, from production and amplification to dissemination. With\nrespect to the 2019 Hong Kong protests, we observed new attack\nmethods, infrastructure, and grassroot groups being deployed in\nnontraditional ways to defend and promote Chinese nationalistic\npropaganda and state interests.\n\n### Key Judgments\n\n - We assess that content farms will continue to play a leading\n\nrole in enabling mainland Chinese disinformation efforts\ntargeting Taiwan.\n\n - Taiwan’s unique efforts to discover, identify, and counter\n\nChinese state-sponsored influence operations will likely\nforce Chinese influencers to innovate and use more covert\noperational TTPs. We believe that these new tactics will likely\ninclude recruitment of overseas Chinese nationals, co-option\nof Taiwanese content farms and social media influencers, use\nof cover organizations, procurement of aged social media\naccounts, and more.\n\n\n-----\n\n - We assess that Chinese influence operators will likely employ\n\nartificial intelligence (AI) and bulk social media management\nsoftware to ease the propagation of weaponized content at\nscale, especially on closed messaging platforms such as LINE\nor WhatsApp. Western social media platforms will also be\nlikely targets for such automated campaigns during sensitive\nperiods such as elections and global events, on issues that are\nrelevant to China’s national image and state interests.\n\n - We judge that China will seek to identify local collaborators in\n\nTaiwan and Hong Kong, or those with policy or political views\nsympathetic to China, such as public figures, politicians, and\nmarketing firms, to obfuscate China as the information source\nand increase its perceived authenticity.\n\n - We assess that new TTPs used to target Hong Kong protesters\n\n— crowd-sourced doxxing of anti-government protesters and\nsocial media “rallies” to support Chinese state interests — are\nlikely to become regularly deployed tools in Chinese domestic\nand overseas influence operations.\n\n - We assess that the Chinese government is likely to start\n\nleveraging the existing patriotism and capabilities of online\ngrassroot groups to promote and defend state interests\nabroad through explicit direction and implicit nudging.\n\n### Background\n\nTaiwan and Hong Kong have long been geopolitical flashpoints for\nthe mainland Chinese government, which has struggled to build\nand maintain a legitimate standing with the people of these two\nspecial-status “regions,” both of which Beijing views as its sovereign\nterritory and key elements of overall domestic stability.\n\nFrom a tactical standpoint, the mainland Chinese government views\nboth Taiwan and Hong Kong as domestic information space. As a\nresult, it is not unusual to observe active Chinese intelligence and\ninfluence tactics in use that have not been traditionally employed\nin other foreign spaces.\n\n\n-----\n\nIn this research, Insikt Group focuses on new TTPs that have been\nused to target the most important political events in Taiwan and\n[Hong Kong this past year — namely, the 2020 Taiwan presidential](https://www.aljazeera.com/news/2020/01/tsai-ing-wen-takes-lead-taiwan-presidential-election-200111114329525.html)\n[elections, which were held on January 11, 2020, and the series of](https://www.aljazeera.com/news/2020/01/tsai-ing-wen-takes-lead-taiwan-presidential-election-200111114329525.html)\n[large-scale Hong Kong protests that started in June 2019 in reaction](https://www.reuters.com/article/us-hongkong-protests/hong-kong-extradition-bill-officially-killed-but-more-unrest-likely-idUSKBN1X20OF)\nto the 2019 Hong Kong Extradition Bill. The data sets we used were\nfrom September 21, 2019 through March 20, 2020 for the Hong\nKong protests, and from October 1, 2019 through January 22, 2020\nfor the Taiwanese elections.\n\n### Taiwan’s 2020 Presidential Elections\n\nRecorded Future observed a spike in references to “disinformation,”\n“fake news,” and “influence operations” in the context of Taiwan\nbetween October 2019 and January 2020. In the first half of\nJanuary alone, our analysts observed 1,223 references, compared\nwith the 775 references observed in December 2019, with peak\n[volume immediately following the Taiwanese presidential elections](https://www.nytimes.com/2020/01/11/world/asia/taiwan-election-china.html)\non January 11, 2020, in which incumbent president Tsai Ing-wen\nsuccessfully won a second term.\n\nDespite the conclusion of the 2020 Taiwanese election cycle and the\nsubsequent drop in references to disinformation campaigns and\nfake news targeting Taiwan, Recorded Future assesses it is highly\nlikely that Chinese influence operations aimed at dividing Taiwanese\nsociety and promoting pro-China narratives and political candidates\npersist. Beijing has adopted this approach toward Taiwan since\nPresident Tsai of Taiwan’s Democratic Progressive Party (DPP)[1] first\nunseated the pro-China Kuomintang (KMT, the Chinese Nationalist\nParty) in 2016.\n\nHowever, it is important to note that different parties in Taiwan\nalso engage in online campaigns to sway public opinion to their\nrespective interests, some of which are aligned with Chinese\nCommunist Party (CCP) interests and employ similar TTPs. This\nconvergence in interests, policy goals, and TTPs occasionally\npresents difficulties in distinguishing between Chinese (mainland)\ninterference activity and Taiwanese political activity. We distinguish\nbetween the two types of activities to the best of our knowledge in\nthe following analysis.\n\n1 The DPP is one of two major political parties in Taiwan, and has been traditionally\nassociated with promoting human rights, anti-communism, a distinct Taiwanese identity,\n\n\n-----\n\n**Covert Influence**\n\nThis section describes TTPs used by Chinese covert influence\noperators to target Taiwanese users across Facebook, the popular\nmessaging app LINE, and YouTube. We also assess the role and\nimpact of Chinese content farms in the disinformation supply chain\ntargeting Taiwan, and highlight associated TTPs:\n\n**• Content Farms: Publishing fake news stories in English, AI-**\n\ngenerated content, and China-friendly Taiwanese content\nfarms\n\n**• Facebook: Employment of PR firms for Facebook influence**\n\noperations, recruitment of Taiwanese influencers, and the use\nof Chinese software for monitoring and batch posting\n\n**• LINE: Use of Chinese software for monitoring and batch**\n\nposting\n\n**• YouTube: Use of Chinese influencers to shape narratives on**\n\nTaiwanese affairs, and the recruitment of Taiwanese YouTube\ninfluencers\n\n**Content Farms**\n\nChinese and Taiwanese content farms[2] have become one of the\nbiggest sources for misleading, intentionally biased, and false\ncontent in Taiwan. According to the database of Taiwanese\nfact-checking website [MyGoPen (which translates to “don’t lie”](https://www.mygopen.com)\nin Taiwanese), at least 60% of false or misleading information\nforwarded to the site are from foreign [sources, the majority of](http://www.twreporter.org/a/information-warfare-business-disinformation-fake-news-behind-line-groups)\nwhich are from mainland China. Oftentimes, Taiwanese content\n[farms also source content from Chinese sources, including Chinese](https://www.youtube.com/watch?v=cn1Jh7w61_Q)\ncontent farms, Weibo posts, WeChat posts, and Chinese state media\nor state-affiliated platforms.\n\n2 We make a distinction between Chinese-originated and Taiwanese-originated content\nfarms. Either may propagate material in simplified or traditional Chinese, or in any\nnumber of dialects, so the key factor in our determination is who the owners and/or\noperators are.\n\n\n-----\n\nAside from common tactics to generate internet traffic from\nTaiwanese users, such as crafting sensational titles for news articles\ncopied from local news outlets, Taiwanese researcher Puma Shen\nhas [observed an evolution of tactics, with Chinese operators](https://advox.globalvoices.org/2020/01/22/how-fake-news-and-disinformation-were-spread-in-the-run-up-to-taiwans-presidential-elections/)\ncreating English-language content farms. In these content farms,\nEnglish articles are first translated to written simplified Chinese and\nthen to traditional Chinese (the official written characters of Hong\nKong and Taiwan, rather than the simplified Chinese characters\nused by mainland Chinese) before being disseminated to Taiwanese\nusers. We believe this evolution is likely for the purpose of deceiving\nthe growing pool of Taiwanese internet users who have learned to\nverify news sources.\n\nWhile we have not observed instances of content from Englishlanguage content farms being disseminated to Western audiences,\nwe assess that such infrastructure and English-language content\ncreation capabilities could be leveraged to target Western audiences.\n\nAnother emerging tactic used by both Chinese and Taiwanese content\nfarms is the use of AI to generate massive volumes of content. In a May\n[2019 report on how to combat disinformation, Taiwan’s Mainland Affairs](https://hackmd.io/@billy3321/rkxYFmuiN/%2Fs%2Fr1I3q7diN?type=book)\nCouncil — the agency responsible for China policy — speculated that\nChina had been using AI technology in influence operations targeting\nTaiwan. This speculation was [corroborated by Taiwanese online](https://www.twreporter.org/a/information-warfare-business-weapons)\nmarketer and renowned public opinion manipulator Peng Kuan Chin (彭\n冠今). Peng created a “Content Farm Automatic Collection System” that\ncrawls the internet for Chinese articles and posts and reorganizes the\nwords and sentences into new text, generating thousands of articles\nper day. Peng’s software is modeled on automation software he saw\n[in China, which he believes no one else outside the mainland has.](https://www.buzzfeednews.com/article/craigsilverman/disinformation-for-hire-black-pr-firms)\n\nAdditionally, while Recorded Future has not observed evidence of\nChinese manipulation of Taiwanese content farms, we assess that\noperators of popular Taiwanese content farms are likely to be seen\n[as valuable assets for Chinese influence operations. One example is](https://www.twreporter.org/a/information-warfare-business-content-farm-mission)\nLin Cheng Kuo (林正國), the owner and active contributor to one of\nTaiwan’s most popular content farms, Mission (密訊).[3] Mission is one of\nthe most shared sources on Facebook Taiwan (zh-tw.facebook[.]com),\nat times surpassing major local news outlets. Investigative news outlet\n\n3 The original Mission domain was mission-tw[.]com, but it has frequently changed\ndomains to circumvent Facebook filters since being tagged as a content farm and banned\nfrom Facebook’s News Feed in October 2019.\n\n\n-----\n\n[The Reporter recently revealed that Lin Cheng Kuo is an active member](https://www.twreporter.org/a/information-warfare-business-content-farm-mission)\nof Taiwan’s New Party, which supports unification with Mainland China.\nAdditionally, he has been photographed attending events held by\nChina’s provincial-level state-owned news station Hai Xia Dao Bao (\n海峡导报), alongside Chinese media personalities. We assess that,\nbecause popular Taiwanese content farms are so vital to spreading\ninformation to the Taiwanese public, owners and operators are likely\nto be seen as potential assets for Chinese influence operators.\n\n**Facebook**\n\n[Social media penetration in Taiwan is the highest in Asia, with 89%](https://tfc-taiwan.org.tw/articles/1624)\nof the population using social media at least once per day. Facebook\n[is one of the most popular social media outlets in Taiwan, with 89%](https://www.slideshare.net/DataReportal/digital-2019-taiwan-january-2019-v01)\nof Taiwanese internet users reported to use the platform. Facebook\nhas become a prime target for Chinese influence operations in\nTaiwan, probably because of its wide reach and product stickiness.\nAccording to Taiwanese researcher Puma Shen, many content farms\nhave relied on Facebook “fan” pages to spread disinformation.\nHowever, many of these pages were banned or deleted in 2019, so\n[content farmers have resorted to employing freelance individuals](https://advox.globalvoices.org/2020/01/22/how-fake-news-and-disinformation-were-spread-in-the-run-up-to-taiwans-presidential-elections/)\nin Malaysia, or other overseas Chinese nationals, to disseminate the\ncontent farm’s misleading content across Facebook. We assess that\nthis trend toward employing more covert means of disseminating\ndisinformation via local third parties on Facebook will accelerate as\nFacebook tightens enforcement of its content policies.\n\nIn the first half of 2019, multiple owners of popular Taiwanese\n[Facebook fan pages disclosed screenshots of strangers attempting](https://www.thenewslens.com/article/116816)\nto purchase their fan pages. While speculation is rife on social\nand traditional media that the purchasers are mainland Chinese\ncitizens, these attempts have not been directly attributed to Chinese\n[nationals. However, according to the testimony of the owner of a](https://www.cw.com.tw/article/articleLogin.action?id=5094863)\nTaiwanese online marketing firm that specializes in PTT[4] influence\ncampaigns, other marketing firms in the industry are conducting\nFacebook influence campaigns on behalf of the CCP, mostly through\ndisseminating images and short commentaries criticizing the\ncurrent administration.\n\n4 PTT is the largest terminal-based bulletin board system (BBS) based in Taiwan.\n\n\n-----\n\nAdditionally, we have identified Chinese provincial governments\nrecruiting “mainland-friendly, pro-unification” Taiwanese\ninfluencers through Facebook posts, with the aim of “training a\ngroup of Taiwanese influencers with distinct political affiliations.”\nThe listings are often posted on behalf of the Chinese government\nagencies by Taiwanese locals, with one listing offering a base salary\nof ¥5,000 to ¥10,000 RMB (approximately $730 to $1,460 USD).\n\n_[Facebook post recruiting Taiwanese influencers for the Sichuan government. (Source: HK01)](https://www.hk01.com/%E5%8D%B3%E6%99%82%E4%B8%AD%E5%9C%8B/316429/%E6%94%B6%E8%B2%B7-%E5%A4%A7%E5%AD%B8%E7%94%9F%E4%BA%86%E6%B2%92-%E5%89%8D%E5%A5%B3%E6%98%9F%E6%8B%9B%E5%8B%9F%E5%8F%B0%E7%B6%B2%E7%B4%85-%E5%9C%8B%E5%8F%B0%E8%BE%A6-%E8%87%AA%E5%B0%8E%E8%87%AA%E6%BC%94%E7%9A%84%E5%81%87%E6%96%B0%E8%81%9E)_\n\n\n-----\n\n**LINE**\n\n[LINE is the most popular messaging app in Taiwan, with 21 million](https://www.inside.com.tw/article/17901-line-friend-new-feature)\nusers (about 90% of Taiwan’s population). According to [research](https://www.inside.com.tw/article/17901-line-friend-new-feature)\nrevealed by LINE in October 2019, Taiwanese users are unique in\ntheir love of using the “share” feature, which allows users to forward\ntext, image, or video messages to other users and message groups\nwithin LINE. The share feature is used approximately a hundred\nmillion times per month by Taiwanese users, which is 40% of the\ntotal “shares” globally. This feature operates similarly to the “share”\nfeature in WhatsApp, which is widely used by Indian nationals\nand has [facilitated the mass dissemination of disinformation in](https://www.wired.com/story/how-whatsapp-fuels-fake-news-and-violence-in-india/)\nIndia. We assess that the speed and breadth of sharing on LINE\nmay render Taiwanese users particularly susceptible to Chinese\ninfluence operations.\n\nChinese operators may also benefit from social media management\n[technologies, including a Chinese-developed software called “Cross-](https://www.facebook.com/kaifu.cheng911/videos/572070186548611/)\nBorder Cloud/Mass Management System” (跨境云/群控系统), which\nallows users to batch manage thousands of social media accounts\nat once (including Facebook, Instagram, WeChat, WhatsApp, LINE,\nQQ, and TikTok). The software [allows users to breach the Great](https://www.douban.com/note/666452637/)\nFirewall, change their IP addresses, batch create and translate\nposts (including converting written simplified Chinese content to\ntraditional Chinese), batch manage groups, batch “like” and “share”\nposts, and more.\n\nAt this time, links between this software and mainland Chinese\ninfluence operations targeting Taiwan [remain speculative and](https://taronews.tw/2018/11/28/188898/?fbclid=IwAR0T8ojCgjr4SvA4cdo-ALSyw1aTa87Hq7_iZjlHCVKkyOnByAkG_yKY8jo)\nunsubstantiated; however, we believe that these technologies are\nlikely currently being employed. That is because these technologies\ncan ease the spread of weaponized content at scale, especially on\nclosed messaging platforms such as LINE, where Taiwanese users\nfrequently reshare content.\n\n\n-----\n\n_[Screenshot of the cross-border cloud/mass management system UI for WhatsApp. (Source: Facebook)](https://www.facebook.com/kaifu.cheng911/videos/572070186548611/)_\n\n**YouTube**\n\nYouTube is also one of the most popular social media platforms in\n[Taiwan, with 90% of Taiwanese internet users using the platform](https://www.slideshare.net/DataReportal/digital-2019-taiwan-january-2019-v01)\n[and 70% of those users visiting every day.](https://www.ipsos.com/sites/default/files/ct/publication/documents/2019-10/n108_bht_taiwanese_turn_to_youtube_for_online_video_content.pdf)\n\nResearchers have [observed that Chinese influence activity on](http://www.taipeitimes.com/News/taiwan/archives/2019/11/12/2003725694)\nYouTube has increased in 2019. 10 YouTube channels were created\nbetween August and October 2019 that all focused on attacking\nthe administration of President Tsai Ing-wen. These researchers\nbelieve that some of the channels, which have more than 10,000\nsubscribers, are likely content farms run by Chinese nationals.\n\n\n-----\n\n[One example is the YouTube channel “Xida speaks on Taiwan at the](https://www.youtube.com/channel/UCyx-N7RptKcBH9dDVm9RZDQ/featured)\nfoot of Yushan” (Yushan is the tallest mountain in Taiwan), which\nfeatures China National Radio journalist and show host Zhang Xida\n(张希达). On the channel, Zhang attempts to speak Mandarin with\na Taiwanese accent and comments on Taiwanese politics, mostly\nattacking the country’s ruling DPP administration. China National\nRadio is the national radio station of China, and is under the purview\nof the Central Publicity Department of the CCP and the State Council\nof the People’s Republic of China. The videos on the channel feature\nsubtitles and graphics in traditional Chinese characters, which we\nassess is because the channel is highly likely to be targeting a\nTaiwanese audience. 15 videos were posted between August 23\nand October 18, 2019, although the channel itself was created on\nAugust 3, 2014. At the time of this writing, the channel had 638,000\nsubscribers.\n\n_[Xida’s video titled “U.S. Interference of Taiwanese Elections — TAIPEI Act.” (Source: YouTube)](https://www.youtube.com/watch?v=Eksm7yylxmY)_\n\nInfluence operations researcher Puma Shen has also [observed](https://www.cw.com.tw/article/article.action?id=5098365)\nadvertisements listed by organizations affiliated with the United\nFront Work Department of the CCP (the agency [responsible for](https://www.uscc.gov/research/chinas-overseas-united-front-work-background-and-implications-united-states)\ncoordinating influence operations to neutralize opposition to the\nCCP) recruiting Taiwanese YouTube influencers.\n\n\n-----\n\nWhile none of these observed activities have been attributed directly\nto the CCP, Recorded Future assesses that we will see more Chinese\nand Taiwanese channels on YouTube promoting issues and political\nstances that are in the Chinese national interest in the few years\nleading up to the next Taiwanese presidential election.\n\n**Overt Influence**\n\nBetween October 1, 2019 and January 22, 2020, Recorded Future\nobserved 801 references to Taiwan, “Tsai Ing-wen,” and “Han Kuoyu” (the KMT presidential candidate) from the social media accounts\nof Chinese state-owned and state-affiliated media. Consistent with\nthe roles of state media as mouthpieces of the CCP, messaging from\nthese accounts falls into several major themes that are aligned with\nChina’s overall “carrot and stick” strategy towards Taiwan: criticism\nof the DPP administration and their policies, threats to deter\n[Taiwanese independence or any deviation from the “One China”](https://www.bbc.com/news/world-asia-china-38285354)\npolicy, and promotion of economic and cultural opportunities that\ncome with closer cross-strait ties.\n\nIn terms of emerging trends in overt influence by state media, we\nbelieve that two factors will be key in the coming years: first, the\nincreased targeting of the younger generation of Taiwanese internet\nusers, and second, the state media’s leveraging and amplification\nof false or biased content from social media and content farms.\n\n**Increased Targeting of Taiwanese Youth**\n\nRecorded Future observed a steady rise of references to Taiwanese\n“youth” and “young people” from the same set of accounts over the\npast five years, with a spike in references in the past year, peaking\nright before the January 2020 Taiwan elections. Most references\ncentered around career opportunities and testimonies offered by\nyoung Taiwanese that have found success in mainland China.\n\n\n-----\n\nImmediately following the January 2020 re-election of President\nTsai, PRC state media Xinhua News Agency published a statement\non social media made by Taiwan Affairs Office spokesperson Ma\nXiaoguang, stating that “[...] young people on both sides of the\nstrait should communicate more and more. We will never give up\non the Taiwanese young people. We will continue to introduce a\nseries of policies through continuous exchanges. The measures\nwill create conditions for cross-strait youth to increase mutual\nunderstanding, improve the correct understanding of cross-strait\nrelations, and promote a more objective and correct understanding\nof the mainland.”\n\nWhile these posts account for a small subset of the posts mentioning\nTaiwan, we assess that this may indicate that the Chinese state has\nrealized the deciding role that the younger generation of Taiwanese\nvoters is increasingly playing in public opinion and elections.\n\n_References to Taiwan’s “youth” or “young people” by Chinese state-affiliated Twitter accounts. (Source: Recorded_\n_Future)_\n\n\n-----\n\n**Leveraging and Amplifying Social Media and Content Farms**\n\nNot only do both Taiwanese and Chinese content farms copy\ncontent originating from Chinese state media, but investigations\nhave also shown that state media reference and amplify fake or\nbiased content that originates from social media and content farms.\n\nExamples include the 2018 Banana Crisis, during which Xinhua News\n[referenced “Taiwanese public opinion,” saying that “deteriorating](http://www.xinhuanet.com/fortune/2018-06/11/c_1122969778.htm)\nrelations with mainland China brought on by the current\nadministration” was one of the main drivers of plunging banana\nprices. The Xinhua article was further [shared by Chinese content](https://kknews.cc/agriculture/28pje69.html)\nfarms including KKNews. Investigative news outlet The Reporter\n[later discovered that the false information had originated from the](https://www.twreporter.org/a/information-warfare-business-content-farm-mission)\nTaiwanese content farm Mission and morphed as it was shared and\ncopied between anti-DPP Facebook groups and different content\n[farms. A false news story smearing President Tsai published by the](https://taiwan.huanqiu.com/article/9CaKrnKbS0l)\nGlobal Times had [followed a similar creation and dissemination](https://books.google.com/books?id=T1e_DwAAQBAJ&newbks=1&newbks_redir=0&lpg=PP1&dq=%E5%85%A8%E9%9D%A2%E6%BB%B2%E9%80%8F%20%3A%20%E4%B8%AD%E5%9C%8B%E6%AD%A3%E5%9C%A8%E9%81%99%E6%8E%A7%E8%87%BA%E7%81%A3&pg=PP1#v=onepage&q=%E5%85%A8%E9%9D%A2%E6%BB%B2%E9%80%8F%20:%20%E4%B8%AD%E5%9C%8B%E6%AD%A3%E5%9C%A8%E9%81%99%E6%8E%A7%E8%87%BA%E7%81%A3&f=false)\nprocess and been shared by numerous content farms.\n\n### Hong Kong Protests\n\nBetween September 21, 2019 and March 20, 2020, Recorded Future\nobserved approximately 230,000 references to Hong Kong protests,\nan 11.9% drop from the approximately 261,000 references observed\nin the prior six months (March 21 to September 20, 2019). However,\nit is worth noting that the first mentions appeared in June 2019, when\nthe protests started. Of the 228,000 references, 692 mentions were\nrelated to “disinformation,” “fake news,” or “influence operations.”\nMuch of the reporting was focused on influence operations — some\nattributed to the Chinese government — carried out on social media\n[(such as Twitter, Facebook, and YouTube), which Recorded Future](https://www.cyberscoop.com/paul-nakasone-nsa-hong-kong-protests/)\nassesses will continue to be a common TTP employed by Chinese\nstate-sponsored groups.\n\n\n-----\n\nWe highlight two new TTPs observed in the past six months that\nhave been employed by Chinese state-backed groups or groups\nthat are supportive of the state: first, the crowd-sourced doxxing\nof anti-government protesters, and second, social media “rallies” to\nsupport Hong Kong police and authorities, and the Chinese state.\nRecorded Future assesses that these are likely to become regularly\ndeployed tools in Chinese influence operations due to the general\nrise of Chinese grassroot patriotism and national pride that are the\ndriving forces behind these campaigns.\n\n**Crowd-Sourced Doxxing of Protestors**\n\nSince August 2019, Recorded Future has observed multiple websites\nand Telegram channels or groups created for the purpose of “doxxing”\nanti-government protesters, publicly revealing their PII and possibly\nexposing them to cyberbullying or other malicious targeting. These\nwebsites collect submissions of doxxing information via an official\ncontact email and publish doxxed profiles in well-designed, uniform\ntemplates without revealing their sources. In this report, we focus\non two of the biggest doxxing websites: HKLeaks and Hong Kong\nMob.\n\n**HKLeaks**\n\n**Original Domain** _hkleaks[.]org (Registered on August 15, 2019)_\n\n**Active Domain(s)** _hkleaks[.]pk, hkleaks[.]ml_\n\n**Contact Email(s)** hkleaks@yandex.com\n\n**Related Telegram Accounts[5]** @hkleaks, @hongkong_nes\n\nHKLeaks is the most prominent and widely reported doxxing site\ntargeting anti-government protesters. It has been [referenced by](https://www.dw.com/en/hong-kong-protesters-personal-data-leaked-by-russian-website/a-50515519)\nChinese state media and foreign news outlets alike. The site has\nused at least 12 known top-level domains (full list in Appendix A)\nsince its creation, likely to avoid takedown requests by Hong Kong\nauthorities, as it is illegal to disclose certain personal details of an\nindividual without their consent.\n\n5 Telegram accounts that are possibly managed by the same actors or majorly promote\ncontent from the specific doxxing site.\n\n|Original Domain|hkleaks[.]org (Registered on August 15, 2019)|\n|---|---|\n|Active Domain(s)|hkleaks[.]pk, hkleaks[.]ml|\n|Contact Email(s)|hkleaks@yandex.com|\n|Related Telegram Accounts5|@hkleaks, @hongkong_nes|\n\n\n-----\n\nHKLeaks includes pages that “debunk (anti-government) rumors,”\nlist out entities branded as “accomplices of protesters” (including\nchurches, restaurants, corporations, and schools), and break down\ndoxxed targets into seven different categories. Doxxed targets\ninclude eight teachers that are seen as supporters of the protests\n(such as the principal of the Chinese University of Hong Kong), 61\njournalists and editors of Apple Daily (one of Hong Kong’s biggest\nnewspapers), 23 individuals who allegedly doxxed the Hong Kong\npolice, numerous pro-democracy lawmakers and opinion leaders,\nand more than 900 protesters. A doxxed profile would include a\nheadshot and information such as the individual’s full name, current\noccupation, date of birth, telephone numbers, Facebook accounts,\naddress, and a brief description of their “misdeeds.”\n\nAccording to [data from social media monitoring platform](https://www.dw.com/en/hong-kong-protesters-personal-data-leaked-by-russian-website/a-50515519)\nCrowdTangle, as of November 2019, more than two million people\nfollow Facebook pages that have shared HKLeaks’s posts. HKLeaks is\nalso promoted by Twitter accounts, Telegram groups and channels,\nand Weibo accounts.\n\nThe doxxing has real-life consequences for some of the victims — a\nfemale reporter from Apple Daily, for instance, received hundreds\n[of threatening calls. Anecdotal evidence presented by some of the](https://www.hongkongfp.com/2019/11/01/bulletproof-china-backed-doxxing-site-attacks-hong-kongs-democracy-activists/)\nvictims allege that authorities from mainland China may be involved.\nA victim told AFP that he gave a “fake address I’ve never given to\nanyone” to Chinese police while he was questioned at the border\nwhen returning to Hong Kong from a business trip in mainland\nChina in August, which showed up as his address on HKLeaks.\n[Another victim told Apple Daily that his photo on the website was](https://globalvoices.org/2019/09/19/china-central-television-urges-netizens-to-doxx-hong-kong-protesters-and-reporters/)\nthe photo he used on his China travel card.\n\nWhile we are unable to attribute the creation and management\nof the site to an individual or group of individuals, we assess that\nHKLeaks is almost certainly the result of a highly coordinated effort\nand heavy resource investment.\n\n - The continuous curation of doxxing information and\n\nproduction of customized, professional-quality graphics over a\nperiod of months show a sustained resource investment.\n\n\n-----\n\n - The constant shift of domains, the use of bulletproof hosting,\n\nand the use of anonymous registration indicate an intent to\nevade takedown and prosecution. A prominent message on\nthe top of the homepage reads, “We declare that this site will\nnever shut down!”\n\n - HKLeaks has been promoted on social media by accounts\n\nsimilar to those taken down by platforms for coordinated\n[inauthentic behavior linked to state-backed actors. Some](https://www.aspistrategist.org.au/doxxing-the-pro-democracy-movement-in-hong-kong/)\n[social media accounts were created shortly before the website](https://www.hongkongfp.com/2019/11/01/bulletproof-china-backed-doxxing-site-attacks-hong-kongs-democracy-activists/)\nwas created in August 2019; others were old, idle accounts\nthat were revived around the same time.\n\n_Screenshot of HKLeaks’s homepage. (Source: HKLeaks)_\n\n**Hong Kong Mob**\n\n|Original Domain|hongkongmob[.]com|\n|---|---|\n|Active Domain(s)|No longer active|\n|Contact Email(s)|hongkongmob@yandex[.]com, hongkongmob@protonmail[.]com, hongkongmob@163[.]com|\n|Related Telegram Accounts|@hongkongmob, @hongkongmobchannel, @Tearmask|\n\n\n-----\n\nHong Kong Mob is a doxxing site that provides cash rewards to\npeople who provide either new doxxing targets or information on\nexisting targets. Individuals can submit new doxxing targets via\nthe official contact email address, and can provide information of\nexisting targets through an online form on the website.\n\nInformation requested includes Facebook and other social media\naccounts, and the misdeeds of the target. The first person to\nprovide “useful information” will receive the reward; if multiple\npeople provide useful information, the cash reward would be split\namong the individuals. The website accepts donations for its cash\nreward fund.\n\n[While Hong Kong Mob is no longer active, the most recent capture](https://web.archive.org/web/20200114151302/http://www.hongkongmob.com/index-2.html)\nfrom WayBack Machine on January 14, 2020 shows a banner on the\nhomepage stating that 62 protesters have been doxxed, 46 doxxing\ntargets are outstanding, and 78,019 HKD (approximately $10,048\nUSD) worth of cash rewards have been awarded.\n\nHong Kong Mob also includes a page that lists out links to similar\npro-Hong Kong government and anti-protester websites, Telegram\ngroups and channels, and Facebook groups and pages.\n\nAccording to its “About Us” page, the website was created by two\ngroups: “Global Volunteers Against Hong Kong’s Pro-Independence\nMob” (全球反港獨暴徒志願者聯盟), and “Volunteers to Protect Hong\nKong” (守護香港志願者聯盟). Recorded Future is unable to attribute\nthese two groups, nor are we able to confirm that they are indeed\ntwo separate groups. However, we assess that the actors behind\nHong Kong Mobs are likely not Hong Kong natives, but are attempting\nto pass off as such. Although most of the website is written in\ntraditional Chinese characters (rather than the simplified Chinese\ncharacters used by mainland Chinese) and the content mirrors\nwritten and spoken Cantonese (which uses distinct characters and\nwording that is different from the written Chinese of Taiwan and\nmainland China), some terms and wording used on the website are\nnot commonly used by Hong Kong-born Cantonese speakers.\n\n\n-----\n\n_[Screenshot of Hong Kong Mob. (Source: Wayback Machine)](https://web.archive.org/web/20200102013558/http://www.hongkongmob.com/index.html)_\n\n**Possible Connections Between Doxxing Websites**\n\nRecorded Future has observed similarities between HKLeaks and\nHong Kong Mob:\n\n**• Same Hosting Infrastructure: Both sites were hosted by a**\n\nRussian bulletproof host service, DDoS-GUARD. Initial domains\nwere hosted on the same IP address block, with hkleaks[.]org\nhosted on 185.178.208[.]149 and hongkongmob[.]com hosted\non 185.178.208[.]143.\n\n**• Same Domain for Contact Email: Both contact emails are**\n\nhosted by Russian email service provider Yandex.\n\nWhile these similarities are not sufficient evidence to support a\nconnection between these two websites, Recorded Future notes that\nthese similarities are not shared with other doxxing websites such\n[as jophk[.]com. We assess that the use of Russian hosting services](https://web.archive.org/web/20191106040253/https://jophk.com/)\nand email hosts by the websites’ creators are likely to maintain\nanonymity and evade takedown or data disclosure requests from\nthe Hong Kong government or other relevant jurisdictions rather\nthan attempting to pose as Russian actors.\n\n\n-----\n\nIt is also worth noting that many of these doxxing websites and social\nmedia groups and channels also promote similar anti-protester,\nor doxxing, websites and social media channels as resources.\nWe assess that this is due to the political motivation behind the\ncreation of these websites and groups, which eliminates the sense\nof competition between different websites for online traffic and\nexposure, as they are all supporting the same cause.\n\n_[@hkleaks Telegram and Hong Kong Mob link to similar channels and websites. (Source: Telegram, WayBack](https://www.hottg.com/hkleaks/webview)_\n_[Machine)](https://web.archive.org/web/20200114151303/http://www.hongkongmob.com/links.html)_\n\n**Interactions With State Media**\n\nOn September 18, 2019, the official Weibo account of CCTV, China’s\n[state-owned TV network, published a video showcasing the HKLeaks](https://www.weibo.com/2656274875/I7uBJgDUy?type=repost#_rnd1584587636871)\nwebsite, and urged followers to “act together” and “tear off the masks\nof the rioters.” The post was subsequently [shared by the Weibo](https://globalvoices.org/2019/09/19/china-central-television-urges-netizens-to-doxx-hong-kong-protesters-and-reporters/)\naccounts of local Chinese police, local media outlets, branches of\nChinese Communist Youth League, and others. While this does not\nestablish a direct connection between doxxing websites such as\nHKLeaks and the Chinese state, we believe this endorsement by\nstate organizations has, at the very least, supported and encouraged\nthese anti-protester doxxing efforts.\n\n\n-----\n\n**Social Media ‘Rallies’ to Support Hong Kong Police and**\n**Chinese Authorities**\n\nChina has a history of internet patriotism. The past several years\nhave yielded [several](https://qz.com/923761/a-history-of-china-retaliating-against-foreign-companies-carrefour-toyota-honda-kfc-lotte/) [examples of Chinese netizens rallying to](https://www.hongkongfp.com/2018/02/25/hurt-feelings-foreign-brands-proving-soft-target-china-wields-power/)\nuse VPNs to circumvent the Great Chinese Firewall and leave\nangry comments on social media accounts of public figures\nand brands that have “wronged” China and “hurt the feelings of\nChinese people.” Several online rallies have been observed since\nthe summer of 2019, targeting Hong Kong pro-democracy social\nmedia pages and accounts. These rallies differ from usual internet\nactivism from individual Chinese online “patriots,” as they involve\nthe congregations of individuals which assume a common identity\n(other than just patriotism) and often have a fixed start date and\ntime when participants engage in certain online behavior together.\nRather than one-off actions of individuals, participation in these\nrallies is based on and can cultivate a sense of community, rather\nsimilar to attending events in the offline world. We highlight two\nnetizen groups that have been most active: “Diba” (帝吧) and\n“Fangirls” (饭圈女孩).\n\n**Diba ‘Expeditions’**\n\nOne of the more coordinated Chinese netizen groups is Diba, a\n[forum with more than 30 million followers on China’s largest search](https://www.echo-wall.eu/currents-context/nazi-song-marches-chinas-internet)\n[engine Baidu, which has organized at least 10 online “expeditions,”](https://www.zhihu.com/question/39653087)\n[or “rallies,” since 2005. One of Diba’s recent expeditions was in 2016](https://foreignpolicy.com/2016/01/20/china-taiwan-tsai-ing-wen-facebook-troll-election/)\nafter the election of Taiwanese president Tsai Ing-wen. The group\n[called upon Chinese netizens to flood prominent Taiwan-related](https://www.weibo.com/ttarticle/p/show?id=2309403933490683997642&sudaref=passport.weibo.com)\nFacebook pages with anti-Taiwan independence comments to\n[“show the patriotism of the Chinese youth.” Diba users also rallied](https://www.echo-wall.eu/currents-context/nazi-song-marches-chinas-internet)\nto flood the Facebook pages of the Swedish national broadcaster\nSVT and Sweden’s Ministry of Foreign Affairs after SVT ran a satirical\nsketch about Chinese tourists in 2018.\n\n\n-----\n\n[On July 22, 2019, Diba organized its first online rally targeting the](https://www.dw.com/zh/%E5%A4%A7%E9%99%86%E7%BD%91%E5%86%9B%E5%B8%9D%E5%90%A7%E5%87%BA%E5%BE%81%E9%A6%99%E6%B8%AF-%E5%A3%B0%E6%8F%B4%E4%BD%95%E5%90%9B%E5%B0%A7%E8%A2%AB%E5%8F%AB%E5%81%9C/a-49718764)\nHong Kong protests with the objective to “Support Hong Kong\npolice, maintain rule of law, denounce violence and chaos, and\nsustain ‘one country two systems’.” Netizens flooded two prodemocracy Facebook pages with comments supporting the Hong\nKong police and “One China.” Another rally was planned for the next\nevening to show support for a pro-China lawmaker in Hong Kong,\nbut was abruptly called off due to “Diba management receiving\n[phone calls from relevant authorities,” as outlined in a post on the](https://www.dw.com/zh/%E5%A4%A7%E9%99%86%E7%BD%91%E5%86%9B%E5%B8%9D%E5%90%A7%E5%87%BA%E5%BE%81%E9%A6%99%E6%B8%AF-%E5%A3%B0%E6%8F%B4%E4%BD%95%E5%90%9B%E5%B0%A7%E8%A2%AB%E5%8F%AB%E5%81%9C/a-49718764)\nDiba official Weibo account. No concrete explanations were given\nbut Diba members speculated that the Chinese government may\nhave intervened.\n\n**Fangirl ‘Rallies’**\n\nA new group of Chinese netizens that has sprung out of the Hong\nKong protests is called the “fangirls.” In China, “fangirls” used to be\na slightly demeaning reference to fan groups of celebrities, who\nhave a reputation of pulling crazy stunts to support their “idols”\n(爱豆) and often get into fierce online arguments with fans of other\ncelebrities. The demographic profile of these fan groups are usually\nyoung women born after 1990 (the so-called “post-’90s” generation).\nAs the entertainment industry in China became more competitive,\nthese fan groups have professionalized online rallying and showing\nsupport for their celebrities, as these overt expressions of support\nserve as an indicator for how popular the celebrities are and boosts\ntheir careers. On August 14, 2019, numerous groups of fangirls\n[rallied together to show support for a new idol, “Brother China”](http://www.ftchinese.com/story/001084215?adchannelID=&full=y%EF%BC%88%E5%8E%9F%E6%96%87%E5%9C%B0%E5%9D%80%EF%BC%8C%E9%9C%80%E7%BF%BB%E5%A2%99%EF%BC%89)\n(阿中哥哥/阿中), an imaginary personification of the Chinese state.\n\nAccording to local news reports, fangirls had become upset that their\nbeloved celebrities were being attacked online and boycotted by\nHong Kong anti-government protesters for speaking out in support\nof the Hong Kong police and the Chinese state. As a result, fan\ngroups that usually supported different celebrities temporarily put\n[aside their differences and supported the Chinese state. According](https://static.nfapp.southcn.com/content/201908/16/c2530727.html)\nto Southern Metropolis Daily, a local newspaper, at least 12 different\nfan groups were created to support the personified “Brother China.”\n[Some fan groups had more than 200 people. Within two days, the](https://static.nfapp.southcn.com/content/201908/16/c2530727.html)\ntopic “We all have an idol called Brother China” (我们都有一个爱豆名\n字叫阿中) was trending on Weibo, and had 790 million views.\n\n\n-----\n\nThe groups were well organized, and had specific teams for image\ncreation, copywriting, translating, and even technical support. They\nalso [provided tools and manuals, teaching newcomers how to](https://static.nfapp.southcn.com/content/201908/16/c2530727.html)\nregister for Instagram and Facebook accounts and how to use VPNs.\n[The fangirls not only flooded the social media accounts of pro-China](https://www.guancha.cn/politics/2019_08_15_513689_s.shtml)\ncelebrities and public figures with supporting comments, they also\nflooded Instagram hashtags with pro-China images and memes.\nThrough comments and images, the fangirls created personas for\nthe Chinese state as a male celebrity that “has been active for 5,000\nyears,” “has 1.4 billion fans,” “was born into power and influence,”\nbut “was bullied by others and lost his status” and had “a son and\na daughter that were kidnapped and now refuse to recognize him\nas their father.” These fictional personas of Brother China mirror\nthe common CCP propaganda narratives, including concepts such\nas the “century of humiliation” and fundamental lore about the\nChinese nation.\n\n_Instagram comments in support of China (left) and Instagram hashtag #blackcop taken over by pro-China images_\n_(right). (Source: Beijing Daily)_\n\n\n-----\n\n#### Interactions Between Diba and Fangirls\n\nOn August 16, 2019, Diba launched its own “Expedition of Patriotic\nYouths” to support the fangirls’ rally. It also promoted the QQ\nmessaging group chat accounts of 17 fangirl groups so that Diba\nusers could join in the ongoing efforts. Diba’s call for online\npatriotism amplified the exposure of the fangirls’ online rally, and\n[was shared by many Weibo opinion leaders, including Hong Kong](https://new.qq.com/omn/20190818/20190818A03Q7C00.html)\npro-China lawmaker Junius Ho.\n\n_Diba’s poster for “Expedition of Patriotic Youths” with the captions “Support HK Police, Protect our motherland–_\n_CHINA” (left), and real-time updates of the campaign posted on Diba’s official Weibo account (right). (Source: Beijing_\n_Daily)_\n\n**Interactions With the Chinese State**\n\nState media and state-affiliated organizations played an important\nrole in instigating, encouraging, and promoting the online rallies of\nfangirls and Diba.\n\n - The August 14 fangirl rally was in part inspired by a Weibo\n\npost from CCTV’s official account with the title “[Hong Kong\nCelebrity] Jackson Wang targeted by pro-democracy forces\nfor being patriotic and protecting [the Chinese] flag.” The\n[post warned pro-democracy protesters to “immediately stop](https://www.guancha.cn/politics/2019_08_15_513689_s.shtml)\nunlawful, violent behavior, or face dire consequences.”\n\n\n-----\n\n - The fangirl rally was encouraged and promoted by the official\n\n[Weibo accounts of People’s Daily, Communist Youth League,](https://www.douban.com/group/topic/149025092/)\n[and the Global Times. It was also highlighted on national](https://baike.baidu.com/reference/23684630/1e8a1p2Ed8sHU6c-rljbcKjtcRhi5lwC3bDmQ3aewcMRoXuwIqlqW_H4EznKX50t6-8L4mnj9fJRi4EKWQumADYuSEX-NQYossKHOmGt6yfQ-z9Iy_HaBxkUART-zgSNrDHX)\n[television, as a segment of CCTV news.](https://baike.baidu.com/reference/23684630/1e8a1p2Ed8sHU6c-rljbcKjtcRhi5lwC3bDmQ3aewcMRoXuwIqlqW_H4EznKX50t6-8L4mnj9fJRi4EKWQumADYuSEX-NQYossKHOmGt6yfQ-z9Iy_HaBxkUART-zgSNrDHX)\n\n - The August 17 Diba expedition was encouraged and promoted\n\n[by the official Weibo account of the Communist Youth League.](https://static.nfapp.southcn.com/content/201908/16/c2530727.html)\n\nRecorded Future assesses that the online netizen groups Diba and\nfangirls are likely grassroot movements that are initiated from\nthe bottom up rather than being directed by the Chinese state.\nHowever, it is likely that the Chinese government will start leveraging\nthe existing patriotism and capabilities of these online grassroot\ngroups to promote and defend state interests abroad through\nexplicit direction (such as the phone calls to Diba management\nby authorities) and implicit nudging (such as encouraging fangirls\nrallies).\n\n### Emerging Chinese TTPs Targeting Taiwan and Hong Kong\n\nBased on the analysis of influence operations targeting the 2020\nTaiwan presidential elections and 2019-2020 Hong Kong protests,\nwe have identified the following TTPs employed by Chinese statesponsored actors or actors supportive of the Chinese state since\nSeptember 2019.\n\n - Creation of simplified Chinese-, traditional Chinese-, and\n\nEnglish-language influence content for dissemination across\na wide variety of both traditional social media and messaging\napplications\n\n - AI-generated content\n\n - Use of social media management software to ease the\n\npropagation of influence messaging\n\n - Co-option of witting and unwitting collaborators, such as\n\npublic figures, politicians, and marketing firms, in spreading\nChinese influence information on social media\n\n - Exploitation of the “share” function in LINE to quickly spread\n\nmisleading, intentionally biased, or false content before it can\nbe countered\n\n\n-----\n\n - Use and creation of YouTube channels propagating\n\nmisleading, intentionally biased, or false content designed to\nlook like commentary from domestic citizens\n\n - Employing state-run media to amplify misleading, intentionally\n\nbiased, or false content\n\n - Microtargeting of specific audiences on other Western social\n\nmedia platforms, such as younger voters in Taiwan\n\n - Crowd-sourced doxxing of anti-government protesters\n\n - Grassroot social media “rallies” to support Chinese state\n\ninterests\n\n### Outlook\n\nOur research here examining recent Chinese state-run influence\noperations reveals that Chinese operational TTPs, targets, and\nmethodologies continue to evolve.\n\nWe assess that these campaigns demonstrate that Chinese influence\noperators are willing to adopt more aggressive tactics that exploit\nweaknesses in targeted societies or manipulate patriotic sentiments\nof their own people.\n\nIn particular, Chinese influence operations targeting Hong Kong\nand Taiwan have been able to outmaneuver counter-disinformation\nefforts in Taiwan and effectively exploit gaps in the terms of service\nof several social media platforms. The Chinese state also makes use\nof patriotic individuals and grassroot groups who are both proactive\nand passionate about their cause, and possess advanced technical\nand organizing capabilities to execute and sustain influence\noperations over long periods of time. Another key theme that has\nsurfaced in both the Taiwan and Hong Kong case studies is the role\nthat Chinese state media organizations play in creating, amplifying,\nand supporting various influence operations that might otherwise\nnot be directly linked to the state.\n\n\n-----\n\nWe expect more of these resources and tactics to be deployed in\noverseas influence operations on social media platforms over the\ncourse of the next year. In particular, automated content creation\nand dissemination in local languages are likely to be used in\ntargeting foreign audiences for Chinese state interests, especially\nduring sensitive times such as elections and global events. An\n[ongoing example during the current COVID-19 pandemic is the use](https://dfcme.me/en/dfc-finds-out-a-botnet-arrived-in-serbia-along-with-coronavirus/)\nof botnets to promote Chinese-friendly content in Serbia.\n\n\n-----\n\n### Recorded Future Ontology\n\nRecorded Future’s Insikt Group tracks threat activity associated with new and\n\nexisting threat actor groups, focusing on China, Iran, Russia, and North Korea.\n\nInsikt Group only names a new threat actor group or campaign when analysts\n\nhave data corresponding to at least three points on the Diamond Model of\n\nIntrusion Analysis with at least medium confidence, and only when we can point\n\nto a handle, persona, person, or organization responsible. We will write about the\n\nactivity as a campaign in the absence of this level of adversary data. We use the\n\nmost widely-utilized or recognized name for a particular group when reporting\n\nand researching known threat actor groups.\n\n**ADVERSARY**\n\n**INFRASTRUCTURE** **CAPABILITY**\n\n**VICTIM**\n\nInsikt Group utilizes a simple color plus [phonetic naming convention for new](http://militarytimechart.com/military-phonetic-alphabet/)\n\nthreat actor groups or campaigns; we will utilize the most common name when\n\nan actor or campaign is already known. The first word in the convention will be\n\na color, currently corresponding to the below, with more color/nation pairings to\n\nbe added as we identify and attribute new threat actor groups associated with\n\nnew nations.\n\n\n-----\n\n### Appendix A — HKLeaks Domains\n\n_hkleaks[.]org_\n_hkleaks[.]ru_\n_hkleaks[.]kz_\n_hkleaks[.]me_\n_hkleaks[.]pk_\n_hkleaks[.]tj_\n_hkleaks[.]dog_\n_hkleaks[.]news_\n_hkleaks[.]af_\n_hkleaks[.]ml_\n_hkleaks[.]kg_\n_hkleaker[.]net_\n\n**About Recorded Future**\n\nRecorded Future arms security teams with the only complete security intelligence\n\nsolution powered by patented machine learning to lower risk. Our technology\n\nautomatically collects and analyzes information from an unrivaled breadth of\n\nsources and provides invaluable context in real time and packaged for human\n\nanalysis or integration with security technologies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.04.29.Chinese_Influence_Operations_Taiwanese_Elections_Hong_Kong_Protests/cta-2020-0429.pdf"
    ],
    "report_names": [
        "cta-2020-0429"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1587650067,
    "ts_modification_date": 1587650088,
    "files": {
        "pdf": "https://archive.orkl.eu/992959657614e0598cdac414b7796dc37b6eab0d.pdf",
        "text": "https://archive.orkl.eu/992959657614e0598cdac414b7796dc37b6eab0d.txt",
        "img": "https://archive.orkl.eu/992959657614e0598cdac414b7796dc37b6eab0d.jpg"
    }
}