{
    "id": "352969ba-0d14-4a63-a09c-8f20cdc1ff4e",
    "created_at": "2023-01-12T15:09:34.70969Z",
    "updated_at": "2025-03-27T02:05:48.043821Z",
    "deleted_at": null,
    "sha1_hash": "519fb01f45f03eb6eb66909319336ad797d23cb3",
    "title": "2021-01-04 - Building a Custom Malware Analysis Lab Environment",
    "authors": "",
    "file_creation_date": "2022-05-28T00:39:45Z",
    "file_modification_date": "2022-05-28T00:39:45Z",
    "file_size": 2435563,
    "plain_text": "# Building a Custom Malware Analysis Lab Environment\n\n**labs.sentinelone.com/building-a-custom-malware-analysis-lab-environment/**\n\nMarco Figueroa\n\n## Introduction\n\n[Building the right malware analysis environment is the first step for every malware researcher. When all system configurations and software](https://www.sentinelone.com/cybersecurity-101/malware-analysis/)\ninstallations are complete, you’re able to analyze and investigate malware properly. In this post, I wanted to share my own experiences and\nscripts to help ease the workload of setting up a malware environment to explore malicious software.\n\nIn this post, you will learn how to:\n\n1. download, install and configure a free Windows 10 and a free REMnux Linux virtual machine\n2. set up a virtual private network for communication between virtual machines\n3. build a custom Windows malware environment with SentinelLabs RevCore Tools\n4. learn how to capture network traffic from a Windows 10 virtual machine\n\n## Installing Virtual Machines\n\nWhen running multiple virtual machines, the host operating system will begin slowing down, so it is critical to set each virtual machine’s best\nrequirements to optimize its performance. To set up the virtual machines in this post, I recommend that the Windows 10 virtual machine be set\nwith the minimum requirements of two processor cores with 4GB of RAM and the Linux virtual machine with two processor cores with 2GB of\nRAM.\n\n## Downloading a Free Windows 10 Installation\n\nMicrosoft provides a free virtual machine which is intended for testing IE and Edge web browsers. To download the Microsoft virtual machine\ngo to [https://developer.microsoft.com/en-us/microsoft-edge/tools/vms/ and download the MSEdge on Windows 10 zip file and select your](https://developer.microsoft.com/en-us/microsoft-edge/tools/vms/)\npreferred VM platform, currently I’m using VM Fusion.\n\n\n-----\n\n## Downloading REMnux Linux\n\nThe next virtual machine we want to download is REMnux Linux. The REMnux distro is a Linux distribution based on Ubuntu. It has excellent\ntools for exploring network interactions for behavioral analysis and investigating system-level interactions of malware. To download REMnux go\nto [https://docs.remnux.org/install-distro/get-virtual-appliance and download the Virtual Machine platform of your choice.](https://docs.remnux.org/install-distro/get-virtual-appliance)\n\n\n-----\n\n## Installing and Configuring a Private Isolated Custom Network\n\nCreating an isolated, controlled network environment when analyzing malware is extremely important due to the level of interaction it gives you\nwith malware. VMware Fusion gives you the capabilities to change key networking settings and add a virtual private network configuration to\nuse for analysis between hosts. We will only add two virtual machines to this lab environment, but you can add many virtual machines to this\nnetwork. The procedures to create this network is as follows:\n\nSelect the tab VMware Fusion->Preferences->Network; click the lock icon to make changes\nSelect the “+” button which creates a `vmnet# under the Custom section.`\nDo not select the “Allow Virtual machines on this network to connect to external networks (using NAT)” option.\nAdd a Subnet IP: I’ve entered `10.1.2.0`\nClick Apply\n\n\n-----\n\n## Windows 10 Setup\n\nOnce you’ve created a custom network and both virtual machines have been downloaded, begin by unzipping the MSEdge Windows 10. Since\nI’m using VMware Fusion, I will go through how to import the virtual image; the process for importing the virtual machine with other platforms is\nsimilar.\n\nOpen up VMware Fusion and follow these steps:\n\n1. After the zip has been unpacked enter the MSEdge-Win10-VMware folder.\n2. Select in VMware Fusion File->Import MSEdge_Win10_VMware, hit Continue and save the Virtual Machine; it will take a few minutes\n\nto import the image.\n3. Click on Customize Settings after the image has been imported.\n4. Click into the Processors & Memory tab and confirm that the settings has two processor cores and the memory is 4096MB.\n5. Before powering on the MSEdge Win10 virtual machine, take a snapshot and name it something like “VM Clean Import”.\n6. When starting the virtual machine, if prompted to upgrade the virtual machine to greater feature compatibility support, choose Upgrade.\n7. The password to the virtual machine is `Passw0rd!`\n8. Open the command prompt to activate the virtual machine, type `slmgr.vbs /ato .`\n9. When prompted, install VMware’s “Virtual Tools” and reboot.\n10. Once the virtual machine has rebooted, complete login and immediately take a snapshot. Give it a descriptive name, such as “Activation\n\nand VM Tools Install” snapshot.\n\n\n-----\n\n## REMnux Setup\n\nThe REMnux virtual machine downloads as an `.ova file. I recommend you browse to docs.REMnux.org to confirm the hash of the`\ndownloaded OVA file.\n\nIf you are using VirtualBox, you can just import REMnux, but if you are using VMware Fusion or VMware Workstation, follow these instructions\nto import the REMnux:\n\n1. Select File->Import->Choose File… and select remnux-v7, hit Continue and then Save.\n2. When the import is complete, click on Customize Settings.\n3. Click into the Processors & Memory pane under System Settings and leave the settings with two processor cores; reduce the memory\n\nfrom 4096MB to 2048MB.\n4. For the REMnux network configuration, the setup is slightly different. We want to add an additional network adapter.Note: There are\n\nmultiple reasons why I configure this virtual machine this way. If I need to update or download other software having the network adapter\nconfigured saves me time; the second is if I want to allow malware callouts.Once the import is complete and you’re in the “Settings”\nmenu, select Network Adapter. The next step is to click Add Device… and select Network Adapter and Add…. Make sure the Share\n_with my Mac radio button is set. Return to the main “Settings” panel and select Network Adapter 2. Click the vmnet2 radio button, then_\nchoose Show All to go back to Settings.\n5. When starting the REMnux virtual machine, if prompted to upgrade the virtual machine to greater feature compatibility support, choose\n\n**Upgrade.**\n6. Once REMnux boots, the credentials are: Username: `remnux Password:` `malware .`\n\n\n-----\n\na ays c a ge t e pass o d o y tua ac es\n\n1. $passwd\n```\n      UNIX password: malware\n      Enter new UNIX password: (your choice)\n\n```\n8. The next step is to configure the network settings. If you type `ifconfig -a you should see two network adapters:`\n\n1. Select NAT for the first network adapter. The virtual machine will get an address on that network from the VMware virtual DHCP\n\nserver. You can ping google to see if you have connectivity or open the Firefox browser and connect to any website to confirm that\nyou have internet access. If you do not, then type this command in terminal: `$ sudo dhclient -r This should allow you to fetch`\nan IP.\n2. For the second adapter, ens37, type in this command: $ sudo ifconfig ens37 10.1.2.1 netmask 255.255.255.0\n\n9. Hit the “Snapshot” button and name it something like “Clean Snapshot”.\n10. Update and upgrade REMnux: $ sudo apt-get update; sudo apt-get upgrade\n\n## Installing SentinelLabs RevCore Tools\n\nOne of the reasons I wanted to create a SentinelLabs VM Bare Bones malware analysis toolkit was that when installing FlareVM, I find it\ncontains many tools that I do not use, and it takes a minimum of 40 minutes to install. I wanted to create a script of the core tools and system\nconfigurations that I need to be able to analyze malware.\n\nFollow this procedure to instal SentinelLabs RevCore Tools on MSEdge WIndows 10:\n\n1. Browse to the [SentinelLabs RevCore Tools github page and download the zip.](https://github.com/SentineLabs/SentinelLabs_RevCore_Tools)\n2. Unzip it and drag the `SentinelLabs_RevCore_Tools_codeSnippet.ps1 script onto your desktop.`\n3. If you are using the free downloaded Windows 10 virtual machine that I’ve mentioned above go to Step 4; if you are using your own\n\nWindows virtual machine continue with these substeps:\n\n1. Instead of dragging just the `SentinelLabs_RevCore_Tools_codeSnippet.ps1, drag the entire folder onto your virtual machine`\n\ndesktop.\n2. Open the `SentinelLabs_RevCore_Tools_codeSnpippet.ps1 file and modify line 4 after` `-PackageName. You will modify the url`\n\nand change it to the directory location on your desktop. E.g.,\n```\n      'https://raw.githubusercontent.com/SentineLabs/SentinelLabs_RevCore_Tools/master/SentinelLabs_RevCore_Tools.ps\n\n```\nto `'c:UsersyourUsernameDesktopSentinelLabs_RevCore_Tools-mainSentinelLabRevCoreTools.ps1'` `;`\n3. The final thing to do is to modify the `SentinelLabsRevCoreTools.ps1. On lines 105-117, replace` `IEUser with the User profiles`\n\nname you are using. Save all files and run the script. E.g.,\n```\n      Install-ChocolateyShortcut -ShortcutFilePath \"C:\\Users\\IEUser\\Desktop\\HxD.lnk\" -TargetPath \"C:\\Program Files\\HxD\\HxD.exe\"\n      Install-ChocolateyShortcut -ShortcutFilePath \"C:\\Users\\YourUser Profile\\Desktop\\HxD.lnk\" -TargetPath \"C:\\Program\n      Files\\HxD\\HxD.exe\"\n\n```\n4. Go to Step 5.\n4. In the Windows 10 search bar, type `powershell, right click and run as administrator. Browse to the location of the`\n```\n   SentinelLabs_RevCore_Tools_codeSnippet.ps1 powershell script, then run the script:\n\n```\n```\nSentinelLabs RevCore Tools codeSnippet ps1\n\n```\n\n-----\n\n5 e sc pt cause t o auto at c eboots, a d you eed to og aga t you use pass o d a te eac e st eboot\ncontinue disabling various system services that could otherwise hinder your malware analysis and continue to install the core tools. After\nthe second reboot, the script will finalize and confirm all of the configurations and installations.The installed tools and modified system\nconfigurations are listed below. Don’t forget to take a snapshot when it’s finished and you’ve reached the “Type ENTER to exit” point.\n\n1. Tools:\n\nChecksum, 7zip, Process Explorer, Autoruns, TCPview, Sysmon, HxD, PEbear, PEStudio, PEsieve, Cmder, NXlog, X64dbg,\n[X32dbg, Ollydbg, IDA-Free, Cutter, Ghidra, Openjdk11, Python3, PIP, PIP pefile, PIP YaraA tool that I frequently use is Hiew,](http://www.hiew.ru/)\nChocolatey does not have Hiew in its collection. My recommendation is to download and try out the free version, once you see the\npower of Hiew you should definitely purchase lifetime access because it is worth every penny.\n2. System Configuration:\n\nDisabling – Bing Search, Game Bar Tips, Computer Restore, UAC, Update, Firewall, Windows Defender, Action Center\nSet Window Theme, Set Wallpaper, Create Shortcuts For Tools\n\n\n-----\n\n## Network Traffic Collection\n\nWhen analyzing malware, often the malware operation and the C2s are still active, so an excellent way to stay under the radar is to run\nmalware in a controlled environment. Analyzing network traffic is a trivial process in detecting malicious software callouts in real time\nnetwork traffic. This section will help you configure your virtual machines to capture the detonated malicious software’s network traffic or\nstatically step through debugged code, which allows your investigation to understand the potential threat at hand.\n\nThe first thing that must be configured is the virtual private network communication between the MSEdge Windows 10 and REMnux:\n\n1. On the Windows 10 virtual machine, select the custom `vmnet2 network (Virtual Machine->Network Adapter->Custom`\n\n**(vmnet2)).**\n2. On the Windows 10 VM, right click on the network adapter in the taskbar and choose Open Network & Internet settings.\n3. Select Ethernet and click on Change adapter options.\n4. Right click on Ethernet0 and select Properties.\n5. Double click on Internet Protocol Version 4 (TCP/IPv4).\n6. Click the radio button to select “Use the following IP address:”, then add the IP address, Subnet mask, Default gateway, and\n\nPreferred DNS server as follows:\n\n1. IP Address: 10.1.2.100\n2. Subnet mask: 255.255.255.0\n3. Default Gateway: 10.1.2.1\n4. Click the radio button to select “Use the following DNS server address:” and add:\n\nPreferred DNS Server: 10.1.2.1\n5. Click OK to complete configuration of the network settings.\n\n\n-----\n\nThe REMnux adapter for the virtual private network has already been configured from the previous section.\n\nNow that the virtual machines are networked and can communicate with each other, it is time to configure a few tools on the REMnux\nvirtual machine to capture traffic.\n\nInstalled on REMnux are various tools you can use to capture network traffic. We will configure Burp Suite and INetSim. Burp Suite is\ntypically used to test web application firewalls, but in our case we want to configure it so that when Windows 10 detonates malware, it will\ntry to establish a connection to a domain or C2. The traffic will potentially use HTTPS and pass through Burp Suite, which will be bound\nto INetSim. INetSim is a software suite that simulates common services for lab environments to analyze malware’s network behavior.\n\n## Burp Suite Configuration\n\nThe Burp Suite setup is straightforward, but there are a couple of steps that we must configure before we can begin using it.\n\nOpen a command prompt and type: `$ sudo Burp Suite .`\nselect Temporary project, then hit Next and then Start Burp.\nSelect the Proxy tab and then “Options”. Under Proxy Listeners, select the default interface and click the Edit button.\nUnder the Binding tab, set Bind to address to Specific address: 10.1.2.1 and click OK.\n\n\n-----\n\nIMPORTANT STEP:\n\nGo back to you MSEDGE Windows 10 virtual machine and open up the Edge browser.\n[Type in the address bar: http://10.1.2.1:8080. You should see “Burp Suite Community Edition”.](http://10.1.2.1:8080/)\nDownload the CA Certificate on the top right side of the page.\nOpen the location of the file and double click on the certificate file.\nSelect `Install Certificate... .`\nSelect `Current User as the Store Location and click` `Next .`\nSelect `Automatically select the certificate store based on the type of certificate . Click` `Next and then`\nclick `Finish .`\nGo into the settings of the EDGE Browser and disable all security functionalities; this will help with testing the connection to\nINetSim in the next section.\nMake sure you take a snapshot.\n\n\n-----\n\nGo back to the REMnux virtual machine. You should still be in Burp Suite Proxy tab, Edit proxy listener options.\n\nUnder the Request handling tab, set Redirect to host to `localhost and Redirect to port to` `4443 . Select support for invisible`\n_proxying._\nNow go to the Intercept tab and make sure intercept is off.\nUnder Proxy Listeners, select the default and click `Edit`\nUnder the Binding tab, `Bind to address: Specific address: 10.1.2.1 should still be kept, but change the Bind to port` `443`\nClick on the Request handling tab and set the Redirect to host option to `localhost and` `Redirect to port to` `4443.`\nSelect the Support invisible proxying (enable only if needed.) and click OK.\n\n\n-----\n\n## INetSim Configuration Setup\n\nREMnux has INetSim preinstalled. Use your favorite text editor and open up the `inetsim.conf file located in` `/etc/inetsim/ . Follow`\nthe steps to configure INetSim:\n\n1. `$ sudo vi /etc/inetsim/inetsim.conf and enable all the services by uncommenting out the services by deleting the` `#`\n\ncharacter.Pro Tip: Be aware that malware could potentially detect it is running in a virtual environment by checking whether\neverything in this file is uncommented. I have yet to come across this, but it is good to be aware of the possibility. You could take a\nmore conservative approach and only uncomment services you intend to use.\n\n\n-----\n\ne e t step s to b d t e u et o adapte t e `ets` `co` e e e t sect o a te t e se ces e u s t e\n```\n  service_bind_address . Uncomment the # and change the default IP address from 10.10.10.1 to 0.0.0.0 .\n\n```\n3. Scroll down to the `dns_default_ip section, uncomment the` `# and change the IP address from 10.10.10.1 to` `10.1.2.1 .`\n4. The last thing to do is to bind the HTTPS port so Burp Suite can route the traffic to the port 4443. Scroll down to the\n```\n  https_bind_port section, uncomment the # character and replace 443 with 4443 .\n\n```\n5. Save the changes and exit the editor.\n\n6. The next step is to run the following commands which are VERY IMPORTANT to execute or INetSim will not work correctly. Ubuntu\n\nhas a system-resolved system service which provides network name resolution to local applications. This conflicts with INetSim so\nwe need to disable the service.We have to disable `system-resolve and also mask it so that it doesn’t auto start on reboot.`\nFinally, we will stop the service.\n```\n $ sudo systemctl disable systemd-resolved\n $ sudo systemctl mask systemd-resolved\n $ sudo systemctl stop systemd-resolved\n\n```\n\n-----\n\ne a step s to u etS\n\n```\n$ sudo inetsim\n\n```\n\nTo test network connectivity from your Windows 10 virtual machine, open a command prompt and ping 10.1.2.1, then open Edge browser\nand type 10.1.2.1. You should see the following message “This is the default HTML page for INetSim HTTP server fake mode.”\n\nThe final test is to make sure the DNS is working correctly and serving up requests. For this example, I type in the search bar\n```\nhttps://www.mymaliciousdomain.com/malwaretrojan.exe . If everything is working, you should see a web page warning that the\n\n```\nrequested site is not secure.\n\n\n-----\n\nI also like using Wireshark to capture packets to analyze the pcaps when investigating malware.\n\nOpen a new tab in your terminal in REMnux and type `$ wireshark .`\n\nOnce the application has opened, click on the shark fin icon on the far left of the toolbar to begin capturing packets.\n\n\n-----\n\n## Detonating Malware\n\nWhen malware is executed, it usually makes some request to a domain or IP address. INetSim helps with this by spoofing the responses\nto the malware that is waiting for a response. An example would be if malware was executed and reached out to a domain and will not\nproceed without a response unless the conditions were met, which is the response. If the malware doesn’t receive the response, it would\nterminate and not continue its malicious actions. This is where the live environment assists us with responding to callouts and capturing\nnetwork traffic.\n\nFor the final step of the lab environment setup, we will detonate a notorious binary trojan (or any malware you choose) to test the\nconfiguration is working correctly.\n\nI’m testing with a Trickbot binary (SHA256: `49d95cae096f7f73b3539568b450076227b4ca42c0240044a7588ddc1f1b6985 ). I’ve opened`\nProcess Explorer and TCPView to monitor the execution of this variant of Trickbot.\n\n\n-----\n\nDetonating malware can save a lot of time before diving deep into reverse engineering as it allows you to gather insight and create an\nunbiased hypothesis. In this example, when we detonated this trickbot sample there were three callouts that stuck out:\n\nThe callouts were to fetch files from Microsoft Updates site; these cab files called were automatic updaters of untrusted certificates.\nA certificate trust list is a predefined list of items signed by a trusted entity. These requested cab files are used to update and\nexpand the existing functionality by adding known untrusted certificates to the untrusted certificate store by using a certificate trust\nlist.\n\n\n-----\n\nAlthough Trickbot is one of the more prolific malware strains today and is more complex than a few callouts, it is a good starting point if\nyou are in the beginning stages of research and have never encountered this binary.\n\nI’ve been successfully using this lab setup for many years. A real-world example of using this lab setup occurred when I was brought in to\nhelp with an incident at short notice back in 2016. I didn’t have time for an initial triage of the binary as I was joining a war room call for\nthe briefing by the investigation team lead. I started both VMs from snapshots and detonated the binary while being brought up to speed\nabout the incident. Within 5 minutes, I informed the investigation lead about an IP that the specific binary was calling out to, which was\nenough to give the threat hunters a place to begin. After the war room call, I started reversing the malware and extracting additional IOCs\nand TTPs.\n\n## Conclusion\n\nA lab environment setup and configuration varies during malware analysis. When analyzing malware you need different tools to dissect\nand do deep analysis. I hope the SentinelLabs RevCore Tools and configurations in this setup assists, but there might be a time that you\nneed to analyze something different, like a dot net file, and may need an additional tool to fully disassemble the binary. The journey of\nreversing malware is a marathon and not a sprint; growing your skill and learning from every malware analyzed should be the goal.\n\n## Resources\n\n[https://support.microsoft.com/en-us/help/2677070/an-automatic-updater-of-untrusted-certificates-is-available-for-window](https://support.microsoft.com/en-us/help/2677070/an-automatic-updater-of-untrusted-certificates-is-available-for-window)\n\n[https://askubuntu.com/questions/191226/dnsmasq-failed-to-create-listening-socket-for-port-53-address-already-in-use](https://askubuntu.com/questions/191226/dnsmasq-failed-to-create-listening-socket-for-port-53-address-already-in-use)\n\n[https://gallery.technet.microsoft.com/scriptcenter/Change-the-Desktop-b5b2141c](https://gallery.technet.microsoft.com/scriptcenter/Change-the-Desktop-b5b2141c)\n\n[https://gist.github.com/trietptm/b84ccad9db01f459ac7e](https://gist.github.com/trietptm/b84ccad9db01f459ac7e)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-04 - Building a Custom Malware Analysis Lab Environment.pdf"
    ],
    "report_names": [
        "2021-01-04 - Building a Custom Malware Analysis Lab Environment.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536174,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653698385,
    "ts_modification_date": 1653698385,
    "files": {
        "pdf": "https://archive.orkl.eu/519fb01f45f03eb6eb66909319336ad797d23cb3.pdf",
        "text": "https://archive.orkl.eu/519fb01f45f03eb6eb66909319336ad797d23cb3.txt",
        "img": "https://archive.orkl.eu/519fb01f45f03eb6eb66909319336ad797d23cb3.jpg"
    }
}