{
    "id": "35367dbd-c193-48ae-87b3-e94abbe5b7b7",
    "created_at": "2023-01-12T15:08:43.273172Z",
    "updated_at": "2025-03-27T02:05:24.896483Z",
    "deleted_at": null,
    "sha1_hash": "f255aa82268752ffe9fe8b168f1b0169b769bccb",
    "title": "2022-04-12 - Qbot Botnet Deploys Malware Payloads Through Malicious Windows Installers",
    "authors": "",
    "file_creation_date": "2022-05-28T02:36:13Z",
    "file_modification_date": "2022-05-28T02:36:13Z",
    "file_size": 111740,
    "plain_text": "# Qbot Botnet Deploys Malware Payloads Through Malicious Windows Installers\n\n**techtimes.com/articles/274190/20220412/qbot-botnet-deploys-malware-payloads-through-malicious-windows-**\ninstallers.htm\n\nApril 12, 2022\n\n[Joseph Henry, Tech Times 12 April 2022, 02:04 am](https://www.techtimes.com/reporters/joseph-henry)\nQbot operators are now relying on infecting systems by installing malware payloads on\nemails. These files reportedly have malware-ridden Windows Installers.\n\nAccording to cybersecurity researchers, the threat actors have done this technique for the\nfirst time. It's different from their previous tactic which is spreading malware through a\ndocument from Microsoft Office.\n\n## What the Experts Think About Qbot Malware\n\n(Photo : Philipp Katzenberger from Unsplash)\n\nCybersecurity researchers have recently discovered that the Qbot operators are\ncompromising systems by infecting Windows installers.\n\nPer [Bleeping Computer's report, the experts thought that the cybercriminals have finally](https://www.bleepingcomputer.com/news/security/qbot-malware-switches-to-new-windows-installer-infection-vector/)\nresponded to what the Microsoft office did earlier this year.\n\n\n-----\n\nThe Redmond firm said back in February that it will now make it tougher to activate VBA\nmacros in Microsoft Office applications. It has reportedly kicked off this month.\n\nIn late 2021, the tech titan noted that the presence of many \"malicious macros\" in the Office\ndocuments (pertaining to the Excel 4.0 macros) had been evident among the attackers.\n\nTo evade further security detection systems, the threat actors make use of Excel 4.0 macros.\nHowever, to properly execute them, they will be required to manually activate them because\nMicrosoft disabled it by default.\n\nAs such, Microsoft had done a great job in preventing hackers from gaining access to its\napps. The widespread phishing schemes have been hitting Office applications. The tactic will\nalso prevent the cybercriminals from being invaded by various malware including TrickBot,\nEmotet, and Qbot to name a few.\n\n**_Related Article: How to Troubleshoot Windows 10 Boot Issues [2022] [To be Published_**\n**_on February 22]_**\n\n## The History of Qbot\n\nFor those unfamiliar with Qbot, it is a notorious malware known to be hitting Windows since\n2007. When it infiltrates the system, it could gain access to the user's financial information,\nas well as some confidential details including password and email address.\n\nThe actors rely on compromising a particular network through an exploit. Previously, it has\nbeen seen to be \"aggressively\" attacking the Active Directory admin accounts.\n\nA myriad of dangerous cyberhacking groups have used it already including REvil,\nMegaCortex, PwndLocker, ProLock, and more ransomware gangs.\n\nOver the past years, IT admins and security analysts have learned to effectively suppress the\nQbot botnet. Since it's known to launch disruptive attacks on its victims, the professionals\nhave gotten used to its signs and what preventive measures can best stop it.\n\nIn other news, [ZDNet reported that attackers are now taking advantage of the Spring4Shell](https://www.zdnet.com/article/spring4shell-flaw-is-now-being-used-to-spread-this-botnet-malware/)\nflaw to spread botnet malware on their targets.\n\nParticularly, cybersecurity firms such as Qihoo 360 and Trend Micro discovered this incident\nin late March.\n\nPer Trend Micro analysts, the findings concluded that the Spring4Shell exploitation was\nclearly seen in the most vulnerable servers. The hackers have exploited the Mirai botnet\nmalware to hit several systems in Singapore.\n\n\n-----\n\nAnother group of researchers from Unit 42 (Palo Alto Network) noted that the hackers made\nuse of this flaw as their weapon. With that being said, cybercriminals have already abused it\non a wide scale.\n\n**_Read Also:_** **_Windows Users Beware: 95% of Ransomware Attacks Target Microsoft's_**\n**_OS [Google Report]_**\n\n**_This article is owned by Tech Times_**\n\n**_Written by Joseph Henry_**\n\nⓒ 2021 TECHTIMES.com All rights reserved. Do not reproduce without permission.\n\n**Tags:** [Qbot Botnet](https://www.techtimes.com/tags/qbot-botnet) [Malware](https://www.techtimes.com/tags/malware) [Malware Payload](https://www.techtimes.com/tags/malware-payload) [Windows Installer](https://www.techtimes.com/tags/windows-installer) [Security](https://www.techtimes.com/tags/security) [phishing](https://www.techtimes.com/tags/phishing)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-12 - Qbot Botnet Deploys Malware Payloads Through Malicious Windows Installers.pdf"
    ],
    "report_names": [
        "2022-04-12 - Qbot Botnet Deploys Malware Payloads Through Malicious Windows Installers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536123,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653705373,
    "ts_modification_date": 1653705373,
    "files": {
        "pdf": "https://archive.orkl.eu/f255aa82268752ffe9fe8b168f1b0169b769bccb.pdf",
        "text": "https://archive.orkl.eu/f255aa82268752ffe9fe8b168f1b0169b769bccb.txt",
        "img": "https://archive.orkl.eu/f255aa82268752ffe9fe8b168f1b0169b769bccb.jpg"
    }
}