{
    "id": "353983a0-1d7e-4917-b82d-cfc5799fa097",
    "created_at": "2023-03-03T02:07:15.03449Z",
    "updated_at": "2025-03-27T02:15:35.708129Z",
    "deleted_at": null,
    "sha1_hash": "3a2d0e33b761ad7cfa02d3874d86574f22b31894",
    "title": "2022-04-15 - Top 10 Malware March 2022",
    "authors": "",
    "file_creation_date": "2023-03-01T09:20:36Z",
    "file_modification_date": "2023-03-01T09:20:36Z",
    "file_size": 202528,
    "plain_text": "# Top 10 Malware March 2022\n\n**cisecurity.org/insights/blog/top-10-malware-march-2022**\n\nApril 15, 2022\n\nIn March 2022, the Top 10 stayed consistent with the previous month with malware changing\nspots in the Top 10. This is with the exception of Gh0st and Jupyter, both returning to the Top\n10. Gh0st is a RAT used to control infected endpoints. Gh0st is dropped by other malware to\ncreate a backdoor into a device that allows an attacker to fully control the infected device.\nJupyter, aka SolarMarker, is a highly evasive and adaptive .NET infostealer that is\ndownloaded by leveraging SEO-poisoning to create watering hole sites for the purpose of\ndeceiving unsuspecting users who visit the website and download a malicious document,\noften a zip or PDF file embedded with a malicious executable. The Top 10 Malware variants\ncomprise 76% of the total malware activity in March 2022, increasing 4% from February\n2022.\n\n\n-----\n\n## Malware Infection Vectors\n\nThe MS-ISAC tracks potential primary infection vectors for our Top 10 Malware each month\nbased on open-source reporting, as depicted in the graph below. We currently track four\ninitial infection vectors: Dropped, Malvertisement, Malspam, and Network. The MS-ISAC has\nnot had any malware in the Top 10 use the initial infection vector Network in the past year.\nSome malware employ different vectors in different contexts and are thus tracked as\n_Multiple._\n\nIn March 2022, Malvertisement accounted for the greatest number of alerts. Malvertisement\nremains the top initial infection vector due to Shlayer activity. Activity levels for\n_Malvertisement, and Multiple decreased, while activity for Dropped and Malspam increased._\nIt is likely that Malvertisement will remain the primary infection vector as the Shlayer\ncampaign continues. The Multiple category increases and decreases at an unpredictable\nrate, which making it difficult to analyze trends. This category will likely continue to comprise\na significant portion of the initial infection vectors as malware becomes more sophisticated\n\n\n-----\n\nand employs multiple methods to infect systems. Malspam consistently represents a portion\nof the Top 10 malware as it is one of the oldest and most reliable primary initial infection\nvectors used by cyber threat actors in both this category and the Multiple category.\n\n**Dropped – Malware delivered by other malware already on the system, an exploit kit,**\ninfected third-party software, or manually by a cyber threat actor. Currently, Gh0st, Jupyter,\nand Mirai are the malware using this technique.\n\n**Multiple – Malware that currently favors at least two vectors. Currently, Arechclient2,**\nCoinMiner, Delf, and ZeuS are the malware utilizing multiple vectors.\n\n**Malspam – Unsolicited emails either direct users to malicious web sites or trick users into**\ndownloading or opening malware. Top 10 Malware using this technique include Agent Tesla\nand NanoCore.\n\n**Malvertisement – Malware introduced through malicious advertisements. Currently, Shlayer**\nis the only Top 10 Malware using this technique.\n\n## Top 10 Malware and IOCs\n\nBelow are the Top 10 Malware ranked in order of prevalence. The respective indicators of\ncompromise (IOCs) are provided to aid in detecting and preventing infections from these Top\n10 Malware variants. Note: The associated URIs are aligned with malware’s respective\ndomain(s) or IP(s) and increase the likelihood of maliciousness when found together. The\nURIs alone are not inherently malicious.\n\n### 1. Shlayer\n\n\n-----\n\nShlayer is a downloader and dropper for MacOS malware. It is primarily distributed through\nmalicious websites, hijacked domains, and malvertizing posing as a fake Adobe Flash\nupdater.\n\nAll Shlayer domains follow the same pattern <api.random_name.com>. Below area several\nexamples of domains Shlayer uses.</api.random_name.com>\n\n**Domains**\n\napi[.]interfacecache[.]com\napi[.]scalableunit[.]com\napi[.]typicalconfig[.]com\napi[.]standartanalog[.]com\napi[.]fieldenumerator[.]com\napi[.]practicalsprint[.]com\napi[.]searchwebsvc[.]com\napi[.]connectedtask[.]com\napi[.]navigationbuffer[.]com\napi[.]windowtask[.]com\n\n### 2. ZeuS\n\nZeuS is a modular banking trojan which uses keystroke logging to compromise victim\ncredentials when the user visits a banking website. Since the release of the ZeuS source\ncode in 2011, many other malware variants have adopted parts of its codebase, which\nmeans that events classified as ZeuS may actually be other malware using parts of the ZeuS\ncode.\n\n### 3. Agent Tesla\n\nAgent Tesla is a RAT that exfiltrate credentials, log keystrokes, and capture screenshots from\nan infected computer.\n\n### 4. NanoCore\n\nNanoCore is a RAT spread via malspam as a malicious Excel XLS spreadsheet. As a RAT,\nNanoCore can accept commands to download and execute files, visit websites, and add\nregistry keys for persistence.\n\n### 5. CoinMiner\n\nCoinMiner is a cryptocurrency miner family that typically uses Windows Management\nInstrumentation (WMI) and EternalBlue to spread across a network. Additionally, it typically\nuses the WMI Standard Event Consumer scripting to execute scripts for persistence.\n\n\n-----\n\nHowever, due to multiple variants of this malware, capabilities may vary. CoinMiner spreads\nthrough malspam or is dropped by other malware.\n\n### 6. Delf\n\nDelf is a family of malware with multiple variants written in the Delphi programming language,\nwhere most are downloaders. Campaigns, targets, infection vectors and capabilities vary\nbased on the variant. Delf has multiple initial infection vectors, such as: dropped, malspam,\nor unintentional downloaded from a malicious website. Some of the abilities Delf variants\nexhibit include: backdoor or proxy functionality, stealing information, terminating antivirus\napplications, and mass mailing.\n\n### 7. Gh0st\n\nGh0st is a RAT used to control infected endpoints. Gh0st is dropped by other malware to\ncreate a backdoor into a device that allows an attacker to fully control the infected device.\n\n### 8. Jupyter\n\nJupyter aka SolarMarker, is a highly evasive and adaptive .NET infostealer that is\ndownloaded by leveraging SEO-poisoning to create watering hole sites for the purpose of\ndeceiving unsuspecting users to visit the website and download a malicious document, often\na zip or PDF file embedded with a malicious executable. Jupyter primarily targets browser\ndata in browsers such as Chrome, Chromium, and Firefox and has full backdoor functionality.\n\nIPs\n\n37[.]120.233[.]92\n89[.]44.9[.]108\n92[.]204.160[.]101\n92[.]204.160[.]114\n146[.]70.101[.]97\n146[.]70.53[.]153\n146[.]70.40[.]236\n193[.]29.104[.]89\n\n### 9. Arechclient2\n\nArechclient2, aka SectopRAT, is a .NET RAT with numerous capabilities including multiple\nstealth functions. Arechclient2 can profile victim systems, steal information such as browser\nand crypto-wallet data, and launch a hidden secondary desktop to control browser sessions.\nAdditionally, it has several anti-VM and anti-emulator capabilities.\n\n### 10. Mirai\n\n\n-----\n\nMirai is a malware botnet known to compromise Internet of Things (IoT) devices in order to\nconduct large-scale DDoS attacks. Mirai is dropped after an exploit has allowed the attacker\nto gain access to a machine.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-15 - Top 10 Malware March 2022.pdf"
    ],
    "report_names": [
        "2022-04-15 - Top 10 Malware March 2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1677809235,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1677662436,
    "ts_modification_date": 1677662436,
    "files": {
        "pdf": "https://archive.orkl.eu/3a2d0e33b761ad7cfa02d3874d86574f22b31894.pdf",
        "text": "https://archive.orkl.eu/3a2d0e33b761ad7cfa02d3874d86574f22b31894.txt",
        "img": "https://archive.orkl.eu/3a2d0e33b761ad7cfa02d3874d86574f22b31894.jpg"
    }
}