{
    "id": "355c42f6-c001-48a8-98ba-ce989cbdf095",
    "created_at": "2023-01-12T15:08:58.829411Z",
    "updated_at": "2025-03-27T02:17:05.829456Z",
    "deleted_at": null,
    "sha1_hash": "5cb29aa233b02b9b520cf8bfc39a708612909e0a",
    "title": "2021-06-28 - Snake Keylogger’s Many Skins- Analysing Code Reuse Among Infostealers",
    "authors": "",
    "file_creation_date": "2022-05-28T19:08:56Z",
    "file_modification_date": "2022-05-28T19:08:56Z",
    "file_size": 4478765,
    "plain_text": "# Recent Posts\n\n**[threatresearch.ext.hp.com/the-many-skins-of-snake-keylogger/](https://threatresearch.ext.hp.com/the-many-skins-of-snake-keylogger/)**\n\nJune 28, 2021\n\n[HP Threat Research Blog • Snake Keylogger’s Many Skins: Analysing Code Reuse Among](https://threatresearch.ext.hp.com/blog/)\nInfostealers\n\n## Snake Keylogger’s Many Skins: Analysing Code Reuse Among Infostealers\n\nSnake is a modular .NET keylogger and credential stealer first spotted in late November\n2020. Since then, we’ve seen campaigns spreading this malware almost daily. Snake’s name\nwas derived from strings found in its log files and string obfuscation code. Using the\nmalware’s builder, a threat actor can select and configure desired features then generate\nnew payloads. For this reason, the capabilities of samples found in the wild can vary. This\narticle describes Snake’s capabilities, its infection chain and code similarities with four other\ncommodity keyloggers.\n\n\n-----\n\n[Figure 1 – Publicly reported Snake keylogger detections over time.](https://bazaar.abuse.ch/browse/signature/SnakeKeylogger/)\n\n## Infection Chain\n\nCampaigns delivering Snake in 2021 used malicious spam to distribute the malware, either\nin RTF or archive attachments.\n\n### Delivery\n\nThe first type of downloader we’ve seen used to deploy Snake are RTF documents\ncontaining the well-known Microsoft Office Equation Editor exploit (CVE-2017-11882). The\ndocuments were renamed with .DOC file extensions and attached to emails themed as\nlegitimate business communications. If the recipient runs a vulnerable version of Microsoft\nOffice, the exploit downloads an executable from a remote server and executes it. This file is\na packed version of Snake keylogger.\n\n[Figure 2 – A malicious RTF email attachment exploiting CVE-2017-11882 isolated by HP](https://www.virustotal.com/gui/file/1a5b15b2be0615e8f31a29e7130822f88d4aa3b9365493c7c9065f0bcc6785b6/detection)\nWolf Security.\n\nWith the second method, attackers send spam with archive files attachments containing\npacked Snake executables. When the recipient opens the archive file, it contains a packed\ncopy of Snake, requiring the user to double click the executable to run it. We found Snake\nbeing distributed in IMG, ZIP, TAR, Z, GZ, ISO, CAB, 7z and RAR attachments.\n\n\n-----\n\n[Figure 3 – A malicious IMG email attachment delivering Snake Keylogger isolated by HP](https://www.virustotal.com/gui/file/c4a81c92d86e75bc35f4c993c6c7ebf19b4f8cbae4811f04754051fddbaa5ff4/detection)\nWolf Security.\n\n### Unpacking and execution\n\nTo reduce chances of detection by endpoint security tools, the Snake samples we analysed\nwere packed. Shortly after execution, the malware unpacks itself by following the process in\nFigure 4.\n\nFigure 4 – Snake’s unpacking and execution process.\n\nFirst, the malware decrypts and loads an encrypted file in the resources section of the .NET\n[file using DES, a common block cipher.](https://en.wikipedia.org/wiki/Data_Encryption_Standard)\n\n\n-----\n\nFigure 5 – Call to decryption method with .NET resource and key as argument.\n\nThe key used to decrypt the file are the first 8 bytes of the SHA256 hash of a string in the\nsource code. Since the UTF-16 encoded so you need to choose the correct encoding when\ncalculating the hash to decrypt the file. Figure 5 shows the key (a string of Unicode\ncharacters) being passed as the second argument to the PerSec function. Since DES is a\nblock cipher, a mode of operation needs to be specified so that the decryption method knows\nhow to process multiple blocks of ciphertext. Snake’s packer uses electronic codebook\n(ECB) as its mode, meaning no initialisation vector is required and therefore only the\nciphertext and the key are needed.\n\nFigure 6 – DES decryption method.\n\nThe decrypted file is a dynamic link library (DLL) called CaptIt.dll, which is loaded. This file\ncontains two encrypted files as resources, which are unpacked and executed at runtime. The\nfirst is the Snake keylogger payload, and the other is an executable file that is used to run\nand hide the malware’s presence. Before decrypting these files, CaptIt.dll copies the packed\nexecutable to the user’s start-up folder (C:\\Users\\\n_<Username>\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup) so that it_\nruns whenever the device is restarted.\n\nFigure 7 – DLL decryption and string decryption calls.\n\n\n-----\n\nThis time, [AES in ECB mode is used to decrypt another DLL file in CapIt.dll. Again, a](https://en.wikipedia.org/wiki/Advanced_Encryption_Standard)\nSHA256 hash of a string is used as the key.\n\nFigure 8 – AES decryption method.\n\nIn addition to decrypting the DLL, the function decrypts a string that corresponds to the\nmethod name of the DLL that has just been unpacked. This method, which is started in a\nnew thread, expects two arguments: a file path and payload name (Figure 9).\n\nFigure 9 – DLL load and execution.\n\nThe second encrypted resource in CapIt.dll is decrypted in the same way as CaptIt.dll, using\nDES in ECB mode with a key passed to the method as an argument.\n\nFigure 10 – Call to DES decryption method with resource and key as argument.\n\nThe Snake payload is hidden inside a legitimate process using RunPE, a well-known\nprocess hollowing technique. First, the file path passed as the first argument is used to start\na new process in suspended mode. This is followed by calls to Windows APIs\nGetThreadContext, ZwUnmapViewOfSection, VirtualAllocEx, WriteProcessMemory,\nSetThreadContext and ResumeThread. These replace the context of the newly-created\nprocess with the malware and then launches it. We found a C# implementation of this\nfunction on [GitHub. At this point, the Snake payload is unpacked and starts running the](https://github.com/NYAN-x-CAT/CSharp-RunPE/blob/master/RunPE/RunPE.cs)\nmodules configured by the attacker.\n\n\n-----\n\n### Code Obfuscation\n\nSnake is written in .NET so instead of being compiled into native code, it is compiled into\nMicrosoft Intermediate Language with meta data about the project. It’s possible to recover a\ndecompiled version of the source code that has almost the same structure as the original\n[code using tools such as dnSpy, which significantly simplifying analysis. However, many](https://github.com/dnSpy/dnSpy)\nthreat actors who use .NET malware try to prevent decompilation by obfuscating their code.\n[In March 2021, we found Snake samples reported to MalwareBazaar were obfuscated using](https://bazaar.abuse.ch/)\nfive tools:\n\nConfuserEx / Beds Protector\nDeepSea 4.1\nBabel .NET\nNET\nObfuscar\n\nThese obfuscators make it difficult to analyse the source code by renaming symbols,\ncomplicating the code’s control flow and encrypting strings and resources. Fortunately, there\n[are often counter-techniques to reverse these obfuscations, such as those in the de4dot and](https://github.com/de4dot/de4dot)\n[DeObfuscar-Static projects.](https://github.com/DarkObb/DeObfuscar-Static)\n\n## Snake’s Features\n\nBecause Snake is modular, the behaviour of samples in the wild varies depending on what\nfeatures are enabled when the malware is built. It is highly likely that functionality is\nconfigured and created using a builder tool. Instead of adding only the selected\nfunctionalities to the payload, the builder appears to integrate all features and simply\nactivates the ones selected by the operator. Figure 11 shows Snake’s features mapped to\n[MITRE ATT&CK techniques.](https://attack.mitre.org/)\n\n\n-----\n\nFigure 11 – MITRE ATT&CK techniques that Snake can use.\n\nUnsurprisingly, most of Snake keylogger’s features fall into the tactic categories of Credential\nAccess, Collection and Exfiltration. Here are some descriptions of Snake’s features:\n\n### Persistence\n\nAs described in the unpacking and execution section, the malware copies itself into the startup folder to be activated again after a reboot of the device. As a further persistence\n[functionality, Snake keylogger has the option of creating a run registry key, which has the](https://docs.microsoft.com/en-us/windows/win32/setupapi/run-and-runonce-registry-keys)\nsame effect and launches the malware when the computer is started.\n\n### Defense Evasion\n\nSnake uses two defense evasion techniques. The first is a function that terminates a list of\nsecurity tool processes. These include anti-virus processes and tools that are commonly\nused to analyse malware. In the case of OllyDbg, the process name was misspelled meaning\nSnake would would fail to kill the process. Moreover, modern anti-virus programs will not be\nterminated by this technique because they will just restart themselves, or use a kernel driver\nto prevent the malware from opening a handle to their process without the right permissions.\nThe second technique is a self-termination function where Snake removes itself from the\ninfected system and terminates its own process.\n\n### Credential Access\n\nMost of Snake’s functionality relates to collecting sensitive information from infected\ncomputers, such as credentials and configurations. Snake parses login credentials from web\nbrowser databases, email clients, Discord and Pidgin chat clients and stored passwords for\nWiFi networks. Snake can extract credentials from Google Chrome, Mozilla Firefox and\nMicrosoft Edge as well as several other less well-known web browsers. It can also steal\ncredentials from a variety of email clients, including Microsoft Outlook, Mozilla Thunderbird,\nFoxmail and Postbox. A full list of all credential stealing modules can be found in the\nappendix.\n\n### Discovery\n\nBefore harvesting credentials, Snake runs a series of host and network checks to determine\nif it is running in a sandbox and to orientate the attacker within the victim’s environment. The\nhost discovery function checks the operating system version, the computer name, hard disk\nsize, time and date configuration as well as installed RAM. One sample we analysed needed\nthe host to have more than 3.75 GB of RAM and its hostname not match a list of blocklisted\nnames to pass the checks. Further checks are executed by the network discovery module\nwhich first resolves the client’s public IP address using the online service,\n_checkip dyndns[ ]org If the public IP matches a blocklist of addresses used by malware_\n\n\n-----\n\nanalysis services, Snake does not run any credential stealing. Using the public IP address,\nSnake resolves an approximate geolocation using the freegeoip[.]app service. Those\ndomains with Snake’s User-Agent (see appendix) can be used to detect its presence.\n\n### Collection\n\nSnake also collects configuration files that can contain sensitive information. One program\ntargeted by Snake is FileZilla. FileZilla can be used as FTP client and therefore saves\nconfigurations of previously accessed servers. Snake also looks for the infected system’s\nWindows product key. Another feature is Snake’s clipboard stealer, which differs from its\nother stealing functionality because it runs periodically rather than once at first execution.\nThis module saves the contents of the clipboard, which may contain sensitive information\nsuch as passwords that are temporarily stored in the clipboard when copied from a password\nmanager. Snake also periodically takes screenshots of the infected system. The images are\nstored in a folder called “Snake keylogger” in the user’s documents folder until they are sent\nto the attacker. Afterwards, the images are deleted. Snake’s keylogger function runs\n[permanently in the background by calling the SetWindowsHookExA API, thereby adding](https://docs.microsoft.com/en-us/windows/win32/api/winuser/nf-winuser-setwindowshookexa)\nitself to the keyboard hook chain. Each time a key is pressed, a callback function is called,\nwhich saves the input and passes the call to the next link in the hook chain. Collected input is\nperiodically sent back to the attacker using one of multiple available exfiltration\nfunctionalities. Interestingly, the keylogging module was not activated in the Snake keylogger\nsamples found since the end of February 2020. Whether this was a mistake on the part of\nthe attacker or a deliberate choice is not clear.\n\n### Exfiltration\n\nSnake has several configurable data exfiltration channels. These include the option of\nuploading the data to a server using the FTP protocol, sending the data as an attachment via\nemail, or publishing it in a Telegram channel via a POST request. The attacker decides which\nof these exfiltration techniques to choose when configuring the malware using the builder.\nTherefore, the necessary credentials, configurations and tokens, are stored directly in the\nmalware. In the samples we observed, attackers preferred to exfiltrate data via Telegram or\nemail.\n\n### Impact\n\nIn addition to the function that terminates security programs to bypass endpoint defenses,\nthe malware also has a function that terminates the Chrome web browser. Since terminating\na web browser is not done for prevention or detection reasons, there must be another\nreason. One possibility is that Snake can only access credentials stored in Chrome if it isn’t\nrunning. Another keylogger called Matiex also had this flaw, raising the suspicion that the two\nfamilies share code.\n\n\n-----\n\nFigure 12 – Excerpt from a review of Matiex from a hacking forum.\n\n## Snake’s Link to Matiex Keylogger\n\n[In November 2020, a malware researcher commented about possible code links between](https://twitter.com/james_inthe_box/status/1333431409847926784?lang=en)\nSnake and Matiex. According to adverts on hacking forums, Matiex’s developer sold a\nkeylogger builder used to configure and generate malware clients using a subscription model\nthat is common for malware-as-a-service operations.\n\nFigure 13 – Matiex’s subscription model advertised on a hacking forum.\n\nComparing the source code of the two malware families uncovered many similarities. Both\nfamilies have functions to terminate a list of the same anti-virus and security tool processes.\n\n\n-----\n\nFigure 14 – Comparison of process termination functions.\n\nFurthermore, both have procedures to uninstall themselves, using the same command.\n\nFigure 15 – Comparison of self-destruction functions.\n\nTheir functions to upload recorded keystrokes via POST requests are also identical.\n\n\n-----\n\nFigure 16 – Comparison of keystroke exfiltration functions.\n\nBoth families have the option to exfiltrate data to a Telegram channel. The functions are\nidentical, but for their names.\n\nFigure 17 – Comparison of Telegram exfiltration functions.\n\nThe only difference between the families’ GeoIP functions are the names.\n\nFigure 18 – Comparison of GeoIP orientation functions.\n\nThe logging functions reveals the names of the keyloggers. But the code is nearly identical,\nincluding variable names\n\n\n-----\n\nFigure 19 – Comparison of logging functions.\n\n_TheInfo is a variable that contains information about the infected system. Matiex collects far_\nmore information than Snake, which is then transmitted to the attacker. Snake, however, has\nan AntiBot function that terminates the malware if the infected system has a blocklisted IP\naddress or hostname.\n\nFigure 20 – Comparison of variables showing collected information.\n\nMany of the variable names used between the families are similar. For example, the\nexfiltration channel is defined analogously via a string variable in both families. Furthermore,\nthe keylogger class is named identically and both have a HSHChecker variable with the\nsame initialisation value.\n\n\n-----\n\nFigure 21 – Similar initialised variables between Snake and Matiex.\n\nBased on the code similarities shown and the corresponding malware analysis, we think it is\nlikely that Matiex and Snake share the same code base and that Snake is derived from the\nformer. The families do have a few minor differences between them:\n\nMatiex does not check for a list of excluded IP addresses, hostnames or the amount of\nRAM installed.\nMatiex can make audio recordings.\nMatiex can exfiltrate data over Discord, an instant messaging service.\n\nThe question is when and how was Matiex’s source code first reused in Snake? In February\n2021, Matiex’s source code was offered for sale in an underground forum. One possibility is\nthat someone bought the source code of Matiex and rebranded it into Snake. However, our\nfirst sighting of Snake was months before the source code was put up for sale, so Snake’s\ndevelopers must have obtained Matiex’s source code by another means.\n\n## Matiex’s Link to Other Keyloggers\n\nDuring this research, we found other .NET keyloggers advertised as a service, similar to\nMatiex. Analysing the code of the 404, Cheetah and Phoenix keyloggers revealed they were\nalso very similar to Matiex. Figure 22 shows when each family was offered for sale as a\nservice and when its source code was offered for sale.\n\nFigure 22 – Timeline of sales activity across hacking forums\n\n\n-----\n\nLooking at the code similarity of the different keyloggers, it struck us how similar their code\nis. 404 and Phoenix keylogger use a slightly different function to record keystrokes and can\nexfiltrate data using the Pastebin API, but are otherwise extremely similar to the other\nfamilies. Cheetah uses the same keylogging functions as Snake and Matiex, but has fewer\nmodules for extracting passwords. The data is exfiltrated in the same way as Snake via\nTelegram, FTP or SMTP.\n\nFigure 23 – An overview of the capabilities of keyloggers linked to Snake.\n\n## Conclusion\n\nAnalysing Snake reveals that it is indeed a comprehensive keylogger and data stealer.\nBased on our analysis, we think five keylogger families active in the last two years are likely\nderived from the same code base. However, this is not an exhaustive list so it is possible that\nother keyloggers with similar code are also in circulation. This “remix” behaviour of\nopportunistically copying source code from established malware families demonstrates how\neasy it is for cybercriminals to create their own malware-as-service businesses – and the\nimportance for enterprise defenses to stay ahead of malware developers.\n\n## Indicators of Compromise\n\n**Snake’s Credential Stealing Modules:**\n\nOutlook Chrome Cent Yandex FireFox\n\n\n-----\n\nFoxmail Coowon xVast Nichrome WaterFox\n\nKinzaa CocCoc Chedot Amigo Thunderbird\n\nSputnik Uran Superbird Kometa SeaMonkey\n\nFalkon QQ 360_English Xpom IceDragon\n\nSalamWeb orbitum 360_China Elements CyberFox\n\nCoolNovo Slimjet Comodo Microsoft Slim\n\nQIPSurf Iridium Brave Opera IceCat\n\nBlackHawk Vivaldi Torch FileZilla PostBox\n\n7Star Iron UC Pidgin PaleMoon\n\nSleipnir Chromium Blisk Liebao TheWiFi_Orginal\n\nCitrio Ghost Epic avast WindowsProductKey_Orginal\n\nChrome_Canary Discord\n\n**Excluded IP Addresses:**\n\n1.254.1[.]255\n34.122.197[.]93\n89.187.165[.]47\n89.208.29[.]133\n92.118.13[.]18\n91.132.136[.]174\n95.26.248[.]29\n95.26.253[.]176\n170.55.59[.]2\n185.220.101[.]5\n192.64.6[.]217\n195.74.76[.]237\n195.239.51[.]117\n\n**Excluded Hostnames:**\n\nJohn\nadmin\nAdmin\nADMIN\nUSER\n\n\n-----\n\nUser\nuser\nJOHN\nJOHN-PC\nWALKER-PC\nJohn-PC\nWALKER\n\n**User Agents**\n\n_Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.2; .NET CLR1.0.3705;)_\n\n**Contacted Domains**\n\ndyndns[.]org\nfreegeoip[.]app\n\nTags\n\n[cybercrime](https://threatresearch.ext.hp.com/blog/?post-tag=cybercrime) [keylogger](https://threatresearch.ext.hp.com/blog/?post-tag=keylogger) [Malware](https://threatresearch.ext.hp.com/blog/?post-tag=Malware) [snake](https://threatresearch.ext.hp.com/blog/?post-tag=snake)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-28 - Snake Keylogger’s Many Skins- Analysing Code Reuse Among Infostealers.pdf"
    ],
    "report_names": [
        "2021-06-28 - Snake Keylogger’s Many Skins- Analysing Code Reuse Among Infostealers.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536138,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653764936,
    "ts_modification_date": 1653764936,
    "files": {
        "pdf": "https://archive.orkl.eu/5cb29aa233b02b9b520cf8bfc39a708612909e0a.pdf",
        "text": "https://archive.orkl.eu/5cb29aa233b02b9b520cf8bfc39a708612909e0a.txt",
        "img": "https://archive.orkl.eu/5cb29aa233b02b9b520cf8bfc39a708612909e0a.jpg"
    }
}