{
    "id": "35ce3a9c-8934-405f-94a8-2221ec16dd6e",
    "created_at": "2023-01-12T15:00:04.368187Z",
    "updated_at": "2025-03-27T02:16:25.564927Z",
    "deleted_at": null,
    "sha1_hash": "e38c0dc45e2d0f9f858df1f59d14d4624910386f",
    "title": "2020-03-10 - New action to disrupt world’s largest online criminal network",
    "authors": "",
    "file_creation_date": "2022-05-27T22:05:37Z",
    "file_modification_date": "2022-05-27T22:05:37Z",
    "file_size": 118520,
    "plain_text": "# New action to disrupt world’s largest online criminal network\n\n**[blogs.microsoft.com/on-the-issues/2020/03/10/necurs-botnet-cyber-crime-disrupt/](https://blogs.microsoft.com/on-the-issues/2020/03/10/necurs-botnet-cyber-crime-disrupt/)**\n\nMarch 10, 2020\n\nToday, Microsoft and partners across 35 countries took coordinated legal and technical steps\nto disrupt one of the world’s most prolific [botnets, called Necurs, which has infected more](https://news.microsoft.com/videos/what-is-a-botnet/)\nthan nine million computers globally. This disruption is the result of eight years of tracking\nand planning and will help ensure the criminals behind this network are no longer able to use\nkey elements of its infrastructure to execute cyberattacks.\n\nA botnet is a network of computers that a cybercriminal has infected with malicious software,\nor malware. Once infected, criminals can control those computers remotely and use them to\ncommit crimes. Microsoft’s Digital Crimes Unit, BitSight and others in the security community\nfirst observed the Necurs botnet in 2012 and have seen it distribute several forms of\n[malware, including the GameOver Zeus banking trojan.](https://blogs.microsoft.com/blog/2014/06/02/microsoft-helps-fbi-in-gameover-zeus-botnet-cleanup/)\n\nThe Necurs botnet is one of the largest networks in the spam email threat ecosystem, with\nvictims in nearly every country in the world. During a 58-day period in our investigation, for\nexample, we observed that one Necurs-infected computer sent a total of 3.8 million spam\n\n\n-----\n\nemails to over 40.6 million potential victims.\n\nNecurs is believed to be operated by criminals based in Russia and has also been used for a\nwide range of crimes including pump-and-dump stock scams, fake pharmaceutical spam\nemail and “Russian dating” scams. It has also been used to attack other computers on the\ninternet, steal credentials for online accounts, and steal people’s personal information and\nconfidential data. Interestingly, it seems the criminals behind Necurs sell or rent access to the\ninfected computer devices to other cybercriminals as part of a botnet-for-hire service. Necurs\nis also known for distributing financially targeted malware and ransomware, cryptomining,\nand even has a DDoS (distributed denial of service) capability that has not yet been\nactivated but could be at any moment.\n\nOn Thursday, March 5, the U.S. District Court for the Eastern District of New York issued an\norder enabling Microsoft to take control of U.S.-based infrastructure Necurs uses to distribute\nmalware and infect victim computers. With this legal action and through a collaborative effort\ninvolving public-private partnerships around the globe, Microsoft is leading activities that will\nprevent the criminals behind Necurs from registering new domains to execute attacks in the\nfuture.\n\nThis was accomplished by analyzing a technique used by Necurs to systematically generate\nnew domains through an algorithm. We were then able to accurately predict over six million\nunique domains that would be created in the next 25 months. Microsoft reported these\ndomains to their respective registries in countries around the world so the websites can be\nblocked and thus prevented from becoming part of the Necurs infrastructure. By taking\ncontrol of existing websites and inhibiting the ability to register new ones, we have\nsignificantly disrupted the botnet.\n\nMicrosoft is also taking the additional step of partnering with Internet Service Providers\n(ISPs) and others around the world to rid their customers’ computers of malware associated\nwith the Necurs botnet. This remediation effort is global in scale and involves collaboration\nwith partners in industry, government and law enforcement via the Microsoft Cyber Threat\nIntelligence Program (CTIP). Through CTIP, Microsoft provides law enforcement,\ngovernment Computer Emergency Response Teams (CERTs), ISPs and government\nagencies responsible for the enforcement of cyber laws and the protection of critical\ninfrastructure with better insights into criminal cyber infrastructure located within their\njurisdiction, as well as a view of compromised computers and victims impacted by such\ncriminal infrastructure.\n\nFor this disruption, we are working with ISPs, domain registries, government CERTs and law\nenforcement in Mexico, Colombia, Taiwan, India, Japan, France, Spain, Poland and\nRomania, among others. Each of us has a critical role to play in protecting customers and\nkeeping the internet safe.\n\n[To make sure your computer is free of malware, visit support.microsoft.com/botnets.](https://docs.microsoft.com/en-us/windows/security/threat-protection/intelligence/safety-scanner-download)\n\n\n-----\n\nTags: [botnet,](https://blogs.microsoft.com/on-the-issues/tag/botnet/) [CTIP,](https://blogs.microsoft.com/on-the-issues/tag/ctip/) [cyberattacks,](https://blogs.microsoft.com/on-the-issues/tag/cyberattacks/) [cybercrime,](https://blogs.microsoft.com/on-the-issues/tag/cybercrime-2/) [Digital Crimes Unit,](https://blogs.microsoft.com/on-the-issues/tag/digital-crimes-unit/) Microsoft Cyber Threat\nIntelligence Program, [necurs](https://blogs.microsoft.com/on-the-issues/tag/necurs/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-10 - New action to disrupt world’s largest online criminal network.pdf"
    ],
    "report_names": [
        "2020-03-10 - New action to disrupt world’s largest online criminal network.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535604,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653689137,
    "ts_modification_date": 1653689137,
    "files": {
        "pdf": "https://archive.orkl.eu/e38c0dc45e2d0f9f858df1f59d14d4624910386f.pdf",
        "text": "https://archive.orkl.eu/e38c0dc45e2d0f9f858df1f59d14d4624910386f.txt",
        "img": "https://archive.orkl.eu/e38c0dc45e2d0f9f858df1f59d14d4624910386f.jpg"
    }
}