{
    "id": "35ffeb1c-ae11-44c4-8549-6f1305a10496",
    "created_at": "2023-01-12T15:03:38.496094Z",
    "updated_at": "2025-03-27T02:10:00.002605Z",
    "deleted_at": null,
    "sha1_hash": "2939cf4f2b5001aca04ba1d6a3a02417e07b7398",
    "title": "2017-12-11 - MoneyTaker- in pursuit of the invisible",
    "authors": "",
    "file_creation_date": "2022-05-29T01:17:57Z",
    "file_modification_date": "2022-05-29T01:17:57Z",
    "file_size": 504660,
    "plain_text": "# MoneyTaker: in pursuit of the invisible\n\n**group-ib.com/blog/moneytaker**\n\n11.12.2017\n\nGroup-IB has uncovered a hacker group attacking banks in the USA and Russia\n\nIn less than two years, this group has conducted over 20 successful attacks on financial\ninstitutions and legal firms in the USA, UK and Russia. The group has primarily been\ntargeting card processing systems, including the AWS CBR (Russian Interbank System) and\npurportedly SWIFT (US). Given the wide usage of STAR in LATAM, financial institutions in\nLATAM could have particular exposure to a potential interest from the MoneyTaker group.\n[Get the report](https://www.group-ib.com/resources/threat-research/money-taker.html)\n\n\n-----\n\nAlthough the group has been successful at targeting a number of banks in different\ncountries, to date, they have gone unreported. In addition to banks, the MoneyTaker group\nhas attacked law firms and also financial software vendors. In total, Group-IB has confirmed\n20 companies as MoneyTaker victims, with 16 attacks on US organizations, 3 attacks on\nRussian banks and 1 in the UK.\n\nBy constantly changing their tools and tactics to bypass antivirus and traditional security\nsolutions and most importantly carefully eliminating their traces after completing their\noperations, the group has largely gone unnoticed.\n\"MoneyTaker uses publicly available tools, which makes the attribution and investigation\nprocess a non-trivial exercise. In addition, incidents occur in different regions worldwide and\nat least one of the US Banks targeted had documents successfully exfiltrated from their\nnetworks, twice. Group-IB specialists expect new thefts in the near future and in order to\nreduce this risk, Group-IB would like to contribute our report identifying hacker tools,\ntechniques as well as indicators of compromise we attribute to MoneyTaker operations\".\n\n**Dmitry Volkov**\n\n**Co-Founder Group-IB and Head of Intelligence**\n\nMoneyTaker attacks: past and future\n\nThe first attack in the US that Group-IB attributes to this group was conducted in the spring\nof 2016: money was stolen from the bank by gaining access to First Data’s \"STAR\" network\noperator portal. Since that time, the group attacked companies in California, Utah,\nOklahoma, Colorado, Illinois, Missouri, South Carolina, North Carolina, Virginia and Florida.\n\nIn 2016, Group-IB identified 10 attacks conducted by MoneyTaker; 6 attacks on banks in the\nUS, 1 attack on a US service provider, 1 attack on a bank in the UK and 2 attacks\non Russian banks. Only one incident involving a Russian bank was promptly identified and\nprevented that is known to Group-IB.\n\nIn 2017, the number of attacks has remained the same with 8 US banks, 1 law firm and 1\nbank in Russia being targeted. The geography, however, has narrowed to only the USA and\nRussia.\n\n\n-----\n\nConnections between incidents\n\nUsing the Group-IB Threat Intelligence system, Group-IB researchers have discovered\nconnections between all 20 incidents throughout 2016 and 2017. Connections were identified\nnot only in the tools used, but also the distributed infrastructure, one-time-use components in\nthe attack toolkit of the group and specific withdrawal schemes – using unique accounts for\neach transaction. Another distinct feature of this group is that they stick around after the\nevent, continuing to spy on a number of impacted banks and sending corporate emails and\nother documents to Yandex and Mail.ru free email services in the first.last@yandex.com\nformat.\n\nImportant findings that enabled Group-IB to discover the links between crimes include\nprivilege escalation tools compiled based on codes presented at the Russian cybersecurity\nconference ZeroNights 2016. Also, in some incidents, hackers used the infamous Citadel\nand Kronos banking Trojans. The latter was used to deliver Point-of-Sale (POS) malware\ndubbed ScanPOS.\n\n\n-----\n\nConnections between incidents\n\nBy analyzing the attack infrastructure, Group-IB identified that they group continuously\nexfiltrates internal banking documentation to learn about bank operations in preparation for\nfuture attacks. Exfiltrated documents include: admin guides, internal regulations and\ninstructions, change request forms, transaction logs, etc. A number of incidents with copied\ndocuments that describe how to make transfers through SWIFT are being investigated by\nGroup-IB. Their contents and geography indicate that banks in Latin America may be\ntargeted next by MoneyTaker.\n\nGroup-IB has provided Europol and Interpol with detailed information about the MoneyTaker\ngroup for further investigative activities as part of our cooperation in fighting cybercrime.\n\nMoneyTaker: arsenal for attacks\n\nGroup-IB reports that MoneyTaker uses both borrowed and their own self-written tools. For\nexample, to spy on bank operators they developed an application with 'screenshot' and\n'keylogger' capabilities. This program is designed to capture keystrokes, take screenshots of\nthe user's desktop and get contents from the clipboard. The application is compiled in Delphi\nand contains 5 timers: functions of the application (such as taking screenshots, capturing\nkeystrokes, disabling itself) are executed once the timer triggers. To circumvent antivirus and\nautomated sample analysis, hackers again used 'security measures': they implemented the\nanti-emulation function in the timer code.\n\n\n-----\n\nIn an attack on a Russian bank through the AWS CBR, hackers used a tool called\nMoneyTaker v5.0, which the group has been named after. Each component of this modular\nprogram performs a certain action: searches for payment orders and modifies them, replaces\noriginal payment details with fraudulent ones, and then erases traces. The success of\nreplacement is due to the fact that at this stage the payment order has not yet been signed,\nwhich will occur after payment details are replaced. In addition to hiding the tracks, the\nconcealment module again substitutes the fraudulent payment details in a debit advice after\nthe transaction back with the original ones. This means that the payment order is sent and\naccepted for execution with the fraudulent payment details, and the responses come as if the\npayment details were the initial ones. This gives cybercriminals extra time to mule funds\nbefore the theft is detected.\n\nLeaving no trace behind\n\nTo conduct targeted attacks, MoneyTaker use a distributed infrastructure that is difficult to\ntrack. A unique feature of the infrastructure is a persistence server, which delivers payloads\nonly to victims with an IP addresses in MoneyTaker's whitelist.\n\nTo control the full operation, MoneyTaker uses a Pentest framework Server. On it, the\nhackers install a legitimate tool for penetration testing – Metasploit. After successfully\ninfecting one of the computers and gaining initial access to the system, the attackers perform\nreconnaissance of the local network in order to gain domain administrator privileges and\neventually consolidate control over the network. Hackers use Metasploit to conduct all these\nactivities: network reconnaissance, search for vulnerable applications, exploit vulnerabilities,\nescalate systems privileges, and collect information.\n\nThe group uses 'fileless' malware only existing in RAM and is destroyed after reboot. To\nensure persistence in the system MoneyTaker relies on PowerShell and VBS scripts - they\nare both difficult to detect by antivirus and easy to modify. In some cases, they have made\nchanges to source code 'on the fly' – during the attack.\n\nAfter successful infection, they carefully erase malware traces. However, when investigating\nan incident in Russia, we managed to discover the initial point of compromise: hackers\npenetrated the bank's internal network by gaining access to the home computer of the bank's\nsystem administrator.\n\nIn addition, to protect C&C communications from being detected by security teams,\nMoneyTaker employs SSL certificates generated using names of well-known brands: Bank of\nAmerica, Federal Reserve Bank, Microsoft, Yahoo, etc.), instead of filling the fields out\nrandomly. In the US, they used the LogMeIn Hamachi solution for remote access.\nAttacks on card processing\n\n\n-----\n\nThe first attack on card processing that Group-IB specialists attribute to this group was\nconducted in May 2016. Having gained access to the bank network, the attackers\ncompromised the workstation of First Data's STAR network portal operators, making the\nchanges required and withdrawing the money. In January 2017, the attack was repeated in\nanother bank.\n\nThe scheme is extremely simple. After taking control over the bank's network, the attackers\nchecked if they could connect to the card processing system. Following this, they legally\nopened or bought cards of the bank whose IT system they had hacked. Money mules –\ncriminals who withdraw money from ATMs – with previously activated cards went abroad and\nwaited for the operation to begin. After getting into the card processing system, the attackers\nremoved or increased cash withdrawal limits for the cards held by the mules. They removed\noverdraft limits, which made it possible to overdraw even with debit cards. Using these cards,\nthe mules withdrew cash from ATMs, one by one. The average loss caused by one attack\nwas about $500,000 USD.\nFull report contains in-depth analysis of attack infrustructure, stealth techniques, IOCs,\nrecommendations\n\nExplore how this newly discovered threat actor managed to hide their traces for 18 months\n\nGet report\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-11 - MoneyTaker- in pursuit of the invisible.pdf"
    ],
    "report_names": [
        "2017-12-11 - MoneyTaker- in pursuit of the invisible.pdf"
    ],
    "threat_actors": [
        {
            "id": "746214d4-5d48-4644-b763-8e9a9c549c04",
            "created_at": "2022-10-25T16:07:23.878029Z",
            "updated_at": "2025-03-27T02:02:10.006583Z",
            "deleted_at": null,
            "main_name": "MoneyTaker",
            "aliases": [],
            "source_name": "ETDA:MoneyTaker",
            "tools": [
                "Kronos",
                "Metasploit",
                "MoneyTaker",
                "Screenshotter"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e5364c16-eb97-467e-a8c2-a720269498c1",
            "created_at": "2023-01-06T13:46:38.733469Z",
            "updated_at": "2025-03-27T02:00:02.904201Z",
            "deleted_at": null,
            "main_name": "MoneyTaker",
            "aliases": [],
            "source_name": "MISPGALAXY:MoneyTaker",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535818,
    "ts_updated_at": 1743041400,
    "ts_creation_date": 1653787077,
    "ts_modification_date": 1653787077,
    "files": {
        "pdf": "https://archive.orkl.eu/2939cf4f2b5001aca04ba1d6a3a02417e07b7398.pdf",
        "text": "https://archive.orkl.eu/2939cf4f2b5001aca04ba1d6a3a02417e07b7398.txt",
        "img": "https://archive.orkl.eu/2939cf4f2b5001aca04ba1d6a3a02417e07b7398.jpg"
    }
}