{
    "id": "360e3bab-5670-4805-aab1-989bba9c6c49",
    "created_at": "2023-01-12T15:05:37.578141Z",
    "updated_at": "2025-03-27T02:14:34.114638Z",
    "deleted_at": null,
    "sha1_hash": "5b5599fc4b3693218082a829e5b6a0a2859c7cd7",
    "title": "2020-12-23 - New attacks by UltraRank group",
    "authors": "",
    "file_creation_date": "2022-05-28T17:05:33Z",
    "file_modification_date": "2022-05-28T17:05:33Z",
    "file_size": 4296985,
    "plain_text": "# New attacks by UltraRank group\n\n**group-ib.com/blog/ultrarank**\n\n23.12.2020\n\n\n-----\n\nViktor Okorokov\n\nThreat Intelligence & Attribution analyst at Group-IB\n\n**Introduction**\n\nIn August 2020, Group-IB published the report \"UltraRank: the unexpected twist of a JSsniffer triple threat\". The report described the operations of the cybercriminal group\n**UltraRank, which in five years of activity had successfully attacked 691 eCommerce stores**\nand 13 website service providers.\n\n\n-----\n\nIn November 2020, Group-IB experts discovered a new wave of UltraRank attacks. Even\nthough new attacks were detected at the time, part of the group's infrastructure remained\nactive and some sites were still infected. The cybercriminals did not use existing domains for\nnew attacks but switched to a new infrastructure to store malicious code and collect\nintercepted payment data.\n\n[As part of UltraRank's new campaign, Group-IB Threat Intelligence and Attribution team](https://www.group-ib.com/intelligence-attribution.html)\ndiscovered 12 eCommerce websites infected with their JavaScript-sniffer. Eight of them\nremain infected at the moment of publication. Group-IB has sent notifications to the infected\nwebsites.\n\nThis time the JS sniffer's code was obfuscated using Radix obfuscation. This obfuscation\npattern had been used by only a few cybercriminal groups, one of which was the UltraRank\ngroup (Figure 1). After deobfuscating the code, Group-IB found that the attacks used a\nsniffer from the SnifLite family, already known to Group-IB experts and used by the threat\nactor UltraRank. Due to the relatively small number of infected websites, the attackers most\nlikely used the credentials in the CMS administrative panel, which, in turn, could have been\ncompromised using malware or as a result of brute force attacks.\n\nDuring their most recent series of attacks UltraRank stored their malicious code on the\nwebsite mimicking a legitimate Google Tag Manager domain. The analysis of the threat\nactor's infrastructure revealed that the main server was hosted by Media Land LLC, which is\nconnected with a bullet-proof hosting company.\n\nThis blog post examines UltraRank's new campaign, provides recommendations to banks,\npayment systems, and online merchants. You'll also find indicators of compromise, attackers'\nTTPs and relevant mitigation and defense techniques in accordance with MITRE ATT&CK\nand MITRE Shield that we recommend to use to protect against UltraRank.\n\n_Figure 1: Fragment of the obfuscated sniffer code_\n\n**Analysis of the JS Sniffer code**\n\n\n-----\n\nThe SnifLite JS sniffer family has been used by UltraRank since at least January 2019, when\n[it was utilized in an attack on the Adverline advertising network. Malicious code is uploaded](https://www.trendmicro.com/en_us/research/19/a/new-magecart-attack-delivered-through-compromised-advertising-supply-chain.html)\nto the infected website by a link to a JS file located on the website\nhXXp://googletagsmanager[.]co/, the domain disguised as a legitimate domain of the Google\nTag Manager googletagmanager.com. The cybercriminals' website\nhXXp://googletagsmanager[.]co/ is also used to collect intercepted payment card data as a\nsniffer gate (Figure 2).\n\n_Figure 2: Fragment of the deobfuscated JS sniffer code with a link to the gate to collect_\n_intercepted cards_\n\nThe function responsible for intercepting payment information in the SnifLite sniffer family is\nshown in Figure 3. The data collection algorithm is based on the function querySelectorAll,\nlike in the FakeLogistics and WebRank sniffer families used by the group earlier. A\ncomparison of these three families was outlined in the report \"UltraRank: the unexpected\ntwist of a JS-sniffer triple threat.\"\n\nAfter data is collected, it is written to local storage in an object named\ngoogle.verify.cache.001.\n\n_Figure 3: Fragment of the JS sniffer code with a function responsible for collecting payment_\n_card data_\n\nData is collected and sent only if the current address of the page where the user is located\ncontains one of the following keywords (Figure 4):\n\n\n-----\n\n- onepage\n\n- checkout\n\n- store\n\n- cart\n\n- pay\n\n- panier\n\n- kasse\n\n- order\n\n- billing\n\n- purchase\n\n- basket\n\nBefore sending an intercepted payment card, its data is extracted from the\n_google.verify.cache.001object stored locally and transmitted to the cybercriminals by\nsending an HTTP GET request.\n\n_Figure 4: Fragment of the JS sniffer code with the function to send the collected data to the_\n_cybercriminals' server_\n\nDuring further analysis of infections by UltraRank, Group-IB team discovered a sample of a\nJS sniffer without obfuscation, identical to what was found on one of the cybercriminals'\nwebsites earlier, which linked UltraRank to the new attacks.\n\n**Analysis of the infrastructure**\n\nWhile analyzing the sniffer infrastructure, a standard PHP script was found, which is typical\nof all of UltraRank's websites. In addition to the common information about the sent request\nand the server, the script displayed the server's real IP address. At the time of analysis, the\ngoogletagsmanager[.]co domain had an IP address of 8.208.16[.]230 (AS45102, Alibaba\n(US) Technology Co., Ltd.). At the same time, the real server address was 45.141.84[.]239\n[(Figure 5), owned by Media Land LLC (AS206728). According to an article by Brian Krebs,](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/)\nMedia Land LLC is connected with a bulletproof hosting company operated by an\n\n\n-----\n\nunderground forum user going by the nickname Yalishanda, which provides services to\ncybercriminals. Presumably, Yalishanda's service uses cloud servers rented from various\nsuppliers, including Alibaba, to host part of the cybercriminals' infrastructure.\n\nIn addition to the server IP address, the script output also specifies the directory where the\nwebsite files are located on the server hXXp://googletagsmanager[.]co/: worker.\n\n_Figure 5: Script output with information about the server where the domain_\n_googletagsmanager.co is located_\n\nThe IP address 45.141.84[.]239 is also linked to the website hXXp://s-panel[.]su/. During its\nanalysis, the same script on all websites in UltraRank's infrastructure was found again\n(Figure 6). In this case, the directory where all the website files were located is called panel.\n\n\n-----\n\n_Figure 6: Script output with information about the server where the domain s-panel.su is_\n_located_\n\nIn addition to the common server, Group-IB's [Graph Network Analysis system detected the](https://www.group-ib.com/ti/graph.html)\nSSL certificate 50e15969b10d40388bffbb87f56dd83df14576af. This certificate was on both\nthe domain googletagsmanager.co and the server with the IP address 45.141.84[.]239, which\nis associated with the domain s-panel[.]su (Figure 7).\n\n\n-----\n\n_Figure 7: Certificate Link graph 50e15969b10d40388bffbb87f56dd83df14576af from Group-_\n_IB Threat Intelligence and Attribution system_\n\nThroughout further analysis of the website hXXp://s-panel[.]su/, a login form was detected.\nPresumably, this website is used by the cybercriminals as a sniffer control panel: all stolen\npayment card data is collected in the panel for subsequent exfiltration and resale.\n\n\n-----\n\n_Figure 8: Login form found on the site s-panel.su_\n\nThe googletagsmanager[.]info domain was also discovered. In September 2020, this domain\nhad the same IP address as googletagsmanager[.]co (8.208.96.88). However, at the time of\nwriting, the website was inactive and no cases of eCommerce infections using it were found.\n\n**Indicators of compromise**\n\n- googletagsmanager[.]co\n\n- googletagsmanager[.]info\n\n- s-panel[.]su\n\n**Recommendations**\n\nTo date, Group-IB experts have studied 96 different JS sniffer families, whereas only 38\nmalware families of this type were known when the report \"Crime without punishment: indepth analysis of JS sniffers\" was published. Attacks on eCommerce stores using malicious\nJavaScript are becoming an increasingly popular way to obtain large amounts of user\npayment information for subsequent resale. As a result of UltraRank installing malicious code\non the Ticketmaster website by hacking the third-party provider Inbenta, user payment data\nwas leaked. Ticketmaster was fined £1.25 million for this. In addition, British Airways was\nfined £20 million for a data leak caused by malicious code injected in one of the JavaScript\nlibraries used on their website and mobile app. Therefore, the threat of JS sniffers is relevant\nnot only for owners of eCommerce stores, but also for all services that use and process bank\ncard payments online. Group-IB experts have compiled a list of recommendations that will\nhelp various eCommerce participants minimize potential damage, prevent infection, or detect\nexisting malicious activity.\n**For issuing banks**\n\n- Notify users of possible risks arising in the online payment process when using payment\ncards.\n\n- If payment cards related to your bank have been compromised, block these cards and\nnotify the users that the eCommerce store has been infected with a payment card sniffer.\n\n\n-----\n\n**For eCommerce websites administrators**\n\n- Use complex and unique passwords to access the website's admin panel and any services\nused for administration, for example phpMyAdmin, Adminer. If possible, set up two-factor\nauthentication.\n\n- Install all necessary updates for the software used, including CMS of websites. Do not use\noutdated or unsupported versions of the CMS. This will help to reduce the risk of servers\nbeing compromised and make it more difficult for an attacker to download a web shell and\ninstall malicious code.\n\n- Regularly check the store for malware and conduct regular security audits of your website.\nFor example, for websites based on CMS Magento, you can use Magento Security Scan\nTool.\n\n- Use the appropriate systems to log all changes that occur on the website, as well as to log\naccess to the website's control panel and database and track file change dates. This will help\nyou to detect website files infected with malicious code, as well as track unauthorized access\nto the website or web server.\n\n**For payment systems/payment processing banks**\n\n- If you provide payment services for eCommerce websites, regularly inform your customers\nabout basic security techniques when accepting online payments on the websites, as well as\nthe threat of JavaScript sniffers;\n\n- Ensure that your services use a correctly-configured Content Security Policy;\n\n\n-----\n\n[Lear more about Group-IB's Security Assessment,](https://www.group-ib.com/security-assessment.html) [Threat Intelligence & Attribution, and](https://www.group-ib.com/intelligence-attribution.html)\n[Fraud Hunting Platform on our](https://www.group-ib.com/fraud-hunting-platform.html) [website.](https://www.group-ib.com/)\nUltraRank:\n\nThe unexpected twist of a JS-sniffer triple threat\n\nNew stage in JS-sniffers research. From analyzing malware families to identifying threat\nactors\n\nRequest the report\n\nShare\n\nReceive insights on the latest cybercrime trends\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-23 - New attacks by UltraRank group.pdf"
    ],
    "report_names": [
        "2020-12-23 - New attacks by UltraRank group.pdf"
    ],
    "threat_actors": [
        {
            "id": "d802a34a-fcca-484e-8b12-1f0c721fccbe",
            "created_at": "2022-10-25T16:07:24.35515Z",
            "updated_at": "2025-03-27T02:02:10.187236Z",
            "deleted_at": null,
            "main_name": "UltraRank",
            "aliases": [],
            "source_name": "ETDA:UltraRank",
            "tools": [
                "SnifLite"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535937,
    "ts_updated_at": 1743041674,
    "ts_creation_date": 1653757533,
    "ts_modification_date": 1653757533,
    "files": {
        "pdf": "https://archive.orkl.eu/5b5599fc4b3693218082a829e5b6a0a2859c7cd7.pdf",
        "text": "https://archive.orkl.eu/5b5599fc4b3693218082a829e5b6a0a2859c7cd7.txt",
        "img": "https://archive.orkl.eu/5b5599fc4b3693218082a829e5b6a0a2859c7cd7.jpg"
    }
}