{
    "id": "3632e08f-d104-45af-ae6c-d8c9e45df1b6",
    "created_at": "2023-01-12T15:00:59.751115Z",
    "updated_at": "2025-03-27T02:12:08.75582Z",
    "deleted_at": null,
    "sha1_hash": "c64a34e98968396cd19a4ff3629d5945cd892f4a",
    "title": "2020-10-22 - Alert (AA20-296A)- Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets",
    "authors": "",
    "file_creation_date": "2022-05-29T01:05:37Z",
    "file_modification_date": "2022-05-29T01:05:37Z",
    "file_size": 172066,
    "plain_text": "# Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets\n\n**us-cert.cisa.gov/ncas/alerts/aa20-296a**\n\n## Summary\n\n_This joint cybersecurity advisory uses the MITRE Adversarial Tactics, Techniques, and_\n_Common Knowledge (ATT&CK®) framework. See the_ _[ATT&CK for Enterprise framework for](https://attack.mitre.org/versions/v7/)_\n_all referenced threat actor tactics and techniques_\n\nThis joint cybersecurity advisory—written by the Federal Bureau of Investigation (FBI) and\nthe Cybersecurity and Infrastructure Security Agency (CISA)—provides information on\nRussian state-sponsored advanced persistent threat (APT) actor activity targeting various\nU.S. state, local, territorial, and tribal (SLTT) government networks, as well as aviation\nnetworks. This advisory updates joint CISA-FBI cybersecurity advisory AA20-283A: APT\n[Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections](https://us-cert.cisa.gov/ncas/alerts/aa20-283a)\nOrganizations.\n\nSince at least September 2020, a Russian state-sponsored APT actor—known variously as\nBerserk Bear, Energetic Bear, TeamSpy, Dragonfly, Havex, Crouching Yeti, and Koala in\nopen-source reporting—has conducted a campaign against a wide variety of U.S. targets.\nThe Russian state-sponsored APT actor has targeted dozens of SLTT government and\naviation networks, attempted intrusions at several SLTT organizations, successfully\ncompromised network infrastructure, and as of October 1, 2020, exfiltrated data from at least\ntwo victim servers.\n\nThe Russian-sponsored APT actor is obtaining user and administrator credentials to\nestablish initial access, enable lateral movement once inside the network, and locate high\nvalue assets in order to exfiltrate data. In at least one compromise, the APT actor laterally\ntraversed an SLTT victim network and accessed documents related to:\n\nSensitive network configurations and passwords.\nStandard operating procedures (SOP), such as enrolling in multi-factor authentication\n(MFA).\nIT instructions, such as requesting password resets.\nVendors and purchasing information.\nPrinting access badges.\n\nTo date, the FBI and CISA have no information to indicate this APT actor has intentionally\ndisrupted any aviation, education, elections, or government operations. However, the actor\nmay be seeking access to obtain future disruption options, to influence U.S. policies and\nactions, or to delegitimize SLTT government entities.\n\n\n-----\n\nAs this recent malicious activity has been directed at SLTT government networks, there may\nbe some risk to elections information housed on SLTT government networks. However, the\nFBI and CISA have no evidence to date that integrity of elections data has been\ncompromised. Due to the heightened awareness surrounding elections infrastructure and the\ntargeting of SLTT government networks, the FBI and CISA will continue to monitor this\nactivity and its proximity to elections infrastructure.\n\nClick here for a [PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/Joint_CISA_FBI_CSA-AA20-296A__Russian_State_Sponsored_APT_Actor_Compromise_US_Government_Targets.pdf)\nClick here for a [STIX package of IOCs.](https://us-cert.cisa.gov/sites/default/files/2020-10/AA20-296A.stix.xml)\n\n**U.S. Heat Map of Activity**\n\n[Click here for an interactive heat map of this activity (current as of November 17, 2020).](https://indd.adobe.com/view/64463245-3411-49f9-b203-1c7cb8f16769)\nHovering the cursor over the map reveals the number and type of entities the Russian APT\nhas targeted in each region. These totals include compromises, scanning, or other\nreconnaissance activity executed from the Russian APT actor infrastructure.\n\n**Note: CISA is committed to providing access to our web pages and documents for**\nindividuals with disabilities, both members of the public and federal employees. If the format\nof any elements or content within this document interferes with your ability to access the\n[information, as defined in the Rehabilitation Act, please email info@us-cert.gov. To enable us](http://10.10.0.46/mailto:%20info@us-cert.gov)\nto respond in a manner most helpful to you, please indicate the nature of your accessibility\nproblem and the preferred format in which to receive the material.\n\n**Note: the heat map has interactive features that may not work in your web browser. For best**\nuse, please download and save this catalog.\n\n## Technical Details\n\nThe FBI and CISA have observed Russian state-sponsored APT actor activity targeting U.S.\nSLTT government networks, as well as aviation networks. The APT actor is using Turkish IP\naddresses `213.74.101[.]65,` `213.74.139[.]196, and` `212.252.30[.]170 to connect`\nto victim web servers (Exploit Public Facing Application [[T1190]).](https://attack.mitre.org/versions/v7/techniques/T1190/)\n\nThe actor is using `213.74.101[.]65 and` `213.74.139[.]196 to attempt brute force`\nlogins and, in several instances, attempted Structured Query Language (SQL) injections on\nvictim websites (Brute Force [[T1110]; Exploit Public Facing Application](https://attack.mitre.org/versions/v7/techniques/T1110) [[T1190]). The APT](https://attack.mitre.org/versions/v7/techniques/T1190/)\nactor also hosted malicious domains, including possible aviation sector target\n```\ncolumbusairports.microsoftonline[.]host, which resolved to 108.177.235[.]92\n\n```\nand `[cityname].westus2.cloudapp.azure.com ; these domains are U.S. registered and`\n[are likely SLTT government targets (Drive-By Compromise [T1189]).](https://attack.mitre.org/versions/v7/techniques/T1189)\n\nThe APT actor scanned for vulnerable Citrix and Microsoft Exchange services and identified\nvulnerable systems, likely for future exploitation. This actor continues to exploit a Citrix\n[Directory Traversal Bug (CVE-2019-19781) and a Microsoft Exchange remote code](https://nvd.nist.gov/vuln/detail/CVE-2019-19781)\n\n\n-----\n\n[execution flaw (CVE-2020-0688).](https://nvd.nist.gov/vuln/detail/CVE-2020-0688)\n\nThe APT actor has been observed using Cisco AnyConnect Secure Socket Layer (SSL)\nvirtual private network (VPN) connections to enable remote logins on at least one victim\nnetwork, possibly enabled by an Exim Simple Mail Transfer Protocol (SMTP) vulnerability\n[(CVE 2019-10149) (External Remote Services](https://nvd.nist.gov/vuln/detail/CVE-2019-10149) [[T1133]). More recently, the APT actor](https://attack.mitre.org/versions/v7/techniques/T1133)\n[enumerated and exploited a Fortinet VPN vulnerability (CVE-2018-13379) for Initial Access](https://nvd.nist.gov/vuln/detail/CVE-2018-13379)\n\n[[TA0001] and a Windows Netlogon vulnerability (CVE-2020-1472) to obtain access to](https://attack.mitre.org/versions/v7/tactics/TA0001/)\n[Windows Active Directory (AD) servers for Privilege Escalation [TA0004] within the network](https://attack.mitre.org/versions/v7/tactics/TA0004/)\n(Valid Accounts [[T1078]). These vulnerabilities can also be leveraged to compromise other](https://attack.mitre.org/versions/v7/techniques/T1078)\ndevices on the network (Lateral Movement [[TA0008]) and to maintain Persistence](https://attack.mitre.org/versions/v7/tactics/TA0008/) [[TA0003]).](https://attack.mitre.org/versions/v7/tactics/TA0003/)\n\nBetween early February and mid-September, these APT actors used `213.74.101[.]65,`\n```\n212.252.30[.]170, 5.196.167[.]184, 37.139.7[.]16, 149.56.20[.]55,\n91.227.68[.]97, and 5.45.119[.]124 to target U.S. SLTT government networks.\n\n```\nSuccessful authentications—including the compromise of Microsoft Office 365 (O365)\naccounts—have been observed on at least one victim network (Valid Accounts [[T1078]).](https://attack.mitre.org/versions/v7/techniques/T1078)\n\n## Mitigations\n\n**Indicators of Compromise**\n\nThe APT actor used the following IP addresses and domains to carry out its objectives:\n\n\n-----\n\nIP address `51.159.28[.]101 appears to have been configured to receive stolen Windows`\nNew Technology Local Area Network Manager (NTLM) credentials. FBI and CISA\nrecommend organizations take defensive actions to mitigate the risk of leaking NTLM\ncredentials; specifically, organizations should disable NTLM or restrict outgoing NTLM.\nOrganizations should consider blocking IP address `51.159.28[.]101 (although this action`\nalone may not mitigate the threat, as the APT actor has likely established, or will establish,\nadditional infrastructure points).\n\nOrganizations should check available logs for traffic to/from IP address `51.159.28[.]101`\nfor indications of credential-harvesting activity. As the APT actors likely have—or will—\nestablish additional infrastructure points, organizations should also monitor for Server\nMessage Block (SMB) or WebDAV activity leaving the network to other IP addresses.\n\nRefer to [AA20-296A.stix for a downloadable copy of IOCs.](https://us-cert.cisa.gov/sites/default/files/publications/AA20-296A.stix.xml)\n\n**Network Defense-in-Depth**\n\nProper network defense-in-depth and adherence to information security best practices can\nassist in mitigating the threat and reducing the risk to critical infrastructure. The following\nguidance may assist organizations in developing network defense procedures.\n\nKeep all applications updated according to vendor recommendations, and especially\nprioritize updates for external facing applications and remote access services to\naddress CVE-2019-19781, CVE-2020-0688, CVE 2019-10149, CVE-2018-13379, and\nCVE-2020-1472. Refer to table 1 for patch information on these CVEs.\n\n_Table 1: Patch information for CVEs_\n\n**Vulnerability** **Vulnerable Products** **Patch Information**\n\n\nCVE-201919781\n\n\nCitrix Application Delivery\nController\nCitrix Gateway\nCitrix SDWAN WANOP\n\n\nCitrix blog post: firmware updates\n[for Citrix ADC and Citrix Gateway](https://www.citrix.com/blogs/2020/01/19/vulnerability-update-first-permanent-fixes-available-timeline-accelerated/)\nversions 11.1 and 12.0\n\nCitrix blog post: security updates\n[for Citrix SD-WAN WANOP release](https://www.citrix.com/blogs/2020/01/22/update-on-cve-2019-19781-fixes-now-available-for-citrix-sd-wan-wanop/)\n10.2.6 and 11.0.3\n\nCitrix blog post: firmware updates\n[for Citrix ADC and Citrix Gateway](https://www.citrix.com/blogs/2020/01/23/fixes-now-available-for-citrix-adc-citrix-gateway-versions-12-1-and-13-0/)\nversions 12.1 and 13.0\n\nCitrix blog post: firmware updates\n[for Citrix ADC and Citrix Gateway](https://www.citrix.com/blogs/2020/01/24/citrix-releases-final-fixes-for-cve-2019-19781/)\nversion 10.5\n\n\n-----\n\n**Vulnerability** **Vulnerable Products** **Patch Information**\n\n\nCVE-20200688\n\nCVE-201910149\n\nCVE-201813379\n\nCVE-20201472\n\n\nMicrosoft Exchange Server\n2010 Service Pack 3 Update\nRollup 30\nMicrosoft Exchange Server\n2013 Cumulative Update 23\nMicrosoft Exchange Server\n2016 Cumulative Update 14\nMicrosoft Exchange Server\n2016 Cumulative Update 15\nMicrosoft Exchange Server\n2019 Cumulative Update 3\nMicrosoft Exchange Server\n2019 Cumulative Update 4\n\n\nFortiOS 6.0: 6.0.0 to 6.0.4\nFortiOS 5.6: 5.6.3 to 5.6.7\nFortiOS 5.4: 5.4.6 to 5.4.12\n\nWindows Server 2008 R2 for\nx64-based Systems Service\nPack 1\nWindows Server 2008 R2 for\nx64-based Systems Service\nPack 1 (Server Core\ninstallation)\nWindows Server 2012\nWindows Server 2012 (Server\nCore installation)\nWindows Server 2012 R2\nWindows Server 2016\nWindows Server 2019\nWindows Server 2019 (Server\nCore installation)\nWindows Server, version 1903\n(Server Core installation)\nWindows Server, version 1909\n(Server Core installation)\nWindows Server, version\n2004  (Server Core\ninstallation)\n\n\nMicrosoft Security Advisory for\nCVE-2020-0688\n\n\nExim versions 4.87–4.91 [Exim page for CVE-2019-10149](https://www.exim.org/static/doc/security/CVE-2019-10149.txt)\n\n\nFortinet Security Advisory: FG-IR18-384\n\nMicrosoft Security Advisory for\nCVE-2020-1472\n\n\nFollow Microsoft’s [guidance on monitoring logs for activity related to the Netlogon](https://support.microsoft.com/en-us/help/4557222/how-to-manage-the-changes-in-netlogon-secure-channel-connections-assoc)\nvulnerability, CVE-2020-1472.\n\n\n-----\n\nIf appropriate for your organization s network, prevent external communication of all\nversions of SMB and related protocols at the network boundary by blocking\nTransmission Control Protocol (TCP) ports 139 and 445 and User Datagram Protocol\n[(UDP) port 137. See the CISA publication on SMB Security Best Practices for more](https://us-cert.cisa.gov/ncas/current-activity/2017/01/16/SMB-Security-Best-Practices)\ninformation.\nImplement the prevention, detection, and mitigation strategies outlined in:\n\nCISA Alert TA15-314A – Compromised Web Servers and Web Shells – Threat\nAwareness and Guidance.\nNational Security Agency Cybersecurity Information Sheet U/OO/134094-20 –\nDetect and Prevent Web Shells Malware.\nIsolate external facing services in a network demilitarized zone (DMZ) since they are\nmore exposed to malicious activity; enable robust logging, and monitor the logs for\nsigns of compromise.\nEstablish a training mechanism to inform end users on proper email and web usage,\nhighlighting current information and analysis and including common indicators of\nphishing. End users should have clear instructions on how to report unusual or\nsuspicious emails.\nImplement application controls to only allow execution from specified application\ndirectories. System administrators may implement this through Microsoft Software\nRestriction Policy, AppLocker, or similar software. Safe defaults allow applications to\nrun from `PROGRAMFILES,` `PROGRAMFILES(X86), and` `WINDOWS folders. All other`\nlocations should be disallowed unless an exception is granted.\nBlock Remote Desktop Protocol (RDP) connections originating from untrusted external\naddresses unless an exception exists; routinely review exceptions on a regular basis\nfor validity.\n\n**Comprehensive Account Resets**\n\nFor accounts where NTLM password hashes or Kerberos tickets may have been\ncompromised (e.g., through CVE-2020-1472), a double-password-reset may be required in\norder to prevent continued exploitation of those accounts. For domain-admin-level\ncredentials, a reset of KRB-TGT “Golden Tickets” may be required, and Microsoft has\n[released specialized guidance for this. Such a reset should be performed very carefully if](https://docs.microsoft.com/en-us/azure-advanced-threat-protection/domain-dominance-alerts)\nneeded.\n\nIf there is an observation of [CVE-2020-1472 Netlogon activity or other indications of valid](https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1472)\ncredential abuse, it should be assumed the APT actors have compromised AD administrative\naccounts. In such cases, the AD forest should not be fully trusted, and, therefore, a new\nforest should be deployed. Existing hosts from the old compromised forest cannot be\nmigrated in without being rebuilt and rejoined to the new domain, but migration may be done\nthrough “creative destruction,” wherein, as endpoints in the legacy forest are\ndecommissioned, new ones can be built in the new forest. This will need to be completed in\non-premise—as well as in Azure-hosted—AD instances.\n\n\n-----\n\nNote that fully resetting an AD forest is difficult and complex; it is best done with the\nassistance of personnel who have successfully completed the task previously.\n\nIt is critical to perform a full password reset on all user and computer accounts in the AD\nforest. Use the following steps as a guide.\n\n1. Create a temporary administrator account, and use this account only for all\n\nadministrative actions\n2. Reset the Kerberos Ticket Granting Ticket `(krbtgt ) password;[1] this must be`\n\ncompleted before any additional actions (a second reset will take place in step 5)\n3. Wait for the `krbtgt reset to propagate to all domain controllers (time may vary)`\n4. Reset all account passwords (passwords should be 15 characters or more and\n\nrandomly assigned):\n\n1. User accounts (forced reset with no legacy password reuse)\n2. Local accounts on hosts (including local accounts not covered by Local\n\nAdministrator Password Solution [LAPS])\n3. Service accounts\n4. Directory Services Restore Mode (DSRM) account\n5. Domain Controller machine account\n6. Application passwords\n5. Reset the krbtgt password again\n6. Wait for the `krbtgt reset to propagate to all domain controllers (time may vary)`\n7. Reboot domain controllers\n8. Reboot all endpoints\n\nThe following accounts should be reset:\n\nAD Kerberos Authentication Master (2x)\nAll Active Directory Accounts\nAll Active Directory Admin Accounts\nAll Active Directory Service Accounts\nAll Active Directory User Accounts\nDSRM Account on Domain Controllers\nNon-AD Privileged Application Accounts\nNon-AD Unprivileged Application Accounts\nNon-Windows Privileged Accounts\nNon-Windows User Accounts\nWindows Computer Accounts\nWindows Local Admin\n\n**VPN Vulnerabilities**\n\nImplement the following recommendations to secure your organization’s VPNs:\n\n\n-----\n\n**Update VPNs, network infrastructure devices, and devices being used to remote**\ninto work environments with the latest software patches and security configurations.\n[See CISA Tips Understanding Patches and Software Updates and](https://us-cert.cisa.gov/ncas/tips/ST04-006) Securing Network\nInfrastructure Devices. Wherever possible, enable automatic updates.\n**Implement MFA on all VPN connections to increase security. Physical security**\ntokens are the most secure form of MFA, followed by authenticator app-based MFA.\nSMS and email-based MFA should only be used when no other forms are available. If\nMFA is not implemented, require teleworkers to use strong passwords. See CISA Tips\n[Choosing and Protecting Passwords and](https://us-cert.cisa.gov/ncas/tips/ST04-002) [Supplementing Passwords for more](https://us-cert.cisa.gov/ncas/tips/ST05-012)\ninformation.\n\nDiscontinue unused VPN servers. Reduce your organization’s attack surface by\ndiscontinuing unused VPN servers, which may act as a point of entry for attackers. To protect\nyour organization against VPN vulnerabilities:\n\n**Audit configuration and patch management programs.**\n**Monitor network traffic for unexpected and unapproved protocols, especially outbound**\nto the Internet (e.g., Secure Shell [SSH], SMB, RDP).\n**Implement MFA, especially for privileged accounts.**\n**Use separate administrative accounts on separate administration workstations.**\n**Keep** [software up to date. Enable automatic updates, if available.](https://us-cert.cisa.gov/ncas/tips/ST04-006)\n\n## Contact Information\n\nTo report suspicious or criminal activity related to information found in this Joint\nCybersecurity Advisory, contact your local FBI field office at [www.fbi.gov/contact-us/field, or](http://www.fbi.gov/contact-us/field)\n[the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-mail at CyWatch@fbi.gov.](http://10.10.0.46/mailto:CyWatch@fbi.gov)\nWhen available, please include the following information regarding the incident: date, time,\nand location of the incident; type of activity; number of people affected; type of equipment\nused for the activity; the name of the submitting company or organization; and a designated\npoint of contact. To request incident response resources or technical assistance related to\nthese threats, contact CISA at [Central@cisa.dhs.gov.](http://10.10.0.46/mailto:Central@cisa.dhs.gov)\n\n## Resources\n\nAPT Actors Chaining Vulnerabilities Against SLTT, Critical Infrastructure, and Elections\n[Organizations – https://us-cert.cisa.gov/ncas/alerts/aa20-283a](https://us-cert.cisa.gov/ncas/alerts/aa20-283a)\n[CISA Activity Alert CVE-2019-19781 – https://us-cert/cisa.gov/ncas/alerts/aa20-031a](https://us-cert/cisa.gov/ncas/alerts/aa20-031a)\n[CISA Vulnerability Bulletin – https://us-cert/cisa.gov/ncas/bulletins/SB19-161](https://us-cert/cisa.gov/ncas/bulletins/SB19-161)\nCISA Current Activity – https://us-cert.cisa.gov/ncas/currentactivity/2020/03/10/unpatched-microsoft-exchange-servers-vulnerable-cve-2020-0688\nCitrix Directory Traversal Bug (CVE-2019-19781) – https://nvd.nist.gov/vuln/detail/CVE2019-19781\n\n\n-----\n\nMicrosoft Exchange remote code execution flaw (CVE-2020-0688) –\n[https://nvd.nist.gov/vuln/detail/CVE-2020-0688](https://nvd.nist.gov/vuln/detail/CVE-2020-0688)\n[CVE-2018-13379 – https://nvd.nist.gov/vuln/detail/CVE-2018-13379](https://nvd.nist.gov/vuln/detail/CVE-2018-13379%20)\n[CVE-2020-1472 – https://nvd.nist.gov/vuln/detail/CVE-2020-1472](https://nvd.nist.gov/vuln/detail/CVE-2020-1472)\n[CVE 2019-10149 – https://nvd.nist.gov/vuln/detail/CVE-2019-10149](https://nvd.nist.gov/vuln/detail/CVE-2019-10149)\nNCCIC/USCERT Alert TA15-314A – Compromised Web Servers and Web Shells –\n[Threat Awareness and Guidance – https://us-cert.cisa.gov/ncas/alerts/TA15-314A](https://us-cert.cisa.gov/ncas/alerts/TA15-314A%20)\nNCCIC/US-CERT publication on SMB Security Best Practices – https://uscert.cisa.gov/ncas/current-activity/2017/01/16/SMB-Security-Best-Practices\n\n**_DISCLAIMER_**\n\n_This information is provided \"as is\" for informational purposes only. The United States_\n_Government does not provide any warranties of any kind regarding this information. In no_\n_event shall the United States Government or its contractors or subcontractors be liable for_\n_any damages, including but not limited to, direct, indirect, special or consequential damages,_\n_arising out of, resulting from, or in any way connected with this information, whether or not_\n_based upon warranty, contract, tort, or otherwise, whether or not arising out of negligence,_\n_and whether or not injury was sustained from, or arose out of the results of, or reliance upon_\n_the information._\n\n_The United States Government does not endorse any commercial product or service,_\n_including any subjects of analysis. Any reference to specific commercial products,_\n_processes, or services by service mark, trademark, manufacturer, or otherwise, does not_\n_constitute or imply their endorsement, recommendation, or favoring by the United States_\n_Government._\n\n## References\n\n[[1] Microsoft: AD Forest Recovery - Resetting the krbtgt password](https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/manage/ad-forest-recovery-resetting-the-krbtgt-password)\n\n## Revisions\n\nOctober 22, 2020: Initial Version\n\nNovember 17, 2020: Added U.S. Heat Map of Activity\n\nDecember 1, 2020: Added \"current as of\" date to U.S. Heat Map of Activity\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa20-296a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-22 - Alert (AA20-296A)- Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets.pdf"
    ],
    "report_names": [
        "2020-10-22 - Alert (AA20-296A)- Russian State-Sponsored Advanced Persistent Threat Actor Compromises U.S. Government Targets.pdf"
    ],
    "threat_actors": [
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d8dd2ca-5592-482e-b89d-6a7e1a49f4f6",
            "created_at": "2023-01-06T13:46:38.408359Z",
            "updated_at": "2025-03-27T02:00:02.826069Z",
            "deleted_at": null,
            "main_name": "TeamSpy Crew",
            "aliases": [
                "TeamSpy",
                "Team Bear",
                "Anger Bear",
                "IRON LYRIC"
            ],
            "source_name": "MISPGALAXY:TeamSpy Crew",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535659,
    "ts_updated_at": 1743041528,
    "ts_creation_date": 1653786337,
    "ts_modification_date": 1653786337,
    "files": {
        "pdf": "https://archive.orkl.eu/c64a34e98968396cd19a4ff3629d5945cd892f4a.pdf",
        "text": "https://archive.orkl.eu/c64a34e98968396cd19a4ff3629d5945cd892f4a.txt",
        "img": "https://archive.orkl.eu/c64a34e98968396cd19a4ff3629d5945cd892f4a.jpg"
    }
}