{
    "id": "36341761-05f3-40f3-9602-7bfb7887ad9c",
    "created_at": "2022-10-25T16:48:19.974957Z",
    "updated_at": "2025-03-27T02:15:37.967307Z",
    "deleted_at": null,
    "sha1_hash": "d7eb46c7b708a6638eaec45c8707a7f171daef5a",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-06-15T02:38:48Z",
    "file_modification_date": "2020-06-15T05:38:52Z",
    "file_size": 3474219,
    "plain_text": "[Home  »  Malware  »  New Android Spyware ActionSpy Revealed via Phishing Attacks from Earth Empusa](https://blog.trendmicro.com/trendlabs-security-intelligence/)\n\n## New Android Spyware ActionSpy Revealed via Phishing Attacks from Earth Empusa\n\n**[Posted on: June 11, 2020](https://blog.trendmicro.com/trendlabs-security-intelligence/2020/06/)** at 5:25 am **[Posted in: Malware,](https://blog.trendmicro.com/trendlabs-security-intelligence/category/malware/)** [Mobile](https://blog.trendmicro.com/trendlabs-security-intelligence/category/mobile/) **[Author: Trend Micro](https://blog.trendmicro.com/trendlabs-security-intelligence/author/trend-micro/)**\n\n 23   \n\n**_By Ecular Xu and Joseph C. Chen_**\n\n[While tracking Earth Empura, also known as POISON CARP/Evil Eye, we identified an](https://citizenlab.ca/2019/09/poison-carp-tibetan-groups-targeted-with-1-click-mobile-exploits/)\nundocumented Android spyware we have named ActionSpy (detected by Trend Micro as\nAndroidOS_ActionSpy.HRX). During the first quarter of 2020, we observed Earth\n\nEmpusa’s activity targeting users in Tibet and Turkey before they extended their scope to\ninclude Taiwan. The campaign is reportedly targeting victims related to Uyghurs by\ncompromising their Android and iOS mobile devices. This group is known to use watering\nhole attacks, but we recently observed them using phishing attacks to deliver their malware.\n\nThe malware that infects the mobile devices is found to be associated with a sequence of iOS exploit chain attacks in the\n\n[wild since 2016. In April 2020, we noticed a phishing page disguised as a download page of an Android video application](https://googleprojectzero.blogspot.com/2019/08/a-very-deep-dive-into-ios-exploit.html)\nthat is popular in Tibet. The phishing page, which appears to have been copied from a third-party web store, may have been\ncreated by Earth Empusa. This is based on the fact that one of the malicious scripts injected on the page was hosted on a\ndomain belonging to the group. Upon checking the Android application downloaded from the page, we found ActionSpy.\n\n\n-----\n\n_Figure 1. The Earth Empusa attack chain_\n\nActionSpy, which may have been around since 2017, is an Android spyware that allows the attacker to collect information\n\nfrom the compromised devices. It also has a module designed for spying on instant messages by abusing Android\nAccessibility and collecting chat logs from four different instant messaging applications.\n\n**Phishing attacks delivering ActionSpy**\n\n[Earth Empusa’s use of phishing pages is similar to our recent report on Operation Poisoned News, which also used web](https://blog.trendmicro.com/trendlabs-security-intelligence/operation-poisoned-news-hong-kong-users-targeted-with-mobile-malware-via-local-news-links/)\nnews pages as a lure to exploit mobile devices. Earth Empusa also used social engineering lures to trick its targets into\n\nvisiting the phishing pages. We found some news web pages, which appear to have been copied from Uyghur-related news\nsites, hosted on their server in March 2020. All pages were injected with a script to load the cross-site scripting framework\n\n[BeEF. We suspect the attacker used the framework to deliver their malicious script when they found a targeted victim](https://beefproject.com/)\nbrowsing the said sites. However, our investigation did not yield any script when we attempted to access said phishing\n\npages. How these pages were distributed in the wild is also unclear.\n\n\n-----\n\n_Figure 2. A news page copied from the World Uyghur Congress website used for loading the BeEF framework_\n\nUpon continued investigation in late April 2020, we found another phishing page that appears to be copied from a third-party\n\n[web store and injected with two scripts to load ScanBox and BeEF frameworks. This phishing page invites users to](https://resources.infosecinstitute.com/scanbox-framework/)\n\ndownload a video app that is known to Tibetan Android users. We believe the page was created by Earth Empusa because\nthe BeEF framework was running on a domain that reportedly belongs to the group. The download link was modified to an\n\narchive file that contains an Android application. Analysis then revealed that the application is an undocumented Android\nspyware we named ActionSpy.\n\n\n-----\n\n_Figures 3 and 4. Fake Android application download page (In original language and translated into English)_\n\n\n-----\n\n_Figure 5. The injection of ScanBox (above) and BeEF (below) on the phishing page shows overlap to Earth Empusa’s_\n\n_domain_\n\n**Breaking Down ActionSpy**\n\nThis malware impersonates a legitimate Uyghur video app called Ekran. The malicious app has the same appearance and\n[features as the original app. It is able to achieve this with VirtualApp. In addition, it’s also protected by Bangcle to evade](https://github.com/asLody/VirtualApp)\n\nstatic analysis and detection.\n\n_Figure 6. ActionSpy’s icon (left) and appearance (right)_\n\n_Figure 7. ActionSpy is protected by Bangcle_\n\nA legitimate Ekran APK file is embedded in the ActionSpy assets directory, and installed in virtual environment after\n\nVirtualApp is ready when ActionSpy is launched the first time.\n\n\n-----\n\n_Figure 8 and 9. Install real “Ekran” (above) and launch it (below)_\n\nActionSpy’s configuration, including its C&C server address, is encrypted by DES. The decryption key is generated in native\n\ncode. This makes static analysis difficult for ActionSpy.\n\nEvery 30 seconds, ActionSpy will collect basic device information like IMEI, phone number, manufacturer, battery status,\n\netc., which it sends to the C&C server as a heartbeat request. The server may return some commands that will be\n\nperformed on the compromised device. All the communication traffic between C&C and ActionSpy is encrypted by RSA and\ntransferred via HTTP.\n\n\n-----\n\n|Col1|Module Name Description location Get device location latitude and longitude geo Get geographic area like province, city, district, street address contacts Get contacts info calling Get call logs sms Get SMS messages nettrace Get browser bookmarks software Get installed APP info process Get running processes info wifi connect Make device connect to a specific Wi-Fi hotspot wifi disconnect Make the device disconnect to Wi-Fi wifi list Get all available Wi-Fi hotspots info dir Collect specific types of file list on SDCard, like txt, jpg, mp4, doc, xls… file Upload files from device to C&C server voice Record the environment camera Take photos with camera screen Take screenshot wechat Get the structure of WeChat directory wxfile Get files that received or sent from WeChat wxrecord Get chat logs of WeChat, QQ, WhatsApp, and Viber|Col3|\n|---|---|---|\n\n\n**Module Name** **Description**\n\nlocation Get device location latitude and longitude\n\ngeo Get geographic area like province, city, district, street address\n\ncontacts Get contacts info\n\ncalling Get call logs\n\nsms Get SMS messages\n\nnettrace Get browser bookmarks\n\nsoftware Get installed APP info\n\nprocess Get running processes info\n\nwifi connect Make device connect to a specific Wi-Fi hotspot\n\nwifi disconnect Make the device disconnect to Wi-Fi\n\nwifi list Get all available Wi-Fi hotspots info\n\ndir Collect specific types of file list on SDCard, like txt, jpg, mp4, doc, xls…\n\nfile Upload files from device to C&C server\n\nvoice Record the environment\n\ncamera Take photos with camera\n\nscreen Take screenshot\n\nwechat Get the structure of WeChat directory\n\nwxfile Get files that received or sent from WeChat\n\nwxrecord Get chat logs of WeChat, QQ, WhatsApp, and Viber\n\n**Abuse of Accessibility**\n\nNormally, a third-party app can’t access files belonging to others on Android. This makes it difficult for ActionSpy to steal\nchat log files from messaging apps like WeChat directly without root permission. ActionSpy, in turn, adopts an indirect\napproach: it prompts users to turn on its Accessibility service and claims that it is a memory garbage cleaning service.\n\n\n-----\n\n_Figure 11. Prompt to turn on Accessibility_\n\nOnce the user enables the Accessibility service, ActionSpy will monitor Accessibility events on the device. This is occurs\n[when something “notable” happens in the user interface (such as clicked buttons, entered text, or changed views). When an](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent)\n\n[Accessibility Event is received, ActionSpy checks if the event type is VIEW_SCROLLED or](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent#TYPE_VIEW_SCROLLED)\n[WINDOW_CONTENT_CHANGED and then check if the events came from targeted apps like WeChat, QQ, WhatsApp, and](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent#TYPE_WINDOW_CONTENT_CHANGED)\nViber. If all the above conditions are met, ActionSpy parses the current activity contents and extracts information like\n\nnicknames, chat contents, and chat time. All the chat information is formatted and stored into a local SQLite Database. Once\na “wxrecord” command is pushed, ActionSpy will gather chat logs in the database and convert them into JSON format\n\nbefore sending it to its C&C server.\n\n_Figure 12. Code snippet of parsing chat information_\n\nWe believe ActionSpy has existed for at least three years, based on its certificate sign time (2017-07-10). We also sourced\nsome old ActionSpy versions that were created in 2017.\n\n\n-----\n\n_Figure 13. Certificate info_\n\n_Figure 14. The earlier version (created in 2017)_\n\n**More on Earth Empusa: Watering hole attacks to compromise iOS systems**\n\nEarth Empusa also employs watering hole attacks to compromise iOS devices. The group injected their malicious scripts on\nwebsites that their targets could potentially visit and load the injected script from it. We found two kinds of attacks they\n\ninjected into compromised websites:\n\nOne injection we found is the ScanBox framework. The framework can collect information from a website’s visitors by\n\nusing JavaScript to record keypresses and harvest the profiles of the OS, browser, and browser plugins from the client\nenvironment. The framework is usually used during the reconnaissance stage, allowing them to understand their targets\n\nand prepare for the next stage of the attack.\n\nAnother injection is their exploit chain framework, which exploits the vulnerabilities on the iOS devices. When a victim\naccesses the framework, it checks the User-Agent header of the HTTP request to determine the iOS version on the\nvictim’s device and reply with a corresponding exploit code. If the User-Agent doesn’t belong to any of the targeted iOS\n\nversions, the framework will not deliver any additional payload.\n\n_Figure 15. An example of iOS exploit chain traffic_\n\nIn the first quarter of 2020, the exploit chain framework was upgraded to include a newer iOS exploit that can compromise\n\n\n-----\n\n5d3590\n\n\n_Figure 16. The script for determining the iOS version and launching the exploit code_\n\nWe have observed these injections on multiple Uyghur-related sites since the start of 2020. In addition, we have also\n\nidentified a news website and political party website in Turkey that have been compromised and injected with the same\nattack. In a more recent development, we found the same injection on a university website as well as a travel agency site\n\nbased in Taiwan in March 2020. These developments have led as to believe that Earth Empusa is widening the scope of\ntheir targets.\n\n**Best practices and solutions**\n\nEarth Empusa is still very active in the wild. We are constantly tracking and monitoring the threat group as it continues to\ndevelop new ways to attack its targets.\n\niOS users are advised to keep their devices updated. Android users, on the other hand, are encouraged to install apps only\nfrom trusted places such as Google Play to avoid malicious apps.\n\n[Users can also install security solutions, such as the Trend Micro™ Mobile Security for iOS and Trend Micro™ Mobile](https://www.trendmicro.com/en_us/forHome/products/mobile-security.html)\n[Security for Android™ (also available on Google Play) solutions, that can block malicious apps. End users can also benefit](https://play.google.com/store/apps/details?id=com.trendmicro.tmmspersonal)\n\nfrom their multilayered security capabilities that secure the device owner’s data and privacy, and features that protect them\nfrom ransomware, fraudulent websites, and identity theft.\n\n[For organizations, the Trend Micro™ Mobile Security for Enterprise suite provides device, compliance and application](https://www.trendmicro.com/en_us/business/products/user-protection/sps.html)\nmanagement, data protection, and configuration provisioning. The suite also protects devices from attacks that exploit\n\nvulnerabilities, prevents unauthorized access to apps and detects and blocks malware and fraudulent websites. Trend\nMicro’s Mobile App Reputation Service (MARS) covers Android and iOS threats using leading sandbox and machine\n\nlearning technologies to protect users against malware, zero-day and known exploits, privacy leaks, and application\nvulnerability.\n\n**Indicators of C0mpromise**\n\nAll of the malicious apps below are detected as AndroidOS_ActionSpy.HRX.\n\n**SHA256** **Package Name** **Label**\n\n56a2562426e504f42ad9aa2bd53445d8e299935c817805b0d9b94315 com.omn.vvi Ekran\n\n21769271\n\nb6e2fdbf022cd009585f62a3de71464014edd58125eb7bc15c2c670d6d com.isyjv.klxblnwc.r 系统优化\n\n5d3590\n\n\n-----\n\n146ebe\n\n\n146ebe\n\n2117e2252fe268136a2833202d746d67bf592de819cc1600ac8d9f2738 com.isyjv.klxblnwc Service Runtime\n\nd8d4d6 Library\n\n588b62a2e0bffa8935cd08ae46255a972b0af4966483967a3046a5df59 com.isyjv.klxblnwc Service Runtime\n\nd38406 Library\n\nd6478b4b7f0ea38947d894b1a87baf4bed7a1ece934fff9dfc233610de2 com.isyjv.klxblnwc Service Runtime\n\n32814 Library\n\n8d0a123e0fe91637fb41d9d9650a4b9c75b6ce77a2b51ac36f05a337da com.ecs.esap Service Runtime\n\n7afd80 Library\n\n9bc16f635fde4ff0b6b02b445a706d885779611b7813c5607ab88fdff43f com.cd.weixin VWechat\n\ncc2f\n\n334dbd15289aaeaf3763f1702003de52ff709515246902f51ee87a4146 com.android.dmp.rec Recording\n\n7a8e55\n\n50c10ab93910a6e617c85a03f8c38a10a7c363e2d37b745964e696da8 com.android.dmp.rec Recording\n\nf98a93d\n\n6575eeda2a8f76170fb6034944eeda5c88dac8009edccc880124fa729d com.android.dmp.l Location\n\nd3c1fd\n\neff30f6cc2d5d04ce4aef0c50f1fb375fb817a803bf3e8e08c847f0465818 com.android.dmp.l Location\n\n5ba\n\na0a48d7e0762ab24b2ec3ec488b011db866992db5392926fe43dd3d1c com.android.dmp.cm Camera\n\n398e30d\n\n088769a80b39d0da26c676a5a52eaccdb805dc67cba85e562785c375 com.android.dmp.c Core\n\nc642b501\n\n87306b59aaaba0ea92ea6a05feb9366eeb625e8da08ed3ef6c86a5cf3 com.android.dmp.c Core\n\n94fada5\n\n**Indicator** **Type**\n\ngotossl.ml Domain used by Earth Empusa\n\ngoforssl.top Domain used by Earth Empusa\n\ngeo2ipapi.org Domain used by Earth Empusa\n\nappbuliki.com Domain used by Earth Empusa\n\numutyole.com Domain used by Earth Empusa\n\nt.freenunn.com Domain used by Earth Empusa\n\n\n-----\n\n|Col1|static.apiforssl.com Domain used by Earth Empusa cdn.doublesclick.me Domain used by Earth Empusa static.doublesclick.info Domain used by Earth Empusa status.search-sslkey-flush.com Domain used by Earth Empusa http://114.215.41.93/ ActionSpy C&C URL http://static.doubles.click:8082/ ActionSpy C&C URL|Col3|\n|---|---|---|\n\n\nstatic.apiforssl.com Domain used by Earth Empusa\n\ncdn.doublesclick.me Domain used by Earth Empusa\n\nstatic.doublesclick.info Domain used by Earth Empusa\n\nstatus.search-sslkey-flush.com Domain used by Earth Empusa\n\nhttp://114.215.41.93/ ActionSpy C&C URL\n\nhttp://static.doubles.click:8082/ ActionSpy C&C URL\n\nMITRE ATT&CK\n\n#    \n\n#### Related Posts:\n\n**Malicious Optimizer and Utility Android Apps on Google Play Communicate with Trojans that Install**\n**Malware, Perform Mobile Ad Fraud**\n\n**[Dissecting Geost: Exposing the Anatomy of the Android Trojan Targeting Russian Banks](https://blog.trendmicro.com/trendlabs-security-intelligence/dissecting-geost-exposing-the-anatomy-of-the-android-trojan-targeting-russian-banks/)**\n\n**[Operation Poisoned News: Hong Kong Users Targeted With Mobile Malware via Local News Links](https://blog.trendmicro.com/trendlabs-security-intelligence/operation-poisoned-news-hong-kong-users-targeted-with-mobile-malware-via-local-news-links/)**\n\n**[Barcode Reader Apps on Google Play Found Using New Ad Fraud Technique](https://blog.trendmicro.com/trendlabs-security-intelligence/barcode-reader-apps-on-google-play-found-using-new-ad-fraud-technique/)**\n\n\n-----\n\nTags: [ActionSpy](https://blog.trendmicro.com/trendlabs-security-intelligence/tag/actionspy/) [android](https://blog.trendmicro.com/trendlabs-security-intelligence/tag/android/) [Earth Empusa](https://blog.trendmicro.com/trendlabs-security-intelligence/tag/earth-empusa/) [Ekran](https://blog.trendmicro.com/trendlabs-security-intelligence/tag/ekran/)\n\n[Uyghur](https://blog.trendmicro.com/trendlabs-security-intelligence/tag/uyghur/)\n\n**0 Comments** **[TrendLabs](https://disqus.com/home/forums/trendlabs/)** [🔒 Disqus' Privacy Policy](https://help.disqus.com/customer/portal/articles/466259-privacy-policy) [1](https://disqus.com/home/inbox/) **Login**\n\n Recommend t Tweet f Share **Sort by Best**\n\n### Start the discussion…\n\n**LOG IN WITH**\n**OR SIGN UP WITH DISQUS** **?**\n\nName\n\nBe the first to comment.\n\n### ✉ Subscribe d Add Disqus to your site ⚠ Do Not Sell My Data\n\n##### Security Predictions for 2020\n\nCybersecurity in 2020 will be viewed through many lenses — from differing attacker motivations and cybercriminal\narsenal to technological developments and global threat intelligence — only so defenders can keep up with the broad\nrange of threats.\n[Read our security predictions for 2020.](https://www.trendmicro.com/vinfo/us/security/research-and-analysis/predictions/2020)\n\n##### Business Process Compromise\n\n\n-----\n\n[more, read our Security 101: Business Process Compromise.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/security-101-business-process-compromise)\n\n\n[more, read our Security 101: Business Process Compromise.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/security-101-business-process-compromise)\n\n##### Recent Posts\n\n[New Android Spyware ActionSpy Revealed via Phishing Attacks from Earth Empusa](https://blog.trendmicro.com/trendlabs-security-intelligence/new-android-spyware-actionspy-revealed-via-phishing-attacks-from-earth-empusa/)\n\n[Patch Tuesday: Fixes for LNK, SMB, and SharePoint Bugs](https://blog.trendmicro.com/trendlabs-security-intelligence/patch-tuesday-fixes-for-lnk-smb-and-sharepoint-bugs/)\n\n[New Tekya Ad Fraud Found on Google Play](https://blog.trendmicro.com/trendlabs-security-intelligence/new-tekya-ad-fraud-found-on-google-play/)\n\n[Barcode Reader Apps on Google Play Found Using New Ad Fraud Technique](https://blog.trendmicro.com/trendlabs-security-intelligence/barcode-reader-apps-on-google-play-found-using-new-ad-fraud-technique/)\n\n[Backdoor, Devil Shadow Botnet Hidden in Fake Zoom Installers](https://blog.trendmicro.com/trendlabs-security-intelligence/backdoor-devil-shadow-botnet-hidden-in-fake-zoom-installers/)\n\n##### Popular Posts\n\n[Barcode Reader Apps on Google Play Found Using New Ad Fraud Technique](https://blog.trendmicro.com/trendlabs-security-intelligence/barcode-reader-apps-on-google-play-found-using-new-ad-fraud-technique/)\n\n[QAKBOT Resurges: Despite Takedowns, Online Banking Threats Persist](https://blog.trendmicro.com/trendlabs-security-intelligence/despite-arrests-and-takedowns-online-banking-threats-persist/)\n\n[Exposed Redis Instances Abused for Remote Code Execution, Cryptocurrency Mining](https://blog.trendmicro.com/trendlabs-security-intelligence/exposed-redis-instances-abused-for-remote-code-execution-cryptocurrency-mining/)\n\n[Third-Generation QAKBOT: Repackaged with Improved Propagation](https://blog.trendmicro.com/trendlabs-security-intelligence/third-generation-qakbot-repackaged-with-improved-propagation/)\n\n[TA505 At It Again: Variety is the Spice of ServHelper and FlawedAmmyy](https://blog.trendmicro.com/trendlabs-security-intelligence/ta505-at-it-again-variety-is-the-spice-of-servhelper-and-flawedammyy/)\n\n##### Stay Updated\n\nEmail Subscription\n\nYour email here\n\nSubscribe\n\n[HOME AND HOME OFFICE](http://www.trendmicro.com/us/home/index.html) | [FOR BUSINESS](http://www.trendmicro.com/us/business/index.html) | [SECURITY INTELLIGENCE](http://www.trendmicro.com/us/security-intelligence/index.html) | [ABOUT TREND MICRO](http://www.trendmicro.com/us/about-us/index.html)\n\n[Asia Pacific Region (APAC): Australia / New Zealand, 中国, 日本, 대한민국, 台灣](http://www.trendmicro.com.au/au/home/index.html) [Latin America Region (LAR): Brasil, México](http://br.trendmicro.com/br/home/index.html) North America Region\n\n[(NABU): United States, Canada](http://www.trendmicro.com/us/index.html)\n\n[Europe, Middle East, & Africa Region (EMEA): France, Deutschland / Österreich / Schweiz, Italia, Россия, España, United Kingdom / Ireland](http://www.trendmicro.fr/)\n\n[Privacy Statement](http://www.trendmicro.com/us/about-us/legal-policies/privacy-statement/index.html) [Legal Policies](http://www.trendmicro.com/us/about-us/legal-policies/index.html) Copyright © 2020 Trend Micro Incorporated. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.06.11.Earth_Empusa/New%20Android%20Spyware%20ActionSpy%20Revealed%20via%20Phishing%20Attacks%20from%20Earth%20Empusa%20-%20TrendLabs%20Security%20Intelligence%20Blog.pdf"
    ],
    "report_names": [
        "New Android Spyware ActionSpy Revealed via Phishing Attacks from Earth Empusa - TrendLabs Security Intelligence Blog"
    ],
    "threat_actors": [
        {
            "id": "f0ebaf6d-5e1a-4ed7-aa2c-0e69a648acea",
            "created_at": "2022-10-25T16:07:23.597455Z",
            "updated_at": "2025-03-27T02:02:09.881507Z",
            "deleted_at": null,
            "main_name": "Evil Eye",
            "aliases": [],
            "source_name": "ETDA:Evil Eye",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "741d58a1-0fc0-41a8-9681-106a06c07e61",
            "created_at": "2022-10-25T16:07:23.983046Z",
            "updated_at": "2025-03-27T02:02:10.062384Z",
            "deleted_at": null,
            "main_name": "Operation Poisoned News",
            "aliases": [
                "Operation Poisoned News",
                "TwoSail Junk"
            ],
            "source_name": "ETDA:Operation Poisoned News",
            "tools": [
                "dmsSpy",
                "lightSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3703894e-cf68-4c1e-a71a-e8fd2ef76747",
            "created_at": "2023-11-08T02:00:07.166789Z",
            "updated_at": "2025-03-27T02:00:03.205354Z",
            "deleted_at": null,
            "main_name": "TwoSail Junk",
            "aliases": [
                "Operation Poisoned News"
            ],
            "source_name": "MISPGALAXY:TwoSail Junk",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d2a5c949-7ae0-4610-8bb8-047ab03b1574",
            "created_at": "2022-10-25T16:07:24.064197Z",
            "updated_at": "2025-03-27T02:02:10.096487Z",
            "deleted_at": null,
            "main_name": "Poison Carp",
            "aliases": [
                "Earth Empusa",
                "Evil Eye",
                "EvilBamboo",
                "Poison Carp",
                "Red Dev 16"
            ],
            "source_name": "ETDA:Poison Carp",
            "tools": [
                "ActionSpy",
                "AxeSpy",
                "BADSIGNAL",
                "BADSOLAR",
                "BadBazaar",
                "IRONSQUIRREL",
                "IceCube",
                "MOONSHINE",
                "PoisonCarp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "52973e5f-9656-4b60-b7f8-457e32ac4bbe",
            "created_at": "2023-01-06T13:46:39.056888Z",
            "updated_at": "2025-03-27T02:00:02.986693Z",
            "deleted_at": null,
            "main_name": "POISON CARP",
            "aliases": [
                "Evil Eye",
                "Red Dev 16",
                "Earth Empusa"
            ],
            "source_name": "MISPGALAXY:POISON CARP",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c39b0fe6-5642-4717-9a05-9e94265e3e3a",
            "created_at": "2022-10-25T16:07:24.332084Z",
            "updated_at": "2025-03-27T02:02:10.175452Z",
            "deleted_at": null,
            "main_name": "Tonto Team",
            "aliases": [
                "Bronze Huntley",
                "CactusPete",
                "Earth Akhlut",
                "HartBeat",
                "Karma Panda",
                "LoneRanger",
                "Operation Bitter Biscuit",
                "TAG-74",
                "Tonto Team"
            ],
            "source_name": "ETDA:Tonto Team",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Bioazih",
                "Bisonal",
                "CONIME",
                "Dexbia",
                "Korlia",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "POISONPLUG.SHADOW",
                "RoyalRoad",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041737,
    "ts_creation_date": 1592188728,
    "ts_modification_date": 1592199532,
    "files": {
        "pdf": "https://archive.orkl.eu/d7eb46c7b708a6638eaec45c8707a7f171daef5a.pdf",
        "text": "https://archive.orkl.eu/d7eb46c7b708a6638eaec45c8707a7f171daef5a.txt",
        "img": "https://archive.orkl.eu/d7eb46c7b708a6638eaec45c8707a7f171daef5a.jpg"
    }
}