{
    "id": "3687b5d1-642a-42c1-9b2e-7d2ec02d3968",
    "created_at": "2023-01-12T15:01:37.512687Z",
    "updated_at": "2025-03-27T02:10:13.099799Z",
    "deleted_at": null,
    "sha1_hash": "fb5dc0fc7f38718dffbc70f69b4bc79d27c30fb8",
    "title": "2022-01-25 - Watering hole deploys new macOS malware, DazzleSpy, in Asia",
    "authors": "",
    "file_creation_date": "2022-05-28T16:10:55Z",
    "file_modification_date": "2022-05-28T16:10:55Z",
    "file_size": 1149067,
    "plain_text": "# Watering hole deploys new macOS malware, DazzleSpy, in Asia\n\n**[welivesecurity.com/2022/01/25/watering-hole-deploys-new-macos-malware-dazzlespy-asia/](https://www.welivesecurity.com/2022/01/25/watering-hole-deploys-new-macos-malware-dazzlespy-asia/)**\n\nJanuary 25, 2022\n\nHong Kong pro-democracy radio station website compromised to serve a Safari exploit that installed\ncyberespionage malware on site visitors’ Macs\n\n[On November 11, Google TAG published a blogpost about watering-hole attacks leading to exploits forth](https://blog.google/threat-analysis-group/analyzing-watering-hole-campaign-using-macos-exploits/)\nthe Safari web browser running on macOS. ESET researchers had been investigating this campaign the\nweek before that publication, uncovering additional details about the targets and malware used to\ncompromise its victims. Here we provide a breakdown of the WebKit exploit used to compromise Mac\nusers and an analysis of the payload, which is a new malware family targeting macOS. But first, let’s look\nat how victims came into contact with the malicious code in the first place.\n\n## Targets\n\n\nIt was [reported by Felix Aimé from SEKOIA.IO that one of the websites used to propagate the exploits](https://twitter.com/felixaime/status/1459452296321024003)\nwas a fake website targeting Hong Kong activists. We can read on its home page “Liberate Hong Kong,\nthe revolution of our times”. The very recent registration date of the fightforhk[.]com domain, October 19,th\n2021, and the fact that the website is no longer accessible, supports that idea. We could also confirm that\nthe [Internet Archive cached a copy of the web page on November 13 . This copy includes the maliciousth](https://archive.org/)\niframe, as seen in Figure 1.\n\n\n-----\n\n_Figure 1. fightforhk[.]com, as archived by the Wayback Machine on November 13th_\n\nESET researchers found another website, this time legitimate but compromised, that also distributed the\nsame exploit during the few months prior to the Google TAG publication: the online, Hong Kong, pro[democracy radio station D100. As seen in Figure 2, an iframe was injected into pages served by](https://en.wikipedia.org/wiki/D100_Radio)\nbc.d100[.]net – the section of the website used by subscribers – between September 30 and Novemberth\n4 2021.th\n\n\nBoth distribution methods have something in common: they attract visitors from Hong Kong with prodemocracy sympathies. It seems that they were the primary target of this threat.\n\n\n-----\n\n_Figure 2. Excerpt of https://bc.d100[.]net/Product/Subscription on November 4th 2021_\n\n## The exploit chain\n\nAs seen in Figure 3, the page hosted on the malicious amnestyhk[.]org domain checks for the installed\nmacOS version and redirects to the next stage if the browser is running on macOS 10.15.2 or newer.\n\n\n-----\n\n_Figure 3. Content of the defaultaa.html page on amnestyhk[.]org_\n\nThe next stage, named 4ba29d5b72266b28.html (see Figure 4) simply loads the JavaScript containing\nthe exploit code – mac.js.\n\n\n-----\n\n_Figure 4. Content of the 4ba29d5b72266b28.html page_\n\nNote that the script tag to load caps.js has been commented out. The previous version of the exploit\n[loaded Capstone.js from that file, while in the new version, Capstone.js is prepended to the exploit code](https://alexaltea.github.io/capstone.js/)\nin mac.js.\n\n## The WebKit exploit\n\nThe exploit used to gain code execution in the browser is quite complex and had more than 1,000 lines of\ncode once formatted nicely. It’s interesting to note that some code, which suggests the vulnerability could\n[also have been exploited on iOS and even on PAC-enabled (Pointer Authentication Code) devices such](https://developer.arm.com/documentation/102433/0100/Return-oriented-programming)\nas the iPhone XS and newer, has been commented out, as seen in Figure 5.\n\n\n-----\n\n_Figure 5. Excerpt of the JavaScript exploit containing comments about how to target iOS and PAC-enabled devices_\n\n[We have confirmed that the patch identified by Google TAG does fix the vulnerability. While it is possible](https://github.com/WebKit/WebKit/commit/f4e35a4796f9570c860d39f2701b2a8213f2e10a#diff-cc796f83ce6dd05d2337dcccb59527826a3bdf8cfa3faa686af7b67a1af9bd39)\n[this vulnerability was assigned CVE-2021-1789, we couldn’t confirm due to the lack of publicly available](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-1789)\ntechnical details. Below we outline our understanding of how the vulnerability affects Safari versions prior\nto 14.1.\n\nThe exploit implements two primitives to gain memory read and write access: one to leak the address of\nan object (addrof) and one to create a fake JavaScript object from a given memory address (fakeobj).\nUsing these two functions, the exploit creates two arrays of different types that overlap in memory, and\nthus is able to set a value in one of them that is treated as a pointer when accessed using the other. The\n[technique is well described by Samuel Groß in his multiple](http://www.phrack.org/issues/70/3.html#article) [publications on the subject. Below we explain](https://googleprojectzero.blogspot.com/2020/09/jitsploitation-one.html)\nthe vulnerability that made the leakage of object addresses possible.\n\nThe exploit relies on a side effect caused by modifying an object property to be accessible via a “getter”\nfunction while enumerating the object’s properties in JIT-compiled code. The JavaScript engine\nerroneously speculates that the value of the property is cached in an array and is not the result of calling\n\n\n-----\n\nthe getter function. We have extracted the relevant part of the code that enables the addrof primitive,\nwhich you can see in Figure 6. Comments starting with (e)r are from ESET Research.\n\n_Figure 6. Commented excerpt of the exploit enabling the leak of object addresses_\n\nThe first corruption happening here is the result of bar(vic). The function will return a pointer to a JSCell\n[object (to be more precise, a GetterSetter), which should never be accessible from the JavaScript code.](https://github.com/WebKit/WebKit/blob/3453222bf9861631d4b2f984bc8609ba1ef3f855/Source/JavaScriptCore/runtime/GetterSetter.h#L43)\nHere is the result of describe(bar(vic)) in a JavaScriptCore console:\n\n**Cell: 0x7fffb34dc080 (0x7ffff38cc4c8:[0x3af5, GetterSetter, {}, NonArray, Leaf]), StructureID: 15093**\n\nThis JSCell is then converted to a JSObject by calling the JavaScript Object function. Internally, this\nresults in calling the JSCell’s toObject method. There is no implementation for converting a GetterSetter\n[to a JSObject and the code will eventually fall back and assume its type is a Symbol. The GetterSetter will](https://github.com/WebKit/WebKit/blob/3453222bf9861631d4b2f984bc8609ba1ef3f855/Source/JavaScriptCore/runtime/JSCell.cpp#L178)\n[erroneously be cast to a Symbol. You may have noticed the assertion that the cell type is a Symbol before](https://tc39.es/ecma262/#sec-symbol-objects)\n[performing the cast in the code; however, the ASSERT macro in WebKit is compiled out of release builds.](https://webkit.org/blog/5397/a-guide-to-assertion-macros-in-webkit/)\n\n\n-----\n\nIn memory, the location of getter[0] is the same as this corrupted symbol s value. Thus, reassigning a\nvalue to getter[0] will change the value of the symbol. Its value is fetched from JavaScript using its\ntoString method.\n\n[The updated JavaScriptCore code now checks whether the object contains properties with GetterSetter](https://github.com/WebKit/WebKit/blob/f4e35a4796f9570c860d39f2701b2a8213f2e10a/Source/JavaScriptCore/runtime/Structure.cpp#L1489)\nafter the property enumeration, before considering whether the object’s attribute can be accessed\n“quickly”.\n\nDetailing the fake object creation would require an article of its own. In short, it abuses the same bug,\nalthough this time the object is manipulated in a way that the JIT-compiled code accesses an item that is\nout-of-bounds and returns an address that was carefully sprayed on the heap before the fetch.\n\n[The rest of the code allows bypassing mitigations, such as the Gigacage, and loads the next stage.](https://labs.f-secure.com/archive/some-brief-notes-on-webkit-heap-hardening/)\n\nAs explained by Google TAG, the JavaScript loads a Mach-O executable file in memory. The rudimentary\nloader does not implement importing symbols from external libraries; instead, the addresses of dlopen\nand dlsym are patched into the loaded Mach-O. These can then be used from the executable to\ndynamically load and get the addresses of functions from external libraries.\n\n## Privilege escalation to root\n\nNow that code execution has been gained, the next stage is a Mach-O that is loaded into memory and\nexecuted. This Mach-O exploits a local privilege escalation vulnerability to run the next stage as root. Our\nexamination confirms Google’s analysis that the exploited vulnerability was described by Xinru Chi and\nTielei Wang in a [presentation at zer0con 2021, but it was also](https://github.com/wangtielei/Slides/blob/main/zer0con21.pdf) [presented in more details at MOSEC 2021](https://github.com/wangtielei/Slides/blob/main/mosec21.pdf)\n[by Tielei Wang. The vulnerability has been assigned CVE-2021-30869. Figure 7 shows a call to a function](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-30869)\nTielei Wang called adjust_port_type in his last presentation. This function, responsible for changing the\ninternal type of a Mach port, is implemented the same way in the Mach-O as was presented at MOSEC.\nChanging the type of a Mach port shouldn’t be possible unless a vulnerability exists.\n\n\n-----\n\n_Figure 7. Altering the port type from IKOT_NAMED_ENTRY to IKOT_HOST_PRIV to gain access to special_\n\n_(privileged) Mach ports_\n\nTo summarize, the Mach-O does the following:\n\n1. Downloads a file from the URL supplied as an argument\n2. Decrypts this file using AES-128-EBC and TEA with a custom delta\n3. Writes the resulting file to $TMPDIR/airportpaird and makes it executable\n4. Uses the privilege escalation exploit to remove the com.apple.quarantineattribute from the file to\n\navoid asking the user to confirm the launch of the unsigned executable\n5. Uses the same privilege escalation to launch the next stage with root privileges\n\nThe decrypted payload is where our analysis differs the most from what was described by Google TAG:\nthe payload delivered to vulnerable visitors to the D100 site was new macOS malware we’ve named\nDazzleSpy.\n\n## DazzleSpy\n\n\n-----\n\nDazzleSpy is a full-featured backdoor that provides attackers a large set of functionalities to control, and\nexfiltrate files from, a compromised computer. Our sample is a Mach-O binary file compiled for x86_64\nCPU architecture.\n\n### Persistence\n\nIn order to persist on the compromised device, the malware adds a Property List file (plist; see Figure 8)\nnamed com.apple.softwareupdate.plist to the LaunchAgents folder. The malware executable file is named\nsoftwareupdate and saved in the $HOME/.local/ folder.\n\n_Figure 8. Property List file in LaunchAgents folder_\n\n### C&C communications\n\nDazzleSpy connects to a hardcoded C&C server; the IP address and port found in the sample we\ndecrypted was 88.218.192[.]128:5633. At first, the malware performs a TLS handshake, then uses a\ncustom protocol to exchange JSON objects to deliver commands from the C&C server to compromised\n\n\n-----\n\nMacs. DazzleSpy s binary contains an X.509 certificate used as a certificate authority (CA). It verifies that\nthe server’s certificate is issued by that authority. In practice, the same self-signed certificate is used for\nboth the CA and the C&C server. The technique protects the malware’s communications from potential\neavesdropping by refusing to send data if end-to-end encryption is not possible.\n\nTable 1 contains the list of commands supported by DazzleSpy. The first column is the name of the\ncommand that must be present in the JSON object received from the C&C server; many support optional\nor mandatory parameters.\n\n_Table 1. DazzleSpy C&C commands_\n\n**Command**\n**name** **Purpose**\n\nheartbeat Sends heartbeat response.\n\ninfo Collects information about compromised computer, including:\n         - Hardware UUID and Mac serial number\n       - Username\n          - Information about disks and their sizes\n        - macOS version\n         - Current date and time\n        - Wi-Fi SSID\n         - IP addresses\n         - Malware binary path and MD5 hash of the main executable\n         - Malware version\n          - System Integrity Protection status\n          - Current privileges\n[• Whether it’s possible to use CVE-2019-8526 to dump the keychain](https://support.apple.com/en-us/HT209600)\n\nsearchFile Searches for the specified file on the compromised computer.\n\nscanFiles Enumerates files in Desktop, Downloads, and Documents folders.\n\ncmd Executes the supplied shell command.\n\nrestartCMD Restarts shell session.\n\nrestart Depending on the supplied parameter: restarts C&C command session, shell\nsession or RDP session, or cleans possible malware traces (fsck_hfs.log file and\napplication logs).\n\nprocessInfo Enumerates running processes.\n\nkeychain Dumps the keychain using a CVE-2019-8526 exploit if the macOS version is lower\n[than 10.14.4. The public KeySteal implementation is used.](https://github.com/LinusHenze/Keysteal)\n\ndownloadFileInfo Enumerates the supplied folder, or provides creation and modification timestamps\nand SHA-1 hash for a supplied filename.\n\ndownloadFile Exfiltrates a file from the supplied path.\n\nfile File operations: provides information, renames, removes, moves, or runs a file at\nthe supplied path.\n\nuninstall Deletes itself from the compromised computer.\n\nRDPInfo Provides information about a remote screen session.\n\n\n-----\n\n**Command**\n**name** **Purpose**\n\nRDP Starts or ends a remote screen session.\n\nmouseEvent Provides mouse events for a remote screen session.\n\nacceptFileInfo Prepares for file transfer (creates the folder at the supplied path, changes file\nattributes if it exists).\n\nacceptFile Writes the supplied file to disk. With additional parameters, updates itself or writes\nfiles required for exploiting the CVE-2019-8526 vulnerability.\n\nsocks5 Starts or ends SOCKS5 session (not implemented).\n\nrecoveryInfo These seem like file recovery functions that involve scanning a partition. These\nfunctions do not seem to work and are probably still in development; they contain\nlots of hardcoded values.\n\nrecovery\n\n## Artifacts\n\nWhile analyzing the DazzleSpy binary we found a number of interesting artifacts that might suggest an\ninternal name for the malware and the authors’ origin.\n\nIn several places (for example, see Figure 9) the malware refers to osxrk and the string 1.1.0 seems likely\nto be an internal version number.\n\n_Figure 9. Possible internal name and version number of the DazzleSpy malware_\n\nMoreover, it seems DazzleSpy’s authors were not so concerned about operational security as they have\nleft the username wangping in paths embedded in the binary. Figure 10 contains paths that reveal this\nusername and internal module names.\n\n\n-----\n\n_Figure 10. Paths embedded in the DazzleSpy binary_\n\nOnce the malware obtains the current date and time on a compromised computer, as you see in Figure\n11, it converts the obtained date to the Asia/Shanghai time zone (aka China Standard Time), before\nsending it to the C&C server.\n\n\n-----\n\n_Figure 11. Decompiled code of the getSystemDate function_\n\nIn addition, it should be noted that the DazzleSpy malware contains a number of internal messages in\nChinese, for example as seen in Figure 12.\n\n_Figure 12. Internal error message in Chinese_\n\n## Conclusion\n\nGiven the complexity of the exploits used in this campaign, we assess that the group behind this\noperation has strong technical capabilities. While there is information published online about the local\nprivilege escalation (LPE) vulnerability used here, we couldn’t find anything about the specific WebKit\nvulnerability used to gain code execution in Safari It’s also interesting that end-to-end encryption is\n\n\n-----\n\nenforced in DazzleSpy and it won t communicate with its C&C server if anyone tries to eavesdrop on the\nunencrypted transmission by inserting a TLS-inspection proxy between the compromised system and the\nC&C server.\n\nThe watering-hole operations this group has pursued show that its targets are likely to be politically\nactive, pro-democracy individuals in Hong Kong. This campaign has similarities with one from 2020\n[where LightSpy iOS malware (described by TrendMicro and](https://www.trendmicro.com/en_us/research/20/c/operation-poisoned-news--hong-kong-users-targeted-with-mobile-ma.html) [Kaspersky) was distributed the same way,](https://securelist.com/ios-exploit-chain-deploys-lightspy-malware/96407/)\nusing iframe injection on websites for Hong Kong citizens leading to a WebKit exploit. We cannot confirm\nat this point whether both campaigns are from the same group, but ESET Research will continue to track\nand report on similar malicious activities.\n\n## Indicators of Compromise (IoCs)\n\n### Samples\n\n\n**SHA-1** **Filename**\n\n\n**ESET detection**\n**name** **Description**\n\n\nF3772A23595C0B51AE32D8E7D601ACBE530C7E97 mac.js JS/Exploit.Agent.NQK JavaScript\ncode with\nWebKit\nexploit\nlaunching\nan LPE.\n\n95889E0EF3D31367583DD31FB5F25743FE92D81D N/A OSX/Exploit.Agent.C Mach-O file\nwith LPE\nlaunching\nnext stage.\n\nEE0678E58868EBD6603CC2E06A134680D2012C1B server.enc OSX/DazzleSpy DazzleSpy\nMach-O\nafter\ndecryption\nof\nserver.enc.\n\n### Filenames\n\n$HOME/Library/LaunchAgents/com.apple.softwareupdate.plist\n$HOME/.local/softwareupdate\n$HOME/.local/security.zip\n$HOME/.local/security/keystealDaemon\n$HOME/.local/security/libkeystealClient.dylib\n\n### Network\n\n**URLs of Safari exploit**\n\nhttps://amnestyhk[.]org/ss/defaultaa.html\nhttps://amnestyhk[.]org/ss/4ba29d5b72266b28.html\nhttps://amnestyhk[.]org/ss/mac.js\nhttps://amnestyhk[ ]org/ss/server enc\n\n\n-----\n\n**DazzleSpy C&C server**\n\n88.218.192[.]128:5633\n\n**DazzleSpy CA certificate**\n\nSHA-256: 1F862B89CC5557F8309A6739DF30DC4AB0865668193FDFF70BA93F05D4F8C8B8\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n\nCertificate:\n\nData:\n\nVersion: 1 (0x0)\n\nSerial Number: 10557282746731470350 (0x928300b9284a1e0e)\n\nSignature Algorithm: sha256WithRSAEncryption\n\nIssuer: C=11, ST=11, L=11, O=11, OU=11, CN=11/emailAddress=11@qq.com\n\nValidity\n\nNot Before: May 18 07:26:17 2021 GMT\n\nNot After : May 16 07:26:17 2031 GMT\n\nSubject: C=11, ST=11, L=11, O=11, OU=11, CN=11/emailAddress=11@qq.com\n\nSubject Public Key Info:\n\nPublic Key Algorithm: rsaEncryption\n\nPublic-Key: (2048 bit)\n\nModulus: …\n\nExponent: 65537 (0x10001)\n\nSignature Algorithm: sha256WithRSAEncryption\n\n-----BEGIN CERTIFICATE----\nMIIDTDCCAjQCCQCSgwC5KEoeDjANBgkqhkiG9w0BAQsFADBoMQswCQYDVQQGEwIx\n\nMTELMAkGA1UECAwCMTExCzAJBgNVBAcMAjExMQswCQYDVQQKDAIxMTELMAkGA1UE\n\nCwwCMTExCzAJBgNVBAMMAjExMRgwFgYJKoZIhvcNAQkBFgkxMUBxcS5jb20wHhcN\n\nMjEwNTE4MDcyNjE3WhcNMzEwNTE2MDcyNjE3WjBoMQswCQYDVQQGEwIxMTELMAkG\n\nA1UECAwCMTExCzAJBgNVBAcMAjExMQswCQYDVQQKDAIxMTELMAkGA1UECwwCMTEx\n\nCzAJBgNVBAMMAjExMRgwFgYJKoZIhvcNAQkBFgkxMUBxcS5jb20wggEiMA0GCSqG\n\nSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDFfrP+LbCk9KhPH2gQ3V5lBWCpuM+yzBzn\n\nofL2RJiTMedP467Js4wzrP+qCkXs9STaOZCvYRFaCmfY9bG7PsrgqG90OHfVkttG\n\n5xIdEpd5XPl+GYl/48ridpE7mgw+KO0oRxoyUO1if9nRXvHNGmx0C3i9Rb6ahynv\n\ndEBAZVxeX20fDHMr0dvVe4TKst9g5W02o31zU54mx2f7m2Kgit+n+UsDA/uBRF/c\n\n\n-----\n\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n\n36\n\n\nGcWsvQFVlcguFmBDt58t98BO5nEmI3iDEfUi8FTf2HVSS0LAYC83IkwZyWpML9Jn\n\nuVg67KFKprNMmzBxDK0eDa9ZHObohj3iscM3IYXlCnicbOLYTCvRAgMBAAEwDQYJ\n\nKoZIhvcNAQELBQADggEBAAvkJC5Fi8+Kz8roBhzCY3ayPLMMMj49aHGU/JDLZwsh\n\nWSng5/eY7LrGkTqP0tKay/rrxQvyMeZftvB0DMCbxu0vndK/jTqruxS+ZXDkqyOb\n\nykU0Z6TqRZ/ltgcK9ii4R6PgUEynrJVZHtUHDtemulpHgPRjkFDA4emOui1kFdNT\n\ngnUr0vgh12KlVNAm64UVh9kkneCTFZtYeCAGNw5kFknv5OgsjcaueqCsm3a3dxFq\n\n7JqReIV1WDx+QEBXgM4itvQRY+d5pv5eOlz8sBzxFR7+Gh/Q9aJoPL+ZX7kouMEU\n\nbKwsEwNCrWZWQu41ghFi/8MdqBxb2Nb9H4gCupqKdiI=\n\n-----END CERTIFICATE----\n\n## MITRE ATT&CK techniques\n\n_[This table was built using version 10 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)_\n\n**Tactic** **ID** **Name** **Description**\n\n\nResource\nDevelopment\n\n\n[T1583.001](https://attack.mitre.org/versions/v10/techniques/T1583/001) Acquire Infrastructure: Domains Domain names such as\namnestyhq[.]org were acquired to\nuse on compromised web servers.\n\n\n[T1583.004](https://attack.mitre.org/versions/v10/techniques/T1583/004) Acquire\nInfrastructure:\nServer\n\n[T1584.004](https://attack.mitre.org/versions/v10/techniques/T1584/004) Compromise\nInfrastructure:\nServer\n\n[T1587.001](https://attack.mitre.org/versions/v10/techniques/T1587/001/) Develop\nCapabilities:\nMalware\n\n[T1587.003](https://attack.mitre.org/versions/v10/techniques/T1587/003/) Develop\nCapabilities:\nDigital\nCertificates\n\n[T1587.004](https://attack.mitre.org/versions/v10/techniques/T1587/004/) Develop\nCapabilities:\nExploits\n\n[T1608.004](https://attack.mitre.org/versions/v10/techniques/T1608/004/) Stage\nCapabilities:\nDrive-by\nTarget\n\n\nServers (or virtual servers) were\nrented to serve WebKit exploits\nand used as C&C servers for\nDazzleSpy.\n\nA legitimate website was\ncompromised to add an iframe\nloading malicious JavaScript\ncode.\n\nDazzleSpy is macOS malware\ndeveloped to steal information\nfrom its victims.\n\nDazzleSpy verifies the\nauthenticity of its C&C server\nusing an X.509 certificate.\n\nAn undocumented Safari exploit\nwas used to compromise the\ntargets.\n\nThis operation compromised a\nwebsite that is likely to be visited\nby its targets, to distribute\nmalware.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\nInitial Access [T1189](https://attack.mitre.org/versions/v10/techniques/T1189/) Drive-by Compromise The compromised website served\nthe exploit to visitors using Safari\non a Mac.\n\nExecution [T1569](https://attack.mitre.org/versions/v10/techniques/T1569/) System Services The exploit sends Mach messages\nto launchd to remove the\nquarantine flag and to kuncd to\nlaunch the malware.\n\n\nPersistence [T1543.001](https://attack.mitre.org/versions/v10/techniques/T1543/001/) Create or Modify System\nProcess: Launch Agent\n\n\nPrivilege\nEscalation\n\nDefense\nEvasion\n\nCredential\nAccess\n\n\n[T1068](https://attack.mitre.org/versions/v10/techniques/T1068/) Exploitation for Privilege\nEscalation\n\n\n[T1555.001](https://attack.mitre.org/versions/v10/techniques/T1555/001/) Credentials from Password\nStores: Keychain\n\n\nDazzleSpy persists by installing a\nLaunch Agent.\n\nAn LPE exploit for macOS is used\nto elevate privileges to root.\n\n\n[T1620](https://attack.mitre.org/versions/v10/techniques/T1620/) Reflective Code Loading The LPE exploit downloading the\nnext stage is loaded and executed\nin memory only.\n\n\nDazzleSpy can steal credentials\nfrom the macOS keychain.\n\n\nDiscovery [T1083](https://attack.mitre.org/versions/v10/techniques/T1083/) File and Directory Discovery DazzleSpy can be used to\nenumerate files in specific folders.\n\n\n[T1057](https://attack.mitre.org/versions/v10/techniques/T1057/) Process\nDiscovery\n\n[T1082](https://attack.mitre.org/versions/v10/techniques/T1082/) System\nInformation\nDiscovery\n\n[T1016](https://attack.mitre.org/versions/v10/techniques/T1016/) System\nNetwork\nConfiguration\nDiscovery\n\n[T1033](https://attack.mitre.org/versions/v10/techniques/T1033/) System\nOwner/User\nDiscovery\n\n[T1124](https://attack.mitre.org/versions/v10/techniques/T1124/) System Time\nDiscovery\n\n\nDazzleSpy can obtain the list of\nrunning processes.\n\nDazzleSpy can obtain the\nmacOS version.\n\nDazzleSpy can obtain the IP\naddress and Wi-Fi SSID.\n\nDazzleSpy can obtain the current\nusername from a compromised\nMac.\n\nDazzleSpy can obtain the\nsystem time on a compromised\nMac.\n\n\nCollection [T1005](https://attack.mitre.org/versions/v10/techniques/T1005/) Data from Local System DazzleSpy can search for\ndocuments on the compromised\nsystem.\n\n\n[T1113](https://attack.mitre.org/versions/v10/techniques/T1113/) Screen\nCapture\n\n\nDazzleSpy has the ability to\nrecord screen activity.\n\n\nCommand\nand Control\n\n\n[T1071](https://attack.mitre.org/versions/v10/techniques/T1071/) Application Layer Protocol DazzleSpy uses a custom JSONbased protocol for its C&C\ncommunications.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1132.001](https://attack.mitre.org/versions/v10/techniques/T1132/001/) Data\nEncoding:\nStandard\nEncoding\n\n[T1573](https://attack.mitre.org/versions/v10/techniques/T1573/) Encrypted\nChannel\n\n[T1571](https://attack.mitre.org/versions/v10/techniques/T1571/) NonStandard Port\n\n\nDazzleSpy uses base64 to\nencode parts of its C&C\ncommunications.\n\nDazzleSpy uses TLS encryption.\n\nDazzleSpy uses TCP port 5633.\n\n\nExfiltration [T1041](https://attack.mitre.org/versions/v10/techniques/T1041/) Exfiltration Over C2 Channel DazzleSpy exfiltrates data over its\nC&C communications channel.\n\n25 Jan 2022 - 11:30AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-25 - Watering hole deploys new macOS malware, DazzleSpy, in Asia.pdf"
    ],
    "report_names": [
        "2022-01-25 - Watering hole deploys new macOS malware, DazzleSpy, in Asia.pdf"
    ],
    "threat_actors": [
        {
            "id": "741d58a1-0fc0-41a8-9681-106a06c07e61",
            "created_at": "2022-10-25T16:07:23.983046Z",
            "updated_at": "2025-03-27T02:02:10.062384Z",
            "deleted_at": null,
            "main_name": "Operation Poisoned News",
            "aliases": [
                "Operation Poisoned News",
                "TwoSail Junk"
            ],
            "source_name": "ETDA:Operation Poisoned News",
            "tools": [
                "dmsSpy",
                "lightSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "62585174-b1f8-47b1-9165-19b594160b01",
            "created_at": "2023-01-06T13:46:39.369991Z",
            "updated_at": "2025-03-27T02:00:03.065156Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [],
            "source_name": "MISPGALAXY:TA578",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3703894e-cf68-4c1e-a71a-e8fd2ef76747",
            "created_at": "2023-11-08T02:00:07.166789Z",
            "updated_at": "2025-03-27T02:00:03.205354Z",
            "deleted_at": null,
            "main_name": "TwoSail Junk",
            "aliases": [
                "Operation Poisoned News"
            ],
            "source_name": "MISPGALAXY:TwoSail Junk",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535697,
    "ts_updated_at": 1743041413,
    "ts_creation_date": 1653754255,
    "ts_modification_date": 1653754255,
    "files": {
        "pdf": "https://archive.orkl.eu/fb5dc0fc7f38718dffbc70f69b4bc79d27c30fb8.pdf",
        "text": "https://archive.orkl.eu/fb5dc0fc7f38718dffbc70f69b4bc79d27c30fb8.txt",
        "img": "https://archive.orkl.eu/fb5dc0fc7f38718dffbc70f69b4bc79d27c30fb8.jpg"
    }
}