{
    "id": "3688b9ab-9593-4111-be2d-db32cdc9d749",
    "created_at": "2023-01-12T15:03:44.469249Z",
    "updated_at": "2025-03-27T02:05:52.416466Z",
    "deleted_at": null,
    "sha1_hash": "656eb03f9b04e254056bcbfbdbe28da2bcff38a8",
    "title": "2020-06-09 - Recent FK_Undead rootkit samples found in the wild",
    "authors": "",
    "file_creation_date": "2022-05-28T04:50:50Z",
    "file_modification_date": "2022-05-28T04:50:50Z",
    "file_size": 99669,
    "plain_text": "# Recent FK_Undead rootkit samples found in the wild\n\n**[lab52.io/blog/recent-fk-undead-rootkit-samples-found-in-the-wild/](https://lab52.io/blog/recent-fk-undead-rootkit-samples-found-in-the-wild/)**\n\nMalware that works at Ring0, generally known as rootkit, is one of the most concerning in\nmany environments because it shares privileges and capabilities with antivirus and EDR\nsolutions, which greatly complicates its detection as far as they can tamper and/or hide the\ndata that allows its detection with relative ease.\n\nOne of these examples is a threat Known FK_Undead, which among its multiple stages of\ninfection and modules, has at least 3 different Rootkit modules.\n\n[This malware family was detected for the first time in November 2018 and has remained](https://www.freebuf.com/articles/system/198869.html)\nactive and in continuous evolution.\n\nRegarding it’s infecction chain, from what has been observed to date, the first element with\nwhich it infects a system is a dropper that renames itself as “ntprint.exe” and copies itself to\nthe %TEMP% folder.\n\nIt check’s the victim’s location by contacting to “http://pv.sohu.]com/cityjson” after which\ndownloads an executable protected with VMProtect that is stored in the %programdata%\nfolder with a random name and executes it.\n\nIf this executable does not detect a virtualized environment, it downloads several malicious\ndrivers of type Rootkit:\n\nThe first of this drivers, the most complete, is in charge of:\n\n1. Monitoring all computer traffic, blocking access to anti-virus solution websites and\n\nmodifying the content of some websites by injecting it’s own code into the traffic results.\n2. Adding a proxy to the browsers that routes all the victim’s traffic through a server\n\ncontrolled by the actors behind this threat.\n3. Protect the registry entry of it’s own installation from being deleted from the system.\n4. Avoid loading drivers with certain signatures to protect itself from other malware of the\n\nsame kind. It downloads a list of signatures from it’s command and control server every\nfew seconds and prevents any driver with one of this signatures of being loaded. This\nis the updated list at the moment:\n\nZhou Donghang\n\nYuchengxian Feiwu service Co.,ltd\n\nCHENGDU YIWO Tech Development Co., Ltd.\n\n\n-----\n\nChengdu Xiongdichuang Trading Co., Ltd.\n\nBeijing Founder Apabi Technology Limited\n\nBeijing Longweishengda Technology Co., Ltd.\n\nBeijing Sages Education Consultant Co.,Ltd\n\nChangsha Qiansheng Garden Landscape Co.,Ltd\n\nXi’ an JingTech electronic Technology Co.,LTD\n\nGuangzhoushi Xunmeng Computer Technology Co.,Ltd\n\nHenan Pushitong Intelligent Technology Co., Ltd.\n\nShanghai Huaqianshu Information Technology Co., Ltd.\n\nHaining shengdun Network Information Technology Co., Ltd\n\n金华米粒网络技术服务有限公司\n\n梁富庆上海天游软件有限公司\n\n姚秋玲\n\n上海域联软件技术有限公司\n\n北京新锐视锋科技有限公司\n\nThe second driver is part of the framework of the company “Callback Technologies” which\noffers an API for applications to control access to files on the disk by any program and even\nfalsify the result. In particular, they only control when the process “svchost.exe” accesses the\n“HOSTS” file and serve to this process another file in its place, thus controlling the DNS\nresolutions of the victim without attracting attention, as far as when other software accesses\nthe “HOSTS” file, it is the real one, which is clean, thus avoiding raising suspicion.\n\nThe third one is in charge of downloading and installing certificates in the victim machine, so\nthat they can also control the victim’s SSL traffic completely, redirecting it to other sites or\nbreaking the encryption on this legitimate traffic.\n\nIt should be noted that these are the modules currently known, but they probably have more\nmodules from which no information has been obtained to date as this threat has been active\nfor over a year and has a lot of new activity.\n\nThe majority of the downloads related to this malware are done over HTTP directly against\nIP addresses generally located in China and using relatively high ports.\n\n\n-----\n\nSome of the names of the threats at the time of download are as follows:\n\n“msdvdlx64.dat”\n“msdvdlx32.dat”\n“mshsdlx64.dat”\n“msadapdlx32.dat”\n\nRegarding the different configurations of each driver, the download is identical, but with a\ndifferent name structure, since in this case they contain the word “list” in it’s name and it’s\ncontents are base64 encoded.\n\n“paclist.dat”\n“tdplist.dat”\n“dnlist.dat”\n\nAll the drivers developed by this group to date use the same “PoolTags” for allocating\nmemory in the kernel space “fktg” and “fkhs”.\n\nDuring a forensic analysis, this data can be very interesting to take into account as IOC,\nbecause some tools like Volatility allow scanning the memory for these memory pools.\n\nSpecifically, the volatility plugin in charge of doing this is “poolpeek” and requires as a\nparameter this PoolTag but reversed, since in memory, it is stored this way:\n\n“poolpeek -t gtkf”\n“poolpeek -t shkf”\n\nIOCs\n\nC2 IP List\n\n\n-----\n\n106.]14.47.210\n\n120.]77.36.184\n\n183.]2.193.147\n\n103.]216.154.25\n\n139.]196.228.142\n\n45.]113.201.205\n\nRedirect Servers\n\n115].231.218.133 182].61.182.114\n\n115].231.218.86 182].61.182.123\n\n182].61.164.201 182].61.182.97\n\n182].61.177.32 182].61.183.212\n\n182].61.177.37 182].61.183.215\n\n182].61.180.119 182].61.188.252\n\n182].61.180.134 192].126.127.199\n\nPDBs found in drivers\n\nfk_drv.pdb fk_netfltdll32.pdb\n\nfk_maindrv.pdb fk_adswindll32.pdb\n\nfk_svcsdll.pdb fk_adsexdrv32.pdb\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-09 - Recent FK_Undead rootkit samples found in the wild.pdf"
    ],
    "report_names": [
        "2020-06-09 - Recent FK_Undead rootkit samples found in the wild.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535824,
    "ts_updated_at": 1743041152,
    "ts_creation_date": 1653713450,
    "ts_modification_date": 1653713450,
    "files": {
        "pdf": "https://archive.orkl.eu/656eb03f9b04e254056bcbfbdbe28da2bcff38a8.pdf",
        "text": "https://archive.orkl.eu/656eb03f9b04e254056bcbfbdbe28da2bcff38a8.txt",
        "img": "https://archive.orkl.eu/656eb03f9b04e254056bcbfbdbe28da2bcff38a8.jpg"
    }
}