{
    "id": "36b74763-cdfa-4cc3-b79e-8028be150cb6",
    "created_at": "2023-01-12T15:07:28.477689Z",
    "updated_at": "2025-03-27T02:05:43.625377Z",
    "deleted_at": null,
    "sha1_hash": "9d29df7a0ecc6a7e42f2109f6e0f63c06cb2e521",
    "title": "2020-05-07 - Ruhr-Universität Bochum meldet Computerangriff",
    "authors": "",
    "file_creation_date": "2022-05-28T02:45:27Z",
    "file_modification_date": "2022-05-28T02:45:27Z",
    "file_size": 341888,
    "plain_text": "# Ruhr-Uni Bochum offenbar Opfer von Computerangriff\n\n**spiegel.de/netzwelt/web/ruhr-uni-bochum-offenbar-opfer-von-computerangriff-a-c42754cc-72dc-4d34-8b58-**\nbb0008619c05\n\nCampus der Ruhr-Universität Bochum (Archivbild)\n\nFoto: Caroline Seidel/ dpa\n\n\n-----\n\nKrise um Krise, twitterte Christina Reinhardt, die Kanzlerin der Ruhr-Universität Bochum\nam Donnerstagvormittag. Da hatte die Universität gerade bekannt gegeben, Opfer eines\nComputerangriffs geworden zu sein. Von außen sei die zentrale Infrastruktur der Uni\n[angegriffen worden, hieß es in einer Mitteilung .](https://news.rub.de/servicemeldungen/2020-05-07-angriff-von-aussen-it-infrastruktur-der-rub-ist-zum-groessten-teil-ausser-betrieb)\n\nAufgrund des Angriffs stehen demnach bereits seit acht Uhr am Donnerstagmorgen eine\nVielzahl der Onlinesysteme der Uni nicht mehr zur Verfügung. Studierende und Mitarbeiter\nhätten keinen Zugriff auf ihre E-Mails über das Mailprogramm Outlook. Und auch der\neingesetzte VPN-Tunnel lässt sich den Angaben zufolge derzeit nicht nutzen. VPN-Dienste\nsind gerade in der Coronakrise wichtig, da darüber auch aus dem Homeoffice auf interne\nDienste und Daten zugegriffen werden kann.\n\nDie IT-Abteilung der Ruhr-Universität empfahl ihren Mitarbeitern, alle vernetzten Windowsbasierten Server-Systeme in den Fakultäten herunterzufahren. Die Universität wies zudem\nauf eine [eigene Notfall-Website hin, über die man weitere Informationen teilen werde, falls](https://notfall.ruhr-uni-bochum.de/)\ndie eigentliche Website ausfällt. Später erklärte die Uni auf ihrer Website, dass mehrere für\ndie Online-Lehre vorgesehenen Dienste wie Zoom und die E-Learning-Plattform Moodle\nbisher noch funktionieren.\n\nEin Sprecher der Uni bestätigte dem Spiegel, dass vor allem die Verwaltung von den\nAusfällen betroffen sei, der Betrieb für Studierende und die Online-Lehre könnten nach\naktuellem Stand im wesentlichen so weiterlaufen, wie man es aufgrund der Umstellungen\nwegen Corona geplant habe. Aktuell prüfen externe IT-Experten das Ausmaß des Schadens\nund die weitere Vorgehensweise.\n\n## Computerangriff könnte Online-Lehre vor Probleme stellen\n\nUnklar ist bisher, welchen Einfluss genau der Zwischenfall auf die Lehre und den\nStudienalltag hat. Angesichts der Coronakrise hatte die Uni Seminare auf\nOnlineveranstaltungen über Zoom oder andere Videokonferenzdienste umgestellt. Die\nmeisten Beschäftigten der Universität arbeiteten im Homeoffice, hieß es.\n\nAn der Ruhr-Universität sind aktuell rund 43.000 Studierende eingeschrieben. Die\nHochschule hat 20 Fakultäten und beschäftigt zahlreiche Spitzenforscher.\n\n_Update: Die Uni Bochum hat inzwischen weitere Angaben dazu gemacht, welche Systeme_\n_betroffen sind und welche nicht. Die Online-Lehre kann demnach nach bisherigem Stand wie_\n_geplant ablaufen._\n\nhpp\n\n\n-----",
    "language": "DE",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-07 - Ruhr-Universität Bochum meldet Computerangriff.pdf"
    ],
    "report_names": [
        "2020-05-07 - Ruhr-Universität Bochum meldet Computerangriff.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536048,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653705927,
    "ts_modification_date": 1653705927,
    "files": {
        "pdf": "https://archive.orkl.eu/9d29df7a0ecc6a7e42f2109f6e0f63c06cb2e521.pdf",
        "text": "https://archive.orkl.eu/9d29df7a0ecc6a7e42f2109f6e0f63c06cb2e521.txt",
        "img": "https://archive.orkl.eu/9d29df7a0ecc6a7e42f2109f6e0f63c06cb2e521.jpg"
    }
}