{
    "id": "36bcc1fa-93c3-41f8-a50b-cd75078b5062",
    "created_at": "2023-01-12T15:10:43.183229Z",
    "updated_at": "2025-03-27T02:05:35.226156Z",
    "deleted_at": null,
    "sha1_hash": "ca72182e6f1712de2c420ac89f9246579b90159d",
    "title": "2022-06-28 - Smash-and-grab- AstraLocker 2.0 pushes ransomware direct from Office docs",
    "authors": "",
    "file_creation_date": "2022-07-02T23:18:15Z",
    "file_modification_date": "2022-07-02T23:18:15Z",
    "file_size": 2465872,
    "plain_text": "# Smash-and-grab: AstraLocker 2.0 pushes ransomware direct from Office docs\n\n**[blog.reversinglabs.com/blog/smash-and-grab-astralocker-2-pushes-ransomware-direct-from-office-docs](https://blog.reversinglabs.com/blog/smash-and-grab-astralocker-2-pushes-ransomware-direct-from-office-docs)**\n\n[ransomware\n| June 28, 2022](https://blog.reversinglabs.com/blog/tag/ransomware)\n\n\n-----\n\nBlog Author\n[Joseph Edwards, Senior Malware Researcher at ReversingLabs. Read More...](https://blog.reversinglabs.com/blog/author/joseph-edwards)\n\n\n-----\n\nReversingLabs recently discovered instances of the AstraLocker 2.0 malware distributed directly from Microsoft Word files used\nin phishing attacks.\n\n## Executive Summary\n\nReversingLabs recently discovered of a new version of the AstraLocker ransomware (AstraLocker 2.0) that was being\ndistributed directly from Microsoft Office files used as bait in phishing attacks. Our analysis suggests that the threat actor\nresponsible for this campaign likely obtained the underlying code for AstraLocker 2.0 from a leak of the Babuk ransomware in\nSeptember 2021. Links between the two campaigns include shared code and campaign markers, while a Monero wallet address\nlisted for ransom payment is tied to the Chaos Ransomware gang.\n\nThe “smash and grab” attack methodology as well as other features suggest the attacker behind this malware is low-skill and\nlooking to cause disruption, compared with the more patient, methodical, and measured approach to compromises used by\nBabuk and other, more sophisticated ransomware outfits. This underscores the risk posed to organizations following code leaks\nlike that affecting Babuk, as a large population of low-skill, high-motivation actors leverage the leaked code for use in their own\nattacks.\n\n## Analysis\n\nReversingLabs threat analysts have looked at a number of samples of the AstraLocker 2.0 malware. This report reflects the\nconclusions of their analysis of the malware and associated attacks.\n\n## Background\n\nFirst identified in 2021, AstraLocker is a fork of Babuk, ransomware used by the cybercriminal group of the same name. The\nBabuk group operated a Ransomware-as-a-Service (RaaS) platform and licensed its software to affiliates to carry out attacks.\n\nBabuk first appeared in early 2021 and was linked to a string of high-profile attacks, including a ransomware attack and data\nleak targeting Washington D.C.’s Metro Police Department in April, 2021. By September of 2021, the Babuk group became a\n[target itself, when the Babuk source code was stolen and leaked to a Russian hacking forum.](https://www.bleepingcomputer.com/news/security/babuk-ransomwares-full-source-code-leaked-on-hacker-forum/)\n\n[The AstraLocker malware also appeared in 2021, concurrent with Babuk. AstraLocker 2.0 was first seen in March 2022.](https://bazaar.abuse.ch/browse/signature/AstraLocker/)\n\n## Significance\n\nThe AstraLocker 2.0 attack we observed was unusual in a number of ways. First: the attackers opted to push ransomware to\nvictims at the very earliest stage of the attack, immediately after targets opened the malicious file attachment used as bait in the\ninitial phishing attacks.\n\nTypically, affiliate threat actors avoid pushing ransomware early, opting instead to push files that allow them to expand their\nreach within the target environment. Ransomware almost invariably is deployed last, after compromising the victim's Domain\nController(s), which enables the cybercriminals to use the domain controller (for example: Active Directory) to deploy a group\npolicy object and encrypt all hosts in the affected domains. It's unusual to see a phishing document deliver ransomware\nimmediately.\n\nHowever, the samples ReversingLabs uncovered revealed a threat actor that was strictly interested in a big impact and a quick\npayout – a kind of “smash and grab” operation.\n\n## The lure\n\nThe AstraLocker samples we uncovered were hidden within Microsoft Word documents. Executing the malware took some\ndoing: recipients who opened the malicious Word attachment were required to make multiple, additional clicks to activate the\nembedded ransomware. That’s because the payload is stored in an OLE object; the lure only activates the ransomware if the\nuser double clicks the icon in the document and consents to running an embedded executable named\n\"WordDocumentDOC.exe:\"\n\n\n-----\n\nNeedless to say: requiring so much user interaction increases the chances that victims will think twice about what they’re doing.\nThat’s one reason OLE objects see less use in malware delivery, as opposed to the more popular VBA macro infection method,\nwhich only requires the user to enable macros in order to execute.\n\n## Unique features\n\nIn addition to the user-interaction intensive bait, the AstraLocker 2.0 samples used an outdated packer, the SafeEngine\nShielden v2.4.0.0 protector, making them difficult to reverse engineer. This packer is so old that the legitimate version no longer\nappears to be sold, which means the threat actor likely obtained a cracked version. One of its tactics is to inject indirect jumps\nevery 5-7 instructions, obfuscating the control flow of the program.\n\nThe malware also employs evasion tactics, checking whether the host is a virtual machine. If a VM is detected, the malware\ndisplays the following message (which is assuredly not from Microsoft).\n\n\n-----\n\nThe packer checks running processes to determine if it is in an analysis environment. To do this, it calls the\nNtQuerySystemInformation API, passing the ProcessInformation and EmulationProcessorInformation parameters.\n\nIn addition, the protector checks the names of open windows to determine if malware analysis tools are being run with different\nprocess names. One such window it searched for was Regmonclass, the window name associated with the tool Registry\nMonitor, before it became Process Monitor.\n\nThe packer attempts to hide its threads from debuggers by setting the thread information argument HideFromDebugger. It\nattempts to detect an evasive debugger by using rdtsc, an instruction which reads the system's Time Stamp Counter. Using\nrdtsc before and after a function, the malware can identify when a debugger has taken too long and is being debugged.\n\n## Impact\n\nOnce unpacked, AstraLocker 2.0 employs several tactics to avoid detection and hamper attempts to recover. Among them:\n\nStops a list of backup and anti-malware and security services:\n\nLike many ransomware files, AstraLocker attempts to disable anti-malware and other endpoint security tools. These include the\nfollowing:\n\n_vss, sql, svc$, memtas, mepocs, sophos, veeam, backup, GxVss, GxBlr, GxFWD, GxCVD, GxCIMgr, DefWatch, ccEvtMgr,_\n_ccSetMgr, SavRoam, RTVscan, QBFCService, QBIDPService, Intuit.QuickBooks.FCS, QBCFMonitorService, YooBackup,_\n_YooIT, zhudongfangyu, stc_raw_agent, VSNAPVSS, VeeamTransportSvc, VeeamDeploymentService, VeeamNFSSvc,_\n_PDVFSService, BackupExecVSSProvider, BackupExecAgentAccelerator, BackupExecAgentBrowser,_\n_BackupExecDiveciMediaService, BackupExecJobEngine, BackupExecManagementService, BackupExecRPCService,_\n_AcrSch2Svc, AcronisAgent, CASAD2DWebSvc, CAARCUpdateSvc_\n\nKills a list of processes that could interfere with encryption:\n\nThe AstraLocker malware also attempts to disable applications that may block- or interfere with the encryption of data. These\ninclude:\n\n_sql.exe, oracle.exe, ocssd.exe, dbsnmp.exe, synctime.exe, agntsvc.exe, isqlplussvc.exe, xfssvccon.exe, mydesktopservice.exe,_\n_ocautoupds.exe, encsvc.exe, firefox.exe, tbirdconfig.exe, mydesktopqos.exe, ocomm.exe, dbeng50.exe, sqbcoreservice.exe,_\n_excel.exe, infopath.exe, msaccess.exe, mspub.exe, onenote.exe, outlook.exe, powerpnt.exe, steam.exe, thebat.exe,_\n_thunderbird.exe, visio.exe, winword.exe, wordpad.exe, notepad.exe_\n\n\n-----\n\nDeletes Volume Shadow Copies using the command\nSample command:\n\nC:\\Windows\\System32\\cmd.exe /c vssadmin.exe delete shadows /all /quiet.\n\nEmpties the Recycle Bin, rather than encrypting files there\n\nEnumerates and attempts to mount all drives and network shares to ensure encryption occurs on all reachable resources\n\nEncrypts files with the Elliptic Curve Cryptography algorithm Curve25519\n\n## Ransom note and FAQ\n\nAstraLocker 2.0 displays the following ransom note, which closely resembles the standard Babuk ransomware note. This note\nhas been modified by our threat actor to include new Monero and BitCoin wallets for payment. However, the attacker did not\nprovide a contact email for victims, making it unclear how -or if -payments from victims were carried out.\n\n\n-----\n\n## Campaign markers\n\nReversingLabs analysis of AstraLocker revealed the following toolmarks, which your organization can use to identify the source\nof this new AstraLocker 2.0 campaign:\n\n## Mutex\n\n\n-----\n\nMalware authors create a Mutex object to ensure only one encryptor is running at a time. The mutex created in this case was\nnamed DoYouWantToHaveSexWithCuongDong, while in other campaigns the mutex was called EncryptedWithAstraLocker.\nHowever, we did notice that the variant with the latter mutex was generating new files.\n\n## File footer\n\nAfter encryption, AstraLocker 2.0 appends the text choung dong looks like hot dog!! to the end of the file. The corresponding\ndecryptor searches for this footer to identify encrypted files.\n\n## Extension\n\nIn this campaign, AstraLocker 2.0 renames files with the .babyk extension, where in other instances it used .AstraLocker,\n**.piton, .Astra, or a randomized extension.**\n\n## Packer\n\nUsing the RHA similarity algorithm, we identified similar samples packed with SafeEngine Shielden, which are most likely in our\ncampaign.\n\n## Ransom wallets\n\nAstraLocker 2.0 uses a different set of cryptocurrency wallet addresses than were used in earlier versions of the malware and in\nthe Babuk ransomware. In addition, the 2.0 version omits a working email address for contacting the threat actors.\n\n## Monero\n\nThe AstraLocker 2.0 lists the following Monero wallet address, which is notable for being the same wallet listed in the ransom\n[note dropped by Chaos](https://www.trendmicro.com/en_us/research/21/h/chaos-ransomware-a-dangerous-proof-of-concept.html) [Ransomware, which was written in .NET.](https://twitter.com/BruteBee/status/1428705093873020930)\n\n47moe29QP2xF2myDYaaMCJHpLGsXLPw14aDK6F7pVSp7Nes4XDPMmNUgTeCPQi5arDUe4gP8h4w4pXCtX1gg7SpGAgh6qqS\n\n## BitCoin (BTC)\n\nThe BitCoin wallet address used by AstraLocker 2.0 is associated with another AstraLocker 2.0 campaign.\n\nbc1qpjftnrmahzc8cjs23snk2rq0vt6l0ehu4gqxus.\n\n## Email address\n\nThe original emails seem to have been removed. In this campaign, the AstraLocker emails are replaced with AstraLocker@.\nThis could indicate that the threat actors are not tied to the original threat group.\n\n## Conclusions\n\nReversingLabs researchers have came to the conclusion that the threat actor responsible for this campaign likely obtained the\nbuilders for the AstraLocker 2.0 ransomware as a result of the Babuk leak in mid-2021. There are a number of elements of the\ncampaign that lead us to that conclusion. Among them: the code and campaign markers in AstraLocker 2.0 are consistent with\n[the encryptor used by the Babuk gang, as documented in this article. To that, the attackers added the SafeEngine Shielden](https://blog.cyble.com/2021/07/05/deep-dive-into-builder-of-notorious-babuk-ransomware/)\npacker and a slightly modified version of the Babuk ransom note.\n\nWhile we do not have any conclusive evidence linking the AstraLocker “smash and grab” campaign to a specific individual, we\nknow that the threat actors use a Monero wallet address that may be tied to Chaos Ransomware group. That makes it\nreasonable to assume that the threat actor behind this attack may have some affiliation with that group. This, however, is mere\nspeculation.\n\nWhat this attack makes clear is that the leak of the Babuk source code and builders in 2021 permits cybercriminals of any\nsophistication to launch their own operations, simply by making small modifications to the existing Babuk code. That is what we\nobserve with the AstraLocker 2.0 malware. By leveraging the leaked code and dispensing with the “low and slow” methodology\nthat is common among sophisticated ransomware outfits, the attackers behind the AstraLocker 2.0 attacks have greatly\nshortened the time and investment needed to realize a profit off of infected hosts with their “smash and grab” approach\n\n\n-----\n\nHowever, as we see with actual smash and grab attacks it is easy for attackers launching such hasty efforts to make\nmistakes. In this case, without a listed email to contact for victims, the AstraLocker 2.0 threat actor has no means of issuing the\ndecryptor to victims even if a ransom is paid. This makes this attack both reckless and destructive.\n\n## Indicators of Compromise (IOCs)\n\nBelow are hashes of AstraLocker 2.0 indicators of compromise, as identified by ReversingLabs.\n\n**SHA256 Hash** **File Type**\n\ncf3bdf0f8ea4c8ece5f5a76524ab4c81fea6c3a1715b5a86b3ad4d397fca76f3 AstraLocker 2.0 Ransomware\n\nb0a010e5a9b353a11fb664501de91fc47878d89bf97cb57bc03428c7a45981b9 AstraLocker 2.0 Ransomware\n\n17ea24ce8866da7ef4a842cba16961eafba89d526d3efe5d783bb7a30c5d1565 AstraLocker 2.0 Ransomware\n\n08565f345878369fdbbcf4a064d9f4762f4549f67d1e2aa3907a112a5e5322b6 AstraLocker 2.0 Ransomware\n\n5c061e188979d3b744a102d5d855e845a3b51453488530ea5dca6b098add2821 AstraLocker 2.0 Ransomware\n\n60167b6a14b7da2257cb6cbdc7f1ebcb4bdfa16c76cc9a7539c9b8d36478d127 Malicious Word Document\n\n71ba916a7f35fe661cb6affc183f1ce83ee068dbc9a123663f93acf7b5a4263e Malicious Word Document\n\n### MORE BLOG ARTICLES\n\n[RSA Conference 2022\n| June 23, 2022](https://blog.reversinglabs.com/blog/tag/rsa-conference-2022)\n[ConversingLabs highlights: RSA Conference spotlights software supply chain, critical infrastructure risk](https://blog.reversinglabs.com/blog/rsa-spotlights-supply-chain-critical-infrastructure-cyber-risk)\nConversingLabs invited Robert Martin of MITRE and Steve Lipner of Safecode, who spoke at RSAC, to discuss supply chain\nrisk, software assurance and more.\n\n[Read More](https://blog.reversinglabs.com/blog/rsa-spotlights-supply-chain-critical-infrastructure-cyber-risk)\n\n\n-----\n\n[Zero Trust\n| June 14, 2022](https://blog.reversinglabs.com/blog/tag/zero-trust)\n[How to build trust in a zero-trust environment: Security leaders share insights](https://blog.reversinglabs.com/blog/how-to-build-trust-in-a-zero-trust-environment)\nIn an expert roundtable at RSA Conference, three industry leaders share insights on taking a zero-trust approach with today's\n'hyperconnected ecosystems'.\n\n[Read More](https://blog.reversinglabs.com/blog/how-to-build-trust-in-a-zero-trust-environment)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-28 - Smash-and-grab- AstraLocker 2.0 pushes ransomware direct from Office docs.pdf"
    ],
    "report_names": [
        "2022-06-28 - Smash-and-grab- AstraLocker 2.0 pushes ransomware direct from Office docs.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536243,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1656803895,
    "ts_modification_date": 1656803895,
    "files": {
        "pdf": "https://archive.orkl.eu/ca72182e6f1712de2c420ac89f9246579b90159d.pdf",
        "text": "https://archive.orkl.eu/ca72182e6f1712de2c420ac89f9246579b90159d.txt",
        "img": "https://archive.orkl.eu/ca72182e6f1712de2c420ac89f9246579b90159d.jpg"
    }
}