{
    "id": "36c980eb-b6b3-45eb-ac96-b60ed96dfcff",
    "created_at": "2023-01-12T15:07:38.179953Z",
    "updated_at": "2025-03-27T02:05:50.326835Z",
    "deleted_at": null,
    "sha1_hash": "2a42cf7d0a52f5e4c3df9f8e57bea112d33ae05b",
    "title": "2021-10-13 - The ad blocker that injects ads",
    "authors": "",
    "file_creation_date": "2022-05-28T19:32:14Z",
    "file_modification_date": "2022-05-28T19:32:14Z",
    "file_size": 1731892,
    "plain_text": "# The ad blocker that injects ads\n\n**imperva.com/blog/the-ad-blocker-that-injects-ads/**\n\nOctober 13, 2021\n\nDeceptive ad injection is a growing concern on the internet today, affecting many people\n[browsing the web. And while the concept isn’t new (Google stated it was the most common](https://security.googleblog.com/2015/03/out-with-unwanted-ad-injectors.html)\ncomplaint amongst Chrome users back in 2015), just like with other online threats, bad\nactors are constantly refining their techniques.\n\nImperva’s research team is constantly monitoring and researching client-side attacks to\nbetter understand the attacker’s TTPs (Tactics, techniques and procedures).\n\nIn this post, we’ll break down a new ad injection campaign that Imperva Research Labs\nrecently uncovered. The campaign was targeting users of some of the largest websites in\nthe world through an extension available on both Chrome and Opera browsers called\nAllBlock.\n\n## What is Ad Injection?\n\nAd injection is the process of inserting unauthorized advertisements into a publisher’s web\npage with the intention of enticing the user to click on them. Ad injection can originate from\nvarious sources like malicious browser extensions, malware and even through stored crosssite scripting (XSS).\n\nAd injectors are often made by scammers who want to cash in on application downloads.\nThey can generate revenue for their creators by serving ads and stealing advertising\nimpressions from other websites. Other uses of ad injection, mostly common in retail ecommerce, include:\n\n\n-----\n\n1. Brands can advertise on competitors sites, potentially stealing customers away.\n2. Price comparison ads can be used to distract customers’ attention from making a\npurchase.\n3. Affiliate codes or links can be injected as well, allowing scammers to cash in on\npurchases without ever helping a single customer.\n\n## Identifying the threat\n\nOn August 22, 2021, during a routine check of potential threats, Imperva Research Labs\ndiscovered unknown malicious domains distributing an ad injection script.\n\nOne of them was hxxps[:]//frgtylik[.]com/KryhsIvSaUnQ[.]js, which works in the following\nway:\n\n1 – The script sends a list of all the links that are currently present in the page, including the\nfull URL of the page, to a remote server.\n\n2 – The server returns the list of domains it wants to redirect back to the script.\n\n3 – Whenever the user clicks on a link that has been altered, the user will then be hijacked\nto a different page.\n\nThe malicious JavaScript code sends a request to a remote server (ratds[.]net) with the list\nof all domains the web page is redirecting to:\n\n\n-----\n\nThen, the server returns the list of domains it wants to replace the links of back to the\nbrowser, associated with a number.\n\nIn a variable called e.hiddenHref, the malicious JavaScript will store the replacing URL\nbased on the information returned by the server ratds[.]net. When the user clicks on any\nmodified links on the webpage, he will be redirected to an affiliate link. Via this affiliate\nfraud, the attacker earns money when specific actions like registration or sale of the product\ntake place. The replacement integer will be included in the parameter of a new URL that will\nreplace the original link with a new one following the pattern:\n\n`hxxps://ratds[.]net/replacement/click?place=&subid=&href=&replacement=&url=`.\n\nThis page will then redirect to an affiliate link behind api[.]smartredirect[.]de that will enable\nthe fraudsters to monetize users’ clicks.\n\nInterestingly, in case the replacement field is set to 1, the server redirects to allblock.net\ndomain:\n\n\n-----\n\n### Script evasion techniques :\n\nThe malicious JavaScript file includes a mechanism in order to disturb analysis:\n\n– It clears the debug console every 100ms\n\nIt detects debugging:\n\n– Search for Firebug initialized variables\n\nIn order to avoid detection, major search engines (with focus on Russian engines) are\nexcluded.\n\nFor the same reason, special attention is paid on rebuilding properly the URLs of several\nRussian websites because in general, the URL of the requested resource can be altered by\nthe redirection code.\n\nWe decided to download the associated Chrome Extension for analysis:\n\n\n-----\n\nAnd indeed, the chrome extension leads to the same malicious behavior.\n\n## A deeper look at AllBlock\n\nIf you were to quickly review the source code of the AllBlock extension, you would probably\nclassify it as just another ad blocker.\n\nTo make the extension look legitimate, the developers actually implemented ad blocking\nfunctionality. Further, the code was not obfuscated and nothing immediately screams\nmalware.\n\nHowever, upon close examination, the cracks start to show. It started when observing the\nbackground script “bg.js” was injecting a JavaScript code snippet into every new tab.\n\n\n-----\n\nThe injected code would then immediately connect back to the extension using the standard\nbrowser → extension communication channel and listen for messages that would be parsed\nand executed as code. The developers made an effort to hide the fact they are executing\nthe code by connecting a number of innocent looking objects and variables together as you\ncan see below.\n\nThe “debug” receives a base64 encoded malicious code from the extension, decodes it and\nproceeds to create a pointer to the native constructor method using the “k” variable. The\nmalicious code is passed to the constructor and executed using the “new Promise”\ninvocation on the “tryCatch” method.\n\n\n-----\n\nWorking our way back from that to find the malicious code was simple, the extension is\nmaking an HTTP request to allblock.net/api/stat/?id=nfofcmcpljmjdningbllljenopcmdhjf and\nreceives a JSON response with two base64 encoded properties “data” and “urls”.\n\nThe “data” property contains the malicious code and the “urls” property seems to be a list of\nknown ads related resources the extension would block.\n\nWe do not believe we found the origin of the attack that led us to this discovery, likely\nbecause of the way the script was injected. The script we first observed was injected via a\nscript tag pointing to a remote server where the AllBlock extension injects the malicious\ncode directly to the active tab.\n\nThis leads us to believe that there is a larger campaign taking place that may utilize\ndifferent delivery methods and more extensions.\n\n\n-----\n\n## The impact of ad injection\n\nAd injection is an evolving threat that can impact almost any site. Attackers will use\nanything from browser extensions to malware and adware installed on visitors’ devices,\nmaking most site owners ill-equipped to handle such attacks.\n\nWhen ad injection is used, the site performance and user experience is degraded, making\n[websites slower and harder to use. According to Baymard Institute, 68.8% of online](https://baymard.com/blog/ecommerce-checkout-usability-report-and-benchmark)\nshopping carts are abandoned. There could be many reasons for this, but there is no\ndenying that ad injection plays a key role in this as well. Other impacts of ad injection\ninclude loss of customer trust and loyalty, revenue loss from ad placements, blocked\ncontent and diminished conversion rates.\n\n## Link to previous campaigns\n\nWe were able to correlate this campaign, via similar IPs and domains, with an older one :\n[PBot campaign. This PBot campaign used metds[.]net domain as a backend server and](https://medium.com/walmartglobaltech/not-your-same-old-adware-anymore-pbot-updates-6d43b159ab35)\nhere, ratds[.]net catds[.]net are seen with the same name format.\n\n## Conclusion\n\nMalicious JavaScript files are still widespread on the Internet despite the effort from global\ncompanies to make the web safer. [Imperva Client-Side Protection enables customers to](https://www.imperva.com/products/client-side-protection/)\nblock such malicious JavaScript threats. The solution provides security teams with visibility\nand insights into the JavaScript based services running on their websites, as well as the\nability to block unwanted services from executing.\n\n### IOCs\n\n**Domains**\n\n– Ratds[.]net\n\n– catds[.]net\n\n– Itonus[.]net\n\n– Frgtylik[.]com\n\n– Metds[.]net\n\n**IPs**\n\n– 5.45.72.30\n\n– 37.252.14.183\n\n**Sha1**\n\n– 341c116deeef845e4fcd2e4e2fef6ae9f45644c7\n\n\n-----\n\n### Try Imperva for Free\n\nProtect your business for 30 days on Imperva.\n\n[Start Now](https://www.imperva.com/free-trial/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-13 - The ad blocker that injects ads.pdf"
    ],
    "report_names": [
        "2021-10-13 - The ad blocker that injects ads.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536058,
    "ts_updated_at": 1743041150,
    "ts_creation_date": 1653766334,
    "ts_modification_date": 1653766334,
    "files": {
        "pdf": "https://archive.orkl.eu/2a42cf7d0a52f5e4c3df9f8e57bea112d33ae05b.pdf",
        "text": "https://archive.orkl.eu/2a42cf7d0a52f5e4c3df9f8e57bea112d33ae05b.txt",
        "img": "https://archive.orkl.eu/2a42cf7d0a52f5e4c3df9f8e57bea112d33ae05b.jpg"
    }
}